{
  "url": "https://voxday.net/2012/08/29/a-manifesto-for-economic-nonsense/",
  "scraped_at": "2025-12-14T05:02:21.661026",
  "title": "A manifesto for economic nonsense",
  "date_display": "August 29, 2012",
  "date_iso": "2012-08-29T13:17:00+00:00",
  "date_from_url": "2012-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Read <a href=\"http://www.manifestoforeconomicsense.org/\">this economic manifesto</a>, realize that it is not only written by professional economists, but signed by dozens of academics from Oxford, Stanford, Princeton, Cambridge, Harvard, and the London School of Economics, and despair for the global economy:</p><blockquote><p>A Manifesto for Economic Sense</p><p>More than four years after the financial crisis began, the world’s major advanced economies remain deeply depressed, in a scene all too reminiscent of the 1930s. And the reason is simple: we are relying on the same ideas that governed policy in the 1930s. These ideas, long since disproved, involve profound errors both about the causes of the crisis, its nature, and the appropriate response.</p><p>These errors have taken deep root in public consciousness and provide the public support for the excessive austerity of current fiscal policies in many countries. So the time is ripe for a Manifesto in which mainstream economists offer the public a more evidence-based analysis of our problems.</p><p>The causes. Many policy makers insist that the crisis was caused by irresponsible public borrowing. With very few exceptions – other than Greece – this is false. Instead, the conditions for crisis were created by excessive private sector borrowing and lending, including by over-leveraged banks. The collapse of this bubble led to massive falls in output and thus in tax revenue. So the large government deficits we see today are a consequence of the crisis, not its cause.</p><p>The nature of the crisis. When real estate bubbles on both sides of the Atlantic burst, many parts of the private sector slashed spending in an attempt to pay down past debts. This was a rational response on the part of individuals, but – just like the similar response of debtors in the 1930s – it has proved collectively self-defeating, because one person’s spending is another person’s income. The result of the spending collapse has been an economic depression that has worsened the public debt.</p><p>The appropriate response. At a time when the private sector is engaged in a collective effort to spend less, public policy should act as a stabilizing force, attempting to sustain spending. At the very least we should not be making things worse by big cuts in government spending or big increases in tax rates on ordinary people. Unfortunately, that’s exactly what many governments are now doing.<br> The big mistake. After responding well in the first, acute phase of the economic crisis, conventional policy wisdom took a wrong turn – focusing on government deficits, which are mainly the result of a crisis-induced plunge in revenue, and arguing that the public sector should attempt to reduce its debts in tandem with the private sector. As a result, instead of playing a stabilizing role, fiscal policy has ended up reinforcing and exacerbating the dampening effects of private-sector spending cuts.</br></p><p>In the face of a less severe shock, monetary policy could take up the slack. But with interest rates close to zero, monetary policy – while it should do all it can – cannot do the whole job. There must of course be a medium-term plan for reducing the government deficit. But if this is too front-loaded it can easily be self-defeating by aborting the recovery. A key priority now is to reduce unemployment, before it becomes endemic, making recovery and future deficit reduction even more difficult.</p><p>How do those who support present policies answer the argument we have just made? They use two quite different arguments in support of their case.</p><p>The confidence argument. Their first argument is that government deficits will raise interest rates and thus prevent recovery. By contrast, they argue, austerity will increase confidence and thus encourage recovery.</p><p>But there is no evidence at all in favour of this argument. First, despite exceptionally high deficits, interest rates today are unprecedentedly low in all major countries where there is a normally functioning central bank. This is true even in Japan where the government debt now exceeds 200% of annual GDP; and past downgrades by the rating agencies here have had no effect on Japanese interest rates. Interest rates are only high in some Euro countries, because the ECB is not allowed to act as lender of last resort to the government. Elsewhere the central bank can always, if needed, fund the deficit, leaving the bond market unaffected.</p><p>Moreover past experience includes no relevant case where budget cuts have actually generated increased economic activity. The IMF has studied 173 cases of budget cuts in individual countries and found that the consistent result is economic contraction. In the handful of cases in which fiscal consolidation was followed by growth, the main channels were a currency depreciation against a strong world market, not a current possibility. The lesson of the IMF’s study is clear – budget cuts retard recovery. And that is what is happening now – the countries with the biggest budget cuts have experienced the biggest falls in output.</p><p>For the truth is, as we can now see, that budget cuts do not inspire business confidence. Companies will only invest when they can foresee enough customers with enough income to spend. Austerity discourages investment.</p><p>So there is massive evidence against the confidence argument; all the alleged evidence in favor of the doctrine has evaporated on closer examination.</p><p>The structural argument. A second argument against expanding demand is that output is in fact constrained on the supply side – by structural imbalances. If this theory were right, however, at least some parts of our economies ought to be at full stretch, and so should some occupations. But in most countries that is just not the case. Every major sector of our economies is struggling, and every occupation has higher unemployment than usual. So the problem must be a general lack of spending and demand.</p><p>In the 1930s the same structural argument was used against proactive spending policies in the U.S. But as spending rose between 1940 and 1942, output rose by 20%. So the problem in the 1930s, as now, was a shortage of demand not of supply.</p><p>As a result of their mistaken ideas, many Western policy-makers are inflicting massive suffering on their peoples. But the ideas they espouse about how to handle recessions were rejected by nearly all economists after the disasters of the 1930s, and for the following forty years or so the West enjoyed an unparalleled period of economic stability and low unemployment. It is tragic that in recent years the old ideas have again taken root. But we can no longer accept a situation where mistaken fears of higher interest rates weigh more highly with policy-makers than the horrors of mass unemployment.</p><p>Better policies will differ between countries and need detailed debate. But they must be based on a correct analysis of the problem. We therefore urge all economists and others who agree with the broad thrust of this Manifesto to register their agreement at www.manifestoforeconomicsense.org, and to publically argue the case for a sounder approach. The whole world suffers when men and women are silent about what they know is wrong.</p></blockquote><p>Now, let’s count the errors….</p><p>1. <i>“we are relying on the same ideas that governed policy in the 1930s”</i> Totally untrue… although like the interventionists of yore, these economists are attempting to blame nonexistent “liquidationists” for the problems their own policies have created.  Do they seriously want to pretend that Milton Friedman and monetarism – the very Neo-Classical school whose conceptual models the Fed Chairman openly utilizes – simply never existed?</p><p>2. <i>“the large government deficits we see today are a consequence of the crisis, not its cause.”</i> This is partially true, but misleading.  The large government deficits were a contributor to the crisis, not its cause.  Both public and private borrowing are to blame, but it is true that as of 2008, in the USA, government accounted for only 14.8% of total debt outstanding.  Furthermore, note that they disingenuously fail to note that federal borrowing has DOUBLED since 2008 as private debt has deleveraged.</p><p>And then there is the obvious logical blunder.  If the large government deficits we see today are a consequence of the crisis, how can they possibly claim that those same governments have been cutting spending in an austerity push?  From whence did those deficits come?</p><p>3. <i>“it has proved collectively self-defeating, because one person’s spending is another person’s income”</i> This is where we see the problem of the Neo-Classical model’s failure to account for debt.  It isn’t the reduction in spending that is the problem, the problem is that the spending, and the income, was based on the false foundation of credit money manufactured out of thin air.</p><p>4. <i>“At a time when the private sector is engaged in a collective effort to spend less, public policy should act as a stabilizing force, attempting to sustain spending.” </i> No, attempting to paper over private “demand gaps” with public spending only exacerbates the situation.  This is completely wrong and it is precisely what Bush and Obama were doing with their stimulus plans, which is why they failed.</p><p>5. <i>“At the very least we should not be making things worse by big cuts in government spending or big increases in tax rates on ordinary people. Unfortunately, that’s exactly what many governments are now doing.” </i> Observably incorrect.  Most governments have dramatically INCREASED both their borrowing and spending.  Austerity is a myth.  The US government is not only running record deficits, it has DOUBLED its outstanding debt in only four years.</p><p>6. <i>“After responding well in the first, acute phase of the economic crisis, conventional policy wisdom took a wrong turn – focusing on government deficits, which are mainly the result of a crisis-induced plunge in revenue, and arguing that the public sector should attempt to reduce its debts in tandem with the private sector.”</i> Again, factually false.  In Q1-2008, the U.S. federal government owed $5.3 trillion in debt.  In Q1-2012, it owes $10.9 trillion.  The US government has already been doing exactly what the manifesto demands and it clearly is not working.</p><p>7. <i>“Every major sector of our economies is struggling, and every occupation has higher unemployment than usual. So the problem must be a general lack of spending and demand.”</i> No, the fact that you only have a hammer does not mean that every problem you encounter must be a nail.  The problem is not a general lack of spending and demand, it is a problem of excessive debt, both public and private.  The Neo-Classical models have no means of either explaining the crisis or fixing it, which is why economists who utilize them keep turning to the same Keynesian and Friedmanite solutions, both of which have already failed repeatedly.</p><p>8. <i>“In the 1930s the same structural argument was used against proactive spending policies in the U.S. But as spending rose between 1940 and 1942, output rose by 20%. So the problem in the 1930s, as now, was a shortage of demand not of supply.</i>”  Now, what happened in between 1940 and 1942?  Anyone recall a certain historical event?  WWII generated a massive demand for ships, planes, and tanks, which the government went into massive debt to purchase.  It was paid for by the profits realized from the destruction of the industrial infrastructure of Europe and Asia.</p><p>The fools don’t realize it, but they are making an economic appeal for global war against China, Japan, and the EU.</p></div>",
  "content_text": "Read\nthis economic manifesto\n, realize that it is not only written by professional economists, but signed by dozens of academics from Oxford, Stanford, Princeton, Cambridge, Harvard, and the London School of Economics, and despair for the global economy:\nA Manifesto for Economic Sense\nMore than four years after the financial crisis began, the world’s major advanced economies remain deeply depressed, in a scene all too reminiscent of the 1930s. And the reason is simple: we are relying on the same ideas that governed policy in the 1930s. These ideas, long since disproved, involve profound errors both about the causes of the crisis, its nature, and the appropriate response.\nThese errors have taken deep root in public consciousness and provide the public support for the excessive austerity of current fiscal policies in many countries. So the time is ripe for a Manifesto in which mainstream economists offer the public a more evidence-based analysis of our problems.\nThe causes. Many policy makers insist that the crisis was caused by irresponsible public borrowing. With very few exceptions – other than Greece – this is false. Instead, the conditions for crisis were created by excessive private sector borrowing and lending, including by over-leveraged banks. The collapse of this bubble led to massive falls in output and thus in tax revenue. So the large government deficits we see today are a consequence of the crisis, not its cause.\nThe nature of the crisis. When real estate bubbles on both sides of the Atlantic burst, many parts of the private sector slashed spending in an attempt to pay down past debts. This was a rational response on the part of individuals, but – just like the similar response of debtors in the 1930s – it has proved collectively self-defeating, because one person’s spending is another person’s income. The result of the spending collapse has been an economic depression that has worsened the public debt.\nThe appropriate response. At a time when the private sector is engaged in a collective effort to spend less, public policy should act as a stabilizing force, attempting to sustain spending. At the very least we should not be making things worse by big cuts in government spending or big increases in tax rates on ordinary people. Unfortunately, that’s exactly what many governments are now doing.\nThe big mistake. After responding well in the first, acute phase of the economic crisis, conventional policy wisdom took a wrong turn – focusing on government deficits, which are mainly the result of a crisis-induced plunge in revenue, and arguing that the public sector should attempt to reduce its debts in tandem with the private sector. As a result, instead of playing a stabilizing role, fiscal policy has ended up reinforcing and exacerbating the dampening effects of private-sector spending cuts.\nIn the face of a less severe shock, monetary policy could take up the slack. But with interest rates close to zero, monetary policy – while it should do all it can – cannot do the whole job. There must of course be a medium-term plan for reducing the government deficit. But if this is too front-loaded it can easily be self-defeating by aborting the recovery. A key priority now is to reduce unemployment, before it becomes endemic, making recovery and future deficit reduction even more difficult.\nHow do those who support present policies answer the argument we have just made? They use two quite different arguments in support of their case.\nThe confidence argument. Their first argument is that government deficits will raise interest rates and thus prevent recovery. By contrast, they argue, austerity will increase confidence and thus encourage recovery.\nBut there is no evidence at all in favour of this argument. First, despite exceptionally high deficits, interest rates today are unprecedentedly low in all major countries where there is a normally functioning central bank. This is true even in Japan where the government debt now exceeds 200% of annual GDP; and past downgrades by the rating agencies here have had no effect on Japanese interest rates. Interest rates are only high in some Euro countries, because the ECB is not allowed to act as lender of last resort to the government. Elsewhere the central bank can always, if needed, fund the deficit, leaving the bond market unaffected.\nMoreover past experience includes no relevant case where budget cuts have actually generated increased economic activity. The IMF has studied 173 cases of budget cuts in individual countries and found that the consistent result is economic contraction. In the handful of cases in which fiscal consolidation was followed by growth, the main channels were a currency depreciation against a strong world market, not a current possibility. The lesson of the IMF’s study is clear – budget cuts retard recovery. And that is what is happening now – the countries with the biggest budget cuts have experienced the biggest falls in output.\nFor the truth is, as we can now see, that budget cuts do not inspire business confidence. Companies will only invest when they can foresee enough customers with enough income to spend. Austerity discourages investment.\nSo there is massive evidence against the confidence argument; all the alleged evidence in favor of the doctrine has evaporated on closer examination.\nThe structural argument. A second argument against expanding demand is that output is in fact constrained on the supply side – by structural imbalances. If this theory were right, however, at least some parts of our economies ought to be at full stretch, and so should some occupations. But in most countries that is just not the case. Every major sector of our economies is struggling, and every occupation has higher unemployment than usual. So the problem must be a general lack of spending and demand.\nIn the 1930s the same structural argument was used against proactive spending policies in the U.S. But as spending rose between 1940 and 1942, output rose by 20%. So the problem in the 1930s, as now, was a shortage of demand not of supply.\nAs a result of their mistaken ideas, many Western policy-makers are inflicting massive suffering on their peoples. But the ideas they espouse about how to handle recessions were rejected by nearly all economists after the disasters of the 1930s, and for the following forty years or so the West enjoyed an unparalleled period of economic stability and low unemployment. It is tragic that in recent years the old ideas have again taken root. But we can no longer accept a situation where mistaken fears of higher interest rates weigh more highly with policy-makers than the horrors of mass unemployment.\nBetter policies will differ between countries and need detailed debate. But they must be based on a correct analysis of the problem. We therefore urge all economists and others who agree with the broad thrust of this Manifesto to register their agreement at www.manifestoforeconomicsense.org, and to publically argue the case for a sounder approach. The whole world suffers when men and women are silent about what they know is wrong.\nNow, let’s count the errors….\n1.\n“we are relying on the same ideas that governed policy in the 1930s”\nTotally untrue… although like the interventionists of yore, these economists are attempting to blame nonexistent “liquidationists” for the problems their own policies have created.  Do they seriously want to pretend that Milton Friedman and monetarism – the very Neo-Classical school whose conceptual models the Fed Chairman openly utilizes – simply never existed?\n2.\n“the large government deficits we see today are a consequence of the crisis, not its cause.”\nThis is partially true, but misleading.  The large government deficits were a contributor to the crisis, not its cause.  Both public and private borrowing are to blame, but it is true that as of 2008, in the USA, government accounted for only 14.8% of total debt outstanding.  Furthermore, note that they disingenuously fail to note that federal borrowing has DOUBLED since 2008 as private debt has deleveraged.\nAnd then there is the obvious logical blunder.  If the large government deficits we see today are a consequence of the crisis, how can they possibly claim that those same governments have been cutting spending in an austerity push?  From whence did those deficits come?\n3.\n“it has proved collectively self-defeating, because one person’s spending is another person’s income”\nThis is where we see the problem of the Neo-Classical model’s failure to account for debt.  It isn’t the reduction in spending that is the problem, the problem is that the spending, and the income, was based on the false foundation of credit money manufactured out of thin air.\n4.\n“At a time when the private sector is engaged in a collective effort to spend less, public policy should act as a stabilizing force, attempting to sustain spending.”\nNo, attempting to paper over private “demand gaps” with public spending only exacerbates the situation.  This is completely wrong and it is precisely what Bush and Obama were doing with their stimulus plans, which is why they failed.\n5.\n“At the very least we should not be making things worse by big cuts in government spending or big increases in tax rates on ordinary people. Unfortunately, that’s exactly what many governments are now doing.”\nObservably incorrect.  Most governments have dramatically INCREASED both their borrowing and spending.  Austerity is a myth.  The US government is not only running record deficits, it has DOUBLED its outstanding debt in only four years.\n6.\n“After responding well in the first, acute phase of the economic crisis, conventional policy wisdom took a wrong turn – focusing on government deficits, which are mainly the result of a crisis-induced plunge in revenue, and arguing that the public sector should attempt to reduce its debts in tandem with the private sector.”\nAgain, factually false.  In Q1-2008, the U.S. federal government owed $5.3 trillion in debt.  In Q1-2012, it owes $10.9 trillion.  The US government has already been doing exactly what the manifesto demands and it clearly is not working.\n7.\n“Every major sector of our economies is struggling, and every occupation has higher unemployment than usual. So the problem must be a general lack of spending and demand.”\nNo, the fact that you only have a hammer does not mean that every problem you encounter must be a nail.  The problem is not a general lack of spending and demand, it is a problem of excessive debt, both public and private.  The Neo-Classical models have no means of either explaining the crisis or fixing it, which is why economists who utilize them keep turning to the same Keynesian and Friedmanite solutions, both of which have already failed repeatedly.\n8.\n“In the 1930s the same structural argument was used against proactive spending policies in the U.S. But as spending rose between 1940 and 1942, output rose by 20%. So the problem in the 1930s, as now, was a shortage of demand not of supply.\n”  Now, what happened in between 1940 and 1942?  Anyone recall a certain historical event?  WWII generated a massive demand for ships, planes, and tanks, which the government went into massive debt to purchase.  It was paid for by the profits realized from the destruction of the industrial infrastructure of Europe and Asia.\nThe fools don’t realize it, but they are making an economic appeal for global war against China, Japan, and the EU.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-29T12:17:00+00:00"
}