{
  "url": "https://voxday.net/2012/08/19/at-black-gate-2/",
  "scraped_at": "2025-12-14T05:01:31.000402",
  "title": "50 Shades of Paedo?",
  "date_display": "August 19, 2012",
  "date_iso": "2012-08-19T13:30:00+00:00",
  "date_from_url": "2012-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is fantasy and then there is fantasy that goes too far. While all of us would draw the line of what is acceptable fantasy and what is not in distinctly different places, I think most fans of the SF/F genre would agree that pedophile fantasies definitely cross that line. I’d also throw in elderly vampires that spend their days in high school and sparkle in the sun myself, but clearly millions of readers disagree. So does <i>50 Shades of Grey</i> go too far? Not on the surface, as according to its description it is little more than John Norman’s <i>Gor </i>brought back to Earth, minus the sword battles and the awesome tarn birds. And it’s not a question I can legitimately even try to answer, since I haven’t read <i>50 Shades of Grey</i> nor do I have any intention of doing so.</p><p>Read the rest at <a href=\"http://www.blackgate.com/2012/08/19/50-shades-of-paedo/\">The Black Gate</a></p></div>",
  "content_text": "There is fantasy and then there is fantasy that goes too far. While all of us would draw the line of what is acceptable fantasy and what is not in distinctly different places, I think most fans of the SF/F genre would agree that pedophile fantasies definitely cross that line. I’d also throw in elderly vampires that spend their days in high school and sparkle in the sun myself, but clearly millions of readers disagree. So does\n50 Shades of Grey\ngo too far? Not on the surface, as according to its description it is little more than John Norman’s\nGor\nbrought back to Earth, minus the sword battles and the awesome tarn birds. And it’s not a question I can legitimately even try to answer, since I haven’t read\n50 Shades of Grey\nnor do I have any intention of doing so.\nRead the rest at\nThe Black Gate",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-19T12:30:00+00:00"
}