{
  "url": "https://voxday.net/2012/08/24/better-ayn-rand-than-asimov/",
  "scraped_at": "2025-12-14T05:01:56.720787",
  "title": "Better Ayn Rand than Asimov",
  "date_display": "August 24, 2012",
  "date_iso": "2012-08-24T09:26:00+00:00",
  "date_from_url": "2012-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find <a href=\"http://www.nytimes.com/2012/08/24/opinion/krugman-galt-gold-and-god.html?hp\">this criticism of Paul Ryan by Paul Krugman</a> to be richly ironic, coming as it does from a man whose economic philosophy is based on an imaginary science called “psychohistory”:</p><blockquote><p>So far, most of the discussion of Paul Ryan, the presumptive Republican nominee for vice president, has focused on his budget proposals. But Mr. Ryan is a man of many ideas, which would ordinarily be a good thing.  In his case, however, most of those ideas appear to come from works of fiction, specifically Ayn Rand’s novel “Atlas Shrugged.”</p><p>For those who somehow missed it when growing up, “Atlas Shrugged” is a fantasy in which the world’s productive people — the “job creators,” if you like — withdraw their services from an ungrateful society. The novel’s centerpiece is a 64-page speech by John Galt, the angry elite’s ringleader; even Friedrich Hayek admitted that he never made it through that part. Yet the book is a perennial favorite among adolescent boys. Most boys eventually outgrow it. Some, however, remain devotees for life.</p></blockquote><p>If Ryan wants to silence Krugman’s attempts to attack him in this vein, he need merely point out that <i>Atlas Shrugged</i> is considerably more mature fiction than <i>Foundation</i>, the adolescent science fiction novel that Paul Krugman never outgrew.</p></div>",
  "content_text": "I find\nthis criticism of Paul Ryan by Paul Krugman\nto be richly ironic, coming as it does from a man whose economic philosophy is based on an imaginary science called “psychohistory”:\nSo far, most of the discussion of Paul Ryan, the presumptive Republican nominee for vice president, has focused on his budget proposals. But Mr. Ryan is a man of many ideas, which would ordinarily be a good thing.  In his case, however, most of those ideas appear to come from works of fiction, specifically Ayn Rand’s novel “Atlas Shrugged.”\nFor those who somehow missed it when growing up, “Atlas Shrugged” is a fantasy in which the world’s productive people — the “job creators,” if you like — withdraw their services from an ungrateful society. The novel’s centerpiece is a 64-page speech by John Galt, the angry elite’s ringleader; even Friedrich Hayek admitted that he never made it through that part. Yet the book is a perennial favorite among adolescent boys. Most boys eventually outgrow it. Some, however, remain devotees for life.\nIf Ryan wants to silence Krugman’s attempts to attack him in this vein, he need merely point out that\nAtlas Shrugged\nis considerably more mature fiction than\nFoundation\n, the adolescent science fiction novel that Paul Krugman never outgrew.",
  "tags": [
    "books",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-24T08:26:00+00:00"
}