{
  "url": "https://voxday.net/2012/08/21/cannibal-dreams-and-sfwa/",
  "scraped_at": "2025-12-14T05:01:42.039235",
  "title": "Cannibal dreams and the SFWA",
  "date_display": "August 21, 2012",
  "date_iso": "2012-08-21T14:33:00+00:00",
  "date_from_url": "2012-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Laura Resnick, an SFWA member, <a href=\"http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/\">waxed homicidal</a> on SFWA President John Scalzi’s blog:</p><p><i>Laura Resnick says: <br> August 17, 2012 at 1:12 pm<br> Whever I think “alpha male”… my daydream quickly becomes a Sweeney Todd nightmare in which I’m serving the remains to my dinner guests, disguised as some sort of heavy-seasoned stew beneath puff pastry, because I wound up killing said Alpha Male in sheer exasperation before sundown and need to get rid of the body….</br></br></i></p><p>Naturally, being an alpha male as per Roissy’s definition, I felt a little uncomfortable reading this strange woman’s fantasies about murdering and dismembering me.  Seeing as some of my recent comments at John’s blog, none of which involved violence, had been removed by John himself, I was a little surprised that Ms Resnick’s comments were deemed acceptable and asked for clarification.</p><p><i>VD says: <br> August 21, 2012 at 9:08 am <br> That’s fascinating, Laura.  It appears your female daydreams about the cannibalistic murder of alpha males are perfectly acceptable to the SFWA President here.  Are male daydreams about raping “alpha females” equally acceptable to you, John? Or do we have to kill them first?  I suppose it’s technically not rape if they’re dead. I don’t know about the cannibalism, though, and you know, Laura is really making me uncomfortable here….</br></br></i></p><p>It is more than a little troubling that the President of the SFWA is not merely free with his frequent accusations of assbaggery and other hurtful terms, but is now playing host to the murderously cannibalistic fantasies of certain SFWA members.  It tends to raise the question: is John Scalzi still fit for the SFWA presidency when he maintains an environment that is so openly and violently hostile to men?</p><p>It is a painful question to ask, as I was a public supporter of Mr. Scalzi’s candidacy.  But his recent actions have rendered me a troubled and frightened former supporter.</p><p>UPDATE:</p><p><i>Why is Laura’s comment ok, but not The Deuce’s? I’m confused. Is this a gender bias thing?<br> Cuspidor says: <br> August 21, 2012 at 12:01 pm</br></br></i></p><p><b>John Scalzi says: <br> August 21, 2012 at 12:14 pm<br> Cuspidor:  Because “slut” and “alpha male” are not equivalent terms in any number of ways. Making an argument that they are is an indication of a failure to understand language.  Which is why this sort of word substitution is often neither useful, nor actually anything approaching clever.</br></br></b></p><p><i>VD says: <br> August 21, 2012 at 12:26 pm<br> They are equivalent terms in the most important way, John. They are both human beings. So, are we to conclude that you find the murder, dismemberment, and devouring of a certain subset of men to be acceptable, but the murder, dismemberment, and devouring of a specific subset of women to be unacceptable?  Why do you find it acceptable for Laura to publicly fantasize about murdering, dismembering, and devouring men on your site, but it is not acceptable for The Deuce to do the same regarding women? For the purposes of clarification, is it acceptable for Laura to also publicly fantasize about murdering, dismembering, and devouring women? Would The Deuce’s comments have been acceptable if he, too, was fantasizing about murdering and cannibalizing men?</br></br></i></p><p>Which Mr. Scalzi, being the coward that he is, promptly modified: <b>[Deleted because I don’t have patience for VD’s special brand of complete nonsense on this topic. Stay in your own pit of manstink, would you, Vox? There’s a lad — JS]</b></p><p><i>VD says: <br> August 21, 2012 at 12:32 pm<br> C-c-c-c-coward!  I’ll be bringing this up in the SFWA forum, of course, Mr. President. Your behavior is wildly inappropriate for an official representative of our fine professional association.</br></br></i></p></div>",
  "content_text": "Laura Resnick, an SFWA member,\nwaxed homicidal\non SFWA President John Scalzi’s blog:\nLaura Resnick says:\nAugust 17, 2012 at 1:12 pm\nWhever I think “alpha male”… my daydream quickly becomes a Sweeney Todd nightmare in which I’m serving the remains to my dinner guests, disguised as some sort of heavy-seasoned stew beneath puff pastry, because I wound up killing said Alpha Male in sheer exasperation before sundown and need to get rid of the body….\nNaturally, being an alpha male as per Roissy’s definition, I felt a little uncomfortable reading this strange woman’s fantasies about murdering and dismembering me.  Seeing as some of my recent comments at John’s blog, none of which involved violence, had been removed by John himself, I was a little surprised that Ms Resnick’s comments were deemed acceptable and asked for clarification.\nVD says:\nAugust 21, 2012 at 9:08 am\nThat’s fascinating, Laura.  It appears your female daydreams about the cannibalistic murder of alpha males are perfectly acceptable to the SFWA President here.  Are male daydreams about raping “alpha females” equally acceptable to you, John? Or do we have to kill them first?  I suppose it’s technically not rape if they’re dead. I don’t know about the cannibalism, though, and you know, Laura is really making me uncomfortable here….\nIt is more than a little troubling that the President of the SFWA is not merely free with his frequent accusations of assbaggery and other hurtful terms, but is now playing host to the murderously cannibalistic fantasies of certain SFWA members.  It tends to raise the question: is John Scalzi still fit for the SFWA presidency when he maintains an environment that is so openly and violently hostile to men?\nIt is a painful question to ask, as I was a public supporter of Mr. Scalzi’s candidacy.  But his recent actions have rendered me a troubled and frightened former supporter.\nUPDATE:\nWhy is Laura’s comment ok, but not The Deuce’s? I’m confused. Is this a gender bias thing?\nCuspidor says:\nAugust 21, 2012 at 12:01 pm\nJohn Scalzi says:\nAugust 21, 2012 at 12:14 pm\nCuspidor:  Because “slut” and “alpha male” are not equivalent terms in any number of ways. Making an argument that they are is an indication of a failure to understand language.  Which is why this sort of word substitution is often neither useful, nor actually anything approaching clever.\nVD says:\nAugust 21, 2012 at 12:26 pm\nThey are equivalent terms in the most important way, John. They are both human beings. So, are we to conclude that you find the murder, dismemberment, and devouring of a certain subset of men to be acceptable, but the murder, dismemberment, and devouring of a specific subset of women to be unacceptable?  Why do you find it acceptable for Laura to publicly fantasize about murdering, dismembering, and devouring men on your site, but it is not acceptable for The Deuce to do the same regarding women? For the purposes of clarification, is it acceptable for Laura to also publicly fantasize about murdering, dismembering, and devouring women? Would The Deuce’s comments have been acceptable if he, too, was fantasizing about murdering and cannibalizing men?\nWhich Mr. Scalzi, being the coward that he is, promptly modified:\n[Deleted because I don’t have patience for VD’s special brand of complete nonsense on this topic. Stay in your own pit of manstink, would you, Vox? There’s a lad — JS]\nVD says:\nAugust 21, 2012 at 12:32 pm\nC-c-c-c-coward!  I’ll be bringing this up in the SFWA forum, of course, Mr. President. Your behavior is wildly inappropriate for an official representative of our fine professional association.",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-21T13:33:00+00:00"
}