{
  "url": "https://voxday.net/2012/08/20/free-trade-and-undermining-of-nations/",
  "scraped_at": "2025-12-14T05:01:38.376573",
  "title": "Free trade and the undermining of nations",
  "date_display": "August 20, 2012",
  "date_iso": "2012-08-20T17:00:00+00:00",
  "date_from_url": "2012-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I understand that many, if not most, of you were skeptical when I pointed out that if free trade were to be implemented on the same scale on the international level that it is on the domestic level, it would necessitate the destruction of the USA as a sovereign nation and <a href=\"http://voxday.blogspot.ch/2012/08/gary-north-still-hates-americans.html#links\">the expatriation of nearly 50 percent of its native workers</a> under the age of 35.  However, you may be a little less dubious once you understand that I am not the only one who <a href=\"http://www.bbc.co.uk/news/uk-politics-18519395\">has done the math</a>.</p><blockquote><p>The EU should “do its best to undermine” the “homogeneity” of its member states, the UN’s special representative for migration has said.  Peter Sutherland told peers the future prosperity of many EU states depended on them becoming multicultural….</p><p>Mr Sutherland, who is non-executive chairman of Goldman Sachs International and a former chairman of oil giant BP, heads the Global Forum on Migration and Development, which brings together representatives of 160 nations to share policy ideas.  He told the House of Lords committee migration was a “crucial dynamic for economic growth” in some EU nations “however difficult it may be to explain this to the citizens of those states”.</p></blockquote><p>As hard as it may be to accept, free trade, mass immigration, multiculturalism, globalism, climate change, and centralized government are all different facets of the same globalist vision of <i>Ein Welt, Ein Volk, Ein Reich</i>.  This isn’t some outlandish figment of my imagination, it’s all right there in front of you.  The problem is that few have the ability to comprehend the scope of it all, and even fewer have the capacity for putting the various pieces together to see the whole.</p></div>",
  "content_text": "I understand that many, if not most, of you were skeptical when I pointed out that if free trade were to be implemented on the same scale on the international level that it is on the domestic level, it would necessitate the destruction of the USA as a sovereign nation and\nthe expatriation of nearly 50 percent of its native workers\nunder the age of 35.  However, you may be a little less dubious once you understand that I am not the only one who\nhas done the math\n.\nThe EU should “do its best to undermine” the “homogeneity” of its member states, the UN’s special representative for migration has said.  Peter Sutherland told peers the future prosperity of many EU states depended on them becoming multicultural….\nMr Sutherland, who is non-executive chairman of Goldman Sachs International and a former chairman of oil giant BP, heads the Global Forum on Migration and Development, which brings together representatives of 160 nations to share policy ideas.  He told the House of Lords committee migration was a “crucial dynamic for economic growth” in some EU nations “however difficult it may be to explain this to the citizens of those states”.\nAs hard as it may be to accept, free trade, mass immigration, multiculturalism, globalism, climate change, and centralized government are all different facets of the same globalist vision of\nEin Welt, Ein Volk, Ein Reich\n.  This isn’t some outlandish figment of my imagination, it’s all right there in front of you.  The problem is that few have the ability to comprehend the scope of it all, and even fewer have the capacity for putting the various pieces together to see the whole.",
  "tags": [
    "free trade",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-20T16:00:00+00:00"
}