{
  "url": "https://voxday.net/2012/08/31/free-society-or-political-equality/",
  "scraped_at": "2025-12-14T05:02:27.155464",
  "title": "Free society or political equality",
  "date_display": "August 31, 2012",
  "date_iso": "2012-08-31T08:10:00+00:00",
  "date_from_url": "2012-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Republicans, like the Democrats, have chosen the latter.  And, as Larry Auster points out, in doing so they have also <a href=\"http://www.amnation.com/vfr/archives/023162.html\">chosen sexual socialism</a>:</p><blockquote><p>Mrs. Romney, along with the GOP which approved her speech, has inadvertently demonstrated once again why women should not have the vote and should not have prominent positions in politics. Because once women have the vote, they become a separate constituency with interests separate from those of men. This inevitably results (1) in female emotionalism and female resentment becoming central in politics; (2) in everyone bowing down at the altar of the mistreated, overworked “moms” of America, who are thus turned into a new type of oppressed ubermensch; and (3) in women as a group demanding substantive equality with men as a group. In short, sexual socialism….</p><p>Republicans say they believe in a free society. But the truth is that women’s political equality is incompatible with a free society, because women’s political equality moves society irresistibly in the direction of socialism.</p></blockquote><p>Women will never, ever, be freedom-oriented voters.  They will always be security-oriented.  Even women who are intellectually freedom-oriented – and what percentage of the electorate is even remotely intellectual? – find it necessary to fight off the emotional appeal of security arguments that appeal to them more powerfully than any man can hope to understand.  Mussolini is one of many socialists who knew this, which is why political equality, including a guaranteed percentage of representative seats in the parliament, is the very first plank in the Fascist manifesto.</p><p>The Democrats accuse Republicans of fighting a war on women.  It’s not true.  But they should be.  Instead, they are putting the dreadful Ann Romney on display, who I suspect will make for a more baleful influence on American society than any first lady since Nancy Reagan.  Hillary only engaged in a bit of financial corruption and fired her lawyer in an unusually untidy manner.  Nancy gave us the War on Drugs.</p><p>And now we live in John Adams’s <s>Dictatorship</s>Tyranny of the Petticoat.  How terribly surprising to discover that the nation’s credit cards are maxed out.  The choice is between Suffrage or Liberty and you can only choose one.</p></div>",
  "content_text": "The Republicans, like the Democrats, have chosen the latter.  And, as Larry Auster points out, in doing so they have also\nchosen sexual socialism\n:\nMrs. Romney, along with the GOP which approved her speech, has inadvertently demonstrated once again why women should not have the vote and should not have prominent positions in politics. Because once women have the vote, they become a separate constituency with interests separate from those of men. This inevitably results (1) in female emotionalism and female resentment becoming central in politics; (2) in everyone bowing down at the altar of the mistreated, overworked “moms” of America, who are thus turned into a new type of oppressed ubermensch; and (3) in women as a group demanding substantive equality with men as a group. In short, sexual socialism….\nRepublicans say they believe in a free society. But the truth is that women’s political equality is incompatible with a free society, because women’s political equality moves society irresistibly in the direction of socialism.\nWomen will never, ever, be freedom-oriented voters.  They will always be security-oriented.  Even women who are intellectually freedom-oriented – and what percentage of the electorate is even remotely intellectual? – find it necessary to fight off the emotional appeal of security arguments that appeal to them more powerfully than any man can hope to understand.  Mussolini is one of many socialists who knew this, which is why political equality, including a guaranteed percentage of representative seats in the parliament, is the very first plank in the Fascist manifesto.\nThe Democrats accuse Republicans of fighting a war on women.  It’s not true.  But they should be.  Instead, they are putting the dreadful Ann Romney on display, who I suspect will make for a more baleful influence on American society than any first lady since Nancy Reagan.  Hillary only engaged in a bit of financial corruption and fired her lawyer in an unusually untidy manner.  Nancy gave us the War on Drugs.\nAnd now we live in John Adams’s\nDictatorship\nTyranny of the Petticoat.  How terribly surprising to discover that the nation’s credit cards are maxed out.  The choice is between Suffrage or Liberty and you can only choose one.",
  "tags": [
    "politics",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-31T07:10:00+00:00"
}