{
  "url": "https://voxday.net/2012/08/10/gary-north-digs-himself-deeper/",
  "scraped_at": "2025-12-14T05:00:51.453789",
  "title": "Gary North digs himself deeper",
  "date_display": "August 10, 2012",
  "date_iso": "2012-08-10T11:47:00+00:00",
  "date_from_url": "2012-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amusing to see North continue flailing about, still avoiding the salient points while casting aspersions and lies on every side in a desperate attempt to distract the reader from the fact that his case is hopeless.  And yet, a close reading shows that he knows his case is hopeless, as he is trying to respond to arguments that he dare not engage openly by name.  Consider <a href=\"http://mises.org/daily/6139/The-Statist-Propositions-of-Protectionism\">this interesting new assertion</a> and the way it contradicts what he had previously written as well as what he later writes in the very same piece:</p><blockquote><p>In my recent essays on tariffs, in which I have used the metaphors of badges and guns and invisible lines known as borders, I have been attempting to get people to think carefully about the underlying economic principles of free enterprise. I am asking people to think through the presuppositions and implications of their views regarding the way the economy really works and the way the economy ought to work.</p></blockquote><p>Ah, so those invisible lines that are used to delineate the nonexistent nation are merely <i>metaphorical</i> now!  He didn’t actually mean to say that nations don’t exist, after all, that would be entirely absurd and would prove my point that he is an intrinsically anti-American globalist.</p><p>But he’s lying again, and the only reason he’s trying to claim it is a metaphor is because it blows apart his entire argument… which is why he’s promptly forced to return to the “metaphor” only a few paragraphs later.</p><blockquote><p>They say that they do not believe that the state is the same as the nation. The problem is, most of them still operate in terms of the collective entity known as the nation. They still cling to the idea of the nation-state as the final source of guidance for the economy….</p><p>What do you mean, “the nation”? What is this nation?</p><p>How does special-interest legislation favoring a handful of domestic manufacturers defend the vaguely defined entity called the nation?</p><p>There is a true bait-and-switch operation going on here. Defenders of tariffs present themselves as defenders of the nation, when in fact the nation, from the point of view of economics, is not a collective entity. The nation, from an economic standpoint, is simply a convenient name that we give to people inside invisible judicial lines known as national borders.</p></blockquote><p>But wait a minute?  Didn’t Mr. North just say that those invisible lines were metaphors?  More importantly, it is clear that the only bait-and-switch taking place here is on North’s part, as he is desperate to conflate the nationalist argument with a statist one.  He has the hammer of his anti-statist argument and therefore the problem must be a nail.  But it is simply false to claim that the nation is the state, and indeed, only a myopic and untraveled American like North is liable to make such a mistake.  Nations are more than judicial constructs or units of Samuelsonian economic calculation, they are genetic and linguistic and they are not only distinct from political states, they predate them.</p><p>North tells more porkies when he provides a list of propositions he erroneously claims to be false, which are particularly embarrassing given his claims to be a historian.  Consider this one: <i>“Badges plus guns plus sales taxes increase the wealth of nations.”</i></p><p>This isn’t a false proposition.  History is perfectly clear on how Rome’s wealth, Great Britain’s wealth, and America’s wealth were all produced by badges, guns, and yes, taxes.  Indeed, the observable decline of the USA traces back to the point when it had to begin competing in a world in which it was no longer the only state without a shattered industrial infrastructure.  As I have pointed out before, Bastiat’s Broken Window Fallacy is not a fallacy so long as one breaks the windows in another town and shoots the glazier there.  It is clear that North simply doesn’t understand the important difference between the collective wealth of nations and the wealth of an individual nation, much less the nature of the dynamic relationship between the two concepts.  Nor does he understand that the free trade he advocates requires the end of the very nations that he simultaneously claims are a) nonexistent and b) the beneficiaries of the wealth produced by free trade.</p><p>Instead of addressing the substantive arguments that I and others have offered, such as my economic calculation that it will require the emigration of nearly fifty percent of the U.S. workforce under the age of 40 to generate the same benefits from international free trade that are derived from domestic free trade, North prefers to attack straw men and centuries-old mercantilist arguments.  But note that even in the quote from Mises that begins his latest debacle, the roots of my argument can be detected: <i>“International division of labor becomes suspect because it hinders the full use of national sovereignty.”</i></p><p>Translation: Free trade is incompatible with national sovereignty.  And international labor mobility is incompatible with the very existence of nations.</p><p>Perhaps he’s senile, or perhaps he’s simply an intellectually overmatched coward, but either way, Gary North’s continued attempts to tar all economic nationalists with the statist brush are not only false, they are dishonest.  Consider his conclusion, which demonstrates the extent to which he fails to grasp the salient issues:</p><blockquote><p>I do not expect to change the mind of any protectionist. But I would like those people who are the targets of protectionists’ taxation program to recognize that the person making the argument for sales taxes on imports is a mercantilist and a welfare statist.  The protectionist will not admit this to himself, and he surely will not admit it to anyone considering his arguments. He will staunchly deny that he is a mercantilist or a welfare statist, but his arguments are those of mercantilism and welfare state economics, so his denials should not be taken seriously.</p></blockquote><p>Of course he would like the modern protectionists to do that… because then he’d have an argument against them!  But the arguments being made are most certainly not “those of mercantilism and welfare state economics” as many of them have clearly never been made before!  And in light of how feeble and dishonest his performance has been, it is more than a little amusing to see an unconfessed globalist utopian such as North trying to claim that anyone else’s denials should not be taken seriously.</p><blockquote><p>Most of all, I want them to stop claiming that they are believers in Austrian school economics and are staunch defenders of libertarianism.</p></blockquote><p>If belief in international free trade is a prerequisite to believing in Austrian School economics, I have no problem declaring myself a post-Austrian.  Mises isn’t Holy Writ after all, and I suspect the Austrian School will be eventually seen as little more than a stepping stone that served as a useful contribution towards a more relevant and reliable post-Austrian economics.  As for libertarianism, I will merely point out that liberty cannot exist in the absence of nations.  The alternative to nations isn’t liberty, but global totalitarianism and the absolute rule of evil.</p></div>",
  "content_text": "It’s amusing to see North continue flailing about, still avoiding the salient points while casting aspersions and lies on every side in a desperate attempt to distract the reader from the fact that his case is hopeless.  And yet, a close reading shows that he knows his case is hopeless, as he is trying to respond to arguments that he dare not engage openly by name.  Consider\nthis interesting new assertion\nand the way it contradicts what he had previously written as well as what he later writes in the very same piece:\nIn my recent essays on tariffs, in which I have used the metaphors of badges and guns and invisible lines known as borders, I have been attempting to get people to think carefully about the underlying economic principles of free enterprise. I am asking people to think through the presuppositions and implications of their views regarding the way the economy really works and the way the economy ought to work.\nAh, so those invisible lines that are used to delineate the nonexistent nation are merely\nmetaphorical\nnow!  He didn’t actually mean to say that nations don’t exist, after all, that would be entirely absurd and would prove my point that he is an intrinsically anti-American globalist.\nBut he’s lying again, and the only reason he’s trying to claim it is a metaphor is because it blows apart his entire argument… which is why he’s promptly forced to return to the “metaphor” only a few paragraphs later.\nThey say that they do not believe that the state is the same as the nation. The problem is, most of them still operate in terms of the collective entity known as the nation. They still cling to the idea of the nation-state as the final source of guidance for the economy….\nWhat do you mean, “the nation”? What is this nation?\nHow does special-interest legislation favoring a handful of domestic manufacturers defend the vaguely defined entity called the nation?\nThere is a true bait-and-switch operation going on here. Defenders of tariffs present themselves as defenders of the nation, when in fact the nation, from the point of view of economics, is not a collective entity. The nation, from an economic standpoint, is simply a convenient name that we give to people inside invisible judicial lines known as national borders.\nBut wait a minute?  Didn’t Mr. North just say that those invisible lines were metaphors?  More importantly, it is clear that the only bait-and-switch taking place here is on North’s part, as he is desperate to conflate the nationalist argument with a statist one.  He has the hammer of his anti-statist argument and therefore the problem must be a nail.  But it is simply false to claim that the nation is the state, and indeed, only a myopic and untraveled American like North is liable to make such a mistake.  Nations are more than judicial constructs or units of Samuelsonian economic calculation, they are genetic and linguistic and they are not only distinct from political states, they predate them.\nNorth tells more porkies when he provides a list of propositions he erroneously claims to be false, which are particularly embarrassing given his claims to be a historian.  Consider this one:\n“Badges plus guns plus sales taxes increase the wealth of nations.”\nThis isn’t a false proposition.  History is perfectly clear on how Rome’s wealth, Great Britain’s wealth, and America’s wealth were all produced by badges, guns, and yes, taxes.  Indeed, the observable decline of the USA traces back to the point when it had to begin competing in a world in which it was no longer the only state without a shattered industrial infrastructure.  As I have pointed out before, Bastiat’s Broken Window Fallacy is not a fallacy so long as one breaks the windows in another town and shoots the glazier there.  It is clear that North simply doesn’t understand the important difference between the collective wealth of nations and the wealth of an individual nation, much less the nature of the dynamic relationship between the two concepts.  Nor does he understand that the free trade he advocates requires the end of the very nations that he simultaneously claims are a) nonexistent and b) the beneficiaries of the wealth produced by free trade.\nInstead of addressing the substantive arguments that I and others have offered, such as my economic calculation that it will require the emigration of nearly fifty percent of the U.S. workforce under the age of 40 to generate the same benefits from international free trade that are derived from domestic free trade, North prefers to attack straw men and centuries-old mercantilist arguments.  But note that even in the quote from Mises that begins his latest debacle, the roots of my argument can be detected:\n“International division of labor becomes suspect because it hinders the full use of national sovereignty.”\nTranslation: Free trade is incompatible with national sovereignty.  And international labor mobility is incompatible with the very existence of nations.\nPerhaps he’s senile, or perhaps he’s simply an intellectually overmatched coward, but either way, Gary North’s continued attempts to tar all economic nationalists with the statist brush are not only false, they are dishonest.  Consider his conclusion, which demonstrates the extent to which he fails to grasp the salient issues:\nI do not expect to change the mind of any protectionist. But I would like those people who are the targets of protectionists’ taxation program to recognize that the person making the argument for sales taxes on imports is a mercantilist and a welfare statist.  The protectionist will not admit this to himself, and he surely will not admit it to anyone considering his arguments. He will staunchly deny that he is a mercantilist or a welfare statist, but his arguments are those of mercantilism and welfare state economics, so his denials should not be taken seriously.\nOf course he would like the modern protectionists to do that… because then he’d have an argument against them!  But the arguments being made are most certainly not “those of mercantilism and welfare state economics” as many of them have clearly never been made before!  And in light of how feeble and dishonest his performance has been, it is more than a little amusing to see an unconfessed globalist utopian such as North trying to claim that anyone else’s denials should not be taken seriously.\nMost of all, I want them to stop claiming that they are believers in Austrian school economics and are staunch defenders of libertarianism.\nIf belief in international free trade is a prerequisite to believing in Austrian School economics, I have no problem declaring myself a post-Austrian.  Mises isn’t Holy Writ after all, and I suspect the Austrian School will be eventually seen as little more than a stepping stone that served as a useful contribution towards a more relevant and reliable post-Austrian economics.  As for libertarianism, I will merely point out that liberty cannot exist in the absence of nations.  The alternative to nations isn’t liberty, but global totalitarianism and the absolute rule of evil.",
  "tags": [
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-10T10:47:00+00:00"
}