{
  "url": "https://voxday.net/2012/08/01/gary-north-still-hates-americans/",
  "scraped_at": "2025-12-14T05:00:15.169434",
  "title": "Gary North still hates Americans",
  "date_display": "August 1, 2012",
  "date_iso": "2012-08-01T14:00:00+00:00",
  "date_from_url": "2012-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gary North is apparently foolish enough to continue shopping around that inept and deceptive article wherein he blatantly lies about the opponents of free trade and the arguments and critiques they present.  Previously on Lew Rockwell, <a href=\"http://mises.org/daily/6123/Tariffs-as-WelfareState-Economics\">the same article</a> is now featured by the Mises Institute:</p><blockquote><p>I have found over the years that when I debate with people who promote tariffs, meaning sales taxes on imported goods that are enforced by people with badges and guns, they always adopt arguments that apply only to America’s side of the border. They refuse to adopt those very same arguments for people on the other side of the border.</p><p>I challenge defenders of tariffs to state their arguments in terms of both of the people who want to trade, not just the American. The ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line. I take this position because I want the pro-tariff person to face the implications of his position.</p></blockquote><p>Of course, Mr. North doesn’t hold himself accountable to the same standard as he flees from the obvious and inescapable conclusions that are logically dictated by his dogmatic free trade positions.  Despite his challenge, I can almost guarantee he won’t address this argument for restricted trade, which transcends economics and applies to Americans, Frenchmen, and Chinese alike. Consider:</p><p><b>1.  Free trade, in its true, complete, and intellectually coherent form, is not limited to the free movement of goods, but includes the free movement of capital and labor as well.</b> (Note, for example, that the “invisible judicial line” doesn’t magically become visible when because human bodies are involved.)</p><p><b>2.  The difference between domestic economies and the global international economy is not trivial, but is substantive, material, and based on significant genetic, cultural, traditional, and legal differences between various self-identified peoples.</b></p><p>3.  Free trade is totally incompatible with national sovereignty, democracy, and self-determination, as well as the existence of independent nation-states with the right and ability to set their own laws according to the preferences of their residents.</p><p>4.  Therefore, free trade must be opposed by every sovereign, democratic, or self-determined people, be they American, Chinese, German, or Zambian, who wish to preserve themselves as a free and distinct nation possessed of its own culture, traditions, and laws.</p><p>I invite Gary North or any other advocate of free trade to dispute or attempt to correct that argument.  Now let’s consider the facts.  Free trade advocates often claim that there is no reason for any difference between the U.S. domestic economy and the international economy.  They believe there should be no more barriers between sovereign nation-states than there are between the several and united American States.  And yet, look at the difference between labor mobility in the USA versus the European Union.</p><p><i>In the former EU15, only about 0.1% of the working age population changes its country of residence in a given year. Conversely, in the US, about 3% of the working age population moves to a different state every year,</i></p><p>These institutional and cultural differences suggest comparing internal geographical mobility in the US with the situation within EU Member States rather than between Member States. In doing so, the figures narrow the ‘mobility gap’ between Europe and the US. Between 2000 and 2005, about 1% of the working age population had changed residence each year from one region to another within the EU15 countries, compared to an overall interstate mobility rate of 2.8%-3.4% in the US during the same period of time.”<br> – Peter Ester and Hubert Krieger, “Comparing labour mobility in Europe and the US: facts and pitfalls”, 2008</br></p><p>What this means is that US workers are about 3x more willing to change their state of residence than European workers are willing to change their region of residence within national borders, and 30x more inclined to change their state of residence than Europeans are inclined to change their country of residence, even though the US state-to-state change likely involves a bigger geographic move than the EU country-to-country one.</p><p>It should be noted that increasing this country-to-country labor mobility rate within the EU is not only a major goal of the EU economic advisers, but the explicitly stated reason for this goal is their belief that increased labor mobility is required in order to increase economic growth.</p><p>Now, let’s look at what that annual 3 percent intra-US mobility translates to in terms of the overall population.  The statistics are as follows for Americans between the ages of 25 and 44:</p><p>US overall 50.5 percent <br> East 54.3 percent<br> Midwest 65.0 percent <br> South 47.3 percent<br> West 40.2 percent</br></br></br></br></p><p>This is why the Midwest has changed much less over the last 40 years than either the East Coast or the West Coast; more Midwesterners stay in the Midwest and maintain their laws and cultural traditions.  But more importantly, note what this signifies for the USA if the apostles of free trade were ever able to achieve their goal of permitting international trade to take place on the same terms as American domestic trade in a manner that realized the anticipated economic benefits: <i><b>very nearly half of all American workers would be expected to leave the USA by the average age of 35</b></i>!</p><p>This vast exodus of young Americans would say nothing, of course, of the <i>hundreds of millions</i> of non-American workers who would be expected to enter the USA, with all of the various consequences to be expected as a result of immigration that is an order of magnitude larger than the current wave.</p><p>The logic of free trade is inescapable.  It amounts to a choice between a steadily declining living standard if free trade is limited to goods and capital versus the total destruction of the nation and the replacement of a majority of its population within a single lifetime if it is pursued to the full beneficial extent of the concept.</p><p>To paraphrase North, if you still refuse to give up the idea of free trade as a desirable means to increase the wealth of nations, then you should at least admit to yourself and others that you favor the total destruction of national sovereignty, the elimination of the U.S. Constitution, and the end of America and other historical nations. It’s time to come clean. You favor the politics of ein Welt, ein Recht, ein Volk.</p><p>In much the same way that those who support high tax levels cannot understand the counter-intuitive fact that the higher tax rates do not always lead to higher tax revenues, free trade advocates fail to understand that reducing national trade barriers will not always lead to increased wealth or liberty.  If one believes that America was ever any sort of paragon of wealth and freedom, then it is obviously insane to advocate any policy that will cause America to return to the global average with regards to either, even if that policy would tend to raise the global average to some degree.</p></div>",
  "content_text": "Gary North is apparently foolish enough to continue shopping around that inept and deceptive article wherein he blatantly lies about the opponents of free trade and the arguments and critiques they present.  Previously on Lew Rockwell,\nthe same article\nis now featured by the Mises Institute:\nI have found over the years that when I debate with people who promote tariffs, meaning sales taxes on imported goods that are enforced by people with badges and guns, they always adopt arguments that apply only to America’s side of the border. They refuse to adopt those very same arguments for people on the other side of the border.\nI challenge defenders of tariffs to state their arguments in terms of both of the people who want to trade, not just the American. The ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line. I take this position because I want the pro-tariff person to face the implications of his position.\nOf course, Mr. North doesn’t hold himself accountable to the same standard as he flees from the obvious and inescapable conclusions that are logically dictated by his dogmatic free trade positions.  Despite his challenge, I can almost guarantee he won’t address this argument for restricted trade, which transcends economics and applies to Americans, Frenchmen, and Chinese alike. Consider:\n1.  Free trade, in its true, complete, and intellectually coherent form, is not limited to the free movement of goods, but includes the free movement of capital and labor as well.\n(Note, for example, that the “invisible judicial line” doesn’t magically become visible when because human bodies are involved.)\n2.  The difference between domestic economies and the global international economy is not trivial, but is substantive, material, and based on significant genetic, cultural, traditional, and legal differences between various self-identified peoples.\n3.  Free trade is totally incompatible with national sovereignty, democracy, and self-determination, as well as the existence of independent nation-states with the right and ability to set their own laws according to the preferences of their residents.\n4.  Therefore, free trade must be opposed by every sovereign, democratic, or self-determined people, be they American, Chinese, German, or Zambian, who wish to preserve themselves as a free and distinct nation possessed of its own culture, traditions, and laws.\nI invite Gary North or any other advocate of free trade to dispute or attempt to correct that argument.  Now let’s consider the facts.  Free trade advocates often claim that there is no reason for any difference between the U.S. domestic economy and the international economy.  They believe there should be no more barriers between sovereign nation-states than there are between the several and united American States.  And yet, look at the difference between labor mobility in the USA versus the European Union.\nIn the former EU15, only about 0.1% of the working age population changes its country of residence in a given year. Conversely, in the US, about 3% of the working age population moves to a different state every year,\nThese institutional and cultural differences suggest comparing internal geographical mobility in the US with the situation within EU Member States rather than between Member States. In doing so, the figures narrow the ‘mobility gap’ between Europe and the US. Between 2000 and 2005, about 1% of the working age population had changed residence each year from one region to another within the EU15 countries, compared to an overall interstate mobility rate of 2.8%-3.4% in the US during the same period of time.”\n– Peter Ester and Hubert Krieger, “Comparing labour mobility in Europe and the US: facts and pitfalls”, 2008\nWhat this means is that US workers are about 3x more willing to change their state of residence than European workers are willing to change their region of residence within national borders, and 30x more inclined to change their state of residence than Europeans are inclined to change their country of residence, even though the US state-to-state change likely involves a bigger geographic move than the EU country-to-country one.\nIt should be noted that increasing this country-to-country labor mobility rate within the EU is not only a major goal of the EU economic advisers, but the explicitly stated reason for this goal is their belief that increased labor mobility is required in order to increase economic growth.\nNow, let’s look at what that annual 3 percent intra-US mobility translates to in terms of the overall population.  The statistics are as follows for Americans between the ages of 25 and 44:\nUS overall 50.5 percent\nEast 54.3 percent\nMidwest 65.0 percent\nSouth 47.3 percent\nWest 40.2 percent\nThis is why the Midwest has changed much less over the last 40 years than either the East Coast or the West Coast; more Midwesterners stay in the Midwest and maintain their laws and cultural traditions.  But more importantly, note what this signifies for the USA if the apostles of free trade were ever able to achieve their goal of permitting international trade to take place on the same terms as American domestic trade in a manner that realized the anticipated economic benefits:\nvery nearly half of all American workers would be expected to leave the USA by the average age of 35\n!\nThis vast exodus of young Americans would say nothing, of course, of the\nhundreds of millions\nof non-American workers who would be expected to enter the USA, with all of the various consequences to be expected as a result of immigration that is an order of magnitude larger than the current wave.\nThe logic of free trade is inescapable.  It amounts to a choice between a steadily declining living standard if free trade is limited to goods and capital versus the total destruction of the nation and the replacement of a majority of its population within a single lifetime if it is pursued to the full beneficial extent of the concept.\nTo paraphrase North, if you still refuse to give up the idea of free trade as a desirable means to increase the wealth of nations, then you should at least admit to yourself and others that you favor the total destruction of national sovereignty, the elimination of the U.S. Constitution, and the end of America and other historical nations. It’s time to come clean. You favor the politics of ein Welt, ein Recht, ein Volk.\nIn much the same way that those who support high tax levels cannot understand the counter-intuitive fact that the higher tax rates do not always lead to higher tax revenues, free trade advocates fail to understand that reducing national trade barriers will not always lead to increased wealth or liberty.  If one believes that America was ever any sort of paragon of wealth and freedom, then it is obviously insane to advocate any policy that will cause America to return to the global average with regards to either, even if that policy would tend to raise the global average to some degree.",
  "tags": [
    "free trade",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-01T13:00:00+00:00"
}