{
  "url": "https://voxday.net/2012/08/23/help-out-instapundi/",
  "scraped_at": "2025-12-14T05:01:54.882682",
  "title": "Scratching back",
  "date_display": "August 23, 2012",
  "date_iso": "2012-08-23T15:44:00+00:00",
  "date_from_url": "2012-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The good professor always sends a lot of traffic to Amazon when he links my books, so it only seems fair to help him out in return, especially when it costs nothing to nobody. <a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2133669\">Download his PDF on the Obamacare decision</a> – no registration or cost required – and apparently he’ll get to count some kind of academic coup or something.  It actually makes for pretty interesting reading, and it’s only 21 pages, but more importantly, downloading it will make some leftist professor whose paper on 19th Century Transgender Law in the Third Ruritanian Republic gets bumped down a notch cry.</p><p>It’s moderately funny too.  Consider the following quote: <i>“This has led some commentators to suggest that Roberts’ holding in Sebelius was, like Marshall’s opinion in Marbury v. Madison, a sort of Trojan horse, smuggling in a victory over an important legal principle while shrouding that victory behind a win on the general issue for the other side. There are two problems with this conception: One is with the understanding of Marbury that it embodies, and the other is with the understanding of NFIB that it embodies.”</i></p><p>Translation: “No, you idiot Republicans, it’s exactly what it looked like.  Roberts stabbed you in the back, so quit pretending you liked it.”</p></div>",
  "content_text": "The good professor always sends a lot of traffic to Amazon when he links my books, so it only seems fair to help him out in return, especially when it costs nothing to nobody.\nDownload his PDF on the Obamacare decision\n– no registration or cost required – and apparently he’ll get to count some kind of academic coup or something.  It actually makes for pretty interesting reading, and it’s only 21 pages, but more importantly, downloading it will make some leftist professor whose paper on 19th Century Transgender Law in the Third Ruritanian Republic gets bumped down a notch cry.\nIt’s moderately funny too.  Consider the following quote:\n“This has led some commentators to suggest that Roberts’ holding in Sebelius was, like Marshall’s opinion in Marbury v. Madison, a sort of Trojan horse, smuggling in a victory over an important legal principle while shrouding that victory behind a win on the general issue for the other side. There are two problems with this conception: One is with the understanding of Marbury that it embodies, and the other is with the understanding of NFIB that it embodies.”\nTranslation: “No, you idiot Republicans, it’s exactly what it looked like.  Roberts stabbed you in the back, so quit pretending you liked it.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-23T14:44:00+00:00"
}