{
  "url": "https://voxday.net/2012/08/08/immigrants-and-economy/",
  "scraped_at": "2025-12-14T05:00:44.157976",
  "title": "Immigrants and the economy",
  "date_display": "August 8, 2012",
  "date_iso": "2012-08-08T14:33:00+00:00",
  "date_from_url": "2012-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is becoming increasingly clear that <a href=\"http://www.washingtontimes.com/news/2012/aug/8/slow-path-to-progress-for-us-immigrants/\">immigrants are not good for the economy</a>, except in the pure Keynesian sense of requiring an increase in G:</p><blockquote><p>Immigrants lag behind native-born Americans on most measures of economic well-being — even those who have been in the U.S. the longest, according to a report from the Center for Immigration Studies, which argues that full assimilation is a more complex task than overcoming language or cultural differences.</p><p>The study, which covers all immigrants, legal and illegal, and their U.S.-born children younger than 18, found that immigrants tend to make economic progress by most measures the longer they live in the U.S. but lag well behind native-born Americans on factors such as poverty, health insurance coverage and homeownership.</p><p>The study, based on 2010 and 2011 census data, found that 43 percent of immigrants who have been in the U.S. at least 20 years were using welfare benefits, a rate that is nearly twice as high as native-born Americans and nearly 50 percent higher than recent immigrants.</p><p>The report was released at a time when both major presidential candidates have backed policies that would make it easier to immigrate legally and would boost the numbers of people coming to the U.S.</p></blockquote><p>The same pattern has been seen in Europe.  Second generation immigrants are actually less inclined to work and more inclined to be radical about their home countries and cultures than the first-generation ones.  While there is nothing about it in the linked article, they are also much more likely to commit criminal acts.  Notice that the conclusion is something I have been pointing out for some time now: <i>“full assimilation is a more complex task than overcoming language or cultural differences”.</i></p><p>It is, in fact, close to impossible even over three or four generations.  As I have also previously noted, it takes hundreds of years to civilize an uncivilized people; this is why blacks are still behaving in social patterns that are clearly distinct from both native whites and immigrant whites, and if history is a reliable guide, they will for at least another 800 years even if there are no absolute genetic bars to it.</p><p>Most non-Anglo Americans have a very retarded and romantic attitude about immigration because their grandparents or great-grandparents were immigrants.  First, they don’t understand how those nineteenth and early twentieth waves of immigration harmed the USA for the obvious reason that they don’t understand the Constitution or the English Common Law any better than their immigrant forebears from Germany, Ireland, Italy, and Scandinavia did.  They may have the emotional attachment to the flag and the pledge of allegiance – the latter only created in 1892 – but they are not genuine Americans in the sense of having been born in a tradition of sovereign rebellion.</p><p>Second, they fail to understand the qualitative differences between the various waves of immigration.  Immigrants from civilized European cultures were always going to be fundamentally different than those from semi-civilized and uncivilized societies.</p></div>",
  "content_text": "It is becoming increasingly clear that\nimmigrants are not good for the economy\n, except in the pure Keynesian sense of requiring an increase in G:\nImmigrants lag behind native-born Americans on most measures of economic well-being — even those who have been in the U.S. the longest, according to a report from the Center for Immigration Studies, which argues that full assimilation is a more complex task than overcoming language or cultural differences.\nThe study, which covers all immigrants, legal and illegal, and their U.S.-born children younger than 18, found that immigrants tend to make economic progress by most measures the longer they live in the U.S. but lag well behind native-born Americans on factors such as poverty, health insurance coverage and homeownership.\nThe study, based on 2010 and 2011 census data, found that 43 percent of immigrants who have been in the U.S. at least 20 years were using welfare benefits, a rate that is nearly twice as high as native-born Americans and nearly 50 percent higher than recent immigrants.\nThe report was released at a time when both major presidential candidates have backed policies that would make it easier to immigrate legally and would boost the numbers of people coming to the U.S.\nThe same pattern has been seen in Europe.  Second generation immigrants are actually less inclined to work and more inclined to be radical about their home countries and cultures than the first-generation ones.  While there is nothing about it in the linked article, they are also much more likely to commit criminal acts.  Notice that the conclusion is something I have been pointing out for some time now:\n“full assimilation is a more complex task than overcoming language or cultural differences”.\nIt is, in fact, close to impossible even over three or four generations.  As I have also previously noted, it takes hundreds of years to civilize an uncivilized people; this is why blacks are still behaving in social patterns that are clearly distinct from both native whites and immigrant whites, and if history is a reliable guide, they will for at least another 800 years even if there are no absolute genetic bars to it.\nMost non-Anglo Americans have a very retarded and romantic attitude about immigration because their grandparents or great-grandparents were immigrants.  First, they don’t understand how those nineteenth and early twentieth waves of immigration harmed the USA for the obvious reason that they don’t understand the Constitution or the English Common Law any better than their immigrant forebears from Germany, Ireland, Italy, and Scandinavia did.  They may have the emotional attachment to the flag and the pledge of allegiance – the latter only created in 1892 – but they are not genuine Americans in the sense of having been born in a tradition of sovereign rebellion.\nSecond, they fail to understand the qualitative differences between the various waves of immigration.  Immigrants from civilized European cultures were always going to be fundamentally different than those from semi-civilized and uncivilized societies.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-08T13:33:00+00:00"
}