{
  "url": "https://voxday.net/2012/08/10/integration-olympic-style/",
  "scraped_at": "2025-12-14T05:00:55.112322",
  "title": "Integration, Olympic style",
  "date_display": "August 10, 2012",
  "date_iso": "2012-08-10T20:37:00+00:00",
  "date_from_url": "2012-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A distance runner <a href=\"http://sports.yahoo.com/blogs/olympics-fourth-place-medal/american-athlete-under-fire-carrying-mexican-flag-171127666--oly.html\">lets the cat out of the bag</a>:</p><blockquote><p>Leo Manzano, a Mexican immigrant who became the first American man to win a medal in the metric mile since 1968, draped himself in the flags of both his countries after his race at Olympic Stadium. That decision earned some cheers, but mostly jeers from Mexican-Americans….  A poll on the CBS Atlanta website showed that 83 percent of respondents think Manzano shouldn’t have carried the Mexican flag.</p></blockquote><p>Only 83 percent… I would have expected that the Mexican-American community would be more upset that he carried an <i>American</i> flag..  It seems to me that there have been numerous events, from the May Day parades to the US home soccer games and the various California public school policies, where many “Mexican-Americans” have made it perfectly clear where their true loyalties lie.</p></div>",
  "content_text": "A distance runner\nlets the cat out of the bag\n:\nLeo Manzano, a Mexican immigrant who became the first American man to win a medal in the metric mile since 1968, draped himself in the flags of both his countries after his race at Olympic Stadium. That decision earned some cheers, but mostly jeers from Mexican-Americans….  A poll on the CBS Atlanta website showed that 83 percent of respondents think Manzano shouldn’t have carried the Mexican flag.\nOnly 83 percent… I would have expected that the Mexican-American community would be more upset that he carried an\nAmerican\nflag..  It seems to me that there have been numerous events, from the May Day parades to the US home soccer games and the various California public school policies, where many “Mexican-Americans” have made it perfectly clear where their true loyalties lie.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-10T19:37:00+00:00"
}