{
  "url": "https://voxday.net/2012/08/17/john-scalzi-justifies-sexis/",
  "scraped_at": "2025-12-14T05:01:20.081483",
  "title": "John Scalzi justifies sexism",
  "date_display": "August 17, 2012",
  "date_iso": "2012-08-17T07:11:00+00:00",
  "date_from_url": "2012-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Scalzi attempts <a href=\"http://whatever.scalzi.com/2012/08/09/an-incomplete-guide-to-not-creeping/\">to defend female rejection of men as “creepers”</a>, amusingly without realizing how perfectly it can be turned around and applied to male rejection of women in a manner that he would probably consider sexist:</p><blockquote><p> Acknowledge that you don’t get to define other people’s comfort level with you. Which is to say that you may be trying your hardest to be interesting and engaging and fun to be around — and still come off as a <s>creeper</s>stupid slut to someone else. Yes, that sucks for you. But you know what? It sucks for them even harder, because you’re <s>creeping</s>pissing them <s>out</s>off and making them profoundly unhappy and uncomfortable.  It may not seem fair that <s>“creep”</s>“stupid slut” is their assessment of you, but: Surprise! It doesn’t matter, and if you try to argue with them (or anyone else) that you’re in fact not being a <s>creep</s>stupid slut and the problem is with them not you, then you go from <s>“creep”</s>“stupid slut”  to <s>“complete assbag”</s>“complete bitch”.  Sometimes people aren’t going to like you or want to be near you. It’s just the way it is.”</p></blockquote><p>Congratulations to John.  He has managed to concoct a soundly sexist argument for simply banning women from DEFCON or any other predominantly male gathering.  After all, if the dorks there don’t like women or want them near them, it’s just the way it is….  Men have precisely the same right to arbitrarily label women “stupid sluts” and treat them accordingly as women have to arbitrarily label men “creeps” and do the same.</p><p>Now, some men are genuinely creepy and I’m certainly not defending anyone’s right to behave in an uncivilized manner.  But at the same time, it should be noted that women cannot be granted a right to free association that is denied to men.</p><p>UPDATE: Scalzi is either too lazy or too much of a pussy to think through his own arguments.  He writes:</p><p><i>You know, I saw in a Google search that you wrote on this piece at your blog, and I thought to myself, “oh, great, now I go have to deal with some dumbass comment from him on the site.” And I was right!  For your next trick of bad equivalence, why don’t you put the word “droid” in parentheses and congratulate me for coming up with a valid excuse for banning R2D2 from the Mos Eisley cantina?</i></p><p>If this is really what you’ve come to say, don’t really need to be on this thread, VD. Shoo.  Everyone else, best to leave VD uncommented upon.</p><p>He also added this:</p><p><i>[Deleted because the point this jackhole was purporting to make was just an excuse for him to call women obnoxious things on my site. Hi there, trolls from VD’s site! Just because you wallow in a feculent miasma of male self-regard over there doesn’t mean you get to port it over here — JS]</i></p><p>It is fascinating to see that John Scalzi has devolved into such an intellectual pussy that he almost immediately concludes those who disagree with him must be trolls.  And in support of my earlier charge of his sexism, what a sexist assumption to assume that all of the readers at VP are men!  This is what happens when you run an echo chamber, you get sloppy, lazy, and eventually become unable to defend your opinions.  It’s particularly embarrassing in this situation, because I am simply pointing out the obvious logical consequences of his statement, which can be easily understood by looking at the word “creep” as a variable rather than being distracted by his “false equivalence” defense.</p><p>The equivalence or lack thereof is irrelevant. It doesn’t matter how Scalzi defines “creep” or to whom he applies the term.  His argument works just as well for justifying the social stigmatization of “droids”, “negroes”, “homosexuals”, “girls with cooties”, or anything else that might make an individual uncomfortable. That’s not bad logic, and if he genuinely think it is, then I certainly invite him to identify the specific logical error or logical fallacy in it… if he can.</p><p>It is amusing to see him talking about “bad logic” as there is a reason I tagged this under “trainwreck” in the first place.  Of course, this is the genius who once cited a female professor teaching “Lesbianism in Indian Film” at the University of Minnesota in order to defend the idea of female interest in the hard sciences.</p></div>",
  "content_text": "Mr. Scalzi attempts\nto defend female rejection of men as “creepers”\n, amusingly without realizing how perfectly it can be turned around and applied to male rejection of women in a manner that he would probably consider sexist:\nAcknowledge that you don’t get to define other people’s comfort level with you. Which is to say that you may be trying your hardest to be interesting and engaging and fun to be around — and still come off as a\ncreeper\nstupid slut to someone else. Yes, that sucks for you. But you know what? It sucks for them even harder, because you’re\ncreeping\npissing them\nout\noff and making them profoundly unhappy and uncomfortable.  It may not seem fair that\n“creep”\n“stupid slut” is their assessment of you, but: Surprise! It doesn’t matter, and if you try to argue with them (or anyone else) that you’re in fact not being a\ncreep\nstupid slut and the problem is with them not you, then you go from\n“creep”\n“stupid slut”  to\n“complete assbag”\n“complete bitch”.  Sometimes people aren’t going to like you or want to be near you. It’s just the way it is.”\nCongratulations to John.  He has managed to concoct a soundly sexist argument for simply banning women from DEFCON or any other predominantly male gathering.  After all, if the dorks there don’t like women or want them near them, it’s just the way it is….  Men have precisely the same right to arbitrarily label women “stupid sluts” and treat them accordingly as women have to arbitrarily label men “creeps” and do the same.\nNow, some men are genuinely creepy and I’m certainly not defending anyone’s right to behave in an uncivilized manner.  But at the same time, it should be noted that women cannot be granted a right to free association that is denied to men.\nUPDATE: Scalzi is either too lazy or too much of a pussy to think through his own arguments.  He writes:\nYou know, I saw in a Google search that you wrote on this piece at your blog, and I thought to myself, “oh, great, now I go have to deal with some dumbass comment from him on the site.” And I was right!  For your next trick of bad equivalence, why don’t you put the word “droid” in parentheses and congratulate me for coming up with a valid excuse for banning R2D2 from the Mos Eisley cantina?\nIf this is really what you’ve come to say, don’t really need to be on this thread, VD. Shoo.  Everyone else, best to leave VD uncommented upon.\nHe also added this:\n[Deleted because the point this jackhole was purporting to make was just an excuse for him to call women obnoxious things on my site. Hi there, trolls from VD’s site! Just because you wallow in a feculent miasma of male self-regard over there doesn’t mean you get to port it over here — JS]\nIt is fascinating to see that John Scalzi has devolved into such an intellectual pussy that he almost immediately concludes those who disagree with him must be trolls.  And in support of my earlier charge of his sexism, what a sexist assumption to assume that all of the readers at VP are men!  This is what happens when you run an echo chamber, you get sloppy, lazy, and eventually become unable to defend your opinions.  It’s particularly embarrassing in this situation, because I am simply pointing out the obvious logical consequences of his statement, which can be easily understood by looking at the word “creep” as a variable rather than being distracted by his “false equivalence” defense.\nThe equivalence or lack thereof is irrelevant. It doesn’t matter how Scalzi defines “creep” or to whom he applies the term.  His argument works just as well for justifying the social stigmatization of “droids”, “negroes”, “homosexuals”, “girls with cooties”, or anything else that might make an individual uncomfortable. That’s not bad logic, and if he genuinely think it is, then I certainly invite him to identify the specific logical error or logical fallacy in it… if he can.\nIt is amusing to see him talking about “bad logic” as there is a reason I tagged this under “trainwreck” in the first place.  Of course, this is the genius who once cited a female professor teaching “Lesbianism in Indian Film” at the University of Minnesota in order to defend the idea of female interest in the hard sciences.",
  "tags": [
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-17T06:11:00+00:00"
}