{
  "url": "https://voxday.net/2012/08/03/mailvox-atheist-debate/",
  "scraped_at": "2025-12-14T05:00:26.149291",
  "title": "Mailvox: atheist debate",
  "date_display": "August 3, 2012",
  "date_iso": "2012-08-03T20:16:00+00:00",
  "date_from_url": "2012-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TS appears to have learned his formidable debating skillz from the late Christopher Hitchens.  He wrote, apropos of nothing, and without so much as a subject matter:</p><blockquote><p>I don’t recall Hitchens ever arguing a point solely by explaining how he “feels” about it. I fear that while your vocabulary may display the results of some kind of education, your ability to reason indicates a resolute refusal to truly learn or listen.</p></blockquote><p>To which I responded: <i>Assuming your memory isn’t flawed, you’re either a complete moron or you haven’t actually read any of Christopher Hitchens’s books.  In fact, I would be very interested to know what you feel is the substantive and non-emotional metric by which Hitchens argued God is not great.  But considering the possibility that it is your recollection that is the problem, precisely what point do you believe I have argued on the sole basis of my feelings?  Deflation vs inflation?  Ricardian comparative advantage?</i></p><p>TS responded:</p><blockquote><p>I never claimed that you argue with emotion. I was responding to your message that accompanied the “demotivator” on your website that showed, for some reason, Hitchens with no shirt on. My “feelings” on matters of science are irrelevant, since science is not bridled with emotion. Hitchens is very emotional. What I wrote was that he, from my recollection, does not argue solely based on his emotions. If he did that, you could certainly lump him into the same category as the philsopher, “Dr.” Craig or indeed the televangelists you see on TV. But, he does not. Name calling is not necessary but, unfortunately, it is not surprising. Faith, one could argue, is strictly emotional, if you consider that by it’s very definition, is the belief in something for which there is no evidence, or in spite of compelling evidence to the contrary. I would submit that a rational person could only have strong faith in something, for which there is no evidence or overwhelming evidence to the contrary, only if they have been compelled to do so from an early age or have some other emotional revelation about that something. While I have the disadvantage of being as you put it a “moron” (that was the only possible conclusion, since I have read Hitchens), I “feel” no need to be angered by an email. Settle the fuck down.</p></blockquote><p><i>Dude, it’s a demotivator!  Hitchens, Dawkins, and Harris all ran around acting like complete assholes and more than merited such contempt.  But the idea that someone’s “ability to reason” is determined by a demotivator – which, in that particular case, I didn’t even create – is deeply and profoundly stupid.  And no, one cannot reasonably argue that faith is “strictly emotional”.</i></p></div>",
  "content_text": "TS appears to have learned his formidable debating skillz from the late Christopher Hitchens.  He wrote, apropos of nothing, and without so much as a subject matter:\nI don’t recall Hitchens ever arguing a point solely by explaining how he “feels” about it. I fear that while your vocabulary may display the results of some kind of education, your ability to reason indicates a resolute refusal to truly learn or listen.\nTo which I responded:\nAssuming your memory isn’t flawed, you’re either a complete moron or you haven’t actually read any of Christopher Hitchens’s books.  In fact, I would be very interested to know what you feel is the substantive and non-emotional metric by which Hitchens argued God is not great.  But considering the possibility that it is your recollection that is the problem, precisely what point do you believe I have argued on the sole basis of my feelings?  Deflation vs inflation?  Ricardian comparative advantage?\nTS responded:\nI never claimed that you argue with emotion. I was responding to your message that accompanied the “demotivator” on your website that showed, for some reason, Hitchens with no shirt on. My “feelings” on matters of science are irrelevant, since science is not bridled with emotion. Hitchens is very emotional. What I wrote was that he, from my recollection, does not argue solely based on his emotions. If he did that, you could certainly lump him into the same category as the philsopher, “Dr.” Craig or indeed the televangelists you see on TV. But, he does not. Name calling is not necessary but, unfortunately, it is not surprising. Faith, one could argue, is strictly emotional, if you consider that by it’s very definition, is the belief in something for which there is no evidence, or in spite of compelling evidence to the contrary. I would submit that a rational person could only have strong faith in something, for which there is no evidence or overwhelming evidence to the contrary, only if they have been compelled to do so from an early age or have some other emotional revelation about that something. While I have the disadvantage of being as you put it a “moron” (that was the only possible conclusion, since I have read Hitchens), I “feel” no need to be angered by an email. Settle the fuck down.\nDude, it’s a demotivator!  Hitchens, Dawkins, and Harris all ran around acting like complete assholes and more than merited such contempt.  But the idea that someone’s “ability to reason” is determined by a demotivator – which, in that particular case, I didn’t even create – is deeply and profoundly stupid.  And no, one cannot reasonably argue that faith is “strictly emotional”.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-03T19:16:00+00:00"
}