{
  "url": "https://voxday.net/2012/08/29/mitt-romney-chicago-republican/",
  "scraped_at": "2025-12-14T05:02:19.814815",
  "title": "Mitt Romney, Republican Totalitarian",
  "date_display": "August 29, 2012",
  "date_iso": "2012-08-29T08:03:00+00:00",
  "date_from_url": "2012-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep <a href=\"http://market-ticker.org/akcs-www?post=210793\">this shenanigan</a> in mind if you still think that Mitt Romney is a fine, upstanding man who will turn the country around:</p><blockquote><p>Listening to the announcement of delegates for the candidates, from the podium they are omitting any votes for other than Mitt Romney.  But not all the votes are for Mitt Romney.  Ron Paul and Rick Santorum have some votes.  They’re being intentionally ignored.  Not counted and then announced that he didn’t win, ignored as if they never happened.</p></blockquote><p>For those who claim Obama is orders of magnitude worse than Romney, note that even the famously narcissistic Obama didn’t try to pretend that no one voted for Hillary Clinton at the 2008 DNC.  The vote totals were 3,188.5 for Obama and 1,010.5 for Clinton.  And while I no longer read National Review on a regular basis, I correctly anticipated that they would have some mention of this. <a href=\"http://www.nationalreview.com/corner/315210/gop-grassroots-and-establishment-clash-again-over-rules-john-fund\">John Fund explained</a> what was going on behind Team Romney’s attempt to present a false front of party unity:</p><p><i>The proposed rules package surfaced last Friday as Team Romney moved to grant sweeping new powers to the Republican National Committee — and the Romney forces who now control it – to amend the governing documents of the Grand Old Party just about any time they want without a vote of delegates from the grassroots….  Team Romney was able to ram the proposed changes through the Rules Committee but a substantial minority, some 40 percent, vociferously objected. </i></p><p>Mitt Romney has revealed himself to be a centralist and a totalitarian with no respect for the rule of law.  I don’t see how anyone who supported Ron Paul can, in good conscience, vote for the man this fall.</p><p>UPDATE: <i>“The Republican National Committee is not transparent and does not have integrity. They stole votes. They stole delegates. They refused to send busses for our delegates. It’s a totalitarian process. This is not democracy. It’s a really sad day for us. I’ve worked for Republican candidates since I was 16. We believed the Republican Party had more integrity. <a href=\"http://www.motherjones.com/mojo/2012/08/ron-paul-supporters-rebel-convention-floor-fuck-you-tyrants\">Boy, did they prove us wrong.</a>“</i></p><p>UPDATE II: Republicans <a href=\"http://takingnote.blogs.nytimes.com/2012/08/28/the-ron-paul-revolt/?smid=tw-share\">demonstrate their respect</a> for the rules: <i>Delegates from Nevada tried to nominate Mr. Paul from the floor, submitting petitions from their own state as well as Minnesota, Maine, Iowa, Oregon, Alaska and the Virgin Islands. That should have done the trick: Rules require signatures from just five states. But the party changed the rules on the spot. Henceforth, delegates must gather petitions from eight states.</i></p></div>",
  "content_text": "Keep\nthis shenanigan\nin mind if you still think that Mitt Romney is a fine, upstanding man who will turn the country around:\nListening to the announcement of delegates for the candidates, from the podium they are omitting any votes for other than Mitt Romney.  But not all the votes are for Mitt Romney.  Ron Paul and Rick Santorum have some votes.  They’re being intentionally ignored.  Not counted and then announced that he didn’t win, ignored as if they never happened.\nFor those who claim Obama is orders of magnitude worse than Romney, note that even the famously narcissistic Obama didn’t try to pretend that no one voted for Hillary Clinton at the 2008 DNC.  The vote totals were 3,188.5 for Obama and 1,010.5 for Clinton.  And while I no longer read National Review on a regular basis, I correctly anticipated that they would have some mention of this.\nJohn Fund explained\nwhat was going on behind Team Romney’s attempt to present a false front of party unity:\nThe proposed rules package surfaced last Friday as Team Romney moved to grant sweeping new powers to the Republican National Committee — and the Romney forces who now control it – to amend the governing documents of the Grand Old Party just about any time they want without a vote of delegates from the grassroots….  Team Romney was able to ram the proposed changes through the Rules Committee but a substantial minority, some 40 percent, vociferously objected.\nMitt Romney has revealed himself to be a centralist and a totalitarian with no respect for the rule of law.  I don’t see how anyone who supported Ron Paul can, in good conscience, vote for the man this fall.\nUPDATE:\n“The Republican National Committee is not transparent and does not have integrity. They stole votes. They stole delegates. They refused to send busses for our delegates. It’s a totalitarian process. This is not democracy. It’s a really sad day for us. I’ve worked for Republican candidates since I was 16. We believed the Republican Party had more integrity.\nBoy, did they prove us wrong.\n“\nUPDATE II: Republicans\ndemonstrate their respect\nfor the rules:\nDelegates from Nevada tried to nominate Mr. Paul from the floor, submitting petitions from their own state as well as Minnesota, Maine, Iowa, Oregon, Alaska and the Virgin Islands. That should have done the trick: Rules require signatures from just five states. But the party changed the rules on the spot. Henceforth, delegates must gather petitions from eight states.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-29T07:03:00+00:00"
}