{
  "url": "https://voxday.net/2012/08/12/not-that-it-matters/",
  "scraped_at": "2025-12-14T05:01:02.067196",
  "title": "Not that it matters",
  "date_display": "August 12, 2012",
  "date_iso": "2012-08-12T14:02:00+00:00",
  "date_from_url": "2012-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, let me point out that I reserve the right to give away or sell my books at any price, reasonable or unreasonable, and to change my policy at any time.</p><p>Second, because one or two people have been whining about how I only provide a few millions of words for free here but no longer give away the eight PDF and PDB files I previously made available for free download, I will point out that due to Amazon’s policy, it is not possible to give away a free ebook and also sell it through Amazon.  Nor can one give away free ebooks on Amazon, except for a five-day free program that they run for paid books.  As I pointed out when I first took down the free links, because Amazon is now the center of the book world, one will find more readers if one sells books on Amazon than if one gives them away on one’s own site, even a site as well-trafficked as this one.</p><p>Third, as it happens, because those books were available on Amazon first, I should never have made them available for free download here, with the sole exception of the collection of short stories called <i>The Altar of Hate</i>.  Fortunately, Amazon did not hold that against me, as they understood it was done in ignorance due to the fact that the Amazon contracts were originally with the publishers and I had no reason to ever review them.</p><p>Amazon is doing a great job of bringing down ebook prices and most people recognize this.  However, fewer realize that in doing so, they have also essentially eliminated the free ebook, Project Gutenberg notwithstanding.</p></div>",
  "content_text": "First, let me point out that I reserve the right to give away or sell my books at any price, reasonable or unreasonable, and to change my policy at any time.\nSecond, because one or two people have been whining about how I only provide a few millions of words for free here but no longer give away the eight PDF and PDB files I previously made available for free download, I will point out that due to Amazon’s policy, it is not possible to give away a free ebook and also sell it through Amazon.  Nor can one give away free ebooks on Amazon, except for a five-day free program that they run for paid books.  As I pointed out when I first took down the free links, because Amazon is now the center of the book world, one will find more readers if one sells books on Amazon than if one gives them away on one’s own site, even a site as well-trafficked as this one.\nThird, as it happens, because those books were available on Amazon first, I should never have made them available for free download here, with the sole exception of the collection of short stories called\nThe Altar of Hate\n.  Fortunately, Amazon did not hold that against me, as they understood it was done in ignorance due to the fact that the Amazon contracts were originally with the publishers and I had no reason to ever review them.\nAmazon is doing a great job of bringing down ebook prices and most people recognize this.  However, fewer realize that in doing so, they have also essentially eliminated the free ebook, Project Gutenberg notwithstanding.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-12T13:02:00+00:00"
}