{
  "url": "https://voxday.net/2012/08/07/sick-of-sikhs/",
  "scraped_at": "2025-12-14T05:00:38.925894",
  "title": "Send the Sikhs to safety",
  "date_display": "August 7, 2012",
  "date_iso": "2012-08-07T14:09:00+00:00",
  "date_from_url": "2012-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems that the Onion’s parody of Michele Bachmann’s fake response to the Wisconsin shootings wasn’t actually all that far off.  Two-thirds of those killed <a href=\"http://thecable.foreignpolicy.com/posts/2012/08/06/state_department_tries_to_smooth_ties_with_india_after_wisconsin_massacre\">weren’t Americans</a>, which is why the savages are now attempting to attack the U.S. Constitution.</p><blockquote><p>Top State Department officials including Secretary of State Hillary Clinton have been working behind the scenes to assuage Indian anger following the attack on a Sikh temple in Wisconsin over the weekend by an Army veteran and alleged former white supremacist.</p><p>Indian government officials and Sikh leaders across India were outraged by the attack that left 6 dead, including 4 Indian nationals, at a Sikh temple near Milwaukee and called on the U.S. to do more to protect Sikhs living in the United Sates. Clinton called Indian Foreign Minister S.M. Krishna from her stop in South Africa Monday after Krishna criticized the U.S. for failed policies and a growing trend of violent incidents against religious minorities….</p><p>Protests broke out in several Indian cities in response to the news of the attack, some calling for stricter U.S. gun laws. Punjab Chief Minister Parkash Singh Badal wrote to India Prime Minister Manmohan Singh to urge the Indian government to press the Obama administration to do more to protect Sikhs living in the U.S.</p></blockquote><p>First of all, the Secretary of State’s message to the Indians should be a very short and succinct one.  “Fuck you, fuck your emigrants, and if they don’t like our gun rights, then they can go home to live in unarmed filth and fear <a href=\"http://www.nytimes.com/2012/08/07/world/asia/india-stray-dogs-are-a-menace.html?hpw\">among your rabid, feral dogs</a>.”</p><p><i>No country has as many stray dogs as India, and no country suffers as much from them. Free-roaming dogs number in the tens of millions and bite millions of people annually, including vast numbers of children. An estimated 20,000 people die every year from rabies infections — more than a third of the global rabies toll.</i></p><p>If the Indians were willing to fight for their own freedom to carry guns, they could save tens of thousand of lives by simply shooting the feral dogs that attack them.  But they’d rather run their mouths trying to interfere with how Americans live in the USA than do anything about the squalor, filth, and tyranny of their own country.  The Obama administration should agree to protect the Sikhs by putting them on a plane back to India.</p></div>",
  "content_text": "It seems that the Onion’s parody of Michele Bachmann’s fake response to the Wisconsin shootings wasn’t actually all that far off.  Two-thirds of those killed\nweren’t Americans\n, which is why the savages are now attempting to attack the U.S. Constitution.\nTop State Department officials including Secretary of State Hillary Clinton have been working behind the scenes to assuage Indian anger following the attack on a Sikh temple in Wisconsin over the weekend by an Army veteran and alleged former white supremacist.\nIndian government officials and Sikh leaders across India were outraged by the attack that left 6 dead, including 4 Indian nationals, at a Sikh temple near Milwaukee and called on the U.S. to do more to protect Sikhs living in the United Sates. Clinton called Indian Foreign Minister S.M. Krishna from her stop in South Africa Monday after Krishna criticized the U.S. for failed policies and a growing trend of violent incidents against religious minorities….\nProtests broke out in several Indian cities in response to the news of the attack, some calling for stricter U.S. gun laws. Punjab Chief Minister Parkash Singh Badal wrote to India Prime Minister Manmohan Singh to urge the Indian government to press the Obama administration to do more to protect Sikhs living in the U.S.\nFirst of all, the Secretary of State’s message to the Indians should be a very short and succinct one.  “Fuck you, fuck your emigrants, and if they don’t like our gun rights, then they can go home to live in unarmed filth and fear\namong your rabid, feral dogs\n.”\nNo country has as many stray dogs as India, and no country suffers as much from them. Free-roaming dogs number in the tens of millions and bite millions of people annually, including vast numbers of children. An estimated 20,000 people die every year from rabies infections — more than a third of the global rabies toll.\nIf the Indians were willing to fight for their own freedom to carry guns, they could save tens of thousand of lives by simply shooting the feral dogs that attack them.  But they’d rather run their mouths trying to interfere with how Americans live in the USA than do anything about the squalor, filth, and tyranny of their own country.  The Obama administration should agree to protect the Sikhs by putting them on a plane back to India.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-07T13:09:00+00:00"
}