{
  "url": "https://voxday.net/2012/08/18/the-last-testament-of-henry-halleck/",
  "scraped_at": "2025-12-14T05:01:27.374066",
  "title": "“The Last Testament of Henry Halleck”",
  "date_display": "August 18, 2012",
  "date_iso": "2012-08-18T17:00:00+00:00",
  "date_from_url": "2012-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In honor of the publication of <a href=\"http://www.amazon.com/Stupefying-Stories-August-2012-ebook/dp/B008YPRBCI/ref=sr_1_1?ie=UTF8&amp;qid=1345306791&amp;sr=8-1&amp;keywords=B008YPRBCI\">the August issue of Stupefying Stories</a>, I’m posting my story that was published in the March 2012 issue.  Seven points count against your sanity if you can correctly identify the author whose style I attempted to imitate here – an effort I think met with rather less success than the story written in the mode of <a href=\"http://www.milobookclub.com/2012/04/11/deported/\">Guy de Maupassant</a>.  If you enjoy fantastic fiction, there are few better values out there than the increasingly well-regarded <i>Stupefying Stories</i> anthologies.</p><p><b>The Last Testament of Henry Halleck</b><br> <i>Stupefying Stories</i>, March 2012<br> Vox Day</br></br></p><p><i>At the request of the Cardinal Prefect, I have forwarded this document to you, Cardinal, which according to our records, has been in the possession of the Congregation since 1885.  I trust you will find it of some use in your present investigations concerning the historical suppression of Humani Generis Unitas.  I should also like to call to your attention the series of files on the Forschungs- und Lehrgemeinschaft das Ahnenerbe, particularly the one concerning a 1939 expedition led by Dr. Otto Huth on U-41, commanded by Kapitänleutnant Gustav-Adolf Mugler, which I believe is already in your possession.</i></p><p>Monsignor Damiano Marzotto Caotorta<br> Palace of the Holy Office<br> The Vatican</br></br></p><p>I have burned the memoirs I once thought to leave to posterity.  I have also destroyed my correspondence, public and private, and can only hope that my fellow conspirators will see fit to follow my example and do the same.  I have only preserved my books and my translations, which I have concluded are harmless, and I pray that if I am remembered, it will be through them and not for my crimes or the monstrosity I played a part in releasing upon the world.  I shall leave behind only this letter, in the hands of Bishop McCloskey, whom I charge with the duty to ensure that it reaches whatever Papist order or society watches over things of this nature, as I have been told exists somewhere in the heart of Rome.  For the evil we unleashed half-unwittingly is neither dead nor vanquished, it merely slumbers, waiting patiently for its next awakening.</p><p>To Seward must be laid the greater portion of the blame.  I do not excuse my own misdeeds in stating this, but state a simple fact.  He had long possessed grandiose dreams of world conquest, but they were inflamed by the thought of having another century or two to realize them.  This, I did not know until afterward, but when I was living in California in 1860, I saw the man twice, before and after his first fatal trip to Russian America, and upon his return I even remarked to my dear wife upon what a changed man he was.  He had always been ambitious and vainglorious, but after his northern excursion, he carried himself with what I can only describe as a Messianic demeanor.  I do not hesitate to admit that I fell under his spell, and upon receiving the promised promotion from the California militia to major general in the United States Army, I believed I could trust him implicitly.</p><p>I did not know the terrible truth of the reason behind this change in the Secretary of State until the autumn of 1861, after traveling to the city of St. Louis and accepting the command for the Department of the Missouri.  Seward met me there and he was much agitated, as the President and the Cabinet were much concerned about the prospective loss of the war following several defeats in Virginia, while I feared that my own career as a Union general would be a short-lived one, since the federal forces for which I was now responsible had been repeatedly defeated by the rebellious State Guard.  How foolish our petty fears now appear in light of the events that subsequently took place!  It was vanity, nothing more, that led us to meet at the Masonic temple in St. Louis, where Seward promised that he would reveal to us a discovery that would change the course of the war.</p><p>There were four of us who met in secret that cold October night; the Secretary of State, myself, a promising young general I had inherited from John Fremont who is presently the President of the United States of America, and the commander of the Department of the Cumberland.  Why Seward chose us rather than any of the much better-known generals from the Eastern states, I cannot say, but I assume it was because Grant, Sherman, and myself were all well outside the federal military establishment and any disasters could be safely attributed to our lack of conventional credentials.  Perhaps more importantly, our distance from the circles of power in Washington meant that his experiment in occult warfare could proceed without criticism and with little risk to his reputation.</p><p>He swore us to secrecy first, and then unveiled the treasure he had discovered in the northern territory.  It was a little idol of a fat, seated man wearing an octopine helm, carved from ivory by the Esquimaux people and small enough to fit in a man’s hand.  We thought him mad when first he showed it to us, but as he was our benefactor, we gave him the opportunity to explain himself nevertheless.  He claimed that the figurine spoke to him, which we did not initially believe, and then said that it would speak to us through him.  To our immense surprise and horror, after he placed both hands around it, his eyes lost their focus and he began speaking with a distinctly different voice.  It was indescribable, and none of us had any doubts that it did not belong to Seward.</p><p>The voice identified itself as a representative of a race of ancient beings.  It refused to name itself, but declared itself to be possessed of such powers as would permit the Union to win the war if we would only provide it with the sustenance it required to wake its fellows.  It said it came from a planet very far away and assured us that neither it nor its race had any interest in the affairs of Man.  We were none of us religious men, but even so, we placed it upon a Bible and Seward immersed it fully in holy water he had obtained for just such purposes, which was sufficient to satisfy myself and Grant, although Sherman still harbored reservations about its nature, particularly when we were told that the sustenance it required was atmospheric, being a psychic substance released by intelligent minds at the moment of their death.  Human minds, although apparently somewhat deficient in various ways, would suffice, which was why it was interested in military men like ourselves.  Sherman and Grant both examined it closely.  I did not touch it, as something about it struck me as unclean, if not unholy.  And yet, we were desperate and ambitious men, disinclined to turn our backs on any device that might serve our ends, however strange.</p><p>Sherman was troubled by the notion of feeding it death, but Seward pointed out that this incorporeal scavenging was no different than the birds of the air and the insects of the field that fed upon the dead and transformed them back to the dust from whence they came.  Therefore, he argued, there was no reason to ascribe either nefarious or beneficial purposes to the idol despite its morbid hungers.  When Grant reminded Sherman that our profession was intimately concerned with killing as many men on the other side as possible, Sherman reluctantly relented.  It was agreed that we would put the strange device to the test as soon as possible, and Seward left the strange little idol in the possession of Sherman prior to his return to Washington the next day.</p><p>The experiment was an unexpected success.  I arranged for one of my colonels to carry the idol into battle unbeknownst to him, and much to our surprise, he dealt the State Guard their first defeat of the war at Fredericktown.  The men were greatly heartened by this success, as the Missouri rebels had beaten them four times previously.  Grant then insisted on taking his turn with it, and with its aid he managed to overrun the Confederate camp at Belmont, killing nearly a thousand rebels at a stroke.  He lost nearly six hundred dead himself, the significance of which we did not truly understand until our next meeting, when Sherman picked up the idol and was unable to remove it first from his hand, then, as he struggled frantically to escape it, from his chest.</p><p>Sherman lay prostrate and speechless for nearly a month before rising from his sickbed and resuming his duties as if nothing had happened.  He would not talk about the device, nor would he permit himself to be approached by doctors, but instead applied himself to his duties with a vengeance.  But he told me once that when he slept, he dreamed of swimming through oceans of blood, and climbing over white mountains of lifeless flesh.  Grant, too, was affected by the dreams, which thankfully left me untouched.  He took to drink to cope with them, but like Sherman, he too began to drive himself and his men relentlessly.  The two men became increasingly close, until I was finally forced to assign Sherman to the Army of West Tennessee so he could serve under Grant.</p><p>The immediate consequence was Shiloh.  Nearly four thousand men died and if there were not oceans of blood, there were at least rivers.  Battle followed battle, victory followed victory, and though I did my best to restrain their increasingly erratic behavior and hide their indifference to the fate of their men, others eventually began to notice.  One newspaper in Ohio even described the pair of them as a drunkard advised by a lunatic.  But they were victorious.  I was summoned to Washington by President Lincoln himself and named General-in-Chief over the entire Union; Grant and Sherman too won promotions despite the whispers that followed them everywhere they went.  The madness and bloodshed finally culminated in The March to the Sea and the dreadful Wilderness Campaign, where entire cities were burned and Grant sacrificed 55,000 of his own men to our secret god of victory.</p><p>I never learned when the idol came into the possession of the President.  But I began to suspect something was amiss when I overheard him ordering Grant to begin destroying plantations and even entire villages throughout the Shenandoah.  He had become obsessed with the tremendous amount of deaths to which both sides were being subjected and he took to wandering the halls of the White House late at night, looking more than a little like a bearded corpse himself.  His eyes burned with the same haunted fire that Sherman’s had after his spell of silent madness and he carried himself with uncharacteristic delicacy.  Mrs. Lincoln openly expressed her fears to me one night after he spent the entire evening sitting in a chair, rocking back and forth mumbling to himself, and to my everlasting shame and regret, I had not the courage to share my own doubts with her.</p><p>It became clear that we needed to intervene after the meeting at Hampton Roads.  The Secretary of State was badly shaken when the President refused to countenance the Confederate offer of surrender, and his concerns deepened when I shared with him a letter from Grant in which he confessed that he had handed over the idol to the President.  But our every attempt to broach the subject with Lincoln met with rebuff.  And our hopes that the end of the war would have a salubrious effect upon him disappeared when the President came to me and asked me to draw up plans for repopulating the conquered southern States by settling the freemen of the North there.  Astonished at his choice of words, I looked into his eyes and saw nothing human there.  At that moment, I knew he would die rather than give up the idol, in fact, I began to wonder if the man I had once so admired even existed anymore.</p><p>As with so much that had gone before, the assassination was Seward’s plan.  He contacted the actor and arranged for the seats at the theater.  It all went as anticipated, including the false attack on Seward, except for the escape of the actor.  But we had bigger concerns that evening than mere exposure of the plot, for when we brought the President back to the White House, we found that he was still alive despite being shot directly in the head at close range with a large caliber pistol.  Imagine our horror when the thing that the President had become opened his eyes and smiled at us.  He seemed to know everything we had done, for he rose from couch upon which he had been placed and attacked Seward, and such was the violence of the assault that he very nearly slew the Secretary of State before Phineas Gurley, the Chaplain of the Senate who had been summoned to pray for the President’s soul, drew a strange object from his waistcoat that caused the demon animating the President to desist.</p><p>At Gurley’s instruction, I slashed away the President’s coat and shirt, revealing the terrible truth.  The idol was embedded into the dead man’s chest like a large, spiderish creature, the octopine tentacles pink and pulsing with parasitic life.  It was with some difficulty that we managed to remove the demonic thing, being of course most careful not to touch it.  At the very moment we pulled it from his flesh, the alien light faded from the President’s eyes.  It was the most peaceful I had seen him in months.  I repent of my many sins and confess them freely as I prepare to meet my end, but the assassination of Abraham Lincoln was neither a sin nor an act for which I can repent.  Had Lincoln lived, I am certain he would have become one of history’s greatest monsters.  Lincoln kept the Union together, but it was Seward who saved the nation.</p><p>I arranged for David Farragut to take the chest in which I secreted the idol on his next voyage across the Atlantic Ocean.  Somewhere at sea, no one knows where, he weighted it with iron and dropped it into the depths.  There, I believe, it will stay, forgotten until the end of time, its rapacious hunger for death unassuaged.  You who read this, know there are evils lurking in the deep shadows of this world beyond the comprehension of men, and that it is ever the duty of those who are cursed to look into those shadows to remain vigilant against them.</p><p>Henry Halleck<br> Louisville, Kentucky<br> January 1, 1872</br></br></p></div>",
  "content_text": "In honor of the publication of\nthe August issue of Stupefying Stories\n, I’m posting my story that was published in the March 2012 issue.  Seven points count against your sanity if you can correctly identify the author whose style I attempted to imitate here – an effort I think met with rather less success than the story written in the mode of\nGuy de Maupassant\n.  If you enjoy fantastic fiction, there are few better values out there than the increasingly well-regarded\nStupefying Stories\nanthologies.\nThe Last Testament of Henry Halleck\nStupefying Stories\n, March 2012\nVox Day\nAt the request of the Cardinal Prefect, I have forwarded this document to you, Cardinal, which according to our records, has been in the possession of the Congregation since 1885.  I trust you will find it of some use in your present investigations concerning the historical suppression of Humani Generis Unitas.  I should also like to call to your attention the series of files on the Forschungs- und Lehrgemeinschaft das Ahnenerbe, particularly the one concerning a 1939 expedition led by Dr. Otto Huth on U-41, commanded by Kapitänleutnant Gustav-Adolf Mugler, which I believe is already in your possession.\nMonsignor Damiano Marzotto Caotorta\nPalace of the Holy Office\nThe Vatican\nI have burned the memoirs I once thought to leave to posterity.  I have also destroyed my correspondence, public and private, and can only hope that my fellow conspirators will see fit to follow my example and do the same.  I have only preserved my books and my translations, which I have concluded are harmless, and I pray that if I am remembered, it will be through them and not for my crimes or the monstrosity I played a part in releasing upon the world.  I shall leave behind only this letter, in the hands of Bishop McCloskey, whom I charge with the duty to ensure that it reaches whatever Papist order or society watches over things of this nature, as I have been told exists somewhere in the heart of Rome.  For the evil we unleashed half-unwittingly is neither dead nor vanquished, it merely slumbers, waiting patiently for its next awakening.\nTo Seward must be laid the greater portion of the blame.  I do not excuse my own misdeeds in stating this, but state a simple fact.  He had long possessed grandiose dreams of world conquest, but they were inflamed by the thought of having another century or two to realize them.  This, I did not know until afterward, but when I was living in California in 1860, I saw the man twice, before and after his first fatal trip to Russian America, and upon his return I even remarked to my dear wife upon what a changed man he was.  He had always been ambitious and vainglorious, but after his northern excursion, he carried himself with what I can only describe as a Messianic demeanor.  I do not hesitate to admit that I fell under his spell, and upon receiving the promised promotion from the California militia to major general in the United States Army, I believed I could trust him implicitly.\nI did not know the terrible truth of the reason behind this change in the Secretary of State until the autumn of 1861, after traveling to the city of St. Louis and accepting the command for the Department of the Missouri.  Seward met me there and he was much agitated, as the President and the Cabinet were much concerned about the prospective loss of the war following several defeats in Virginia, while I feared that my own career as a Union general would be a short-lived one, since the federal forces for which I was now responsible had been repeatedly defeated by the rebellious State Guard.  How foolish our petty fears now appear in light of the events that subsequently took place!  It was vanity, nothing more, that led us to meet at the Masonic temple in St. Louis, where Seward promised that he would reveal to us a discovery that would change the course of the war.\nThere were four of us who met in secret that cold October night; the Secretary of State, myself, a promising young general I had inherited from John Fremont who is presently the President of the United States of America, and the commander of the Department of the Cumberland.  Why Seward chose us rather than any of the much better-known generals from the Eastern states, I cannot say, but I assume it was because Grant, Sherman, and myself were all well outside the federal military establishment and any disasters could be safely attributed to our lack of conventional credentials.  Perhaps more importantly, our distance from the circles of power in Washington meant that his experiment in occult warfare could proceed without criticism and with little risk to his reputation.\nHe swore us to secrecy first, and then unveiled the treasure he had discovered in the northern territory.  It was a little idol of a fat, seated man wearing an octopine helm, carved from ivory by the Esquimaux people and small enough to fit in a man’s hand.  We thought him mad when first he showed it to us, but as he was our benefactor, we gave him the opportunity to explain himself nevertheless.  He claimed that the figurine spoke to him, which we did not initially believe, and then said that it would speak to us through him.  To our immense surprise and horror, after he placed both hands around it, his eyes lost their focus and he began speaking with a distinctly different voice.  It was indescribable, and none of us had any doubts that it did not belong to Seward.\nThe voice identified itself as a representative of a race of ancient beings.  It refused to name itself, but declared itself to be possessed of such powers as would permit the Union to win the war if we would only provide it with the sustenance it required to wake its fellows.  It said it came from a planet very far away and assured us that neither it nor its race had any interest in the affairs of Man.  We were none of us religious men, but even so, we placed it upon a Bible and Seward immersed it fully in holy water he had obtained for just such purposes, which was sufficient to satisfy myself and Grant, although Sherman still harbored reservations about its nature, particularly when we were told that the sustenance it required was atmospheric, being a psychic substance released by intelligent minds at the moment of their death.  Human minds, although apparently somewhat deficient in various ways, would suffice, which was why it was interested in military men like ourselves.  Sherman and Grant both examined it closely.  I did not touch it, as something about it struck me as unclean, if not unholy.  And yet, we were desperate and ambitious men, disinclined to turn our backs on any device that might serve our ends, however strange.\nSherman was troubled by the notion of feeding it death, but Seward pointed out that this incorporeal scavenging was no different than the birds of the air and the insects of the field that fed upon the dead and transformed them back to the dust from whence they came.  Therefore, he argued, there was no reason to ascribe either nefarious or beneficial purposes to the idol despite its morbid hungers.  When Grant reminded Sherman that our profession was intimately concerned with killing as many men on the other side as possible, Sherman reluctantly relented.  It was agreed that we would put the strange device to the test as soon as possible, and Seward left the strange little idol in the possession of Sherman prior to his return to Washington the next day.\nThe experiment was an unexpected success.  I arranged for one of my colonels to carry the idol into battle unbeknownst to him, and much to our surprise, he dealt the State Guard their first defeat of the war at Fredericktown.  The men were greatly heartened by this success, as the Missouri rebels had beaten them four times previously.  Grant then insisted on taking his turn with it, and with its aid he managed to overrun the Confederate camp at Belmont, killing nearly a thousand rebels at a stroke.  He lost nearly six hundred dead himself, the significance of which we did not truly understand until our next meeting, when Sherman picked up the idol and was unable to remove it first from his hand, then, as he struggled frantically to escape it, from his chest.\nSherman lay prostrate and speechless for nearly a month before rising from his sickbed and resuming his duties as if nothing had happened.  He would not talk about the device, nor would he permit himself to be approached by doctors, but instead applied himself to his duties with a vengeance.  But he told me once that when he slept, he dreamed of swimming through oceans of blood, and climbing over white mountains of lifeless flesh.  Grant, too, was affected by the dreams, which thankfully left me untouched.  He took to drink to cope with them, but like Sherman, he too began to drive himself and his men relentlessly.  The two men became increasingly close, until I was finally forced to assign Sherman to the Army of West Tennessee so he could serve under Grant.\nThe immediate consequence was Shiloh.  Nearly four thousand men died and if there were not oceans of blood, there were at least rivers.  Battle followed battle, victory followed victory, and though I did my best to restrain their increasingly erratic behavior and hide their indifference to the fate of their men, others eventually began to notice.  One newspaper in Ohio even described the pair of them as a drunkard advised by a lunatic.  But they were victorious.  I was summoned to Washington by President Lincoln himself and named General-in-Chief over the entire Union; Grant and Sherman too won promotions despite the whispers that followed them everywhere they went.  The madness and bloodshed finally culminated in The March to the Sea and the dreadful Wilderness Campaign, where entire cities were burned and Grant sacrificed 55,000 of his own men to our secret god of victory.\nI never learned when the idol came into the possession of the President.  But I began to suspect something was amiss when I overheard him ordering Grant to begin destroying plantations and even entire villages throughout the Shenandoah.  He had become obsessed with the tremendous amount of deaths to which both sides were being subjected and he took to wandering the halls of the White House late at night, looking more than a little like a bearded corpse himself.  His eyes burned with the same haunted fire that Sherman’s had after his spell of silent madness and he carried himself with uncharacteristic delicacy.  Mrs. Lincoln openly expressed her fears to me one night after he spent the entire evening sitting in a chair, rocking back and forth mumbling to himself, and to my everlasting shame and regret, I had not the courage to share my own doubts with her.\nIt became clear that we needed to intervene after the meeting at Hampton Roads.  The Secretary of State was badly shaken when the President refused to countenance the Confederate offer of surrender, and his concerns deepened when I shared with him a letter from Grant in which he confessed that he had handed over the idol to the President.  But our every attempt to broach the subject with Lincoln met with rebuff.  And our hopes that the end of the war would have a salubrious effect upon him disappeared when the President came to me and asked me to draw up plans for repopulating the conquered southern States by settling the freemen of the North there.  Astonished at his choice of words, I looked into his eyes and saw nothing human there.  At that moment, I knew he would die rather than give up the idol, in fact, I began to wonder if the man I had once so admired even existed anymore.\nAs with so much that had gone before, the assassination was Seward’s plan.  He contacted the actor and arranged for the seats at the theater.  It all went as anticipated, including the false attack on Seward, except for the escape of the actor.  But we had bigger concerns that evening than mere exposure of the plot, for when we brought the President back to the White House, we found that he was still alive despite being shot directly in the head at close range with a large caliber pistol.  Imagine our horror when the thing that the President had become opened his eyes and smiled at us.  He seemed to know everything we had done, for he rose from couch upon which he had been placed and attacked Seward, and such was the violence of the assault that he very nearly slew the Secretary of State before Phineas Gurley, the Chaplain of the Senate who had been summoned to pray for the President’s soul, drew a strange object from his waistcoat that caused the demon animating the President to desist.\nAt Gurley’s instruction, I slashed away the President’s coat and shirt, revealing the terrible truth.  The idol was embedded into the dead man’s chest like a large, spiderish creature, the octopine tentacles pink and pulsing with parasitic life.  It was with some difficulty that we managed to remove the demonic thing, being of course most careful not to touch it.  At the very moment we pulled it from his flesh, the alien light faded from the President’s eyes.  It was the most peaceful I had seen him in months.  I repent of my many sins and confess them freely as I prepare to meet my end, but the assassination of Abraham Lincoln was neither a sin nor an act for which I can repent.  Had Lincoln lived, I am certain he would have become one of history’s greatest monsters.  Lincoln kept the Union together, but it was Seward who saved the nation.\nI arranged for David Farragut to take the chest in which I secreted the idol on his next voyage across the Atlantic Ocean.  Somewhere at sea, no one knows where, he weighted it with iron and dropped it into the depths.  There, I believe, it will stay, forgotten until the end of time, its rapacious hunger for death unassuaged.  You who read this, know there are evils lurking in the deep shadows of this world beyond the comprehension of men, and that it is ever the duty of those who are cursed to look into those shadows to remain vigilant against them.\nHenry Halleck\nLouisville, Kentucky\nJanuary 1, 1872",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-18T16:00:00+00:00"
}