{
  "url": "https://voxday.net/2012/08/12/the-end-of-us-banking-syste/",
  "scraped_at": "2025-12-14T05:01:00.583171",
  "title": "The end of the US banking system",
  "date_display": "August 12, 2012",
  "date_iso": "2012-08-12T11:19:00+00:00",
  "date_from_url": "2012-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://barnhardt.biz/\">Ann Barnhardt</a> explains why it is time to not only get one’s assets out of the US financial markets, but the US banks as well.</p><blockquote><p>What this [Sentinel ruling] means is that even if Jon Corzine is somehow dragged into court by private citizens, because you know damn good and well that the Justice Department will never, ever touch him, Corzine now has a legal precedent, likely from a bribed or otherwise coerced Federal Appeals Court, explicitly stating that <b>an FCM can use customer deposits to pay its debts</b>, and that the customers themselves are subjugated and have basically no legal right to their own monies, no matter what the law says, or what legal assurances, claims or guarantees are made to that customer about their funds held with an FCM or any other brokerage or depository institution. The “secured” party at the front of the line will always be the mega-bank who made the fraudulent loan using the stolen customer funds as collateral.</p><p>In other words, all customer funds in the United States are now the legal property of JP Morgan, Goldman Sachs, BNYM, or whichever megabank is the counterparty on the loans the FCM or depository institution takes out in order to fund its mega-levered proprietary in-house trading desks.</p><p>For the love of God, I don’t know what more there could possibly be to say to snap you people out of your normalcy bias trance. You have GOT to get ALL MONIES out of the financial system NOW. This ruling sets precedence for every depository institution, not just futures brokerages. It is now legal in the United States for any financial institution to steal customer funds, borrow money against those funds for the uber-levered proprietary trading use of the financial institution, and the customers have ZERO CLAIM TO THEIR OWN FUNDS once they are in the custody of the financial institution.</p><p>The court has ruled that once your money passes out of your PHYSICAL POSSESSION, and I mean PHYSICAL possession, <b>it is no longer yours</b>, and you have no legal claim or legal recourse to it when it is stolen. <b>This includes BANK ACCOUNTS. Money in a bank is in the possession of the BANK, not you.</b> Do you comprehend this? The entire system is utterly devoid of any integrity or genuine security and is breaking down catastophically before our very eyes. You HAVE to comprehend that your money sitting in an account is no longer legally yours. You have to force your brain to process and comprehend this, no matter how incomprehensible it may seem. IT IS OVER. This is Marxist hell. We have arrived.</p><p>This ruling and precedent will be used by every brokerage, every bank, every insurance company and every pension fund to deny you your money when the financial system finally collapses, be it on Monday, or be it two years from now.</p></blockquote><p>This is <a href=\"http://www.reuters.com/article/2012/08/10/us-sentinel-appeals-decision-idUSBRE87900T20120810\">the Reuters article</a> to which she is referring.  The reason the ruling is so disastrous is that it grants all depository institutions ownership of the funds on deposit with it.  While this is a logical continuation of the Bankers First and Foremost policy we’ve been seeing from the federal government since 2008, it is burning down the village and salting the earth upon which it stood in order to save it, because there is now absolutely no sound reason to keep your money in a US bank.</p><p>Now, obviously, no banks are going to be dumb enough to take this ruling and run with it… unless it is a matter of their own survival.  But the fact remains that a bank deposit is now legally considered no different than a gift from you to the bank, and depositors are now entirely dependent upon the bank’s good will to spend its money on their behalf.</p><p>I tend to suspect this ruling will be reversed upon appeal once the Powers That Be realize that saving the personal fortunes of Corzine and other failed bankers isn’t worth the price of destroying the US banking system.  But if not, it should cause the largest banking run the world has ever known.  I say “should” rather than “will”, because as we know, most people are idiots and will probably continue blithely assuming that it doesn’t matter what the fine print and the court rulings say, they’ve got a receipt showing they put their money in the bank, and money in the bank is safe, by definition.</p><p>On the other hand, I find this ruling particularly intriguing because I have observed that one can anticipate events, to a certain degree, by seeing through which hoops the elite institutions force the federal government to jump.  While they wouldn’t have any reason to take such risks for Corzine and company, it would make a great deal of sense to do so if they are anticipating a U.S. financial collapse in the near-to-middle term.</p><p>For example, we can safely assume Romney will win the election November on the basis of the Goldman Sachs contributions. <i>“Four years ago, employees of New York-based Goldman gave three-fourths of their campaign donations to Democratic candidates and committees, including presidential nominee Barack Obama. This time, they’re showering 70 percent of their contributions on Republicans.”</i></p></div>",
  "content_text": "Ann Barnhardt\nexplains why it is time to not only get one’s assets out of the US financial markets, but the US banks as well.\nWhat this [Sentinel ruling] means is that even if Jon Corzine is somehow dragged into court by private citizens, because you know damn good and well that the Justice Department will never, ever touch him, Corzine now has a legal precedent, likely from a bribed or otherwise coerced Federal Appeals Court, explicitly stating that\nan FCM can use customer deposits to pay its debts\n, and that the customers themselves are subjugated and have basically no legal right to their own monies, no matter what the law says, or what legal assurances, claims or guarantees are made to that customer about their funds held with an FCM or any other brokerage or depository institution. The “secured” party at the front of the line will always be the mega-bank who made the fraudulent loan using the stolen customer funds as collateral.\nIn other words, all customer funds in the United States are now the legal property of JP Morgan, Goldman Sachs, BNYM, or whichever megabank is the counterparty on the loans the FCM or depository institution takes out in order to fund its mega-levered proprietary in-house trading desks.\nFor the love of God, I don’t know what more there could possibly be to say to snap you people out of your normalcy bias trance. You have GOT to get ALL MONIES out of the financial system NOW. This ruling sets precedence for every depository institution, not just futures brokerages. It is now legal in the United States for any financial institution to steal customer funds, borrow money against those funds for the uber-levered proprietary trading use of the financial institution, and the customers have ZERO CLAIM TO THEIR OWN FUNDS once they are in the custody of the financial institution.\nThe court has ruled that once your money passes out of your PHYSICAL POSSESSION, and I mean PHYSICAL possession,\nit is no longer yours\n, and you have no legal claim or legal recourse to it when it is stolen.\nThis includes BANK ACCOUNTS. Money in a bank is in the possession of the BANK, not you.\nDo you comprehend this? The entire system is utterly devoid of any integrity or genuine security and is breaking down catastophically before our very eyes. You HAVE to comprehend that your money sitting in an account is no longer legally yours. You have to force your brain to process and comprehend this, no matter how incomprehensible it may seem. IT IS OVER. This is Marxist hell. We have arrived.\nThis ruling and precedent will be used by every brokerage, every bank, every insurance company and every pension fund to deny you your money when the financial system finally collapses, be it on Monday, or be it two years from now.\nThis is\nthe Reuters article\nto which she is referring.  The reason the ruling is so disastrous is that it grants all depository institutions ownership of the funds on deposit with it.  While this is a logical continuation of the Bankers First and Foremost policy we’ve been seeing from the federal government since 2008, it is burning down the village and salting the earth upon which it stood in order to save it, because there is now absolutely no sound reason to keep your money in a US bank.\nNow, obviously, no banks are going to be dumb enough to take this ruling and run with it… unless it is a matter of their own survival.  But the fact remains that a bank deposit is now legally considered no different than a gift from you to the bank, and depositors are now entirely dependent upon the bank’s good will to spend its money on their behalf.\nI tend to suspect this ruling will be reversed upon appeal once the Powers That Be realize that saving the personal fortunes of Corzine and other failed bankers isn’t worth the price of destroying the US banking system.  But if not, it should cause the largest banking run the world has ever known.  I say “should” rather than “will”, because as we know, most people are idiots and will probably continue blithely assuming that it doesn’t matter what the fine print and the court rulings say, they’ve got a receipt showing they put their money in the bank, and money in the bank is safe, by definition.\nOn the other hand, I find this ruling particularly intriguing because I have observed that one can anticipate events, to a certain degree, by seeing through which hoops the elite institutions force the federal government to jump.  While they wouldn’t have any reason to take such risks for Corzine and company, it would make a great deal of sense to do so if they are anticipating a U.S. financial collapse in the near-to-middle term.\nFor example, we can safely assume Romney will win the election November on the basis of the Goldman Sachs contributions.\n“Four years ago, employees of New York-based Goldman gave three-fourths of their campaign donations to Democratic candidates and committees, including presidential nominee Barack Obama. This time, they’re showering 70 percent of their contributions on Republicans.”",
  "tags": [
    "banks",
    "MPAI"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-12T10:19:00+00:00"
}