{
  "url": "https://voxday.net/2012/08/17/tia-meme-spreads/",
  "scraped_at": "2025-12-14T05:01:21.901343",
  "title": "TIA: the meme spreads",
  "date_display": "August 17, 2012",
  "date_iso": "2012-08-17T13:00:00+00:00",
  "date_from_url": "2012-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Courtesy of Scott Atran, the argument that religion does not cause war has now reached both <i>Science </i>and <a href=\"http://chronicle.com/article/Does-Religion-Really-Poison/133457/\">T<i>he Chronicle of Higher Education</i></a>:</p><blockquote><p>it’s not the criticism of ecclesiastical overreach that bothers Wilson and Atran; it’s the conflation of science and advocacy. Wilson supports efforts to destigmatize atheism, like the running feature “Why I Am an Atheist” on Pharyngula, and said so in his anti-Dawkins posts. Atran believes that “attacking obscurantic, cruel, lunatic ideas is always a good idea.” It’s proclaiming that religion is rotten to the core that they think is misguided.</p><p>That includes laying the blame for much of human conflict at the feet of the faithful. In a recent Science article, Atran and Jeremy Ginges, an associate professor of psychology at the New School, cite evidence suggesting that “only a small minority of recorded wars” have been mainly motivated by religious disputes (though making distinctions between religious and political causes is notoriously knotty). They complain in the article that the New Atheists are quick to remind everyone how fundamentalism fuels Al Qaeda but neglect to mention the role of churches in the civil-rights movement. The New Atheists are, according to Atran and Ginges, cherry-picking the horrors. “Science produced a nuclear bomb. Therefore we should throw away science,” says Atran, to illustrate the baby-bathwater logic. “Sometimes it can be really noxious, and other times it can be quite helpful.”</p></blockquote><p>The Science article is entitled “Religious and Sacred Imperatives in Human Conflict” and appears in <i>Science </i>336, 855 (2012).  The relevant passage cites <i>The Encylopedia of Wars</i> and states: “In fact, explicit religious issues have motivated only a small minority of recorded wars. There is little religious cause for the internecine Russian and Chinese conflicts and world wars responsible for history’s most lethal century of international conflict.”</p><p>Given the absurd assertions by science fetishists who insist that I do not understand science, I find it more than a little ironic that a number of real scientists are not only making use of my ideas, <i>but my methods as well</i>, in publishing professional peer-reviewed science.</p></div>",
  "content_text": "Courtesy of Scott Atran, the argument that religion does not cause war has now reached both\nScience\nand\nT\nhe Chronicle of Higher Education\n:\nit’s not the criticism of ecclesiastical overreach that bothers Wilson and Atran; it’s the conflation of science and advocacy. Wilson supports efforts to destigmatize atheism, like the running feature “Why I Am an Atheist” on Pharyngula, and said so in his anti-Dawkins posts. Atran believes that “attacking obscurantic, cruel, lunatic ideas is always a good idea.” It’s proclaiming that religion is rotten to the core that they think is misguided.\nThat includes laying the blame for much of human conflict at the feet of the faithful. In a recent Science article, Atran and Jeremy Ginges, an associate professor of psychology at the New School, cite evidence suggesting that “only a small minority of recorded wars” have been mainly motivated by religious disputes (though making distinctions between religious and political causes is notoriously knotty). They complain in the article that the New Atheists are quick to remind everyone how fundamentalism fuels Al Qaeda but neglect to mention the role of churches in the civil-rights movement. The New Atheists are, according to Atran and Ginges, cherry-picking the horrors. “Science produced a nuclear bomb. Therefore we should throw away science,” says Atran, to illustrate the baby-bathwater logic. “Sometimes it can be really noxious, and other times it can be quite helpful.”\nThe Science article is entitled “Religious and Sacred Imperatives in Human Conflict” and appears in\nScience\n336, 855 (2012).  The relevant passage cites\nThe Encylopedia of Wars\nand states: “In fact, explicit religious issues have motivated only a small minority of recorded wars. There is little religious cause for the internecine Russian and Chinese conflicts and world wars responsible for history’s most lethal century of international conflict.”\nGiven the absurd assertions by science fetishists who insist that I do not understand science, I find it more than a little ironic that a number of real scientists are not only making use of my ideas,\nbut my methods as well\n, in publishing professional peer-reviewed science.",
  "tags": [
    "atheism",
    "science",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-17T12:00:00+00:00"
}