{
  "url": "https://voxday.net/2012/08/11/two-ninety-freaking-five/",
  "scraped_at": "2025-12-14T05:00:58.765356",
  "title": "Two Ninety Freaking Five!",
  "date_display": "August 11, 2012",
  "date_iso": "2012-08-11T22:57:00+00:00",
  "date_from_url": "2012-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That would be words.  As in thousands of them.  As I previously mentioned, I didn’t quite make my goal of writing the first draft of a George RR Martin-size novel in 365 days, but I did succeed in doing it in 383 of them.  The fact that I got the final cover from the artist and it is, in a word, <i>seriously awesome</i> – okay, that’s two words, but it totally requires two words – helped me kick it up a gear on the home stretch.  I even finished 12 days ahead of my revised schedule.</p><p>Now, I don’t mean to obsess about the cover or anything, but let’s just say that a) the artist says it is his favorite to date, and, b) as much as I love the Summa cover and was both flabbergasted and appalled when he wanted to go in another direction, it was ABSOLUTELY, DEFINITELY, and WITHOUT QUESTION the right decision to go with the new style.  It’s beautiful and ghastly and epic all at the same time and I very much look forward to letting you all see it in a few months.  I’ll also have a surprise to go along with that announcement, about which I will only say that JartStar has been doing some superlative work.</p><p>No, it’s not a cartoon involving elves and Thomas Aquinas, although that would no doubt be amusing for the seven people who would read it.</p><p>I’m not anywhere nearly done with the book yet, of course.  Now that the base is there, I’ve got to go through it all and make sure that it is at least somewhat readable and coherent.  But that’s the fun part, as far as I am concerned.</p></div>",
  "content_text": "That would be words.  As in thousands of them.  As I previously mentioned, I didn’t quite make my goal of writing the first draft of a George RR Martin-size novel in 365 days, but I did succeed in doing it in 383 of them.  The fact that I got the final cover from the artist and it is, in a word,\nseriously awesome\n– okay, that’s two words, but it totally requires two words – helped me kick it up a gear on the home stretch.  I even finished 12 days ahead of my revised schedule.\nNow, I don’t mean to obsess about the cover or anything, but let’s just say that a) the artist says it is his favorite to date, and, b) as much as I love the Summa cover and was both flabbergasted and appalled when he wanted to go in another direction, it was ABSOLUTELY, DEFINITELY, and WITHOUT QUESTION the right decision to go with the new style.  It’s beautiful and ghastly and epic all at the same time and I very much look forward to letting you all see it in a few months.  I’ll also have a surprise to go along with that announcement, about which I will only say that JartStar has been doing some superlative work.\nNo, it’s not a cartoon involving elves and Thomas Aquinas, although that would no doubt be amusing for the seven people who would read it.\nI’m not anywhere nearly done with the book yet, of course.  Now that the base is there, I’ve got to go through it all and make sure that it is at least somewhat readable and coherent.  But that’s the fun part, as far as I am concerned.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-11T21:57:00+00:00"
}