{
  "url": "https://voxday.net/2012/08/09/why-wachowskis-suck/",
  "scraped_at": "2025-12-14T05:00:47.817724",
  "title": "Why the Wachowskis suck",
  "date_display": "August 9, 2012",
  "date_iso": "2012-08-09T10:28:00+00:00",
  "date_from_url": "2012-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a simple explanation for why the second and third Matrix movies were so bad, and why the Wachowskis haven’t been able to produce a movie that is one-tenth as intriguing as the original <i>The Matrix</i>.  They aren’t genuine storytellers and <i>The Matrix</i> wasn’t their story, <a href=\"http://www.cracked.com/article_19443_7-classic-movies-you-didnt-know-were-rip-offs.html\">they were ripping off a comic book</a> that served as the graphic storyboard for the first movie.</p><blockquote><p>In 1999, The Matrix came out and blew everyone away with its insane action sequences, revolutionary cinematic techniques and, most of all, a mind-fucking plot that left the head of every viewer filled with intense philosophical questions.</p><p>What It’s Suspiciously Like:</p><p><i>The Invisibles</i>, a cult comic book series created by Grant Morrison, is basically about a group of individuals who fight the establishment because the establishment is secretly keeping people dumb and hiding the fact that reality is an illusion. Turns out that the “real world” is ruled by horrifying insect-like demons. One more thing: <i>The Invisibles</i> debuted in 1994….</p><p>The Wachowskis have never acknowledged <i>The Invisibles</i> as an influence, even though they had invited the comic’s creator Grant Morrison to contribute a story for their website. Morrison — who actually liked <i>The Matrix</i> — says he “was told by people on the set that Invisibles books were passed around for visual reference.” His reaction to the second and third movies? “They should have kept on stealing from me.”</p></blockquote><p>The real problem with Hollywood isn’t the lack of creativity among those responsible for making movies.  The real problem is the ridiculous pretensions of those who are technically skilled movie makers to be something that they are not, which is storytellers.  At its root, the inability of the Wachowskis to give proper credit and continue to utilize Grant Morrison’s storytelling abilities is no different than James Cameron stealing from Harlan Ellison or Peter Jackson and Philippa Boyens crapping all over Tolkien with their idiotic dialogue additions and “feminine energy”.  Their pride, narcissism, and incapacity for understanding their limits causes them to produce movies that are much worse than they would be if they would simply focus on their cinematic craft and leave the story construction to the storytellers.</p><p>The issue here isn’t IP legalities, but the intrinsic stupidity of trying to claim an idea that wasn’t yours as your own.  It’s foolish, because everyone is going to realize that the first idea wasn’t yours just as soon as you’re forced to come up with a second idea and it becomes obvious that you’re completely incapable of doing so.</p></div>",
  "content_text": "There is a simple explanation for why the second and third Matrix movies were so bad, and why the Wachowskis haven’t been able to produce a movie that is one-tenth as intriguing as the original\nThe Matrix\n.  They aren’t genuine storytellers and\nThe Matrix\nwasn’t their story,\nthey were ripping off a comic book\nthat served as the graphic storyboard for the first movie.\nIn 1999, The Matrix came out and blew everyone away with its insane action sequences, revolutionary cinematic techniques and, most of all, a mind-fucking plot that left the head of every viewer filled with intense philosophical questions.\nWhat It’s Suspiciously Like:\nThe Invisibles\n, a cult comic book series created by Grant Morrison, is basically about a group of individuals who fight the establishment because the establishment is secretly keeping people dumb and hiding the fact that reality is an illusion. Turns out that the “real world” is ruled by horrifying insect-like demons. One more thing:\nThe Invisibles\ndebuted in 1994….\nThe Wachowskis have never acknowledged\nThe Invisibles\nas an influence, even though they had invited the comic’s creator Grant Morrison to contribute a story for their website. Morrison — who actually liked\nThe Matrix\n— says he “was told by people on the set that Invisibles books were passed around for visual reference.” His reaction to the second and third movies? “They should have kept on stealing from me.”\nThe real problem with Hollywood isn’t the lack of creativity among those responsible for making movies.  The real problem is the ridiculous pretensions of those who are technically skilled movie makers to be something that they are not, which is storytellers.  At its root, the inability of the Wachowskis to give proper credit and continue to utilize Grant Morrison’s storytelling abilities is no different than James Cameron stealing from Harlan Ellison or Peter Jackson and Philippa Boyens crapping all over Tolkien with their idiotic dialogue additions and “feminine energy”.  Their pride, narcissism, and incapacity for understanding their limits causes them to produce movies that are much worse than they would be if they would simply focus on their cinematic craft and leave the story construction to the storytellers.\nThe issue here isn’t IP legalities, but the intrinsic stupidity of trying to claim an idea that wasn’t yours as your own.  It’s foolish, because everyone is going to realize that the first idea wasn’t yours just as soon as you’re forced to come up with a second idea and it becomes obvious that you’re completely incapable of doing so.",
  "tags": [
    "movies",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-09T09:28:00+00:00"
}