{
  "url": "https://voxday.net/2012/08/15/women-ruin-everything-defcon-edition/",
  "scraped_at": "2025-12-14T05:01:12.793495",
  "title": "Women ruin everything: DEFCON edition",
  "date_display": "August 15, 2012",
  "date_iso": "2012-08-15T17:31:00+00:00",
  "date_from_url": "2012-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From atheist conferences to hacker conferences, <a href=\"https://adainitiative.org/2012/08/defcon-why-conference-harassment-matters/\">women are complaining about them</a>:</p><blockquote><p>[E]veryone at DEFCON benefits from more women attending. Women “hackers” – in the creative technologist sense – are everywhere, and many of them are brilliant, interesting, and just plain good company (think Limor Fried, Jeri Ellsworth, and Angela Byron). Companies recruiting for talent get access to the full range of qualified applicants, not just the ones who can put up with a brogrammer atmosphere. We get more and better talks on a wider range of subjects. Conversations are more fun. Conferences and everyone at them loses when amazing women don’t attend.</p><p>When you say, “Women shouldn’t go to DEFCON if they don’t like it,” you are saying that women shouldn’t have all of the opportunities that come with attending DEFCON: jobs, education, networking, book contracts, speaking opportunities – or else should be willing to undergo sexual harassment and assault to get access to them. Is that really what you believe?</p></blockquote><p>Yes.  Absolutely.  The conference should do everything it legally can to dissuade “amazing women” from attending.  Because what this foolish woman, in her obvious ignorance of cause-and-effect, is asserting that the absolute highest priority of the conference should be that women feel comfortable.  The problem is that once that principle is established, the seeds of the conference’s destruction will have been planted, <i>because women will always find a reason to claim they are uncomfortable</i>.  No one at DEFCON would benefit in the long term from more women attending, at least not under that principle, because it only creates more opportunities for women to feel uncomfortable.  Therefore, more female attendees would eventually eviscerate DEFCON as the small core of male attendees who actually make the conference valuable would stop attending as their activities increasingly infringed upon female comfort.  History is very clear on the way women degrade every male institution they successfully invade that they do not succeed in destroying entirely.</p><p>Lest you think I exaggerate, consider the policy statement recommended by one of her commenters: “This conference is for everybody and everybody visiting this conference should feel comfortable, regardless of gender, sexual orientation, disability, physical appearance, body size, race, or religion.”  That’s not a hacker conference policy, that’s one establishing a comfort conference.  The priority defines the purpose.</p><p>And lest you think I exaggerate concerning what might be erroneously dismissed as a slippery slope argument: “These guys can rationalize until they’re blue in the face but IT IS NEVER OKAY TO GIVE A LADY THE HEEBIE JEEBIES!”</p><p>We’re not even 100 years into the great equalitarian experiment and Western civilization is already on the verge of economic and demographic collapse.  This is not a coincidence.  Consider that it only took 79 years for the United Kingdom to go from granting all women over the age of 21 the franchise to voluntarily surrendering its national sovereignty in the Lisbon Treaty.  When the Sports Guy said “the lesson, as always, is this: women ruin everything”, he spoke nothing but the bitter truth.</p></div>",
  "content_text": "From atheist conferences to hacker conferences,\nwomen are complaining about them\n:\n[E]veryone at DEFCON benefits from more women attending. Women “hackers” – in the creative technologist sense – are everywhere, and many of them are brilliant, interesting, and just plain good company (think Limor Fried, Jeri Ellsworth, and Angela Byron). Companies recruiting for talent get access to the full range of qualified applicants, not just the ones who can put up with a brogrammer atmosphere. We get more and better talks on a wider range of subjects. Conversations are more fun. Conferences and everyone at them loses when amazing women don’t attend.\nWhen you say, “Women shouldn’t go to DEFCON if they don’t like it,” you are saying that women shouldn’t have all of the opportunities that come with attending DEFCON: jobs, education, networking, book contracts, speaking opportunities – or else should be willing to undergo sexual harassment and assault to get access to them. Is that really what you believe?\nYes.  Absolutely.  The conference should do everything it legally can to dissuade “amazing women” from attending.  Because what this foolish woman, in her obvious ignorance of cause-and-effect, is asserting that the absolute highest priority of the conference should be that women feel comfortable.  The problem is that once that principle is established, the seeds of the conference’s destruction will have been planted,\nbecause women will always find a reason to claim they are uncomfortable\n.  No one at DEFCON would benefit in the long term from more women attending, at least not under that principle, because it only creates more opportunities for women to feel uncomfortable.  Therefore, more female attendees would eventually eviscerate DEFCON as the small core of male attendees who actually make the conference valuable would stop attending as their activities increasingly infringed upon female comfort.  History is very clear on the way women degrade every male institution they successfully invade that they do not succeed in destroying entirely.\nLest you think I exaggerate, consider the policy statement recommended by one of her commenters: “This conference is for everybody and everybody visiting this conference should feel comfortable, regardless of gender, sexual orientation, disability, physical appearance, body size, race, or religion.”  That’s not a hacker conference policy, that’s one establishing a comfort conference.  The priority defines the purpose.\nAnd lest you think I exaggerate concerning what might be erroneously dismissed as a slippery slope argument: “These guys can rationalize until they’re blue in the face but IT IS NEVER OKAY TO GIVE A LADY THE HEEBIE JEEBIES!”\nWe’re not even 100 years into the great equalitarian experiment and Western civilization is already on the verge of economic and demographic collapse.  This is not a coincidence.  Consider that it only took 79 years for the United Kingdom to go from granting all women over the age of 21 the franchise to voluntarily surrendering its national sovereignty in the Lisbon Treaty.  When the Sports Guy said “the lesson, as always, is this: women ruin everything”, he spoke nothing but the bitter truth.",
  "tags": [
    "technology",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-15T16:31:00+00:00"
}