{
  "url": "https://voxday.net/2012/08/03/wrong-on-trade-wrong-on-money/",
  "scraped_at": "2025-12-14T05:00:22.426079",
  "title": "Wrong on trade, wrong on money",
  "date_display": "August 3, 2012",
  "date_iso": "2012-08-03T10:09:00+00:00",
  "date_from_url": "2012-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gary North isn’t merely a deceitful free trade dogmatist, he’s also off-base <a href=\"http://lewrockwell.com/north/north1180.html\">when it comes to monetary theory</a> too:</p><blockquote><p>John Exter — an old friend of mine — argued in the 1970s and 1980s that monetary deflation has to come, despite FED policy. There will be a collapse of prices through de-leveraging.</p><p>He was wrong. Why? Because it is not possible for depositors to take sufficient money in paper currency notes out of banks and keep these notes out, thereby reversing the fractional reserve process, thereby deflating the money supply. That was what happened in the USA from 1930 to 1933. If hoarders spend the notes, businesses will re-deposit them in their banks. Only if they deal exclusively with other hoarders can they keep money out of banks. But the vast majority of all money transactions are based on digital money, not paper currency.</p><p>Today, large depositors can pull digital money out of bank A, but only by transferring it to bank B. Digits must be in a bank account at all times. There can be no decrease in the money supply for as long as money is digital. Hence, there can be no decrease in prices unless it is FED policy to decrease prices. This was not true, 1930 to 1933.</p><p>Deflationists never respond to this argument by invoking either monetary theory or monetary history. You can and should ignore them until one of them does answer this, and all the others publicly say, “Yes. That’s it! We have waited since 1933 for this argument! I was blind, but now I see! I’m on board! I will sink or swim with this.”</p></blockquote><p>First, North clearly doesn’t know what he’s talking about with regards to money from the Austrian perspective, which is why he is, like Friedman and the monetarists, focused on M1 rather than Z1.  He makes the same mistake that Robert Wenzel made when trying to criticize Karl Denninger and me <a href=\"http://www.milobookclub.com/2011/12/22/explaining-economics-to-epj/\">back in 2011</a>, because he is only considering commodity money and fiat money, and thereby fails to take credit money into account, which, as Mises points out, must be considered in a developed monetary system.</p><p><i>In a developed monetary system, on the other hand, we find commodity money, of which large quantities remain constantly in circulation and are never consumed or used in industry; credit money, whose foundation, the claim to payment, is never made use of; and possibly even fiat money, which has no use at all except as money.</i><br> – The Theory of Money and Credit, p. 103 (1953)</br></p><p>Like the proverbial gorilla reading Nietzsche, Gary North looks at the historical monetary statistics but fails to understand what they mean.  He ludicrously claims “there can be no decrease in prices unless it is FED policy to decrease prices”, an assertion easily disproved by citing the housing market, which has shown a steady decline in home prices since 2006 despite the desperate efforts of the Federal Reserve to prop them up.  More importantly, North doesn’t understand that the reason the broader price declines indicative of deflation have not taken place at any point in the last 70 years is due to the constant growth of outstanding credit over that time, from $355 billion in 1946 to $54.6 trillion in 2012, an amount which absolutely dwarfs the $2.3 trillion in M1 that North erroneously believes to be the controlling factor.</p><p>North is factually incorrect.  The vast majority of all money transactions in the current economy are not based on digital money, they are based on <i>credit money</i>.  Please note that I am once more saying something that North falsely claims has never been said, as I am invoking both monetary theory and monetary history to make the deflationary case.  One may reasonably attempt to argue that it is incorrect, but it is a blatant lie to claim that it has not been made.  I’ve even addressed the obvious delta between M1/M2 and various measures of inflation that tends to cast doubt upon the monetarist position <a href=\"http://www.milobookclub.com/2012/04/04/inflation-and-money-supply/\">in the past</a>.</p><p>The reason that prices didn’t collapse and monetary deflation didn’t occur in the 1970s and 1980s because none of the required deleveraging took place.  Credit money continued to expand throughout, as debt outstanding was $1.6 trillion in 1970 and $12.8 trillion in 1989.  Why are the deflationists likely – not certain – to be correct today when they were wrong before?  Because the long-predicted deleveraging is finally taking place in the two largest credit sectors, Household and Financial.</p><p>Household has been deleveraging since Q3-2008 and is presently down $1 trillion.  Financial has been deleveraging since Q4-2008 and is presently down $3.4 trillion.  The only reason this private deleveraging hasn’t shown up as general deflation is due to the $5.6 trillion increase in Federal leveraging; the Federal government has literally doubled its outstanding debt in four years.</p><p>In addition to ignoring the fact that credit money is a much more important factor than fiat money, be it paper or digital, Gary North clearly doesn’t realize that everyone with any exposure to the economy will sink or swim on the Federal government’s ability to continue substituting its own ability to leverage for private sector deleveraging.  So long as the government can continue to borrow and maintain that ratio, it can stave off deflation.  But unless it can borrow infinitely, it cannot do so forever.</p></div>",
  "content_text": "Gary North isn’t merely a deceitful free trade dogmatist, he’s also off-base\nwhen it comes to monetary theory\ntoo:\nJohn Exter — an old friend of mine — argued in the 1970s and 1980s that monetary deflation has to come, despite FED policy. There will be a collapse of prices through de-leveraging.\nHe was wrong. Why? Because it is not possible for depositors to take sufficient money in paper currency notes out of banks and keep these notes out, thereby reversing the fractional reserve process, thereby deflating the money supply. That was what happened in the USA from 1930 to 1933. If hoarders spend the notes, businesses will re-deposit them in their banks. Only if they deal exclusively with other hoarders can they keep money out of banks. But the vast majority of all money transactions are based on digital money, not paper currency.\nToday, large depositors can pull digital money out of bank A, but only by transferring it to bank B. Digits must be in a bank account at all times. There can be no decrease in the money supply for as long as money is digital. Hence, there can be no decrease in prices unless it is FED policy to decrease prices. This was not true, 1930 to 1933.\nDeflationists never respond to this argument by invoking either monetary theory or monetary history. You can and should ignore them until one of them does answer this, and all the others publicly say, “Yes. That’s it! We have waited since 1933 for this argument! I was blind, but now I see! I’m on board! I will sink or swim with this.”\nFirst, North clearly doesn’t know what he’s talking about with regards to money from the Austrian perspective, which is why he is, like Friedman and the monetarists, focused on M1 rather than Z1.  He makes the same mistake that Robert Wenzel made when trying to criticize Karl Denninger and me\nback in 2011\n, because he is only considering commodity money and fiat money, and thereby fails to take credit money into account, which, as Mises points out, must be considered in a developed monetary system.\nIn a developed monetary system, on the other hand, we find commodity money, of which large quantities remain constantly in circulation and are never consumed or used in industry; credit money, whose foundation, the claim to payment, is never made use of; and possibly even fiat money, which has no use at all except as money.\n– The Theory of Money and Credit, p. 103 (1953)\nLike the proverbial gorilla reading Nietzsche, Gary North looks at the historical monetary statistics but fails to understand what they mean.  He ludicrously claims “there can be no decrease in prices unless it is FED policy to decrease prices”, an assertion easily disproved by citing the housing market, which has shown a steady decline in home prices since 2006 despite the desperate efforts of the Federal Reserve to prop them up.  More importantly, North doesn’t understand that the reason the broader price declines indicative of deflation have not taken place at any point in the last 70 years is due to the constant growth of outstanding credit over that time, from $355 billion in 1946 to $54.6 trillion in 2012, an amount which absolutely dwarfs the $2.3 trillion in M1 that North erroneously believes to be the controlling factor.\nNorth is factually incorrect.  The vast majority of all money transactions in the current economy are not based on digital money, they are based on\ncredit money\n.  Please note that I am once more saying something that North falsely claims has never been said, as I am invoking both monetary theory and monetary history to make the deflationary case.  One may reasonably attempt to argue that it is incorrect, but it is a blatant lie to claim that it has not been made.  I’ve even addressed the obvious delta between M1/M2 and various measures of inflation that tends to cast doubt upon the monetarist position\nin the past\n.\nThe reason that prices didn’t collapse and monetary deflation didn’t occur in the 1970s and 1980s because none of the required deleveraging took place.  Credit money continued to expand throughout, as debt outstanding was $1.6 trillion in 1970 and $12.8 trillion in 1989.  Why are the deflationists likely – not certain – to be correct today when they were wrong before?  Because the long-predicted deleveraging is finally taking place in the two largest credit sectors, Household and Financial.\nHousehold has been deleveraging since Q3-2008 and is presently down $1 trillion.  Financial has been deleveraging since Q4-2008 and is presently down $3.4 trillion.  The only reason this private deleveraging hasn’t shown up as general deflation is due to the $5.6 trillion increase in Federal leveraging; the Federal government has literally doubled its outstanding debt in four years.\nIn addition to ignoring the fact that credit money is a much more important factor than fiat money, be it paper or digital, Gary North clearly doesn’t realize that everyone with any exposure to the economy will sink or swim on the Federal government’s ability to continue substituting its own ability to leverage for private sector deleveraging.  So long as the government can continue to borrow and maintain that ratio, it can stave off deflation.  But unless it can borrow infinitely, it cannot do so forever.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-08-03T09:09:00+00:00"
}