{
  "url": "https://voxday.net/2019/03/12/a-secret-king-in-action/",
  "scraped_at": "2025-12-20T05:33:55.452556",
  "title": "A secret king in action",
  "date_display": "March 12, 2019",
  "date_iso": "2019-03-12T17:27:05+00:00",
  "date_from_url": "2019-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been asked on occasion what I mean by “Secret King wins again!” This example should help demonstrate what I’m talking about. It’s in reference to a question about <a href=\"https://www.youtube.com/watch?v=BkCOd40lgIM\">my recent Darkstream</a> addressing Jordan Peterson’s appearance at the Trilateral Commission:</p><blockquote><p>Badbadnotgood Goodgodnotbad<br>Why didn’t you use the video where someone questioned him about holodomor, a far better example to show his intentional blind spots.﻿</br></p><p>Darkstream<br>Because the point is not to show his unwillingness to address a specific issue, but rather, his inability to intelligently answer a straightforward question even when he is willing to do so.﻿</br></p><p>Badbadnotgood Goodgodnotbad<br>Darkstream ugh caught you out mr Vox…. Your main point of the video was how he intentionally avoids answering questions and reverts to rehearsed dialogue to divert away from the questions topic. Not that he is a useful idiot and doesn’t have the ability to, as you specifically point out his subversive flip flopping of meanings and focusing on the notion of the state rather then the nation. The holodomor video Would have been a perfect example of addressing his true intentions of which you were trying to show with the first.﻿</br></p></blockquote><p>This is a perfect example of why everyone hates gammas, even other gammas. They can’t ever accept an answer to a question, because they never ask an honest question. Every question is simply a trap designed to allow them to show everyone what a Smart Boy they are. If you ever want to know why I simply ignore many questions that are posed to me, well, now you know.</p><p>Notice that almost every other comment testifies to what an effective demonstration the video and the related commentary were. But that’s not good enough for the gamma male, because his way is always the better way, <i>especially </i>when it obviously isn’t. After all, the fact that he’s now banned just proves how threatened I am by his obvious intellectual superiority, right? Secret King wins again!</p><p>On a more positive note, this comment definitely won the thread:</p><blockquote class=\"tr_bq\"><p>Q- Dr. Peterson, how will democracy survive?<br>A- THE INDIVIDUAL IS THE FOUNDATION OF THE COSMOS!</br></p></blockquote><p>I’ll admit it. I laughed.</p></div>",
  "content_text": "I’ve been asked on occasion what I mean by “Secret King wins again!” This example should help demonstrate what I’m talking about. It’s in reference to a question about\nmy recent Darkstream\naddressing Jordan Peterson’s appearance at the Trilateral Commission:\nBadbadnotgood Goodgodnotbad\nWhy didn’t you use the video where someone questioned him about holodomor, a far better example to show his intentional blind spots.﻿\nDarkstream\nBecause the point is not to show his unwillingness to address a specific issue, but rather, his inability to intelligently answer a straightforward question even when he is willing to do so.﻿\nBadbadnotgood Goodgodnotbad\nDarkstream ugh caught you out mr Vox…. Your main point of the video was how he intentionally avoids answering questions and reverts to rehearsed dialogue to divert away from the questions topic. Not that he is a useful idiot and doesn’t have the ability to, as you specifically point out his subversive flip flopping of meanings and focusing on the notion of the state rather then the nation. The holodomor video Would have been a perfect example of addressing his true intentions of which you were trying to show with the first.﻿\nThis is a perfect example of why everyone hates gammas, even other gammas. They can’t ever accept an answer to a question, because they never ask an honest question. Every question is simply a trap designed to allow them to show everyone what a Smart Boy they are. If you ever want to know why I simply ignore many questions that are posed to me, well, now you know.\nNotice that almost every other comment testifies to what an effective demonstration the video and the related commentary were. But that’s not good enough for the gamma male, because his way is always the better way,\nespecially\nwhen it obviously isn’t. After all, the fact that he’s now banned just proves how threatened I am by his obvious intellectual superiority, right? Secret King wins again!\nOn a more positive note, this comment definitely won the thread:\nQ- Dr. Peterson, how will democracy survive?\nA- THE INDIVIDUAL IS THE FOUNDATION OF THE COSMOS!\nI’ll admit it. I laughed.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-12T17:27:05+00:00"
}