{
  "url": "https://voxday.net/2019/03/14/an-infernal-economy-canto-ii/",
  "scraped_at": "2025-12-20T05:34:06.836971",
  "title": "An Infernal Economy, Canto II",
  "date_display": "March 14, 2019",
  "date_iso": "2019-03-14T17:20:19+00:00",
  "date_from_url": "2019-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For those who missed it, <a href=\"http://voxday.blogspot.com/2019/03/an-infernal-economy-canto-i.html\">Canto I</a></p><p><b><i>An Infernal Economy</i></b></p><p>Canto II</p><p>At the peak of a lofty precipice<br>A noisome stench wafted high in the air,<br>And yet my guide commenced to reminisce<br>As if there was no mirksome foulness there.<br>It was ever so at the cycle’s peak,<br>He said with a rueful shake of despair.<br>Greed, whispered words, and an air of mystique<br>Brings the innocent lambs to the slaughter.<br>They hope to catch on to the winning streak,<br>Doomed, from the start, come hell or high water.<br>But justice they’ll have, for here it is found,<br>Payback for each duplicitous fraudster.<br>He showed me a path that led further down,<br>Deeper into that corpse-scented chasm.<br>O Guide, do warn me what we’ll find here bound,<br>What sort of odoriferous phantasm?<br>I know not how I shall hope to bear this,<br>For much I feared an internal spasm<br>Was imminent, given the foul abyss.<br>But I soon forgot my sense of affliction<br>As we looked upon the flowers of Dis.<br>For there was planted without restriction<br>An orchard such as none have ever seen,<br>Nor will see outside of Hell’s jurisdiction.<br>Displayed in a form well beyond obscene<br>The bodies of men, dead, yet living still.<br>Everywhere faces of treacherous mien<br>Staring at us with palpable ill will,<br>Flippers of mortgages, sellers of stocks,<br>Feeders of hedge funds, and then, the great shill.<br>I saw the mastermind, Ponzi’s Fox<br>Buried to his waist in the stinking mire,<br>His skin all covered by a weeping pox.<br>Is that who I think it is, my good sire?<br>Indeed, acceded the wise with grim smile,<br>Be glad we pass when the tide is higher<br>You would not fain see beneath the muck vile<br>Below is where the worms them devour.<br>We walked over stones along the defile,</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Dark was the sky and late was the hour.<br>We passed chasms filled with human debris<br>Hearing screams of those in evil’s power,<br>And still I shed no tear of sympathy<br>Nor did the master once slacken his stride.<br>Who could ever feel any empathy<br>For those accursed with such towering pride<br>Beyond we saw a great red-golden glow<br>Downward we strode and downward did we slide<br>Toward a gleaming pit through which did flow<br>The river of Midas in full advance.<br>Bubbling, boiling, burning and so<br>Scalding the servants of debt and finance<br>That they shrieked, and wept, and shamelessly cried.<br>The archaic current took its vengeance<br>On politicians from every side.<br>A fitting reward I had to admit<br>For the predicament they’d caused worldwide.<br>In silence we walked on past the dread pit<br>Sublime, it was, verily to behold,<br>And a prodigious heat did it emit.<br>Leaving behind that great river of gold<br>Beneath my feet was no more stone but ice.<br>Darkness descended and also the cold,<br>I shivered, and hoped the guide would suffice<br>To ensure we were permitted to pass<br>This Fimbul-winter of devil’s device<br>That Zero Kelvin would hardly surpass.<br/>Then I saw two shades held in ice confined<br/>A frozen embrace thus holding them fast.<br/>Their eyes, tormented, showed madness of mind<br/>And snow on the beard of one could be seen<br/>Their arms were locked and their fates intertwined.<br/>As none could hope to ever intervene.<br/>Freezing though I was, colder my blood ran<br/>Upon realizing that icy scene<br/>Was Ben Bernanke and Alan Greenspan.<br/>Entrapped in cruel bonds of hard liquidity<br/>My guide gestured round with expansive hand<br/>They damned themselves by their cupidity.<br/>Live by the target, then die by the rate,<br/>This is the consequence, naturally.<br/>They sold for credit the soul of the state.<br/>Finance first and foremost was their belief<br/>Thus they encouraged assets to inflate<br/>While withholding from the public relief.<br/>Then we left the maestro and the scholar<br/>In ongoing committee of boundless brief.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Not far now was the king of the dollar<br/>Toward him, my guide urged. If your eyes avail<br/>To espy him, go and see the squalor<br/>Ere the last Trump and the epic fail<br/>Of the king of the kingdom of despair<br/>And out of the ice, at such mighty scale<br/>I saw a giant beyond all compare<br/>His ghastly visages were thricely florid,<br/>Although mayhap they were once passing fair<br/>Afore his constitution fell morbid.<br/>Entrapped was he, by that which held the two,<br/>Central bankers caught on that plain horrid,<br/>Liquid flowed down causing ice to accrue<br/>And held that monster fast about the waist.<br/>Each of his three mouths endeavored to chew<br/>What turned out to be an awful repaste.<br/>Three great sinners now great evil endured.<br/>The first called schoolmaster, now in poor taste,<br/>His legs dangled as his head was tortured.<br/>The second was once a president too,<br/>Twelve long years a thief, his fate was assured.<br/>The third morsel managed to so construe<br/>A crisis as to hold nations hostage,<br/>Arrogance such as the world never knew.<br/>Look well on them, for this is the knowledge,<br/>The fruit of the tree of economy<br/>Which will in the end human action judge.<br/>Man is not born into man’s slavery<br/>Nor may he be ruled, even in defeat,<br/>Through the will of another’s knavery.<br/>Ergo the reliance upon deceit<br/>By those who dare think to control the land,<br/>Theirs is no more than the fatal conceit,<br/>Oft shattered by the invisible hand.</p><p><i>Thus ends the second canto.</i></p></div>",
  "content_text": "For those who missed it,\nCanto I\nAn Infernal Economy\nCanto II\nAt the peak of a lofty precipice\nA noisome stench wafted high in the air,\nAnd yet my guide commenced to reminisce\nAs if there was no mirksome foulness there.\nIt was ever so at the cycle’s peak,\nHe said with a rueful shake of despair.\nGreed, whispered words, and an air of mystique\nBrings the innocent lambs to the slaughter.\nThey hope to catch on to the winning streak,\nDoomed, from the start, come hell or high water.\nBut justice they’ll have, for here it is found,\nPayback for each duplicitous fraudster.\nHe showed me a path that led further down,\nDeeper into that corpse-scented chasm.\nO Guide, do warn me what we’ll find here bound,\nWhat sort of odoriferous phantasm?\nI know not how I shall hope to bear this,\nFor much I feared an internal spasm\nWas imminent, given the foul abyss.\nBut I soon forgot my sense of affliction\nAs we looked upon the flowers of Dis.\nFor there was planted without restriction\nAn orchard such as none have ever seen,\nNor will see outside of Hell’s jurisdiction.\nDisplayed in a form well beyond obscene\nThe bodies of men, dead, yet living still.\nEverywhere faces of treacherous mien\nStaring at us with palpable ill will,\nFlippers of mortgages, sellers of stocks,\nFeeders of hedge funds, and then, the great shill.\nI saw the mastermind, Ponzi’s Fox\nBuried to his waist in the stinking mire,\nHis skin all covered by a weeping pox.\nIs that who I think it is, my good sire?\nIndeed, acceded the wise with grim smile,\nBe glad we pass when the tide is higher\nYou would not fain see beneath the muck vile\nBelow is where the worms them devour.\nWe walked over stones along the defile,\nDark was the sky and late was the hour.\nWe passed chasms filled with human debris\nHearing screams of those in evil’s power,\nAnd still I shed no tear of sympathy\nNor did the master once slacken his stride.\nWho could ever feel any empathy\nFor those accursed with such towering pride\nBeyond we saw a great red-golden glow\nDownward we strode and downward did we slide\nToward a gleaming pit through which did flow\nThe river of Midas in full advance.\nBubbling, boiling, burning and so\nScalding the servants of debt and finance\nThat they shrieked, and wept, and shamelessly cried.\nThe archaic current took its vengeance\nOn politicians from every side.\nA fitting reward I had to admit\nFor the predicament they’d caused worldwide.\nIn silence we walked on past the dread pit\nSublime, it was, verily to behold,\nAnd a prodigious heat did it emit.\nLeaving behind that great river of gold\nBeneath my feet was no more stone but ice.\nDarkness descended and also the cold,\nI shivered, and hoped the guide would suffice\nTo ensure we were permitted to pass\nThis Fimbul-winter of devil’s device\nThat Zero Kelvin would hardly surpass.\nThen I saw two shades held in ice confined\nA frozen embrace thus holding them fast.\nTheir eyes, tormented, showed madness of mind\nAnd snow on the beard of one could be seen\nTheir arms were locked and their fates intertwined.\nAs none could hope to ever intervene.\nFreezing though I was, colder my blood ran\nUpon realizing that icy scene\nWas Ben Bernanke and Alan Greenspan.\nEntrapped in cruel bonds of hard liquidity\nMy guide gestured round with expansive hand\nThey damned themselves by their cupidity.\nLive by the target, then die by the rate,\nThis is the consequence, naturally.\nThey sold for credit the soul of the state.\nFinance first and foremost was their belief\nThus they encouraged assets to inflate\nWhile withholding from the public relief.\nThen we left the maestro and the scholar\nIn ongoing committee of boundless brief.\nNot far now was the king of the dollar\nToward him, my guide urged. If your eyes avail\nTo espy him, go and see the squalor\nEre the last Trump and the epic fail\nOf the king of the kingdom of despair\nAnd out of the ice, at such mighty scale\nI saw a giant beyond all compare\nHis ghastly visages were thricely florid,\nAlthough mayhap they were once passing fair\nAfore his constitution fell morbid.\nEntrapped was he, by that which held the two,\nCentral bankers caught on that plain horrid,\nLiquid flowed down causing ice to accrue\nAnd held that monster fast about the waist.\nEach of his three mouths endeavored to chew\nWhat turned out to be an awful repaste.\nThree great sinners now great evil endured.\nThe first called schoolmaster, now in poor taste,\nHis legs dangled as his head was tortured.\nThe second was once a president too,\nTwelve long years a thief, his fate was assured.\nThe third morsel managed to so construe\nA crisis as to hold nations hostage,\nArrogance such as the world never knew.\nLook well on them, for this is the knowledge,\nThe fruit of the tree of economy\nWhich will in the end human action judge.\nMan is not born into man’s slavery\nNor may he be ruled, even in defeat,\nThrough the will of another’s knavery.\nErgo the reliance upon deceit\nBy those who dare think to control the land,\nTheirs is no more than the fatal conceit,\nOft shattered by the invisible hand.\nThus ends the second canto.",
  "tags": [
    "doggerel"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-14T17:20:19+00:00"
}