{
  "url": "https://voxday.net/2019/03/13/an-infernal-economy-canto-i/",
  "scraped_at": "2025-12-20T05:34:02.045534",
  "title": "An Infernal Economy, Canto I",
  "date_display": "March 13, 2019",
  "date_iso": "2019-03-13T15:32:55+00:00",
  "date_from_url": "2019-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After seeing the Big Bear <a href=\"https://www.youtube.com/watch?v=ryxUuh-mM9g\">on his Dante kick</a>, it occurred to me that very few of the new readers of the last 10 years would be familiar with my own little foray into terza rima, which was originally published in the appendix of <i>The Return of the Great Depression</i>.</p><p><b><i>An Infernal Economy</i></b></p><p>Canto I</p><p>In a dark woodland I espied a bear<br>Vicious, hirsute, with a low, evil brow.<br>His stinking breath befouled the woodland air;<br>A roar, and animal spirits somehow<br>Vanished, like ghosts dissipating in mist,<br>Taking with them fully half from the Dow.<br>I knew not how I should hope to resist<br>This great beast, when before me then appeared<br>A genius, albeit one much dismissed,<br>For espousing truths both exact and feared<br>By men parsimonious in wisdom.<br>“No man, yet I act,” said him I revered,<br>“To spare thee much needless pain have I come!”<br>Then he raised a gleaming sword of pure gold<br>Before which the terrible beast did succumb<br>And turn away. Thus inspired I made bold<br>To inquire of insights he might convey.<br>“No, I shall not teach, instead shall I scold.<br>Come, thou shalt witness how ends the soiree!”<br>We found ourselves before a wide Abyss<br>From which came moans and cries of great dismay,<br>The regrets of men who’d been so remiss<br>As to believe markets will always rise.<br>“Speak, damned broker,” I said with a hiss,<br>To a wretched shade with dark, haunted eyes,<br>All naked but for his well-tattered suit.<br>“Every long-term chart showed we were wise.”<br>He protested, his contrition acute.<br>“Dollar-cost averaging, interest compound,<br>We thought they invested risk free, absolute!”<br>My Guide laughed, it was a cold, hollow sound<br>Of scorn for innocence so misplaced.<br>“That which goes up must finally come down,<br>And asset inflation will be retraced.<br>For growth cannot last indefinitely<br>When debt is rising and money debased.”<br>Behind us we left that sad misery,<br>Weeping and wailing under the cliff’s edge,<br>Descending down to the second degree.<br>There we encountered the god of the pledge,<br>Visa, the Master of living and dead.<br>Who sneered at my Guide: “From whence didst thou dredge<br>This old fossil, academic unread<br>By my countless servants, my serfs, my slaves?<br>He shall not enter, but for thee, instead<br>I’ll offer a card that actually saves<br>Thee five percent even as thou doth spend!”<br>Temptation rushed o’er me, enticing waves,<br>Cast by the fat goblin off’ring to lend<br>Me all that I wanted, and more beside!<br>“Stand fast, man, and do not think thou shalt bend!”<br>So spoke my Guardian, the consummate Guide,<br>Who, bare-handed, tore that false god in half!<br>“His day is done, comest thou alongside.<br>Seest the shades blown like wheat amidst chaff?”<br>Throughout the depths blew a most fearsome wind<br>Hurling poor souls around, all the riff-raff<br>In mighty numbers, those fools who had sinned,<br>Caught up in the feverish gluttony<br>Of consumption, and now, too late, chagrined.<br>They tumbled through clouds of fiat money,<br>Faith rendered faithless in one mad moment,<br>Then came a pair still in matrimony<br>Bound. They shrieked and fought for they did resent<br>The ties that held them linked close together<br>In bitter rage and mutual dissent.<br/>The woman cried, clawing at her tether.<br/>Impoverished, angry, seeking divorce,<br/>And falling for the netherest nether<br/>They plunged to the depths like a Russian bourse.<br/>“New house, new clothes, new car financed with debt<br/>They married for better, but found the worst,”<br/>Said the Master without sounding upset.<br/>“So now, they can’t even pay for a split!”<br/>Such countless horrors no one could forget,<br/>Happily did I that fell mirk acquit.<br/>But new torments I saw, new terrors. I found<br/>Myself standing in the midst of a pit,<br/>Where an icy rain came tumbling down<br/>Upon the unjust, and the unjust alone,<br/>For there the just in their absence abound.<br/>Suffering journalists wept to atone<br/>For lying deceits practiced on the crowd.<br/>While above towered three heads overgrown<br/>From one horrid shape better disavowed,<br/>Kudlow and Cramer and Bartiromo.<br/>Three slavering heads drooled and barked aloud:<br/>“Buy with both hands, this is doubtless the low!”<br/>All the while snapping and snarfing up dirt.<br/>Souls sold for nothing, not even a show,<br/>No newspaperman had so much as a shirt<br/>As hatless, shoeless, they froze in the rain,<br/>Lamenting the truth they’d tried to pervert.<br/>Shivering, I asked to depart this plane<br/>A request to which my Guide acceded.<br/>Thus we abandoned the media’s bane,<br/>The encroaching ice quickly receded.<br/>Before us there stood rows of mighty stones<br/>And behind each a small man proceeded<br/>To push it back and forth, with moans and groans,<br/>Across the dismal field of outsized dreams.<br/>“Economists,” I heard the amused tones<br/>Of the Guide, “and duly damned for their schemes<br/>That served as the key to open the door<br/>For terrible tax-and-spending regimes.”<br/>I spared but a brief sigh for Nobel’s whore<br/>As we fell to a field of sepulchers<br/>Uncovered and belching forth with a roar<br/>Crimson flames that seared those entrepreneurs<br/>Of finance, gamblers, investment bankers<br/>Who played games with exotic wire transfers.<br/>Those who had been for their banks anchors<br/>Howled in unending agony, the fire<br/>Fueled by derivatives, lethal cankers<br/>Of financial cunning that now require<br/>Unthinkable time to fully unwind.<br/>Until then, each screams in his stone pyre.<br/>No more could I bear, horror smote my mind,<br/>I reeled before sights I could not forget.<br/>And then my adviser did me remind<br/>We’d yet to meet the political set.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "After seeing the Big Bear\non his Dante kick\n, it occurred to me that very few of the new readers of the last 10 years would be familiar with my own little foray into terza rima, which was originally published in the appendix of\nThe Return of the Great Depression\n.\nAn Infernal Economy\nCanto I\nIn a dark woodland I espied a bear\nVicious, hirsute, with a low, evil brow.\nHis stinking breath befouled the woodland air;\nA roar, and animal spirits somehow\nVanished, like ghosts dissipating in mist,\nTaking with them fully half from the Dow.\nI knew not how I should hope to resist\nThis great beast, when before me then appeared\nA genius, albeit one much dismissed,\nFor espousing truths both exact and feared\nBy men parsimonious in wisdom.\n“No man, yet I act,” said him I revered,\n“To spare thee much needless pain have I come!”\nThen he raised a gleaming sword of pure gold\nBefore which the terrible beast did succumb\nAnd turn away. Thus inspired I made bold\nTo inquire of insights he might convey.\n“No, I shall not teach, instead shall I scold.\nCome, thou shalt witness how ends the soiree!”\nWe found ourselves before a wide Abyss\nFrom which came moans and cries of great dismay,\nThe regrets of men who’d been so remiss\nAs to believe markets will always rise.\n“Speak, damned broker,” I said with a hiss,\nTo a wretched shade with dark, haunted eyes,\nAll naked but for his well-tattered suit.\n“Every long-term chart showed we were wise.”\nHe protested, his contrition acute.\n“Dollar-cost averaging, interest compound,\nWe thought they invested risk free, absolute!”\nMy Guide laughed, it was a cold, hollow sound\nOf scorn for innocence so misplaced.\n“That which goes up must finally come down,\nAnd asset inflation will be retraced.\nFor growth cannot last indefinitely\nWhen debt is rising and money debased.”\nBehind us we left that sad misery,\nWeeping and wailing under the cliff’s edge,\nDescending down to the second degree.\nThere we encountered the god of the pledge,\nVisa, the Master of living and dead.\nWho sneered at my Guide: “From whence didst thou dredge\nThis old fossil, academic unread\nBy my countless servants, my serfs, my slaves?\nHe shall not enter, but for thee, instead\nI’ll offer a card that actually saves\nThee five percent even as thou doth spend!”\nTemptation rushed o’er me, enticing waves,\nCast by the fat goblin off’ring to lend\nMe all that I wanted, and more beside!\n“Stand fast, man, and do not think thou shalt bend!”\nSo spoke my Guardian, the consummate Guide,\nWho, bare-handed, tore that false god in half!\n“His day is done, comest thou alongside.\nSeest the shades blown like wheat amidst chaff?”\nThroughout the depths blew a most fearsome wind\nHurling poor souls around, all the riff-raff\nIn mighty numbers, those fools who had sinned,\nCaught up in the feverish gluttony\nOf consumption, and now, too late, chagrined.\nThey tumbled through clouds of fiat money,\nFaith rendered faithless in one mad moment,\nThen came a pair still in matrimony\nBound. They shrieked and fought for they did resent\nThe ties that held them linked close together\nIn bitter rage and mutual dissent.\nThe woman cried, clawing at her tether.\nImpoverished, angry, seeking divorce,\nAnd falling for the netherest nether\nThey plunged to the depths like a Russian bourse.\n“New house, new clothes, new car financed with debt\nThey married for better, but found the worst,”\nSaid the Master without sounding upset.\n“So now, they can’t even pay for a split!”\nSuch countless horrors no one could forget,\nHappily did I that fell mirk acquit.\nBut new torments I saw, new terrors. I found\nMyself standing in the midst of a pit,\nWhere an icy rain came tumbling down\nUpon the unjust, and the unjust alone,\nFor there the just in their absence abound.\nSuffering journalists wept to atone\nFor lying deceits practiced on the crowd.\nWhile above towered three heads overgrown\nFrom one horrid shape better disavowed,\nKudlow and Cramer and Bartiromo.\nThree slavering heads drooled and barked aloud:\n“Buy with both hands, this is doubtless the low!”\nAll the while snapping and snarfing up dirt.\nSouls sold for nothing, not even a show,\nNo newspaperman had so much as a shirt\nAs hatless, shoeless, they froze in the rain,\nLamenting the truth they’d tried to pervert.\nShivering, I asked to depart this plane\nA request to which my Guide acceded.\nThus we abandoned the media’s bane,\nThe encroaching ice quickly receded.\nBefore us there stood rows of mighty stones\nAnd behind each a small man proceeded\nTo push it back and forth, with moans and groans,\nAcross the dismal field of outsized dreams.\n“Economists,” I heard the amused tones\nOf the Guide, “and duly damned for their schemes\nThat served as the key to open the door\nFor terrible tax-and-spending regimes.”\nI spared but a brief sigh for Nobel’s whore\nAs we fell to a field of sepulchers\nUncovered and belching forth with a roar\nCrimson flames that seared those entrepreneurs\nOf finance, gamblers, investment bankers\nWho played games with exotic wire transfers.\nThose who had been for their banks anchors\nHowled in unending agony, the fire\nFueled by derivatives, lethal cankers\nOf financial cunning that now require\nUnthinkable time to fully unwind.\nUntil then, each screams in his stone pyre.\nNo more could I bear, horror smote my mind,\nI reeled before sights I could not forget.\nAnd then my adviser did me remind\nWe’d yet to meet the political set.",
  "tags": [
    "doggerel"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-13T15:32:55+00:00"
}