{
  "url": "https://voxday.net/2019/03/29/context-and-comprehension/",
  "scraped_at": "2025-12-20T05:35:56.872790",
  "title": "Context and comprehension",
  "date_display": "March 29, 2019",
  "date_iso": "2019-03-29T13:28:30+00:00",
  "date_from_url": "2019-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s true, Jordan Peterson’s defenders only have <a href=\"https://www.reddit.com/r/enoughpetersonspam/comments/b6m78k/literally_every_conversation_with_a_lobster_ever/\">two defenses for their hapless hero</a>. The first is “you don’t understand him.” Because obviously only losers who believe they have benefited from being told to clean their room can understand the deep brilliance of the man. The second is “you’re taking him out of context,” which is amusing in light of Jordan Peterson’s own difficulties in that regard:</p><blockquote><p>Whenever I hear it I can only remember that one video where Jordan Peterson sat on a couch with two professors and discussed how a womens studies book was insane. They got the quote wrong ( from memory to be fair), they got the point wrong, and none of them even understood the point being made. They didn’t disagree with it – they didn’t even understand it. It was one small quote but they are supposed to be knowledgeable about the subject since they believe it’s destroying the world.</p><p>Jordan Peterson who fixates on debate as a kind of masculine battle where the loser is dominated could not wrap his head around a womens studies book saying the exact same thing. It was a quote about how debate as a means of ascertaining “truth” in a social setting was a historically masculine and black female communities used co-operative methods I think. Jordan Peterson who fixates on redefining truth in a social history instead went on a rant how about the book was actually saying “facts and logic are white oppression!” and then all three sniffed each others farts about how the subject was insane. I’ve never studied it but after research I understood what they were saying even if I didn’t agree with their solutions.</p><p>Peterson is a man who does not read the people he criticises. He is a person who struggles to understand the people he criticises as the creators of the next holocaust when they’re discussing similar topics. He doesn’t read context, he doesn’t read, and he demonstrated it regularly.</p><p>But everyone else has to listen to his fanfiction of history and religion for hours to understand him.</p></blockquote><p>The more you hear Peterson babble about anything that isn’t himself, the more it becomes apparent that he’s simply not very intelligent or very well-read.</p></div>",
  "content_text": "It’s true, Jordan Peterson’s defenders only have\ntwo defenses for their hapless hero\n. The first is “you don’t understand him.” Because obviously only losers who believe they have benefited from being told to clean their room can understand the deep brilliance of the man. The second is “you’re taking him out of context,” which is amusing in light of Jordan Peterson’s own difficulties in that regard:\nWhenever I hear it I can only remember that one video where Jordan Peterson sat on a couch with two professors and discussed how a womens studies book was insane. They got the quote wrong ( from memory to be fair), they got the point wrong, and none of them even understood the point being made. They didn’t disagree with it – they didn’t even understand it. It was one small quote but they are supposed to be knowledgeable about the subject since they believe it’s destroying the world.\nJordan Peterson who fixates on debate as a kind of masculine battle where the loser is dominated could not wrap his head around a womens studies book saying the exact same thing. It was a quote about how debate as a means of ascertaining “truth” in a social setting was a historically masculine and black female communities used co-operative methods I think. Jordan Peterson who fixates on redefining truth in a social history instead went on a rant how about the book was actually saying “facts and logic are white oppression!” and then all three sniffed each others farts about how the subject was insane. I’ve never studied it but after research I understood what they were saying even if I didn’t agree with their solutions.\nPeterson is a man who does not read the people he criticises. He is a person who struggles to understand the people he criticises as the creators of the next holocaust when they’re discussing similar topics. He doesn’t read context, he doesn’t read, and he demonstrated it regularly.\nBut everyone else has to listen to his fanfiction of history and religion for hours to understand him.\nThe more you hear Peterson babble about anything that isn’t himself, the more it becomes apparent that he’s simply not very intelligent or very well-read.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-29T13:28:30+00:00"
}