{
  "url": "https://voxday.net/2019/03/07/forget-the-past/",
  "scraped_at": "2025-12-20T05:33:12.739304",
  "title": "“Forget the past”",
  "date_display": "March 7, 2019",
  "date_iso": "2019-03-07T16:00:00+00:00",
  "date_from_url": "2019-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Read this if you are still under the impression that Disney gives even a fraction of a quantum of a damn about pr<a href=\"https://boundingintocomics.com/2019/03/06/mark-hamill-once-again-criticizes-luke-skywalkers-portrayal-in-star-wars-the-last-jedi/\">eserving the intellectual properties</a> that it has acquired:</p><blockquote><p>Mark came back for three movies, and not just cameo appearances. He calls his role in Episode VII the beginning of Episode VIII. He dies in <i>The Last Jedi</i>, but he is in reportedly in Episode IX as a Force Ghost. Mark feels Luke’s death should have happened in the last movie of this series.</p><p><i>“Then the second thing was that they killed me off. I thought: oh, okay, you should push my death off to the last one. That’s what I was hoping when I came back: no cameos and a run-of-the-trilogy contract. Did I get any of those things? Because as far as I’m concerned, the end of VII is really the beginning of VIII. I got one movie! They totally hornswoggled me.”</i></p><p>Hamill would also discuss how Johnson directed him to ignore C-3PO and just walk right past him for one scene:</p><p><i>They had me walking by 3PO, not even acknowledging him. I said: “I can’t do that! He (The Last Jedi’s director, Rian Johnson) said, “Okay, go over and do whatever.” So I went over, and I did whatever. They say it in the script: “Forget the past, kill it if you have to”, and they’re doing a pretty good job!’</i></p><p>The statement really sticks with me the most and may be the most telling to fans. Mark seemed genuinely upset with the lack of acknowledgment to the stories that took place before.</p><p>He specifically discusses the scene where he’s instructed to ignore C-3PO. The writing is reminiscent of when Chewie and Leia ignore each other in <i>The Force Awakens</i>. The action seems out of character for heroes that went through so much together. Mark was able to fix his scene. However, it was the underlying tone of dismissal by the director that upset so many fans.</p></blockquote><p>That “underlying tone of dismissal” says it all. The evil little men who run Disney hate Western civilization and everything about it. They hate heroes, they hate nobility, they hate self-restraint, and they hate the very philosophical mode of thinking the West inherited from the ancient Greeks. They are not only willing to destroy the cultural icons you love, they downright <i>revel </i>in doing so. You cannot understand what they are doing unless you grasp that. And once you understand them, you can anticipate what they are going to do next.</p><p>Which is why I expect they will not even hesitate to destroy Marvel in the same way they have destroyed Star Wars.</p></div>",
  "content_text": "Read this if you are still under the impression that Disney gives even a fraction of a quantum of a damn about pr\neserving the intellectual properties\nthat it has acquired:\nMark came back for three movies, and not just cameo appearances. He calls his role in Episode VII the beginning of Episode VIII. He dies in\nThe Last Jedi\n, but he is in reportedly in Episode IX as a Force Ghost. Mark feels Luke’s death should have happened in the last movie of this series.\n“Then the second thing was that they killed me off. I thought: oh, okay, you should push my death off to the last one. That’s what I was hoping when I came back: no cameos and a run-of-the-trilogy contract. Did I get any of those things? Because as far as I’m concerned, the end of VII is really the beginning of VIII. I got one movie! They totally hornswoggled me.”\nHamill would also discuss how Johnson directed him to ignore C-3PO and just walk right past him for one scene:\nThey had me walking by 3PO, not even acknowledging him. I said: “I can’t do that! He (The Last Jedi’s director, Rian Johnson) said, “Okay, go over and do whatever.” So I went over, and I did whatever. They say it in the script: “Forget the past, kill it if you have to”, and they’re doing a pretty good job!’\nThe statement really sticks with me the most and may be the most telling to fans. Mark seemed genuinely upset with the lack of acknowledgment to the stories that took place before.\nHe specifically discusses the scene where he’s instructed to ignore C-3PO. The writing is reminiscent of when Chewie and Leia ignore each other in\nThe Force Awakens\n. The action seems out of character for heroes that went through so much together. Mark was able to fix his scene. However, it was the underlying tone of dismissal by the director that upset so many fans.\nThat “underlying tone of dismissal” says it all. The evil little men who run Disney hate Western civilization and everything about it. They hate heroes, they hate nobility, they hate self-restraint, and they hate the very philosophical mode of thinking the West inherited from the ancient Greeks. They are not only willing to destroy the cultural icons you love, they downright\nrevel\nin doing so. You cannot understand what they are doing unless you grasp that. And once you understand them, you can anticipate what they are going to do next.\nWhich is why I expect they will not even hesitate to destroy Marvel in the same way they have destroyed Star Wars.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-07T16:00:00+00:00"
}