{
  "url": "https://voxday.net/2019/03/21/how-gammas-handle-rejection/",
  "scraped_at": "2025-12-20T05:34:59.926068",
  "title": "How Gammas handle rejection",
  "date_display": "March 21, 2019",
  "date_iso": "2019-03-21T02:12:00+00:00",
  "date_from_url": "2019-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Jordan B. Peterson provides an excellent demonstration of how a gamma male handles being rejected. It’s hilarious, because he clearly believed he was now beyond experiencing any more of that, having become Rich and Famous. This is a classic Gamma response we know as the Wall of Text.</i><br><i><br/></i><b><a href=\"https://www.jordanbpeterson.com/blog-posts/cambridge-university-rescinds-my-fellowship/\">Cambridge University Rescinds My Fellowship</a></b></br></p><p>From @CamDivinity, this morning (Wed, Mar 20, 2019): <i>“Jordan Peterson requested a visiting fellowship at the Faculty of Divinity, and an initial offer has been rescinded after a further review.”</i></p><p>I visited Cambridge University in November of last year, during my 12 Rules for Life Book tour, one stop of which was the city of Cambridge, where I spoke publicly at the venerable Cambridge Corn Exchange. While there, I had lunch and dinner and various scheduled conversations with a good number of faculty members and other interested individuals who came in for the occasion, and we took the opportunity to speak with a welcome frankness about theological, philosophical and psychological matters. I also recorded twoYouTube videos/podcasts: one with the eminent philosopher Sir Roger Scruton, presented by The Cambridge Center for the Study of Platonism, and another with Dr. Stephen Blackwood, founding President of Ralston College, a university in Savannah, Georgia, preparing for launch.</p><p>I was also invited to address the student-run Cambridge Union, the oldest continuously running debating society in the world – a talk which was delivered to a packed house (a relatively rare occurrence) and which, despite being posted only four months ago, is now the second-most watched of their 200 total videos. I’m mentioning this for a very particular purpose: CUSU, the Cambridge University Student Union (not to be confused with the aforementioned Cambridge Union), pinned to their Twitter account the rescindment announcement three minutes before (!) the Faculty of Divinity did so, and in a spirit of apparent “relief.” The Guardian cited the following CUSU statement:</p><p>We are relieved to hear that Jordan Peterson’s request for a visiting fellowship to Cambridge’s faculty of divinity has been rescinded following further review. It is a political act to associate the University with an academic’s work through offers which legitimise figures such as Peterson. His work and views are not representative of the student body and as such we do not see his visit as a valuable contribution to the University, but one that works in opposition to the principles of the University.</p><p>It seems to me that the packed Cambridge Union auditorium, the intelligent questioning associated with the lecture, and the overwhelming number of views the subsequently posted video accrued, indicates that there a number of Cambridge students are very interested in what I have to say, and might well regard my visit “as a valuable contribution to the University.” I also have to say, as a university professor concerned with literacy, that the CUSU statement offered to The Guardian borders on the unintelligible, perhaps even crossing the line (as so much ideological-puppet-babble tends to): what in the world does it mean that “it is a political act to associate the University with an academic’s work through offers which legitimise figures such as Peterson”? And who could write or say something of that rhetorical nature without a deep sense of betraying their personal conscience?</p><p>In any case: In November, when I was in Cambridge, I began discussions with one of the faculty members (whom I had met briefly before, in London) about the possibility of entering into a collaboration with the Cambridge Divinity Faculty. I enjoyed the conversations I had at Cambridge immensely. I learned a lot about Biblical matters that had remained unknown to me in a very short time. This was of particular relevance to me, but also perhaps of more broad and public import, because of a series of lectures on the Biblical stories of Genesis I prepared, delivered live (at the Isabel Bader Theatre in Toronto) and then posted on YouTube (playlist here) and in podcast form.</p><p>Since their posting, beginning in May of 2017, these lectures have received about 10 million hits (as well as an equal or greater number of downloads). The first lecture alone, on the first sentence of Genesis, has, alone, garnered 3.7 million of those, which makes it the most well-received of all the talks I have ever posted online. I have received correspondence in great volume from religious people all over the world, Jews, Christians, Buddhists and Muslims alike—and an equally large number from atheists—all telling me that my psychological take on the Genesis material resonated very strongly with their faith, or that it helped them understand for the first time the value of these stories. You can see this for yourself by reading the comments on the YouTube channel, which are remarkably civilized and positive, by modern social media standards. I don’t think there is another modern religious/psychological phenomenon or happening that is genuinely comparable. It’s also the case that my books, 12 Rules for Life and Maps of Meaning both rely heavily on Judeo-Christian thinking, and are predicated on the idea that the stories that make up such thought constitute the bedrock of our civil, peaceful and productive society. The former has now sold 3 million copies (one million in tongues other than English), and will be translated into 50 languages; the latter, a much older book, was recently a New York Times bestseller in audio format. This volume of interest is clear indication of the widespread cross-cultural appeal of the work that I am doing.</p><p>In the fall, I am planning to produce a series of lectures on the Exodus stories. I presume they will have equal drawing power. I thought that I could extend my knowledge of the relevant stories by spending time in Cambridge, and that doing so would be useful for me, for faculty members who might be interested in speaking with me, and to the students. I also regarded it as a privilege and an opportunity. I believed (and still believe) that collaborating with the Faculty of Divinity on such a project would constitute an opportunity of clear mutual benefit. Finally, I thought that making myself more knowledgeable about relevant Biblical matters by working with the experts there would be of substantive benefit to the public audience who would eventually receive the resultant lectures.</p><p>Now the Divinity school has decided that signaling their solidarity with the diversity-inclusivity-equity mob trumps that opportunity–or so I presume. You see, I don’t yet know, because (and this is particularly appalling) I was not formally notified of this decision by any representative of the Divinity school. I heard about the rescinded offer through the grapevine, via a colleague and friend, and gathered what I could about the reasons from social media and press coverage (assuming that CUSU has at least something to do with it).</p><p>I would also like to point out something else. As I already noted, the Divinity Faculty (@CamDivinity) tweeted their decision to rescind, consciously making this a public issue. This is inexcusable, in my estimation, given (1) that they did not equally publicize the initial agreement/invitation (which has to be considered an event of equal import) and (2) that they implied that I came cap-in-hand to the school for the fellowship. This is precisely  the kind of half-truth particularly characteristic of those who deeply practice to deceive, as the fellowship offer was a consequence of mutual discussion between those who invited me to Cambridge in July and my subsequent formal request, and not something I had dreamed up on my own.</p><p>It’s not going to make much difference to my future, in some sense. I have more opportunities at the moment than I can keep track of, let alone (let’s say) capitalize on. It’s a complex and surreally fortunate position to occupy, and I’m not taking it for granted, but it happens to be true. In the fall, therefore, I will produce the lectures I plan to produce on Exodus, regardless of whether they occur in the UK or in Canada or elsewhere, and they will attract whatever audience remains interested. But I think that it is deeply unfortunate that the authorities at the Divinity school in Cambridge decided that kowtowing to an ill-informed, ignorant and ideologically-addled mob trumped participating in an extensive online experiment in mass Christian and psychological education. Given the continued decline of church attendance, the rise in atheistic or agnostic sentiment, the increasing irrelevance of theological education and the collapse in interest in such matters among young people, wiser and more profound decisions might have been made.</p><p>You see, it matters whether people around the world understand these ancient stories. It deeply matters. We are becoming unmoored, because we no longer share the structure these stories undergird. This is psychologically destabilizing. It’s producing a pathological and desperate nihilism that is increasingly common and, at the same time, a pronounced proclivity for the ideological certainty that mimics but cannot replace true religious belief. Both consequences are bound to be, as the evidence certainly indicates, divisive and truly dangerous.</p><p>I think the Faculty of Divinity made a serious error of judgement in rescinding their offer to me (and I’m speaking about those unnamed persons who made that specific decision). I think they handled publicizing the rescindment in a manner that could hardly have been more narcissistic, self-congratulatory and devious.</p><p>I believe that the parties in question don’t give a damn about the perilous decline of Christianity, and I presume in any case that they regard that faith, in their propaganda-addled souls, as the ultimate manifestation of the oppressive Western patriarchy, despite their hypothetical allegiance to their own discipline.</p><p>I think that it is no bloody wonder that the faith is declining (and with it, the values of the West, as it fragments) with cowards and mountebanks of the sort who manifested themselves today at the helm.</p><p>I wish them the continued decline in relevance over the next few decades that they deeply and profoundly and diligently work toward and deserve.</p><p>P.S. I also find it interesting and deeply revealing that I know the names of the people who invited me, both informally and formally, but the names of the people who have disinvited me remain shrouded in exactly the kind of secrecy that might be expected from hidden, conspiratorial, authoritarian and cowardly bureaucrats. How many were there? No one knows. By what process did they come to the decision (since there were obviously people who wanted me there)? No one knows. On what grounds was the decision made? That has not been revealed. What role was played by pressure from, for example, the CUSU? That’s apparently no one’s business. It is on such ground that tyranny does not so much grow as positively thrive.</p><p>P.P.S. Here’s something from Vice-Chancellor Professor Stephen Toope of the University of Cambridge that’s worth consideration, in the current context (the described “openness” is apparently part of the university’s declared strategic initiatives regarding (what else) equality and diversity (bold mine):</p><p>One very specific aspect of…openness is being inclusive, and open to diversity in all its forms – diversity of interests and beliefs, of gender, of religion, of sexual identity, of ethnicity, of physical ability.</p></div>",
  "content_text": "Jordan B. Peterson provides an excellent demonstration of how a gamma male handles being rejected. It’s hilarious, because he clearly believed he was now beyond experiencing any more of that, having become Rich and Famous. This is a classic Gamma response we know as the Wall of Text.\nCambridge University Rescinds My Fellowship\nFrom @CamDivinity, this morning (Wed, Mar 20, 2019):\n“Jordan Peterson requested a visiting fellowship at the Faculty of Divinity, and an initial offer has been rescinded after a further review.”\nI visited Cambridge University in November of last year, during my 12 Rules for Life Book tour, one stop of which was the city of Cambridge, where I spoke publicly at the venerable Cambridge Corn Exchange. While there, I had lunch and dinner and various scheduled conversations with a good number of faculty members and other interested individuals who came in for the occasion, and we took the opportunity to speak with a welcome frankness about theological, philosophical and psychological matters. I also recorded twoYouTube videos/podcasts: one with the eminent philosopher Sir Roger Scruton, presented by The Cambridge Center for the Study of Platonism, and another with Dr. Stephen Blackwood, founding President of Ralston College, a university in Savannah, Georgia, preparing for launch.\nI was also invited to address the student-run Cambridge Union, the oldest continuously running debating society in the world – a talk which was delivered to a packed house (a relatively rare occurrence) and which, despite being posted only four months ago, is now the second-most watched of their 200 total videos. I’m mentioning this for a very particular purpose: CUSU, the Cambridge University Student Union (not to be confused with the aforementioned Cambridge Union), pinned to their Twitter account the rescindment announcement three minutes before (!) the Faculty of Divinity did so, and in a spirit of apparent “relief.” The Guardian cited the following CUSU statement:\nWe are relieved to hear that Jordan Peterson’s request for a visiting fellowship to Cambridge’s faculty of divinity has been rescinded following further review. It is a political act to associate the University with an academic’s work through offers which legitimise figures such as Peterson. His work and views are not representative of the student body and as such we do not see his visit as a valuable contribution to the University, but one that works in opposition to the principles of the University.\nIt seems to me that the packed Cambridge Union auditorium, the intelligent questioning associated with the lecture, and the overwhelming number of views the subsequently posted video accrued, indicates that there a number of Cambridge students are very interested in what I have to say, and might well regard my visit “as a valuable contribution to the University.” I also have to say, as a university professor concerned with literacy, that the CUSU statement offered to The Guardian borders on the unintelligible, perhaps even crossing the line (as so much ideological-puppet-babble tends to): what in the world does it mean that “it is a political act to associate the University with an academic’s work through offers which legitimise figures such as Peterson”? And who could write or say something of that rhetorical nature without a deep sense of betraying their personal conscience?\nIn any case: In November, when I was in Cambridge, I began discussions with one of the faculty members (whom I had met briefly before, in London) about the possibility of entering into a collaboration with the Cambridge Divinity Faculty. I enjoyed the conversations I had at Cambridge immensely. I learned a lot about Biblical matters that had remained unknown to me in a very short time. This was of particular relevance to me, but also perhaps of more broad and public import, because of a series of lectures on the Biblical stories of Genesis I prepared, delivered live (at the Isabel Bader Theatre in Toronto) and then posted on YouTube (playlist here) and in podcast form.\nSince their posting, beginning in May of 2017, these lectures have received about 10 million hits (as well as an equal or greater number of downloads). The first lecture alone, on the first sentence of Genesis, has, alone, garnered 3.7 million of those, which makes it the most well-received of all the talks I have ever posted online. I have received correspondence in great volume from religious people all over the world, Jews, Christians, Buddhists and Muslims alike—and an equally large number from atheists—all telling me that my psychological take on the Genesis material resonated very strongly with their faith, or that it helped them understand for the first time the value of these stories. You can see this for yourself by reading the comments on the YouTube channel, which are remarkably civilized and positive, by modern social media standards. I don’t think there is another modern religious/psychological phenomenon or happening that is genuinely comparable. It’s also the case that my books, 12 Rules for Life and Maps of Meaning both rely heavily on Judeo-Christian thinking, and are predicated on the idea that the stories that make up such thought constitute the bedrock of our civil, peaceful and productive society. The former has now sold 3 million copies (one million in tongues other than English), and will be translated into 50 languages; the latter, a much older book, was recently a New York Times bestseller in audio format. This volume of interest is clear indication of the widespread cross-cultural appeal of the work that I am doing.\nIn the fall, I am planning to produce a series of lectures on the Exodus stories. I presume they will have equal drawing power. I thought that I could extend my knowledge of the relevant stories by spending time in Cambridge, and that doing so would be useful for me, for faculty members who might be interested in speaking with me, and to the students. I also regarded it as a privilege and an opportunity. I believed (and still believe) that collaborating with the Faculty of Divinity on such a project would constitute an opportunity of clear mutual benefit. Finally, I thought that making myself more knowledgeable about relevant Biblical matters by working with the experts there would be of substantive benefit to the public audience who would eventually receive the resultant lectures.\nNow the Divinity school has decided that signaling their solidarity with the diversity-inclusivity-equity mob trumps that opportunity–or so I presume. You see, I don’t yet know, because (and this is particularly appalling) I was not formally notified of this decision by any representative of the Divinity school. I heard about the rescinded offer through the grapevine, via a colleague and friend, and gathered what I could about the reasons from social media and press coverage (assuming that CUSU has at least something to do with it).\nI would also like to point out something else. As I already noted, the Divinity Faculty (@CamDivinity) tweeted their decision to rescind, consciously making this a public issue. This is inexcusable, in my estimation, given (1) that they did not equally publicize the initial agreement/invitation (which has to be considered an event of equal import) and (2) that they implied that I came cap-in-hand to the school for the fellowship. This is precisely  the kind of half-truth particularly characteristic of those who deeply practice to deceive, as the fellowship offer was a consequence of mutual discussion between those who invited me to Cambridge in July and my subsequent formal request, and not something I had dreamed up on my own.\nIt’s not going to make much difference to my future, in some sense. I have more opportunities at the moment than I can keep track of, let alone (let’s say) capitalize on. It’s a complex and surreally fortunate position to occupy, and I’m not taking it for granted, but it happens to be true. In the fall, therefore, I will produce the lectures I plan to produce on Exodus, regardless of whether they occur in the UK or in Canada or elsewhere, and they will attract whatever audience remains interested. But I think that it is deeply unfortunate that the authorities at the Divinity school in Cambridge decided that kowtowing to an ill-informed, ignorant and ideologically-addled mob trumped participating in an extensive online experiment in mass Christian and psychological education. Given the continued decline of church attendance, the rise in atheistic or agnostic sentiment, the increasing irrelevance of theological education and the collapse in interest in such matters among young people, wiser and more profound decisions might have been made.\nYou see, it matters whether people around the world understand these ancient stories. It deeply matters. We are becoming unmoored, because we no longer share the structure these stories undergird. This is psychologically destabilizing. It’s producing a pathological and desperate nihilism that is increasingly common and, at the same time, a pronounced proclivity for the ideological certainty that mimics but cannot replace true religious belief. Both consequences are bound to be, as the evidence certainly indicates, divisive and truly dangerous.\nI think the Faculty of Divinity made a serious error of judgement in rescinding their offer to me (and I’m speaking about those unnamed persons who made that specific decision). I think they handled publicizing the rescindment in a manner that could hardly have been more narcissistic, self-congratulatory and devious.\nI believe that the parties in question don’t give a damn about the perilous decline of Christianity, and I presume in any case that they regard that faith, in their propaganda-addled souls, as the ultimate manifestation of the oppressive Western patriarchy, despite their hypothetical allegiance to their own discipline.\nI think that it is no bloody wonder that the faith is declining (and with it, the values of the West, as it fragments) with cowards and mountebanks of the sort who manifested themselves today at the helm.\nI wish them the continued decline in relevance over the next few decades that they deeply and profoundly and diligently work toward and deserve.\nP.S. I also find it interesting and deeply revealing that I know the names of the people who invited me, both informally and formally, but the names of the people who have disinvited me remain shrouded in exactly the kind of secrecy that might be expected from hidden, conspiratorial, authoritarian and cowardly bureaucrats. How many were there? No one knows. By what process did they come to the decision (since there were obviously people who wanted me there)? No one knows. On what grounds was the decision made? That has not been revealed. What role was played by pressure from, for example, the CUSU? That’s apparently no one’s business. It is on such ground that tyranny does not so much grow as positively thrive.\nP.P.S. Here’s something from Vice-Chancellor Professor Stephen Toope of the University of Cambridge that’s worth consideration, in the current context (the described “openness” is apparently part of the university’s declared strategic initiatives regarding (what else) equality and diversity (bold mine):\nOne very specific aspect of…openness is being inclusive, and open to diversity in all its forms – diversity of interests and beliefs, of gender, of religion, of sexual identity, of ethnicity, of physical ability.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-21T02:12:00+00:00"
}