{
  "url": "https://voxday.net/2019/03/28/jewish-humor-isnt/",
  "scraped_at": "2025-12-20T05:35:49.147050",
  "title": "Jewish humor isn’t",
  "date_display": "March 28, 2019",
  "date_iso": "2019-03-28T12:15:08+00:00",
  "date_from_url": "2019-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Owen Benjamin <a href=\"https://www.youtube.com/watch?v=ssFkn26AEZE\">is absolutely right</a>. What passes for Jewish so-called humor isn’t funny at all. I’ve never found Mel Brooks, Jerry Seinfeld, Larry David, Sarah Silverman, Adam Sandler, Gene Wilder, or Lenny Bruce to be even modestly amusing. Jewish “humor” is nothing more than a degenerate combination of whining, moral and cultural transgressivism, narcissistic posturing, and sexual obsession. It’s so relentlessly stupid that it is borderline retarded.</p><p>Is it funny to urinate on a picture of the Holocaust? No, that’s just stupid, disrespectful, and transgressive. And it’s equally stupid to think it’s hilarious to “accidentally” urinate on a picture of Jesus Christ. In fact, all that is necessary to demonstrate the intrinsically idiotic unfunniness of Jewish humor is to change a word or two in their jokes.</p><p><i>Everybody blames the Germans for the Holocaust, and then the Germans try to pass it off on the Nazis. I’m one of the few people who believes it was the blacks. I don’t care. Good. I hope the Germans did do the Holocaust. I’d do it again. I’d fucking do it again in a second.</i><br>– Sarah Silverman</br></p><p>Ha very ha. The routine is not unfunny because it’s offensive, it’s simply not a funny construction in the first place. Of course, it will be amusing to see people start flipping out when the Holocaust is treated as a punchline, as it will be given the increasing absurdity of the Holocaustianity being imposed upon yet another generation that neither knows nor cares about a long-dead war that never had anything to do with them or their forebears. And why should anyone treat a historical event with any respect whatsoever, especially from a secular or scientific perspective, in the first place? It would make more sense to build Jurassic Memorial Centers around the world mourning the loss of the dinosaurs.</p><p>The reason that comedy is dying is because it was taken over by subversives, and subversives are intrinsically parasitical in nature. They can’t build, create, or even sustain anything on their own. It’s like trying to maintain the financial sector on the basis of nothing except finance.</p></div>",
  "content_text": "Owen Benjamin\nis absolutely right\n. What passes for Jewish so-called humor isn’t funny at all. I’ve never found Mel Brooks, Jerry Seinfeld, Larry David, Sarah Silverman, Adam Sandler, Gene Wilder, or Lenny Bruce to be even modestly amusing. Jewish “humor” is nothing more than a degenerate combination of whining, moral and cultural transgressivism, narcissistic posturing, and sexual obsession. It’s so relentlessly stupid that it is borderline retarded.\nIs it funny to urinate on a picture of the Holocaust? No, that’s just stupid, disrespectful, and transgressive. And it’s equally stupid to think it’s hilarious to “accidentally” urinate on a picture of Jesus Christ. In fact, all that is necessary to demonstrate the intrinsically idiotic unfunniness of Jewish humor is to change a word or two in their jokes.\nEverybody blames the Germans for the Holocaust, and then the Germans try to pass it off on the Nazis. I’m one of the few people who believes it was the blacks. I don’t care. Good. I hope the Germans did do the Holocaust. I’d do it again. I’d fucking do it again in a second.\n– Sarah Silverman\nHa very ha. The routine is not unfunny because it’s offensive, it’s simply not a funny construction in the first place. Of course, it will be amusing to see people start flipping out when the Holocaust is treated as a punchline, as it will be given the increasing absurdity of the Holocaustianity being imposed upon yet another generation that neither knows nor cares about a long-dead war that never had anything to do with them or their forebears. And why should anyone treat a historical event with any respect whatsoever, especially from a secular or scientific perspective, in the first place? It would make more sense to build Jurassic Memorial Centers around the world mourning the loss of the dinosaurs.\nThe reason that comedy is dying is because it was taken over by subversives, and subversives are intrinsically parasitical in nature. They can’t build, create, or even sustain anything on their own. It’s like trying to maintain the financial sector on the basis of nothing except finance.",
  "tags": [
    "ClashofCivilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-28T12:15:08+00:00"
}