{
  "url": "https://voxday.net/2019/03/30/mailvox-the-instapundit-link/",
  "scraped_at": "2025-12-20T05:36:07.940958",
  "title": "Mailvox: the Instapundit link",
  "date_display": "March 30, 2019",
  "date_iso": "2019-03-30T20:34:23+00:00",
  "date_from_url": "2019-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve gotten several inquiries about the recent removal of the link to <i>Instapundit </i>from the Day Trips. The reason is pretty straightforward and doesn’t indicate anything negative about either Glenn Reynolds or Dr. Helen; I harbor a high personal regard for both of them. The fact is that I simply don’t read <i>Instapundit </i>any more now that it is All Antisemitism All the Time. After I observed something like 27 links to either “anti-semitism” or “antisemitism” in a single day, almost all of them by Ed Driscoll and Stephen Green, I simply stopped reading the site.</p><p>I don’t happen to find anti-semitism to be interesting, important, or relevant to my life, and I don’t consider it to be one of the top 50 current issues about which conservatives or Republicans need concern themselves. So, I expect you can understand that I don’t regularly read sites that consider it to be the primary topic of discussion.</p></div>",
  "content_text": "I’ve gotten several inquiries about the recent removal of the link to\nInstapundit\nfrom the Day Trips. The reason is pretty straightforward and doesn’t indicate anything negative about either Glenn Reynolds or Dr. Helen; I harbor a high personal regard for both of them. The fact is that I simply don’t read\nInstapundit\nany more now that it is All Antisemitism All the Time. After I observed something like 27 links to either “anti-semitism” or “antisemitism” in a single day, almost all of them by Ed Driscoll and Stephen Green, I simply stopped reading the site.\nI don’t happen to find anti-semitism to be interesting, important, or relevant to my life, and I don’t consider it to be one of the top 50 current issues about which conservatives or Republicans need concern themselves. So, I expect you can understand that I don’t regularly read sites that consider it to be the primary topic of discussion.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-30T20:34:23+00:00"
}