{
  "url": "https://voxday.net/2019/03/27/nationalism-rising/",
  "scraped_at": "2025-12-20T05:35:41.852697",
  "title": "Nationalism rising",
  "date_display": "March 27, 2019",
  "date_iso": "2019-03-27T15:12:31+00:00",
  "date_from_url": "2019-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s visible everywhere now, from politics to popular culture. <a href=\"https://www.youtube.com/watch?v=l_MyUGq7pgs\">This video</a> inspired the hilarious Trump Peshwa Warrior parody, but for me, it is much more interesting for the fierce national pride it exhibits as well as the fact that it has 97 MILLION views on YouTube. I’m not at all into Bollywood or Indian music, and the idea of swordsmen wearing skirts and dancing tends to strike this student of the Western way of war as being a little absurd, but nevertheless, you’d have to be almost entirely full of soy to fail to find it invigorating. This is exactly the sort of proud nationalistic spirit that the globalists seek to eradicate from every nation.</p><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/l_MyUGq7pgs\" width=\"512\"></iframe><div style=\"text-align: left;\">For those interested in the socio-sexual hierarchy, it is also a very good visualization of what Alpha looks like. From the very beginning, the observer is left with absolutely no doubts who the Alpha of the group is… or what <a href=\"https://www.youtube.com/watch?v=zRtPUIumXcY&amp;list=PLzuzwCUSxGGVT_nmnp7gGJcbeL8xBY4xp\">the rewards of Alpha status</a> are.</div></div></div>",
  "content_text": "It’s visible everywhere now, from politics to popular culture.\nThis video\ninspired the hilarious Trump Peshwa Warrior parody, but for me, it is much more interesting for the fierce national pride it exhibits as well as the fact that it has 97 MILLION views on YouTube. I’m not at all into Bollywood or Indian music, and the idea of swordsmen wearing skirts and dancing tends to strike this student of the Western way of war as being a little absurd, but nevertheless, you’d have to be almost entirely full of soy to fail to find it invigorating. This is exactly the sort of proud nationalistic spirit that the globalists seek to eradicate from every nation.\nFor those interested in the socio-sexual hierarchy, it is also a very good visualization of what Alpha looks like. From the very beginning, the observer is left with absolutely no doubts who the Alpha of the group is… or what\nthe rewards of Alpha status\nare.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-27T15:12:31+00:00"
}