{
  "url": "https://voxday.net/2019/03/15/new-zealand-false-flag/",
  "scraped_at": "2025-12-20T05:34:13.743730",
  "title": "New Zealand = false flag",
  "date_display": "March 15, 2019",
  "date_iso": "2019-03-15T10:33:08+00:00",
  "date_from_url": "2019-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>UPDATE: </b>The shootings in New Zealand were almost certainly the first of the false flags everyone who has been paying attention has been anticipating. The paid shills are out HARD on this one trying to put out the fires being set by everyone who notices the highly cheesy nature of the so-called manifesto or the unlikely prospect of a very fit young Aussie who looks a lot like an SAS officer being inspired by a Norwegian to attack a mosque in New Zealand in order to defend gun rights in the United States.</p><div style=\"text-align: center;\">—</div><p>Martin van Creveld warned you. I warned you. The history of the Islamic invasions of Europe and the reconquest of Spain warned you. The entire recorded history of the movement of peoples warned you. Of course, the inevitability of the historical trends is not going to even slow down the feigned media “shock and outrage” narrative that will greet <a href=\"https://www.thesun.co.uk/news/8642007/new-zealand-mosque-shooting-manifesto-anders-breivik/\">the events in New Zealand</a> that may be the beginning of Reconquista 2.0, the next phase in the conquest of the West, or simply a clumsy false flag designed to do anything from a) trigger war with Iran, b) justify the further suppression of inalienable rights, or c) derail the growing popularity of the nationalist right.</p><blockquote><p>Two gunmen opened fire at two mosques in Christchurch, New Zealand, at 1.40pm local time on Friday. Prime Minister Jacinda Ardern said 49 were killed. 41 were killed at Masjid Al Noor Mosque, seven at Linwood Masjid Mosque and one died at hospital.</p><p>48 people were rushed to hospital with gunshot wounds and 20 are in critical condition. One of the gunmen live-streamed the deadly attack on Facebook using a GoPro in footage too distressing to show. It was posted on a Facebook page belonging to Brenton Tarrant. It is understood the killer is an Australian-Brit who published a chilling 74-page manifesto before the rampage</p><p>Cops have arrested three men and a woman – with one found wearing a suicide vest. New Zealand Police commissioner Mike Bush said a man in his late twenties has been charged with murder and will appear in court tomorrow.</p></blockquote><p>As I have written before, and will no doubt have to write again and again, the blood of the victims on both sides is on the hands of the evil politicians and activists who opened the borders of the nation-states of the West to foreign invaders. There is a reason Muslims refer to the lands outside the House of Submission as the <a href=\"https://infogalactic.com/info/Divisions_of_the_world_in_Islam\">Dar al-Harb</a>, the House of War.</p><p><i>Dar al-Harab is a term classically referring to those countries where the Muslim law is not in force, in the matter of worship and the protection of the faithful and dhimmis. It is unclean by definition, and will not become clean until annexed to the House of Peace. Its denizens are either to be converted, killed or, if people of the book, tolerated as long as they pay the jizya.</i><br><i><br/></i>So, don’t bother pretending to be shocked or upset. The bloodshed in Christchurch is what has always happened when rival civilizations clash as a result of one group of people moving into the territory of another group of people. The media never even pretends to shed any tears when dozens of Christians are regularly murdered in their churches in Pakistan, Egypt, and elsewhere in the Middle East. And if the brave men and women of the armed forces had simply defended their nations from Islamic invasion instead of massacring hundreds of thousands of innocent men, women, and children everywhere from Afghanistan to Somalia, ordinary men and women would feel no need to become resistance fighters in their own lands.</br></p><p>If, that is, anyone has actually done so, as there are more than a few distinctly false notes throughout the entire manifesto, which makes me very reluctant to accept the scenario at face value. The entire document felt very cut-and-pasted, and as if it had multiple authors, at least one of whom was trolling the reader.</p><p><b>UPDATE: </b>Apparently option (c) was the correct answer.</p><p><i>The pathology of identity politics on the extreme right….</i><br>– Dr. Jordan B Peterson</br></p></div>",
  "content_text": "UPDATE:\nThe shootings in New Zealand were almost certainly the first of the false flags everyone who has been paying attention has been anticipating. The paid shills are out HARD on this one trying to put out the fires being set by everyone who notices the highly cheesy nature of the so-called manifesto or the unlikely prospect of a very fit young Aussie who looks a lot like an SAS officer being inspired by a Norwegian to attack a mosque in New Zealand in order to defend gun rights in the United States.\n—\nMartin van Creveld warned you. I warned you. The history of the Islamic invasions of Europe and the reconquest of Spain warned you. The entire recorded history of the movement of peoples warned you. Of course, the inevitability of the historical trends is not going to even slow down the feigned media “shock and outrage” narrative that will greet\nthe events in New Zealand\nthat may be the beginning of Reconquista 2.0, the next phase in the conquest of the West, or simply a clumsy false flag designed to do anything from a) trigger war with Iran, b) justify the further suppression of inalienable rights, or c) derail the growing popularity of the nationalist right.\nTwo gunmen opened fire at two mosques in Christchurch, New Zealand, at 1.40pm local time on Friday. Prime Minister Jacinda Ardern said 49 were killed. 41 were killed at Masjid Al Noor Mosque, seven at Linwood Masjid Mosque and one died at hospital.\n48 people were rushed to hospital with gunshot wounds and 20 are in critical condition. One of the gunmen live-streamed the deadly attack on Facebook using a GoPro in footage too distressing to show. It was posted on a Facebook page belonging to Brenton Tarrant. It is understood the killer is an Australian-Brit who published a chilling 74-page manifesto before the rampage\nCops have arrested three men and a woman – with one found wearing a suicide vest. New Zealand Police commissioner Mike Bush said a man in his late twenties has been charged with murder and will appear in court tomorrow.\nAs I have written before, and will no doubt have to write again and again, the blood of the victims on both sides is on the hands of the evil politicians and activists who opened the borders of the nation-states of the West to foreign invaders. There is a reason Muslims refer to the lands outside the House of Submission as the\nDar al-Harb\n, the House of War.\nDar al-Harab is a term classically referring to those countries where the Muslim law is not in force, in the matter of worship and the protection of the faithful and dhimmis. It is unclean by definition, and will not become clean until annexed to the House of Peace. Its denizens are either to be converted, killed or, if people of the book, tolerated as long as they pay the jizya.\nSo, don’t bother pretending to be shocked or upset. The bloodshed in Christchurch is what has always happened when rival civilizations clash as a result of one group of people moving into the territory of another group of people. The media never even pretends to shed any tears when dozens of Christians are regularly murdered in their churches in Pakistan, Egypt, and elsewhere in the Middle East. And if the brave men and women of the armed forces had simply defended their nations from Islamic invasion instead of massacring hundreds of thousands of innocent men, women, and children everywhere from Afghanistan to Somalia, ordinary men and women would feel no need to become resistance fighters in their own lands.\nIf, that is, anyone has actually done so, as there are more than a few distinctly false notes throughout the entire manifesto, which makes me very reluctant to accept the scenario at face value. The entire document felt very cut-and-pasted, and as if it had multiple authors, at least one of whom was trolling the reader.\nUPDATE:\nApparently option (c) was the correct answer.\nThe pathology of identity politics on the extreme right….\n– Dr. Jordan B Peterson",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-15T10:33:08+00:00"
}