{
  "url": "https://voxday.net/2019/03/27/newly-unauthorized/",
  "scraped_at": "2025-12-20T05:35:38.919674",
  "title": "Newly UNAUTHORIZED",
  "date_display": "March 27, 2019",
  "date_iso": "2019-03-27T12:00:10+00:00",
  "date_from_url": "2019-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re pleased to announce two new developments on UNAUTHORIZED.TV today. The first is that David the Good is back from his massively successful live tour of South Florida and he has made available a two-hour video of his workshop at The Great South Florida Food Forest Project. It is available for subscribers only.</p><p><b><a href=\"https://www.unauthorized.tv/programs/grow-or-die\">Live at The Great South Florida Food Forest Project!</a></b><br>Join David The Good for a two hour food forest workshop conducted live in Fort Lauderdale at The Great South Florida Food Forest Project.</br></p><p>We’ve also added a new monthly subscription called the Good Gardening Subscription, a $5 subscription that supports David the Good and his <i>Grow or Die</i> program. Please keep in mind that if you’re already a subscriber, it’s not possible to purchase another one at this time. These direct subscriptions are primarily intended to permit the YouTube subscribers of our creators to offer support for their favorite creators.</p><p>Also, the first episode of Barcelona Life is now <a href=\"https://www.unauthorized.tv/programs/barcelona-life\">available to everyone</a>. Enjoy a glimpse into the impossibly glamorous life of an American couple in Spain as they dare intrepid dangers, drink mysterious wines, and put a GoPro on the real star of the show.</p></div>",
  "content_text": "We’re pleased to announce two new developments on UNAUTHORIZED.TV today. The first is that David the Good is back from his massively successful live tour of South Florida and he has made available a two-hour video of his workshop at The Great South Florida Food Forest Project. It is available for subscribers only.\nLive at The Great South Florida Food Forest Project!\nJoin David The Good for a two hour food forest workshop conducted live in Fort Lauderdale at The Great South Florida Food Forest Project.\nWe’ve also added a new monthly subscription called the Good Gardening Subscription, a $5 subscription that supports David the Good and his\nGrow or Die\nprogram. Please keep in mind that if you’re already a subscriber, it’s not possible to purchase another one at this time. These direct subscriptions are primarily intended to permit the YouTube subscribers of our creators to offer support for their favorite creators.\nAlso, the first episode of Barcelona Life is now\navailable to everyone\n. Enjoy a glimpse into the impossibly glamorous life of an American couple in Spain as they dare intrepid dangers, drink mysterious wines, and put a GoPro on the real star of the show.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-27T12:00:10+00:00"
}