{
  "url": "https://voxday.net/2019/03/22/slander-is-a-judeo-christian-value/",
  "scraped_at": "2025-12-20T05:35:12.395990",
  "title": "Slander is a Judeo-Christian value",
  "date_display": "March 22, 2019",
  "date_iso": "2019-03-22T12:14:03+00:00",
  "date_from_url": "2019-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ben Shapiro <a href=\"https://youtu.be/U4G-DtqB-ZE?t=1257\">slanders me and Milo</a> in his outrage over the fact that <i>Jordanetics </i>is still on sale at a bookstore in New Zealand while <i>12 Rules for Life</i> is not.</p><blockquote><p>There is no way that banning Jordan Peterson’s book from sale in New Zealand is preventing shooting. This is, it’s just utter craziness.</p><p>By the way, other books that continue to be on sale at Whitcoulls include <i>Mein Kampf</i>, which has to do with white supremacism, guys, and also, a book called, it’s like, <i>Jordantology</i>, by Vox Day, an outspoken white supremacist, and Milo Yiannopoulos, an alt-right troll. That book is still on sale, apparently, at Whitcoulls. So, just, very, very solid stuff here, from the Left.</p></blockquote><p>This is classic Judeo-Christian wormtonguery from the Littlest Chickenhawk. There is literally nothing even remotely objectionable in <i>Jordanetics </i>except for the language that some of the Jordan Peterson fans direct at me and the disturbing quotes from Jordan Peterson concerning his overheated dreams about his naked grandmother and his hot cousin. The book has literally nothing to do with white supremacy, mass shootings, or New Zealand, but as far as little (((Ben))) is concerned, <i>Jordanetics </i>is right up there with <i>Mein Kampf</i>.</p><p>Which, I suggest, testifies to it being a compellingly conclusive takedown of the intellectual fraud that is Jordan Peterson.</p><p>Notice how heavily these wormtongues rely upon their inversive rhetorical wizardry to deceive their audiences. Consider that here we have an example of a Neo-Palestinian supremacist who openly boasts about his racial purity calling a mixed-race American Indian who publicly rejects the concept of racial supremacy “an outspoken white supremacist”.</p><p>Anyhow, if you don’t understand why Ben and Jordy are crying about <i>Jordanetics</i>, you can <a href=\"https://arkhavencomics.com/product/jordanetics-audiobook/\">acquire the audiobook+ at Arkhaven</a>.</p></div>",
  "content_text": "Ben Shapiro\nslanders me and Milo\nin his outrage over the fact that\nJordanetics\nis still on sale at a bookstore in New Zealand while\n12 Rules for Life\nis not.\nThere is no way that banning Jordan Peterson’s book from sale in New Zealand is preventing shooting. This is, it’s just utter craziness.\nBy the way, other books that continue to be on sale at Whitcoulls include\nMein Kampf\n, which has to do with white supremacism, guys, and also, a book called, it’s like,\nJordantology\n, by Vox Day, an outspoken white supremacist, and Milo Yiannopoulos, an alt-right troll. That book is still on sale, apparently, at Whitcoulls. So, just, very, very solid stuff here, from the Left.\nThis is classic Judeo-Christian wormtonguery from the Littlest Chickenhawk. There is literally nothing even remotely objectionable in\nJordanetics\nexcept for the language that some of the Jordan Peterson fans direct at me and the disturbing quotes from Jordan Peterson concerning his overheated dreams about his naked grandmother and his hot cousin. The book has literally nothing to do with white supremacy, mass shootings, or New Zealand, but as far as little (((Ben))) is concerned,\nJordanetics\nis right up there with\nMein Kampf\n.\nWhich, I suggest, testifies to it being a compellingly conclusive takedown of the intellectual fraud that is Jordan Peterson.\nNotice how heavily these wormtongues rely upon their inversive rhetorical wizardry to deceive their audiences. Consider that here we have an example of a Neo-Palestinian supremacist who openly boasts about his racial purity calling a mixed-race American Indian who publicly rejects the concept of racial supremacy “an outspoken white supremacist”.\nAnyhow, if you don’t understand why Ben and Jordy are crying about\nJordanetics\n, you can\nacquire the audiobook+ at Arkhaven\n.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-22T12:14:03+00:00"
}