{
  "url": "https://voxday.net/2019/03/21/the-big-bear-roars/",
  "scraped_at": "2025-12-20T05:35:09.111536",
  "title": "The Big Bear roars",
  "date_display": "March 21, 2019",
  "date_iso": "2019-03-21T21:54:48+00:00",
  "date_from_url": "2019-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Owen Benjamin <a href=\"https://www.instagram.com/p/BvSJnd5Bqtj/\">responds to Ben Shapiro</a> attempting to get people to talk about his latest attempt to twist the history of the West to serve his Neo-Palestinian interests:</p><blockquote><p>This little shit called my buddy Vox Day a white supremacist today. Shapiro brags about his racial purity that allegedly leads to high IQs and justifies their dominance in power and wealth. While Vox is an American Indian who reads all day and writes video games has never once said white people are “superior.” Ben Shapiro is barely 3 Rogans tall and schizophrenia runs deep in his family.</p><p>He should pump the brakes on his (((strong genes))). Apparently not recognizing Jews as racially superior makes you a white supremacist. But it doesn’t though. That’s a lie. Which is what Ben does. You gotta read some of the sick shit this guy has said on record. He’s literally pro (((genocide))) and no the stupid three parenthesis thing is not as offensive as genocide you bunch of sheep morons. #owenbenjamin</p></blockquote><p>I was wondering why Shapiro would suddenly resurrect that old libel to which the <i>New Republic</i> first resorted during the demolition of the Hugo Awards, and apparently the reason is that he’s talking his book.</p><p>The very title of Shapiro’s new book is a lie: <i>The Right Side of History: How Reason and Moral Purpose Made the West Great</i></p><p>Typical revisionist wizardry. One could make a better historical case for the Black Plague than for “reason and moral purpose”. The West became great for three reasons: Christianity, the European Nations, and the Greco-Roman philosophical legacy. The Littlest Chickenhawk is on the side of those attempting to destroy Western civilization, which is why he is consciously echoing the Marxianism of his Trotskyite forebears.</p><p><b>UPDATE: </b>I’ll do a video review of <i>The Right Side of History</i> on Unauthorized for subscribers next week. It won’t take long to read the book, as it’s only nine chapters long and the style is far less meandering than Peterson’s. But having read the introduction, it’s obvious why Ben Shapiro was attacking me in connection with the book’s release, as he uses the false and self-contradictory term “Judeo-Christian” no less than 70 times in the book, although it felt as if he used it 70 times in the introduction alone.</p><p>His basic thesis is that Western Civilization is the result of Jerusalem and Athens, which is about five-sixths false. Based on that initial glance, I have no reason to doubt that the book will be full of similar deceptions, falsehoods, and blatant historical revisions.</p><p>One amusing point. He actually mentions that his wife is a doctor in the third sentence of chapter one. Promo code: hilarious!</p></div>",
  "content_text": "Owen Benjamin\nresponds to Ben Shapiro\nattempting to get people to talk about his latest attempt to twist the history of the West to serve his Neo-Palestinian interests:\nThis little shit called my buddy Vox Day a white supremacist today. Shapiro brags about his racial purity that allegedly leads to high IQs and justifies their dominance in power and wealth. While Vox is an American Indian who reads all day and writes video games has never once said white people are “superior.” Ben Shapiro is barely 3 Rogans tall and schizophrenia runs deep in his family.\nHe should pump the brakes on his (((strong genes))). Apparently not recognizing Jews as racially superior makes you a white supremacist. But it doesn’t though. That’s a lie. Which is what Ben does. You gotta read some of the sick shit this guy has said on record. He’s literally pro (((genocide))) and no the stupid three parenthesis thing is not as offensive as genocide you bunch of sheep morons. #owenbenjamin\nI was wondering why Shapiro would suddenly resurrect that old libel to which the\nNew Republic\nfirst resorted during the demolition of the Hugo Awards, and apparently the reason is that he’s talking his book.\nThe very title of Shapiro’s new book is a lie:\nThe Right Side of History: How Reason and Moral Purpose Made the West Great\nTypical revisionist wizardry. One could make a better historical case for the Black Plague than for “reason and moral purpose”. The West became great for three reasons: Christianity, the European Nations, and the Greco-Roman philosophical legacy. The Littlest Chickenhawk is on the side of those attempting to destroy Western civilization, which is why he is consciously echoing the Marxianism of his Trotskyite forebears.\nUPDATE:\nI’ll do a video review of\nThe Right Side of History\non Unauthorized for subscribers next week. It won’t take long to read the book, as it’s only nine chapters long and the style is far less meandering than Peterson’s. But having read the introduction, it’s obvious why Ben Shapiro was attacking me in connection with the book’s release, as he uses the false and self-contradictory term “Judeo-Christian” no less than 70 times in the book, although it felt as if he used it 70 times in the introduction alone.\nHis basic thesis is that Western Civilization is the result of Jerusalem and Athens, which is about five-sixths false. Based on that initial glance, I have no reason to doubt that the book will be full of similar deceptions, falsehoods, and blatant historical revisions.\nOne amusing point. He actually mentions that his wife is a doctor in the third sentence of chapter one. Promo code: hilarious!",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-21T21:54:48+00:00"
}