{
  "url": "https://voxday.net/2019/03/10/the-threatened-alpha/",
  "scraped_at": "2025-12-20T05:33:34.252004",
  "title": "The threatened Alpha",
  "date_display": "March 10, 2019",
  "date_iso": "2019-03-10T11:04:44+00:00",
  "date_from_url": "2019-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why on Earth is the God-Emperor <a href=\"https://deadline.com/2019/03/president-trump-hits-back-hard-at-tv-pundit-ann-coulter-wacky-nut-job-1202572812/\">attacking Ann Coulter</a>?</p><blockquote class=\"tr_bq\"><p>Donald J. Trump@realDonaldTrump<br>Wacky Nut Job @AnnCoulter, who still hasn’t figured out that, despite all odds and an entire Democrat Party of Far Left Radicals against me (not to mention certain Republicans who are sadly unwilling to fight), I am winning on the Border. Major sections of Wall are being built and renovated, with MUCH MORE to follow shortly. Tens of thousands of illegals are being apprehended (captured) at the Border and NOT allowed into our Country. With another President, millions would be pouring in. I am stopping an invasion as the Wall gets built. #MAGA</br></p></blockquote><p>I think the president’s response is better understood via the socio-sexual hierarchy than through politics. Trump knows better than anyone else that he’s failing to deliver. He can sense his support crumbling; alphas are <i>very </i>sensitive to these things. And alphas highly value female opinion, as it is female approval of them that most clearly highlights their distinction from men lower in the hierarchy.</p><p>So, Coulter’s brutal appraisal of the president’s near-complete failure on the most important issue of his campaign stings him to his core. Coulter, by the way, almost certainly knows this and she is not attempting to tear the president down, but rather to motivate him to stop listening to the cucks and foreigners and bad economists around him and start living up to his promises.</p><p>The challenges are manifold, even though Trump is genuinely doing more to address the problem than any president since Eisenhower and he is meeting staunch and formidable opposition. But he is betrayed by his own preference for negotiated settlements and expectations of rational behavior on the part of his opponents, and by his own civic nationalism. Unless he is willing to declare no-quarter, go scorched earth on the issue, and actually behave as if he is facing a genuine national emergency of existential proportions – which he legitimately is, whether he is able to grasp that or not – he is going to fail on all three of the primary issues upon which he was elected.</p><p>That doesn’t mean he has been a failure. Far from it! He has been an <u style=\"font-style: italic;\">excellent</u> president and he will be justifiably re-elected in 2020. The problem is that after more than 50 years of relentless foreign invasion, the situation is so dire that mere excellence will not suffice.</p></div>",
  "content_text": "Why on Earth is the God-Emperor\nattacking Ann Coulter\n?\nDonald J. Trump@realDonaldTrump\nWacky Nut Job @AnnCoulter, who still hasn’t figured out that, despite all odds and an entire Democrat Party of Far Left Radicals against me (not to mention certain Republicans who are sadly unwilling to fight), I am winning on the Border. Major sections of Wall are being built and renovated, with MUCH MORE to follow shortly. Tens of thousands of illegals are being apprehended (captured) at the Border and NOT allowed into our Country. With another President, millions would be pouring in. I am stopping an invasion as the Wall gets built. #MAGA\nI think the president’s response is better understood via the socio-sexual hierarchy than through politics. Trump knows better than anyone else that he’s failing to deliver. He can sense his support crumbling; alphas are\nvery\nsensitive to these things. And alphas highly value female opinion, as it is female approval of them that most clearly highlights their distinction from men lower in the hierarchy.\nSo, Coulter’s brutal appraisal of the president’s near-complete failure on the most important issue of his campaign stings him to his core. Coulter, by the way, almost certainly knows this and she is not attempting to tear the president down, but rather to motivate him to stop listening to the cucks and foreigners and bad economists around him and start living up to his promises.\nThe challenges are manifold, even though Trump is genuinely doing more to address the problem than any president since Eisenhower and he is meeting staunch and formidable opposition. But he is betrayed by his own preference for negotiated settlements and expectations of rational behavior on the part of his opponents, and by his own civic nationalism. Unless he is willing to declare no-quarter, go scorched earth on the issue, and actually behave as if he is facing a genuine national emergency of existential proportions – which he legitimately is, whether he is able to grasp that or not – he is going to fail on all three of the primary issues upon which he was elected.\nThat doesn’t mean he has been a failure. Far from it! He has been an\nexcellent\npresident and he will be justifiably re-elected in 2020. The problem is that after more than 50 years of relentless foreign invasion, the situation is so dire that mere excellence will not suffice.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-10T11:04:44+00:00"
}