{
  "url": "https://voxday.net/2019/03/04/the-conceptual-weakness-of-conservativism/",
  "scraped_at": "2025-12-20T05:32:35.022805",
  "title": "The conceptual weakness of conservativism",
  "date_display": "March 4, 2019",
  "date_iso": "2019-03-04T14:55:40+00:00",
  "date_from_url": "2019-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Kirkpatrick explains why conservatives will never be able to even begin to successfully address <a href=\"http://www.unz.com/article/conservatism-inc-finally-admits-patriots-are-being-deplatformed-attacked-so-what-is-it-going-to-do/\">the problem of corporate deplatforming</a>:</p><blockquote><p>Conservatism Inc. now at least recognizes deplatforming is an issue. Matt Schlapp of the American Conservative Union recently announced that a slot at CPAC will feature Senator Josh Hawley of Missouri, who “will talk about the growing concerns around big tech companies and what Congress needs to do about it.” Hawley has questioned whether large tech companies should continue to benefit from the Section 230 protection in the 1996 Communications Decency Act, which protects social media platforms from being sued for user content.</p><p>Yet the ironic result of taking away this protection could be the destruction of small internet startups, ensuring that Facebook, Twitter and other large companies are the only ones who can maintain a large user base. Big Tech, of course, is entirely governed by the Left.</p><p>The larger problem: Conservatism Inc.’s dogma is preventing it from doing anything productive. There are two critical issues.</p><ul><li>Conservatism Inc. won’t defend its own;</li><li>It won’t attack corporate power, even when that power is used in service of the Left.</li></ul><p>Conservatism Inc.’s tradition of “purges” and selling out its own is well known and is arguably the defining characteristic of the movement. Thus it was less than a month ago the entire Republican Party threw Congressman Steve King under the bus because he was misquoted by the New York Times.</p><p>With online censorship, the temptation is to remain silent as the “unrespectable” elements are gradually deplatformed. Indeed, those who are not deplatformed actually benefit from the lack of any competition to their Right. Certainly, the “Never Trump true conservative” types would have rejoiced if Donald Trump’s Facebook account had been purged in 2015, as the company was reportedly considering. Indeed, journalists enforcers are still crusading to get President Trump banned from Twitter even now.</p><p>Even more serious: conservatives, because of their attachment to “free market principles,” are ideologically incapable of confronting the Leftist corporate power structure now called “Woke Capital”. Thus, at a time when populism is on the rise globally, American conservatives are in the idiotic position of trying to defend companies like Amazon from socialists like Alexandria Ocasio-Cortez, even while Amazon continues a crackdown on conservative speech.</p></blockquote><p>At this point, anyone who focuses their rhetorical attacks on the faceless, unidentified “Left” should be considered suspect at the very least. It is more likely that they are simply unwilling and unable to face the reality of identity politics for one reason or another. The common conflation of corporations with capitalism, which is an intrinsically false notion due to the obvious and undeniable fact that corporations are artificial constructions <i>of the government</i>, is a conceptual trap into which most conservatives have fallen.</p><p>How is it “conservative” in any way, what does it conserve, to defend the rights of artificial constructs while absolving them from any responsibility for their actions?</p><p>The irony is that the very phenomenon of corporate deplatforming demonstrates that capitalist imperatives are not priorities for the modern post-capitalist corporation, because they do not rely upon the interactions of supply and demand for its profits, but rather, politically-driven access to the government-financial pool of resources.</p></div>",
  "content_text": "James Kirkpatrick explains why conservatives will never be able to even begin to successfully address\nthe problem of corporate deplatforming\n:\nConservatism Inc. now at least recognizes deplatforming is an issue. Matt Schlapp of the American Conservative Union recently announced that a slot at CPAC will feature Senator Josh Hawley of Missouri, who “will talk about the growing concerns around big tech companies and what Congress needs to do about it.” Hawley has questioned whether large tech companies should continue to benefit from the Section 230 protection in the 1996 Communications Decency Act, which protects social media platforms from being sued for user content.\nYet the ironic result of taking away this protection could be the destruction of small internet startups, ensuring that Facebook, Twitter and other large companies are the only ones who can maintain a large user base. Big Tech, of course, is entirely governed by the Left.\nThe larger problem: Conservatism Inc.’s dogma is preventing it from doing anything productive. There are two critical issues.\nConservatism Inc. won’t defend its own;\nIt won’t attack corporate power, even when that power is used in service of the Left.\nConservatism Inc.’s tradition of “purges” and selling out its own is well known and is arguably the defining characteristic of the movement. Thus it was less than a month ago the entire Republican Party threw Congressman Steve King under the bus because he was misquoted by the New York Times.\nWith online censorship, the temptation is to remain silent as the “unrespectable” elements are gradually deplatformed. Indeed, those who are not deplatformed actually benefit from the lack of any competition to their Right. Certainly, the “Never Trump true conservative” types would have rejoiced if Donald Trump’s Facebook account had been purged in 2015, as the company was reportedly considering. Indeed, journalists enforcers are still crusading to get President Trump banned from Twitter even now.\nEven more serious: conservatives, because of their attachment to “free market principles,” are ideologically incapable of confronting the Leftist corporate power structure now called “Woke Capital”. Thus, at a time when populism is on the rise globally, American conservatives are in the idiotic position of trying to defend companies like Amazon from socialists like Alexandria Ocasio-Cortez, even while Amazon continues a crackdown on conservative speech.\nAt this point, anyone who focuses their rhetorical attacks on the faceless, unidentified “Left” should be considered suspect at the very least. It is more likely that they are simply unwilling and unable to face the reality of identity politics for one reason or another. The common conflation of corporations with capitalism, which is an intrinsically false notion due to the obvious and undeniable fact that corporations are artificial constructions\nof the government\n, is a conceptual trap into which most conservatives have fallen.\nHow is it “conservative” in any way, what does it conserve, to defend the rights of artificial constructs while absolving them from any responsibility for their actions?\nThe irony is that the very phenomenon of corporate deplatforming demonstrates that capitalist imperatives are not priorities for the modern post-capitalist corporation, because they do not rely upon the interactions of supply and demand for its profits, but rather, politically-driven access to the government-financial pool of resources.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-04T14:55:40+00:00"
}