{
  "url": "https://voxday.net/2019/03/17/they-feel-american/",
  "scraped_at": "2025-12-20T05:34:30.319748",
  "title": "They FEEL American",
  "date_display": "March 17, 2019",
  "date_iso": "2019-03-17T10:52:53+00:00",
  "date_from_url": "2019-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But they’re not, they never were, and they never will be. A telling confession from <a href=\"https://www.firstthings.com/article/2019/04/giving-the-boot\">a review of an entirely unnecessary boo</a>k by the eminently contemptible Max Boot.</p><blockquote><p>The best bits of <i>The Corrosion of Conservatism</i> come early, when Boot describes his childhood under Soviet tyranny and his years as a precocious, politically hyper-conscious teenager in Reagan-era California. The most sympathetic character we encounter is his mother—the ­fiercely loving émigré, who “enrolled me in swim classes, piano lessons, and Hebrew school to give me the athletic, musical, and religious education that she had lacked.” All this, though money was tight and his ­father largely absent.</p><p>Yet Boot never took to sports, nor the piano, nor Hebrew study, and he didn’t retain his native Russian. His real passion was America. Boot was six years old when pressure exerted by Sen. Henry Jackson forced the communist regime to allow families like his to emigrate. In a passage that had me underlining and writing “Amen!” in the margins, he explains: “I have never visited Russia since leaving. I feel entirely American.” That describes my own immigrant sensibility, though I came from Iran just before I turned fourteen.</p><p>But it soon becomes clear that Boot views his adopted homeland through a set of abstract, free-­floating propositions about rights and norms—his patriotism is attached to liberal proceduralism. The religious and spiritual warp and weft of the land elude him entirely. That is, when he isn’t disgusted by them.</p></blockquote><p>America is not, and has never been, an idea. America is a nation, which means, by definition, that Americans are an actual and distinct living <i>people</i>. The claim that America is an idea or a creed is not merely an insult, it is an existential attack on the genetic Posterity of the American Revolution, a nation that has been invaded, adulterated, betrayed, confused, and demoralized to the point that it doesn’t recognize itself or even know what it is.</p><p>If you want to know why the military doesn’t defend the borders, and why the people don’t defend their lands, their neighborhoods, or their families, it is because the American nation has been literally robbed of its identity. And that is why the charlatans and gatekeepers of the Right condemn identity politics, identity, and nationalism so vehemently, because they are alien usurpers who are desperate to keep the rightful heirs of the Revolution from claiming the very country their forefathers founded.</p><p>The review is much more perspicacious than the book, which makes sense, if one considers who the author of the latter is, even though the reviewer’s identity complications prevent him from grasping why the metaphysical ideals of the West have been eclipsed.</p><blockquote><p>Without a shared vision of the common good, society devolves into consumerist cliques and warring tribal factions. With the eclipse of the metaphysical ideals that underlie their conception of reason, America and the West can barely address other civilizations, much less win them over. And it turns out that the consent principle, without more, can authorize all manner of degradation, most shockingly evident in such phenomena as the sale of children and wombs in surrogacy, the unrestricted circulation of hard-core, misogynistic pornography under the banner of “free speech,” and the legalization of death-by-doctor throughout the developed world.</p><p>The liberal consensus, then, has emerged as a profoundly illiberal, repressive force—precisely because it grants the autonomous individual such wide berth to define what is good and true. If maximizing individual autonomy is the highest good and, indeed, the very purpose of political community, then for ­Chelsea Manning to exercise “her” autonomy requires the state to compel the rest of us to say that “she” wasn’t born male. And even absent state compulsion, as already exists in Canada and elsewhere, the institutions charged with upholding the consensus—corporations, big tech, universities, and elite media—can exact a high price for dissent.</p><p>The free world doesn’t feel free.</p></blockquote></div>",
  "content_text": "But they’re not, they never were, and they never will be. A telling confession from\na review of an entirely unnecessary boo\nk by the eminently contemptible Max Boot.\nThe best bits of\nThe Corrosion of Conservatism\ncome early, when Boot describes his childhood under Soviet tyranny and his years as a precocious, politically hyper-conscious teenager in Reagan-era California. The most sympathetic character we encounter is his mother—the ­fiercely loving émigré, who “enrolled me in swim classes, piano lessons, and Hebrew school to give me the athletic, musical, and religious education that she had lacked.” All this, though money was tight and his ­father largely absent.\nYet Boot never took to sports, nor the piano, nor Hebrew study, and he didn’t retain his native Russian. His real passion was America. Boot was six years old when pressure exerted by Sen. Henry Jackson forced the communist regime to allow families like his to emigrate. In a passage that had me underlining and writing “Amen!” in the margins, he explains: “I have never visited Russia since leaving. I feel entirely American.” That describes my own immigrant sensibility, though I came from Iran just before I turned fourteen.\nBut it soon becomes clear that Boot views his adopted homeland through a set of abstract, free-­floating propositions about rights and norms—his patriotism is attached to liberal proceduralism. The religious and spiritual warp and weft of the land elude him entirely. That is, when he isn’t disgusted by them.\nAmerica is not, and has never been, an idea. America is a nation, which means, by definition, that Americans are an actual and distinct living\npeople\n. The claim that America is an idea or a creed is not merely an insult, it is an existential attack on the genetic Posterity of the American Revolution, a nation that has been invaded, adulterated, betrayed, confused, and demoralized to the point that it doesn’t recognize itself or even know what it is.\nIf you want to know why the military doesn’t defend the borders, and why the people don’t defend their lands, their neighborhoods, or their families, it is because the American nation has been literally robbed of its identity. And that is why the charlatans and gatekeepers of the Right condemn identity politics, identity, and nationalism so vehemently, because they are alien usurpers who are desperate to keep the rightful heirs of the Revolution from claiming the very country their forefathers founded.\nThe review is much more perspicacious than the book, which makes sense, if one considers who the author of the latter is, even though the reviewer’s identity complications prevent him from grasping why the metaphysical ideals of the West have been eclipsed.\nWithout a shared vision of the common good, society devolves into consumerist cliques and warring tribal factions. With the eclipse of the metaphysical ideals that underlie their conception of reason, America and the West can barely address other civilizations, much less win them over. And it turns out that the consent principle, without more, can authorize all manner of degradation, most shockingly evident in such phenomena as the sale of children and wombs in surrogacy, the unrestricted circulation of hard-core, misogynistic pornography under the banner of “free speech,” and the legalization of death-by-doctor throughout the developed world.\nThe liberal consensus, then, has emerged as a profoundly illiberal, repressive force—precisely because it grants the autonomous individual such wide berth to define what is good and true. If maximizing individual autonomy is the highest good and, indeed, the very purpose of political community, then for ­Chelsea Manning to exercise “her” autonomy requires the state to compel the rest of us to say that “she” wasn’t born male. And even absent state compulsion, as already exists in Canada and elsewhere, the institutions charged with upholding the consensus—corporations, big tech, universities, and elite media—can exact a high price for dissent.\nThe free world doesn’t feel free.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-17T10:52:53+00:00"
}