{
  "url": "https://voxday.net/2019/03/28/when-chickenhawks-cry/",
  "scraped_at": "2025-12-20T05:35:53.091367",
  "title": "When chickenhawks cry",
  "date_display": "March 28, 2019",
  "date_iso": "2019-03-28T18:01:21+00:00",
  "date_from_url": "2019-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Littlest Chickenhawk is outraged that the Economist has described him as <a href=\"https://twitchy.com/sarahd-313035/2019/03/28/i-demand-a-retraction-ben-shapiro-torches-the-economist-for-peddling-this-utterly-vile-lie/\">an “Alt-Right Sage”</a>:</p><blockquote><p>Ben Shapiro@benshapiro<br>This is a vile lie. Not only am I not alt-right, I am probably their leading critic on the right. I was the number one target of their hate in 2016 online according to ADL data. I demand a retraction.</br></p><p>Ben Shapiro@benshapiro<br>You should be ashamed of yourselves for that garbage headline and description. To call yourselves a journalistic outlet and then botch this one so badly is astonishing. Here is me in 2016 in WaPo ripping Trump for flirting with the alt-right</br></p><p>Ben Shapiro@benshapiro<br>My book itself contains several pages devoted to the evil of the alt-right and white supremacy. Retract this pathetically inaccurate and defamatory nonsense now.</br></p></blockquote><p>Spare us the outrage, Benny. You’re the liar who maliciously and knowingly slandered me as “an outspoken white supremacist” just last week.</p><p>What a pathetic little weasel. I’ll be sending him a demand for a public retraction and apology this week.</p></div>",
  "content_text": "The Littlest Chickenhawk is outraged that the Economist has described him as\nan “Alt-Right Sage”\n:\nBen Shapiro@benshapiro\nThis is a vile lie. Not only am I not alt-right, I am probably their leading critic on the right. I was the number one target of their hate in 2016 online according to ADL data. I demand a retraction.\nBen Shapiro@benshapiro\nYou should be ashamed of yourselves for that garbage headline and description. To call yourselves a journalistic outlet and then botch this one so badly is astonishing. Here is me in 2016 in WaPo ripping Trump for flirting with the alt-right\nBen Shapiro@benshapiro\nMy book itself contains several pages devoted to the evil of the alt-right and white supremacy. Retract this pathetically inaccurate and defamatory nonsense now.\nSpare us the outrage, Benny. You’re the liar who maliciously and knowingly slandered me as “an outspoken white supremacist” just last week.\nWhat a pathetic little weasel. I’ll be sending him a demand for a public retraction and apology this week.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-03-28T18:01:21+00:00"
}