{
  "url": "https://voxday.net/2011/02/16/alpha-to-omega/",
  "scraped_at": "2025-12-13T23:02:39.741678",
  "title": "Alpha to Omega",
  "date_display": "February 16, 2011",
  "date_iso": "2011-02-16T14:45:00+00:00",
  "date_from_url": "2011-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DW has created a quiz on <a href=\"http://www.quiztron.com/tests/socio-sexual_hierarc_quiz_193262.htm\">the male socio-sexual hierarchy</a>.  So go ahead and take it, all you precious male snowflakes, and report back on how astonishingly alphasexy you are!</p><p>I do note that lambda was somehow omitted, but I suspect most lambdas can readily figure out where they rank.  For example, if your answer with regards to question four  would have been <i>You were in the mall a week ago with a bunch of friends. Are you:</i> “The one giving/getting a hummer in the men’s room”, then it really doesn’t matter what your answers to the other questions happen to be.</p><p>I’ve been intending to put together a quiz of my own at some point in time and I’ll eventually get around to it, but this is certainly entertaining for starters.</p></div>",
  "content_text": "DW has created a quiz on\nthe male socio-sexual hierarchy\n.  So go ahead and take it, all you precious male snowflakes, and report back on how astonishingly alphasexy you are!\nI do note that lambda was somehow omitted, but I suspect most lambdas can readily figure out where they rank.  For example, if your answer with regards to question four  would have been\nYou were in the mall a week ago with a bunch of friends. Are you:\n“The one giving/getting a hummer in the men’s room”, then it really doesn’t matter what your answers to the other questions happen to be.\nI’ve been intending to put together a quiz of my own at some point in time and I’ll eventually get around to it, but this is certainly entertaining for starters.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-16T14:45:00+00:00"
}