{
  "url": "https://voxday.net/2011/02/20/at-black-gate-5/",
  "scraped_at": "2025-12-13T23:03:01.581762",
  "title": "At the Black Gate",
  "date_display": "February 20, 2011",
  "date_iso": "2011-02-20T12:43:00+00:00",
  "date_from_url": "2011-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last week, I read with great interest the discussion that began with Leo Grin’s comparison of the heroic fantasy fiction of J.R.R. Tolkien and Robert E. Howard with the anti-heroic fantasy fiction of Joe Abercrombie. As this is a topic that has interested me for years, I certainly have a number of thoughts regarding it.  However, since I am a political commentator who is correctly said to be well outside the ideological mainstream of the SF/F community, I think it is best to begin by pointing out to those on both sides of the spectrum who may be eager to turn this into a political debate that this is not a political subject, but rather a historical, literary, and philosophical one. And as such, there is no need to argue over whether the trajectory over time that Grin observes is desirable or not, since that is a matter of perspective and personal opinion.</p><p>Regardless of one’s ideological self-identification or opinion on the  specifics of Grin’s observations, it should be eminently clear to all and  sundry that something material and significant has changed within the  field of fantasy fiction in the 71 years that separate Howard’s final  publication from Abercrombie’s first one and the 52 years that separate  the publication of <i>The Return of the King </i>from <i>The Blade Itself</i>.   I should also point out that I offer no personal criticism of Joe  Abercrombie here, as he merely happens to serve as a representative of  modern fantasy fiction and one of its more accomplished representatives  at that….</p><p>Read the rest of what is <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/\">a rather lengthy post</a> on the link between literary decline and societal decline over at <i>Black Gate</i>.</p></div>",
  "content_text": "Last week, I read with great interest the discussion that began with Leo Grin’s comparison of the heroic fantasy fiction of J.R.R. Tolkien and Robert E. Howard with the anti-heroic fantasy fiction of Joe Abercrombie. As this is a topic that has interested me for years, I certainly have a number of thoughts regarding it.  However, since I am a political commentator who is correctly said to be well outside the ideological mainstream of the SF/F community, I think it is best to begin by pointing out to those on both sides of the spectrum who may be eager to turn this into a political debate that this is not a political subject, but rather a historical, literary, and philosophical one. And as such, there is no need to argue over whether the trajectory over time that Grin observes is desirable or not, since that is a matter of perspective and personal opinion.\nRegardless of one’s ideological self-identification or opinion on the  specifics of Grin’s observations, it should be eminently clear to all and  sundry that something material and significant has changed within the  field of fantasy fiction in the 71 years that separate Howard’s final  publication from Abercrombie’s first one and the 52 years that separate  the publication of\nThe Return of the King\nfrom\nThe Blade Itself\n.   I should also point out that I offer no personal criticism of Joe  Abercrombie here, as he merely happens to serve as a representative of  modern fantasy fiction and one of its more accomplished representatives  at that….\nRead the rest of what is\na rather lengthy post\non the link between literary decline and societal decline over at\nBlack Gate\n.",
  "tags": [
    "books",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-20T12:43:00+00:00"
}