{
  "url": "https://voxday.net/2011/02/23/bakker-on-triumph-of-modern-fantasy/",
  "scraped_at": "2025-12-13T23:03:20.847772",
  "title": "Postulating a literary triumph",
  "date_display": "February 23, 2011",
  "date_iso": "2011-02-23T15:30:00+00:00",
  "date_from_url": "2011-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RS Bakker, whose work was one of the examples of modern fantasy cited in <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/\">the heroism/nihilism debate at Black Gate</a> inspired by Leo Grin’s original essay, <a href=\"http://rsbakker.wordpress.com/2011/02/21/the-rise-and-triumph-of-modern-fantasy/\">weighs in on the matter</a>.  Unfortunately, I am not familiar with Mr. Bakker’s novels, but I have heard some very good things about them, so it was more than a little interesting to read his perspective:</p><blockquote><p>More often than not, the truth, whatever it is, likes to hide in the trashcan. So let me suggest, from the outset, that even though we may belong to the low paraliterati, we are actually engaging in an incredibly complex and timely debate, one which represents genuinely conflicting social interests, while the literati are simply disputing angels and pins amongst themselves.</p><p>Only in fantasy, folks. Which is why I have been self-consciously exploring these self-same issues throughout The Prince of Nothing and The Aspect-Emperor. These are literally the problems that I used to structure the metaphysics of the World and the Outside. I can’t help but feel a little bit of that delicious I-told-you-so tingle…</p><p>The latest salvo in the dour side of the debate is “The Decline and Fall of the Fantasy Novel,” which appeared on Black Gate just this past Sunday. In this essay, Theo breaks Grin’s lament down into four categories, so rescuing the argument from all the hyperbole and self-congratulatory in-group asides that so marred the original.</p></blockquote><p>I liked Bakker’s sober, straightforward take on the matter, which stands in marked contrast to the disjointed reactions of some of the more impassioned opinions expressed.  With regards to the first category, <i>1) Heroic inspiration versus anti-heroic discouragement</i>, Bakker wrote: “Why this [moral redemption or heroic overcoming of external threats] should be the cornerstone of the genre, or anything beyond a statement of personal taste, is quite beyond me.”</p><p>But in the very first issue of Black Gate, John O’Neill wrote: <i>“Some people believe that the age of the magazines is over.  That people don’t read short stories anymore, that no one is interested in fantasy not packaged as a trilogy.  I don’t believe that.  But at the same time, I will admit that modern magazines have lost some of the magic that characterized the first Golden Age.  In particular, they’ve misplaced the sense of excitement, the focus on adventure, and the ability to reach across generations to readers of all ages.  In Black Gate, we hope to recapture that spirit, to publish original epic fantasy in the classic mold – with strong characters, exotic settings, and page-turning action.”</i><br> – Black Gate, Spring 2001, pg. 4</br></p><p>My suggestion is that what John was referring to with regards to the lost magic can quite reasonably be identified as the moral redemption and heroic overcoming of external threats, which are important elements going into that which makes characters strong and fantasy epic.  This doesn’t mean that this lost magic needs to be a cornerstone of the genre anymore than sex with murderous dead people does.  But there is, nevertheless, a distinct and palpable sense of loss in the move from the one to the other.  Now, Bakker is right, as it is a matter of personal taste regarding what one prefers to consume, but then, that is equally true of expressing a gastronomic preference between eating chocolate and eating shit.  And with literature as with food, what one consumes will tend to have consequences over time.</p><p>On the second point concerning <i>2) Moral certainty versus relativistic confusion</i>, I very much disagree that there is any straw man, let alone a Great Straw Man involved.  Bakker writes: “The idea seems to be that ‘moral relativism’ has some kind of ‘moral dampening effect,’ which in turn forces the author to reach deeper to achieve moral effects. I’m not so sure this makes much sense.”  But I don’t see how the dampening effect can be reasonably doubted.  Let me put it in visual terms.  If I am painting with primary colors, it is not difficult to achieve the effects of “red” and “blue”.  I simply use red and blue paint.  If, however, I have nothing but grey paint, it takes a tremendous amount of skill to achieve any distinction between a red effect and a blue effect.  So most painters, not being sufficiently skilled, will be forced to utilize other means of getting the effect across to the viewer by appealing to the viewer’s strongest preconceptions about color, preconceptions which are entirely <i>external</i> to the work.  (This is what I meant when I referred to an “artificial facsimile of a moral sensibility” which is located <i>within</i> the work itself.)   The inclusion of a stop sign or a police uniform can serve as reference points for colors that aren’t actually there.  While one might quite reasonably argue that it is simplistic to use traditional and commonly understood colors in order to achieve a specific color effect, I don’t see how one can rationally argue that not using color, or worse, using yellow for red and brown for blue, is a more effective or powerful means of communicating color.  What might work out extraordinarily well in the sophisticated hands of a master painter is very likely to turn out as a gaudy and nonsensical disaster in less accomplished hands.  And these sorts of morally incoherent disasters are precisely what I perceive in much modern fantasy today.  To extend the analogy a bit further, the problem with the end result isn’t that the painting doesn’t have the exact amount of blue that I, (or anyone else), might believe it should have, the problem is that it is an ugly mess that lacks versimilitude and is incapable of stirring any feeling in the viewer but contempt and disgust.</p><p>Although he characterized it correctly, I don’t think Bakker quite understood the third point, <i>3) Organic consistency versus moral anachronism</i>, in its entirety.  I applaud his refusal to bow to the temporal moral anachronisms that litter modern fantasy like a virulent STD, and will happily assure him that I have never presumed “individuals in ancient contexts were not morally conflicted”.  The simple fact that has apparently been missed here is that in order to be “morally conflicted”, there must be at least two moral poles between which that conflict can take place.  It doesn’t matter what the moralities are, as one can create a credible moral conflict regardless of whether one believes that stoning homosexuals is a moral imperative or a totally immoral act.  The point is that there must be a defined pole and an anti-pole or else there is no moral conflict; define those poles how you like, albeit with due respect for historical definitions if you have decided to make use of a recognizable historical setting.  As for the connection between moral anachronisms in fiction and certain sensibilities, I would think it is rather obvious that it is almost always those writers who reject traditional moral standards – or alternatively, the very concept of universally applicable moral standards – who are so uncomfortable with them that they insist on introducing the moral equivalent of laser-sighted handguns into an era of swords and spears.  This is just bad judgment leading to bad writing.</p><p>With regards to the fourth point, I am entirely open to the idea that the latest generation of modern fantasists are not at all responsible for the way they are regarded by their fans. But their predecessors in the SF/F genre, such as Michael Moorcock and Harlan Ellison, certainly revelled in their self-styled transgressivism and so-called “dangerous” visions.  Still, I think it is abundantly clear that there is nothing bold or daring about upholding the moral perspective of what has now become the mainstream perspective in the publishing industry, if not necessarily among the readership.  If Messrs. Joe, Steve, and George don’t consider themselves to be dangerous, transgressive writers in the Moorcockian mode, then obviously the charge of hypocrisy would not apply.</p><p>Finally, I have no choice but to conclude that Bakker has missed the primary thrust of my argument when he writes: “As I hope should be clear by this point, Theo’s four recapitulations of Grin’s points are really different spins of the same complaint: modern fantasy is a moral failure.”</p><p>But this is not what I am saying at all.  I am observing – not complaining –  that modern fantasy is a <i>literary</i> failure and that the <i>literary</i> decline of the genre over the last fifty years is one of the many symptoms of a greater societal decline.  That this literary and societal decline has a moral component is readily apparent, but is beyond the scope of my argument, nor does that argument rely upon subscription to “a certain family of wish-fulfilment moralities”.  In other words, there is no circle, which is why the potential difficulty of squaring it is irrelevant.  I have no desire to tell anyone what they should or should not write, anymore than I wish to tell them what they should or should not eat.  Write what thou wilt is the whole of the literary law.  But if you happen to be wondering why so many people think your breath stinks, I’m certainly not going to hesitate to explain that you may want to reconsider your eating habits.</p><p>UPDATE – Mr. Bakker <a href=\"http://rsbakker.wordpress.com/2011/02/23/of-blood-and-titties/\">responds</a>.  But unfortunately, by his own admission, it would appear that most of it sailed right over his head.  I’m not sure how I can make what is a fairly basic concept much more clear, but I will certainly attempt to do so tomorrow.  In the meantime, I am much amused by his opinion that he has forced me “into an uncomfortable position”.  I’m not uncomfortable at all, I’m just bemused.  It increasingly feels like trying to explain to retarded children why their fingerpaintings suck and how they might like to try improving them by using more than one color… then having them respond “I like pink and you’re just AFRAID of it.”  Throw in more blood and titties if you like, by all means.  I certainly don’t care.  And if that sums up the scope of your literary ambitions, well, so be it.  I’m sure we’ll all look forward to seeing holographic movies based on your epic novels 50 years from now, or at least the bowdlerized versions approved by the Imam of Culture.</p></div>",
  "content_text": "RS Bakker, whose work was one of the examples of modern fantasy cited in\nthe heroism/nihilism debate at Black Gate\ninspired by Leo Grin’s original essay,\nweighs in on the matter\n.  Unfortunately, I am not familiar with Mr. Bakker’s novels, but I have heard some very good things about them, so it was more than a little interesting to read his perspective:\nMore often than not, the truth, whatever it is, likes to hide in the trashcan. So let me suggest, from the outset, that even though we may belong to the low paraliterati, we are actually engaging in an incredibly complex and timely debate, one which represents genuinely conflicting social interests, while the literati are simply disputing angels and pins amongst themselves.\nOnly in fantasy, folks. Which is why I have been self-consciously exploring these self-same issues throughout The Prince of Nothing and The Aspect-Emperor. These are literally the problems that I used to structure the metaphysics of the World and the Outside. I can’t help but feel a little bit of that delicious I-told-you-so tingle…\nThe latest salvo in the dour side of the debate is “The Decline and Fall of the Fantasy Novel,” which appeared on Black Gate just this past Sunday. In this essay, Theo breaks Grin’s lament down into four categories, so rescuing the argument from all the hyperbole and self-congratulatory in-group asides that so marred the original.\nI liked Bakker’s sober, straightforward take on the matter, which stands in marked contrast to the disjointed reactions of some of the more impassioned opinions expressed.  With regards to the first category,\n1) Heroic inspiration versus anti-heroic discouragement\n, Bakker wrote: “Why this [moral redemption or heroic overcoming of external threats] should be the cornerstone of the genre, or anything beyond a statement of personal taste, is quite beyond me.”\nBut in the very first issue of Black Gate, John O’Neill wrote:\n“Some people believe that the age of the magazines is over.  That people don’t read short stories anymore, that no one is interested in fantasy not packaged as a trilogy.  I don’t believe that.  But at the same time, I will admit that modern magazines have lost some of the magic that characterized the first Golden Age.  In particular, they’ve misplaced the sense of excitement, the focus on adventure, and the ability to reach across generations to readers of all ages.  In Black Gate, we hope to recapture that spirit, to publish original epic fantasy in the classic mold – with strong characters, exotic settings, and page-turning action.”\n– Black Gate, Spring 2001, pg. 4\nMy suggestion is that what John was referring to with regards to the lost magic can quite reasonably be identified as the moral redemption and heroic overcoming of external threats, which are important elements going into that which makes characters strong and fantasy epic.  This doesn’t mean that this lost magic needs to be a cornerstone of the genre anymore than sex with murderous dead people does.  But there is, nevertheless, a distinct and palpable sense of loss in the move from the one to the other.  Now, Bakker is right, as it is a matter of personal taste regarding what one prefers to consume, but then, that is equally true of expressing a gastronomic preference between eating chocolate and eating shit.  And with literature as with food, what one consumes will tend to have consequences over time.\nOn the second point concerning\n2) Moral certainty versus relativistic confusion\n, I very much disagree that there is any straw man, let alone a Great Straw Man involved.  Bakker writes: “The idea seems to be that ‘moral relativism’ has some kind of ‘moral dampening effect,’ which in turn forces the author to reach deeper to achieve moral effects. I’m not so sure this makes much sense.”  But I don’t see how the dampening effect can be reasonably doubted.  Let me put it in visual terms.  If I am painting with primary colors, it is not difficult to achieve the effects of “red” and “blue”.  I simply use red and blue paint.  If, however, I have nothing but grey paint, it takes a tremendous amount of skill to achieve any distinction between a red effect and a blue effect.  So most painters, not being sufficiently skilled, will be forced to utilize other means of getting the effect across to the viewer by appealing to the viewer’s strongest preconceptions about color, preconceptions which are entirely\nexternal\nto the work.  (This is what I meant when I referred to an “artificial facsimile of a moral sensibility” which is located\nwithin\nthe work itself.)   The inclusion of a stop sign or a police uniform can serve as reference points for colors that aren’t actually there.  While one might quite reasonably argue that it is simplistic to use traditional and commonly understood colors in order to achieve a specific color effect, I don’t see how one can rationally argue that not using color, or worse, using yellow for red and brown for blue, is a more effective or powerful means of communicating color.  What might work out extraordinarily well in the sophisticated hands of a master painter is very likely to turn out as a gaudy and nonsensical disaster in less accomplished hands.  And these sorts of morally incoherent disasters are precisely what I perceive in much modern fantasy today.  To extend the analogy a bit further, the problem with the end result isn’t that the painting doesn’t have the exact amount of blue that I, (or anyone else), might believe it should have, the problem is that it is an ugly mess that lacks versimilitude and is incapable of stirring any feeling in the viewer but contempt and disgust.\nAlthough he characterized it correctly, I don’t think Bakker quite understood the third point,\n3) Organic consistency versus moral anachronism\n, in its entirety.  I applaud his refusal to bow to the temporal moral anachronisms that litter modern fantasy like a virulent STD, and will happily assure him that I have never presumed “individuals in ancient contexts were not morally conflicted”.  The simple fact that has apparently been missed here is that in order to be “morally conflicted”, there must be at least two moral poles between which that conflict can take place.  It doesn’t matter what the moralities are, as one can create a credible moral conflict regardless of whether one believes that stoning homosexuals is a moral imperative or a totally immoral act.  The point is that there must be a defined pole and an anti-pole or else there is no moral conflict; define those poles how you like, albeit with due respect for historical definitions if you have decided to make use of a recognizable historical setting.  As for the connection between moral anachronisms in fiction and certain sensibilities, I would think it is rather obvious that it is almost always those writers who reject traditional moral standards – or alternatively, the very concept of universally applicable moral standards – who are so uncomfortable with them that they insist on introducing the moral equivalent of laser-sighted handguns into an era of swords and spears.  This is just bad judgment leading to bad writing.\nWith regards to the fourth point, I am entirely open to the idea that the latest generation of modern fantasists are not at all responsible for the way they are regarded by their fans. But their predecessors in the SF/F genre, such as Michael Moorcock and Harlan Ellison, certainly revelled in their self-styled transgressivism and so-called “dangerous” visions.  Still, I think it is abundantly clear that there is nothing bold or daring about upholding the moral perspective of what has now become the mainstream perspective in the publishing industry, if not necessarily among the readership.  If Messrs. Joe, Steve, and George don’t consider themselves to be dangerous, transgressive writers in the Moorcockian mode, then obviously the charge of hypocrisy would not apply.\nFinally, I have no choice but to conclude that Bakker has missed the primary thrust of my argument when he writes: “As I hope should be clear by this point, Theo’s four recapitulations of Grin’s points are really different spins of the same complaint: modern fantasy is a moral failure.”\nBut this is not what I am saying at all.  I am observing – not complaining –  that modern fantasy is a\nliterary\nfailure and that the\nliterary\ndecline of the genre over the last fifty years is one of the many symptoms of a greater societal decline.  That this literary and societal decline has a moral component is readily apparent, but is beyond the scope of my argument, nor does that argument rely upon subscription to “a certain family of wish-fulfilment moralities”.  In other words, there is no circle, which is why the potential difficulty of squaring it is irrelevant.  I have no desire to tell anyone what they should or should not write, anymore than I wish to tell them what they should or should not eat.  Write what thou wilt is the whole of the literary law.  But if you happen to be wondering why so many people think your breath stinks, I’m certainly not going to hesitate to explain that you may want to reconsider your eating habits.\nUPDATE – Mr. Bakker\nresponds\n.  But unfortunately, by his own admission, it would appear that most of it sailed right over his head.  I’m not sure how I can make what is a fairly basic concept much more clear, but I will certainly attempt to do so tomorrow.  In the meantime, I am much amused by his opinion that he has forced me “into an uncomfortable position”.  I’m not uncomfortable at all, I’m just bemused.  It increasingly feels like trying to explain to retarded children why their fingerpaintings suck and how they might like to try improving them by using more than one color… then having them respond “I like pink and you’re just AFRAID of it.”  Throw in more blood and titties if you like, by all means.  I certainly don’t care.  And if that sums up the scope of your literary ambitions, well, so be it.  I’m sure we’ll all look forward to seeing holographic movies based on your epic novels 50 years from now, or at least the bowdlerized versions approved by the Imam of Culture.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-23T15:30:00+00:00"
}