{
  "url": "https://voxday.net/2011/02/23/blowing-up-mers/",
  "scraped_at": "2025-12-13T23:03:24.910671",
  "title": "Blowing up MERS",
  "date_display": "February 23, 2011",
  "date_iso": "2011-02-23T21:00:00+00:00",
  "date_from_url": "2011-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A county in Massachusetts has the mortgage bankers’ scam engine <a href=\"http://4closurefraud.org/2011/02/22/massachusetts-register-of-deeds-call-on-mers-to-come-clean-and-pay-up-says-essex-county-owed-22-million-dollars/\">in its sights</a>:</p><blockquote><p>Essex South Register of Deeds John O’Brien announced today that he will be seeking over $22 million dollars from the Mortgage Electronic Registration System, “MERS” which represents several major banking conglomerates.  O’Brien bases the $22M number on the fact that the Salem registry has recorded over 148,663 MERS mortgages since 1998.  After a careful review of a number of these mortgages O’Brien said it became very clear to him that MERS had assigned mortgages to other entities at least twice without paying a recording fee.  Based on this information the taxpayers have been defrauded out of $22,299,450 in Southern Essex County alone.</p></blockquote><p>That’s one way to start addressing the pension hole in a lot of local government budgets.  This would appear to be one of the reasons MERS has announced that it is <a href=\"http://www.economicpopulist.org/content/mers-leaves-field\">getting out of the foreclosure business</a>.  Of course, they’re already guilty of an incredible number of fraudulent actions and responsible for billions in unpaid recording fees, so this ex post facto handwashing isn’t going to change anything.</p><p><i>The Mortgage Electronic Registration Systems company (known as MERS), which has been at the center of legal problems affecting the securitization of home mortgages and foreclosures, has given up one of its principal corporate objectives. It is now instructing its members to cease foreclosing on residential properties in the name of MERS, and to begin immediately to register all assignments of mortgages with local county recorders of deeds.</i></p></div>",
  "content_text": "A county in Massachusetts has the mortgage bankers’ scam engine\nin its sights\n:\nEssex South Register of Deeds John O’Brien announced today that he will be seeking over $22 million dollars from the Mortgage Electronic Registration System, “MERS” which represents several major banking conglomerates.  O’Brien bases the $22M number on the fact that the Salem registry has recorded over 148,663 MERS mortgages since 1998.  After a careful review of a number of these mortgages O’Brien said it became very clear to him that MERS had assigned mortgages to other entities at least twice without paying a recording fee.  Based on this information the taxpayers have been defrauded out of $22,299,450 in Southern Essex County alone.\nThat’s one way to start addressing the pension hole in a lot of local government budgets.  This would appear to be one of the reasons MERS has announced that it is\ngetting out of the foreclosure business\n.  Of course, they’re already guilty of an incredible number of fraudulent actions and responsible for billions in unpaid recording fees, so this ex post facto handwashing isn’t going to change anything.\nThe Mortgage Electronic Registration Systems company (known as MERS), which has been at the center of legal problems affecting the securitization of home mortgages and foreclosures, has given up one of its principal corporate objectives. It is now instructing its members to cease foreclosing on residential properties in the name of MERS, and to begin immediately to register all assignments of mortgages with local county recorders of deeds.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-23T21:00:00+00:00"
}