{
  "url": "https://voxday.net/2011/02/19/cicero-on-scientific-morality/",
  "scraped_at": "2025-12-13T23:02:56.057807",
  "title": "Cicero on “scientific” morality",
  "date_display": "February 19, 2011",
  "date_iso": "2011-02-19T14:05:00+00:00",
  "date_from_url": "2011-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I spent a rather pleasant morning finishing <i>de Legibus</i> today, and was inspired to begin putting together some thoughts that I anticipate sharing at some future date.  In the meantime, however, I was more than a little amused by these two passages, the first from Book One and the second from Book Two, particularly in light of having read <i>The Moral Landscape</i>.  As a general rule, if your argument has not only been anticipated, but brutally dismissed, some 2,000 years in advance, you should probably consider rethinking it.</p><p><i>“As for those who go in for self-indulgence and are slaves of their own bodies – people who measure everything they should seek and avoid in life by the yardstick of pleasure and pain – even if they are right (and there is no need to take issue with them here) let us tell them to preach in their own little gardens and let us ask them to keep away for a little while from any participation in public life, an area of which they know nothing and have never wished to know anything….</i></p><p>What can be more certain than this, that no one should be so stupid and arrogant as to believe that reason and intelligence are present in him but not in the heavens and the world?  Or that those things which are barely understood by the highest intellectual reasoning are kept in motion without any intelligence at all?  As for the person who is not impelled to give thanks for the procession of the stars, the alternation of day and night, the regular succession of the seasons, and the fruits which are produced for our enjoyment – how can such a person be counted as human at all?”</p><p>I think we can be confident that the great Roman humanist would not only be unimpressed with the proposed science of morality based on the happiness/suffering metric, but like most Americans today, he would be more than a little reluctant to cast a presidential vote for an atheist.</p></div>",
  "content_text": "I spent a rather pleasant morning finishing\nde Legibus\ntoday, and was inspired to begin putting together some thoughts that I anticipate sharing at some future date.  In the meantime, however, I was more than a little amused by these two passages, the first from Book One and the second from Book Two, particularly in light of having read\nThe Moral Landscape\n.  As a general rule, if your argument has not only been anticipated, but brutally dismissed, some 2,000 years in advance, you should probably consider rethinking it.\n“As for those who go in for self-indulgence and are slaves of their own bodies – people who measure everything they should seek and avoid in life by the yardstick of pleasure and pain – even if they are right (and there is no need to take issue with them here) let us tell them to preach in their own little gardens and let us ask them to keep away for a little while from any participation in public life, an area of which they know nothing and have never wished to know anything….\nWhat can be more certain than this, that no one should be so stupid and arrogant as to believe that reason and intelligence are present in him but not in the heavens and the world?  Or that those things which are barely understood by the highest intellectual reasoning are kept in motion without any intelligence at all?  As for the person who is not impelled to give thanks for the procession of the stars, the alternation of day and night, the regular succession of the seasons, and the fruits which are produced for our enjoyment – how can such a person be counted as human at all?”\nI think we can be confident that the great Roman humanist would not only be unimpressed with the proposed science of morality based on the happiness/suffering metric, but like most Americans today, he would be more than a little reluctant to cast a presidential vote for an atheist.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-19T14:05:00+00:00"
}