{
  "url": "https://voxday.net/2011/02/21/collective-vanilla-ice/",
  "scraped_at": "2025-12-13T23:03:07.069003",
  "title": "The collective Vanilla Ice",
  "date_display": "February 21, 2011",
  "date_iso": "2011-02-21T14:15:00+00:00",
  "date_from_url": "2011-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of the comments at the Black Gate on yesterday’s post regarding the decline and fall of the fantasy novel really have to be read to be believed.  There has been a great deal of what appears to be willful obtuseness and a determined inability to understand standard definitions on display, but there’s not much that needs to be said against an argument that relies upon the idea that the basic concept of Western civilization has no intrinsic meaning… although it would certainly make for an amusingly meta defense of post-modernism in modern fantasy.</p><p>In any event, I replied thusly: <i>Matt and [B], there appears to be little to discuss with either of you on the subject of Western civilization, still less its observable decline in demographic and other terms, as your knowledge of the concept clearly doesn’t even rise to the level of Wikipedia.  Nor is this the proper venue to explain the <em>principium contradictionis</em>, so I suggest you read up on what the “Western world” and “the Occident” are and how they have been defined for decades, if not centuries. <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/#comment-6061\">What you have presented</a>, Matt, is not a rebuttal, but rather a collection of contorted wordplay and suppositions which attempts to avoid the manifestly obvious.  Let me put it in terms you might be willing to acknowledge.  Suppose you were to write a modern fantasy set in America circa 2010, but completely leaving out all science and technology.  Don’t you think that would create a ludicrously false image of both the setting and the basic mindsets of the characters?  Then suppose that people began claiming this omission of science and technology as well as scientific modes of thinking actually presented a <em>more realistic</em> understanding of the period than its inclusion.  That would border on the insane, wouldn’t you agree?</i></p><p>Read the rest of my reply <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/\">at the Black Gate</a>.  And if you feel moved to comment there, be considerate and polite.  Playing hardball is completely fine here, but it is not the way things are done there.</p><p>Matt has also written what I consider to be <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-bankrupt-nihilism/\">a more relevant post</a> on the moral aspect of the subject that you should find interesting.</p></div>",
  "content_text": "Some of the comments at the Black Gate on yesterday’s post regarding the decline and fall of the fantasy novel really have to be read to be believed.  There has been a great deal of what appears to be willful obtuseness and a determined inability to understand standard definitions on display, but there’s not much that needs to be said against an argument that relies upon the idea that the basic concept of Western civilization has no intrinsic meaning… although it would certainly make for an amusingly meta defense of post-modernism in modern fantasy.\nIn any event, I replied thusly:\nMatt and [B], there appears to be little to discuss with either of you on the subject of Western civilization, still less its observable decline in demographic and other terms, as your knowledge of the concept clearly doesn’t even rise to the level of Wikipedia.  Nor is this the proper venue to explain the\nprincipium contradictionis\n, so I suggest you read up on what the “Western world” and “the Occident” are and how they have been defined for decades, if not centuries.\nWhat you have presented\n, Matt, is not a rebuttal, but rather a collection of contorted wordplay and suppositions which attempts to avoid the manifestly obvious.  Let me put it in terms you might be willing to acknowledge.  Suppose you were to write a modern fantasy set in America circa 2010, but completely leaving out all science and technology.  Don’t you think that would create a ludicrously false image of both the setting and the basic mindsets of the characters?  Then suppose that people began claiming this omission of science and technology as well as scientific modes of thinking actually presented a\nmore realistic\nunderstanding of the period than its inclusion.  That would border on the insane, wouldn’t you agree?\nRead the rest of my reply\nat the Black Gate\n.  And if you feel moved to comment there, be considerate and polite.  Playing hardball is completely fine here, but it is not the way things are done there.\nMatt has also written what I consider to be\na more relevant post\non the moral aspect of the subject that you should find interesting.",
  "tags": [
    "Black Gate",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-21T14:15:00+00:00"
}