{
  "url": "https://voxday.net/2011/02/01/consider-name/",
  "scraped_at": "2025-12-13T23:01:19.279819",
  "title": "Consider the name",
  "date_display": "February 1, 2011",
  "date_iso": "2011-02-01T18:00:00+00:00",
  "date_from_url": "2011-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Israeli commentators <a href=\"http://www.reuters.com/article/2011/01/31/us-egypt-israel-usa-idUSTRE70U53720110131\">appear to be genuinely surprised</a> that a man named Hussein who attended madrassahs as a child might take a slightly different tack in the Middle East than his white Episcopalian predecessors:</p><blockquote><p>If Egypt’s President Hosni Mubarak is toppled, Israel will lose one of its very few friends in a hostile neighborhood and President Barack Obama will bear a large share of the blame, Israeli pundits said on Monday.  Political commentators expressed shock at how the United States as well as its major European allies appeared to be ready to dump a staunch strategic ally of three decades, simply to conform to the current ideology of political correctness….</p><p>Who is advising them, he asked, “to fuel the mob raging in the streets of Egypt and to demand the head of the person who five minutes ago was the bold ally of the president … an almost lone voice of sanity in a Middle East?”</p></blockquote><p>Regardless of whether Obama is a Muslim himself or not, he is obviously going to be sympathetic to the various causes of the non-European third worlders because he considers himself one of them.  Look at how he behaves towards longtime European allies like the English versus his kowtowing before the Saudi king and the head of the Chinese regime.  Obama’s degrees from Columbia and Harvard no more give him a normal American perspective than did the King of Jordan’s attendance at Deerfield Academy and Georgetown.</p><p>It’s rather like the Romans being surprised when they support a Teutonic general’s claim to the imperial throne and then see him taking sides in barbarian affairs.  If against all expectations he somehow managed to survive and win a second term, I wouldn’t be at all surprised to see Obama start openly supporting Hamas, Hezbollah, and Al-Ikhwān against Israel.</p><p>UPDATE: I wrote that before I read <a href=\"http://www.latimes.com/news/nationworld/world/la-fg-us-egypt-20110201,0,7079100.story?track=rss\">this article</a>: <i>The Obama administration said for the first time that it supports a role for groups such as the Muslim Brotherhood, a banned Islamist organization, in a reformed Egyptian government. The organization must reject violence and recognize democratic goals if the U.S. is to be comfortable with it taking part in the government, the White House said.</i></p><p>It would be interesting to learn what “democratic goals” are supposed to be, especially in light of how the Muslim Brotherhood is a bigger fan of genuine democracy right now than the Obama administration is.</p></div>",
  "content_text": "In which Israeli commentators\nappear to be genuinely surprised\nthat a man named Hussein who attended madrassahs as a child might take a slightly different tack in the Middle East than his white Episcopalian predecessors:\nIf Egypt’s President Hosni Mubarak is toppled, Israel will lose one of its very few friends in a hostile neighborhood and President Barack Obama will bear a large share of the blame, Israeli pundits said on Monday.  Political commentators expressed shock at how the United States as well as its major European allies appeared to be ready to dump a staunch strategic ally of three decades, simply to conform to the current ideology of political correctness….\nWho is advising them, he asked, “to fuel the mob raging in the streets of Egypt and to demand the head of the person who five minutes ago was the bold ally of the president … an almost lone voice of sanity in a Middle East?”\nRegardless of whether Obama is a Muslim himself or not, he is obviously going to be sympathetic to the various causes of the non-European third worlders because he considers himself one of them.  Look at how he behaves towards longtime European allies like the English versus his kowtowing before the Saudi king and the head of the Chinese regime.  Obama’s degrees from Columbia and Harvard no more give him a normal American perspective than did the King of Jordan’s attendance at Deerfield Academy and Georgetown.\nIt’s rather like the Romans being surprised when they support a Teutonic general’s claim to the imperial throne and then see him taking sides in barbarian affairs.  If against all expectations he somehow managed to survive and win a second term, I wouldn’t be at all surprised to see Obama start openly supporting Hamas, Hezbollah, and Al-Ikhwān against Israel.\nUPDATE: I wrote that before I read\nthis article\n:\nThe Obama administration said for the first time that it supports a role for groups such as the Muslim Brotherhood, a banned Islamist organization, in a reformed Egyptian government. The organization must reject violence and recognize democratic goals if the U.S. is to be comfortable with it taking part in the government, the White House said.\nIt would be interesting to learn what “democratic goals” are supposed to be, especially in light of how the Muslim Brotherhood is a bigger fan of genuine democracy right now than the Obama administration is.",
  "tags": [
    "politics",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-01T18:00:00+00:00"
}