{
  "url": "https://voxday.net/2011/02/18/day-you-thought-would-never-come/",
  "scraped_at": "2025-12-13T23:02:50.576064",
  "title": "The day you thought would never come",
  "date_display": "February 18, 2011",
  "date_iso": "2011-02-18T12:00:00+00:00",
  "date_from_url": "2011-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I write <a href=\"http://blogs.telegraph.co.uk/news/cristinaodone/100076803/justin-bieber-attacks-abortion-huge-coup-for-pro-life-lobby-but-how-long-before-hollywood-shuts-him-up/\">in praise of Justin Bieber</a>:</p><blockquote><p>Justin Bieber, pop icon and every teeny bopper’s dreamboat, has given the pro-life lobby a totally unexpected and extraordinary coup: he has told Rolling Stone magazine that he thinks abortion is “like killing a baby”. The 16-year-old, a committed Christian, has actually come out and said that an embryo is a human being. Gasp! Gulp! From Montreal to Manchester, this is the most important person in a teenage girl’s universe.</p></blockquote><p>It is always dangerous to place much credence in anything that any celebrity says or does, especially a young one.  Michelle Malkin’s foolishly premature praise of Charlotte Church springs to mind, by way of example.  Regardless, it is courageous of Bieber to so openly take a stand against the dogma of Hollywood at such a young age and so early in his career.</p><p>On a totally unrelated but apparently more predictable note, Abe produced a timely comment: <i>“DRAT! How could I have forgotten the Merlot, Ritz crackers, and canned cheese spread for Vox?! It’s all he ever eats, anyway!” :-p</i></p><p>The reason SB and I thought this was so funny was that at the very moment I read the comment, I happened to be enjoying a lunch that consisted of a 2001 Gran Riserva, spiced Valaisian sausage, and parmigiano reggiano. <i>Ecco la dolce vita….</i></p></div>",
  "content_text": "In which I write\nin praise of Justin Bieber\n:\nJustin Bieber, pop icon and every teeny bopper’s dreamboat, has given the pro-life lobby a totally unexpected and extraordinary coup: he has told Rolling Stone magazine that he thinks abortion is “like killing a baby”. The 16-year-old, a committed Christian, has actually come out and said that an embryo is a human being. Gasp! Gulp! From Montreal to Manchester, this is the most important person in a teenage girl’s universe.\nIt is always dangerous to place much credence in anything that any celebrity says or does, especially a young one.  Michelle Malkin’s foolishly premature praise of Charlotte Church springs to mind, by way of example.  Regardless, it is courageous of Bieber to so openly take a stand against the dogma of Hollywood at such a young age and so early in his career.\nOn a totally unrelated but apparently more predictable note, Abe produced a timely comment:\n“DRAT! How could I have forgotten the Merlot, Ritz crackers, and canned cheese spread for Vox?! It’s all he ever eats, anyway!” :-p\nThe reason SB and I thought this was so funny was that at the very moment I read the comment, I happened to be enjoying a lunch that consisted of a 2001 Gran Riserva, spiced Valaisian sausage, and parmigiano reggiano.\nEcco la dolce vita….",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-18T12:00:00+00:00"
}