{
  "url": "https://voxday.net/2011/02/27/death-of-satire/",
  "scraped_at": "2025-12-13T23:03:45.174874",
  "title": "The death of satire",
  "date_display": "February 27, 2011",
  "date_iso": "2011-02-27T20:30:00+00:00",
  "date_from_url": "2011-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Dyke and the Dybbuk</i>, by Ellen Galford.  “A fun, feisty, feminist romp through Jewish folklore as an ancient spirit returns to haunt a modern-day London lesbian.”</p><p>The OC remarks: “And they wonder why straight men have lost almost all interest in buying and reading fiction…”</p><p>This makes me suspect that the gatekeepers are unintentionally strangling the genre by ignoring population demographics.  Do the math.  It is nearly impossible to get published in SF/F as a Christian evangelical or anti-feminist these days.  It is, by comparison, relatively easy to get published as a lesbian, feminist, or Jewish writer, because the lesbian, feminist and Jewish editors, (or in some cases, all three in one), understandably tend to be interested in publishing books that reflect their interests and perspective.  There is nothing intrinsically wrong with that.  Their job, their call.</p><p>But there is something mathematically wrong with it, since lesbians make up around one percent of the population and Jews are either 2.2 percent or 1.7 percent, depending upon which metric you use.  So, by combining those two factors, as in the case of Ms Galford’s new “fun, feisty, feminist romp”, you have functionally decided to turn your back on at least 99.98 percent of your potential market.  Of course, the transparent short-sightedness of this approach is unlikely to prevent the publishers from decrying their continually declining sales and blaming them on ebook piracy, video games, or that old standby, male readers being intimidated by strong, independent female characters.</p><p>I have to confess, though, that description kind of makes me want to read <i>The Dyke and the Dibbuk</i>.  It appears to have the potential to be even hilariously awful than that were-seal book that presently serves as our standard for the literary depths of the SF/F genre.</p></div>",
  "content_text": "The Dyke and the Dybbuk\n, by Ellen Galford.  “A fun, feisty, feminist romp through Jewish folklore as an ancient spirit returns to haunt a modern-day London lesbian.”\nThe OC remarks: “And they wonder why straight men have lost almost all interest in buying and reading fiction…”\nThis makes me suspect that the gatekeepers are unintentionally strangling the genre by ignoring population demographics.  Do the math.  It is nearly impossible to get published in SF/F as a Christian evangelical or anti-feminist these days.  It is, by comparison, relatively easy to get published as a lesbian, feminist, or Jewish writer, because the lesbian, feminist and Jewish editors, (or in some cases, all three in one), understandably tend to be interested in publishing books that reflect their interests and perspective.  There is nothing intrinsically wrong with that.  Their job, their call.\nBut there is something mathematically wrong with it, since lesbians make up around one percent of the population and Jews are either 2.2 percent or 1.7 percent, depending upon which metric you use.  So, by combining those two factors, as in the case of Ms Galford’s new “fun, feisty, feminist romp”, you have functionally decided to turn your back on at least 99.98 percent of your potential market.  Of course, the transparent short-sightedness of this approach is unlikely to prevent the publishers from decrying their continually declining sales and blaming them on ebook piracy, video games, or that old standby, male readers being intimidated by strong, independent female characters.\nI have to confess, though, that description kind of makes me want to read\nThe Dyke and the Dibbuk\n.  It appears to have the potential to be even hilariously awful than that were-seal book that presently serves as our standard for the literary depths of the SF/F genre.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-27T20:30:00+00:00"
}