{
  "url": "https://voxday.net/2011/02/28/defining-epic/",
  "scraped_at": "2025-12-13T23:03:48.849082",
  "title": "Defining epic",
  "date_display": "February 28, 2011",
  "date_iso": "2011-02-28T14:15:00+00:00",
  "date_from_url": "2011-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matthew David Surridge <a href=\"http://www.blackgate.com/2011/02/27/epic-fantasy-notes-toward-a-definition/#more-18163\">attempts to define it</a>:</p><blockquote><p>[W]e decided to take a stab at coming up with a definition for epic fantasy ourselves. We decided to first list a number of texts that seemed clearly ‘epic fantasies,’ and try to work out what they had in common. In the process, we also thought of texts that seemed close but which we felt not to be epics, and texts that really seem to be on the margins of the epic; any genre definition is a fuzzy set, and some things will seem in the genre and some out of it depending on how you look at them. At any rate, while it seemed likely that the defintion we’d arrive at would be somewhat conservative — at best describing what epic fantasy has been so far, not necessarily what it is or could be — it seemed worth doing, just to try to establish what people think of when they talk about epic fantasy. If you have any counter-suggestions, or texts that you’d like to put forward as possible epics, we’d love to hear about it in the comments.</p><p>The core texts that we came up with, by a fairly quick process of word-association, were: Tolkien’s The Lord of the Rings, Terry Brooks’ Sword of Shannara, David Eddings’ Belgariad, Guy Gavriel Kay’s Fionavar Tapestry, Robert Jordan and Brandon Sanderson’s The Wheel of Time, Margaret Weis and Tracy Hickman’s Deathgate Cycle, George R.R. Martin’s A Song of Ice and Fire, Robin Hobb’s Liveship Traders Trilogy, Steven Erikson’s Malazan Book of the Fallen, Jacqueline Carey’s Kushiel’s Legacy series, R. Scott Bakker’s Prince of Nothing series, and Brandon Sanderson’s Mistborn series. In many cases only one of us had read the books in question; in a couple of cases, notably Erikson and Bakker, it has to be said neither of us had read all the books of the series. In some cases neither of us liked the books much, but this was not an evaluative process, simply definitional.</p><p>As we discussed what we thought was and wasn’t epic fantasy, the marginal cases we found were Ursula Le Guin’s original Earthsea trilogy, Gene Wolfe’s Book of the New Sun, and Glen Cook’s Black Company series. Things that looked like epic fantasy, but which one or another of us felt strongly were not, were Anne McCaffrey’s Pern books, Roger Zelazny’s Amber series, and J.K. Rowling’s Harry Potter books.</p><p>Attempting to justify what we felt was and wasn’t epic fantasy, we came up with the following characteristics of the fantasy epic:  Firstly, it has to have a certain length. Ideally, at least three thick books. I’ve seen The Lord of the Rings estimated at 400,000 words, which seems about right; The Sword of Shannara I’ve seen estimated as 265,000 words, so let’s set 250,000 words as an absolute minimum, with a reasonable expectation of much more.</p></blockquote><p>Epic fantasy is one of those things that I suspect is easier to recognize than define.  Tolkien is clearly epic.  Eddings is clearly epic.  I don’t think Carey feels epic in any way, shape or form; even though one could make a rational case for it, I think the argument for Zelazny’s <i>Amber </i> is stronger than for Carey’s <i>Kushiel</i>.  I also think that both the original <i>Dragonlance </i>trilogy and the <i>Twins </i>trilogy are far more epic than Kay’s <i>Fionavar Tapestry</i>, even though the latter is clearly higher quality literature.  But certainly Surridge’s approach is the correct one, the challenge is to reasonably draw the line between that which is epic and that which is not epic.  The <s>primary omission</s> thus far, in my opinion, is is Steven Erikson’s prodigiously epic <i>Malazan Book of the Fallen</i>, even if it isn’t always what I would tend to consider particularly readable or even necessarily plotted.</p><p>UPDATE – Erikson wasn’t omitted at all.  Let this serve as an object lesson in why one should read carefully before opining.</p></div>",
  "content_text": "Matthew David Surridge\nattempts to define it\n:\n[W]e decided to take a stab at coming up with a definition for epic fantasy ourselves. We decided to first list a number of texts that seemed clearly ‘epic fantasies,’ and try to work out what they had in common. In the process, we also thought of texts that seemed close but which we felt not to be epics, and texts that really seem to be on the margins of the epic; any genre definition is a fuzzy set, and some things will seem in the genre and some out of it depending on how you look at them. At any rate, while it seemed likely that the defintion we’d arrive at would be somewhat conservative — at best describing what epic fantasy has been so far, not necessarily what it is or could be — it seemed worth doing, just to try to establish what people think of when they talk about epic fantasy. If you have any counter-suggestions, or texts that you’d like to put forward as possible epics, we’d love to hear about it in the comments.\nThe core texts that we came up with, by a fairly quick process of word-association, were: Tolkien’s The Lord of the Rings, Terry Brooks’ Sword of Shannara, David Eddings’ Belgariad, Guy Gavriel Kay’s Fionavar Tapestry, Robert Jordan and Brandon Sanderson’s The Wheel of Time, Margaret Weis and Tracy Hickman’s Deathgate Cycle, George R.R. Martin’s A Song of Ice and Fire, Robin Hobb’s Liveship Traders Trilogy, Steven Erikson’s Malazan Book of the Fallen, Jacqueline Carey’s Kushiel’s Legacy series, R. Scott Bakker’s Prince of Nothing series, and Brandon Sanderson’s Mistborn series. In many cases only one of us had read the books in question; in a couple of cases, notably Erikson and Bakker, it has to be said neither of us had read all the books of the series. In some cases neither of us liked the books much, but this was not an evaluative process, simply definitional.\nAs we discussed what we thought was and wasn’t epic fantasy, the marginal cases we found were Ursula Le Guin’s original Earthsea trilogy, Gene Wolfe’s Book of the New Sun, and Glen Cook’s Black Company series. Things that looked like epic fantasy, but which one or another of us felt strongly were not, were Anne McCaffrey’s Pern books, Roger Zelazny’s Amber series, and J.K. Rowling’s Harry Potter books.\nAttempting to justify what we felt was and wasn’t epic fantasy, we came up with the following characteristics of the fantasy epic:  Firstly, it has to have a certain length. Ideally, at least three thick books. I’ve seen The Lord of the Rings estimated at 400,000 words, which seems about right; The Sword of Shannara I’ve seen estimated as 265,000 words, so let’s set 250,000 words as an absolute minimum, with a reasonable expectation of much more.\nEpic fantasy is one of those things that I suspect is easier to recognize than define.  Tolkien is clearly epic.  Eddings is clearly epic.  I don’t think Carey feels epic in any way, shape or form; even though one could make a rational case for it, I think the argument for Zelazny’s\nAmber\nis stronger than for Carey’s\nKushiel\n.  I also think that both the original\nDragonlance\ntrilogy and the\nTwins\ntrilogy are far more epic than Kay’s\nFionavar Tapestry\n, even though the latter is clearly higher quality literature.  But certainly Surridge’s approach is the correct one, the challenge is to reasonably draw the line between that which is epic and that which is not epic.  The\nprimary omission\nthus far, in my opinion, is is Steven Erikson’s prodigiously epic\nMalazan Book of the Fallen\n, even if it isn’t always what I would tend to consider particularly readable or even necessarily plotted.\nUPDATE – Erikson wasn’t omitted at all.  Let this serve as an object lesson in why one should read carefully before opining.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-28T14:15:00+00:00"
}