{
  "url": "https://voxday.net/2011/02/09/disappeal-of-slu/",
  "scraped_at": "2025-12-13T23:02:03.430849",
  "title": "The disappeal of the slut",
  "date_display": "February 9, 2011",
  "date_iso": "2011-02-09T18:00:00+00:00",
  "date_from_url": "2011-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Women often have a hard time understanding why men have such a problem with “the number” even though few men put much of a premium on actual virginity these days.  But it’s a mistake for women to assume that men think about sexual histories in the same way they do because whereas the pre-selection and DHV aspects tend to counteract any negative sense of jealousy and/or disgust that women might feel when considering a stud’s copious history, there simply aren’t any equivalent positive aspects working in favor of the slut.</p><p>So, if women wish to better understand the way most men react to hearing about their girlfriend’s sexual histories, it might help to contemplate how they would feel about a man’s hypothetical past homosexual activities.  While it <i>might</i> be at least <i>possible</i> to overlook a youthful indiscretion or two at boarding school or band camp, very few women are attracted to a man who spent the last ten years running rampant in the gay clubs and having sex with 20 or 30 men before deciding that he’d had enough fun and was now ready to settle down with a woman.</p><p>This is obviously somewhat of an exaggeration, but I think it’s much closer to the way that most men feel about female sexual histories than the way women feel about male sexual histories.</p></div>",
  "content_text": "Women often have a hard time understanding why men have such a problem with “the number” even though few men put much of a premium on actual virginity these days.  But it’s a mistake for women to assume that men think about sexual histories in the same way they do because whereas the pre-selection and DHV aspects tend to counteract any negative sense of jealousy and/or disgust that women might feel when considering a stud’s copious history, there simply aren’t any equivalent positive aspects working in favor of the slut.\nSo, if women wish to better understand the way most men react to hearing about their girlfriend’s sexual histories, it might help to contemplate how they would feel about a man’s hypothetical past homosexual activities.  While it\nmight\nbe at least\npossible\nto overlook a youthful indiscretion or two at boarding school or band camp, very few women are attracted to a man who spent the last ten years running rampant in the gay clubs and having sex with 20 or 30 men before deciding that he’d had enough fun and was now ready to settle down with a woman.\nThis is obviously somewhat of an exaggeration, but I think it’s much closer to the way that most men feel about female sexual histories than the way women feel about male sexual histories.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-09T18:00:00+00:00"
}