{
  "url": "https://voxday.net/2011/02/09/dread-and-drama-dilemma/",
  "scraped_at": "2025-12-13T23:02:01.602103",
  "title": "Dread and the drama dilemma",
  "date_display": "February 9, 2011",
  "date_iso": "2011-02-09T14:00:00+00:00",
  "date_from_url": "2011-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Susan Walsh is skeptical about the depth of <a href=\"http://www.hookingupsmart.com/2011/02/01/relationshipstrategies/how-to-destroy-a-relationship/\">the female need for uncertainty and drama</a>:</p><blockquote><p>I understand that women like men who are strong, dominant, and refuse to put up with their shit. Indeed, if a man cannot do these things, he may strike out time and time again. But that’s a far cry, a whole other continent, away from wanting to feel dread in the pit of your stomach for the rest of your life.</p></blockquote><p>Susan is highly unusual in that she is a female blogger who grasps the reality and the importance of Game without being offended by it.  I suspect this is in part due to the fact that she is a) happily married, and b) has a reasonable grasp of economics.  Therefore, she has the ability to consider Game-related matters rationally rather than in a defensive and emotionally reactive manner.</p><p>That being said, I think she has underestimated the dark complexity of the human psyche here, in this case, the female one.  More importantly, I think she has failed to take into account the powerful consequences of state interference in male-female relationships.  This is why it’s not a question of want, but rather, a question of <i>need</i>.  Due to Marriage 2.0, there isn’t a married man who does not live with at least some sense of dread that he will find himself among the 43% of men who are legally and financially raped by the divorce industry.  So, what Roissy describes as “<a href=\"http://roissy.wordpress.com/2008/03/27/dread/\">dread</a>” and what Haley describes as “<a href=\"http://haleyshalo.wordpress.com/2011/01/26/every-woman-is-the-star-of-her-own-melodrama/\">providing a drama fix</a>” is little more than an emotional leveling of the playing field.</p><p>Susan understands that women have a strong tendency to behave badly when they feel they have the upper hand in a relationship due to their hypergamous nature.  If they can’t respect you, they despise you.  As Churchill once said of the proverbial Hun, they are either at your throat or at your feet.  This hypergamy presents a serious problem now, since the male dread of divorce has caused many men to quite reasonably become fearfully deferential of their wives and as a consequence rendered the marital relationship unstable.</p><p>Therefore something is required to remove the feeling of the upper hand from the state-sponsored wife.  Enter “dread” or some other equally effective psychological substitute.  Contra Susan’s title, it is <i>failing</i> to counter this state-imposed imbalance that will tend destroy marital relationships, and now that courts in the UK and USA are beginning to grant awards to women who are non-marital partners, increasingly threaten long-term non-marital relationships as well.</p><p>However, this does not mean all men are well-advised to behave according to Roissy’s most extreme position.  It simply isn’t necessary or even productive in some cases.  Take Russell Brand, for example.  He can behave in the most omega manner possible, because his wife already knows beyond any shadow of a doubt that if she behaves badly or leaves him, he will immediately react by replacing her with two Victoria’s Secret angels, six topless lads mag models, a Hollywood actress, and three waitresses from a Thai restaurant, very possibly all at once.  The Roissyan “dread” for lack of a better word, is implicit in the core concept of “being married to Russell Brand”.</p><p>(Side note.  SB and I laughed out loud when watching a quiz show on which Brand apologized to the women of England for not having slept with all of them despite his best efforts to do so.)</p><p>As with most things related to Game, the actionable concepts are not dogma meant to be accepted without question, but are instead designed to provide for the conscious emulation of the unconscious actions of men who are naturally successful with women <i>regardless of the specific form that “success with women” is deemed to take</i>.  This is the central concept that so many critics of Game fail to grasp.  Whether success means “nailing skank #3” or “remaining happily married to one’s beloved wife”, there will always be those men who manage it without trying and those men who don’t.  And the latter will always be well-served by learning from the example of the former.</p><p>It should be noted that just as some men don’t need to provide dread or drama, some women don’t require it.  Having the legal power of the state at her command is not necessarily going to translate into a feeling of superiority in a woman, especially one who happens to be more psychologically or emotionally vulnerable.  In the same way that Brand has no need to demonstrate his options, the vulnerable woman doesn’t need to be emotionally unsettled in order to prevent her from behaving badly.</p></div>",
  "content_text": "Susan Walsh is skeptical about the depth of\nthe female need for uncertainty and drama\n:\nI understand that women like men who are strong, dominant, and refuse to put up with their shit. Indeed, if a man cannot do these things, he may strike out time and time again. But that’s a far cry, a whole other continent, away from wanting to feel dread in the pit of your stomach for the rest of your life.\nSusan is highly unusual in that she is a female blogger who grasps the reality and the importance of Game without being offended by it.  I suspect this is in part due to the fact that she is a) happily married, and b) has a reasonable grasp of economics.  Therefore, she has the ability to consider Game-related matters rationally rather than in a defensive and emotionally reactive manner.\nThat being said, I think she has underestimated the dark complexity of the human psyche here, in this case, the female one.  More importantly, I think she has failed to take into account the powerful consequences of state interference in male-female relationships.  This is why it’s not a question of want, but rather, a question of\nneed\n.  Due to Marriage 2.0, there isn’t a married man who does not live with at least some sense of dread that he will find himself among the 43% of men who are legally and financially raped by the divorce industry.  So, what Roissy describes as “\ndread\n” and what Haley describes as “\nproviding a drama fix\n” is little more than an emotional leveling of the playing field.\nSusan understands that women have a strong tendency to behave badly when they feel they have the upper hand in a relationship due to their hypergamous nature.  If they can’t respect you, they despise you.  As Churchill once said of the proverbial Hun, they are either at your throat or at your feet.  This hypergamy presents a serious problem now, since the male dread of divorce has caused many men to quite reasonably become fearfully deferential of their wives and as a consequence rendered the marital relationship unstable.\nTherefore something is required to remove the feeling of the upper hand from the state-sponsored wife.  Enter “dread” or some other equally effective psychological substitute.  Contra Susan’s title, it is\nfailing\nto counter this state-imposed imbalance that will tend destroy marital relationships, and now that courts in the UK and USA are beginning to grant awards to women who are non-marital partners, increasingly threaten long-term non-marital relationships as well.\nHowever, this does not mean all men are well-advised to behave according to Roissy’s most extreme position.  It simply isn’t necessary or even productive in some cases.  Take Russell Brand, for example.  He can behave in the most omega manner possible, because his wife already knows beyond any shadow of a doubt that if she behaves badly or leaves him, he will immediately react by replacing her with two Victoria’s Secret angels, six topless lads mag models, a Hollywood actress, and three waitresses from a Thai restaurant, very possibly all at once.  The Roissyan “dread” for lack of a better word, is implicit in the core concept of “being married to Russell Brand”.\n(Side note.  SB and I laughed out loud when watching a quiz show on which Brand apologized to the women of England for not having slept with all of them despite his best efforts to do so.)\nAs with most things related to Game, the actionable concepts are not dogma meant to be accepted without question, but are instead designed to provide for the conscious emulation of the unconscious actions of men who are naturally successful with women\nregardless of the specific form that “success with women” is deemed to take\n.  This is the central concept that so many critics of Game fail to grasp.  Whether success means “nailing skank #3” or “remaining happily married to one’s beloved wife”, there will always be those men who manage it without trying and those men who don’t.  And the latter will always be well-served by learning from the example of the former.\nIt should be noted that just as some men don’t need to provide dread or drama, some women don’t require it.  Having the legal power of the state at her command is not necessarily going to translate into a feeling of superiority in a woman, especially one who happens to be more psychologically or emotionally vulnerable.  In the same way that Brand has no need to demonstrate his options, the vulnerable woman doesn’t need to be emotionally unsettled in order to prevent her from behaving badly.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-09T14:00:00+00:00"
}