{
  "url": "https://voxday.net/2011/02/03/krugman-catches-up/",
  "scraped_at": "2025-12-13T23:01:28.517423",
  "title": "Krugman catches up",
  "date_display": "February 3, 2011",
  "date_iso": "2011-02-03T09:43:00+00:00",
  "date_from_url": "2011-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://research.stlouisfed.org/fred2/graph/fredgraph.png?&amp;chart_type=line&amp;graph_id=&amp;category_id=&amp;recession_bars=On&amp;width=480&amp;height=378&amp;bgcolor=%23B3CDE7&amp;graph_bgcolor=%23FFFFFF&amp;txtcolor=%23000000&amp;ts=8&amp;preserve_ratio=false&amp;fo=ve&amp;id=GDPDEF,CPIAUCSL&amp;transformation=nbd,nbd&amp;scale=Left,Left&amp;range=Max,Max&amp;cosd=1947-01-01,1947-01-01&amp;coed=2010-10-01,2010-12-01&amp;line_color=%230000FF,%23006600&amp;link_values=,&amp;mark_type=NONE,NONE&amp;mw=4,4&amp;line_style=Solid,Solid&amp;lw=1,1&amp;vintage_date=2011-02-02,2011-02-02&amp;revision_date=2011-02-02,2011-02-02&amp;mma=0,0&amp;nd=1973-11-01,1973-11-01&amp;ost=,&amp;oet=,&amp;fml=a,a&amp;fq=Quarterly,Monthly&amp;fam=avg,avg&amp;fgst=lin,lin\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"252\" src=\"http://research.stlouisfed.org/fred2/graph/fredgraph.png?&amp;chart_type=line&amp;graph_id=&amp;category_id=&amp;recession_bars=On&amp;width=480&amp;height=378&amp;bgcolor=%23B3CDE7&amp;graph_bgcolor=%23FFFFFF&amp;txtcolor=%23000000&amp;ts=8&amp;preserve_ratio=false&amp;fo=ve&amp;id=GDPDEF,CPIAUCSL&amp;transformation=nbd,nbd&amp;scale=Left,Left&amp;range=Max,Max&amp;cosd=1947-01-01,1947-01-01&amp;coed=2010-10-01,2010-12-01&amp;line_color=%230000FF,%23006600&amp;link_values=,&amp;mark_type=NONE,NONE&amp;mw=4,4&amp;line_style=Solid,Solid&amp;lw=1,1&amp;vintage_date=2011-02-02,2011-02-02&amp;revision_date=2011-02-02,2011-02-02&amp;mma=0,0&amp;nd=1973-11-01,1973-11-01&amp;ost=,&amp;oet=,&amp;fml=a,a&amp;fq=Quarterly,Monthly&amp;fam=avg,avg&amp;fgst=lin,lin\" width=\"320\"/></a></div><p><a href=\"http://krugman.blogs.nytimes.com/2011/02/02/prices-and-plutocrats/\">What’s going on here</a>? It means that we’re either overstating inflation (and hence understating income gains) or overstating economic growth. Both the BEA (which measures GDP and related) and the BLS (which does consumer prices) work hard and honestly at their tasks; the difference probably arises (I’m sure someone has done this more carefully) in how you value new or improved goods. My sense has always been that the GDP accounts overdo their hedonics, but that’s very much a matter of opinion. Maybe the real point here is to remember, always, that economic statistics are a peculiarly boring sub-genre of science fiction; extremely useful, but not to be treated as absolute truth.</p></blockquote><p>From RGD Chapter 4, No One Knows Anything: <i>“Another indication that GDP growth may be exaggerated stems from comparing the data for the GDP deflator, which purports to correct GDP for inflation, with the Consumer Price Index, which is more commonly used as the primary measure of inflation. If one chooses 1983, the base year of index to which all of the historical CPI data are chained, one will find that the GDP deflator reports inflation of 79.1 percent over the last 26 years, while the CPI figure shows 114.1 percent inflation over the same period. While the two statistical measures are based on different criteria, their comparison shows the inverse of what one would tend to expect since CPI reflects the price of imported goods while the GDP deflator does not. And, as anyone who has been paying attention to the balance of trade over the last two decades will recognize, foreign imports tend to cost less than domestically manufactured products. Another oddity is the way in which an increase in the price of imported oil reduces the GDP deflator, thereby exaggerating GDP growth when the price of oil rises and reducing it when it drops. It’s interesting to note that when GDP is corrected for inflation using the CPI rather than the deflator, the real U.S. economy appears to be significantly smaller than it is presently believed to be. For example, whereas the GDP deflator shows growth from $3.1 trillion to $8.0 trillion over the last 26 years in 1983 dollars, using GDP-CPI would indicate a real 2009 GDP of only $6.6 trillion.”</i></p><p>My conclusion, of course, is that inflation has been erroneously defined and economic growth has been significantly overstated.  This will become readily apparent once it is no longer possible to conceal the bad debts that are still being recorded as positive assets on the corporate and government books.  And it is more than a little amusing to see Krugman admit that economic statistics are “a sub-genre of science fiction” and “not to be treated as absolute truth” considering the way in which he attempts to use them to macromanage the global economy.</p></div>",
  "content_text": "What’s going on here\n? It means that we’re either overstating inflation (and hence understating income gains) or overstating economic growth. Both the BEA (which measures GDP and related) and the BLS (which does consumer prices) work hard and honestly at their tasks; the difference probably arises (I’m sure someone has done this more carefully) in how you value new or improved goods. My sense has always been that the GDP accounts overdo their hedonics, but that’s very much a matter of opinion. Maybe the real point here is to remember, always, that economic statistics are a peculiarly boring sub-genre of science fiction; extremely useful, but not to be treated as absolute truth.\nFrom RGD Chapter 4, No One Knows Anything:\n“Another indication that GDP growth may be exaggerated stems from comparing the data for the GDP deflator, which purports to correct GDP for inflation, with the Consumer Price Index, which is more commonly used as the primary measure of inflation. If one chooses 1983, the base year of index to which all of the historical CPI data are chained, one will find that the GDP deflator reports inflation of 79.1 percent over the last 26 years, while the CPI figure shows 114.1 percent inflation over the same period. While the two statistical measures are based on different criteria, their comparison shows the inverse of what one would tend to expect since CPI reflects the price of imported goods while the GDP deflator does not. And, as anyone who has been paying attention to the balance of trade over the last two decades will recognize, foreign imports tend to cost less than domestically manufactured products. Another oddity is the way in which an increase in the price of imported oil reduces the GDP deflator, thereby exaggerating GDP growth when the price of oil rises and reducing it when it drops. It’s interesting to note that when GDP is corrected for inflation using the CPI rather than the deflator, the real U.S. economy appears to be significantly smaller than it is presently believed to be. For example, whereas the GDP deflator shows growth from $3.1 trillion to $8.0 trillion over the last 26 years in 1983 dollars, using GDP-CPI would indicate a real 2009 GDP of only $6.6 trillion.”\nMy conclusion, of course, is that inflation has been erroneously defined and economic growth has been significantly overstated.  This will become readily apparent once it is no longer possible to conceal the bad debts that are still being recorded as positive assets on the corporate and government books.  And it is more than a little amusing to see Krugman admit that economic statistics are “a sub-genre of science fiction” and “not to be treated as absolute truth” considering the way in which he attempts to use them to macromanage the global economy.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-03T09:43:00+00:00"
}