{
  "url": "https://voxday.net/2011/02/24/lets-try-this-one-more-time/",
  "scraped_at": "2025-12-13T23:03:26.732984",
  "title": "Let’s try this one more time",
  "date_display": "February 24, 2011",
  "date_iso": "2011-02-24T10:50:00+00:00",
  "date_from_url": "2011-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things I always find amusing about a discussion on the Internet is the reaction of the more dim-witted fans of one or both of the interlocutors.  For example, <a href=\"http://rsbakker.wordpress.com/2011/02/23/of-blood-and-titties/\">in his second response</a>, RS Bakker twice admits that he doesn’t understand what I’ve written, but doesn’t let this prevent him from spiraling downward into tangents wherein he attempts to engage in some minor psychoanalysis, demonstrates that he has not, in fact, understood what I’ve written, and finally reaches the conclusion that my argument (and Grin’s) could serve as proof to many modern fantasists that they are doing something right.  It was not surprising that this nimble performance elicited the following comment, presumably from a Bakker fan:  “What a trouncing! Bakker, you’re quite skilled in argument!”  Can you imagine how impressed that fan would have been if Bakker had actually managed to indicate that he understood anything relevant to the issue at hand?</p><p>Now, I have absolutely nothing personal against Bakker.  I haven’t read his novels, (which are apparently pretty good), and I don’t take exception to his opinion regarding my perceived moral cowardice, sense of moral superiority, or superlative sophistry.  (NB: I don’t have a sense of moral superiority, I have a sense of <i>intellectual</i> superiority.  Important difference there.)  Political columnists tend to be rather more familiar with criticism than the average published author since it tends to come with the territory.  After 10 years of receiving email from angry readers performing detailed exegeses of every weekly column, I barely even consider it criticism anymore if the nominal critic doesn’t see fit to threaten a) physical attack, or b) to not have sex with me.</p><p>Now, I was initially at somewhat of a loss regarding how I could better explain what I considered to be a pretty uncomplicated analogy, but a snarky little comment from another reader at Bakker’s place provided useful inspiration.  To wit: “Monochrome photography is photography where the image produced has a single hue, rather than recording the colours of the object that was photographed.”  In other words, the other hues simply are not there.  Now, by way of example, please tell me the color of the dilapidated house <a href=\"http://i.pbase.com/u14/shaun/upload/42590370.mud_barn.jpg\">in this photo</a>.  Is it brown?  Is it white?  Is it that faded blue-grey that you often see in half-collapsed houses out in the country?</p><p>Not only is it impossible to say what color it is, but just making a reasonable guess requires the viewer to draw upon his own experiences which are external to the photograph if he is even to begin formulating an opinion.  And it is not a value judgment, but a straightforward statement of fact, to observe that color information is missing from the image and therefore the ability of the viewer to formulate an opinion on the color of the object is severely handicapped.</p><p>So much for amorality.  Now on to alternative moral standards.  Consider <a href=\"http://www.thebestpageintheuniverse.net/images/crapart2_5.jpg\">this picture</a>.  Discerning art critics can certainly disagree on the aesthetic value of the image, but it would be very difficult to reasonably argue that it offers a more accurate or realistic picture of a historical automobile than <a href=\"http://www.carpictures.com/media/images/400/11BLA573524093AA.jpeg\">a more conventional image</a> that respects traditional color schemes.</p><p>It’s not difficult to demonstrate that Bakker has no idea what he’s talking about when he theorizes that I am committing a Consensus Fallacy in observing the literary decline of modern fantasy.  The Romance Writers of America report that the SF/F genre sold $554 million last year, of which a significant proportion were <i>Harry Potter</i> and <i>Twilight</i> books.  (Twilight books appear to be listed as Fantasy bestsellers, not Romance, based on a review of the RWA’s historical lists.)  Religion/inspirational sold $770 million.  Now, obviously not all books in the religious/inspirational category will reflect precisely the same moral standard, but it is sufficient evidence of a general belief in moral standards among the book-buying public to indicate that my case is not at all dependent upon the specific moral standards to which I happen to subscribe.</p><p>Furthermore, I didn’t say “that moral conflict requires “two immutable poles and two immutable poles only…”.  Nor did I imply it or assume it; I used the phrase “at least two moral poles” because that is the minimum number required to generate moral conflict.  Bakker is either being disingenuous or suffering from serious reading comprehension problems here to attempt summarizing the section on the requirements for moral conflict so inaccurately.</p><p>Finally, Bakker’s claim that he pressed my nose against the “imperative” of “art unconstrained by moral or religious prejudice” by emphasizing the way moral concerns marble my arguments against modern fantasy is downright laughable.  This is little more than a predictable, outdated and juvenile justification for artistic coprophagy that underlines my points about the literary decline of the genre.  This is the very transgressive mentality to which I referred in my original post.  I certainly don’t deny that I am making a value judgment about modern fantasy, what Bakker simply can’t seem to grasp is that I am expressing a <i>literary</i> judgment and not a <i>moral</i> one.  The fact that one of the causes of the genre’s literary decline can quite logically be attributed to observable moral color-blindness on the part of many modern fantasy authors does not make the observation a moral judgment, anymore than attributing the decline to historical ignorance would make it a historical judgment.</p><p>This isn’t double-talk or moral cowardice.  I am about as genuinely disinterested as it is possible to be and still be cognizant of the matter.  I have read everything from Nietzsche and Stalin to Keynes and Onfray without it ruffling my feathers so I’m not inclined to be perturbed by mere fictitious monsters.  If I was concerned that Joe or anyone else was “leading innocent souls to potential damnation” through nihilistic genre literature, my track record of publishing highly controversial opinions strongly suggests that I would not hesitate to say so.  The fact is that I simply don’t believe the writers of modern fantasy matter all that much, in part due to the literary decline of the genre.  As I stated before, they are a symptom of the greater societal decline, they are not a cause.</p><p>Of course no one likes to hear that their work can be reasonably compared to colorblind children producing monochromatic fingerpaintings.  Nor do they have to listen to such cricism.  I, for one, won’t mind in the least if the likes of Messrs. Bakker and Abercrombie ignore my opinion and continue basking in the critical acclaim for their moral vacuity, historically incoherent settings, and cardboard characterizations.  That is exactly what I expect them to do.  I am not writing for their benefit, but for the benefit of the generation of upcoming authors who are capable of learning from the mistakes of those who have gone before and wish to avoid reproducing them.</p><p>If the modern fantasists genuinely believe that more blood and titties is literary progress, by all means, let them write more.  Let a hundred nihilistic anti-heroes blossom into the murderous child rapists of their creators’ moralblind fantasies.  Just don’t expect me, or the large number of intelligent readers capable of noticing what John O’Neill described as “lost magic”, to be favorably impressed with the result.</p><p>Despite my mild distaste for Ursula Le Guin’s work, I thought J.S. Bangs had <a href=\"http://jsbangs.wordpress.com/2011/02/23/nihilists-i-mean-say-what-you-like-about-the-tenets-of-national-socialism-dude-at-least-its-an-ethos/\">an intelligent perspective on the matter</a> in his amusingly titled post:</p><blockquote><p>On the one hand: it’s possible that the “new gritty” is meant as a reaction against old narratives that have lost their power. But if that’s what those authors are trying to do, then I think they’re doing an awfully poor job of it, because—look, you can question conventional narratives or whatever without sliding into nihilism and madness. What you might do, instead, is offer an alternate model of heroism, an alternate view of goodness. If you do this well you can wind up with something that is compelling, inspiring, and life-changing in much the way that Tolkein and the classical heroic narratives are, but which compels people in a direction that you find more salutory. If you don’t think this can be done, I refer you to the entire oeurve of Ursula K. LeGuin, especially the Earthsea novels and her recent Annals of the Western Shore books. These books repudiate conventional heroic tropes in a variety of ways, but the result is not a demoralizing darkness, but the calm and confident demonstration that there is another way.</p><p>Of course, we can’t all be Ursula K. LeGuin. (Oh, but what if we could?) Still, if we grant that the foundations of reactionary fantasy are rotten (not something I agree with, but for the sake of argument), then a lot of the dark, gritty fantasy that I’ve sampled seems like it’s just kicking in the creaky old doors and drawing obscene graffiti in the entrance hall. If the literary building is decrepit, who cares? But this doesn’t impress me. Better you build something beautiful in the ruins.</p></blockquote><p>Of course, they don’t because they won’t and they won’t because they know they can’t.  If you can’t draw, you can still scribble.  If you can’t create, you can still deconstruct.  If you can’t build, you can still destroy.  And if you can’t argue, at least you can still mock.  None of this is new or even the least bit innovative.  I happened to have finished a book last night which makes it clear that the core concept is a tediously old one, older than Tolkien or even Howard.  The Preachers of Death call themselves creators, but they create only corpses.  Fortunately, in this case, the corpses are only imaginary.</p><p><i>To allure many from the herd—for that purpose have I come. The people and the herd must be angry with me: a robber shall Zarathustra be called by the herdsmen.</i></p><p>Herdsmen, I say, but they call themselves the good and just. Herdsmen, I say, but they call themselves the believers in the orthodox belief.</p><p>Behold the good and just! Whom do they hate most? Him who breaketh up their tables of values, the breaker, the lawbreaker:—he, however, is the creator.</p><p>Behold the believers of all beliefs! Whom do they hate most? Him who breaketh up their tables of values, the breaker, the law-breaker—he, however, is the creator.</p><p>Companions, the creator seeketh, not corpses—and not herds or believers either. Fellow-creators the creator seeketh—those who grave new values on new tables.</p><p>Companions, the creator seeketh, and fellow-reapers: for everything is ripe for the harvest with him. But he lacketh the hundred sickles: so he plucketh the ears of corn and is vexed.</p><p>Companions, the creator seeketh, and such as know how to whet their sickles. Destroyers, will they be called, and despisers of good and evil. But they are the reapers and rejoicers.”<br> – Friedrich Nietzsche, <i>Thus Spake Zarathustra</i>, IX</br></p><p>Jakob Schmidt had an interesting comment there which I also thought was worth addressing:</p><blockquote><p>Now, Theo’s color metaphor seems to imply that he deems ethical relativism to be somehow “too difficult” a concept to master for most writers. In other words, if a fantasy author doesn’t write from the clear cut notion that, e.g., “honorable conduct” (red) is fundamentally good and that “betraying your king” (blue) is inherently bad, the result will most probably be a muddled and ugly grey mess. What he doesn’t seem to take into account is the idea that a writer could write about moral values that are problematic to us, to allow a reader to react to them in an ethical way.</p></blockquote><p>No, I specifically allowed for that possibility, hence the analogy to the prospective ability of the master painter to paint without color and still achieve a superlative color effect.  But Jakob is correct, as given the observable inability of modern fantasy authors to competently portray historical religions and philosophies with any degree of versimilitude, the ethical relativism he described is without even the smallest modicum of doubt far, far beyond the literary and intellectual abilities of the average modern fantasy author.</p></div>",
  "content_text": "One of the things I always find amusing about a discussion on the Internet is the reaction of the more dim-witted fans of one or both of the interlocutors.  For example,\nin his second response\n, RS Bakker twice admits that he doesn’t understand what I’ve written, but doesn’t let this prevent him from spiraling downward into tangents wherein he attempts to engage in some minor psychoanalysis, demonstrates that he has not, in fact, understood what I’ve written, and finally reaches the conclusion that my argument (and Grin’s) could serve as proof to many modern fantasists that they are doing something right.  It was not surprising that this nimble performance elicited the following comment, presumably from a Bakker fan:  “What a trouncing! Bakker, you’re quite skilled in argument!”  Can you imagine how impressed that fan would have been if Bakker had actually managed to indicate that he understood anything relevant to the issue at hand?\nNow, I have absolutely nothing personal against Bakker.  I haven’t read his novels, (which are apparently pretty good), and I don’t take exception to his opinion regarding my perceived moral cowardice, sense of moral superiority, or superlative sophistry.  (NB: I don’t have a sense of moral superiority, I have a sense of\nintellectual\nsuperiority.  Important difference there.)  Political columnists tend to be rather more familiar with criticism than the average published author since it tends to come with the territory.  After 10 years of receiving email from angry readers performing detailed exegeses of every weekly column, I barely even consider it criticism anymore if the nominal critic doesn’t see fit to threaten a) physical attack, or b) to not have sex with me.\nNow, I was initially at somewhat of a loss regarding how I could better explain what I considered to be a pretty uncomplicated analogy, but a snarky little comment from another reader at Bakker’s place provided useful inspiration.  To wit: “Monochrome photography is photography where the image produced has a single hue, rather than recording the colours of the object that was photographed.”  In other words, the other hues simply are not there.  Now, by way of example, please tell me the color of the dilapidated house\nin this photo\n.  Is it brown?  Is it white?  Is it that faded blue-grey that you often see in half-collapsed houses out in the country?\nNot only is it impossible to say what color it is, but just making a reasonable guess requires the viewer to draw upon his own experiences which are external to the photograph if he is even to begin formulating an opinion.  And it is not a value judgment, but a straightforward statement of fact, to observe that color information is missing from the image and therefore the ability of the viewer to formulate an opinion on the color of the object is severely handicapped.\nSo much for amorality.  Now on to alternative moral standards.  Consider\nthis picture\n.  Discerning art critics can certainly disagree on the aesthetic value of the image, but it would be very difficult to reasonably argue that it offers a more accurate or realistic picture of a historical automobile than\na more conventional image\nthat respects traditional color schemes.\nIt’s not difficult to demonstrate that Bakker has no idea what he’s talking about when he theorizes that I am committing a Consensus Fallacy in observing the literary decline of modern fantasy.  The Romance Writers of America report that the SF/F genre sold $554 million last year, of which a significant proportion were\nHarry Potter\nand\nTwilight\nbooks.  (Twilight books appear to be listed as Fantasy bestsellers, not Romance, based on a review of the RWA’s historical lists.)  Religion/inspirational sold $770 million.  Now, obviously not all books in the religious/inspirational category will reflect precisely the same moral standard, but it is sufficient evidence of a general belief in moral standards among the book-buying public to indicate that my case is not at all dependent upon the specific moral standards to which I happen to subscribe.\nFurthermore, I didn’t say “that moral conflict requires “two immutable poles and two immutable poles only…”.  Nor did I imply it or assume it; I used the phrase “at least two moral poles” because that is the minimum number required to generate moral conflict.  Bakker is either being disingenuous or suffering from serious reading comprehension problems here to attempt summarizing the section on the requirements for moral conflict so inaccurately.\nFinally, Bakker’s claim that he pressed my nose against the “imperative” of “art unconstrained by moral or religious prejudice” by emphasizing the way moral concerns marble my arguments against modern fantasy is downright laughable.  This is little more than a predictable, outdated and juvenile justification for artistic coprophagy that underlines my points about the literary decline of the genre.  This is the very transgressive mentality to which I referred in my original post.  I certainly don’t deny that I am making a value judgment about modern fantasy, what Bakker simply can’t seem to grasp is that I am expressing a\nliterary\njudgment and not a\nmoral\none.  The fact that one of the causes of the genre’s literary decline can quite logically be attributed to observable moral color-blindness on the part of many modern fantasy authors does not make the observation a moral judgment, anymore than attributing the decline to historical ignorance would make it a historical judgment.\nThis isn’t double-talk or moral cowardice.  I am about as genuinely disinterested as it is possible to be and still be cognizant of the matter.  I have read everything from Nietzsche and Stalin to Keynes and Onfray without it ruffling my feathers so I’m not inclined to be perturbed by mere fictitious monsters.  If I was concerned that Joe or anyone else was “leading innocent souls to potential damnation” through nihilistic genre literature, my track record of publishing highly controversial opinions strongly suggests that I would not hesitate to say so.  The fact is that I simply don’t believe the writers of modern fantasy matter all that much, in part due to the literary decline of the genre.  As I stated before, they are a symptom of the greater societal decline, they are not a cause.\nOf course no one likes to hear that their work can be reasonably compared to colorblind children producing monochromatic fingerpaintings.  Nor do they have to listen to such cricism.  I, for one, won’t mind in the least if the likes of Messrs. Bakker and Abercrombie ignore my opinion and continue basking in the critical acclaim for their moral vacuity, historically incoherent settings, and cardboard characterizations.  That is exactly what I expect them to do.  I am not writing for their benefit, but for the benefit of the generation of upcoming authors who are capable of learning from the mistakes of those who have gone before and wish to avoid reproducing them.\nIf the modern fantasists genuinely believe that more blood and titties is literary progress, by all means, let them write more.  Let a hundred nihilistic anti-heroes blossom into the murderous child rapists of their creators’ moralblind fantasies.  Just don’t expect me, or the large number of intelligent readers capable of noticing what John O’Neill described as “lost magic”, to be favorably impressed with the result.\nDespite my mild distaste for Ursula Le Guin’s work, I thought J.S. Bangs had\nan intelligent perspective on the matter\nin his amusingly titled post:\nOn the one hand: it’s possible that the “new gritty” is meant as a reaction against old narratives that have lost their power. But if that’s what those authors are trying to do, then I think they’re doing an awfully poor job of it, because—look, you can question conventional narratives or whatever without sliding into nihilism and madness. What you might do, instead, is offer an alternate model of heroism, an alternate view of goodness. If you do this well you can wind up with something that is compelling, inspiring, and life-changing in much the way that Tolkein and the classical heroic narratives are, but which compels people in a direction that you find more salutory. If you don’t think this can be done, I refer you to the entire oeurve of Ursula K. LeGuin, especially the Earthsea novels and her recent Annals of the Western Shore books. These books repudiate conventional heroic tropes in a variety of ways, but the result is not a demoralizing darkness, but the calm and confident demonstration that there is another way.\nOf course, we can’t all be Ursula K. LeGuin. (Oh, but what if we could?) Still, if we grant that the foundations of reactionary fantasy are rotten (not something I agree with, but for the sake of argument), then a lot of the dark, gritty fantasy that I’ve sampled seems like it’s just kicking in the creaky old doors and drawing obscene graffiti in the entrance hall. If the literary building is decrepit, who cares? But this doesn’t impress me. Better you build something beautiful in the ruins.\nOf course, they don’t because they won’t and they won’t because they know they can’t.  If you can’t draw, you can still scribble.  If you can’t create, you can still deconstruct.  If you can’t build, you can still destroy.  And if you can’t argue, at least you can still mock.  None of this is new or even the least bit innovative.  I happened to have finished a book last night which makes it clear that the core concept is a tediously old one, older than Tolkien or even Howard.  The Preachers of Death call themselves creators, but they create only corpses.  Fortunately, in this case, the corpses are only imaginary.\nTo allure many from the herd—for that purpose have I come. The people and the herd must be angry with me: a robber shall Zarathustra be called by the herdsmen.\nHerdsmen, I say, but they call themselves the good and just. Herdsmen, I say, but they call themselves the believers in the orthodox belief.\nBehold the good and just! Whom do they hate most? Him who breaketh up their tables of values, the breaker, the lawbreaker:—he, however, is the creator.\nBehold the believers of all beliefs! Whom do they hate most? Him who breaketh up their tables of values, the breaker, the law-breaker—he, however, is the creator.\nCompanions, the creator seeketh, not corpses—and not herds or believers either. Fellow-creators the creator seeketh—those who grave new values on new tables.\nCompanions, the creator seeketh, and fellow-reapers: for everything is ripe for the harvest with him. But he lacketh the hundred sickles: so he plucketh the ears of corn and is vexed.\nCompanions, the creator seeketh, and such as know how to whet their sickles. Destroyers, will they be called, and despisers of good and evil. But they are the reapers and rejoicers.”\n– Friedrich Nietzsche,\nThus Spake Zarathustra\n, IX\nJakob Schmidt had an interesting comment there which I also thought was worth addressing:\nNow, Theo’s color metaphor seems to imply that he deems ethical relativism to be somehow “too difficult” a concept to master for most writers. In other words, if a fantasy author doesn’t write from the clear cut notion that, e.g., “honorable conduct” (red) is fundamentally good and that “betraying your king” (blue) is inherently bad, the result will most probably be a muddled and ugly grey mess. What he doesn’t seem to take into account is the idea that a writer could write about moral values that are problematic to us, to allow a reader to react to them in an ethical way.\nNo, I specifically allowed for that possibility, hence the analogy to the prospective ability of the master painter to paint without color and still achieve a superlative color effect.  But Jakob is correct, as given the observable inability of modern fantasy authors to competently portray historical religions and philosophies with any degree of versimilitude, the ethical relativism he described is without even the smallest modicum of doubt far, far beyond the literary and intellectual abilities of the average modern fantasy author.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-24T10:50:00+00:00"
}