{
  "url": "https://voxday.net/2011/02/26/mailvox-spelling-it-out-slowly/",
  "scraped_at": "2025-12-13T23:03:37.738815",
  "title": "Mailvox: Spelling it out slowly",
  "date_display": "February 26, 2011",
  "date_iso": "2011-02-26T11:23:00+00:00",
  "date_from_url": "2011-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James S doesn’t realize that it isn’t necessary to deal with the “meat of an argument” when the point that it is trying to defend is irrelevant.  He wrote, and I quote in full:</p><blockquote><p>“How can you possibly say this isn’t a moral argument? It feels like you are purposefully muddying the issue by making a distinction between ‘attributing’ the decline of genre to it’s amorality and the moral judgment that would be necessary to make the aforementioned attribution. This seems to be done to escape having to admit that the argument turns on morals (for it would then collapse) and turning it into one of literary aesthetics instead (which it is anything but as the crux of the argument rests on the ‘moral vacuity’ of the literature you claim is a symptom of a declining society). The distinctions are self-serving and at best contrived and artificial. This posting proves to me that you are indeed the moral coward Bakker claims you are.”</p></blockquote><p>First, while Bakker is by all accounts an entertaining writer, in making the accusation of “moral cowardice” he has also  shown himself to be an ignoramus who is attempting to spin words and concepts that he does not, by his own admission, understand.  To claim that I am a moral coward because I am directly and openly calling out the genre’s authors on what I believe to be their literary failures without also calling them out on their supposed moral failures is simply nonsensical.  It is obvious that James S, Bakker, and other putative Preachers of Death desperately want me to make a moral argument so they can preen in their juvenile transgressivism, attack the argument in relativistic terms, and thereby avoid dealing with the problematic matter of the material literary incompetence of modern fantasy.  This is why people keep trying to insist that I am making an argument that I have repeatedly and correctly informed them I am not making.</p><p>If I was to make a moral argument for the decline of SF/F literature, I would first define the moral standard to which I was holding the literature accountable, then compile comparative lists of transgressions against that standard committed by two sets of fantasy authors, those writing from 1930 to 1960 and from 1980 to 2010.  If significantly more transgressions were committed by the latter, my point would be supported.  If not, my point would fail.  While critics could certainly debate the question of whether the selected moral standard was relevant or not, no one, myself included, could dispute that the argument was an intrinsically moral one.  Of course, I have done absolutely nothing of the sort for the obvious reason that I have not presented a moral argument… note that my critics can’t even tell what moral standard I am supposedly utilizing as the basis for this nonexistent moral argument.</p><p>James appears to suspect on some level that the case he presents here is an invalid one.  Which is, in fact, the case.  Note the weaselly approach as he attempts to derive a “proves” from a “seems” plus a “feels”.  When I correctly dealt with the actual question posed – <i>How can you say this isn’t a moral argument?  Because it demonstrably is not.</i> – he tried to claim that I was avoiding the core of his argument.  But it is not necessary to address an argument that is based on nothing more than James’s feelings and perceptions.</p><p>Of course, since I, too, have my share of character flaws and take an amount of unseemly and sadistic pleasure in rubbing my intellectual supremacy in the face of those who are unwise enough to directly challenge me on it, I will first correct James’s argument by transforming it into one that is not dependent upon his feelings.  Then I will show why his argument is incorrect, even when presented in a relevant form.</p><p>I paraphrase his argument thusly: <i>How can you say the decline of the SF/F genre isn’t a moral argument? I believe you are purposefully muddying the issue by making a distinction between attributing the decline of genre to its amorality and the moral judgment that is required to make this attribution.  You are making this distinction in order to escape having to admit that the argument turns on morals and turning it into one of literary aesthetics instead because you cannot successfully make the moral argument. The distinction between the attribution and the moral judgement are contrived, artificial, and self-serving and the fact that you are unwilling to make the moral argument directly proves you are a moral coward.</i></p><p>1.  I can say the decline of the SF/F genre is not a moral argument because morality is only one of many possible metrics in which decline of the genre can be measured.  Decline can be measured in book sales, in real dollar revenue corrected for inflation, in failure to abide by traditional moral standards, in historical accuracy, in logical consistency, in scope of ambition, or in literary quality, just to name a few possible metrics.  My argument happens to be focused on what I perceive to be the decline in literary quality, although I am certain one could make a convincing argument with regards to the genre’s increasing failure to abide by conventional moral standards if one so chose.  I may even do so one day, primarily for the purposes of demonstrating to the dim-witted or insufficiently imaginative that it can be done.  But the fact that one can make the moral argument does not indicate that one must do so in the course of making any of the other arguments.</p><p>2.  I did not invent the distinction between “‘attributing’ the decline of genre to it’s amorality” and “the moral judgment that is required to make this attribution”.  It is, quite clearly, a distinction that is absolutely necessary in order to determine if the observation is correct or not based on the chosen metric.  Being necessary, it is neither artificial nor contrived, and it is only self-serving for me in this case because my argument happens to be correct.  Were my observations not correctly in line with the metric selected, it would not be self-serving.  If I had attributed the decline of the genre to the lengths of the books published, would anyone be dumb enough to assert that this attribution was not distinct from the knowledge of book lengths required to make it?</p><p>To underline how absurd James’s attempted elimination of the distinction is, let us return to the technological example.  As with the book lengths, there is an obvious distinction between “attributing the decline of genre to its technological incongruency” and “the technological judgment that is required to make this attribution”?  There has to be a distinction, there always will be, because the former is an act and the latter is a capacity.  While it is true that it is necessary to be sufficiently technologically (morally) aware to perceive a potential decline in literary quality due to technological incongruency (amorality), the ability to make an informed judgment cannot possibly be equated with the judgment itself.  The distinction is both real and necessary.</p><p>3.  James should note that it is not at all necessary to subscribe to a moral standard to a) have the capability to make a judgment concerning whether something abides by that moral standard or not and b) determine that something does or does not abide by that standard or not.  I am not a Muslim, nor do I subscribe to Islamic moral standards, but I know enough about Islam to be able to determine if a book is respectful of Islamic morals or not.  What this discussion has revealed quite clearly is that many fans of the genre lack both the moral knowledge and intellectual capacity to participate in a rational discussion of the subject.  This is why their arguments in attempted defense of the state of the genre have been so uniformly irrelevant; lacking the ability to see color, they have nothing to offer in a discussion of whether the painter would have done better to consider using a different color palette.</p><p>4.  The irrelevance of the moral argument obviously removes the foundation for the accusation of moral cowardice.</p><p>5.  James wrote in a subsequent comment: <i>“If my argument (and it is one out of many issues I have with this post) is so obviously wrong, then show me. A decline to do so reads as an inability to do so, however you dress it up as disinterest with my ability to comprehend your obvious superiority. Again, quote my argument and dismember it. If you can prove me wrong I think I could admit it, but all you have done is again and again in different ways call me names and assert your intellectual superiority. I would ask you to stop embarrassing yourself but you seem hellbent on proving yourself superior (in any way possible), and in doing so you have only proven your need to feel superior. Quote the argument!”</i> Once more, it should be clear to all and sundry that I have no need to feel intellectually superior, since it happens to be an observable fact that I can demonstrate at will.  The fact that I often don’t bother to address an invalid or irrelevant argument should never be confused with an inability to do so.  I trust James will feel entirely satisfied that his argument has been quoted in full and dismembered, as per his request.</p></div>",
  "content_text": "James S doesn’t realize that it isn’t necessary to deal with the “meat of an argument” when the point that it is trying to defend is irrelevant.  He wrote, and I quote in full:\n“How can you possibly say this isn’t a moral argument? It feels like you are purposefully muddying the issue by making a distinction between ‘attributing’ the decline of genre to it’s amorality and the moral judgment that would be necessary to make the aforementioned attribution. This seems to be done to escape having to admit that the argument turns on morals (for it would then collapse) and turning it into one of literary aesthetics instead (which it is anything but as the crux of the argument rests on the ‘moral vacuity’ of the literature you claim is a symptom of a declining society). The distinctions are self-serving and at best contrived and artificial. This posting proves to me that you are indeed the moral coward Bakker claims you are.”\nFirst, while Bakker is by all accounts an entertaining writer, in making the accusation of “moral cowardice” he has also  shown himself to be an ignoramus who is attempting to spin words and concepts that he does not, by his own admission, understand.  To claim that I am a moral coward because I am directly and openly calling out the genre’s authors on what I believe to be their literary failures without also calling them out on their supposed moral failures is simply nonsensical.  It is obvious that James S, Bakker, and other putative Preachers of Death desperately want me to make a moral argument so they can preen in their juvenile transgressivism, attack the argument in relativistic terms, and thereby avoid dealing with the problematic matter of the material literary incompetence of modern fantasy.  This is why people keep trying to insist that I am making an argument that I have repeatedly and correctly informed them I am not making.\nIf I was to make a moral argument for the decline of SF/F literature, I would first define the moral standard to which I was holding the literature accountable, then compile comparative lists of transgressions against that standard committed by two sets of fantasy authors, those writing from 1930 to 1960 and from 1980 to 2010.  If significantly more transgressions were committed by the latter, my point would be supported.  If not, my point would fail.  While critics could certainly debate the question of whether the selected moral standard was relevant or not, no one, myself included, could dispute that the argument was an intrinsically moral one.  Of course, I have done absolutely nothing of the sort for the obvious reason that I have not presented a moral argument… note that my critics can’t even tell what moral standard I am supposedly utilizing as the basis for this nonexistent moral argument.\nJames appears to suspect on some level that the case he presents here is an invalid one.  Which is, in fact, the case.  Note the weaselly approach as he attempts to derive a “proves” from a “seems” plus a “feels”.  When I correctly dealt with the actual question posed –\nHow can you say this isn’t a moral argument?  Because it demonstrably is not.\n– he tried to claim that I was avoiding the core of his argument.  But it is not necessary to address an argument that is based on nothing more than James’s feelings and perceptions.\nOf course, since I, too, have my share of character flaws and take an amount of unseemly and sadistic pleasure in rubbing my intellectual supremacy in the face of those who are unwise enough to directly challenge me on it, I will first correct James’s argument by transforming it into one that is not dependent upon his feelings.  Then I will show why his argument is incorrect, even when presented in a relevant form.\nI paraphrase his argument thusly:\nHow can you say the decline of the SF/F genre isn’t a moral argument? I believe you are purposefully muddying the issue by making a distinction between attributing the decline of genre to its amorality and the moral judgment that is required to make this attribution.  You are making this distinction in order to escape having to admit that the argument turns on morals and turning it into one of literary aesthetics instead because you cannot successfully make the moral argument. The distinction between the attribution and the moral judgement are contrived, artificial, and self-serving and the fact that you are unwilling to make the moral argument directly proves you are a moral coward.\n1.  I can say the decline of the SF/F genre is not a moral argument because morality is only one of many possible metrics in which decline of the genre can be measured.  Decline can be measured in book sales, in real dollar revenue corrected for inflation, in failure to abide by traditional moral standards, in historical accuracy, in logical consistency, in scope of ambition, or in literary quality, just to name a few possible metrics.  My argument happens to be focused on what I perceive to be the decline in literary quality, although I am certain one could make a convincing argument with regards to the genre’s increasing failure to abide by conventional moral standards if one so chose.  I may even do so one day, primarily for the purposes of demonstrating to the dim-witted or insufficiently imaginative that it can be done.  But the fact that one can make the moral argument does not indicate that one must do so in the course of making any of the other arguments.\n2.  I did not invent the distinction between “‘attributing’ the decline of genre to it’s amorality” and “the moral judgment that is required to make this attribution”.  It is, quite clearly, a distinction that is absolutely necessary in order to determine if the observation is correct or not based on the chosen metric.  Being necessary, it is neither artificial nor contrived, and it is only self-serving for me in this case because my argument happens to be correct.  Were my observations not correctly in line with the metric selected, it would not be self-serving.  If I had attributed the decline of the genre to the lengths of the books published, would anyone be dumb enough to assert that this attribution was not distinct from the knowledge of book lengths required to make it?\nTo underline how absurd James’s attempted elimination of the distinction is, let us return to the technological example.  As with the book lengths, there is an obvious distinction between “attributing the decline of genre to its technological incongruency” and “the technological judgment that is required to make this attribution”?  There has to be a distinction, there always will be, because the former is an act and the latter is a capacity.  While it is true that it is necessary to be sufficiently technologically (morally) aware to perceive a potential decline in literary quality due to technological incongruency (amorality), the ability to make an informed judgment cannot possibly be equated with the judgment itself.  The distinction is both real and necessary.\n3.  James should note that it is not at all necessary to subscribe to a moral standard to a) have the capability to make a judgment concerning whether something abides by that moral standard or not and b) determine that something does or does not abide by that standard or not.  I am not a Muslim, nor do I subscribe to Islamic moral standards, but I know enough about Islam to be able to determine if a book is respectful of Islamic morals or not.  What this discussion has revealed quite clearly is that many fans of the genre lack both the moral knowledge and intellectual capacity to participate in a rational discussion of the subject.  This is why their arguments in attempted defense of the state of the genre have been so uniformly irrelevant; lacking the ability to see color, they have nothing to offer in a discussion of whether the painter would have done better to consider using a different color palette.\n4.  The irrelevance of the moral argument obviously removes the foundation for the accusation of moral cowardice.\n5.  James wrote in a subsequent comment:\n“If my argument (and it is one out of many issues I have with this post) is so obviously wrong, then show me. A decline to do so reads as an inability to do so, however you dress it up as disinterest with my ability to comprehend your obvious superiority. Again, quote my argument and dismember it. If you can prove me wrong I think I could admit it, but all you have done is again and again in different ways call me names and assert your intellectual superiority. I would ask you to stop embarrassing yourself but you seem hellbent on proving yourself superior (in any way possible), and in doing so you have only proven your need to feel superior. Quote the argument!”\nOnce more, it should be clear to all and sundry that I have no need to feel intellectually superior, since it happens to be an observable fact that I can demonstrate at will.  The fact that I often don’t bother to address an invalid or irrelevant argument should never be confused with an inability to do so.  I trust James will feel entirely satisfied that his argument has been quoted in full and dismembered, as per his request.",
  "tags": [
    "mailvox",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-26T11:23:00+00:00"
}