{
  "url": "https://voxday.net/2011/02/15/never-show-weakness/",
  "scraped_at": "2025-12-13T23:02:34.189269",
  "title": "Never show weakness",
  "date_display": "February 15, 2011",
  "date_iso": "2011-02-15T14:30:00+00:00",
  "date_from_url": "2011-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not to women, children, or dogs, anyhow.  Roissy tells <a href=\"http://roissy.wordpress.com/2011/02/14/soulkill/\">the tale of a text message</a> written in response to a blow-off:</p><blockquote><p>I begin reading his reply in a trembly voice, imitating as best I can a lovelorn beta. Paraphrased:</p><p>“Ok, I’m sorry to hear that. I was hoping we could date a few more times and see where it goes. I think you are really great, and a very special girl, and I felt we had something between us. I definitely felt we bonded on our dates together. Remember that time playing pool? That was pretty funny. But oh well, if you need some time to yourself, I understand. If you ever change your mind, you know where to email me. I’m willing to give it another try if you are. Ciao.”</p></blockquote><p>Look, guys, no woman ever needs any time to herself.  With very few exceptions, women are not contemplative and few can even entertain themselves for any extended period of time.  The expression is merely a conflict-avoidance device utilized to communicate a lack of romantic interest.  The correct translation of “time to herself” means “time with men who are not you” and by “time” she means “until the end of it”.  If a woman is genuinely attracted to a man, she will make time for him even if it means abandoning her children, quitting her job, or doing without food and sleep.</p><p>But a blow-off shouldn’t inspire this cringing, lachrymose attempt to convince a woman that she has made the wrong choice.  “I definitely felt we bonded”… seriously?  This is classic delta and all it does is convince her that she was right to blow off the weakling when she did and make him a figure of mockery and scorn.  The correct response, as numerous Chateau denizens have pointed out in the comments, is nothing.  Niente.  No response.  To lash back at her over nothing more than legitimate rejection would be gamma; this need to ensure the rejector that there are no hard feelings on the part of the rejectee is pure delta.  The omega, of course, will vow eternal vengeance (to himself) and tell his fellow rejects about the ten different terrible things that would teach his rejector a lesson she’d never forget if he ever followed through on one.  Which he won’t.  There is no single appropriate alpha response, as the real alpha is already involved with at least one of her friends and will feel relieved that a potentially messy problem has sorted itself out again without requiring any effort on his part.</p><p>The sigma response, of course, is “????”</p><p>Now, since there are clearly a few quasi-aspies here of the sort that regularly drive the Chateau regulars mad with their inability to understand the concept of behavioral gradations, the injunction to show no weakness is a relative one.  If you are covered in blood, surrounded by headless bodies, and holding a severed head in your hand, then you can safely shed a tear or two and permit a woman to read your diary of secret doubts about your courage and masculinity.  Any perceived weakness will be tend to be outweighed in her mind by your manifest ability to wreak massive havoc and that delicious sense of fear and security it inspires in her.</p><p>Please note that I am primarily speaking metaphorically here despite the literal truth of the statement.  Casanova can confess his fears of rejection without concern, (although quite possibly not without sarcasm), because the woman knows that if she rejects him he can and will find a replacement for her within days, if not hours.  Your average delta – and this very probably means you* – not so much.  In summary, the strong man can afford to be seen as vulnerable, but the average man cannot.</p><p><i>*Except you, of course.  You are a unique and precious sigma snowflake.</i></p><p>Which reminds me.  Pop socio-sexual rank quiz:</p><p>Omega: You have threatened to kill yourself over a woman.  But you stalked her instead.<br> Gamma: You have thought about killing yourself over a woman.  But you wrote about how she made you feel instead. <br> Delta: You have taken it seriously when a woman threatened to kill herself.  She did not do it.<br> Beta: You have listened to a woman threatening to kill herself over your best friend.  With some amusement.  On more than one occasion.<br> Alpha: A woman with whom you were involved has threatened to kill you because you also had sex with a) her roommate, b) her best friend, or c) her sister.<br> Sigma: A woman has asked you to kill her during sex.  You thought it was hot.</br></br></br></br></br></p><p>UPDATE: The Dark Lord <a href=\"http://roissy.wordpress.com/2011/02/15/how-to-respond-to-a-girl-who-dumps-you-over-facebook/\">explains the optimal response to a blow-off</a> and why it is better than the alternatives.  You’ll note that it is precisely the response I recommended:</p><blockquote><p>#1: No response. (Credit: Gorbachev)</p><p>90% of the time, and in 90% of situations, this will be your best option. Radio silence is a failsafe method for causing reckless hamster spin in a woman’s headspace. You have got to understand a couple of things about women and breaking up.</p><p>One, women initiate most breakups. I have read it is on the order of 75-85% of all breakups. Women also initiate 2/3rds to 3/4ths or more of all divorces.</p><p>Two, women secretly get a thrill out of the power they wield as society’s de facto hypergamous dumpers. When a woman dumps a man, she wants to know she got to him. Though she will never admit it, the act of gettting to a man is a blissful ego massage for the typical woman.</p></blockquote></div>",
  "content_text": "Not to women, children, or dogs, anyhow.  Roissy tells\nthe tale of a text message\nwritten in response to a blow-off:\nI begin reading his reply in a trembly voice, imitating as best I can a lovelorn beta. Paraphrased:\n“Ok, I’m sorry to hear that. I was hoping we could date a few more times and see where it goes. I think you are really great, and a very special girl, and I felt we had something between us. I definitely felt we bonded on our dates together. Remember that time playing pool? That was pretty funny. But oh well, if you need some time to yourself, I understand. If you ever change your mind, you know where to email me. I’m willing to give it another try if you are. Ciao.”\nLook, guys, no woman ever needs any time to herself.  With very few exceptions, women are not contemplative and few can even entertain themselves for any extended period of time.  The expression is merely a conflict-avoidance device utilized to communicate a lack of romantic interest.  The correct translation of “time to herself” means “time with men who are not you” and by “time” she means “until the end of it”.  If a woman is genuinely attracted to a man, she will make time for him even if it means abandoning her children, quitting her job, or doing without food and sleep.\nBut a blow-off shouldn’t inspire this cringing, lachrymose attempt to convince a woman that she has made the wrong choice.  “I definitely felt we bonded”… seriously?  This is classic delta and all it does is convince her that she was right to blow off the weakling when she did and make him a figure of mockery and scorn.  The correct response, as numerous Chateau denizens have pointed out in the comments, is nothing.  Niente.  No response.  To lash back at her over nothing more than legitimate rejection would be gamma; this need to ensure the rejector that there are no hard feelings on the part of the rejectee is pure delta.  The omega, of course, will vow eternal vengeance (to himself) and tell his fellow rejects about the ten different terrible things that would teach his rejector a lesson she’d never forget if he ever followed through on one.  Which he won’t.  There is no single appropriate alpha response, as the real alpha is already involved with at least one of her friends and will feel relieved that a potentially messy problem has sorted itself out again without requiring any effort on his part.\nThe sigma response, of course, is “????”\nNow, since there are clearly a few quasi-aspies here of the sort that regularly drive the Chateau regulars mad with their inability to understand the concept of behavioral gradations, the injunction to show no weakness is a relative one.  If you are covered in blood, surrounded by headless bodies, and holding a severed head in your hand, then you can safely shed a tear or two and permit a woman to read your diary of secret doubts about your courage and masculinity.  Any perceived weakness will be tend to be outweighed in her mind by your manifest ability to wreak massive havoc and that delicious sense of fear and security it inspires in her.\nPlease note that I am primarily speaking metaphorically here despite the literal truth of the statement.  Casanova can confess his fears of rejection without concern, (although quite possibly not without sarcasm), because the woman knows that if she rejects him he can and will find a replacement for her within days, if not hours.  Your average delta – and this very probably means you* – not so much.  In summary, the strong man can afford to be seen as vulnerable, but the average man cannot.\n*Except you, of course.  You are a unique and precious sigma snowflake.\nWhich reminds me.  Pop socio-sexual rank quiz:\nOmega: You have threatened to kill yourself over a woman.  But you stalked her instead.\nGamma: You have thought about killing yourself over a woman.  But you wrote about how she made you feel instead.\nDelta: You have taken it seriously when a woman threatened to kill herself.  She did not do it.\nBeta: You have listened to a woman threatening to kill herself over your best friend.  With some amusement.  On more than one occasion.\nAlpha: A woman with whom you were involved has threatened to kill you because you also had sex with a) her roommate, b) her best friend, or c) her sister.\nSigma: A woman has asked you to kill her during sex.  You thought it was hot.\nUPDATE: The Dark Lord\nexplains the optimal response to a blow-off\nand why it is better than the alternatives.  You’ll note that it is precisely the response I recommended:\n#1: No response. (Credit: Gorbachev)\n90% of the time, and in 90% of situations, this will be your best option. Radio silence is a failsafe method for causing reckless hamster spin in a woman’s headspace. You have got to understand a couple of things about women and breaking up.\nOne, women initiate most breakups. I have read it is on the order of 75-85% of all breakups. Women also initiate 2/3rds to 3/4ths or more of all divorces.\nTwo, women secretly get a thrill out of the power they wield as society’s de facto hypergamous dumpers. When a woman dumps a man, she wants to know she got to him. Though she will never admit it, the act of gettting to a man is a blissful ego massage for the typical woman.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-15T14:30:00+00:00"
}