{
  "url": "https://voxday.net/2011/02/21/no-place-for-cowards/",
  "scraped_at": "2025-12-13T23:03:11.457581",
  "title": "No place for cowards",
  "date_display": "February 21, 2011",
  "date_iso": "2011-02-21T21:00:00+00:00",
  "date_from_url": "2011-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Marriage is no place for cowards. No woman wants to be married to a man she can intimidate, even if she tries from time to time.  Men have to realize that if they want to have a happy home, they have to be a man <a href=\"http://hawaiianlibertarian.blogspot.com/2011/02/is-your-home-haven-or-hellhole.html\">about facing up to conflict</a>.</p><blockquote><p>Remember the old saying, “Home is Where the Heart is?” That only applies if you relish being in your home in the first place. And that ‘aint gonna happen if you live every waking moment in your home, fearful of upsetting your wife. Lying to her to try and avoid upsetting her only makes it worse, because even if you don’t consciously realize it, you will hate yourself for living a lie.</p><p>Home is supposed to be your sanctuary. Your place to rest, relax, and recharge, so that you can get ready to go out and face the world another day…knowing you can come home and let your guard down and just enjoy the company of your family upon your return.  How can you do that when you’re afraid of doing or saying something, and than having to deal with an upset tyrant of a spouse?</p><p>That is because you are not supposed to be under the dominion of her emotional state in the first place.</p></blockquote><p>I understand that for many men, this is a concept that is much easier to agree with than to put into effect.  But if you are under the dominion of a woman’s emotional state, you have to break free of it for her sake as well as your own.  How can you be relied upon if you are constantly being blown to and fro in the winds of her emotional hurricanes?  How can she feel secure with a protector who is a pushover? However, keep in mind that it’s also important not to overdo it with your reaction, as so many men and women do when they have finally resolved to act against their habitual behavioral patterns.</p><p>Remember that practice makes perfect.  The man in control of himself doesn’t fear the rage of an out-of-control woman anymore than the boxer fears getting hit.  He has absolutely no doubt that he can take the shot <i>because he has taken it before.</i> So, look for opportunities to practice facing up to your fear.  The next time you find yourself tempted to shade the truth or avoid telling her something because you are afraid of her reaction, first remind yourself of the Litany Against Fear and then assume that you’re going to be busy not exacerbating the situation by giving into your own emotions for the next 15 minutes.</p><p><i>I must not fear.<br> Fear is the mind-killer.<br> Fear is the little-death that brings total obliteration.<br> I will face my fear.<br> I will permit it to pass over me and through me….</br></br></br></br></i></p><p>Then go and tell her whatever trivial thing you suspect is going to set her off and refuse to react regardless of how she emotes.  Then, once the storm has blown itself out, smile and go about your business.  You will almost surely find yourself thinking that it really wasn’t that bad after all.  And that should give you the strength required to face up to the next emotional storm when it becomes necessary.</p><p>I love being in my home.  I love being with Spacebunny.  But then, I’m not afraid of her emotions.</p></div>",
  "content_text": "Marriage is no place for cowards. No woman wants to be married to a man she can intimidate, even if she tries from time to time.  Men have to realize that if they want to have a happy home, they have to be a man\nabout facing up to conflict\n.\nRemember the old saying, “Home is Where the Heart is?” That only applies if you relish being in your home in the first place. And that ‘aint gonna happen if you live every waking moment in your home, fearful of upsetting your wife. Lying to her to try and avoid upsetting her only makes it worse, because even if you don’t consciously realize it, you will hate yourself for living a lie.\nHome is supposed to be your sanctuary. Your place to rest, relax, and recharge, so that you can get ready to go out and face the world another day…knowing you can come home and let your guard down and just enjoy the company of your family upon your return.  How can you do that when you’re afraid of doing or saying something, and than having to deal with an upset tyrant of a spouse?\nThat is because you are not supposed to be under the dominion of her emotional state in the first place.\nI understand that for many men, this is a concept that is much easier to agree with than to put into effect.  But if you are under the dominion of a woman’s emotional state, you have to break free of it for her sake as well as your own.  How can you be relied upon if you are constantly being blown to and fro in the winds of her emotional hurricanes?  How can she feel secure with a protector who is a pushover? However, keep in mind that it’s also important not to overdo it with your reaction, as so many men and women do when they have finally resolved to act against their habitual behavioral patterns.\nRemember that practice makes perfect.  The man in control of himself doesn’t fear the rage of an out-of-control woman anymore than the boxer fears getting hit.  He has absolutely no doubt that he can take the shot\nbecause he has taken it before.\nSo, look for opportunities to practice facing up to your fear.  The next time you find yourself tempted to shade the truth or avoid telling her something because you are afraid of her reaction, first remind yourself of the Litany Against Fear and then assume that you’re going to be busy not exacerbating the situation by giving into your own emotions for the next 15 minutes.\nI must not fear.\nFear is the mind-killer.\nFear is the little-death that brings total obliteration.\nI will face my fear.\nI will permit it to pass over me and through me….\nThen go and tell her whatever trivial thing you suspect is going to set her off and refuse to react regardless of how she emotes.  Then, once the storm has blown itself out, smile and go about your business.  You will almost surely find yourself thinking that it really wasn’t that bad after all.  And that should give you the strength required to face up to the next emotional storm when it becomes necessary.\nI love being in my home.  I love being with Spacebunny.  But then, I’m not afraid of her emotions.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-21T21:00:00+00:00"
}