{
  "url": "https://voxday.net/2011/02/11/no-psycho/",
  "scraped_at": "2025-12-13T23:02:12.208418",
  "title": "No psycho",
  "date_display": "February 11, 2011",
  "date_iso": "2011-02-11T09:50:00+00:00",
  "date_from_url": "2011-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since Zoegirl seemed surprised at my comment that I tend towards narcissism rather than psychopathy, I thought it perhaps a modicum of evidence might be in order.  So, I <a href=\"http://www.okcupid.com/tests/the-psychopathy-test\">took an online version of the psychopathy test</a> to see if the results on the Hare’s Psychopathy Checklist-Revised were in harmony with my admittedly biased observations.  As with all tests of this sort, it is transparently easy to direct the results, but I gave honest answers that my friends and family would generally be able to confirm.  The result was as follows:</p><p><i>Narcissus: You scored 12 on Emotional Detachment and 9 on Chaotic Lifestyle. You are not quite a psycho, but you have problems in one of the aspects of psychopathy: emotional detachment.</i></p><p>What I find amusing about the test is that I simply don’t see a reasonable amount of emotional detachment as any sort of problem at all, considering how many problems are observably caused by the way in which so many make use of emotion in the place of reason in their decision-making.  It’s not as if I don’t have the same emotions everyone else does, I simply have the ability to take them into account or not most of the time rather than being ruled by them.  What one calls emotional detachment another might as reasonably call self-control.  Of course, one of my biggest challenges in relating to others over the years has been dealing with what I tend to see as a complete inability to grasp what is quite clearly in their own interest, which was why I had to construct a non-judgmental MPAI philosophical framework before I was able to find any success in convincing people of even the most obvious things.</p><p>What I’ve learned that until you can ensure that the clear-cut logical path is not in direct opposition to someone’s emotional inclinations, (or better yet, is at least somewhat in line with them), you will find it nearly impossible to convince them of what a less-biased party would consider irrefutable.  This is hardly news, for as it has long been said, “one convinced against his will is of the same opinion still.”  But it is one thing to be familiar with the aphorism and another to actively account for it as a regular practice.</p><p>It’s almost a pity I’m not a psychopath, though, as it appears I am <a href=\"http://www.okcupid.com/tests/the-how-well-read-are-you-test1\"> Incredibly Well-Read</a>: <i>“Your level of Well-Readliness is 100 %! *Applause* You. Are. Amazing.”</i> If only I’d scored higher and could cook, I might have been a Hannibal Lector.  On the other hand, I don’t think much of chianti.  Also, note that notwithstanding the reported results, it is a 30+ score that indicates genuine psychopathy, not 20+.</p></div>",
  "content_text": "Since Zoegirl seemed surprised at my comment that I tend towards narcissism rather than psychopathy, I thought it perhaps a modicum of evidence might be in order.  So, I\ntook an online version of the psychopathy test\nto see if the results on the Hare’s Psychopathy Checklist-Revised were in harmony with my admittedly biased observations.  As with all tests of this sort, it is transparently easy to direct the results, but I gave honest answers that my friends and family would generally be able to confirm.  The result was as follows:\nNarcissus: You scored 12 on Emotional Detachment and 9 on Chaotic Lifestyle. You are not quite a psycho, but you have problems in one of the aspects of psychopathy: emotional detachment.\nWhat I find amusing about the test is that I simply don’t see a reasonable amount of emotional detachment as any sort of problem at all, considering how many problems are observably caused by the way in which so many make use of emotion in the place of reason in their decision-making.  It’s not as if I don’t have the same emotions everyone else does, I simply have the ability to take them into account or not most of the time rather than being ruled by them.  What one calls emotional detachment another might as reasonably call self-control.  Of course, one of my biggest challenges in relating to others over the years has been dealing with what I tend to see as a complete inability to grasp what is quite clearly in their own interest, which was why I had to construct a non-judgmental MPAI philosophical framework before I was able to find any success in convincing people of even the most obvious things.\nWhat I’ve learned that until you can ensure that the clear-cut logical path is not in direct opposition to someone’s emotional inclinations, (or better yet, is at least somewhat in line with them), you will find it nearly impossible to convince them of what a less-biased party would consider irrefutable.  This is hardly news, for as it has long been said, “one convinced against his will is of the same opinion still.”  But it is one thing to be familiar with the aphorism and another to actively account for it as a regular practice.\nIt’s almost a pity I’m not a psychopath, though, as it appears I am\nIncredibly Well-Read\n:\n“Your level of Well-Readliness is 100 %! *Applause* You. Are. Amazing.”\nIf only I’d scored higher and could cook, I might have been a Hannibal Lector.  On the other hand, I don’t think much of chianti.  Also, note that notwithstanding the reported results, it is a 30+ score that indicates genuine psychopathy, not 20+.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-11T09:50:00+00:00"
}