{
  "url": "https://voxday.net/2011/02/13/nonsense-of-noir/",
  "scraped_at": "2025-12-13T23:02:23.200919",
  "title": "The nonsense of noir",
  "date_display": "February 13, 2011",
  "date_iso": "2011-02-13T15:26:00+00:00",
  "date_from_url": "2011-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I recently read three more books in <i>The Dresden Files</i>, the popular noir magic series written by Jim Butcher.  And while I quite enjoy them, something was bothering me throughout the books, something that I couldn’t quite identify until I had nearly reached the end of <i>Changes</i>.  And then it struck me.  The noir genre, which these days is predominantly seen in its urban fantasy form, is considered to be based on the hardboiled school of American detective literature published in the 1930s.  So, we have a fantasy literature based upon the figure of the cynical, wise-cracking private investigator, who fights evil in all its various criminal forms along with the aid of his allies in the police department, who regularly risk their lives and careers on his behalf.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/02/13/the-nonsense-of-noir/\">at The Black Gate</a>.</p></div>",
  "content_text": "I recently read three more books in\nThe Dresden Files\n, the popular noir magic series written by Jim Butcher.  And while I quite enjoy them, something was bothering me throughout the books, something that I couldn’t quite identify until I had nearly reached the end of\nChanges\n.  And then it struck me.  The noir genre, which these days is predominantly seen in its urban fantasy form, is considered to be based on the hardboiled school of American detective literature published in the 1930s.  So, we have a fantasy literature based upon the figure of the cynical, wise-cracking private investigator, who fights evil in all its various criminal forms along with the aid of his allies in the police department, who regularly risk their lives and careers on his behalf.\nRead the rest\nat The Black Gate\n.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-13T15:26:00+00:00"
}