{
  "url": "https://voxday.net/2011/02/13/of-church-and-state/",
  "scraped_at": "2025-12-13T23:02:25.027707",
  "title": "Of Church and State",
  "date_display": "February 13, 2011",
  "date_iso": "2011-02-13T18:15:00+00:00",
  "date_from_url": "2011-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.dailymail.co.uk/news/article-1356490/Gay-lesbian-couples-right-marry-church.html\">This is an example</a> of why the Church needs to keep itself apart from the State.  The purpose of the separation of Church and State is not to protect the State from the doctrine of the Church, but to protect the Church from the dictates of the State:</p><blockquote><p>Gays and lesbians will be able to ‘marry’ in church under new laws to be unveiled this week.  The historic decision by Liberal Democrat Equalities Minister Lynne Featherstone will end the legal definition of marriage as a relationship between a man and a woman.  A gay couple will be able to refer to one of the partners as a ‘husband’, and a lesbian couple will be able to refer to one of the partners as a ‘wife’.  A key part of the reform will bring an end to the ban that prevents civil partnerships being conducted in places of worship.</p></blockquote><p>Now, you can certainly call a fish a gorilla if you want to.  You can even pass a law declaring that all fish are henceforth to be legally considered gorillas.  But it still won’t make a fish into a gorilla.  At this point, it’s almost impossible to lament the decline of what was once Christendom as its actions <a href=\"http://www.dailymail.co.uk/news/article-1356388/Villagers-outraged-police-order-protect-garden-sheds.html\">eminently merit its forthcoming collapse</a>.</p><p>It will be interesting to see how long the various governments attempt to deny the obvious logic that permits polygamy and bestiagamy under the same guise as homogamy before the inevitable acceptance.</p></div>",
  "content_text": "This is an example\nof why the Church needs to keep itself apart from the State.  The purpose of the separation of Church and State is not to protect the State from the doctrine of the Church, but to protect the Church from the dictates of the State:\nGays and lesbians will be able to ‘marry’ in church under new laws to be unveiled this week.  The historic decision by Liberal Democrat Equalities Minister Lynne Featherstone will end the legal definition of marriage as a relationship between a man and a woman.  A gay couple will be able to refer to one of the partners as a ‘husband’, and a lesbian couple will be able to refer to one of the partners as a ‘wife’.  A key part of the reform will bring an end to the ban that prevents civil partnerships being conducted in places of worship.\nNow, you can certainly call a fish a gorilla if you want to.  You can even pass a law declaring that all fish are henceforth to be legally considered gorillas.  But it still won’t make a fish into a gorilla.  At this point, it’s almost impossible to lament the decline of what was once Christendom as its actions\neminently merit its forthcoming collapse\n.\nIt will be interesting to see how long the various governments attempt to deny the obvious logic that permits polygamy and bestiagamy under the same guise as homogamy before the inevitable acceptance.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-13T18:15:00+00:00"
}