{
  "url": "https://voxday.net/2011/02/23/overstated/",
  "scraped_at": "2025-12-13T23:03:18.890409",
  "title": "Overstated",
  "date_display": "February 23, 2011",
  "date_iso": "2011-02-23T15:00:00+00:00",
  "date_from_url": "2011-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Long-time readers will recall that NAR Chief Economist has been my bitch for the last two years that I made existing home sale price predictions.  So, you can probably understand that I was amused at the news that <a href=\"http://blog.mises.org/15772/home-prices-decline-past-sales-data-overstated/\">the basic NAR model badly wants revision</a>:</p><blockquote><p>Case-Shiller also released its quarterly index covering all homes in the country. It showed prices fell 3.9 percent in the fourth quarter and 4.1 percent for all of 2010.  All of that may be the good news. The bad news is the Wall Street Journal reports that the National Association of Realtors may have been overstating existing home sale figures as far back as 2007.</p><p><i>“The group reported that there were 4.9 million sales of previously owned homes in 2010, down 5.7% from 5.2 million in 2009. But CoreLogic, a real-estate analytics firm based in Santa Ana, Calif., counted just 3.3 million homes sales last year, a drop of 10.8% from 3.7 million in 2009. CoreLogic says NAR could have overstated home sales by as much as 20%.</i></p><p>If the Realtors have overstated sales, the existing overhang of unsold homes is even greater than what’s been thought.</p><p>In determining annual sales numbers the Realtors have been using a model “that is benchmarked to the figures reported in the decennial U.S. Census. The model requires making certain assumptions for population growth and other measures in between the census surveys,” reports the WSJ.</p><p>The model may have overstated the number of sales “due to recent consolidation among multiple-listing services, which has resulted in those firms having wider coverage of housing markets. NAR’s tally could be distorted if the firms ‘are sending us more home sales because they have a larger coverage area, but without informing us that their reach has grown,’” said Lawrence Yun, who is the chief economist at NAR and the one keeping an eye on the model.</p></blockquote><p>Needless to say, if they overstated the sales numbers, there is a very good chance that they overstated the average prices paid as well.  Once more, it looks as if I was <i>insufficiently pessimistic</i> in RGD, positive GDP reports notwithstanding.  Of course, now that we’ve brought up the subject of erroneous statistical reports….</p><p>The economic contraction isn’t over.  It has still barely begun.</p></div>",
  "content_text": "Long-time readers will recall that NAR Chief Economist has been my bitch for the last two years that I made existing home sale price predictions.  So, you can probably understand that I was amused at the news that\nthe basic NAR model badly wants revision\n:\nCase-Shiller also released its quarterly index covering all homes in the country. It showed prices fell 3.9 percent in the fourth quarter and 4.1 percent for all of 2010.  All of that may be the good news. The bad news is the Wall Street Journal reports that the National Association of Realtors may have been overstating existing home sale figures as far back as 2007.\n“The group reported that there were 4.9 million sales of previously owned homes in 2010, down 5.7% from 5.2 million in 2009. But CoreLogic, a real-estate analytics firm based in Santa Ana, Calif., counted just 3.3 million homes sales last year, a drop of 10.8% from 3.7 million in 2009. CoreLogic says NAR could have overstated home sales by as much as 20%.\nIf the Realtors have overstated sales, the existing overhang of unsold homes is even greater than what’s been thought.\nIn determining annual sales numbers the Realtors have been using a model “that is benchmarked to the figures reported in the decennial U.S. Census. The model requires making certain assumptions for population growth and other measures in between the census surveys,” reports the WSJ.\nThe model may have overstated the number of sales “due to recent consolidation among multiple-listing services, which has resulted in those firms having wider coverage of housing markets. NAR’s tally could be distorted if the firms ‘are sending us more home sales because they have a larger coverage area, but without informing us that their reach has grown,’” said Lawrence Yun, who is the chief economist at NAR and the one keeping an eye on the model.\nNeedless to say, if they overstated the sales numbers, there is a very good chance that they overstated the average prices paid as well.  Once more, it looks as if I was\ninsufficiently pessimistic\nin RGD, positive GDP reports notwithstanding.  Of course, now that we’ve brought up the subject of erroneous statistical reports….\nThe economic contraction isn’t over.  It has still barely begun.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-23T15:00:00+00:00"
}