{
  "url": "https://voxday.net/2011/02/25/progressive-projection/",
  "scraped_at": "2025-12-13T23:03:30.378202",
  "title": "Progressive projection and the Dynamic Law",
  "date_display": "February 25, 2011",
  "date_iso": "2011-02-25T10:55:00+00:00",
  "date_from_url": "2011-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things I have continued to find interesting about discussing the topic of morality with those who believe that Man is capable of collective moral progression is their frequent reference to the supposed self-righteousness of those who subscribe to more conventional and traditional moral standards.  Consider Ludovici’s notes on Friedrich Nietzche’s <i>Thus Spake Zarathustra</i>, which are at the end of the book in the Common translation available at Project Gutenberg.</p><p><i>“‘[T]he good and just,’ throughout the book, is the expression used in referring to the self-righteous of modern times, those who are quite sure that they know all that is to be known concerning good and evil, and are satisfied that the values their little world of tradition has handed down to them, are destined to rule mankind as long as it lasts.”</i></p><p>But what is intriguing about this nineteenth century attitude, (which is shared by many of today’s moral progressives under the false impression that it is something new), is that it is not only morally blind and philosophically ignorant, it is also logically backward.  Setting aside the obvious ignorance of the basic concept of Natural Law it entails, the idea of the “self-righteous moral traditionalist” doesn’t even begin to make sense.</p><p>Think about it.  If a moral tradition has been handed down from previous generations, then it quite clearly is not a subjective standard.  If a man is deemed, by himself or others, to be righteous when measured against that traditional standard, he cannot reasonably be described as “self-righteous” because the standard is wholly external to the man.  It is particularly absurd to attempt to claim that a Christian is “self-righteous” given that one of the primary tenets of the Christian faith is that righteousness comes only through the grace of God and the person of Jesus Christ.</p><p>A “self-righteous Christian” is an intrinsic contradiction in terms.  One can reasonably call the self-righteous individual’s Christianity into account, but one cannot reasonably describe the Christian’s adherence to Christian standards as being self-righteous in any way.</p><p>Moreover, logic dictates that the accusation of self-righteousness not only can be directed, but <i>must be directed</i> at those who a) subscribe to a subjective moral standard of their own device by selecting bits and pieces from existing moral standards, or b) subscribe to what Bakker described as “naive moral relativism”.  Their righteousness, to the extent it can even be said to exist, is entirely based on their own self-references.  Therefore, we can safely conclude that the accusation of “self-righteousness” so often directed at those who subscribe to traditional moral standards by those who do not is little more than an obvious case of psychological projection.  Just as liars believe everyone else is lying, those who deem themselves to be good by virtue of their own subjective moral standards believe everyone else must be self-righteous too.</p><p>As for the question of what standard of morality will rule mankind as long as it lasts, one’s opinion will depend upon whether one believes in the concept of an underlying Natural Law that can be discovered through reason, an arbitrary Divine Law that may or may not be amenable to being discovered through reason and observation, or a Dynamic Law that is created by Man, is enforced by Man’s might, and is therefore intrinsically mutable.</p><p>The logical incoherence of the moral progressives can be seen in their adherence to the Dynamic Law concept, forgetting that while its dynamic nature means it will be always changing, the direction of the change is innately indeterminate.  In the end, what we see is that what the moral progressive actually means by “self-righteous” is daring to hold another individual accountable to a moral standard.  But even if we resort to this practical definition, we can see that the moral progressive is always guilty of self-righteousness.</p></div>",
  "content_text": "One of the things I have continued to find interesting about discussing the topic of morality with those who believe that Man is capable of collective moral progression is their frequent reference to the supposed self-righteousness of those who subscribe to more conventional and traditional moral standards.  Consider Ludovici’s notes on Friedrich Nietzche’s\nThus Spake Zarathustra\n, which are at the end of the book in the Common translation available at Project Gutenberg.\n“‘[T]he good and just,’ throughout the book, is the expression used in referring to the self-righteous of modern times, those who are quite sure that they know all that is to be known concerning good and evil, and are satisfied that the values their little world of tradition has handed down to them, are destined to rule mankind as long as it lasts.”\nBut what is intriguing about this nineteenth century attitude, (which is shared by many of today’s moral progressives under the false impression that it is something new), is that it is not only morally blind and philosophically ignorant, it is also logically backward.  Setting aside the obvious ignorance of the basic concept of Natural Law it entails, the idea of the “self-righteous moral traditionalist” doesn’t even begin to make sense.\nThink about it.  If a moral tradition has been handed down from previous generations, then it quite clearly is not a subjective standard.  If a man is deemed, by himself or others, to be righteous when measured against that traditional standard, he cannot reasonably be described as “self-righteous” because the standard is wholly external to the man.  It is particularly absurd to attempt to claim that a Christian is “self-righteous” given that one of the primary tenets of the Christian faith is that righteousness comes only through the grace of God and the person of Jesus Christ.\nA “self-righteous Christian” is an intrinsic contradiction in terms.  One can reasonably call the self-righteous individual’s Christianity into account, but one cannot reasonably describe the Christian’s adherence to Christian standards as being self-righteous in any way.\nMoreover, logic dictates that the accusation of self-righteousness not only can be directed, but\nmust be directed\nat those who a) subscribe to a subjective moral standard of their own device by selecting bits and pieces from existing moral standards, or b) subscribe to what Bakker described as “naive moral relativism”.  Their righteousness, to the extent it can even be said to exist, is entirely based on their own self-references.  Therefore, we can safely conclude that the accusation of “self-righteousness” so often directed at those who subscribe to traditional moral standards by those who do not is little more than an obvious case of psychological projection.  Just as liars believe everyone else is lying, those who deem themselves to be good by virtue of their own subjective moral standards believe everyone else must be self-righteous too.\nAs for the question of what standard of morality will rule mankind as long as it lasts, one’s opinion will depend upon whether one believes in the concept of an underlying Natural Law that can be discovered through reason, an arbitrary Divine Law that may or may not be amenable to being discovered through reason and observation, or a Dynamic Law that is created by Man, is enforced by Man’s might, and is therefore intrinsically mutable.\nThe logical incoherence of the moral progressives can be seen in their adherence to the Dynamic Law concept, forgetting that while its dynamic nature means it will be always changing, the direction of the change is innately indeterminate.  In the end, what we see is that what the moral progressive actually means by “self-righteous” is daring to hold another individual accountable to a moral standard.  But even if we resort to this practical definition, we can see that the moral progressive is always guilty of self-righteousness.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-25T10:55:00+00:00"
}