{
  "url": "https://voxday.net/2011/02/14/pursuit-of-excellence/",
  "scraped_at": "2025-12-13T23:02:30.505148",
  "title": "The pursuit of excellence",
  "date_display": "February 14, 2011",
  "date_iso": "2011-02-14T21:01:00+00:00",
  "date_from_url": "2011-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I am working on what is now the third revision of the monetarist inflation video – I never should have started reading Rothbard’s <i>History of Economic Thought</i> before finishing it – it occurs to me that I am hardly the only individual in possession of esoteric information here.  And it’s quite obvious that my video production skills are towards the low end of the spectrum.</p><p>What I’m interested in doing is making more Voxiversity-style videos available on a variety of subjects.  So, if you have an idea for a series on anything from basic evolutionary biology to Calvinism or the impossibility of a Japanese naval invasion in 1941, let me know and we can discuss it via email.  I’ll review each completed video before it will be added to the YouTube channel; there has to be some amount of quality control and you should probably plan for at least two rounds of criticism and refinement until you’ve got a good handle on what’s expected.</p><p>I don’t know if anyone will be interested or not.  I’m going to keep doing what I’m doing regardless, but if anyone has anything worthwhile to add, it would be welcome.</p></div>",
  "content_text": "As I am working on what is now the third revision of the monetarist inflation video – I never should have started reading Rothbard’s\nHistory of Economic Thought\nbefore finishing it – it occurs to me that I am hardly the only individual in possession of esoteric information here.  And it’s quite obvious that my video production skills are towards the low end of the spectrum.\nWhat I’m interested in doing is making more Voxiversity-style videos available on a variety of subjects.  So, if you have an idea for a series on anything from basic evolutionary biology to Calvinism or the impossibility of a Japanese naval invasion in 1941, let me know and we can discuss it via email.  I’ll review each completed video before it will be added to the YouTube channel; there has to be some amount of quality control and you should probably plan for at least two rounds of criticism and refinement until you’ve got a good handle on what’s expected.\nI don’t know if anyone will be interested or not.  I’m going to keep doing what I’m doing regardless, but if anyone has anything worthwhile to add, it would be welcome.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-14T21:01:00+00:00"
}