{
  "url": "https://voxday.net/2011/02/11/scientific-proof-by-analogy/",
  "scraped_at": "2025-12-13T23:02:14.061331",
  "title": "Scientific proof by analogy",
  "date_display": "February 11, 2011",
  "date_iso": "2011-02-11T15:45:00+00:00",
  "date_from_url": "2011-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you ever wondered why I harbor such complete scorn for psychiatry and consider it to be intrinsically less scientific than astrology or even evolutionary biology, here is a pair of illuminating examples provided by Dr. Hervey Cleckley:</p><blockquote><p>“I have become increasingly convinced that some of the popular methods presumed to discover what is in the unconscious cannot be counted upon as reliable methods of obtaining evidence. They often involve the use of symbolism and analogy in such a way that the interpreter can find virtually anything that he is looking for. Freud, for instance, from a simple dream reported by a man in his middle twenties as having occurred at 4 years of age drew remarkable conclusions. The 4-year-old boy dreamed of seeing six or seven white wolves sitting in a tree. Freud interpreted the dream in such a way as to convince himself that the patient at 18 months of age had been shocked by seeing his parents have intercourse three times in succession and that this played a major part in the extreme fear of being castrated by his father which Freud ascribed to him at 4 years of age. No objective evidence was ever offered to support this conclusion. Nor was actual fear of castration ever made to emerge into the light of consciousness despite years of analysis</p><p>Faithfully following Freud’s method of establishing proof by analogy, a prominent psychiatrist in his well-known book <i>Beyond Laughter</i> has given us a remarkable interpretation of the drum majorette. Most of us are likely to think that the average man’s pleasant reaction to these well-built, sparsely clad young ladies who prance happily and often somewhat sexily before the band at football stadiums can be pretty well accounted for by tastes and impulses quite obvious in nearly anyone’s consciousness. Such tastes and impulses, according to the interpretation in Beyond Laughter, must be considered as superficial or perhaps even as the result of reaction formation. The lissome girl, we are solemnly told, stands out before the grouped band just as an erect penis stands out before the larger mass of the body. This analogy is taken as evidence that interest and excitement about the provocative lass do not lie primarily in the fact that any ordinary man would find her attractive. In our unconscious she is said to be equated with the erect male organ, and it is maintained that men really feel toward her, as she stands projected before the group, as they unconsciously feel toward the penis of another male. Our positive reactions toward her, we are told, arise from our unrecognized and unaccepted homosexuality. No corroborative evidence is offered, nor any doubt expressed, about this interpretation. It is soberly offered as a fact, presumably discovered by science.”<br> – <i>The Mask of Sanity</i> pp 407-408</br></p></blockquote><p>Keep in mind that this pseudo-scientific analogical “proof” is not only the sole basis for much atheist speculation about theistic mental health, but is also the conceptual foundation underlying Keynesian General Theory as well as Paul Samuelson’s statistical perversion of it.  It is also remniscent of the quality of empirical evidence that has been gathered in support of the natural selection mechanic.</p></div>",
  "content_text": "In case you ever wondered why I harbor such complete scorn for psychiatry and consider it to be intrinsically less scientific than astrology or even evolutionary biology, here is a pair of illuminating examples provided by Dr. Hervey Cleckley:\n“I have become increasingly convinced that some of the popular methods presumed to discover what is in the unconscious cannot be counted upon as reliable methods of obtaining evidence. They often involve the use of symbolism and analogy in such a way that the interpreter can find virtually anything that he is looking for. Freud, for instance, from a simple dream reported by a man in his middle twenties as having occurred at 4 years of age drew remarkable conclusions. The 4-year-old boy dreamed of seeing six or seven white wolves sitting in a tree. Freud interpreted the dream in such a way as to convince himself that the patient at 18 months of age had been shocked by seeing his parents have intercourse three times in succession and that this played a major part in the extreme fear of being castrated by his father which Freud ascribed to him at 4 years of age. No objective evidence was ever offered to support this conclusion. Nor was actual fear of castration ever made to emerge into the light of consciousness despite years of analysis\nFaithfully following Freud’s method of establishing proof by analogy, a prominent psychiatrist in his well-known book\nBeyond Laughter\nhas given us a remarkable interpretation of the drum majorette. Most of us are likely to think that the average man’s pleasant reaction to these well-built, sparsely clad young ladies who prance happily and often somewhat sexily before the band at football stadiums can be pretty well accounted for by tastes and impulses quite obvious in nearly anyone’s consciousness. Such tastes and impulses, according to the interpretation in Beyond Laughter, must be considered as superficial or perhaps even as the result of reaction formation. The lissome girl, we are solemnly told, stands out before the grouped band just as an erect penis stands out before the larger mass of the body. This analogy is taken as evidence that interest and excitement about the provocative lass do not lie primarily in the fact that any ordinary man would find her attractive. In our unconscious she is said to be equated with the erect male organ, and it is maintained that men really feel toward her, as she stands projected before the group, as they unconsciously feel toward the penis of another male. Our positive reactions toward her, we are told, arise from our unrecognized and unaccepted homosexuality. No corroborative evidence is offered, nor any doubt expressed, about this interpretation. It is soberly offered as a fact, presumably discovered by science.”\n–\nThe Mask of Sanity\npp 407-408\nKeep in mind that this pseudo-scientific analogical “proof” is not only the sole basis for much atheist speculation about theistic mental health, but is also the conceptual foundation underlying Keynesian General Theory as well as Paul Samuelson’s statistical perversion of it.  It is also remniscent of the quality of empirical evidence that has been gathered in support of the natural selection mechanic.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-11T15:45:00+00:00"
}