{
  "url": "https://voxday.net/2011/02/03/tony-soprano-died-at-diner/",
  "scraped_at": "2025-12-13T23:01:34.053067",
  "title": "Tony Soprano died at the diner",
  "date_display": "February 3, 2011",
  "date_iso": "2011-02-03T23:04:00+00:00",
  "date_from_url": "2011-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Look, it was never a mystery.  I have not seen one second of The Sopranos, but when I heard it was coming to an end, I knew that Tony would be whacked.  I knew he would be whacked because he HAD to be whacked.  Any half-skilled dramatist – and by all accounts, David Chase is a highly skilled one – knows that a drama has to end in death, redemption, or the completion of an odyssey.  Since there is no secular redemption other than a wedding (or its extra-marital substitute) and I assumed that no HBO series would end in Christian repentance, and because Tony Soprano was an overt antihero, (therefore precluding the odyssey), there simply was no other dramatically possible option.</p><p>And no one who has ever seen The Godfather should fail to grasp the metaphorical significance of someone walking into a bathroom at a restaurant.  Especially not in a television series <i>about the Mafia</i>.  I would give no more credence to the idea that the fade to black at the end – which ended on the word “stop” – meant that the lead character got arrested than it meant he left his wife, moved to Las Vegas, and became a poledancer at a gay club.</p></div>",
  "content_text": "Look, it was never a mystery.  I have not seen one second of The Sopranos, but when I heard it was coming to an end, I knew that Tony would be whacked.  I knew he would be whacked because he HAD to be whacked.  Any half-skilled dramatist – and by all accounts, David Chase is a highly skilled one – knows that a drama has to end in death, redemption, or the completion of an odyssey.  Since there is no secular redemption other than a wedding (or its extra-marital substitute) and I assumed that no HBO series would end in Christian repentance, and because Tony Soprano was an overt antihero, (therefore precluding the odyssey), there simply was no other dramatically possible option.\nAnd no one who has ever seen The Godfather should fail to grasp the metaphorical significance of someone walking into a bathroom at a restaurant.  Especially not in a television series\nabout the Mafia\n.  I would give no more credence to the idea that the fade to black at the end – which ended on the word “stop” – meant that the lead character got arrested than it meant he left his wife, moved to Las Vegas, and became a poledancer at a gay club.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-03T23:04:00+00:00"
}