{
  "url": "https://voxday.net/2011/02/10/useless-tea-party/",
  "scraped_at": "2025-12-13T23:02:08.546220",
  "title": "The useless Tea Party",
  "date_display": "February 10, 2011",
  "date_iso": "2011-02-10T18:32:00+00:00",
  "date_from_url": "2011-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Most of you will recall that unlike those bloggers that leaped on the bandwagon with alacrity, I have been extremely skeptical of the Tea Party from the very beginning.  And, as Karl Denninger points out, <a href=\"http://market-ticker.org/akcs-www?post=179672\">the skeptics were correct</a>:</p><blockquote><p>That’s thirty-one out of forty voting for the bill (77.5%), eight voting against, and one no-vote. Despite the eight nay votes, Tea Party-backed candidates overwhelmingly supported an extension of the PATRIOT Act.</p></blockquote><p>As I expected, the Tea Party is an ineffectual and ideologically incoherent joke.  They don’t see the intrinsic dichotomy of claiming to support <i>small government</i> while simultaneously playing totalitarian world police.  Yes, the movement managed to get a few people elected to office, but that’s totally irrelevant because, as we have seen every time that Republicans get elected to office, they support extending and expanding central government power.  This behavior is as predictable as the phases of the Moon; it is the nature of the sort of beast who runs for office.</p><p>And despite the brave “well, we’ll just throw them out again” rhetoric that we’ll likely hear from the more principled Tea Partiers, I am confident that most of the 31 Tea Party-backed sellouts will easily win re-election with the enthusiastic support of the very people they betrayed.  Notice, by the way, that it is Republicans who are pushing the Patriot Act extensions.</p><p><i>“Republican leaders will bring the bill back to the floor under a rule, where it will almost certainly secure the 218-vote threshold.”</i></p><p>As for Michelle Bachmann, I was unsurprised to see that she was one of the frauds.  I remember when she was first getting started in Minnesota politics.  If I recall correctly, my father was one of her contributors, but I didn’t think much of her at the time and I have seen no reason to revise my opinion since.</p></div>",
  "content_text": "Most of you will recall that unlike those bloggers that leaped on the bandwagon with alacrity, I have been extremely skeptical of the Tea Party from the very beginning.  And, as Karl Denninger points out,\nthe skeptics were correct\n:\nThat’s thirty-one out of forty voting for the bill (77.5%), eight voting against, and one no-vote. Despite the eight nay votes, Tea Party-backed candidates overwhelmingly supported an extension of the PATRIOT Act.\nAs I expected, the Tea Party is an ineffectual and ideologically incoherent joke.  They don’t see the intrinsic dichotomy of claiming to support\nsmall government\nwhile simultaneously playing totalitarian world police.  Yes, the movement managed to get a few people elected to office, but that’s totally irrelevant because, as we have seen every time that Republicans get elected to office, they support extending and expanding central government power.  This behavior is as predictable as the phases of the Moon; it is the nature of the sort of beast who runs for office.\nAnd despite the brave “well, we’ll just throw them out again” rhetoric that we’ll likely hear from the more principled Tea Partiers, I am confident that most of the 31 Tea Party-backed sellouts will easily win re-election with the enthusiastic support of the very people they betrayed.  Notice, by the way, that it is Republicans who are pushing the Patriot Act extensions.\n“Republican leaders will bring the bill back to the floor under a rule, where it will almost certainly secure the 218-vote threshold.”\nAs for Michelle Bachmann, I was unsurprised to see that she was one of the frauds.  I remember when she was first getting started in Minnesota politics.  If I recall correctly, my father was one of her contributors, but I didn’t think much of her at the time and I have seen no reason to revise my opinion since.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-10T18:32:00+00:00"
}