{
  "url": "https://voxday.net/2011/02/04/well-hitler-was-austrian/",
  "scraped_at": "2025-12-13T23:01:35.882908",
  "title": "Well, Hitlerwasfrom Austria….",
  "date_display": "February 4, 2011",
  "date_iso": "2011-02-04T10:46:00+00:00",
  "date_from_url": "2011-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Oh sweet Mises, even Krugman at his most obstinately ignorant hasn’t descended <a href=\"http://dissention.wordpress.com/2011/01/26/austrian-economics-and-the-rise-of-hitler/\">to these depths</a> regarding the Austrian School of Economics:</p><blockquote><p>Ever wonder how one of the most educated and advanced nation in Europe ended up with Hitler as a leader in 1933? Well, you have thank Austrian Economics for that- at least partially.  You see, after ww1 the allies made Germans pay exorbitant and ruinous reparations. The only way to escape these compensations was through hyperinflation- wiemar style.</p><p>But here is the fun part.. after a few years of such hyperinflation they decided to cool down and “normalize” the economy- using the advice of people like Friedrich von Hayek and his “Austrian” School Of Economics. The guy who led this effort, Heinrich Brüning, whose austerity measures resulted in a massive increase in unemployment- from 15% to over 30% in less than two years.</p></blockquote><p>No, you really don’t.  At all.  The Austrian School of economics had as much to do with the rise of the National Socialists to power in Germany as Victoria’s Secret or My Pretty Pony did.  First, as anyone who has ever read <i>The Economic Consequences of the Peace</i> will know, hyperinflation was not only a predictable consequence of the war reparations, but could not be utilized to reduce the German debt because it was subject to recalculations that were completely under the control of the Allied commission.  Inflating their way out of the debt was never an option for the Germans; there was no escape except default.  This was already obvious to everyone back in 1929, which is why the Young plan reduced the reparations payments and was followed by a moratorium in 1931.  Note that the Young plan went into effect three months before Brüning even took office for the first time.  Second, Austrian economics had no influence on German politics, which was dominated by socialism of varying stripes.  In fact, the very name “Austrian” was given as a deprecating insult to the school by the empiricists of the dominant German Historical School during the <i>Methodenstreit</i> at the end of the 19th century.</p><p>Third, Heinrich Brüning’s attempt to rein in the Weimar hyperinflation was not based on Friedrich von Hayek’s advice.  Hayek and the Austrians were hardly the first to notice the pernicious effects of inflation and Hayek didn’t even publish his first book until 1929.  Moreover, he was in London at the London School of Economics while Brüning was Chancellor of the Weimar Republic.  The ironic thing is that this inept Advocatus Diaboli appears to think that Brüning should have pursued a Keynesian approach, nowithstanding the fact that the the German edition of <i>The General Theory of Employment, Interest, and Mony</i> was not published until September 1936, four years after Brüning left office.  Keynes’s own words on the German economic tradition during the period that included the Weimar years are also somewhat pertinent to the subject:</p><p><i>“The orthodox tradition, which ruled in nineteenth century England, never took so firm a hold of German thought. There have always existed important schools of economists in Germany who have strongly disputed the adequacy of the classical theory for the analysis of contemporary events. The Manchester School and Marxism both derive ultimately from Ricardo, a conclusion which is only superficially surprising. But in Germany there has always existed a large section of opinion which has adhered neither to the one nor to the other. It can scarcely be claimed, however, that this school of thought has erected a rival theoretical construction; or has even attempted to do so. It has been sceptical, realistic, content with historical and empirical methods and results, which discard formal analysis….  Thus Germany, quite contrary to her habit in most of the sciences, has been content for a whole century to do without any formal theory of economics which was predominant and generally accepted.”</i></p><p>Keynes is describing the importance of the Historical School here, the same German Historical School that gave the name to its provincial theoretical rivals.  Attempting to blame the end of Weimar hyperinflation, much less the rise of Adolf Hitler, on the Austrian school or even the slightly more plausible Manchester school reveals a near-complete ignorance of economic history.</p></div>",
  "content_text": "Oh sweet Mises, even Krugman at his most obstinately ignorant hasn’t descended\nto these depths\nregarding the Austrian School of Economics:\nEver wonder how one of the most educated and advanced nation in Europe ended up with Hitler as a leader in 1933? Well, you have thank Austrian Economics for that- at least partially.  You see, after ww1 the allies made Germans pay exorbitant and ruinous reparations. The only way to escape these compensations was through hyperinflation- wiemar style.\nBut here is the fun part.. after a few years of such hyperinflation they decided to cool down and “normalize” the economy- using the advice of people like Friedrich von Hayek and his “Austrian” School Of Economics. The guy who led this effort, Heinrich Brüning, whose austerity measures resulted in a massive increase in unemployment- from 15% to over 30% in less than two years.\nNo, you really don’t.  At all.  The Austrian School of economics had as much to do with the rise of the National Socialists to power in Germany as Victoria’s Secret or My Pretty Pony did.  First, as anyone who has ever read\nThe Economic Consequences of the Peace\nwill know, hyperinflation was not only a predictable consequence of the war reparations, but could not be utilized to reduce the German debt because it was subject to recalculations that were completely under the control of the Allied commission.  Inflating their way out of the debt was never an option for the Germans; there was no escape except default.  This was already obvious to everyone back in 1929, which is why the Young plan reduced the reparations payments and was followed by a moratorium in 1931.  Note that the Young plan went into effect three months before Brüning even took office for the first time.  Second, Austrian economics had no influence on German politics, which was dominated by socialism of varying stripes.  In fact, the very name “Austrian” was given as a deprecating insult to the school by the empiricists of the dominant German Historical School during the\nMethodenstreit\nat the end of the 19th century.\nThird, Heinrich Brüning’s attempt to rein in the Weimar hyperinflation was not based on Friedrich von Hayek’s advice.  Hayek and the Austrians were hardly the first to notice the pernicious effects of inflation and Hayek didn’t even publish his first book until 1929.  Moreover, he was in London at the London School of Economics while Brüning was Chancellor of the Weimar Republic.  The ironic thing is that this inept Advocatus Diaboli appears to think that Brüning should have pursued a Keynesian approach, nowithstanding the fact that the the German edition of\nThe General Theory of Employment, Interest, and Mony\nwas not published until September 1936, four years after Brüning left office.  Keynes’s own words on the German economic tradition during the period that included the Weimar years are also somewhat pertinent to the subject:\n“The orthodox tradition, which ruled in nineteenth century England, never took so firm a hold of German thought. There have always existed important schools of economists in Germany who have strongly disputed the adequacy of the classical theory for the analysis of contemporary events. The Manchester School and Marxism both derive ultimately from Ricardo, a conclusion which is only superficially surprising. But in Germany there has always existed a large section of opinion which has adhered neither to the one nor to the other. It can scarcely be claimed, however, that this school of thought has erected a rival theoretical construction; or has even attempted to do so. It has been sceptical, realistic, content with historical and empirical methods and results, which discard formal analysis….  Thus Germany, quite contrary to her habit in most of the sciences, has been content for a whole century to do without any formal theory of economics which was predominant and generally accepted.”\nKeynes is describing the importance of the Historical School here, the same German Historical School that gave the name to its provincial theoretical rivals.  Attempting to blame the end of Weimar hyperinflation, much less the rise of Adolf Hitler, on the Austrian school or even the slightly more plausible Manchester school reveals a near-complete ignorance of economic history.",
  "tags": [
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-04T10:46:00+00:00"
}