{
  "url": "https://voxday.net/2011/02/02/whether-science-is-self-correcting/",
  "scraped_at": "2025-12-13T23:01:26.659262",
  "title": "Whether science is self-correcting",
  "date_display": "February 2, 2011",
  "date_iso": "2011-02-02T22:30:00+00:00",
  "date_from_url": "2011-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><b>Vox:</b></i> It is said that science is self-correcting.  For to be accepted, new ideas must survive the most rigorous standards of evidence and scrutiny, according to the Cosmologist.  And yet, it is also said that life itself is an error-correcting process, as well as an error-making one.  Since science is not entirely unrelated to life, this raises the obvious question of what the material differences distinguishing science from life and scientific self-correction from life’s intrinsic error-correcting process might happen to be.</p><p>But let us be patient and attempt to limit ourselves to one issue at a time.  What is science and what distinguishes it from life?</p><p> <b><i>The Biochemist:</i> </b>What is science and what distinguishes it from life?  Science is that portion of study that uses observation to describe a system. An  adequate description so formed can be used as a tool for some purpose.  Science is one of the ways that life can utilize information.</p><p>I  want “observation” to include both natural situations and perturbed  systems (experiments). That way we are inclusive of both white and pink  polar bears. I say “describe” so that both it includes both rule (i  before e except after c) and rote (a list of words with adjacent i and  e) and combination (i before e except after c with the following  exceptions…).  I add the second sentence so that the “correctness”  of the science can be judged. The adequacy of a description ( a model, a  list, a definition) does depend on the end user (“Italy is shaped like a  boot” is fine for helping someone find it on a map, not so great for  navigation).</p><p>I make no claim that only life can employ science or that science always provides information that can be utilized by life.</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> While it’s tough to pin down a definition that will satisfy every scientist and philosopher, functionally I’m happy with saying that science is just the effort to understand the world through observation and experiment. The commuter who tries several routes to work to find the quickest is doing science in the process of going about daily life. So is the cook who tries different recipes to see which is most popular with the customers. In this respect science is something that most everyone does in the process of living their lives. People try different things and throw out what doesn’t work, in a process which it’s probably fair to call self-correction.</p><p>A person with “scientist” as a job title is just applying these same methods to difficult problems in nature. Separating what works from what doesn’t is especially crucial to science as a profession, and methods such as journal publication, conference presentations, public colloquiums and the like have been developed to make this process more efficient. But none of this is magic, and I wouldn’t argue that the science done by professional scientists is different in anything but degree from the “Try and see” methods most people use every day.</p><p> <i><b>Vox:</b></i> I see no reason to disagree with either statement.  So we three are agreed that science is a thing that is done and a means that is employed.  It is not alive, and it has no animating spirit, much less a self-aware consciousness.  To this, we can add the observation that science can also be in error, or there would be no need for it to be corrected and we would not be able to describe it as self-correcting.  Now, when an error occurs in the application of science, is it the means that is employed or is it the employer of that means that commits the error?</p><p> <b><i>The Biochemist:</i></b> Only the employer can “commit” the error, but it is possible that a modification of the means could prevent the error. For example, driving is a means of transportation and cars are not self-aware; if a car has a long stopping distance because of brake design, it is the driver who commits an error by not leaving enough stopping distance. Yet improvement of the brakes by the manufacturer would lead to less accidents.</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> If we agree that science is a thing that is done and a means that is employed, saying that the method is wrong is a category error along the lines of blaming the concept of language for the dumb things that people sometimes say.  But if we agree that the means of science is observation and experiment, it’s clearly true that the conclusions drawn by scientists are limited by the accuracy of our observations, the limitations of our experimental apparatus, the accessibility of the things we wish to observe, the clarity with which we examine the results, and other problems of that nature. To the extent those problems exist, we’re limited in our ability to understand the world via science. And thus scientists make mistakes, and lots of them.</p><p>Conversely, nature is what it is regardless of what mistakes we make while trying to examine it. Our mistakes can only exist until we observe facts contradicting them, whereas a correct conclusion will never be overturned by a contradictory fact. As a wise man once said, truth cannot contradict truth.</p><p> <i><b>Vox:</b></i> How fortunate it is that we have thus far avoided contradicting truth!  I am very much heartened in the hope that we shall continue to avoid any such fate by the fact that we three find ourselves once more in a harmonious accord, in which we have concluded that it is the employer of the method of science who commits the error when an error happens to occur.  Now, since we are not only contemplating errors, but also the eventual correction of errors, it stands to reason that someone, or something, must have first discovered employer’s error prior to correcting it.  And therein lies the next question: who, or what, discovers it?</p><p> <b><i>The Biochemist:</i></b> Errors can be discovered by anyone who finds the science wanting.</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> Anyone who experimentally tests the possible error against observed reality.</p><p> <i><b>Vox:</b></i> We appear to be rapidly approaching a potential conclusion, but lest we reach a false one overhastily, I urge caution.  We have now determined that an error in the application of science is committed by an employer and can potentially be discovered by any<i>one</i> rather than any<i>thing</i>.  Is this likewise true of errors that are unrelated to the application of science, errors that are, in fact, entirely unrelated to science in any way?  Or to phrase it another way, are the class of potential discoverers of non-science errors intrinsically limited in some way?</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> Since we’ve taken a broad but robust view of science as testing via observation, if an error – any kind of error, in professional science or otherwise – is detectable by observation, such detection is done through science by definition. There are no empirically observable errors entirely unrelated to science, and there is no restriction on who can use their own observations to discover and correct those errors.  This is not some science triumphalist claim that science is everything and everything is science. The answers to a large number of important, legitimate, and well-posed questions are simply not amenable to test via observation. The discovery and discoverers of those errors is an interesting and profound question, but probably not one which science can say much of anything about.</p><p> <b><i>The Biochemist:</i></b> Non-science errors can potentially be discovered by anything or anyone. A phase-lock loop on an RF oscillator, a checksum for memory storage, the Mut proteins that find mismatched base-pairs in dna; these all find errors but are not (on their own) doing science.</p><p> <i><b>Vox:</b></i> So, if I have understood the Biochemist correctly errors in science can be discovered by anyone, while errors in non-science can be discovered by anyone or anything.  But let us stay focused on the errors in science.  Having been discovered by anyone, who or what then can claim credit for correcting the error?  After all, to correct something it is not enough to merely note the error, correction implies the provision of an alternative answer that is not incorrect.</p><p> <b><i>The Biochemist:</i></b> The participants in the correction process deserve credit. Anyone can claim credit.</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> One can discover and publicize an error without putting forth a better explanation. To pick a random example, the perihelion precession of Mercury was discovered in the 1850s by Urbain Le Verrier and persisted as a nagging contradiction within classical mechanics for many decades. Its theoretical resolution remained incomplete until Einstein’s work in the early part of the 20th century.  As for the credit, that’s an issue that matters a lot to scientists but not really to science. A discovery is a discovery regardless of the name attached to it.</p><p> <i><b>Vox:</b></i> So we have successfully established several important points of agreement.  We know that when an error occurs during the employment of science, it is the responsibility of the employer.  When that error is detected and corrected, the correction is credited to those who participated in detecting and correcting it, although the detectors need not be the correctors.  These statements are all very clear and create no confusion with regards to themselves.  And yet, I find myself unable to balance them with the original question.  Allow me to explain the difficulty in which I find myself.</p><p>In addition to the previously mentioned conclusions, we have also noted that those who employ science are not uniquely prone to error.  A doctor can make a mistake, as can an accountant.  And just as we do not blame science for the error of the scientist, we do not blame medicine for the error of the doctor.  Neither do we hold accounting responsible for the error of the accountant.  When a second doctor corrects the error of the first doctor or when a second accountant corrects the error of the first accountant, we correctly credit the correction to the second doctor and the second accountant, not to medicine or accounting.  And therefore, we do not say that either medicine or accounting are <i>self-correcting</i>, we instead consider them to be <i>capable of being corrected</i>.</p><p>However, because we have concluded that it is scientists, or anyone else participating in the correction process, who corrects the errors of other scientists in science, which is in keeping with the way that doctors correct the errors of other doctors in medicine and accountants correct the errors of other accountants in accounting, shall we therefore conclude that medicine and accounting are also self-correcting?</p><p> <b><i><a href=\"http://scienceblogs.com/builtonfacts/\">The Physicist</a>:</i></b> Science has no monopoly on self-correction. An accounting uncovering error or fraud by examining a spreadsheet is not doing something so different from a scientist uncovering a problem with a theory by examining instrument readings. In both cases the members of the professions are correcting their previous errors.</p><p>However, the the character of the corrections in accounting and science are somewhat different. The rules of accounting are set by accountants, lawyers, and legislators. Errors and corrections happen within that known framework, which can itself be adjusted. In science the framework is the laws of nature, which are not known a priori and can’t be adjusted. (Citigroup can rewrite accounting law, Virgin Galactic can’t rewrite gravity.) So sure, you could say accounting is self-correcting. That description might not be as useful as it is for the scientific study of natural laws, but it wouldn’t be wrong.</p><p> <b><i>The Biochemist:</i> </b>Medicine and accounting are “capable of being corrected”. In your scenarios, they are self-correcting via redundancy; one engineering method of adding self-correction to a system. Most systems that are self-correcting can also exist in a non-self-correcting state. Most FM receivers use “Automatic Frequency Control” to lock to a station, but many also have a button to toggle the AFC off. A system of medicine or accounting is self-correcting if it enforces the requirement of a second opinion or an outside audit.</p><p> <i><b>Vox:</b></i> I am afraid both my distinguished interlocutors appear to be committing a basic category error here.  Previously, we had agreed that the error is committed by one party and corrected by another party, which may in fact be the same party.  But at no point in time has anyone asserted that it is the method utilized by one or both parties which either commits or corrects the error.  Just as one cannot confuse the fact of a car being driven with a car driving itself, it is not correct to say that which is capable of being corrected is correcting itself.  Now, I understand that one can reasonably describe the entire system which contains both the acting individuals as well as the process that is utilized as a “self-correcting” system in some very broad sense, but this all-encompassing systemic concept  is quite clearly not the definition of science which we defined earlier.</p><p>But perhaps I am mistaken, so it might prove instructive to further contemplate this broad and inclusive  definition of a self-correcting system.  So far, it has been asserted that systems of science, medicine, and accounting are self-correcting.  Based on the definition of “a system that enforces the requirement of a second opinion or an outside audit” can we also say that systems of politics, mathematics, law, publishing, and theology are all self-correcting as well?</p></div>",
  "content_text": "Vox:\nIt is said that science is self-correcting.  For to be accepted, new ideas must survive the most rigorous standards of evidence and scrutiny, according to the Cosmologist.  And yet, it is also said that life itself is an error-correcting process, as well as an error-making one.  Since science is not entirely unrelated to life, this raises the obvious question of what the material differences distinguishing science from life and scientific self-correction from life’s intrinsic error-correcting process might happen to be.\nBut let us be patient and attempt to limit ourselves to one issue at a time.  What is science and what distinguishes it from life?\nThe Biochemist:\nWhat is science and what distinguishes it from life?  Science is that portion of study that uses observation to describe a system. An  adequate description so formed can be used as a tool for some purpose.  Science is one of the ways that life can utilize information.\nI  want “observation” to include both natural situations and perturbed  systems (experiments). That way we are inclusive of both white and pink  polar bears. I say “describe” so that both it includes both rule (i  before e except after c) and rote (a list of words with adjacent i and  e) and combination (i before e except after c with the following  exceptions…).  I add the second sentence so that the “correctness”  of the science can be judged. The adequacy of a description ( a model, a  list, a definition) does depend on the end user (“Italy is shaped like a  boot” is fine for helping someone find it on a map, not so great for  navigation).\nI make no claim that only life can employ science or that science always provides information that can be utilized by life.\nThe Physicist\n:\nWhile it’s tough to pin down a definition that will satisfy every scientist and philosopher, functionally I’m happy with saying that science is just the effort to understand the world through observation and experiment. The commuter who tries several routes to work to find the quickest is doing science in the process of going about daily life. So is the cook who tries different recipes to see which is most popular with the customers. In this respect science is something that most everyone does in the process of living their lives. People try different things and throw out what doesn’t work, in a process which it’s probably fair to call self-correction.\nA person with “scientist” as a job title is just applying these same methods to difficult problems in nature. Separating what works from what doesn’t is especially crucial to science as a profession, and methods such as journal publication, conference presentations, public colloquiums and the like have been developed to make this process more efficient. But none of this is magic, and I wouldn’t argue that the science done by professional scientists is different in anything but degree from the “Try and see” methods most people use every day.\nVox:\nI see no reason to disagree with either statement.  So we three are agreed that science is a thing that is done and a means that is employed.  It is not alive, and it has no animating spirit, much less a self-aware consciousness.  To this, we can add the observation that science can also be in error, or there would be no need for it to be corrected and we would not be able to describe it as self-correcting.  Now, when an error occurs in the application of science, is it the means that is employed or is it the employer of that means that commits the error?\nThe Biochemist:\nOnly the employer can “commit” the error, but it is possible that a modification of the means could prevent the error. For example, driving is a means of transportation and cars are not self-aware; if a car has a long stopping distance because of brake design, it is the driver who commits an error by not leaving enough stopping distance. Yet improvement of the brakes by the manufacturer would lead to less accidents.\nThe Physicist\n:\nIf we agree that science is a thing that is done and a means that is employed, saying that the method is wrong is a category error along the lines of blaming the concept of language for the dumb things that people sometimes say.  But if we agree that the means of science is observation and experiment, it’s clearly true that the conclusions drawn by scientists are limited by the accuracy of our observations, the limitations of our experimental apparatus, the accessibility of the things we wish to observe, the clarity with which we examine the results, and other problems of that nature. To the extent those problems exist, we’re limited in our ability to understand the world via science. And thus scientists make mistakes, and lots of them.\nConversely, nature is what it is regardless of what mistakes we make while trying to examine it. Our mistakes can only exist until we observe facts contradicting them, whereas a correct conclusion will never be overturned by a contradictory fact. As a wise man once said, truth cannot contradict truth.\nVox:\nHow fortunate it is that we have thus far avoided contradicting truth!  I am very much heartened in the hope that we shall continue to avoid any such fate by the fact that we three find ourselves once more in a harmonious accord, in which we have concluded that it is the employer of the method of science who commits the error when an error happens to occur.  Now, since we are not only contemplating errors, but also the eventual correction of errors, it stands to reason that someone, or something, must have first discovered employer’s error prior to correcting it.  And therein lies the next question: who, or what, discovers it?\nThe Biochemist:\nErrors can be discovered by anyone who finds the science wanting.\nThe Physicist\n:\nAnyone who experimentally tests the possible error against observed reality.\nVox:\nWe appear to be rapidly approaching a potential conclusion, but lest we reach a false one overhastily, I urge caution.  We have now determined that an error in the application of science is committed by an employer and can potentially be discovered by any\none\nrather than any\nthing\n.  Is this likewise true of errors that are unrelated to the application of science, errors that are, in fact, entirely unrelated to science in any way?  Or to phrase it another way, are the class of potential discoverers of non-science errors intrinsically limited in some way?\nThe Physicist\n:\nSince we’ve taken a broad but robust view of science as testing via observation, if an error – any kind of error, in professional science or otherwise – is detectable by observation, such detection is done through science by definition. There are no empirically observable errors entirely unrelated to science, and there is no restriction on who can use their own observations to discover and correct those errors.  This is not some science triumphalist claim that science is everything and everything is science. The answers to a large number of important, legitimate, and well-posed questions are simply not amenable to test via observation. The discovery and discoverers of those errors is an interesting and profound question, but probably not one which science can say much of anything about.\nThe Biochemist:\nNon-science errors can potentially be discovered by anything or anyone. A phase-lock loop on an RF oscillator, a checksum for memory storage, the Mut proteins that find mismatched base-pairs in dna; these all find errors but are not (on their own) doing science.\nVox:\nSo, if I have understood the Biochemist correctly errors in science can be discovered by anyone, while errors in non-science can be discovered by anyone or anything.  But let us stay focused on the errors in science.  Having been discovered by anyone, who or what then can claim credit for correcting the error?  After all, to correct something it is not enough to merely note the error, correction implies the provision of an alternative answer that is not incorrect.\nThe Biochemist:\nThe participants in the correction process deserve credit. Anyone can claim credit.\nThe Physicist\n:\nOne can discover and publicize an error without putting forth a better explanation. To pick a random example, the perihelion precession of Mercury was discovered in the 1850s by Urbain Le Verrier and persisted as a nagging contradiction within classical mechanics for many decades. Its theoretical resolution remained incomplete until Einstein’s work in the early part of the 20th century.  As for the credit, that’s an issue that matters a lot to scientists but not really to science. A discovery is a discovery regardless of the name attached to it.\nVox:\nSo we have successfully established several important points of agreement.  We know that when an error occurs during the employment of science, it is the responsibility of the employer.  When that error is detected and corrected, the correction is credited to those who participated in detecting and correcting it, although the detectors need not be the correctors.  These statements are all very clear and create no confusion with regards to themselves.  And yet, I find myself unable to balance them with the original question.  Allow me to explain the difficulty in which I find myself.\nIn addition to the previously mentioned conclusions, we have also noted that those who employ science are not uniquely prone to error.  A doctor can make a mistake, as can an accountant.  And just as we do not blame science for the error of the scientist, we do not blame medicine for the error of the doctor.  Neither do we hold accounting responsible for the error of the accountant.  When a second doctor corrects the error of the first doctor or when a second accountant corrects the error of the first accountant, we correctly credit the correction to the second doctor and the second accountant, not to medicine or accounting.  And therefore, we do not say that either medicine or accounting are\nself-correcting\n, we instead consider them to be\ncapable of being corrected\n.\nHowever, because we have concluded that it is scientists, or anyone else participating in the correction process, who corrects the errors of other scientists in science, which is in keeping with the way that doctors correct the errors of other doctors in medicine and accountants correct the errors of other accountants in accounting, shall we therefore conclude that medicine and accounting are also self-correcting?\nThe Physicist\n:\nScience has no monopoly on self-correction. An accounting uncovering error or fraud by examining a spreadsheet is not doing something so different from a scientist uncovering a problem with a theory by examining instrument readings. In both cases the members of the professions are correcting their previous errors.\nHowever, the the character of the corrections in accounting and science are somewhat different. The rules of accounting are set by accountants, lawyers, and legislators. Errors and corrections happen within that known framework, which can itself be adjusted. In science the framework is the laws of nature, which are not known a priori and can’t be adjusted. (Citigroup can rewrite accounting law, Virgin Galactic can’t rewrite gravity.) So sure, you could say accounting is self-correcting. That description might not be as useful as it is for the scientific study of natural laws, but it wouldn’t be wrong.\nThe Biochemist:\nMedicine and accounting are “capable of being corrected”. In your scenarios, they are self-correcting via redundancy; one engineering method of adding self-correction to a system. Most systems that are self-correcting can also exist in a non-self-correcting state. Most FM receivers use “Automatic Frequency Control” to lock to a station, but many also have a button to toggle the AFC off. A system of medicine or accounting is self-correcting if it enforces the requirement of a second opinion or an outside audit.\nVox:\nI am afraid both my distinguished interlocutors appear to be committing a basic category error here.  Previously, we had agreed that the error is committed by one party and corrected by another party, which may in fact be the same party.  But at no point in time has anyone asserted that it is the method utilized by one or both parties which either commits or corrects the error.  Just as one cannot confuse the fact of a car being driven with a car driving itself, it is not correct to say that which is capable of being corrected is correcting itself.  Now, I understand that one can reasonably describe the entire system which contains both the acting individuals as well as the process that is utilized as a “self-correcting” system in some very broad sense, but this all-encompassing systemic concept  is quite clearly not the definition of science which we defined earlier.\nBut perhaps I am mistaken, so it might prove instructive to further contemplate this broad and inclusive  definition of a self-correcting system.  So far, it has been asserted that systems of science, medicine, and accounting are self-correcting.  Based on the definition of “a system that enforces the requirement of a second opinion or an outside audit” can we also say that systems of politics, mathematics, law, publishing, and theology are all self-correcting as well?",
  "tags": [
    "science trialogue"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-02-02T22:30:00+00:00"
}