{
  "url": "https://voxday.net/2024/10/15/5-6x-fatality/",
  "scraped_at": "2026-01-08T19:26:21.675298",
  "title": "5-6x Fatality",
  "date_display": "October 15, 2024",
  "date_iso": "2024-10-15T12:34:45+00:00",
  "date_from_url": "2024-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just in case all the vaccinated young people dying of heart attacks and turbocancers didn’t clue you in, the Science is finally beginning to consider the possibility that maybe, just maybe, the vaxx <a href=\"https://kirschsubstack.com/p/us-data-shows-covid-vaccinated-kids\">might not be good for children.</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A new paper published in the peer-reviewed medical literature (Yang) looking at over 300,000 kids aged 5-18 (mostly in the US) shows a highly statistically significant 5.7X higher mortality rate for those who opted to get vaccinated. The authors didn’t mention that at all. Furthermore, when they were asked about it, they refused to comment on it. So I will.</p><p>Secondly, a new FOIA response in New Zealand shows nearly a stunning 5X increase in cardiac-related ER visits in those under age 40 after the COVID shots rolled out from 4406 in 2020 to 21416 in the first full year after the shots rolled out. That’s a Z-score of 256 which means something very serious is causing this; it is in no way a statistical fluke.</p></blockquote><p>Of course, it took them about 60 years to admit that putting fluoride in the water is bad for people, so this turnaround is happening in record time. As always, view anything the government recommends as being good, or worse, absolutely necessary, for your health with extreme skepticism. Remember, when they tell you that they want to reduce the population, <em>they’re talking about you.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/b24a0b37-ed4c-4da5-82a3-ad928d1dbcb4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just in case all the vaccinated young people dying of heart attacks and turbocancers didn’t clue you in, the Science is finally beginning to consider the possibility that maybe, just maybe, the vaxx\nmight not be good for children.\nA new paper published in the peer-reviewed medical literature (Yang) looking at over 300,000 kids aged 5-18 (mostly in the US) shows a highly statistically significant 5.7X higher mortality rate for those who opted to get vaccinated. The authors didn’t mention that at all. Furthermore, when they were asked about it, they refused to comment on it. So I will.\nSecondly, a new FOIA response in New Zealand shows nearly a stunning 5X increase in cardiac-related ER visits in those under age 40 after the COVID shots rolled out from 4406 in 2020 to 21416 in the first full year after the shots rolled out. That’s a Z-score of 256 which means something very serious is causing this; it is in no way a statistical fluke.\nOf course, it took them about 60 years to admit that putting fluoride in the water is bad for people, so this turnaround is happening in record time. As always, view anything the government recommends as being good, or worse, absolutely necessary, for your health with extreme skepticism. Remember, when they tell you that they want to reduce the population,\nthey’re talking about you.\nDISCUSS ON SG",
  "tags": [
    "science",
    "Vaxx"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-15T12:34:46+00:00"
}