{
  "url": "https://voxday.net/2024/10/13/a-different-god/",
  "scraped_at": "2026-01-08T19:26:12.410028",
  "title": "A Different God",
  "date_display": "October 13, 2024",
  "date_iso": "2024-10-13T21:45:17+00:00",
  "date_from_url": "2024-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whenever people talk about God, it’s extremely important to determine exactly what god they’re talking about. Because the god <a href=\"https://www.dailymail.co.uk/news/article-13891693/rabbi-father-abuse-memoir-sara-sherbill-darker-secrets.html\">this man served</a> was not the Creator whom Christians worship as the Father of Jesus Christ:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A beloved rabbi in an Orthodox community in Chicago, he has just come home from synagogue in a foul temper – something that has been happening more and more regularly lately – and the violence rises slowly and with a terrifying inevitability.</p><p>In her searing new memoir, <em>There Was Night and There Was Morning</em>, Sherbill describes her father’s dark double life and how, once he was no longer able to abuse his own family, he descended into a spiral of depraved drug abuse, preying on vulnerable young girls in his congregation.</p></blockquote><p>It’s not just about the observable behaviors either, as in the case of a sinful priest or pastor. What many people don’t understand about the rabbinic religion is that the Torah is not studied in order to better obey it, but rather, to better determine how to “legally” work around it. It’s very much like the Constitution, whereas the Talmud is akin to the growing collection of case law and interpretation that takes precedence over the black letter law itself. In the same way lawyers are able to justify violating Constitutional rights despite the clear language of the Constitution, rabbis are highly skilled in their ability to justify various activities despite the clear language of the Law of the Old Testament.</p><p>Which is why there is a specific warning in Isaiah against those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter.</p><p>If you can imagine ten thousand Ben Shapiros deciding what is right, what is wrong, and constantly redefining both over time as desired, that’s pretty much the situation.</p><p><em><a href=\"https://socialgalactic.com/micropost/43a3b47f-a067-4755-8d7e-52e9d83b4825\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Whenever people talk about God, it’s extremely important to determine exactly what god they’re talking about. Because the god\nthis man served\nwas not the Creator whom Christians worship as the Father of Jesus Christ:\nA beloved rabbi in an Orthodox community in Chicago, he has just come home from synagogue in a foul temper – something that has been happening more and more regularly lately – and the violence rises slowly and with a terrifying inevitability.\nIn her searing new memoir,\nThere Was Night and There Was Morning\n, Sherbill describes her father’s dark double life and how, once he was no longer able to abuse his own family, he descended into a spiral of depraved drug abuse, preying on vulnerable young girls in his congregation.\nIt’s not just about the observable behaviors either, as in the case of a sinful priest or pastor. What many people don’t understand about the rabbinic religion is that the Torah is not studied in order to better obey it, but rather, to better determine how to “legally” work around it. It’s very much like the Constitution, whereas the Talmud is akin to the growing collection of case law and interpretation that takes precedence over the black letter law itself. In the same way lawyers are able to justify violating Constitutional rights despite the clear language of the Constitution, rabbis are highly skilled in their ability to justify various activities despite the clear language of the Law of the Old Testament.\nWhich is why there is a specific warning in Isaiah against those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter.\nIf you can imagine ten thousand Ben Shapiros deciding what is right, what is wrong, and constantly redefining both over time as desired, that’s pretty much the situation.\nDISCUSS ON SG",
  "tags": [
    "judeo-christianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-13T21:45:19+00:00"
}