{
  "url": "https://voxday.net/2024/10/02/a-question-of-identity/",
  "scraped_at": "2026-01-08T19:24:57.612691",
  "title": "A Question of Identity",
  "date_display": "October 2, 2024",
  "date_iso": "2024-10-02T14:25:18+00:00",
  "date_from_url": "2024-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The debate moderators asked Tim Walz why he lied about being in China during the Tiananmen Square Massacre. After rambling for two minutes about sometimes being a knucklehead and getting caught up in the rhetoric it seemed like Tim Walz admitted lying. When the moderator asked him to explain why he lied he backtracked and claimed he was in China during the massacre despite photographic evidence he was in Nebraska at the time.</em></p><p>Obviously the man <em>identifies </em>as having been a Chinese student in a specific geolocation in the space-time continuum. What does “photographic evidence” have to do with anything? After all, this is a man who not only believes that men can identify as women, but ordered tampons put into the boys rooms in schools in support of those theoretical alternate realities.</p><p>The fact that anyone would ever even consider voting for the Harris-Walz ticket, combined with the fact that 1,312,349 people voted to RE-ELECT Walz as the Governor of Minnesota, is sufficient proof that representative democracy is an unmitigated catastrophe and a worse form of government than monarchy, the lottery, or pretty much any other historical or imaginary form of government.</p><p><em><a href=\"https://socialgalactic.com/micropost/9409bf21-0cb3-40af-ac81-b933986df532\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The debate moderators asked Tim Walz why he lied about being in China during the Tiananmen Square Massacre. After rambling for two minutes about sometimes being a knucklehead and getting caught up in the rhetoric it seemed like Tim Walz admitted lying. When the moderator asked him to explain why he lied he backtracked and claimed he was in China during the massacre despite photographic evidence he was in Nebraska at the time.\nObviously the man\nidentifies\nas having been a Chinese student in a specific geolocation in the space-time continuum. What does “photographic evidence” have to do with anything? After all, this is a man who not only believes that men can identify as women, but ordered tampons put into the boys rooms in schools in support of those theoretical alternate realities.\nThe fact that anyone would ever even consider voting for the Harris-Walz ticket, combined with the fact that 1,312,349 people voted to RE-ELECT Walz as the Governor of Minnesota, is sufficient proof that representative democracy is an unmitigated catastrophe and a worse form of government than monarchy, the lottery, or pretty much any other historical or imaginary form of government.\nDISCUSS ON SG",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-02T14:25:22+00:00"
}