{
  "url": "https://voxday.net/2024/10/11/always-fake-usually-gay/",
  "scraped_at": "2026-01-08T19:25:59.985086",
  "title": "Always Fake, Usually Gay",
  "date_display": "October 11, 2024",
  "date_iso": "2024-10-11T22:27:54+00:00",
  "date_from_url": "2024-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lo and behold, but it turns out that the Real Men who are turning out for Kamala Harris in her television ads are just the usual theater kids pretending to be men they are not and could never be.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As many of you know, Jimmy Kimmel’s writer, Jacob Reed, directed an ad for the campaign titled <em>Men for Kamala</em>. The ad features what are presented as everyday male voters explaining why supporting Kamala Harris is the masculine thing to do. However, none of the men in the ad are actually regular voters—they are paid actors.</p><p>Moreover, their real-life circumstances differ significantly from the individuals they portray in the ad. Here are their stories:</p><ul class=\"wp-block-list\"><li>Wayland McQueen is a far-left, pro-Antifa comedian and actor who has, until now, found limited success. He does improv gigs at the Upright Citizens Brigade in Los Angeles. In a Twitter post from 2022, he explains what white privilege is and tells you why you need to acknowledge your white privilege. As of 2024 he is single.</li><li>Lanre Idewu is an immigrant from Nigeria. He is also an actor who works at the D.C.-based OCTET Productions. He has many intimate pictures with the Obamas and the Bidens. Idewu, who is bisexual, has done gay-for-pay movies and nude solo shoots. In the Men for Kamala ad, he says he is “man enough to braid his daughter’s hair,” but the only problem is that he doesn’t have a daughter. Idewu isn’t braiding anyone’s hair.</li><li>Mike Leffingwell, a gay man, also works at the Upright Citizens Brigade, where McQueen works. He is an acting coach, cartoon writer for Netflix and DreamWorks, and an actor in TV commercials. On his public Instagram page, he showcases his participation in his latest project—the Men for Kamala ad.</li><li>Winston Carter, the heavyset fellow in the ad who claims to be a mechanic and rancher, lives in Los Angeles signed with Taft Broadcasting Company. He has found limited success in the acting world, mainly as an extra in films and as a character in the low-budget superhero film Spaghettiman.</li><li>Tony Ketcham, the tough, rugged, bearded grandpa in his garage in the Men for Kamala ad, is also an actor. He now mainly does low-budget independent films like Car Botz, where he played the role of PePaw. Tony is unmarried in real life. In 2001, he played the extra role of “alcoholic consumer” in the movie Ghost World.</li></ul><p>Well, I know I am just shocked to discover that these actors on television aren’t genuine. I definitely won’t be voting for Kamala now! What’s next, we’ll learn that the guys who were on <em>The Big Bang Theory</em> don’t actually do science?</p><p><em><a href=\"https://socialgalactic.com/micropost/164b20c8-88aa-4713-81d2-a5751d2d28d6\">DISCUSS ON SG</a></em></p></blockquote></div>",
  "content_text": "Lo and behold, but it turns out that the Real Men who are turning out for Kamala Harris in her television ads are just the usual theater kids pretending to be men they are not and could never be.\nAs many of you know, Jimmy Kimmel’s writer, Jacob Reed, directed an ad for the campaign titled\nMen for Kamala\n. The ad features what are presented as everyday male voters explaining why supporting Kamala Harris is the masculine thing to do. However, none of the men in the ad are actually regular voters—they are paid actors.\nMoreover, their real-life circumstances differ significantly from the individuals they portray in the ad. Here are their stories:\nWayland McQueen is a far-left, pro-Antifa comedian and actor who has, until now, found limited success. He does improv gigs at the Upright Citizens Brigade in Los Angeles. In a Twitter post from 2022, he explains what white privilege is and tells you why you need to acknowledge your white privilege. As of 2024 he is single.\nLanre Idewu is an immigrant from Nigeria. He is also an actor who works at the D.C.-based OCTET Productions. He has many intimate pictures with the Obamas and the Bidens. Idewu, who is bisexual, has done gay-for-pay movies and nude solo shoots. In the Men for Kamala ad, he says he is “man enough to braid his daughter’s hair,” but the only problem is that he doesn’t have a daughter. Idewu isn’t braiding anyone’s hair.\nMike Leffingwell, a gay man, also works at the Upright Citizens Brigade, where McQueen works. He is an acting coach, cartoon writer for Netflix and DreamWorks, and an actor in TV commercials. On his public Instagram page, he showcases his participation in his latest project—the Men for Kamala ad.\nWinston Carter, the heavyset fellow in the ad who claims to be a mechanic and rancher, lives in Los Angeles signed with Taft Broadcasting Company. He has found limited success in the acting world, mainly as an extra in films and as a character in the low-budget superhero film Spaghettiman.\nTony Ketcham, the tough, rugged, bearded grandpa in his garage in the Men for Kamala ad, is also an actor. He now mainly does low-budget independent films like Car Botz, where he played the role of PePaw. Tony is unmarried in real life. In 2001, he played the extra role of “alcoholic consumer” in the movie Ghost World.\nWell, I know I am just shocked to discover that these actors on television aren’t genuine. I definitely won’t be voting for Kamala now! What’s next, we’ll learn that the guys who were on\nThe Big Bang Theory\ndon’t actually do science?\nDISCUSS ON SG",
  "tags": [
    "Hellmouth",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-11T22:27:56+00:00"
}