{
  "url": "https://voxday.net/2024/10/02/an-incoherent-narrative/",
  "scraped_at": "2026-01-08T19:25:01.285239",
  "title": "An Incoherent Narrative",
  "date_display": "October 2, 2024",
  "date_iso": "2024-10-02T09:47:40+00:00",
  "date_from_url": "2024-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both Israel and the USA are crowing that the Iranian missile attack did absolutely no harm whatsoever to Israel. Ha ha ha, so very funny!</p><ul class=\"wp-block-list\"><li><em>Israel’s defence system halts barrage of missiles as Iran’s attack falls flat.</em></li><li><em>In a major embarrassment for Iran, the US said that the missile volley was ‘defeated and ineffective’, with just one reported death – a Palestinian man who was killed by shrapnel in the West Bank.</em></li><li><em>Iran’s Missile Barrage Fails Again</em></li><li><em>Like its previous attack in April of 2024, the onslaught failed to leave a mark on the Jewish state.</em></li><li><em>IDF says no harm… It emphasized that there was no damage to the “competence” of the Israeli Air Force in the attack, and said the IAF’s planes, air defenses, and air traffic control were operating normally.</em></li></ul><p>In some reports, there is whiplash, as the narrative lurches from one extreme to the other:</p><p><em>As Iran unleashed a salvo of missiles, ordered by its supreme leader Ali Khamenei, falling projectiles burned like comets against the night sky after the rockets were intercepted by Israel’s ‘Iron Dome’ defensive system. The sickening attack, which Israel has vowed to exact revenge for…</em></p><p>What is “sickening” about an embarrassingly “ineffective” attack “failed to leave a mark” and harmed almost no one? And how is one salvo of missiles a “major escalation” in response to a) days of relentless bombing of a foreign country and b) a ground invasion of a foreign country?</p><p>Meanwhile, Iran claims to have fired Fattah-2 hypersonic missiles, and <a href=\"https://simplicius76.substack.com/p/operation-true-promise-2-iran-strikes\">there is video evidence of at least three</a> hitting their targets. So unless Iran did not actually fire the missiles and the videos are from Ukraine, the IDF is obviously lying; the best US systems have not been able to shoot down any Russian hypersonics in Ukraine. That being said, it’s highly unlikely that any F-35s were destroyed on the ground and the Iranian claim that “a large number of tanks were destroyed” can almost certainly be dismissed in the absence of any satellite imagery or videos showing the wrecks.</p><p>However, the one thing that can be believed amidst all the ridiculous lies and hypocrisy is the Iran Revolutionary Guard Corps warning about what will happen if Israel doesn’t heed the Iranian message: <em>“If the Zionist regime responds to our attack, our next strikes will be more destructive.”</em></p><p>It’s clear from the incoherency of the Clown World narrative that they’re not sure what to do in light of the usual rhetoric falling so flat. When NATO “allies” are calling for a UN invasion of Israel and most of the world is wondering how Russia, Belarus, and China are being sanctioned while Israel isn’t despite the customary media barrage, it’s clear that no amount of rhetoric will change the new power dynamic.</p><p>And what use is Israel’s so-called “Samson Option” in deterring the sovereign nations? Seeing Israel set off suitcase nukes in some European capitals in an attack that couldn’t possibly be blamed on them would be seen as a very fortunate development in Beijing, Moscow, and Tehran.</p><p>Regardless, the present small-scale war in the Middle East isn’t going to be settled by air strikes any more than the much larger-scale war in Ukraine will be. And it’s already evident that Hezbollah’s ability to engage on the ground hasn’t been seriously affected by the air war.</p><p><em>Hezbollah has launched more than 100 rockets into Israel, with the group claiming it has targeted troops massing on the border as the Israeli Defence Forces ordered more troops and armoured units to join its ground invasion of Lebanon. Hezbollah said this morning that its forces had confronted Israeli soldiers who were infiltrating the southern village of Adaisseh and forced them to retreat.</em></p><p>This is the fourth Israeli invasion of Lebanon since 1979. What it is supposed to accomplish that the others didn’t is very unclear at this time. As far as I can tell, the Israeli strategy is to continue escalating until the USA declares war on Iran, while hoping that Russia, Turkiye, and China all stand by and do nothing. That might have worked in 1991, or even as late as 2008, but I very much doubt it will do so in 2024. The tail may be able to wag the dog, but it’s a terrible idea when the dog is facing a bear.</p><p>And/or a dragon. China is very unhappy with the USA’s continued interference in its internal affairs, as a spokesman for the Foreign Ministry made clear yesterday.</p><p><strong>Phoenix TV:</strong> <em>The White House announced on its website the decision to provide around US$ 567 million military assistance to China’s Taiwan region. What’s China’s comment?</em></p><p><strong>Lin Jian: </strong>The US again provides weapons to China’s Taiwan region, which seriously violates the one-China principle and the three China-US joint communiqués, especially the August 17 Communiqué of 1982. The move is in fact emboldening Lai Ching-te and the DPP authorities as they cling to the stance of “Taiwan independence” and make deliberate provocations on the one-China principle. This once again shows that the separatist moves for “Taiwan independence” and connivance and support for such moves from US-led external forces are the biggest threat facing cross-Strait peace and stability and cause the greatest disruption to the real status quo in the Taiwan Strait. Let me be clear, “Taiwan independence” separatism is a dead end and what the US has done to assist the “Taiwan independence” attempt by arming Taiwan will only backfire. We urge the US to earnestly abide by the one-China principle and the three China-US joint communiqués, and stop arming Taiwan in any form. No matter how many weapons the US provides to the Taiwan region, it will never weaken our firm will in opposing “Taiwan independence,” and safeguarding China’s national sovereignty and territorial integrity.</p><p><strong>UPDATE: </strong>Apparently Hezbollah wasn’t just blowing smoke. Ground operations are always more costly than air operations in terms of human life. And while the Israelis claim to have killed 20 Hezbollah “operatives”, that’s an equation that favors the Hezbollah-Iranian alliance even if the number isn’t exaggerated. Martin van Creveld has repeatedly warned that Hezbollah’s light infantry is very good, even if they don’t have much in the way of armor or artillery, and absolutely no air support.</p><p><em>The IDF announced the first fatalities of Israel’s ground operation in Lebanon on Wednesday after eight soldiers were killed during battles against Hezbollah operatives in the south of the country.</em></p><p>It is perhaps worth noting that this means the first day of the invasion has already accounted for 6.6 percent of the 2006 war’s IDF fatalities. That indicates that if the current conflict lasts as long as the previous one, it will cost Israel about twice as much in terms of manpower. I find it hard to imagine that any objective that can be reasonably achieved will be worth that cost. If killing Lebanese is the goal, the air strikes have already accomplished that at a much lower cost to Israel.</p><p><em><a href=\"https://socialgalactic.com/micropost/02e56ec4-4fa7-4b7c-bfde-92ecc6d3de93\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Both Israel and the USA are crowing that the Iranian missile attack did absolutely no harm whatsoever to Israel. Ha ha ha, so very funny!\nIsrael’s defence system halts barrage of missiles as Iran’s attack falls flat.\nIn a major embarrassment for Iran, the US said that the missile volley was ‘defeated and ineffective’, with just one reported death – a Palestinian man who was killed by shrapnel in the West Bank.\nIran’s Missile Barrage Fails Again\nLike its previous attack in April of 2024, the onslaught failed to leave a mark on the Jewish state.\nIDF says no harm… It emphasized that there was no damage to the “competence” of the Israeli Air Force in the attack, and said the IAF’s planes, air defenses, and air traffic control were operating normally.\nIn some reports, there is whiplash, as the narrative lurches from one extreme to the other:\nAs Iran unleashed a salvo of missiles, ordered by its supreme leader Ali Khamenei, falling projectiles burned like comets against the night sky after the rockets were intercepted by Israel’s ‘Iron Dome’ defensive system. The sickening attack, which Israel has vowed to exact revenge for…\nWhat is “sickening” about an embarrassingly “ineffective” attack “failed to leave a mark” and harmed almost no one? And how is one salvo of missiles a “major escalation” in response to a) days of relentless bombing of a foreign country and b) a ground invasion of a foreign country?\nMeanwhile, Iran claims to have fired Fattah-2 hypersonic missiles, and\nthere is video evidence of at least three\nhitting their targets. So unless Iran did not actually fire the missiles and the videos are from Ukraine, the IDF is obviously lying; the best US systems have not been able to shoot down any Russian hypersonics in Ukraine. That being said, it’s highly unlikely that any F-35s were destroyed on the ground and the Iranian claim that “a large number of tanks were destroyed” can almost certainly be dismissed in the absence of any satellite imagery or videos showing the wrecks.\nHowever, the one thing that can be believed amidst all the ridiculous lies and hypocrisy is the Iran Revolutionary Guard Corps warning about what will happen if Israel doesn’t heed the Iranian message:\n“If the Zionist regime responds to our attack, our next strikes will be more destructive.”\nIt’s clear from the incoherency of the Clown World narrative that they’re not sure what to do in light of the usual rhetoric falling so flat. When NATO “allies” are calling for a UN invasion of Israel and most of the world is wondering how Russia, Belarus, and China are being sanctioned while Israel isn’t despite the customary media barrage, it’s clear that no amount of rhetoric will change the new power dynamic.\nAnd what use is Israel’s so-called “Samson Option” in deterring the sovereign nations? Seeing Israel set off suitcase nukes in some European capitals in an attack that couldn’t possibly be blamed on them would be seen as a very fortunate development in Beijing, Moscow, and Tehran.\nRegardless, the present small-scale war in the Middle East isn’t going to be settled by air strikes any more than the much larger-scale war in Ukraine will be. And it’s already evident that Hezbollah’s ability to engage on the ground hasn’t been seriously affected by the air war.\nHezbollah has launched more than 100 rockets into Israel, with the group claiming it has targeted troops massing on the border as the Israeli Defence Forces ordered more troops and armoured units to join its ground invasion of Lebanon. Hezbollah said this morning that its forces had confronted Israeli soldiers who were infiltrating the southern village of Adaisseh and forced them to retreat.\nThis is the fourth Israeli invasion of Lebanon since 1979. What it is supposed to accomplish that the others didn’t is very unclear at this time. As far as I can tell, the Israeli strategy is to continue escalating until the USA declares war on Iran, while hoping that Russia, Turkiye, and China all stand by and do nothing. That might have worked in 1991, or even as late as 2008, but I very much doubt it will do so in 2024. The tail may be able to wag the dog, but it’s a terrible idea when the dog is facing a bear.\nAnd/or a dragon. China is very unhappy with the USA’s continued interference in its internal affairs, as a spokesman for the Foreign Ministry made clear yesterday.\nPhoenix TV:\nThe White House announced on its website the decision to provide around US$ 567 million military assistance to China’s Taiwan region. What’s China’s comment?\nLin Jian:\nThe US again provides weapons to China’s Taiwan region, which seriously violates the one-China principle and the three China-US joint communiqués, especially the August 17 Communiqué of 1982. The move is in fact emboldening Lai Ching-te and the DPP authorities as they cling to the stance of “Taiwan independence” and make deliberate provocations on the one-China principle. This once again shows that the separatist moves for “Taiwan independence” and connivance and support for such moves from US-led external forces are the biggest threat facing cross-Strait peace and stability and cause the greatest disruption to the real status quo in the Taiwan Strait. Let me be clear, “Taiwan independence” separatism is a dead end and what the US has done to assist the “Taiwan independence” attempt by arming Taiwan will only backfire. We urge the US to earnestly abide by the one-China principle and the three China-US joint communiqués, and stop arming Taiwan in any form. No matter how many weapons the US provides to the Taiwan region, it will never weaken our firm will in opposing “Taiwan independence,” and safeguarding China’s national sovereignty and territorial integrity.\nUPDATE:\nApparently Hezbollah wasn’t just blowing smoke. Ground operations are always more costly than air operations in terms of human life. And while the Israelis claim to have killed 20 Hezbollah “operatives”, that’s an equation that favors the Hezbollah-Iranian alliance even if the number isn’t exaggerated. Martin van Creveld has repeatedly warned that Hezbollah’s light infantry is very good, even if they don’t have much in the way of armor or artillery, and absolutely no air support.\nThe IDF announced the first fatalities of Israel’s ground operation in Lebanon on Wednesday after eight soldiers were killed during battles against Hezbollah operatives in the south of the country.\nIt is perhaps worth noting that this means the first day of the invasion has already accounted for 6.6 percent of the 2006 war’s IDF fatalities. That indicates that if the current conflict lasts as long as the previous one, it will cost Israel about twice as much in terms of manpower. I find it hard to imagine that any objective that can be reasonably achieved will be worth that cost. If killing Lebanese is the goal, the air strikes have already accomplished that at a much lower cost to Israel.\nDISCUSS ON SG",
  "tags": [
    "Middle East",
    "rhetoric",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-02T20:00:26+00:00"
}