{
  "url": "https://voxday.net/2024/10/14/end-game-in-ukraine/",
  "scraped_at": "2026-01-08T19:26:14.260968",
  "title": "End Game in Ukraine",
  "date_display": "October 14, 2024",
  "date_iso": "2024-10-14T00:45:16+00:00",
  "date_from_url": "2024-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s all but over for the Kiev regime. It’s taken Berlin 31 months to recognize the obvious, but the Germans, which means the Europeans, <a href=\"https://www.rt.com/russia/605653-german-military-hardware-ukraine/\">have finally given up</a> on the idea of winning Clown World’s proxy war on Russia. The right thing to do would be to instruct Kiev to surrender and spare the lives of the Ukrainian soldiers whose sacrifice would be totally pointless at this point.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Germany has no more military hardware to offer Ukraine beyond what has already been pledged, even as Kiev remains hard-pressed by Russia on the front line, <em>Bild </em>reported on Saturday.</p><p>According to the outlet, the German Defense Ministry does not believe that Ukraine will be capable of launching “an offensive to liberate its own territory” in the near future.</p><p>The report also said, citing an internal document, that Berlin would no longer send “heavy weapons” to Ukraine, and that deliveries of this type of aid have been “completed.” The term applies to tanks, infantry fighting vehicles, armored personnel carriers, self-propelled howitzers and similar hardware.</p></blockquote><p>Russia obviously can, and will, grind it out until Kiev is flattened like Berlin was in 1945. But I doubt anyone who doesn’t belong to the Azov Brigade is going to be very interested in facing the increasingly capable Russian war machine, which history has repeatedly shown will continue to improve its abilities until it takes the enemy capital.</p><p>In the 19th century, the Russians took Paris. In the 20th century, the Russians took Berlin. In the 21st century, if they are forced to do so by NATO’s recalcitrance, the Russians will take Kiev, Berlin, and Paris. Fortunately, Putin understands the evils of empire and has no interest in following the disastrous lead of the British and US empires. So it would be much better for everyone if the inevitable were simply accepted, however bitterly, now instead of this time next year.</p><p><em><a href=\"https://socialgalactic.com/micropost/1280d427-b84a-42b1-9594-b3667deb618d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s all but over for the Kiev regime. It’s taken Berlin 31 months to recognize the obvious, but the Germans, which means the Europeans,\nhave finally given up\non the idea of winning Clown World’s proxy war on Russia. The right thing to do would be to instruct Kiev to surrender and spare the lives of the Ukrainian soldiers whose sacrifice would be totally pointless at this point.\nGermany has no more military hardware to offer Ukraine beyond what has already been pledged, even as Kiev remains hard-pressed by Russia on the front line,\nBild\nreported on Saturday.\nAccording to the outlet, the German Defense Ministry does not believe that Ukraine will be capable of launching “an offensive to liberate its own territory” in the near future.\nThe report also said, citing an internal document, that Berlin would no longer send “heavy weapons” to Ukraine, and that deliveries of this type of aid have been “completed.” The term applies to tanks, infantry fighting vehicles, armored personnel carriers, self-propelled howitzers and similar hardware.\nRussia obviously can, and will, grind it out until Kiev is flattened like Berlin was in 1945. But I doubt anyone who doesn’t belong to the Azov Brigade is going to be very interested in facing the increasingly capable Russian war machine, which history has repeatedly shown will continue to improve its abilities until it takes the enemy capital.\nIn the 19th century, the Russians took Paris. In the 20th century, the Russians took Berlin. In the 21st century, if they are forced to do so by NATO’s recalcitrance, the Russians will take Kiev, Berlin, and Paris. Fortunately, Putin understands the evils of empire and has no interest in following the disastrous lead of the British and US empires. So it would be much better for everyone if the inevitable were simply accepted, however bitterly, now instead of this time next year.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-14T00:45:18+00:00"
}