{
  "url": "https://voxday.net/2024/10/14/exposing-the-mmc/",
  "scraped_at": "2026-01-08T19:26:16.115930",
  "title": "Exposing the MMC",
  "date_display": "October 14, 2024",
  "date_iso": "2024-10-14T10:04:51+00:00",
  "date_from_url": "2024-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not surprised that Ron Unz reached <a href=\"https://www.unz.com/runz/american-pravda-michael-collins-piper-miles-mathis-and-proving-pi-4/\">much the same conclusion that I did</a> about the Miles Mathis Committee:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The first of my surprises was the sheer volume of his material. I try to be methodical and comprehensive, so I’d originally planned to read his entire corpus of work, but I immediately saw that this was totally impossible unless I was willing to invest many, many months in the project.</p><p>His main eponymous website MilesWMathis.com includes an “Update Page” containing links to well over 1,500 of his articles and their updates, of which nearly 1,000 were his new pieces on conspiratorial topics, stretching back to around 2011 or so, with only a small fraction of these being by guest contributors. Spot-checking the word-count on a few of them suggested that they are rarely shorter than 5,000 words and perhaps might average closer to 8,000 words or more. So the total of his conspiratorial writings certainly runs many, many millions of words, with most of those pieces also containing numerous images. He had probably published enough content to fill at least 60 or 70 non-fiction books, certainly an astonishing level of productivity for a single writer.</p><p>Indeed, the volume of conspiratorial material on this Mathis website was so enormous that I suspect his aggregate content is far greater than the combined total for every other conspiracy-website on the Internet. Given that huge quantity of writing he even provided a separate archive page listing the 160 conspiratorial articles that he considers his best.</p><p>Writing a 5,000 or 10,000 word essay of entirely original text often including copious images and doing that every couple of days or so seems a rather formidable undertaking for a single individual, especially since nearly all of these were apparently based upon extensive Internet research. These essays seem reasonably well written, though usually in his trademark meandering, obfuscating style, and I spotted very few typos, spelling errors, or grammatical mistakes, indicating that they had also been carefully proofed, certainly far more so than the output of a typical website writer.</p><p>Furthermore, I soon discovered that he also maintained an entirely separate website called MilesMathis.com, devoted to his mathematical and scientific writing, which includes nearly another 500 articles, supposedly totaling some 7,800 pages of text and perhaps 1.5 million words or more. A little spot-checking suggested that there was only slight overlap with those listed on his main website.</p><p>One very odd aspect of his work was that apparently all of the 1,500 or so individual articles on his main website were in the form of PDF files rather than as ordinary HTML pages, and I could think of no other writer nor blogger who followed that approach.</p></blockquote><p>For me, it wasn’t the volume, but rather, the observably different writing styles appearing <a href=\"https://mileswmathis.com/bestfake.html\">in the same papers</a>. I personally know and edit two extremely prolific writers, John C. Wright and Chuck Dixon. And there is a fundamental sameness to their writing styles, even across a much wider range of thematic topics, than one sees in the Miles Mathis, JK Rowling, or James Patterson committees. Even books written by a pair of co-writers instead of a single author is usually quite identifiable; for example, if you compare <em>Good Omens</em> to a typical book by either Terry Pratchett or Neil Gaiman, it’s very easy to not only see that two authors were involved, but to a certain extent, which parts were written by whom.</p><p>In the case of the MMC, the painter guy, who has a very good eye for photo fakes, is clearly different than the genealogy guy. The difference is downright jarring when they’re both contributing to the same article. And they’re both different than the history guy, who has a much better grasp on basic history than most writers.</p><p>Don’t get me wrong, I genuinely like reading the MMC, regardless of who is running it. The fact is that if you read Miles Mathis, you’ll get far closer to the truth of objective reality than you ever will by reading <em>The New York Times</em> and other news organizations responsible for maintaining the current Narrative. When the mainstream media talks about “misinformation” they are just projecting their own behavior onto others. As the meme has it, “conspiracy theory” is just another word for “sneak preview”.</p><p>I don’t know about you, but I’m certainly looking forward to reading the now-inevitable expose about how I am a Swiss intelligence operative descended from a long line of aristocratic British crypto-rabbis who is motivated by pure jealousy of Miles’s luxurious golden ringlets. My connections to Owen Benjamin alone should be sufficient to fill at least two pages of the PDF. Beale/Bâle/Baal. Phoenician Navy confirmed!</p><p><em><a href=\"https://socialgalactic.com/micropost/93654fd3-5e5a-4022-acdf-be422e594f9d/comment/1759e6a6-5a64-42dd-8231-25a460d3c919\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m not surprised that Ron Unz reached\nmuch the same conclusion that I did\nabout the Miles Mathis Committee:\nThe first of my surprises was the sheer volume of his material. I try to be methodical and comprehensive, so I’d originally planned to read his entire corpus of work, but I immediately saw that this was totally impossible unless I was willing to invest many, many months in the project.\nHis main eponymous website MilesWMathis.com includes an “Update Page” containing links to well over 1,500 of his articles and their updates, of which nearly 1,000 were his new pieces on conspiratorial topics, stretching back to around 2011 or so, with only a small fraction of these being by guest contributors. Spot-checking the word-count on a few of them suggested that they are rarely shorter than 5,000 words and perhaps might average closer to 8,000 words or more. So the total of his conspiratorial writings certainly runs many, many millions of words, with most of those pieces also containing numerous images. He had probably published enough content to fill at least 60 or 70 non-fiction books, certainly an astonishing level of productivity for a single writer.\nIndeed, the volume of conspiratorial material on this Mathis website was so enormous that I suspect his aggregate content is far greater than the combined total for every other conspiracy-website on the Internet. Given that huge quantity of writing he even provided a separate archive page listing the 160 conspiratorial articles that he considers his best.\nWriting a 5,000 or 10,000 word essay of entirely original text often including copious images and doing that every couple of days or so seems a rather formidable undertaking for a single individual, especially since nearly all of these were apparently based upon extensive Internet research. These essays seem reasonably well written, though usually in his trademark meandering, obfuscating style, and I spotted very few typos, spelling errors, or grammatical mistakes, indicating that they had also been carefully proofed, certainly far more so than the output of a typical website writer.\nFurthermore, I soon discovered that he also maintained an entirely separate website called MilesMathis.com, devoted to his mathematical and scientific writing, which includes nearly another 500 articles, supposedly totaling some 7,800 pages of text and perhaps 1.5 million words or more. A little spot-checking suggested that there was only slight overlap with those listed on his main website.\nOne very odd aspect of his work was that apparently all of the 1,500 or so individual articles on his main website were in the form of PDF files rather than as ordinary HTML pages, and I could think of no other writer nor blogger who followed that approach.\nFor me, it wasn’t the volume, but rather, the observably different writing styles appearing\nin the same papers\n. I personally know and edit two extremely prolific writers, John C. Wright and Chuck Dixon. And there is a fundamental sameness to their writing styles, even across a much wider range of thematic topics, than one sees in the Miles Mathis, JK Rowling, or James Patterson committees. Even books written by a pair of co-writers instead of a single author is usually quite identifiable; for example, if you compare\nGood Omens\nto a typical book by either Terry Pratchett or Neil Gaiman, it’s very easy to not only see that two authors were involved, but to a certain extent, which parts were written by whom.\nIn the case of the MMC, the painter guy, who has a very good eye for photo fakes, is clearly different than the genealogy guy. The difference is downright jarring when they’re both contributing to the same article. And they’re both different than the history guy, who has a much better grasp on basic history than most writers.\nDon’t get me wrong, I genuinely like reading the MMC, regardless of who is running it. The fact is that if you read Miles Mathis, you’ll get far closer to the truth of objective reality than you ever will by reading\nThe New York Times\nand other news organizations responsible for maintaining the current Narrative. When the mainstream media talks about “misinformation” they are just projecting their own behavior onto others. As the meme has it, “conspiracy theory” is just another word for “sneak preview”.\nI don’t know about you, but I’m certainly looking forward to reading the now-inevitable expose about how I am a Swiss intelligence operative descended from a long line of aristocratic British crypto-rabbis who is motivated by pure jealousy of Miles’s luxurious golden ringlets. My connections to Owen Benjamin alone should be sufficient to fill at least two pages of the PDF. Beale/Bâle/Baal. Phoenician Navy confirmed!\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "media",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-14T10:28:05+00:00"
}