{
  "url": "https://voxday.net/2024/10/01/hunting-neil-gaiman/",
  "scraped_at": "2026-01-08T19:24:55.777852",
  "title": "Hunting Neil Gaiman",
  "date_display": "October 1, 2024",
  "date_iso": "2024-10-01T18:34:58+00:00",
  "date_from_url": "2024-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The investigative reporters behind the Tortoise Media reports that exposed Neil Gaiman as an alleged sex predator speak out about how <a href=\"https://www.youtube.com/watch?v=AvBseCiJMTY\">they went down the rabbit hole</a>.</p><p><strong>Paul Caruana Galizia: </strong><em>The risk was was we end up telling a story of what he might describe as a messy and difficult sexual relationship, and that he’d never done anything like that before, and it’s a he said-she said situation. As Rachel mentioned, we heard from Scarlett an allegation that there were other women, and which is one we took seriously as well and was also another big public interest test for us. If he’s done this many, many times, then there’s are stronger reasons to do this story. You know, you might argue that he is a threat to young, vulnerable women and that he uses his image to lure them in to problematic sexual relationships, which is also an issue, and so we started exploring all those things. It took a while to break through this real silence around him and this real culture of secrecy and fear, actually, and so speaking up was really quite difficult for them. It took months of turning over stones until we got a lead to a woman who told us that she met Neil Gaiman when she was 18, at a book signing, and began a sexual relationship within two years, and her descriptions of that sexual relationship matched in really precise ways what Scarlet had told us even though they were separated by two decades and many continents.</em></p><p><strong>Rachel Johnson: </strong><em>As far as we were concerned one of the public interests was the fact that Neil Gaiman’s persona and also his career placed him in continuous contact with young admiring women there was his social media activity which is very intense. He connected with fans all the time. There were his book signings, his attendance at readings and and conventions again placing him with young fans, impressionable fans, and then of course the fact that he had a child and this was where Scarlet comes in. So that meant that we felt there was a strong public interest in reporting the allegations, because<br/>several of the women said to us, ‘we don’t want him to be cancelled, we just want him to stop, we just want him to be held accountable for his behavior in these situations with very young women.’</em></p><p>As I said from the start, there was absolutely no way, no chance at all, that the encounter with Scarlett was the first, or even the tenth, time he’d done something like that. Players are going to play, haters are going to hate, Gammas are going to gamma, and predators are going to prey upon starry-eyed young women who are overly impressed by media whoredom.</p><p>But regardless of what happens in the end, these brave women have accomplished something that is both worthwhile, unthinkable, and well worthy of note. They’ve actually caused the most relentless self-promoter in the entertainment industry to stop promoting himself in public for the first time since he was seven years old.</p><p><a href=\"https://socialgalactic.com/micropost/18aa303f-d519-4a2a-bc37-83136867271a\">DISCUSS ON SG</a></p></div>",
  "content_text": "The investigative reporters behind the Tortoise Media reports that exposed Neil Gaiman as an alleged sex predator speak out about how\nthey went down the rabbit hole\n.\nPaul Caruana Galizia:\nThe risk was was we end up telling a story of what he might describe as a messy and difficult sexual relationship, and that he’d never done anything like that before, and it’s a he said-she said situation. As Rachel mentioned, we heard from Scarlett an allegation that there were other women, and which is one we took seriously as well and was also another big public interest test for us. If he’s done this many, many times, then there’s are stronger reasons to do this story. You know, you might argue that he is a threat to young, vulnerable women and that he uses his image to lure them in to problematic sexual relationships, which is also an issue, and so we started exploring all those things. It took a while to break through this real silence around him and this real culture of secrecy and fear, actually, and so speaking up was really quite difficult for them. It took months of turning over stones until we got a lead to a woman who told us that she met Neil Gaiman when she was 18, at a book signing, and began a sexual relationship within two years, and her descriptions of that sexual relationship matched in really precise ways what Scarlet had told us even though they were separated by two decades and many continents.\nRachel Johnson:\nAs far as we were concerned one of the public interests was the fact that Neil Gaiman’s persona and also his career placed him in continuous contact with young admiring women there was his social media activity which is very intense. He connected with fans all the time. There were his book signings, his attendance at readings and and conventions again placing him with young fans, impressionable fans, and then of course the fact that he had a child and this was where Scarlet comes in. So that meant that we felt there was a strong public interest in reporting the allegations, because\nseveral of the women said to us, ‘we don’t want him to be cancelled, we just want him to stop, we just want him to be held accountable for his behavior in these situations with very young women.’\nAs I said from the start, there was absolutely no way, no chance at all, that the encounter with Scarlett was the first, or even the tenth, time he’d done something like that. Players are going to play, haters are going to hate, Gammas are going to gamma, and predators are going to prey upon starry-eyed young women who are overly impressed by media whoredom.\nBut regardless of what happens in the end, these brave women have accomplished something that is both worthwhile, unthinkable, and well worthy of note. They’ve actually caused the most relentless self-promoter in the entertainment industry to stop promoting himself in public for the first time since he was seven years old.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-01T21:40:33+00:00"
}