{
  "url": "https://voxday.net/2024/10/07/mailvox-surviving-helene/",
  "scraped_at": "2026-01-08T19:25:31.730261",
  "title": "Mailvox: Surviving Helene",
  "date_display": "October 7, 2024",
  "date_iso": "2024-10-07T16:57:24+00:00",
  "date_from_url": "2024-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is an email from a reader. I can’t vouch for its accuracy, so I’m presenting it here unedited except for the removal of a few sections since it was pretty long.</em></p><p>This is an attempt to capture my thoughts and first hand experiences over the last week having gone through hurricane Helene and the subsequent recovery effort. My goal is to get this all down while its fresh so i will not forget all the lessons learned 6 months from now. I will reference “the police” at various points. Unless otherwise stated, you can assume these are Sheriff’s Deputies from my local church community who I personally know and trust. This is categorized into topics and roughly follows the timeline as it developed.</p><p>My family and I live in Henderson County, NC. You have probably seen Henderson Co. in the news over the last week, from my home its only about 8 miles to what used to be Bat Cave and Chimney Rock, and little farther down the roads was the village of Lake Lure.</p><p>A quick summary of what happened: from Tuesday night (24 Sep) to Thursday night, the greater Asheville area received 20 inches of rainfall. Late Thursday night is when we saw the first of the hurricane weather and it dropped another 12 inches of rain over the next 8 hours. All told, Henderson County saw nearly 3 feet of rain in about a 72 hour period. This obviously contributed to historic levels of flooding, but it also prevented the trees from being able to withstand the hurricane force winds. Trees fell everywhere. every single yard that had trees before the storm had at least some of them blown over by Friday morning. This led to the largest impact of the whole experience: catastrophic damage to the power grid. Between flooding and mud slides, nearly all power substations were damaged or completely destroyed. the first 3 days of recovery was completely devoted to fixing or rebuilding all of these substations. People started voicing frustration because for a while you didnt see power crews working on the roads as they were forced to start with all the damaged substations. Once the substations were back online, the power company and tree crews shifted to clearing the lines. A “good” road would only have a tree rip down the power lines on 1 out of every 5 sections of line between poles. the higher up a mountain you went, the more that ratio would inverse with the narrow roads and thick mountain vegetation. Duke energy would estimate they had thousands of down lines and hundreds of broken poles in Henson County alone. this total failure of the power grid let to an immediate “shortage” of supplies, specifically food, water, and gasoline, because literally no one anywhere had power to run their store or gas station.</p><p><strong>Preparedness</strong></p><p>I, like most people in my area, did not prepare specifically for this event ahead of time. The volume of rain took everyone by surprise. I remember being at Ingles early Thursday morning and grabbing an extra loaf of bread on a whim because it seemed like a good idea. that’s all. sadly, this was more forethought than a lot of people in our area. What carried us through was our general level of preparedness. We have food for 4-6 months and several weeks worth of drinking water. I cant express the amount of peace i felt knowing we were never in desperate straight and had the means to provide for and defend ourselves. Winning the psychological battle is a real thing and should not be underestimated. The biggest hole we found in our preps was gray water. our only means of flushing the toilet was our 50 gallon rain barrel and that was getting very low by the end of day two. the only other option was a creek about 400 yards down a steep hill behind our house that would have been a tremendous amount of time and energy cost in collection… Another interesting note is the loss of faith in our Berkey filter for this specific event. It was no fault of the Berkey, but every single water supply, be it creek, stream, river, or pond flooded to historic levels and was left cluttered with all manner of God knows what from who knows where. Unless i was able to collect it coming directly out of a spring (i know people who have springs on their property and were just fine drinking from it), i would have used a nature water source only as a last resort. Lifting weights paid off big time. I lift 3 days a week and doing a 5×5 squats and deadlifts had me ready to go when it came to 3 days of moving trees.</p><p><strong>First 3 Days</strong></p><p>We spend the wee hours of Friday morning in our basement to protects us from the falling trees. I was able to go outside and look around in the steady but windless rain by about noon. It was obvious there would be significant clean up based on all the down trees around us. walking out to the road I could see several snapped and hanging power poles and the road was impassible in both directions from huge oak trees. Cell service was still available to us until Friday evening so i was able to text pictures to family and even spoke to out of area family on the phone to let then know we were ok. By Friday evening cell service started going in and out. we would later find out that some towers have generators damaged or destroyed from mud slides and other worked for a while until they ran out of fuel. The latter would remain down for the next several days until crews could cut their way to them with more fuel. This significantly limited our ability to communicate until people were able to identify places where service was usable, and were able to actually get there. In these first 3 days it was more or less you and your neighbors just trying to cut everyone out. first cars and driveways had to be cleared, then your road, then the main road would get you back into town. If a road was lined with trees would would average a significantly sized down tree about once every couple hundred yards. Its about a mile from our house back to the main road and I would bet more than 20 trees had to be cut and moved to clear a path big enough for a car to get through. Luckily there is lots of farming equipment around here so you could cut it into fairly large pieces and someone would push it with a backhoe into the ditch or at least out of the middle of the road. On Saturday afternoon one of our deputy friends that lives nearby stopped to check on us. That’s when we got the first news that Bat Cave and Chimney Rocks were unknown as all the bridges washed out as well as the scope of the down trees. The police were critical in these first few days with spreading the word on what roads were passible and what areas had to be avoided. One friend is a long time dispatcher and said the previous record was a bad storm years ago and the call tracker got to 87 active reports in the stack. by Saturday afternoon it topped 900. It certainly would have been higher if cell services wasn’t down for most people. It was also Saturday night that all the issues with panicked and desperate people started popping up. there were two gas stations in the whole southern half of the county who had their pumps running on a generator. starting Saturday morning these stations were grid locked by people who were caught transiting through Hendersonville, plus anyone else who didn’t top off their tank before the storm. hundreds of cars were waiting at pumps around the clock. I was finally able to gas up Tuesday morning at 1am. There were multiple fights and at a rest stop on I-26 some lunatic even climbed up on a tanker truck and tried to force the driver at gun point to give him fuel. The police said it was insane how many people were out driving around on Saturday looking for food because they only procure food one day at a time. The looting was limited to closed gas stations and convivence stores but generator theft was a big problem. I didn’t get much sleep those first 3 nights as we had to keep the windows open to try and fight the now growing mold in the basement. Monday was a big mile stone for my family, we were able to make it over to the other side of town to link up with extended family. they lived right outside town and never lost natural gas and just had their municipal water restored earlier on Sunday. I moved my wife and kids in with them for the rest of the week and i would spend the night at our house with the animals and all our long term preps.</p><p><strong>Logistics Considerations</strong></p><p>Tuesday marked the shift out of immediate survival mode and into coordinated recovery mode. Enough men from our church had cut them self out that we were able to organize chainsaw crews to start helping church members, mainly the elderly. By this point you had a decent idea of how to could get from here to there, but you only knew for sure one route that was clear. As Duke Energy and all the other out of state (and even out of country) power crews started restoring lines, previously passible roads would be found closed so crews could cut trees and fix lines. this would lead to a game of find your way around, and often the first 2 or 3 alternate routes you knew would be blocked and unusable as well. A trip that would normally take 15 minutes might take 30 minutes or 2.5 hours. This lead to EDC on steroids. if you left the house you had a gun with spare mags, flashlight, headlamp, water, food, chainsaw + tools, cash, and extra water to give out.</p><p><strong>Community</strong></p><p>Even as i write this Monday morning October 7th, its still mostly a community driven recovery effort. neighbors helped each other in the beginning, then we were able to start organizing and effectively getting around to places on Tuesday. I didn’t see a FEMA person until Thursday morning, and all they have done is make sure all the previously homeless drug addicts and illegals have what they need at the large shelters. There is no way i would send a woman or child to any of the temporary shelters run by FEMA or the Red Cross. It was incredible to see how man good people there are around us. everyone was helpful and gracious. a specific thing i noted was how little power multiple homes really need to keep afloat in something like this. our extended family’s neighbor had a natural gas whole-home generator that operated the entire time. they ran extension cords to the 3 houses in the immediate vicinity so everyone in that little nook of homes had a charging station inside their house, could run their deep freezer, and have a box fan. it was a huge morale boost to say the least.</p><p><strong>Operational Logistics</strong></p><p>The recover effort leverages the network of churches, and specifically the pastors of those churches. out of area pastors would coordinate supply drop offs with our pastor and get it packed and shipped up to our church. (by this point I-26 was open heading south into SC and that allowed trucks and trailers to get stuff in to us). We converted our fellowship hall into a receiving area and small aid station. We worked about 10 hours a day unloading trucks and sorting supplies. lesson learned here, timely supplies are nice but we would have taken them several hours later if it was a little more organized. A lot of small items, like toothpaste or bottles of water, would come in large palatized produce box but would be completely loose inside it. it would take a lot of time to dig them all out while you were trying to empty a truck and get it out of the way for the next truck. The best way to go about it would be to throw everything in boxes that can be carried by a single person. Supplies were then loaded onto pickup trucks (using trailers was a hard no-go as the more remote roads were barely passible and there would be no room to maneuver them) and taken deeper into the worse hit areas where they would be left with a local church as a forward staging area. From there either pickups or ATVs would take out for distribution to work crews or families still in the area. Local men would form into unofficially official chainsaw teams or search and rescue teams and would get a police escort into and out of the worst areas. This leads into the final topic.</p><p><strong>Social Media / Cellphone Culture</strong></p><p>90% of all the reports of “police kept me out and refused to let me save people!!!” are all nonsense and are actually examples of police exercising good judgment. Right now DoT contractors are trying to reconstruct roads so large recovery teams can get into places like Chimney Rock but have to constantly avoid killing GoPro Bros on 4 wheelers and dirt bikes. One equipment operator at church yesterday said they had to double back to re-repair a stretch of road that was rutted out and left unusable by a group on ATVs, no one knows who they were. There are hundreds of local, able bodied men that know the lay of the land and exactly who they are looking for. Do not bring your lifted jeep to NC to try and save people because TikTok said you should. Its really hard to believe how much disaster rubber necking is happening out there right now.</p><p><em><a href=\"https://socialgalactic.com/micropost/9c62c227-7ae0-4d2f-a46b-101120108fbb\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is an email from a reader. I can’t vouch for its accuracy, so I’m presenting it here unedited except for the removal of a few sections since it was pretty long.\nThis is an attempt to capture my thoughts and first hand experiences over the last week having gone through hurricane Helene and the subsequent recovery effort. My goal is to get this all down while its fresh so i will not forget all the lessons learned 6 months from now. I will reference “the police” at various points. Unless otherwise stated, you can assume these are Sheriff’s Deputies from my local church community who I personally know and trust. This is categorized into topics and roughly follows the timeline as it developed.\nMy family and I live in Henderson County, NC. You have probably seen Henderson Co. in the news over the last week, from my home its only about 8 miles to what used to be Bat Cave and Chimney Rock, and little farther down the roads was the village of Lake Lure.\nA quick summary of what happened: from Tuesday night (24 Sep) to Thursday night, the greater Asheville area received 20 inches of rainfall. Late Thursday night is when we saw the first of the hurricane weather and it dropped another 12 inches of rain over the next 8 hours. All told, Henderson County saw nearly 3 feet of rain in about a 72 hour period. This obviously contributed to historic levels of flooding, but it also prevented the trees from being able to withstand the hurricane force winds. Trees fell everywhere. every single yard that had trees before the storm had at least some of them blown over by Friday morning. This led to the largest impact of the whole experience: catastrophic damage to the power grid. Between flooding and mud slides, nearly all power substations were damaged or completely destroyed. the first 3 days of recovery was completely devoted to fixing or rebuilding all of these substations. People started voicing frustration because for a while you didnt see power crews working on the roads as they were forced to start with all the damaged substations. Once the substations were back online, the power company and tree crews shifted to clearing the lines. A “good” road would only have a tree rip down the power lines on 1 out of every 5 sections of line between poles. the higher up a mountain you went, the more that ratio would inverse with the narrow roads and thick mountain vegetation. Duke energy would estimate they had thousands of down lines and hundreds of broken poles in Henson County alone. this total failure of the power grid let to an immediate “shortage” of supplies, specifically food, water, and gasoline, because literally no one anywhere had power to run their store or gas station.\nPreparedness\nI, like most people in my area, did not prepare specifically for this event ahead of time. The volume of rain took everyone by surprise. I remember being at Ingles early Thursday morning and grabbing an extra loaf of bread on a whim because it seemed like a good idea. that’s all. sadly, this was more forethought than a lot of people in our area. What carried us through was our general level of preparedness. We have food for 4-6 months and several weeks worth of drinking water. I cant express the amount of peace i felt knowing we were never in desperate straight and had the means to provide for and defend ourselves. Winning the psychological battle is a real thing and should not be underestimated. The biggest hole we found in our preps was gray water. our only means of flushing the toilet was our 50 gallon rain barrel and that was getting very low by the end of day two. the only other option was a creek about 400 yards down a steep hill behind our house that would have been a tremendous amount of time and energy cost in collection… Another interesting note is the loss of faith in our Berkey filter for this specific event. It was no fault of the Berkey, but every single water supply, be it creek, stream, river, or pond flooded to historic levels and was left cluttered with all manner of God knows what from who knows where. Unless i was able to collect it coming directly out of a spring (i know people who have springs on their property and were just fine drinking from it), i would have used a nature water source only as a last resort. Lifting weights paid off big time. I lift 3 days a week and doing a 5×5 squats and deadlifts had me ready to go when it came to 3 days of moving trees.\nFirst 3 Days\nWe spend the wee hours of Friday morning in our basement to protects us from the falling trees. I was able to go outside and look around in the steady but windless rain by about noon. It was obvious there would be significant clean up based on all the down trees around us. walking out to the road I could see several snapped and hanging power poles and the road was impassible in both directions from huge oak trees. Cell service was still available to us until Friday evening so i was able to text pictures to family and even spoke to out of area family on the phone to let then know we were ok. By Friday evening cell service started going in and out. we would later find out that some towers have generators damaged or destroyed from mud slides and other worked for a while until they ran out of fuel. The latter would remain down for the next several days until crews could cut their way to them with more fuel. This significantly limited our ability to communicate until people were able to identify places where service was usable, and were able to actually get there. In these first 3 days it was more or less you and your neighbors just trying to cut everyone out. first cars and driveways had to be cleared, then your road, then the main road would get you back into town. If a road was lined with trees would would average a significantly sized down tree about once every couple hundred yards. Its about a mile from our house back to the main road and I would bet more than 20 trees had to be cut and moved to clear a path big enough for a car to get through. Luckily there is lots of farming equipment around here so you could cut it into fairly large pieces and someone would push it with a backhoe into the ditch or at least out of the middle of the road. On Saturday afternoon one of our deputy friends that lives nearby stopped to check on us. That’s when we got the first news that Bat Cave and Chimney Rocks were unknown as all the bridges washed out as well as the scope of the down trees. The police were critical in these first few days with spreading the word on what roads were passible and what areas had to be avoided. One friend is a long time dispatcher and said the previous record was a bad storm years ago and the call tracker got to 87 active reports in the stack. by Saturday afternoon it topped 900. It certainly would have been higher if cell services wasn’t down for most people. It was also Saturday night that all the issues with panicked and desperate people started popping up. there were two gas stations in the whole southern half of the county who had their pumps running on a generator. starting Saturday morning these stations were grid locked by people who were caught transiting through Hendersonville, plus anyone else who didn’t top off their tank before the storm. hundreds of cars were waiting at pumps around the clock. I was finally able to gas up Tuesday morning at 1am. There were multiple fights and at a rest stop on I-26 some lunatic even climbed up on a tanker truck and tried to force the driver at gun point to give him fuel. The police said it was insane how many people were out driving around on Saturday looking for food because they only procure food one day at a time. The looting was limited to closed gas stations and convivence stores but generator theft was a big problem. I didn’t get much sleep those first 3 nights as we had to keep the windows open to try and fight the now growing mold in the basement. Monday was a big mile stone for my family, we were able to make it over to the other side of town to link up with extended family. they lived right outside town and never lost natural gas and just had their municipal water restored earlier on Sunday. I moved my wife and kids in with them for the rest of the week and i would spend the night at our house with the animals and all our long term preps.\nLogistics Considerations\nTuesday marked the shift out of immediate survival mode and into coordinated recovery mode. Enough men from our church had cut them self out that we were able to organize chainsaw crews to start helping church members, mainly the elderly. By this point you had a decent idea of how to could get from here to there, but you only knew for sure one route that was clear. As Duke Energy and all the other out of state (and even out of country) power crews started restoring lines, previously passible roads would be found closed so crews could cut trees and fix lines. this would lead to a game of find your way around, and often the first 2 or 3 alternate routes you knew would be blocked and unusable as well. A trip that would normally take 15 minutes might take 30 minutes or 2.5 hours. This lead to EDC on steroids. if you left the house you had a gun with spare mags, flashlight, headlamp, water, food, chainsaw + tools, cash, and extra water to give out.\nCommunity\nEven as i write this Monday morning October 7th, its still mostly a community driven recovery effort. neighbors helped each other in the beginning, then we were able to start organizing and effectively getting around to places on Tuesday. I didn’t see a FEMA person until Thursday morning, and all they have done is make sure all the previously homeless drug addicts and illegals have what they need at the large shelters. There is no way i would send a woman or child to any of the temporary shelters run by FEMA or the Red Cross. It was incredible to see how man good people there are around us. everyone was helpful and gracious. a specific thing i noted was how little power multiple homes really need to keep afloat in something like this. our extended family’s neighbor had a natural gas whole-home generator that operated the entire time. they ran extension cords to the 3 houses in the immediate vicinity so everyone in that little nook of homes had a charging station inside their house, could run their deep freezer, and have a box fan. it was a huge morale boost to say the least.\nOperational Logistics\nThe recover effort leverages the network of churches, and specifically the pastors of those churches. out of area pastors would coordinate supply drop offs with our pastor and get it packed and shipped up to our church. (by this point I-26 was open heading south into SC and that allowed trucks and trailers to get stuff in to us). We converted our fellowship hall into a receiving area and small aid station. We worked about 10 hours a day unloading trucks and sorting supplies. lesson learned here, timely supplies are nice but we would have taken them several hours later if it was a little more organized. A lot of small items, like toothpaste or bottles of water, would come in large palatized produce box but would be completely loose inside it. it would take a lot of time to dig them all out while you were trying to empty a truck and get it out of the way for the next truck. The best way to go about it would be to throw everything in boxes that can be carried by a single person. Supplies were then loaded onto pickup trucks (using trailers was a hard no-go as the more remote roads were barely passible and there would be no room to maneuver them) and taken deeper into the worse hit areas where they would be left with a local church as a forward staging area. From there either pickups or ATVs would take out for distribution to work crews or families still in the area. Local men would form into unofficially official chainsaw teams or search and rescue teams and would get a police escort into and out of the worst areas. This leads into the final topic.\nSocial Media / Cellphone Culture\n90% of all the reports of “police kept me out and refused to let me save people!!!” are all nonsense and are actually examples of police exercising good judgment. Right now DoT contractors are trying to reconstruct roads so large recovery teams can get into places like Chimney Rock but have to constantly avoid killing GoPro Bros on 4 wheelers and dirt bikes. One equipment operator at church yesterday said they had to double back to re-repair a stretch of road that was rutted out and left unusable by a group on ATVs, no one knows who they were. There are hundreds of local, able bodied men that know the lay of the land and exactly who they are looking for. Do not bring your lifted jeep to NC to try and save people because TikTok said you should. Its really hard to believe how much disaster rubber necking is happening out there right now.\nDISCUSS ON SG",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-07T16:57:26+00:00"
}