{
  "url": "https://voxday.net/2024/10/21/moldova-rejects-eu/",
  "scraped_at": "2026-01-08T19:26:56.638023",
  "title": "Moldova Rejects EU",
  "date_display": "October 21, 2024",
  "date_iso": "2024-10-21T00:06:56+00:00",
  "date_from_url": "2024-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may mark the death knell for the EU. Once every Central and Eastern European state was desperate to join. Now, a number of existing members want out and formerly-prospective members <a href=\"https://www.rt.com/russia/605996-moldovans-reject-eu-integration/\">no longer see any benefit</a> to joining:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Voters in Moldova have rejected the government-backed proposal to enshrine eventual integration with the EU in the former Soviet country’s constitution. During Sunday’s referendum, held simultaneously with a presidential election, voters were asked whether the constitution should be amended to reflect the “irreversible European course” of the country and affirm the “integration into the European Union as a strategic objective” of the nation.</p><p>With more than 86% of the ballots counted, 54.55% voted against the proposal, while 45.45% voted in favor, according to the preliminary results cited by the news channel TVR.</p></blockquote><p>BRICS is the smarter bet anyhow. But staying out of the EU is paramount. Never trust anyone who wants you to sign on to something “irreversible”. It’s almost as obvious as requiring you to sign in blood.</p><p><strong>UPDATE: </strong>And now it looks as if this “vote” is about as legitimate as the faked 2020 US Presidential election. The referendum was suddenly turned around at the last minute with a flood of YES votes being found in the final hours. Democracy is increasingly nothing more than a flat-out fraud that inverts the genuine will of the people.</p><p><em>Potrivit rezultatelor preliminare, după prelucrarea a 98,74% din buletinele de vot din cadrul Referendumului constituțional 50,24% au votat DA și 49,76% au votat NU.</em></p><p>This probably means that Russia will have to invade Moldova sooner or later to free its people from Clown World.</p><p><em><a href=\"https://socialgalactic.com/micropost/bae86eee-88ab-4c9e-9d0a-07141148100a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This may mark the death knell for the EU. Once every Central and Eastern European state was desperate to join. Now, a number of existing members want out and formerly-prospective members\nno longer see any benefit\nto joining:\nVoters in Moldova have rejected the government-backed proposal to enshrine eventual integration with the EU in the former Soviet country’s constitution. During Sunday’s referendum, held simultaneously with a presidential election, voters were asked whether the constitution should be amended to reflect the “irreversible European course” of the country and affirm the “integration into the European Union as a strategic objective” of the nation.\nWith more than 86% of the ballots counted, 54.55% voted against the proposal, while 45.45% voted in favor, according to the preliminary results cited by the news channel TVR.\nBRICS is the smarter bet anyhow. But staying out of the EU is paramount. Never trust anyone who wants you to sign on to something “irreversible”. It’s almost as obvious as requiring you to sign in blood.\nUPDATE:\nAnd now it looks as if this “vote” is about as legitimate as the faked 2020 US Presidential election. The referendum was suddenly turned around at the last minute with a flood of YES votes being found in the final hours. Democracy is increasingly nothing more than a flat-out fraud that inverts the genuine will of the people.\nPotrivit rezultatelor preliminare, după prelucrarea a 98,74% din buletinele de vot din cadrul Referendumului constituțional 50,24% au votat DA și 49,76% au votat NU.\nThis probably means that Russia will have to invade Moldova sooner or later to free its people from Clown World.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "EU",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-21T09:53:06+00:00"
}