{
  "url": "https://voxday.net/2024/10/28/no-foreign-wars/",
  "scraped_at": "2026-01-08T19:27:41.796521",
  "title": "No Foreign Wars",
  "date_display": "October 28, 2024",
  "date_iso": "2024-10-28T10:47:03+00:00",
  "date_from_url": "2024-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One area where Donald Trump did have an excellent track record was the way he avoided getting the US military involved in any new wars. And he even tried to end some of the various US occupations, although he was undermined by traitors in his administration and the military itself. So his expressed determination <a href=\"https://www.rt.com/news/606592-trump-us-foreign-wars/\">to stay out of war for the next four years</a> is highly credible, despite his occasionally bellicose rhetoric.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Former US President Donald Trump promised not to send Americans to fight and die in countries they have never heard of while addressing a crowd in the battleground state of Pennsylvania this weekend.</p><p>Speaking at a campaign rally on Saturday, Trump once again claimed he is the only one capable of preventing an all-out global conflict, arguing that his Democratic rival Kamala Harris “would get us into World War III, guaranteed, because she is too grossly incompetent to do the job.”</p><p>“To make her president would be to gamble with the lives of millions of people. Sons and daughters will end up getting drafted to fight in a war in a country you’ve never heard of,” he said.</p><p>In his nomination acceptance speech earlier this year, Trump vowed to “end every single international crisis that the current administration has created,” particularly the Ukraine and Gaza conflicts. He never offered specific plans to bring about world peace, but repeatedly warned that by supporting and financing “other people’s wars” under the leadership of President Joe Biden and Vice President Kamala Harris, the US is increasing the likelihood of sliding into WWIII.</p></blockquote><p>Of course, if he returns to the White House, he’ll need to do something about repatriating the tens of millions of invaders now running amok in the USA. And it would be good if he would clarify that he won’t let Americans fight for any countries their parents have heard of also.</p><p>Most importantly, it’s time to put some teeth behind the phrase “America First” and end all foreign aid. There is absolutely no excuse for giving a single dollar to any foreign country while Americans are in need. That’s not “loving your neighbor” but “ignoring your family in order to score virtue points by helping complete strangers.”</p><p><em><a href=\"https://socialgalactic.com/micropost/0961e865-ea5f-4a01-bd57-d81f7050b29d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One area where Donald Trump did have an excellent track record was the way he avoided getting the US military involved in any new wars. And he even tried to end some of the various US occupations, although he was undermined by traitors in his administration and the military itself. So his expressed determination\nto stay out of war for the next four years\nis highly credible, despite his occasionally bellicose rhetoric.\nFormer US President Donald Trump promised not to send Americans to fight and die in countries they have never heard of while addressing a crowd in the battleground state of Pennsylvania this weekend.\nSpeaking at a campaign rally on Saturday, Trump once again claimed he is the only one capable of preventing an all-out global conflict, arguing that his Democratic rival Kamala Harris “would get us into World War III, guaranteed, because she is too grossly incompetent to do the job.”\n“To make her president would be to gamble with the lives of millions of people. Sons and daughters will end up getting drafted to fight in a war in a country you’ve never heard of,” he said.\nIn his nomination acceptance speech earlier this year, Trump vowed to “end every single international crisis that the current administration has created,” particularly the Ukraine and Gaza conflicts. He never offered specific plans to bring about world peace, but repeatedly warned that by supporting and financing “other people’s wars” under the leadership of President Joe Biden and Vice President Kamala Harris, the US is increasing the likelihood of sliding into WWIII.\nOf course, if he returns to the White House, he’ll need to do something about repatriating the tens of millions of invaders now running amok in the USA. And it would be good if he would clarify that he won’t let Americans fight for any countries their parents have heard of also.\nMost importantly, it’s time to put some teeth behind the phrase “America First” and end all foreign aid. There is absolutely no excuse for giving a single dollar to any foreign country while Americans are in need. That’s not “loving your neighbor” but “ignoring your family in order to score virtue points by helping complete strangers.”\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2024-10-28T10:47:03+00:00"
}