{
  "url": "https://voxday.net/2024/10/30/racist-sfwa-removes-black-board-member/",
  "scraped_at": "2026-01-08T19:27:55.447814",
  "title": "Racist SFWA Removes Black Board Member",
  "date_display": "October 30, 2024",
  "date_iso": "2024-10-30T10:15:49+00:00",
  "date_from_url": "2024-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SFWA continues to be the gift that just keeps on giving, as embracing diversity bites them in their very ample, non-binary backsides. Fandom Pulse <a href=\"https://fandompulse.substack.com/p/sfwa-board-member-and-world-fantasy\">covers SFWA’s latest scandal</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Oghenechovwe Donald Ekpeki was hailed as one of Africa’s rising star voices in science fiction. He had been propped up by the publishing establishment as an author from Nigeria with an “authentic take” on writing because of his background. He won a World Fantasy Award, was nominated for multiple Hugos and other awards, and was propped up as a diversity token as establishment publishing is desperate for black talent in science fiction.</p><p>Ekpeki loved to use his clout to pay for his vacations. He opened different projects on GoFundMe each time he received an award nomination organized by serial clout goblin Jason Sanford, who was all too happy to virtue signal for the African writer. One was even to raise alleged legal fees for a visa, culminating in over $15,000 of donations from sci-fi fandom. </p><p>His clout as a black short fiction author eventually landed him a position on The Science Fiction and Fantasy Writers Association’s board as a board member at large.</p><p>SFWA has been under fire these last few months, with multiple board members stepping down amid a scandal involving a disabled employee who complained about accessibility and was ignored by the board and President Jeffe Kennedy. As SFWA records its election for a new president, a new scandal has broken out with this Nigerian board member.</p><p>On October 27th, SFWA reported they removed Oghenechovwe Donald Ekpeki as a board member due to multiple ethics complaints surrounding the African author. These allegations were listed by Locus Magazine, posting the full text from an author named Erin Cairns, alleging the black author stole a story from her. The full text of her complaint is 78 pages long, but it details an account starting in 2022 in which Ekpeki reached out to her allegedly to exploit her. After months of leading her on, Ekpeki allegedly asked Cairns to co-write a story with him. Cairns claims she wrote an entire story, and Ekpeki changed some of the names to sound more authentically black in the story before submitting it to a “black voices”-themed magazine.</p><p>The catch is that Ekpeki didn’t list Cairns as a co-writer but submitted it solely as his own work, according to Cairns.</p><p><em>On 10/27/2024, the Board met to discuss multiple ethics complaints regarding Director-at-Large Oghenechovwe Donald Ekpeki after hearing statements from various parties involved. Mr. Ekpeki was also given a chance to speak to the Board regarding these complaints. After due consideration, and in compliance with Article V(5)(iii) of the SFWA Bylaws, the Board voted unanimously to remove Director-at-Large Ekpeki from his position on the SFWA Board of Directors for good and sufficient cause, effective immediately.</em></p><p><em>The Board will not be answering questions on this matter to protect the privacy of the individuals involved.</em></p></blockquote><p>Here’s the punchline: the board still hasn’t expelled Elpeki from SFWA. So they’ve got convicted pedos, unconvicted pedos who are NAMBLA members, and now plagiarists as members in good standing, to say nothing of all the wannabes who have never even written, nor published, a single SF novel… and they’re still pretending to have expelled me even though <em>the required membership vote never took place.</em></p><p>No wonder publishers pay no attention to the organization.</p><p><strong>UPDATE: </strong>This community alone is considerably larger <a href=\"https://fandompulse.substack.com/p/less-than-300-members-vote-in-sfwa\">than the active SFWA membership</a> now. The science fiction writers of yore never should have listened to Anne McCaffrey. It’s not a coincidence that Diversity, Inclusivity, and Inclusion spells DIE.</p><p><em>Less than three hundred members bothered to vote for the president of the club and approximately one hundred wrote in a candidate for secretary as the one candidate who was on the ballot withdrew, not wanting to do work for the club in this environment. </em></p><p><em><a href=\"https://socialgalactic.com/micropost/78a37da2-94d2-4f55-a397-1f2f4989e08b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "SFWA continues to be the gift that just keeps on giving, as embracing diversity bites them in their very ample, non-binary backsides. Fandom Pulse\ncovers SFWA’s latest scandal\n:\nOghenechovwe Donald Ekpeki was hailed as one of Africa’s rising star voices in science fiction. He had been propped up by the publishing establishment as an author from Nigeria with an “authentic take” on writing because of his background. He won a World Fantasy Award, was nominated for multiple Hugos and other awards, and was propped up as a diversity token as establishment publishing is desperate for black talent in science fiction.\nEkpeki loved to use his clout to pay for his vacations. He opened different projects on GoFundMe each time he received an award nomination organized by serial clout goblin Jason Sanford, who was all too happy to virtue signal for the African writer. One was even to raise alleged legal fees for a visa, culminating in over $15,000 of donations from sci-fi fandom.\nHis clout as a black short fiction author eventually landed him a position on The Science Fiction and Fantasy Writers Association’s board as a board member at large.\nSFWA has been under fire these last few months, with multiple board members stepping down amid a scandal involving a disabled employee who complained about accessibility and was ignored by the board and President Jeffe Kennedy. As SFWA records its election for a new president, a new scandal has broken out with this Nigerian board member.\nOn October 27th, SFWA reported they removed Oghenechovwe Donald Ekpeki as a board member due to multiple ethics complaints surrounding the African author. These allegations were listed by Locus Magazine, posting the full text from an author named Erin Cairns, alleging the black author stole a story from her. The full text of her complaint is 78 pages long, but it details an account starting in 2022 in which Ekpeki reached out to her allegedly to exploit her. After months of leading her on, Ekpeki allegedly asked Cairns to co-write a story with him. Cairns claims she wrote an entire story, and Ekpeki changed some of the names to sound more authentically black in the story before submitting it to a “black voices”-themed magazine.\nThe catch is that Ekpeki didn’t list Cairns as a co-writer but submitted it solely as his own work, according to Cairns.\nOn 10/27/2024, the Board met to discuss multiple ethics complaints regarding Director-at-Large Oghenechovwe Donald Ekpeki after hearing statements from various parties involved. Mr. Ekpeki was also given a chance to speak to the Board regarding these complaints. After due consideration, and in compliance with Article V(5)(iii) of the SFWA Bylaws, the Board voted unanimously to remove Director-at-Large Ekpeki from his position on the SFWA Board of Directors for good and sufficient cause, effective immediately.\nThe Board will not be answering questions on this matter to protect the privacy of the individuals involved.\nHere’s the punchline: the board still hasn’t expelled Elpeki from SFWA. So they’ve got convicted pedos, unconvicted pedos who are NAMBLA members, and now plagiarists as members in good standing, to say nothing of all the wannabes who have never even written, nor published, a single SF novel… and they’re still pretending to have expelled me even though\nthe required membership vote never took place.\nNo wonder publishers pay no attention to the organization.\nUPDATE:\nThis community alone is considerably larger\nthan the active SFWA membership\nnow. The science fiction writers of yore never should have listened to Anne McCaffrey. It’s not a coincidence that Diversity, Inclusivity, and Inclusion spells DIE.\nLess than three hundred members bothered to vote for the president of the club and approximately one hundred wrote in a candidate for secretary as the one candidate who was on the ballot withdrew, not wanting to do work for the club in this environment.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2024-10-30T13:02:02+00:00"
}