{
  "url": "https://voxday.net/2024/10/13/tampon-timmy-in-trouble/",
  "scraped_at": "2026-01-08T19:26:10.544818",
  "title": "Tampon Timmy in Trouble",
  "date_display": "October 13, 2024",
  "date_iso": "2024-10-13T12:59:05+00:00",
  "date_from_url": "2024-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The historical details, at least, <a href=\"https://x.com/DocNetyoutube/status/1845106539410956715\">are correct</a>. I can even help confirm the one part that did not make initially sense to the investigative journalist who is digging into the VP candidate’s sordid past.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When I received a tip back in August claiming Tim Walz had an inappropriate relationship with a minor, I was very skeptical. I get dozens of tips/dm’s per day. In fact, I did not act on the tip for a few days because I thought it would be impossible to prove the allegations. I also knew that Harris and Walz would deny the allegations… However, one part of the tipster story did not make sense to me, the date of the Indigo Girls Concert. Tipster claimed it was in 1995, but I could not find anything corresponding to that date, well, the tipster told the truth, there was a concert in 1995, and the tipster claimed that Walz got a DUI months after the concert…</p><p>Tim Walz has lied about almost every single detail of his life. Him and his wife have been getting a pass from the MSM. Yesterday, I received numerous threats, in fact, some of the threats were scary as some of the accounts were brand new accounts and had my personal information. In my investigation, I also emailed all the major news outlets WHILE my investigation was in progress. I have every single receipt…</p><p>I have also found out that there were other journalists who had parts of this story but did not print it or withheld the information. It is my plan to release the story tomorrow. I have gone out of my way to give Harris and Walz the opportunity to flat out deny the allegations, but they have really done the opposite, in fact, in statements to various articles they have confirmed much of the story. The only allegation about the tipster’s story I cannot prove is if Walz did indeed have a sexual relationship with a minor. That is Walz vs. The Tipster. But every aspect of the tipster’s story turned out to be true, including Walz being fired from his football job in Nebraska and the fact that Walz brought a student to an Indigo Girls concert.</p></blockquote><p>There was, in fact, an Indigo Girls concert in Minneapolis in 1995. I remember it, not because I have ever attended an Indigo Girls concert or listened to their music, but because a few years before that, during a Psykosonik interview with Mad Mike at KJ104, the deejay had told an amusing story about how scary the lesbians who would show up at the station asking for free tickets when the Indigo Girls were coming to town were. His anecdote was the inspiration for various comments in my social circle whenever the pair would subsequently come to town. And, although the concert is missing from Concert Archives, the Indigo Girls did play at Northrop Auditorium in Minneapolis <a href=\"https://etreedb.org/db/shows/browse/artist_key/360/year/1995\">on May 9th, 1995</a>.</p><p>This doesn’t prove that Tampon Timmy is a pedophile, but the amount of evidence now being aggregated and confirmed strongly suggests that he will soon be proven to be one. One would assume that would be sufficient to cause the Harris campaign to drop him from the ticket, but these days, who knows? After all, he’s now serving his second term as Governor of Minnesota despite what would appear to be some undersized, and underaged, skeletons in his closet.</p><p><em><a href=\"https://socialgalactic.com/micropost/72cbd8a7-e012-4959-8811-9dc3ecde72e6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The historical details, at least,\nare correct\n. I can even help confirm the one part that did not make initially sense to the investigative journalist who is digging into the VP candidate’s sordid past.\nWhen I received a tip back in August claiming Tim Walz had an inappropriate relationship with a minor, I was very skeptical. I get dozens of tips/dm’s per day. In fact, I did not act on the tip for a few days because I thought it would be impossible to prove the allegations. I also knew that Harris and Walz would deny the allegations… However, one part of the tipster story did not make sense to me, the date of the Indigo Girls Concert. Tipster claimed it was in 1995, but I could not find anything corresponding to that date, well, the tipster told the truth, there was a concert in 1995, and the tipster claimed that Walz got a DUI months after the concert…\nTim Walz has lied about almost every single detail of his life. Him and his wife have been getting a pass from the MSM. Yesterday, I received numerous threats, in fact, some of the threats were scary as some of the accounts were brand new accounts and had my personal information. In my investigation, I also emailed all the major news outlets WHILE my investigation was in progress. I have every single receipt…\nI have also found out that there were other journalists who had parts of this story but did not print it or withheld the information. It is my plan to release the story tomorrow. I have gone out of my way to give Harris and Walz the opportunity to flat out deny the allegations, but they have really done the opposite, in fact, in statements to various articles they have confirmed much of the story. The only allegation about the tipster’s story I cannot prove is if Walz did indeed have a sexual relationship with a minor. That is Walz vs. The Tipster. But every aspect of the tipster’s story turned out to be true, including Walz being fired from his football job in Nebraska and the fact that Walz brought a student to an Indigo Girls concert.\nThere was, in fact, an Indigo Girls concert in Minneapolis in 1995. I remember it, not because I have ever attended an Indigo Girls concert or listened to their music, but because a few years before that, during a Psykosonik interview with Mad Mike at KJ104, the deejay had told an amusing story about how scary the lesbians who would show up at the station asking for free tickets when the Indigo Girls were coming to town were. His anecdote was the inspiration for various comments in my social circle whenever the pair would subsequently come to town. And, although the concert is missing from Concert Archives, the Indigo Girls did play at Northrop Auditorium in Minneapolis\non May 9th, 1995\n.\nThis doesn’t prove that Tampon Timmy is a pedophile, but the amount of evidence now being aggregated and confirmed strongly suggests that he will soon be proven to be one. One would assume that would be sufficient to cause the Harris campaign to drop him from the ticket, but these days, who knows? After all, he’s now serving his second term as Governor of Minnesota despite what would appear to be some undersized, and underaged, skeletons in his closet.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-13T13:02:11+00:00"
}