{
  "url": "https://voxday.net/2024/10/23/the-strangest-tools/",
  "scraped_at": "2026-01-08T19:27:09.225894",
  "title": "The Strangest Tools",
  "date_display": "October 23, 2024",
  "date_iso": "2024-10-23T10:36:41+00:00",
  "date_from_url": "2024-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I believe President Trump to have been the greatest US president since Andrew Jackson, his many failures and his various retarderies on an irritatingly broad range of topics have certainly diminished my enthusiasm for the prospects of his eventual return to the White House. Nevertheless, and despite the obvious electoral frauds past and future, there is some reason to retain at least an amount of hope in the man. Because, for some reason that is hard to explain, <a href=\"https://x.com/BehizyTweets/status/1848837727392772413\">the truly wicked fear him</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Want proof that God is with Trump?</p><p>Literal Witches are complaining on Reddit that they are trying to launch demonic attacks against Trump, but “he seems to have some kind of protection around him.”</p><p>Trump is even winning against witches!</p><p><em>“A thousand may fall at your side, And ten thousand at your right hand; But it shall not come near you. Only with your eyes shall you look, And see the reward of the wicked.”</em> – Psalm 91:7-8</p><p>God is using Trump to help set the world straight. Only Christians with a sanctimonious attitude refuse to understand this. God doesn’t choose the qualified. He qualifies the chosen.</p></blockquote><p>I’m sure more than a few Christians were highly skeptical of the Apostle Paul. And there are people who were so shocked by the fact that a certain author wrote a certain book that they regarded it as genuine evidence of the existence of God.</p><p>Hope is a virtue, not a weakness. Never forget that. The actual weakness is fearing to hope due to past disappointments.</p><p><em><a href=\"https://socialgalactic.com/micropost/8c269f7f-8201-42b3-85a9-d61d3d007ad7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Although I believe President Trump to have been the greatest US president since Andrew Jackson, his many failures and his various retarderies on an irritatingly broad range of topics have certainly diminished my enthusiasm for the prospects of his eventual return to the White House. Nevertheless, and despite the obvious electoral frauds past and future, there is some reason to retain at least an amount of hope in the man. Because, for some reason that is hard to explain,\nthe truly wicked fear him\n.\nWant proof that God is with Trump?\nLiteral Witches are complaining on Reddit that they are trying to launch demonic attacks against Trump, but “he seems to have some kind of protection around him.”\nTrump is even winning against witches!\n“A thousand may fall at your side, And ten thousand at your right hand; But it shall not come near you. Only with your eyes shall you look, And see the reward of the wicked.”\n– Psalm 91:7-8\nGod is using Trump to help set the world straight. Only Christians with a sanctimonious attitude refuse to understand this. God doesn’t choose the qualified. He qualifies the chosen.\nI’m sure more than a few Christians were highly skeptical of the Apostle Paul. And there are people who were so shocked by the fact that a certain author wrote a certain book that they regarded it as genuine evidence of the existence of God.\nHope is a virtue, not a weakness. Never forget that. The actual weakness is fearing to hope due to past disappointments.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-23T10:36:43+00:00"
}