{
  "url": "https://voxday.net/2024/10/03/the-same-failed-strategy/",
  "scraped_at": "2026-01-08T19:25:06.925566",
  "title": "The Same Failed Strategy",
  "date_display": "October 3, 2024",
  "date_iso": "2024-10-03T10:41:36+00:00",
  "date_from_url": "2024-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If what we’re hearing in the news reports concerning the US-Israeli strategy is even remotely true, the Tel Aviv regime is going to fail as comprehensively, and quite possibly, as catastrophically, as the Kiev regime. First, as Larry Johnson points out, the IDF is spreading itself too thin by <a href=\"https://sputnikglobe.com/20241002/iron-dome-proved-to-be-a-bust-iran-strikes-israel-in-retaliation-for-assassinations-1120377938.html\">attacking on too many fronts</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Israel is not in a position to fight a multi-front war and it does not have the strategic depth to fight wars of attrition. And that’s exactly what it’s got itself into now. It’s not going to be able to finish off Hezbollah in a week. It couldn’t even finish off Hamas in 12 months. It’s not going to be able to finish off Syria, finish off the Houthis or finish off Iran… That’s what Israel fails to understand. It does not have the ability to sustain itself in these kinds of operations for an extended period of time.</p></blockquote><p>The idea, of course, is to get themselves overwhelmed – or at least present the appearance of being overwhelmed – and thereby force the USA to bail them out. This isn’t an unreasonable concept based on the history of the Arab-Israeli wars, as going back to the Ottoman Empire, an external force has always been stepping in to freeze any conflict that looked like it was heading for a transformative conclusion, whether it was the Ottomans, the British, the Soviets, or the USA. And, of course, invading Iran on behalf of Israel has been the primary objective of the US-based neocons since Michael Ledeen turned “Faster, Please” into the “Carthago delenda est” for them <a href=\"https://www.nationalreview.com/2005/02/faster-please-michael-ledeen/\">back in 2005</a>.</p><p><em>Thus far, no Western leader has endorsed the call for an Iranian referendum. Now is the time. If the mullahs unexpectedly accept it, they will either receive confirmation of their claims to legitimacy, or be permitted to peacefully leave their posts. If they reject it, then no Western leader will be able to dismiss the calls for democratic revolution in Iran, and a united West can do for Iran what was done for Ukraine.</em></p><p>“A united West can do for Iran what was done for Ukraine.” That certainly did not age well; I’m absolutely certain the Iranian people do not see Ukraine as a positive model for themselves and that they would very much like to avoid the fate of the Ukrainians.</p><p>What struck me most, however, is the way that the neocons are relying upon their usual strategy for winning an Iran-Israeli war. What strategy is that? You guessed it: <em>regime change.</em> That’s why the media is relentlessly pushing the rhetoric that the missile attack “failed,” that it was “an embarrassment,” and that the Tehran regime was “humiliated.” The idea is to cause the government to collapse and be replaced by one more willing to surrender, just like Russia has surrendered due to all of the failures, embarrassments, and humiliations endured by Vladimir Putin over the last two years.</p><p>This is, of course, retarded. But as far as I can tell, and insofar as the global media has specifically articulated it, <em>that’s the actual objective here</em>. <a href=\"https://x.com/AdameMedia/status/1841521363732816270\">Note the video</a> in which a British Sky News reporter asks an Iranian professor if Iran lost a “war” to Israel – by which he clearly meant an exchange of air and missile strikes, not an actual war on the ground – could the Iranian regime survive? The professor just laughed at him, and rightly so; this is a government that survived 600,000 fatalities and eight years of very bloody air, sea, and land war in defeating the invading Iraqi forces despite the massive assistance provided to Saddam Hussein by the USA, the French, and the Arab states.</p><p>It is evident that the US-Israeli plan for victory is to hope that the other side simply doesn’t have the stomach for any direct conflict that lasts more than a few weeks. But while that plan has worked in the past, Persians are no more Arabs than the Afghans or the Russians are.</p><p><strong>UPDATE: </strong>Apparently this is the Dahiya doctrine, conceived by an IDF Chief of General Staff, Col. Gabi Siboni. Either he read too much Douhet or he didn’t pay enough attention to the complete failure of the Allied air campaign against Germany during WWII to achieve its objectives, let alone force regime change.</p><p><em><a href=\"https://socialgalactic.com/micropost/11818845-0fc0-494f-8a47-1184e4d833a8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If what we’re hearing in the news reports concerning the US-Israeli strategy is even remotely true, the Tel Aviv regime is going to fail as comprehensively, and quite possibly, as catastrophically, as the Kiev regime. First, as Larry Johnson points out, the IDF is spreading itself too thin by\nattacking on too many fronts\n.\nIsrael is not in a position to fight a multi-front war and it does not have the strategic depth to fight wars of attrition. And that’s exactly what it’s got itself into now. It’s not going to be able to finish off Hezbollah in a week. It couldn’t even finish off Hamas in 12 months. It’s not going to be able to finish off Syria, finish off the Houthis or finish off Iran… That’s what Israel fails to understand. It does not have the ability to sustain itself in these kinds of operations for an extended period of time.\nThe idea, of course, is to get themselves overwhelmed – or at least present the appearance of being overwhelmed – and thereby force the USA to bail them out. This isn’t an unreasonable concept based on the history of the Arab-Israeli wars, as going back to the Ottoman Empire, an external force has always been stepping in to freeze any conflict that looked like it was heading for a transformative conclusion, whether it was the Ottomans, the British, the Soviets, or the USA. And, of course, invading Iran on behalf of Israel has been the primary objective of the US-based neocons since Michael Ledeen turned “Faster, Please” into the “Carthago delenda est” for them\nback in 2005\n.\nThus far, no Western leader has endorsed the call for an Iranian referendum. Now is the time. If the mullahs unexpectedly accept it, they will either receive confirmation of their claims to legitimacy, or be permitted to peacefully leave their posts. If they reject it, then no Western leader will be able to dismiss the calls for democratic revolution in Iran, and a united West can do for Iran what was done for Ukraine.\n“A united West can do for Iran what was done for Ukraine.” That certainly did not age well; I’m absolutely certain the Iranian people do not see Ukraine as a positive model for themselves and that they would very much like to avoid the fate of the Ukrainians.\nWhat struck me most, however, is the way that the neocons are relying upon their usual strategy for winning an Iran-Israeli war. What strategy is that? You guessed it:\nregime change.\nThat’s why the media is relentlessly pushing the rhetoric that the missile attack “failed,” that it was “an embarrassment,” and that the Tehran regime was “humiliated.” The idea is to cause the government to collapse and be replaced by one more willing to surrender, just like Russia has surrendered due to all of the failures, embarrassments, and humiliations endured by Vladimir Putin over the last two years.\nThis is, of course, retarded. But as far as I can tell, and insofar as the global media has specifically articulated it,\nthat’s the actual objective here\n.\nNote the video\nin which a British Sky News reporter asks an Iranian professor if Iran lost a “war” to Israel – by which he clearly meant an exchange of air and missile strikes, not an actual war on the ground – could the Iranian regime survive? The professor just laughed at him, and rightly so; this is a government that survived 600,000 fatalities and eight years of very bloody air, sea, and land war in defeating the invading Iraqi forces despite the massive assistance provided to Saddam Hussein by the USA, the French, and the Arab states.\nIt is evident that the US-Israeli plan for victory is to hope that the other side simply doesn’t have the stomach for any direct conflict that lasts more than a few weeks. But while that plan has worked in the past, Persians are no more Arabs than the Afghans or the Russians are.\nUPDATE:\nApparently this is the Dahiya doctrine, conceived by an IDF Chief of General Staff, Col. Gabi Siboni. Either he read too much Douhet or he didn’t pay enough attention to the complete failure of the Allied air campaign against Germany during WWII to achieve its objectives, let alone force regime change.\nDISCUSS ON SG",
  "tags": [
    "Middle East",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-03T15:28:25+00:00"
}