{
  "url": "https://voxday.net/2024/10/05/the-next-british-scandal/",
  "scraped_at": "2026-01-08T19:25:20.688880",
  "title": "The Next British Scandal",
  "date_display": "October 5, 2024",
  "date_iso": "2024-10-05T15:56:26+00:00",
  "date_from_url": "2024-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Something is going on with British Prime Minister Keir Starmer that <a href=\"https://www.youtube.com/live/CNI6RNoW0iQ\">the media is presently dancing around</a>.</p><p><em>So we have a name, as do the Mail and the Telegraph, we have a birth certificate and people have been<br/>looking into it. People been contacted. Journalists have contacted the family, so it’s in play and a lot of people do know it, but we have not been able to substantiate it to to the degree that you need to to<br/>publish.</em></p><p>I’m no insider where British politics are concerned, but I heard rumors that the Prime Minister wasn’t even living with his wife, but was living with his other family until not long before the most recent electoral election began. But regardless of the how and why, it’s pretty clear that Starmer is a creature of Clown World.</p><p><em><a href=\"https://socialgalactic.com/micropost/2786b11e-a058-4bfe-965c-8284ef0243f0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Something is going on with British Prime Minister Keir Starmer that\nthe media is presently dancing around\n.\nSo we have a name, as do the Mail and the Telegraph, we have a birth certificate and people have been\nlooking into it. People been contacted. Journalists have contacted the family, so it’s in play and a lot of people do know it, but we have not been able to substantiate it to to the degree that you need to to\npublish.\nI’m no insider where British politics are concerned, but I heard rumors that the Prime Minister wasn’t even living with his wife, but was living with his other family until not long before the most recent electoral election began. But regardless of the how and why, it’s pretty clear that Starmer is a creature of Clown World.\nDISCUSS ON SG",
  "tags": [
    "media",
    "politics",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-10-05T15:56:29+00:00"
}