{
  "url": "https://voxday.net/2024/10/15/the-readers-speak/",
  "scraped_at": "2026-01-08T19:26:25.329868",
  "title": "The Readers Speak",
  "date_display": "October 15, 2024",
  "date_iso": "2024-10-15T18:23:06+00:00",
  "date_from_url": "2024-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The subscribers and other interested parties have spoken. <a href=\"https://castalialibrary.substack.com/p/three-questions-for-2025\">Here is how they answered</a>:</p><ul class=\"wp-block-list\"><li>86 percent of the Substack readers said they were seriously interested in a new Christian-themed subscription.</li><li>75 percent of the Library/History/Libraria subscribers said they would subscribe to a new two-book subscription as detailed.</li><li>The most popular books requested were written by: St. Augustine, St. Thomas Aquinas, CS Lewis, and GK Chesterton.</li></ul><p>There were a small number of Catholic objections to Protestant classics such as <em>Pilgrim’s Progress</em> and <em>The Canterbury Tales</em>. However, since this will be a Christian subscription, and not a Roman Catholic subscription, and since several of the most requested authors were Protestants, classics from the Catholic, Orthodox, and Protestant traditions will all be considered. But let’s face it. Everyone who reads me knows that, sooner or later, you’re getting Aquinas.</p><p>Given the overwhelmingly positive response, we anticipate announcing the new Castalia subscription in the new year. In the meantime, both volumes of <em>WAR AND PEACE</em> are on their way to the warehouse and <em>STUDIES IN THE NAPOLEONIC WARS</em> should follow next week.</p><p>Also, if you’re a History subscriber, be sure to check your email.</p><p><em><a href=\"https://socialgalactic.com/micropost/5b88a345-e803-4e21-8343-a60a30318a71\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The subscribers and other interested parties have spoken.\nHere is how they answered\n:\n86 percent of the Substack readers said they were seriously interested in a new Christian-themed subscription.\n75 percent of the Library/History/Libraria subscribers said they would subscribe to a new two-book subscription as detailed.\nThe most popular books requested were written by: St. Augustine, St. Thomas Aquinas, CS Lewis, and GK Chesterton.\nThere were a small number of Catholic objections to Protestant classics such as\nPilgrim’s Progress\nand\nThe Canterbury Tales\n. However, since this will be a Christian subscription, and not a Roman Catholic subscription, and since several of the most requested authors were Protestants, classics from the Catholic, Orthodox, and Protestant traditions will all be considered. But let’s face it. Everyone who reads me knows that, sooner or later, you’re getting Aquinas.\nGiven the overwhelmingly positive response, we anticipate announcing the new Castalia subscription in the new year. In the meantime, both volumes of\nWAR AND PEACE\nare on their way to the warehouse and\nSTUDIES IN THE NAPOLEONIC WARS\nshould follow next week.\nAlso, if you’re a History subscriber, be sure to check your email.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2024-10-15T18:25:03+00:00"
}