{
  "url": "https://voxday.net/2019/10/16/24-hours-300-percent/",
  "scraped_at": "2025-12-21T03:01:57.348009",
  "title": "24 hours, 300 percent",
  "date_display": "October 16, 2019",
  "date_iso": "2019-10-16T16:22:48+00:00",
  "date_from_url": "2019-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Junior Classics campaign is going extremely well, having hit 300 percent of goal in less than 24 hours. You can acquire a digital set, a hardcover set, or a deluxe leatherbound set by <a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312#/\">backing the campaign</a>.</p><p>The 2020 edition is about 85 percent 1918 and 15 percent 1958. This is because the 1918 volumes are generally better, but a) one of the original volumes was half-comprised of <i>Alice in Wonderland</i> whereas the later volume had a better and broader selection of stories, and b) the stories contained in the 1918 Volume 9 <i>Stories of Today</i> are seriously outdated and mediocre in comparison with the relatively timeless stories contained in the 1958 Volume 9, <i>Sport and Adventure</i>.</p><p>If you want multiple sets, just run through the buying process as many times as you require. You will receive multiple backer numbers.</p><p>The digital editions are both EPUB and MOBI (Kindle) format.</p></div>",
  "content_text": "The Junior Classics campaign is going extremely well, having hit 300 percent of goal in less than 24 hours. You can acquire a digital set, a hardcover set, or a deluxe leatherbound set by\nbacking the campaign\n.\nThe 2020 edition is about 85 percent 1918 and 15 percent 1958. This is because the 1918 volumes are generally better, but a) one of the original volumes was half-comprised of\nAlice in Wonderland\nwhereas the later volume had a better and broader selection of stories, and b) the stories contained in the 1918 Volume 9\nStories of Today\nare seriously outdated and mediocre in comparison with the relatively timeless stories contained in the 1958 Volume 9,\nSport and Adventure\n.\nIf you want multiple sets, just run through the buying process as many times as you require. You will receive multiple backer numbers.\nThe digital editions are both EPUB and MOBI (Kindle) format.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-16T15:22:48+00:00"
}