{
  "url": "https://voxday.net/2019/10/19/600-and-counting/",
  "scraped_at": "2025-12-21T03:02:20.565803",
  "title": "600% and counting",
  "date_display": "October 19, 2019",
  "date_iso": "2019-10-19T20:46:35+00:00",
  "date_from_url": "2019-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312#/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"67\" data-original-width=\"200\" decoding=\"async\" src=\"https://1.bp.blogspot.com/-YzDDm8ac_b0/XarmYfnRgJI/AAAAAAAAEZY/YRaXGCKdlD8Z7BRzvDzyJu0dk1pGMoe8wCLcBGAsYHQ/s1600/Junior-Classics-1.gif\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"67\" data-original-width=\"200\" data-src=\"https://1.bp.blogspot.com/-YzDDm8ac_b0/XarmYfnRgJI/AAAAAAAAEZY/YRaXGCKdlD8Z7BRzvDzyJu0dk1pGMoe8wCLcBGAsYHQ/s1600/Junior-Classics-1.gif\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%2067%22%3E%3C/svg%3E\"/></a></div><p>News of the availability of the 2020 Junior Classics is has observably spread as far as Australia and Hong Kong. If you are similarly interested in acquiring one of the greatest homeschooling assets ever printed, whether in digital, hardcover, or deluxe leather editions, <a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312#/\">you can do so here</a>.<br> The campaign owner is aware that the campaign cannot be found by searching for it on Google or the crowdfunding site. That is by design, so there is no need to repeatedly inform us of that fact. If you wish to help spread the news about the , please feel free to post the animated GIF above with <a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312#/\">a direct link to the campaign</a> attached. And thanks very much to the Classics backer who created the banner.<br> In other crowdfunding news, we are aware of about 500 AH Vol. I omnibuses that have not yet shipped due to a problem with the order formatting. We are in the process of fixing that with the printer, so if you have not yet received your omnibus, just sit tight, as this is just a minor procedural problem.<br> <b>UPDATE: </b>The Heirloom perk is intentionally priced higher than the sum of its parts because certain backers have requested a means of providing additional support to the project.<br> <b>UPDATE: </b>Both the leather and the case-laminated hardcover editions are printed on acid-free paper that meets the ANSI/NISO Z39.48-1992 standards for archival quality paper.</br></br></br></br></p></div>",
  "content_text": "News of the availability of the 2020 Junior Classics is has observably spread as far as Australia and Hong Kong. If you are similarly interested in acquiring one of the greatest homeschooling assets ever printed, whether in digital, hardcover, or deluxe leather editions,\nyou can do so here\n.\nThe campaign owner is aware that the campaign cannot be found by searching for it on Google or the crowdfunding site. That is by design, so there is no need to repeatedly inform us of that fact. If you wish to help spread the news about the , please feel free to post the animated GIF above with\na direct link to the campaign\nattached. And thanks very much to the Classics backer who created the banner.\nIn other crowdfunding news, we are aware of about 500 AH Vol. I omnibuses that have not yet shipped due to a problem with the order formatting. We are in the process of fixing that with the printer, so if you have not yet received your omnibus, just sit tight, as this is just a minor procedural problem.\nUPDATE:\nThe Heirloom perk is intentionally priced higher than the sum of its parts because certain backers have requested a means of providing additional support to the project.\nUPDATE:\nBoth the leather and the case-laminated hardcover editions are printed on acid-free paper that meets the ANSI/NISO Z39.48-1992 standards for archival quality paper.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-19T19:46:35+00:00"
}