{
  "url": "https://voxday.net/2019/10/25/800-percent-and-rising/",
  "scraped_at": "2025-12-21T03:03:03.717548",
  "title": "800 percent and rising",
  "date_display": "October 25, 2019",
  "date_iso": "2019-10-25T17:00:01+00:00",
  "date_from_url": "2019-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The campaign for <a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312#/\">the 2020 edition of the Junior Classics</a> continues to go from strength to strength. To explain why it is important, consider the following preface from Volume 4 of the 1918 edition, “Heroes and Heroines of Chivalry”, which was excised from the 1958 edition for reasons that will be obvious to anyone who is conversant with the concept of social justice convergence and the long-running cultural war against Christianity and the West. And it probably will not surprise you to know that all three of the stories referenced in this preface were also removed from the 1958 edition.</i><br><i><br/></i><i>The preface and all four stories will, of course, appear in the 2020 edition.</i></br></p><p>The word chivalry is taken from the French <i>cheval</i>, a horse. A knight was a young man, the son of a good family, who was allowed to wear arms. In the story “How the Child of the Sea was made Knight,” we are told how a boy of twelve became a page to the queen, and in the opening pages of the story “The Adventures of Sir Gareth,” we get a glimpse of a young man growing up at the court of King Arthur. It was not an easy life, that of a boy who wished to become a knight, but it made a man of him. He was taken at an early age, sometimes when only seven years old, to the castle of the king or knight he was to serve. He first became a page or valet, and, under the instruction of a governor, was taught to carve and wait on the table, to hunt and fish, and was drilled in wrestling and riding on horseback. Most pages were taught to dance, and if a boy had talent he was taught to play the harp so he could accompany his voice when singing to the ladies.</p><p>By the time a boy was fourteen he was ready to become an esquire. He was then taught to get on and off a horse with his heavy armor on, to wield the battle axe, and practise tilting with a spear. His service to the ladies had now reached the point where he picked out a lady to serve loyally. His endeavor was to please her in all things, in order that he might be known as her knight, and wear her glove or scarf as a badge or favor when he entered the lists of a joust or tournament.</p><p>To become a knight was almost as solemn an affair as it was to become a priest. Before the day of the ceremony he fasted, spent the night in prayer, confessed his sins, and received the Holy Sacrament. When morning came he went, clothed in white, to the church or hall, with a knight’s sword suspended from his neck. This the priest blessed and returned to him. Upon receiving back the sword he went and knelt before the presiding knight and took the oath of knighthood. The friends who accompanied him now came forward and handed him the spurs, the coat of mail, the armlet and gauntlet, and having put these on he girded on his sword. The presiding knight now bade him kneel, and, touching him three times on the shoulder with the flat of his sword, he pronounced the words that received him into the company of worthy knights: “In the name of God, of St. Michael, and St. George, I make thee a knight; be valiant, courteous, and loyal!” After this he received his helmet, his shield, and his spear, and the ceremony was completed.</p><p>The knight’s real work, and greatest joy, was fighting for some one who needed his help. Tournaments and jousts gave them chances to show off their skill in public. We must remember that there were no big open-air theatres in those days, such as the Greeks had, no public races or trials of strength such as the Greeks held in the stadiums, nor were there chariot races or fighting gladiators such as the Romans had at an earlier day. Tournaments or jousts were the big public entertainments, and you will find a famous description of one by Sir Walter Scott in Ivanhoe, in the volume “Stories that Never Grow Old,” the tournament of Ashby-de-la-Zouche. In it you will find a clear description of how the field of contest was laid out, of the magnificent pavilions decorated with flags, and the galleries spread with carpets and tapestries for the ladies.</p><p>The same qualities that made a manful fighter then, make one now: to speak the truth, to perform a promise to the utmost, to reverence all women, to be constant in love, to despise luxury, to be simple and modest and gentle in heart, to help the weak and take no unfair advantage of an inferior. This was the ideal of the age, and chivalry is the word that expresses that ideal. In all our reading we shall perhaps find no more glowing example of it as something real, than in the speech of Sir Jean de Vienne, governor of the besieged town of Calais who, when called upon by King Edward III of England to surrender unconditionally, replied:—</p><p><i>“We are but a small number of knights and squires, who have loyally served our lord and master as you would have done, and have suffered much ill and disquiet, but we will endure far more than any man has done in such a post, before we consent that the smallest boy in the town shall fare worse than ourselves.”</i></p><p>And this story you can find in the volume “Tales of Courage and Heroism,” entitled “The Noble Burghers of Calais.”</p></div>",
  "content_text": "The campaign for\nthe 2020 edition of the Junior Classics\ncontinues to go from strength to strength. To explain why it is important, consider the following preface from Volume 4 of the 1918 edition, “Heroes and Heroines of Chivalry”, which was excised from the 1958 edition for reasons that will be obvious to anyone who is conversant with the concept of social justice convergence and the long-running cultural war against Christianity and the West. And it probably will not surprise you to know that all three of the stories referenced in this preface were also removed from the 1958 edition.\nThe preface and all four stories will, of course, appear in the 2020 edition.\nThe word chivalry is taken from the French\ncheval\n, a horse. A knight was a young man, the son of a good family, who was allowed to wear arms. In the story “How the Child of the Sea was made Knight,” we are told how a boy of twelve became a page to the queen, and in the opening pages of the story “The Adventures of Sir Gareth,” we get a glimpse of a young man growing up at the court of King Arthur. It was not an easy life, that of a boy who wished to become a knight, but it made a man of him. He was taken at an early age, sometimes when only seven years old, to the castle of the king or knight he was to serve. He first became a page or valet, and, under the instruction of a governor, was taught to carve and wait on the table, to hunt and fish, and was drilled in wrestling and riding on horseback. Most pages were taught to dance, and if a boy had talent he was taught to play the harp so he could accompany his voice when singing to the ladies.\nBy the time a boy was fourteen he was ready to become an esquire. He was then taught to get on and off a horse with his heavy armor on, to wield the battle axe, and practise tilting with a spear. His service to the ladies had now reached the point where he picked out a lady to serve loyally. His endeavor was to please her in all things, in order that he might be known as her knight, and wear her glove or scarf as a badge or favor when he entered the lists of a joust or tournament.\nTo become a knight was almost as solemn an affair as it was to become a priest. Before the day of the ceremony he fasted, spent the night in prayer, confessed his sins, and received the Holy Sacrament. When morning came he went, clothed in white, to the church or hall, with a knight’s sword suspended from his neck. This the priest blessed and returned to him. Upon receiving back the sword he went and knelt before the presiding knight and took the oath of knighthood. The friends who accompanied him now came forward and handed him the spurs, the coat of mail, the armlet and gauntlet, and having put these on he girded on his sword. The presiding knight now bade him kneel, and, touching him three times on the shoulder with the flat of his sword, he pronounced the words that received him into the company of worthy knights: “In the name of God, of St. Michael, and St. George, I make thee a knight; be valiant, courteous, and loyal!” After this he received his helmet, his shield, and his spear, and the ceremony was completed.\nThe knight’s real work, and greatest joy, was fighting for some one who needed his help. Tournaments and jousts gave them chances to show off their skill in public. We must remember that there were no big open-air theatres in those days, such as the Greeks had, no public races or trials of strength such as the Greeks held in the stadiums, nor were there chariot races or fighting gladiators such as the Romans had at an earlier day. Tournaments or jousts were the big public entertainments, and you will find a famous description of one by Sir Walter Scott in Ivanhoe, in the volume “Stories that Never Grow Old,” the tournament of Ashby-de-la-Zouche. In it you will find a clear description of how the field of contest was laid out, of the magnificent pavilions decorated with flags, and the galleries spread with carpets and tapestries for the ladies.\nThe same qualities that made a manful fighter then, make one now: to speak the truth, to perform a promise to the utmost, to reverence all women, to be constant in love, to despise luxury, to be simple and modest and gentle in heart, to help the weak and take no unfair advantage of an inferior. This was the ideal of the age, and chivalry is the word that expresses that ideal. In all our reading we shall perhaps find no more glowing example of it as something real, than in the speech of Sir Jean de Vienne, governor of the besieged town of Calais who, when called upon by King Edward III of England to surrender unconditionally, replied:—\n“We are but a small number of knights and squires, who have loyally served our lord and master as you would have done, and have suffered much ill and disquiet, but we will endure far more than any man has done in such a post, before we consent that the smallest boy in the town shall fare worse than ourselves.”\nAnd this story you can find in the volume “Tales of Courage and Heroism,” entitled “The Noble Burghers of Calais.”",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-25T16:00:01+00:00"
}