{
  "url": "https://voxday.net/2019/10/04/a-game-designer-gets-it/",
  "scraped_at": "2025-12-21T03:00:48.050227",
  "title": "A game designer gets it",
  "date_display": "October 4, 2019",
  "date_iso": "2019-10-04T12:00:01+00:00",
  "date_from_url": "2019-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The designer of Sense: A Cyberpunk Ghost Story has <a href=\"https://boundingintocomics.com/2019/10/03/sense-a-cyberpunk-ghost-story-creator-benjamin-widdowson-on-cancel-culture-never-apologize-to-the-mob/\">some excellent advice</a> that sounds rather familiar:</p><blockquote><p>Widdowson then puts forth four tactics, “never apologize,” cease any support for “people that engage in this behavior (on all sides),” minimize “engagement with these people,” and speak “with your wallets,” and states that these tactics are “the only way to stop this stuff from happening”:</p><p><i>“– Never apologize to the mob, if enough people stop doing the corporate non-apology, or the “I’m sorry, I’m woke now”-apology then the mob loses it’s power and the “game” stops being exciting for the hangers-on. An apology is a vindication, a self-defeat, a statement saying you acknowledge you did something worth an apology. Don’t do it.</i><br><i><br/></i><i>– Stop supporting the people that engage in this behavior (on all sides), and stop supporting the companies that employ them. Money talks, eventually…</i><br><i><br/></i><i>– Minimize engagement with these people. Starve them of attention; make them feel like they are screaming into a void of exactly 0 people that care. Remember, these people subsist purely on outrage, anger, and discomfort. You don’t have to. So if you really need to engage with these people though, make sure you do it in a way that benefits you. We’ve connected with some great fans and new customers thanks to this.</i><br><i><br/></i><i>– Speak with your wallets, if you see a large company bend the knee to the mob, stop giving them your money at all. You don’t need the next AAA  EA/Activision/whoever published game, but they certainly need your money. You guys have 100{20631733b5a15c3694dbfcf360b60a1948a54005354f1d1bb00d126531fe1735} of the power. Never, ever forget that you determine actual success regardless of what those in “power” redefine that word to mean.”</i></br></br></br></p></blockquote><p>Minimizing engagement and voting with your wallet are the two most important points. The evil power of the Devil Mouse would be significantly reduced if idiot conservatives would simply <u>stop</u> going to Disneyland and buying tickets to Disney-produced movies. Hollywood would be significantly less able to influence minds all over the planet if the people it hates would stop paying for its increasingly horrendous products.</p><p>No wonder they harbor such contempt for the men and women of the West. Far too many of us not only materially support, <i>but actually pride ourselves on</i>, destroying our own interests and our own societies.</p></div>",
  "content_text": "The designer of Sense: A Cyberpunk Ghost Story has\nsome excellent advice\nthat sounds rather familiar:\nWiddowson then puts forth four tactics, “never apologize,” cease any support for “people that engage in this behavior (on all sides),” minimize “engagement with these people,” and speak “with your wallets,” and states that these tactics are “the only way to stop this stuff from happening”:\n“– Never apologize to the mob, if enough people stop doing the corporate non-apology, or the “I’m sorry, I’m woke now”-apology then the mob loses it’s power and the “game” stops being exciting for the hangers-on. An apology is a vindication, a self-defeat, a statement saying you acknowledge you did something worth an apology. Don’t do it.\n– Stop supporting the people that engage in this behavior (on all sides), and stop supporting the companies that employ them. Money talks, eventually…\n– Minimize engagement with these people. Starve them of attention; make them feel like they are screaming into a void of exactly 0 people that care. Remember, these people subsist purely on outrage, anger, and discomfort. You don’t have to. So if you really need to engage with these people though, make sure you do it in a way that benefits you. We’ve connected with some great fans and new customers thanks to this.\n– Speak with your wallets, if you see a large company bend the knee to the mob, stop giving them your money at all. You don’t need the next AAA  EA/Activision/whoever published game, but they certainly need your money. You guys have 100{20631733b5a15c3694dbfcf360b60a1948a54005354f1d1bb00d126531fe1735} of the power. Never, ever forget that you determine actual success regardless of what those in “power” redefine that word to mean.”\nMinimizing engagement and voting with your wallet are the two most important points. The evil power of the Devil Mouse would be significantly reduced if idiot conservatives would simply\nstop\ngoing to Disneyland and buying tickets to Disney-produced movies. Hollywood would be significantly less able to influence minds all over the planet if the people it hates would stop paying for its increasingly horrendous products.\nNo wonder they harbor such contempt for the men and women of the West. Far too many of us not only materially support,\nbut actually pride ourselves on\n, destroying our own interests and our own societies.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-04T11:00:01+00:00"
}