{
  "url": "https://voxday.net/2019/10/02/castalia-deluxe/",
  "scraped_at": "2025-12-21T03:00:31.305848",
  "title": "Castalia Deluxe",
  "date_display": "October 2, 2019",
  "date_iso": "2019-10-02T16:07:39+00:00",
  "date_from_url": "2019-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader emails concerning his interest in the new Castalia Deluxe line we are currently in the process of creating:</p><blockquote><p>I am interested in the Castalia House leather bound books you have been proposing. My commitment is firm.</p><p>After growing up with reading being a prominent pastime, I had become post-literate myself. I had stopped reading for fun or leisure for over a decade.</p><p>Why? Because, increasingly, nearly everything that was readily accessible or recommended to me was subverted, converged, perverted, plain wrong, incompetent, amounted to nothing more than propaganda, was revisionist garbage, etc., etc. I had not finished a book in years that did not leave me feeling distorted, disgusted, or contributed to my mounting nihilism in some way. The same has been true for movies, TV, and pop culture generally which I have also abandoned. The odds were too good it would be utter *@!$.</p><p>Castalia House has been a welcome relief to my literary drought. Since I discovered you and Castalia House, aside from my professional and academic duties, I have read more in the last few months than I have in years. It’s not just the books Castalia publishes, but also Castalia’s blog, your blog, and the other resources you have exposed me to that has allowed me to reliably track down things worth reading. Things that leave me with a sense of the good, the true, and the beautiful.</p><p><i>A Throne of Bones</i> was excellent. (Looking forward to <i>A Sea of Skulls</i>). David Eddings’s<i> The Belgariad</i> series was an effortless, enjoyable read. <i>A History of France</i> by John Julius Norwich wasn’t revisionist garbage. I am about to crack the first volume in my 1910 edition of Charles Oman’s <i>The History of England</i>.</p><p>Thank you for Castalia House and all you do. Keep up the good work.</p><p>P.S. Sometimes the presence of gatekeepers make people aware there’s a gate. Despite my growing disdain for Jordan Peterson, I took notice of his interview with Milo. I wondered what had changed because, for lack of a better phrase, one was authorized and the other wasn’t. When I watched the interview, Peterson reminded me you existed with his “Say hi to Vox for me” line. I quickly realized what had changed is <i>Jordanetics </i>was published. <i>Jordanetics </i>clearly articulated why I had developed such disdain for Peterson. This led me to Castalia House, Vox Popoli, and the Darkstream.</p><p>So, thanks, Jordan.</p></blockquote><p>For those who aren’t aware, over the last week I’ve been working on expanding the concept of the requested deluxe leatherbound Castalia Junior Classics to an entire line of high-quality Castalia Deluxe books in the vein of Easton Press and Franklin Mint. The interest in this has been unexpectedly high, even among the presumably post-literate video crowd, and the project is looking extremely viable due to the way in which it builds directly on what we’re already doing at Castalia House.</p><p>The current plan is to offer a 50/month subscription to Castalia Deluxe, which will provide six books per year to the subscriber, delivered every other month. These subscriber books will NOT be limited editions, but they may have some features that the regular Deluxe books do not, such as gilded page edges and bookmark ribbons. The Castalia Junior Classics will NOT be part of the subscription, but both the regular hardcover and Deluxe editions will be available for sale.</p><p>We will offer a discount on non-subscription Deluxe books to subscribers, probably on the order of 5 or 10 dollars per book. We MAY also offer free shipping if we can ship a purchased book with a regular subscription shipment.</p><p>The first two books we will send to subscribers will be <i>The Missionaries</i> and <i>Summa Elvetica &amp; Other Stories</i>. And in answer to some more of the frequently asked questions I’ve been getting:</p><p><b>Where do I sign up for the Deluxe subscription?</b><br>You don’t yet. We still have to decide how we want to set this up exactly, most likely through the Arkhaven store, and confirm that all the numbers add up correctly. But if you are seriously interested – by which I mean an 85 percent chance you believe you will sign up for a subscription if and when it becomes available – email me now with CASTALIA DELUXE in the subject.</br></p><p><b>How do I get the Castalia Junior Classics?</b><br>Through the crowdfunding campaign that is expected to begin in 2-3 weeks. The Junior Classics are NOT a part of this subscription program. The only connection is that we stumbled upon the idea of a new product line as part of figuring out how to offer a Deluxe edition of them.</br></p><p><b>Are you only going to be offering Castalia House books in Castalia Deluxe?</b><br>No. We’re just starting the Deluxe line with books we already publish because that is one less issue to sort out at the start. We’re trying to keep the degree of difficulty to a reasonable minimum. In addition to some of the usual classics, we want to publish great reference works of history, science, and philosophy. For example, I’d particularly like to bring back the first edition of <i>The Cambridge Medieval History</i>.</br></p><p><b>Will <i>A THRONE OF BONES</i>/<i>AWAKE IN THE NIGHT LAND</i> be available as part of the Deluxe subscription?</b><br>Yes, they will probably be included in the first year. We need to re-layout AWAKE, otherwise it would replace SUMMA as the second subscription book. And beginning with a monstrosity like ATOB would not be minimizing the degree of difficulty.</br></p><p><b>Will large books like ATOB cost more for subscribers?</b><br>No. Some books will cost us more, some will cost us less. This may affect the retail price, but will not affect the subscriptions.</br></p><p><b>Is the paper for the Deluxe editions going to be acid-free?</b><br>Yes, the paper is acid-free and meets ANSI/NISO Z39.48-1992 standards for archival quality paper.</br></p><p><b>Will you be publishing <i>THERE WILL BE WAR </i>in Deluxe editions?</b><br>Absolutely. They’re very near the top of the list.</br></p><p><b>I’m an author. Will you publish a Deluxe edition of my book?</b><br>That depends. Is your name “Nick Cole” or “William Gibson” or “Arturo Perez-Reverte”?</br></p><p><b>Will the Deluxe editions ship outside the USA?</b><br>Yes, although it is POSSIBLE that an international surcharge to cover shipping will be required for the subscription shipments.</br></p><p><b>UPDATE: </b>the initial response has been enthusiastic.</p><blockquote class=\"tr_bq\"><p>Count me in for $50 a month! I find your literary curation absolutely invaluable. This year alone you’ve been the driving force behind me digging into Richard Adams, Hesse, Wodehouse, Umberto Eco, William Gibson, Owen Stanley, Quigley, Norwich, Van Creveld and more. It’s been an incredibly rewarding and transformative process.</p></blockquote></div>",
  "content_text": "A reader emails concerning his interest in the new Castalia Deluxe line we are currently in the process of creating:\nI am interested in the Castalia House leather bound books you have been proposing. My commitment is firm.\nAfter growing up with reading being a prominent pastime, I had become post-literate myself. I had stopped reading for fun or leisure for over a decade.\nWhy? Because, increasingly, nearly everything that was readily accessible or recommended to me was subverted, converged, perverted, plain wrong, incompetent, amounted to nothing more than propaganda, was revisionist garbage, etc., etc. I had not finished a book in years that did not leave me feeling distorted, disgusted, or contributed to my mounting nihilism in some way. The same has been true for movies, TV, and pop culture generally which I have also abandoned. The odds were too good it would be utter *@!$.\nCastalia House has been a welcome relief to my literary drought. Since I discovered you and Castalia House, aside from my professional and academic duties, I have read more in the last few months than I have in years. It’s not just the books Castalia publishes, but also Castalia’s blog, your blog, and the other resources you have exposed me to that has allowed me to reliably track down things worth reading. Things that leave me with a sense of the good, the true, and the beautiful.\nA Throne of Bones\nwas excellent. (Looking forward to\nA Sea of Skulls\n). David Eddings’s\nThe Belgariad\nseries was an effortless, enjoyable read.\nA History of France\nby John Julius Norwich wasn’t revisionist garbage. I am about to crack the first volume in my 1910 edition of Charles Oman’s\nThe History of England\n.\nThank you for Castalia House and all you do. Keep up the good work.\nP.S. Sometimes the presence of gatekeepers make people aware there’s a gate. Despite my growing disdain for Jordan Peterson, I took notice of his interview with Milo. I wondered what had changed because, for lack of a better phrase, one was authorized and the other wasn’t. When I watched the interview, Peterson reminded me you existed with his “Say hi to Vox for me” line. I quickly realized what had changed is\nJordanetics\nwas published.\nJordanetics\nclearly articulated why I had developed such disdain for Peterson. This led me to Castalia House, Vox Popoli, and the Darkstream.\nSo, thanks, Jordan.\nFor those who aren’t aware, over the last week I’ve been working on expanding the concept of the requested deluxe leatherbound Castalia Junior Classics to an entire line of high-quality Castalia Deluxe books in the vein of Easton Press and Franklin Mint. The interest in this has been unexpectedly high, even among the presumably post-literate video crowd, and the project is looking extremely viable due to the way in which it builds directly on what we’re already doing at Castalia House.\nThe current plan is to offer a 50/month subscription to Castalia Deluxe, which will provide six books per year to the subscriber, delivered every other month. These subscriber books will NOT be limited editions, but they may have some features that the regular Deluxe books do not, such as gilded page edges and bookmark ribbons. The Castalia Junior Classics will NOT be part of the subscription, but both the regular hardcover and Deluxe editions will be available for sale.\nWe will offer a discount on non-subscription Deluxe books to subscribers, probably on the order of 5 or 10 dollars per book. We MAY also offer free shipping if we can ship a purchased book with a regular subscription shipment.\nThe first two books we will send to subscribers will be\nThe Missionaries\nand\nSumma Elvetica & Other Stories\n. And in answer to some more of the frequently asked questions I’ve been getting:\nWhere do I sign up for the Deluxe subscription?\nYou don’t yet. We still have to decide how we want to set this up exactly, most likely through the Arkhaven store, and confirm that all the numbers add up correctly. But if you are seriously interested – by which I mean an 85 percent chance you believe you will sign up for a subscription if and when it becomes available – email me now with CASTALIA DELUXE in the subject.\nHow do I get the Castalia Junior Classics?\nThrough the crowdfunding campaign that is expected to begin in 2-3 weeks. The Junior Classics are NOT a part of this subscription program. The only connection is that we stumbled upon the idea of a new product line as part of figuring out how to offer a Deluxe edition of them.\nAre you only going to be offering Castalia House books in Castalia Deluxe?\nNo. We’re just starting the Deluxe line with books we already publish because that is one less issue to sort out at the start. We’re trying to keep the degree of difficulty to a reasonable minimum. In addition to some of the usual classics, we want to publish great reference works of history, science, and philosophy. For example, I’d particularly like to bring back the first edition of\nThe Cambridge Medieval History\n.\nWill\nA THRONE OF BONES\n/\nAWAKE IN THE NIGHT LAND\nbe available as part of the Deluxe subscription?\nYes, they will probably be included in the first year. We need to re-layout AWAKE, otherwise it would replace SUMMA as the second subscription book. And beginning with a monstrosity like ATOB would not be minimizing the degree of difficulty.\nWill large books like ATOB cost more for subscribers?\nNo. Some books will cost us more, some will cost us less. This may affect the retail price, but will not affect the subscriptions.\nIs the paper for the Deluxe editions going to be acid-free?\nYes, the paper is acid-free and meets ANSI/NISO Z39.48-1992 standards for archival quality paper.\nWill you be publishing\nTHERE WILL BE WAR\nin Deluxe editions?\nAbsolutely. They’re very near the top of the list.\nI’m an author. Will you publish a Deluxe edition of my book?\nThat depends. Is your name “Nick Cole” or “William Gibson” or “Arturo Perez-Reverte”?\nWill the Deluxe editions ship outside the USA?\nYes, although it is POSSIBLE that an international surcharge to cover shipping will be required for the subscription shipments.\nUPDATE:\nthe initial response has been enthusiastic.\nCount me in for $50 a month! I find your literary curation absolutely invaluable. This year alone you’ve been the driving force behind me digging into Richard Adams, Hesse, Wodehouse, Umberto Eco, William Gibson, Owen Stanley, Quigley, Norwich, Van Creveld and more. It’s been an incredibly rewarding and transformative process.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-02T15:07:39+00:00"
}