{
  "url": "https://voxday.net/2019/10/21/clueless-cowards/",
  "scraped_at": "2025-12-21T03:02:29.803012",
  "title": "Clueless cowards",
  "date_display": "October 21, 2019",
  "date_iso": "2019-10-21T11:28:20+00:00",
  "date_from_url": "2019-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s reprehensibly stupid when sports reporters not only <a href=\"https://profootballtalk.nbcsports.com/2019/10/21/rams-trade-jalen-ramsey-fmia-nfl-peter-king/\">can’t stick to sports</a>, but insist on publicly demonstrating both their complete ignorance of geopolitics as well as their intellectual cowardice.</p><blockquote><p><i>Enough already with the politics.</i> From John D.: “We get it. You’re liberal and you hate the POTUS. Just shut up already about it.”</p><p>I will spend some words from time to time calling it the way I see it.</p><p><i>I am a coward for not addressing China last week. </i>From Jeff Cannon Sr.: “You’re a coward, Peter. A quiet coward. Thank the ghosts that your industry is dying an accelerated death … Avoiding the subject of China while taking another needless shot at the president cost you a loyal reader. Good day.”</p><p>You mean you don’t want me to stick to sports?</p><p>One overriding thought about the NBA-China-United States-LeBron-Morey story: If Daryl Morey expresses his opinion wishing good luck to Hong Kong for its freedom fight from China, and if China gets incredibly ticked off about it, that is understandable. China is not as free as the United States. So of course China will be angry. So what? The Chinese run their country their way. We run our country our way. Why should anyone in the United States—particularly someone who has benefited from the freedoms of the United States like LeBron James—kowtow to China? Our belief is that our citizens can speak freely, which is what Daryl Morey was doing. China should understand this is who we are. Who cares if China is offended? If the Chinese don’t accept that we have a right to criticize them, well, tough. And if it costs the NBA billions, such is life.</p><p>I get it: It’s not my money at stake. But it’s outrageous, honestly, that China would be outraged at us. If they want to prevent their citizens from speaking freely, that’s their business. We allow our citizens to express opinions, on everything. They should understand that.</p></blockquote><p>Why should the Chinese understand that? Why should anyone understand that, <i>especially when it is observably false?</i> Peter King would disemploy, disavow, and forcibly silence anyone in his power who expressed an opinion of which he did not approve on race, sex, or sexual abnormalities. Why should he affect outrage that China should wield its economic power as it sees fit?</p><p>If Sports Illustrated had simply stuck to sports, it might not be circling the drain now.</p></div>",
  "content_text": "It’s reprehensibly stupid when sports reporters not only\ncan’t stick to sports\n, but insist on publicly demonstrating both their complete ignorance of geopolitics as well as their intellectual cowardice.\nEnough already with the politics.\nFrom John D.: “We get it. You’re liberal and you hate the POTUS. Just shut up already about it.”\nI will spend some words from time to time calling it the way I see it.\nI am a coward for not addressing China last week.\nFrom Jeff Cannon Sr.: “You’re a coward, Peter. A quiet coward. Thank the ghosts that your industry is dying an accelerated death … Avoiding the subject of China while taking another needless shot at the president cost you a loyal reader. Good day.”\nYou mean you don’t want me to stick to sports?\nOne overriding thought about the NBA-China-United States-LeBron-Morey story: If Daryl Morey expresses his opinion wishing good luck to Hong Kong for its freedom fight from China, and if China gets incredibly ticked off about it, that is understandable. China is not as free as the United States. So of course China will be angry. So what? The Chinese run their country their way. We run our country our way. Why should anyone in the United States—particularly someone who has benefited from the freedoms of the United States like LeBron James—kowtow to China? Our belief is that our citizens can speak freely, which is what Daryl Morey was doing. China should understand this is who we are. Who cares if China is offended? If the Chinese don’t accept that we have a right to criticize them, well, tough. And if it costs the NBA billions, such is life.\nI get it: It’s not my money at stake. But it’s outrageous, honestly, that China would be outraged at us. If they want to prevent their citizens from speaking freely, that’s their business. We allow our citizens to express opinions, on everything. They should understand that.\nWhy should the Chinese understand that? Why should anyone understand that,\nespecially when it is observably false?\nPeter King would disemploy, disavow, and forcibly silence anyone in his power who expressed an opinion of which he did not approve on race, sex, or sexual abnormalities. Why should he affect outrage that China should wield its economic power as it sees fit?\nIf Sports Illustrated had simply stuck to sports, it might not be circling the drain now.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-21T10:28:20+00:00"
}