{
  "url": "https://voxday.net/2019/10/04/diversity-comics-reviews-alt-hero-volume-one/",
  "scraped_at": "2025-12-21T03:00:49.519006",
  "title": "Diversity & Comics reviews Alt-Hero Volume One",
  "date_display": "October 4, 2019",
  "date_iso": "2019-10-04T15:22:59+00:00",
  "date_from_url": "2019-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/tl8ucCB43vE\" width=\"512\"></iframe></div><p>It’s a fair and detailed <a href=\"https://youtu.be/tl8ucCB43vE\">review of the six issues collected</a>. I disagree, of course, with the idea that comics must be relentless BIF! – SOCK! – POW! action, as I see no problem with what is described here as “the talking head problem”, or as we novelists refer to it, dialogue and character development. And while I understand that not everyone is interested in current events, I am, and it would be very strange indeed if a fictional battle between globalists and nationalists did not bear some resemblances to the real-world version.</p><p>Indeed, as some have noted, the events taking place in the Alt-Hero world have even been observed to have anticipated events taking place in the real one. I also found it interesting that D&amp;C so strongly preferred the US-based story to the Europe-based one, as it’s been my vague impression that a majority of AH fans tend to prefer the latter.</p><p>But regardless, I appreciate the review, which is one of the first to look at the entire volume one omnibus.</p></div>",
  "content_text": "It’s a fair and detailed\nreview of the six issues collected\n. I disagree, of course, with the idea that comics must be relentless BIF! – SOCK! – POW! action, as I see no problem with what is described here as “the talking head problem”, or as we novelists refer to it, dialogue and character development. And while I understand that not everyone is interested in current events, I am, and it would be very strange indeed if a fictional battle between globalists and nationalists did not bear some resemblances to the real-world version.\nIndeed, as some have noted, the events taking place in the Alt-Hero world have even been observed to have anticipated events taking place in the real one. I also found it interesting that D&C so strongly preferred the US-based story to the Europe-based one, as it’s been my vague impression that a majority of AH fans tend to prefer the latter.\nBut regardless, I appreciate the review, which is one of the first to look at the entire volume one omnibus.",
  "tags": [
    "Alt-Hero"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-04T14:22:59+00:00"
}