{
  "url": "https://voxday.net/2019/10/01/henry-haller-is-a-gamma/",
  "scraped_at": "2025-12-21T03:00:20.273519",
  "title": "Henry Haller is a gamma",
  "date_display": "October 1, 2019",
  "date_iso": "2019-10-01T12:17:09+00:00",
  "date_from_url": "2019-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A fellow Hesse fan reaches a conclusion:</p><blockquote><p>I’ve been reading <i>Steppenwolf </i>by Herman Hesse and something occurred to me. I first intended to ask what sociosexual rank you think Harry Haller inhabits, but then I got to this passage and started laughing outside the sauna:</p><p><i>For long during this night’s walk I had reflected upon the significance of my relation to music, and not for the first time recognized this appealing and fatal relation as the destiny of the entire German spirit. In the German spirit the matriarchal link with nature rules in the form of the hegemony of music to an extent unknown in any other people. We intellectuals instead of opposing ourselves to this tendency like men, and rendering obedience to the spirit, the Logos, the Word, and gaining a hearing for it, are all dreaming of a speech without words that utters the inexpressible and gives form to the formless. </i><br><i><br/></i><i>Instead of playing his part as truly and honestly as he could, the German intellectual has constantly rebelled against the word and against reason and courted music, in wonderful creation of sound and wonderful beauties of feeling and mood that were never pressed home to reality, has left the greater part of its practical gifts to decay. None of us intellectuals is at home in reality. We are strangers to it and hostile. That is why the part played by intellect even in our own German reality, in our history and politics and public opinion, has been so lamentable a one. Well, I had often pondered all this, not without an intense longing sometimes to turn to and do something real for once, to be seriously and responsibly active instead of occupying myself forever with nothing but aesthetics and intellectual and artistic pursuits. It always ended, however, in resignation, in surrender to destiny. </i><br><i><br/></i><i>The generals and captains of industry were quite right. there was nothing to be made of us intellectuals. We were a superfluous, irresponsible lot of talented chatterboxes for whom reality had no meaning.</i></br></br></p><p>I wish I would have read <i>Steppenwolf </i>years and years ago because I think that passage would have helped me as much back then as it did today. At that passage I realized that it’s a book written by a German for the German people to help us understand ourselves. Occasionally someone asks you if it would be a good idea to move back to his own ancestral homeland. It may be a good idea, but it’s equally good to start by reading one’s own people’s literature because it was written for you yourself as one of those people.</p><p>A German girl I met on vacation about four years ago recommended that I read <i>Steppenwolf</i>, I think now because she recognized me as being truly German and as such would benefit from it like other Germans have. I plan now on diving into Goethe, as my grandfather told me a long time ago that “Goethe is the German Shakespeare.”</p></blockquote><p>I’ve always felt that it was a bit ironic that the band that recorded “Born to be Wild” called themselves Steppenwolf since if they had remained true to the novel, the song would have been named “Born to be Mild”.</p><p>And “a superfluous, irresponsible lot of talented chatterboxes for whom reality had no meaning” is a fairly accurate description of the average intellectual today, except, of course, for the bit about talent.</p></div>",
  "content_text": "A fellow Hesse fan reaches a conclusion:\nI’ve been reading\nSteppenwolf\nby Herman Hesse and something occurred to me. I first intended to ask what sociosexual rank you think Harry Haller inhabits, but then I got to this passage and started laughing outside the sauna:\nFor long during this night’s walk I had reflected upon the significance of my relation to music, and not for the first time recognized this appealing and fatal relation as the destiny of the entire German spirit. In the German spirit the matriarchal link with nature rules in the form of the hegemony of music to an extent unknown in any other people. We intellectuals instead of opposing ourselves to this tendency like men, and rendering obedience to the spirit, the Logos, the Word, and gaining a hearing for it, are all dreaming of a speech without words that utters the inexpressible and gives form to the formless.\nInstead of playing his part as truly and honestly as he could, the German intellectual has constantly rebelled against the word and against reason and courted music, in wonderful creation of sound and wonderful beauties of feeling and mood that were never pressed home to reality, has left the greater part of its practical gifts to decay. None of us intellectuals is at home in reality. We are strangers to it and hostile. That is why the part played by intellect even in our own German reality, in our history and politics and public opinion, has been so lamentable a one. Well, I had often pondered all this, not without an intense longing sometimes to turn to and do something real for once, to be seriously and responsibly active instead of occupying myself forever with nothing but aesthetics and intellectual and artistic pursuits. It always ended, however, in resignation, in surrender to destiny.\nThe generals and captains of industry were quite right. there was nothing to be made of us intellectuals. We were a superfluous, irresponsible lot of talented chatterboxes for whom reality had no meaning.\nI wish I would have read\nSteppenwolf\nyears and years ago because I think that passage would have helped me as much back then as it did today. At that passage I realized that it’s a book written by a German for the German people to help us understand ourselves. Occasionally someone asks you if it would be a good idea to move back to his own ancestral homeland. It may be a good idea, but it’s equally good to start by reading one’s own people’s literature because it was written for you yourself as one of those people.\nA German girl I met on vacation about four years ago recommended that I read\nSteppenwolf\n, I think now because she recognized me as being truly German and as such would benefit from it like other Germans have. I plan now on diving into Goethe, as my grandfather told me a long time ago that “Goethe is the German Shakespeare.”\nI’ve always felt that it was a bit ironic that the band that recorded “Born to be Wild” called themselves Steppenwolf since if they had remained true to the novel, the song would have been named “Born to be Mild”.\nAnd “a superfluous, irresponsible lot of talented chatterboxes for whom reality had no meaning” is a fairly accurate description of the average intellectual today, except, of course, for the bit about talent.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-01T11:17:09+00:00"
}