{
  "url": "https://voxday.net/2019/10/22/mailvox-the-rot-is-creeping-in/",
  "scraped_at": "2025-12-21T03:02:40.463934",
  "title": "Mailvox: the rot is creeping in",
  "date_display": "October 22, 2019",
  "date_iso": "2019-10-22T15:00:09+00:00",
  "date_from_url": "2019-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A veteran with multiple active-duty deployments in Iraq confirms a young officer’s observations about the state of the US Army, and specifically, its Officer Candidate School:</i></p><p>I wanted to comment on and, sadly, confirm a good chunk of what your recent OCS attendee wrote.</p><p><b>“Equal” Opportunity: </b></p><p>Women and especially brown and black women were absolutely given preference. Nothing so brazen as ignoring stated orders and being given a pass, but things like being told to our faces that our waste-of-a-cadet black nurse would be held to a lower standard (supposedly because nurse), or seeing women given consistently higher marks for actions that would have been given at best a “nice job” had she been a man. Some instructors were happier about this than others, but it was obviously an understood thing.</p><p><b>Second Generation Modern Warfare Training: </b></p><p>Yes, and lots of it. Training and Doctrine Command (TRADOC) cannot deal with innovative thinkers. Not will not, <i>cannot</i>. Everything is cookie cutter down almost to the last detail and any deviation is punished. I watched our Ranger-tabbed cadet get his ass chewed for not doing things exactly the TRADOC way, never mind that he had met with success by the instructor’s own admission. While the units can and often do beat this out of junior officers, to say that newly commissioned 2LTs are hidebound and risk-averse as a rule is an understatement, and too many continue to be so as their careers progress. If the US Army retains any vestiges of 3rd generation capability, it’s in spite of TRADOC.</p><p><b>The F-Word and A Culture of Gullible Murderers: </b></p><p>This is also true, but it’s also the fastest one to change with experience. Most of these men are young and fresh out of college, and all of them know that the way you get ahead in the Army is to in part be more bloodthirsty than the next guy. You don’t get points for being thoughtful or even remotely isolationist. Fortunately, much of it is posturing and many change their tunes after deploying a time or two. Not to say it isn’t a problem, just that it’s probably the most superficial and fastest to change of all the so far published points.</p><p><b>What I Call the “NuBoomer” Sub-Generation: </b></p><p>This one’s a bit more complicated. Do they exist? Yes, but part of it is inexperience, part of it is social conditioning, and the rest is telling the boss what he wants to hear. There are a lot more open dissidents in the Active and Guard ranks, especially in combat arms, including commanders. Of the several commanding officers I’ve served under, the closest I ever saw to this was a disgruntled Gen Xer who by virtue of his wife and where he lived, had a tendency to spout the Narrative. The incoming officers, at least in combat arms, will more often shuck the Narrative as soon as they see no one else is buying, though the superficial sense of religion is sadly spot on. They are, however, just as post-literate as the rest of their generation and civnattery is the last of the Narrative to go, if it ever does. Racism and sexism remain the only unforgivable sins in the Army.</p><p>Based on your source’s published letter, the rot I saw has gotten worse. From the view of a veteran, most of it is still confined to the support elements. Their reputations as hives of LGBT+, feminism, and all of the other contaminants of the Clown World are, from what I’ve observed, sadly merited. Combat arms still tries to focus on warfighting, but we are not immune and the rot is creeping in.</p></div>",
  "content_text": "A veteran with multiple active-duty deployments in Iraq confirms a young officer’s observations about the state of the US Army, and specifically, its Officer Candidate School:\nI wanted to comment on and, sadly, confirm a good chunk of what your recent OCS attendee wrote.\n“Equal” Opportunity:\nWomen and especially brown and black women were absolutely given preference. Nothing so brazen as ignoring stated orders and being given a pass, but things like being told to our faces that our waste-of-a-cadet black nurse would be held to a lower standard (supposedly because nurse), or seeing women given consistently higher marks for actions that would have been given at best a “nice job” had she been a man. Some instructors were happier about this than others, but it was obviously an understood thing.\nSecond Generation Modern Warfare Training:\nYes, and lots of it. Training and Doctrine Command (TRADOC) cannot deal with innovative thinkers. Not will not,\ncannot\n. Everything is cookie cutter down almost to the last detail and any deviation is punished. I watched our Ranger-tabbed cadet get his ass chewed for not doing things exactly the TRADOC way, never mind that he had met with success by the instructor’s own admission. While the units can and often do beat this out of junior officers, to say that newly commissioned 2LTs are hidebound and risk-averse as a rule is an understatement, and too many continue to be so as their careers progress. If the US Army retains any vestiges of 3rd generation capability, it’s in spite of TRADOC.\nThe F-Word and A Culture of Gullible Murderers:\nThis is also true, but it’s also the fastest one to change with experience. Most of these men are young and fresh out of college, and all of them know that the way you get ahead in the Army is to in part be more bloodthirsty than the next guy. You don’t get points for being thoughtful or even remotely isolationist. Fortunately, much of it is posturing and many change their tunes after deploying a time or two. Not to say it isn’t a problem, just that it’s probably the most superficial and fastest to change of all the so far published points.\nWhat I Call the “NuBoomer” Sub-Generation:\nThis one’s a bit more complicated. Do they exist? Yes, but part of it is inexperience, part of it is social conditioning, and the rest is telling the boss what he wants to hear. There are a lot more open dissidents in the Active and Guard ranks, especially in combat arms, including commanders. Of the several commanding officers I’ve served under, the closest I ever saw to this was a disgruntled Gen Xer who by virtue of his wife and where he lived, had a tendency to spout the Narrative. The incoming officers, at least in combat arms, will more often shuck the Narrative as soon as they see no one else is buying, though the superficial sense of religion is sadly spot on. They are, however, just as post-literate as the rest of their generation and civnattery is the last of the Narrative to go, if it ever does. Racism and sexism remain the only unforgivable sins in the Army.\nBased on your source’s published letter, the rot I saw has gotten worse. From the view of a veteran, most of it is still confined to the support elements. Their reputations as hives of LGBT+, feminism, and all of the other contaminants of the Clown World are, from what I’ve observed, sadly merited. Combat arms still tries to focus on warfighting, but we are not immune and the rot is creeping in.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-22T14:00:09+00:00"
}