{
  "url": "https://voxday.net/2019/10/25/preemptive-defense/",
  "scraped_at": "2025-12-21T03:03:02.216903",
  "title": "Preemptive defense",
  "date_display": "October 25, 2019",
  "date_iso": "2019-10-25T15:03:17+00:00",
  "date_from_url": "2019-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hillary Clinton might as well have come out and announced that there are videos of her and other Democratic Party nominees <a href=\"https://dailycaller.com/2019/10/24/hillary-clinton-flashing-videos-dark-web/\">doing horrible things</a>.</p><blockquote><p>Former Secretary of State Hillary Clinton blamed “flashing videos” on the “dark web” for her 2016 presidential election loss last Friday during a radio interview. Clinton said on Campaign HQ’s podcast that she anticipates President Donald Trump will employ a similar strategy to win re-election next November.</p><p>“I think it’s going to be the same as 2016,” Clinton said. “I’m going to show you in these flashing videos that appear and then disappear and they’re on the dark web and nobody can find them, but you’re going to see them and you’re going to see that person doing these horrible things.”</p></blockquote><p>How does she know?  <i>Because she did horrible things</i> and she knew the cameras were rolling. That’s the price the elite pays in order to receive their money, fame, and power from the prince of this fallen world.</p><p>Do you really believe that Katie Hill, <a href=\"https://www.dailymail.co.uk/news/article-7609835/Katie-Hill-seen-showing-Nazi-era-tattoo-smoking-BONG-NAKED.html\">aka Rep. Angelbutt</a>, is an outlier? She isn’t. Nearly all US politicians are similarly compromised. The God-Emperor and the Q Team are gradually tearing off the mask and revealing the awful reality to the naive American public.</p></div>",
  "content_text": "Hillary Clinton might as well have come out and announced that there are videos of her and other Democratic Party nominees\ndoing horrible things\n.\nFormer Secretary of State Hillary Clinton blamed “flashing videos” on the “dark web” for her 2016 presidential election loss last Friday during a radio interview. Clinton said on Campaign HQ’s podcast that she anticipates President Donald Trump will employ a similar strategy to win re-election next November.\n“I think it’s going to be the same as 2016,” Clinton said. “I’m going to show you in these flashing videos that appear and then disappear and they’re on the dark web and nobody can find them, but you’re going to see them and you’re going to see that person doing these horrible things.”\nHow does she know?\nBecause she did horrible things\nand she knew the cameras were rolling. That’s the price the elite pays in order to receive their money, fame, and power from the prince of this fallen world.\nDo you really believe that Katie Hill,\naka Rep. Angelbutt\n, is an outlier? She isn’t. Nearly all US politicians are similarly compromised. The God-Emperor and the Q Team are gradually tearing off the mask and revealing the awful reality to the naive American public.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-25T14:03:17+00:00"
}