{
  "url": "https://voxday.net/2019/10/28/professionally-inept/",
  "scraped_at": "2025-12-21T03:03:23.557194",
  "title": "Professionally inept",
  "date_display": "October 28, 2019",
  "date_iso": "2019-10-28T12:14:46+00:00",
  "date_from_url": "2019-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the reasons why the converged media companies have been running roughshod over those they’ve targeted for deplatforming is that their victims are afraid to fight back. But if you have, or are, or can find, a competent lawyer who doesn’t play the usual lawyer’s game of waiting until the last possible minute to submit some boilerplate that he plans to revise later, you’ll likely be well ahead of the opposition.</p><blockquote class=\"tr_bq\"><p>Law firm mistakes number of days in the month, so lawyer files notice of appeal one day after actual deadline. Court dismisses appeal and awards fees.</p></blockquote><p>They even have cute professional jargon for it: <i>calendar the deadline</i>. This sort of thing happens all the time. I’ve personally witnessed it and something similar happened in the Vic Mignogna case. Most lawyers, even very highly credentialed lawyers from very expensive law firms, take a disturbingly blase approach to deadlines, mostly because the established case law permits them to redefine clearly fixed time frames as indefinite periods that are entirely at the judge’s discretion.</p><p>Of course, the fact that it is reprehensibly stupid to proactively rely upon the judge being lax about deadlines never occurs to them. We are always careful to prepare our filings as soon as possible, and to file them several days ahead of time, in order to not provide a potentially adversarial judge an excuse to rule against us. Never wait until the last minute!</p><p>And on a not-unrelated note, the VFM, the Rubble-bouncers, and the Reprehensibles should be prepared to act very quickly when the Legion’s next campaign is announced tonight around 6:30 PM Eastern. I’ll send out emails, put up a post, and do a Darkstream once the link is live. The amount is irrelevant, as the objective is to establish standing for as many of you as possible. Now, don’t play Smart Boy and demonstrate how much you know about what’s going on here in the comments, but do feel free to indicate if you’re in on this one.</p></div>",
  "content_text": "One of the reasons why the converged media companies have been running roughshod over those they’ve targeted for deplatforming is that their victims are afraid to fight back. But if you have, or are, or can find, a competent lawyer who doesn’t play the usual lawyer’s game of waiting until the last possible minute to submit some boilerplate that he plans to revise later, you’ll likely be well ahead of the opposition.\nLaw firm mistakes number of days in the month, so lawyer files notice of appeal one day after actual deadline. Court dismisses appeal and awards fees.\nThey even have cute professional jargon for it:\ncalendar the deadline\n. This sort of thing happens all the time. I’ve personally witnessed it and something similar happened in the Vic Mignogna case. Most lawyers, even very highly credentialed lawyers from very expensive law firms, take a disturbingly blase approach to deadlines, mostly because the established case law permits them to redefine clearly fixed time frames as indefinite periods that are entirely at the judge’s discretion.\nOf course, the fact that it is reprehensibly stupid to proactively rely upon the judge being lax about deadlines never occurs to them. We are always careful to prepare our filings as soon as possible, and to file them several days ahead of time, in order to not provide a potentially adversarial judge an excuse to rule against us. Never wait until the last minute!\nAnd on a not-unrelated note, the VFM, the Rubble-bouncers, and the Reprehensibles should be prepared to act very quickly when the Legion’s next campaign is announced tonight around 6:30 PM Eastern. I’ll send out emails, put up a post, and do a Darkstream once the link is live. The amount is irrelevant, as the objective is to establish standing for as many of you as possible. Now, don’t play Smart Boy and demonstrate how much you know about what’s going on here in the comments, but do feel free to indicate if you’re in on this one.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-28T12:14:46+00:00"
}