{
  "url": "https://voxday.net/2019/10/02/signs-of-the-storm/",
  "scraped_at": "2025-12-21T03:00:27.658874",
  "title": "Signs of the Storm",
  "date_display": "October 2, 2019",
  "date_iso": "2019-10-02T10:04:29+00:00",
  "date_from_url": "2019-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We can see that the Democrats and the media are in full panic mode with the desperation of their toothless attacks on the God-Emperor. What we don’t know is why. <a href=\"https://www.foxnews.com/media/democrats-ig-report-spying\">It may be due</a> to the way in which the Obama administration is being shown to have colluded with various foreign governments while it engaged in illegal spying on the Trump campaign.</p><blockquote><p>As Democrats ramp up their impeachment efforts against President Trump, Fox News contributor Dan Bongino said the party is starting to panic at the possibility of being linked to illegal spying, as the Department of Justice inspector general prepares to release his report on the matter.</p><p>“It’s never going to stop. I mean, the republic is dying a slow death,” he said Monday on “Fox &amp; Friends.” “We’re on life support here… They’re panicking because the IG report’s about to come out, which is about to expose a massive government spying operation against Donald Trump.</p><p>“Here’s the key takeaway — in collusion with foreign governments,” Bongino continued. “That’s why they’re panicking. And they’re panicking because… what the Obama administration did is 1,000 times worse than what they’re alleging Donald Trump did.”</p></blockquote><p>The fact that a senior Twitter executive <a href=\"https://www.middleeasteye.net/news/twitter-executive-also-part-time-officer-uk-army-psychological-warfare-unit\">has been exposed as British military intelligence</a> isn’t going to make it harder for the American public to believe that these various agents of the Deep State committed treason. Gordon McMillan, Twitter’s Head of Editorial for Europe, the Middle East, and Africa, is a reserve captain in the 77th Brigade, the British Army’s psyops unit.</p><blockquote><p>The 77th Brigade uses social media platforms such as Twitter, Instagram and Facebook, as well as podcasts, data analysis and audience research to wage what the head of the UK military, General Nick Carter, describes as “information warfare”.</p><p>Carter says the 77th Brigade is giving the British military “the capability to compete in the war of narratives at the tactical level”; to shape perceptions of conflict. Some soldiers who have served with the unit say they have been engaged in operations intended to change the behaviour of target audiences…. The 77th Brigade’s headquarters is located west of London. It brought together a number of existing military units such as the Media Operations Group and the 15 Psychological Operations Group.</p><p>The British army’s website describes the 77th Brigade as “an agent of change” which aims to “challenge the difficulties of modern warfare using non-lethal engagement and legitimate non-military levers as a means to adapt behaviours of the opposing forces and adversaries”.</p></blockquote><p>We learn more and more about the corruption of the USA every day. This is why President Trump’s popularity is steadily growing.</p></div>",
  "content_text": "We can see that the Democrats and the media are in full panic mode with the desperation of their toothless attacks on the God-Emperor. What we don’t know is why.\nIt may be due\nto the way in which the Obama administration is being shown to have colluded with various foreign governments while it engaged in illegal spying on the Trump campaign.\nAs Democrats ramp up their impeachment efforts against President Trump, Fox News contributor Dan Bongino said the party is starting to panic at the possibility of being linked to illegal spying, as the Department of Justice inspector general prepares to release his report on the matter.\n“It’s never going to stop. I mean, the republic is dying a slow death,” he said Monday on “Fox & Friends.” “We’re on life support here… They’re panicking because the IG report’s about to come out, which is about to expose a massive government spying operation against Donald Trump.\n“Here’s the key takeaway — in collusion with foreign governments,” Bongino continued. “That’s why they’re panicking. And they’re panicking because… what the Obama administration did is 1,000 times worse than what they’re alleging Donald Trump did.”\nThe fact that a senior Twitter executive\nhas been exposed as British military intelligence\nisn’t going to make it harder for the American public to believe that these various agents of the Deep State committed treason. Gordon McMillan, Twitter’s Head of Editorial for Europe, the Middle East, and Africa, is a reserve captain in the 77th Brigade, the British Army’s psyops unit.\nThe 77th Brigade uses social media platforms such as Twitter, Instagram and Facebook, as well as podcasts, data analysis and audience research to wage what the head of the UK military, General Nick Carter, describes as “information warfare”.\nCarter says the 77th Brigade is giving the British military “the capability to compete in the war of narratives at the tactical level”; to shape perceptions of conflict. Some soldiers who have served with the unit say they have been engaged in operations intended to change the behaviour of target audiences…. The 77th Brigade’s headquarters is located west of London. It brought together a number of existing military units such as the Media Operations Group and the 15 Psychological Operations Group.\nThe British army’s website describes the 77th Brigade as “an agent of change” which aims to “challenge the difficulties of modern warfare using non-lethal engagement and legitimate non-military levers as a means to adapt behaviours of the opposing forces and adversaries”.\nWe learn more and more about the corruption of the USA every day. This is why President Trump’s popularity is steadily growing.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-02T09:04:29+00:00"
}