{
  "url": "https://voxday.net/2019/10/16/the-dark-ages-new-and-improved/",
  "scraped_at": "2025-12-21T03:01:54.040917",
  "title": "The Dark Ages, new and improved!",
  "date_display": "October 16, 2019",
  "date_iso": "2019-10-16T09:25:27+00:00",
  "date_from_url": "2019-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Z-man doesn’t get the etymological origin of the term “Dark Ages” quite right, but <a href=\"https://thezman.com/wordpress/?p=18858\">he raises a good question</a> about whether the West has already entered another one:</p><blockquote><p>That’s a good point to wonder if the West has not already entered a new dark age, in which superstition rules over rationality. The concept of the microaggression is something superstitious people living in a dark age would have understood. After all, a microaggression is the idea that certain words and phrases, incantations, will cause a miasma to develop around the people saying and hearing the words. This miasma or evil spirit will cause those exposed to react involuntarily and uncontrollably.</p><p>In fact, everything about political correctness and multiculturalism relies on oogily-boogily that people in the dark age of Europe would have found ridiculous. The people of Europe in the middle ages may not have had a sophisticated understanding of the natural world, but they did not think the dirt had magical qualities. Magic Dirt Theory would have struck them as laughably ridiculous. They may not have understood cognitive science, but they knew the apple does not fall far from the tree.</p></blockquote><p>As I explained in TIA, Petrarch’s term was the reversal of an earlier Christian perspective of the time before the coming of the Light of the World by an embittered Italian patriot looking at the ruins of the Roman Empire and despairing of the relatively barbaric German domination of his time.</p><p>Which is hauntingly similar to the situation which the people of the West may soon be facing. That is why it is so important to preserve knowledge now. Barbarians have never cared about building or minded living amidst filth, which is why we are already at the point where the fate of our indoor plumbing is in doubt.</p><p>It’s not enough to know about things. It’s not even enough to know how to maintain them. It is vital to learn how to design, develop, and build things if civilized society is to be preserved. We’re already bringing back <a href=\"https://www.indiegogo.com/projects/the-junior-classics/x/22400312?create_edit=true#/\">the Junior Classics</a>, but perhaps we also need to create a new series, Core Civilization, comprised of books that teach the core basics of everything from architecture to gardening and water engineering. Because it’s clearly time to begin thinking <a href=\"https://thezman.com/wordpress/?p=18856\">about these things</a>.</p><blockquote class=\"tr_bq\"><p>I started to think about those people living in the Roman Empire wondering why the water no longer comes from the big stone thingy anymore. Some may have remembered their ancestors working on them for some reason, but they no longer recall why. The people who knew how and why those aqueducts worked were long gone. No one was around who could figure out how to make them work again, because they lacked the capacity to do it.</p></blockquote></div>",
  "content_text": "The Z-man doesn’t get the etymological origin of the term “Dark Ages” quite right, but\nhe raises a good question\nabout whether the West has already entered another one:\nThat’s a good point to wonder if the West has not already entered a new dark age, in which superstition rules over rationality. The concept of the microaggression is something superstitious people living in a dark age would have understood. After all, a microaggression is the idea that certain words and phrases, incantations, will cause a miasma to develop around the people saying and hearing the words. This miasma or evil spirit will cause those exposed to react involuntarily and uncontrollably.\nIn fact, everything about political correctness and multiculturalism relies on oogily-boogily that people in the dark age of Europe would have found ridiculous. The people of Europe in the middle ages may not have had a sophisticated understanding of the natural world, but they did not think the dirt had magical qualities. Magic Dirt Theory would have struck them as laughably ridiculous. They may not have understood cognitive science, but they knew the apple does not fall far from the tree.\nAs I explained in TIA, Petrarch’s term was the reversal of an earlier Christian perspective of the time before the coming of the Light of the World by an embittered Italian patriot looking at the ruins of the Roman Empire and despairing of the relatively barbaric German domination of his time.\nWhich is hauntingly similar to the situation which the people of the West may soon be facing. That is why it is so important to preserve knowledge now. Barbarians have never cared about building or minded living amidst filth, which is why we are already at the point where the fate of our indoor plumbing is in doubt.\nIt’s not enough to know about things. It’s not even enough to know how to maintain them. It is vital to learn how to design, develop, and build things if civilized society is to be preserved. We’re already bringing back\nthe Junior Classics\n, but perhaps we also need to create a new series, Core Civilization, comprised of books that teach the core basics of everything from architecture to gardening and water engineering. Because it’s clearly time to begin thinking\nabout these things\n.\nI started to think about those people living in the Roman Empire wondering why the water no longer comes from the big stone thingy anymore. Some may have remembered their ancestors working on them for some reason, but they no longer recall why. The people who knew how and why those aqueducts worked were long gone. No one was around who could figure out how to make them work again, because they lacked the capacity to do it.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-16T08:25:27+00:00"
}