{
  "url": "https://voxday.net/2019/10/10/the-cost-of-money/",
  "scraped_at": "2025-12-21T03:01:28.376985",
  "title": "The cost of money",
  "date_display": "October 10, 2019",
  "date_iso": "2019-10-10T11:26:13+00:00",
  "date_from_url": "2019-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>World of Warcraft Designer/Producer Mark Kern’s explanation of <a href=\"https://boundingintocomics.com/2019/10/09/world-of-warcraft-vanilla-team-lead-mark-kern-explains-why-he-joined-boycottblizzard/\">why he has severed himself from all things Blizzard</a> illustrates why I never seek large investments from anyone in any of my projects:</p><blockquote><p>This hurts. But until Blizzard reverses their decision on @blitzchungHS I am giving up playing Classic WoW, which I helped make and helped convince Blizzard to relaunch. There will be no Mark of Kern guild after all.</p><p>Let me explain why I am #BoycottBlizzard</p><p>I am ethnically Chinese. I was born in Taiwan and I lived in Hong Kong for a time. I have done business with China for many years, with several gaming companies there. So I think I have a valid perspective here, having been a Team Lead at Blizzard and having grown up in Asia.</p><p>I have watched China slowly take over as the dominant investing force in gaming and movies over the years. It’s a shame US companies never believed as strongly as China and Asia in investing in games, but this allowed China to have unprecedented influence over our media.</p><p>Chinese game companies have grown huge not just because of market size, but because the government subsidizes them. They get free land, free offices, and huge infusions of cash. This cash was and is used to do expand and buy up stakes in US gaming companies.</p><p>I’ve seen firsthand the corruption of Chinese gaming companies, and I was removed from a company I founded (after Blizzard) for refusing to take a 2 million dollar kickback bribe to take an investment from China. This is the first time I’ve ever spoken publicly about it. I’ve also seen how American company reps in China have been offered similar bribes to get licenses for large AAA titles. Not everyone refused like I did.</p><p>Unfortunately, US and European companies are loath to take risks and invest in game companies legally as much as China was. China remained one of the few places mid-tier studios could get funding. So again, China influence grew. I’m sure this is the same for movies as well.</p></blockquote><p>I understand Mark’s perspective and I respect his stand. He’s a good guy, a smart game designer, and a man of principle. That being said, I absolutely consider the Chinese influence to be vastly preferable to the alternative with which they are competing. A competing civilizational alternative to Western civilization may not be ideal, but it is almost infinitely better than pure satanic inversion.</p><p>Remember, the Chinese response is a <i>reaction </i>to the subversive cultural invasion of <i>their </i>civilization. It is an aggressive form of civilizational self-defense. Rather than permit their invaders a safe base from which to stage their attacks, they are attacking the bases from which the invasion stems. Given this observation, I very much doubt it will be long before a Chinese company acquires one of the Big Five media companies.</p><p>And let’s face it. They couldn’t have screwed up Star Wars any worse than the Devil Mouse has.</p></div>",
  "content_text": "World of Warcraft Designer/Producer Mark Kern’s explanation of\nwhy he has severed himself from all things Blizzard\nillustrates why I never seek large investments from anyone in any of my projects:\nThis hurts. But until Blizzard reverses their decision on @blitzchungHS I am giving up playing Classic WoW, which I helped make and helped convince Blizzard to relaunch. There will be no Mark of Kern guild after all.\nLet me explain why I am #BoycottBlizzard\nI am ethnically Chinese. I was born in Taiwan and I lived in Hong Kong for a time. I have done business with China for many years, with several gaming companies there. So I think I have a valid perspective here, having been a Team Lead at Blizzard and having grown up in Asia.\nI have watched China slowly take over as the dominant investing force in gaming and movies over the years. It’s a shame US companies never believed as strongly as China and Asia in investing in games, but this allowed China to have unprecedented influence over our media.\nChinese game companies have grown huge not just because of market size, but because the government subsidizes them. They get free land, free offices, and huge infusions of cash. This cash was and is used to do expand and buy up stakes in US gaming companies.\nI’ve seen firsthand the corruption of Chinese gaming companies, and I was removed from a company I founded (after Blizzard) for refusing to take a 2 million dollar kickback bribe to take an investment from China. This is the first time I’ve ever spoken publicly about it. I’ve also seen how American company reps in China have been offered similar bribes to get licenses for large AAA titles. Not everyone refused like I did.\nUnfortunately, US and European companies are loath to take risks and invest in game companies legally as much as China was. China remained one of the few places mid-tier studios could get funding. So again, China influence grew. I’m sure this is the same for movies as well.\nI understand Mark’s perspective and I respect his stand. He’s a good guy, a smart game designer, and a man of principle. That being said, I absolutely consider the Chinese influence to be vastly preferable to the alternative with which they are competing. A competing civilizational alternative to Western civilization may not be ideal, but it is almost infinitely better than pure satanic inversion.\nRemember, the Chinese response is a\nreaction\nto the subversive cultural invasion of\ntheir\ncivilization. It is an aggressive form of civilizational self-defense. Rather than permit their invaders a safe base from which to stage their attacks, they are attacking the bases from which the invasion stems. Given this observation, I very much doubt it will be long before a Chinese company acquires one of the Big Five media companies.\nAnd let’s face it. They couldn’t have screwed up Star Wars any worse than the Devil Mouse has.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-10T10:26:13+00:00"
}