{
  "url": "https://voxday.net/2019/10/26/the-reason-the-gop-establishment-supports-impeachment/",
  "scraped_at": "2025-12-21T03:03:05.257623",
  "title": "The reason the GOP establishment supports impeachment",
  "date_display": "October 26, 2019",
  "date_iso": "2019-10-26T09:41:22+00:00",
  "date_from_url": "2019-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They are desperate to stop President Trump and his men from uncovering <a href=\"https://truepundit.com/gop-senator-drops-bomb-foster-kids-are-being-sold-into-sex-slavery/\">their crimes against children</a>:</p><blockquote><p>The names of some of the largest GOP critics of President Donald Trump are surfacing in the investigation of a politician indicted on charges of fraud, human smuggling, selling children, forgery, conspiracy and ripping off the Arizona Health Care Cost Containment System. GOP critics of President Trump, including former US Sen. Jeff Flake, late Sen. John McCain, and Sen. Mitt Romney among others are linked to suspect Paul Petersen. Petersen also campaigned for and is friends with Arizona Gov. Goug Ducey and other politicians, according to records and sources.</p><p>But back to the NEW bombshell allegations coming, again, out of Arizona.</p><p>The Arizona Senator Farnsworth said that he has been looking into how DCS “lost” more than 550 children last year, roughly half of whom are categorized as either runaways or otherwise missing. The rest appear to be flagged for paperwork errors.</p><p>He said he fears the children have been abducted and sold into a global sex trafficking ring, and said he has been holding meetings with DCS, critics of the agency and fellow lawmakers, including Brophy McGee.</p><p>Farnsworth said he didn’t believe DCS officials were actively selling children into sexual slavery, but that they are being lax at protecting children from predators who will do so.</p><p>While he said he hopes his meetings ultimately prove him wrong, Farnsworth said he is more convinced than ever that Arizona children removed from their parents and put into group homes or foster homes are being sex-trafficked.</p><p>“When I first heard about this, I believed that children from Arizona (DCS) were ending up in sex trafficking. Now, after the research I’ve done, I’m confident of it,” he said.</p></blockquote><p>I no longer trust ANY organization that says it is “for the children” or even expresses any particular interest in them at all. Increasingly, such organizations are filled with those who prey upon children in one way or another. Never forget, <i>predators always go where the prey is. </i></p></div>",
  "content_text": "They are desperate to stop President Trump and his men from uncovering\ntheir crimes against children\n:\nThe names of some of the largest GOP critics of President Donald Trump are surfacing in the investigation of a politician indicted on charges of fraud, human smuggling, selling children, forgery, conspiracy and ripping off the Arizona Health Care Cost Containment System. GOP critics of President Trump, including former US Sen. Jeff Flake, late Sen. John McCain, and Sen. Mitt Romney among others are linked to suspect Paul Petersen. Petersen also campaigned for and is friends with Arizona Gov. Goug Ducey and other politicians, according to records and sources.\nBut back to the NEW bombshell allegations coming, again, out of Arizona.\nThe Arizona Senator Farnsworth said that he has been looking into how DCS “lost” more than 550 children last year, roughly half of whom are categorized as either runaways or otherwise missing. The rest appear to be flagged for paperwork errors.\nHe said he fears the children have been abducted and sold into a global sex trafficking ring, and said he has been holding meetings with DCS, critics of the agency and fellow lawmakers, including Brophy McGee.\nFarnsworth said he didn’t believe DCS officials were actively selling children into sexual slavery, but that they are being lax at protecting children from predators who will do so.\nWhile he said he hopes his meetings ultimately prove him wrong, Farnsworth said he is more convinced than ever that Arizona children removed from their parents and put into group homes or foster homes are being sex-trafficked.\n“When I first heard about this, I believed that children from Arizona (DCS) were ending up in sex trafficking. Now, after the research I’ve done, I’m confident of it,” he said.\nI no longer trust ANY organization that says it is “for the children” or even expresses any particular interest in them at all. Increasingly, such organizations are filled with those who prey upon children in one way or another. Never forget,\npredators always go where the prey is.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-10-26T08:41:22+00:00"
}