{
  "url": "https://voxday.net/2017/07/23/diasporans-cucks-and-free-speec/",
  "scraped_at": "2025-12-18T07:23:45.630765",
  "title": "Diasporans, cucks, and free speech",
  "date_display": "July 23, 2017",
  "date_iso": "2017-07-23T12:00:00+00:00",
  "date_from_url": "2017-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a bit disjointed, but that is an unavoidable consequence of the second article’s lurching from one topic to another. First, demographics has its consequences: the inevitable divide between increasingly religious right-wing Israelis and increasingly secular left-wing Diasporans in the US is growing, <a href=\"http://www.haaretz.com/israel-news/1.802602\">if Haaretz is to be believed</a>.</p><blockquote><p> The basis for Netanyahu’s diplomatic activism is his assessment that America is growing weaker and gradually withdrawing from the Middle East. The visit to Haifa Port by the aircraft carrier George H. W. Bush, the first such visit since the beginning of the second intifada, doesn’t change the overall trend.</p><p>Oil is cheaper, and America no longer depends on the Middle East for its supply. Public opinion is isolationist, opposed to wars far from home. America’s internal rifts are deep and getting wider, and Netanyahu has taken the conservative side without even a pretense of bipartisanism. Perhaps bipartisan support is no longer even possible when Americans are so divided over everything. It’s better to have the Republicans’ support, since their control of Congress seems unassailable.</p><p>Netanyahu sees the Christian community as Israel’s most important bastion of support in America, alongside Orthodox Jews. His recent decisions against the Reform and Conservative movements – canceling the Western Wall deal and advancing the conversion bill – reflect a strategic disengagement from liberal American Jews.</p><p>This wasn’t a caprice caused by momentary pressure from Israel’s ultra-Orthodox parties, but a calculated decision that won almost wall-to-wall support in the cabinet. Netanyahu’s circle sees liberal Jewry as a transient phenomenon that will disappear on its own in another generation due to intermarriage and disinterest in Jewish tradition or Israel.</p><p>For years, liberal Jews have threatened to break with Israel if it continues discriminating against their denominations, and some have also vocally opposed the unending occupation of the territories. They didn’t expect a right-wing Israeli government to break with them first.</p></blockquote><p>Whether the divide is real or not – and it probably is, many liberal Diasporans hate Netanyahu as much as they hate Trump – Netanyahu would be well-advised to rein in AIPAC and encourage the Israel Firsters in the U.S. Senate and Congress to abandon the proposed anti-American law S. 720, presently co-sponsored by 43 U.S. Senators of both parties, and supported by 234 Representatives. It is a tone-deaf action that is absolutely guaranteed to backfire on Israel… unless Netanyahu is playing a deep game and intends to make life in the USA less comfortable for the diaspora.</p><p>Amazingly, even the pro-Israel cucks at National Review <a href=\"http://www.nationalreview.com/article/449733/boycott-divest-sanction-senate-bill-720-free-speech-conservatives-the-left\">understand that the proposed law is a terrible idea</a>, and to their credit, have come out against it. Of course, they couldn’t help but try to take the opportunity to tangent into taking shots at the pro-free speech Alt-Lite in the meantime.</p><blockquote><p> Sometimes in the course of our political life, someone proposes something so mind-bogglingly stupid that it’s hard to know exactly what to say about it. Senate Bill 720 is one of those things. Over the past few years, a small but prominent movement has cropped up, using the age-old tactic of boycott to protest what it sees as Israel’s unjust occupation of territories that are assumed to belong rightfully to the Palestinians. Called “BDS” (boycott, divest, sanction) after the strategy it employs against the state of Israel and goods produced therein, it has acquired a certain notoriety on college campuses, not least for its uncomfortable associations with veritable anti-Semites.</p><p>Israel’s supporters in the Senate, justifiably seeing this as a problem, have come up with an innovative solution: Make participation in BDS or other boycotts of Israel a felony, punishable by enormous fines and up to two decades in prison. The Israel Anti-Boycott Act enjoys remarkable bipartisan support: It’s not often you can get Ted Cruz and Ben Sasse to sign onto a measure alongside Chuck Schumer and Kirsten Gillibrand. Its proponents number 43 in the Senate and 234 in the House….</p><p>And, yes, when it comes to Mike Cernovich and Milo Yiannopoulos or Tomi Lahren, that’s more or less correct; they really are distasteful hypocrites who care not one bit about free speech and who use the principle instead to advance their particular cause. They are of the new breed of conservatism that views its primary goal as melting special snowflakes and doesn’t give much of a damn about anything beyond that. But we knew that already; we’ve always known they’re unprincipled actors seeking only to aggrandize themselves.</p><p>Their silence on Lisa Durden tells us nothing new or interesting about their character. Their place in the intellectual debate over free speech is marginal in any case, and what really matters is not what they think but what the more rational, principled minds of the Right and center say.</p></blockquote><p>I tend to suspect their “silence on Lisa Durden” is because a) what is an Essex College? and b) who is <strike>Tyler </strike>Lisa Durden? There are massive violations of free speech every single day; most of us are far more concerned about Patreon shutting down Lauren Southern and Brittany Pettibone for their defense of Europe than we are about some employee of a minor college that no one has ever heard of being held accountable by her employer. Why aren’t these more rational, principled minds of the right and center speaking out against Patreon? I guess they must be distasteful hypocrites who care not one bit about free speech….</p><p>And it is downright bizarre to see <i>National Review</i> – NATIONAL REVIEW – questioning the principles of others who actually fight the Left when their only observed principles involve a) gracefully going down to noble defeat and b) not overly upsetting the editorial page of the <i>New York Times</i>. But to return to the point, if you’ve lost the cucks, you’ve lost everyone.</p><p>The Alt-Right is inevitable, even in Israel, as it is in every nation that wishes to survive the 21st century.</p></div>",
  "content_text": "This is a bit disjointed, but that is an unavoidable consequence of the second article’s lurching from one topic to another. First, demographics has its consequences: the inevitable divide between increasingly religious right-wing Israelis and increasingly secular left-wing Diasporans in the US is growing,\nif Haaretz is to be believed\n.\nThe basis for Netanyahu’s diplomatic activism is his assessment that America is growing weaker and gradually withdrawing from the Middle East. The visit to Haifa Port by the aircraft carrier George H. W. Bush, the first such visit since the beginning of the second intifada, doesn’t change the overall trend.\nOil is cheaper, and America no longer depends on the Middle East for its supply. Public opinion is isolationist, opposed to wars far from home. America’s internal rifts are deep and getting wider, and Netanyahu has taken the conservative side without even a pretense of bipartisanism. Perhaps bipartisan support is no longer even possible when Americans are so divided over everything. It’s better to have the Republicans’ support, since their control of Congress seems unassailable.\nNetanyahu sees the Christian community as Israel’s most important bastion of support in America, alongside Orthodox Jews. His recent decisions against the Reform and Conservative movements – canceling the Western Wall deal and advancing the conversion bill – reflect a strategic disengagement from liberal American Jews.\nThis wasn’t a caprice caused by momentary pressure from Israel’s ultra-Orthodox parties, but a calculated decision that won almost wall-to-wall support in the cabinet. Netanyahu’s circle sees liberal Jewry as a transient phenomenon that will disappear on its own in another generation due to intermarriage and disinterest in Jewish tradition or Israel.\nFor years, liberal Jews have threatened to break with Israel if it continues discriminating against their denominations, and some have also vocally opposed the unending occupation of the territories. They didn’t expect a right-wing Israeli government to break with them first.\nWhether the divide is real or not – and it probably is, many liberal Diasporans hate Netanyahu as much as they hate Trump – Netanyahu would be well-advised to rein in AIPAC and encourage the Israel Firsters in the U.S. Senate and Congress to abandon the proposed anti-American law S. 720, presently co-sponsored by 43 U.S. Senators of both parties, and supported by 234 Representatives. It is a tone-deaf action that is absolutely guaranteed to backfire on Israel… unless Netanyahu is playing a deep game and intends to make life in the USA less comfortable for the diaspora.\nAmazingly, even the pro-Israel cucks at National Review\nunderstand that the proposed law is a terrible idea\n, and to their credit, have come out against it. Of course, they couldn’t help but try to take the opportunity to tangent into taking shots at the pro-free speech Alt-Lite in the meantime.\nSometimes in the course of our political life, someone proposes something so mind-bogglingly stupid that it’s hard to know exactly what to say about it. Senate Bill 720 is one of those things. Over the past few years, a small but prominent movement has cropped up, using the age-old tactic of boycott to protest what it sees as Israel’s unjust occupation of territories that are assumed to belong rightfully to the Palestinians. Called “BDS” (boycott, divest, sanction) after the strategy it employs against the state of Israel and goods produced therein, it has acquired a certain notoriety on college campuses, not least for its uncomfortable associations with veritable anti-Semites.\nIsrael’s supporters in the Senate, justifiably seeing this as a problem, have come up with an innovative solution: Make participation in BDS or other boycotts of Israel a felony, punishable by enormous fines and up to two decades in prison. The Israel Anti-Boycott Act enjoys remarkable bipartisan support: It’s not often you can get Ted Cruz and Ben Sasse to sign onto a measure alongside Chuck Schumer and Kirsten Gillibrand. Its proponents number 43 in the Senate and 234 in the House….\nAnd, yes, when it comes to Mike Cernovich and Milo Yiannopoulos or Tomi Lahren, that’s more or less correct; they really are distasteful hypocrites who care not one bit about free speech and who use the principle instead to advance their particular cause. They are of the new breed of conservatism that views its primary goal as melting special snowflakes and doesn’t give much of a damn about anything beyond that. But we knew that already; we’ve always known they’re unprincipled actors seeking only to aggrandize themselves.\nTheir silence on Lisa Durden tells us nothing new or interesting about their character. Their place in the intellectual debate over free speech is marginal in any case, and what really matters is not what they think but what the more rational, principled minds of the Right and center say.\nI tend to suspect their “silence on Lisa Durden” is because a) what is an Essex College? and b) who is\nTyler\nLisa Durden? There are massive violations of free speech every single day; most of us are far more concerned about Patreon shutting down Lauren Southern and Brittany Pettibone for their defense of Europe than we are about some employee of a minor college that no one has ever heard of being held accountable by her employer. Why aren’t these more rational, principled minds of the right and center speaking out against Patreon? I guess they must be distasteful hypocrites who care not one bit about free speech….\nAnd it is downright bizarre to see\nNational Review\n– NATIONAL REVIEW – questioning the principles of others who actually fight the Left when their only observed principles involve a) gracefully going down to noble defeat and b) not overly upsetting the editorial page of the\nNew York Times\n. But to return to the point, if you’ve lost the cucks, you’ve lost everyone.\nThe Alt-Right is inevitable, even in Israel, as it is in every nation that wishes to survive the 21st century.",
  "tags": [
    "cuckservative",
    "media",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-23T11:00:00+00:00"
}