{
  "url": "https://voxday.net/2017/07/21/do-talk-to-media/",
  "scraped_at": "2025-12-18T07:23:28.425956",
  "title": "DO talk to the media?",
  "date_display": "July 21, 2017",
  "date_iso": "2017-07-21T12:00:00+00:00",
  "date_from_url": "2017-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I initially turned it down, after consulting with Mike Cernovich, I decided to accept a request from a <i>Rolling Stone</i> reporter to do an interview concerning “a profile of Castalia House—particularly its success in sci fi and fantasy.”</p><p>Why do this after repeatedly instructing people to not talk to the media? Isn’t it hypocritical? Allow me to explain.</p><p>First, there is a massive difference between being used as filler to support an existing narrative and simply marketing one’s products. I have turned down dozens of interview requests this year. I expect to turn down even more over the second part of the year. If this reporter tries to pull a bait-and-switch like other reporters, such as David Pakman and Amy Wallace, have done before, I’m simply not going to answer those questions. I am there to talk about Castalia House, its books, and its authors. I’m not there to discuss the Alt-Right position on immigration.</p><p>(That being said, I still enjoy this quote from Wallace’s piece: “Having a conversation with Day feels sort of like walking around a room designed by M. C. Escher.” If nothing else, that should suffice to explain the concept of the 2SD communications gap.)</p><p>Second, as the Lead Editor of Castalia House, I have a professional responsibility to talk to the media about our books, and given the 100-percent year-on-year growth we have averaged for three years, it’s not surprising that the media has begun to become aware of our existence. I am not personally interested in talking to the media or becoming a public figure, nor, as an editor, is that a likely consequence. It is the books that are the compelling subject, not me or my political, religious, or sporting beliefs.</p><p>Third, the most interesting narratives about Castalia House do not involve the fact that one of its editors are Alt-Right. We have world-class authors from across the political spectrum publishing with us, from Steve Keen and Martin van Creveld on the Left to Vox Day and Tara McCarthy on the Right. We have first-rate scientists, such as Dr. Sarah Salviander and Dr. Christopher Hallpike. We have authors from around the world publishing with us, everywhere from Israel and Japan and Singapore to the UK, France, and the USA.</p><p>Fourth, as Mike pointed out, <i>Rolling Stone</i> is one of the few media institutions that is sufficiently important to our potential readers to justify spending the time. Few media institutions are interested in books, after all.</p><p>And fifth, even if it is a hit piece, what are they going to say? That our books suck? That’s laughable, as even a cursory glance at the Amazon reviews will suffice to show. That they’re all Nazi Nazi tomes written by Nazis? That’s absurd on its face. Charles Stross alone publishes more about Nazis than all the Castalia House authors combined. That we’re a sophisticated institution of unmitigated right-wing evil run by highly intelligent individuals who are actively engaged in the literary cultural wars?</p><p>You know, I tend to think we can live with that, said the Supreme Dark Lord of the Evil Legion of Evil.</p></div>",
  "content_text": "Although I initially turned it down, after consulting with Mike Cernovich, I decided to accept a request from a\nRolling Stone\nreporter to do an interview concerning “a profile of Castalia House—particularly its success in sci fi and fantasy.”\nWhy do this after repeatedly instructing people to not talk to the media? Isn’t it hypocritical? Allow me to explain.\nFirst, there is a massive difference between being used as filler to support an existing narrative and simply marketing one’s products. I have turned down dozens of interview requests this year. I expect to turn down even more over the second part of the year. If this reporter tries to pull a bait-and-switch like other reporters, such as David Pakman and Amy Wallace, have done before, I’m simply not going to answer those questions. I am there to talk about Castalia House, its books, and its authors. I’m not there to discuss the Alt-Right position on immigration.\n(That being said, I still enjoy this quote from Wallace’s piece: “Having a conversation with Day feels sort of like walking around a room designed by M. C. Escher.” If nothing else, that should suffice to explain the concept of the 2SD communications gap.)\nSecond, as the Lead Editor of Castalia House, I have a professional responsibility to talk to the media about our books, and given the 100-percent year-on-year growth we have averaged for three years, it’s not surprising that the media has begun to become aware of our existence. I am not personally interested in talking to the media or becoming a public figure, nor, as an editor, is that a likely consequence. It is the books that are the compelling subject, not me or my political, religious, or sporting beliefs.\nThird, the most interesting narratives about Castalia House do not involve the fact that one of its editors are Alt-Right. We have world-class authors from across the political spectrum publishing with us, from Steve Keen and Martin van Creveld on the Left to Vox Day and Tara McCarthy on the Right. We have first-rate scientists, such as Dr. Sarah Salviander and Dr. Christopher Hallpike. We have authors from around the world publishing with us, everywhere from Israel and Japan and Singapore to the UK, France, and the USA.\nFourth, as Mike pointed out,\nRolling Stone\nis one of the few media institutions that is sufficiently important to our potential readers to justify spending the time. Few media institutions are interested in books, after all.\nAnd fifth, even if it is a hit piece, what are they going to say? That our books suck? That’s laughable, as even a cursory glance at the Amazon reviews will suffice to show. That they’re all Nazi Nazi tomes written by Nazis? That’s absurd on its face. Charles Stross alone publishes more about Nazis than all the Castalia House authors combined. That we’re a sophisticated institution of unmitigated right-wing evil run by highly intelligent individuals who are actively engaged in the literary cultural wars?\nYou know, I tend to think we can live with that, said the Supreme Dark Lord of the Evil Legion of Evil.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-21T11:00:00+00:00"
}