{
  "url": "https://voxday.net/2017/07/11/doesnt-anyone-know-how-to-play-this-game/",
  "scraped_at": "2025-12-18T07:22:03.111232",
  "title": "Doesn’t anyone know how to play this game?",
  "date_display": "July 11, 2017",
  "date_iso": "2017-07-11T08:21:00+00:00",
  "date_from_url": "2017-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer <a href=\"https://www.unz.com/isteve/vox-proves-trump-lies-by-citing-a-trump-truth/\">busts the Other Vox</a>:</p><blockquote><p> From Vox, an article about factchecking that starts with an un-factchecked falsehood:</p><p><i>Trump supporters know Trump lies. They just don’t care.</i><br> <i>A new study explains the psychological power — and hard limits — of fact-checking journalism.</i><br> <i>   </i><br> <i>During the campaign — and into his presidency — Donald Trump repeatedly exaggerated and distorted crime statistics. “Decades of progress made in bringing down crime are now being reversed,” he asserted in his dark speech at the Republican National Convention in July 2016. But the data here is unambiguous: FBI statistics show crime has been going down for decades. </i></br></br></br></p><p>Uh, the liberal Brennan Center estimated back in April 2017 that the homicide rate (the most reliable crime rate) was nationally 19% higher in 2016 than in 2014 and up 29% in the 30 biggest cities.</p></blockquote><p>Media “fact-checking” is a perfect example of pseudo-dialectic. It’s framed in the style of dialectic, and pretends to be an objective appeal to the truth, but it is actually nothing more than disguised rhetoric meant to manipulate the emotions of the reader. Which, of course, is why it is almost entirely ineffective. The “hard limits” are the result of their “facts” being incongruous with observable reality and the truth as the target perceives it.</p><p>The problem most people have in understanding the difference between rhetoric and dialectic, let alone grasping the concept of pseudo-dialectic, is that they are philosophically monolingual. Consider, for example, Jagi Lamplighter’s typically dialectic disdain for rhetoric.</p><blockquote><p> The problem with Rhetoric is…it cannot stand up against reality. It is only useful for persuading sheep. Worse, when a person is persuaded by rhetoric, he will change his mind as soon as someone comes along with snazzier rhetoric.</p><p>The advantage of dialectic is when someone is persuaded by reason, they stay persuaded.</p><p>Vox is a bright and brave man with brilliant ideas. He is so smart that much of what he understands, most people cannot follow—and that is a harsh and lonely way to live.</p><p>But that doesn’t mean that he can’t use his brilliance to learn how to present real arguments in a simple and concise manner that the masses can grasp.</p><p>This rhetoric nonsense is beneath him.</p></blockquote><p>But one might as reasonably claim that this Chinese nonsense is beneath the English speaker, <i>even when speaking to a Chinese-speaking audience</i>. Jagi’s faith in my ability to not only leap the IQ communications gap, but successfully reason with emotion-driven non-thinkers, is probably more flattering than she knows, but I can assure her, neither I nor anyone else in the course of human history has ever been sufficiently brilliant for that.</p><p>Remember, dialectic is a form of rhetoric. That sweet reason dialectic speakers value so highly is merely a subset of the art of persuasion, and moreover, it is <u>not</u> the only legitimate form. Rhetoric is not about truth and falsehood per se, but rather emotional content that can point towards the truth with falsehood as readily as it points towards falsehood with the truth. And, as I noted above, the more rhetoric points towards the recognized truth, the more effective it tends to be.</p></div>",
  "content_text": "Steve Sailer\nbusts the Other Vox\n:\nFrom Vox, an article about factchecking that starts with an un-factchecked falsehood:\nTrump supporters know Trump lies. They just don’t care.\nA new study explains the psychological power — and hard limits — of fact-checking journalism.\nDuring the campaign — and into his presidency — Donald Trump repeatedly exaggerated and distorted crime statistics. “Decades of progress made in bringing down crime are now being reversed,” he asserted in his dark speech at the Republican National Convention in July 2016. But the data here is unambiguous: FBI statistics show crime has been going down for decades.\nUh, the liberal Brennan Center estimated back in April 2017 that the homicide rate (the most reliable crime rate) was nationally 19% higher in 2016 than in 2014 and up 29% in the 30 biggest cities.\nMedia “fact-checking” is a perfect example of pseudo-dialectic. It’s framed in the style of dialectic, and pretends to be an objective appeal to the truth, but it is actually nothing more than disguised rhetoric meant to manipulate the emotions of the reader. Which, of course, is why it is almost entirely ineffective. The “hard limits” are the result of their “facts” being incongruous with observable reality and the truth as the target perceives it.\nThe problem most people have in understanding the difference between rhetoric and dialectic, let alone grasping the concept of pseudo-dialectic, is that they are philosophically monolingual. Consider, for example, Jagi Lamplighter’s typically dialectic disdain for rhetoric.\nThe problem with Rhetoric is…it cannot stand up against reality. It is only useful for persuading sheep. Worse, when a person is persuaded by rhetoric, he will change his mind as soon as someone comes along with snazzier rhetoric.\nThe advantage of dialectic is when someone is persuaded by reason, they stay persuaded.\nVox is a bright and brave man with brilliant ideas. He is so smart that much of what he understands, most people cannot follow—and that is a harsh and lonely way to live.\nBut that doesn’t mean that he can’t use his brilliance to learn how to present real arguments in a simple and concise manner that the masses can grasp.\nThis rhetoric nonsense is beneath him.\nBut one might as reasonably claim that this Chinese nonsense is beneath the English speaker,\neven when speaking to a Chinese-speaking audience\n. Jagi’s faith in my ability to not only leap the IQ communications gap, but successfully reason with emotion-driven non-thinkers, is probably more flattering than she knows, but I can assure her, neither I nor anyone else in the course of human history has ever been sufficiently brilliant for that.\nRemember, dialectic is a form of rhetoric. That sweet reason dialectic speakers value so highly is merely a subset of the art of persuasion, and moreover, it is\nnot\nthe only legitimate form. Rhetoric is not about truth and falsehood per se, but rather emotional content that can point towards the truth with falsehood as readily as it points towards falsehood with the truth. And, as I noted above, the more rhetoric points towards the recognized truth, the more effective it tends to be.",
  "tags": [
    "media",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-11T07:21:00+00:00"
}