{
  "url": "https://voxday.net/2017/07/28/dont-talk-to-media-ii/",
  "scraped_at": "2025-12-18T07:24:25.480536",
  "title": "Don’t talk to the media II",
  "date_display": "July 28, 2017",
  "date_iso": "2017-07-28T19:54:00+00:00",
  "date_from_url": "2017-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like many of us, Le Chateau has seen an increase in the amount of media requests of late, and is wondering <a href=\"https://heartiste.wordpress.com/2017/07/27/the-whores-of-pozzed-media-solicit-yours-truly/\">if he should reconsider his policy</a>:<br/></p><blockquote><p> I’ve been receiving an increasing frequency of emails from gaystream media whores soliciting this blog’s lordship for a roll in the clickbait hay. All of them, to date, have requested absolute privacy (the irony), so I won’t divulge details on threat of (((legal))) recriminations, but I can offer a general impression of what they’re asking. For instance, one media whore speaking on behalf of a well-known whoresite is part of a team putting together a piece of agitprop art on the manosphere and wanted CH’s scintillating contribution to the effort.</p><p>I’ve wondered for a few months how best to respond to these inquiries. So far, the CH policy has been to ignore and plow. No j/k, it’s been to ignore. Period. I never respond, partly because, what’s the use? I won’t persuade a shriek of shitlibs to accept in their hearts the Rude Word of the Chateau, and I certainly can’t expect to be treated fairly by these toads. More practically, I am very careful to guard my shadowy dimensions, and there is a risk, however muted through multiple proxies and TOR nodes, that a reply by me would be scoured for identifying info by a black ops team at Fusion GPS (stands for Grabbing Pussy Systems).</p><p>But the inquiries are getting more insistent and coming from bigger and bigger names. So I’m reconsidering my standard policy of ignoring them; perhaps for an upgrade to a “lol suck a dik” response? I have toyed with the idea of a conditional reply. That is, I set the ground rules and they swear by them in writing before I offer any penetrating insights of my tumescent wisdom.</p></blockquote><p><a href=\"http://www.milobookclub.com/2017/06/20/dont-talk-to-media/\">Short answer: no</a>. He should continue to reject ALL media requests.</p><p>Now, isn’t that hypocritical advice, considering that I just spent three hours having lunch with a reporter from <i>Rolling Stone</i> and other mainstream media institutions?</p><p>Well, to put it into perspective, that is the first request I have accepted in the last 50+ requests I have received. Furthermore, I have not spoken – in the sense of actually speaking via TV, radio, or telephone – to a single mainstream media reporter since I made the mistake of speaking to Amy Wallace of <i>Wired </i>back in 2015.</p><p>In other words, you can see it as hypocrisy or you can see it as a rare exception to the rule. I leave it to you to decide which scenario is more applicable.</p><p>As for the interview yesterday, I agreed to it after reading the reporter’s various articles and seeing that she was a smart and perceptive writer who was clearly more interested in getting to know the subject and presenting a compelling in-depth story than writing generic hit pieces upholding the current narrative. Not only that, but she was clearly willing to go to far greater lengths, and put in a lot more time and effort into a piece, than was necessary for anyone simply bolstering a preconceived narrative, even when the subject was someone for whom it was very difficult to have any sympathy.</p><p>Now, obviously we’ll see whether my decision was a foolish one or not when the story eventually runs in a few months, but there were no gotcha questions asked, and it was interesting to learn, in the course of the interview, that she correctly observed something about Castalia House’s protagonists that neither I nor anyone else had picked up upon before.</p></div>",
  "content_text": "Like many of us, Le Chateau has seen an increase in the amount of media requests of late, and is wondering\nif he should reconsider his policy\n:\nI’ve been receiving an increasing frequency of emails from gaystream media whores soliciting this blog’s lordship for a roll in the clickbait hay. All of them, to date, have requested absolute privacy (the irony), so I won’t divulge details on threat of (((legal))) recriminations, but I can offer a general impression of what they’re asking. For instance, one media whore speaking on behalf of a well-known whoresite is part of a team putting together a piece of agitprop art on the manosphere and wanted CH’s scintillating contribution to the effort.\nI’ve wondered for a few months how best to respond to these inquiries. So far, the CH policy has been to ignore and plow. No j/k, it’s been to ignore. Period. I never respond, partly because, what’s the use? I won’t persuade a shriek of shitlibs to accept in their hearts the Rude Word of the Chateau, and I certainly can’t expect to be treated fairly by these toads. More practically, I am very careful to guard my shadowy dimensions, and there is a risk, however muted through multiple proxies and TOR nodes, that a reply by me would be scoured for identifying info by a black ops team at Fusion GPS (stands for Grabbing Pussy Systems).\nBut the inquiries are getting more insistent and coming from bigger and bigger names. So I’m reconsidering my standard policy of ignoring them; perhaps for an upgrade to a “lol suck a dik” response? I have toyed with the idea of a conditional reply. That is, I set the ground rules and they swear by them in writing before I offer any penetrating insights of my tumescent wisdom.\nShort answer: no\n. He should continue to reject ALL media requests.\nNow, isn’t that hypocritical advice, considering that I just spent three hours having lunch with a reporter from\nRolling Stone\nand other mainstream media institutions?\nWell, to put it into perspective, that is the first request I have accepted in the last 50+ requests I have received. Furthermore, I have not spoken – in the sense of actually speaking via TV, radio, or telephone – to a single mainstream media reporter since I made the mistake of speaking to Amy Wallace of\nWired\nback in 2015.\nIn other words, you can see it as hypocrisy or you can see it as a rare exception to the rule. I leave it to you to decide which scenario is more applicable.\nAs for the interview yesterday, I agreed to it after reading the reporter’s various articles and seeing that she was a smart and perceptive writer who was clearly more interested in getting to know the subject and presenting a compelling in-depth story than writing generic hit pieces upholding the current narrative. Not only that, but she was clearly willing to go to far greater lengths, and put in a lot more time and effort into a piece, than was necessary for anyone simply bolstering a preconceived narrative, even when the subject was someone for whom it was very difficult to have any sympathy.\nNow, obviously we’ll see whether my decision was a foolish one or not when the story eventually runs in a few months, but there were no gotcha questions asked, and it was interesting to learn, in the course of the interview, that she correctly observed something about Castalia House’s protagonists that neither I nor anyone else had picked up upon before.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-28T18:54:00+00:00"
}