{
  "url": "https://voxday.net/2017/07/16/dr-who-converged/",
  "scraped_at": "2025-12-18T07:22:46.713738",
  "title": "Dr. Who converged",
  "date_display": "July 16, 2017",
  "date_iso": "2017-07-16T15:53:00+00:00",
  "date_from_url": "2017-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a rare and totally not-at-all expected twist, <a href=\"http://www.dailymail.co.uk/news/article-4701252/Jodie-Whittaker-woman-play-Doctor-Who.html\">the Thirteenth Doctor is a <strike>gay black </strike>woman</a>!</p><blockquote><p> Broadchurch star Jodie Whittaker is to be the first ever woman to play Doctor Who, it has been announced. The identity of the new Doctor was revealed on BBC One and on social media around the world after the Men’s Wimbledon Final today.</p><p>She will be the Thirteenth Time Lord and take over from Peter Capaldi who leaves the global hit show at Christmas.</p><p>New head writer and executive producer Chris Chibnall who takes over from Steven Moffat on the next series made the decision to cast the first ever woman in the iconic role.</p><p>Jodie Whittaker says: ‘I’m beyond excited to begin this epic journey – with Chris and with every Whovian on this planet. It’s more than an honour to play the Doctor.  ‘It means remembering everyone I used to be, while stepping forward to embrace everything the Doctor stands for: hope. I can’t wait.’</p><p>Chris Chibnall, New Head Writer and Executive Producer said: ‘After months of lists, conversations, auditions, recalls, and a lot of secret-keeping, we’re excited to welcome Jodie Whittaker as the Thirteenth Doctor. I always knew I wanted the Thirteenth Doctor to be a woman and we’re thrilled to have secured our number one choice.</p></blockquote><p>It’s got to be a little difficult to fake much enthusiasm for doing what every other SJW in entertainment has already been doing for the last 10 years. Personally, I look forward to the inevitable reboot when the initial fake audience generated by the SJW attention  inevitably drifts away and everyone realizes that the traditional viewership has declined.</p><p>Now, personally, I don’t give a damn about <i>Doctor Who</i>. I haven’t watched it since I was in junior high and Tom Baker was the Doctor, and even then I thought it was pretty lame. And the actress is attractive, considerably more attractive than most of the past companions. But that’s all irrelevant, and the casting decision is chiefly noteworthy in that it signifies that <i>absolutely nothing</i>, no matter how classic or beloved, is safe from SJWs. We know we have reached Peak SJW when Heidi is remade, with the blonde Swiss girl played by a gay black transgendered Muslim.</p></div>",
  "content_text": "In a rare and totally not-at-all expected twist,\nthe Thirteenth Doctor is a\ngay black\nwoman\n!\nBroadchurch star Jodie Whittaker is to be the first ever woman to play Doctor Who, it has been announced. The identity of the new Doctor was revealed on BBC One and on social media around the world after the Men’s Wimbledon Final today.\nShe will be the Thirteenth Time Lord and take over from Peter Capaldi who leaves the global hit show at Christmas.\nNew head writer and executive producer Chris Chibnall who takes over from Steven Moffat on the next series made the decision to cast the first ever woman in the iconic role.\nJodie Whittaker says: ‘I’m beyond excited to begin this epic journey – with Chris and with every Whovian on this planet. It’s more than an honour to play the Doctor.  ‘It means remembering everyone I used to be, while stepping forward to embrace everything the Doctor stands for: hope. I can’t wait.’\nChris Chibnall, New Head Writer and Executive Producer said: ‘After months of lists, conversations, auditions, recalls, and a lot of secret-keeping, we’re excited to welcome Jodie Whittaker as the Thirteenth Doctor. I always knew I wanted the Thirteenth Doctor to be a woman and we’re thrilled to have secured our number one choice.\nIt’s got to be a little difficult to fake much enthusiasm for doing what every other SJW in entertainment has already been doing for the last 10 years. Personally, I look forward to the inevitable reboot when the initial fake audience generated by the SJW attention  inevitably drifts away and everyone realizes that the traditional viewership has declined.\nNow, personally, I don’t give a damn about\nDoctor Who\n. I haven’t watched it since I was in junior high and Tom Baker was the Doctor, and even then I thought it was pretty lame. And the actress is attractive, considerably more attractive than most of the past companions. But that’s all irrelevant, and the casting decision is chiefly noteworthy in that it signifies that\nabsolutely nothing\n, no matter how classic or beloved, is safe from SJWs. We know we have reached Peak SJW when Heidi is remade, with the blonde Swiss girl played by a gay black transgendered Muslim.",
  "tags": [
    "movies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-16T14:53:00+00:00"
}