{
  "url": "https://voxday.net/2017/07/22/dragon-awards-deadline/",
  "scraped_at": "2025-12-18T07:23:40.857272",
  "title": "Dragon Awards deadline",
  "date_display": "July 22, 2017",
  "date_iso": "2017-07-22T17:00:00+00:00",
  "date_from_url": "2017-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you want to <a href=\"http://application.dragoncon.org/dc_fan_awards_nominations.php\">nominate for the Dragon Awards</a>, you’ve got to do so today or tomorrow. Here are <a href=\"http://www.milobookclub.com/2017/06/06/dragon-awards-2017/\">my recommendations</a>. Remember that a work cannot be nominated in two categories.</p><p>On a not-at-all-unrelated note here is a pair of recent book reviews by Jevaughn Brown, the latter of which concerns <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b>, which is eligible in the Best Fantasy Novel category and is written by an author who is not only handsome and charming, but is also said to be <a href=\"http://happyfrogs.org/2017/06/23/happy-frogs-official-dragon-award-recommendations/\">“the most underrated fantasy author in fiction.</a>“</p><blockquote><p> <b><i><a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a></i></b></p><p><i>A Throne Of Bones</i> in one book is the kind of story/world in essence that I had thought <i>A Song Of Fire And Ice</i> was going to develop into by now, but hasn’t quite. I loved how thoroughly embedded and powerful the Magic systems are into the fabric of Selenoth, yet they’re not a cure-all in the slightest, playing a part at fitting moments within “believable” limits.</p><p>The interactions between characters based on their circumstances and personalities had the feel of Real People rather than caricatures acting in contrived ways only to advance the plot. When we’re taken inside a character’s perspective, you really get how justified they feel in their worldview – as we all are.</p><p>I personally haven’t read more detailed yet visceral battle scenes. Vox retains the grandness of ancient armies and big sword-and-shield battles without washing out the fear and carnage and courage and confusion and skill and luck they really entailed.</p><p><a href=\"http://amzn.to/2hgubn2\"><br/></a><br> <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b></br></p><p>As richly developed as its predecessor was, <i>A Sea Of Skulls</i> added many new dimensions to this world and the crisis it’s in. All the positives I spoke of in my review of <i>A Throne Of Bones</i>, and more, were leveled up.</p><p>The standout achievement of this novel could be how well Vox takes us into the minds of the non-humans of Selenoth, and gives us just a taste of their civilizations – The underground dominion of the Dwarves, the stagnant decadence of the Elves, and the structured melee of the Orcs. Such is the depth Vox goes with such viewpoint characters that you may even find yourself *almost* starting to kinda sorta briefly feel a little empathy for an orc!</p><p>Minor characters are used meaningfully and there’s no one I would want to cut out. There’s a lot of traveling or being camped-out for extended periods, but we don’t get lost in dozens of pages of interminable wandering or stagnation, a major grievance I had with parts of both <i>A Song Of Fire And Ice</i> and the <i>Wheel Of Time</i> series.</p><p>Also much appreciated was the expansion on Dalarn culture as its warriors made their last stand, and on the Savondir side of the world through Marcus’ struggles and Theuderic serving his kingdom. If Book 1 left you asking for more elves and more battle magic, then your wish was granted. But again, the magic is the icing on the cake of well-scripted battles that feel as real as epic fantasy can get.</p><p>Things get unapologetically dark several times, so gird your mental loins going in. Every fan of Epic Fantasy should read this series.</p></blockquote><p>You really should read it. At present, Theuderic is busy assisting the Marquis de Poncheaux perform a fighting withdrawal at a bridge near the town of Rouvillier. It’s a cracking scene.</p></div>",
  "content_text": "If you want to\nnominate for the Dragon Awards\n, you’ve got to do so today or tomorrow. Here are\nmy recommendations\n. Remember that a work cannot be nominated in two categories.\nOn a not-at-all-unrelated note here is a pair of recent book reviews by Jevaughn Brown, the latter of which concerns\nA SEA OF SKULLS\n, which is eligible in the Best Fantasy Novel category and is written by an author who is not only handsome and charming, but is also said to be\n“the most underrated fantasy author in fiction.\n“\nA THRONE OF BONES\nA Throne Of Bones\nin one book is the kind of story/world in essence that I had thought\nA Song Of Fire And Ice\nwas going to develop into by now, but hasn’t quite. I loved how thoroughly embedded and powerful the Magic systems are into the fabric of Selenoth, yet they’re not a cure-all in the slightest, playing a part at fitting moments within “believable” limits.\nThe interactions between characters based on their circumstances and personalities had the feel of Real People rather than caricatures acting in contrived ways only to advance the plot. When we’re taken inside a character’s perspective, you really get how justified they feel in their worldview – as we all are.\nI personally haven’t read more detailed yet visceral battle scenes. Vox retains the grandness of ancient armies and big sword-and-shield battles without washing out the fear and carnage and courage and confusion and skill and luck they really entailed.\nA SEA OF SKULLS\nAs richly developed as its predecessor was,\nA Sea Of Skulls\nadded many new dimensions to this world and the crisis it’s in. All the positives I spoke of in my review of\nA Throne Of Bones\n, and more, were leveled up.\nThe standout achievement of this novel could be how well Vox takes us into the minds of the non-humans of Selenoth, and gives us just a taste of their civilizations – The underground dominion of the Dwarves, the stagnant decadence of the Elves, and the structured melee of the Orcs. Such is the depth Vox goes with such viewpoint characters that you may even find yourself *almost* starting to kinda sorta briefly feel a little empathy for an orc!\nMinor characters are used meaningfully and there’s no one I would want to cut out. There’s a lot of traveling or being camped-out for extended periods, but we don’t get lost in dozens of pages of interminable wandering or stagnation, a major grievance I had with parts of both\nA Song Of Fire And Ice\nand the\nWheel Of Time\nseries.\nAlso much appreciated was the expansion on Dalarn culture as its warriors made their last stand, and on the Savondir side of the world through Marcus’ struggles and Theuderic serving his kingdom. If Book 1 left you asking for more elves and more battle magic, then your wish was granted. But again, the magic is the icing on the cake of well-scripted battles that feel as real as epic fantasy can get.\nThings get unapologetically dark several times, so gird your mental loins going in. Every fan of Epic Fantasy should read this series.\nYou really should read it. At present, Theuderic is busy assisting the Marquis de Poncheaux perform a fighting withdrawal at a bridge near the town of Rouvillier. It’s a cracking scene.",
  "tags": [
    "Book Review",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-22T16:00:00+00:00"
}