{
  "url": "https://voxday.net/2017/07/15/he-must-be-jealous/",
  "scraped_at": "2025-12-18T07:22:41.926134",
  "title": "He must be jealous",
  "date_display": "July 15, 2017",
  "date_iso": "2017-07-15T20:30:00+00:00",
  "date_from_url": "2017-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi opines, mostly in experienced, but uninformed ignorance <a href=\"https://archive.fo/Nk2js#selection-597.0-687.82\">about Milo’s bestselling book</a>, which actually made the New York Times bestseller lists on the merits of its own performance.</p><blockquote><p> This is a little bit of publishing inside pool which apparently Yiannopoulos is not aware of (or is trying to fudge), but: You don’t count wholesale orders because wholesalers will eventually return books if they don’t sell them. The publisher has to make them whole for that, either by shifting credit to other books (which in this case Yiannopoulos as a self-publisher of a single book does not have), or by refunding the money. Yiannopoulos may have shipped 105,000 hardcover copies of the book, but that’s not the same as having sold them. I don’t know in this case what “direct orders” mean — it could be sales to individual book buyers (in which case that would be a sale) or to individual booksellers (in which case they are probably returnable, as book stores are loath to stock anything on a non-returnable basis), or to organizations which are making a “bulk buy” for their own reasons, say, a conservative organization who wants to hand out copies to employees or on the street or whatever.</p><p>But however you slice it, by Yiannopoulos’ own words (and by his apparent lack of understanding of how bookselling works), he probably has not in fact sold all 100k of the hardcover books. Also, with regard to the wholesalers and other booksellers, I do hope someone in his organization is keeping money in reserve to deal with returns when they (inevitably) happen. I’m also curious as to how he as a self-publisher is dealing with long-term storage and shipping of the books; I really don’t see Yiannopoulos himself handling that. I don’t picture him as a detail-oriented person. Perhaps this will be a job for the interns.</p><p>With all of this said, and again with the reminder that I find Yiannopoulos a hot feculent mess of a person, sales of 18,000 hardcovers in one week is pretty darn good. It was enough to land Yiannopoulos at #3 on the USA Today list and at #4 on the New York Times Hardcover Nonfiction list (and #2 on the paper’s print/ebook combined list). He’s a legitimate bestseller. And those 18K sales don’t cover ebook sales, which given his audience demographics I suspect are pretty high. Most authors would be absolutely delighted to have 18k in hardcover sales in their first week. People exercising schadenfreude about all this are thus advised to temper their glee somewhat. The book is not a failure in any manner except in contrast to Yiannopoulos’ industry-specific hype, and also (if the professional reviews are to be believed) as a book worth reading.</p><p>Can Yiannopoulos sell 100,000 copies of his book? I suspect so in the long run, especially considering that Yiannopoulos can now have it as a rider for speaking events that whomever is having him speak will be obliged to purchase a certain number of the book in order to have him appear — and speaking events and appearances are the actual bread-and-butter for a creature such as Yiannopoulos, for which this book is mostly advertising.</p><p>Has he sold that many in the first week? I doubt it. The actual number, in all formats, across all retailers, is somewhere between 18,000 and 100,000 copies. Which, again, is not at all a bad number of books to sell in the first week. Had Yiannopoulos been smart, he wouldn’t have alleged selling 100K books in his first week at all, he simply would have taken those USA Today and NYT list rankings and waved them about happily, and built PR around those.</p><p>But apparently he’s not really that smart. Now most of the stories are about how he only sold 18,000 copies in his first week, rather than the 100,000 copies he alleged.</p></blockquote><p>It’s rather amusing to see Scalzi opining on someone else’s book sales and strategies, in light of how his fans claim that anyone doing the same to Scalzi is doing so out of envy. (For the record, I am not envious of Scalzi’s career nor do I think he is envious of Milo’s.)</p><p>Now, I can state, with certainty, that Scalzi has it mostly wrong. I won’t say more than that, because Milo’s secrets are not mine to tell, except to observe that no author publishing through the major publishers really understands how the world of independent publishing works at the top. In fact, even trying to compare unit sales doesn’t even make sense, because Milo will be making somewhere between 3x and 5x more per unit than Scalzi and other mainstream-published authors depending upon whether one is utilizing hardcovers, trade paperbacks, ebooks, or audiobooks as the metric.</p><p>Where Scalzi is correct is when he notes that Nielsen Bookscan woefully undercounts book sales, so much so that I pay it absolutely no attention whatsoever. And I am absolutely confident that Milo will sell more than 250,000 copies of Dangerous before the end of 2017; my expectation is that he will sell somewhere between 300k and 350k this calendar year. And that is copies sold <i>to the reader</i>, <u>NOT </u>merely units in the distribution channel</p><p>As for permitting the media to spin the story of Milo “only” selling 18,000 copies, that is the statement of a man who is accustomed to the media fawning on him and <a href=\"http://www.milobookclub.com/2016/06/14/mcrapey-is-lying-again/\">repeating his lies</a> without question. No matter what Milo did, the media was going to find a way to say something negative. But  his assumptions about Milo’s dishonesty is a timely reminder of the 3rd Law of SJW: SJWs Always Project.</p></div>",
  "content_text": "John Scalzi opines, mostly in experienced, but uninformed ignorance\nabout Milo’s bestselling book\n, which actually made the New York Times bestseller lists on the merits of its own performance.\nThis is a little bit of publishing inside pool which apparently Yiannopoulos is not aware of (or is trying to fudge), but: You don’t count wholesale orders because wholesalers will eventually return books if they don’t sell them. The publisher has to make them whole for that, either by shifting credit to other books (which in this case Yiannopoulos as a self-publisher of a single book does not have), or by refunding the money. Yiannopoulos may have shipped 105,000 hardcover copies of the book, but that’s not the same as having sold them. I don’t know in this case what “direct orders” mean — it could be sales to individual book buyers (in which case that would be a sale) or to individual booksellers (in which case they are probably returnable, as book stores are loath to stock anything on a non-returnable basis), or to organizations which are making a “bulk buy” for their own reasons, say, a conservative organization who wants to hand out copies to employees or on the street or whatever.\nBut however you slice it, by Yiannopoulos’ own words (and by his apparent lack of understanding of how bookselling works), he probably has not in fact sold all 100k of the hardcover books. Also, with regard to the wholesalers and other booksellers, I do hope someone in his organization is keeping money in reserve to deal with returns when they (inevitably) happen. I’m also curious as to how he as a self-publisher is dealing with long-term storage and shipping of the books; I really don’t see Yiannopoulos himself handling that. I don’t picture him as a detail-oriented person. Perhaps this will be a job for the interns.\nWith all of this said, and again with the reminder that I find Yiannopoulos a hot feculent mess of a person, sales of 18,000 hardcovers in one week is pretty darn good. It was enough to land Yiannopoulos at #3 on the USA Today list and at #4 on the New York Times Hardcover Nonfiction list (and #2 on the paper’s print/ebook combined list). He’s a legitimate bestseller. And those 18K sales don’t cover ebook sales, which given his audience demographics I suspect are pretty high. Most authors would be absolutely delighted to have 18k in hardcover sales in their first week. People exercising schadenfreude about all this are thus advised to temper their glee somewhat. The book is not a failure in any manner except in contrast to Yiannopoulos’ industry-specific hype, and also (if the professional reviews are to be believed) as a book worth reading.\nCan Yiannopoulos sell 100,000 copies of his book? I suspect so in the long run, especially considering that Yiannopoulos can now have it as a rider for speaking events that whomever is having him speak will be obliged to purchase a certain number of the book in order to have him appear — and speaking events and appearances are the actual bread-and-butter for a creature such as Yiannopoulos, for which this book is mostly advertising.\nHas he sold that many in the first week? I doubt it. The actual number, in all formats, across all retailers, is somewhere between 18,000 and 100,000 copies. Which, again, is not at all a bad number of books to sell in the first week. Had Yiannopoulos been smart, he wouldn’t have alleged selling 100K books in his first week at all, he simply would have taken those USA Today and NYT list rankings and waved them about happily, and built PR around those.\nBut apparently he’s not really that smart. Now most of the stories are about how he only sold 18,000 copies in his first week, rather than the 100,000 copies he alleged.\nIt’s rather amusing to see Scalzi opining on someone else’s book sales and strategies, in light of how his fans claim that anyone doing the same to Scalzi is doing so out of envy. (For the record, I am not envious of Scalzi’s career nor do I think he is envious of Milo’s.)\nNow, I can state, with certainty, that Scalzi has it mostly wrong. I won’t say more than that, because Milo’s secrets are not mine to tell, except to observe that no author publishing through the major publishers really understands how the world of independent publishing works at the top. In fact, even trying to compare unit sales doesn’t even make sense, because Milo will be making somewhere between 3x and 5x more per unit than Scalzi and other mainstream-published authors depending upon whether one is utilizing hardcovers, trade paperbacks, ebooks, or audiobooks as the metric.\nWhere Scalzi is correct is when he notes that Nielsen Bookscan woefully undercounts book sales, so much so that I pay it absolutely no attention whatsoever. And I am absolutely confident that Milo will sell more than 250,000 copies of Dangerous before the end of 2017; my expectation is that he will sell somewhere between 300k and 350k this calendar year. And that is copies sold\nto the reader\n,\nNOT\nmerely units in the distribution channel\nAs for permitting the media to spin the story of Milo “only” selling 18,000 copies, that is the statement of a man who is accustomed to the media fawning on him and\nrepeating his lies\nwithout question. No matter what Milo did, the media was going to find a way to say something negative. But  his assumptions about Milo’s dishonesty is a timely reminder of the 3rd Law of SJW: SJWs Always Project.",
  "tags": [
    "books",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-15T19:30:00+00:00"
}