{
  "url": "https://voxday.net/2017/07/11/jewish-double-talk-in-action/",
  "scraped_at": "2025-12-18T07:22:08.557282",
  "title": "Jewish double-talk in action",
  "date_display": "July 11, 2017",
  "date_iso": "2017-07-11T17:51:00+00:00",
  "date_from_url": "2017-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://972mag.com/soros-bannon-and-the-anti-semitism-of-israels-prime-minister/128603/\">an amusing example</a> of a Jewish commentator attempting to simultaneously cry Holocaust, defend his tribe, and attack the other 7.688 billion people on the planet, and who, in doing so, winds up as looking like a medieval stereotype of a perfidious Jew attempting to whitewash the evil deeds of his wicked co-tribalist.</p><blockquote><p> Instead of defending George Soros from Hungary’s anti-Semitism, he has taken a page out of the alt-right playbook. His bottom line? Some Jews just aren’t worth protecting.</p><p>Benjamin Netanyahu is the self-appointed protector of world Jewry. And as such, he views his role not only as prime minister of Israel, but as the spokesperson for Jews across the world. On Saturday, Netanyahu played that role when the Israeli government called on the Hungarian government to halt an ad campaign against Hungarian-born Jewish-American financier George Soros, claiming it was fueling anti-Semitism across the country.</p><p>Just a day later, however, Netanyahu ordered the Foreign Ministry to retract the statement, resorting instead to attacking Soros, a known critic of Israel’s policies vis-a-vis the Palestinians. The clarification, issued by Foreign Ministry Spokesperson Emmanuel Nahshon, deploys similar tropes to the ones used against Soros by the Hungarian government:</p><p><i>Israel deplores any expression of anti-Semitism in any country and stands with Jewish communities everywhere in confronting this hatred. This was the sole purpose of the statement issued by Israel’s ambassador to Hungary…In no way was the statement meant to delegitimize criticism of George Soros, who continuously undermines Israel’s democratically elected governments by funding organizations that defame the Jewish state and seek to deny it the right to defend itself.</i></p><p>The reaction in Israel was immediate. Meretz leader Zehava Galon sharply criticized Netanyahu, accusing him of “supporting global anti-Semitism,” and backed calls by Hungarian Jews for Netanyahu to cancel his visit to Hungary next week. Some of the reactions by the Israeli Right simply doubled down on Netanyahu’s decision. Take right-wing commentator Shimon Riklin, who on Sunday tweeted: “Want to understand part of the anti-Semitism of the 30s in Europe? Look at George Soros who is trying to educate the goyim over and over again, telling them what to think.”</p><p>The astounding thing about Netanyahu’s implicit support for Hungary’s anti-Semitism is not that it comes from the most powerful Jewish figure in the world.</p></blockquote><p>The absolute and incontrovertible fact is that some Jews are not worth protecting. Some Jews are murderous homosexual cannibals. Some Jews are traitors and cultural Marxists. Some Jews rape children. Some Jews suck the penises of little boys and infect them with venereal diseases. And some Jews fund movements intended to overturn civilized societies and destroy Western civilization.</p><p>Do ALL of these evil individuals merit protecting? If you genuinely think so, if you truly believe that the mere possession of certain DNA sequences suffices to justify any and all actions on the part of the individual concerned, you are not only racist, you are so irretrievably and unmistakably wicked that the tender mercy of a Zyklon B gas chamber is far too merciful for you.</p><p>I think far too well of the Jewish people to believe that most of them, let alone all of them, subscribe to this evil, and arguably insane, logic. Christianity is not a free pass. Judaism is not a free pass. Genetics are not a free pass. <i>Nothing </i>is a free pass. In the end, we ALL must answer for our deeds, regardless of our genetics or our beliefs. Whether you are a Christian or a godless Objectivist, you understand that it is the individual who is responsible for his actions.</p><p>Netanyahu did very well to condemn George Soros although it is a pity that he didn’t mention that Soros continually attempts to undermine other democratically elected governments than Israel’s as well. In any event, the most inadvertently insightful aspect of the article is here.<br> <i><br/></i><br> <i>Soros is the cosmopolitan, liberal, Upper West Side Jew who looks at the increasingly fascistic trends in the Jewish state and “wants nothing to do with it,” as he himself once put it. The frightening part is that there is very little daylight between the way this Jew is viewed by far-right Zionists (and in many ways classic Zionism, too) and the alt-right.</i><br> <i><br/></i><br> That is because far-right Zionists are the Israeli expression of the Alt-Right, which will take a different form in every different nation. The Alt-Right is inevitable, in Israel as elsewhere, because the 75-year pendulum is finally swinging back and nationalism is on the rise.</br></br></br></br></p></div>",
  "content_text": "This is\nan amusing example\nof a Jewish commentator attempting to simultaneously cry Holocaust, defend his tribe, and attack the other 7.688 billion people on the planet, and who, in doing so, winds up as looking like a medieval stereotype of a perfidious Jew attempting to whitewash the evil deeds of his wicked co-tribalist.\nInstead of defending George Soros from Hungary’s anti-Semitism, he has taken a page out of the alt-right playbook. His bottom line? Some Jews just aren’t worth protecting.\nBenjamin Netanyahu is the self-appointed protector of world Jewry. And as such, he views his role not only as prime minister of Israel, but as the spokesperson for Jews across the world. On Saturday, Netanyahu played that role when the Israeli government called on the Hungarian government to halt an ad campaign against Hungarian-born Jewish-American financier George Soros, claiming it was fueling anti-Semitism across the country.\nJust a day later, however, Netanyahu ordered the Foreign Ministry to retract the statement, resorting instead to attacking Soros, a known critic of Israel’s policies vis-a-vis the Palestinians. The clarification, issued by Foreign Ministry Spokesperson Emmanuel Nahshon, deploys similar tropes to the ones used against Soros by the Hungarian government:\nIsrael deplores any expression of anti-Semitism in any country and stands with Jewish communities everywhere in confronting this hatred. This was the sole purpose of the statement issued by Israel’s ambassador to Hungary…In no way was the statement meant to delegitimize criticism of George Soros, who continuously undermines Israel’s democratically elected governments by funding organizations that defame the Jewish state and seek to deny it the right to defend itself.\nThe reaction in Israel was immediate. Meretz leader Zehava Galon sharply criticized Netanyahu, accusing him of “supporting global anti-Semitism,” and backed calls by Hungarian Jews for Netanyahu to cancel his visit to Hungary next week. Some of the reactions by the Israeli Right simply doubled down on Netanyahu’s decision. Take right-wing commentator Shimon Riklin, who on Sunday tweeted: “Want to understand part of the anti-Semitism of the 30s in Europe? Look at George Soros who is trying to educate the goyim over and over again, telling them what to think.”\nThe astounding thing about Netanyahu’s implicit support for Hungary’s anti-Semitism is not that it comes from the most powerful Jewish figure in the world.\nThe absolute and incontrovertible fact is that some Jews are not worth protecting. Some Jews are murderous homosexual cannibals. Some Jews are traitors and cultural Marxists. Some Jews rape children. Some Jews suck the penises of little boys and infect them with venereal diseases. And some Jews fund movements intended to overturn civilized societies and destroy Western civilization.\nDo ALL of these evil individuals merit protecting? If you genuinely think so, if you truly believe that the mere possession of certain DNA sequences suffices to justify any and all actions on the part of the individual concerned, you are not only racist, you are so irretrievably and unmistakably wicked that the tender mercy of a Zyklon B gas chamber is far too merciful for you.\nI think far too well of the Jewish people to believe that most of them, let alone all of them, subscribe to this evil, and arguably insane, logic. Christianity is not a free pass. Judaism is not a free pass. Genetics are not a free pass.\nNothing\nis a free pass. In the end, we ALL must answer for our deeds, regardless of our genetics or our beliefs. Whether you are a Christian or a godless Objectivist, you understand that it is the individual who is responsible for his actions.\nNetanyahu did very well to condemn George Soros although it is a pity that he didn’t mention that Soros continually attempts to undermine other democratically elected governments than Israel’s as well. In any event, the most inadvertently insightful aspect of the article is here.\nSoros is the cosmopolitan, liberal, Upper West Side Jew who looks at the increasingly fascistic trends in the Jewish state and “wants nothing to do with it,” as he himself once put it. The frightening part is that there is very little daylight between the way this Jew is viewed by far-right Zionists (and in many ways classic Zionism, too) and the alt-right.\nThat is because far-right Zionists are the Israeli expression of the Alt-Right, which will take a different form in every different nation. The Alt-Right is inevitable, in Israel as elsewhere, because the 75-year pendulum is finally swinging back and nationalism is on the rise.",
  "tags": [
    "#AltRight",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-11T16:51:00+00:00"
}