{
  "url": "https://voxday.net/2017/07/30/jews-do-not-control-media/",
  "scraped_at": "2025-12-18T07:24:41.830042",
  "title": "People of no particular religion do NOT control the media",
  "date_display": "July 30, 2017",
  "date_iso": "2017-07-30T18:54:00+00:00",
  "date_from_url": "2017-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And if you suggest they do, they will terminate your career in the media.</p><blockquote><p> Sunday Times Ireland columnist Kevin Myers will not write again for the paper, a spokesman said. The newspaper said it abhorred anti-Semitism after Mr Myers noted that two of the best-paid female presenters at the BBC, Claudia Winkleman and Vanessa Feltz, were Jewish in an article on the corporation’s gender pay gap. Sunday Times editor Martin Ivens has apologised personally to the two women for these ‘unacceptable comments both to Jewish people and to women in the workplace’.</p></blockquote><p>Let me see if I understand this. Disparate impact is a terrible injustice and is not only policed by various government agencies, but requires financial redress to underrepresented minorities and special rules to ensure their advancement when whites are statistically overrepresented, but to even <i>notice </i>disparate impact is anti-Semitism and cause for immediate termination when people of a particular religion that shall not be mentioned are observed to be statistically overrepresented.</p><p>After all, of the 65,640,000 people in the UK, 269,568 of them are people whose religion shall not be mentioned at all, so doesn’t it only make sense that two of them would be the two highest paid women in British broadcasting? I mean, the odds against that happening are only 0.0041 squared, or if you prefer, a one in 59,488 chance.</p><p>That’s perfectly reasonable, right? Why on Earth would that strike anyone as unusual?</p><p>Thank goodness the Campaign Against Anti-Semitism was there to demand that Mr. Myers should “no longer work as a journalist at any decent publication”!</p><p><i>It is clear that the column breached clauses 12(i) and 12(ii) of the Independent Press Standards Organisation’s Editors’ Code by making discriminatory comments about Jews and also mentioning the religion of the Jewish BBC presenters at all. We have called on the Independent Press Standards Organisation to require the Sunday Times to prominently print apologies in the next edition; investigate the editorial process that allowed this column to be printed in the first place; and recommend that Kevin Myers no longer be employed by any newspaper as a columnist or journalist.</i><br> <i><br/></i><br> Frankly, I don’t think that mere permanent disemployment and expulsion from the industry is going far enough, as justice obviously demands that Mr. Myers be run over with a bulldozer before his family home is demolished. Also, the entire editorial staff of the <i>Sunday Times</i> should be fired and replaced by people of no particular religion that shall be mentioned at all.</br></br></p></div>",
  "content_text": "And if you suggest they do, they will terminate your career in the media.\nSunday Times Ireland columnist Kevin Myers will not write again for the paper, a spokesman said. The newspaper said it abhorred anti-Semitism after Mr Myers noted that two of the best-paid female presenters at the BBC, Claudia Winkleman and Vanessa Feltz, were Jewish in an article on the corporation’s gender pay gap. Sunday Times editor Martin Ivens has apologised personally to the two women for these ‘unacceptable comments both to Jewish people and to women in the workplace’.\nLet me see if I understand this. Disparate impact is a terrible injustice and is not only policed by various government agencies, but requires financial redress to underrepresented minorities and special rules to ensure their advancement when whites are statistically overrepresented, but to even\nnotice\ndisparate impact is anti-Semitism and cause for immediate termination when people of a particular religion that shall not be mentioned are observed to be statistically overrepresented.\nAfter all, of the 65,640,000 people in the UK, 269,568 of them are people whose religion shall not be mentioned at all, so doesn’t it only make sense that two of them would be the two highest paid women in British broadcasting? I mean, the odds against that happening are only 0.0041 squared, or if you prefer, a one in 59,488 chance.\nThat’s perfectly reasonable, right? Why on Earth would that strike anyone as unusual?\nThank goodness the Campaign Against Anti-Semitism was there to demand that Mr. Myers should “no longer work as a journalist at any decent publication”!\nIt is clear that the column breached clauses 12(i) and 12(ii) of the Independent Press Standards Organisation’s Editors’ Code by making discriminatory comments about Jews and also mentioning the religion of the Jewish BBC presenters at all. We have called on the Independent Press Standards Organisation to require the Sunday Times to prominently print apologies in the next edition; investigate the editorial process that allowed this column to be printed in the first place; and recommend that Kevin Myers no longer be employed by any newspaper as a columnist or journalist.\nFrankly, I don’t think that mere permanent disemployment and expulsion from the industry is going far enough, as justice obviously demands that Mr. Myers be run over with a bulldozer before his family home is demolished. Also, the entire editorial staff of the\nSunday Times\nshould be fired and replaced by people of no particular religion that shall be mentioned at all.",
  "tags": [
    "media",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-30T17:54:00+00:00"
}