{
  "url": "https://voxday.net/2017/07/18/mailvox-doctor-feelgood-fake-news/",
  "scraped_at": "2025-12-18T07:22:57.728460",
  "title": "Mailvox: Doctor Feelgood Fake News",
  "date_display": "July 18, 2017",
  "date_iso": "2017-07-18T09:48:00+00:00",
  "date_from_url": "2017-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CGS wonders if perhaps the Fake News is preventing an even greater incidence of psychological breakdowns among the heavily medicated SJW community:</p><blockquote><p> While browsing the CNN headlines and seeing this line-up of five articles about polls negatively reflecting on Trump, I contemplated the amygdala soothing that this must provide to a substantial portion of the population. If it weren’t for the constant false reminder that they aren’t alone, there is a  substantial portion of the population that would find themselves under constant anxiety and tension of realizing just how isolated and fragile their situation really is.</p><p>Especially the middle class liberal who isn’t as well protected from the ghetto democrats as the upper class liberals are. If they were ever to realize how many people are indifferent to support of Trump they would realize just how tenuous their situation is stuck between the ghetto and flyover land… and knowing deep down the gates to upper class liberal town would be closed in the event of a civil breakdown.</p><p>In a way CNN’s lies are probably providing a tenuous glue keeping the liberal amygdala from meltdown which is indirectly helping maintain the peace we currently have. I know that working in a converged industry, city, and company… that even the slightest hint of disregard for their feelings or even outright <i>support </i>for Trump would be enough to bring the social condition to a standstill. I can’t imagine the amount of “sick leave” that we’d start seeing if CNN started reporting the accurate social shift.</p></blockquote><p>Rabbits are incredibly fragile to feeling outgrouped, which of course is why they always run to that tactic whenever they are attacking us. SJW Law #3: SJWs Always Project. So trigger those fragile, shrunken amygdalas, my friends. TRIGGER THEM.</p><p>The <a href=\"http://www.milobookclub.com/2017/07/09/meme-of-day/\">Daily Meme Wars</a> are a good place to start if you’re not sure how.</p></div>",
  "content_text": "CGS wonders if perhaps the Fake News is preventing an even greater incidence of psychological breakdowns among the heavily medicated SJW community:\nWhile browsing the CNN headlines and seeing this line-up of five articles about polls negatively reflecting on Trump, I contemplated the amygdala soothing that this must provide to a substantial portion of the population. If it weren’t for the constant false reminder that they aren’t alone, there is a  substantial portion of the population that would find themselves under constant anxiety and tension of realizing just how isolated and fragile their situation really is.\nEspecially the middle class liberal who isn’t as well protected from the ghetto democrats as the upper class liberals are. If they were ever to realize how many people are indifferent to support of Trump they would realize just how tenuous their situation is stuck between the ghetto and flyover land… and knowing deep down the gates to upper class liberal town would be closed in the event of a civil breakdown.\nIn a way CNN’s lies are probably providing a tenuous glue keeping the liberal amygdala from meltdown which is indirectly helping maintain the peace we currently have. I know that working in a converged industry, city, and company… that even the slightest hint of disregard for their feelings or even outright\nsupport\nfor Trump would be enough to bring the social condition to a standstill. I can’t imagine the amount of “sick leave” that we’d start seeing if CNN started reporting the accurate social shift.\nRabbits are incredibly fragile to feeling outgrouped, which of course is why they always run to that tactic whenever they are attacking us. SJW Law #3: SJWs Always Project. So trigger those fragile, shrunken amygdalas, my friends. TRIGGER THEM.\nThe\nDaily Meme Wars\nare a good place to start if you’re not sure how.",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-18T08:48:00+00:00"
}