{
  "url": "https://voxday.net/2017/07/25/modern-literature-is-bad-writing/",
  "scraped_at": "2025-12-18T07:23:56.609363",
  "title": "Modern literature is bad writing",
  "date_display": "July 25, 2017",
  "date_iso": "2017-07-25T12:25:00+00:00",
  "date_from_url": "2017-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of bad writing, this 2001 Atlantic essay on <a href=\"https://www.theatlantic.com/magazine/archive/2001/07/a-readers-manifesto/302270/\">the form and purpose of modern literature</a> is magnificent. The author, BR Myers, rightly crucifies several doyennes of modern literature, including one, Cormac McCarthy, whose popular appeal I have never understood in the slightest. Read the whole thing. It’s long, but it’s well worth it.</p><blockquote><p> Parallelisms and pseudo-archaic formulations abound: “They caught up and set out each day in the dark before the day yet was and they ate cold meat and biscuit and made no fire”; “and they would always be so and never be otherwise”; “the captain wrote on nor did he look up”; “there rode no soul save he,” and so forth.</p><p>The reader is meant to be carried along on the stream of language. In the New York Times review of The Crossing, Robert Hass praised the effect: “It is a matter of straight-on writing, a veering accumulation of compound sentences, stinginess with commas, and a witching repetition of words … Once this style is established, firm, faintly hypnotic, the crispness and sinuousness of the sentences … gather to a magic.” The key word here is “accumulation.” Like Proulx and so many others today, McCarthy relies more on barrages of hit-and-miss verbiage than on careful use of just the right words.</p><p><i>While inside the vaulting of the ribs between his knees the darkly meated heart pumped of who’s will and the blood pulsed and the bowels shifted in their massive blue convolutions of who’s will and the stout thighbones and knee and cannon and the tendons like flaxen hawsers that drew and flexed and drew and flexed at their articulations of who’s will all sheathed and muffled in the flesh and the hooves that stove wells in the morning groundmist and the head turning side to side and the great slavering keyboard of his teeth and the hot globes of his eyes where the world burned. </i><br> (All the Pretty Horses, 1992)</br></p><p>This may get Hass’s darkly meated heart pumping, but it’s really just bad poetry formatted to exploit the lenient standards of modern prose. The obscurity of who’s will, which has an unfortunate Dr. Seussian ring to it, is meant to bully readers into thinking that the author’s mind operates on a plane higher than their own—a plane where it isn’t ridiculous to eulogize the shifts in a horse’s bowels.</p><p>As a fan of movie westerns, I refuse to quibble with the myth that a wild landscape can bestow epic significance on the lives of its inhabitants. But novels tolerate epic language only in moderation. To record with the same somber majesty every aspect of a cowboy’s life, from a knife fight to his lunchtime burrito, is to create what can only be described as kitsch. Here we learn that out west even a hangover is something special.</p><p><i>[They] walked off in separate directions through the chaparral to stand spraddlelegged clutching their knees and vomiting. The browsing horses jerked their heads up. It was no sound they’d ever heard before. In the gray twilight those retchings seemed to echo like the calls of some rude provisional species loosed upon that waste. Something imperfect and malformed lodged in the heart of being. A thing smirking deep in the eyes of grace itself like a gorgon in an autumn pool. </i><br> (All the Pretty Horses)</br></p><p>It is a rare passage that can make you look up, wherever you may be, and wonder if you are being subjected to a diabolically thorough Candid Camera prank. I can just go along with the idea that horses might mistake human retching for the call of wild animals. But “wild animals” isn’t epic enough: McCarthy must blow smoke about some rude provisional species, as if your average quadruped had impeccable table manners and a pension plan. Then he switches from the horses’ perspective to the narrator’s, though just what something imperfect and malformed refers to is unclear. The last half sentence only deepens the confusion. Is the thing smirking deep in the eyes of grace the same thing that is lodged in the heart of being? And what is a gorgon doing in a pool? Or is it peering into it? And why an autumn pool? I doubt if McCarthy can explain any of this; he probably just likes the way it sounds.</p><p>No novelist with a sense of the ridiculous would write such nonsense. Although his characters sometimes rib one another, McCarthy is among the most humorless writers in American history. In this excerpt the subject is horses.<br> <i><br/></i><br> <i>He said that the souls of horses mirror the souls of men more closely than men suppose and that horses also love war. Men say they only learn this but he said that no creature can learn that which his heart has no shape to hold … Lastly he said that he had seen the souls of horses and that it was a terrible thing to see. He said that it could be seen under certain circumstances attending the death of a horse because the horse shares a common soul and its separate life only forms it out of all horses and makes it mortal … Finally John Grady asked him if it were not true that should all horses vanish from the face of the earth the soul of the horse would not also perish for there would be nothing out of which to replenish it but the old man only said that it was pointless to speak of there being no horses in the world for God would not permit such a thing.</i><br> (All the Pretty Horses)</br></br></br></p><p>The further we get from our cowboy past, the loonier becomes the hippophilia we attribute to it. More to the point, especially considering The New York Times’s praise of All the Pretty Horses for its “realistic dialogue,” is the stiltedness with which the conversation is reproduced. The cowboys are supposed to be talking to a Mexican in Spanish, which is a stretch to begin with, but from the tone in which the conversation is set down you’d think it was ancient Hebrew. And shouldn’t Grady satisfy our curiosity by finding out what a horse’s soul looks like, instead of pursuing a hypothetical point of equine theology? You half expect him to ask how many horses’ souls can fit on the head of a pin.</p><p>All the Pretty Horses received the National Book Award in 1992. “Not until now,” the judges wrote in their fatuous citation, “has the unhuman world been given its own holy canon.” What a difference a pseudo-biblical style makes; this so-called canon has little more to offer than the conventional belief that horses, like dogs, serve us well enough to merit exemption from an otherwise sweeping disregard for animal life. (No one ever sees a cow’s soul.) McCarthy’s fiction may be less fun than the “genre” western, but its world view is much the same. So is the cast of characters: the quiet cowboys, the women who “like to see a man eat,” the howling savages. (In fairness to the western: McCarthy’s depiction of Native Americans in Blood Meridian [1985] is far more offensive than anything in Louis L’ Amour.) The critics, however, are too much impressed by the muscles of his prose to care about the heart underneath. Even The Village Voice has called McCarthy “a master stylist, perhaps without equal in American letters.” Robert Hass wrote much of his review of The Crossing in an earnest imitation of McCarthy’s style:</p><p><i>The boys travel through this world, tipping their hats, saying “yessir” and “nosir” and “si” and “es verdad” and “claro” to all its potential malice, its half-mad philosophers, as the world washes over and around them, and the brothers themselves come to be as much arrested by the gesture of the quest as the old are by their stores of bitter wisdom and the other travelers, in the middle of life, in various stages of the arc between innocence and experience, by whatever impulses have placed them on the road.</i></p><p>The vagueness of that encomium must annoy McCarthy, who prides himself on the way he tackles “issues of life and death” head on. In interviews he presents himself as a man’s man with no time for pansified intellectuals—a literary version, if you will, of Dave Thomas, the smugly parochial old-timer in the Wendy’s commercials. It would be both unfair and a little too charitable to suggest that this is just a pose. When McCarthy says of Marcel Proust and Henry James, “I don’t understand them. To me, that’s not literature,” I have a sinking feeling he’s telling the truth.</p></blockquote><p>The essay finally made it clear to me what these modern literaturists – one hesitates to call them actual writers – are doing, and it’s not dissimilar to what the gammas are doing with their terrible, narcissistic metaphors. Their words are not meant to be read as words as such, but are meant to be lightly scanned, so that an impression is formed by that superficial contact.</p><p>That’s why there is so often no meaning to be found in their works, that there is neither action nor character to be found in the texts. <i>No one actually reads these books!</i> They are, instead, scanned, with no more comprehension of the empty contents surveyed than the whole language reader grasps the phonetics of the words he is reading.</p></div>",
  "content_text": "Speaking of bad writing, this 2001 Atlantic essay on\nthe form and purpose of modern literature\nis magnificent. The author, BR Myers, rightly crucifies several doyennes of modern literature, including one, Cormac McCarthy, whose popular appeal I have never understood in the slightest. Read the whole thing. It’s long, but it’s well worth it.\nParallelisms and pseudo-archaic formulations abound: “They caught up and set out each day in the dark before the day yet was and they ate cold meat and biscuit and made no fire”; “and they would always be so and never be otherwise”; “the captain wrote on nor did he look up”; “there rode no soul save he,” and so forth.\nThe reader is meant to be carried along on the stream of language. In the New York Times review of The Crossing, Robert Hass praised the effect: “It is a matter of straight-on writing, a veering accumulation of compound sentences, stinginess with commas, and a witching repetition of words … Once this style is established, firm, faintly hypnotic, the crispness and sinuousness of the sentences … gather to a magic.” The key word here is “accumulation.” Like Proulx and so many others today, McCarthy relies more on barrages of hit-and-miss verbiage than on careful use of just the right words.\nWhile inside the vaulting of the ribs between his knees the darkly meated heart pumped of who’s will and the blood pulsed and the bowels shifted in their massive blue convolutions of who’s will and the stout thighbones and knee and cannon and the tendons like flaxen hawsers that drew and flexed and drew and flexed at their articulations of who’s will all sheathed and muffled in the flesh and the hooves that stove wells in the morning groundmist and the head turning side to side and the great slavering keyboard of his teeth and the hot globes of his eyes where the world burned.\n(All the Pretty Horses, 1992)\nThis may get Hass’s darkly meated heart pumping, but it’s really just bad poetry formatted to exploit the lenient standards of modern prose. The obscurity of who’s will, which has an unfortunate Dr. Seussian ring to it, is meant to bully readers into thinking that the author’s mind operates on a plane higher than their own—a plane where it isn’t ridiculous to eulogize the shifts in a horse’s bowels.\nAs a fan of movie westerns, I refuse to quibble with the myth that a wild landscape can bestow epic significance on the lives of its inhabitants. But novels tolerate epic language only in moderation. To record with the same somber majesty every aspect of a cowboy’s life, from a knife fight to his lunchtime burrito, is to create what can only be described as kitsch. Here we learn that out west even a hangover is something special.\n[They] walked off in separate directions through the chaparral to stand spraddlelegged clutching their knees and vomiting. The browsing horses jerked their heads up. It was no sound they’d ever heard before. In the gray twilight those retchings seemed to echo like the calls of some rude provisional species loosed upon that waste. Something imperfect and malformed lodged in the heart of being. A thing smirking deep in the eyes of grace itself like a gorgon in an autumn pool.\n(All the Pretty Horses)\nIt is a rare passage that can make you look up, wherever you may be, and wonder if you are being subjected to a diabolically thorough Candid Camera prank. I can just go along with the idea that horses might mistake human retching for the call of wild animals. But “wild animals” isn’t epic enough: McCarthy must blow smoke about some rude provisional species, as if your average quadruped had impeccable table manners and a pension plan. Then he switches from the horses’ perspective to the narrator’s, though just what something imperfect and malformed refers to is unclear. The last half sentence only deepens the confusion. Is the thing smirking deep in the eyes of grace the same thing that is lodged in the heart of being? And what is a gorgon doing in a pool? Or is it peering into it? And why an autumn pool? I doubt if McCarthy can explain any of this; he probably just likes the way it sounds.\nNo novelist with a sense of the ridiculous would write such nonsense. Although his characters sometimes rib one another, McCarthy is among the most humorless writers in American history. In this excerpt the subject is horses.\nHe said that the souls of horses mirror the souls of men more closely than men suppose and that horses also love war. Men say they only learn this but he said that no creature can learn that which his heart has no shape to hold … Lastly he said that he had seen the souls of horses and that it was a terrible thing to see. He said that it could be seen under certain circumstances attending the death of a horse because the horse shares a common soul and its separate life only forms it out of all horses and makes it mortal … Finally John Grady asked him if it were not true that should all horses vanish from the face of the earth the soul of the horse would not also perish for there would be nothing out of which to replenish it but the old man only said that it was pointless to speak of there being no horses in the world for God would not permit such a thing.\n(All the Pretty Horses)\nThe further we get from our cowboy past, the loonier becomes the hippophilia we attribute to it. More to the point, especially considering The New York Times’s praise of All the Pretty Horses for its “realistic dialogue,” is the stiltedness with which the conversation is reproduced. The cowboys are supposed to be talking to a Mexican in Spanish, which is a stretch to begin with, but from the tone in which the conversation is set down you’d think it was ancient Hebrew. And shouldn’t Grady satisfy our curiosity by finding out what a horse’s soul looks like, instead of pursuing a hypothetical point of equine theology? You half expect him to ask how many horses’ souls can fit on the head of a pin.\nAll the Pretty Horses received the National Book Award in 1992. “Not until now,” the judges wrote in their fatuous citation, “has the unhuman world been given its own holy canon.” What a difference a pseudo-biblical style makes; this so-called canon has little more to offer than the conventional belief that horses, like dogs, serve us well enough to merit exemption from an otherwise sweeping disregard for animal life. (No one ever sees a cow’s soul.) McCarthy’s fiction may be less fun than the “genre” western, but its world view is much the same. So is the cast of characters: the quiet cowboys, the women who “like to see a man eat,” the howling savages. (In fairness to the western: McCarthy’s depiction of Native Americans in Blood Meridian [1985] is far more offensive than anything in Louis L’ Amour.) The critics, however, are too much impressed by the muscles of his prose to care about the heart underneath. Even The Village Voice has called McCarthy “a master stylist, perhaps without equal in American letters.” Robert Hass wrote much of his review of The Crossing in an earnest imitation of McCarthy’s style:\nThe boys travel through this world, tipping their hats, saying “yessir” and “nosir” and “si” and “es verdad” and “claro” to all its potential malice, its half-mad philosophers, as the world washes over and around them, and the brothers themselves come to be as much arrested by the gesture of the quest as the old are by their stores of bitter wisdom and the other travelers, in the middle of life, in various stages of the arc between innocence and experience, by whatever impulses have placed them on the road.\nThe vagueness of that encomium must annoy McCarthy, who prides himself on the way he tackles “issues of life and death” head on. In interviews he presents himself as a man’s man with no time for pansified intellectuals—a literary version, if you will, of Dave Thomas, the smugly parochial old-timer in the Wendy’s commercials. It would be both unfair and a little too charitable to suggest that this is just a pose. When McCarthy says of Marcel Proust and Henry James, “I don’t understand them. To me, that’s not literature,” I have a sinking feeling he’s telling the truth.\nThe essay finally made it clear to me what these modern literaturists – one hesitates to call them actual writers – are doing, and it’s not dissimilar to what the gammas are doing with their terrible, narcissistic metaphors. Their words are not meant to be read as words as such, but are meant to be lightly scanned, so that an impression is formed by that superficial contact.\nThat’s why there is so often no meaning to be found in their works, that there is neither action nor character to be found in the texts.\nNo one actually reads these books!\nThey are, instead, scanned, with no more comprehension of the empty contents surveyed than the whole language reader grasps the phonetics of the words he is reading.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-25T11:25:00+00:00"
}