{
  "url": "https://voxday.net/2017/07/18/name-defamatory-jewish-organization/",
  "scraped_at": "2025-12-18T07:23:04.985593",
  "title": "Name the defamatory Jewish organization",
  "date_display": "July 18, 2017",
  "date_iso": "2017-07-18T20:34:00+00:00",
  "date_from_url": "2017-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If so-called “Anti-Defamation League” wants to live up to its mission of stopping the defamation of the Jewish people, perhaps they should try <a href=\"https://www.adl.org/education/resources/backgrounders/from-alt-right-to-alt-lite-naming-the-hate\">not blatantly lying about people</a>. I very much doubt they are making any friends here with their attack on me and several of my friends and allies.</p><blockquote class=\"tr_bq\"><p> Theodore Beale aka Vox Day is a champion of the alt right movement who claims to have popularized the term “cuckservative.” A science fiction writer, video game designer and blogger, Beale is best known in alt right circles for his online blog “Vox Popoli” (Voice of the People) where he posts misogynistic, white supremacist diatribes. Beale’s white supremacist beliefs are on full display in one of his primary talking points: “The Alt Right believes we must secure the existence of white people and a future for white children.” This is an unabashed homage to the white supremacist “14 words” mantra.</p></blockquote><p>There are five lies here, at least four of them knowingly defamatory.</p><ul><li>I do not post misogynistic diatribes here or anywhere. I do not hate women and it is a shameless lie to claim that I do.</li><li>I do not post white supremacist diatribes here or anywhere. I am not a white supremacist. I do not believe in racial supremacy of any kind.</li><li>My beliefs are not white supremacist. I am not a white supremacist. I do not believe in racial supremacy of any kind.</li><li>The belief in securing the existence of white people and a future for white children is no more “white supremacy” than stopping the defamation of the Jewish people is “Jewish supremacy”.</li><li>The presence of Point 14 in the 16 Points is not “an unabashed homage” to the 14 Words. It is a direct citation of them. But the position is not a “white supremacist” position, as my rejection of many of the 88 points suffices to demonstrate.</li></ul><div> Furthermore, I am an American Indian and it is as every bit as offensive to claim that I am a “white supremacist” as it is to claim that a Jew is a ZioNazi. I will be writing to the ADL requesting a public retraction and an apology. Their treatment of me, and of others on their list, in the article entitled <a href=\"https://www.adl.org/education/resources/backgrounders/from-alt-right-to-alt-lite-naming-the-hate\">Naming the Hate</a>, is, contra their mission statement, neither fair nor just.<p>And just in case it is not clear, I’m not a cuckservative and I’m not the least bit impressed by the dishonest rhetoric hurled indiscriminately about by a few cry-Holocaust-for-profit devil worshippers. They make it <i>abundantly</i> clear that they serve the Father of Lies, and they merit nothing but contempt.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/DFFTy12XcAAW7ds.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"188\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DFFTy12XcAAW7ds.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"188\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DFFTy12XcAAW7ds.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20188%22%3E%3C/svg%3E\"/></a></div><p></p></div></div>",
  "content_text": "If so-called “Anti-Defamation League” wants to live up to its mission of stopping the defamation of the Jewish people, perhaps they should try\nnot blatantly lying about people\n. I very much doubt they are making any friends here with their attack on me and several of my friends and allies.\nTheodore Beale aka Vox Day is a champion of the alt right movement who claims to have popularized the term “cuckservative.” A science fiction writer, video game designer and blogger, Beale is best known in alt right circles for his online blog “Vox Popoli” (Voice of the People) where he posts misogynistic, white supremacist diatribes. Beale’s white supremacist beliefs are on full display in one of his primary talking points: “The Alt Right believes we must secure the existence of white people and a future for white children.” This is an unabashed homage to the white supremacist “14 words” mantra.\nThere are five lies here, at least four of them knowingly defamatory.\nI do not post misogynistic diatribes here or anywhere. I do not hate women and it is a shameless lie to claim that I do.\nI do not post white supremacist diatribes here or anywhere. I am not a white supremacist. I do not believe in racial supremacy of any kind.\nMy beliefs are not white supremacist. I am not a white supremacist. I do not believe in racial supremacy of any kind.\nThe belief in securing the existence of white people and a future for white children is no more “white supremacy” than stopping the defamation of the Jewish people is “Jewish supremacy”.\nThe presence of Point 14 in the 16 Points is not “an unabashed homage” to the 14 Words. It is a direct citation of them. But the position is not a “white supremacist” position, as my rejection of many of the 88 points suffices to demonstrate.\nFurthermore, I am an American Indian and it is as every bit as offensive to claim that I am a “white supremacist” as it is to claim that a Jew is a ZioNazi. I will be writing to the ADL requesting a public retraction and an apology. Their treatment of me, and of others on their list, in the article entitled\nNaming the Hate\n, is, contra their mission statement, neither fair nor just.\nAnd just in case it is not clear, I’m not a cuckservative and I’m not the least bit impressed by the dishonest rhetoric hurled indiscriminately about by a few cry-Holocaust-for-profit devil worshippers. They make it\nabundantly\nclear that they serve the Father of Lies, and they merit nothing but contempt.",
  "tags": [
    "SJW",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-18T19:34:00+00:00"
}