{
  "url": "https://voxday.net/2017/07/24/on-bad-writing/",
  "scraped_at": "2025-12-18T07:23:52.985884",
  "title": "On bad writing",
  "date_display": "July 24, 2017",
  "date_iso": "2017-07-24T19:55:00+00:00",
  "date_from_url": "2017-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was talking to one of our authors today, trying to understand why authors so often make a certain style of mistake that has puzzled me for years. He actually managed to articulate it, and I found the explanation to be rather fascinating as well as potentially useful to those who are trying to improve their literary style. I think it is something that separates bad writing from competent writing.</p><p>What we were discussing is the nonsensical metaphor or simile. Now, I have used a nonsensical simile at least once myself, although I did so knowingly, as it was an inside joke. Some old-school Ilk might remember the phrase “then it hit him, like a cheetah” from Rebel Moon. That was something my best friend’s brother used to say, because my best friend’s brother is a complete goofball who gloried in saying nonsensical things like that. The point is that I knew it was a silly simile and horrifically bad writing, although I suppose it is not a nonsensical simile from a technical perspective, since being hit by a cheetah at 60+ MPH would presumably be the sort of thing that would bowl one over.</p><p>However, as the writer explained, the mediocre writer doesn’t know that the metaphor or the simile is nonsensical. To him, it is an emotionally true connection, and therefore it makes sense, even when it objectively doesn’t. For the purposes of reference, here are the four examples from the rough draft to which the author, Johan Kalsi, is referring, a bizarre metaphor that completely mystified me, and not only because the author utilized it FOUR FREAKING TIMES in a single scene.</p><p><i>Jeckell’s broad, sleepy face held his lips in a strange smile, as if he had just caught a mouse between his teeth. </i><br> <i><br/></i><br> <i>Jeckell continued to chew on his mouse, doing nothing to wipe his face clean of its aura of smug supremacy.</i><br> <i><br/></i><br> <i>Jeckell stopped gnawing the imaginary mouse for a moment.</i><br> <i><br/></i><br> <i>Everyone gasped. Jeckell stood up and punched the table in front of him, his jaw clenched back down on the mouse.</i></br></br></br></br></br></br></p><p>I like to think that my editorial comments were polite, professional and helpful: <i>“What the fuck is going on with this guy chewing on a nonexistent mouse? What does that even look like? Lose the fucking mouse!”</i></p><p>I mean, this was, by any measure, bad writing. Fine, everyone commits their clunkers from time to time. But this is a weird mistake, and one I see far too often these days, with authors using words they apparently don’t understand and images that simply don’t make any kind of sense. Fortunately, Mr. Kalsi was able to put this particular example into perspective that at least make a modicum of sense, and should help people avoid making this particular mistake.</p><ul><li>I was trying to emulate Asimov’s long Q&amp;A scene from Foundation, which I don’t like, and I was being lazy – I hadn’t figured out good words to make the bureaucrat both human and annoying, so I just wrote that mouse thing in, because I had an image in my head of this fat old barn cat I came across when I was a kid. I opened a bag of feed, and this cat was in there, chewing on a wriggling mouse. It was a disturbing, vivid, shocking thing, and I still remember that cat’s dead eyes looking at me like, “What, asshole? Just watch it wriggle.”</li><li>Emotionally, I thought of the bureaucrat like that – this perfectly harmless guy that the First Technocrat had known for decades, who suddenly held his life in his hands, and didn’t care a bit.</li><li>Of course, some random personal memory means nothing to you or any other reader, and that’s why it is such an annoying dig at the reader.</li><li>A bad writer or a lazy writer won’t see when he does this (I think it got mentioned 3 times in a page or something, and I didn’t even remember I had written it at all when you pointed it out to me.)</li><li>A gamma will cling to this personal image as a secret king thing – “Oh, the peasant reader doesn’t get me – I’m a genius!” and as an excuse thing when the criticism comes. – Delusional</li><li>The old big writers I can think of who did it a lot were Stephen King (the lady in Misery has “a face like a tornado” twice in two pages, for example – memorable for the wrong reasons) Piers Anthony and Philip Jose Farmer.</li></ul><div> Kalsi is right. A face like a tornado makes no more sense than a man gnawing on a mouse. Remember, writing is <i>communication</i>. So, off-hand implied references to personal memories or associations that are not accessible to your readers is not going to make you look brilliant, it’s just going to make you a bad writer.</div></div>",
  "content_text": "I was talking to one of our authors today, trying to understand why authors so often make a certain style of mistake that has puzzled me for years. He actually managed to articulate it, and I found the explanation to be rather fascinating as well as potentially useful to those who are trying to improve their literary style. I think it is something that separates bad writing from competent writing.\nWhat we were discussing is the nonsensical metaphor or simile. Now, I have used a nonsensical simile at least once myself, although I did so knowingly, as it was an inside joke. Some old-school Ilk might remember the phrase “then it hit him, like a cheetah” from Rebel Moon. That was something my best friend’s brother used to say, because my best friend’s brother is a complete goofball who gloried in saying nonsensical things like that. The point is that I knew it was a silly simile and horrifically bad writing, although I suppose it is not a nonsensical simile from a technical perspective, since being hit by a cheetah at 60+ MPH would presumably be the sort of thing that would bowl one over.\nHowever, as the writer explained, the mediocre writer doesn’t know that the metaphor or the simile is nonsensical. To him, it is an emotionally true connection, and therefore it makes sense, even when it objectively doesn’t. For the purposes of reference, here are the four examples from the rough draft to which the author, Johan Kalsi, is referring, a bizarre metaphor that completely mystified me, and not only because the author utilized it FOUR FREAKING TIMES in a single scene.\nJeckell’s broad, sleepy face held his lips in a strange smile, as if he had just caught a mouse between his teeth.\nJeckell continued to chew on his mouse, doing nothing to wipe his face clean of its aura of smug supremacy.\nJeckell stopped gnawing the imaginary mouse for a moment.\nEveryone gasped. Jeckell stood up and punched the table in front of him, his jaw clenched back down on the mouse.\nI like to think that my editorial comments were polite, professional and helpful:\n“What the fuck is going on with this guy chewing on a nonexistent mouse? What does that even look like? Lose the fucking mouse!”\nI mean, this was, by any measure, bad writing. Fine, everyone commits their clunkers from time to time. But this is a weird mistake, and one I see far too often these days, with authors using words they apparently don’t understand and images that simply don’t make any kind of sense. Fortunately, Mr. Kalsi was able to put this particular example into perspective that at least make a modicum of sense, and should help people avoid making this particular mistake.\nI was trying to emulate Asimov’s long Q&A scene from Foundation, which I don’t like, and I was being lazy – I hadn’t figured out good words to make the bureaucrat both human and annoying, so I just wrote that mouse thing in, because I had an image in my head of this fat old barn cat I came across when I was a kid. I opened a bag of feed, and this cat was in there, chewing on a wriggling mouse. It was a disturbing, vivid, shocking thing, and I still remember that cat’s dead eyes looking at me like, “What, asshole? Just watch it wriggle.”\nEmotionally, I thought of the bureaucrat like that – this perfectly harmless guy that the First Technocrat had known for decades, who suddenly held his life in his hands, and didn’t care a bit.\nOf course, some random personal memory means nothing to you or any other reader, and that’s why it is such an annoying dig at the reader.\nA bad writer or a lazy writer won’t see when he does this (I think it got mentioned 3 times in a page or something, and I didn’t even remember I had written it at all when you pointed it out to me.)\nA gamma will cling to this personal image as a secret king thing – “Oh, the peasant reader doesn’t get me – I’m a genius!” and as an excuse thing when the criticism comes. – Delusional\nThe old big writers I can think of who did it a lot were Stephen King (the lady in Misery has “a face like a tornado” twice in two pages, for example – memorable for the wrong reasons) Piers Anthony and Philip Jose Farmer.\nKalsi is right. A face like a tornado makes no more sense than a man gnawing on a mouse. Remember, writing is\ncommunication\n. So, off-hand implied references to personal memories or associations that are not accessible to your readers is not going to make you look brilliant, it’s just going to make you a bad writer.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-24T18:55:00+00:00"
}