{
  "url": "https://voxday.net/2017/07/07/on-restoration-of-paganis/",
  "scraped_at": "2025-12-18T07:21:32.377454",
  "title": "On the restoration of paganism",
  "date_display": "July 7, 2017",
  "date_iso": "2017-07-07T10:35:00+00:00",
  "date_from_url": "2017-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>It’s not uncommon to hear atheists and other unbelievers who wish to defend Christendom, but do so without Christianity, suggesting that perhaps a return to European paganism is an option for replacing what is now the obvious failure of godless secularism. This selection from the 1911 edition of the Cambridge Medieval History series, Volume I, should suffice to indicate why that will not work. When even an intelligent emperor with an excellent character and all the imperial power of Rome could not suffice, the wistful yearnings of a few poorly-educated neopagans will not either. </i><br> <i><br/></i><br> <i>There is only one solution, and that is the repentance and cleansing of the European churches leading to a Christian revival and a new Crusade. If you seek to defeat the resurgent Paynim and their globalist enablers, you must embrace Deus Vult and the Church Militant. Western civilization is the combination of the European nations, the Graeco-Roman legacy, and Christianity. It cannot survive  – it cannot exist – without any of those three elements.</i></br></br></p><p>One feature of Julian’s attempt to make the worship of the gods the universal and privileged religion of the Empire is too characteristic of the age to be entirely passed over. In the opening pages of this chapter, in which the living paganism of the third and fourth centuries is briefly described, it is shewn that the old official worships of Greece and Rome lingered as mere simulacra and that the real religious life of the times was fed by Oriental faiths which had introduced such thoughts as redemption, salvation, purification, the Way of Return, etc. It is not too much to say that whatever of the old pagan piety remained in the middle of’the fourth century had attached itself to the worship of the Mysteries ; and that pious men, if educated, looked on the different initiations and rites of purification taught in the various cults to be ways of attaining the same redemption, or finding the same Way of Return. Julian belonged to his age. He was a pure-hearted and deeply pious man. His piety was in a real sense heart religion, and, like that of his contemporaries, clothed itself in the cult of the Mysteries ; while his nervous, sensitive character inclined him personally to the theurgic or magical side of the cult, and especially to what reproduced the old Dionysiac ecstasy. Hence the dominating thought in Julian’s mind was to reform the whole public worship of paganism by impregnating it with the real piety and heart religion of the Mysteries cult. The one thing really reactionary in the movement he contemplated was the return to the worship of the old official deities, but he proposed to attempt this in a way which can only be called revolutionary. He endeavoured to put life into the old rituals by bringing to their aid and quickening them with that sincere fervour which the Mysteries cult demanded from its votaries.</p><p>This is what makes Julian such an interesting figure in the history of paganism; while it in part accounts for his complete failure to do what he attempted. He tried to unite two things which had utterly separate roots, whose ideals were different, and which could not easily blend. For the religion of the Mysteries was essentially a private cult, into which men and women were received, one by one, by rites of initiation which each had to pass through personally, and, when admitted, they became members of coteries, large or small, of like-minded persons. They had entered because their souls had craved something which they believed the initiations and purifications would give. It was a common saying among them that as sickness of the body needed medicine, so the sickness of the soul required those rites to which they submitted. What had this to do with the courteous recognition due to bright celestial beings which was the central thought of the official religion of Greece, or the punctilious performance of ceremonies which was believed to propitiate the sterner deities of Rome ? Mysteries and participation in their rites may exist along with a belief in the necessity and religious value of the public services of a state religion; but whenever the latter can only be justified, even by its own votaries, on the ground of traditional and patriotic propriety, Mystery worship may take its place but can never quicken it. When the whole piety of paganism disappeared in the Mysteries cult, it estranged itself from the national and official religion; and the Mysteries could never be used to recall the gods of Olympus for whose banishment they had been largely responsible.</p><p>No edicts of an Emperor could change the bright deities of Olympus into saviours, or transform their careless votaries into men who felt in their hearts the need of redemption and a way of return. Yet that was what Julian had to do when he proposed to impregnate the old official worship with the fervour of the Mysteries cult. It was equally in vain to think that the Mysteries cult, which owed its power to its spontaneity, to its independence, to its individuality, could be drilled and organised into the national religion of a great Empire. It was a true instinct that led Julian to see that the real and living pagan piety of his generation had taken refuge within the circles of the Mysteries, and that the hope of paganism lay in the spread of the fervour which kindled their votaries; his mistake lay in thinking that it could be used to requicken the official worship. It would have been better for his designs had he acted as did Vettius Agorius Praetextatus, the model of genuine pagan piety in the Roman senatorial circle (princeps religiosorum, Macrobius calls him). Praetextatus contented himself with a dignified and cool recognition of the official deities of Rome but sought outlet for his piety elsewhere, in initiations at Eleusis and other places and in the purifying rite of the taurobolium. The sentimental side of Julian’s nature led him astray. He could not forget his early studies in Homer and Hesiod (he quotes Homer as frequently and as fervently as a contemporary Christian does the Holy Scriptures) and he had to introduce the gods of Olympus somewhere. He tried to unite the passionate Oriental worships with the dignified Greek and the grave Roman ceremonies where personal faith was superfluous. The elements were too incongruous.</p><p>In spite of all the signs of a reaction against Christianity Julian failed; and for himself the tragedy of his failure lay in the apathy of his co-religionists. In spite of his elaborate treatise against Christianity and his other writings; notwithstanding his public orations and his private persuasions, Julian did not succeed in making many converts. We hear of no Christians of mark who embraced Hellenism, save the rhetorician Hecebolius and Pegasius, a bishop with a questionable past. The Emperor boasted that his Hellenism made some progress in the army, but at his death the legions selected a Christian successor.</p><p>It is almost pathetic to read Julian’s accounts of his continual disappointments. He could not find in “all Cappadocia a single man who was a true Hellenist.” They did not care to offer sacrifice, and those who_did so, did not know how. In Galatia, at Pessinus where stood a famous temple erected to the Great Mother, he had to bribe and threaten the inhabitants to do honour to the goddess. At Beroea he harangued the municipal council on the duty of worshipping the gods. “They all warmly praised my discourse,” he says somewhat sadly, “but none were convinced by it save the few who were convinced before hearing.” So it was wherever he went. Even pagan admirers like Ammianus Marcellinus were rather bored with the Emperor’s Hellenism and thought the whole thing a devout imagination not worth the trouble he wasted on it. The senatorial circle at Rome had no sympathy with Julian’s Hellenic revival. No one shewed any enthusiasm but the narrow circle of Neoplatonist sbphists, and they had no influence with the people.</p><p>Yet Julian’s attempt to stay the progress of Christianity and to drive back the tide which was submerging the Empire, was, with all its practical faults, by far the ablest yet conceived. It provided a substitute and presented an alternative. The substitute was pretentious and artificial, but it was probably the best that the times could furnish Hellenism, Julian called it; but where in that golden past of Hellas into which the Imperial dreamer peered, could be found a puritan strictness of conduct, a prolonged and sustained religious fervour, and a religion independent of the State? The three strongest parts of his scheme had no connexion with Hellenism. Religions may be used, but cannot be created by statesmen, unless they happen to have the prophetic fire and inspiration — and Julian was no prophet. He may be credited with seizing and combining in one whole the strongest anti-Christian forces of his generation — the passion of Oriental religion, the patriotic desire to retain the old religion under which Greece and Rome had grown great, the glory of the ancient literature, the superstition which clung to magic and divinations, and a philosophy which, if it lacked independence of thought, at least represented that eclecticism which was the intellectual atmosphere which all men then breathed. He brought them together to build an edifice which was to be the temple of his Empire. But though the builder had many of the qualities which go to make a religious reformer — pure in heart and life, full of sincere piety, manly and with a strong sense of duty — the edifice he reared was quite artificial, lacked the living principle of growth, and could not last. Athanasius gave its history in four words when he said “It will soon pass.” The world had outgrown paganism.</p><p>Whatever faults the Christianity of the time exhibited, whatever ills had come to it from Imperial patronage and conformity with the world, it still retained within it the original simplicity and profundity of its message. Nothing in its environment could take that from it. It proclaimed a living God, Who had made man and all things and for Whom man was made. That God had manifested Himself in Jesus Christ and the centre of the manifestation was the Passion of our Lord — the Cross.</p><p>The globalists understand <a href=\"https://www.unz.com/isteve/in-the-atlantic-peter-beinart-accuses-trump-of-paranoia-for-invoking-the-west/\">what the West is</a>:</p><blockquote><p> The West is not a geographic term. Poland is further east than Morocco. France is further east than Haiti. Australia is further east than Egypt. Yet Poland, France, and Australia are all considered part of “The West.” Morocco, Haiti, and Egypt are not.</p><p>The West is not an ideological or economic term either. India is the world’s largest democracy. Japan is among its most economically advanced nations. No one considers them part of the West.</p><p>The West is a racial and religious term. To be considered Western, a country must be largely Christian (preferably Protestant or Catholic) and largely white. Where there is ambiguity about a country’s “Westernness,” it’s because there is ambiguity about, or tension between, these two characteristics. Is Latin America Western? Maybe. Most of its people are Christian, but by U.S. standards, they’re not clearly white. Are Albania and Bosnia Western? Maybe. By American standards, their people are white. But they are also mostly Muslim.</p></blockquote><p>It is not a good sign of your strategic capabilities when your enemies understand what you are defending better than you do.</p></div>",
  "content_text": "It’s not uncommon to hear atheists and other unbelievers who wish to defend Christendom, but do so without Christianity, suggesting that perhaps a return to European paganism is an option for replacing what is now the obvious failure of godless secularism. This selection from the 1911 edition of the Cambridge Medieval History series, Volume I, should suffice to indicate why that will not work. When even an intelligent emperor with an excellent character and all the imperial power of Rome could not suffice, the wistful yearnings of a few poorly-educated neopagans will not either.\nThere is only one solution, and that is the repentance and cleansing of the European churches leading to a Christian revival and a new Crusade. If you seek to defeat the resurgent Paynim and their globalist enablers, you must embrace Deus Vult and the Church Militant. Western civilization is the combination of the European nations, the Graeco-Roman legacy, and Christianity. It cannot survive  – it cannot exist – without any of those three elements.\nOne feature of Julian’s attempt to make the worship of the gods the universal and privileged religion of the Empire is too characteristic of the age to be entirely passed over. In the opening pages of this chapter, in which the living paganism of the third and fourth centuries is briefly described, it is shewn that the old official worships of Greece and Rome lingered as mere simulacra and that the real religious life of the times was fed by Oriental faiths which had introduced such thoughts as redemption, salvation, purification, the Way of Return, etc. It is not too much to say that whatever of the old pagan piety remained in the middle of’the fourth century had attached itself to the worship of the Mysteries ; and that pious men, if educated, looked on the different initiations and rites of purification taught in the various cults to be ways of attaining the same redemption, or finding the same Way of Return. Julian belonged to his age. He was a pure-hearted and deeply pious man. His piety was in a real sense heart religion, and, like that of his contemporaries, clothed itself in the cult of the Mysteries ; while his nervous, sensitive character inclined him personally to the theurgic or magical side of the cult, and especially to what reproduced the old Dionysiac ecstasy. Hence the dominating thought in Julian’s mind was to reform the whole public worship of paganism by impregnating it with the real piety and heart religion of the Mysteries cult. The one thing really reactionary in the movement he contemplated was the return to the worship of the old official deities, but he proposed to attempt this in a way which can only be called revolutionary. He endeavoured to put life into the old rituals by bringing to their aid and quickening them with that sincere fervour which the Mysteries cult demanded from its votaries.\nThis is what makes Julian such an interesting figure in the history of paganism; while it in part accounts for his complete failure to do what he attempted. He tried to unite two things which had utterly separate roots, whose ideals were different, and which could not easily blend. For the religion of the Mysteries was essentially a private cult, into which men and women were received, one by one, by rites of initiation which each had to pass through personally, and, when admitted, they became members of coteries, large or small, of like-minded persons. They had entered because their souls had craved something which they believed the initiations and purifications would give. It was a common saying among them that as sickness of the body needed medicine, so the sickness of the soul required those rites to which they submitted. What had this to do with the courteous recognition due to bright celestial beings which was the central thought of the official religion of Greece, or the punctilious performance of ceremonies which was believed to propitiate the sterner deities of Rome ? Mysteries and participation in their rites may exist along with a belief in the necessity and religious value of the public services of a state religion; but whenever the latter can only be justified, even by its own votaries, on the ground of traditional and patriotic propriety, Mystery worship may take its place but can never quicken it. When the whole piety of paganism disappeared in the Mysteries cult, it estranged itself from the national and official religion; and the Mysteries could never be used to recall the gods of Olympus for whose banishment they had been largely responsible.\nNo edicts of an Emperor could change the bright deities of Olympus into saviours, or transform their careless votaries into men who felt in their hearts the need of redemption and a way of return. Yet that was what Julian had to do when he proposed to impregnate the old official worship with the fervour of the Mysteries cult. It was equally in vain to think that the Mysteries cult, which owed its power to its spontaneity, to its independence, to its individuality, could be drilled and organised into the national religion of a great Empire. It was a true instinct that led Julian to see that the real and living pagan piety of his generation had taken refuge within the circles of the Mysteries, and that the hope of paganism lay in the spread of the fervour which kindled their votaries; his mistake lay in thinking that it could be used to requicken the official worship. It would have been better for his designs had he acted as did Vettius Agorius Praetextatus, the model of genuine pagan piety in the Roman senatorial circle (princeps religiosorum, Macrobius calls him). Praetextatus contented himself with a dignified and cool recognition of the official deities of Rome but sought outlet for his piety elsewhere, in initiations at Eleusis and other places and in the purifying rite of the taurobolium. The sentimental side of Julian’s nature led him astray. He could not forget his early studies in Homer and Hesiod (he quotes Homer as frequently and as fervently as a contemporary Christian does the Holy Scriptures) and he had to introduce the gods of Olympus somewhere. He tried to unite the passionate Oriental worships with the dignified Greek and the grave Roman ceremonies where personal faith was superfluous. The elements were too incongruous.\nIn spite of all the signs of a reaction against Christianity Julian failed; and for himself the tragedy of his failure lay in the apathy of his co-religionists. In spite of his elaborate treatise against Christianity and his other writings; notwithstanding his public orations and his private persuasions, Julian did not succeed in making many converts. We hear of no Christians of mark who embraced Hellenism, save the rhetorician Hecebolius and Pegasius, a bishop with a questionable past. The Emperor boasted that his Hellenism made some progress in the army, but at his death the legions selected a Christian successor.\nIt is almost pathetic to read Julian’s accounts of his continual disappointments. He could not find in “all Cappadocia a single man who was a true Hellenist.” They did not care to offer sacrifice, and those who_did so, did not know how. In Galatia, at Pessinus where stood a famous temple erected to the Great Mother, he had to bribe and threaten the inhabitants to do honour to the goddess. At Beroea he harangued the municipal council on the duty of worshipping the gods. “They all warmly praised my discourse,” he says somewhat sadly, “but none were convinced by it save the few who were convinced before hearing.” So it was wherever he went. Even pagan admirers like Ammianus Marcellinus were rather bored with the Emperor’s Hellenism and thought the whole thing a devout imagination not worth the trouble he wasted on it. The senatorial circle at Rome had no sympathy with Julian’s Hellenic revival. No one shewed any enthusiasm but the narrow circle of Neoplatonist sbphists, and they had no influence with the people.\nYet Julian’s attempt to stay the progress of Christianity and to drive back the tide which was submerging the Empire, was, with all its practical faults, by far the ablest yet conceived. It provided a substitute and presented an alternative. The substitute was pretentious and artificial, but it was probably the best that the times could furnish Hellenism, Julian called it; but where in that golden past of Hellas into which the Imperial dreamer peered, could be found a puritan strictness of conduct, a prolonged and sustained religious fervour, and a religion independent of the State? The three strongest parts of his scheme had no connexion with Hellenism. Religions may be used, but cannot be created by statesmen, unless they happen to have the prophetic fire and inspiration — and Julian was no prophet. He may be credited with seizing and combining in one whole the strongest anti-Christian forces of his generation — the passion of Oriental religion, the patriotic desire to retain the old religion under which Greece and Rome had grown great, the glory of the ancient literature, the superstition which clung to magic and divinations, and a philosophy which, if it lacked independence of thought, at least represented that eclecticism which was the intellectual atmosphere which all men then breathed. He brought them together to build an edifice which was to be the temple of his Empire. But though the builder had many of the qualities which go to make a religious reformer — pure in heart and life, full of sincere piety, manly and with a strong sense of duty — the edifice he reared was quite artificial, lacked the living principle of growth, and could not last. Athanasius gave its history in four words when he said “It will soon pass.” The world had outgrown paganism.\nWhatever faults the Christianity of the time exhibited, whatever ills had come to it from Imperial patronage and conformity with the world, it still retained within it the original simplicity and profundity of its message. Nothing in its environment could take that from it. It proclaimed a living God, Who had made man and all things and for Whom man was made. That God had manifested Himself in Jesus Christ and the centre of the manifestation was the Passion of our Lord — the Cross.\nThe globalists understand\nwhat the West is\n:\nThe West is not a geographic term. Poland is further east than Morocco. France is further east than Haiti. Australia is further east than Egypt. Yet Poland, France, and Australia are all considered part of “The West.” Morocco, Haiti, and Egypt are not.\nThe West is not an ideological or economic term either. India is the world’s largest democracy. Japan is among its most economically advanced nations. No one considers them part of the West.\nThe West is a racial and religious term. To be considered Western, a country must be largely Christian (preferably Protestant or Catholic) and largely white. Where there is ambiguity about a country’s “Westernness,” it’s because there is ambiguity about, or tension between, these two characteristics. Is Latin America Western? Maybe. Most of its people are Christian, but by U.S. standards, they’re not clearly white. Are Albania and Bosnia Western? Maybe. By American standards, their people are white. But they are also mostly Muslim.\nIt is not a good sign of your strategic capabilities when your enemies understand what you are defending better than you do.",
  "tags": [
    "Christianity",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-07T09:35:00+00:00"
}