{
  "url": "https://voxday.net/2017/07/04/speaking-of-john-c-wrig/",
  "scraped_at": "2025-12-18T07:21:06.737569",
  "title": "Better than Reagan",
  "date_display": "July 4, 2017",
  "date_iso": "2017-07-04T23:19:00+00:00",
  "date_from_url": "2017-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of John C. Wright, the science fiction and fantasy grandmaster reminds us that while the God-Emperor is overturning the media’s collective apple cart with his tweets, <a href=\"http://www.scifiwright.com/2017/07/not-tired-of-winning-yet-xxvi/\">he is also getting a great deal done</a>:</p><blockquote><p> President Trump fulfilled another campaign promise and recinded the absurdly unconstitutional Johnson Amendment, which is a Dem administration IRS regulation threatening preachers, priests and pastors with loss of their tax free status for their churches should they ever speak on political matters from the pulpit.</p><p>I had never heard any so called conservative politicians even speaking on the topic of the Johnson Amendment erenow. It has been in place for decades, an insolent, open, filthy, glaring, and obvious desecration of the central Constitutional liberty embodied in the First Amendment.</p></blockquote><p>Donald Trump is already showing strong signs of being the best and most conservative President the United States has had since Calvin Coolidge. Believe it or not, he’s much, much better than Ronald Reagan ever was. I was there. I loved Reagan. And the God-Emperor is, to this point, doing much better than Reagan.</p><p>Still. Not. Tired.<br> <a href=\"https://www.periscope.tv/voxday/1eaKbYgWMQZxX\"><br/></a><br> <a href=\"https://www.periscope.tv/voxday/1eaKbYgWMQZxX\">On tonight’s Darkstream</a>, I explained how Trump has gotten off to a much better start than Reagan did in 1981, and also mentioned some ideas about the possible purpose behind the God-Emperor’s meeting with Vladimir Putin this week.</br></br></p></div>",
  "content_text": "Speaking of John C. Wright, the science fiction and fantasy grandmaster reminds us that while the God-Emperor is overturning the media’s collective apple cart with his tweets,\nhe is also getting a great deal done\n:\nPresident Trump fulfilled another campaign promise and recinded the absurdly unconstitutional Johnson Amendment, which is a Dem administration IRS regulation threatening preachers, priests and pastors with loss of their tax free status for their churches should they ever speak on political matters from the pulpit.\nI had never heard any so called conservative politicians even speaking on the topic of the Johnson Amendment erenow. It has been in place for decades, an insolent, open, filthy, glaring, and obvious desecration of the central Constitutional liberty embodied in the First Amendment.\nDonald Trump is already showing strong signs of being the best and most conservative President the United States has had since Calvin Coolidge. Believe it or not, he’s much, much better than Ronald Reagan ever was. I was there. I loved Reagan. And the God-Emperor is, to this point, doing much better than Reagan.\nStill. Not. Tired.\nOn tonight’s Darkstream\n, I explained how Trump has gotten off to a much better start than Reagan did in 1981, and also mentioned some ideas about the possible purpose behind the God-Emperor’s meeting with Vladimir Putin this week.",
  "tags": [
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-04T22:19:00+00:00"
}