{
  "url": "https://voxday.net/2017/07/10/surrender-or-antisemite/",
  "scraped_at": "2025-12-18T07:21:55.784836",
  "title": "Surrender or antisemite",
  "date_display": "July 10, 2017",
  "date_iso": "2017-07-10T08:19:00+00:00",
  "date_from_url": "2017-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those are <a href=\"https://www.defendevropa.org/2017/other-news/criticism-george-soros-antisemitic-says-israeli-official/\">the options being presented</a> by the Israeli ambassador to Hungary. I have no doubt that Hungary will rightly choose the latter.</p><blockquote><p> The Israeli ambassador in Budapest has called on the Hungarian government to end its campaign against Jewish billionaire George Soros, which he claims is stoking antisemitic sentiment.</p><p>The Hungarian government has recently rolled out a nationwide billboard campaign, urging Hungarians to stand firm against the ruinous influence of the Jewish financial speculator.</p><p>George Soros is well known for his involvement in the open borders campaign, with his Open Society organisation essentially acting as a front for the criminal people smugglers bringing third world migrants to Europe.</p><p>What is lesser known however, is the extent to which Soros is using his ‘soft power’ to influence civil society.</p><p>The Central European University in Budapest was founded and bankrolled by the Jewish billionaire, and has attempted to exert its influence against Viktor Orbán’s popular government in loosely veiled retaliation for recent legal measures against the university.</p><p>In recent months Hungary has seen protests by students carrying the Soros message against the potential closure of the university, with some fearing that this could be the beginning of another ‘colour revolution’.</p><p>Soros’ Open Society organisation has also worked tirelessly behind the scenes against the Hungarian government’s opposition to illegal immigration, despite the fact that 98.5% of Hungarians rejected illegal migrant quotas in a referendum just last year.</p><p>Yet despite the validity of the Hungarian government’s complaints against George Soros, it is apparently antisemitic to speak out.</p><p>Hungary’s largest Jewish organisation Mazsihisz has also called for the government to end its campaign, also on the basis that it is ‘antisemitic’.</p></blockquote><p>This is precisely why I don’t give an airborne rodent’s fornication about it when people cry antisemitism or Holocaust anymore. It’s no different than when Zoe Quinn or Anita Sarkeesian cry sexual harassment and death threats; the accusations are just a rhetorical means of attempting to shut down legitimate and well-merited criticism. There is simply no substance to them.</p><p>If you’re going to call me a Nazi, or a Fascist, or an antisemite, or a Holocaust denier, or a rape apologist, or an Alien Autopsy denier, or a racist sexist transgenderphobe, or an anthropogenic global warming denier, or whatever vituperative label you can concoct because I disagree with your belief that one world government under anyone but Jesus Christ is desirable, then I do not give so much as a single electron for your opinion.</p><p>The undeniable fact is that most people have a very good reason to hate certain individuals and what those individuals have done to their nations as well as the rest of Mankind. Their creed and ethnicity is irrelevant. If you don’t hate what Immanuel Celler did to the USA, you’re objectively anti-American. And if you don’t hate what George Soros has done to European countries from the UK to Hungary, you’re either evil yourself or you are simply unaware of the unmitigated wickedness of his globe-spanning Evil Society. And if you don’t hate <a href=\"http://www.milobookclub.com/2016/09/03/straight-from-source/\">these creeps</a> who believe God has chosen them to enslave the rest of humanity, well, you’re clearly suffering from a severe lack of self-esteem.</p></div>",
  "content_text": "Those are\nthe options being presented\nby the Israeli ambassador to Hungary. I have no doubt that Hungary will rightly choose the latter.\nThe Israeli ambassador in Budapest has called on the Hungarian government to end its campaign against Jewish billionaire George Soros, which he claims is stoking antisemitic sentiment.\nThe Hungarian government has recently rolled out a nationwide billboard campaign, urging Hungarians to stand firm against the ruinous influence of the Jewish financial speculator.\nGeorge Soros is well known for his involvement in the open borders campaign, with his Open Society organisation essentially acting as a front for the criminal people smugglers bringing third world migrants to Europe.\nWhat is lesser known however, is the extent to which Soros is using his ‘soft power’ to influence civil society.\nThe Central European University in Budapest was founded and bankrolled by the Jewish billionaire, and has attempted to exert its influence against Viktor Orbán’s popular government in loosely veiled retaliation for recent legal measures against the university.\nIn recent months Hungary has seen protests by students carrying the Soros message against the potential closure of the university, with some fearing that this could be the beginning of another ‘colour revolution’.\nSoros’ Open Society organisation has also worked tirelessly behind the scenes against the Hungarian government’s opposition to illegal immigration, despite the fact that 98.5% of Hungarians rejected illegal migrant quotas in a referendum just last year.\nYet despite the validity of the Hungarian government’s complaints against George Soros, it is apparently antisemitic to speak out.\nHungary’s largest Jewish organisation Mazsihisz has also called for the government to end its campaign, also on the basis that it is ‘antisemitic’.\nThis is precisely why I don’t give an airborne rodent’s fornication about it when people cry antisemitism or Holocaust anymore. It’s no different than when Zoe Quinn or Anita Sarkeesian cry sexual harassment and death threats; the accusations are just a rhetorical means of attempting to shut down legitimate and well-merited criticism. There is simply no substance to them.\nIf you’re going to call me a Nazi, or a Fascist, or an antisemite, or a Holocaust denier, or a rape apologist, or an Alien Autopsy denier, or a racist sexist transgenderphobe, or an anthropogenic global warming denier, or whatever vituperative label you can concoct because I disagree with your belief that one world government under anyone but Jesus Christ is desirable, then I do not give so much as a single electron for your opinion.\nThe undeniable fact is that most people have a very good reason to hate certain individuals and what those individuals have done to their nations as well as the rest of Mankind. Their creed and ethnicity is irrelevant. If you don’t hate what Immanuel Celler did to the USA, you’re objectively anti-American. And if you don’t hate what George Soros has done to European countries from the UK to Hungary, you’re either evil yourself or you are simply unaware of the unmitigated wickedness of his globe-spanning Evil Society. And if you don’t hate\nthese creeps\nwho believe God has chosen them to enslave the rest of humanity, well, you’re clearly suffering from a severe lack of self-esteem.",
  "tags": [
    "conspiracy",
    "rhetoric",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-10T07:19:00+00:00"
}