{
  "url": "https://voxday.net/2017/07/12/the-fabrication-of-anti-trump-attack/",
  "scraped_at": "2025-12-18T07:22:19.621857",
  "title": "The fabrication of an anti-Trump attack",
  "date_display": "July 12, 2017",
  "date_iso": "2017-07-12T22:36:00+00:00",
  "date_from_url": "2017-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember, /pol/ is always right. Not only has Weaponized Autism demonstrated that <a href=\"https://weaponizedautism.wordpress.com/2017/04/09/trump-dns-logs-fabricated/\">the Russian Server story is bogus</a>, they have identified the locus for the attack named “Tea Leaves”:</p><blockquote><p> On October 31, 2016, Slate published an article titled “Was a Trump Server Communicating With Russia?” This article described the work of Professor L. Jean Camp and her colleagues, all of whom had developed an interest in the activity of mail1.trump-email.com, an email-marketing server associated with the Trump Organization:</p><p>The computer scientists posited a logical hypothesis, which they set out to rigorously test: If the Russians were worming their way into the DNC, they might very well be attacking other entities central to the presidential campaign, including Donald Trump’s many servers. “We wanted to help defend both campaigns, because we wanted to preserve the integrity of the election,” says one of the academics, who works at a university that asked him not to speak with reporters because of the sensitive nature of his work.</p><p>This professed altruism as a rationale for digital snooping may be hard to swallow given that Camp and her associates spend a great deal of time on Twitter launching unhinged attacks against President Trump, but pushing ahead, enter Tea Leaves:</p><p>In late July, one of these scientists—who asked to be referred to as Tea Leaves, a pseudonym that would protect his relationship with the networks and banks that employ him to sift their data—found what looked like malware emanating from Russia. The destination domain had Trump in its name, which of course attracted Tea Leaves’ attention. But his discovery of the data was pure happenstance—a surprising needle in a large haystack of DNS lookups on his screen. “I have an outlier here that connects to Russia in a strange way,” he wrote in his notes. He couldn’t quite figure it out at first. But what he saw was a bank in Moscow that kept irregularly pinging a server registered to the Trump Organization on Fifth Avenue.</p><p>Tea Leaves is another piece of work in the “concerned and impartial researcher” department. Check out Tea Leaves on medium.com (@tea.leaves) play-acting as the innocently curious Lea Vestea (roughly a cyclic permutation on “Tea Leaves,” in case you missed it):<br> <i><br/></i><br> <i>If you are a billionaire, do you have lesser people “take the fall” for you? We already saw a loyal Trump employee — who is a woman — used as a scapegoat in the scandal about Melania Trump plagiarizing a Michele Obama speech. </i><i>After reading details of an under-reported story that seems to be just emerging — I predict that The Donald will do it again and yet again find a woman amongst his large organization to blame his own extremely risky actions upon.</i></br></br></p><p>We were assured that known DNS experts vouched for the authenticity of the DNS logs. We were assured that nine computer scientists considered it nearly impossible for such logs to be forged or manipulated. And thus a virulent narrative was reinforced.</p></blockquote><p>Now, I neither know anything nor care about DNS lookups or servers so long as my Internet is working. And I always assumed that this “Russian server scandal” was just another anti-Trump put-up job, just like the current non-scandal involving Donald Trump Jr. is. But there is one thing about this that is very interesting to me as a writer. There is a <i>tremendous </i>tell in that quote from Tea Leaves, who was commonly supposed to be a man all along. See if you can spot it. I mean, does that read like anything a man would <i>ever </i>write?</p><p>No, it most certainly does not….</p></div>",
  "content_text": "Remember, /pol/ is always right. Not only has Weaponized Autism demonstrated that\nthe Russian Server story is bogus\n, they have identified the locus for the attack named “Tea Leaves”:\nOn October 31, 2016, Slate published an article titled “Was a Trump Server Communicating With Russia?” This article described the work of Professor L. Jean Camp and her colleagues, all of whom had developed an interest in the activity of mail1.trump-email.com, an email-marketing server associated with the Trump Organization:\nThe computer scientists posited a logical hypothesis, which they set out to rigorously test: If the Russians were worming their way into the DNC, they might very well be attacking other entities central to the presidential campaign, including Donald Trump’s many servers. “We wanted to help defend both campaigns, because we wanted to preserve the integrity of the election,” says one of the academics, who works at a university that asked him not to speak with reporters because of the sensitive nature of his work.\nThis professed altruism as a rationale for digital snooping may be hard to swallow given that Camp and her associates spend a great deal of time on Twitter launching unhinged attacks against President Trump, but pushing ahead, enter Tea Leaves:\nIn late July, one of these scientists—who asked to be referred to as Tea Leaves, a pseudonym that would protect his relationship with the networks and banks that employ him to sift their data—found what looked like malware emanating from Russia. The destination domain had Trump in its name, which of course attracted Tea Leaves’ attention. But his discovery of the data was pure happenstance—a surprising needle in a large haystack of DNS lookups on his screen. “I have an outlier here that connects to Russia in a strange way,” he wrote in his notes. He couldn’t quite figure it out at first. But what he saw was a bank in Moscow that kept irregularly pinging a server registered to the Trump Organization on Fifth Avenue.\nTea Leaves is another piece of work in the “concerned and impartial researcher” department. Check out Tea Leaves on medium.com (@tea.leaves) play-acting as the innocently curious Lea Vestea (roughly a cyclic permutation on “Tea Leaves,” in case you missed it):\nIf you are a billionaire, do you have lesser people “take the fall” for you? We already saw a loyal Trump employee — who is a woman — used as a scapegoat in the scandal about Melania Trump plagiarizing a Michele Obama speech.\nAfter reading details of an under-reported story that seems to be just emerging — I predict that The Donald will do it again and yet again find a woman amongst his large organization to blame his own extremely risky actions upon.\nWe were assured that known DNS experts vouched for the authenticity of the DNS logs. We were assured that nine computer scientists considered it nearly impossible for such logs to be forged or manipulated. And thus a virulent narrative was reinforced.\nNow, I neither know anything nor care about DNS lookups or servers so long as my Internet is working. And I always assumed that this “Russian server scandal” was just another anti-Trump put-up job, just like the current non-scandal involving Donald Trump Jr. is. But there is one thing about this that is very interesting to me as a writer. There is a\ntremendous\ntell in that quote from Tea Leaves, who was commonly supposed to be a man all along. See if you can spot it. I mean, does that read like anything a man would\never\nwrite?\nNo, it most certainly does not….",
  "tags": [
    "conspiracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-12T21:36:00+00:00"
}