{
  "url": "https://voxday.net/2017/07/06/the-west-will-never-ever-be-broken/",
  "scraped_at": "2025-12-18T07:21:25.028777",
  "title": "The West will never, ever be broken",
  "date_display": "July 6, 2017",
  "date_iso": "2017-07-06T16:49:00+00:00",
  "date_from_url": "2017-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A transcript of President Donald Trump’s speech in Poland. It was an excellent, inspiring speech. The God-Emperor may not be properly Alt-Right, not yet. But he is sure sounding more than a little Alt-West.</i></p><p>TRUMP: Thank you very much. That’s so nice.</p><p>The United States has many great diplomats, but there is truly no better ambassador for our country than our beautiful first lady, Melania.</p><p>Thank you, Melania. That was very nice.</p><p>We’ve come to your nation to deliver a very important message: America loves Poland and America loves the Polish people. Thank you.</p><p>The Poles have not only greatly enriched this region, but Polish- Americans have also greatly enriched the United States. And I was truly proud to have their support in the 2016 election.</p><p>It is a profound honor to stand in this city by this monument to the Warsaw uprising, and to address the Polish nation that so many generations have dreamed of, a Poland that is safe, strong and free.</p><p>President Duda and your wonderful first lady, Agata, have welcomed us with the tremendous warmth and kindness for which Poland is known around the world.</p><p>Thank you.</p><p>I sincere — I mean sincerely — thank both of them, and to Prime Minister Szydlo a very special thanks, also … We are pleased that former President Lech Walesa, so famous for leading the Solidarity movement, has joined us today, also … Thank you. Thank you.</p><p>On behalf of all Americans, let me also thank the entire Polish people for the generosity you have shown in welcoming our soldiers to your country. These soldiers are not only brave defenders of freedom, but also symbols of America’s commitment to your security and your place in a strong and democratic Europe.</p><p>We are proudly joined on stage by American, Polish, British and Romanian soldiers. Thank you. Thank you. Great job.</p><p>President Duda and I have just come from an incredibly successful meeting with the leaders participating in the Three Seas Initiative.</p><p>To the citizens of this great region, America is eager to expand our partnership with you. We welcome stronger ties of trade and commerce as you grow your economies. And we are committed to securing your access to alternate sources of energy, so Poland and its neighbors are never again held hostage to a single supplier of energy.</p><p>Mr. President, I congratulate you, along with the president of Croatia, on your leadership of this historic Three Seas Initiative. Thank you.</p><p>This is my first visit to Central Europe as president, and I am thrilled that it could be right here, at this magnificent, beautiful piece of land. It is beautiful.</p><p>Poland is the geographic heart of Europe. But more importantly, in the Polish people, we see the soul of Europe.</p><p>Your nation is great because your spirit is great and your spirit is strong.</p><p><a name=\"more\"></a></p><p>For two centuries, Poland suffered constant and brutal attacks.</p><p>But while Poland could be invaded and occupied and its borders even erased from the map, it could never be erased from history or from your hearts. In those dark days, you have lost your land, but you never lost your pride.</p><p>So it is with true admiration I can say today, that from the farms and villages of your countryside, to the cathedrals and squares of your great cities, Poland lives, Poland prospers and Poland prevails.</p><p>Despite every effort to transform you, oppress you or destroy you, you endured and overcame.</p><p>You are the proud nation of Copernicus — think of that..</p><p>Chopin, St. John Paul II. Poland is a land of great heroes.</p><p>And you are a people who know the true value of what you defend.</p><p>The triumph of the Polish spirit over centuries of hardship gives us all hope for a future in which good conquers evil and peace achieves victory over war.</p><p>For Americans, Poland has been a symbol of hope since the beginning of our nation. Polish heroes and American patriots fought side by side in our War of Independence and in many wars that followed. Our soldiers still serve together today in Afghanistan and Iraq, combating the enemies of all civilization.</p><p>For America’s part, we have never given up on freedom and independence as the right and destiny of the Polish people. And we never, ever will.</p><p>Our two countries share a special bond forged by unique histories and national characters. It’s a fellowship that exists only among people who have fought and bled and died for freedom.</p><p>The signs of this friendship stand in our nation’s capital. Just steps from the White House, we’ve raised statues of men with names like Pulaski and Kosciuszko.</p><p>The same is true in Warsaw, where street signs carry the name of George Washington and a monument stands to one of the world’s greatest heroes, Ronald Reagan.</p><p>And so, I am here today not just to visit an old ally, but to hold it up as an example for others who seek freedom and who wish to summon the courage and the will to defend our civilization.</p><p>The story of Poland is the story of a people who have never lost hope, who have never been broken and who have never, ever forgotten who they are.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: Thank you so much. Thank you. Thank you so much. Such a great honor.</p><p>This is a nation more than 1,000 years old. Your borders were erased for more than a century and only restored just one century ago.</p><p>In 1920, in the Miracle of Vistula, Poland stopped the Soviet Army bent on European conquest.</p><p>Then 19 years later, in 1938, you were invaded yet again; this time by Nazi Germany from the west and the Soviet Union from the east. That’s trouble.</p><p>That’s tough.</p><p>Under a double occupation, the Polish people endured evils beyond description: the Katyn Forest Massacre, the occupation, the Holocaust, the Warsaw Ghetto and the Warsaw Ghetto uprising, the destruction of this beautiful capital city, and the deaths of nearly one in five Polish people.</p><p>A vibrant Jewish population, the largest in Europe, was reduced to almost nothing after the Nazis systematically murdered millions of Poland’s Jewish citizens, along with countless others during that brutal occupation.</p><p>In the summer of 1944, the Nazi and Soviet armies were preparing for a terrible and bloody battle right here in Warsaw. Amid that Hell on Earth, the citizens of Poland rose up to defend their homeland.</p><p>I am deeply honored to be joined on stage today by veterans and heroes of the Warsaw uprising.</p><p>What great spirit.</p><p>We salute your noble sacrifice and we pledge to always remember your fight for Poland and for freedom. Thank you. Thank you.</p><p>This monument reminds us that more than 150,000 Poles died during that desperate struggle to overthrow oppression.</p><p>From the other side of the river, the Soviet armed forces stopped and waited.</p><p>They watched as the Nazis ruthlessly destroyed the city, viciously murdering men, women and children.</p><p>They tried to destroy this nation forever by shattering its will to survive.</p><p>But there’s a courage and a strength deep in the Polish character that no one could destroy.</p><p>The Polish martyr Bishop Michal Kozal said it well: “More horrifying of a defeat of arms is a collapse of the human spirit.” Through four decades of Communist rule, Poland and the other captive nations of Europe endured a brutal campaign to demolish freedom, your faith, your laws, your history, your identity; indeed, the very essence of your culture and your humanity.</p><p>Yet through it all, you never lost that spirit.</p><p>Your oppressors tried to break you, but Poland could not be broken.</p><p>And when the day came on June 2nd, 1979, and 1 million Poles gathered around Victory Square for their very first mass with their Polish pope, that day every Communist in Warsaw must have known that their oppressive system would soon come crashing down.</p><p>They must have known it at the exact moment during Pope John Paul II’s sermon when a million Polish men, women and children suddenly raised their voices in a single prayer.</p><p>A million Polish people did not ask for wealth. They did not ask for privilege. Instead, 1 million Poles saying three simple words: “We want God.” In those words, the Polish people recalled the promise of a better future.</p><p>They found new courage to face down their oppressors. And they found the words to declare that Poland would be Poland once again.</p><p>As I stand here today before this incredible crowd, this faithful nation, we can still hear those voices that echo through history. Their message is as true today as ever. The people of Poland, the people of America and the people of Europe still cry out, “We want God.” Together with Pope John Paul II, the Poles reasserted their identity as a nation devoted to God. And with that powerful declaration of who you are, you came to understand what to do and how to live.</p><p>You stood in solidarity against oppression, against a lawless secret police, against a cruel and wicked system that impoverished your cities and your souls, and you won. Poland prevailed. Poland will always prevail.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: Thank you.</p><p>You were supported in that victory over communism by a strong alliance of free nations in the West that defied tyranny. Now among the most committed members of the NATO alliance, Poland has resumed its place as a leading nation of a Europe that is strong, whole and free. A strong Poland is a blessing to the nations of Europe and they know that. A strong Europe is a blessing to the West, and to the world.</p><p>One hundred years after the entry of American forces into World War I, the transatlantic bond between the United States and Europe is as strong as ever and maybe, in many ways, even stronger.</p><p>This continent no longer confronts the specter of communism. But today, we’re in the West, and we have to say, there are dire threats to our security and to our way of life.</p><p>You see what’s happening out there. They are threats. We will confront them.</p><p>We will win. But they are threats.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: We are confronted by another oppressive ideology, one that seeks to export terrorism and extremism all around the globe.</p><p>America and others have suffered one terror attack after another. We’re going to get it to stop.</p><p>During a historic gathering in Saudi Arabia, I called on the leaders of more than 50 Muslim nations to join together to drive out this menace which threatens all of humanity. We must stand united against these shared enemies to strip them of their territory and their funding and their networks and any form of ideological support that they may have.</p><p>While we will always welcome new citizens who share our values and love our people, our borders will always be closed to terrorism and extremism of any kind.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: We are fighting hard against radical Islamic terrorism.</p><p>And we will prevail.</p><p>We cannot accept those who reject our values and who use hatred to justify violence against the innocent.</p><p>Today, the West is also confronted by the powers that seek to test our will, undermine our confidence and challenge our interests.</p><p>To meet new forms of aggression, including propaganda, financial crimes and cyber warfare, we must adapt our alliance to compete effectively in new ways and on all new battlefields.</p><p>We urge Russia to cease its destabilizing activities in Ukraine and elsewhere and its support for hostile regimes, including Syria and Iran, and to instead join the community of responsible nations in our fight against common enemies and in defense of civilization itself.</p><p>Finally, on both sides of the Atlantic, our citizens are confronted by yet another danger, one firmly within our control. This danger is invisible to some but familiar to the Poles: the steady creep of government bureaucracy that drains the vitality and wealth of the people.</p><p>The West became great, not because of paperwork and regulations, but because people were allowed to chase their dreams and pursue their destinies.</p><p>Americans, Poles and nations of Europe value freedom and sovereignty. We must work together to confront forces, whether they come inside or out, from the south or the east, that threaten over time to undermine these values and to erase the bonds of culture, faith and tradition that make us who we are.</p><p>If left unchecked, these forces will undermine our courage, sap our spirit and weaken our will to defend ourselves and our societies</p><p>But just as our adversaries and enemies of the past learned here in Poland, we know that these forces, too, are doomed to fail if we want them to fail. And we do indeed want them to fail.</p><p>They are doomed not only because our alliance is strong, our countries are resilient and our power is unmatched. To all of that, you have to say, everything is true.</p><p>Our adversaries, however, are doomed because we will never forget who we are.</p><p>And if we don’t forget who we are, we just can’t be beaten.</p><p>Americans will never forget. The nations of Europe will never forget.</p><p>We are the fastest and the greatest community. There is nothing like our community of nations. The world has never known anything like our community of nations.</p><p>We write symphonies. We pursue innovation. We celebrate our ancient heroes, embrace our timeless traditions and customs, and always seek to explore and discover brand-new frontiers.</p><p>We reward brilliance, we strive for excellence, and cherish inspiring works of art that honor God. We treasure the rule of law and protect the right to free speech and free expression.</p><p>We empower women as pillars of our society and of our success.</p><p>We put faith and family, not government and bureaucracy, at the center of our lives.</p><p>And we debate everything. We challenge everything. We seek to know everything, so that we can better know ourselves.</p><p>And above all, we value the dignity of every human life, protect the rights of every person and share the hope of every soul to live in freedom.</p><p>That is who we are. Those are the priceless ties that bind us together as nations, as allies and as a civilization.</p><p>What we have, what we inherited from our — and — and you know this better than anybody and you see it today, with this incredible group of people — what we’ve inherited from our ancestors has never existed to this extent before. And if we fail to preserve it, it will never, ever exist again. So we cannot fail.</p><p>This great community of nations has something else in common. In every one of them, it is the people, not the powerful, who have always formed the foundation of freedom and the cornerstone of our defense.</p><p>The people have been that foundation here in Poland, as they were right here in Warsaw. And they were the foundation from the very, very beginning in America.</p><p>Our citizens did not win freedom together, did not survive horrors together, did not face down evil together only to lose our freedom to a lack of pride and confidence in our values. We did not and we will not. We will never back down.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: As long as we know our history, we will know how to build our future.</p><p>Americans know that a strong alliance of free, sovereign and independent nations is the best defense for our freedoms and for our interests. That is why my administration has demanded that all members of NATO finally meet their full and fair financial obligation. As a result of this insistence, billions of dollars more have begun to pour into NATO. In fact, people are shocked. But billions and billions of dollars more coming in from countries that, in my opinion, would not have been paying so quickly.</p><p>To those who would criticize our tough stance, I would point out that the United States has demonstrated not merely with words but with its actions that we stand firmly behind Article V, the mutual defense commitment.</p><p>Words are easy but actions are what matters. And for its own protection — and you know this, everybody knows this, everybody has to know this — Europe must do more. Europe must demonstrate that it believes in its future by investing its money to secure that future.</p><p>That is why we applaud Poland for its decision to move forward this week on acquiring from the United States the battle-tested Patriot air and missile defense system, the best anywhere in the world.</p><p>That is also why we salute the Polish people for being one of the NATO countries that has actually achieved the benchmark for investment in our common defense.</p><p>Thank you. Thank you, Poland. I must tell you the example you set is truly magnificent and we applaud Poland. Thank you.</p><p>We have to remember that our defense is not just a commitment of money, it is a commitment of will. Because as the Polish experience reminds us, the defense of the West ultimately rests not only on means, but also on the will of its people to prevail and be successful and get what you have to have.</p><p>The fundamental question of our time is whether the West has the will to survive. Do we have the confidence in our values to defend them at any cost? Do we have enough respect for our citizens to protect our borders? Do we have the desire and the courage to preserve our civilization in the face of those who would subvert and destroy it? We can have the largest economies and the most lethal weapons anywhere on Earth, but if we do not have strong families and strong values, then we will be weak and we will not survive.</p><p>If anyone forgets the critical importance of these things, let them come to one country that never has, let them come to Poland… and let them come here to Warsaw and learn the story of the Warsaw Uprising.</p><p>When they do, they should learn about Jerusalem Avenue.</p><p>In August of 1944, Jerusalem Avenue was one of the main roads running east and west through this city, just as it is today. Control of that road was crucially important to both sides in the battle for Warsaw. The German military wanted it as their most direct route to move troops and to form a very strong front. And for the Polish home army, the ability to pass north and south across that street was critical to keep the center of the city and the uprising itself from being split apart and destroyed.</p><p>Every night the Poles put up sandbags amid machine-gun fire — and it was horrendous fire — to protect a narrow passage across Jerusalem Avenue. Every day, the enemy forces knocked them down, again and again and again.</p><p>Then the Poles dug a trench. Finally, they built a barricade.</p><p>And the brave Polish fighters began to flow across Jerusalem Avenue.</p><p>That narrow passageway, just a few feet wide, was the fragile link that kept the uprising alive. Between its walls, a constant stream of citizens and freedom fighters made their perilous — just perilous — sprints. They ran across that street, they ran through that street, they ran under that street, all to defend the city.</p><p>The far side was several yards away, recalled one young Polish woman … That mortality and that life was so important to her. In fact, she said the mortally dangerous sector of the street was soaked in blood.</p><p>It was the blood of messengers, liaison girls and couriers. Nazi snipers shot at anybody who crossed; anybody who crossed, they were being shot at. Their soldiers burned every building on the street and they used the Poles as human shields for their tanks in their effort to capture Jerusalem Avenue.</p><p>The enemy never ceased its relentless assault on that small outpost of civilization. And the Poles never ceased its defense. The Jerusalem Avenue passage required constant protection, repair and reinforcement.</p><p>But the will of its defenders did not waver even in the face of death.</p><p>And to the last days of the uprising, the fragile crossing never, ever failed.</p><p>It was never, ever forgotten. It was kept open by the Polish people.</p><p>The memories of those who perished in the Warsaw Uprising cry out across the decades. And few are clearer than the memories of those who died to build and defend the Jerusalem Avenue crossing.</p><p>Those heroes remind us that the West was saved with the blood of patriots, that each generation must rise up and play their part in its defense and that every foot of ground and every last inch of civilization is worth defending with your life.</p><p>Our own fight for the West does not begin on the battlefield. It begins with our minds, our wills and our souls. Today, the ties that unite our civilization are no less vital and demand no less defense than that bare shred of land on which the hope of Poland once totally rested.</p><p>Our freedom, our civilization and our survival depend on these bonds of history, culture and memory. And today, as ever, Poland is in our heart, and its people are in that fight.</p><p>Just as Poland could not be broken, I declare today for the world to hear that the West will never, ever be broken. Our values will prevail, our people will thrive, and our civilization will triumph.</p><p>AUDIENCE: Donald Trump! Donald Trump! Donald Trump!</p><p>TRUMP: Thank you.</p><p>So together let us all fight like the Poles, for family, for freedom, for country and for God.</p><p>Thank you. God bless you, God bless the Polish people, God bless our allies, and God bless the United States of America.</p><p>Thank you. God bless you. Thank you very much.</p></div>",
  "content_text": "A transcript of President Donald Trump’s speech in Poland. It was an excellent, inspiring speech. The God-Emperor may not be properly Alt-Right, not yet. But he is sure sounding more than a little Alt-West.\nTRUMP: Thank you very much. That’s so nice.\nThe United States has many great diplomats, but there is truly no better ambassador for our country than our beautiful first lady, Melania.\nThank you, Melania. That was very nice.\nWe’ve come to your nation to deliver a very important message: America loves Poland and America loves the Polish people. Thank you.\nThe Poles have not only greatly enriched this region, but Polish- Americans have also greatly enriched the United States. And I was truly proud to have their support in the 2016 election.\nIt is a profound honor to stand in this city by this monument to the Warsaw uprising, and to address the Polish nation that so many generations have dreamed of, a Poland that is safe, strong and free.\nPresident Duda and your wonderful first lady, Agata, have welcomed us with the tremendous warmth and kindness for which Poland is known around the world.\nThank you.\nI sincere — I mean sincerely — thank both of them, and to Prime Minister Szydlo a very special thanks, also … We are pleased that former President Lech Walesa, so famous for leading the Solidarity movement, has joined us today, also … Thank you. Thank you.\nOn behalf of all Americans, let me also thank the entire Polish people for the generosity you have shown in welcoming our soldiers to your country. These soldiers are not only brave defenders of freedom, but also symbols of America’s commitment to your security and your place in a strong and democratic Europe.\nWe are proudly joined on stage by American, Polish, British and Romanian soldiers. Thank you. Thank you. Great job.\nPresident Duda and I have just come from an incredibly successful meeting with the leaders participating in the Three Seas Initiative.\nTo the citizens of this great region, America is eager to expand our partnership with you. We welcome stronger ties of trade and commerce as you grow your economies. And we are committed to securing your access to alternate sources of energy, so Poland and its neighbors are never again held hostage to a single supplier of energy.\nMr. President, I congratulate you, along with the president of Croatia, on your leadership of this historic Three Seas Initiative. Thank you.\nThis is my first visit to Central Europe as president, and I am thrilled that it could be right here, at this magnificent, beautiful piece of land. It is beautiful.\nPoland is the geographic heart of Europe. But more importantly, in the Polish people, we see the soul of Europe.\nYour nation is great because your spirit is great and your spirit is strong.\nFor two centuries, Poland suffered constant and brutal attacks.\nBut while Poland could be invaded and occupied and its borders even erased from the map, it could never be erased from history or from your hearts. In those dark days, you have lost your land, but you never lost your pride.\nSo it is with true admiration I can say today, that from the farms and villages of your countryside, to the cathedrals and squares of your great cities, Poland lives, Poland prospers and Poland prevails.\nDespite every effort to transform you, oppress you or destroy you, you endured and overcame.\nYou are the proud nation of Copernicus — think of that..\nChopin, St. John Paul II. Poland is a land of great heroes.\nAnd you are a people who know the true value of what you defend.\nThe triumph of the Polish spirit over centuries of hardship gives us all hope for a future in which good conquers evil and peace achieves victory over war.\nFor Americans, Poland has been a symbol of hope since the beginning of our nation. Polish heroes and American patriots fought side by side in our War of Independence and in many wars that followed. Our soldiers still serve together today in Afghanistan and Iraq, combating the enemies of all civilization.\nFor America’s part, we have never given up on freedom and independence as the right and destiny of the Polish people. And we never, ever will.\nOur two countries share a special bond forged by unique histories and national characters. It’s a fellowship that exists only among people who have fought and bled and died for freedom.\nThe signs of this friendship stand in our nation’s capital. Just steps from the White House, we’ve raised statues of men with names like Pulaski and Kosciuszko.\nThe same is true in Warsaw, where street signs carry the name of George Washington and a monument stands to one of the world’s greatest heroes, Ronald Reagan.\nAnd so, I am here today not just to visit an old ally, but to hold it up as an example for others who seek freedom and who wish to summon the courage and the will to defend our civilization.\nThe story of Poland is the story of a people who have never lost hope, who have never been broken and who have never, ever forgotten who they are.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: Thank you so much. Thank you. Thank you so much. Such a great honor.\nThis is a nation more than 1,000 years old. Your borders were erased for more than a century and only restored just one century ago.\nIn 1920, in the Miracle of Vistula, Poland stopped the Soviet Army bent on European conquest.\nThen 19 years later, in 1938, you were invaded yet again; this time by Nazi Germany from the west and the Soviet Union from the east. That’s trouble.\nThat’s tough.\nUnder a double occupation, the Polish people endured evils beyond description: the Katyn Forest Massacre, the occupation, the Holocaust, the Warsaw Ghetto and the Warsaw Ghetto uprising, the destruction of this beautiful capital city, and the deaths of nearly one in five Polish people.\nA vibrant Jewish population, the largest in Europe, was reduced to almost nothing after the Nazis systematically murdered millions of Poland’s Jewish citizens, along with countless others during that brutal occupation.\nIn the summer of 1944, the Nazi and Soviet armies were preparing for a terrible and bloody battle right here in Warsaw. Amid that Hell on Earth, the citizens of Poland rose up to defend their homeland.\nI am deeply honored to be joined on stage today by veterans and heroes of the Warsaw uprising.\nWhat great spirit.\nWe salute your noble sacrifice and we pledge to always remember your fight for Poland and for freedom. Thank you. Thank you.\nThis monument reminds us that more than 150,000 Poles died during that desperate struggle to overthrow oppression.\nFrom the other side of the river, the Soviet armed forces stopped and waited.\nThey watched as the Nazis ruthlessly destroyed the city, viciously murdering men, women and children.\nThey tried to destroy this nation forever by shattering its will to survive.\nBut there’s a courage and a strength deep in the Polish character that no one could destroy.\nThe Polish martyr Bishop Michal Kozal said it well: “More horrifying of a defeat of arms is a collapse of the human spirit.” Through four decades of Communist rule, Poland and the other captive nations of Europe endured a brutal campaign to demolish freedom, your faith, your laws, your history, your identity; indeed, the very essence of your culture and your humanity.\nYet through it all, you never lost that spirit.\nYour oppressors tried to break you, but Poland could not be broken.\nAnd when the day came on June 2nd, 1979, and 1 million Poles gathered around Victory Square for their very first mass with their Polish pope, that day every Communist in Warsaw must have known that their oppressive system would soon come crashing down.\nThey must have known it at the exact moment during Pope John Paul II’s sermon when a million Polish men, women and children suddenly raised their voices in a single prayer.\nA million Polish people did not ask for wealth. They did not ask for privilege. Instead, 1 million Poles saying three simple words: “We want God.” In those words, the Polish people recalled the promise of a better future.\nThey found new courage to face down their oppressors. And they found the words to declare that Poland would be Poland once again.\nAs I stand here today before this incredible crowd, this faithful nation, we can still hear those voices that echo through history. Their message is as true today as ever. The people of Poland, the people of America and the people of Europe still cry out, “We want God.” Together with Pope John Paul II, the Poles reasserted their identity as a nation devoted to God. And with that powerful declaration of who you are, you came to understand what to do and how to live.\nYou stood in solidarity against oppression, against a lawless secret police, against a cruel and wicked system that impoverished your cities and your souls, and you won. Poland prevailed. Poland will always prevail.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: Thank you.\nYou were supported in that victory over communism by a strong alliance of free nations in the West that defied tyranny. Now among the most committed members of the NATO alliance, Poland has resumed its place as a leading nation of a Europe that is strong, whole and free. A strong Poland is a blessing to the nations of Europe and they know that. A strong Europe is a blessing to the West, and to the world.\nOne hundred years after the entry of American forces into World War I, the transatlantic bond between the United States and Europe is as strong as ever and maybe, in many ways, even stronger.\nThis continent no longer confronts the specter of communism. But today, we’re in the West, and we have to say, there are dire threats to our security and to our way of life.\nYou see what’s happening out there. They are threats. We will confront them.\nWe will win. But they are threats.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: We are confronted by another oppressive ideology, one that seeks to export terrorism and extremism all around the globe.\nAmerica and others have suffered one terror attack after another. We’re going to get it to stop.\nDuring a historic gathering in Saudi Arabia, I called on the leaders of more than 50 Muslim nations to join together to drive out this menace which threatens all of humanity. We must stand united against these shared enemies to strip them of their territory and their funding and their networks and any form of ideological support that they may have.\nWhile we will always welcome new citizens who share our values and love our people, our borders will always be closed to terrorism and extremism of any kind.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: We are fighting hard against radical Islamic terrorism.\nAnd we will prevail.\nWe cannot accept those who reject our values and who use hatred to justify violence against the innocent.\nToday, the West is also confronted by the powers that seek to test our will, undermine our confidence and challenge our interests.\nTo meet new forms of aggression, including propaganda, financial crimes and cyber warfare, we must adapt our alliance to compete effectively in new ways and on all new battlefields.\nWe urge Russia to cease its destabilizing activities in Ukraine and elsewhere and its support for hostile regimes, including Syria and Iran, and to instead join the community of responsible nations in our fight against common enemies and in defense of civilization itself.\nFinally, on both sides of the Atlantic, our citizens are confronted by yet another danger, one firmly within our control. This danger is invisible to some but familiar to the Poles: the steady creep of government bureaucracy that drains the vitality and wealth of the people.\nThe West became great, not because of paperwork and regulations, but because people were allowed to chase their dreams and pursue their destinies.\nAmericans, Poles and nations of Europe value freedom and sovereignty. We must work together to confront forces, whether they come inside or out, from the south or the east, that threaten over time to undermine these values and to erase the bonds of culture, faith and tradition that make us who we are.\nIf left unchecked, these forces will undermine our courage, sap our spirit and weaken our will to defend ourselves and our societies\nBut just as our adversaries and enemies of the past learned here in Poland, we know that these forces, too, are doomed to fail if we want them to fail. And we do indeed want them to fail.\nThey are doomed not only because our alliance is strong, our countries are resilient and our power is unmatched. To all of that, you have to say, everything is true.\nOur adversaries, however, are doomed because we will never forget who we are.\nAnd if we don’t forget who we are, we just can’t be beaten.\nAmericans will never forget. The nations of Europe will never forget.\nWe are the fastest and the greatest community. There is nothing like our community of nations. The world has never known anything like our community of nations.\nWe write symphonies. We pursue innovation. We celebrate our ancient heroes, embrace our timeless traditions and customs, and always seek to explore and discover brand-new frontiers.\nWe reward brilliance, we strive for excellence, and cherish inspiring works of art that honor God. We treasure the rule of law and protect the right to free speech and free expression.\nWe empower women as pillars of our society and of our success.\nWe put faith and family, not government and bureaucracy, at the center of our lives.\nAnd we debate everything. We challenge everything. We seek to know everything, so that we can better know ourselves.\nAnd above all, we value the dignity of every human life, protect the rights of every person and share the hope of every soul to live in freedom.\nThat is who we are. Those are the priceless ties that bind us together as nations, as allies and as a civilization.\nWhat we have, what we inherited from our — and — and you know this better than anybody and you see it today, with this incredible group of people — what we’ve inherited from our ancestors has never existed to this extent before. And if we fail to preserve it, it will never, ever exist again. So we cannot fail.\nThis great community of nations has something else in common. In every one of them, it is the people, not the powerful, who have always formed the foundation of freedom and the cornerstone of our defense.\nThe people have been that foundation here in Poland, as they were right here in Warsaw. And they were the foundation from the very, very beginning in America.\nOur citizens did not win freedom together, did not survive horrors together, did not face down evil together only to lose our freedom to a lack of pride and confidence in our values. We did not and we will not. We will never back down.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: As long as we know our history, we will know how to build our future.\nAmericans know that a strong alliance of free, sovereign and independent nations is the best defense for our freedoms and for our interests. That is why my administration has demanded that all members of NATO finally meet their full and fair financial obligation. As a result of this insistence, billions of dollars more have begun to pour into NATO. In fact, people are shocked. But billions and billions of dollars more coming in from countries that, in my opinion, would not have been paying so quickly.\nTo those who would criticize our tough stance, I would point out that the United States has demonstrated not merely with words but with its actions that we stand firmly behind Article V, the mutual defense commitment.\nWords are easy but actions are what matters. And for its own protection — and you know this, everybody knows this, everybody has to know this — Europe must do more. Europe must demonstrate that it believes in its future by investing its money to secure that future.\nThat is why we applaud Poland for its decision to move forward this week on acquiring from the United States the battle-tested Patriot air and missile defense system, the best anywhere in the world.\nThat is also why we salute the Polish people for being one of the NATO countries that has actually achieved the benchmark for investment in our common defense.\nThank you. Thank you, Poland. I must tell you the example you set is truly magnificent and we applaud Poland. Thank you.\nWe have to remember that our defense is not just a commitment of money, it is a commitment of will. Because as the Polish experience reminds us, the defense of the West ultimately rests not only on means, but also on the will of its people to prevail and be successful and get what you have to have.\nThe fundamental question of our time is whether the West has the will to survive. Do we have the confidence in our values to defend them at any cost? Do we have enough respect for our citizens to protect our borders? Do we have the desire and the courage to preserve our civilization in the face of those who would subvert and destroy it? We can have the largest economies and the most lethal weapons anywhere on Earth, but if we do not have strong families and strong values, then we will be weak and we will not survive.\nIf anyone forgets the critical importance of these things, let them come to one country that never has, let them come to Poland… and let them come here to Warsaw and learn the story of the Warsaw Uprising.\nWhen they do, they should learn about Jerusalem Avenue.\nIn August of 1944, Jerusalem Avenue was one of the main roads running east and west through this city, just as it is today. Control of that road was crucially important to both sides in the battle for Warsaw. The German military wanted it as their most direct route to move troops and to form a very strong front. And for the Polish home army, the ability to pass north and south across that street was critical to keep the center of the city and the uprising itself from being split apart and destroyed.\nEvery night the Poles put up sandbags amid machine-gun fire — and it was horrendous fire — to protect a narrow passage across Jerusalem Avenue. Every day, the enemy forces knocked them down, again and again and again.\nThen the Poles dug a trench. Finally, they built a barricade.\nAnd the brave Polish fighters began to flow across Jerusalem Avenue.\nThat narrow passageway, just a few feet wide, was the fragile link that kept the uprising alive. Between its walls, a constant stream of citizens and freedom fighters made their perilous — just perilous — sprints. They ran across that street, they ran through that street, they ran under that street, all to defend the city.\nThe far side was several yards away, recalled one young Polish woman … That mortality and that life was so important to her. In fact, she said the mortally dangerous sector of the street was soaked in blood.\nIt was the blood of messengers, liaison girls and couriers. Nazi snipers shot at anybody who crossed; anybody who crossed, they were being shot at. Their soldiers burned every building on the street and they used the Poles as human shields for their tanks in their effort to capture Jerusalem Avenue.\nThe enemy never ceased its relentless assault on that small outpost of civilization. And the Poles never ceased its defense. The Jerusalem Avenue passage required constant protection, repair and reinforcement.\nBut the will of its defenders did not waver even in the face of death.\nAnd to the last days of the uprising, the fragile crossing never, ever failed.\nIt was never, ever forgotten. It was kept open by the Polish people.\nThe memories of those who perished in the Warsaw Uprising cry out across the decades. And few are clearer than the memories of those who died to build and defend the Jerusalem Avenue crossing.\nThose heroes remind us that the West was saved with the blood of patriots, that each generation must rise up and play their part in its defense and that every foot of ground and every last inch of civilization is worth defending with your life.\nOur own fight for the West does not begin on the battlefield. It begins with our minds, our wills and our souls. Today, the ties that unite our civilization are no less vital and demand no less defense than that bare shred of land on which the hope of Poland once totally rested.\nOur freedom, our civilization and our survival depend on these bonds of history, culture and memory. And today, as ever, Poland is in our heart, and its people are in that fight.\nJust as Poland could not be broken, I declare today for the world to hear that the West will never, ever be broken. Our values will prevail, our people will thrive, and our civilization will triumph.\nAUDIENCE: Donald Trump! Donald Trump! Donald Trump!\nTRUMP: Thank you.\nSo together let us all fight like the Poles, for family, for freedom, for country and for God.\nThank you. God bless you, God bless the Polish people, God bless our allies, and God bless the United States of America.\nThank you. God bless you. Thank you very much.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-06T15:49:00+00:00"
}