{
  "url": "https://voxday.net/2017/07/06/the-judeo-christian-fraud/",
  "scraped_at": "2025-12-18T07:21:26.879292",
  "title": "The “Judeo-Christian” fraud",
  "date_display": "July 6, 2017",
  "date_iso": "2017-07-06T18:28:00+00:00",
  "date_from_url": "2017-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Needless to say, Diasporans like the Littlest Chickenhawk push it every chance they get, because they are <i>shameless </i>liars.</p><blockquote><p> Tariq Nasheed@tariqnasheed<br> Trump did a speech in Poland and spoke about Western values. Now we all know what “Western” is a code word for, don’t we?</br></p><p>Ben Shapiro‏@benshapir<br> Yes, “Judeo-Christian.” You know, the civilization that protects your freedoms.</br></p><p>Supreme Dark Lord‏ @voxday<br> “Judeo-Christian” civilization does not exist. There is only Christian civilization, you cowardly fraud. “Judeo-Christian” is anti-semitic.</br></p></blockquote><p>If you happen doubt my observation that “Judeo-Christian values” is a complete 20th century fraud, have a look at the Google NGram below. There is no such thing as “Judeo-Christianity” or “Judeo-Christian civilization” or “Judeo-Christian values”. You can make a <i>far </i>better case for Islamo-Christian civilization despite the exaggerations that surround the medieval paradise of al-Andalus. Judeo-Christianity does not exist. It never existed. It does not “bless Israel” and it is nothing more than post-Holocaust propaganda directed against Americans. And you will find absolutely ZERO historical references to it in the Western civilization known as Christendom.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/DEEhLJZUwAAWqUi.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"309\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"154\" src=\"https://pbs.twimg.com/media/DEEhLJZUwAAWqUi.jpg\" width=\"400\"/></a></div><p> <a href=\"https://www.blogger.com/\"></a>Want to see what decades of relentless propaganda looks like? Look at the graph of “Christendom” vs “Judeo-Christian” <a href=\"https://books.google.com/ngrams/graph?content=Christendom%2C+Judeo-Christian&amp;year_start=1940&amp;year_end=2000&amp;corpus=15&amp;smoothing=3&amp;share=&amp;direct_url=t1%3B%2CChristendom%3B%2Cc0%3B.t1%3B%2CJudeo%20-%20Christian%3B%2Cc0\">since 1940</a>. Or, better yet, <a href=\"https://books.google.com/ngrams/graph?content=Christian+civilization%2CJudeo-Christian+civilization%2CMuslim+civilization&amp;year_start=1900&amp;year_end=2000&amp;corpus=15&amp;smoothing=3&amp;share=&amp;direct_url=t1%3B%2CChristian%20civilization%3B%2Cc0%3B.t1%3B%2CJudeo%20-%20Christian%20civilization%3B%2Cc0%3B.t1%3B%2CMuslim%20civilization%3B%2Cc0\">“Christian civilization” vs “Judeo-Christian civilization” and “Muslim civilization”</a>.</p></div>",
  "content_text": "Needless to say, Diasporans like the Littlest Chickenhawk push it every chance they get, because they are\nshameless\nliars.\nTariq Nasheed@tariqnasheed\nTrump did a speech in Poland and spoke about Western values. Now we all know what “Western” is a code word for, don’t we?\nBen Shapiro‏@benshapir\nYes, “Judeo-Christian.” You know, the civilization that protects your freedoms.\nSupreme Dark Lord‏ @voxday\n“Judeo-Christian” civilization does not exist. There is only Christian civilization, you cowardly fraud. “Judeo-Christian” is anti-semitic.\nIf you happen doubt my observation that “Judeo-Christian values” is a complete 20th century fraud, have a look at the Google NGram below. There is no such thing as “Judeo-Christianity” or “Judeo-Christian civilization” or “Judeo-Christian values”. You can make a\nfar\nbetter case for Islamo-Christian civilization despite the exaggerations that surround the medieval paradise of al-Andalus. Judeo-Christianity does not exist. It never existed. It does not “bless Israel” and it is nothing more than post-Holocaust propaganda directed against Americans. And you will find absolutely ZERO historical references to it in the Western civilization known as Christendom.\nWant to see what decades of relentless propaganda looks like? Look at the graph of “Christendom” vs “Judeo-Christian”\nsince 1940\n. Or, better yet,\n“Christian civilization” vs “Judeo-Christian civilization” and “Muslim civilization”\n.",
  "tags": [
    "Christianity",
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-06T17:28:00+00:00"
}