{
  "url": "https://voxday.net/2017/07/13/the-proposition-lef/",
  "scraped_at": "2025-12-18T07:22:26.552724",
  "title": "The Proposition Left",
  "date_display": "July 13, 2017",
  "date_iso": "2017-07-13T17:31:00+00:00",
  "date_from_url": "2017-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the white Left is gradually beginning to realize that <a href=\"https://archive.fo/nPka5#selection-1791.0-1791.797\">they have made a fatal blunder</a> in declaring the white Christian West their enemy, as there is no place for them in the various tribes of the global South and East:</p><blockquote><p> It’s anyone’s guess whether the latest round of Russia revelations will flame out or bring the administration toppling to the ground. But either way, the drama is only one act in an ongoing cycle of outrages involving Trump and Russia that will, one way or another, come to an end. That is not true of the controversy over the President’s remarks in Warsaw last week, which exposed a crucial contest over ideas that will continue to influence our politics until long after this administration has left office. And the responses from Trump’s liberal critics were revealing — and dangerous.</p><p>The speech — a call to arms for a Western civilization ostensibly menaced by decadence and bloat from within and hostile powers from without — was received across the center-left as a thinly veiled apologia for white nationalism. “Trump did everything but cite Pepe the Frog,” tweeted the Atlantic’s Peter Beinart. “Trump’s speech in Poland sounded like an alt-right manifesto,” read a Vox headline. According the New Republic’s Jeet Heer, Trump’s “alt-right speech” “redefined the West in nativist terms.”</p><p>Thus, the intelligentsia is now flirting with an intellectually indefensible linguistic coup: Characterizing any appeal to the coherence or distinctiveness of Western civilization as evidence of white nationalist sympathies. Such a shift, if accepted, would so expand the scope of the term “alt-right” that it would lose its meaning. Its genuinely ugly ideas would continue to fester, but we would lose the rhetorical tools to identify and repudiate them as distinct from legitimate admiration for the Western tradition. To use a favorite term of the resistance, the alt-right would become normalized….</p><p>What is at stake now is whether Americans will surrender the idea of “the West” to liberalism’s enemies on the alt-right — that is, whether we will allow people who deny the equal citizenship of women and minorities and Jews to lay claim to the legacy of Western civilization. This would amount to a major and potentially suicidal concession, because the alt-right — not in the opportunistically watered-down sense of “immigration skeptic,” or “social conservative,” but in the sense of genuine white male political supremacism — is anti-Western. It is hostile to the once-radical ideals of pluralism and self-governance and individual rights that were developed during the Western Enlightenment and its offshoots. It represents an attack on, not a defense of, of the West’s greatest achievements.</p></blockquote><p>It’s an impressive feat of intellectual gymnastics that the author is attempting. He’s essentially doing the equivalent of declaring that Democrats are the real racists: the Alt-Right are the real enemies of the West. But that is not true. Indeed, the Alt-Right are the <i>only </i>defenders of the West.</p><p>It’s become fairly common for conservatives andthe  Alt-Lite like to play rhetorical games and try to claim that the Alt-Right is really the SJW Left because word salad. But notice how similar this Left-wing argument is to the arguments of the conservative Proposition Nationalists and the Alt-Lite civic nationalists addressing the Alt-Right.</p><p>This is why I keep pointing out that the Alt-Right is inevitable. You can play all the word games you like. You can cherry-pick whatever historical documents you like. You can invent whatever contorted and ahistorical definitions you like. You can quote at length from the red-letter edition of the True Sayings of Judeo-Christ. But in the end, so long as you continue to deny that a nation is a group of people related by blood, language, and tradition, and deny that the West is a civilization constructed by, of, and for European Christians, you will end up precisely where the Left is, because a first step into falsehood is always followed by a second, and a third, as your perspective increasingly comes into conflict with observable events.</p></div>",
  "content_text": "And the white Left is gradually beginning to realize that\nthey have made a fatal blunder\nin declaring the white Christian West their enemy, as there is no place for them in the various tribes of the global South and East:\nIt’s anyone’s guess whether the latest round of Russia revelations will flame out or bring the administration toppling to the ground. But either way, the drama is only one act in an ongoing cycle of outrages involving Trump and Russia that will, one way or another, come to an end. That is not true of the controversy over the President’s remarks in Warsaw last week, which exposed a crucial contest over ideas that will continue to influence our politics until long after this administration has left office. And the responses from Trump’s liberal critics were revealing — and dangerous.\nThe speech — a call to arms for a Western civilization ostensibly menaced by decadence and bloat from within and hostile powers from without — was received across the center-left as a thinly veiled apologia for white nationalism. “Trump did everything but cite Pepe the Frog,” tweeted the Atlantic’s Peter Beinart. “Trump’s speech in Poland sounded like an alt-right manifesto,” read a Vox headline. According the New Republic’s Jeet Heer, Trump’s “alt-right speech” “redefined the West in nativist terms.”\nThus, the intelligentsia is now flirting with an intellectually indefensible linguistic coup: Characterizing any appeal to the coherence or distinctiveness of Western civilization as evidence of white nationalist sympathies. Such a shift, if accepted, would so expand the scope of the term “alt-right” that it would lose its meaning. Its genuinely ugly ideas would continue to fester, but we would lose the rhetorical tools to identify and repudiate them as distinct from legitimate admiration for the Western tradition. To use a favorite term of the resistance, the alt-right would become normalized….\nWhat is at stake now is whether Americans will surrender the idea of “the West” to liberalism’s enemies on the alt-right — that is, whether we will allow people who deny the equal citizenship of women and minorities and Jews to lay claim to the legacy of Western civilization. This would amount to a major and potentially suicidal concession, because the alt-right — not in the opportunistically watered-down sense of “immigration skeptic,” or “social conservative,” but in the sense of genuine white male political supremacism — is anti-Western. It is hostile to the once-radical ideals of pluralism and self-governance and individual rights that were developed during the Western Enlightenment and its offshoots. It represents an attack on, not a defense of, of the West’s greatest achievements.\nIt’s an impressive feat of intellectual gymnastics that the author is attempting. He’s essentially doing the equivalent of declaring that Democrats are the real racists: the Alt-Right are the real enemies of the West. But that is not true. Indeed, the Alt-Right are the\nonly\ndefenders of the West.\nIt’s become fairly common for conservatives andthe  Alt-Lite like to play rhetorical games and try to claim that the Alt-Right is really the SJW Left because word salad. But notice how similar this Left-wing argument is to the arguments of the conservative Proposition Nationalists and the Alt-Lite civic nationalists addressing the Alt-Right.\nThis is why I keep pointing out that the Alt-Right is inevitable. You can play all the word games you like. You can cherry-pick whatever historical documents you like. You can invent whatever contorted and ahistorical definitions you like. You can quote at length from the red-letter edition of the True Sayings of Judeo-Christ. But in the end, so long as you continue to deny that a nation is a group of people related by blood, language, and tradition, and deny that the West is a civilization constructed by, of, and for European Christians, you will end up precisely where the Left is, because a first step into falsehood is always followed by a second, and a third, as your perspective increasingly comes into conflict with observable events.",
  "tags": [
    "#AltRight",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-07-13T16:31:00+00:00"
}