{
  "url": "https://voxday.net/2011/09/09/courtier-science/",
  "scraped_at": "2025-12-13T23:21:20.865677",
  "title": "Courtier science",
  "date_display": "September 9, 2011",
  "date_iso": "2011-09-09T16:30:00+00:00",
  "date_from_url": "2011-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have repeatedly pointed out that the profession of science does not create wealth, but is utterly dependent upon societal wealth and the willingness of the people to spend money on it.  Scientistry is basically a potentially more useful National Endowment for the Arts. <a href=\"http://www.physorg.com/news/2011-09-turkish-academy-sciences-independence.html\">This action by the Turkish government</a> will likely mark the first of many reminders that modern government-funded science will no longer be deemed important enough to justify its existence as the economic contraction continues to reduce tax revenues and the ability of the average individual to pay his bills:</p><blockquote><p>The decree, issued on 27th August, which was just after the start of a nine-day holiday in Turkey, says that one-third of the members of the academy will now be appointed by the government and a further one-third by the Council of Higher Education, which is also a government body. Only the remaining one-third will be elected by current members. The president and vice-president of the academy will in future be appointed by the government rather than by sitting members. In addition, honorary members will lose their voting rights and the age at which members are deemed honorary will be reduced from 70 to 67.</p><p>TÜBA has issued a statement that says the government’s decree effectively ends the Academy and replaces it with a new Academy of Sciences that will be under the control of the government. They add: “There is no science academy in the world where the majority of members and the president are appointed directly by the government.”</p><p>The academy has been given no reasons for the changes, but the government has the right to make changes to the academy’s structure because the academy is publicly funded.</p></blockquote><p>The Turkish scientists aren’t upset because they are losing an imaginary independence that never existed in the first place, they are upset because those who hold the purse strings are finally exercising the control they have had all along.  This should prove an object lesson for science fetishists who have long dreamed of a war between religion and science, imagining that government would naturally side with the scientific elite.</p><p>This was always a ridiculous notion, since both the money and the popular support upon which government depends are generated by the religious masses.  Scientists had better pray that the coming years don’t bring about a genuine war between religion and science, in the Muslim world or in the West, because it is readily apparent that the scientific world not only can’t hope to win, <i>it can’t even support its own existence</i> and is dependent upon access to the wealth of the other side.</p></div>",
  "content_text": "I have repeatedly pointed out that the profession of science does not create wealth, but is utterly dependent upon societal wealth and the willingness of the people to spend money on it.  Scientistry is basically a potentially more useful National Endowment for the Arts.\nThis action by the Turkish government\nwill likely mark the first of many reminders that modern government-funded science will no longer be deemed important enough to justify its existence as the economic contraction continues to reduce tax revenues and the ability of the average individual to pay his bills:\nThe decree, issued on 27th August, which was just after the start of a nine-day holiday in Turkey, says that one-third of the members of the academy will now be appointed by the government and a further one-third by the Council of Higher Education, which is also a government body. Only the remaining one-third will be elected by current members. The president and vice-president of the academy will in future be appointed by the government rather than by sitting members. In addition, honorary members will lose their voting rights and the age at which members are deemed honorary will be reduced from 70 to 67.\nTÜBA has issued a statement that says the government’s decree effectively ends the Academy and replaces it with a new Academy of Sciences that will be under the control of the government. They add: “There is no science academy in the world where the majority of members and the president are appointed directly by the government.”\nThe academy has been given no reasons for the changes, but the government has the right to make changes to the academy’s structure because the academy is publicly funded.\nThe Turkish scientists aren’t upset because they are losing an imaginary independence that never existed in the first place, they are upset because those who hold the purse strings are finally exercising the control they have had all along.  This should prove an object lesson for science fetishists who have long dreamed of a war between religion and science, imagining that government would naturally side with the scientific elite.\nThis was always a ridiculous notion, since both the money and the popular support upon which government depends are generated by the religious masses.  Scientists had better pray that the coming years don’t bring about a genuine war between religion and science, in the Muslim world or in the West, because it is readily apparent that the scientific world not only can’t hope to win,\nit can’t even support its own existence\nand is dependent upon access to the wealth of the other side.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-09T15:30:00+00:00"
}