{
  "url": "https://voxday.net/2011/09/01/debate-as-blood-spor/",
  "scraped_at": "2025-12-13T23:20:40.951269",
  "title": "The PZ Myers Memorial Debate",
  "date_display": "September 1, 2011",
  "date_iso": "2011-09-01T19:40:00+00:00",
  "date_from_url": "2011-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we have learned that the Fowl Atheist, Paul Zachary, has <a href=\"http://freethoughtblogs.com/pharyngula/2011/08/31/darn-it-dont-tell-me-this/\">given up the art of debating Creationists</a>, (and no doubt numerous Christians will have to remind him of this when he calls into a radio show and attempts to ambush them), it appears we shall have to find another atheist with whom to debate the topic I suggested three years ago.  Hence this announcement of the first PZ Myers Memorial Debate, dedicated to the short-lived, but inglorious debating career of our favorite community college butterfly collector.  I’m sure we all recall how beautifully he ran; Paul Zachary’s reaction to a challenge reminded me of Usain Bolt’s to the sound of a starter’s pistol.</p><p>Of course, a debate requires an opponent, so I’m interested to know if there is an atheist who would like to contest the assertion that there is not only substantial evidence for the existence of gods, but that the logic and the evidence in support of the existence of gods is superior to the logic and the evidence for the nonexistence of them.</p><p>This will be a written debate.  Each party will simultaneously submit an initial statement of no more than 1,500 words for the other party to critique, and both parties will have one week to respond to the other’s initial statement with a critique of no more than 2,000 words.  Whoever the judges determine to have won the first round will have the choice between writing the next post or replying to the first-round loser’s next post.  There will be five rounds, after which one side or the other may concede or simply withdraw, or continue if both parties wish.  The second to fifth rounds will be limited to 3,000 words.</p><p>If you happen to be interested in opposing the assertion, please put your name forward along with any credentials you might deem relevant.  I’m also interested in three judges, one Christian, one agnostic, and one atheist, so please put your name forward if you would like to be a judge and believe you are impartial enough to focus on the quality of the arguments.  If multiple atheists wish to debate, I will post their names and encourage a discussion among them in order to allow them to select the strongest candidate.</p><p>I’m also interested in hearing recommendations on a scoring system.  I was thinking of having the judges each award up to 5 points on each exchange, but perhaps someone will have a better idea.</p><p>Anyhow, it would be impossible to put up a worse showing than the Fowl Atheist, so if you’re interested, do let me know.</p></div>",
  "content_text": "Since we have learned that the Fowl Atheist, Paul Zachary, has\ngiven up the art of debating Creationists\n, (and no doubt numerous Christians will have to remind him of this when he calls into a radio show and attempts to ambush them), it appears we shall have to find another atheist with whom to debate the topic I suggested three years ago.  Hence this announcement of the first PZ Myers Memorial Debate, dedicated to the short-lived, but inglorious debating career of our favorite community college butterfly collector.  I’m sure we all recall how beautifully he ran; Paul Zachary’s reaction to a challenge reminded me of Usain Bolt’s to the sound of a starter’s pistol.\nOf course, a debate requires an opponent, so I’m interested to know if there is an atheist who would like to contest the assertion that there is not only substantial evidence for the existence of gods, but that the logic and the evidence in support of the existence of gods is superior to the logic and the evidence for the nonexistence of them.\nThis will be a written debate.  Each party will simultaneously submit an initial statement of no more than 1,500 words for the other party to critique, and both parties will have one week to respond to the other’s initial statement with a critique of no more than 2,000 words.  Whoever the judges determine to have won the first round will have the choice between writing the next post or replying to the first-round loser’s next post.  There will be five rounds, after which one side or the other may concede or simply withdraw, or continue if both parties wish.  The second to fifth rounds will be limited to 3,000 words.\nIf you happen to be interested in opposing the assertion, please put your name forward along with any credentials you might deem relevant.  I’m also interested in three judges, one Christian, one agnostic, and one atheist, so please put your name forward if you would like to be a judge and believe you are impartial enough to focus on the quality of the arguments.  If multiple atheists wish to debate, I will post their names and encourage a discussion among them in order to allow them to select the strongest candidate.\nI’m also interested in hearing recommendations on a scoring system.  I was thinking of having the judges each award up to 5 points on each exchange, but perhaps someone will have a better idea.\nAnyhow, it would be impossible to put up a worse showing than the Fowl Atheist, so if you’re interested, do let me know.",
  "tags": [
    "atheism",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-01T18:40:00+00:00"
}