{
  "url": "https://voxday.net/2011/09/29/decline-and-fall-of-eu/",
  "scraped_at": "2025-12-13T23:23:16.468463",
  "title": "The decline and fall of the EU",
  "date_display": "September 29, 2011",
  "date_iso": "2011-09-29T08:06:00+00:00",
  "date_from_url": "2011-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things that I always find amusing is the way that those who openly mock my seemingly crazy predictions at the time I make them never seem to surface again later when the unthinkable and supposedly impossible finally becomes the topic of mainstream debate.  It’s a reliable pattern that we’ve seen three times this year already, first with the “double-dip” aka depression, second with the growing “Obama steps aside in favor of Hillary” theme in the press, and now with <a href=\"http://finance.yahoo.com/news/The-European-Union-in-crisis-apf-1393163375.html?x=0&amp;sec=topStories&amp;pos=2&amp;asset=&amp;ccode=\">the breakup of the EU</a> being openly discussed in the mainstream media.  All three predictions could still ultimately turn out to be incorrect, but that’s almost beside the point, which is that the trend was correctly identified long before it became readily apparent:</p><blockquote><p>Until recently, the idea that the 27-nation European Union might disintegrate would have been unthinkable, for uniting a continent ripped apart by two World Wars was considered a rousing diplomatic success.  But the EU’s two most cherished achievements — a common currency and the free movement of people across borders — are under threat. And the possibility that the decades-long experiment that is the EU might not survive in its present form has now entered mainstream debate.</p></blockquote><p>Now, I don’t mind being held accountable when my predictions are incorrect.  In the last U.S. Presidential round, my prediction was that it would be Pataki vs Hillary with Hillary winning election.  Obviously, neither nomination came to pass since Pataki didn’t even run and Hillary blew the nomination with her failure to read the rules.  Fine, I got those wrong.  But what those who like to bring up that election cycle forget is that Giuliani didn’t come anywhere near the Republican nomination – it may look obvious now, but I predicted that when “America’s Mayor” was the widely anointed frontrunner – and the Republicans did end up going with what I suggested would be the alternative to Pataki, namely, a moderate Senator in the Dole mode who would be served up as a sacrificial lamb.  Which, of course, is exactly what McCain was.</p><p>In retrospect, I should have realized that Pataki wouldn’t run against Giuliani.  But I would still have gone with Hillary, there is no way I would have believed she would run such a strategically inept campaign after the way she simply strolled into the New York Senate seat without breaking a sweat.  Either way, I’m not concerned about being wrong about these things since I don’t play it like Nate Silver and make 100 different “predictions”, the last one as people are actually voting.  If you compare my predictions with his at the same distance out from the event, I think you’ll find that mine tend to be rather better.  By way of example, look how long it took him to realize that the Republicans would win the House in 2010.</p><p>And, of course, I was the only political observer out of 50 or so writers surveyed by the Right Wing News to nail the Palin pick as the Republican VP selection.  I don’t remember who the flavor of the month was back then, but it was obvious that McCain was going to pick a woman since he was going up against a half-black man.  I didn’t make a prediction on the Democratic side because I had no idea what Obama would do, but I will admit that his choice of Biden absolutely astonished me.  It still astonishes me.</p><p>Getting back the EU, the only question concerning the eventual breakup is if it happens now or after the politicians openly attempt to abandon democracy altogether and play the full totalitarian card.  I don’t think they ultimately will, for the simple reason that they don’t have the necessary military and police resources to pull it off.  As one European wag has noted, the last time an unpopular political structure was rammed down an angry German populace’s throat by other European nations, the subsequent results weren’t exactly what one would consider to be positive.</p><p>Even if Merkel manages to twist enough arms to force the $500 billion expansion of the European Financial Stability Facility through the Bundestag today, the German courts have clearly signified that enough is enough and no further European institutions will be permitted to encroach upon German financial sovereignty.  The EU political elite can pontificate all they like about how further political integration is necessary to prevent fragmentation, but most of the European people would now clearly prefer the breakup of the EU and the return of their national currencies.  But regardless of what happens this fall, the banks and the politicians are going to lose in the end since the global economy is going to continue to get contract, it’s not going to start growing any time soon, and the EU was always a project that required economic sunshine.</p></div>",
  "content_text": "One of the things that I always find amusing is the way that those who openly mock my seemingly crazy predictions at the time I make them never seem to surface again later when the unthinkable and supposedly impossible finally becomes the topic of mainstream debate.  It’s a reliable pattern that we’ve seen three times this year already, first with the “double-dip” aka depression, second with the growing “Obama steps aside in favor of Hillary” theme in the press, and now with\nthe breakup of the EU\nbeing openly discussed in the mainstream media.  All three predictions could still ultimately turn out to be incorrect, but that’s almost beside the point, which is that the trend was correctly identified long before it became readily apparent:\nUntil recently, the idea that the 27-nation European Union might disintegrate would have been unthinkable, for uniting a continent ripped apart by two World Wars was considered a rousing diplomatic success.  But the EU’s two most cherished achievements — a common currency and the free movement of people across borders — are under threat. And the possibility that the decades-long experiment that is the EU might not survive in its present form has now entered mainstream debate.\nNow, I don’t mind being held accountable when my predictions are incorrect.  In the last U.S. Presidential round, my prediction was that it would be Pataki vs Hillary with Hillary winning election.  Obviously, neither nomination came to pass since Pataki didn’t even run and Hillary blew the nomination with her failure to read the rules.  Fine, I got those wrong.  But what those who like to bring up that election cycle forget is that Giuliani didn’t come anywhere near the Republican nomination – it may look obvious now, but I predicted that when “America’s Mayor” was the widely anointed frontrunner – and the Republicans did end up going with what I suggested would be the alternative to Pataki, namely, a moderate Senator in the Dole mode who would be served up as a sacrificial lamb.  Which, of course, is exactly what McCain was.\nIn retrospect, I should have realized that Pataki wouldn’t run against Giuliani.  But I would still have gone with Hillary, there is no way I would have believed she would run such a strategically inept campaign after the way she simply strolled into the New York Senate seat without breaking a sweat.  Either way, I’m not concerned about being wrong about these things since I don’t play it like Nate Silver and make 100 different “predictions”, the last one as people are actually voting.  If you compare my predictions with his at the same distance out from the event, I think you’ll find that mine tend to be rather better.  By way of example, look how long it took him to realize that the Republicans would win the House in 2010.\nAnd, of course, I was the only political observer out of 50 or so writers surveyed by the Right Wing News to nail the Palin pick as the Republican VP selection.  I don’t remember who the flavor of the month was back then, but it was obvious that McCain was going to pick a woman since he was going up against a half-black man.  I didn’t make a prediction on the Democratic side because I had no idea what Obama would do, but I will admit that his choice of Biden absolutely astonished me.  It still astonishes me.\nGetting back the EU, the only question concerning the eventual breakup is if it happens now or after the politicians openly attempt to abandon democracy altogether and play the full totalitarian card.  I don’t think they ultimately will, for the simple reason that they don’t have the necessary military and police resources to pull it off.  As one European wag has noted, the last time an unpopular political structure was rammed down an angry German populace’s throat by other European nations, the subsequent results weren’t exactly what one would consider to be positive.\nEven if Merkel manages to twist enough arms to force the $500 billion expansion of the European Financial Stability Facility through the Bundestag today, the German courts have clearly signified that enough is enough and no further European institutions will be permitted to encroach upon German financial sovereignty.  The EU political elite can pontificate all they like about how further political integration is necessary to prevent fragmentation, but most of the European people would now clearly prefer the breakup of the EU and the return of their national currencies.  But regardless of what happens this fall, the banks and the politicians are going to lose in the end since the global economy is going to continue to get contract, it’s not going to start growing any time soon, and the EU was always a project that required economic sunshine.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-29T07:06:00+00:00"
}