{
  "url": "https://voxday.net/2011/09/22/devolution-of-economics/",
  "scraped_at": "2025-12-13T23:22:31.687968",
  "title": "The devolution of economics",
  "date_display": "September 22, 2011",
  "date_iso": "2011-09-22T10:26:00+00:00",
  "date_from_url": "2011-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not just scientists convinced of the universal superiority of their method who are deluded.  Tim Price cites an amusing example of <a href=\"http://www.stockopedia.co.uk/content/the-dire-state-of-economics-blame-leon-walras-43159/\">the extraordinary arrogance of economists</a>:</p><blockquote><p>“Most economists, it seems, believe strongly in their own superior intelligence and take themselves far too seriously. In his open letter of 22 July 2001 to Joseph Stiglitz, Kenneth Rogoff identified this problem. “One of my favourite stories from that era is a lunch with you and our former colleague, Carl Shapiro, at which the two of you started discussing whether Paul Volcker merited your vote for a tenured appointment at Princeton. At one point, you turned to me and said, “Ken, you used to work for Volcker at the Fed. Tell me, is he really smart ?”  I responded something to the effect of, “Well, he was arguably the greatest Federal Reserve Chairman of the twentieth century.” To which you replied, “But is he smart like us?”</p></blockquote><p>The thing is, most economists are extremely intelligent, particularly the more influential ones.  One of the remarkable things about Rothbard’s history of economic thought is the way most – not some, most – of the significant economic theoreticians prior to the academic professionalization of the field had extremely successful careers in business, politics, or the Church.  And their theoretical influence in most cases cannot be a considered a consequence of their societal success, because their theoretical writings tended to precede their obtainment of societally significant positions.  The publications were, in fact, not infrequently the reason for their appointment to such positions.</p><p>The ironic thing is that the credentialization of the field has tended to reduce the power and influence of even the most intelligent economists, dumb down the general consensus, and permit the elevation of the less gifted at the expense of the more talented.  One could not go so far as to say that Mises and Rothbard wasted their many decades in an unappreciative academy, given their massive literary output, but they were certainly far less materially influential than the economic theoreticians of yore who were elected to Parliament, handed control of monopolies like the East India Company, appointed Controller General of Finances by foreign countries, or given a royal charter to establish a central bank.</p><p>Now, one cannot read the heavily credentialed Paul Krugman on a regular basis without noticing that his arrogance is not supported by the intelligence of his political commentary, the accuracy of his economic predictions, or even the breadth of his theoretical knowledge.  The decline of economics is especially apparent when one realizes that many of his arguments were anticipated and rebutted by men like John Locke <i>in the 17th century</i>.</p><blockquote><p>Locke superbly put his finger on the supposed function of the Mint: to maintain the currency as purely a definition, or standard of weight of silver; any debasement, any change of standards, would be as arbitrary, fraudulent, and unjust as the government’s changing the definition of a foot or a yard. Locke put it dramatically: ‘one may as rationally hope to lengthen a foot by dividing it into fifteen parts instead of twelve, and calling them inches…’.</p><p><i>“Furthermore, government, the supported guarantor of contracts, thereby leads in contract-breaking: The reason why it should not be changed is this: because the public authority is guarantee for the performance of all legal contracts. But men are absolved from the performance of their legal contracts, if the quantity of silver under settled and legal denominations be altered… the landlord here and creditor are each defrauded of twenty percent of what they contracted for and is their due…”</i></p></blockquote><p>This is precisely what Karl Denninger keeps banging on about at the Market Ticker when he points out how the Federal Reserve’s low inflation targets are in blatant contradiction to their charter to maintain price stability.  As for Walras, whose neoclassical general-equilibrium theory is still in the process of being methodically dismantled and rubbished along with other classical fossils such as Ricardian free trade theory, the flaws in his perspective were presaged in Richard Cantillon’s <i>Essay on the Nature of Trade in General</i>, published in 1730.</p><p>There is no question that economists are highly intelligent.  It requires a high degree of intelligence in order to produce such a vast and convincing body of literature rationalizing politically useful concepts that have been known to be false for more than 300 years.</p></div>",
  "content_text": "It’s not just scientists convinced of the universal superiority of their method who are deluded.  Tim Price cites an amusing example of\nthe extraordinary arrogance of economists\n:\n“Most economists, it seems, believe strongly in their own superior intelligence and take themselves far too seriously. In his open letter of 22 July 2001 to Joseph Stiglitz, Kenneth Rogoff identified this problem. “One of my favourite stories from that era is a lunch with you and our former colleague, Carl Shapiro, at which the two of you started discussing whether Paul Volcker merited your vote for a tenured appointment at Princeton. At one point, you turned to me and said, “Ken, you used to work for Volcker at the Fed. Tell me, is he really smart ?”  I responded something to the effect of, “Well, he was arguably the greatest Federal Reserve Chairman of the twentieth century.” To which you replied, “But is he smart like us?”\nThe thing is, most economists are extremely intelligent, particularly the more influential ones.  One of the remarkable things about Rothbard’s history of economic thought is the way most – not some, most – of the significant economic theoreticians prior to the academic professionalization of the field had extremely successful careers in business, politics, or the Church.  And their theoretical influence in most cases cannot be a considered a consequence of their societal success, because their theoretical writings tended to precede their obtainment of societally significant positions.  The publications were, in fact, not infrequently the reason for their appointment to such positions.\nThe ironic thing is that the credentialization of the field has tended to reduce the power and influence of even the most intelligent economists, dumb down the general consensus, and permit the elevation of the less gifted at the expense of the more talented.  One could not go so far as to say that Mises and Rothbard wasted their many decades in an unappreciative academy, given their massive literary output, but they were certainly far less materially influential than the economic theoreticians of yore who were elected to Parliament, handed control of monopolies like the East India Company, appointed Controller General of Finances by foreign countries, or given a royal charter to establish a central bank.\nNow, one cannot read the heavily credentialed Paul Krugman on a regular basis without noticing that his arrogance is not supported by the intelligence of his political commentary, the accuracy of his economic predictions, or even the breadth of his theoretical knowledge.  The decline of economics is especially apparent when one realizes that many of his arguments were anticipated and rebutted by men like John Locke\nin the 17th century\n.\nLocke superbly put his finger on the supposed function of the Mint: to maintain the currency as purely a definition, or standard of weight of silver; any debasement, any change of standards, would be as arbitrary, fraudulent, and unjust as the government’s changing the definition of a foot or a yard. Locke put it dramatically: ‘one may as rationally hope to lengthen a foot by dividing it into fifteen parts instead of twelve, and calling them inches…’.\n“Furthermore, government, the supported guarantor of contracts, thereby leads in contract-breaking: The reason why it should not be changed is this: because the public authority is guarantee for the performance of all legal contracts. But men are absolved from the performance of their legal contracts, if the quantity of silver under settled and legal denominations be altered… the landlord here and creditor are each defrauded of twenty percent of what they contracted for and is their due…”\nThis is precisely what Karl Denninger keeps banging on about at the Market Ticker when he points out how the Federal Reserve’s low inflation targets are in blatant contradiction to their charter to maintain price stability.  As for Walras, whose neoclassical general-equilibrium theory is still in the process of being methodically dismantled and rubbished along with other classical fossils such as Ricardian free trade theory, the flaws in his perspective were presaged in Richard Cantillon’s\nEssay on the Nature of Trade in General\n, published in 1730.\nThere is no question that economists are highly intelligent.  It requires a high degree of intelligence in order to produce such a vast and convincing body of literature rationalizing politically useful concepts that have been known to be false for more than 300 years.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-22T09:26:00+00:00"
}