{
  "url": "https://voxday.net/2011/09/10/dishonest-atheis/",
  "scraped_at": "2025-12-13T23:21:22.690162",
  "title": "The dishonest atheist",
  "date_display": "September 10, 2011",
  "date_iso": "2011-09-10T07:12:00+00:00",
  "date_from_url": "2011-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This statement by Cabal demonstrates why one always has to assume, until it is demonstrated otherwise, that an atheist is a lying snake who will deceitfully redefine the language to suit his arguments at need.</p><blockquote><p>Darwinism…a meaningless expression that only exists in creationist literature.</p></blockquote><p>It doesn’t surprise me that some atheists, particularly the militant and evangelical ones, should practice their own form of <i>Taqiyya</i>.  They reject the source of morality, after all, so they have no rationale for behaving in a truthful, moral manner.  But what astonishes me time and time again is that they should choose to tell such stupid, easily exposed lies over and over again.</p><p>From the Oxford English Dictionary:</p><p><i><b>Darwinism</b><br> Pronunciation:/ˈdɑːwɪnɪz(ə)m/<br> noun</br></br></i></p><p>the theory of the evolution of species by natural selection advanced by Charles Darwin.</p><p>Derivatives</p><p>Darwinist<br> noun &amp; adjective</br></p><p>No doubt we’ll soon be hearing new fictions about how the Oxford English Dictionary is creationist literature.  And then I’ll have to point out that “Darwinism” is also in the Collins, Merrian-Webster, and World Heritage dictionaries as well.</p><p><i>Dar·win·ism</i></p><p>noun<br> the Darwinian theory that species originate by descent, with variation, from parent forms, through the natural selection of those individuals best adapted for the reproductive success of their kind.<br> Origin:<br> 1855–60; Darwin + -ism</br></br></br></p></div>",
  "content_text": "This statement by Cabal demonstrates why one always has to assume, until it is demonstrated otherwise, that an atheist is a lying snake who will deceitfully redefine the language to suit his arguments at need.\nDarwinism…a meaningless expression that only exists in creationist literature.\nIt doesn’t surprise me that some atheists, particularly the militant and evangelical ones, should practice their own form of\nTaqiyya\n.  They reject the source of morality, after all, so they have no rationale for behaving in a truthful, moral manner.  But what astonishes me time and time again is that they should choose to tell such stupid, easily exposed lies over and over again.\nFrom the Oxford English Dictionary:\nDarwinism\nPronunciation:/ˈdɑːwɪnɪz(ə)m/\nnoun\nthe theory of the evolution of species by natural selection advanced by Charles Darwin.\nDerivatives\nDarwinist\nnoun & adjective\nNo doubt we’ll soon be hearing new fictions about how the Oxford English Dictionary is creationist literature.  And then I’ll have to point out that “Darwinism” is also in the Collins, Merrian-Webster, and World Heritage dictionaries as well.\nDar·win·ism\nnoun\nthe Darwinian theory that species originate by descent, with variation, from parent forms, through the natural selection of those individuals best adapted for the reproductive success of their kind.\nOrigin:\n1855–60; Darwin + -ism",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-10T06:12:00+00:00"
}