{
  "url": "https://voxday.net/2011/09/01/formidable-defender-of-darwin/",
  "scraped_at": "2025-12-13T23:20:37.205569",
  "title": "A formidable defender of Darwin",
  "date_display": "September 1, 2011",
  "date_iso": "2011-09-01T08:29:00+00:00",
  "date_from_url": "2011-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since Paul Zachary is so fearful, perhaps I should debate this kid.  He can’t be any less capable of presenting a logical argument, and clearly <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=339845\">he can parrot the current Cult of Darwin consensus</a> with the best of them:</p><blockquote><p>Amid the hoots at Republican presidential candidate Rick Perry for saying there were “gaps” in the theory of evolution, the strongest evidence for Darwinism presented by these soi-disant rationalists was a 9-year-old boy quoted in the New York Times.</p><p>After his mother had pushed him in front of Perry on the campaign trail and made him ask if Perry believed in evolution, the trained seal beamed at his Wicked Witch of the West mother, saying, “Evolution, I think, is correct!”</p><p>That’s the most extended discussion of Darwin’s theory to appear in the mainstream media in a quarter-century. More people know the precepts of kabala than know the basic elements of Darwinism.</p></blockquote><p>Well, if a nine year-old kid thinks it’s correct, it must be correct!  QED.  Miss Coulter’s last claim is certainly interesting, given the massive emphasis that the Cult of Darwin places upon exposing schoolchildren to its relentless propaganda at an early age.  But who would have thought that children who can barely learn to read in 12 years of public school might have a tough time retaining anything they’ve been taught about a dynamic quasi-scientific theory?</p><p>Personally, I tend to find it extremely amusing when accused of being ignorant about <s>TENS</s>TE(p)NSBMGDaGF.  Never mind that I was taught about it in public school by credentialed members of the Cult of Darwin in precisely the manner the cultists advocate.  The fact is that unlike most Darwinians, I have read seven of Richard Dawkins’s ten books, two of Stephen Gould’s, a random assortment of books by other authors including Charles Darwin, Marc Hauser and Daniel Dennett, around 50 published papers which relate to natural selection in some way and more than 20 years worth of magazines such as <i>Natural History </i>and <i>New Scientist</i>.</p><p>This doesn’t make me any sort of expert on the subject.  But I should think it tends to indicate that I am not <i>completely</i> uninformed about it.  And it’s certainly ironic to be repeatedly accused of ignorance when not having read any economists from Turgot to Tobin or theologians from Tertullian to Craig ever seems to prevent credentialed Cult of Darwin members from opining authoritatively on economics or theology.</p></div>",
  "content_text": "Since Paul Zachary is so fearful, perhaps I should debate this kid.  He can’t be any less capable of presenting a logical argument, and clearly\nhe can parrot the current Cult of Darwin consensus\nwith the best of them:\nAmid the hoots at Republican presidential candidate Rick Perry for saying there were “gaps” in the theory of evolution, the strongest evidence for Darwinism presented by these soi-disant rationalists was a 9-year-old boy quoted in the New York Times.\nAfter his mother had pushed him in front of Perry on the campaign trail and made him ask if Perry believed in evolution, the trained seal beamed at his Wicked Witch of the West mother, saying, “Evolution, I think, is correct!”\nThat’s the most extended discussion of Darwin’s theory to appear in the mainstream media in a quarter-century. More people know the precepts of kabala than know the basic elements of Darwinism.\nWell, if a nine year-old kid thinks it’s correct, it must be correct!  QED.  Miss Coulter’s last claim is certainly interesting, given the massive emphasis that the Cult of Darwin places upon exposing schoolchildren to its relentless propaganda at an early age.  But who would have thought that children who can barely learn to read in 12 years of public school might have a tough time retaining anything they’ve been taught about a dynamic quasi-scientific theory?\nPersonally, I tend to find it extremely amusing when accused of being ignorant about\nTENS\nTE(p)NSBMGDaGF.  Never mind that I was taught about it in public school by credentialed members of the Cult of Darwin in precisely the manner the cultists advocate.  The fact is that unlike most Darwinians, I have read seven of Richard Dawkins’s ten books, two of Stephen Gould’s, a random assortment of books by other authors including Charles Darwin, Marc Hauser and Daniel Dennett, around 50 published papers which relate to natural selection in some way and more than 20 years worth of magazines such as\nNatural History\nand\nNew Scientist\n.\nThis doesn’t make me any sort of expert on the subject.  But I should think it tends to indicate that I am not\ncompletely\nuninformed about it.  And it’s certainly ironic to be repeatedly accused of ignorance when not having read any economists from Turgot to Tobin or theologians from Tertullian to Craig ever seems to prevent credentialed Cult of Darwin members from opining authoritatively on economics or theology.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-01T07:29:00+00:00"
}