{
  "url": "https://voxday.net/2011/09/07/germany-chickens-ou/",
  "scraped_at": "2025-12-13T23:21:04.335707",
  "title": "Germany chickens out",
  "date_display": "September 7, 2011",
  "date_iso": "2011-09-07T14:00:00+00:00",
  "date_from_url": "2011-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Faced with a clear and open violation of the German Constitution, <a href=\"http://www.nytimes.com/2011/09/08/world/europe/08germany.html?hp\">the German Supreme Court unsurprisingly caved</a> rather than risk undermining the supports that are propping up the banks of the European Union:</p><blockquote><p>In a widely followed ruling on Wednesday, Germany’s Constitutional Court upheld the legality of Berlin’s rescue packages for debt-stricken euro zone countries, but said any future bailouts must be approved by a parliamentary panel….  The court rejected three appeals against the legality of earlier bailouts, which have stirred a furious political debate among Germans. The suits had been brought by a coalition of German lawmakers, economists and business executives who argued that Germany’s participation in loans and support funds for Greece undermined Parliament and infringed constitutional provisions underpinning the country’s democracy.</p></blockquote><p>In other words, there is no longer any more law in Germany than there is in the United States.  That should work out well.  All this worldwide government kowtowing to the banks in a futile and desperate attempt to keep them from going under has done is to make it perfectly clear to all and sundry that there is no law.  The law is now a transparent fiction.  All of the words written down on paper are entirely meaningless.  Read the English translation, it is <a href=\"http://www.bundesverfassungsgericht.de/en/press/bvg11-055en.html\">a masterpiece of legal weaselry</a>.</p><p>The world is rapidly entering into a literally Satanic state where do what thou wilt truly is the whole of the law.</p><p>And clearly, going to mark-to-fantasy should fix the whole thing.  After all, it has worked so well in the USA. <i>“My gnome, high above the Alps is hearing that the EU is considering suspension of bank mark to market acctg.”</i></p></div>",
  "content_text": "Faced with a clear and open violation of the German Constitution,\nthe German Supreme Court unsurprisingly caved\nrather than risk undermining the supports that are propping up the banks of the European Union:\nIn a widely followed ruling on Wednesday, Germany’s Constitutional Court upheld the legality of Berlin’s rescue packages for debt-stricken euro zone countries, but said any future bailouts must be approved by a parliamentary panel….  The court rejected three appeals against the legality of earlier bailouts, which have stirred a furious political debate among Germans. The suits had been brought by a coalition of German lawmakers, economists and business executives who argued that Germany’s participation in loans and support funds for Greece undermined Parliament and infringed constitutional provisions underpinning the country’s democracy.\nIn other words, there is no longer any more law in Germany than there is in the United States.  That should work out well.  All this worldwide government kowtowing to the banks in a futile and desperate attempt to keep them from going under has done is to make it perfectly clear to all and sundry that there is no law.  The law is now a transparent fiction.  All of the words written down on paper are entirely meaningless.  Read the English translation, it is\na masterpiece of legal weaselry\n.\nThe world is rapidly entering into a literally Satanic state where do what thou wilt truly is the whole of the law.\nAnd clearly, going to mark-to-fantasy should fix the whole thing.  After all, it has worked so well in the USA.\n“My gnome, high above the Alps is hearing that the EU is considering suspension of bank mark to market acctg.”",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-07T13:00:00+00:00"
}