{
  "url": "https://voxday.net/2011/09/08/harsh-realities-of-game-set-to-music/",
  "scraped_at": "2025-12-13T23:21:09.874506",
  "title": "Disturbed gang-bangs Taylor Swift",
  "date_display": "September 8, 2011",
  "date_iso": "2011-09-08T08:51:00+00:00",
  "date_from_url": "2011-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://www.youtube.com/watch?v=EvnYMvdlp7s\">Game set to music</a>, the perfect juxtaposition of naive young female delusions about bad boys and the predatory male perspective.  One cringes at the lovely little lamb’s attitude about how it will safely lie down with the poor, misunderstood, and very hungry lion.  Disturbed and Taylor Swift are like one of those couples where you look at them and figure she’ll be lucky if she ends up in the hospital instead of the morgue.  It’s also unusual in that the mash-up is arguably better than either song that goes into it.  If whoever put it together could have only somehow pulled a Rock Sugar and mixed in the psychopath’s manipulative line from <a href=\"http://www.youtube.com/watch?v=sqLdyZBjZeo\">Decadence</a> as well, it would have been perfect.</p><p><i>“If I scare you now, don’t run from me.  I’ve been hiding my pain you see.”</i></p><p>The insurmountable gap in understanding between these interwoven lyrics had me laughing out loud:</p><p>Swift: If you could see that I’m the one who understands you.  Been here all along so why can’t you see, you belong with me?</p><p>Draiman:  Come inside now I implore, do you think you can restore the crucial pieces missing from my brain.</p><p>Swift: Hey, isn’t this easy!</p><p>Draiman: What seems to be the matter dear?  Why do you cry and shake with fear?</p></div>",
  "content_text": "This is\nGame set to music\n, the perfect juxtaposition of naive young female delusions about bad boys and the predatory male perspective.  One cringes at the lovely little lamb’s attitude about how it will safely lie down with the poor, misunderstood, and very hungry lion.  Disturbed and Taylor Swift are like one of those couples where you look at them and figure she’ll be lucky if she ends up in the hospital instead of the morgue.  It’s also unusual in that the mash-up is arguably better than either song that goes into it.  If whoever put it together could have only somehow pulled a Rock Sugar and mixed in the psychopath’s manipulative line from\nDecadence\nas well, it would have been perfect.\n“If I scare you now, don’t run from me.  I’ve been hiding my pain you see.”\nThe insurmountable gap in understanding between these interwoven lyrics had me laughing out loud:\nSwift: If you could see that I’m the one who understands you.  Been here all along so why can’t you see, you belong with me?\nDraiman:  Come inside now I implore, do you think you can restore the crucial pieces missing from my brain.\nSwift: Hey, isn’t this easy!\nDraiman: What seems to be the matter dear?  Why do you cry and shake with fear?",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-08T07:51:00+00:00"
}