{
  "url": "https://voxday.net/2011/09/17/here-it-comes/",
  "scraped_at": "2025-12-13T23:22:02.073294",
  "title": "Here it comes",
  "date_display": "September 17, 2011",
  "date_iso": "2011-09-17T10:14:00+00:00",
  "date_from_url": "2011-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that as I’ve been tracking the debt sectors over the last few years, I have also been repeatedly warning that the federal government would not be able to indefinitely substitute public debt for the contraction in private debt.  The gamble that the federal government could fill in the credit gap until private credit began to grow again was a high-risk one that was always likely to fail. <a href=\"http://www.federalreserve.gov/releases/z1/current/accessible/l1.htm\">The latest Z1 figures</a>, reported yesterday, show that the gamble appears to be in the process of failing; consider the comparison of the growth rates of the largest debt sector, the financial, with the federal sector over the last six quarters:</p><p>Federal<br> +6.12% +4.16% +4.52% +4.08% +2.77% +0.96%</br></p><p>Financial<br> -4.40% -1.57% -1.99% -1.38% -0.93% -2.08%</br></p><p>This shows that the $4.5 trillion increase in federal debt is now slowing down while the $3.3 trillion decrease in financial debt is beginning to pick up speed again, precisely as I have been predicting.  The state and local governments are shedding debt for the first time as well, being down -0.81% and -0.78% in the first two quarters of 2011.  The household sector is officially down only $610 billion (4.4%) from the peak, but this is not an accurate number due to the gap between formal defaults and the very large number of informal defaults that have not yet been registered on the books of the mortgage banks.</p><p>These unreported defaults are the main reason most of the big banks stocks are trading at half their reported asset values.  Everyone knows that somewhere between 35% and 60% of those paper assets no longer have any value.  The net is that while total credit market debt outstanding is only down $280 billion from the Q1-2009 peak, the composition of that debt continues to change and there is a credit gap of $16.5 trillion from where the previous 2% average quarterly credit growth would have indicated.</p><p>When all these factors are taken together, it amounts to a strong indication are that the economy and the financial system are rapidly approaching another crash in the third and fourth quarters of 2011.  There are, of course, other reasons to expect one, such as Greek two-year bonds being at 66.4% compared to 9.5% one year ago.  But the Z1 report alone is sufficient to show that something wicked this way comes.</p></div>",
  "content_text": "You may recall that as I’ve been tracking the debt sectors over the last few years, I have also been repeatedly warning that the federal government would not be able to indefinitely substitute public debt for the contraction in private debt.  The gamble that the federal government could fill in the credit gap until private credit began to grow again was a high-risk one that was always likely to fail.\nThe latest Z1 figures\n, reported yesterday, show that the gamble appears to be in the process of failing; consider the comparison of the growth rates of the largest debt sector, the financial, with the federal sector over the last six quarters:\nFederal\n+6.12% +4.16% +4.52% +4.08% +2.77% +0.96%\nFinancial\n-4.40% -1.57% -1.99% -1.38% -0.93% -2.08%\nThis shows that the $4.5 trillion increase in federal debt is now slowing down while the $3.3 trillion decrease in financial debt is beginning to pick up speed again, precisely as I have been predicting.  The state and local governments are shedding debt for the first time as well, being down -0.81% and -0.78% in the first two quarters of 2011.  The household sector is officially down only $610 billion (4.4%) from the peak, but this is not an accurate number due to the gap between formal defaults and the very large number of informal defaults that have not yet been registered on the books of the mortgage banks.\nThese unreported defaults are the main reason most of the big banks stocks are trading at half their reported asset values.  Everyone knows that somewhere between 35% and 60% of those paper assets no longer have any value.  The net is that while total credit market debt outstanding is only down $280 billion from the Q1-2009 peak, the composition of that debt continues to change and there is a credit gap of $16.5 trillion from where the previous 2% average quarterly credit growth would have indicated.\nWhen all these factors are taken together, it amounts to a strong indication are that the economy and the financial system are rapidly approaching another crash in the third and fourth quarters of 2011.  There are, of course, other reasons to expect one, such as Greek two-year bonds being at 66.4% compared to 9.5% one year ago.  But the Z1 report alone is sufficient to show that something wicked this way comes.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-17T09:14:00+00:00"
}