{
  "url": "https://voxday.net/2011/09/15/homecare-or-die/",
  "scraped_at": "2025-12-13T23:21:52.900006",
  "title": "Homecare or die",
  "date_display": "September 15, 2011",
  "date_iso": "2011-09-15T11:18:00+00:00",
  "date_from_url": "2011-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, I won’t be surprised to see it reported soon that <a href=\"http://www.dailymail.co.uk/health/article-2036266/Putting-baby-nursery-raise-heart-disease-risk-sends-stress-levels-soaring.html\">daycare leads to sterility, Satanism, suicide, and supporting the Green Bay Packers</a>:</p><blockquote><p>n an article for The Biologist journal, Dr Sigman cites studies which show higher levels of the stress hormone cortisol in children who go to day care.  The increase only appears up until the age of three or so, but Dr Sigman says it is still important, as the brain develops rapidly during these years. High levels of cortisol are linked to lower resistance to infection in the short-term and heart disease in the long-term.</p></blockquote><p>Of course, no sooner will the reports be published than the supporters of these kiddy concentration camps will argue that while there is a broad consensus that day-care influences the suicide rate in the short term, there is no evidence that this has long-term detrimental consequences.</p><p>Throw in the fact that the median male worker now <a href=\"http://www.zerohedge.com/news/median-male-worker-makes-less-now-43-years-ago\">makes less than he did in 1968</a>, and a very solid case can be made that mothers with young children not only should not work, they should probably be legally barred from working if they are married or cohabitating.</p></div>",
  "content_text": "At this point, I won’t be surprised to see it reported soon that\ndaycare leads to sterility, Satanism, suicide, and supporting the Green Bay Packers\n:\nn an article for The Biologist journal, Dr Sigman cites studies which show higher levels of the stress hormone cortisol in children who go to day care.  The increase only appears up until the age of three or so, but Dr Sigman says it is still important, as the brain develops rapidly during these years. High levels of cortisol are linked to lower resistance to infection in the short-term and heart disease in the long-term.\nOf course, no sooner will the reports be published than the supporters of these kiddy concentration camps will argue that while there is a broad consensus that day-care influences the suicide rate in the short term, there is no evidence that this has long-term detrimental consequences.\nThrow in the fact that the median male worker now\nmakes less than he did in 1968\n, and a very solid case can be made that mothers with young children not only should not work, they should probably be legally barred from working if they are married or cohabitating.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-15T10:18:00+00:00"
}