{
  "url": "https://voxday.net/2011/09/28/killer-game/",
  "scraped_at": "2025-12-13T23:23:12.759600",
  "title": "Killer Game",
  "date_display": "September 28, 2011",
  "date_iso": "2011-09-28T18:06:00+00:00",
  "date_from_url": "2011-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t believe I could recommend this as a strategy for most men, but it is surely educational to learn that raping and killing a woman <a href=\"http://www.milobookclub.com/2011/09/28/killer-game/\">is demonstrably more attractive to women</a> than behaving like a gentleman.  And women, before all the inevitable snowflaking commences, please note that there is absolutely nothing to argue about here.  It is an established empirical fact.</p><p>I would go so far to argue that if you are being introduced to a woman you find attractive, she will be more attracted to you if you slap her in the face without warning and walk away without explanation than if you smile and tell her that you are very pleased to meet her.  Now this, being a mere hypothesis, can be argued.  And tested, if you’re feeling especially scientific this weekend.</p><p>Now, please note that I am not saying that women dislike men behaving like gentlemen, it’s only that they don’t find it attractive.  It’s irrelevant.  It’s analogous to the male perspective on a woman having a good job or an impressive degree.  Men don’t dislike these things, they just don’t have anything to do with whether a man is attracted to the woman possessing them or not.</p></div>",
  "content_text": "I don’t believe I could recommend this as a strategy for most men, but it is surely educational to learn that raping and killing a woman\nis demonstrably more attractive to women\nthan behaving like a gentleman.  And women, before all the inevitable snowflaking commences, please note that there is absolutely nothing to argue about here.  It is an established empirical fact.\nI would go so far to argue that if you are being introduced to a woman you find attractive, she will be more attracted to you if you slap her in the face without warning and walk away without explanation than if you smile and tell her that you are very pleased to meet her.  Now this, being a mere hypothesis, can be argued.  And tested, if you’re feeling especially scientific this weekend.\nNow, please note that I am not saying that women dislike men behaving like gentlemen, it’s only that they don’t find it attractive.  It’s irrelevant.  It’s analogous to the male perspective on a woman having a good job or an impressive degree.  Men don’t dislike these things, they just don’t have anything to do with whether a man is attracted to the woman possessing them or not.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-28T17:06:00+00:00"
}