{
  "url": "https://voxday.net/2011/09/21/mailvox-holding-scientists-accountable/",
  "scraped_at": "2025-12-13T23:22:26.193246",
  "title": "Mailvox: holding scientists accountable",
  "date_display": "September 21, 2011",
  "date_iso": "2011-09-21T13:30:00+00:00",
  "date_from_url": "2011-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BT wonders if the Italians are taking a science fetish one step too far in holding scientists accountable for <a href=\"http://timesofindia.indiatimes.com/world/europe/Italian-scientists-in-dock-for-failing-to-predict-quake/articleshow/10060940.cms\">their failure to correctly predict an imminent earthquake</a>:</p><blockquote><p>I know you are skeptical about the scientific community. But don’t you think that this is an extreme step- unless somebody can prove that they deliberately did not carry out their duties, isn’t it unfair to expect them to be superknowledgible? Can we see this as a result of the secular society going too far by putting science in an infallible pedestal that they are now expecting the scientists to answer every question? Just like may be how the priest sorcerer would have been held accountable for any “false prophesies” in the old clans on questions of winning battles or where to cultivate?</p></blockquote><p>This actually represents an interesting attack on Naturalism.  If we are to take the Naturalist perspective, which insists that science is not only the “most reliable source of knowledge” but “the best description of reality”, then obviously scientists must be held <i>more</i> responsible than other individuals who depend entirely upon  less reliable sources of knowledge such as personal experience, testimonial evidence, hearsay, and documented historical evidence.</p><p>If an accountant can be held liable for failing to properly advise his clients about the probable consequences of information he possesses on the basis of one of these less reliable sources of knowledge, than obviously scientists should similarly be held liable for their similar failures when damages are suffered by the public, especially when the public is paying their salaries.</p><p>It would certainly be interesting to see a scientist who subscribes to Naturalism, or more likely, a science fetishist, to simultaneously attempt to argue that a) science is the most reliable source of knowledge but b) scientists should not be held responsible for avoidable damages suffered by other parties caused due to the inherent unreliability of science.</p><p>It’s an intriguing question, because this dichotomy between claims made on the behalf of science and the legal responsibilities of those who utilize it fundamentally calls into account the basic validity of science as a source of knowledge.</p></div>",
  "content_text": "BT wonders if the Italians are taking a science fetish one step too far in holding scientists accountable for\ntheir failure to correctly predict an imminent earthquake\n:\nI know you are skeptical about the scientific community. But don’t you think that this is an extreme step- unless somebody can prove that they deliberately did not carry out their duties, isn’t it unfair to expect them to be superknowledgible? Can we see this as a result of the secular society going too far by putting science in an infallible pedestal that they are now expecting the scientists to answer every question? Just like may be how the priest sorcerer would have been held accountable for any “false prophesies” in the old clans on questions of winning battles or where to cultivate?\nThis actually represents an interesting attack on Naturalism.  If we are to take the Naturalist perspective, which insists that science is not only the “most reliable source of knowledge” but “the best description of reality”, then obviously scientists must be held\nmore\nresponsible than other individuals who depend entirely upon  less reliable sources of knowledge such as personal experience, testimonial evidence, hearsay, and documented historical evidence.\nIf an accountant can be held liable for failing to properly advise his clients about the probable consequences of information he possesses on the basis of one of these less reliable sources of knowledge, than obviously scientists should similarly be held liable for their similar failures when damages are suffered by the public, especially when the public is paying their salaries.\nIt would certainly be interesting to see a scientist who subscribes to Naturalism, or more likely, a science fetishist, to simultaneously attempt to argue that a) science is the most reliable source of knowledge but b) scientists should not be held responsible for avoidable damages suffered by other parties caused due to the inherent unreliability of science.\nIt’s an intriguing question, because this dichotomy between claims made on the behalf of science and the legal responsibilities of those who utilize it fundamentally calls into account the basic validity of science as a source of knowledge.",
  "tags": [
    "mailvox",
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-21T12:30:00+00:00"
}