{
  "url": "https://voxday.net/2011/09/14/mustache-vs-mustache/",
  "scraped_at": "2025-12-13T23:21:46.654211",
  "title": "Mustache vs Mustache",
  "date_display": "September 14, 2011",
  "date_iso": "2011-09-14T13:30:00+00:00",
  "date_from_url": "2011-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s like Spy vs Spy, only hairier.  Joseph Farah <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=344701\">beats up on Michael Medved</a>:</p><blockquote><p>Medved explains in the broadcast that his disgust with WND, which he refers to as “WorldNutDaily,” began during a period in which he toiled for the site as a weekly columnist – a position from which he was terminated for lack of interest by the public.</p></blockquote><p>Medved is a remarkably clueless talker, prone to moral preening and fake outrage, and Farah is correct about the lack of interest in Medved’s columns.  I had access to the servers back then and I remember my column had around 4x the readership of Medved’s when he was still on WND.</p><p>And let’s not forget that <a href=\"http://www.milobookclub.com/2006/06/09/pale-horse-tramples-michael-medved/\">Equus Pallidus reduced Medved to a sputtering puddle of self-contradictions on his own show</a> when he was having his little fainting fit over my perfectly factual, completely uncontroversial statement that if National Socialist Germany  could identify, transport, and kill 6 million Jews in three years, it is apparent that it is entirely possible for the USA to identify and transport 12 million illegal immigrants in less than eight years.</p><p>In this epic battle of mustaches, it’s clear that the edge is with 70’s Porn Stache over the Gay Mustachio.</p></div>",
  "content_text": "It’s like Spy vs Spy, only hairier.  Joseph Farah\nbeats up on Michael Medved\n:\nMedved explains in the broadcast that his disgust with WND, which he refers to as “WorldNutDaily,” began during a period in which he toiled for the site as a weekly columnist – a position from which he was terminated for lack of interest by the public.\nMedved is a remarkably clueless talker, prone to moral preening and fake outrage, and Farah is correct about the lack of interest in Medved’s columns.  I had access to the servers back then and I remember my column had around 4x the readership of Medved’s when he was still on WND.\nAnd let’s not forget that\nEquus Pallidus reduced Medved to a sputtering puddle of self-contradictions on his own show\nwhen he was having his little fainting fit over my perfectly factual, completely uncontroversial statement that if National Socialist Germany  could identify, transport, and kill 6 million Jews in three years, it is apparent that it is entirely possible for the USA to identify and transport 12 million illegal immigrants in less than eight years.\nIn this epic battle of mustaches, it’s clear that the edge is with 70’s Porn Stache over the Gay Mustachio.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-14T12:30:00+00:00"
}