{
  "url": "https://voxday.net/2011/09/20/naturalism-is-dead/",
  "scraped_at": "2025-12-13T23:22:22.776411",
  "title": "Naturalism is dead",
  "date_display": "September 20, 2011",
  "date_iso": "2011-09-20T20:02:00+00:00",
  "date_from_url": "2011-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alex Rosenberg doesn’t realize <a href=\"http://opinionator.blogs.nytimes.com/2011/09/17/why-i-am-a-naturalist/\">he’s out of date already</a>:</p><blockquote><p>Naturalism is the philosophical theory that treats science as our most reliable source of knowledge and scientific method as the most effective route to knowledge.</p></blockquote><p>To which I point to the obvious rebuttal: <i>“Gamers have solved the structure of a retrovirus enzyme whose configuration had stumped scientists for more than a decade.”</i></p><p>Obviously, the scientific method is no longer the most effective route to knowledge.  It’s not even <i>close</i> to being the most effective route.  Ludence, or the combination of reason, game programming, and mass game playing, is obviously far more effective.  Unsurprisingly, Alex turns out to be an atheist, an academic, and prone to making all the usual epistemological errors.</p><p><i>“Naturalists recognize that science is fallible. Its self-correction, its continual increase in breadth and accuracy, give naturalists confidence in the resources they borrow from physics, chemistry and biology. The second law of thermodynamics, the periodic table, and the principles of natural selection are unlikely to be threatened by future science. Philosophy can therefore rely on them to answer many of its questions without fear of being overtaken by events.”</i></p><p>I always enjoy how they try to sneak Daniel Dennett’s <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\">atheist logic</a> in there hoping that no one will notice.  “You can trust biologists.  Because physicists get amazingly accurate results.”  And, as we know, the principles of natural selection and the idea of it being the core mechanism of evolution are being threatened as never before thanks to genetic science.</p><p>But the most amusing thing is the fundamental logical error at the heart of naturalism.  He refers specifically to physics, but he means science when he writes “We should be confident that it will do better than any other approach at getting things right.”  Sure.  Just have faith.  Because past results are always indicative of future results.</p><p>UPDATE – It’s officially time to shut down the National Science Foundation.</p><blockquote><p>As CNS News reported, $762,372 of your money was spent — under the stimulus, of course — by the National Science Foundation to study . . . interpretive dance.</p></blockquote><p>Do you want to understand why an economist would have such contempt for science and scientists?  The National Science Foundation spending over $750,000 on <i><a href=\"http://www.nationalreview.com/corner/277814/close-national-science-foundation-today-kevin-d-williamson\">interpretive fucking dance</a></i> would be Exhibit A.  Let scientists fund themselves if they want to do science.  It’s long past time for the separation of science and state.</p></div>",
  "content_text": "Alex Rosenberg doesn’t realize\nhe’s out of date already\n:\nNaturalism is the philosophical theory that treats science as our most reliable source of knowledge and scientific method as the most effective route to knowledge.\nTo which I point to the obvious rebuttal:\n“Gamers have solved the structure of a retrovirus enzyme whose configuration had stumped scientists for more than a decade.”\nObviously, the scientific method is no longer the most effective route to knowledge.  It’s not even\nclose\nto being the most effective route.  Ludence, or the combination of reason, game programming, and mass game playing, is obviously far more effective.  Unsurprisingly, Alex turns out to be an atheist, an academic, and prone to making all the usual epistemological errors.\n“Naturalists recognize that science is fallible. Its self-correction, its continual increase in breadth and accuracy, give naturalists confidence in the resources they borrow from physics, chemistry and biology. The second law of thermodynamics, the periodic table, and the principles of natural selection are unlikely to be threatened by future science. Philosophy can therefore rely on them to answer many of its questions without fear of being overtaken by events.”\nI always enjoy how they try to sneak Daniel Dennett’s\natheist logic\nin there hoping that no one will notice.  “You can trust biologists.  Because physicists get amazingly accurate results.”  And, as we know, the principles of natural selection and the idea of it being the core mechanism of evolution are being threatened as never before thanks to genetic science.\nBut the most amusing thing is the fundamental logical error at the heart of naturalism.  He refers specifically to physics, but he means science when he writes “We should be confident that it will do better than any other approach at getting things right.”  Sure.  Just have faith.  Because past results are always indicative of future results.\nUPDATE – It’s officially time to shut down the National Science Foundation.\nAs CNS News reported, $762,372 of your money was spent — under the stimulus, of course — by the National Science Foundation to study . . . interpretive dance.\nDo you want to understand why an economist would have such contempt for science and scientists?  The National Science Foundation spending over $750,000 on\ninterpretive fucking dance\nwould be Exhibit A.  Let scientists fund themselves if they want to do science.  It’s long past time for the separation of science and state.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-20T19:02:00+00:00"
}