{
  "url": "https://voxday.net/2011/09/23/perry-sinks-himself/",
  "scraped_at": "2025-12-13T23:22:39.008676",
  "title": "Perry sinks himself",
  "date_display": "September 23, 2011",
  "date_iso": "2011-09-23T07:27:00+00:00",
  "date_from_url": "2011-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You really have to be remarkably stupid <a href=\"http://www.weeklystandard.com/blogs/perry-i-dont-think-you-have-heart-if-you-oppose-state-tuition-children-illegal-immigrants_594080.html\">to come out in rabid support of immigration</a> when unemployment rates are effectively at 15.5 percent:</p><blockquote><p>During Thursday night’s Republican presidential debate, Mitt Romney, Michele Bachmann, Newt Gingrich, and Rick Santorum all took shots at Rick Perry’s record on illegal immigration. Bachmann said that Texas’s law allowing in-state tuition for the children of illegal immigrants acted like a “magnet” for illegal immigrants. Perry’s response was forceful and personal. “I don’t think you have a heart,” Perry told his critics.</p><p>“If you say that we should not educate children who come into our state for no other reason than that they’ve been brought their through no fault of their own, I don’t think you have a heart,” Perry said. “We need to be educating these children because they will become a drag on our society. I think that’s what Texans wanted to do. Out of 181 members of the Texas legislature when this issue came up [there were] only four dissenting votes. This was a state issue. Texas voted on it. And I still support it today.”</p></blockquote><p>Texans don’t need to be educating Mexican children, they need to be <i>sending them back to Mexico</i>.  This is simply an astonishing statement coming as it does on the heels of the report that 80 percent of the new jobs created in Texas over the last decade went to immigrants rather than Americans.</p><p>It’s clear that neither party has any desire to represent the interest of Americans.  The Democrats are the anti-American, pro-Wall Street party while the Republicans are the pro-corporation, pro-Wall Street party.  In either case, the interests of Americans are simply ignored, when they’re not being actively attacked.  And it goes without saying that neither of them is going to do a damn thing about the ongoing economic catastrophe except to try to keep the banks afloat, both here and in Europe.</p></div>",
  "content_text": "You really have to be remarkably stupid\nto come out in rabid support of immigration\nwhen unemployment rates are effectively at 15.5 percent:\nDuring Thursday night’s Republican presidential debate, Mitt Romney, Michele Bachmann, Newt Gingrich, and Rick Santorum all took shots at Rick Perry’s record on illegal immigration. Bachmann said that Texas’s law allowing in-state tuition for the children of illegal immigrants acted like a “magnet” for illegal immigrants. Perry’s response was forceful and personal. “I don’t think you have a heart,” Perry told his critics.\n“If you say that we should not educate children who come into our state for no other reason than that they’ve been brought their through no fault of their own, I don’t think you have a heart,” Perry said. “We need to be educating these children because they will become a drag on our society. I think that’s what Texans wanted to do. Out of 181 members of the Texas legislature when this issue came up [there were] only four dissenting votes. This was a state issue. Texas voted on it. And I still support it today.”\nTexans don’t need to be educating Mexican children, they need to be\nsending them back to Mexico\n.  This is simply an astonishing statement coming as it does on the heels of the report that 80 percent of the new jobs created in Texas over the last decade went to immigrants rather than Americans.\nIt’s clear that neither party has any desire to represent the interest of Americans.  The Democrats are the anti-American, pro-Wall Street party while the Republicans are the pro-corporation, pro-Wall Street party.  In either case, the interests of Americans are simply ignored, when they’re not being actively attacked.  And it goes without saying that neither of them is going to do a damn thing about the ongoing economic catastrophe except to try to keep the banks afloat, both here and in Europe.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-23T06:27:00+00:00"
}