{
  "url": "https://voxday.net/2011/09/13/pz-myers-memorial-debate-round-1-judges/",
  "scraped_at": "2025-12-13T23:21:39.381243",
  "title": "PZ Myers Memorial Debate Round 1: The Judges",
  "date_display": "September 13, 2011",
  "date_iso": "2011-09-13T08:09:00+00:00",
  "date_from_url": "2011-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The three judges have reached their decisions and provided their commentaries.  Each not only has a different perspective, but took a different approach to their judging.  The bulk of CL’s decision <a href=\"http://thewarfareismental.wordpress.com/2011/09/12/the-pz-myers-memorial-debate-round-one/\">is posted on his blog</a>; go there to read the whole thing.  The entirety of Alex’s and Scott’s statement’s are posted here below.  Scott elected to judge both the initial statements and the rebuttals separately, whereas CL and Alex judged the whole of the four pieces.</i></p><p> <b>CL</b>: Overlooking his neglect for citations, Vox’s arguments respected scientific methodology, consistency and consensus, whereas Dominic’s arguments showed flagrant disregard for the same. I’m not being harsh, but Dominic didn’t make a single forceful argument for the non-existence of gods. On the other hand, Vox’s argument from mathematical probability established plausibility, but that isn’t sufficient to force the conclusion that gods exist. Vox’s argument from moral evil wasn’t sufficiently developed to be relevant. The clincher? Dominic conceded the forcefulness of Vox’s “plethora of evidence” argument, which clearly tips the scale in Vox’s favor, but it gets worse for Dominic: Vox’s “plethora of evidence” is also consistent with Dominic’s “alien hypothesis,” and aliens are acceptable given the definition of “gods” we’ve been supplied. So, unexpectedly, both Vox and Dominic seem to have agreed that E/L-&gt;gods! Since Dominic was supposed to argue that E/L-&gt;no gods, it seems he didn’t make his case and actually conceded Vox’s. Since our loosely-defined concept of “gods” allows for any superhuman being worshipped as able to control nature, I don’t see how Dominic could successfully argue that E/L-&gt;no gods, unless of course he attributes Vox’s “plethora of evidence” to an uncannily teleological “Northern lights” -type phenomena. Or mass delusion, but both these guys are levels above John Loftus.</p><p>I reluctantly declare Vox Day the winner of round one, but not by much. In fact, it’s almost by default.</p><p><i>NB: This is merely CL’s conclusion, CL closely analyzed the entire round on a point-by-point basis at his blog, The Warfare is Mental.  Go there <a href=\"http://thewarfareismental.wordpress.com/2011/09/12/the-pz-myers-memorial-debate-round-one/\">to read the entire analysis</a>.</i></p><p> <b>Alex Amenos</b>: I’m going to be brief and unspecific with my comments because I don’t want to risk influencing the direction or content of the participants’ arguments any more than absolutely necessary.  My breakdown, generally:</p><p>The Ancient Astronaut Argument—Oh sweet Sitchin, I never expected this when I signed on for the job.  Noting that Vox has not yet responded to the rebuttal, I give a small edge to Dominic.</p><p>Vox’s Argument from Evil v. Dominic’s Rebuttal—I didn’t find Dominic’s rebuttal to be terribly compelling.  That’s not to say it couldn’t be beefed up, but as for now….edge to Vox.</p><p>Dominic’s ‘Effect before Cause’ Argument v. Vox’s Rebuttal—Vox.</p><p>‘Problem of Infinite Regress’ Point and Counter-point—TLDR, draw</p><p>Dominic’s ‘Truth is Stranger than Fiction’ Argument v. Vox’s Rebuttal—Dominic’s argument suggests the answer to the Question is not only Not-Known but also maybe Un-Knowable.  I’m going to stay on the fence with this one for the time being.</p><p>Not a knockout by any stretch, but I give the first round to Vox.  Looking forward to round 2.</p><p> <b>Scott Scheule:</b> First, let me thank the debaters for their contributions to this perennial debate. That both could produce novel arguments on this well-worn issue is a marvel. Moreover, the respectful tone that both champions have maintained thus far is testament that–despite the great degree of name-calling currently exhibited by both sides in this era of New Atheism–an interesting, illuminating, and entertaining exchange of ideas remains possible.</p><p>I will announce my choice for the winner of each round of debate, after giving a summary and examination of the respective offerings of the debater. I have erred, in my evaluations, on the side of being overly critical. I hope no one finds this to be a sign of disrespect: it is intended as precisely the opposite.</p><p><i>Opening Statement – Dominic</i></p><p>Dominic’s opening salvo consists of three arguments. Two of these are anticipatory of the theist’s arguments: first, he denies the necessity of a prime mover, and second, he argues the cosmological argument is invalid as it is victim to an infinite regress, antipathy towards which is what is supposed to drive that argument in the first place. I examine these in turn, before moving on to the third, positive argument.</p><p> Argument 1: There is no need for a first mover.</p><p>Dominic argues that a first mover is only necessary if space-time is causal and linear, and we have reasons to believe that it is not (entirely) so.</p><p>I’m not entirely sure it’s true that linearity is necessary for the first mover argument. Rather it’s the causality prong that bears the burden.  If God exists out of time, which seems to be the typical conception, then he doesn’t exist “before” the cause in anything but a very strained sense of “before.” Now, to be sure, all these mysteries of timelessness are a problem for the first cause argument proponent as well, importing as he does everyday “timeful” intuitions to a timeless realm, and I imagine there are significant points to be gained by the atheist in that area. But that’s something we’ll have to examine if it comes up.</p><p>Regardless, Dominic attacks the linearity of space-time by giving evidence against that conception: 1. a recent paper by Daryl Bem that shows some psychic ability in participants, particularly as regards pornography; 2. an anecdote by my fellow judge “cl” where he claims to have had a prescient vision; 3. the phenomenon of deja vu; and 4. mantic dreams.</p><p>Again, even if we grant the truth of this non-linear version of space-time, I don’t see it much aids against the prime mover argument. Say it’s proven an effect may precede its cause: if such, we can imagine our prime mover no longer necessarily preceding his creation, but perhaps even succeeding it. God may exist after the end of the universe, and thence he reached back and caused the universe. This slightly altered cosmological argument seems to pack the same punch, as, as I’ve said, it’s the connection of cause and effect that matters, not the temporal relation between the two.</p><p>But let us assume that non-linearity would be a significant wrench in the works for the cosmological argument. Even so, I find Dominic’s evidence strikingly weak. With all due respect to cl, I think we’re perfectly entitled to cut his experience out of the data set as a mere anecdote. (Of course cl may not be able to do so, which is presumably why Dominic chose it. Nonetheless, I’m not cl, so I can, and do.) Bem’s paper is interesting, but recent, and an outlier. I would be happy if it turns out to have identified something true–but, given the long failure of research to find evidence of such things, I think a large amount of skepticism is required here. As to deja vu, which I experience quite often, I’m similarly skeptical here: mystical and delightful as the phenomenon is, my guess is it’s just a short in the brain’s memory apparatus.</p><p>As to prescient dreams, Dominic felt the phenomenon widespread enough not to need a reference. I disagree.</p><p>So I think the evidence offered for non-linearity is weak at best, and the issue perhaps entirely irrelevant.</p><p> Argument 2: The cosmological argument suffers an infinite regress.</p><p>I have never heard this counterargument before. Dominic runs the normal cosmological argument, and points out that thought itself is the phenomenon that most easily crosses abstract and material, and thus it was a thought of God that bridged the gap. The first thought, he asserts, was a thought about thinking, as that would be the purest thought. But what was the thinking that that thought was about about? More thinking? Hence, an infinite regress.</p><p>But I see no reason to think the primordial thought of God would be about thinking. If that’s truly the purest thought–and I don’t see why that is either–then why would God have to think that and nothing else?</p><p>Moreover, I’m generally skeptical of infinite regress arguments. Even with Zeno’s paradox, nevertheless, arrows do reach their destinations, so either that’s an illusion of some sort, or there’s something wrong with the argument. The latter seems more likely. And I’m tempted to use a similar counterexample here. Thinking about thinking leads to an infinite regress, perhaps: nonetheless I can–and I imagine y’all can as well–think about thinking. I’m doing it right now. Infinite regress, or no, I can do it, so either an infinite regress must be possible, or for some reason, this really isn’t an infinite regress.</p><p> Argument 3: The truth is stranger than fiction.</p><p>This is the only positive argument against the existence of gods. If the previous two counterarguments succeeded and there were no other pro-theistic arguments, we would be left with only agnosticism. I’m not faulting Dominic here–the topic of the debate was never sharpened into anything as clear as “There are gods,” but left rather murky as “evidence for and against gods.” Still, as his contribution to evidence “against gods,” for which he’s presumably the proponent, this doesn’t do much.</p><p>Dominic’s point here is that gods are simply not strange enough to be the real answer. Reality has to be far stranger than that.</p><p>The adjective “strange” verges on the dangerously subjective. Moreover, imagine hearing, e.g., Christian orthodoxy without prior exposure. God gives birth to a third of His tripartite-self, speaking to that fraction of himself and ultimately sacrificing it to remove the ancient taint of ingestion of a forbidden fruit. Eldritcher stories are imaginable, but with fresh ears this one’s pretty weird. I recall C.S. Lewis in, I believe, “Mere Christianity” pointing out this oddness.</p><p>Dominic gives examples of weirdness proving true: quantum physics (certainly the best example), heliocentrism. Many more examples could be added: evolution, the germ theory of disease, genetics. But there’s surely some selection bias here: a discovery must be, almost by definition, of something weird. Otherwise a discovery isn’t really necessary. Why is it bright during the day and dark at night? Answer: the sun shines during the day. Nothing weird about that. All the commonsensical functions of the world don’t draw attention–point being, truth is often quite a bit less strange than fiction. We just don’t notice it. The chicken probably crossed the road because chickens walk and roads are things that are sometimes walked over.</p><p>Moreover, simple strangeness doesn’t really bear on the issue of theism vs. atheism. Yes, it may be that reality is much stranger than imagined. But that reality may have a God or may not. If there is a God, then He may well be something far stranger than anything we’ve imagined (many Christians would happily agree)–nonetheless, He’s still God. Or there may be no God, and reality is, alone, far stranger than anticipated (many atheists would happily agree). There still won’t be a God.</p><p>So I don’t think this argument succeeds.</p><p>Dominic also says postulating the existence of supernatural beings is abundantly obvious as being a convenient fantasy concocted as a childish and superficial explanation of any and everything. This may be true, but it’s mere assertion, and can be treated as such.</p><p> <i>Opening Statement – Vox Day</i></p><p>Vox begins by widening evidence to its full dictionary definition, in contrast with the niggardly conception that many of the New Atheists hew to. Essentially his conception of evidence allows in testimony, whereas others would limit evidence to the purely scientific. There’s usually some sort of vulgar verificationism or falsificationism appealed to by the atheist here, but such an appeal is naive.</p><p>With this wide definition, Vox Day points out the vast quantity of evidence for gods throughout time.</p><p>It’s hard to quarrel with this and I don’t. Even if such evidence is flawed in some way, it must be dealt with. While Day defends this proposition at some length, with examples, as I largely agree I won’t detail his defense. I only note that the defense is sound, and the examples–the Hittite Empire, Nineveh, the Higgs boson–are felicitous.</p><p>Vox makes the interesting observation that the supernatural universe may coincide with some part of the multiverse, and an inhabitant thereof may well be the gods we seek. Could be.</p><p>There’s another interesting observation worth quoting:</p><p>“When the mathematical odds indicate that advanced technological aliens exist somewhere in the material universe and contact with superhuman beings has been reported on tens of thousands of occasions, the assumption that gods do not exist begins to look more like outright denial than reasonable skepticism. When seen in this light, the failure of modern science to detect gods in what the scientific consensus presently states is only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist. No doubt this would have seemed like a perfectly reasonable conclusion, right up until the day Córdoba arrived in the Yucatán.”</p><p>This is clever and I’ve never heard it before. It is somewhat weaker than it seems at first blush, as it neglects a salient feature of our evidence for gods: it is as our ability to measure reality and record history has improved that our evidence for the supernatural has begun to wane. Now, as Vox points out, rightly, this could be a momentary blip. Human history is no lengthy thing in the greater scheme of the universe, and the gods that be may simply be busy elsewhere–nonetheless, the inverse correlation is suggestive.</p><p>Vox goes on to make an argument from evil, essentially: 1. evil exists; 2. the existence of evil “requires the presence of a source of good”; 3. the only entity capable of dictating an objective and definitive good is the creator entity or His agent.  Hence, God, exists. Fans of William Lane Craig will recognize this move.</p><p>I don’t find this persuasive, for at least two reasons. One, I simply don’t think evil exists. There are things I would describe as morally wrong, but all I intend by that judgement is to express my subjective dislike of such things. Many do not share my intuition here–it’s a common feeling that good/evil has a universal, timeless aspect that other, more petty likes and dislikes or ours lack: I share this hunch, for example, but I resolve it by denying its validity. Others don’t, and for them, this argument has a weight that should be respected.</p><p>Nevertheless, the other steps of the argument strike me as of dubious validity as well. Why, for example, should “good” be taken as the fundamental quality and not “evil”? Perhaps all good requires a perfectly evil being, after all. Nor is it as self-evidently clear to me as it is to Vox that evil is the sort of thing only defined in contrast with its opposite, a la heat and cold.</p><p>Nor is it clear that a creator gets to define morality. On a smaller scale, I think few believe this as regards, for example, parents and their children. We would rightly balk at the parent who claimed to able to define the morality of his ilk, creator or no.</p><p>Nor is it clear to me why the creator (or his agent) most be the one propounding moral law. Suppose the creator were not morally perfect (nothing seems to demand that He be so, save Anselm’s shaky metaphysics), and another god, one who didn’t create, existed. Suppose the latter were perfectly moral. Surely it’s the latter who we’d look to as the propounder of morality–creator or no.</p><p>Now it may be the vast power of the Almighty means the rules are different when we’re dealing with an ex nihilo creation. But that argument remains to be made.</p><p>Bottom line, this move may go through, but it’s not clear that it must without more information.</p><p>Note that our debaters have shot past one another here. Dominic attacked the cosmological argument, but Day didn’t rely on that (unless it’s implicit in his discussion of a creator God). Rather, Day’s main evidence is testimonial.</p><p>Of all the claims, it seems to me that it is this, Day’s mustering and rescuing of testimonial evidence, that is the strongest thus far adduced. Thus, the round goes to Day.</p><p> <i>Dominic – First Rebuttal</i></p><p>Dominic’s rebuttal is attractive, clever, and funny. Rather than dispute Day’s insistence on the validity of much testimonial evidence, Dominic glibly accepts it, but points out it misses something: accounts of aliens. Dominic then treats us to a brief history of the concept of extraterrestrials and the rise of abduction accounts.</p><p>Moreover, Dominic argues, it is more likely that the testimony for gods through the ages was actually imperfectly grasped accounts of encounters with extraterrestrials. Such beings are statistically probable, as Fermi pointed out. (I am somewhat disappointed that Dominic didn’t seize on evidence of Elvis sightings and make the parallel argument that all testimony for gods through the ages was actually imperfectly grasped accounts of the King.)</p><p>But aliens, however powerful, are not gods, Dominic argues. No more than the technically advanced men worshipped by the famous cargo cults were gods in relation to their devotees. I agree.</p><p>The extraterrestrial argument is a fresh argument–John Shook mentions aliens in his debate with Craig, but he certainly doesn’t develop the theme as fully as Dominic does. It’s hard to dislike the argument; it would resolve the Fermi paradox, at least. If this were a common counterargument, I’d give the common responses to it. But it’s new to me, so I’ll leave it to Day.</p><p>Day’s testimonial evidence arguably dispatched with, Dominic moves onto the (reverse) argument from evil.</p><p>Dominic defines evil in a fairly non-controversial matter, essentially willful infliction of harm and suffering, then examines Day’s metaphor of light and dark, and pointedly disagrees with it.</p><p>Dominic first disputes that evil is purely a negative thing, a mere absence of good. Evil, says he, is “recognized through positive…tangible… action.”</p><p>He says the objectivity of evil is a result of it being unpleasant for someone, and that, presumably, is enough to impart objectivity. No lawgiver is needed.</p><p>I find this an uncomfortable expansion of what it means for something to be objective. If objectivity can be achieved by merely having an effect on a person, it’s hard to see what couldn’t be objective. Take any of our stereotypical notions of subjectivity: say, is Glee a good TV show?  Now surely if anything is subjective, it’s this. Yet there is a measurable effect of Glee on its viewers–we can clock laughter, survey boredom, gauge serotonin release, etc. Does this render the quality of Glee an objective fact? Surely it can’t, if objectivity/subjectivity is to mean anything.</p><p>Nonetheless, Dominic’s statement that “Good and Evil laws requiring a lawgiver is [an] assumption” is well taken. The atheistic moral realist can claim that morality is simply a fact of the universe, a brute fact, on a par with basic physical laws. The origin of those physical laws is problematic, but it at least gives the realist some precedent.</p><p>Moreover, Dominic seems to agree with me that morality is not objective in the commonly held sense of the term.</p><p>He argues that morality is not, in principle, different from other human sensitivities, such as to heat and to sweetness. Why, he asks, should evil be elevated to the level of universal law, when we don’t do the same with heat and sweetness? Essentially, the argument seems to now be: man’s moral sense has enough in common with things we consider simply subjective to be rightfully considered subjective itself. Thus he rejects the first plank in Day’s argument from evil: that evil exists. Sure, Dominic thinks evil exists, but not in the objective, universal sense that Day does and many others do.</p><p>I realize that Dominic is agreeing with my own stated view here, and it’s somewhat ironic that I’m now going to critique that belief, but here goes.</p><p>Yes, it may be that “morality” is no more objective than heat and sweetness. Nonetheless, there is a very common hunch that it is, even among atheists. Witness Sam Harris’s latest (abysmal) attempt to produce an atheistic account of objective morality. What are we to do with this intuition? It may be wrong–but why is it at all? Why indeed, as Dominic himself asks, do we elevate morality to universal law?</p><p>I don’t know the answer. But regardless, the simple fact of the matter is we do elevate morality to universal law. Why? Well, perhaps there’s some evolutionary psych explanation. But there’s another possibility, one that is far simpler: perhaps morality simply is universal, while sweetness and heat sensation are not.</p><p>In sum, Dominic produces an insightful if partly problematic critique of Day’s two arguments for God. Again though, this leaves us only, if entirely successful, as agnostics.</p><p> <i>First Rebuttal – Vox Day</i></p><p>Day begins by pointing out Dominic’s definition of gods as beings predating this universe is unnecessarily restrictive, and historically inaccurate. Only the creator God need precede the universe: the vast menagerie of others gods have no such requirement, and historically are seldom described as such. Day gives the example of Olympians, who patently were not creators.</p><p>Still I wonder if these non-creator gods really qualify as gods, or if they are, as Dominic argued, merely superior beings. That is to say, are these non-creator gods nothing more than the technologically advanced humans that the cargo cults centered around? Dominic dismisses them as unworthy of consideration for this debate because of this identity: he may well be right to do so. It may be that the Creator is the only suitably godlike being worth debating.</p><p>Even were that so, however, Day defends the Creator as well. Day dismisses Dominic’s evidence for the (partly) non-causal nature of time as irrelevant. I had much the same criticism in my review of Dominic’s opening argument, and so agree with Day here. However, Day does little more than simply assert this irrelevancy: some more illustration would have helped.</p><p>I do disagree, however, that it is completely irrelevant. It may well be irrelevant to the vast majority of gods, but, the cause and effect and linearity of time does bear on the issue of the creator God, if no other. At least, Dominic argues it does and needs to be addressed. We thus have a set of dueling assertions here, with Dominic asserting relevancy and Day denying it, with little other exploration.</p><p>Moreover, the nature of cause and effect–unlike linearity–strikes me as an intimately important part of the cosmological argument. Witness any of Craig’s presentations, which invariably start with something like: “Premise 1: Everything that begins to exist has a cause.” Now if there were a counterexample to this, that would be pertinent. Nonetheless, Dominic does not, psychic porn notwithstanding, present any such counterexample that I can see. Perhaps Day simply disagrees that violations of causality in our universe have any bearing on that initial premise: if so, I’m sympathetic, but not convinced.</p><p>Assertion or no, as I largely agree with Day’s stance, it’s tough to fault it. Moreover, Dominic’s assertion was the counterargument to an argument that Day didn’t actually make–so he’s within his rights to wave it away.</p><p>Day goes on to dispute Dominic’s argument about the infinite regress present in the Creator’s first thought. He echoes some of my criticisms and adds more besides, and I think largely carries the day here. I’ll move on in the interests of avoiding pleonasm.</p><p>Day goes on to critique Dominic’s sole positive argument for atheism, his “truth is stranger than fiction” argument. Day and I agree here that the metric is disappointingly subjective. Indeed, I find many of Day’s criticisms here, as well, coincide with mine, so I won’t repeat them at length. I will only sum them up briefly: 1. strangeness is subjective; 2. strangeness functions equally well as an argument against the current scientific, materialist consensus, as it does to the current theological consensus.</p><p>Day points out, rightly:</p><p>“Had I argued that gods exist because their existence is obvious to me, I would have expected his rebuttal to consist of little more than pointing and laughing, because that is all that would have been needed to dismiss such a feeble appeal to personal sensibilities.”</p><p>Just so. It is not per se an invalid step to take something merely as sensually obvious–this is what my belief in the external world ultimately comes down to–but to assert this and merely nothing else would not do much to carry one’s burden of persuasion. Note that Craig in his debates will mention the testimony of the Holy Spirit as evidence for God–rightly–but never rests his entire defense on this one prong, and usually spends most of his time elsewhere; while he believes it to be the strongest argument, he realizes it’s not persuasive to those who don’t already agree.</p><p>If my review here is rather brief, it’s because by and large I find little to fault Day for here, and for a reason: I had many of the same reactions to Dominic’s arguments. While Dominic’s rebuttal was inventive, Day’s was less so. But I can’t fault Day for this: the reason it was less inventive is because a less inventive response was necessary for Dominic’s opening arguments.</p><p>Day wins the rebuttal.</p><p> UPDATE – In light of the judges awarding the first round to me, I’m going to exercise my option to write the next post, thus giving Dominic the rebuttal.  I will attempt to send my Round 2 post to him by Friday evening.  The word limit for both of us is 3k words.</p></div>",
  "content_text": "The three judges have reached their decisions and provided their commentaries.  Each not only has a different perspective, but took a different approach to their judging.  The bulk of CL’s decision\nis posted on his blog\n; go there to read the whole thing.  The entirety of Alex’s and Scott’s statement’s are posted here below.  Scott elected to judge both the initial statements and the rebuttals separately, whereas CL and Alex judged the whole of the four pieces.\nCL\n: Overlooking his neglect for citations, Vox’s arguments respected scientific methodology, consistency and consensus, whereas Dominic’s arguments showed flagrant disregard for the same. I’m not being harsh, but Dominic didn’t make a single forceful argument for the non-existence of gods. On the other hand, Vox’s argument from mathematical probability established plausibility, but that isn’t sufficient to force the conclusion that gods exist. Vox’s argument from moral evil wasn’t sufficiently developed to be relevant. The clincher? Dominic conceded the forcefulness of Vox’s “plethora of evidence” argument, which clearly tips the scale in Vox’s favor, but it gets worse for Dominic: Vox’s “plethora of evidence” is also consistent with Dominic’s “alien hypothesis,” and aliens are acceptable given the definition of “gods” we’ve been supplied. So, unexpectedly, both Vox and Dominic seem to have agreed that E/L->gods! Since Dominic was supposed to argue that E/L->no gods, it seems he didn’t make his case and actually conceded Vox’s. Since our loosely-defined concept of “gods” allows for any superhuman being worshipped as able to control nature, I don’t see how Dominic could successfully argue that E/L->no gods, unless of course he attributes Vox’s “plethora of evidence” to an uncannily teleological “Northern lights” -type phenomena. Or mass delusion, but both these guys are levels above John Loftus.\nI reluctantly declare Vox Day the winner of round one, but not by much. In fact, it’s almost by default.\nNB: This is merely CL’s conclusion, CL closely analyzed the entire round on a point-by-point basis at his blog, The Warfare is Mental.  Go there\nto read the entire analysis\n.\nAlex Amenos\n: I’m going to be brief and unspecific with my comments because I don’t want to risk influencing the direction or content of the participants’ arguments any more than absolutely necessary.  My breakdown, generally:\nThe Ancient Astronaut Argument—Oh sweet Sitchin, I never expected this when I signed on for the job.  Noting that Vox has not yet responded to the rebuttal, I give a small edge to Dominic.\nVox’s Argument from Evil v. Dominic’s Rebuttal—I didn’t find Dominic’s rebuttal to be terribly compelling.  That’s not to say it couldn’t be beefed up, but as for now….edge to Vox.\nDominic’s ‘Effect before Cause’ Argument v. Vox’s Rebuttal—Vox.\n‘Problem of Infinite Regress’ Point and Counter-point—TLDR, draw\nDominic’s ‘Truth is Stranger than Fiction’ Argument v. Vox’s Rebuttal—Dominic’s argument suggests the answer to the Question is not only Not-Known but also maybe Un-Knowable.  I’m going to stay on the fence with this one for the time being.\nNot a knockout by any stretch, but I give the first round to Vox.  Looking forward to round 2.\nScott Scheule:\nFirst, let me thank the debaters for their contributions to this perennial debate. That both could produce novel arguments on this well-worn issue is a marvel. Moreover, the respectful tone that both champions have maintained thus far is testament that–despite the great degree of name-calling currently exhibited by both sides in this era of New Atheism–an interesting, illuminating, and entertaining exchange of ideas remains possible.\nI will announce my choice for the winner of each round of debate, after giving a summary and examination of the respective offerings of the debater. I have erred, in my evaluations, on the side of being overly critical. I hope no one finds this to be a sign of disrespect: it is intended as precisely the opposite.\nOpening Statement – Dominic\nDominic’s opening salvo consists of three arguments. Two of these are anticipatory of the theist’s arguments: first, he denies the necessity of a prime mover, and second, he argues the cosmological argument is invalid as it is victim to an infinite regress, antipathy towards which is what is supposed to drive that argument in the first place. I examine these in turn, before moving on to the third, positive argument.\nArgument 1: There is no need for a first mover.\nDominic argues that a first mover is only necessary if space-time is causal and linear, and we have reasons to believe that it is not (entirely) so.\nI’m not entirely sure it’s true that linearity is necessary for the first mover argument. Rather it’s the causality prong that bears the burden.  If God exists out of time, which seems to be the typical conception, then he doesn’t exist “before” the cause in anything but a very strained sense of “before.” Now, to be sure, all these mysteries of timelessness are a problem for the first cause argument proponent as well, importing as he does everyday “timeful” intuitions to a timeless realm, and I imagine there are significant points to be gained by the atheist in that area. But that’s something we’ll have to examine if it comes up.\nRegardless, Dominic attacks the linearity of space-time by giving evidence against that conception: 1. a recent paper by Daryl Bem that shows some psychic ability in participants, particularly as regards pornography; 2. an anecdote by my fellow judge “cl” where he claims to have had a prescient vision; 3. the phenomenon of deja vu; and 4. mantic dreams.\nAgain, even if we grant the truth of this non-linear version of space-time, I don’t see it much aids against the prime mover argument. Say it’s proven an effect may precede its cause: if such, we can imagine our prime mover no longer necessarily preceding his creation, but perhaps even succeeding it. God may exist after the end of the universe, and thence he reached back and caused the universe. This slightly altered cosmological argument seems to pack the same punch, as, as I’ve said, it’s the connection of cause and effect that matters, not the temporal relation between the two.\nBut let us assume that non-linearity would be a significant wrench in the works for the cosmological argument. Even so, I find Dominic’s evidence strikingly weak. With all due respect to cl, I think we’re perfectly entitled to cut his experience out of the data set as a mere anecdote. (Of course cl may not be able to do so, which is presumably why Dominic chose it. Nonetheless, I’m not cl, so I can, and do.) Bem’s paper is interesting, but recent, and an outlier. I would be happy if it turns out to have identified something true–but, given the long failure of research to find evidence of such things, I think a large amount of skepticism is required here. As to deja vu, which I experience quite often, I’m similarly skeptical here: mystical and delightful as the phenomenon is, my guess is it’s just a short in the brain’s memory apparatus.\nAs to prescient dreams, Dominic felt the phenomenon widespread enough not to need a reference. I disagree.\nSo I think the evidence offered for non-linearity is weak at best, and the issue perhaps entirely irrelevant.\nArgument 2: The cosmological argument suffers an infinite regress.\nI have never heard this counterargument before. Dominic runs the normal cosmological argument, and points out that thought itself is the phenomenon that most easily crosses abstract and material, and thus it was a thought of God that bridged the gap. The first thought, he asserts, was a thought about thinking, as that would be the purest thought. But what was the thinking that that thought was about about? More thinking? Hence, an infinite regress.\nBut I see no reason to think the primordial thought of God would be about thinking. If that’s truly the purest thought–and I don’t see why that is either–then why would God have to think that and nothing else?\nMoreover, I’m generally skeptical of infinite regress arguments. Even with Zeno’s paradox, nevertheless, arrows do reach their destinations, so either that’s an illusion of some sort, or there’s something wrong with the argument. The latter seems more likely. And I’m tempted to use a similar counterexample here. Thinking about thinking leads to an infinite regress, perhaps: nonetheless I can–and I imagine y’all can as well–think about thinking. I’m doing it right now. Infinite regress, or no, I can do it, so either an infinite regress must be possible, or for some reason, this really isn’t an infinite regress.\nArgument 3: The truth is stranger than fiction.\nThis is the only positive argument against the existence of gods. If the previous two counterarguments succeeded and there were no other pro-theistic arguments, we would be left with only agnosticism. I’m not faulting Dominic here–the topic of the debate was never sharpened into anything as clear as “There are gods,” but left rather murky as “evidence for and against gods.” Still, as his contribution to evidence “against gods,” for which he’s presumably the proponent, this doesn’t do much.\nDominic’s point here is that gods are simply not strange enough to be the real answer. Reality has to be far stranger than that.\nThe adjective “strange” verges on the dangerously subjective. Moreover, imagine hearing, e.g., Christian orthodoxy without prior exposure. God gives birth to a third of His tripartite-self, speaking to that fraction of himself and ultimately sacrificing it to remove the ancient taint of ingestion of a forbidden fruit. Eldritcher stories are imaginable, but with fresh ears this one’s pretty weird. I recall C.S. Lewis in, I believe, “Mere Christianity” pointing out this oddness.\nDominic gives examples of weirdness proving true: quantum physics (certainly the best example), heliocentrism. Many more examples could be added: evolution, the germ theory of disease, genetics. But there’s surely some selection bias here: a discovery must be, almost by definition, of something weird. Otherwise a discovery isn’t really necessary. Why is it bright during the day and dark at night? Answer: the sun shines during the day. Nothing weird about that. All the commonsensical functions of the world don’t draw attention–point being, truth is often quite a bit less strange than fiction. We just don’t notice it. The chicken probably crossed the road because chickens walk and roads are things that are sometimes walked over.\nMoreover, simple strangeness doesn’t really bear on the issue of theism vs. atheism. Yes, it may be that reality is much stranger than imagined. But that reality may have a God or may not. If there is a God, then He may well be something far stranger than anything we’ve imagined (many Christians would happily agree)–nonetheless, He’s still God. Or there may be no God, and reality is, alone, far stranger than anticipated (many atheists would happily agree). There still won’t be a God.\nSo I don’t think this argument succeeds.\nDominic also says postulating the existence of supernatural beings is abundantly obvious as being a convenient fantasy concocted as a childish and superficial explanation of any and everything. This may be true, but it’s mere assertion, and can be treated as such.\nOpening Statement – Vox Day\nVox begins by widening evidence to its full dictionary definition, in contrast with the niggardly conception that many of the New Atheists hew to. Essentially his conception of evidence allows in testimony, whereas others would limit evidence to the purely scientific. There’s usually some sort of vulgar verificationism or falsificationism appealed to by the atheist here, but such an appeal is naive.\nWith this wide definition, Vox Day points out the vast quantity of evidence for gods throughout time.\nIt’s hard to quarrel with this and I don’t. Even if such evidence is flawed in some way, it must be dealt with. While Day defends this proposition at some length, with examples, as I largely agree I won’t detail his defense. I only note that the defense is sound, and the examples–the Hittite Empire, Nineveh, the Higgs boson–are felicitous.\nVox makes the interesting observation that the supernatural universe may coincide with some part of the multiverse, and an inhabitant thereof may well be the gods we seek. Could be.\nThere’s another interesting observation worth quoting:\n“When the mathematical odds indicate that advanced technological aliens exist somewhere in the material universe and contact with superhuman beings has been reported on tens of thousands of occasions, the assumption that gods do not exist begins to look more like outright denial than reasonable skepticism. When seen in this light, the failure of modern science to detect gods in what the scientific consensus presently states is only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist. No doubt this would have seemed like a perfectly reasonable conclusion, right up until the day Córdoba arrived in the Yucatán.”\nThis is clever and I’ve never heard it before. It is somewhat weaker than it seems at first blush, as it neglects a salient feature of our evidence for gods: it is as our ability to measure reality and record history has improved that our evidence for the supernatural has begun to wane. Now, as Vox points out, rightly, this could be a momentary blip. Human history is no lengthy thing in the greater scheme of the universe, and the gods that be may simply be busy elsewhere–nonetheless, the inverse correlation is suggestive.\nVox goes on to make an argument from evil, essentially: 1. evil exists; 2. the existence of evil “requires the presence of a source of good”; 3. the only entity capable of dictating an objective and definitive good is the creator entity or His agent.  Hence, God, exists. Fans of William Lane Craig will recognize this move.\nI don’t find this persuasive, for at least two reasons. One, I simply don’t think evil exists. There are things I would describe as morally wrong, but all I intend by that judgement is to express my subjective dislike of such things. Many do not share my intuition here–it’s a common feeling that good/evil has a universal, timeless aspect that other, more petty likes and dislikes or ours lack: I share this hunch, for example, but I resolve it by denying its validity. Others don’t, and for them, this argument has a weight that should be respected.\nNevertheless, the other steps of the argument strike me as of dubious validity as well. Why, for example, should “good” be taken as the fundamental quality and not “evil”? Perhaps all good requires a perfectly evil being, after all. Nor is it as self-evidently clear to me as it is to Vox that evil is the sort of thing only defined in contrast with its opposite, a la heat and cold.\nNor is it clear that a creator gets to define morality. On a smaller scale, I think few believe this as regards, for example, parents and their children. We would rightly balk at the parent who claimed to able to define the morality of his ilk, creator or no.\nNor is it clear to me why the creator (or his agent) most be the one propounding moral law. Suppose the creator were not morally perfect (nothing seems to demand that He be so, save Anselm’s shaky metaphysics), and another god, one who didn’t create, existed. Suppose the latter were perfectly moral. Surely it’s the latter who we’d look to as the propounder of morality–creator or no.\nNow it may be the vast power of the Almighty means the rules are different when we’re dealing with an ex nihilo creation. But that argument remains to be made.\nBottom line, this move may go through, but it’s not clear that it must without more information.\nNote that our debaters have shot past one another here. Dominic attacked the cosmological argument, but Day didn’t rely on that (unless it’s implicit in his discussion of a creator God). Rather, Day’s main evidence is testimonial.\nOf all the claims, it seems to me that it is this, Day’s mustering and rescuing of testimonial evidence, that is the strongest thus far adduced. Thus, the round goes to Day.\nDominic – First Rebuttal\nDominic’s rebuttal is attractive, clever, and funny. Rather than dispute Day’s insistence on the validity of much testimonial evidence, Dominic glibly accepts it, but points out it misses something: accounts of aliens. Dominic then treats us to a brief history of the concept of extraterrestrials and the rise of abduction accounts.\nMoreover, Dominic argues, it is more likely that the testimony for gods through the ages was actually imperfectly grasped accounts of encounters with extraterrestrials. Such beings are statistically probable, as Fermi pointed out. (I am somewhat disappointed that Dominic didn’t seize on evidence of Elvis sightings and make the parallel argument that all testimony for gods through the ages was actually imperfectly grasped accounts of the King.)\nBut aliens, however powerful, are not gods, Dominic argues. No more than the technically advanced men worshipped by the famous cargo cults were gods in relation to their devotees. I agree.\nThe extraterrestrial argument is a fresh argument–John Shook mentions aliens in his debate with Craig, but he certainly doesn’t develop the theme as fully as Dominic does. It’s hard to dislike the argument; it would resolve the Fermi paradox, at least. If this were a common counterargument, I’d give the common responses to it. But it’s new to me, so I’ll leave it to Day.\nDay’s testimonial evidence arguably dispatched with, Dominic moves onto the (reverse) argument from evil.\nDominic defines evil in a fairly non-controversial matter, essentially willful infliction of harm and suffering, then examines Day’s metaphor of light and dark, and pointedly disagrees with it.\nDominic first disputes that evil is purely a negative thing, a mere absence of good. Evil, says he, is “recognized through positive…tangible… action.”\nHe says the objectivity of evil is a result of it being unpleasant for someone, and that, presumably, is enough to impart objectivity. No lawgiver is needed.\nI find this an uncomfortable expansion of what it means for something to be objective. If objectivity can be achieved by merely having an effect on a person, it’s hard to see what couldn’t be objective. Take any of our stereotypical notions of subjectivity: say, is Glee a good TV show?  Now surely if anything is subjective, it’s this. Yet there is a measurable effect of Glee on its viewers–we can clock laughter, survey boredom, gauge serotonin release, etc. Does this render the quality of Glee an objective fact? Surely it can’t, if objectivity/subjectivity is to mean anything.\nNonetheless, Dominic’s statement that “Good and Evil laws requiring a lawgiver is [an] assumption” is well taken. The atheistic moral realist can claim that morality is simply a fact of the universe, a brute fact, on a par with basic physical laws. The origin of those physical laws is problematic, but it at least gives the realist some precedent.\nMoreover, Dominic seems to agree with me that morality is not objective in the commonly held sense of the term.\nHe argues that morality is not, in principle, different from other human sensitivities, such as to heat and to sweetness. Why, he asks, should evil be elevated to the level of universal law, when we don’t do the same with heat and sweetness? Essentially, the argument seems to now be: man’s moral sense has enough in common with things we consider simply subjective to be rightfully considered subjective itself. Thus he rejects the first plank in Day’s argument from evil: that evil exists. Sure, Dominic thinks evil exists, but not in the objective, universal sense that Day does and many others do.\nI realize that Dominic is agreeing with my own stated view here, and it’s somewhat ironic that I’m now going to critique that belief, but here goes.\nYes, it may be that “morality” is no more objective than heat and sweetness. Nonetheless, there is a very common hunch that it is, even among atheists. Witness Sam Harris’s latest (abysmal) attempt to produce an atheistic account of objective morality. What are we to do with this intuition? It may be wrong–but why is it at all? Why indeed, as Dominic himself asks, do we elevate morality to universal law?\nI don’t know the answer. But regardless, the simple fact of the matter is we do elevate morality to universal law. Why? Well, perhaps there’s some evolutionary psych explanation. But there’s another possibility, one that is far simpler: perhaps morality simply is universal, while sweetness and heat sensation are not.\nIn sum, Dominic produces an insightful if partly problematic critique of Day’s two arguments for God. Again though, this leaves us only, if entirely successful, as agnostics.\nFirst Rebuttal – Vox Day\nDay begins by pointing out Dominic’s definition of gods as beings predating this universe is unnecessarily restrictive, and historically inaccurate. Only the creator God need precede the universe: the vast menagerie of others gods have no such requirement, and historically are seldom described as such. Day gives the example of Olympians, who patently were not creators.\nStill I wonder if these non-creator gods really qualify as gods, or if they are, as Dominic argued, merely superior beings. That is to say, are these non-creator gods nothing more than the technologically advanced humans that the cargo cults centered around? Dominic dismisses them as unworthy of consideration for this debate because of this identity: he may well be right to do so. It may be that the Creator is the only suitably godlike being worth debating.\nEven were that so, however, Day defends the Creator as well. Day dismisses Dominic’s evidence for the (partly) non-causal nature of time as irrelevant. I had much the same criticism in my review of Dominic’s opening argument, and so agree with Day here. However, Day does little more than simply assert this irrelevancy: some more illustration would have helped.\nI do disagree, however, that it is completely irrelevant. It may well be irrelevant to the vast majority of gods, but, the cause and effect and linearity of time does bear on the issue of the creator God, if no other. At least, Dominic argues it does and needs to be addressed. We thus have a set of dueling assertions here, with Dominic asserting relevancy and Day denying it, with little other exploration.\nMoreover, the nature of cause and effect–unlike linearity–strikes me as an intimately important part of the cosmological argument. Witness any of Craig’s presentations, which invariably start with something like: “Premise 1: Everything that begins to exist has a cause.” Now if there were a counterexample to this, that would be pertinent. Nonetheless, Dominic does not, psychic porn notwithstanding, present any such counterexample that I can see. Perhaps Day simply disagrees that violations of causality in our universe have any bearing on that initial premise: if so, I’m sympathetic, but not convinced.\nAssertion or no, as I largely agree with Day’s stance, it’s tough to fault it. Moreover, Dominic’s assertion was the counterargument to an argument that Day didn’t actually make–so he’s within his rights to wave it away.\nDay goes on to dispute Dominic’s argument about the infinite regress present in the Creator’s first thought. He echoes some of my criticisms and adds more besides, and I think largely carries the day here. I’ll move on in the interests of avoiding pleonasm.\nDay goes on to critique Dominic’s sole positive argument for atheism, his “truth is stranger than fiction” argument. Day and I agree here that the metric is disappointingly subjective. Indeed, I find many of Day’s criticisms here, as well, coincide with mine, so I won’t repeat them at length. I will only sum them up briefly: 1. strangeness is subjective; 2. strangeness functions equally well as an argument against the current scientific, materialist consensus, as it does to the current theological consensus.\nDay points out, rightly:\n“Had I argued that gods exist because their existence is obvious to me, I would have expected his rebuttal to consist of little more than pointing and laughing, because that is all that would have been needed to dismiss such a feeble appeal to personal sensibilities.”\nJust so. It is not per se an invalid step to take something merely as sensually obvious–this is what my belief in the external world ultimately comes down to–but to assert this and merely nothing else would not do much to carry one’s burden of persuasion. Note that Craig in his debates will mention the testimony of the Holy Spirit as evidence for God–rightly–but never rests his entire defense on this one prong, and usually spends most of his time elsewhere; while he believes it to be the strongest argument, he realizes it’s not persuasive to those who don’t already agree.\nIf my review here is rather brief, it’s because by and large I find little to fault Day for here, and for a reason: I had many of the same reactions to Dominic’s arguments. While Dominic’s rebuttal was inventive, Day’s was less so. But I can’t fault Day for this: the reason it was less inventive is because a less inventive response was necessary for Dominic’s opening arguments.\nDay wins the rebuttal.\nUPDATE – In light of the judges awarding the first round to me, I’m going to exercise my option to write the next post, thus giving Dominic the rebuttal.  I will attempt to send my Round 2 post to him by Friday evening.  The word limit for both of us is 3k words.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-13T07:09:00+00:00"
}