{
  "url": "https://voxday.net/2011/09/30/pz-myers-memorial-debate-round-3/",
  "scraped_at": "2025-12-13T23:23:22.154952",
  "title": "PZ Myers Memorial Debate Round 3",
  "date_display": "September 30, 2011",
  "date_iso": "2011-09-30T06:00:00+00:00",
  "date_from_url": "2011-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Round 3 Argument</b><br> Dominic Saltarelli</br></p><p>Thus far, there are three arguments at play, what I have identified as A and B, presented by Vox which are respectively for the existence of gods and for a creator/custodian God, and my own argument that gods are an explanation that fall under the domain of the following hypothesis:</p><p><i>For any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.</i></p><p>Gods being a first attempt at explaining supernatural experiences, thus most likely wrong, and therefore gods do not exist.</p><p>Regarding B3, I previously stated that Vox admittedly defeated his own argument by stating that the moral sense is an integral part of our conciousness and our selves.  In hindsight, I can see how this could lead one to assume I did not understand that Vox was not equivocating the moral sense with the moral impulse, but rather saying that a part of us was picking up signals from an external source.  Similar to saying that the eye is a part of us, but what the eye perceives is not.  However what I did not emphasize well enough the first time was that Vox had also asserted the following (where the third element is considering the morality of an action):</p><p><i>Materialists assume that this third element does not exist and is merely a variable result of combining the first two elements, but their opinion is irrelevant at this point since they are still wrestling with the question of the material existence of consciousness itself. Should they ever manage to sort that out, it will of course have to be taken into account, but until then the science-based materialist consensus is no more significant than the cartoon of the proverbial devil and angel sitting, sight unseen, on one’s shoulders, whispering into one’s ears. Only observations, history, and logic are relevant here.</i></p><p>What is missing here is that not only do materialists not have a complete model of what constitutes conciousness, no one does.  Ignoring this inconvenient fact allows Vox to frame the question of the source of our moral impulse into one of either “Freud’s theory and its variants” representing the possibility that the signal is internally generated or that the signal comes from a source that is genuinely separate from our conciousness.  This is a false dichotomy.  Applying my own hypothesis to groundbreaking theories and ideas in addition to new experiences, Freud’s id, ego, and superego are about as likely a representative of conciousness as the first periodic table of elements (earth, air, water, and fire) was representative of matter.  Rejecting the notion that all things are composed of varying parts of earth, air, water and fire does not mean that the world and everything in it is not made out of elements of some sort, but that is just sort of choice one is left with if Vox’s statements regarding the nature of conciousness and the moral impulse are taken at face value.</p><p>Because Vox has no better idea of what constitutes conciousness than anyone else, admitting that the moral sense is a part of our conciousness immediately puts it on par with any other urge or desire that is already accepted as part of our conciousness due to ignorance of the source of said other urges and desires.  In fact, Vox’s own argument regarding the external nature of the source of the signal could just as justifiably be applied to our sense of heterosexual attraction to the opposite sex (relatively stable continuity across time and space) or any other sensibility that we share in sufficient quantity, but no one is questioning whether that “signal” is internally generated or not.  It is just another desire, a consequence of biology, and accepted as an internally generated part of us.</p><p>So, admitting that our moral sense is another part of our conciousness while having no idea what conciousness is composed of amounts to admitting B3 is false.  The moral impulse that informs it need not be any more external in source than any other desire or motivation that leads to action or state of mind.</p><p>Regarding B4, I don’t see how there is any more to add, since any objections to the argument can only be an objection to the definition of evil so far agreed upon.</p><p>Regarding A3, however, one of Vox’s statements concerning the suggestive weight of evidence was:</p><p><i>All we know now is that there is a long and consistent record of evidence of something with superscientific abilities imposing itself on people throughout history, a record that not only preceded the era of modern science, but continues right through it to the present day.</i></p><p>What I have been trying to establish thus far and will elaborate further upon here is that even this statement is presumptuous.  The reasons people have been witnessing gods could be that gods are real, or that they are really technologically advanced aliens, or that they are some special sort of plasma/energy based lifeform that evolved alongside humanity, future humans with time travel technology, or sufficiently common environmental factors that cause some to experience waking dreams with common attributes but differeing details.  Without further context, each of these are equally plausible explanations, especially in light of the fact Vox admitted the first 3 could very well be one and the same based on our inability to differentiate between each, stating:</p><p><i>This does not mean that gods exist.  This does not mean that aliens exist.  This does not mean that aliens broadly defined as gods exist.  This merely means that the weight of the historical evidence strongly indicates that aliens and/or gods exist, that the lack of scientific evidence for either gods or aliens is almost completely irrelevant concerning the fact of their existence, and that it is at least conceivable that supertechnological aliens, transdimensional beings, and supernatural gods are actually one and the same thing.</i></p><p>Which is precisely half of my point, and has been from the beginning.  That what we think or later interpret to be gods could very well be something else, something that isn’t a god.  The other half of my point being that the evidence aside from the testimonies themselves strongly suggests that we have in fact gotten it wrong, and that the experiences which result in testimony for the existence of gods is in reality attributable to something other than gods.</p><p>An analogy used by religious apologists in arguing against strict scientific materialism that I have seen used often enough in the past is an analogy comparing people to fish.  If you have a lake full of fish, those fish only know breathing water, other fish, and whatever else is in the lake with them, as the lake is their universe.  The argument made by apologists being that the fish are in no way justified in denying the existence of a fisherman due to their complete inability to even comprehend what a fisherman is or interact with him, since he’s never jumped into the lake with them, only cast baited hooks, nets, and disturbed the surface of the water with his toes.  The fish only have supernatural events of baited hooks appearing from heaven and mind boggling appendages briefly churning the sky then disappearing.  Similarly with people, we have supernatural experiences of our own that cannot be explained by what’s here in the lake with us.  This is where I part with the apologists.</p><p>The chances that the fish would be able to correctly understand that the source of the supernatural events is actually a fisherman, or something even remotely like a fisherman are non-existant.  What I have sought to prove through the introduction of one piece of evidence after another:</p><p>1) transition from newtonian to quantum physics<br> 2) transition from geocentrism to heliocentrism<br> 3) phlogiston<br> 4) luminiferous aether<br> 5) Dark Matter (a prediction)<br> 6) a challenge to anyone to get a small child who hasn’t yet been taught how reproduction works to explain how babies are made</br></br></br></br></br></p><p>…Is that we really are just like the fish of the analogy, and when we try to explain something using less than all of the necessary details, we get it wrong.  We are consistently and reliably wrong.</p><p>Now, I am talking about <b>the very concept of gods</b>, I cannot stress this enough.  The gods of our mythology, the imagined gods people actually believe in, the idea we have in our heads when the term “gods” is used in a sentence when talking about these actual gods, rather than using the term as a synonym for “exceptional”, that is the topic of this debate.  The concept of gods are what we first postulated to explain the inexplicable.  Consequently, the concept itself, is wrong.  Reality is something else entirely. (disclaimer: this is not a statement of hard fact but a statement of belief based on the weight of evidence)</p><p>Lastly, here I must address the rebuttals to this argument.  No much else to say on the matter other than to scour history books and populate an absurdly long list of theories and explanations that ended up being wrong.  The only criteria for inclusion being whether they fall under the domain of the hypothesis presented in round 2.</p><p>First, <i>“just because it’s the first explanation, that in no way establishes for a fact that said first explanation is wrong, in fact nothing really stops us from getting it right the first time.”</i><br> I never said it was an established fact.  Just that it is most likely the case.  Presenting a hypothetical situation where someone somewhere gets it right the first time is ignorant and cowardly.  The basis for the debate has been which case has a greater weight of evidence supporting it, I have provided a great deal supporting my position, and with a bit of time could produce a great deal more.  Countering evidence with none whatsoever is absurd.</br></p><p>Second, <i>“gods are by definition supernatural and inexplicable, so of course we’ll get the details wrong, but that doesn’t mean they aren’t real.”</i><br> One of the judges, Scott Scheule, in his previous evaluation said “[S]ure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.”  For some reason, Scott was under the impression he was disagreeing with me here, but he made my point quite well.  Yes, there is a Sun out there, but it sure as hell isn’t a guy in a chariot.  It is something else besides a god.</br></p><p>Third, <i>“if it looks like a duck, and it quacks like a duck, then it’s a duck.”</i><br> It also does not fall under the domain of the hypothesis my argument rests on.  If a person has never been to a coffee shop before, but is already familiar with all the factors that together result in a coffee shop (monetary transactions over a counter, the smell of coffee, styrofoam cups, cramped seating arrangments, and annoying people with laptops), it is not a new phenomenon that requires him to extrapolate on what he knows to fill in any details.  All the necessary details are right there for first hand observation.</br></p><p>Lastly, regarding: <i>For any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.</i></p><p>I realize that the hypothesis presented is a very rough draft, and needs a fair amount of revision to more accurately reflect my position.  However I feel I’ve made my case even without it, and should suffice for now.</p><p> <b>Round 3 Rebuttal</b><br> Vox</br></p><p>I begin by noting that I tend to agree with Dominic that in most cases, Man’s first attempt to explain a new phenomenon using the tools for understanding at his disposal does often tend to be wrong.  Dominic’s use of the word “invariably” can be excused as rhetoric and I will not offer pedantic objection to it.  The principle Dominic is articulating is not only sensible, it is entirely in line with my own observation that appeals to the science-based materialist consensus are intrinsically limited by the present state of technology, and it is largely supported by history in general and the history of science in particular.</p><p>That being said, it does not apply to the question of the existence of gods.  Dominic has committed a category error in attempting to appeal to this principle of Initial Error.</p><p>While the principle of Initial Error could theoretically be applied to the historical appeal to gods to explain natural phenomena, (although I note Dominic did not actually provide any support for his assertion that gods are a first attempt at understanding anything, natural or supernatural), it cannot reasonably be applied to what he characterizes as “a first attempt at explaining supernatural experiences”.</p><p>First, it is a matter of easily establishable fact that the concept of gods are not an attempt at explaining most supernatural experiences, either initial or subsequent.  Astrology, ESP, clairvoyance, telekinesis, telepathy, ghosts, reincarnation, necroparlance and demon-possession have nothing to do with the existence or nonexistence of gods.  Gods may be one of many aspects of the supernatural, but they are largely unrelated to any means of explaining the majority of supernatural experiences.  The connection is tangential; for example, one European survey reported that 60 percent of those who do not believe in gods nevertheless believe in the existence of the supernatural.  More importantly, gods could not have originally been conceived as an explanation for supernatural experiences because the concept of gods long predates Man’s distinction between the natural and the supernatural.  Dominic’s assumption that gods are an attempt at explaining supernatural experiences is incorrect and therefore his conclusion based on that assumption is also incorrect.</p><p>Based on the sheer number of creator gods identified throughout the course of human history, it is much more reasonable to conclude that the primary reason the god concept exists is to explain the phenomenon and purpose of material existence.  And throughout the 50,000 years of modern Man’s existence, divine creation still remains the first and foremost hypothesis explaining it, with one brief and partial exception during the 17 years in which Fred Hoyle’s Steady State theory was formulated, embraced, and rejected by the cosmological community.  Even so noteworthy an atheist as Richard Dawkins, after arguing that “the most ingenious and powerful crane so far discovered is Darwinian evolution by natural selection” freely admits that “We don’t yet have an equivalent crane for physics.”  Nor do we have one for the readily observable existence of life.</p><p>While Ockham’s Razor is a heuristic, not a proof, it is at least as reliable as Dominic’s principle of First Error.  And since Ockham’s Razor recommends the selection of the hypothesis that makes the fewest new assumptions, it dictates the selection of the only serious and lasting hypothesis that Man has ever produced in preference to the others.  This conclusion is bolstered by the fact that the only two concepts that could loosely be considered as competing hypotheses at this point in time, the multiverse concept and Nick Bostrom’s simulation hypothesis, are functionally identical to the creator god hypothesis.  As I have previously pointed out, from Man’s perspective there is no meaningful distinction between a) a conventional creator god, b) a technologically advanced creator being from another dimension, and c) a programmer of Man’s virtual world.</p><p>In conclusion, I note the irony of Dominic’s appeal to the historical record in an attack on a significant aspect of it.  This alone should be sufficient to invalidate the aspects of his argument that depend upon the Initial Error hypothesis.</p><p>In his attack on B3, the assertion that the moral sense is informed by a source external to the conscious mind, Dominic commits a logical error when he concludes that Man’s present failure to understand consciousness necessarily places the moral sense on par with our other urges and desires.  There is simply no basis for this leap of logic.  He also fails to understand that in referring to the moral sense as a third aspect of consciousness I was not limiting its existence to the human consciousness.  This should have been obvious since I made an explicit distinction between the internal and external models.  So, not only did I not defeat my own argument, but the assertion that I did makes it clear that Dominic did not understand it.  While the moral sense is integrated into human consciousness and at least partially accessible to it, my entire argument is based upon the observable fact that it is often opposed to human desires and therefore cannot be dismissed as just another competing one.</p><p>It is true that no one has a complete model of what constitutes consciousness.  I did not, as Dominic asserts, ignore “this inconvenient fact”, since I stated that examining the nature of consciousness is presently “beyond the current ability of the science-based materialist consensus”.  And while it would be a false dichotomy to note that <i>either</i> Freud’s theory represents the possibility that the signal is internally generated <i>or</i> the moral impulse must come from a source that is genuinely separate from our conciousness, I never proposed any such dichotomy.  I cited Freud’s theory in order to show a) even materialists recognize the third observable aspect of consciousness, and I cited its legacy of failure to demonstrate b) the materialist internal model cannot be assumed to be correct.  In support of the likelihood that the external generation for the impulse was more likely than the internal, I also cited the external model’s greater success in modifying human behavior, the divergence between the rates of moral evolution when viewed from societal and historical perspectives, and the observed spatio-temporal range of the relatively static moral impulse.</p><p>After doing some research, I realized that my case may actually be stronger than originally presented because I was thinking of the moral sense as being wholly accessible to the human consciousness, but this is not the case.  As it happens, Dominic contradicted both the current scientific consensus as well as his own statement that no one has “a complete model of what constitutes conciousness” when he declares the moral impulse “is just another desire, a consequence of biology, and accepted as an internally generated part of us.”  If this were true, Freud and his successors would not have had to construct their tripartite model in the first place and various moral researchers such as Lewis Petroninovich, John Mikhail, and Marc Hauser would not concur that “much of our knowledge of morality is… based on <i>unconscious</i> and <i>inaccessible</i> principles for guiding judgments of permissibility”.  Emphasis mine.  Were the moral sense nothing more than one of many biologically driven desires as accessible to the human consciousness as any other, there would be no need for wide-ranging efforts across several scientific and philosophic fields to explain the experiential and observable divergences from the simple two-level materialist model.</p><p>The scientifically established fact that parts of our moral sense are not even accessible by our conscious mind is further support for the external model, even if it falls well short of providing proof of it.  Few researchers in the area would agree; despite this inaccessibility they simply assume it is an artifact of biological evolution even though their attempts to locate either a moral organ or an area of the brain devoted to moral reasoning have thus far proven fruitless.  But the present consensus shows it cannot be reasonably said that the observation of how our moral sense somehow interacts with our conciousness without knowing precisely what conciousness is composed of or the nature of that interaction is in any way tantamount to an admission that B3 is false.  Dominic’s case against the assertion that the moral sense is informed by a source external to the conscious mind is both logically flawed and incorrect according to the current scientific consensus.</p><p>Moving on to the next issue, Dominic is content to stand pat on his previous assertion that B4 was false because “Man’s moral sense greatly changes on a regular basis, even within the span of a moment.”  However, this too stands contrary to the current science.  In his book <i>Moral Minds</i>, Marc Hauser refers to language in explaining the distinction between Man’s core moral faculty and the various moral grammars that can be observed in societies separated by time and space.  Although we speak a variety of languages that sound very different, the differences are superficial in the sense that they serve the same purpose and depend upon precisely the same linguistic faculty.  The moral changes to which Dominic refers are mere grammatical transformations, and as such, they are not relevant to the core question of the unchanging moral faculty.  B4 states that Man’s moral sense has not greatly changed over time, a statement which clearly refers to the moral <i>faculty</i>, not the various moral grammars, and it does not require that the many billions of expressions of that moral sense over the vast expanse of history have all been identical.</p><p>Hauser summarizes the way in which the moral faculty utilizes the various moral grammars on page 44: “The point here is simple: our moral faculty is equipped with a universal set of rules, with each culture setting up particular exceptions to those rules.”  Later in the book, he also underlines one of my earlier points about the speed of moral evolution when he refers to the famous silver fox breeding experiment of Dmitry Belyaev and notes how the observed speed of intense selection “sets up a significant challenge” to the conventional materialist perspective on the evolution of the human mind.</p><p>Since the conclusions of the various scientific researchers into morality show that Dominic’s statement about the dynamic nature of man’s moral sense was false, this, combined with his previous concession concerning the existence of objective evil, is sufficient to support the conclusion that since Man’s moral sense has not greatly changed over time, the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.</p><p>Dominic spends the greater portion of his argument in what superficially appears to be an attempt to regain lost ground previously conceded in the initial round by an appeal to his principle of Initial Error.  But this is not actually the case, as his return to A3 and my “weight of evidence” argument demonstrates that there is actually a surprising amount of common ground in our opposing positions concerning the existence of gods.  The difference is that Dominic fails to understand that the theistic concept of gods, and even the Christian concept of God, is much broader than he imagines.  The Christian cannot reasonably insist that he knows much about the specific nature and character of God in light of how the Apostle Paul, who actually claimed to have encountered the risen Lord Jesus Christ on the road to Damascus, subsequently wrote in 1st Corinthians, “For now we see through a glass, darkly.”</p><p>This is very much in keeping with the earlier words of the Psalmist, who wrote: “Great is the Lord and most worthy of praise; his greatness no one can fathom.”  And in the book of Job, Elihu outright states that God is “beyond our understanding”.   The same holds equally true of the many pagan gods, about whom Man possesses even less information.</p><p>Thus when Dominic writes “That what we think or later interpret to be gods could very well be something else, something that isn’t a god,” he is not so much arguing for the nonexistence of gods as he is revealing a failure to understand what a god is and why any being would be considered worthy of worship.  I will not belabor the dictionary definition by quoting it again, but instead note that a god is primarily worshipped for one of three reasons.  First, because the god merits worship due to being the lord and maker of the worshipper, second, for the material benefits that the god can grant to the worshipper, and third, because the exceptional power of the god is feared.</p><p>Now, even if the supernatural is eventually discovered to be synonymous with the natural, (as in the case of aliens from this universe), the transdimensional, (as in the case of aliens from a different universe), or the real (as in the case of a programmer responsible for creating our virtual universe), such beings are not only potentially worthy of being acclaimed as genuine gods, but in the case of the latter, are potentially worthy of being recognized as the Creator God.  It is the definitive elements of godhood that are the significant aspect of the existential argument here, not the assumed supernatural element, much less the peripheral paranormal phenomena that the supernatural is said to involve, since our understanding of the supernatural is a limited and dynamic one involving “that which is presently believed to be beyond natural limits”.  Gods are not synonymous with the supernatural and I note that even definitive evidence that the supernatural exists, such as reliably replicable scientific experiments supporting the existence of telepathy, for example, would not suffice to prove the existence of gods.</p><p>This also addresses the second half of Dominic’s point, which is that “the experiences which result in testimony for the existence of gods is in reality attributable to something other than gods.”  But theists readily admit our understanding of the nature of the divine is far from perfect.  And not only is that understanding imperfect, it is quite reasonably capable of encompassing a significant portion of the alternatives Dominic has posited.  Not all natural aliens could be gods, but natural aliens that created the human race would at the very least bear a strong claim to legitimate status as creator gods.  Not all transdimensional aliens need be gods, but extradimensional aliens that created our universe would doubtless merit the title.  And, of course, a computer programmer who created the simulated universe in which we are the player-characters would, by definition, be our Creator God, although in that case his world would be the natural and ours would not be the natural, but rather the virtual.</p><p>The difficulty, and what in some cases may be the impossibility, of distinguishing between gods, natural aliens, transdimensional aliens, and computer programmers isn’t a valid argument against the existence of gods.  It is merely an object lesson in the importance of not leaping to conclusions or placing inordinate confidence in a tool that is inadequate for the task at hand.</p><p>A significant aspect of my argument that I believe both Dominic and the judges have thus far failed to recognize is that I have not only, as Scott mentioned in his comments on the first round, rescued testimonial evidence, but have also unseated the current science-based material consensus from its presumed position of authority with regards to its capacity for determining the validity of testimonial evidence.  Dominic is correct to say that Man is consistently and reliably wrong with regards to his various explanations for various phenomena, but he is incorrect to say this in defense of strict scientific materialism for the obvious reason that science itself is subject to precisely the same problem!</p><p>Dominic is somewhat unfortunate in this regard because his argument might have superficially appeared more convincing as recently as two weeks ago, before the physicists at CERN announced the overturning of what scientists had long assumed was one of the fundamental laws of the universe, the cosmic constant. Whether repetitions of the neutrino experiment confirm that the speed of light can be exceeded or not, the unexpected announcement that the speed of light limit has been broken underlines the fact that a dynamic, technology-based temporal snapshot simply cannot serve as a reliable arbiter of what is possible and what is not possible, or even what exists and does not exist.   Science, and the  materialist consensus based upon it, are clearly incapable of providing a valid means of assessing historical evidence in general and the testimonial evidence for the existence of gods in particular.</p><p>The concept of gods are not what Man first postulated to explain the inexplicable, but rather to explain the <i>observable</i>.  The concept is not wrong, it is rational, it is necessary, and it remains entirely viable in light of the reality in which we perceive ourselves to exist.  Since there is no reason beyond personal incredulity and the present absence of scientific evidence to deny the existence of gods, the significant body of historical evidence is more than sufficient to support the conclusion that gods exist.</p><p> <a href=\"http://www.milobookclub.com/2011/09/12/pz-myers-memorial-debate-round-1-ds/\">Round 1: Dominic</a><br> <a href=\"http://www.milobookclub.com/2011/09/12/pz-myers-memorial-debate-round-1-vd/\">Round 1: Vox</a></br></p><p><a href=\"http://www.milobookclub.com/2011/09/19/pz-myers-memorial-debate-round-2/\">Round 2</a></p></div>",
  "content_text": "Round 3 Argument\nDominic Saltarelli\nThus far, there are three arguments at play, what I have identified as A and B, presented by Vox which are respectively for the existence of gods and for a creator/custodian God, and my own argument that gods are an explanation that fall under the domain of the following hypothesis:\nFor any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.\nGods being a first attempt at explaining supernatural experiences, thus most likely wrong, and therefore gods do not exist.\nRegarding B3, I previously stated that Vox admittedly defeated his own argument by stating that the moral sense is an integral part of our conciousness and our selves.  In hindsight, I can see how this could lead one to assume I did not understand that Vox was not equivocating the moral sense with the moral impulse, but rather saying that a part of us was picking up signals from an external source.  Similar to saying that the eye is a part of us, but what the eye perceives is not.  However what I did not emphasize well enough the first time was that Vox had also asserted the following (where the third element is considering the morality of an action):\nMaterialists assume that this third element does not exist and is merely a variable result of combining the first two elements, but their opinion is irrelevant at this point since they are still wrestling with the question of the material existence of consciousness itself. Should they ever manage to sort that out, it will of course have to be taken into account, but until then the science-based materialist consensus is no more significant than the cartoon of the proverbial devil and angel sitting, sight unseen, on one’s shoulders, whispering into one’s ears. Only observations, history, and logic are relevant here.\nWhat is missing here is that not only do materialists not have a complete model of what constitutes conciousness, no one does.  Ignoring this inconvenient fact allows Vox to frame the question of the source of our moral impulse into one of either “Freud’s theory and its variants” representing the possibility that the signal is internally generated or that the signal comes from a source that is genuinely separate from our conciousness.  This is a false dichotomy.  Applying my own hypothesis to groundbreaking theories and ideas in addition to new experiences, Freud’s id, ego, and superego are about as likely a representative of conciousness as the first periodic table of elements (earth, air, water, and fire) was representative of matter.  Rejecting the notion that all things are composed of varying parts of earth, air, water and fire does not mean that the world and everything in it is not made out of elements of some sort, but that is just sort of choice one is left with if Vox’s statements regarding the nature of conciousness and the moral impulse are taken at face value.\nBecause Vox has no better idea of what constitutes conciousness than anyone else, admitting that the moral sense is a part of our conciousness immediately puts it on par with any other urge or desire that is already accepted as part of our conciousness due to ignorance of the source of said other urges and desires.  In fact, Vox’s own argument regarding the external nature of the source of the signal could just as justifiably be applied to our sense of heterosexual attraction to the opposite sex (relatively stable continuity across time and space) or any other sensibility that we share in sufficient quantity, but no one is questioning whether that “signal” is internally generated or not.  It is just another desire, a consequence of biology, and accepted as an internally generated part of us.\nSo, admitting that our moral sense is another part of our conciousness while having no idea what conciousness is composed of amounts to admitting B3 is false.  The moral impulse that informs it need not be any more external in source than any other desire or motivation that leads to action or state of mind.\nRegarding B4, I don’t see how there is any more to add, since any objections to the argument can only be an objection to the definition of evil so far agreed upon.\nRegarding A3, however, one of Vox’s statements concerning the suggestive weight of evidence was:\nAll we know now is that there is a long and consistent record of evidence of something with superscientific abilities imposing itself on people throughout history, a record that not only preceded the era of modern science, but continues right through it to the present day.\nWhat I have been trying to establish thus far and will elaborate further upon here is that even this statement is presumptuous.  The reasons people have been witnessing gods could be that gods are real, or that they are really technologically advanced aliens, or that they are some special sort of plasma/energy based lifeform that evolved alongside humanity, future humans with time travel technology, or sufficiently common environmental factors that cause some to experience waking dreams with common attributes but differeing details.  Without further context, each of these are equally plausible explanations, especially in light of the fact Vox admitted the first 3 could very well be one and the same based on our inability to differentiate between each, stating:\nThis does not mean that gods exist.  This does not mean that aliens exist.  This does not mean that aliens broadly defined as gods exist.  This merely means that the weight of the historical evidence strongly indicates that aliens and/or gods exist, that the lack of scientific evidence for either gods or aliens is almost completely irrelevant concerning the fact of their existence, and that it is at least conceivable that supertechnological aliens, transdimensional beings, and supernatural gods are actually one and the same thing.\nWhich is precisely half of my point, and has been from the beginning.  That what we think or later interpret to be gods could very well be something else, something that isn’t a god.  The other half of my point being that the evidence aside from the testimonies themselves strongly suggests that we have in fact gotten it wrong, and that the experiences which result in testimony for the existence of gods is in reality attributable to something other than gods.\nAn analogy used by religious apologists in arguing against strict scientific materialism that I have seen used often enough in the past is an analogy comparing people to fish.  If you have a lake full of fish, those fish only know breathing water, other fish, and whatever else is in the lake with them, as the lake is their universe.  The argument made by apologists being that the fish are in no way justified in denying the existence of a fisherman due to their complete inability to even comprehend what a fisherman is or interact with him, since he’s never jumped into the lake with them, only cast baited hooks, nets, and disturbed the surface of the water with his toes.  The fish only have supernatural events of baited hooks appearing from heaven and mind boggling appendages briefly churning the sky then disappearing.  Similarly with people, we have supernatural experiences of our own that cannot be explained by what’s here in the lake with us.  This is where I part with the apologists.\nThe chances that the fish would be able to correctly understand that the source of the supernatural events is actually a fisherman, or something even remotely like a fisherman are non-existant.  What I have sought to prove through the introduction of one piece of evidence after another:\n1) transition from newtonian to quantum physics\n2) transition from geocentrism to heliocentrism\n3) phlogiston\n4) luminiferous aether\n5) Dark Matter (a prediction)\n6) a challenge to anyone to get a small child who hasn’t yet been taught how reproduction works to explain how babies are made\n…Is that we really are just like the fish of the analogy, and when we try to explain something using less than all of the necessary details, we get it wrong.  We are consistently and reliably wrong.\nNow, I am talking about\nthe very concept of gods\n, I cannot stress this enough.  The gods of our mythology, the imagined gods people actually believe in, the idea we have in our heads when the term “gods” is used in a sentence when talking about these actual gods, rather than using the term as a synonym for “exceptional”, that is the topic of this debate.  The concept of gods are what we first postulated to explain the inexplicable.  Consequently, the concept itself, is wrong.  Reality is something else entirely. (disclaimer: this is not a statement of hard fact but a statement of belief based on the weight of evidence)\nLastly, here I must address the rebuttals to this argument.  No much else to say on the matter other than to scour history books and populate an absurdly long list of theories and explanations that ended up being wrong.  The only criteria for inclusion being whether they fall under the domain of the hypothesis presented in round 2.\nFirst,\n“just because it’s the first explanation, that in no way establishes for a fact that said first explanation is wrong, in fact nothing really stops us from getting it right the first time.”\nI never said it was an established fact.  Just that it is most likely the case.  Presenting a hypothetical situation where someone somewhere gets it right the first time is ignorant and cowardly.  The basis for the debate has been which case has a greater weight of evidence supporting it, I have provided a great deal supporting my position, and with a bit of time could produce a great deal more.  Countering evidence with none whatsoever is absurd.\nSecond,\n“gods are by definition supernatural and inexplicable, so of course we’ll get the details wrong, but that doesn’t mean they aren’t real.”\nOne of the judges, Scott Scheule, in his previous evaluation said “[S]ure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.”  For some reason, Scott was under the impression he was disagreeing with me here, but he made my point quite well.  Yes, there is a Sun out there, but it sure as hell isn’t a guy in a chariot.  It is something else besides a god.\nThird,\n“if it looks like a duck, and it quacks like a duck, then it’s a duck.”\nIt also does not fall under the domain of the hypothesis my argument rests on.  If a person has never been to a coffee shop before, but is already familiar with all the factors that together result in a coffee shop (monetary transactions over a counter, the smell of coffee, styrofoam cups, cramped seating arrangments, and annoying people with laptops), it is not a new phenomenon that requires him to extrapolate on what he knows to fill in any details.  All the necessary details are right there for first hand observation.\nLastly, regarding:\nFor any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.\nI realize that the hypothesis presented is a very rough draft, and needs a fair amount of revision to more accurately reflect my position.  However I feel I’ve made my case even without it, and should suffice for now.\nRound 3 Rebuttal\nVox\nI begin by noting that I tend to agree with Dominic that in most cases, Man’s first attempt to explain a new phenomenon using the tools for understanding at his disposal does often tend to be wrong.  Dominic’s use of the word “invariably” can be excused as rhetoric and I will not offer pedantic objection to it.  The principle Dominic is articulating is not only sensible, it is entirely in line with my own observation that appeals to the science-based materialist consensus are intrinsically limited by the present state of technology, and it is largely supported by history in general and the history of science in particular.\nThat being said, it does not apply to the question of the existence of gods.  Dominic has committed a category error in attempting to appeal to this principle of Initial Error.\nWhile the principle of Initial Error could theoretically be applied to the historical appeal to gods to explain natural phenomena, (although I note Dominic did not actually provide any support for his assertion that gods are a first attempt at understanding anything, natural or supernatural), it cannot reasonably be applied to what he characterizes as “a first attempt at explaining supernatural experiences”.\nFirst, it is a matter of easily establishable fact that the concept of gods are not an attempt at explaining most supernatural experiences, either initial or subsequent.  Astrology, ESP, clairvoyance, telekinesis, telepathy, ghosts, reincarnation, necroparlance and demon-possession have nothing to do with the existence or nonexistence of gods.  Gods may be one of many aspects of the supernatural, but they are largely unrelated to any means of explaining the majority of supernatural experiences.  The connection is tangential; for example, one European survey reported that 60 percent of those who do not believe in gods nevertheless believe in the existence of the supernatural.  More importantly, gods could not have originally been conceived as an explanation for supernatural experiences because the concept of gods long predates Man’s distinction between the natural and the supernatural.  Dominic’s assumption that gods are an attempt at explaining supernatural experiences is incorrect and therefore his conclusion based on that assumption is also incorrect.\nBased on the sheer number of creator gods identified throughout the course of human history, it is much more reasonable to conclude that the primary reason the god concept exists is to explain the phenomenon and purpose of material existence.  And throughout the 50,000 years of modern Man’s existence, divine creation still remains the first and foremost hypothesis explaining it, with one brief and partial exception during the 17 years in which Fred Hoyle’s Steady State theory was formulated, embraced, and rejected by the cosmological community.  Even so noteworthy an atheist as Richard Dawkins, after arguing that “the most ingenious and powerful crane so far discovered is Darwinian evolution by natural selection” freely admits that “We don’t yet have an equivalent crane for physics.”  Nor do we have one for the readily observable existence of life.\nWhile Ockham’s Razor is a heuristic, not a proof, it is at least as reliable as Dominic’s principle of First Error.  And since Ockham’s Razor recommends the selection of the hypothesis that makes the fewest new assumptions, it dictates the selection of the only serious and lasting hypothesis that Man has ever produced in preference to the others.  This conclusion is bolstered by the fact that the only two concepts that could loosely be considered as competing hypotheses at this point in time, the multiverse concept and Nick Bostrom’s simulation hypothesis, are functionally identical to the creator god hypothesis.  As I have previously pointed out, from Man’s perspective there is no meaningful distinction between a) a conventional creator god, b) a technologically advanced creator being from another dimension, and c) a programmer of Man’s virtual world.\nIn conclusion, I note the irony of Dominic’s appeal to the historical record in an attack on a significant aspect of it.  This alone should be sufficient to invalidate the aspects of his argument that depend upon the Initial Error hypothesis.\nIn his attack on B3, the assertion that the moral sense is informed by a source external to the conscious mind, Dominic commits a logical error when he concludes that Man’s present failure to understand consciousness necessarily places the moral sense on par with our other urges and desires.  There is simply no basis for this leap of logic.  He also fails to understand that in referring to the moral sense as a third aspect of consciousness I was not limiting its existence to the human consciousness.  This should have been obvious since I made an explicit distinction between the internal and external models.  So, not only did I not defeat my own argument, but the assertion that I did makes it clear that Dominic did not understand it.  While the moral sense is integrated into human consciousness and at least partially accessible to it, my entire argument is based upon the observable fact that it is often opposed to human desires and therefore cannot be dismissed as just another competing one.\nIt is true that no one has a complete model of what constitutes consciousness.  I did not, as Dominic asserts, ignore “this inconvenient fact”, since I stated that examining the nature of consciousness is presently “beyond the current ability of the science-based materialist consensus”.  And while it would be a false dichotomy to note that\neither\nFreud’s theory represents the possibility that the signal is internally generated\nor\nthe moral impulse must come from a source that is genuinely separate from our conciousness, I never proposed any such dichotomy.  I cited Freud’s theory in order to show a) even materialists recognize the third observable aspect of consciousness, and I cited its legacy of failure to demonstrate b) the materialist internal model cannot be assumed to be correct.  In support of the likelihood that the external generation for the impulse was more likely than the internal, I also cited the external model’s greater success in modifying human behavior, the divergence between the rates of moral evolution when viewed from societal and historical perspectives, and the observed spatio-temporal range of the relatively static moral impulse.\nAfter doing some research, I realized that my case may actually be stronger than originally presented because I was thinking of the moral sense as being wholly accessible to the human consciousness, but this is not the case.  As it happens, Dominic contradicted both the current scientific consensus as well as his own statement that no one has “a complete model of what constitutes conciousness” when he declares the moral impulse “is just another desire, a consequence of biology, and accepted as an internally generated part of us.”  If this were true, Freud and his successors would not have had to construct their tripartite model in the first place and various moral researchers such as Lewis Petroninovich, John Mikhail, and Marc Hauser would not concur that “much of our knowledge of morality is… based on\nunconscious\nand\ninaccessible\nprinciples for guiding judgments of permissibility”.  Emphasis mine.  Were the moral sense nothing more than one of many biologically driven desires as accessible to the human consciousness as any other, there would be no need for wide-ranging efforts across several scientific and philosophic fields to explain the experiential and observable divergences from the simple two-level materialist model.\nThe scientifically established fact that parts of our moral sense are not even accessible by our conscious mind is further support for the external model, even if it falls well short of providing proof of it.  Few researchers in the area would agree; despite this inaccessibility they simply assume it is an artifact of biological evolution even though their attempts to locate either a moral organ or an area of the brain devoted to moral reasoning have thus far proven fruitless.  But the present consensus shows it cannot be reasonably said that the observation of how our moral sense somehow interacts with our conciousness without knowing precisely what conciousness is composed of or the nature of that interaction is in any way tantamount to an admission that B3 is false.  Dominic’s case against the assertion that the moral sense is informed by a source external to the conscious mind is both logically flawed and incorrect according to the current scientific consensus.\nMoving on to the next issue, Dominic is content to stand pat on his previous assertion that B4 was false because “Man’s moral sense greatly changes on a regular basis, even within the span of a moment.”  However, this too stands contrary to the current science.  In his book\nMoral Minds\n, Marc Hauser refers to language in explaining the distinction between Man’s core moral faculty and the various moral grammars that can be observed in societies separated by time and space.  Although we speak a variety of languages that sound very different, the differences are superficial in the sense that they serve the same purpose and depend upon precisely the same linguistic faculty.  The moral changes to which Dominic refers are mere grammatical transformations, and as such, they are not relevant to the core question of the unchanging moral faculty.  B4 states that Man’s moral sense has not greatly changed over time, a statement which clearly refers to the moral\nfaculty\n, not the various moral grammars, and it does not require that the many billions of expressions of that moral sense over the vast expanse of history have all been identical.\nHauser summarizes the way in which the moral faculty utilizes the various moral grammars on page 44: “The point here is simple: our moral faculty is equipped with a universal set of rules, with each culture setting up particular exceptions to those rules.”  Later in the book, he also underlines one of my earlier points about the speed of moral evolution when he refers to the famous silver fox breeding experiment of Dmitry Belyaev and notes how the observed speed of intense selection “sets up a significant challenge” to the conventional materialist perspective on the evolution of the human mind.\nSince the conclusions of the various scientific researchers into morality show that Dominic’s statement about the dynamic nature of man’s moral sense was false, this, combined with his previous concession concerning the existence of objective evil, is sufficient to support the conclusion that since Man’s moral sense has not greatly changed over time, the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.\nDominic spends the greater portion of his argument in what superficially appears to be an attempt to regain lost ground previously conceded in the initial round by an appeal to his principle of Initial Error.  But this is not actually the case, as his return to A3 and my “weight of evidence” argument demonstrates that there is actually a surprising amount of common ground in our opposing positions concerning the existence of gods.  The difference is that Dominic fails to understand that the theistic concept of gods, and even the Christian concept of God, is much broader than he imagines.  The Christian cannot reasonably insist that he knows much about the specific nature and character of God in light of how the Apostle Paul, who actually claimed to have encountered the risen Lord Jesus Christ on the road to Damascus, subsequently wrote in 1st Corinthians, “For now we see through a glass, darkly.”\nThis is very much in keeping with the earlier words of the Psalmist, who wrote: “Great is the Lord and most worthy of praise; his greatness no one can fathom.”  And in the book of Job, Elihu outright states that God is “beyond our understanding”.   The same holds equally true of the many pagan gods, about whom Man possesses even less information.\nThus when Dominic writes “That what we think or later interpret to be gods could very well be something else, something that isn’t a god,” he is not so much arguing for the nonexistence of gods as he is revealing a failure to understand what a god is and why any being would be considered worthy of worship.  I will not belabor the dictionary definition by quoting it again, but instead note that a god is primarily worshipped for one of three reasons.  First, because the god merits worship due to being the lord and maker of the worshipper, second, for the material benefits that the god can grant to the worshipper, and third, because the exceptional power of the god is feared.\nNow, even if the supernatural is eventually discovered to be synonymous with the natural, (as in the case of aliens from this universe), the transdimensional, (as in the case of aliens from a different universe), or the real (as in the case of a programmer responsible for creating our virtual universe), such beings are not only potentially worthy of being acclaimed as genuine gods, but in the case of the latter, are potentially worthy of being recognized as the Creator God.  It is the definitive elements of godhood that are the significant aspect of the existential argument here, not the assumed supernatural element, much less the peripheral paranormal phenomena that the supernatural is said to involve, since our understanding of the supernatural is a limited and dynamic one involving “that which is presently believed to be beyond natural limits”.  Gods are not synonymous with the supernatural and I note that even definitive evidence that the supernatural exists, such as reliably replicable scientific experiments supporting the existence of telepathy, for example, would not suffice to prove the existence of gods.\nThis also addresses the second half of Dominic’s point, which is that “the experiences which result in testimony for the existence of gods is in reality attributable to something other than gods.”  But theists readily admit our understanding of the nature of the divine is far from perfect.  And not only is that understanding imperfect, it is quite reasonably capable of encompassing a significant portion of the alternatives Dominic has posited.  Not all natural aliens could be gods, but natural aliens that created the human race would at the very least bear a strong claim to legitimate status as creator gods.  Not all transdimensional aliens need be gods, but extradimensional aliens that created our universe would doubtless merit the title.  And, of course, a computer programmer who created the simulated universe in which we are the player-characters would, by definition, be our Creator God, although in that case his world would be the natural and ours would not be the natural, but rather the virtual.\nThe difficulty, and what in some cases may be the impossibility, of distinguishing between gods, natural aliens, transdimensional aliens, and computer programmers isn’t a valid argument against the existence of gods.  It is merely an object lesson in the importance of not leaping to conclusions or placing inordinate confidence in a tool that is inadequate for the task at hand.\nA significant aspect of my argument that I believe both Dominic and the judges have thus far failed to recognize is that I have not only, as Scott mentioned in his comments on the first round, rescued testimonial evidence, but have also unseated the current science-based material consensus from its presumed position of authority with regards to its capacity for determining the validity of testimonial evidence.  Dominic is correct to say that Man is consistently and reliably wrong with regards to his various explanations for various phenomena, but he is incorrect to say this in defense of strict scientific materialism for the obvious reason that science itself is subject to precisely the same problem!\nDominic is somewhat unfortunate in this regard because his argument might have superficially appeared more convincing as recently as two weeks ago, before the physicists at CERN announced the overturning of what scientists had long assumed was one of the fundamental laws of the universe, the cosmic constant. Whether repetitions of the neutrino experiment confirm that the speed of light can be exceeded or not, the unexpected announcement that the speed of light limit has been broken underlines the fact that a dynamic, technology-based temporal snapshot simply cannot serve as a reliable arbiter of what is possible and what is not possible, or even what exists and does not exist.   Science, and the  materialist consensus based upon it, are clearly incapable of providing a valid means of assessing historical evidence in general and the testimonial evidence for the existence of gods in particular.\nThe concept of gods are not what Man first postulated to explain the inexplicable, but rather to explain the\nobservable\n.  The concept is not wrong, it is rational, it is necessary, and it remains entirely viable in light of the reality in which we perceive ourselves to exist.  Since there is no reason beyond personal incredulity and the present absence of scientific evidence to deny the existence of gods, the significant body of historical evidence is more than sufficient to support the conclusion that gods exist.\nRound 1: Dominic\nRound 1: Vox\nRound 2",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-30T05:00:00+00:00"
}