{
  "url": "https://voxday.net/2011/09/19/pz-myers-memorial-debate-round-2/",
  "scraped_at": "2025-12-13T23:22:11.780058",
  "title": "PZ Myers Memorial Debate Round 2",
  "date_display": "September 19, 2011",
  "date_iso": "2011-09-19T05:00:00+00:00",
  "date_from_url": "2011-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ON THE EXISTENCE OF GODS</b><br> Vox Day</br></p><p>As there has been some confusion of the debate concerning the existence of gods rather than being limited to the existence of the Christian God, I will point out that the focus on the existence of small-g gods, plural, has always been the case.  In his initial post on Pharyngula that inspired my original debate challenge three years ago, PZ Myers demanded to see “some intelligent arguments for gods”.  He wrote: <i>”Somebody somewhere is going to have to someday point me to some intelligent arguments for gods, because I’ve sure never found them.”</i> My challenge to him reflected that, as I wrote: <i>“It is my contention that there is not only substantial evidence for the existence of gods, but that the logic for the existence of gods is superior to the logic for the nonexistence of them as presented by yourself, Richard Dawkins, Sam Harris, and Daniel Dennett, to name a few.”</i> Any objections to the original subject of the debate turning out to be the subject of debate are not only spurious, but entirely nonsensical.</p><p>Furthermore, if we accept the commonly cited argument for atheism articulated by Stephen F. Roberts as valid, when we understand why Dominic dismisses all the other possible gods, we will understand why he dismisses the Christian God.  The atheist position that Dominic is championing is not defined as disbelief in the existence of the Christian God, but as disbelief in the existence of all gods.  To his credit, Dominic understands and accepts this, and everyone would do well to follow his example.</p><p>In the first round, Dominic correctly conceded two significant points.  They are as follows:</p><p>1.  There is something, possibly of a distinctly external nature, is imposing itself on people throughout history</p><p>2.  Objective evil, as defined as a self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, is quite real.</p><p>Although Dominic has not taken issue with it, others have complained that the Oxford English Dictionary’s definition of gods is excessively broad.  This is not the case.  Most dictionaries similarly distinguish between God and gods, sometimes more specifically than Oxford, and many even define the concept more broadly.  For example, Merriam-Webster defines “god” thusly:</p><p>1.  capitalized : the supreme or ultimate reality: the Being perfect in power, wisdom, and goodness who is worshipped as creator and ruler of the universe<br> 2 : a being or object believed to have more than natural attributes and powers and to require human worship<br> 3 : a person or thing of supreme value<br> 4 : a powerful ruler</br></br></br></p><p>The second Merriam-Webster definition is helpful because its use of the term “believed” points to the important aspect of the potential confusion between technologically advanced space aliens and gods.  While one could get technical and assert that a mistaken belief in the divinity of a technologically advanced individual is sufficient to prove the existence of gods as per the dictionary definitions, this is not an argument I am making.  Dominic is correct to suggest proving other people exist is not the purpose of this discussion. Nor is it to prove that technologically advanced aliens may be god-like or that Hu Jintao is a god.  My purpose in citing a correct dictionary definition of gods and the potential confusion of aliens for them is merely to show that the intrinsic difficulty in distinguishing between a genuine supernatural deity and a technologically advanced natural entity renders reliance upon the science-based materialist consensus an inherently invalid metric.</p><p>The known possibility of confusion does not mean that perception counts as actual objective existence, it means that the perception of gods and/or aliens, and more importantly, <i>the means of perceiving them</i>, are unreliable and therefore cannot be appealed to as if they are conclusive, or even meaningful in this specific regard.  The failure of science to detect supernatural gods is no more significant than its failure to detect natural aliens, and combined with the potential for confusing the two, this means science is an intrinsically unreliable means of determining what historical evidence for the existence of gods and/or aliens is valid and what is not.  Therefore, the science-based materialist consensus is incapable of judging the mass of available historical evidence for gods.</p><p>In support of this conclusion, I note that in the previous round, I showed that the failure of modern science to detect gods during only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist.  But this analogy actually tends to understate the actual situation because a) not all individuals living in the era of modern science are scientists and b) not all scientists operate in fields that potentially concern the detection of gods.</p><p>According to the American Association for the Advancement of Science, there are 5.8 million science and engineering researchers in the world, which means there are approximately three million scientists out of the 6.85 billion people on the planet assuming a relatively equal division between scientists and engineers.  Even if we generously assume that this ratio of 1/2283 of the population can be applied to the entire era of modern science from 1600 AD to 2011 AD, this means that a more precise analogy requires concluding that because 6,570 of the estimated 15 million Aztecs did not see any white men during 201 days between 1427 and 1519,  Cortés and the conquistadors did not exist.  In light of this statistical reality, it is worth recalling that despite eyewitness testimony and historical evidence dating back to The Apadana of Xerxes in 424 BC, modern science did not credit the existence of the okapi for 299 years, the first three-quarters of the modern scientific era, despite the fact that an estimated 15,000 okapis still live in the wild today.  And given how we are informed that 90% of the matter in the universe still remains undetected, it should not be a mystery that no scientists have managed to find any gods in the 10% of the universal matter they have so far managed to locate.</p><p>Furthermore, it is incorrect to say that as our ability to measure reality and record history has improved, our evidence for the supernatural has begun to wane.  And here I will turn to Dominic’s excellent point about the way in which the general shift in the nature of reports of the scientifically inexplicable have increasingly tended to reflect the aliens of science fiction rather than the gods of history.  Since I have already demonstrated that science cannot distinguish between the former and the latter, one cannot reasonably say that our evidence for the supernatural has begun to wane; if anything it has increased in recent decades because the testimonial evidence for the supertechnological is indistinguishable from the testimonial evidence for the supernatural.  At this point, we have no idea if ancient evidence for gods is more indicative of technologically advanced aliens than current evidence for technologically advanced aliens is indicative of ancient gods.  All we know now is that there is a long and consistent record of evidence of something with superscientific abilities imposing itself on people throughout history, a record that not only preceded the era of modern science, but continues right through it to the present day.</p><p>This does not mean that gods exist.  This does not mean that aliens exist.  This does not mean that aliens broadly defined as gods exist.  This merely means that the weight of the historical evidence strongly indicates that aliens and/or gods exist, that the lack of scientific evidence for either gods or aliens is almost completely irrelevant concerning the fact of their existence, and that it is at least conceivable that supertechnological aliens, transdimensional beings, and supernatural gods are actually one and the same thing.</p><p>However, it should be noted that even iron-clad scientific proof of the existence of gods would not be sufficient to prove the existence of a creator god, still less the existence of a Creator God, and less yet the existence of the Christian Creator God who has provided Creation with moral laws as well as physical laws.  The destruction of the materialist case for nonexistence is not tantamount to proving the case for existence and there is no way to make the logical leap from the evidential support for the existence of gods and/or aliens to the Ten Commandments and Jesus Christ dying on the Cross for the sins of Man.  A very different case is required.</p><p>Since Dominic has already acknowledged the existence of evil as defined above, I shall endeavor to explain why the analogy of light and shadow is correct and how the existence of evil suffices to prove the existence of a creator god worthy of the more significant term God.  I acknowledge that this argument will hold no water for those who reject the existence of evil or consider all events to be nothing more than meaningless and dynamic arrangements of atoms over time.  However, I have observed over the years that the vast majority of those who claim not to believe in evil nevertheless speak, write, and act in a manner that completely contradicts their asserted non-belief, therefore the axiom will be legitimate for most.</p><p>The first assent having been granted, the two steps in the logic that still need to be demonstrated here are a) that the existence of evil requires the presence of a source of good, and, b) that the only entity capable of dictating an objective and definitive good is the Creator or His agent.  Due to the word limit, I shall concentrate my efforts on the demonstrating why the existence of evil requires the presence of a definitive Good, and how that strongly implies existence of a Creator.</p><p>To determine if the existence of evil requires the presence of a source of good, we must first consider what the existence of evil requires.  At a bare minimum, it is apparent that evil requires an actor, an action/event, and a sensate victim.  One does not consider a hurricane to be evil although it is an event and there are victims because there is no actor.  One does not consider a man telling lies to the mirror to be evil because no one is deceived; there is no victim.  And one does not consider a man smashing a stone into pieces to be evil because although there is an actor, an action, and a victim, the victim is not sensate.</p><p>However, of the seven deadly sins, wrath, greed, sloth, pride, lust, envy, and gluttony, only gluttony even requires an action for its commission.  The others are states of consciousness that may or may not lead to action.  Now, obviously to insist that the seven capital vices of Christianity are evil would be special pleading, but I cite them only to highlight the way in which an evil state of consciousness usually precedes the evil act regardless of what the evil act may be.  So, we must conclude that evil requires either an actor, an action, and a sensate victim or an actor and a state of consciousness in which committing an action is desired.  Such states of consciousness are not crimes, of course, since the law requires action, and usually, material injury before it is concerned.  And yet, those who admit to the existence of evil uniformly consider these intentional states of consciousness to be evil even when the actor remains completely inactive.  It is not merely the pedophile’s actions which are evil, but also his state of consciousness previous to any subsequent evil actions.</p><p>So, evil is fundamentally a matter of consciousness, which at this point in time places it beyond the current ability of the science-based materialist consensus to examine.  But those who have experienced such states of consciousness already know that the materialist explanation for cause-and-effect are insufficient, even before taking Dominic’s suggestion of occasional exceptions to it into account.  Consider the differences between a plant which lacks the capacity to consider consequences or a moral sense, an animal which lacks a moral sense and a Man who possesses both the capacity to consider consequences as well as a moral sense.</p><p>Plant:  Do what thou wilt shall be the whole of the law.<br> Animal: Do what thou wilt, with due regard for the policemen around the corner.<br> Man: Do what is right.</br></br></p><p>Man’s consciousness observably has at least three aspects, as unlike animals, which operate according to a simple utilitarian dualism, Man has an additional sense which acts as an internal brake upon his desires in addition to the external brake imposed by other parties.  It is this sense which caused Freud to develop his theory of ego, id, and superego, and it is possession of this sense which explains why we hold men responsible for actions that animals are permitted.  When Man contemplates an action, he is capable of taking at least three elements into account.</p><p>1.His desires.<br> 2.The potential consequences<br> 3.The morality of his action</br></br></p><p>The sense that is required for the third step is what I referred to in the previous round as the antenna that is indicative of the existence of some form of transmission.  It is usually referred to as conscience, or in religious terms, the “still small voice”, and it is something that is simultaneously internal to the consciousness and outside the desires and the awareness of consequences.  It is most noticeable when it is in opposition to the alignment of the two other aspects of the state of consciousness.  Materialists assume that this third element does not exist and is merely a variable result of combining the first two elements, but their opinion is irrelevant at this point since they are still wrestling with the question of the material existence of consciousness itself.  Should they ever manage to sort that out, it will of course have to be taken into account, but until then the science-based materialist consensus is no more significant than the cartoon of the proverbial devil and angel sitting, sight unseen, on one’s shoulders, whispering into one’s ears.  Only observations, history, and logic are relevant here.</p><p>Given our observation that this sense exists and that it picks up signals that may or may not be produced internally and which are known to frequently contradict the two other elements, we must decide if it is more likely that the signal is internally or externally generated.  Freud’s theory and its variants is the most established of the various internal models, but nearly 100 years of the consistent failure of psychoanalysis and its theory of the unconscious mind suggest that external generation is more likely, especially when one considers the external model’s relative success in comparison with the internal model when everything from suicide rates to life expectancy are compared.  Moreover, neither the materialist perspective nor the internal model can account for the difference between the rapid rate of claimed moral evolution observed in the United States with regards to homosexuality and the very small variations in moral sensibilities observed across societies separated by geography as well as the full extent of the historical record.</p><p>If we accept that the signal is externally generated, the next question is the extent of the signal.  Due to the relatively small range of variations in moral sensibilities, we can see that this signal has a vast scope in terms of time as well as space.  The transmitter, then, must be able to transcend the material to at least the same extent that human consciousness does, it must be capable of reaching the utmost expanses of humanity both geographically and temporally, and it must be relatively stable.  And it because it is departures from the signal that result in states of consciousness that we have shown to be evil, it is obvious that such states can only exist insofar as the signal also exists.  In the absence of the signal, which is the objective and definitive Good, or if one prefers, the Moral Law, neither the state of consciousness nor the actions of the actor can rise above the animal level, and therefore cannot be considered evil.  The Law can only be broken if the Law exists.  Evil can only exist in the presence of the Good.</p><p>Now, the signal need not be a signal per se.  It could also be a pre-programmed implant, in which case we would speak of the implanter rather than the transmitter.  But regardless, the almost uniformly observed existence of Man’s moral sense throughout history proves that so long as we accept that (1) evil exists, (2) potential differences between one’s consequentially safe desires and one’s moral sense can be observed, (3) the moral sense is informed by a source external to the conscious mind, and (4) Man’s moral sense has not greatly changed over time, then the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.</p><p>And because this definitive moral law is constant and arbitrary, there must be a lawgiver capable of both defining and transmitting it.  It should be readily apparent that the term more customarily used for the lawgiver is God, who as the Creator of the universe has both the authority and the ability to define the arbitrary constants of the moral law in the same way He has defined the constants of the physical ones.</p><p> <b>REBUTTAL</b><br> Dominic Saltarelli</br></p><p>First off, I would like to thank Vox for letting me off the hook for having to wrack my brain to come up with a sufficiently entertaining argument to prove a negative.  It was my mistake to overlook the topic of the debate being towards “gods” rather than the preconcieved yet popular notion of “God”.  So any references to a creator God, the cosmological argument, and out-of-context quoting of Aristotle pointing out how the teaching method of a competing school is poor because it suffers from infinite regress by trying to rely on demonstration alone, are all being dropped as not germane to the topic at hand (though may be relied upon for satire at a later time).</p><p>In summary, Vox’s argument thus far is twofold, the first providing the foundation for the second.</p><p>(A) There is (1) a mountain of testimonial evidence of interaction with gods, (2) testimonial evidence is generally reliable, thus (3) it is ahistorical and denialist to dismiss all such testimonial evidence, and therefore the evidence suggests gods are real.</p><p>(B) (1) Evil exists, (2) potential differences between one’s consequentially safe desires and one’s moral sense can be observed, (3) the moral sense is informed by a source external to the conscious mind, and (4) Man’s moral sense has not greatly changed over time, then the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.</p><p>The conclusion of (B), that this law means a lawgiver who meets the definition of God, is an element, or at least subset of the set of likely “gods” established by (A).</p><p>Both arguments require all of A1, A2, A3, B1, B2, B3, and B4 to each be true statements for the evidence to support the logic that gods are more likely than not.  Establishing that, contrary to the arguments presented, there is evidence showing A3, B3, and B4 are each false statements will invalidate the conclusions drawn by both (A) and (B).</p><p>Further, because this is the point of the debate, “not A3” being the true statement supports the separate line of argument I presented originally that there is valid logic and evidence for the non-existence of gods, which I will seek to clarify herein, and by clarify I mean dumb down my original argument enough so that people aren’t laboring under the impression I was actually arguing for the existence of aliens rather than calling me out for making the argument from incredulity (which it primarily was, with the exception that I gave actual reasons to be incredulous).</p><p><u>A3 – “it is ahistorical and denialist to dismiss all such testimonial evidence”</u></p><p>The true statement would be that it is ahistorical to dismiss all testimonial evidence out of hand.  Vox provides several good examples of why this statement is true (the existence of okapis and the empire of Assyria to name a few).  However, testimony of personal contact with gods is a class of testimony, clearly defined by being an experience of the apparently supernatural, out of the ordinary, and demanding of an explanation.  This is precisely why I introduced the relatively recent phenomenon of alien abductions.  It is a class of testimony that is equivalent to and practically indistinguishable from testimony of interactions with gods, as opposed to testimony of interactions with the mundane.  By presenting evidence that we have every reason to dismiss testimonial evidence of alien abductions due to the fact that pre-existing cultural influence both preceedes and largely defines what is later reported by alien abductees, and the same can thus be said of angelic visitations, demonic possession, and ornery leprechauns.</p><p>A3 is false.</p><p>The only argument Vox has presented that A3 is true are increasingly elaborate ways of saying “absence of evidence is not evidence of absence”.  I completely agree that this is true.  However Vox’s responses thus far regarding A3 have been against an imaginary materialist-concensus opponent who dogmatically insists that gods aren’t real because he hasn’t personally poked one with a stick.  My argument, from the very beginning, has been that testimonial evidence for gods <b>in particular</b> is easily dismissed for the exact same reason that testimony for alien abductions can be dismissed.  That it would have been silly for a hypothetical group of Aztecs to deny the existence of hostile Spainards before ever meeting a white man is intentional obfuscation, because Vox’s own argument is entirely dependent on the idea that the gods have in fact been met.</p><p>The response to my objection is not to hem and haw and say, “well, we don’t know everything you see, so, it… uh, could be.”  We may not know much of anything, but we do know each other pretty well.  If we didn’t, Vox’s entire argument regarding the existence of evil would be impossible to make.</p><p>The only response that actually addresses my argument would be to show me someone who is possessed by a demon that spits on both the cross and the name of Christ who has never heard of Christianity or been exposed to anything christian.  Show me someone recounting an experience of being sexually molested by little grey aliens with big heads and huge hypnotic eyes who’d never heard of or been exposed to Hollywood films or other popular culture sources that tell us what aliens do and what they look like.  There has been no such showing yet.</p><p>That we don’t know everything is irrelevant.  That aliens who may exist that may yet further be mistaken for gods is irrelevant.  We have established thus far that “not A3” is a true statement, given my evidence that this is such and Vox’s complete lack of any rebuttal.  Because A3 is false, the conclusion drawn from (A) is also false.</p><p><u>B3 – “the moral sense is informed by a source external to the conscious mind”</u></p><p>Vox’s argument here involves correlating the moral impulse, the objective Good, with a signal that imposes itself on our conscious decision making process, with the significance of the analogy being that the signal is external and universal, crossing time and space to affect everyone.  Vox dashes his own argument to pieces by stating:</p><p>“…it is something that is simultaneously internal to the consciousness and outside the desires and the awareness of consequences.”</p><p>and</p><p>“It could also be a pre-programmed implant, in which case we would speak of the implanter rather than the transmitter.”</p><p>Ok, so after all that about it being a still quiet voice most likely external in nature, it could equally just as well be an integral part of us that is just another influence on our decision making process.  Why Vox would invalidate his own argument so completely is a mystery, but of no conern to me.  This admission by Vox that the moral impulse is internal to the conciousness (and no weasling out by saying I don’t understand the part about it being identified most easily through opposition to other <i>parts</i> of the conciousness, [notice how I <i>italicized “parts”</i>, that’s the kicker]) and likely a result of our physical structure is simply admitting B3 is not true.  Our morality is just as much a part of us as any other part of our conciousness that influences decision making.</p><p>B3 is false.</p><p><u>B4 – “Man’s moral sense has not greatly changed over time”</u></p><p>Vox himself admits there has been a “rapid rate of claimed moral evolution observed in the United States with regards to homosexuality”.  I could leave it at that.  Since this is what I was expecting from the very beginning, though, I will go ahead with what I had at the ready.  Man’s moral sense greatly changes on a regular basis, even within the span of a moment.  In fact, man’s moral sense completely reverses itself and actively pushes us towards evil so often we have a word for it.  This single word invalidates B4, and demonstates that “not B4” is the true statement.</p><p>Vengeance.</p><p>Retribution and revenge can be considered as evil in a great many situations.  But just as often we call it justice.  Objective evil has been defined, it is:</p><p>“A self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, requiring either an actor, an action, and a sensate victim or an actor and a state of consciousness in which committing an action is desired.”</p><p>A man who gets his hands on the boy who raped his daughter meets every single clause of the definition presented above.  Yet both the man and what happens next is not evil, it is justice.  Depending on who you ask, of course.  Evil is suddenly not evil when the victim deserves it, this is what our moral sense tells us, yet meeting out justice and punishment satisfies every single criterion for objectively identifying evil presented.</p><p>Trying to argue at this point that our sense of justice is itself a consistent a part of the moral sense by pointing to the grand scheme of history and how it’s a component that has always been a part of our cultures is to avoid the issue at hand.  The argument is that there is an objective and consistent Good that we can sense with the morality identifying part of our conciousness, and exceptions or violations to this universal Good are how we recognize evil.  But I have shown that the moral sense <b>itself</b> completely reverses course and calls evil, the Good, on a regular basis.  Time to put <i>Mere Christianity</i> down, C.S. Lewis can’t help you now.</p><p>B4 is false.</p><p>Having shown that Vox’s argument for the existence of gods is false, it is apparently still incumbent on me to make a positive case for the non-existence of gods, again.</p><p>The theme of my presenation was titled “truth is stranger than fiction”, for which I did what I could to divorce any personal feelings on the matter from the attempt to establish the pattern, and only afterwards finally admitting that I’ve noticed the pattern myself and found it persuasive.  The hypothesis which I sought to prove being that for any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt (and sometimes 2nd, 3rd, 4th, etc…) at explanation is almost invariably wrong.  Test it if you like.  Find a young child, turn the tables, and be the person to ask them how babies are made.</p><p>The examples I provided showed this pattern through history.  When physicists were first exploring the atomic and subatomic, they went in with the expectation that little particles couldn’t be all that different from big ones, with experimental results very quickly overturning that assumption.  Similarly with the first impression regarding what revolved around what in the solar system.  Another example would be the phlogiston theory of fire, because that extra weight had to go somewhere.  Then there was ‘luminiferous aether’ to fill up the universe with something that could carry these pesky light “waves”.</p><p>It’s not terribly relevant to the debate, but consider the case when applying this hypothesis to a prevailing “first explanation for a great mystery” that has not yet been officially scrapped.  Take Dark Matter, the idea that the universe is mainly composed of just more matter that it so happens we can’t see or detect any direct way, but it’s got to be there, because <i>nothing</i> else could account for these gravitational anomolies.  I expect it to be consigned to the dustbin of history along with the tachyon soon enough.  Those most likely to do it being a vocal fringe group of plasma cosmologists challenging this first attempt at an explanation.</p><p>So, to make myself absolutely crystal clear on the matter, the hypothesis is:<br> <i>For any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.</i></br></p><p>I thought I was being clear before when I came out and explicitly said “great mystery” rather than rely on context alone to convey that the explanations that fall under the domain of this hypothesis were those that <b>required</b> imagination to fill in the missing details.</p><p>The response received so far to this argument has been a dismissive wave of “obvious to Dominic does not make it true”.  The counter examples being perfectly mundane references to Starbucks and Internet porn.  No imagination is necessary to postulate the existence of either, and the retort so far has been remarkably asinine.  There is no need to rely on extrapolation to paint a complete picture when acertaining either Starbucks or Jenna Jameson is real.</p><p>Given that I have supported the hypothesis with historical evidence, and that there has been no attempt at all in refuting it, the evidence suggests that the hypothesis is true.  Applying it to the concept of “gods”, we see that for man’s experiences of what he has deemed supernatural throughout history, “gods” was the first explanation.  This first explanation is an extrapolation using the tools for understanding at man’s disposal at the time to explain a new phenomenon, and is consequently most likely the incorrect explanation.  Gods are not real because the true reason for the eyewitness testimony that they are based on is something else entirely.</p><p>Let me also make it clear here and now that whatever that something else would happen to be, I neither know nor care, nor is it required to be singular in nature or anymore conscious than gravity.  The only case I’m making is in regards to the one thing it isn’t.  Further, attempting to claim that this argument does not disprove any and all potential gods rather than those identified thus far is outside of the scope of this debate.</p><p> <a href=\"http://www.milobookclub.com/2011/09/12/pz-myers-memorial-debate-round-1-ds/\">Round 1: Dominic</a><br> <a href=\"http://www.milobookclub.com/2011/09/12/pz-myers-memorial-debate-round-1-vd/\">Round 1: Vox</a></br></p></div>",
  "content_text": "ON THE EXISTENCE OF GODS\nVox Day\nAs there has been some confusion of the debate concerning the existence of gods rather than being limited to the existence of the Christian God, I will point out that the focus on the existence of small-g gods, plural, has always been the case.  In his initial post on Pharyngula that inspired my original debate challenge three years ago, PZ Myers demanded to see “some intelligent arguments for gods”.  He wrote:\n”Somebody somewhere is going to have to someday point me to some intelligent arguments for gods, because I’ve sure never found them.”\nMy challenge to him reflected that, as I wrote:\n“It is my contention that there is not only substantial evidence for the existence of gods, but that the logic for the existence of gods is superior to the logic for the nonexistence of them as presented by yourself, Richard Dawkins, Sam Harris, and Daniel Dennett, to name a few.”\nAny objections to the original subject of the debate turning out to be the subject of debate are not only spurious, but entirely nonsensical.\nFurthermore, if we accept the commonly cited argument for atheism articulated by Stephen F. Roberts as valid, when we understand why Dominic dismisses all the other possible gods, we will understand why he dismisses the Christian God.  The atheist position that Dominic is championing is not defined as disbelief in the existence of the Christian God, but as disbelief in the existence of all gods.  To his credit, Dominic understands and accepts this, and everyone would do well to follow his example.\nIn the first round, Dominic correctly conceded two significant points.  They are as follows:\n1.  There is something, possibly of a distinctly external nature, is imposing itself on people throughout history\n2.  Objective evil, as defined as a self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, is quite real.\nAlthough Dominic has not taken issue with it, others have complained that the Oxford English Dictionary’s definition of gods is excessively broad.  This is not the case.  Most dictionaries similarly distinguish between God and gods, sometimes more specifically than Oxford, and many even define the concept more broadly.  For example, Merriam-Webster defines “god” thusly:\n1.  capitalized : the supreme or ultimate reality: the Being perfect in power, wisdom, and goodness who is worshipped as creator and ruler of the universe\n2 : a being or object believed to have more than natural attributes and powers and to require human worship\n3 : a person or thing of supreme value\n4 : a powerful ruler\nThe second Merriam-Webster definition is helpful because its use of the term “believed” points to the important aspect of the potential confusion between technologically advanced space aliens and gods.  While one could get technical and assert that a mistaken belief in the divinity of a technologically advanced individual is sufficient to prove the existence of gods as per the dictionary definitions, this is not an argument I am making.  Dominic is correct to suggest proving other people exist is not the purpose of this discussion. Nor is it to prove that technologically advanced aliens may be god-like or that Hu Jintao is a god.  My purpose in citing a correct dictionary definition of gods and the potential confusion of aliens for them is merely to show that the intrinsic difficulty in distinguishing between a genuine supernatural deity and a technologically advanced natural entity renders reliance upon the science-based materialist consensus an inherently invalid metric.\nThe known possibility of confusion does not mean that perception counts as actual objective existence, it means that the perception of gods and/or aliens, and more importantly,\nthe means of perceiving them\n, are unreliable and therefore cannot be appealed to as if they are conclusive, or even meaningful in this specific regard.  The failure of science to detect supernatural gods is no more significant than its failure to detect natural aliens, and combined with the potential for confusing the two, this means science is an intrinsically unreliable means of determining what historical evidence for the existence of gods and/or aliens is valid and what is not.  Therefore, the science-based materialist consensus is incapable of judging the mass of available historical evidence for gods.\nIn support of this conclusion, I note that in the previous round, I showed that the failure of modern science to detect gods during only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist.  But this analogy actually tends to understate the actual situation because a) not all individuals living in the era of modern science are scientists and b) not all scientists operate in fields that potentially concern the detection of gods.\nAccording to the American Association for the Advancement of Science, there are 5.8 million science and engineering researchers in the world, which means there are approximately three million scientists out of the 6.85 billion people on the planet assuming a relatively equal division between scientists and engineers.  Even if we generously assume that this ratio of 1/2283 of the population can be applied to the entire era of modern science from 1600 AD to 2011 AD, this means that a more precise analogy requires concluding that because 6,570 of the estimated 15 million Aztecs did not see any white men during 201 days between 1427 and 1519,  Cortés and the conquistadors did not exist.  In light of this statistical reality, it is worth recalling that despite eyewitness testimony and historical evidence dating back to The Apadana of Xerxes in 424 BC, modern science did not credit the existence of the okapi for 299 years, the first three-quarters of the modern scientific era, despite the fact that an estimated 15,000 okapis still live in the wild today.  And given how we are informed that 90% of the matter in the universe still remains undetected, it should not be a mystery that no scientists have managed to find any gods in the 10% of the universal matter they have so far managed to locate.\nFurthermore, it is incorrect to say that as our ability to measure reality and record history has improved, our evidence for the supernatural has begun to wane.  And here I will turn to Dominic’s excellent point about the way in which the general shift in the nature of reports of the scientifically inexplicable have increasingly tended to reflect the aliens of science fiction rather than the gods of history.  Since I have already demonstrated that science cannot distinguish between the former and the latter, one cannot reasonably say that our evidence for the supernatural has begun to wane; if anything it has increased in recent decades because the testimonial evidence for the supertechnological is indistinguishable from the testimonial evidence for the supernatural.  At this point, we have no idea if ancient evidence for gods is more indicative of technologically advanced aliens than current evidence for technologically advanced aliens is indicative of ancient gods.  All we know now is that there is a long and consistent record of evidence of something with superscientific abilities imposing itself on people throughout history, a record that not only preceded the era of modern science, but continues right through it to the present day.\nThis does not mean that gods exist.  This does not mean that aliens exist.  This does not mean that aliens broadly defined as gods exist.  This merely means that the weight of the historical evidence strongly indicates that aliens and/or gods exist, that the lack of scientific evidence for either gods or aliens is almost completely irrelevant concerning the fact of their existence, and that it is at least conceivable that supertechnological aliens, transdimensional beings, and supernatural gods are actually one and the same thing.\nHowever, it should be noted that even iron-clad scientific proof of the existence of gods would not be sufficient to prove the existence of a creator god, still less the existence of a Creator God, and less yet the existence of the Christian Creator God who has provided Creation with moral laws as well as physical laws.  The destruction of the materialist case for nonexistence is not tantamount to proving the case for existence and there is no way to make the logical leap from the evidential support for the existence of gods and/or aliens to the Ten Commandments and Jesus Christ dying on the Cross for the sins of Man.  A very different case is required.\nSince Dominic has already acknowledged the existence of evil as defined above, I shall endeavor to explain why the analogy of light and shadow is correct and how the existence of evil suffices to prove the existence of a creator god worthy of the more significant term God.  I acknowledge that this argument will hold no water for those who reject the existence of evil or consider all events to be nothing more than meaningless and dynamic arrangements of atoms over time.  However, I have observed over the years that the vast majority of those who claim not to believe in evil nevertheless speak, write, and act in a manner that completely contradicts their asserted non-belief, therefore the axiom will be legitimate for most.\nThe first assent having been granted, the two steps in the logic that still need to be demonstrated here are a) that the existence of evil requires the presence of a source of good, and, b) that the only entity capable of dictating an objective and definitive good is the Creator or His agent.  Due to the word limit, I shall concentrate my efforts on the demonstrating why the existence of evil requires the presence of a definitive Good, and how that strongly implies existence of a Creator.\nTo determine if the existence of evil requires the presence of a source of good, we must first consider what the existence of evil requires.  At a bare minimum, it is apparent that evil requires an actor, an action/event, and a sensate victim.  One does not consider a hurricane to be evil although it is an event and there are victims because there is no actor.  One does not consider a man telling lies to the mirror to be evil because no one is deceived; there is no victim.  And one does not consider a man smashing a stone into pieces to be evil because although there is an actor, an action, and a victim, the victim is not sensate.\nHowever, of the seven deadly sins, wrath, greed, sloth, pride, lust, envy, and gluttony, only gluttony even requires an action for its commission.  The others are states of consciousness that may or may not lead to action.  Now, obviously to insist that the seven capital vices of Christianity are evil would be special pleading, but I cite them only to highlight the way in which an evil state of consciousness usually precedes the evil act regardless of what the evil act may be.  So, we must conclude that evil requires either an actor, an action, and a sensate victim or an actor and a state of consciousness in which committing an action is desired.  Such states of consciousness are not crimes, of course, since the law requires action, and usually, material injury before it is concerned.  And yet, those who admit to the existence of evil uniformly consider these intentional states of consciousness to be evil even when the actor remains completely inactive.  It is not merely the pedophile’s actions which are evil, but also his state of consciousness previous to any subsequent evil actions.\nSo, evil is fundamentally a matter of consciousness, which at this point in time places it beyond the current ability of the science-based materialist consensus to examine.  But those who have experienced such states of consciousness already know that the materialist explanation for cause-and-effect are insufficient, even before taking Dominic’s suggestion of occasional exceptions to it into account.  Consider the differences between a plant which lacks the capacity to consider consequences or a moral sense, an animal which lacks a moral sense and a Man who possesses both the capacity to consider consequences as well as a moral sense.\nPlant:  Do what thou wilt shall be the whole of the law.\nAnimal: Do what thou wilt, with due regard for the policemen around the corner.\nMan: Do what is right.\nMan’s consciousness observably has at least three aspects, as unlike animals, which operate according to a simple utilitarian dualism, Man has an additional sense which acts as an internal brake upon his desires in addition to the external brake imposed by other parties.  It is this sense which caused Freud to develop his theory of ego, id, and superego, and it is possession of this sense which explains why we hold men responsible for actions that animals are permitted.  When Man contemplates an action, he is capable of taking at least three elements into account.\n1.His desires.\n2.The potential consequences\n3.The morality of his action\nThe sense that is required for the third step is what I referred to in the previous round as the antenna that is indicative of the existence of some form of transmission.  It is usually referred to as conscience, or in religious terms, the “still small voice”, and it is something that is simultaneously internal to the consciousness and outside the desires and the awareness of consequences.  It is most noticeable when it is in opposition to the alignment of the two other aspects of the state of consciousness.  Materialists assume that this third element does not exist and is merely a variable result of combining the first two elements, but their opinion is irrelevant at this point since they are still wrestling with the question of the material existence of consciousness itself.  Should they ever manage to sort that out, it will of course have to be taken into account, but until then the science-based materialist consensus is no more significant than the cartoon of the proverbial devil and angel sitting, sight unseen, on one’s shoulders, whispering into one’s ears.  Only observations, history, and logic are relevant here.\nGiven our observation that this sense exists and that it picks up signals that may or may not be produced internally and which are known to frequently contradict the two other elements, we must decide if it is more likely that the signal is internally or externally generated.  Freud’s theory and its variants is the most established of the various internal models, but nearly 100 years of the consistent failure of psychoanalysis and its theory of the unconscious mind suggest that external generation is more likely, especially when one considers the external model’s relative success in comparison with the internal model when everything from suicide rates to life expectancy are compared.  Moreover, neither the materialist perspective nor the internal model can account for the difference between the rapid rate of claimed moral evolution observed in the United States with regards to homosexuality and the very small variations in moral sensibilities observed across societies separated by geography as well as the full extent of the historical record.\nIf we accept that the signal is externally generated, the next question is the extent of the signal.  Due to the relatively small range of variations in moral sensibilities, we can see that this signal has a vast scope in terms of time as well as space.  The transmitter, then, must be able to transcend the material to at least the same extent that human consciousness does, it must be capable of reaching the utmost expanses of humanity both geographically and temporally, and it must be relatively stable.  And it because it is departures from the signal that result in states of consciousness that we have shown to be evil, it is obvious that such states can only exist insofar as the signal also exists.  In the absence of the signal, which is the objective and definitive Good, or if one prefers, the Moral Law, neither the state of consciousness nor the actions of the actor can rise above the animal level, and therefore cannot be considered evil.  The Law can only be broken if the Law exists.  Evil can only exist in the presence of the Good.\nNow, the signal need not be a signal per se.  It could also be a pre-programmed implant, in which case we would speak of the implanter rather than the transmitter.  But regardless, the almost uniformly observed existence of Man’s moral sense throughout history proves that so long as we accept that (1) evil exists, (2) potential differences between one’s consequentially safe desires and one’s moral sense can be observed, (3) the moral sense is informed by a source external to the conscious mind, and (4) Man’s moral sense has not greatly changed over time, then the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.\nAnd because this definitive moral law is constant and arbitrary, there must be a lawgiver capable of both defining and transmitting it.  It should be readily apparent that the term more customarily used for the lawgiver is God, who as the Creator of the universe has both the authority and the ability to define the arbitrary constants of the moral law in the same way He has defined the constants of the physical ones.\nREBUTTAL\nDominic Saltarelli\nFirst off, I would like to thank Vox for letting me off the hook for having to wrack my brain to come up with a sufficiently entertaining argument to prove a negative.  It was my mistake to overlook the topic of the debate being towards “gods” rather than the preconcieved yet popular notion of “God”.  So any references to a creator God, the cosmological argument, and out-of-context quoting of Aristotle pointing out how the teaching method of a competing school is poor because it suffers from infinite regress by trying to rely on demonstration alone, are all being dropped as not germane to the topic at hand (though may be relied upon for satire at a later time).\nIn summary, Vox’s argument thus far is twofold, the first providing the foundation for the second.\n(A) There is (1) a mountain of testimonial evidence of interaction with gods, (2) testimonial evidence is generally reliable, thus (3) it is ahistorical and denialist to dismiss all such testimonial evidence, and therefore the evidence suggests gods are real.\n(B) (1) Evil exists, (2) potential differences between one’s consequentially safe desires and one’s moral sense can be observed, (3) the moral sense is informed by a source external to the conscious mind, and (4) Man’s moral sense has not greatly changed over time, then the existence of evil logically indicates the existence of a definitive moral law that is as constant and as arbitrary as most, if not all, of the physical laws of the universe.\nThe conclusion of (B), that this law means a lawgiver who meets the definition of God, is an element, or at least subset of the set of likely “gods” established by (A).\nBoth arguments require all of A1, A2, A3, B1, B2, B3, and B4 to each be true statements for the evidence to support the logic that gods are more likely than not.  Establishing that, contrary to the arguments presented, there is evidence showing A3, B3, and B4 are each false statements will invalidate the conclusions drawn by both (A) and (B).\nFurther, because this is the point of the debate, “not A3” being the true statement supports the separate line of argument I presented originally that there is valid logic and evidence for the non-existence of gods, which I will seek to clarify herein, and by clarify I mean dumb down my original argument enough so that people aren’t laboring under the impression I was actually arguing for the existence of aliens rather than calling me out for making the argument from incredulity (which it primarily was, with the exception that I gave actual reasons to be incredulous).\nA3 – “it is ahistorical and denialist to dismiss all such testimonial evidence”\nThe true statement would be that it is ahistorical to dismiss all testimonial evidence out of hand.  Vox provides several good examples of why this statement is true (the existence of okapis and the empire of Assyria to name a few).  However, testimony of personal contact with gods is a class of testimony, clearly defined by being an experience of the apparently supernatural, out of the ordinary, and demanding of an explanation.  This is precisely why I introduced the relatively recent phenomenon of alien abductions.  It is a class of testimony that is equivalent to and practically indistinguishable from testimony of interactions with gods, as opposed to testimony of interactions with the mundane.  By presenting evidence that we have every reason to dismiss testimonial evidence of alien abductions due to the fact that pre-existing cultural influence both preceedes and largely defines what is later reported by alien abductees, and the same can thus be said of angelic visitations, demonic possession, and ornery leprechauns.\nA3 is false.\nThe only argument Vox has presented that A3 is true are increasingly elaborate ways of saying “absence of evidence is not evidence of absence”.  I completely agree that this is true.  However Vox’s responses thus far regarding A3 have been against an imaginary materialist-concensus opponent who dogmatically insists that gods aren’t real because he hasn’t personally poked one with a stick.  My argument, from the very beginning, has been that testimonial evidence for gods\nin particular\nis easily dismissed for the exact same reason that testimony for alien abductions can be dismissed.  That it would have been silly for a hypothetical group of Aztecs to deny the existence of hostile Spainards before ever meeting a white man is intentional obfuscation, because Vox’s own argument is entirely dependent on the idea that the gods have in fact been met.\nThe response to my objection is not to hem and haw and say, “well, we don’t know everything you see, so, it… uh, could be.”  We may not know much of anything, but we do know each other pretty well.  If we didn’t, Vox’s entire argument regarding the existence of evil would be impossible to make.\nThe only response that actually addresses my argument would be to show me someone who is possessed by a demon that spits on both the cross and the name of Christ who has never heard of Christianity or been exposed to anything christian.  Show me someone recounting an experience of being sexually molested by little grey aliens with big heads and huge hypnotic eyes who’d never heard of or been exposed to Hollywood films or other popular culture sources that tell us what aliens do and what they look like.  There has been no such showing yet.\nThat we don’t know everything is irrelevant.  That aliens who may exist that may yet further be mistaken for gods is irrelevant.  We have established thus far that “not A3” is a true statement, given my evidence that this is such and Vox’s complete lack of any rebuttal.  Because A3 is false, the conclusion drawn from (A) is also false.\nB3 – “the moral sense is informed by a source external to the conscious mind”\nVox’s argument here involves correlating the moral impulse, the objective Good, with a signal that imposes itself on our conscious decision making process, with the significance of the analogy being that the signal is external and universal, crossing time and space to affect everyone.  Vox dashes his own argument to pieces by stating:\n“…it is something that is simultaneously internal to the consciousness and outside the desires and the awareness of consequences.”\nand\n“It could also be a pre-programmed implant, in which case we would speak of the implanter rather than the transmitter.”\nOk, so after all that about it being a still quiet voice most likely external in nature, it could equally just as well be an integral part of us that is just another influence on our decision making process.  Why Vox would invalidate his own argument so completely is a mystery, but of no conern to me.  This admission by Vox that the moral impulse is internal to the conciousness (and no weasling out by saying I don’t understand the part about it being identified most easily through opposition to other\nparts\nof the conciousness, [notice how I\nitalicized “parts”\n, that’s the kicker]) and likely a result of our physical structure is simply admitting B3 is not true.  Our morality is just as much a part of us as any other part of our conciousness that influences decision making.\nB3 is false.\nB4 – “Man’s moral sense has not greatly changed over time”\nVox himself admits there has been a “rapid rate of claimed moral evolution observed in the United States with regards to homosexuality”.  I could leave it at that.  Since this is what I was expecting from the very beginning, though, I will go ahead with what I had at the ready.  Man’s moral sense greatly changes on a regular basis, even within the span of a moment.  In fact, man’s moral sense completely reverses itself and actively pushes us towards evil so often we have a word for it.  This single word invalidates B4, and demonstates that “not B4” is the true statement.\nVengeance.\nRetribution and revenge can be considered as evil in a great many situations.  But just as often we call it justice.  Objective evil has been defined, it is:\n“A self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, requiring either an actor, an action, and a sensate victim or an actor and a state of consciousness in which committing an action is desired.”\nA man who gets his hands on the boy who raped his daughter meets every single clause of the definition presented above.  Yet both the man and what happens next is not evil, it is justice.  Depending on who you ask, of course.  Evil is suddenly not evil when the victim deserves it, this is what our moral sense tells us, yet meeting out justice and punishment satisfies every single criterion for objectively identifying evil presented.\nTrying to argue at this point that our sense of justice is itself a consistent a part of the moral sense by pointing to the grand scheme of history and how it’s a component that has always been a part of our cultures is to avoid the issue at hand.  The argument is that there is an objective and consistent Good that we can sense with the morality identifying part of our conciousness, and exceptions or violations to this universal Good are how we recognize evil.  But I have shown that the moral sense\nitself\ncompletely reverses course and calls evil, the Good, on a regular basis.  Time to put\nMere Christianity\ndown, C.S. Lewis can’t help you now.\nB4 is false.\nHaving shown that Vox’s argument for the existence of gods is false, it is apparently still incumbent on me to make a positive case for the non-existence of gods, again.\nThe theme of my presenation was titled “truth is stranger than fiction”, for which I did what I could to divorce any personal feelings on the matter from the attempt to establish the pattern, and only afterwards finally admitting that I’ve noticed the pattern myself and found it persuasive.  The hypothesis which I sought to prove being that for any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt (and sometimes 2nd, 3rd, 4th, etc…) at explanation is almost invariably wrong.  Test it if you like.  Find a young child, turn the tables, and be the person to ask them how babies are made.\nThe examples I provided showed this pattern through history.  When physicists were first exploring the atomic and subatomic, they went in with the expectation that little particles couldn’t be all that different from big ones, with experimental results very quickly overturning that assumption.  Similarly with the first impression regarding what revolved around what in the solar system.  Another example would be the phlogiston theory of fire, because that extra weight had to go somewhere.  Then there was ‘luminiferous aether’ to fill up the universe with something that could carry these pesky light “waves”.\nIt’s not terribly relevant to the debate, but consider the case when applying this hypothesis to a prevailing “first explanation for a great mystery” that has not yet been officially scrapped.  Take Dark Matter, the idea that the universe is mainly composed of just more matter that it so happens we can’t see or detect any direct way, but it’s got to be there, because\nnothing\nelse could account for these gravitational anomolies.  I expect it to be consigned to the dustbin of history along with the tachyon soon enough.  Those most likely to do it being a vocal fringe group of plasma cosmologists challenging this first attempt at an explanation.\nSo, to make myself absolutely crystal clear on the matter, the hypothesis is:\nFor any new experience or phenomenon, when man attempts to explain the phenomenon using the tools for understanding at his disposal, the first attempt at explanation is almost invariably wrong.\nI thought I was being clear before when I came out and explicitly said “great mystery” rather than rely on context alone to convey that the explanations that fall under the domain of this hypothesis were those that\nrequired\nimagination to fill in the missing details.\nThe response received so far to this argument has been a dismissive wave of “obvious to Dominic does not make it true”.  The counter examples being perfectly mundane references to Starbucks and Internet porn.  No imagination is necessary to postulate the existence of either, and the retort so far has been remarkably asinine.  There is no need to rely on extrapolation to paint a complete picture when acertaining either Starbucks or Jenna Jameson is real.\nGiven that I have supported the hypothesis with historical evidence, and that there has been no attempt at all in refuting it, the evidence suggests that the hypothesis is true.  Applying it to the concept of “gods”, we see that for man’s experiences of what he has deemed supernatural throughout history, “gods” was the first explanation.  This first explanation is an extrapolation using the tools for understanding at man’s disposal at the time to explain a new phenomenon, and is consequently most likely the incorrect explanation.  Gods are not real because the true reason for the eyewitness testimony that they are based on is something else entirely.\nLet me also make it clear here and now that whatever that something else would happen to be, I neither know nor care, nor is it required to be singular in nature or anymore conscious than gravity.  The only case I’m making is in regards to the one thing it isn’t.  Further, attempting to claim that this argument does not disprove any and all potential gods rather than those identified thus far is outside of the scope of this debate.\nRound 1: Dominic\nRound 1: Vox",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-19T04:00:00+00:00"
}