{
  "url": "https://voxday.net/2011/09/12/pz-myers-memorial-debate-round-1-vd/",
  "scraped_at": "2025-12-13T23:21:33.652090",
  "title": "PZ Myers Memorial Debate Round 1 VD",
  "date_display": "September 12, 2011",
  "date_iso": "2011-09-12T14:09:00+00:00",
  "date_from_url": "2011-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ON THE EXISTENCE OF GODS</b></p><p>In order to make the case that the weight of the available evidence and logic is more supportive of the existence of gods than of their nonexistence, it is necessary to define the two terms.  In making my case for the existence of gods, I am relying upon the definitions of “evidence” and “logic” as defined by the Oxford English Dictionary.  I am utilizing the term “evidence” in a sense that encompasses all three of the primary definitions provided.</p><p>Evidence: <br> 1.Available body of facts or information indicating whether a belief or proposition is true or valid.<br> 2.Information drawn from personal testimony, a document, or a material object, used to establish facts in a legal investigation or admissible as testimony in a law court.<br> 3.Signs or indications of something.</br></br></br></p><p>Logic:<br> 1.reasoning conducted or assessed according to strict principles of validity</br></p><p>There is a vast quantity of extant documentary and testimonial evidence providing indications that gods exist.  This evidence dates from the earliest written records to current testimonials from living individuals.  While it is true that the quality of this evidence varies considerably, it cannot simply be dismissed out of hand anymore than one can conclude Gaius Julius Caesar did not exist because one cannot see him on television today.  Each and every case demands its own careful examination before it can be dismissed, and such examination has never been done in the overwhelming majority of cases.</p><p>For example, there are many documented cases of confirmed fraud in published scientific papers.  If we apply the same reasoning to published scientific papers that some wish to apply to documentary evidence of gods, we have no choice but to conclude that all science is fraudulent.  But this is absurd, as we know that at least some science is not fraudulent.  Therefore, if one is willing to accept the validity of published scientific papers that one has not been able to verify are not fraudulent, one must similarly accept the validity of documentary evidence for the existence of gods that one has not examined and determined to merit dismissal for one reason or another.</p><p>Because it is intrinsically testimonial in nature, the documentary evidence for gods has been impugned on the basis of studies concerning the unreliability of eyewitness testimony for various reasons.  However, this critical analogy actually demonstrates the precise opposite of what it purports to show.  Since eyewitness testimony has been variously determined to be somewhere between 12 percent and 50 percent inaccurate, this means that between 50 percent and 88 percent of the testimonial evidence for gods should be assumed accurate, at least concerning the correctly reported details of the divine encounter.  The correct interpretations of the specific details, of course, are a different matter.</p><p>One of the core principles of the historical method is that “the closer a source is to the event which it purports to describe, the more one can trust it to give an accurate historical description of what actually happened.”  Blanket rejection of the entire historical record that does not accord with the present materialist consensus with regards to the universe turns this principle on its head to such an extent that it can only be described as ahistorical.  Moreover, it is downright illogical given the dynamic nature of the materialist consensus, especially when one takes into account how many times the material rejectionist position can be confirmed to have been wrong whereas the historical record was correct.   The cities of Capernaum, Chorazin, Bethsaida, and Nineveh, and the empires of Assyria and the Hittites are but six of many valid examples.</p><p>In fact, the material rejectionist position amounts to nothing more than a time-limited appeal to technology.  At one time, Man could not detect x-rays, radiation, or distant planets because he lacked the necessary technology.  At present, Man cannot detect dark matter, the Higgs boson, other universes, Heaven, Hell, alien life forms, or intelligent supernatural beings.  These things may or may not exist, for example, the scientists at CERN have excluded the possibility of the Higgs boson particle from masses ranging from 145 to 466 GeV.  But science has never managed to exclude the existence of gods from anything, and unless one also rejects the existence of multiple universes and other undetected concepts, one cannot reasonably reject the existence of gods.</p><p>Indeed, the acceptance of the possibility of the existence of the multiversal and the rejection of the possibility of the supernatural makes no sense, given that it is entirely conceivable that the two could be identical.  It would be as difficult for humanity today to distinguish between a technologically advanced being from a different universe and “a superhuman being worshiped as having power over nature or human fortunes”, which is how Oxford defines a god, [as it would for an ancient human to distinguish between a current U.S. Marine with air support and a god.]</p><p>Science itself lends support to the idea of the material existence of gods in this universe when astronomical evidence taken into account.  According to the latest scientific consensuses, the universe is 13.75 billion years old, the Sun is 4.6 billion years old, the Earth is 4.54 billion years old, and homo sapiens sapiens reached behavioral modernity 50,000 years ago.  As there are a conservatively estimated 200 billion stars in the galaxy and 100 billion galaxies in the universe, this indicates that there has been sufficient time for at least 7,891 billion alien races to appear, evolve, and reach a higher level of technological development than Man given the current ratio of 1.18 planets discovered per star.  And to paraphrase Arthur C. Clarke, any sufficiently advanced technology is indistinguishable from godhood.</p><p>One could dismiss the numerical argument as a simple appeal to very large numbers, except for the fact of a written historical record which repeatedly describes contact with superhuman beings possessing power over nature and human fortunes.  When the mathematical odds indicate that advanced technological aliens exist somewhere in the material universe and contact with superhuman beings has been reported on tens of thousands of occasions, the assumption that gods do not exist begins to look more like outright denial than reasonable skepticism.  When seen in this light, the failure of modern science to detect gods in what the scientific consensus presently states is only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist.  No doubt this would have seemed like a perfectly reasonable conclusion, right up until the day Córdoba arrived in the Yucatán.</p><p>So, there is evidence from history, mathematical probability from science, and logic from the combination of the two which support the existence of gods.  However, the most powerful evidence for the existence of not only gods, but the existence of one or more Creator gods, can be materially observed in Man himself.  Just as the existence of various phenomena can be correctly deduced through the observation of senses and sensors designed to interact with those phenomena even if a particular phenomenon remains unobserved, the presence of an invisible sound wave can be deduced by the presence of an antenna and the presence of a lawgiver can be deduced by the presence of prison guards.  Hence the importance of Man’s moral sense.</p><p>While some people throughout history have reported experiencing personal contact with God, most have not.  However, I am not aware of a single individual who has denied ever experiencing any direct contact with evil.  And by evil, I do not mean mere bad fortune, physical pain, or the application of the various principles of physics to suboptimal human action, but rather those self-aware, purposeful, and malicious forces which intend material harm and suffering to others and are capable of inflicting it.  We are aware of this force in ourselves and we can observe it in others.  As anyone who has witnessed a child lie for the first time knows, human evil not an entirely learned behavior, it is at least partially endogenous.</p><p>As a shadow requires the presence of a source of light in order to exist, evil requires the presence of a source of good.  What some call God is perhaps better understood as the source of that good through which evil can exist and be observed, by which I do not mean any subjective and experienced good, but rather the objective and definitive good.  But the only entity capable of dictating an objective and definitive good with universal application is either a) the entity that created the universe, or b) an entity given managing responsibility by the creating entity.  This is not a case of might makes right, but rather, conception and creation necessitating constants.</p><p>Therefore, when we observe and acknowledge material evil, we must correctly conclude the existence of a Creator God.</p><p> <b>TO WHICH DOMINIC REPLIES</b></p><p>The opening argument for the positive existence of gods comes from the mountain of eyewitness accounts of having experienced what they can only describe as supernatural.  Admittedly, no amount of handwaving theorizing that so many people throughout history have been merely dishonest, crazy, delusional, or suffering from temporal lobe epilepsy can stand up against the sheer volume of accounts made, so dismissal simply is not an option.  There is no denying that there is something, possibly of a distinctly external nature, is imposing itself on people throughout history causing them to report visitations from gods, angels, demons.  What was left out are the more recent and very similar accounts of space aliens.</p><p>From space.</p><p>Early accounts of UFOs contain vague references to fires in the sky that are wheel-like or circular.  Examples of this are the flying Vimanas of the Sanskrit epics, Ezekiel’s Wheel (which, from the description, sort of looks more like a V-22 Osprey [landing gear and all] with an extra pair of wings and rockets underneath the tiltrotors, than a flying saucer), the mass sighting at Nuremberg in 1561, and the ‘Miracle of the Sun’ event in Portugal (1917).  Attributing such sightings to actual aliens rather than supernatural manifestations of the classical sense does not occur until after pop culture had introduced alien life into the public imagination.</p><p>Aliens seem to first have been introduced as forms of social commentary coupled with an increasingly materialist worldview, from Voltaire’s ‘Micromegas’ (1752) as a vehicle for warning against anthrocentric hubris and a convenient means to lampoon a few people he didn’t particularly care for, to H.G. Wells ‘War of the Worlds’ (1898) as a criticism of gunboat colonialism.  Aliens as entertainment took as many different forms as the people who subsequently claim to have actually met them.  Detailed descriptions of the aliens themselves, and what subsequently happens to a person after meeting them, were all wildly different, and a more consistent story does not emerge until after science fiction literature and Hollywood have a crack at it, writing the scripts for such experiences before people actually start having them.</p><p>The event that really popularized alien abductions and set the stage for the flood of abduction stories that people have reported since is generally considered to be the Betty and Barney Hill abduction (September 19, 1961), where the couple recounts an alien abduction with many of the details pulled straight from an episode of ‘The Outer Limits’ which aired just 12 days beforehand, and the 1951 film, ‘Invaders from Mars’.  From here, alien encounters have become increasingly normalized with nearly everyone meeting “Grey” aliens with squat bodies, thin limbs, huge heads and giant black unblinking eyes, the sort that we have been exposed to by Hollywood now as the prototypical ‘alien’.  Quite different than the furry vagabonds who harrased Colonel H. G. Shaw in 1897.  And never mind that the case of Antonio Villas Boas did not occur until 9 years after the publication ‘Flash Gordon and the Adventures of the Flying Saucers’.</p><p>The evidence suggests that there is a very strong influence of belief and disposition which not only influences how paranormal events are interpreted, but how they are in fact experienced and remembered.  Looking now at the eyewitness accounts of visitations by gods and angels, and also of demon possession, the first observation to make is that familairity with the context is a mandatory prerequisite for having the experience, just as no one remembered being abducted by a Grey alien with giant unblinking eyes until after Hollywood gave us Grey aliens with giant unblinking eyes.  Again, this isn’t to say that all the experiences are delusional, given the logic that 50 to 88 percent of such accounts can be considered honest accounts by people who are not crazy, simply that the actual explanation, the real source that triggers these experiences, is something quite different, and let’s not forget stranger, than what they appear to be to the eyewitness, given the sheer variety of expereiences and undeniable influence of pre-existing culture and belief.  After all, Barney Hill reported that one of the first things the aliens said to him was to not be afraid.  Something that anyone familiar with eyewitness accounts of angelic visitations should recognize.  However, Barney wasn’t visited by angels bearing halos and white wings, and he did not recognize them as such, he saw space aliens.  This is not an ‘interpretation’ of details, these are entirely different details, one of gods, the other of aliens.</p><p>This brings us to the second point, that of the materialist position rejecting such accounts on the basis of the lack of an objective measuring tool which would verify the validity of the accounts of gods made by the eyewitnesses is ahistorical and the intellectual equivalent of burying one’s head in the sand.  Here, there is no dissagreement.  Rejecting something’s existence based on nothing more than ignorance of similar phenonmenon is an unsustainable position.</p><p>However, included in this point, is the argument that gods are more likely than not given that our gods could very well be aliens.  Ironic, given what all I just wrote, but worthy of being addressed separetely.  Combining the statistical probablity of alien life with the eyewitness accounts of paranormal visitors and the Oxford dictionary’s definition of “god” would lead one to believe that the alien visitation explanation concocted over the past 110 years or so (particularly in the last 50) is the more accurate description of real gods, and our religions (with the exception of the Mormons) are clumsy attempts at describing what we now have better tools for understanding, that we’re being visited by aliens.  Maybe the Mormons are actually right and we should follow Matt Stone and Trey Parker to the promised lands.</p><p>To address this, I would argue in turn this application of the Oxford definition actually makes one group of men gods over others.  For example, John Frum, a recipeint of his own cult, possessed, along with the rest of the American military, the superhuman ability to bestow gifts of divine cargo upon the residents of the island of Tanna.  Squint at bit a the word “superhuman”, or just take it in context of the situation, and the military service men whose actions led to the creation of such cargo cults were, technically, gods.</p><p>Somehow, I doubt that proving other people exist, though, is the purpose of this discussion.  Further, if we’re saying that technologically advanced aliens are as god-like as anything in the universe, we should probably just stop now.</p><p>But then we’d miss out on what I see as the actual argument, and what I predict will be the real thrust from here on out.  The final argument, that a real creator God (big ‘G’) is necessary given the existence real objective evil in the world.</p><p>Objective measurement is one where the point of reference does not move.  Here I believe we can all be in agreement that objective evil, as defined as a self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, is quite real.  It would be an impossible task to actually prove that people have never or do not act with self-ware, purposeful, and malicious intent to cause material harm and suffering to others and are capable of inflicting it.  This metric for evil is universally recognized and it does not change.  Some people go so far as to do it for its own sake because it pleases them.</p><p>The logical chain that results in demonstrating a Creator God who is necessary to establish the metric by which evil can exist and can be recognized begins with the following statement:</p><p>“As a shadow requires the presence of a source of light in order to exist, evil requires the presence of a source of good.”</p><p>This statement is always taken at face value as axiomatically true, and is always phrased as a light/dark dichotomy for illustration.  I also happen to disagree with it.</p><p>Objectively real evil is something we intuitively recognize by its qualities, and I don’t see how any of the qualities that defines evil requires a source of goodness to either enable or define it.  Evil is a phenomenon that is recognized through positive (or should I say, tangible?) action, not through negatives, as opposed to the metaphor of evil being a shadow, a region where light (the Good) doesn’t hit.  Evil is always unpleasant for someone, that’s what makes it objective, but leaping to the conclusion that it couldn’t exist without the objective and definitive Good strikes me as awfully non-sequiteur, knocking the base out of the argument that our ability to recognize evil necessitates the existence of a custodian of the Good.  Besides, calling Good and Evil laws requiring a lawgiver is not only assumption, but in light of my opening arguments, just too convenient as well.</p><p>I wouldn’t be at all suprised if our objective recognition of evil could be completely redefined to be merely experiencing the color blue if all of humanity were converted to a diet consisting exclusively of shellfish and Mellow Yellow.  After everyone is done scratching their heads, let me explain.</p><p>Right now, it is indisputable that our perceptions and attitudes are heavily influenced, possibly even dictated, by what finds its way into our bloodstream.  High doses of anabolic steriods increase aggression, THC improves ones mood, psilocybin makes you see things that aren’t there, and alcohol can significantly affect what the imbiber considers to be proper behavior at her best friend’s wedding.</p><p>The nutrients we derive from food fall under the same few categories: fat, protein, carbohydrates, vitamins, and minerals.  We all eat roughly the same things due to the fact we all need the same kinds of dietary input to survive due to the similiarity of our bodies (which is also why its safe so say we all see colors in roughly the same way, philosophers and their “what if my blue is your red?” be damned).  Sugar is sweet, 50 degree Farenheit water is cold, and someone who steals from someone else for purely personal gain is evil.  The first two are readily accepted facts across the board (thus objective, the only thing subjective is “how sweet” or “how cold”) as being a consequence of our common biology, yet the third gets a free pass as a universal law that we know though our moral intuition, that would hold true even without us around.  This makes no sense.</p><p>I’m not saying that our common biology is the definitive answer as to why we all perceive and recognize flavor, temperature, and evil, but it is just as good an explanation, if not better, than jumping to the conclusion that our recognition of evil is a window into some absolute moral law, much less saying that the very act of recognizing it requires some corresponding Goodness.  We know that what we consume can and does affect our minds, personalities, and perceptions (such as steriods, marijuana, mushrooms, and tequila), and for the most part we all consume roughly the same categories of nutrients to survive (regular food, from sweet potato to squid), so it’s unsuprising that we have some experiences and attitudes that are common across the board.</p><p>So the existence of objective evil is not itself a definitive proof of a lawgiver, it could just as easily be a secondary consequence of our biological reliance on vitamin C or something equally unexpected.  Given the theme of human progress I highlighted in my own opening arguments, I would not be at all suprised if our perception of evil ultimately is explained as a combination of our diet, the wavelengths of the radiation that hits us from the sun, coupled with a surprising discovery by someone who finally figures out why yawns are contagious but sneezing isn’t.</p><p> Dominic’s first post and my rebuttal <a href=\"http://www.milobookclub.com/2011/09/12/pz-myers-memorial-debate-round-1-ds/\">can be read here</a>.</p></div>",
  "content_text": "ON THE EXISTENCE OF GODS\nIn order to make the case that the weight of the available evidence and logic is more supportive of the existence of gods than of their nonexistence, it is necessary to define the two terms.  In making my case for the existence of gods, I am relying upon the definitions of “evidence” and “logic” as defined by the Oxford English Dictionary.  I am utilizing the term “evidence” in a sense that encompasses all three of the primary definitions provided.\nEvidence:\n1.Available body of facts or information indicating whether a belief or proposition is true or valid.\n2.Information drawn from personal testimony, a document, or a material object, used to establish facts in a legal investigation or admissible as testimony in a law court.\n3.Signs or indications of something.\nLogic:\n1.reasoning conducted or assessed according to strict principles of validity\nThere is a vast quantity of extant documentary and testimonial evidence providing indications that gods exist.  This evidence dates from the earliest written records to current testimonials from living individuals.  While it is true that the quality of this evidence varies considerably, it cannot simply be dismissed out of hand anymore than one can conclude Gaius Julius Caesar did not exist because one cannot see him on television today.  Each and every case demands its own careful examination before it can be dismissed, and such examination has never been done in the overwhelming majority of cases.\nFor example, there are many documented cases of confirmed fraud in published scientific papers.  If we apply the same reasoning to published scientific papers that some wish to apply to documentary evidence of gods, we have no choice but to conclude that all science is fraudulent.  But this is absurd, as we know that at least some science is not fraudulent.  Therefore, if one is willing to accept the validity of published scientific papers that one has not been able to verify are not fraudulent, one must similarly accept the validity of documentary evidence for the existence of gods that one has not examined and determined to merit dismissal for one reason or another.\nBecause it is intrinsically testimonial in nature, the documentary evidence for gods has been impugned on the basis of studies concerning the unreliability of eyewitness testimony for various reasons.  However, this critical analogy actually demonstrates the precise opposite of what it purports to show.  Since eyewitness testimony has been variously determined to be somewhere between 12 percent and 50 percent inaccurate, this means that between 50 percent and 88 percent of the testimonial evidence for gods should be assumed accurate, at least concerning the correctly reported details of the divine encounter.  The correct interpretations of the specific details, of course, are a different matter.\nOne of the core principles of the historical method is that “the closer a source is to the event which it purports to describe, the more one can trust it to give an accurate historical description of what actually happened.”  Blanket rejection of the entire historical record that does not accord with the present materialist consensus with regards to the universe turns this principle on its head to such an extent that it can only be described as ahistorical.  Moreover, it is downright illogical given the dynamic nature of the materialist consensus, especially when one takes into account how many times the material rejectionist position can be confirmed to have been wrong whereas the historical record was correct.   The cities of Capernaum, Chorazin, Bethsaida, and Nineveh, and the empires of Assyria and the Hittites are but six of many valid examples.\nIn fact, the material rejectionist position amounts to nothing more than a time-limited appeal to technology.  At one time, Man could not detect x-rays, radiation, or distant planets because he lacked the necessary technology.  At present, Man cannot detect dark matter, the Higgs boson, other universes, Heaven, Hell, alien life forms, or intelligent supernatural beings.  These things may or may not exist, for example, the scientists at CERN have excluded the possibility of the Higgs boson particle from masses ranging from 145 to 466 GeV.  But science has never managed to exclude the existence of gods from anything, and unless one also rejects the existence of multiple universes and other undetected concepts, one cannot reasonably reject the existence of gods.\nIndeed, the acceptance of the possibility of the existence of the multiversal and the rejection of the possibility of the supernatural makes no sense, given that it is entirely conceivable that the two could be identical.  It would be as difficult for humanity today to distinguish between a technologically advanced being from a different universe and “a superhuman being worshiped as having power over nature or human fortunes”, which is how Oxford defines a god, [as it would for an ancient human to distinguish between a current U.S. Marine with air support and a god.]\nScience itself lends support to the idea of the material existence of gods in this universe when astronomical evidence taken into account.  According to the latest scientific consensuses, the universe is 13.75 billion years old, the Sun is 4.6 billion years old, the Earth is 4.54 billion years old, and homo sapiens sapiens reached behavioral modernity 50,000 years ago.  As there are a conservatively estimated 200 billion stars in the galaxy and 100 billion galaxies in the universe, this indicates that there has been sufficient time for at least 7,891 billion alien races to appear, evolve, and reach a higher level of technological development than Man given the current ratio of 1.18 planets discovered per star.  And to paraphrase Arthur C. Clarke, any sufficiently advanced technology is indistinguishable from godhood.\nOne could dismiss the numerical argument as a simple appeal to very large numbers, except for the fact of a written historical record which repeatedly describes contact with superhuman beings possessing power over nature and human fortunes.  When the mathematical odds indicate that advanced technological aliens exist somewhere in the material universe and contact with superhuman beings has been reported on tens of thousands of occasions, the assumption that gods do not exist begins to look more like outright denial than reasonable skepticism.  When seen in this light, the failure of modern science to detect gods in what the scientific consensus presently states is only 0.6 percent of modern Man’s existence is analogous to the Aztecs assuming that because no white men were seen during a given 201-day period between 1427 and 1519, Cortés and the conquistadors did not exist.  No doubt this would have seemed like a perfectly reasonable conclusion, right up until the day Córdoba arrived in the Yucatán.\nSo, there is evidence from history, mathematical probability from science, and logic from the combination of the two which support the existence of gods.  However, the most powerful evidence for the existence of not only gods, but the existence of one or more Creator gods, can be materially observed in Man himself.  Just as the existence of various phenomena can be correctly deduced through the observation of senses and sensors designed to interact with those phenomena even if a particular phenomenon remains unobserved, the presence of an invisible sound wave can be deduced by the presence of an antenna and the presence of a lawgiver can be deduced by the presence of prison guards.  Hence the importance of Man’s moral sense.\nWhile some people throughout history have reported experiencing personal contact with God, most have not.  However, I am not aware of a single individual who has denied ever experiencing any direct contact with evil.  And by evil, I do not mean mere bad fortune, physical pain, or the application of the various principles of physics to suboptimal human action, but rather those self-aware, purposeful, and malicious forces which intend material harm and suffering to others and are capable of inflicting it.  We are aware of this force in ourselves and we can observe it in others.  As anyone who has witnessed a child lie for the first time knows, human evil not an entirely learned behavior, it is at least partially endogenous.\nAs a shadow requires the presence of a source of light in order to exist, evil requires the presence of a source of good.  What some call God is perhaps better understood as the source of that good through which evil can exist and be observed, by which I do not mean any subjective and experienced good, but rather the objective and definitive good.  But the only entity capable of dictating an objective and definitive good with universal application is either a) the entity that created the universe, or b) an entity given managing responsibility by the creating entity.  This is not a case of might makes right, but rather, conception and creation necessitating constants.\nTherefore, when we observe and acknowledge material evil, we must correctly conclude the existence of a Creator God.\nTO WHICH DOMINIC REPLIES\nThe opening argument for the positive existence of gods comes from the mountain of eyewitness accounts of having experienced what they can only describe as supernatural.  Admittedly, no amount of handwaving theorizing that so many people throughout history have been merely dishonest, crazy, delusional, or suffering from temporal lobe epilepsy can stand up against the sheer volume of accounts made, so dismissal simply is not an option.  There is no denying that there is something, possibly of a distinctly external nature, is imposing itself on people throughout history causing them to report visitations from gods, angels, demons.  What was left out are the more recent and very similar accounts of space aliens.\nFrom space.\nEarly accounts of UFOs contain vague references to fires in the sky that are wheel-like or circular.  Examples of this are the flying Vimanas of the Sanskrit epics, Ezekiel’s Wheel (which, from the description, sort of looks more like a V-22 Osprey [landing gear and all] with an extra pair of wings and rockets underneath the tiltrotors, than a flying saucer), the mass sighting at Nuremberg in 1561, and the ‘Miracle of the Sun’ event in Portugal (1917).  Attributing such sightings to actual aliens rather than supernatural manifestations of the classical sense does not occur until after pop culture had introduced alien life into the public imagination.\nAliens seem to first have been introduced as forms of social commentary coupled with an increasingly materialist worldview, from Voltaire’s ‘Micromegas’ (1752) as a vehicle for warning against anthrocentric hubris and a convenient means to lampoon a few people he didn’t particularly care for, to H.G. Wells ‘War of the Worlds’ (1898) as a criticism of gunboat colonialism.  Aliens as entertainment took as many different forms as the people who subsequently claim to have actually met them.  Detailed descriptions of the aliens themselves, and what subsequently happens to a person after meeting them, were all wildly different, and a more consistent story does not emerge until after science fiction literature and Hollywood have a crack at it, writing the scripts for such experiences before people actually start having them.\nThe event that really popularized alien abductions and set the stage for the flood of abduction stories that people have reported since is generally considered to be the Betty and Barney Hill abduction (September 19, 1961), where the couple recounts an alien abduction with many of the details pulled straight from an episode of ‘The Outer Limits’ which aired just 12 days beforehand, and the 1951 film, ‘Invaders from Mars’.  From here, alien encounters have become increasingly normalized with nearly everyone meeting “Grey” aliens with squat bodies, thin limbs, huge heads and giant black unblinking eyes, the sort that we have been exposed to by Hollywood now as the prototypical ‘alien’.  Quite different than the furry vagabonds who harrased Colonel H. G. Shaw in 1897.  And never mind that the case of Antonio Villas Boas did not occur until 9 years after the publication ‘Flash Gordon and the Adventures of the Flying Saucers’.\nThe evidence suggests that there is a very strong influence of belief and disposition which not only influences how paranormal events are interpreted, but how they are in fact experienced and remembered.  Looking now at the eyewitness accounts of visitations by gods and angels, and also of demon possession, the first observation to make is that familairity with the context is a mandatory prerequisite for having the experience, just as no one remembered being abducted by a Grey alien with giant unblinking eyes until after Hollywood gave us Grey aliens with giant unblinking eyes.  Again, this isn’t to say that all the experiences are delusional, given the logic that 50 to 88 percent of such accounts can be considered honest accounts by people who are not crazy, simply that the actual explanation, the real source that triggers these experiences, is something quite different, and let’s not forget stranger, than what they appear to be to the eyewitness, given the sheer variety of expereiences and undeniable influence of pre-existing culture and belief.  After all, Barney Hill reported that one of the first things the aliens said to him was to not be afraid.  Something that anyone familiar with eyewitness accounts of angelic visitations should recognize.  However, Barney wasn’t visited by angels bearing halos and white wings, and he did not recognize them as such, he saw space aliens.  This is not an ‘interpretation’ of details, these are entirely different details, one of gods, the other of aliens.\nThis brings us to the second point, that of the materialist position rejecting such accounts on the basis of the lack of an objective measuring tool which would verify the validity of the accounts of gods made by the eyewitnesses is ahistorical and the intellectual equivalent of burying one’s head in the sand.  Here, there is no dissagreement.  Rejecting something’s existence based on nothing more than ignorance of similar phenonmenon is an unsustainable position.\nHowever, included in this point, is the argument that gods are more likely than not given that our gods could very well be aliens.  Ironic, given what all I just wrote, but worthy of being addressed separetely.  Combining the statistical probablity of alien life with the eyewitness accounts of paranormal visitors and the Oxford dictionary’s definition of “god” would lead one to believe that the alien visitation explanation concocted over the past 110 years or so (particularly in the last 50) is the more accurate description of real gods, and our religions (with the exception of the Mormons) are clumsy attempts at describing what we now have better tools for understanding, that we’re being visited by aliens.  Maybe the Mormons are actually right and we should follow Matt Stone and Trey Parker to the promised lands.\nTo address this, I would argue in turn this application of the Oxford definition actually makes one group of men gods over others.  For example, John Frum, a recipeint of his own cult, possessed, along with the rest of the American military, the superhuman ability to bestow gifts of divine cargo upon the residents of the island of Tanna.  Squint at bit a the word “superhuman”, or just take it in context of the situation, and the military service men whose actions led to the creation of such cargo cults were, technically, gods.\nSomehow, I doubt that proving other people exist, though, is the purpose of this discussion.  Further, if we’re saying that technologically advanced aliens are as god-like as anything in the universe, we should probably just stop now.\nBut then we’d miss out on what I see as the actual argument, and what I predict will be the real thrust from here on out.  The final argument, that a real creator God (big ‘G’) is necessary given the existence real objective evil in the world.\nObjective measurement is one where the point of reference does not move.  Here I believe we can all be in agreement that objective evil, as defined as a self-aware, purposeful, and malicious force which intends material harm and suffering to others and is capable of inflicting it, is quite real.  It would be an impossible task to actually prove that people have never or do not act with self-ware, purposeful, and malicious intent to cause material harm and suffering to others and are capable of inflicting it.  This metric for evil is universally recognized and it does not change.  Some people go so far as to do it for its own sake because it pleases them.\nThe logical chain that results in demonstrating a Creator God who is necessary to establish the metric by which evil can exist and can be recognized begins with the following statement:\n“As a shadow requires the presence of a source of light in order to exist, evil requires the presence of a source of good.”\nThis statement is always taken at face value as axiomatically true, and is always phrased as a light/dark dichotomy for illustration.  I also happen to disagree with it.\nObjectively real evil is something we intuitively recognize by its qualities, and I don’t see how any of the qualities that defines evil requires a source of goodness to either enable or define it.  Evil is a phenomenon that is recognized through positive (or should I say, tangible?) action, not through negatives, as opposed to the metaphor of evil being a shadow, a region where light (the Good) doesn’t hit.  Evil is always unpleasant for someone, that’s what makes it objective, but leaping to the conclusion that it couldn’t exist without the objective and definitive Good strikes me as awfully non-sequiteur, knocking the base out of the argument that our ability to recognize evil necessitates the existence of a custodian of the Good.  Besides, calling Good and Evil laws requiring a lawgiver is not only assumption, but in light of my opening arguments, just too convenient as well.\nI wouldn’t be at all suprised if our objective recognition of evil could be completely redefined to be merely experiencing the color blue if all of humanity were converted to a diet consisting exclusively of shellfish and Mellow Yellow.  After everyone is done scratching their heads, let me explain.\nRight now, it is indisputable that our perceptions and attitudes are heavily influenced, possibly even dictated, by what finds its way into our bloodstream.  High doses of anabolic steriods increase aggression, THC improves ones mood, psilocybin makes you see things that aren’t there, and alcohol can significantly affect what the imbiber considers to be proper behavior at her best friend’s wedding.\nThe nutrients we derive from food fall under the same few categories: fat, protein, carbohydrates, vitamins, and minerals.  We all eat roughly the same things due to the fact we all need the same kinds of dietary input to survive due to the similiarity of our bodies (which is also why its safe so say we all see colors in roughly the same way, philosophers and their “what if my blue is your red?” be damned).  Sugar is sweet, 50 degree Farenheit water is cold, and someone who steals from someone else for purely personal gain is evil.  The first two are readily accepted facts across the board (thus objective, the only thing subjective is “how sweet” or “how cold”) as being a consequence of our common biology, yet the third gets a free pass as a universal law that we know though our moral intuition, that would hold true even without us around.  This makes no sense.\nI’m not saying that our common biology is the definitive answer as to why we all perceive and recognize flavor, temperature, and evil, but it is just as good an explanation, if not better, than jumping to the conclusion that our recognition of evil is a window into some absolute moral law, much less saying that the very act of recognizing it requires some corresponding Goodness.  We know that what we consume can and does affect our minds, personalities, and perceptions (such as steriods, marijuana, mushrooms, and tequila), and for the most part we all consume roughly the same categories of nutrients to survive (regular food, from sweet potato to squid), so it’s unsuprising that we have some experiences and attitudes that are common across the board.\nSo the existence of objective evil is not itself a definitive proof of a lawgiver, it could just as easily be a secondary consequence of our biological reliance on vitamin C or something equally unexpected.  Given the theme of human progress I highlighted in my own opening arguments, I would not be at all suprised if our perception of evil ultimately is explained as a combination of our diet, the wavelengths of the radiation that hits us from the sun, coupled with a surprising discovery by someone who finally figures out why yawns are contagious but sneezing isn’t.\nDominic’s first post and my rebuttal\ncan be read here\n.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-12T13:09:00+00:00"
}