{
  "url": "https://voxday.net/2011/09/22/pz-myers-memorial-debate-round-two/",
  "scraped_at": "2025-12-13T23:22:33.515240",
  "title": "PZ Myers Memorial Debate Round Two: The Judges",
  "date_display": "September 22, 2011",
  "date_iso": "2011-09-22T14:25:00+00:00",
  "date_from_url": "2011-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Curiouser and curiouser!  The debate begins to sharpen and come into focus in the second round and we have a fascinating difference of opinion among the three judges as they pronounce their collective verdict.</i></p><p><b>CL:</b> Vox did not persuasively demonstrate his argument from moral evil. Dominic failed to show A3 and B3 false. B4 seems irrevocably tied to subjectivity hence still up for grabs. Dominic did not persuasively demonstrate his hypothesis that the first attempt at an explanation is almost invariably correct, nor did he attempt to account for the fact that testimony is distinct from explanation. I declare this round a draw. <i>(For CL’s complete analysis of Round 2, <a href=\"http://thewarfareismental.wordpress.com/2011/09/22/the-pz-myers-memorial-debate-round-two/\">visit The Warfare Is Mental</a>.)</i></p><p><b>Alex Amenos:</b> Gods and Flying Saucers – round to Vox, with bonus points to both participants for not making me declare whether I take Erich von Daniken seriously;</p><p>Evil Detection – edge to Vox;</p><p>The first attempt at explanation is almost invariably wrong – if not an altogether new argument, this is at least a very different presentation of the round 1 argument, and accordingly I prefer to give Vox an opportunity to respond before offering any further judgment.</p><p>Good show, gents.  Overall I give the round to Vox.  His argument is (thus far) the more tightly constructed of the two.  If anyone following the debate is interested in trudging through my expanded commentary, just say the word in the comments and we’ll make arrangements.</p><p><b>Scott Scheule:</b> Again, I’m very grateful to both debaters for inviting me to judge their contributions. And again, my criticisms are testament to the respect I have for both. And so no one need read all the way through my commentary, in the end, I award the round to Dominic.</p><p>Round 2 – Vox’s Statement<br> Judgement and Decision – Scott Scheule</br></p><p>Vox begins by addressing some of the complaints various commenters (and judges) have had with the topic of the debate. To be clear, I don’t question whether the topic of the debate is being adhered to–only whether it is an adequate topic of debate if it would allow in, inter alia, space aliens.</p><p>Day clarifies that the similarity between gods and advanced non-godly creatures is merely to show the failure of the materialist metric that cannot tell the two apart. Fair enough. It may also be a failure in the specificity of our definitions.</p><p>Says Day: <i>“The failure of science to detect supernatural gods is no more significant than its failure to detect natural aliens, and combined with the potential for confusing the two, this means science is an intrinsically unreliable means of determining what historical evidence for the existence of gods and/or aliens is valid and what is not. Therefore, the science-based materialist consensus is incapable of judging the mass of available historical evidence for gods.”</i></p><p>Some of the language is ambiguous here. Day’s conclusion that the “science-based materialist consensus is incapable of judging the mass of available historical evidence for gods” is correct so far as it means the “science-based materialist consensus is incapable of judging whether the mass of available historical evidence is specifically for gods, or for aliens.” The wider conclusion that some readings would supply: “science can’t deal with the historical evidence for gods, full stop” is too ambitious.</p><p>Day reiterates his previous metaphor with the Aztecs, which, with the provisos I allowed previously, is still good. He says the analogy understates the actual situation because ” a) not all individuals living in the era of modern science are scientists and b) not all scientists operate in fields that potentially concern the detection of gods.” He develops this theme at length, using a clever example about the okapi, statistics about the prevalence of scientists in the population, and dark matter. He actually understates his case here, by only considering dark matter and not dark energy. When considering energy as well, the amount of energy/matter in the universe we’ve actually been able to detect is a mere 4%.</p><p>I wholeheartedly agree it’s amazing how little we know.</p><p>Day disputes my point that “as our ability to measure reality and record history has improved, our evidence for the supernatural has begun to wane.” He uses Dominic’s evidence of aliens as a counterexample (it matters not that aliens are not gods, since science can’t distinguish the two, it might be and we wouldn’t know). I do not find this at all convincing. Yes, there are UFO sightings, but I have never heard any particularly reliable account that didn’t seem anywhere near as plausible, anywhere near as 1% as plausible, as alternate explanations such as lying or hallucination.</p><p>Day makes the observation that the vast majority of those who claim not to believe in evil nevertheless act as if they do. I don’t know what evidence he could have for this. Take two people, one who believes murder is objectively bad, and another who believes murder is abhorrent, but only subjectively. Both people could act identically, and we’d have no means of telling who was who unless we questioned them on the issue. I never eat eggplant, because I hate it. Someone who believed eating eggplant was evil would presumably act much like I do. That’s no proof that I actually believe in the evilness of eating eggplant.</p><p>But I granted most believe morality is objective, even if I don’t, so we can skip over this. Day argues that evil requires an actor, an event, and a sensate victim. Day argues consciousness is also required. This is all fine.</p><p>Day then says consciousness is beyond current science. I agree. Nonetheless, there are other solutions that save materialism here: Dennett’s view that consciousness is a persistent illusion would solve the problem as well as any, if only it could take account of the rather large datum of the first-person perspective. McGinn’s mysterianism would also leave us with materialism. But I won’t harp on these, as I don’t find them persuasive.</p><p>At any rate, after some exploration of the issue, we come to the issue of whether morality is internal or external. Day’s evidence here strikes me as weak. That psychoanalysis fails to provide a consistent account of morality is true, but not news. Modern accounts of morality using game theory and evolutionary psychology are stronger candidates. Day’s statement that the rapid rate of evolution of morality in the US and the overall uniformity in moral senses across societies otherwise separated is unexplainable by materialism is an assertion I see no reason to accept. If our moral sensibilities had simply evolved before the large scale dispersion of the human race, then it’s no more surprising that we should have the same morality than that we should all be interested in heterosexual sex.</p><p>As to the rapid evolution of morality lately: fashion sense has evolved rapidly at the same time, yet I’ve met few who would argue therefore that fashion must have an external non-material source. I’m not sure what sort of morality we would expect if it were entirely material or internal, and if it would differ from what we observe.</p><p>Nonetheless, as I’ve conceded, most don’t agree with me. Some will even be unnerved that I would compare morality with clothing fashion. So I’ll proceed with the axiom that morality is objective.</p><p>And so I’ll accept Day’s argument, arguendo, that as morality is as arbitrary and constant as any of the physical laws, we can say it’s a similar law. But, I suppose in contradistinction to many, I have no problem accepting something as a brute fact. I’m afraid I just don’t see the force of the argument: laws exist, thus a lawgiver is necessary. This seems to me almost an equivocation on the term “law”: which means something quite different in the cases of the Internal Revenue Code vs. F = MA.</p><p>Rebuttal Round 2 – Dominic Saltarelli</p><p>Dominic formalizes the logic of the debate. I agree with his presentation of A. I’ve given reason why I think B doesn’t succeed, even as plotted. He goes on to attack necessary planks in both arguments.</p><p>Dominic says he wasn’t arguing aliens existed, only that the evidence is on a par with evidence for gods. The implication is Dominic thinks the evidence is weak for aliens: yet Day has taken it as support for his argument in his contribution above. There’s a disagreement obviously on the validity of such evidence.</p><p>Dominic argues that the extraordinary nature of testimony for gods makes it different from other testimonial evidence, and more akin to alien encounters. I agree. Indeed, Day seems to agree as well. The only difference is Dominic (and I) think this is a shot against the evidence for gods, Day the opposite. So there’s a prior parties are bringing to the table in which they differ: their personal views of testimony of alien encounters.</p><p>Dominic says that Day’s Aztec metaphor is obfuscation. I disagree. It’s simply not relevant to this branch of the argument. That alien encounters continue the evidence for ancient gods would be one reason to not deny the evidence of past encounters with gods (says Day). But that gods may simply be absent, in much the same way whites were from Aztecs, is another independent defense of past testimonial evidence (and a better defense). And Dominic seems to concede the point here: he says it would be silly for Aztecs to deny the existence of white men. Is he thus admitting it would be similarly silly to deny the existence of gods? Again, Dominic seems to be arguing for agnosticism, not atheism.</p><p>Dominic demands evidence of aliens or gods that arises independently of the cultural milieu it supports. Fair enough. How about a risen Christ from people whose only conception of resurrection was to be at the end of days?</p><p>Were I Day, my response would be something along the line of sure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.</p><p>Dominic argues that morality is not objective, and moreover, Vox has admitted as much: Vox, says he, admitted it could be an implant and that gave the game away. Well no, not exactly. The game is who’s the more likely implanter, evolution or God or some tertium quid.</p><p>Dominic argues morality, contra Vox (at times), does change often.</p><p>I find something distinctly weird in both disputers here. See, if morality is just another evolved chunk of us, we would expect uniformity in it. So I would expect Dominic to be arguing for a stable morality. And if morality is just hanging out there, perfected, then I would expect our morality to change to more closely approximate that ideal morality with time, in the same way our understanding of physical laws has changed with time–thus I’d expect Vox to argue for a fluid morality. But both are doing the opposite, at least at times.</p><p>Dominic then argues vengeance disproves a stable morality. I don’t find this at all convincing. Dominic seems to think calling vengeance an exception to the general law against, e.g., murder, is somehow to give up the claim that morality is objective. I can’t see why, anymore than granting the law that things fall at the same rate has an exception when there’s air resistance gives up the objective existence of gravity.</p><p>In sum, I think the testimonial evidence criticism does invalidate argument A. I don’t think B goes through because B1 is false. Even if B1 is true, I don’t think the law requires a lawgiver, so I don’t think B goes through. But Dominic’s arguments have been against B3 and B4, and I’m not convinced either criticism has been sound.</p><p>Still, we need a positive argument to get to atheism, which Dominic presents. It is simply his weird argument again. I will state my first response, which I still feel works.</p><p>“Moreover, simple strangeness doesn’t really bear on the issue of theism vs. atheism. Yes, it may be reality is much stranger than imagined. But that reality may have a God or may not. If there is a God, then He may well be something far stranger than anything we’ve imagined… Or there may be no God, and reality is alone, far stranger than anticipated…”</p><p>Dominic says his point was that the first explanation is usually wrong. Well, yeah. Otherwise, there wouldn’t be a second explanation. When the first explanation works, we pay no attention. That gods were the first explanation seems a gross simplification. And it’s not exactly like others didn’t try materialism as an early explanation either. See De Rerum Natura.</p><p>What’s subjective is the guess at what the next explanation, the successful one, the weird one, will be. Dominic’s got a hunch it’s an atheistic explanation. Here’s my original explanation, altered to face Dominic’s revision:</p><p>“Moreover, the simple wrongness of the first explanation doesn’t bear on the issue of theism vs. atheism. It may be that the second, weirder explanation involves a god. It may be that the second, weirder explanation doesn’t involve a god. Still weird, still second, still correct in either case.”</p><p>Dominic argues that the existence of other gods not thus far touched upon is beyond the scope of the debate. I have no idea if this is true or not. The only topic I’ve seen thus far is “The first PZ Myers Memorial Debate features Dominic Saltarelli vs Vox Day and concerns the evidence and logic for the existence or nonexistence of gods.” That’s vague, but “gods” suggests a fairly wide net. Moreover Day seems quite explicit that he’s talking about as many gods as possible. The debaters are welcome to clarify the topic.</p><p>In sum, Day’s A argument fails, the B argument fails, but I’m less certain about that, and Dominic’s positive argument that there are no gods fails as well. We’re left with agnosticism, which I suppose, to be cheerful about it, means both parties lose.</p><p>Still, all in all, I think Dominic made the better case.</p><p> <i>So, we have one vote for Dominic, one vote for Vox, and one vote for a draw.  That makes Round Two a draw!  Dominic has decided that for Round Three, he will present the next argument and I will write the rebuttal.  The current score is Vox 4.5, Dominic 1.5.</i></p></div>",
  "content_text": "Curiouser and curiouser!  The debate begins to sharpen and come into focus in the second round and we have a fascinating difference of opinion among the three judges as they pronounce their collective verdict.\nCL:\nVox did not persuasively demonstrate his argument from moral evil. Dominic failed to show A3 and B3 false. B4 seems irrevocably tied to subjectivity hence still up for grabs. Dominic did not persuasively demonstrate his hypothesis that the first attempt at an explanation is almost invariably correct, nor did he attempt to account for the fact that testimony is distinct from explanation. I declare this round a draw.\n(For CL’s complete analysis of Round 2,\nvisit The Warfare Is Mental\n.)\nAlex Amenos:\nGods and Flying Saucers – round to Vox, with bonus points to both participants for not making me declare whether I take Erich von Daniken seriously;\nEvil Detection – edge to Vox;\nThe first attempt at explanation is almost invariably wrong – if not an altogether new argument, this is at least a very different presentation of the round 1 argument, and accordingly I prefer to give Vox an opportunity to respond before offering any further judgment.\nGood show, gents.  Overall I give the round to Vox.  His argument is (thus far) the more tightly constructed of the two.  If anyone following the debate is interested in trudging through my expanded commentary, just say the word in the comments and we’ll make arrangements.\nScott Scheule:\nAgain, I’m very grateful to both debaters for inviting me to judge their contributions. And again, my criticisms are testament to the respect I have for both. And so no one need read all the way through my commentary, in the end, I award the round to Dominic.\nRound 2 – Vox’s Statement\nJudgement and Decision – Scott Scheule\nVox begins by addressing some of the complaints various commenters (and judges) have had with the topic of the debate. To be clear, I don’t question whether the topic of the debate is being adhered to–only whether it is an adequate topic of debate if it would allow in, inter alia, space aliens.\nDay clarifies that the similarity between gods and advanced non-godly creatures is merely to show the failure of the materialist metric that cannot tell the two apart. Fair enough. It may also be a failure in the specificity of our definitions.\nSays Day:\n“The failure of science to detect supernatural gods is no more significant than its failure to detect natural aliens, and combined with the potential for confusing the two, this means science is an intrinsically unreliable means of determining what historical evidence for the existence of gods and/or aliens is valid and what is not. Therefore, the science-based materialist consensus is incapable of judging the mass of available historical evidence for gods.”\nSome of the language is ambiguous here. Day’s conclusion that the “science-based materialist consensus is incapable of judging the mass of available historical evidence for gods” is correct so far as it means the “science-based materialist consensus is incapable of judging whether the mass of available historical evidence is specifically for gods, or for aliens.” The wider conclusion that some readings would supply: “science can’t deal with the historical evidence for gods, full stop” is too ambitious.\nDay reiterates his previous metaphor with the Aztecs, which, with the provisos I allowed previously, is still good. He says the analogy understates the actual situation because ” a) not all individuals living in the era of modern science are scientists and b) not all scientists operate in fields that potentially concern the detection of gods.” He develops this theme at length, using a clever example about the okapi, statistics about the prevalence of scientists in the population, and dark matter. He actually understates his case here, by only considering dark matter and not dark energy. When considering energy as well, the amount of energy/matter in the universe we’ve actually been able to detect is a mere 4%.\nI wholeheartedly agree it’s amazing how little we know.\nDay disputes my point that “as our ability to measure reality and record history has improved, our evidence for the supernatural has begun to wane.” He uses Dominic’s evidence of aliens as a counterexample (it matters not that aliens are not gods, since science can’t distinguish the two, it might be and we wouldn’t know). I do not find this at all convincing. Yes, there are UFO sightings, but I have never heard any particularly reliable account that didn’t seem anywhere near as plausible, anywhere near as 1% as plausible, as alternate explanations such as lying or hallucination.\nDay makes the observation that the vast majority of those who claim not to believe in evil nevertheless act as if they do. I don’t know what evidence he could have for this. Take two people, one who believes murder is objectively bad, and another who believes murder is abhorrent, but only subjectively. Both people could act identically, and we’d have no means of telling who was who unless we questioned them on the issue. I never eat eggplant, because I hate it. Someone who believed eating eggplant was evil would presumably act much like I do. That’s no proof that I actually believe in the evilness of eating eggplant.\nBut I granted most believe morality is objective, even if I don’t, so we can skip over this. Day argues that evil requires an actor, an event, and a sensate victim. Day argues consciousness is also required. This is all fine.\nDay then says consciousness is beyond current science. I agree. Nonetheless, there are other solutions that save materialism here: Dennett’s view that consciousness is a persistent illusion would solve the problem as well as any, if only it could take account of the rather large datum of the first-person perspective. McGinn’s mysterianism would also leave us with materialism. But I won’t harp on these, as I don’t find them persuasive.\nAt any rate, after some exploration of the issue, we come to the issue of whether morality is internal or external. Day’s evidence here strikes me as weak. That psychoanalysis fails to provide a consistent account of morality is true, but not news. Modern accounts of morality using game theory and evolutionary psychology are stronger candidates. Day’s statement that the rapid rate of evolution of morality in the US and the overall uniformity in moral senses across societies otherwise separated is unexplainable by materialism is an assertion I see no reason to accept. If our moral sensibilities had simply evolved before the large scale dispersion of the human race, then it’s no more surprising that we should have the same morality than that we should all be interested in heterosexual sex.\nAs to the rapid evolution of morality lately: fashion sense has evolved rapidly at the same time, yet I’ve met few who would argue therefore that fashion must have an external non-material source. I’m not sure what sort of morality we would expect if it were entirely material or internal, and if it would differ from what we observe.\nNonetheless, as I’ve conceded, most don’t agree with me. Some will even be unnerved that I would compare morality with clothing fashion. So I’ll proceed with the axiom that morality is objective.\nAnd so I’ll accept Day’s argument, arguendo, that as morality is as arbitrary and constant as any of the physical laws, we can say it’s a similar law. But, I suppose in contradistinction to many, I have no problem accepting something as a brute fact. I’m afraid I just don’t see the force of the argument: laws exist, thus a lawgiver is necessary. This seems to me almost an equivocation on the term “law”: which means something quite different in the cases of the Internal Revenue Code vs. F = MA.\nRebuttal Round 2 – Dominic Saltarelli\nDominic formalizes the logic of the debate. I agree with his presentation of A. I’ve given reason why I think B doesn’t succeed, even as plotted. He goes on to attack necessary planks in both arguments.\nDominic says he wasn’t arguing aliens existed, only that the evidence is on a par with evidence for gods. The implication is Dominic thinks the evidence is weak for aliens: yet Day has taken it as support for his argument in his contribution above. There’s a disagreement obviously on the validity of such evidence.\nDominic argues that the extraordinary nature of testimony for gods makes it different from other testimonial evidence, and more akin to alien encounters. I agree. Indeed, Day seems to agree as well. The only difference is Dominic (and I) think this is a shot against the evidence for gods, Day the opposite. So there’s a prior parties are bringing to the table in which they differ: their personal views of testimony of alien encounters.\nDominic says that Day’s Aztec metaphor is obfuscation. I disagree. It’s simply not relevant to this branch of the argument. That alien encounters continue the evidence for ancient gods would be one reason to not deny the evidence of past encounters with gods (says Day). But that gods may simply be absent, in much the same way whites were from Aztecs, is another independent defense of past testimonial evidence (and a better defense). And Dominic seems to concede the point here: he says it would be silly for Aztecs to deny the existence of white men. Is he thus admitting it would be similarly silly to deny the existence of gods? Again, Dominic seems to be arguing for agnosticism, not atheism.\nDominic demands evidence of aliens or gods that arises independently of the cultural milieu it supports. Fair enough. How about a risen Christ from people whose only conception of resurrection was to be at the end of days?\nWere I Day, my response would be something along the line of sure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.\nDominic argues that morality is not objective, and moreover, Vox has admitted as much: Vox, says he, admitted it could be an implant and that gave the game away. Well no, not exactly. The game is who’s the more likely implanter, evolution or God or some tertium quid.\nDominic argues morality, contra Vox (at times), does change often.\nI find something distinctly weird in both disputers here. See, if morality is just another evolved chunk of us, we would expect uniformity in it. So I would expect Dominic to be arguing for a stable morality. And if morality is just hanging out there, perfected, then I would expect our morality to change to more closely approximate that ideal morality with time, in the same way our understanding of physical laws has changed with time–thus I’d expect Vox to argue for a fluid morality. But both are doing the opposite, at least at times.\nDominic then argues vengeance disproves a stable morality. I don’t find this at all convincing. Dominic seems to think calling vengeance an exception to the general law against, e.g., murder, is somehow to give up the claim that morality is objective. I can’t see why, anymore than granting the law that things fall at the same rate has an exception when there’s air resistance gives up the objective existence of gravity.\nIn sum, I think the testimonial evidence criticism does invalidate argument A. I don’t think B goes through because B1 is false. Even if B1 is true, I don’t think the law requires a lawgiver, so I don’t think B goes through. But Dominic’s arguments have been against B3 and B4, and I’m not convinced either criticism has been sound.\nStill, we need a positive argument to get to atheism, which Dominic presents. It is simply his weird argument again. I will state my first response, which I still feel works.\n“Moreover, simple strangeness doesn’t really bear on the issue of theism vs. atheism. Yes, it may be reality is much stranger than imagined. But that reality may have a God or may not. If there is a God, then He may well be something far stranger than anything we’ve imagined… Or there may be no God, and reality is alone, far stranger than anticipated…”\nDominic says his point was that the first explanation is usually wrong. Well, yeah. Otherwise, there wouldn’t be a second explanation. When the first explanation works, we pay no attention. That gods were the first explanation seems a gross simplification. And it’s not exactly like others didn’t try materialism as an early explanation either. See De Rerum Natura.\nWhat’s subjective is the guess at what the next explanation, the successful one, the weird one, will be. Dominic’s got a hunch it’s an atheistic explanation. Here’s my original explanation, altered to face Dominic’s revision:\n“Moreover, the simple wrongness of the first explanation doesn’t bear on the issue of theism vs. atheism. It may be that the second, weirder explanation involves a god. It may be that the second, weirder explanation doesn’t involve a god. Still weird, still second, still correct in either case.”\nDominic argues that the existence of other gods not thus far touched upon is beyond the scope of the debate. I have no idea if this is true or not. The only topic I’ve seen thus far is “The first PZ Myers Memorial Debate features Dominic Saltarelli vs Vox Day and concerns the evidence and logic for the existence or nonexistence of gods.” That’s vague, but “gods” suggests a fairly wide net. Moreover Day seems quite explicit that he’s talking about as many gods as possible. The debaters are welcome to clarify the topic.\nIn sum, Day’s A argument fails, the B argument fails, but I’m less certain about that, and Dominic’s positive argument that there are no gods fails as well. We’re left with agnosticism, which I suppose, to be cheerful about it, means both parties lose.\nStill, all in all, I think Dominic made the better case.\nSo, we have one vote for Dominic, one vote for Vox, and one vote for a draw.  That makes Round Two a draw!  Dominic has decided that for Round Three, he will present the next argument and I will write the rebuttal.  The current score is Vox 4.5, Dominic 1.5.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-22T13:25:00+00:00"
}