{
  "url": "https://voxday.net/2011/09/12/pz-myers-memorial-debate-round-1-ds/",
  "scraped_at": "2025-12-13T23:21:35.518593",
  "title": "PZ Myers Memorial Debate Round 1 DS",
  "date_display": "September 12, 2011",
  "date_iso": "2011-09-12T17:00:00+00:00",
  "date_from_url": "2011-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>THE REASONS AND EVIDENCE THAT GODS PROBABLY DON’T EXIST</b></p><p>First off, I see no need for a “first mover”.</p><p>I’m assuming gods refer to one or more concious beings who predate our universe (at least one of whom being its creator), capable of creating something out of nothing with concious intent.  The being(s) necessitated by the cosmological argument (Plato, Aristotle, Aquinas…William Lane Craig, choose whichever version you like, they’re all basically the same) something I’m assuming all readers of this are familiar with, so no reason to summarize it.</p><p>However, the existence of the supernatural is necessary only by taking it as axiomatically true that cause preceeds effect, and therefore space-time is causal and linear.</p><p>The majority of our experience confirms these assumptions as self-evidently true, from daily living down to events only quantum physics can describe, thus making the existence of at least one god absolutely necessary.  The problem I have with this though, is that there are other experiences which contradict these assumptions, and ironically enough are often relied upon as themselves proof of the supernatural which, from my perspective, they ultimately contradict.</p><p>Precognition (the artist formerly known as prophecy).</p><p>Exhibit A.  Daryl Bem.  (see <a href=\"http://dbem.ws/FeelingFuture.pdf\">a paper recently published in the Journal of Personality and Social Psychology</a>).  Technically, the jury is still out on his results, as more rigourous replication must take place first to verify the study. One such paper <a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1715954\">is found here</a>)</p><p>Essentially, Bem demonstrates that the future can affect the past by reversing the order of conventional psychology tests and seeing statistically significant results, the most amusing of which is the ability of subjects to find porn.  Subjects are sat down in front of a computer with two selectable regions, and are told to select one, where it is randomly selected by the computer for one of the regions to display a blank wall, but the other will reveal a sexually stimulating image.  This test, as opposed to others which displayed less interesting images, deviated significantly enough to warrant suggesting precognition was in fact a possibility.  The effect of being rewarded with a sexually stimulating image was leaking back in time often enough to influence its cause, that of selecting a region on the computer screen.  Time itself is no obstacle when it comes to finding porn on a computer.</p><p>Exhibit B:  Mystery butter.</p><p>A Christian blogger who goes by the name of “cl”, in an ongoing attempt to provide ever stronger arguments in favor of theism at his blog, The Warfare Is Mental, offered up a personal story of his own as part of a series arguing favor of his tripartite model of conciousness, where he relays a story of a time when <a href=\"http://thewarfareismental.wordpress.com/2009/11/25/amp-2/\">he clearly remembered an even</a>t, right before it happened, apparently triggered due to the zen like state one enters when scooping up butter balls.</p><p>Exhibit C: Deja Vu.</p><p>A phenomenon so common as to have it’s own term.  A feeling of disorientation that comes from the sensation of experiencing the same event… twice, somehow.  If time was completely linear in all circumstances, then how is it that people can have two experiences of the same event bump into each other enough to disorient them.  While one explanation could be the processing delays in the brain that occur between a literal sensation  and the concious awareness of said event, such that at least two copies of the same sensory stimuli drift through the brain, this is, at best, idle speculation.</p><p>Exhibit D: Dreaming the future.</p><p>Another phenonmenon so common that I feel is safe enough to present as evidence without needing to cite a reference.  I even know someone personally who routinely dreams things that happen the next day.</p><p>Each exhibit presented here is evidenciary support to dissuade one from automatically accepting that either cause necessarily preceedes effect or that time is linear in the strict sense, upon which the cosmological argument and the necessity of gods rests.  Time is usually linear and cause almost always preceeds effect, but not necessarily, the universe seems to be trickier than that.</p><p> Second, the cosmological argument itself is an attempt to eliminate the problem of inifinite regress that suffers from inifinite regress.</p><p>Now, rather than thinking I’m resorting to the “Then what created God?  Ha, gotcha!” nonsense, it’s better to look at the original structure of the argument first put forth, since the summary version that most people are familiar with is vague enough to define God as an unstable particle.  God is more than just a source of energy, since the observation is that everything that has a direction was pushed that way, yet an immediately observable exception to this is the phenomenon of conscious intent as a source of motion.  A body, (literally, a human body) can be completely at rest, yet spurred to motion through conscious effort.  This led to the concusion that God, being defined as the unmoved mover, is by necessity a conscious entity who chose to create the universe, since thought itself is the most readily observable phenomenon that bridges the gap between the purely abstract and the material.  And the purest thought, then, would be thinking about thinking, the first act that led to the creation of the universe and needs no material source to give it a push.  This, however, does not alleviate the problem of infinite regression that was sought to be solved, as it only addresses infinite regress of particle motion.  This first thought, the one about thinking…  Thinking about what, more thinking?  Infinite regress.  Do not pass Go, do not collect $200.</p><p> Lastly, the statement “truth is stranger than fiction” itself is quite persuasive.</p><p>Building on my rejection of the cosmological argument, I’ll further contest that gods are not real simply because as an explanation, they are simply too convenient.  The truth of the matter, regardless of which great mystery being discussed, is reliably something far stranger than whichever fiction is first proposed.</p><p>The most obvious example of this was the painful transition from Newtonion physics to quantum physics.  Under the classical model, particles were particles and behaved like partcles, motion was consistent, and everything ran its course, and all the mindless matter in the universe was reliably deterministic.  A simple explanation that is based on precisely what one would expect of the world given nothing in our experience schizophrenically goes from acting like a particle to acting like a wave, or mysteriously teleports from one location to another.  A simple explanation that turned out to be quite wrong.</p><p>Or one could go back earlier to the transition from geocentric to heliocentric models of planetary motion.  The simple explanation, that of the earth being stationary with the sun rotating around it, turned out to be the fiction whereas the truth was far stranger, namely the planet we sit upon, that doesn’t feel like it’s moving at all, is in fact spinning around quite fast.</p><p>Recognition of an explanation as too simple, too convenient, or too obvious is useful as a predictive tool as well.  Healthy skepticism of the theory of evolution by natural selection can be arrived at by recognizing the explanation itself as an entirely self-contained and awfully neat little attempt at summarizing the history of life on this planet.  Personally I’d put money on the actual process being something far stranger involving phenomenon that we don’t even have words for yet and forces previously thought to have no impact on speciation whatsoever.</p><p>This being said, postulating the existence of supernature beings is abundantly obvious, to me at least, as being a convenient fantasy concocted as a childish and superficial explanation for the origins of any and everything, from the beginning of the universe to the strange bumping one hears in the attic.  It’s a fiction we’ve told ourselves for countless generations, and it is my firm belief that the actual truth of the matter, from why or how the universe began (or just always was) all the way down to experiences some people have communicating with the dead, is something far stranger than any story we tell ourselves about gods and ghosts.</p><p> <b>TO WHICH VOX REPLIES</b></p><p>I feel that I must begin by congratulating my opponent for not only producing a far more intriguing piece than I had reason to expect, but concocting one that I suspect makes my case for the existence of gods look downright sane by comparison.  If nothing else, Dominic has produced a genuinely original case for atheism.</p><p>I begin by correcting his assumption that gods must predate our universe or be capable of creating something out of nothing.  While at least one god must be assumed to be the creator god that fits this definition if the universe was indeed created, the vast majority of gods are not the creator and need not be capable of creating anything out of nothing, much less predate the universe.  I note that the greater part of the gods described in the historical record do not fit Dominic’s description here.  By the definition he assumes, neither Zeus nor Athena would qualify as gods, much less Baal, or Chemosh, or other gods known to have been worshipped in the course of human history.</p><p>The attack on the potential existence of the supernatural by denying cause and effect is certainly an unexpected one.  However, the assertion that the existence of the supernatural depends upon the axiom that cause precedes effect or that space-time is causal and linear is both incorrect and unsupported.  While there is plenty of reason to criticize both his self-evident assumptions and the refutations of those assumptions, it is not necessary to do either because his logic is flawed.  It does not matter if the self-evidence of his assumptions are correct or not, just as it does not matter if his subsequent case against those assumptions are sufficient to reject them or not, because he has failed to do more than nakedly assert a link between those assumptions and the existence of the supernatural, much less the existence of gods.</p><p>So, although I find them intriguing, I have nothing to say here about the existence or non-existence of precognition, mystery butter, deja vu, or dreaming the future, because none of them are relevant to this debate given the nonexistent logical link between those four things and the existence of gods.</p><p>With regards to the second point, the problem of infinite regress as it relates to consciousness rather than to particles, the problem was solved long ago by Aristotle in Posterior Analytics.  To summarize, the concept of infinite regress depends upon an assumption that there is no way of knowing other than by demonstration.  But not all knowledge is demonstrative, because knowledge of the immediate premises depends upon indemonstrable truths.  Thus there is no regress and the argument is defeated.  Furthermore, Dominic’s specific formulation contains two additional flaws.  First, even if we accept his definition of “the purest thought”, there is no rational requirement that the first thought need be the purest one, therefore that first thought need not be thinking about thinking, much less thinking about thinking about thinking.  Second, there is obviously no need for the first thought about thinking to concern more thinking, as is evidenced by Decartes’s famous statement, “I think, therefore I am”, because in the Decartesian formulation the first thinking about thinking does not concern more thinking, but rather the existence of mind.  The regress ends and the appeal to the problem of infinite regress is once more defeated.</p><p>As to the third point, I entirely agree that truth is stranger than fiction.  I also agree that turning to divine action to explain every unknown is too convenient to be convincing, (to say nothing of lazy), and I wholeheartedly concur that the true explanation for the existence of life on Earth will almost surely be far stranger than any of us presently imagine.</p><p>Nevertheless, convenience is not a serious argument against existence.  7-11 indubitably exists.  Starbucks seemingly exists on every corner.  Few things could possibly be considered more convenient than Internet porn, which is available 24-7 around the entire planet, and yet it too can be confirmed to exist.  Convenience is not convincing, but it should not be taken as negating either.  Ockham’s Razor is certainly not a proof, but it is a useful rule of thumb and parsimony is usually considered to be a scientific positive when the relative likelihood of two competing theories is being compared.</p><p>While I can hardly question what is or is not obvious to Dominic, I can certainly point out that “obviousness to Dominic” is not a objective metric that is relevant in any way to anyone else.  Had I argued that gods exist because their existence is obvious to me, I would have expected his rebuttal to consist of little more than pointing and laughing, because that is all that would have been needed to dismiss such a feeble appeal to personal sensibilities.  And since I have already shown that his rejection of the cosmological argument is based on a false foundation, it is obvious that his subsequent arguments are invalid to the extent that they rely upon it.</p><p>However, his cited examples from the history of science are important, because they underline a point that I made in my initial argument concerning the dynamic nature of the materialist consensus and the limits which technology places upon it.  With the continued advance of technology and the concomitant changes in Man’s future understanding of the universe that will come from that advance, it is entirely possible that a belief in the material limits of the universe which rejects the supernatural may well one day look as ignorant and crazy as a belief in Newtonian physics which rejects quantum physics.</p><p>Now, it is always possible that the strange bumping in the attic is nothing but the wind.  And it may be convenient to say that what we see and what we hear is seen and heard because it is actually there.  But most of the time, that simple explanation is true and our senses are observing things because those things are real.  The converse, on the other hand, is not necessarily true.  Sometimes we don’t see anything because they are not there.  But often, we don’t see anything because our eyes are closed.</p></div>",
  "content_text": "THE REASONS AND EVIDENCE THAT GODS PROBABLY DON’T EXIST\nFirst off, I see no need for a “first mover”.\nI’m assuming gods refer to one or more concious beings who predate our universe (at least one of whom being its creator), capable of creating something out of nothing with concious intent.  The being(s) necessitated by the cosmological argument (Plato, Aristotle, Aquinas…William Lane Craig, choose whichever version you like, they’re all basically the same) something I’m assuming all readers of this are familiar with, so no reason to summarize it.\nHowever, the existence of the supernatural is necessary only by taking it as axiomatically true that cause preceeds effect, and therefore space-time is causal and linear.\nThe majority of our experience confirms these assumptions as self-evidently true, from daily living down to events only quantum physics can describe, thus making the existence of at least one god absolutely necessary.  The problem I have with this though, is that there are other experiences which contradict these assumptions, and ironically enough are often relied upon as themselves proof of the supernatural which, from my perspective, they ultimately contradict.\nPrecognition (the artist formerly known as prophecy).\nExhibit A.  Daryl Bem.  (see\na paper recently published in the Journal of Personality and Social Psychology\n).  Technically, the jury is still out on his results, as more rigourous replication must take place first to verify the study. One such paper\nis found here\n)\nEssentially, Bem demonstrates that the future can affect the past by reversing the order of conventional psychology tests and seeing statistically significant results, the most amusing of which is the ability of subjects to find porn.  Subjects are sat down in front of a computer with two selectable regions, and are told to select one, where it is randomly selected by the computer for one of the regions to display a blank wall, but the other will reveal a sexually stimulating image.  This test, as opposed to others which displayed less interesting images, deviated significantly enough to warrant suggesting precognition was in fact a possibility.  The effect of being rewarded with a sexually stimulating image was leaking back in time often enough to influence its cause, that of selecting a region on the computer screen.  Time itself is no obstacle when it comes to finding porn on a computer.\nExhibit B:  Mystery butter.\nA Christian blogger who goes by the name of “cl”, in an ongoing attempt to provide ever stronger arguments in favor of theism at his blog, The Warfare Is Mental, offered up a personal story of his own as part of a series arguing favor of his tripartite model of conciousness, where he relays a story of a time when\nhe clearly remembered an even\nt, right before it happened, apparently triggered due to the zen like state one enters when scooping up butter balls.\nExhibit C: Deja Vu.\nA phenomenon so common as to have it’s own term.  A feeling of disorientation that comes from the sensation of experiencing the same event… twice, somehow.  If time was completely linear in all circumstances, then how is it that people can have two experiences of the same event bump into each other enough to disorient them.  While one explanation could be the processing delays in the brain that occur between a literal sensation  and the concious awareness of said event, such that at least two copies of the same sensory stimuli drift through the brain, this is, at best, idle speculation.\nExhibit D: Dreaming the future.\nAnother phenonmenon so common that I feel is safe enough to present as evidence without needing to cite a reference.  I even know someone personally who routinely dreams things that happen the next day.\nEach exhibit presented here is evidenciary support to dissuade one from automatically accepting that either cause necessarily preceedes effect or that time is linear in the strict sense, upon which the cosmological argument and the necessity of gods rests.  Time is usually linear and cause almost always preceeds effect, but not necessarily, the universe seems to be trickier than that.\nSecond, the cosmological argument itself is an attempt to eliminate the problem of inifinite regress that suffers from inifinite regress.\nNow, rather than thinking I’m resorting to the “Then what created God?  Ha, gotcha!” nonsense, it’s better to look at the original structure of the argument first put forth, since the summary version that most people are familiar with is vague enough to define God as an unstable particle.  God is more than just a source of energy, since the observation is that everything that has a direction was pushed that way, yet an immediately observable exception to this is the phenomenon of conscious intent as a source of motion.  A body, (literally, a human body) can be completely at rest, yet spurred to motion through conscious effort.  This led to the concusion that God, being defined as the unmoved mover, is by necessity a conscious entity who chose to create the universe, since thought itself is the most readily observable phenomenon that bridges the gap between the purely abstract and the material.  And the purest thought, then, would be thinking about thinking, the first act that led to the creation of the universe and needs no material source to give it a push.  This, however, does not alleviate the problem of infinite regression that was sought to be solved, as it only addresses infinite regress of particle motion.  This first thought, the one about thinking…  Thinking about what, more thinking?  Infinite regress.  Do not pass Go, do not collect $200.\nLastly, the statement “truth is stranger than fiction” itself is quite persuasive.\nBuilding on my rejection of the cosmological argument, I’ll further contest that gods are not real simply because as an explanation, they are simply too convenient.  The truth of the matter, regardless of which great mystery being discussed, is reliably something far stranger than whichever fiction is first proposed.\nThe most obvious example of this was the painful transition from Newtonion physics to quantum physics.  Under the classical model, particles were particles and behaved like partcles, motion was consistent, and everything ran its course, and all the mindless matter in the universe was reliably deterministic.  A simple explanation that is based on precisely what one would expect of the world given nothing in our experience schizophrenically goes from acting like a particle to acting like a wave, or mysteriously teleports from one location to another.  A simple explanation that turned out to be quite wrong.\nOr one could go back earlier to the transition from geocentric to heliocentric models of planetary motion.  The simple explanation, that of the earth being stationary with the sun rotating around it, turned out to be the fiction whereas the truth was far stranger, namely the planet we sit upon, that doesn’t feel like it’s moving at all, is in fact spinning around quite fast.\nRecognition of an explanation as too simple, too convenient, or too obvious is useful as a predictive tool as well.  Healthy skepticism of the theory of evolution by natural selection can be arrived at by recognizing the explanation itself as an entirely self-contained and awfully neat little attempt at summarizing the history of life on this planet.  Personally I’d put money on the actual process being something far stranger involving phenomenon that we don’t even have words for yet and forces previously thought to have no impact on speciation whatsoever.\nThis being said, postulating the existence of supernature beings is abundantly obvious, to me at least, as being a convenient fantasy concocted as a childish and superficial explanation for the origins of any and everything, from the beginning of the universe to the strange bumping one hears in the attic.  It’s a fiction we’ve told ourselves for countless generations, and it is my firm belief that the actual truth of the matter, from why or how the universe began (or just always was) all the way down to experiences some people have communicating with the dead, is something far stranger than any story we tell ourselves about gods and ghosts.\nTO WHICH VOX REPLIES\nI feel that I must begin by congratulating my opponent for not only producing a far more intriguing piece than I had reason to expect, but concocting one that I suspect makes my case for the existence of gods look downright sane by comparison.  If nothing else, Dominic has produced a genuinely original case for atheism.\nI begin by correcting his assumption that gods must predate our universe or be capable of creating something out of nothing.  While at least one god must be assumed to be the creator god that fits this definition if the universe was indeed created, the vast majority of gods are not the creator and need not be capable of creating anything out of nothing, much less predate the universe.  I note that the greater part of the gods described in the historical record do not fit Dominic’s description here.  By the definition he assumes, neither Zeus nor Athena would qualify as gods, much less Baal, or Chemosh, or other gods known to have been worshipped in the course of human history.\nThe attack on the potential existence of the supernatural by denying cause and effect is certainly an unexpected one.  However, the assertion that the existence of the supernatural depends upon the axiom that cause precedes effect or that space-time is causal and linear is both incorrect and unsupported.  While there is plenty of reason to criticize both his self-evident assumptions and the refutations of those assumptions, it is not necessary to do either because his logic is flawed.  It does not matter if the self-evidence of his assumptions are correct or not, just as it does not matter if his subsequent case against those assumptions are sufficient to reject them or not, because he has failed to do more than nakedly assert a link between those assumptions and the existence of the supernatural, much less the existence of gods.\nSo, although I find them intriguing, I have nothing to say here about the existence or non-existence of precognition, mystery butter, deja vu, or dreaming the future, because none of them are relevant to this debate given the nonexistent logical link between those four things and the existence of gods.\nWith regards to the second point, the problem of infinite regress as it relates to consciousness rather than to particles, the problem was solved long ago by Aristotle in Posterior Analytics.  To summarize, the concept of infinite regress depends upon an assumption that there is no way of knowing other than by demonstration.  But not all knowledge is demonstrative, because knowledge of the immediate premises depends upon indemonstrable truths.  Thus there is no regress and the argument is defeated.  Furthermore, Dominic’s specific formulation contains two additional flaws.  First, even if we accept his definition of “the purest thought”, there is no rational requirement that the first thought need be the purest one, therefore that first thought need not be thinking about thinking, much less thinking about thinking about thinking.  Second, there is obviously no need for the first thought about thinking to concern more thinking, as is evidenced by Decartes’s famous statement, “I think, therefore I am”, because in the Decartesian formulation the first thinking about thinking does not concern more thinking, but rather the existence of mind.  The regress ends and the appeal to the problem of infinite regress is once more defeated.\nAs to the third point, I entirely agree that truth is stranger than fiction.  I also agree that turning to divine action to explain every unknown is too convenient to be convincing, (to say nothing of lazy), and I wholeheartedly concur that the true explanation for the existence of life on Earth will almost surely be far stranger than any of us presently imagine.\nNevertheless, convenience is not a serious argument against existence.  7-11 indubitably exists.  Starbucks seemingly exists on every corner.  Few things could possibly be considered more convenient than Internet porn, which is available 24-7 around the entire planet, and yet it too can be confirmed to exist.  Convenience is not convincing, but it should not be taken as negating either.  Ockham’s Razor is certainly not a proof, but it is a useful rule of thumb and parsimony is usually considered to be a scientific positive when the relative likelihood of two competing theories is being compared.\nWhile I can hardly question what is or is not obvious to Dominic, I can certainly point out that “obviousness to Dominic” is not a objective metric that is relevant in any way to anyone else.  Had I argued that gods exist because their existence is obvious to me, I would have expected his rebuttal to consist of little more than pointing and laughing, because that is all that would have been needed to dismiss such a feeble appeal to personal sensibilities.  And since I have already shown that his rejection of the cosmological argument is based on a false foundation, it is obvious that his subsequent arguments are invalid to the extent that they rely upon it.\nHowever, his cited examples from the history of science are important, because they underline a point that I made in my initial argument concerning the dynamic nature of the materialist consensus and the limits which technology places upon it.  With the continued advance of technology and the concomitant changes in Man’s future understanding of the universe that will come from that advance, it is entirely possible that a belief in the material limits of the universe which rejects the supernatural may well one day look as ignorant and crazy as a belief in Newtonian physics which rejects quantum physics.\nNow, it is always possible that the strange bumping in the attic is nothing but the wind.  And it may be convenient to say that what we see and what we hear is seen and heard because it is actually there.  But most of the time, that simple explanation is true and our senses are observing things because those things are real.  The converse, on the other hand, is not necessarily true.  Sometimes we don’t see anything because they are not there.  But often, we don’t see anything because our eyes are closed.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-12T16:00:00+00:00"
}