{
  "url": "https://voxday.net/2011/09/11/review-of-anathem-by-neal-stephenson/",
  "scraped_at": "2025-12-13T23:21:26.350416",
  "title": "Review ofAnathemby Neal Stephenson",
  "date_display": "September 11, 2011",
  "date_iso": "2011-09-11T14:07:00+00:00",
  "date_from_url": "2011-09-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is really not correct to describe <em>Anathem </em>as science fiction.  It is actually science fantasy in its purest form, a fantasy about science that blatantly panders to almost every cherished assumption, heartfelt belief, and wishful desire possessed by those who make a literal fetish of science.  In <em>Anathem</em>, Stephenson presents a world in which Science and Philosophy dwell apart from the rest of the world, secure in elite monkish conclaves and protected, for the most part, from the vile and vulgar mysteries of the common herd who occupy themselves with such distasteful pastimes such as sports, television, politics, and religion.  The scientific elite and the rest of the world have essentially realized that their relationship is no longer symbiotic, but have managed to arrange for a reasonably amicable breakup in which the science-monks get the nuclear power plants and the unwanted smart kids in return for leaving the rest of the world free to go its own way and life life without finger-waving lectures from the science monks about how illogical their behavior is, or more importantly, living with the risk of the science monks blowing up the entire world at the behest of the Saecular Power.</p><p>Read the rest at <a href=\"http://www.blackgate.com/2011/09/11/review-of-neal-stephensons-anathem/\">the Black Gate</a>.</p></div>",
  "content_text": "It is really not correct to describe\nAnathem\nas science fiction.  It is actually science fantasy in its purest form, a fantasy about science that blatantly panders to almost every cherished assumption, heartfelt belief, and wishful desire possessed by those who make a literal fetish of science.  In\nAnathem\n, Stephenson presents a world in which Science and Philosophy dwell apart from the rest of the world, secure in elite monkish conclaves and protected, for the most part, from the vile and vulgar mysteries of the common herd who occupy themselves with such distasteful pastimes such as sports, television, politics, and religion.  The scientific elite and the rest of the world have essentially realized that their relationship is no longer symbiotic, but have managed to arrange for a reasonably amicable breakup in which the science-monks get the nuclear power plants and the unwanted smart kids in return for leaving the rest of the world free to go its own way and life life without finger-waving lectures from the science monks about how illogical their behavior is, or more importantly, living with the risk of the science monks blowing up the entire world at the behest of the Saecular Power.\nRead the rest at\nthe Black Gate\n.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-11T13:07:00+00:00"
}