{
  "url": "https://voxday.net/2011/09/25/review-kobo-ereader-touc/",
  "scraped_at": "2025-12-13T23:22:56.254102",
  "title": "Review: Kobo eReader Touch",
  "date_display": "September 25, 2011",
  "date_iso": "2011-09-25T16:44:00+00:00",
  "date_from_url": "2011-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may be going a bit far afield, but since most <strike>Black Gate</strike>Vox Popoli readers are, well, readers, I suspect it will be of interest to many here.  While I am a big advocate of eReaders and digital books, I have avoided eReading devices in the past because they haven’t offered any significant upgrade over reading on my smartphone, at least not without imposing significant costs.  I started with reading .pdb books on various Palm Treos, then enjoyed a significant graphical upgrade to reading .epub books on an Android phone.  This works quite well and I still do the vast majority of my reading that way since whether I am out and about or at home, my phone is always handy.  And, since it emits light, it permits reading in the dark, which is an advantage for anyone who customarily goes to sleep later than the bed’s other occupant.</p><p>Read the rest at <a href=\"http://www.blackgate.com/2011/09/25/review-kobo-ereader-touch/\">the Black Gate</a>.</p></div>",
  "content_text": "This may be going a bit far afield, but since most\nBlack Gate\nVox Popoli readers are, well, readers, I suspect it will be of interest to many here.  While I am a big advocate of eReaders and digital books, I have avoided eReading devices in the past because they haven’t offered any significant upgrade over reading on my smartphone, at least not without imposing significant costs.  I started with reading .pdb books on various Palm Treos, then enjoyed a significant graphical upgrade to reading .epub books on an Android phone.  This works quite well and I still do the vast majority of my reading that way since whether I am out and about or at home, my phone is always handy.  And, since it emits light, it permits reading in the dark, which is an advantage for anyone who customarily goes to sleep later than the bed’s other occupant.\nRead the rest at\nthe Black Gate\n.",
  "tags": [
    "Black Gate",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-25T15:44:00+00:00"
}