{
  "url": "https://voxday.net/2011/09/21/those-who-dont-know-history/",
  "scraped_at": "2025-12-13T23:22:28.048824",
  "title": "Those who don’t know history",
  "date_display": "September 21, 2011",
  "date_iso": "2011-09-21T18:13:00+00:00",
  "date_from_url": "2011-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the most startling things about reading Rothbard’s <i>An Austrian Perspective on the History of Economic Thought</i> is how old many of the issues presently being discussed today are.  Consider the following passage in light of the FOMC meeting today:</p><blockquote><p>Josiah Child’s pamphlet and his testimony before Parliament were centrepieces of the debate swirling around the proposal. Child’s critics pointed out effectively that low interest in a country is the effect of plentiful savings and of prosperity, and not their cause. Thus, Edward Waller, during the House of Commons debate, pointed out that ‘it is with money as it is with other commodities, when they are most plentiful then they are cheapest, so make money [savings] plentiful and the interest will be low’. Colonel Silius Titus pressed on to demonstrate that, since low interest is the consequence and not the cause of wealth, any maximum usury law would be counterproductive: for by outlawing currently legal loans, ‘its effect would be to make usurers call in their loans. Traders would be ruined, and mortgages foreclosed; gentlemen who needed to borrow would be forced to break the law….’</p><p>Child feebly replied to his critics that usurers would never not lend their money, that they were forced to take the legal maximum or lump it. On the idea that low interest was an effect not a cause, Child merely recited the previous times that English government had forced interest lower, from 10 to 8 to 6 per cent. Why not then a step further? Child, of course, did not deign to take the scenario further and ask why the state did not have the power to force the interest rate down to zero.</p></blockquote><p>Notice that these critics of artificially low interest rates already knew in 1668 what Ben Bernanke and the Federal Reserve still deny today.  Force interest rates too low and the result will not be an increase in loans and subsequent business activity, but a rather reduction in the number of loans, decreasing business activity, and even <i>an increase in the number of mortgage foreclosures</i>.</p><p>It’s hardly possible to claim that the outcome was unforeseeable, much less some sort of black swan, when it was foreseen 342 years ago, more than 100 years before Adam Smith published <i>The Wealth of Nations</i>.  I cannot recommend APHET enough.  It is the absolute gold standard of economic history and I have been astonished how many of the core concepts I was taught were developed decades after Adam Smith actually preceded the man by <i>centuries</i>.  And I finally understand why Schumpeter thought rather more highly of Turgot than Smith in his excellent <i>History of Economic Analysis</i>.  I haven’t finished APHET yet, but I have already learned more economic history from this monumental two-volume work than I did from the works of Friedman, Schumpeter, and Hayek combined.</p><p>In related news, the Federal Reserve announced the following: <i>“The Committee also decided to keep the target range for the federal funds rate at 0 to 1/4 percent and currently anticipates that economic conditions–including low rates of resource utilization and a subdued outlook for inflation over the medium run–are likely to warrant exceptionally low levels for the federal funds rate at least through mid-2013.”</i></p><p>And by “exceptionally low”, they actually mean “artificially low”, you understand.  It seems relevant to cite the way Rothbard noted that the anticipated bankruptcies and mortgage foreclosures weren’t the only expected result from the forced lowering of the interest rate.</p><blockquote><p>Even more revealing was Child’s reply to the charge of the author of <i>Interest of Money Mistaken</i> that Child was trying to ‘engross all trade into the hands of a few rich merchants who have money enough of their own to trade with, to the excluding of all young men that want it’. Child replied to that shrewd thrust that, on the contrary, his East India Company was not in need of a low rate since it could borrow as much money as it pleased at 4 per cent. But that of course is precisely the point. Sir Josiah Child and his ilk were eager to push down the rate of interest below the free market level in order to create a shortage of credit, and thereby to ration credit to the prime borrowers – to large firms who could afford to pay 4 per cent or less and away from more speculative borrowers. It was precisely because Child knew full well that a forced lowering of interest rates would indeed ‘engross all trade into the hands of a few rich merchants’ that Child and his colleagues were so eager to put this mercantilist measure into effect.</p></blockquote><p>Translation: if you’re concerned about growing income inequality, then you should support higher interest rates, not rates that the central bank has artificially forced down to zero.</p></div>",
  "content_text": "One of the most startling things about reading Rothbard’s\nAn Austrian Perspective on the History of Economic Thought\nis how old many of the issues presently being discussed today are.  Consider the following passage in light of the FOMC meeting today:\nJosiah Child’s pamphlet and his testimony before Parliament were centrepieces of the debate swirling around the proposal. Child’s critics pointed out effectively that low interest in a country is the effect of plentiful savings and of prosperity, and not their cause. Thus, Edward Waller, during the House of Commons debate, pointed out that ‘it is with money as it is with other commodities, when they are most plentiful then they are cheapest, so make money [savings] plentiful and the interest will be low’. Colonel Silius Titus pressed on to demonstrate that, since low interest is the consequence and not the cause of wealth, any maximum usury law would be counterproductive: for by outlawing currently legal loans, ‘its effect would be to make usurers call in their loans. Traders would be ruined, and mortgages foreclosed; gentlemen who needed to borrow would be forced to break the law….’\nChild feebly replied to his critics that usurers would never not lend their money, that they were forced to take the legal maximum or lump it. On the idea that low interest was an effect not a cause, Child merely recited the previous times that English government had forced interest lower, from 10 to 8 to 6 per cent. Why not then a step further? Child, of course, did not deign to take the scenario further and ask why the state did not have the power to force the interest rate down to zero.\nNotice that these critics of artificially low interest rates already knew in 1668 what Ben Bernanke and the Federal Reserve still deny today.  Force interest rates too low and the result will not be an increase in loans and subsequent business activity, but a rather reduction in the number of loans, decreasing business activity, and even\nan increase in the number of mortgage foreclosures\n.\nIt’s hardly possible to claim that the outcome was unforeseeable, much less some sort of black swan, when it was foreseen 342 years ago, more than 100 years before Adam Smith published\nThe Wealth of Nations\n.  I cannot recommend APHET enough.  It is the absolute gold standard of economic history and I have been astonished how many of the core concepts I was taught were developed decades after Adam Smith actually preceded the man by\ncenturies\n.  And I finally understand why Schumpeter thought rather more highly of Turgot than Smith in his excellent\nHistory of Economic Analysis\n.  I haven’t finished APHET yet, but I have already learned more economic history from this monumental two-volume work than I did from the works of Friedman, Schumpeter, and Hayek combined.\nIn related news, the Federal Reserve announced the following:\n“The Committee also decided to keep the target range for the federal funds rate at 0 to 1/4 percent and currently anticipates that economic conditions–including low rates of resource utilization and a subdued outlook for inflation over the medium run–are likely to warrant exceptionally low levels for the federal funds rate at least through mid-2013.”\nAnd by “exceptionally low”, they actually mean “artificially low”, you understand.  It seems relevant to cite the way Rothbard noted that the anticipated bankruptcies and mortgage foreclosures weren’t the only expected result from the forced lowering of the interest rate.\nEven more revealing was Child’s reply to the charge of the author of\nInterest of Money Mistaken\nthat Child was trying to ‘engross all trade into the hands of a few rich merchants who have money enough of their own to trade with, to the excluding of all young men that want it’. Child replied to that shrewd thrust that, on the contrary, his East India Company was not in need of a low rate since it could borrow as much money as it pleased at 4 per cent. But that of course is precisely the point. Sir Josiah Child and his ilk were eager to push down the rate of interest below the free market level in order to create a shortage of credit, and thereby to ration credit to the prime borrowers – to large firms who could afford to pay 4 per cent or less and away from more speculative borrowers. It was precisely because Child knew full well that a forced lowering of interest rates would indeed ‘engross all trade into the hands of a few rich merchants’ that Child and his colleagues were so eager to put this mercantilist measure into effect.\nTranslation: if you’re concerned about growing income inequality, then you should support higher interest rates, not rates that the central bank has artificially forced down to zero.",
  "tags": [
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-21T17:13:00+00:00"
}