{
  "url": "https://voxday.net/2011/09/27/tia-it-is-science/",
  "scraped_at": "2025-12-13T23:23:05.407867",
  "title": "TIA: it is science",
  "date_display": "September 27, 2011",
  "date_iso": "2011-09-27T13:00:00+00:00",
  "date_from_url": "2011-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, you can all stop sending this to me now.  Look, I don’t think anyone should have been terribly shocked by news of <a href=\"http://www.dailymail.co.uk/sciencetech/article-2039690/Atheism-autism-Controversial-new-study-points-link-two.html\">the scientific link between atheism and autism</a> which supports <a href=\"http://www.milobookclub.com/2007/08/02/socially-autistic-atheis/\">my original hypothesis</a> from four years ago:</p><blockquote><p>People with ‘mild’ forms of autism are more likely to be atheists, according to a controversial new study – and more likely to shun organised religion in general.  The study, which looked at posts on autism forums, focused on people with high-functioning autism such as Asperger’s.  The study, from University of Boston, speculates that common autistic spectrum behaviours such as ‘a preference for logical beliefs’ and a distrust of metaphor and figures of speech, could be responsible.</p></blockquote><p>The amusing thing about the vehement reaction by many atheists to my description of their observable tendency towards socially autistic behavior is that it was not only based on my personal observations over the years, but also by the Asperger’s Quotient results <i>proudly</i> reported by dozens of the Internet’s most militant atheists.  But the link should have always been obvious because it is logically inevitable.  Even if one believes that a god is nothing but a social construct, it should not be hard to grasp that a degree of social dysfunction would tend to inhibit one’s understanding of those constructs.</p><p>Now, obviously god-blindness will take a variety of forms, just as color-blindness does.  My belated discovery of my own very mild color-blindness has, in some ways, helped me understand what Brent Rasmussen once described as a missing sense more than my longtime agnosticism ever did.  You can explain it to me all you like, you can walk me slowly and patiently through all the lines on the image, but I am still not going to see it.  Even if I trust that it is there, I simply cannot see it and no amount of desire allows me to detect it.  It is perhaps worth recalling that just as my color-blindness is totally undetectable by others whereas the total or red-green versions are readily observable to anyone paying attention to the individual’s behavior, god-blindness is not going to automatically translate into full blown New Atheist social autism.</p><p>What is slightly misleading about the article’s description of these socially autistic individuals is that what is described as a “preference for logical beliefs” should actually be phrased as a “preference for beliefs that appear to be logical”.  For, as we have repeatedly seen, socially dysfunctional atheists tend to be extraordinarily illogical, to such an extent that they will deny the existence of straightforward dictionary definitions in use for hundreds of years in order to cling to their pseudo-logic.</p><p>It’s not so much logic as static rules that appeal to them.  Where the cognitive deficiency is revealed is in their inability to understand that the decision tree they have adopted with quasi-religious fervor is insufficiently dynamic.  I suspect it is somehow related to their concomitant emotional immaturity, as I see a similar problem with static decision trees all the time in children’s soccer.</p><p>For example, you might tell a young defender to closely mark #12 because he is the most dangerous striker on the other team.  Then you will watch in disbelief as that defender obediently stays wide and out of the play at #12’s side instead of moving into the center and attacking the other striker  who has the ball and is heading for a shot on goal.  What the young defender doesn’t understand that the order to mark the one player is a <i>conditional</i> one and that the order should no longer be considered in effect once a greater danger to the goal presents itself.  So, it’s necessary to keep building more and more complex decision trees as the player develops until the light bulb goes off, the logical bases underlying all the various trees are finally understood, and the defender can begin thinking and analyzing the situations for himself rather than simply attempting to identify which branch of the decision tree applies to the present situation.</p><p>An inability or dislike for processing dynamic if-then situations has nothing to do with logic per se, it is simply a need for clear-cut rules that remove any necessity for active thinking.  To the socially autistic, both “Science” and “Reason” are perceived as The Legitimate Rulegivers and they represent far more than the simple tools they are to the neurotypical.  Of course, it is more than a little ironic that those who claim to be freethinkers and paragons of logic are actually exhibiting illogical behavior that is fundamentally based on an aversion to thinking.</p></div>",
  "content_text": "Okay, you can all stop sending this to me now.  Look, I don’t think anyone should have been terribly shocked by news of\nthe scientific link between atheism and autism\nwhich supports\nmy original hypothesis\nfrom four years ago:\nPeople with ‘mild’ forms of autism are more likely to be atheists, according to a controversial new study – and more likely to shun organised religion in general.  The study, which looked at posts on autism forums, focused on people with high-functioning autism such as Asperger’s.  The study, from University of Boston, speculates that common autistic spectrum behaviours such as ‘a preference for logical beliefs’ and a distrust of metaphor and figures of speech, could be responsible.\nThe amusing thing about the vehement reaction by many atheists to my description of their observable tendency towards socially autistic behavior is that it was not only based on my personal observations over the years, but also by the Asperger’s Quotient results\nproudly\nreported by dozens of the Internet’s most militant atheists.  But the link should have always been obvious because it is logically inevitable.  Even if one believes that a god is nothing but a social construct, it should not be hard to grasp that a degree of social dysfunction would tend to inhibit one’s understanding of those constructs.\nNow, obviously god-blindness will take a variety of forms, just as color-blindness does.  My belated discovery of my own very mild color-blindness has, in some ways, helped me understand what Brent Rasmussen once described as a missing sense more than my longtime agnosticism ever did.  You can explain it to me all you like, you can walk me slowly and patiently through all the lines on the image, but I am still not going to see it.  Even if I trust that it is there, I simply cannot see it and no amount of desire allows me to detect it.  It is perhaps worth recalling that just as my color-blindness is totally undetectable by others whereas the total or red-green versions are readily observable to anyone paying attention to the individual’s behavior, god-blindness is not going to automatically translate into full blown New Atheist social autism.\nWhat is slightly misleading about the article’s description of these socially autistic individuals is that what is described as a “preference for logical beliefs” should actually be phrased as a “preference for beliefs that appear to be logical”.  For, as we have repeatedly seen, socially dysfunctional atheists tend to be extraordinarily illogical, to such an extent that they will deny the existence of straightforward dictionary definitions in use for hundreds of years in order to cling to their pseudo-logic.\nIt’s not so much logic as static rules that appeal to them.  Where the cognitive deficiency is revealed is in their inability to understand that the decision tree they have adopted with quasi-religious fervor is insufficiently dynamic.  I suspect it is somehow related to their concomitant emotional immaturity, as I see a similar problem with static decision trees all the time in children’s soccer.\nFor example, you might tell a young defender to closely mark #12 because he is the most dangerous striker on the other team.  Then you will watch in disbelief as that defender obediently stays wide and out of the play at #12’s side instead of moving into the center and attacking the other striker  who has the ball and is heading for a shot on goal.  What the young defender doesn’t understand that the order to mark the one player is a\nconditional\none and that the order should no longer be considered in effect once a greater danger to the goal presents itself.  So, it’s necessary to keep building more and more complex decision trees as the player develops until the light bulb goes off, the logical bases underlying all the various trees are finally understood, and the defender can begin thinking and analyzing the situations for himself rather than simply attempting to identify which branch of the decision tree applies to the present situation.\nAn inability or dislike for processing dynamic if-then situations has nothing to do with logic per se, it is simply a need for clear-cut rules that remove any necessity for active thinking.  To the socially autistic, both “Science” and “Reason” are perceived as The Legitimate Rulegivers and they represent far more than the simple tools they are to the neurotypical.  Of course, it is more than a little ironic that those who claim to be freethinkers and paragons of logic are actually exhibiting illogical behavior that is fundamentally based on an aversion to thinking.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-27T12:00:00+00:00"
}