{
  "url": "https://voxday.net/2011/09/18/umberto-eco-on-canine-intelligence/",
  "scraped_at": "2025-12-13T23:22:05.731699",
  "title": "Umberto Eco on canine intelligence",
  "date_display": "September 18, 2011",
  "date_iso": "2011-09-18T09:40:00+00:00",
  "date_from_url": "2011-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><a href=\"http://espresso.repubblica.it/dettaglio/ma-i-cani-parlano-o-no/2159595/18\"><b>But do dogs speak or not?</b></a></p><p>A lady, who went mushroom-gathering with a friend, was stung by a wasp and went into anaphylactic shock.  She stopped breathing and her friend telephoned the paramedics, but the arrival of the paramedics was delayed because the two women were in a very thick forest and it was hard to find them.  However, Queen, the friend’s dog, (but I imagine it must have been a female dog)1, instead of staying there licking the hand of the stricken as instinct would have commanded, ran through the forest, found the paramedics, and guided them to the right place.</p><p>As Danilo Mainardi commented in the <i>Corriere Della Sera</i> last August 21st, we are not seeing a simple instinctive behavior here, we are seeing an “intelligent” behavior in which the dog does not respond to the command of the instinct, (to stay near the injured), but elaborates “a complex plan which also comprehends the involvement of other individuals”.</p><p>The case, and the comments by Mainardi, recall to mind the vast literature of antiquity on the capacity for reason on the part of dogs.  One of the texts that had great influence in the past is the <i>Naturalis Historia</i> of Pliny the Elder, who is occupied with the voices of fishes and birds, but also delved amply into canine intelligence; he cites a dog that recognized in the crowd the killer of his master, and by snapping and snarling at him, forced him to confess his crime.  He also relates the story of the dog of a man condemned to death that howled mournfully over him, and when a spectator gave the dog some food, tried to put it in the mouth of the dead man.  When the body was finally thrown in the Tiber, the dog jumped in and swam in an attempt to rescue its master.</p><p>But the more interesting philosophical discussion was already developed in three centuries of debate between Stoics, Academics, and Epicureans.  Within the circuit of the Stoic discussions appears an argument attributed to Chrysippus of Soli, that was actually reprised and popularized about five centuries later by Sextus Empiricus.  Sextus judged that the dog had the capacity for logical reason, showing how a dog that arrived at an intersection of three paths, and recognized by the odor that the prey had not taken two of the paths, immediately ran down the third without needing to sniff it.  In effect, the dog had shown this mode of reason: “The prey has taken this way or that, or the other, now it is not this way or that, and therefore it is the other.”  That would be an example of a reasoning called the Fifth Indemonstrable.</p><p>Sextus further recorded that a dog possessed a “logos” because it knew to remove the slivers and clean the paws, hold the injured limb immobile, and distinguish the herbs that possessed the ability to ease its suffering.  As to an animal language, it is true that we don’t comprehend the voices of the animals, but we also don’t comprehend the voices of the barbarians even though we know they speak.  And dogs certainly emit diverse vocalizations in diverse situations.</p><p>We can continue by citing the <i>De Sollertia Animalium</i> of Plutarch, where he said that while it is certain the rationality of animals is imperfect with respect to that of Man, this difference also applies between human beings.  In another dialogue, <i>Bruta Animalia Ratione Uti</i>, to one who forcefully objected to attributing reason to beings that possessed no innate notion of the divine, Plutarch responded by recalling that there are also atheists among human beings.</p><p>In the <i>On the Nature of the Animals</i> of Claudio Eliano, other arguments are already seen; he cites dogs that are in love with human beings.  In the <i>De Abstinentia </i>of Porfirio, the arguments in favor of the intelligence of animals serve to sustain a vegetarian thesis.  All of these themes have been variously reprised in the modern era and until our days.</p><p>But let us stop here: if we cannot succeed in successfully defining the canine intelligence, we must  be more sensible about this mystery.  If it isn’t enough to cause us to become vegetarians, at least the less intelligent dog owners among us will not abandon their dogs on the highway.</p></blockquote><p>As always with these translations, please recall that I am sub-fluent in Italian, particularly Eco’s notoriously complex brand of it.  As an aside, I find it interesting to contemplate how reason has been turned on its head since Plutarch’s day.  From assuming that an innate sense of the divine is required for a being to possess reason, there are now individuals such as Sam Harris who assume that an innate sense of the divine somehow equates to evidence of a lack of reason.  I trust that by the time it ends, the ongoing Memorial Debate will suffice to demonstrate the false nature of the Harrisian assumption.</p><p>As for the matter of canine intelligence, having owned a Viszla for 15 years, I can testify that while dogs do possess the capacity for reason, they don’t have a lot of it.  The larger part of it appears to go towards rationalizing why they should be able to steal food from places they know perfectly well is not permitted.  But despite these limitations, it goes without saying that anyone who intentionally abandons a dog should be excommunicated, flayed, rolled in salt, and burned.</p><p>If human affections were only half as reliable as the canine, the world would be a much better place.</p><p><i>(1) this clarification stems from the use of grammatical gender in Italian.  “Il cane” is the generic term and suggests “the male dog”, but Eco imagines that the name Queen tends to indicate “la cagna”, or “the bitch”.</i></p></div>",
  "content_text": "But do dogs speak or not?\nA lady, who went mushroom-gathering with a friend, was stung by a wasp and went into anaphylactic shock.  She stopped breathing and her friend telephoned the paramedics, but the arrival of the paramedics was delayed because the two women were in a very thick forest and it was hard to find them.  However, Queen, the friend’s dog, (but I imagine it must have been a female dog)1, instead of staying there licking the hand of the stricken as instinct would have commanded, ran through the forest, found the paramedics, and guided them to the right place.\nAs Danilo Mainardi commented in the\nCorriere Della Sera\nlast August 21st, we are not seeing a simple instinctive behavior here, we are seeing an “intelligent” behavior in which the dog does not respond to the command of the instinct, (to stay near the injured), but elaborates “a complex plan which also comprehends the involvement of other individuals”.\nThe case, and the comments by Mainardi, recall to mind the vast literature of antiquity on the capacity for reason on the part of dogs.  One of the texts that had great influence in the past is the\nNaturalis Historia\nof Pliny the Elder, who is occupied with the voices of fishes and birds, but also delved amply into canine intelligence; he cites a dog that recognized in the crowd the killer of his master, and by snapping and snarling at him, forced him to confess his crime.  He also relates the story of the dog of a man condemned to death that howled mournfully over him, and when a spectator gave the dog some food, tried to put it in the mouth of the dead man.  When the body was finally thrown in the Tiber, the dog jumped in and swam in an attempt to rescue its master.\nBut the more interesting philosophical discussion was already developed in three centuries of debate between Stoics, Academics, and Epicureans.  Within the circuit of the Stoic discussions appears an argument attributed to Chrysippus of Soli, that was actually reprised and popularized about five centuries later by Sextus Empiricus.  Sextus judged that the dog had the capacity for logical reason, showing how a dog that arrived at an intersection of three paths, and recognized by the odor that the prey had not taken two of the paths, immediately ran down the third without needing to sniff it.  In effect, the dog had shown this mode of reason: “The prey has taken this way or that, or the other, now it is not this way or that, and therefore it is the other.”  That would be an example of a reasoning called the Fifth Indemonstrable.\nSextus further recorded that a dog possessed a “logos” because it knew to remove the slivers and clean the paws, hold the injured limb immobile, and distinguish the herbs that possessed the ability to ease its suffering.  As to an animal language, it is true that we don’t comprehend the voices of the animals, but we also don’t comprehend the voices of the barbarians even though we know they speak.  And dogs certainly emit diverse vocalizations in diverse situations.\nWe can continue by citing the\nDe Sollertia Animalium\nof Plutarch, where he said that while it is certain the rationality of animals is imperfect with respect to that of Man, this difference also applies between human beings.  In another dialogue,\nBruta Animalia Ratione Uti\n, to one who forcefully objected to attributing reason to beings that possessed no innate notion of the divine, Plutarch responded by recalling that there are also atheists among human beings.\nIn the\nOn the Nature of the Animals\nof Claudio Eliano, other arguments are already seen; he cites dogs that are in love with human beings.  In the\nDe Abstinentia\nof Porfirio, the arguments in favor of the intelligence of animals serve to sustain a vegetarian thesis.  All of these themes have been variously reprised in the modern era and until our days.\nBut let us stop here: if we cannot succeed in successfully defining the canine intelligence, we must  be more sensible about this mystery.  If it isn’t enough to cause us to become vegetarians, at least the less intelligent dog owners among us will not abandon their dogs on the highway.\nAs always with these translations, please recall that I am sub-fluent in Italian, particularly Eco’s notoriously complex brand of it.  As an aside, I find it interesting to contemplate how reason has been turned on its head since Plutarch’s day.  From assuming that an innate sense of the divine is required for a being to possess reason, there are now individuals such as Sam Harris who assume that an innate sense of the divine somehow equates to evidence of a lack of reason.  I trust that by the time it ends, the ongoing Memorial Debate will suffice to demonstrate the false nature of the Harrisian assumption.\nAs for the matter of canine intelligence, having owned a Viszla for 15 years, I can testify that while dogs do possess the capacity for reason, they don’t have a lot of it.  The larger part of it appears to go towards rationalizing why they should be able to steal food from places they know perfectly well is not permitted.  But despite these limitations, it goes without saying that anyone who intentionally abandons a dog should be excommunicated, flayed, rolled in salt, and burned.\nIf human affections were only half as reliable as the canine, the world would be a much better place.\n(1) this clarification stems from the use of grammatical gender in Italian.  “Il cane” is the generic term and suggests “the male dog”, but Eco imagines that the name Queen tends to indicate “la cagna”, or “the bitch”.",
  "tags": [
    "Eco"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-18T08:40:00+00:00"
}