{
  "url": "https://voxday.net/2011/09/05/wnd-column-16/",
  "scraped_at": "2025-12-13T23:20:53.427152",
  "title": "WND column",
  "date_display": "September 5, 2011",
  "date_iso": "2011-09-05T07:28:00+00:00",
  "date_from_url": "2011-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?pageId=341573\">The Christian Nation</a></b></p><p><i>“While I was in America, a witness, who happened to be called at the assizes of the county of Chester (state of New York), declared that he did not believe in the existence of God or in the immortality of the soul. The judge refused to admit his evidence, on the ground that the witness had destroyed beforehand all the confidence of the court in what he was about to say. The newspapers related the fact without any farther comment. The Americans combine the notions of Christianity and of liberty so intimately in their minds, that it is impossible to make them conceive the one without the other; and with them this conviction does not spring from that barren traditionary faith which seems to vegetate in the soul rather than to live.”</i><br> – Alexis de Tocqueville, “American Institutions and Their Influence,” 1851</br></p><p>One of the repetitive themes that developed in <i>The Irrational Atheist</i> over the course of its writing is the profound historical unreliability of atheists. Atheists, particularly the aggressive variety, tend to repeat the same talking points over and over with such assurance that the average historically illiterate individual, regardless of his religious faith, has a tendency to accept them at face value. But this is foolish, as historical arguments presented by atheists almost invariably rely upon taking one small piece of historical evidence and twisting it beyond all recognition while simultaneously ignoring the larger part of the historical record.</p></div>",
  "content_text": "The Christian Nation\n“While I was in America, a witness, who happened to be called at the assizes of the county of Chester (state of New York), declared that he did not believe in the existence of God or in the immortality of the soul. The judge refused to admit his evidence, on the ground that the witness had destroyed beforehand all the confidence of the court in what he was about to say. The newspapers related the fact without any farther comment. The Americans combine the notions of Christianity and of liberty so intimately in their minds, that it is impossible to make them conceive the one without the other; and with them this conviction does not spring from that barren traditionary faith which seems to vegetate in the soul rather than to live.”\n– Alexis de Tocqueville, “American Institutions and Their Influence,” 1851\nOne of the repetitive themes that developed in\nThe Irrational Atheist\nover the course of its writing is the profound historical unreliability of atheists. Atheists, particularly the aggressive variety, tend to repeat the same talking points over and over with such assurance that the average historically illiterate individual, regardless of his religious faith, has a tendency to accept them at face value. But this is foolish, as historical arguments presented by atheists almost invariably rely upon taking one small piece of historical evidence and twisting it beyond all recognition while simultaneously ignoring the larger part of the historical record.",
  "tags": [
    "atheism",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-09-05T06:28:00+00:00"
}