{
  "url": "https://voxday.net/2006/03/20/banning-sub-optima/",
  "scraped_at": "2026-01-08T21:02:26.508955",
  "title": "Banning the sub-optimal",
  "date_display": "March 20, 2006",
  "date_iso": "2006-03-20T11:57:00+00:00",
  "date_from_url": "2006-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a toss-up as to who is more prone to confusing legality and morality, Scripture-quoting Christians or government-loving atheists.  In either case, the complete silliness of the former with regards to the forthcoming polygamy debate is clear.  The Evangelical Outpost features <a href=\"http://www.evangelicaloutpost.com/archives/001851.html#more\">an interesting discussion of the subject</a>, wherein the mindless monogamaniacs repeat Joseph Farah’s specious point last week about how monogamy is the Christian ideal.</p><p>First, I note that this is a stupid line of quasi-reasoning which no one with an IQ over 75 would dare to try with regards to any other subject.  Baptism is a much more important Christian ideal and yet not even the Southern Baptists believe that baptism should be enshrined into law, let alone the Constitution.  Better yet, why not mandate a public confession of Jesus Christ as Lord?  That is not only the ultimate Christian ideal, it is inevitable anyhow.</p><p>Second, it betrays an impressive ignorance of Scripture.  Monogamous marriage is absolutely NOT the Christian ideal.  Paul states very clearly that it is better not to marry at all, but to live a celibate life in service to the Lord.  Having pointed this out, I shall now wait with interest to see how long it takes all of these nominal idealists to begin calling for the banning of all marriage….</p><p>More relevant than the “one flesh” verse, (which says nothing about it being an exclusive or unrepeatable experience), is the very useful one about fruits and judging.  The fruits of state-sponsored monogamous marriage are very clear, both here in the United States and across Western Europe.  Considering how Christianity grew powerfully in various polygamous cultures, including Africa today, at least at first glance this would appear to be a clear strike against the notion that government-imposed monogamy is either godly or societally beneficial.</p><p>As I have written before, I do not think the state has any role to play in marriage, either pro or con.  Christians who turn to the government to impose their vision of marriage on others are making a huge mistake and they will suffer the same disappointment that conservatives who elected George Bush to impose limited government are now experiencing.</p><p>The government that can dictate marriage to your liking is the government that will dictate marriage that is not to your liking.</p></div>",
  "content_text": "It’s a toss-up as to who is more prone to confusing legality and morality, Scripture-quoting Christians or government-loving atheists.  In either case, the complete silliness of the former with regards to the forthcoming polygamy debate is clear.  The Evangelical Outpost features\nan interesting discussion of the subject\n, wherein the mindless monogamaniacs repeat Joseph Farah’s specious point last week about how monogamy is the Christian ideal.\nFirst, I note that this is a stupid line of quasi-reasoning which no one with an IQ over 75 would dare to try with regards to any other subject.  Baptism is a much more important Christian ideal and yet not even the Southern Baptists believe that baptism should be enshrined into law, let alone the Constitution.  Better yet, why not mandate a public confession of Jesus Christ as Lord?  That is not only the ultimate Christian ideal, it is inevitable anyhow.\nSecond, it betrays an impressive ignorance of Scripture.  Monogamous marriage is absolutely NOT the Christian ideal.  Paul states very clearly that it is better not to marry at all, but to live a celibate life in service to the Lord.  Having pointed this out, I shall now wait with interest to see how long it takes all of these nominal idealists to begin calling for the banning of all marriage….\nMore relevant than the “one flesh” verse, (which says nothing about it being an exclusive or unrepeatable experience), is the very useful one about fruits and judging.  The fruits of state-sponsored monogamous marriage are very clear, both here in the United States and across Western Europe.  Considering how Christianity grew powerfully in various polygamous cultures, including Africa today, at least at first glance this would appear to be a clear strike against the notion that government-imposed monogamy is either godly or societally beneficial.\nAs I have written before, I do not think the state has any role to play in marriage, either pro or con.  Christians who turn to the government to impose their vision of marriage on others are making a huge mistake and they will suffer the same disappointment that conservatives who elected George Bush to impose limited government are now experiencing.\nThe government that can dictate marriage to your liking is the government that will dictate marriage that is not to your liking.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-20T11:57:00+00:00"
}