{
  "url": "https://voxday.net/2006/03/26/eco-on-migrations/",
  "scraped_at": "2026-01-08T21:03:10.772721",
  "title": "Eco on Migrations",
  "date_display": "March 26, 2006",
  "date_iso": "2006-03-26T21:35:00+00:00",
  "date_from_url": "2006-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Discuss, as always, amongst yourselves:</p><blockquote><p>MIGRAZIONI<br>Umberto Eco<br>La Bustina Di Minerva, 1990</br></br></p><p>Martedi scorso, mentre tutti i giornali dedicavano numerosi articoli alle tensioni fiorentine, su La Repubblica appariva una vignetta di Bucchi: rappresentava due silhouette, un’Africa enorme e incombente, un’Italia minuscola: accanto, una Firenze che non era rappresentabile neppure con un puntino (e sotta c’era scritto “Dove vogliono piu polizia”).  Sul Corriere della Sera si riassumeva la storia delle mutazioni climatiche sul nostro pianeta dal 4000 a.C. a oggi.  E da questa rassegna emergeva che a mano a mano la fertilità o l’aridità di un continente provocavano immense migrazioni che hanno cambiato il volto del pianeta e creato le civiltà che oggi conosciamo o per esperienza diretto o per recostruzione storica.</p><p>Oggi, di fronte al cosiddetto problemi degli extracomunitari (grazioso eufemismo che, come è stato già notato, dovrebbe compredere anche gli svizzeri e i turisti texani), problema che interessa tutte le nazioni europee, continuiamo a ragionare come se ci trovassimo di fronte a un fenomeno di immigrazione.  Si ha immigrazione quando alcune centinaia di migliaia di cittadini di un paese sovrappopolato vogliano andare a vivere in un altro paese (per esempio gli italiani in Australia).  Ed è naturale che il paese ospitante debba regolare il flusso di immigrazione secondo le proprio capacità di accoglienza, come va da sè che abbia il diritto di arrestare o espellere gli immigrati che delinquono – così come d’altra parte ha il dovere di arrestare, se delinquono, sia i propri cittadini che i turisti ricchi che portano valuta pregiata.</p><p>Ma oggi, in Europa, non ci troviamo di fronte a un fenomeno di immigrazione.  Ci troviamo di fronte a un fenomeno <b>migratorio</b>.  Certo non ha l’aspetto violento e travolgente delle invasioni dei popoli germanici in Italia, Francia e Spagna, non ha la virulenza dell’espansione araba dopo l’Egira, non ha la lentezza di quei flussi imprecisi che hanno portato popoli scuri dall’Asia all’Oceania e forse alle Americhe, muovendosi sopra lingua di terra ormai sommerse.  Ma è un altro capitolo della storia del pianeta che ha visto le civiltà formarsi e dissolversi sull’onda di grandi flussi migratori, prima dall’Ovest verso l’Est (ma ne sappiamo pochissimo), poi dall’Est verso l’Ovest iniziando con un movimento millenario dalle sorgenti dell’Indo alle Colonne d’Ercole, e poi in quattro secoli dalle Colonne d’Ercole alle California e alla Terra del Fuoco.</p><p>Ora la migrazione, inavvertibile perche assume l’aspetto di un viaggio in aereo e di una sosta all’ufficio stranieri della questura, o dello sbarco clandestino, avviene da un Sud sempre più arido e affamato verso il Nord.  Sembra una immigrazione, ma è una migrazione, è un evento storico di portata incalcolabile, non avviene per transito di orde che non lasciano più crescer l’erba dove sono passati i loro cavali, ma a grappoli discreti e sottomessi, e pero non prenderà secoli o millenni, ma decenni.  È come tutte le grandi migrazioni avrà come risultato finale un riassetto etnico delle terre di destinazione, un inesorabile cambiamento dei costumi, una inarrestabile ibridazione che mutera statisticamente il colore della pelle, dei capelli, degli occhi delle poplazioni, cosi come non molti normanni hanno installato in Sicilia dei tipi umani biondi e con gli occhi azzurri.</p><p>Le grandi migrazioni, almeno in periodo storico, sono temute: dapprincipio si tenta di evitarle, gli imperatori romani erigono un <em>vallum</em> qua e uno là, mandano le quadrate legioni in avanti per sottomettere gli intrusi che avanzano; poi vengono a patti e disciplinano le prime installazioni, quindi allargano la cittadinanza romana a tutti i sudditi dell’impero, ma alla fine sulle rovine della romanita si formano i cosiddetti regni romano-barbarici che sono l’orgine dei nostri paesi europei, delle lingue che oggi orgogliosamente parliamo, delle nostre istituzioni politiche e sociali.  Quando sulle autostrade lombarde troviamo località che si chiamano italianamente Usmate, Biandrate, abbiamo dimenticato che sono desinenze longobarde.  D’altra parte, da dove venivano quei sorrisi etruschi che ritroviamo ancora su tanti volti dell’Italia centrale?</p><p>Le grande migrazioni non si arrestano.  Ci si prepara semplicimente a vivere una nuova stagione della cultura afroeuropea.</p></blockquote><p>Last Tuesday, while all the newspapers were dedicating numerous articles to the tense events in Florence, there appeared in La Repubblica a cartoon by Bucchi: it showed two silhouettes, an enormous Africa looming over a miniscule Italy; next to it was a Florence that was represented only by a small dot.  The caption was: “Where do we want more police?”  Meanwhile, the Corriere della Sera summed up the story of the climactic changes on our planet over the last six thousand years.  From this review it emerged that the fertility or the aridity of a continent inspired vast migrations that changed the face of the planet and created the civilizations that today we know, experience directly or study through history.</p><p>Today, with regards to the so-called problems of the “foreigners” (a gracious euphemism that, as has already been noted, must also include the Swiss and the tourists from Texas), an issue that is of interest to all of the nations of Europe, we continue to reason as if we find ourself facing a phenomenon of immigration.  One has immigration when some hundreds of thousands of citizens of one overpopulated country want to go to live in another country, (for example, the Italians in Australia).  And it is natural that the hosting country must regulate the flow of immigration according to its ability to incorporate them, which is why it has the right to arrest or expel those immigrants that prove criminal, just as it has to arrest its own criminal citizens who rob the rich tourists carrying their precious valuables.</p><p>But today, in Europe, we do not find ourselves facing a phenomenon of immigration.  We find ourselves facing a phenomenon of migration.  To be sure, it does not have the violent and sweeping aspect of the Germanic invasions in Italy, France and Spain, it does not have the virulence of the Arab expansions following the Hegira,  nor the slowness of the imprecise flows that carried the dark peoples from Asia to Polynesia and perhaps to America.  But it is another chapter in the story of the planet that has seen civilizations form and dissolve on the waves of the great migratory flows, first from the West to the East (but we know very little about that), after from the East to the West beginning with the millennial movement of the surge from the Indus to the Pillars of Hercules, (the straights of Gibraltar), and afterwards in the fourth century from the Pillars of Hercules to California and Tierra del Fuego, (Argentina and Patagonia).</p><p>Now the migration, unnoticed because it comes in the guise of an airplane trip and a stop at the immigration office at the police headquarters, or perhaps by a clandestine boat, comes to the North from an arid and hungry South.  It feels like an immigration, but it is a migration, a historic event of incalcuable scope.  They do not travel in such a horde that the grass will no longer grow where their horses have trampled, but in discrete clusters that attract little notice, nevertheless, the process will not take centuries or millenia but decades.  And like all the great migrations, it will finally result in a rearrangement of the ethnicity of the land of their destination, an inexorable change of costumes, an unarrestable hybridization that noticeably mutates the color of the skin, the hair and the eyes of the population, as even a small number of Normans left behind their blond hair and blue eyes in Sicily.</p><p>The great migrations, at least in historic periods, were feared: at first they tried to avoid them, the Roman emperors erected one rampart here and another on<br> e there, they sent the legions ahead to defeat the advancing intruders, after they came to bargain and discipline the first settlements, therefore offering Roman citizenship to all the subjects of the Empire, but in the end, the ruin of the Romans formed the so-called romano-barbarian kingdoms that were the origins of our European countries, of the languages that we jealously speak today, of our political and social institutions.  When on the Lombardian highway, we find places that we call, in Italian fashion names like Usmate or Biandrate, we have forgotten that they were descendants of the Longobards.  On the other hand, from where do we get those Etruscan Smiles we find so often in central Italy?</br></p><p>The great migrations cannot be stopped.  We simply must prepare ourselves to live in a new season of Afro-European culture.</p></div>",
  "content_text": "Discuss, as always, amongst yourselves:\nMIGRAZIONI\nUmberto Eco\nLa Bustina Di Minerva, 1990\nMartedi scorso, mentre tutti i giornali dedicavano numerosi articoli alle tensioni fiorentine, su La Repubblica appariva una vignetta di Bucchi: rappresentava due silhouette, un’Africa enorme e incombente, un’Italia minuscola: accanto, una Firenze che non era rappresentabile neppure con un puntino (e sotta c’era scritto “Dove vogliono piu polizia”).  Sul Corriere della Sera si riassumeva la storia delle mutazioni climatiche sul nostro pianeta dal 4000 a.C. a oggi.  E da questa rassegna emergeva che a mano a mano la fertilità o l’aridità di un continente provocavano immense migrazioni che hanno cambiato il volto del pianeta e creato le civiltà che oggi conosciamo o per esperienza diretto o per recostruzione storica.\nOggi, di fronte al cosiddetto problemi degli extracomunitari (grazioso eufemismo che, come è stato già notato, dovrebbe compredere anche gli svizzeri e i turisti texani), problema che interessa tutte le nazioni europee, continuiamo a ragionare come se ci trovassimo di fronte a un fenomeno di immigrazione.  Si ha immigrazione quando alcune centinaia di migliaia di cittadini di un paese sovrappopolato vogliano andare a vivere in un altro paese (per esempio gli italiani in Australia).  Ed è naturale che il paese ospitante debba regolare il flusso di immigrazione secondo le proprio capacità di accoglienza, come va da sè che abbia il diritto di arrestare o espellere gli immigrati che delinquono – così come d’altra parte ha il dovere di arrestare, se delinquono, sia i propri cittadini che i turisti ricchi che portano valuta pregiata.\nMa oggi, in Europa, non ci troviamo di fronte a un fenomeno di immigrazione.  Ci troviamo di fronte a un fenomeno\nmigratorio\n.  Certo non ha l’aspetto violento e travolgente delle invasioni dei popoli germanici in Italia, Francia e Spagna, non ha la virulenza dell’espansione araba dopo l’Egira, non ha la lentezza di quei flussi imprecisi che hanno portato popoli scuri dall’Asia all’Oceania e forse alle Americhe, muovendosi sopra lingua di terra ormai sommerse.  Ma è un altro capitolo della storia del pianeta che ha visto le civiltà formarsi e dissolversi sull’onda di grandi flussi migratori, prima dall’Ovest verso l’Est (ma ne sappiamo pochissimo), poi dall’Est verso l’Ovest iniziando con un movimento millenario dalle sorgenti dell’Indo alle Colonne d’Ercole, e poi in quattro secoli dalle Colonne d’Ercole alle California e alla Terra del Fuoco.\nOra la migrazione, inavvertibile perche assume l’aspetto di un viaggio in aereo e di una sosta all’ufficio stranieri della questura, o dello sbarco clandestino, avviene da un Sud sempre più arido e affamato verso il Nord.  Sembra una immigrazione, ma è una migrazione, è un evento storico di portata incalcolabile, non avviene per transito di orde che non lasciano più crescer l’erba dove sono passati i loro cavali, ma a grappoli discreti e sottomessi, e pero non prenderà secoli o millenni, ma decenni.  È come tutte le grandi migrazioni avrà come risultato finale un riassetto etnico delle terre di destinazione, un inesorabile cambiamento dei costumi, una inarrestabile ibridazione che mutera statisticamente il colore della pelle, dei capelli, degli occhi delle poplazioni, cosi come non molti normanni hanno installato in Sicilia dei tipi umani biondi e con gli occhi azzurri.\nLe grandi migrazioni, almeno in periodo storico, sono temute: dapprincipio si tenta di evitarle, gli imperatori romani erigono un\nvallum\nqua e uno là, mandano le quadrate legioni in avanti per sottomettere gli intrusi che avanzano; poi vengono a patti e disciplinano le prime installazioni, quindi allargano la cittadinanza romana a tutti i sudditi dell’impero, ma alla fine sulle rovine della romanita si formano i cosiddetti regni romano-barbarici che sono l’orgine dei nostri paesi europei, delle lingue che oggi orgogliosamente parliamo, delle nostre istituzioni politiche e sociali.  Quando sulle autostrade lombarde troviamo località che si chiamano italianamente Usmate, Biandrate, abbiamo dimenticato che sono desinenze longobarde.  D’altra parte, da dove venivano quei sorrisi etruschi che ritroviamo ancora su tanti volti dell’Italia centrale?\nLe grande migrazioni non si arrestano.  Ci si prepara semplicimente a vivere una nuova stagione della cultura afroeuropea.\nLast Tuesday, while all the newspapers were dedicating numerous articles to the tense events in Florence, there appeared in La Repubblica a cartoon by Bucchi: it showed two silhouettes, an enormous Africa looming over a miniscule Italy; next to it was a Florence that was represented only by a small dot.  The caption was: “Where do we want more police?”  Meanwhile, the Corriere della Sera summed up the story of the climactic changes on our planet over the last six thousand years.  From this review it emerged that the fertility or the aridity of a continent inspired vast migrations that changed the face of the planet and created the civilizations that today we know, experience directly or study through history.\nToday, with regards to the so-called problems of the “foreigners” (a gracious euphemism that, as has already been noted, must also include the Swiss and the tourists from Texas), an issue that is of interest to all of the nations of Europe, we continue to reason as if we find ourself facing a phenomenon of immigration.  One has immigration when some hundreds of thousands of citizens of one overpopulated country want to go to live in another country, (for example, the Italians in Australia).  And it is natural that the hosting country must regulate the flow of immigration according to its ability to incorporate them, which is why it has the right to arrest or expel those immigrants that prove criminal, just as it has to arrest its own criminal citizens who rob the rich tourists carrying their precious valuables.\nBut today, in Europe, we do not find ourselves facing a phenomenon of immigration.  We find ourselves facing a phenomenon of migration.  To be sure, it does not have the violent and sweeping aspect of the Germanic invasions in Italy, France and Spain, it does not have the virulence of the Arab expansions following the Hegira,  nor the slowness of the imprecise flows that carried the dark peoples from Asia to Polynesia and perhaps to America.  But it is another chapter in the story of the planet that has seen civilizations form and dissolve on the waves of the great migratory flows, first from the West to the East (but we know very little about that), after from the East to the West beginning with the millennial movement of the surge from the Indus to the Pillars of Hercules, (the straights of Gibraltar), and afterwards in the fourth century from the Pillars of Hercules to California and Tierra del Fuego, (Argentina and Patagonia).\nNow the migration, unnoticed because it comes in the guise of an airplane trip and a stop at the immigration office at the police headquarters, or perhaps by a clandestine boat, comes to the North from an arid and hungry South.  It feels like an immigration, but it is a migration, a historic event of incalcuable scope.  They do not travel in such a horde that the grass will no longer grow where their horses have trampled, but in discrete clusters that attract little notice, nevertheless, the process will not take centuries or millenia but decades.  And like all the great migrations, it will finally result in a rearrangement of the ethnicity of the land of their destination, an inexorable change of costumes, an unarrestable hybridization that noticeably mutates the color of the skin, the hair and the eyes of the population, as even a small number of Normans left behind their blond hair and blue eyes in Sicily.\nThe great migrations, at least in historic periods, were feared: at first they tried to avoid them, the Roman emperors erected one rampart here and another on\ne there, they sent the legions ahead to defeat the advancing intruders, after they came to bargain and discipline the first settlements, therefore offering Roman citizenship to all the subjects of the Empire, but in the end, the ruin of the Romans formed the so-called romano-barbarian kingdoms that were the origins of our European countries, of the languages that we jealously speak today, of our political and social institutions.  When on the Lombardian highway, we find places that we call, in Italian fashion names like Usmate or Biandrate, we have forgotten that they were descendants of the Longobards.  On the other hand, from where do we get those Etruscan Smiles we find so often in central Italy?\nThe great migrations cannot be stopped.  We simply must prepare ourselves to live in a new season of Afro-European culture.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-26T20:35:00+00:00"
}