{
  "url": "https://voxday.net/2006/03/01/little-late-there-mr-buckley/",
  "scraped_at": "2026-01-08T21:00:47.417187",
  "title": "A little late there, Mr. Buckley",
  "date_display": "March 1, 2006",
  "date_iso": "2006-03-01T11:42:00+00:00",
  "date_from_url": "2006-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Buckley finally <a href=\"http://www.townhall.com/opinion/columns/wfbuckley/2006/02/28/188185.html\">admits to the limits of military power</a>:</p><blockquote><p> Three years ago (March 2003) I wrote in this space: “What Mr. Bush proposes to do is to unseat Saddam Hussein and to eliminate his investments in aggressive weaponry. We can devoutly hope that internecine tribal antagonisms will be subsumed in the fresh air of a despot removed, and that the restoration of freedom will be productive. But these concomitant developments can’t be either foreseen by the United States or implemented by us. What Mr. Bush can accomplish is the removal of a regime and its infrastructure. The Iraqi people will have to take it from there.”</p><p>Mr. Bush is entitled to maintain, doggedly and persuasively, that he took the right steps — up through the overthrow of Saddam and the exposure of an armory without weapons of mass destruction. From that point on, the challenge required more than his deployable resources. His political reputation will rest on his success in making that point and ceding realistically to realities we are not going to cope with, and ought not to attempt to cope with.</p></blockquote><p>Mr. Buckley, appears to be attempting to cover up for the fact that he did not, as I and a very few other writers did, oppose the madness of “nation-building”.  It was a foolish notion from the start as there was never any nation to be built, there were at least three separate nations all subject to the same repressive force.  Keeping them together required the same sort of repression that was seen in the Soviet Union and Yugoslavia, as we are finally beginning to recognize some three years later.</p><p><em>I was willing to support an open and declared war on Iraq and other self-declared enemies of America as a means of ending this clash of civilizations that began in the 1970s – or 1950s if you view the post-independence violence that took place in India as the rebirth of jihad. War is the health of the state, true, but unlike the tango, it does not require two. However, it has become clear that the neoconservative utopians in the administration do not see this undeclared and unconstitutional war as a reactive strike in self-defense, but more as a means of reshaping the global order. I expect this attempt to work about as well as Woodrow Wilson’s did in 1918.</em> <a href=\"http://www.voxday.net/archive/2004/022304.html\">February 2004</a></p><p>I was pleased to note, however, that Mr. Buckley did make reference to the WWII occupations, which I openly mocked back when they were being made as a means of attempting to rationalize the post-war violence.</p><p><em>The conquest of Iraq no more brought about an end to the global jihad than did the conquest of the Rhineland-Palatinate mean the end of World War II. Nor could it have. Berlin had to fall before the defeat of Nazi Germany could even be contemplated, and it’s bizarre to suggest that the occupation of a peripheral Arabic province could end the war while the Clausewitzian center of gravity remains unmolested.</em> – <a href=\"http://www.voxday.net/archive/2004/041204.html\">April 2004</a></p><p>On a related, note, I found <a href=\"http://www.townhall.com/opinion/columns/benshapiro/2006/03/01/188223.html\">the Littlest Chickenhawk’s explanation</a> of how he and other clever pundits derive their political positions to be more than a little telling:</p><blockquote><p>Clever politicians and pundits, therefore, try to find a way of hedging their bets….  It is worthwhile arguing about strategy in Iraq and in the global war on terror. But honest strategic suggestions can be — and must be — distinguished from simple political positioning.</p></blockquote><p>It appears that we can conclude from this that Mr. B. Shapiro, Esquire, will cease his crowing for imperial conquest now that empire has been declared to be officially declasse by the Confather.  Look for future apologetics explaining how it is the fault of insufficiently martial Americans, most of them Democrats, that Sunni Iraqis and Shia Iraqis prefer killing each other in genuine power struggles to participating in farcical elections wherein a bi-factional elite pretends to pay attention to the Will of the People while ignoring it whenever it suits them.</p></div>",
  "content_text": "Mr. Buckley finally\nadmits to the limits of military power\n:\nThree years ago (March 2003) I wrote in this space: “What Mr. Bush proposes to do is to unseat Saddam Hussein and to eliminate his investments in aggressive weaponry. We can devoutly hope that internecine tribal antagonisms will be subsumed in the fresh air of a despot removed, and that the restoration of freedom will be productive. But these concomitant developments can’t be either foreseen by the United States or implemented by us. What Mr. Bush can accomplish is the removal of a regime and its infrastructure. The Iraqi people will have to take it from there.”\nMr. Bush is entitled to maintain, doggedly and persuasively, that he took the right steps — up through the overthrow of Saddam and the exposure of an armory without weapons of mass destruction. From that point on, the challenge required more than his deployable resources. His political reputation will rest on his success in making that point and ceding realistically to realities we are not going to cope with, and ought not to attempt to cope with.\nMr. Buckley, appears to be attempting to cover up for the fact that he did not, as I and a very few other writers did, oppose the madness of “nation-building”.  It was a foolish notion from the start as there was never any nation to be built, there were at least three separate nations all subject to the same repressive force.  Keeping them together required the same sort of repression that was seen in the Soviet Union and Yugoslavia, as we are finally beginning to recognize some three years later.\nI was willing to support an open and declared war on Iraq and other self-declared enemies of America as a means of ending this clash of civilizations that began in the 1970s – or 1950s if you view the post-independence violence that took place in India as the rebirth of jihad. War is the health of the state, true, but unlike the tango, it does not require two. However, it has become clear that the neoconservative utopians in the administration do not see this undeclared and unconstitutional war as a reactive strike in self-defense, but more as a means of reshaping the global order. I expect this attempt to work about as well as Woodrow Wilson’s did in 1918.\nFebruary 2004\nI was pleased to note, however, that Mr. Buckley did make reference to the WWII occupations, which I openly mocked back when they were being made as a means of attempting to rationalize the post-war violence.\nThe conquest of Iraq no more brought about an end to the global jihad than did the conquest of the Rhineland-Palatinate mean the end of World War II. Nor could it have. Berlin had to fall before the defeat of Nazi Germany could even be contemplated, and it’s bizarre to suggest that the occupation of a peripheral Arabic province could end the war while the Clausewitzian center of gravity remains unmolested.\n–\nApril 2004\nOn a related, note, I found\nthe Littlest Chickenhawk’s explanation\nof how he and other clever pundits derive their political positions to be more than a little telling:\nClever politicians and pundits, therefore, try to find a way of hedging their bets….  It is worthwhile arguing about strategy in Iraq and in the global war on terror. But honest strategic suggestions can be — and must be — distinguished from simple political positioning.\nIt appears that we can conclude from this that Mr. B. Shapiro, Esquire, will cease his crowing for imperial conquest now that empire has been declared to be officially declasse by the Confather.  Look for future apologetics explaining how it is the fault of insufficiently martial Americans, most of them Democrats, that Sunni Iraqis and Shia Iraqis prefer killing each other in genuine power struggles to participating in farcical elections wherein a bi-factional elite pretends to pay attention to the Will of the People while ignoring it whenever it suits them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-01T11:42:00+00:00"
}