{
  "url": "https://voxday.net/2006/03/01/mailvox-airpower-and-techno/",
  "scraped_at": "2026-01-08T21:00:49.360214",
  "title": "Mailvox: airpower and techno-ecumenicism",
  "date_display": "March 1, 2006",
  "date_iso": "2006-03-01T12:50:00+00:00",
  "date_from_url": "2006-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Major CC continues the discussion:</p><blockquote><p>As a third-generation professional Airman, I could not let your statement that “the history of strategic bombing is a history of complete failure” go unanswered.  Additionally, your assertion that Airpower, while being “a crucial tactical element… is strategically toothless” could not be more wrong.  I’ve read many of the responses posted on your website, many driven by some pretty strong emotion-driven bias and selective statistics on every side of the debate, so I hope to try a more “strategic” approach, although I may seem overly optimistic to some.</p><p>First Lesson:  Weapons are not inherently tactical, operational or strategic in and of themselves.</p><p>Whether a mission is tactical, operational, or strategic is dictated by the target and the effect of destroying or degrading that target, and not by the weapon used.  The rifle and solitary bullet used by an army sniper can have a tactical, operational, or strategic effect, based on whether the target is an enemy platoon leader, commanding General, or Prime Minister.  In the same way, a 2000 pound GPS-guided bomb dropped from the wild blue can have a tactical, operational, or strategic effect, based on whether the target is a tank, a command bunker, or a key communications node.</p></blockquote><p>Agreed.  I thought it was fairly clear that the aspect of airpower I was dismissing was the Dohout/Mitchell view of Airpower uber alles, that favored view of bloodless war-enamored political columnists, which believes that mass bombing campaigns and pinpoint air strikes are capable of winning wars without risking the infantry.  The target of my criticism is not the Air Force, but those who call for its misuse under misapprehensions of its capabilities.</p><blockquote><p>I understand the confusion.  My father served in a Cold War Air Force that systemically confused the word strategic with nuclear bombers and the word tactical with conventional fighters.  Vietnam left the Air Force totally confused over its role in a non-nuclear strategic air campaign, and we actually adopted the Army’s myopic AirLand Battle Doctrine in the late 70s and 80s, so I wouldn’t necessarily consider “flyboys” or “grunts” who served even 5-15 years ago to be experts on this topic, either.</p></blockquote><p>I hope some of the retired flyboys who are reading this will note that the major said that, not me….</p><blockquote><p>While AirLand Battle Doctrine did help give us the venerable A-10, it looked at conventional Airpower in terms of tactical Close Air Support or long-range artillery based on a mystical epic future tank battle in the Fulda Gap.  While you seem to agree with the idea that employing ground forces, with airplanes buzzing in tactical submission overhead, is the only truly effective way to achieve strategic results, let me point out that two-dimensional conventional ground forces must first maneuver against the two-dimensional tactical targets on the ground in front of them.  Only when they are able to push back or break through the “front line” can they begin to slog their way overland to operational and strategic targets.</p><p>The early airpower theorists recognized that Airpower could operate simultaneously against tactical, operational, and strategic target sets and attack from any direction at any time (sometimes referred to as “parallel warfare”).  This time factor actually adds a fourth-dimensional advantage to air assets that ground forces simply do not possess.  It has taken time for the technology to catch up with the theory.  Just wait until we start employing airborne lasers, which will have the capability to vaporize an Iranian ballistic missile in flight and then refocus to deep-tan Usama from 20 miles away without even scorching his brokeback buddies’ Al-Qaeda-regulation beards.</p></blockquote><p>Being a science fiction writer, I’m entirely open to the possibilities, indeed, one of my short stories anticipated something very similar to today’s Predator, albeit one used in a more networked capacity than anything today.  However, the major must admit that “just wait” has been the mantra of the Air Force for over sixty years now.  And while it has done many impressive things, it has seldom delivered the results it promised beforehand.</p><blockquote><p>I’m not surprised when a civilian with a government school education thinks that war is only about “boots on the ground” with soldiers fighting hand-to-hand and door-to-door until we plant our flag on foreign soil.  Any midgrade officer in today’s military should be able to explain that war, in a broader sense, is the application of various national instruments of power, including military, to make an enemy do what we want them to do (or kill them if they won’t).  Our “national will” must be translated by civilian leaders into military objectives before military planners can determine how Airpower, or any other military capability, can be used to meet those objectives.</p></blockquote><p>When have I ever stated anything about that?  Indeed, I have written for the last two years about how “boots on the ground” will not suffice to accomplish our revised goals in Iraq.  My skepticism with regards to Iran is not because I am setting up a strawman and arguing that air strikes won’t cause the mullahs to surrender – although Michael Ledeen did seem to think for a while that the mere threat of air strikes and special forces in support of Iranian insurrectionists would suffice a while back – it is because I doubt that a combination of air strikes and special forces ops are capable of shutting down a clandestine and distributed nuclear program run by smart people who watched what happened in Iraq.  As Blackfive has mentioned, in war, the enemy gets a vote too.</p><blockquote><p>With that in mind, our senior military leaders of all services must focus on meeting strategic objectives and the desired effects, rather than focusing on tactics and specific weapons.  Contrary to your assertions, Airpower is actually most effective when used strategically, and is currently the most efficient means of achieving the quickest strategic effects with the least risk and cost – a bargain for the taxpayer, despite all the editorial comments regarding the cost of stealth-bombers, etc.</p></blockquote><p>This is a naked assertion.  I’d like to see some detailed evidence before I even consider conceding the point.  Keep in mind, I have a whole catalog of information demonstrating how air power failed to even meet its stated strategic goals, much less proved to be more effective strategically than tactically.</p><blockquote><p>Regardless of the Combined Bomber Offensive’s effect during WWII, the entire paradigm has changed.  It has even changed exponentially since Operation DESERT STORM.  The original Airpower theorists were way ahead of the technology, but it’s not really even about Airpower, but tactical, operational and strategic effects.  It is true that 16 years after DESERT STORM, a single B-2 can launch from 3000 miles away, appear unannounced and unseen miles over enemy territory, destroy more than 60 targets on a single pass, at night, in bad weather, and depart without a trace, leaving behind a steel hailstorm precise enough to destroy diverse strategic, operational, and/or tactical targets simultaneously without even shattering the windows of adjacent buildings.  More importantly, this B-2 can be data-linked with F-22 fighters or Navy radar cruisers, networked into US military data systems, retasked at a moment’s notice to fill priorities from a commander on the other side of the globe, coordinate operations with Army, Marine Corps, or Special Operations assets on the ground, receive updated and real-time intelligence from multiple sources, including drones, satellites, and intelligence sources, and share it’s own real-time situational information with everyone else.  Obviously, the entire US military network is key to this process.</p><p>Trying to simplify the argument to “Air campaign” versus “B<br> oots on the Ground” is old-school and based on ignorance of modern capabilities.  US Military personnel now have the capability to operate across the spectrum of military operations, including Cyberspace, to destroy strategic, operational, and tactical targets as necessary to fulfill a combatant commanders objectives.  Any Airman, Soldier, Sailor, or Marine who thinks only in terms of their Service’s capabilities has probably not been deployed recently and the mainstream media is too confused to understand what’s really going on (or has a political agenda of their own).  In this vein, denying the strategic value of Airpower is based on ignorance or emotional bias.</br></p></blockquote><p>I think the major has forgotten that I not only commit the occasional crime of science fiction, but I’m also a game designer.  The capabilities of current cross-service networking haven’t even caught up with what I’ve envisioned in the near term, much less some of the concepts designed into the never released Rebel Moon Revolution… which had several military advisors, albeit mostly from the Marines.  What holds true of the average journalism major now engaged in punditry seldom applies to me.</p><p>I do not deny that there may well be strategic value to airpower, I merely insist that it is toothless acting alone as numerous columnists have advocated.  While the major’s holistic and techno-ecumenical approach does not explicitly admit to this stand-alone toothlessness, it could logically be seen as a tacit admission of sorts.</p><blockquote><p>The question now is “what is the objective and what military effect do we need accomplished, and how fast”.  Fortunately, Joint force commanders, not arm-chair bloggers, will decide how to meet that objective and what weapons systems to use, based on what’s available to them at any given time.  Don’t be surprised if Air assets continue to operate strategically and decisively, from time to time.</p><p>I’ve tried to decipher the specific military objectives you and the other bloggers think would drive a war against Iran.  When you comment that “precision air strikes launched in combination with special forces operating inside Iran… is only likely to succeed in Hollywood”, what objectives are you using to measure success?  Degradation of Iran’s Military or Nuclear Capability? You allude to a possible invasion of Iran – to what end?  Regime Change?  Unconditional Surrender?  If you let me know exactly what you think the objectives of a military action against Iran might be, we can begin to discuss which ones an Air Campaign could and could not achieve.</p><p>Keep up the great discussions!  The truth always comes out eventually.</p></blockquote><p>With regards to airstrikes (plus special forces), the public objective would be preventing Iran from obtaining a working nuclear-tipped missile.  As I’ve already said, I am skeptical that this can be prevented regardless of what we do, short of the use of nuclear weapons or a massive boots-on-the-ground invasion.  The quiet objective I suspect would be preventing the opening of the Iran Oil Bourse, or at least preventing oil being sold in Euros.  This could theoretically be accomplished without violence, or merely with its threat.  (That’s what I assume is going on.)  An invasion would be meant to cause regime change, and presumably, the installation of a government in accordance with the principles of the world democratic revolutionaries.</p></div>",
  "content_text": "Major CC continues the discussion:\nAs a third-generation professional Airman, I could not let your statement that “the history of strategic bombing is a history of complete failure” go unanswered.  Additionally, your assertion that Airpower, while being “a crucial tactical element… is strategically toothless” could not be more wrong.  I’ve read many of the responses posted on your website, many driven by some pretty strong emotion-driven bias and selective statistics on every side of the debate, so I hope to try a more “strategic” approach, although I may seem overly optimistic to some.\nFirst Lesson:  Weapons are not inherently tactical, operational or strategic in and of themselves.\nWhether a mission is tactical, operational, or strategic is dictated by the target and the effect of destroying or degrading that target, and not by the weapon used.  The rifle and solitary bullet used by an army sniper can have a tactical, operational, or strategic effect, based on whether the target is an enemy platoon leader, commanding General, or Prime Minister.  In the same way, a 2000 pound GPS-guided bomb dropped from the wild blue can have a tactical, operational, or strategic effect, based on whether the target is a tank, a command bunker, or a key communications node.\nAgreed.  I thought it was fairly clear that the aspect of airpower I was dismissing was the Dohout/Mitchell view of Airpower uber alles, that favored view of bloodless war-enamored political columnists, which believes that mass bombing campaigns and pinpoint air strikes are capable of winning wars without risking the infantry.  The target of my criticism is not the Air Force, but those who call for its misuse under misapprehensions of its capabilities.\nI understand the confusion.  My father served in a Cold War Air Force that systemically confused the word strategic with nuclear bombers and the word tactical with conventional fighters.  Vietnam left the Air Force totally confused over its role in a non-nuclear strategic air campaign, and we actually adopted the Army’s myopic AirLand Battle Doctrine in the late 70s and 80s, so I wouldn’t necessarily consider “flyboys” or “grunts” who served even 5-15 years ago to be experts on this topic, either.\nI hope some of the retired flyboys who are reading this will note that the major said that, not me….\nWhile AirLand Battle Doctrine did help give us the venerable A-10, it looked at conventional Airpower in terms of tactical Close Air Support or long-range artillery based on a mystical epic future tank battle in the Fulda Gap.  While you seem to agree with the idea that employing ground forces, with airplanes buzzing in tactical submission overhead, is the only truly effective way to achieve strategic results, let me point out that two-dimensional conventional ground forces must first maneuver against the two-dimensional tactical targets on the ground in front of them.  Only when they are able to push back or break through the “front line” can they begin to slog their way overland to operational and strategic targets.\nThe early airpower theorists recognized that Airpower could operate simultaneously against tactical, operational, and strategic target sets and attack from any direction at any time (sometimes referred to as “parallel warfare”).  This time factor actually adds a fourth-dimensional advantage to air assets that ground forces simply do not possess.  It has taken time for the technology to catch up with the theory.  Just wait until we start employing airborne lasers, which will have the capability to vaporize an Iranian ballistic missile in flight and then refocus to deep-tan Usama from 20 miles away without even scorching his brokeback buddies’ Al-Qaeda-regulation beards.\nBeing a science fiction writer, I’m entirely open to the possibilities, indeed, one of my short stories anticipated something very similar to today’s Predator, albeit one used in a more networked capacity than anything today.  However, the major must admit that “just wait” has been the mantra of the Air Force for over sixty years now.  And while it has done many impressive things, it has seldom delivered the results it promised beforehand.\nI’m not surprised when a civilian with a government school education thinks that war is only about “boots on the ground” with soldiers fighting hand-to-hand and door-to-door until we plant our flag on foreign soil.  Any midgrade officer in today’s military should be able to explain that war, in a broader sense, is the application of various national instruments of power, including military, to make an enemy do what we want them to do (or kill them if they won’t).  Our “national will” must be translated by civilian leaders into military objectives before military planners can determine how Airpower, or any other military capability, can be used to meet those objectives.\nWhen have I ever stated anything about that?  Indeed, I have written for the last two years about how “boots on the ground” will not suffice to accomplish our revised goals in Iraq.  My skepticism with regards to Iran is not because I am setting up a strawman and arguing that air strikes won’t cause the mullahs to surrender – although Michael Ledeen did seem to think for a while that the mere threat of air strikes and special forces in support of Iranian insurrectionists would suffice a while back – it is because I doubt that a combination of air strikes and special forces ops are capable of shutting down a clandestine and distributed nuclear program run by smart people who watched what happened in Iraq.  As Blackfive has mentioned, in war, the enemy gets a vote too.\nWith that in mind, our senior military leaders of all services must focus on meeting strategic objectives and the desired effects, rather than focusing on tactics and specific weapons.  Contrary to your assertions, Airpower is actually most effective when used strategically, and is currently the most efficient means of achieving the quickest strategic effects with the least risk and cost – a bargain for the taxpayer, despite all the editorial comments regarding the cost of stealth-bombers, etc.\nThis is a naked assertion.  I’d like to see some detailed evidence before I even consider conceding the point.  Keep in mind, I have a whole catalog of information demonstrating how air power failed to even meet its stated strategic goals, much less proved to be more effective strategically than tactically.\nRegardless of the Combined Bomber Offensive’s effect during WWII, the entire paradigm has changed.  It has even changed exponentially since Operation DESERT STORM.  The original Airpower theorists were way ahead of the technology, but it’s not really even about Airpower, but tactical, operational and strategic effects.  It is true that 16 years after DESERT STORM, a single B-2 can launch from 3000 miles away, appear unannounced and unseen miles over enemy territory, destroy more than 60 targets on a single pass, at night, in bad weather, and depart without a trace, leaving behind a steel hailstorm precise enough to destroy diverse strategic, operational, and/or tactical targets simultaneously without even shattering the windows of adjacent buildings.  More importantly, this B-2 can be data-linked with F-22 fighters or Navy radar cruisers, networked into US military data systems, retasked at a moment’s notice to fill priorities from a commander on the other side of the globe, coordinate operations with Army, Marine Corps, or Special Operations assets on the ground, receive updated and real-time intelligence from multiple sources, including drones, satellites, and intelligence sources, and share it’s own real-time situational information with everyone else.  Obviously, the entire US military network is key to this process.\nTrying to simplify the argument to “Air campaign” versus “B\noots on the Ground” is old-school and based on ignorance of modern capabilities.  US Military personnel now have the capability to operate across the spectrum of military operations, including Cyberspace, to destroy strategic, operational, and tactical targets as necessary to fulfill a combatant commanders objectives.  Any Airman, Soldier, Sailor, or Marine who thinks only in terms of their Service’s capabilities has probably not been deployed recently and the mainstream media is too confused to understand what’s really going on (or has a political agenda of their own).  In this vein, denying the strategic value of Airpower is based on ignorance or emotional bias.\nI think the major has forgotten that I not only commit the occasional crime of science fiction, but I’m also a game designer.  The capabilities of current cross-service networking haven’t even caught up with what I’ve envisioned in the near term, much less some of the concepts designed into the never released Rebel Moon Revolution… which had several military advisors, albeit mostly from the Marines.  What holds true of the average journalism major now engaged in punditry seldom applies to me.\nI do not deny that there may well be strategic value to airpower, I merely insist that it is toothless acting alone as numerous columnists have advocated.  While the major’s holistic and techno-ecumenical approach does not explicitly admit to this stand-alone toothlessness, it could logically be seen as a tacit admission of sorts.\nThe question now is “what is the objective and what military effect do we need accomplished, and how fast”.  Fortunately, Joint force commanders, not arm-chair bloggers, will decide how to meet that objective and what weapons systems to use, based on what’s available to them at any given time.  Don’t be surprised if Air assets continue to operate strategically and decisively, from time to time.\nI’ve tried to decipher the specific military objectives you and the other bloggers think would drive a war against Iran.  When you comment that “precision air strikes launched in combination with special forces operating inside Iran… is only likely to succeed in Hollywood”, what objectives are you using to measure success?  Degradation of Iran’s Military or Nuclear Capability? You allude to a possible invasion of Iran – to what end?  Regime Change?  Unconditional Surrender?  If you let me know exactly what you think the objectives of a military action against Iran might be, we can begin to discuss which ones an Air Campaign could and could not achieve.\nKeep up the great discussions!  The truth always comes out eventually.\nWith regards to airstrikes (plus special forces), the public objective would be preventing Iran from obtaining a working nuclear-tipped missile.  As I’ve already said, I am skeptical that this can be prevented regardless of what we do, short of the use of nuclear weapons or a massive boots-on-the-ground invasion.  The quiet objective I suspect would be preventing the opening of the Iran Oil Bourse, or at least preventing oil being sold in Euros.  This could theoretically be accomplished without violence, or merely with its threat.  (That’s what I assume is going on.)  An invasion would be meant to cause regime change, and presumably, the installation of a government in accordance with the principles of the world democratic revolutionaries.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-01T12:50:00+00:00"
}