{
  "url": "https://voxday.net/2006/03/02/mailvox-those-lecherous-unicorns/",
  "scraped_at": "2026-01-08T21:00:54.851661",
  "title": "Mailvox: those lecherous unicorns",
  "date_display": "March 2, 2006",
  "date_iso": "2006-03-02T08:37:00+00:00",
  "date_from_url": "2006-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter sends a link to Protein Wisdom’s post about <a href=\"http://www.proteinwisdom.com/index.php/weblog/entry/19864/\">a particularly dumb “rape victim”</a>:</p><blockquote><p>You might be asking yourself: Why would a woman claim rape if she knew a video existed that so thoroughly contradicts her story? If you can figure that out, please let us know. Even after police detectives told her they’d viewed the video, Moonier still refused to recant. She continued to demand that the men be prosecuted.</p><p>Next month an Orange County jury will hear the case against Moonier (now Kerr following her marriage). Interesting footnote: without the videotape, the men could have spent the rest of their lives in state prison if they were convicted of kidnapping and aggravated rape with a handgun. But the woman’s false accusation is a misdemeanor punishable by no more than six months in county jail. It’s only because she took several thousand dollars from a taxpayer-funded victims’ assistance program that she was charged with two felonies.</p></blockquote><p>The thing that I find most amusing about this is that even a psycho-slut such as Mrs. Kerr can manage to find a husband, while the Maureen Dowdniks of the world are loudly bemoaning the fact that men completely fail to appreciate their glorious educations and impressive resumes.  Of course, it’s fairly obvious that if nothing else, the former Miss Moonier is extraordinarily entertaining in the boudoir, although the futility of attempting to prevent her from enthusiastically sharing her charms with the police, the postman, the paperboy, the neighborhood pets and small woodland animals might prove burdensome in time.</p><p>Naturally, our occasional bait noir, <a href=\"http://feministe.us/blog\">la feminista</a> found it impossible to allow this chauvinistic calumny to go unchallenged:</p><blockquote><p>There is a balance: It’s the criminal justice system, and it evaluates rape like it does every other crime. Of course the concept that you mention extends to men accused of rape. Are they denied lawyers? Are any of their Constitutional rights taken away from them? Every crime report has the potential for abuse—and you can fake a robbery a whole lot easier than you can fake a rape. Why make the bar higher for rape? You haven’t given a good reason (and “women can cry rape” isn’t a good reason, given that people can—and do—“cry” nearly every other kind of crime).</p><p>Rape, like nearly every other crime, is sometimes falsely reported. It’s interesting that you choose to highlight this case, when I don’t remember seeing on your blog the many, many stories of people who commit insurance fraud.</p><p>Rape is also one of the most under-reported crimes out there. There’s a ton of shame and stigma still attached to it. I know many women who have been raped and assaulted, and none who have reported it. So no, I’m not going to dedicate space on my blog to highlighting one of the very few false rape reports. It’s a slap in the face to rape victims. It’s a further reminder that no one will believe them.</p></blockquote><p>First, rape isn’t treated like “every other crime”.  There is no such thing as a murder shield law, and those accused of rape are sometimes denied their right to confront their accuser.  The assertion is wildly absurd; if theft was treated like rape, people would be getting convicted without the accuser having to demonstrate that any money had been stolen in the first place.  Murderers would be convicted despite there being no body.</p><p>As for the under-reporting of rape, we’ve already settled that one.  It’s clearly the unicorns.  No one believes most “rape victims” because most of them are lying, or at the very least, wildly exaggerating.  It’s telling to note that in every country where actual evidence is required – including otherwise feminist strongholds such as the Scandinavian countries – the reporting, arrest and conviction rates for rape are signficantly lower than in the United States.  There are three possibilities:</p><p>1.  American men are significantly more prone to commit rape than anywhere else on the planet.<br>2.  Rape is even more underreported in every country from Singapore to Sweden.<br>3.  The feminization of the US justice system combined with the sexual revolution has caused a dramatic increase in false rape reports.</br></br></p><p>Since <em>la feminista</em> is likely a typically parochial, untravelled American, she is probably unaware that the American culture of hooking up is completely foreign to Europe or Asia, with the partial exception of the UK.  This strongly suggests that the reason for the USA’s inordinately high incidence of reported rape is number three, a conclusion which is supported by all of the available evidence that does not simply consist of asking a woman a) has she ever been raped?  b) did she report it? c) what color was the unicorn?</p><p>Rape victims haven’t been stigmatized in the USA for decades.  They are beatified, idolized and made the center of attention by every group of feminist sob sisters on every college campus in the country.  Women love being victims and they love attention, so fake rape is inevitable.  Best just to relax and enjoy it.</p></div>",
  "content_text": "Peter sends a link to Protein Wisdom’s post about\na particularly dumb “rape victim”\n:\nYou might be asking yourself: Why would a woman claim rape if she knew a video existed that so thoroughly contradicts her story? If you can figure that out, please let us know. Even after police detectives told her they’d viewed the video, Moonier still refused to recant. She continued to demand that the men be prosecuted.\nNext month an Orange County jury will hear the case against Moonier (now Kerr following her marriage). Interesting footnote: without the videotape, the men could have spent the rest of their lives in state prison if they were convicted of kidnapping and aggravated rape with a handgun. But the woman’s false accusation is a misdemeanor punishable by no more than six months in county jail. It’s only because she took several thousand dollars from a taxpayer-funded victims’ assistance program that she was charged with two felonies.\nThe thing that I find most amusing about this is that even a psycho-slut such as Mrs. Kerr can manage to find a husband, while the Maureen Dowdniks of the world are loudly bemoaning the fact that men completely fail to appreciate their glorious educations and impressive resumes.  Of course, it’s fairly obvious that if nothing else, the former Miss Moonier is extraordinarily entertaining in the boudoir, although the futility of attempting to prevent her from enthusiastically sharing her charms with the police, the postman, the paperboy, the neighborhood pets and small woodland animals might prove burdensome in time.\nNaturally, our occasional bait noir,\nla feminista\nfound it impossible to allow this chauvinistic calumny to go unchallenged:\nThere is a balance: It’s the criminal justice system, and it evaluates rape like it does every other crime. Of course the concept that you mention extends to men accused of rape. Are they denied lawyers? Are any of their Constitutional rights taken away from them? Every crime report has the potential for abuse—and you can fake a robbery a whole lot easier than you can fake a rape. Why make the bar higher for rape? You haven’t given a good reason (and “women can cry rape” isn’t a good reason, given that people can—and do—“cry” nearly every other kind of crime).\nRape, like nearly every other crime, is sometimes falsely reported. It’s interesting that you choose to highlight this case, when I don’t remember seeing on your blog the many, many stories of people who commit insurance fraud.\nRape is also one of the most under-reported crimes out there. There’s a ton of shame and stigma still attached to it. I know many women who have been raped and assaulted, and none who have reported it. So no, I’m not going to dedicate space on my blog to highlighting one of the very few false rape reports. It’s a slap in the face to rape victims. It’s a further reminder that no one will believe them.\nFirst, rape isn’t treated like “every other crime”.  There is no such thing as a murder shield law, and those accused of rape are sometimes denied their right to confront their accuser.  The assertion is wildly absurd; if theft was treated like rape, people would be getting convicted without the accuser having to demonstrate that any money had been stolen in the first place.  Murderers would be convicted despite there being no body.\nAs for the under-reporting of rape, we’ve already settled that one.  It’s clearly the unicorns.  No one believes most “rape victims” because most of them are lying, or at the very least, wildly exaggerating.  It’s telling to note that in every country where actual evidence is required – including otherwise feminist strongholds such as the Scandinavian countries – the reporting, arrest and conviction rates for rape are signficantly lower than in the United States.  There are three possibilities:\n1.  American men are significantly more prone to commit rape than anywhere else on the planet.\n2.  Rape is even more underreported in every country from Singapore to Sweden.\n3.  The feminization of the US justice system combined with the sexual revolution has caused a dramatic increase in false rape reports.\nSince\nla feminista\nis likely a typically parochial, untravelled American, she is probably unaware that the American culture of hooking up is completely foreign to Europe or Asia, with the partial exception of the UK.  This strongly suggests that the reason for the USA’s inordinately high incidence of reported rape is number three, a conclusion which is supported by all of the available evidence that does not simply consist of asking a woman a) has she ever been raped?  b) did she report it? c) what color was the unicorn?\nRape victims haven’t been stigmatized in the USA for decades.  They are beatified, idolized and made the center of attention by every group of feminist sob sisters on every college campus in the country.  Women love being victims and they love attention, so fake rape is inevitable.  Best just to relax and enjoy it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-02T08:37:00+00:00"
}