{
  "url": "https://voxday.net/2006/03/06/mailvox-doctrinal-grammar_06/",
  "scraped_at": "2026-01-08T21:01:32.278860",
  "title": "Mailvox: doctrinal grammar",
  "date_display": "March 6, 2006",
  "date_iso": "2006-03-06T16:58:00+00:00",
  "date_from_url": "2006-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JJ asks for clarification:</p><blockquote><p>Are you saying that the idea of “servant leadership” should be thrown out entirely or that it’s simply a misapplied concept in the marital relationship?  I’m in agreement with you that the church, in general, has acquiesced to the feminist culture and not stood by its guns in its teachings on marriage.  On the other hand, if we are to follow Christ’s example and there is no such thing as servant leadership, how do we explain what He said in Luke 22:27 (“For who is greater, the one who is at the table or the one who serves? Is it not the one who is at the table?  But I am among you as one who serves.”).</p></blockquote><p>At this point, I’d say to throw it out entirely as poisonous and demonstrably destructive.  My view is that one must apply the noun first – leadership – and then concern oneself with the fine points of the adjective second.  In the absence of <br>the former, the latter is completely irrelevant.</br></p><p>A man who focuses on being a servant to his wife and pays no mind to being her leader is missing the point far more completely than the man who is a harsh and cruel leader.  For, as is pointed out in the Old Testament, the man is destined to not only lead, but oppress.  As a leader, a man will have a natural tendency to be a cruel one without the mitigating effects of Jesus Christ’s teachings on what kind of leader a man should aspire to be.</p><p>There is another option, of course.  The man’s leadership role can be surrendered to an even harsher authority, a third party in the marriage that respects no limits and worships no god except itself.</p></div>",
  "content_text": "JJ asks for clarification:\nAre you saying that the idea of “servant leadership” should be thrown out entirely or that it’s simply a misapplied concept in the marital relationship?  I’m in agreement with you that the church, in general, has acquiesced to the feminist culture and not stood by its guns in its teachings on marriage.  On the other hand, if we are to follow Christ’s example and there is no such thing as servant leadership, how do we explain what He said in Luke 22:27 (“For who is greater, the one who is at the table or the one who serves? Is it not the one who is at the table?  But I am among you as one who serves.”).\nAt this point, I’d say to throw it out entirely as poisonous and demonstrably destructive.  My view is that one must apply the noun first – leadership – and then concern oneself with the fine points of the adjective second.  In the absence of\nthe former, the latter is completely irrelevant.\nA man who focuses on being a servant to his wife and pays no mind to being her leader is missing the point far more completely than the man who is a harsh and cruel leader.  For, as is pointed out in the Old Testament, the man is destined to not only lead, but oppress.  As a leader, a man will have a natural tendency to be a cruel one without the mitigating effects of Jesus Christ’s teachings on what kind of leader a man should aspire to be.\nThere is another option, of course.  The man’s leadership role can be surrendered to an even harsher authority, a third party in the marriage that respects no limits and worships no god except itself.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-06T16:58:00+00:00"
}