{
  "url": "https://voxday.net/2006/03/17/scott-adams-political-historian/",
  "scraped_at": "2026-01-08T21:02:13.819691",
  "title": "Scott Adams: Political Historian",
  "date_display": "March 17, 2006",
  "date_iso": "2006-03-17T14:15:00+00:00",
  "date_from_url": "2006-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>I still favor the traditional system where rich people run the country and convince the morons who live here that <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2006/03/constitutional__1.html\">the voters are really the ones in charge</a>. It’s not a perfect system, but no one has come up with a better one. And it’s fair in the sense that anyone could become rich and abuse the poor.</p></blockquote><p>If a cartoonist can figure it out – admittedly, a very successful cartoonist, but still – you’d think that anyone could, especially with George Bush having spent the last six years governing exactly like a Democrat, only less spendthrifty.</p><p>And for those who would seriously attempt to argue that Democrats would never have been so bold as to invade Afghanistan and Iraq, I believe it should suffice to mention WWI, WWII, the Korean War, the Vietnam War, Somalia and Kosovo.</p></div>",
  "content_text": "I still favor the traditional system where rich people run the country and convince the morons who live here that\nthe voters are really the ones in charge\n. It’s not a perfect system, but no one has come up with a better one. And it’s fair in the sense that anyone could become rich and abuse the poor.\nIf a cartoonist can figure it out – admittedly, a very successful cartoonist, but still – you’d think that anyone could, especially with George Bush having spent the last six years governing exactly like a Democrat, only less spendthrifty.\nAnd for those who would seriously attempt to argue that Democrats would never have been so bold as to invade Afghanistan and Iraq, I believe it should suffice to mention WWI, WWII, the Korean War, the Vietnam War, Somalia and Kosovo.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-03-17T14:15:00+00:00"
}