{
  "url": "https://voxday.net/2006/03/26/umberto-eco-on-migrations/",
  "scraped_at": "2026-01-08T21:03:05.044450",
  "title": "Umberto Eco on migrations",
  "date_display": "March 26, 2006",
  "date_iso": "2006-03-26T14:32:00+00:00",
  "date_from_url": "2006-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This essay, entitled “Migrazioni”, was published in <i>La Bustina Di Minerva</i> in 1990</p><blockquote class=\"tr_bq\"><p> Last Tuesday, while all the newspapers were dedicating numerous articles<br> to the tense events in Florence, there appeared in La Repubblica a<br> cartoon by Bucchi: it showed two silhouettes, an enormous Africa looming<br> over a miniscule Italy; next to it was a Florence that was represented<br> only by a small dot.  The caption was: “Where do we want more police?”<br> Meanwhile, the Corriere della Sera summed up the story of the climactic<br> changes on our planet over the last six thousand years.  From this<br> review it emerged that the fertility or the aridity of a continent<br> inspired vast migrations that changed the face of the planet and created<br> the civilizations that today we know, experience directly or study<br> through history.</br></br></br></br></br></br></br></br></br></br></p><p>Today, with regards to the so-called problems of<br> the “foreigners” (a gracious euphemism that, as has already been noted,<br> must also include the Swiss and the tourists from Texas), an issue that<br> is of interest to all of the nations of Europe, we continue to reason<br> as if we find ourself facing a phenomenon of immigration.  One has<br> immigration when some hundreds of thousands of citizens of one<br> overpopulated country want to go to live in another country, (for<br> example, the Italians in Australia).  And it is natural that the hosting<br> country must regulate the flow of immigration according to its ability<br> to incorporate them, which is why it has the right to arrest or expel<br> those immigrants that prove criminal, just as it has to arrest its own<br> criminal citizens who rob the rich tourists carrying their precious<br> valuables.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>But today, in Europe, we do not find ourselves facing a<br> phenomenon of immigration.  We find ourselves facing a phenomenon of<br> migration.  To be sure, it does not have the violent and sweeping aspect<br> of the Germanic invasions in Italy, France and Spain, it does not have<br> the virulence of the Arab expansions following the Hegira,  nor the<br> slowness of the imprecise flows that carried the dark peoples from Asia<br> to Polynesia and perhaps to America.  But it is another chapter in the<br> story of the planet that has seen civilizations form and dissolve on the<br> waves of the great migratory flows, first from the West to the East<br> (but we know very little about that), after from the East to the West<br> beginning with the millennial movement of the surge from the Indus to<br> the Pillars of Hercules, (the straights of Gibraltar), and afterwards in<br> the fourth century from the Pillars of Hercules to California and<br> Tierra del Fuego, (Argentina and Patagonia).</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Now the migration,<br> unnoticed because it comes in the guise of an airplane trip and a stop<br> at the immigration office at the police headquarters, or perhaps by a<br> clandestine boat, comes to the North from an arid and hungry South.  It<br> feels like an immigration, but it is a migration, a historic event of<br> incalcuable scope.  They do not travel in such a horde that the grass<br> will no longer grow where their horses have trampled, but in discrete<br> clusters that attract little notice, nevertheless, the process will not<br> take centuries or millenia but decades.  And like all the great<br> migrations, it will finally result in a rearrangement of the ethnicity<br> of the land of their destination, an inexorable change of costumes, an<br> unarrestable hybridization that noticeably mutates the color of the<br> skin, the hair and the eyes of the population, as even a small number of<br> Normans left behind their blond hair and blue eyes in Sicily.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The<br> great migrations, at least in historic periods, were feared: at first<br> they tried to avoid them, the Roman emperors erected one rampart here<br> and another one there, they sent the legions ahead to defeat the<br> advancing intruders, after they came to bargain and discipline the first<br> settlements, therefore offering Roman citizenship to all the subjects<br> of the Empire, but in the end, the ruin of the Romans formed the<br> so-called romano-barbarian kingdoms that were the origins of our<br> European countries, of the languages that we jealously speak today, of<br> our political and social institutions.  When on the Lombardian highway,<br> we find places that we call, in Italian fashion names like Usmate or<br> Biandrate, we have forgotten that they were descendants of the<br> Longobards.  On the other hand, from where do we get those Etruscan<br> Smiles we find so often in central Italy?</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The great migrations cannot be stopped.  We simply must prepare ourselves to live in a new season of Afro-European culture.</p></blockquote></div>",
  "content_text": "This essay, entitled “Migrazioni”, was published in\nLa Bustina Di Minerva\nin 1990\nLast Tuesday, while all the newspapers were dedicating numerous articles\nto the tense events in Florence, there appeared in La Repubblica a\ncartoon by Bucchi: it showed two silhouettes, an enormous Africa looming\nover a miniscule Italy; next to it was a Florence that was represented\nonly by a small dot.  The caption was: “Where do we want more police?”\nMeanwhile, the Corriere della Sera summed up the story of the climactic\nchanges on our planet over the last six thousand years.  From this\nreview it emerged that the fertility or the aridity of a continent\ninspired vast migrations that changed the face of the planet and created\nthe civilizations that today we know, experience directly or study\nthrough history.\nToday, with regards to the so-called problems of\nthe “foreigners” (a gracious euphemism that, as has already been noted,\nmust also include the Swiss and the tourists from Texas), an issue that\nis of interest to all of the nations of Europe, we continue to reason\nas if we find ourself facing a phenomenon of immigration.  One has\nimmigration when some hundreds of thousands of citizens of one\noverpopulated country want to go to live in another country, (for\nexample, the Italians in Australia).  And it is natural that the hosting\ncountry must regulate the flow of immigration according to its ability\nto incorporate them, which is why it has the right to arrest or expel\nthose immigrants that prove criminal, just as it has to arrest its own\ncriminal citizens who rob the rich tourists carrying their precious\nvaluables.\nBut today, in Europe, we do not find ourselves facing a\nphenomenon of immigration.  We find ourselves facing a phenomenon of\nmigration.  To be sure, it does not have the violent and sweeping aspect\nof the Germanic invasions in Italy, France and Spain, it does not have\nthe virulence of the Arab expansions following the Hegira,  nor the\nslowness of the imprecise flows that carried the dark peoples from Asia\nto Polynesia and perhaps to America.  But it is another chapter in the\nstory of the planet that has seen civilizations form and dissolve on the\nwaves of the great migratory flows, first from the West to the East\n(but we know very little about that), after from the East to the West\nbeginning with the millennial movement of the surge from the Indus to\nthe Pillars of Hercules, (the straights of Gibraltar), and afterwards in\nthe fourth century from the Pillars of Hercules to California and\nTierra del Fuego, (Argentina and Patagonia).\nNow the migration,\nunnoticed because it comes in the guise of an airplane trip and a stop\nat the immigration office at the police headquarters, or perhaps by a\nclandestine boat, comes to the North from an arid and hungry South.  It\nfeels like an immigration, but it is a migration, a historic event of\nincalcuable scope.  They do not travel in such a horde that the grass\nwill no longer grow where their horses have trampled, but in discrete\nclusters that attract little notice, nevertheless, the process will not\ntake centuries or millenia but decades.  And like all the great\nmigrations, it will finally result in a rearrangement of the ethnicity\nof the land of their destination, an inexorable change of costumes, an\nunarrestable hybridization that noticeably mutates the color of the\nskin, the hair and the eyes of the population, as even a small number of\nNormans left behind their blond hair and blue eyes in Sicily.\nThe\ngreat migrations, at least in historic periods, were feared: at first\nthey tried to avoid them, the Roman emperors erected one rampart here\nand another one there, they sent the legions ahead to defeat the\nadvancing intruders, after they came to bargain and discipline the first\nsettlements, therefore offering Roman citizenship to all the subjects\nof the Empire, but in the end, the ruin of the Romans formed the\nso-called romano-barbarian kingdoms that were the origins of our\nEuropean countries, of the languages that we jealously speak today, of\nour political and social institutions.  When on the Lombardian highway,\nwe find places that we call, in Italian fashion names like Usmate or\nBiandrate, we have forgotten that they were descendants of the\nLongobards.  On the other hand, from where do we get those Etruscan\nSmiles we find so often in central Italy?\nThe great migrations cannot be stopped.  We simply must prepare ourselves to live in a new season of Afro-European culture.",
  "tags": [
    "Eco"
  ],
  "categories": [],
  "sitemap_lastmod": "2006-03-26T13:32:00+00:00"
}