{
  "url": "https://voxday.net/2008/10/29/death-by-ice/",
  "scraped_at": "2026-01-08T22:39:23.377925",
  "title": "Death by ice",
  "date_display": "October 29, 2008",
  "date_iso": "2008-10-29T15:41:00+00:00",
  "date_from_url": "2008-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If these polls are historically accurate, then Obama is going down in flames next Tuesday:</p><blockquote><p>TRICK OR TREAT: GALLUP SAYS OBAMA +2</p><p>The <a href=\"http://www.rasmussenreports.com/public_content/politics/election_20082/2008_presidential_election/daily_presidential_tracking_poll\">Rasmussen Reports daily Presidential Tracking Poll</a> for Wednesday shows Barack Obama attracting 50% of the vote nationwide while John McCain earns 47%.</p></blockquote><p>The state-by-state is the important count, of course, but state polls tend to lag the national ones by a few weeks.  Always shift the polls by five percent to account for the pollsters’ pro-Democratic interpretations.  And remember, “enthusiastic young voters” tend to talk about voting a lot more than they vote.</p><p>UPDATE – As I said: <i>“Analysts have predicted that new voters, young voters and Hispanic voters <a href=\"http://www.lvrj.com/news/33494194.html\">will turn out in record numbers</a> in this election. But as Nevadans continue to flock to the polls, turnout among those three groups is lagging, at least in the early going.  While turnout statewide was nearly 25 percent through Sunday, it was just 20 percent among Hispanic voters, 14 percent among voters under 30 and 15 percent among those who didn’t vote in the last three elections, according to an analysis of state early voting records through Sunday prepared by America Votes, an organization that works to mobilize voters.”</i></p></div>",
  "content_text": "If these polls are historically accurate, then Obama is going down in flames next Tuesday:\nTRICK OR TREAT: GALLUP SAYS OBAMA +2\nThe\nRasmussen Reports daily Presidential Tracking Poll\nfor Wednesday shows Barack Obama attracting 50% of the vote nationwide while John McCain earns 47%.\nThe state-by-state is the important count, of course, but state polls tend to lag the national ones by a few weeks.  Always shift the polls by five percent to account for the pollsters’ pro-Democratic interpretations.  And remember, “enthusiastic young voters” tend to talk about voting a lot more than they vote.\nUPDATE – As I said:\n“Analysts have predicted that new voters, young voters and Hispanic voters\nwill turn out in record numbers\nin this election. But as Nevadans continue to flock to the polls, turnout among those three groups is lagging, at least in the early going.  While turnout statewide was nearly 25 percent through Sunday, it was just 20 percent among Hispanic voters, 14 percent among voters under 30 and 15 percent among those who didn’t vote in the last three elections, according to an analysis of state early voting records through Sunday prepared by America Votes, an organization that works to mobilize voters.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-29T15:41:00+00:00"
}