{
  "url": "https://voxday.net/2008/10/30/decline-of-western-civilization-2/",
  "scraped_at": "2026-01-08T22:39:30.326519",
  "title": "The Decline of Western Civilization",
  "date_display": "October 30, 2008",
  "date_iso": "2008-10-30T15:15:00+00:00",
  "date_from_url": "2008-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m going to be a guest on the Straight Talk with Jerry Hughes show today at 4 PM EST <a href=\"http://www.accentradionetwork.com/chooseplayer.htm\">in case you’re interested in listening live</a>, where we will be discussing the aforementioned.</p><p>And on a not completely unrelated note, you may be amused to read yet another left-liberal “it’s for the children” plea, albeit in this case, it’s a unique one that’s actually made on behalf of legalized homogamy.  Oh, and I regret to inform you that if your perspective happen to be in accordance with social norms that have prevailed for the entire course of Western civilization, then you are “<a href=\"http://whatever.scalzi.com/2008/10/30/what-prop-8-threatens-existing-marriages-you-dont-say/\">monstrous, horrible, hateful and bigoted</a>“.</p><p>Just so you know.</p><p>UPDATE – Added bonus.  Folks had to pay six grand <a href=\"http://scienceblogs.com/principles/2008/10/the_monkey_dance.php\">to see Chad Orzel dance</a> on the Internet, but Mr. Scalzi is kind enough <a href=\"http://whatever.scalzi.com/2008/10/30/what-prop-8-threatens-existing-marriages-you-dont-say/\">to do it for free</a>!</p></div>",
  "content_text": "I’m going to be a guest on the Straight Talk with Jerry Hughes show today at 4 PM EST\nin case you’re interested in listening live\n, where we will be discussing the aforementioned.\nAnd on a not completely unrelated note, you may be amused to read yet another left-liberal “it’s for the children” plea, albeit in this case, it’s a unique one that’s actually made on behalf of legalized homogamy.  Oh, and I regret to inform you that if your perspective happen to be in accordance with social norms that have prevailed for the entire course of Western civilization, then you are “\nmonstrous, horrible, hateful and bigoted\n“.\nJust so you know.\nUPDATE – Added bonus.  Folks had to pay six grand\nto see Chad Orzel dance\non the Internet, but Mr. Scalzi is kind enough\nto do it for free\n!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-30T15:15:00+00:00"
}