{
  "url": "https://voxday.net/2008/10/25/democracy-in-new-york/",
  "scraped_at": "2026-01-08T22:38:59.410338",
  "title": "Democracy in New York",
  "date_display": "October 25, 2008",
  "date_iso": "2008-10-25T14:41:00+00:00",
  "date_from_url": "2008-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The political class isn’t even <a href=\"http://cityroom.blogs.nytimes.com/2008/10/23/council-to-debate-term-limits-change/?hp\">bothering to pretend anymore</a>:</p><blockquote><p>After a spirited, emotional and at times raucous debate, the New York City Council voted, 29 to 22, on Thursday afternoon to extend term limits, allowing Mayor Michael R. Bloomberg to seek re-election next year and undoing the result of two voter referendums that had imposed a limit of two four-year terms.</p></blockquote><p>Even in the EUSSR, they make the people vote until they get it right.  In the USA, on the other hand, they simply change the laws at will and run roughshod over the will of the people.  And notice how “crisis” is used to justify this legal legerdemain: <i>“Supporters of the bill said the dire economic situation confronting the city — and the possibility of multibillion-dollar budget shortfalls — demanded continuity of leadership.”</i></p></div>",
  "content_text": "The political class isn’t even\nbothering to pretend anymore\n:\nAfter a spirited, emotional and at times raucous debate, the New York City Council voted, 29 to 22, on Thursday afternoon to extend term limits, allowing Mayor Michael R. Bloomberg to seek re-election next year and undoing the result of two voter referendums that had imposed a limit of two four-year terms.\nEven in the EUSSR, they make the people vote until they get it right.  In the USA, on the other hand, they simply change the laws at will and run roughshod over the will of the people.  And notice how “crisis” is used to justify this legal legerdemain:\n“Supporters of the bill said the dire economic situation confronting the city — and the possibility of multibillion-dollar budget shortfalls — demanded continuity of leadership.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-25T13:41:00+00:00"
}