{
  "url": "https://voxday.net/2008/10/30/fantasies-of-would-be-philosopher-kings/",
  "scraped_at": "2026-01-08T22:39:27.012313",
  "title": "Fantasies of the would-be philosopher-kings",
  "date_display": "October 30, 2008",
  "date_iso": "2008-10-30T00:30:00+00:00",
  "date_from_url": "2008-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some readers didn’t understand why I included two chapters dealing with science in TIA. <a href=\"http://scienceblogs.com/pharyngula/2008/10/the_election_is_all_but_over_n.php#comments\">This endorsement of Obama</a> should suffice to explain their relevance to those who didn’t grasp the connection between science fetishism and the New Atheists.  Read it and see if you don’t agree that each and every individual who endorses it should be stripped of their science degrees and their intellectual pretensions:</p><blockquote><p>Science is a way of governing, not just something to be governed. Science offers a methodology and philosophy rooted in evidence, kept in check by persistent inquiry, and bounded by the constraints of a self-critical and rigorous method. Science is a lens through which we can and should visualize and solve complex problems, organize government and multilateral bodies, establish international alliances, inspire national pride, restore positive feelings about America around the globe, embolden democracy, and ultimately, lead the world. More than anything, what this lens offers the next administration is a limitless capacity to handle all that comes its way, no matter how complex or unanticipated.</p></blockquote><p>Science, is there anything it can’t do?  It sounds amazingly like the parody of the Corinthians-style ode to science I pointed out in the chapter entitled “Darwin’s Judas”.  Even more amazing, these fetishists truly don’t see how they have made a quasi-religion of the object of their adoration.  On a closely related note, one of our more thoughtful critics, Dominic Saltarelli, emailed me yesterday:</p><p><i>While I’m sure there’s plenty for us to disagree on in other matters, I just took a swim in some “secular, liberal, progressive” waters, and am still washing the sewage off.  I tried talking a little sense into them regarding economics, because this is a crowd that sees the current economic situation as a fundamental failure of capitalism.  So I tried injecting <a href=\"http://onegoodmove.org/1gm/1gmarchive/2008/10/the_problem_wit_1.html#comments\">some facts</a> into <a href=\"http://onegoodmove.org/1gm/1gmarchive/2008/10/links_with_your_845.html#comments\">the discourse</a></i></p><p>It was like hitting vampires with sunlight.  The venom some of these people resorted to in defense of just a damn economic model was, disheartening, to say the least.  Having had this experience, whenever some refers to “Atheism as a religion” or to an “atheistic religion”, I think I know exactly what they’re talking about now, and it isn’t pretty nor something I wish to be associated with.</p><p>Just wanted to let you know, that I feel your pain.</p><p>He does indeed.  Science fetishists, economically vacuuous secularists, liberal progressives… they’re not precisely the same, but there’s certainly a significant amount of overlap.  And in each and every case, there is a near complete inability to apply even the most rudimentary logic to the subject at hand as well as an intense, emotional reaction to having their ignorance punctured with the verifiable facts.</p><p>And all of this is setting aside the obvious absurdity of the idea that the scientific socialist Obama could possibly be a  champion of Reason and Science.</p></div>",
  "content_text": "Some readers didn’t understand why I included two chapters dealing with science in TIA.\nThis endorsement of Obama\nshould suffice to explain their relevance to those who didn’t grasp the connection between science fetishism and the New Atheists.  Read it and see if you don’t agree that each and every individual who endorses it should be stripped of their science degrees and their intellectual pretensions:\nScience is a way of governing, not just something to be governed. Science offers a methodology and philosophy rooted in evidence, kept in check by persistent inquiry, and bounded by the constraints of a self-critical and rigorous method. Science is a lens through which we can and should visualize and solve complex problems, organize government and multilateral bodies, establish international alliances, inspire national pride, restore positive feelings about America around the globe, embolden democracy, and ultimately, lead the world. More than anything, what this lens offers the next administration is a limitless capacity to handle all that comes its way, no matter how complex or unanticipated.\nScience, is there anything it can’t do?  It sounds amazingly like the parody of the Corinthians-style ode to science I pointed out in the chapter entitled “Darwin’s Judas”.  Even more amazing, these fetishists truly don’t see how they have made a quasi-religion of the object of their adoration.  On a closely related note, one of our more thoughtful critics, Dominic Saltarelli, emailed me yesterday:\nWhile I’m sure there’s plenty for us to disagree on in other matters, I just took a swim in some “secular, liberal, progressive” waters, and am still washing the sewage off.  I tried talking a little sense into them regarding economics, because this is a crowd that sees the current economic situation as a fundamental failure of capitalism.  So I tried injecting\nsome facts\ninto\nthe discourse\nIt was like hitting vampires with sunlight.  The venom some of these people resorted to in defense of just a damn economic model was, disheartening, to say the least.  Having had this experience, whenever some refers to “Atheism as a religion” or to an “atheistic religion”, I think I know exactly what they’re talking about now, and it isn’t pretty nor something I wish to be associated with.\nJust wanted to let you know, that I feel your pain.\nHe does indeed.  Science fetishists, economically vacuuous secularists, liberal progressives… they’re not precisely the same, but there’s certainly a significant amount of overlap.  And in each and every case, there is a near complete inability to apply even the most rudimentary logic to the subject at hand as well as an intense, emotional reaction to having their ignorance punctured with the verifiable facts.\nAnd all of this is setting aside the obvious absurdity of the idea that the scientific socialist Obama could possibly be a  champion of Reason and Science.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-30T00:30:00+00:00"
}