{
  "url": "https://voxday.net/2008/10/07/how-to-make-depression/",
  "scraped_at": "2026-01-08T22:37:16.143970",
  "title": "How to make a depression",
  "date_display": "October 7, 2008",
  "date_iso": "2008-10-07T15:12:00+00:00",
  "date_from_url": "2008-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>FDR <a href=\"http://newsroom.ucla.edu/portal/ucla/FDR-s-Policies-Prolonged-Depression-5409.aspx?RelNum=5409\">showed the way</a>:</p><blockquote><p>Two UCLA economists say they have figured out why the Great Depression dragged on for almost 15 years, and they blame a suspect previously thought to be beyond reproach: President Franklin D. Roosevelt.  After scrutinizing Roosevelt’s record for four years, Harold L. Cole and Lee E. Ohanian conclude in a new study that New Deal policies signed into law 71 years ago thwarted economic recovery for seven long years.</p></blockquote><p>This is interesting news that happens to be highly relevant, as Voxiversity II is going to be reading and discussing Murray Rothbard’s <i>America’s Great Depression</i>.  We’ll start the readings on Monday the 27th, but if you want to get an early jump you can <a href=\"http://mises.org/rothbard/agd/contents.asp\">download the entire book on PDF</a> or bookmark the online text at the Mises Institute.  However, Voxiversity I participants tended to find having the physical text on hand to be helpful, so you may wish to consider <a href=\"http://mises.org/store/Americas-Great-Depression-P63C1.aspx\">ordering the book from the Mises bookstore</a>.</p><p>Full disclosure: I have no connection with the Mises Institute, they do not provide me with their literature, and I make nothing from their book sales.</p></div>",
  "content_text": "FDR\nshowed the way\n:\nTwo UCLA economists say they have figured out why the Great Depression dragged on for almost 15 years, and they blame a suspect previously thought to be beyond reproach: President Franklin D. Roosevelt.  After scrutinizing Roosevelt’s record for four years, Harold L. Cole and Lee E. Ohanian conclude in a new study that New Deal policies signed into law 71 years ago thwarted economic recovery for seven long years.\nThis is interesting news that happens to be highly relevant, as Voxiversity II is going to be reading and discussing Murray Rothbard’s\nAmerica’s Great Depression\n.  We’ll start the readings on Monday the 27th, but if you want to get an early jump you can\ndownload the entire book on PDF\nor bookmark the online text at the Mises Institute.  However, Voxiversity I participants tended to find having the physical text on hand to be helpful, so you may wish to consider\nordering the book from the Mises bookstore\n.\nFull disclosure: I have no connection with the Mises Institute, they do not provide me with their literature, and I make nothing from their book sales.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-07T14:12:00+00:00"
}