{
  "url": "https://voxday.net/2008/10/24/in-your-base-shorting-your-stokks/",
  "scraped_at": "2026-01-08T22:38:52.162738",
  "title": "In your base, shorting your stokks",
  "date_display": "October 24, 2008",
  "date_iso": "2008-10-24T12:57:00+00:00",
  "date_from_url": "2008-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve mostly stayed out of this bear since I knew the up days would be vicious – although I had no idea they’d be 11 percent vicious like earlier this month!  But it’s fun to keep your toes in for practice, if nothing else, and those 09 NDX 1200 puts are looking <a href=\"http://biz.yahoo.com/ap/081024/wall_street.html\">pretty happy right now</a>.</p><blockquote><p>Wall Street headed for another precipitous drop Friday as fears of a punishing global recession stirred panic among investors and sent world financial markets into a tailspin. The Dow Jones industrial average futures fell 550 points, triggering a halt in selling of stock future contracts.</p></blockquote><p>Did you ever stop to wonder why, if it’s supposed to be a free market, they only freeze the markets when they go down?  Anyhow, there should be a serious bear rally starting next week, so if you’re still in, next month would probably be the time to get out once there’s a 50 percent retracement of whatever turns out to mark the short-term bottom.</p><p>And if you ever wondered why this happened, <a href=\"http://www.paradise-paradigm.com/res/GrandTheft.html\">the explanation is pretty simple</a>: <i>“Nearly a century ago, two audacious mechanisms were put into place to drain wealth and power from the American people and to funnel that wealth and power to an elite. Today’s crisis has arisen because essentially all of our wealth and power has by now been taken from us, and the illusion of normalcy can no longer be maintained.”</i></p></div>",
  "content_text": "I’ve mostly stayed out of this bear since I knew the up days would be vicious – although I had no idea they’d be 11 percent vicious like earlier this month!  But it’s fun to keep your toes in for practice, if nothing else, and those 09 NDX 1200 puts are looking\npretty happy right now\n.\nWall Street headed for another precipitous drop Friday as fears of a punishing global recession stirred panic among investors and sent world financial markets into a tailspin. The Dow Jones industrial average futures fell 550 points, triggering a halt in selling of stock future contracts.\nDid you ever stop to wonder why, if it’s supposed to be a free market, they only freeze the markets when they go down?  Anyhow, there should be a serious bear rally starting next week, so if you’re still in, next month would probably be the time to get out once there’s a 50 percent retracement of whatever turns out to mark the short-term bottom.\nAnd if you ever wondered why this happened,\nthe explanation is pretty simple\n:\n“Nearly a century ago, two audacious mechanisms were put into place to drain wealth and power from the American people and to funnel that wealth and power to an elite. Today’s crisis has arisen because essentially all of our wealth and power has by now been taken from us, and the illusion of normalcy can no longer be maintained.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-24T11:57:00+00:00"
}