{
  "url": "https://voxday.net/2008/10/26/more-obama-weirdness/",
  "scraped_at": "2026-01-08T22:39:04.907280",
  "title": "More Obama weirdness",
  "date_display": "October 26, 2008",
  "date_iso": "2008-10-26T11:58:00+00:00",
  "date_from_url": "2008-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Edwards may not have been the only Democratic candidate for president <a href=\"http://www.stoptheaclu.com/archives/2008/10/12/did-obama-have-an-affair-with-vera-baker-recently/\">having an affair</a>:</p><blockquote><p>Who is Vera Baker?</p><p>Some people in Chicago claim she was Obama’s Finance Director for his 2004 Senate campaign. FEC Senate campaign records show she was paid a pretty penny as “Finance Director”.  However, people familiar with Obama’s 2004 Senate campaign say Claire Serdiuk was Obama’s Finance Director. Looking through everything we can see online for that 2004 campaign, Claire Serdiuk is consistently listed as the Finance Director – because that’s what she was.</p><p>There’s no mention of Vera Baker…but Vera Baker was paid as the “Finance Director” too.  And then, suddenly, Vera Baker was relocated to New York.</p><p>Right around the time Michelle Obama got incredibly angry about something. We know it was hard to tell, because Michelle’s angry about something on a good day…but this was EXTRA angry.  And then, even more suddenly, Vera Baker was relocated to the island of Martinique, where she remains.</p></blockquote><p>Better yet, she’s “working” there on the dime of “someone who is a big, shiny part of the dirty Chicago political machine”.  And Obama is suddenly too busy to campaign because his grandmother is dying as a result of injuries she incurred when he threw her under the bus this summer.  This could be just another Internet rumor, on the other hand, this actually looks more inherently suspicious than the Edwards rumors that turned out to be true.  Maybe if we’re lucky, the mainstream media will stop investigating Joe the Plumber long enough to send someone to Martinique before Miss Baker accidentally overdoses on cocaine.</p><p><a href=\"http://www.blackfive.net/main/2008/10/the-wolf-on-oba.html\">Blackfive has an interview with a Democrat who’s up on the expose</a> and promises more on Monday.  It will be interesting to see if this and the African Press International report about Michelle Obama checks out or not.  However, his source believes the media will break the scandal AFTER the election in order to serve their own interests by dragging it out.  If Obama loses, then the story ends.  If he wins, however, it’s a story that lasts months.  Anyhow, it’s just as likely that she’s making herself scarce because she was involved with illegal fundraising as with the candidate.</p><p>Either way, consider the thought of President Biden… now that would be a gift that would never stop giving!</p><p>UPDATE – I just received an email informing me that ABC News has been privy to this story for some time now, and that Vera Baker is not the only woman that may have been involved with Sen. Obama.</p></div>",
  "content_text": "John Edwards may not have been the only Democratic candidate for president\nhaving an affair\n:\nWho is Vera Baker?\nSome people in Chicago claim she was Obama’s Finance Director for his 2004 Senate campaign. FEC Senate campaign records show she was paid a pretty penny as “Finance Director”.  However, people familiar with Obama’s 2004 Senate campaign say Claire Serdiuk was Obama’s Finance Director. Looking through everything we can see online for that 2004 campaign, Claire Serdiuk is consistently listed as the Finance Director – because that’s what she was.\nThere’s no mention of Vera Baker…but Vera Baker was paid as the “Finance Director” too.  And then, suddenly, Vera Baker was relocated to New York.\nRight around the time Michelle Obama got incredibly angry about something. We know it was hard to tell, because Michelle’s angry about something on a good day…but this was EXTRA angry.  And then, even more suddenly, Vera Baker was relocated to the island of Martinique, where she remains.\nBetter yet, she’s “working” there on the dime of “someone who is a big, shiny part of the dirty Chicago political machine”.  And Obama is suddenly too busy to campaign because his grandmother is dying as a result of injuries she incurred when he threw her under the bus this summer.  This could be just another Internet rumor, on the other hand, this actually looks more inherently suspicious than the Edwards rumors that turned out to be true.  Maybe if we’re lucky, the mainstream media will stop investigating Joe the Plumber long enough to send someone to Martinique before Miss Baker accidentally overdoses on cocaine.\nBlackfive has an interview with a Democrat who’s up on the expose\nand promises more on Monday.  It will be interesting to see if this and the African Press International report about Michelle Obama checks out or not.  However, his source believes the media will break the scandal AFTER the election in order to serve their own interests by dragging it out.  If Obama loses, then the story ends.  If he wins, however, it’s a story that lasts months.  Anyhow, it’s just as likely that she’s making herself scarce because she was involved with illegal fundraising as with the candidate.\nEither way, consider the thought of President Biden… now that would be a gift that would never stop giving!\nUPDATE – I just received an email informing me that ABC News has been privy to this story for some time now, and that Vera Baker is not the only woman that may have been involved with Sen. Obama.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-26T11:58:00+00:00"
}