{
  "url": "https://voxday.net/2008/10/22/no-envy-no-angst_22/",
  "scraped_at": "2026-01-08T22:38:40.470589",
  "title": "No envy, no angst",
  "date_display": "October 22, 2008",
  "date_iso": "2008-10-22T17:30:00+00:00",
  "date_from_url": "2008-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you wonder <a href=\"http://www.anti-shurtugal.com/wordpress/?p=53\">why I don’t worry</a> about my book sales:</p><blockquote><p>There’s a decided lack of plot in the above synopsis, and it’s not because I want to withhold spoilers. Truth is, there really isn’t a plot in <i>Twilight</i>. Nearly 400 out of 500 pages are devoted to Bella and Edward cuddling, professing their undying love for each other, and generally staring at each other dewey-eyed. In other words, oodles and oodles of this:</p><p><i>“His angel’s face was only a few inches from mine. I might have — should have — flinched away from his uexpected closeness, but I was unable to move. His golden eyes mesmerized me.”What are you afraid of, then?” he whispered intently.But I couldn’t answer. As I had just that once before, I smelled his cool breath in my face. Sweet, delicious, the scent made my mouth water. It was unlike anything else. Instinctively, unthinkingly, I leaned closer, inhaling.”</i></p><p>Sweet smelling…breath? Is this for real? I bet he craps rainbows, too. Just sayin’.</p><p>Seriously people, this is it. Between scenes of Bella playing Susie Homemaker to her father and wondering at her inexplicable popularity, this is <i>Twilight</i>.</p></blockquote><p>Given the rather exotic nature of <i>Summa Elvetica</i> I suspect no one will ever doubt my professed lack of ambition to make the NYT bestseller’s list again.  The truth is, if I wanted to maximize my pursuit of the consumer entertainment dollar, I’d much prefer to build an x-rated empire and develop games like <i>Strip Club Tycoon</i> and <i>Rape 3D</i> than write this sort of banal and brainless schlock.</p><p>Speaking of porn and <i>Twilight</i>, I’m reminded of the writer who wondered what was going to happen when a generation of young men accustomed to acrobatic performances by silicone-enhanced actresses runs headlong into a generation of young women expecting the human equivalent of gentlemanly teetotalling vampires.  My impression is that moment of two cultures colliding will be the perfect moment to introduce Robogirl.</p><p>And, of course, bid adieu to Homo Technicas.</p></div>",
  "content_text": "Lest you wonder\nwhy I don’t worry\nabout my book sales:\nThere’s a decided lack of plot in the above synopsis, and it’s not because I want to withhold spoilers. Truth is, there really isn’t a plot in\nTwilight\n. Nearly 400 out of 500 pages are devoted to Bella and Edward cuddling, professing their undying love for each other, and generally staring at each other dewey-eyed. In other words, oodles and oodles of this:\n“His angel’s face was only a few inches from mine. I might have — should have — flinched away from his uexpected closeness, but I was unable to move. His golden eyes mesmerized me.”What are you afraid of, then?” he whispered intently.But I couldn’t answer. As I had just that once before, I smelled his cool breath in my face. Sweet, delicious, the scent made my mouth water. It was unlike anything else. Instinctively, unthinkingly, I leaned closer, inhaling.”\nSweet smelling…breath? Is this for real? I bet he craps rainbows, too. Just sayin’.\nSeriously people, this is it. Between scenes of Bella playing Susie Homemaker to her father and wondering at her inexplicable popularity, this is\nTwilight\n.\nGiven the rather exotic nature of\nSumma Elvetica\nI suspect no one will ever doubt my professed lack of ambition to make the NYT bestseller’s list again.  The truth is, if I wanted to maximize my pursuit of the consumer entertainment dollar, I’d much prefer to build an x-rated empire and develop games like\nStrip Club Tycoon\nand\nRape 3D\nthan write this sort of banal and brainless schlock.\nSpeaking of porn and\nTwilight\n, I’m reminded of the writer who wondered what was going to happen when a generation of young men accustomed to acrobatic performances by silicone-enhanced actresses runs headlong into a generation of young women expecting the human equivalent of gentlemanly teetotalling vampires.  My impression is that moment of two cultures colliding will be the perfect moment to introduce Robogirl.\nAnd, of course, bid adieu to Homo Technicas.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-22T16:30:00+00:00"
}