{
  "url": "https://voxday.net/2008/10/18/ocs-vd-challenge/",
  "scraped_at": "2026-01-08T22:38:14.747379",
  "title": "The OC’s VD challenge",
  "date_display": "October 18, 2008",
  "date_iso": "2008-10-18T08:31:00+00:00",
  "date_from_url": "2008-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No, it’s not a competition involving women of free favors and extensive bacterial collections, merely the latest spin on <a href=\"http://rantingroom.blogspot.com/2008/10/friday-challenge-101708.html\">his weekly literary challenge</a> for aspiring writers:</p><blockquote><p>What do I think? I think it’s a great idea! Not only that, I’ve discussed this with Vox, and he (lower case ‘h’) has given it his blessing. Ergo, this week’s Friday Challenge is: <b>write a short story or pastiche set in one of the worlds of, and using the almost but not quite inimitable style of, the one and only Vox Day!</b></p></blockquote><p>Please don’t post any such challenge entries here, because in order for an entry to be considered valid and judged by the OC’s elite panel of experts it must be posted <a href=\"http://rantingroom.blogspot.com/2008/10/friday-challenge-101708.html\">at the OC’s Ranting Room</a>.  I have no vote in selecting the winner, however, I will post both the winning entry as well as my favorite entry here on VP.  These may or may not be the same one.  Also, if you’re a writer, it’s worth noting that OpenOffice 3.0 is now available for download.  I’ve written my last three books using OpenOffice as well as all of my columns since 2002, so there’s really no justification for throwing away money on Microsoft anymore.  Click the banner below to download the new 3.0.0 and don’t forget to add the extension for PDF importing.  I’ll have a review of it once I have the chance to play with it for a while.</p><p><a href=\"http://www.openoffice.org\"><noscript><img alt=\" Use OpenOffice.org\" border=\"0\" decoding=\"async\" src=\"http://marketing.openoffice.org/art/galleries/marketing/web_banners/nicu/468x60_3.png\" title=\"Use OpenOffice.org\"/></noscript><img alt=\" Use OpenOffice.org\" border=\"0\" class=\"lazyload\" data-src=\"http://marketing.openoffice.org/art/galleries/marketing/web_banners/nicu/468x60_3.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" title=\"Use OpenOffice.org\"/></a></p><p>It may be helpful to keep in mind that since I do not happen to be an author of wereseal fiction myself, a torrid romance between a strong, independent, but lonely lighthouse keeper and a handsome, rugged, but respectful wereseal is unlikely to prove successful, however well-executed.  This, on the other hand, is an actual example, albeit one tainted by the OC himself:</p><p><i><u>Aboard Assault Shuttle LST(N)-14<br>7 November 2069, 06:00 GMT</br></u></i></p><p>“No, you’re wrong!” Faroukh ibn Yusef exclaimed to Walid ibn Walid.  “The Prophet prohibited images of people because we are made in the image of Allah, who is infinite.  Images can be reduced to binary, to numbers, thus placing a finite limitation on the infinite, which is blasphemy!”</p><p>“That’s ridiculous, Faroukh.  The very concept of digital information didn’t exist until a hundred years ago.  You’re saying the Prophet foresaw the development of computers?  Pfah!”</p><p>A third man, like the others wearing a UN blue battlesuit that concealed all but his head, spat onto the black plaz deck.  “The Prophet prohibited nothing.  He communicated the vision that was sent to him through the archangel, that is all.  The law is of Allah!”</p><p>Faroukh smiled.  “Hamal is right, Walid.  Only in modern times are we able to understand the wisdom behind that particular law.  But would you dare to argue that Allah did not understand the truth of binary, even in the Prophet’s early days in the desert?  And is not the nature of man’s soul itself binary, forced to choose between good and evil?”</p><p>Captain Eileen “Devil Bunny” Mahoney decided enough was enough, and butted in.  “Stow it, Sergeant!”  She shook her head in exasperation.  Five minutes to insertion in a hot LZ, and her boys were debating the nature of God.  Again</p><p>Bunny was pissed.  In her initial briefing on Operation Restore Justice, she’d been relieved to learn that she’d been assigned as cadre officer to a Palestinian unit.  At least the Palestians could fight, she’d thought at the time, remembering the Intra-Arab war of the 2050’s, and they never tried to eat the enemy dead, like the New Guineans sometimes did.</p><p>That was before she’d actually met her troops, and discovered that she was stuck with a bunch of would-be Sufis.  And the ones who aren’t mystics want to die in battle.  It’s the express ticket to Paradise.</p><p>Uh oh.  Faroukh was staring at her, for daring to interrupt again.  She tried to shrug it off.  “Well, binary or ASCII, Faroukh, right now I’m sure Allah wants you to make sure your weapon is charged up and set on full.”  She tried a smile.</p><p>Oops.  Wrong move.  Faroukh turned to Walid, and the two of them began jabbering heatedly in Arabic, their sparsely-bearded chins working with great vigor, their dark eyes darting narrow glances toward her.</p><p>Enough of this, Bunny decided.  If I can’t get them to like me, then they damn well better respect me.  She bounced to her feet.  “Speak English, troop!”</p><p>Walid looked at her, with casual disdain.  “Ah, the woman of scarlet has made a sound.”</p><p>ENOUGH!  It was bad enough that they had to argue incessantly over the Koran.  It was bad enough that they’d spent the last five days arguing over whether the current Sharif of Iran was in fact the seventh incarnation of the second imam.  But she’d be damned if she let Walid call her some kind of hooker again!</p><p>Bunny charged forward, simultaneously slapping the oversized button that took her battlesuit up to full power and slamming her helmet over her head.  Before Walid could react, she’d grabbed him by the gap between his breastplate and abdominal webbing, and lifted him high over her head.  Walid kicked once, then relaxed, quickly realizing that even a large and angry man could not overpower a woman in a powered battlesuit.</p><p>“Get this, private,” Bunny spat out.  “My name is Captain Mahoney.  You will call me captain or sir.  If I hear you refer to me by any other name, or if I hear you imply even one more time that I am a woman of ill repute, I will rip your genitals off with my bare hands.  Is that clear?”</p><p>Walid nodded, slightly.  “Yes.”</p><p>“Yes what?”</p><p>“Yessir, Captain Mahoney, sir.”</p><p>“Very good.”  For a moment Bunny considered dropping him, then decided against it.  It was one thing to instill some healthy fear in the man, quite another to humiliate him, especially as he might soon be standing behind her, holding a loaded weapon.</p><p>Bunny gently lowered Walid to the floor.  “As you can see,” she said through the suit comm system, “my face is now properly covered, so I won’t be tempting you to sin for at least the next six hours.  Will this do?”</p><p>Walid nodded more clearly.  “Yes, sir.”</p></div>",
  "content_text": "No, it’s not a competition involving women of free favors and extensive bacterial collections, merely the latest spin on\nhis weekly literary challenge\nfor aspiring writers:\nWhat do I think? I think it’s a great idea! Not only that, I’ve discussed this with Vox, and he (lower case ‘h’) has given it his blessing. Ergo, this week’s Friday Challenge is:\nwrite a short story or pastiche set in one of the worlds of, and using the almost but not quite inimitable style of, the one and only Vox Day!\nPlease don’t post any such challenge entries here, because in order for an entry to be considered valid and judged by the OC’s elite panel of experts it must be posted\nat the OC’s Ranting Room\n.  I have no vote in selecting the winner, however, I will post both the winning entry as well as my favorite entry here on VP.  These may or may not be the same one.  Also, if you’re a writer, it’s worth noting that OpenOffice 3.0 is now available for download.  I’ve written my last three books using OpenOffice as well as all of my columns since 2002, so there’s really no justification for throwing away money on Microsoft anymore.  Click the banner below to download the new 3.0.0 and don’t forget to add the extension for PDF importing.  I’ll have a review of it once I have the chance to play with it for a while.\nIt may be helpful to keep in mind that since I do not happen to be an author of wereseal fiction myself, a torrid romance between a strong, independent, but lonely lighthouse keeper and a handsome, rugged, but respectful wereseal is unlikely to prove successful, however well-executed.  This, on the other hand, is an actual example, albeit one tainted by the OC himself:\nAboard Assault Shuttle LST(N)-14\n7 November 2069, 06:00 GMT\n“No, you’re wrong!” Faroukh ibn Yusef exclaimed to Walid ibn Walid.  “The Prophet prohibited images of people because we are made in the image of Allah, who is infinite.  Images can be reduced to binary, to numbers, thus placing a finite limitation on the infinite, which is blasphemy!”\n“That’s ridiculous, Faroukh.  The very concept of digital information didn’t exist until a hundred years ago.  You’re saying the Prophet foresaw the development of computers?  Pfah!”\nA third man, like the others wearing a UN blue battlesuit that concealed all but his head, spat onto the black plaz deck.  “The Prophet prohibited nothing.  He communicated the vision that was sent to him through the archangel, that is all.  The law is of Allah!”\nFaroukh smiled.  “Hamal is right, Walid.  Only in modern times are we able to understand the wisdom behind that particular law.  But would you dare to argue that Allah did not understand the truth of binary, even in the Prophet’s early days in the desert?  And is not the nature of man’s soul itself binary, forced to choose between good and evil?”\nCaptain Eileen “Devil Bunny” Mahoney decided enough was enough, and butted in.  “Stow it, Sergeant!”  She shook her head in exasperation.  Five minutes to insertion in a hot LZ, and her boys were debating the nature of God.  Again\nBunny was pissed.  In her initial briefing on Operation Restore Justice, she’d been relieved to learn that she’d been assigned as cadre officer to a Palestinian unit.  At least the Palestians could fight, she’d thought at the time, remembering the Intra-Arab war of the 2050’s, and they never tried to eat the enemy dead, like the New Guineans sometimes did.\nThat was before she’d actually met her troops, and discovered that she was stuck with a bunch of would-be Sufis.  And the ones who aren’t mystics want to die in battle.  It’s the express ticket to Paradise.\nUh oh.  Faroukh was staring at her, for daring to interrupt again.  She tried to shrug it off.  “Well, binary or ASCII, Faroukh, right now I’m sure Allah wants you to make sure your weapon is charged up and set on full.”  She tried a smile.\nOops.  Wrong move.  Faroukh turned to Walid, and the two of them began jabbering heatedly in Arabic, their sparsely-bearded chins working with great vigor, their dark eyes darting narrow glances toward her.\nEnough of this, Bunny decided.  If I can’t get them to like me, then they damn well better respect me.  She bounced to her feet.  “Speak English, troop!”\nWalid looked at her, with casual disdain.  “Ah, the woman of scarlet has made a sound.”\nENOUGH!  It was bad enough that they had to argue incessantly over the Koran.  It was bad enough that they’d spent the last five days arguing over whether the current Sharif of Iran was in fact the seventh incarnation of the second imam.  But she’d be damned if she let Walid call her some kind of hooker again!\nBunny charged forward, simultaneously slapping the oversized button that took her battlesuit up to full power and slamming her helmet over her head.  Before Walid could react, she’d grabbed him by the gap between his breastplate and abdominal webbing, and lifted him high over her head.  Walid kicked once, then relaxed, quickly realizing that even a large and angry man could not overpower a woman in a powered battlesuit.\n“Get this, private,” Bunny spat out.  “My name is Captain Mahoney.  You will call me captain or sir.  If I hear you refer to me by any other name, or if I hear you imply even one more time that I am a woman of ill repute, I will rip your genitals off with my bare hands.  Is that clear?”\nWalid nodded, slightly.  “Yes.”\n“Yes what?”\n“Yessir, Captain Mahoney, sir.”\n“Very good.”  For a moment Bunny considered dropping him, then decided against it.  It was one thing to instill some healthy fear in the man, quite another to humiliate him, especially as he might soon be standing behind her, holding a loaded weapon.\nBunny gently lowered Walid to the floor.  “As you can see,” she said through the suit comm system, “my face is now properly covered, so I won’t be tempting you to sin for at least the next six hours.  Will this do?”\nWalid nodded more clearly.  “Yes, sir.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-18T07:31:00+00:00"
}