{
  "url": "https://voxday.net/2008/10/01/sharpen-those-stakes/",
  "scraped_at": "2026-01-08T22:36:48.124917",
  "title": "Sharpen those stakes",
  "date_display": "October 1, 2008",
  "date_iso": "2008-10-01T10:02:00+00:00",
  "date_from_url": "2008-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I predicted, Washington and the wrinkled whores of Wall Street have chosen the Brussels option and are <a href=\"http://apnews.myway.com/article/20081001/D93HD3M80.html\">forcing a second vote this week</a> on their <s>attempted robbery</s>rescue plan:</p><blockquote><p>In a surprise move to resurrect President Bush’s $700 billion Wall Street rescue plan, Senate leaders slated a vote on the measure for Wednesday – but added a tax cut plan already rejected by the House. Majority Leader Harry Reid, D-Nev., and GOP Leader Mitch McConnell of Kentucky unveiled the plan Tuesday.</p><p>The Senate plan would also raise federal deposit insurance limits to $250,000 from $100,000, as called for by the two presidential nominees only hours earlier….  The surprise move capped a day in which supporters of the imperiled multibillion-dollar economic rescue fought to bring it back to life, courting reluctant lawmakers with a variety of other sweeteners including the plan to reassure Americans their bank deposits are safe.</p></blockquote><p>Surprise?  How could anyone with a functioning brain possibly be surprised by this?  I can’t imagine them making less than three straight attempts at it before they run out of time when the predicted apocalypse either fails to arrive, or, more likely, arrives in a manner which the “rescue” would obviously have done nothing to prevent.</p><p>Obviously, mere stakes won’t be enough for these revenants.  First, the garlic clove in the mouth.  Then the stake.  Then, and only then, the chopper.  Meanwhile, Dr. Doom is one of the many financially astute individuals to point out that <a href=\"http://www.bi-me.com/main.php?id=25070&amp;t=1&amp;c=35&amp;cg=4&amp;mset=1011\">the bailouts will in no way prevent economic contraction</a>.</p><p>Of course, Faber is completely wrong.  Because this brand new <s>Paulson</s>bipartisan plan is a <i>rescue</i> of the American economy, not a bailout of Wall Street bankers like the previous one.  They’re, like, two <i>totally</i> different things, even if they happen to look exactly the same to you, the unsophisticated American taxpayer.</p></div>",
  "content_text": "As I predicted, Washington and the wrinkled whores of Wall Street have chosen the Brussels option and are\nforcing a second vote this week\non their\nattempted robbery\nrescue plan:\nIn a surprise move to resurrect President Bush’s $700 billion Wall Street rescue plan, Senate leaders slated a vote on the measure for Wednesday – but added a tax cut plan already rejected by the House. Majority Leader Harry Reid, D-Nev., and GOP Leader Mitch McConnell of Kentucky unveiled the plan Tuesday.\nThe Senate plan would also raise federal deposit insurance limits to $250,000 from $100,000, as called for by the two presidential nominees only hours earlier….  The surprise move capped a day in which supporters of the imperiled multibillion-dollar economic rescue fought to bring it back to life, courting reluctant lawmakers with a variety of other sweeteners including the plan to reassure Americans their bank deposits are safe.\nSurprise?  How could anyone with a functioning brain possibly be surprised by this?  I can’t imagine them making less than three straight attempts at it before they run out of time when the predicted apocalypse either fails to arrive, or, more likely, arrives in a manner which the “rescue” would obviously have done nothing to prevent.\nObviously, mere stakes won’t be enough for these revenants.  First, the garlic clove in the mouth.  Then the stake.  Then, and only then, the chopper.  Meanwhile, Dr. Doom is one of the many financially astute individuals to point out that\nthe bailouts will in no way prevent economic contraction\n.\nOf course, Faber is completely wrong.  Because this brand new\nPaulson\nbipartisan plan is a\nrescue\nof the American economy, not a bailout of Wall Street bankers like the previous one.  They’re, like, two\ntotally\ndifferent things, even if they happen to look exactly the same to you, the unsophisticated American taxpayer.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-01T09:02:00+00:00"
}