{
  "url": "https://voxday.net/2008/10/20/something-wicked-this-way-comes/",
  "scraped_at": "2026-01-08T22:38:25.787283",
  "title": "Something wicked this way comes",
  "date_display": "October 20, 2008",
  "date_iso": "2008-10-20T13:34:00+00:00",
  "date_from_url": "2008-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Biden <a href=\"http://blogs.abcnews.com/politicalradar/2008/10/biden-to-suppor.html\">gives fair warning</a>:</p><blockquote><p>Sen. Joe Biden, D-Del., on Sunday guaranteed that if elected, Sen. Barack Obama., D-Ill., will be tested by an international crisis within his first six months in power and he will need supporters to stand by him as he makes tough, and possibly unpopular, decisions.</p></blockquote><p>It’s nice of old Joe to let us know that, yes, the HopeChange shouldn’t lead anyone to assume that the Obama administration won’t hesitate to run the old <i>ordo ab chao</i> game as did its predecessors in the Bush administration.  Now, given that this was a warning given to a group of hardcore Democrats, what can we assume they will consider to be distasteful.</p><p>More government spending?  No.  Increased government power?  No.  Increased taxes?  No.  Is there a crisis that might involve reducing government spending or lowering taxes?  Not that I can think of.  This leads one to conclude that Biden is referring to either yet another invasion and occupation – unlikely, given the overstretched state of the military – or a much more probable suspension of civil liberties.</p></div>",
  "content_text": "Joe Biden\ngives fair warning\n:\nSen. Joe Biden, D-Del., on Sunday guaranteed that if elected, Sen. Barack Obama., D-Ill., will be tested by an international crisis within his first six months in power and he will need supporters to stand by him as he makes tough, and possibly unpopular, decisions.\nIt’s nice of old Joe to let us know that, yes, the HopeChange shouldn’t lead anyone to assume that the Obama administration won’t hesitate to run the old\nordo ab chao\ngame as did its predecessors in the Bush administration.  Now, given that this was a warning given to a group of hardcore Democrats, what can we assume they will consider to be distasteful.\nMore government spending?  No.  Increased government power?  No.  Increased taxes?  No.  Is there a crisis that might involve reducing government spending or lowering taxes?  Not that I can think of.  This leads one to conclude that Biden is referring to either yet another invasion and occupation – unlikely, given the overstretched state of the military – or a much more probable suspension of civil liberties.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-20T12:34:00+00:00"
}