{
  "url": "https://voxday.net/2008/10/02/spengler-spells-it-ou/",
  "scraped_at": "2026-01-08T22:36:51.848052",
  "title": "Spengler spells it out",
  "date_display": "October 2, 2008",
  "date_iso": "2008-10-02T09:10:00+00:00",
  "date_from_url": "2008-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Congressman McCotter rightly pointed out, the <s>bailout</s>rescue will not work.  It <a href=\"http://www.atimes.com/atimes/Global_Economy/JJ02Dj02.html\">isn’t even capable of working</a>:</p><blockquote><p>There are no atheists in the trenches, and no free-marketeers in Congress after a nearly 10% fall in stock prices. A chorus of erstwhile conservative voices led by the likes of Newt Gingrich, the Republican firebrand of the 1990s, now argues that the proposed $700 billion bailout package is flawed, but it is better to enact it than to do nothing. This simply is not true….  The trouble is that the banking system is insolvent; that is, it lacks sufficient capital to hold its existing portfolio of assets, let alone to make new loans. Its capital is dissolving as loan losses mount. Banks have written off nearly $600 billion of mortgages or securities backed by mortgages during the past year. Against this, they have raised $350 billion in new capital from investors. But investors believe that losses will continue to rise in the mortgage market – and that is before other asset classes begin to decay, including credit cards, and corporate loans….</p><p>Why anyone believes that the Treasury plan will prevent widespread economic misery is unclear. Assuming that the Treasury overpays for the so-called “troubled assets” it purchases from banks, it cannot overpay by too much. Let us suppose that it overpays by 20%. In this case, it would effectively give the banks a $140 billion boost. That is a small fraction of what they have written off already, and an even smaller fraction of what they must write off as American wealth continues to shrink. It will help the shareholders of a few big institutions, and that is about it.  The banks need a good trillion dollars or so of new capital. The Paulson plan, unfair and indirect as it might be, cannot provide more than a small fraction of that amount.</p></blockquote><p>Needless to say, it is the shareholders of a few big institutions – like one Henry Paulson, lately of Goldman Sachs – who are the driving force behind the <s>bailout</s>rescue plan.  “Conservatives” who supported either the previous plan or its expanded and revised form have done nothing but publicly demonstrate both naivete and economic ignorance.</p></div>",
  "content_text": "As Congressman McCotter rightly pointed out, the\nbailout\nrescue will not work.  It\nisn’t even capable of working\n:\nThere are no atheists in the trenches, and no free-marketeers in Congress after a nearly 10% fall in stock prices. A chorus of erstwhile conservative voices led by the likes of Newt Gingrich, the Republican firebrand of the 1990s, now argues that the proposed $700 billion bailout package is flawed, but it is better to enact it than to do nothing. This simply is not true….  The trouble is that the banking system is insolvent; that is, it lacks sufficient capital to hold its existing portfolio of assets, let alone to make new loans. Its capital is dissolving as loan losses mount. Banks have written off nearly $600 billion of mortgages or securities backed by mortgages during the past year. Against this, they have raised $350 billion in new capital from investors. But investors believe that losses will continue to rise in the mortgage market – and that is before other asset classes begin to decay, including credit cards, and corporate loans….\nWhy anyone believes that the Treasury plan will prevent widespread economic misery is unclear. Assuming that the Treasury overpays for the so-called “troubled assets” it purchases from banks, it cannot overpay by too much. Let us suppose that it overpays by 20%. In this case, it would effectively give the banks a $140 billion boost. That is a small fraction of what they have written off already, and an even smaller fraction of what they must write off as American wealth continues to shrink. It will help the shareholders of a few big institutions, and that is about it.  The banks need a good trillion dollars or so of new capital. The Paulson plan, unfair and indirect as it might be, cannot provide more than a small fraction of that amount.\nNeedless to say, it is the shareholders of a few big institutions – like one Henry Paulson, lately of Goldman Sachs – who are the driving force behind the\nbailout\nrescue plan.  “Conservatives” who supported either the previous plan or its expanded and revised form have done nothing but publicly demonstrate both naivete and economic ignorance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-02T08:10:00+00:00"
}