{
  "url": "https://voxday.net/2008/10/01/summa-elvetica-is-now-available/",
  "scraped_at": "2026-01-08T22:36:50.025097",
  "title": "Summa Elveticais now available",
  "date_display": "October 1, 2008",
  "date_iso": "2008-10-01T11:01:00+00:00",
  "date_from_url": "2008-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://marcherlordpress.com/store/images/Summa%20Elvetica--Medium.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://marcherlordpress.com/store/images/Summa%20Elvetica--Medium.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 320px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://marcherlordpress.com/store/images/Summa%20Elvetica--Medium.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 320px;\"/></a>Marcher Lord Press is now accepting orders for its three launch titles, one of which is my latest fictional concoction, a fantasy novel entitled <i>Summa Elvetica: A Casuistry of the Elvish Controversy</i>; you may <a href=\"http://marcherlordpress.com/store/index.php?cPath=2_3\">order it directly</a> from Marcher Lord’s online store.  For the time being, the Marcher Lord store will be the only place the book will be available for sale.</p><p>If you’re not sure the novel will justify shelling out $12.99, if you can’t afford it, or if you are simply philosophically opposed to further contributing to the the lifestyle of a Lamborghini libertarian, then you can simply <a href=\"http://voxday.net/mart/SummaElvetica.pdf\">download the PDF of the complete manuscript</a> instead.  But regardless of how you elect to read the book, I hope you will consider giving it a whirl, as I believe I can guarantee that it will be one of the more unique fantasy novels published this year.</p></div>",
  "content_text": "Marcher Lord Press is now accepting orders for its three launch titles, one of which is my latest fictional concoction, a fantasy novel entitled\nSumma Elvetica: A Casuistry of the Elvish Controversy\n; you may\norder it directly\nfrom Marcher Lord’s online store.  For the time being, the Marcher Lord store will be the only place the book will be available for sale.\nIf you’re not sure the novel will justify shelling out $12.99, if you can’t afford it, or if you are simply philosophically opposed to further contributing to the the lifestyle of a Lamborghini libertarian, then you can simply\ndownload the PDF of the complete manuscript\ninstead.  But regardless of how you elect to read the book, I hope you will consider giving it a whirl, as I believe I can guarantee that it will be one of the more unique fantasy novels published this year.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-01T10:01:00+00:00"
}