{
  "url": "https://voxday.net/2008/10/21/summa-surge/",
  "scraped_at": "2026-01-08T22:38:31.327052",
  "title": "A Summa surge",
  "date_display": "October 21, 2008",
  "date_iso": "2008-10-21T10:39:00+00:00",
  "date_from_url": "2008-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems that contrary to my original impressions, <i>Summa Elvetica</i> is actually <a href=\"http://www.amazon.com/Summa-Elvetica-Theodore-Beale/dp/0982104928/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1224585664&amp;sr=8-1\">available through Amazon</a> now.  I assume that most of you who were interested in acquiring the book have already ordered it from Marcher Lord by now, but if not, I thought I’d see if anyone was still interested in participating in a book surge of the sort we did for TIA.  So, let me know what you think one way or the other; in the meantime, here’s a few more comments on the book from three recent reviewers:</p><blockquote><p><i>I have never written fan mail to an author before, but I wanted to email you in praise of your wonderful book!   I finished reading Summa Elvetica this weekend and was terribly disappointed when it ended so soon!   I would quite happily have stayed in the world you created, enjoying the philosophical debate and the theological discussions.  I trained as a surgeon in Oxford, and your book reminded me of the kind of arguments we would have in the Common Room until the small hours of the morning (though admittedly not over the eternal fate of elves…:)</i><br>– JB (via email)</br></p><p><i>Beale is an accomplished storyteller. This is evidenced by the fact that he stuck what amounted to two massive flashbacks into the front of his story and I didn’t realize until I got to the end of the first. And Beale also put in a great deal of tension and I didn’t see the ambush coming until it was too late. On top of that, the way the Sanctiff decides the question of elvish souls is so deliciously simple, I couldn’t stop smiling after I read it.</i><br>– <a href=\"http://leastread.blogspot.com/2008/10/summa-elvetica.html\">The Least Read Blog on the Web</a></br></p><p><i>Theodore Beale takes up this theme in Summa Elvetica. When it is claimed that religion causes war, the crusades spring instantly to mind. If we read the prospective holy war against the elves as a parallel to one of the crusades of the middle ages, a complicated picture begins to emerge. The pious may be more likely to support a war if urged on to do so by their spiritual leader, but the war profiteers aren’t going to be moved by indulgences and red crosses. In short, a variety of motives lead men to go to war, even an ostensibly holy one. Blame resides with fallen man, not with religion which serves to ameliorate his depravity.  Beale is not likely to join the company of Tolkien and Lewis—at least not yet—but he gives evidence of a lucid imagination and demonstrates that he can tell a good story. Its unusual subject matter may suggest merely an amusing novel, but Summa Elvetica creates a world in which the middle ages, its wars and its theological disputes, come roaring back to life.</i><br>– <a href=\"http://ericsjackson.blogspot.com/2008/10/in-which-we-unexpectedly-learn-thing-or.html\">Thoughts and Ideas… of a Catholic libertarian</a></br></p></blockquote><p>I don’t believe it makes any sense to argue with another reader’s impression of a book, least of all when you’re the author, so I will merely observe that I am fully aware of how I violated numerous “rules” of fantasy fiction throughout <i>Summa Elvetica</i> and mention that my publisher is in total agreement with the second point made by The Least Read Blog.  If one understands that <i><a href=\"http://www.amazon.com/Programmed-Man-Sutton/dp/0399201882/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1224601624&amp;sr=8-1\">The Programmed Man</a></i> is my favorite science fiction novel, then perhaps one can grasp why I elected to handle such an important plot element in that manner.  As for the first point, the entire purpose of the book was to drop a medieval Church into a conventional high fantasy world, therefore convention in the usual fantasy races was required.  Note, however, that I did build a foundation for a departure from conventional high fantasy with some of the other races in the event I decide to set future fiction in Selenoth.</p><p>Also, if you have written reviews, I’d encourage you to put them up on Amazon.</p></div>",
  "content_text": "It seems that contrary to my original impressions,\nSumma Elvetica\nis actually\navailable through Amazon\nnow.  I assume that most of you who were interested in acquiring the book have already ordered it from Marcher Lord by now, but if not, I thought I’d see if anyone was still interested in participating in a book surge of the sort we did for TIA.  So, let me know what you think one way or the other; in the meantime, here’s a few more comments on the book from three recent reviewers:\nI have never written fan mail to an author before, but I wanted to email you in praise of your wonderful book!   I finished reading Summa Elvetica this weekend and was terribly disappointed when it ended so soon!   I would quite happily have stayed in the world you created, enjoying the philosophical debate and the theological discussions.  I trained as a surgeon in Oxford, and your book reminded me of the kind of arguments we would have in the Common Room until the small hours of the morning (though admittedly not over the eternal fate of elves…:)\n– JB (via email)\nBeale is an accomplished storyteller. This is evidenced by the fact that he stuck what amounted to two massive flashbacks into the front of his story and I didn’t realize until I got to the end of the first. And Beale also put in a great deal of tension and I didn’t see the ambush coming until it was too late. On top of that, the way the Sanctiff decides the question of elvish souls is so deliciously simple, I couldn’t stop smiling after I read it.\n–\nThe Least Read Blog on the Web\nTheodore Beale takes up this theme in Summa Elvetica. When it is claimed that religion causes war, the crusades spring instantly to mind. If we read the prospective holy war against the elves as a parallel to one of the crusades of the middle ages, a complicated picture begins to emerge. The pious may be more likely to support a war if urged on to do so by their spiritual leader, but the war profiteers aren’t going to be moved by indulgences and red crosses. In short, a variety of motives lead men to go to war, even an ostensibly holy one. Blame resides with fallen man, not with religion which serves to ameliorate his depravity.  Beale is not likely to join the company of Tolkien and Lewis—at least not yet—but he gives evidence of a lucid imagination and demonstrates that he can tell a good story. Its unusual subject matter may suggest merely an amusing novel, but Summa Elvetica creates a world in which the middle ages, its wars and its theological disputes, come roaring back to life.\n–\nThoughts and Ideas… of a Catholic libertarian\nI don’t believe it makes any sense to argue with another reader’s impression of a book, least of all when you’re the author, so I will merely observe that I am fully aware of how I violated numerous “rules” of fantasy fiction throughout\nSumma Elvetica\nand mention that my publisher is in total agreement with the second point made by The Least Read Blog.  If one understands that\nThe Programmed Man\nis my favorite science fiction novel, then perhaps one can grasp why I elected to handle such an important plot element in that manner.  As for the first point, the entire purpose of the book was to drop a medieval Church into a conventional high fantasy world, therefore convention in the usual fantasy races was required.  Note, however, that I did build a foundation for a departure from conventional high fantasy with some of the other races in the event I decide to set future fiction in Selenoth.\nAlso, if you have written reviews, I’d encourage you to put them up on Amazon.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-21T09:39:00+00:00"
}