{
  "url": "https://voxday.net/2008/10/14/summa-elvetica-fourth-review/",
  "scraped_at": "2026-01-08T22:37:58.196614",
  "title": "Summa Elvetica: the fourth review",
  "date_display": "October 14, 2008",
  "date_iso": "2008-10-14T14:30:00+00:00",
  "date_from_url": "2008-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Eaglewood rather likes the book, but <a href=\"http://eaglewoodsnest.org/?p=413\">notes what is quickly becoming a recurrent theme</a>:</p><blockquote><p>I downloaded his free e-book version when it came out, and I got quickly engrossed in the vibrant world of men, dwarves, and elves he was creating.  Others have compared it to the Hobbit or to The Lord of the Rings, but I am not sure I am willing to go that far yet, but I can see the promise in his writing.  Unlike other novels of this sort, I liked that he engaged the mind as the story line was more of a thinking man’s story than the typical slash and burn kill fests that so many fantasy novels turn out to be….  This is part of the brilliance of the authors writing.  He is able to take you into the world of his characters and have you see through their eyes and truly be there with them in their adventures and follies. You get the feeling you are right there with them as part of the group and actively involved as a fellow adventurer in what appears to be a well thought out complex world.</p></blockquote><p>It seems I may have to give more consideration to a sequel of some sort than I had originally envisioned.  The thing is, I had something completely different in mind, albeit set in the same world.  However, it occurs to me that there is a very logical link between that which is written and that which I have been contemplating writing in the near future.  (That cynical sound you hear is Spacebunny laughing at me.)</p><p>Anyhow, if you liked <i>Summa Elvetica</i> and would like more of that sort of thing, then let me know.  I have to admit, I quite enjoyed the intellectual challenge of what I consider to be the most interesting aspect, which naturally has been of little interest to anyone else.  It’s a good thing I write primarily for my own amusement, is it not?  Of course, if you want more of it in physical form, it would be helpful to <a href=\"http://marcherlordpress.com/store/product_info.php?cPath=2_3&amp;products_id=4\">order the book from Marcher Lord</a>.</p><p>As for the length, I’ll merely mention that it was intended to be a short novel from the very start; you’ll note that the Aquinan structure dictates that it either be around its current length or something nearly twice as long.  Also, I attempted to roughly follow Umberto Eco’s concept of describing events according to their duration; for example, I’d originally conceived three “traveller’s tales” but the editor wisely declared that two was sufficient.</p><p>So, I’ll probably publish Faelan’s tale as a stand-alone short story at some point in the future.</p></div>",
  "content_text": "Eaglewood rather likes the book, but\nnotes what is quickly becoming a recurrent theme\n:\nI downloaded his free e-book version when it came out, and I got quickly engrossed in the vibrant world of men, dwarves, and elves he was creating.  Others have compared it to the Hobbit or to The Lord of the Rings, but I am not sure I am willing to go that far yet, but I can see the promise in his writing.  Unlike other novels of this sort, I liked that he engaged the mind as the story line was more of a thinking man’s story than the typical slash and burn kill fests that so many fantasy novels turn out to be….  This is part of the brilliance of the authors writing.  He is able to take you into the world of his characters and have you see through their eyes and truly be there with them in their adventures and follies. You get the feeling you are right there with them as part of the group and actively involved as a fellow adventurer in what appears to be a well thought out complex world.\nIt seems I may have to give more consideration to a sequel of some sort than I had originally envisioned.  The thing is, I had something completely different in mind, albeit set in the same world.  However, it occurs to me that there is a very logical link between that which is written and that which I have been contemplating writing in the near future.  (That cynical sound you hear is Spacebunny laughing at me.)\nAnyhow, if you liked\nSumma Elvetica\nand would like more of that sort of thing, then let me know.  I have to admit, I quite enjoyed the intellectual challenge of what I consider to be the most interesting aspect, which naturally has been of little interest to anyone else.  It’s a good thing I write primarily for my own amusement, is it not?  Of course, if you want more of it in physical form, it would be helpful to\norder the book from Marcher Lord\n.\nAs for the length, I’ll merely mention that it was intended to be a short novel from the very start; you’ll note that the Aquinan structure dictates that it either be around its current length or something nearly twice as long.  Also, I attempted to roughly follow Umberto Eco’s concept of describing events according to their duration; for example, I’d originally conceived three “traveller’s tales” but the editor wisely declared that two was sufficient.\nSo, I’ll probably publish Faelan’s tale as a stand-alone short story at some point in the future.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-14T13:30:00+00:00"
}