{
  "url": "https://voxday.net/2008/10/10/this-may-sound-familiar/",
  "scraped_at": "2026-01-08T22:37:41.541505",
  "title": "This may sound familiar",
  "date_display": "October 10, 2008",
  "date_iso": "2008-10-10T15:45:00+00:00",
  "date_from_url": "2008-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The negligence and incompetence of the nominally conservative commentariat on economic matters has really been quite remarkable when one considers how often and how favorably they tend to write about the so-called “free market”.  I wrote <a href=\"http://corner.nationalreview.com/post/?q=NGZjYWNhMmM0ODcxZjk4ZGQwNWRiY2EyNTAzYzJkZTA=\">this email to Rich Lowry</a> in response to his amazing assertion on NRO that the failure of the Paulson plan to “restore confidence” to the markets <a href=\"http://corner.nationalreview.com/post/?q=ODJiMGE4YTZlN2M1MDhlYjc4MDhjMjk3MWJiYTIxNTg=\">should not be taken as a failure</a> of the Paulson plan.</p><blockquote><p>Mr. Lowry, with all due respect, you’re missing the point. The Paulson plan cannot and will not work. It is hopeless and was from the very moment of its conception. It’s a Keynesian solution to an Austrian problem; all the Treasury is doing is ensuring that the crisis is exacerbated and extended in exactly the same way that Hoover and FDR did. This is the classic “pushing-on-a-string” problem that all the contrarians have been warning about for some time now. You cannot correct fundamental investment misallocations caused by cheap money by providing more liquidity. It’s spraying gasoline on the fire.</p><p>This is not about “a crisis of confidence” or “animal spirits” or all the usual Keynesian blather that is spouted by the half-educated in political economy. They’re only addressing the symptoms, not the disease <s>which</s> as they try to fight off the contraction that inevitably stems from previous inflationary expansion. It worked in 1996 when they inflated equities. It worked again in 2003 when they inflated housing.  Now, there’s nothing left to inflate and the contraction will be much more painful than it would have been if they hadn’t tried to fight it off the two previous times. So, it doesn’t matter when the Paulson plan was put into play, since it couldn’t have worked anyhow. I know Mr. Kudlow and your other mainstream Keynesian and Monetarist contacts will tell you otherwise; they are wrong, as you will see.</p><p>It’s a basic matter of defying economic gravity. After the boom, the bust must come eventually. And please don’t confuse the bounce coming next week with an actual recovery; because just when everyone breaths a sigh of relief and starts writing about how the worst has passed, the bear will return with a vengeance.</p></blockquote><p>It’s a beautiful ideal, it merely hasn’t been implemented properly.  Now, where have we heard THAT ONE before?</p><p>UPDATE – NRO’s <a href=\"http://corner.nationalreview.com/post/?q=ZDk1YTBlNmM5YmY5N2ZmMTE0ZDUzYzViMzk3YzQ2YjE=\">John Hood concurs</a> with my take on the matter in a note to Rich Lowry:</p><blockquote><p>You’ll get no disagreement from me that it’s very, very difficult to draw quick conclusions about the relationship between public policy and financial markets….  That said, though, think back to when the House initially voted down the Paulson plan. There was a large subsequent drop in equity values, which many pundits, including some Corner contributors, blamed on the irresponsibility of House Republicans. Now that the plan, more or less intact, has been voted into law, the markets have truly plummeted. Sure, it’s possible that the bear market would have been even hairier and growlier if the Paulson’s bailout notion had never passed, but a certain Medieval philosopher’s shaving equipment would tend to discourage that line of reasoning.</p><p>Your correspondent is correct, I think. This is an Austrian moment being described almost entirely in Keynesian terms. No wonder people are panicked and confused.  I think the case against Treasury’s plan remains persuasive.</p></blockquote></div>",
  "content_text": "The negligence and incompetence of the nominally conservative commentariat on economic matters has really been quite remarkable when one considers how often and how favorably they tend to write about the so-called “free market”.  I wrote\nthis email to Rich Lowry\nin response to his amazing assertion on NRO that the failure of the Paulson plan to “restore confidence” to the markets\nshould not be taken as a failure\nof the Paulson plan.\nMr. Lowry, with all due respect, you’re missing the point. The Paulson plan cannot and will not work. It is hopeless and was from the very moment of its conception. It’s a Keynesian solution to an Austrian problem; all the Treasury is doing is ensuring that the crisis is exacerbated and extended in exactly the same way that Hoover and FDR did. This is the classic “pushing-on-a-string” problem that all the contrarians have been warning about for some time now. You cannot correct fundamental investment misallocations caused by cheap money by providing more liquidity. It’s spraying gasoline on the fire.\nThis is not about “a crisis of confidence” or “animal spirits” or all the usual Keynesian blather that is spouted by the half-educated in political economy. They’re only addressing the symptoms, not the disease\nwhich\nas they try to fight off the contraction that inevitably stems from previous inflationary expansion. It worked in 1996 when they inflated equities. It worked again in 2003 when they inflated housing.  Now, there’s nothing left to inflate and the contraction will be much more painful than it would have been if they hadn’t tried to fight it off the two previous times. So, it doesn’t matter when the Paulson plan was put into play, since it couldn’t have worked anyhow. I know Mr. Kudlow and your other mainstream Keynesian and Monetarist contacts will tell you otherwise; they are wrong, as you will see.\nIt’s a basic matter of defying economic gravity. After the boom, the bust must come eventually. And please don’t confuse the bounce coming next week with an actual recovery; because just when everyone breaths a sigh of relief and starts writing about how the worst has passed, the bear will return with a vengeance.\nIt’s a beautiful ideal, it merely hasn’t been implemented properly.  Now, where have we heard THAT ONE before?\nUPDATE – NRO’s\nJohn Hood concurs\nwith my take on the matter in a note to Rich Lowry:\nYou’ll get no disagreement from me that it’s very, very difficult to draw quick conclusions about the relationship between public policy and financial markets….  That said, though, think back to when the House initially voted down the Paulson plan. There was a large subsequent drop in equity values, which many pundits, including some Corner contributors, blamed on the irresponsibility of House Republicans. Now that the plan, more or less intact, has been voted into law, the markets have truly plummeted. Sure, it’s possible that the bear market would have been even hairier and growlier if the Paulson’s bailout notion had never passed, but a certain Medieval philosopher’s shaving equipment would tend to discourage that line of reasoning.\nYour correspondent is correct, I think. This is an Austrian moment being described almost entirely in Keynesian terms. No wonder people are panicked and confused.  I think the case against Treasury’s plan remains persuasive.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-10T14:45:00+00:00"
}