{
  "url": "https://voxday.net/2008/10/27/voxiversity-ii_27/",
  "scraped_at": "2026-01-08T22:39:15.991569",
  "title": "Voxiversity II",
  "date_display": "October 27, 2008",
  "date_iso": "2008-10-27T19:03:00+00:00",
  "date_from_url": "2008-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ladies and gentlemen, it is time to start turning those pages.  Today, Voxiversity II kicks off with our group study of <i>America’s Great Depression</i> by Murray Rothbard. You can <a href=\"http://mises.org/rothbard/agd.pdf\">download the entire book on PDF</a> or <a href=\"http://mises.org/rothbard/agd/contents.asp\">bookmark the online text</a> at the Mises Institute. However, Voxiversity I participants tended to find having the physical text on hand to be helpful, so you may wish to consider <a href=\"http://mises.org/store/Americas-Great-Depression-P63C1.aspx\">ordering the book from the Mises bookstore</a> if you haven’t done so already.</p><p>Let me know if you’re planning to participate so I can keep a rough count of how many start and how many finish.  Last time, we had about 100 start Thucydides and about a third that number completed it.  I don’t actually care, I’m just curious about these things.  The first reading assignment is the five Introductions to the five editions and the first quiz and subsequent discussion will be this Saturday.</p><p>CS emailed to ask: <i>“I am interested in participating in Voxiversity II…. I know sweet f— all about economics (although I’m trying to learn)  – am I too far behind in terms of background knowledge or is it worth it to give er’ a go??”</i></p><p>I would actually encourage those who don’t know anything about economics to participate, first because few of those who studied economics in college learned anything about Austrian theory anyhow, second because this will present an unusual opportunity to ask as many questions as you like of a fair number of people who have a decent grasp of the material.  I would also encourage those who have such training to be patient and avoid the use of jargon when answering questions, i.e. don’t just say “marginal utility” or “IS/LM” and expect everyone to know what you mean.</p><p>In other, unrelated news, after consulting the OC, I have decided we will do the <i>Summa Elvetica</i> surge on Election Day so we can watch <a href=\"http://www.amazon.com/Summa-Elvetica-Theodore-Beale/dp/0982104928/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1224585664&amp;sr=8-1\">the Amazon numbers climb</a> as the election returns come in.  This will only be a 12-hour surge, so make sure to place your orders between 12 noon and 12 midnight EST on Tuesday, November 4th.</p></div>",
  "content_text": "Ladies and gentlemen, it is time to start turning those pages.  Today, Voxiversity II kicks off with our group study of\nAmerica’s Great Depression\nby Murray Rothbard. You can\ndownload the entire book on PDF\nor\nbookmark the online text\nat the Mises Institute. However, Voxiversity I participants tended to find having the physical text on hand to be helpful, so you may wish to consider\nordering the book from the Mises bookstore\nif you haven’t done so already.\nLet me know if you’re planning to participate so I can keep a rough count of how many start and how many finish.  Last time, we had about 100 start Thucydides and about a third that number completed it.  I don’t actually care, I’m just curious about these things.  The first reading assignment is the five Introductions to the five editions and the first quiz and subsequent discussion will be this Saturday.\nCS emailed to ask:\n“I am interested in participating in Voxiversity II…. I know sweet f— all about economics (although I’m trying to learn)  – am I too far behind in terms of background knowledge or is it worth it to give er’ a go??”\nI would actually encourage those who don’t know anything about economics to participate, first because few of those who studied economics in college learned anything about Austrian theory anyhow, second because this will present an unusual opportunity to ask as many questions as you like of a fair number of people who have a decent grasp of the material.  I would also encourage those who have such training to be patient and avoid the use of jargon when answering questions, i.e. don’t just say “marginal utility” or “IS/LM” and expect everyone to know what you mean.\nIn other, unrelated news, after consulting the OC, I have decided we will do the\nSumma Elvetica\nsurge on Election Day so we can watch\nthe Amazon numbers climb\nas the election returns come in.  This will only be a 12-hour surge, so make sure to place your orders between 12 noon and 12 midnight EST on Tuesday, November 4th.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-27T19:03:00+00:00"
}