{
  "url": "https://voxday.net/2008/10/27/why-they-hate-palin/",
  "scraped_at": "2026-01-08T22:39:12.321335",
  "title": "Why they hate Palin",
  "date_display": "October 27, 2008",
  "date_iso": "2008-10-27T11:45:00+00:00",
  "date_from_url": "2008-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m just talking about the Republicans, mind you.  The reason is that the neocons and other faux-conservatives doubt her malleability and they are <a href=\"http://www.politico.com/news/stories/1008/14929.html\">frightened of her star power</a>:</p><blockquote><p>Four Republicans close to Palin said she has decided increasingly to disregard the advice of the former Bush aides tasked to handle her, creating occasionally tense situations as she travels the country with them. Those Palin supporters, inside the campaign and out, said Palin blames her handlers for a botched rollout and a tarnished public image — even as others in McCain’s camp blame the pick of the relatively inexperienced Alaska governor, and her public performance, for McCain’s decline.</p><p>“She’s lost confidence in most of the people on the plane,” said a senior Republican who speaks to Palin, referring to her campaign jet. He said Palin had begun to “go rogue” in some of her public pronouncements and decisions.</p><p>“I think she’d like to go more rogue,” he said.</p></blockquote><p>Palin’s vice-presidential revolt is interesting.  She did exactly as she was told once selected, which got her into a lot of trouble.  She’s not unintelligent; her weird answers and stilted performance in the early interviews were signs of someone who has been completely overcoached and is trying not to make a mistake.  It’s important to remember that this was her first appearance on the national stage and she held her own in the vice-presidential debate despite being unprepared for the Biden BS storm.</p><p>(Someone like Biden is very difficult to handle if you’re not prepared for shameless lies, but if you are, they’re the easy people in the world to publicly demolish.  The challenge is to be able to correctly anticipate the direction of their BS and have the facts on hand to discredit them once they start making stuff up.)</p><p>Neocons like Frum and Kristol, and RINOs like David Brooks and Ben Stein dislike Palin because she’s insufficiently impressed with the East Coast imperative, and despite her Christian Zionism so typical of the average evangelical, she simply doesn’t share their Israel-uber-alles perspective.  While many of her views run pretty much in parallel with theirs, she’s not wedded to them, which makes her untrustworthy in their eyes.  For example, what <s>real conservative</s> populist is going to continue funding foreign aid or further American adventures in the Middle East after another year of economic carnage?</p><p>The economic situation means that whoever wins this year is likely to be a one-and-done president.  Palin is the leading candidate for the Republican nomination in 2012, so unless the New York-Washington Republican axis can blame a McCain loss on her somehow – which is absurd in light of the stock markets’ meltdown, if Obama wasn’t such a ridiculous candidate McCain would be losing in a huge landslide – she will be the favorite to win the general election.  So, expect a significant part of the “conservative” commentariat to devote itself to destroying Sarah Palin over the next few years while attempting to build up other, less conservative figures in the mode of Giuliani and Romney.</p><p>Jindal and Bloomberg are the two obvious possibilities at this point in time.  Normally, I’d say Bloomberg would be a ludicrous stretch, but then, they tried it with the Lisper, so who knows where the line is.  Of course, Palin should never have paid any attention to the handlers in the first place.  That was her fundamental mistake.</p><p>UPDATE – Right Wing News just published <a href=\"http://rightwingnews.com/#post13215\">a poll which tends to support my contention</a>.  The vast majority of Republican bloggers love Sarah Palin, so it’s pretty much only the supposedly conservative media commentators, whose allegiance to conservative principles is extremely dubious anyhow, who dislike her.  And note my votes in bold below, I was one of only six who expressed a negative view of her.</p><blockquote><p>2) Do you think Sarah Palin has been a plus or a minus to the ticket?</p><p>A) Minus: 9% (7)<br><b>B) Plus: 91% (68)</b></br></p><p>3) How do you feel about Sarah Palin as a candidate?</p><p>A) I really like her!: 80% (61)<br>B) She’s so-so.: 12% (9)<br><b>C) I’m not a big fan!: 8% (6)</b></br></br></p></blockquote></div>",
  "content_text": "I’m just talking about the Republicans, mind you.  The reason is that the neocons and other faux-conservatives doubt her malleability and they are\nfrightened of her star power\n:\nFour Republicans close to Palin said she has decided increasingly to disregard the advice of the former Bush aides tasked to handle her, creating occasionally tense situations as she travels the country with them. Those Palin supporters, inside the campaign and out, said Palin blames her handlers for a botched rollout and a tarnished public image — even as others in McCain’s camp blame the pick of the relatively inexperienced Alaska governor, and her public performance, for McCain’s decline.\n“She’s lost confidence in most of the people on the plane,” said a senior Republican who speaks to Palin, referring to her campaign jet. He said Palin had begun to “go rogue” in some of her public pronouncements and decisions.\n“I think she’d like to go more rogue,” he said.\nPalin’s vice-presidential revolt is interesting.  She did exactly as she was told once selected, which got her into a lot of trouble.  She’s not unintelligent; her weird answers and stilted performance in the early interviews were signs of someone who has been completely overcoached and is trying not to make a mistake.  It’s important to remember that this was her first appearance on the national stage and she held her own in the vice-presidential debate despite being unprepared for the Biden BS storm.\n(Someone like Biden is very difficult to handle if you’re not prepared for shameless lies, but if you are, they’re the easy people in the world to publicly demolish.  The challenge is to be able to correctly anticipate the direction of their BS and have the facts on hand to discredit them once they start making stuff up.)\nNeocons like Frum and Kristol, and RINOs like David Brooks and Ben Stein dislike Palin because she’s insufficiently impressed with the East Coast imperative, and despite her Christian Zionism so typical of the average evangelical, she simply doesn’t share their Israel-uber-alles perspective.  While many of her views run pretty much in parallel with theirs, she’s not wedded to them, which makes her untrustworthy in their eyes.  For example, what\nreal conservative\npopulist is going to continue funding foreign aid or further American adventures in the Middle East after another year of economic carnage?\nThe economic situation means that whoever wins this year is likely to be a one-and-done president.  Palin is the leading candidate for the Republican nomination in 2012, so unless the New York-Washington Republican axis can blame a McCain loss on her somehow – which is absurd in light of the stock markets’ meltdown, if Obama wasn’t such a ridiculous candidate McCain would be losing in a huge landslide – she will be the favorite to win the general election.  So, expect a significant part of the “conservative” commentariat to devote itself to destroying Sarah Palin over the next few years while attempting to build up other, less conservative figures in the mode of Giuliani and Romney.\nJindal and Bloomberg are the two obvious possibilities at this point in time.  Normally, I’d say Bloomberg would be a ludicrous stretch, but then, they tried it with the Lisper, so who knows where the line is.  Of course, Palin should never have paid any attention to the handlers in the first place.  That was her fundamental mistake.\nUPDATE – Right Wing News just published\na poll which tends to support my contention\n.  The vast majority of Republican bloggers love Sarah Palin, so it’s pretty much only the supposedly conservative media commentators, whose allegiance to conservative principles is extremely dubious anyhow, who dislike her.  And note my votes in bold below, I was one of only six who expressed a negative view of her.\n2) Do you think Sarah Palin has been a plus or a minus to the ticket?\nA) Minus: 9% (7)\nB) Plus: 91% (68)\n3) How do you feel about Sarah Palin as a candidate?\nA) I really like her!: 80% (61)\nB) She’s so-so.: 12% (9)\nC) I’m not a big fan!: 8% (6)",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-27T11:45:00+00:00"
}