{
  "url": "https://voxday.net/2008/10/25/yes-they-are-propaganda-houses/",
  "scraped_at": "2026-01-08T22:39:01.255485",
  "title": "Yes, they are propaganda houses",
  "date_display": "October 25, 2008",
  "date_iso": "2008-10-25T16:51:00+00:00",
  "date_from_url": "2008-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A career journalist <a href=\"http://pajamasmedia.com/edgelings/2008/10/24/editing-their-way-to-oblivion-journalism-sacraficed-for-power-and-pensions/\">admits the obvious</a>:</p><blockquote><p>[W]hat I object to (and I think most other Americans do as well) is the lack of equivalent hardball coverage of the other side – or worse, actively serving as attack dogs for Senators Obama and Biden.  If the current polls are correct, we are about to elect as President of the United States a man who is essentially a cipher, who has left almost no paper trail, seems to have few friends (that at least will talk) and has entire years missing out of his biography.  That isn’t Sen. Obama’s fault:  his job is to put his best face forward.  No, it is the traditional media’s fault, for it alone (unlike the alternative media) has had the resources to cover this story properly, and has systematically refused to do so.</p><p>Why, for example to quote McCain’s lawyer, haven’t we seen an interview with Sen. Obama’s grad school drug dealer – when we know all about Mrs. McCain’s addiction?  Are Bill Ayers and Tony Rezko that hard to interview?  All those phony voter registrations that hard to scrutinize?  And why are Senator Biden’s endless gaffes almost always covered up, or rationalized, by the traditional media?</p><p>The absolute nadir (though I hate to commit to that, as we still have two weeks before the election) came with Joe the Plumber.  Middle America, even when they didn’t agree with Joe, looked on in horror as the press took apart the private life of an average person who had the temerity to ask a tough question of a Presidential candidate.  So much for the Standing Up for the Little Man, so much for Speaking Truth to Power, so much for Comforting the Afflicted and Afflicting the Comfortable, and all of those other catchphrases we journalists used to believe we lived by.</p><p>I learned a long time ago that when people or institutions begin to behave in a manner that seems to be entirely against their own interests, it’s because we don’t understand what their motives really are.  It would seem that by so exposing their biases and betting everything on one candidate over another, the traditional media is trying to commit suicide – especially when, given our currently volatile world and economy, the chances of a successful Obama presidency, indeed any presidency, is probably less than 50:50.</p></blockquote><p>I laughed when I read this, because it brought to mind an angry email I once received from a newspaper reporter who had, to be fair, written a perfectly reasonable article about my father.  He objected to my blatant contempt for his profession, unfortunately, he cited academic credentials as a defense.  Needless to say, that didn’t quite cut it in my book.</p><p>For the most part, journalists aren’t actually stupid, but they’re <i>functionally</i> stupid.  Theirs is a necessarily superficial perspective – which is not their fault, it’s built into the job description – but also an arrogant, self-deceptive one.  It’s the only group of people I’ve ever met who seriously appear to believe that an impressive Address Book is a substitute for actual knowledge and experience.  This perspective is the analog predecessor to the modern Wikipedia myth, which is the idea that if you know where to find the information, it’s the same thing as actually possessing the pertinent knowledge.</p><p>For a blatant example of this blatant superficialism and bias in action, look no further than <a href=\"http://www.nytimes.com/2008/10/24/opinion/24fri1.html?em\">the NYT’s endorsement of Obama</a>.  In a cursory scan of it, I counted no less than 21 errors in it, and that’s not counting opinions that cannot be logically supported by the facts.</p><p>Few regulars here still do, but if you are one of the few who still subscribe to a daily newspaper, watch the evening news networks, or read mainstream magazines like Time and People, you should be ashamed of yourself.  Because it’s people like you who give these outmoded organizations the power to influence the less intelligent and the maleducated.</p><p>This, of course, is why I have always made it very clear to all and sundry that despite my three national syndications, I am not and have never been a journalist.</p></div>",
  "content_text": "A career journalist\nadmits the obvious\n:\n[W]hat I object to (and I think most other Americans do as well) is the lack of equivalent hardball coverage of the other side – or worse, actively serving as attack dogs for Senators Obama and Biden.  If the current polls are correct, we are about to elect as President of the United States a man who is essentially a cipher, who has left almost no paper trail, seems to have few friends (that at least will talk) and has entire years missing out of his biography.  That isn’t Sen. Obama’s fault:  his job is to put his best face forward.  No, it is the traditional media’s fault, for it alone (unlike the alternative media) has had the resources to cover this story properly, and has systematically refused to do so.\nWhy, for example to quote McCain’s lawyer, haven’t we seen an interview with Sen. Obama’s grad school drug dealer – when we know all about Mrs. McCain’s addiction?  Are Bill Ayers and Tony Rezko that hard to interview?  All those phony voter registrations that hard to scrutinize?  And why are Senator Biden’s endless gaffes almost always covered up, or rationalized, by the traditional media?\nThe absolute nadir (though I hate to commit to that, as we still have two weeks before the election) came with Joe the Plumber.  Middle America, even when they didn’t agree with Joe, looked on in horror as the press took apart the private life of an average person who had the temerity to ask a tough question of a Presidential candidate.  So much for the Standing Up for the Little Man, so much for Speaking Truth to Power, so much for Comforting the Afflicted and Afflicting the Comfortable, and all of those other catchphrases we journalists used to believe we lived by.\nI learned a long time ago that when people or institutions begin to behave in a manner that seems to be entirely against their own interests, it’s because we don’t understand what their motives really are.  It would seem that by so exposing their biases and betting everything on one candidate over another, the traditional media is trying to commit suicide – especially when, given our currently volatile world and economy, the chances of a successful Obama presidency, indeed any presidency, is probably less than 50:50.\nI laughed when I read this, because it brought to mind an angry email I once received from a newspaper reporter who had, to be fair, written a perfectly reasonable article about my father.  He objected to my blatant contempt for his profession, unfortunately, he cited academic credentials as a defense.  Needless to say, that didn’t quite cut it in my book.\nFor the most part, journalists aren’t actually stupid, but they’re\nfunctionally\nstupid.  Theirs is a necessarily superficial perspective – which is not their fault, it’s built into the job description – but also an arrogant, self-deceptive one.  It’s the only group of people I’ve ever met who seriously appear to believe that an impressive Address Book is a substitute for actual knowledge and experience.  This perspective is the analog predecessor to the modern Wikipedia myth, which is the idea that if you know where to find the information, it’s the same thing as actually possessing the pertinent knowledge.\nFor a blatant example of this blatant superficialism and bias in action, look no further than\nthe NYT’s endorsement of Obama\n.  In a cursory scan of it, I counted no less than 21 errors in it, and that’s not counting opinions that cannot be logically supported by the facts.\nFew regulars here still do, but if you are one of the few who still subscribe to a daily newspaper, watch the evening news networks, or read mainstream magazines like Time and People, you should be ashamed of yourself.  Because it’s people like you who give these outmoded organizations the power to influence the less intelligent and the maleducated.\nThis, of course, is why I have always made it very clear to all and sundry that despite my three national syndications, I am not and have never been a journalist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-10-25T15:51:00+00:00"
}