{
  "url": "https://voxday.net/2006/08/28/commercial-culture/",
  "scraped_at": "2026-01-08T21:16:09.109540",
  "title": "Commercial culture",
  "date_display": "August 28, 2006",
  "date_iso": "2006-08-28T11:42:00+00:00",
  "date_from_url": "2006-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I saw a commercial for TIM, the Italian cellular giant, which illustrated some of the differences between current Italian and American cultures, especially when it comes to heterosexual relations.  In the ad, the utterly delectable Miss Lima calls her boyfriend on his new videophone, tells him that she has an important appointment and doesn’t know what to wear.</p><p>There’s no hostility, she addresses him cheerfully as “amore” and he sounds generally delighted when he answers “Adriana!”  But he isn’t the typical clueless schlub always seen on US TV, instead he shakes his head when she presents her first outfit, a Britney Spears “Hit Me Baby” schoolgirl look which only goes to show that Adriana is approximately 650 times more attractive than Britney was at her best.</p><p>She goes through several more outfits which range from silly to sexy, and which have the boyfriend either shaking his finger or peeping through them in reluctant fascination.  In the end, she shows up in a sleek and sophisticated outfit that she hasn’t shown him… needless to say, she looks fantastic and the boyfriend’s silent “wow” shows his appreciation for both her taste and her impeccable <em>bella figura</em>.  She apologizes for having been frantic, explaining that she didn’t know what she should put on, then leans forward and kisses him affectionately on the nose.</p><p>The subtext is more ambiguous, however.  “Scusa se agitato” could also mean “I’m sorry I flustered you”, in addition to which it is left unsaid with whom the “important appointment” might be… it may actually be this meeting with him which appears to be unexpected.  If that’s the case, then it’s clear that she didn’t actually need his help in dressing herself, she was merely playing a flirtatious game that entertained both of them… an idea supported by both her overall demeanor throughout and the wink she gives him while displaying outfits.</p><p>I merely thought this was interesting, in that it posits a more traditional notion of men and women as sexual beings interacting playfully and intelligently with each other rather than competing in a zero-sum game of domination and mutual dislike.  The probability that this commercial would be denounced as sexist in the USA only tends to demonstrate the sickness of our commercial culture.</p></div>",
  "content_text": "I saw a commercial for TIM, the Italian cellular giant, which illustrated some of the differences between current Italian and American cultures, especially when it comes to heterosexual relations.  In the ad, the utterly delectable Miss Lima calls her boyfriend on his new videophone, tells him that she has an important appointment and doesn’t know what to wear.\nThere’s no hostility, she addresses him cheerfully as “amore” and he sounds generally delighted when he answers “Adriana!”  But he isn’t the typical clueless schlub always seen on US TV, instead he shakes his head when she presents her first outfit, a Britney Spears “Hit Me Baby” schoolgirl look which only goes to show that Adriana is approximately 650 times more attractive than Britney was at her best.\nShe goes through several more outfits which range from silly to sexy, and which have the boyfriend either shaking his finger or peeping through them in reluctant fascination.  In the end, she shows up in a sleek and sophisticated outfit that she hasn’t shown him… needless to say, she looks fantastic and the boyfriend’s silent “wow” shows his appreciation for both her taste and her impeccable\nbella figura\n.  She apologizes for having been frantic, explaining that she didn’t know what she should put on, then leans forward and kisses him affectionately on the nose.\nThe subtext is more ambiguous, however.  “Scusa se agitato” could also mean “I’m sorry I flustered you”, in addition to which it is left unsaid with whom the “important appointment” might be… it may actually be this meeting with him which appears to be unexpected.  If that’s the case, then it’s clear that she didn’t actually need his help in dressing herself, she was merely playing a flirtatious game that entertained both of them… an idea supported by both her overall demeanor throughout and the wink she gives him while displaying outfits.\nI merely thought this was interesting, in that it posits a more traditional notion of men and women as sexual beings interacting playfully and intelligently with each other rather than competing in a zero-sum game of domination and mutual dislike.  The probability that this commercial would be denounced as sexist in the USA only tends to demonstrate the sickness of our commercial culture.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-28T10:42:00+00:00"
}