{
  "url": "https://voxday.net/2006/08/01/cultural-correction/",
  "scraped_at": "2026-01-08T21:13:56.799620",
  "title": "A cultural correction",
  "date_display": "August 1, 2006",
  "date_iso": "2006-08-01T08:01:00+00:00",
  "date_from_url": "2006-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wheeler sums up some European differences:</p><blockquote><p>I lived for four years in Europe as a hitchhiker. The Greeks hate the Turks. The Italians love everybody. The English hate the French. The German hates the French and the Turk. The Dane hate the Swedes and the Swede hates the Danish. And everybody, but the Italians, hate the French.</p></blockquote><p>Actually, the Italians quite dislike the Germans but they tend to keep it quiet since they get a lot of tourist traffic from Germany.  Surprisingly, despite their obvious ethnic kinship and the fact that their national anthem, The Wilhelmus, boasts of their Germanic blood, the Dutch really hate the Germans.</p><p>The Germans fear and admire the Brits, everyone regards the Swiss with friendly suspicion, looks down on the Poles and considers inhabitants of the former Yugoslavia, especially the Muslim Bosnians, to be problematic lowlives.  The least popular people, however, are definitely the Albanians.</p><p>And with the exception of the Italians, pretty much everyone despises Israel and the Jews as reliable troublemakers.  I had lunch with some Milanese yesterday, one of whose grandfather had saved twenty Jewish children during the German occupation of Italy, and they were disturbed at the way in which <em>Judenhassen</em> is beginning to come back in vogue again.</p><p>I don’t know why people are surprised by this.  The Fourth German Reich is already in place, and if you disregard Barbarossa, it already rules over nearly as much territory as the Third Reich ever managed.  The fact that it is far more civilized than its brutal National Socialist predecessor means nothing, so were its first two iterations.</p></div>",
  "content_text": "Wheeler sums up some European differences:\nI lived for four years in Europe as a hitchhiker. The Greeks hate the Turks. The Italians love everybody. The English hate the French. The German hates the French and the Turk. The Dane hate the Swedes and the Swede hates the Danish. And everybody, but the Italians, hate the French.\nActually, the Italians quite dislike the Germans but they tend to keep it quiet since they get a lot of tourist traffic from Germany.  Surprisingly, despite their obvious ethnic kinship and the fact that their national anthem, The Wilhelmus, boasts of their Germanic blood, the Dutch really hate the Germans.\nThe Germans fear and admire the Brits, everyone regards the Swiss with friendly suspicion, looks down on the Poles and considers inhabitants of the former Yugoslavia, especially the Muslim Bosnians, to be problematic lowlives.  The least popular people, however, are definitely the Albanians.\nAnd with the exception of the Italians, pretty much everyone despises Israel and the Jews as reliable troublemakers.  I had lunch with some Milanese yesterday, one of whose grandfather had saved twenty Jewish children during the German occupation of Italy, and they were disturbed at the way in which\nJudenhassen\nis beginning to come back in vogue again.\nI don’t know why people are surprised by this.  The Fourth German Reich is already in place, and if you disregard Barbarossa, it already rules over nearly as much territory as the Third Reich ever managed.  The fact that it is far more civilized than its brutal National Socialist predecessor means nothing, so were its first two iterations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-01T07:01:00+00:00"
}