{
  "url": "https://voxday.net/2006/08/04/do-you-hear-people-sing/",
  "scraped_at": "2026-01-08T21:14:22.619974",
  "title": "Do you hear the people sing?",
  "date_display": "August 4, 2006",
  "date_iso": "2006-08-04T17:22:00+00:00",
  "date_from_url": "2006-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From NRO:</p><blockquote><p>If you want to feel just a little more anxious about the military situation in the Iraq theater of the war, read <a href=\"http://www.csmonitor.com/2006/0721/p09s01-coop.html\">this Christian Science Monitor piece by Patrick Lang</a>, a former official in the Defense Intelligence Agency. Lang analyzes a basic logistics issue: lines of supply. Because virtually all of our forces’ materiel and supplies are trucked from Kuwait, the lines stretch through large swaths of southern Iraqi territory that are quiescent at present but “thoroughly infiltrated by Iranian special operations forces working with Shiite militias.” Thus, if tensions over Lebanon or nuclear-weapons development escalate further, Lang argues that Iran could essentially order a serious harassment campaign against the American supply lines, lightly guarded and operated largely by skittish Turkish and South Asian truck drivers.</p></blockquote><p>Meanwhile, the idiot neocons want to attack Iran and Syria.  Now, Michael Ledeen vehemently denies he is calling for military conflict when he ends every column with “Faster, Please”, he insists that he is merely supporting regime change because with but a little external cheerleading, the people of those countries are sure to rise against the oppressive regimes that currently rule them.</p><p>When one considers how much this resembles the brilliant plan of Enjolras in “Les Miserables”, one is left with two conclusions.  One, the neocons really are a bunch of thinly disguised Reds.  Two, their strategic ability is somewhat lacking.</p></div>",
  "content_text": "From NRO:\nIf you want to feel just a little more anxious about the military situation in the Iraq theater of the war, read\nthis Christian Science Monitor piece by Patrick Lang\n, a former official in the Defense Intelligence Agency. Lang analyzes a basic logistics issue: lines of supply. Because virtually all of our forces’ materiel and supplies are trucked from Kuwait, the lines stretch through large swaths of southern Iraqi territory that are quiescent at present but “thoroughly infiltrated by Iranian special operations forces working with Shiite militias.” Thus, if tensions over Lebanon or nuclear-weapons development escalate further, Lang argues that Iran could essentially order a serious harassment campaign against the American supply lines, lightly guarded and operated largely by skittish Turkish and South Asian truck drivers.\nMeanwhile, the idiot neocons want to attack Iran and Syria.  Now, Michael Ledeen vehemently denies he is calling for military conflict when he ends every column with “Faster, Please”, he insists that he is merely supporting regime change because with but a little external cheerleading, the people of those countries are sure to rise against the oppressive regimes that currently rule them.\nWhen one considers how much this resembles the brilliant plan of Enjolras in “Les Miserables”, one is left with two conclusions.  One, the neocons really are a bunch of thinly disguised Reds.  Two, their strategic ability is somewhat lacking.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-04T16:22:00+00:00"
}