{
  "url": "https://voxday.net/2006/08/14/even-feminists-disgust-feminists/",
  "scraped_at": "2026-01-08T21:14:48.565209",
  "title": "Even feminists disgust feminists",
  "date_display": "August 14, 2006",
  "date_iso": "2006-08-14T13:58:00+00:00",
  "date_from_url": "2006-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember that bit about the brothel or the burqah?  In England, some feminists <a href=\"http://www.timesonline.co.uk/article/0,,2092-2309812,00.html\">are going for the burqah</a>:</p><blockquote><p>As a supporter of the peace movement in the 1980s, I could never have imagined that many of the same crowd I hung out with then would today be standing shoulder-to-shoulder with militantly anti-feminist Islamic fundamentalist groups, whose views on women make western patriarchy look like a Greenham peace picnic. Nor would I have predicted that today’s feminists would be so indulgent towards Iran, a theocratic nation where it is an act of resistance to show an inch or two of female hair beneath the veil and whose president, Mahmoud Ahmadinejad, is not joking about his murderous intentions towards Israel and the Jews.</p><p>On the defining issue of our times, the rise of Islamic extremism, what is left of the sisterhood has almost nothing to say.</p></blockquote><p>Except, of course, to join it, the morons.  And as for that “strawfeminist” concept, it tends to fall apart when you can so easily find feminists who fit the description:</p><blockquote><p>I’m always startled at the anti-childbirth, anti-mother faction within feminism, because whenever an acquaintance of mine says something like “I don’t like feminists, they wouldn’t respect my decision to have children” or “Feminism isn’t for me, because I really want kids,” I want to be able to tell them “no! it’s okay! That won’t happen here…!</p><p>When feminists buy into the idea that giving birth is weird, or icky, or not a possible feminist choice, they are playing directly into the hands of the opposition. The right wing knows that this sort of division is bound to alienate 85% of women from feminism in all forms — and they’re fully armed with people who’ll tell them that feminism is anti-mother. When feminists themselves add to this view, they are living down to a strawfeminist stereotype that should be beneath them.</p></blockquote><p>Oh, but it isn’t.  In terms of sheer loathsomeness, I rank feminists just above Stalin-era Communists and a degree or two below National Socialists.  As their enthusiasm for anti-Patriarchal <em>Judenhassen</em> and Hezbollah demonstrates, that’s about the right place for them.</p></div>",
  "content_text": "Remember that bit about the brothel or the burqah?  In England, some feminists\nare going for the burqah\n:\nAs a supporter of the peace movement in the 1980s, I could never have imagined that many of the same crowd I hung out with then would today be standing shoulder-to-shoulder with militantly anti-feminist Islamic fundamentalist groups, whose views on women make western patriarchy look like a Greenham peace picnic. Nor would I have predicted that today’s feminists would be so indulgent towards Iran, a theocratic nation where it is an act of resistance to show an inch or two of female hair beneath the veil and whose president, Mahmoud Ahmadinejad, is not joking about his murderous intentions towards Israel and the Jews.\nOn the defining issue of our times, the rise of Islamic extremism, what is left of the sisterhood has almost nothing to say.\nExcept, of course, to join it, the morons.  And as for that “strawfeminist” concept, it tends to fall apart when you can so easily find feminists who fit the description:\nI’m always startled at the anti-childbirth, anti-mother faction within feminism, because whenever an acquaintance of mine says something like “I don’t like feminists, they wouldn’t respect my decision to have children” or “Feminism isn’t for me, because I really want kids,” I want to be able to tell them “no! it’s okay! That won’t happen here…!\nWhen feminists buy into the idea that giving birth is weird, or icky, or not a possible feminist choice, they are playing directly into the hands of the opposition. The right wing knows that this sort of division is bound to alienate 85% of women from feminism in all forms — and they’re fully armed with people who’ll tell them that feminism is anti-mother. When feminists themselves add to this view, they are living down to a strawfeminist stereotype that should be beneath them.\nOh, but it isn’t.  In terms of sheer loathsomeness, I rank feminists just above Stalin-era Communists and a degree or two below National Socialists.  As their enthusiasm for anti-Patriarchal\nJudenhassen\nand Hezbollah demonstrates, that’s about the right place for them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-14T12:58:00+00:00"
}