{
  "url": "https://voxday.net/2006/08/19/family-matters/",
  "scraped_at": "2026-01-08T21:15:17.853765",
  "title": "Family matters",
  "date_display": "August 19, 2006",
  "date_iso": "2006-08-19T12:37:00+00:00",
  "date_from_url": "2006-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As most everyone knows, I don’t comment on family matters, partly because it seldom has much to do with me and partly because my family occasionally appears to border on the lunatic.  This is the curse of living on the far side of the Bell Curve.  Anyhow if you think the recent stir created by one family member is interesting, well, just wait and see what another one has in store for us all.  (Fortunately, it’s about something to which not even the most imaginative government jackboot could object.)</p><p>I am quite proud of my father for standing up for his beliefs, even though I have considered his crusade to be a quixotic one from its inception.  Because he is a brilliant man with an incredible capacity for excrutiating detail, I have no doubt that he is entirely correct with regards to his legal position; I also believe that being correct in these matters is largely beside the point.</p><p>For when in Rome, the saying goes, do as the Romans do.  The saying does not say to obey the Roman law, for as anyone familiar with either ancient or modern Rome well knows, that is a very Protean beast indeed.  The same is true in America today, where certain federal wiretapping was legal last week, is illegal this week, and presumably will be legal again soon without a single law being modified in any way.</p><p>The poverty and impotence of quasi-democracy, to say nothing of its fundamental hostility towards liberty and the rule of law, has been repeatedly illustrated across the globe.  And yet, like other truly patriotic Americans, my father simply  was not cynical enough to accept the idea that the <em>de facto</em> law of tooth and claw has replaced the law <em>de jure</em>.  So, armed with little more than a lance of legal knowledge and a shield of Christian faith, he has waged a long, stoic and heroic battle against the beast, at great social, emotional and monetary cost to himself.</p><p>I am proud of my grandfather, who fought on Guadacanal and stormed the beaches of Tarawa and Saipan, even though I consider two of those battles to have been entirely pointless from a strategic perspective.  In much the same way, I am proud of my father, even though I disagreed with the wisdom of tilting at these particular windmills.  If I seem strangely unconcerned about all of this, it’s probably because it’s difficult to get overly upset about something you’ve seen coming for years.</p><p>By the way, I should like to thank the vast majority of my usual critics, who with a very few exceptions have refrained from attempting to expand the range of their critiques at my father’s expense.  While it is a news story and is to a certain degree fair game, (I completely understand how hilarious this all must be for some of you), I’d merely hope people would attempt to refrain from making ridiculous speculations in public.  I should also like to thank the investigating agents for their civilized comportment this week as well as the print and TV media for their unusually accurate representation of the facts involved.</p><p>I sincerely hope that the law will be obeyed by all parties concerned and justice will be done.  Unfortunately, justice and the courts don’t appear to have much in common these days.</p></div>",
  "content_text": "As most everyone knows, I don’t comment on family matters, partly because it seldom has much to do with me and partly because my family occasionally appears to border on the lunatic.  This is the curse of living on the far side of the Bell Curve.  Anyhow if you think the recent stir created by one family member is interesting, well, just wait and see what another one has in store for us all.  (Fortunately, it’s about something to which not even the most imaginative government jackboot could object.)\nI am quite proud of my father for standing up for his beliefs, even though I have considered his crusade to be a quixotic one from its inception.  Because he is a brilliant man with an incredible capacity for excrutiating detail, I have no doubt that he is entirely correct with regards to his legal position; I also believe that being correct in these matters is largely beside the point.\nFor when in Rome, the saying goes, do as the Romans do.  The saying does not say to obey the Roman law, for as anyone familiar with either ancient or modern Rome well knows, that is a very Protean beast indeed.  The same is true in America today, where certain federal wiretapping was legal last week, is illegal this week, and presumably will be legal again soon without a single law being modified in any way.\nThe poverty and impotence of quasi-democracy, to say nothing of its fundamental hostility towards liberty and the rule of law, has been repeatedly illustrated across the globe.  And yet, like other truly patriotic Americans, my father simply  was not cynical enough to accept the idea that the\nde facto\nlaw of tooth and claw has replaced the law\nde jure\n.  So, armed with little more than a lance of legal knowledge and a shield of Christian faith, he has waged a long, stoic and heroic battle against the beast, at great social, emotional and monetary cost to himself.\nI am proud of my grandfather, who fought on Guadacanal and stormed the beaches of Tarawa and Saipan, even though I consider two of those battles to have been entirely pointless from a strategic perspective.  In much the same way, I am proud of my father, even though I disagreed with the wisdom of tilting at these particular windmills.  If I seem strangely unconcerned about all of this, it’s probably because it’s difficult to get overly upset about something you’ve seen coming for years.\nBy the way, I should like to thank the vast majority of my usual critics, who with a very few exceptions have refrained from attempting to expand the range of their critiques at my father’s expense.  While it is a news story and is to a certain degree fair game, (I completely understand how hilarious this all must be for some of you), I’d merely hope people would attempt to refrain from making ridiculous speculations in public.  I should also like to thank the investigating agents for their civilized comportment this week as well as the print and TV media for their unusually accurate representation of the facts involved.\nI sincerely hope that the law will be obeyed by all parties concerned and justice will be done.  Unfortunately, justice and the courts don’t appear to have much in common these days.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-19T11:37:00+00:00"
}