{
  "url": "https://voxday.net/2006/08/01/i-wonder-why/",
  "scraped_at": "2026-01-08T21:14:00.613859",
  "title": "I wonder why",
  "date_display": "August 1, 2006",
  "date_iso": "2006-08-01T12:04:00+00:00",
  "date_from_url": "2006-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An ex-male <a href=\"http://www.feministe.us/blog/archives/2006/07/31/why-do-i-bother/#comments\">comments on Feminstasi</a>:</p><blockquote><p>The upbringing point would be a good one if anti-feminists weren’t outbreeding feminists to an almost ridiculous degree. The second half of what you said is really important, though. I think we all need to step up our public activity a notch. Just keeping your friends in line isn’t good enough. I don’t know about you, but I have precious few non-feminist friends in my social circle.</p></blockquote><p>That’s almost surely because non-feminists, like most people, dislike those who believe it is their job to keep us in line and will not accept them as friends.  I don’t tolerate feminists, who can seldom keep their mouths shut when faced with anything deemed overly Patriarchal, and I find that unhesitatingly administering a sound intellectual beat-down tends to cause them to keep a safe distance away from me and my social circle.  The nice thing is that you never have to start anything, you can always count on a snarky and inappropriate comment to provide you with a socially acceptable opening.  A Platonic, questioning approach beginning with “why would you say that?” usually combines maximum effect with minimal upset to neutral parties.</p><p>It is interesting, however, to see that a member of the Equalitarian Hemlock Society is capable of grasping the demographic doom that awaits feminism.</p><p>By the way, this is a thread that just keeps on giving.  Check out this hilarious exchange:</p><blockquote><p>DENNIS: <em>I don’t understand how we’re supposed to get anywhere with the issue of rapists without at least mentioning rape victims. If we restrict ourselves so, it seems like all we can say is “Boy, rapists sure are bastards!”, and then move on to a cat-picture thread.</em></p><p>ZUZU: Mentioning rape victims is one thing. However, you’re trying to put the responsibility for stopping rape on their shoulders by saying things like this: <em>“In a sense, women do need greater social responsibility… namely, they need to report their own rapes and press charges.”</em></p><p>Women do not need greater social responsibility wrt rape. We’re already blamed for it when it happens. What we need is for men to take responsibility for it, and we need to be absolutely sure that we keep the focus where it belongs, on the people who are doing the raping.</p></blockquote><p>Got that?  Women not only do not need to take responsibility for their own behavior, such as not mindlessly wandering into manifestly dangerous situations while being weak, helples and unarmed, but if something bad does happen to them, they shouldn’t even be responsible for reporting it!*</p><p>If I may remind the reader of my previous assertion that women in Western society are legally considered to be quasi-children, it’s very clear that feminists are the special ed class.</p><p>*<em>I will, however, agree with Zuzu that girls who manage to get themselves killed should be absolved of any such reporting responsibilities.</em></p></div>",
  "content_text": "An ex-male\ncomments on Feminstasi\n:\nThe upbringing point would be a good one if anti-feminists weren’t outbreeding feminists to an almost ridiculous degree. The second half of what you said is really important, though. I think we all need to step up our public activity a notch. Just keeping your friends in line isn’t good enough. I don’t know about you, but I have precious few non-feminist friends in my social circle.\nThat’s almost surely because non-feminists, like most people, dislike those who believe it is their job to keep us in line and will not accept them as friends.  I don’t tolerate feminists, who can seldom keep their mouths shut when faced with anything deemed overly Patriarchal, and I find that unhesitatingly administering a sound intellectual beat-down tends to cause them to keep a safe distance away from me and my social circle.  The nice thing is that you never have to start anything, you can always count on a snarky and inappropriate comment to provide you with a socially acceptable opening.  A Platonic, questioning approach beginning with “why would you say that?” usually combines maximum effect with minimal upset to neutral parties.\nIt is interesting, however, to see that a member of the Equalitarian Hemlock Society is capable of grasping the demographic doom that awaits feminism.\nBy the way, this is a thread that just keeps on giving.  Check out this hilarious exchange:\nDENNIS:\nI don’t understand how we’re supposed to get anywhere with the issue of rapists without at least mentioning rape victims. If we restrict ourselves so, it seems like all we can say is “Boy, rapists sure are bastards!”, and then move on to a cat-picture thread.\nZUZU: Mentioning rape victims is one thing. However, you’re trying to put the responsibility for stopping rape on their shoulders by saying things like this:\n“In a sense, women do need greater social responsibility… namely, they need to report their own rapes and press charges.”\nWomen do not need greater social responsibility wrt rape. We’re already blamed for it when it happens. What we need is for men to take responsibility for it, and we need to be absolutely sure that we keep the focus where it belongs, on the people who are doing the raping.\nGot that?  Women not only do not need to take responsibility for their own behavior, such as not mindlessly wandering into manifestly dangerous situations while being weak, helples and unarmed, but if something bad does happen to them, they shouldn’t even be responsible for reporting it!*\nIf I may remind the reader of my previous assertion that women in Western society are legally considered to be quasi-children, it’s very clear that feminists are the special ed class.\n*\nI will, however, agree with Zuzu that girls who manage to get themselves killed should be absolved of any such reporting responsibilities.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-01T11:04:00+00:00"
}