{
  "url": "https://voxday.net/2006/08/29/mailvox-pretty-much-yea/",
  "scraped_at": "2026-01-08T21:16:15.185259",
  "title": "Mailvox: pretty much, yeah",
  "date_display": "August 29, 2006",
  "date_iso": "2006-08-29T10:53:00+00:00",
  "date_from_url": "2006-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AF is curious about men’s responsibilities:</p><blockquote><p>Do you believe American men are increasingly unsuitable for marriage? I believe they are. American men are weak- in mind and in spirit. They lack strength of character, conviction, and courage. They tend to be spoiled, lazy, and self-indulgent. They are quite capable of finding fault with good Christian women who would truly love to be married and raise a family. Most men find these women fall into the ”no fun” category, because they do the best every day to live up to their Christian beliefs.</p><p>Unfortunately, I also see that there are too many women who can’t or will not handle the responsibility that comes with being a wife and mother. However, one of the biggest problems in our society is the fact that men have given up their natural roles of providers, protectors, and leaders. Most single women I know would love to find a man that would cherish those roles. Too bad men like that are too hard to find.</p></blockquote><p>Yes, it surely cuts both ways.  I don’t spend much time criticizing men as there is a plethora of writers and publications devoted to doing so.  But the blame for the destruction that feminism has wrought on the West ultimately lies at the feet of the men who, unlike their more manly predecessors such as John Adams, fail to tell women “no”.  Even Winston Churchill, who boldly faced down the wrath of the <em>Fuhrer</em>, was eventually worn down by women’s whining.</p><p>And men are prone to the same sort of cowardice in many individual relationships as well.  Most men these days are more than a little confused, because they have been indoctrinated into a quasi-feminist mindset which is completely at odds with what they have learned through personal experience.  This confusion leaves them weakened intellectually and ideologically, after all, it is difficult to have the courage of your convictions when you possess none except a vague notion of tolerance being desirable.  When confronted by a woman shrieking histrionically about her “rights”, such a man’s natural tendency is to cower and give in to whatever nonsense she demands.  Equal pay for equal work?  Fine.  Equal pay for different work?  You got it.  Equal pay for less work?  All right.  Equal pay for no work at all while you have kids?  Here, just please shut up!</p><p>A woman has whatever power over a man he chooses to give her.  While her misuse of that power is her responsibility, it should never be forgotten that he elected to give it to her in the first place.   If a man is not prepared to disagree with a woman and accept whatever consequences may result from that disagreement, then he is, as AF suggests, unsuitable for marriage and would do well to avoid it.</p></div>",
  "content_text": "AF is curious about men’s responsibilities:\nDo you believe American men are increasingly unsuitable for marriage? I believe they are. American men are weak- in mind and in spirit. They lack strength of character, conviction, and courage. They tend to be spoiled, lazy, and self-indulgent. They are quite capable of finding fault with good Christian women who would truly love to be married and raise a family. Most men find these women fall into the ”no fun” category, because they do the best every day to live up to their Christian beliefs.\nUnfortunately, I also see that there are too many women who can’t or will not handle the responsibility that comes with being a wife and mother. However, one of the biggest problems in our society is the fact that men have given up their natural roles of providers, protectors, and leaders. Most single women I know would love to find a man that would cherish those roles. Too bad men like that are too hard to find.\nYes, it surely cuts both ways.  I don’t spend much time criticizing men as there is a plethora of writers and publications devoted to doing so.  But the blame for the destruction that feminism has wrought on the West ultimately lies at the feet of the men who, unlike their more manly predecessors such as John Adams, fail to tell women “no”.  Even Winston Churchill, who boldly faced down the wrath of the\nFuhrer\n, was eventually worn down by women’s whining.\nAnd men are prone to the same sort of cowardice in many individual relationships as well.  Most men these days are more than a little confused, because they have been indoctrinated into a quasi-feminist mindset which is completely at odds with what they have learned through personal experience.  This confusion leaves them weakened intellectually and ideologically, after all, it is difficult to have the courage of your convictions when you possess none except a vague notion of tolerance being desirable.  When confronted by a woman shrieking histrionically about her “rights”, such a man’s natural tendency is to cower and give in to whatever nonsense she demands.  Equal pay for equal work?  Fine.  Equal pay for different work?  You got it.  Equal pay for less work?  All right.  Equal pay for no work at all while you have kids?  Here, just please shut up!\nA woman has whatever power over a man he chooses to give her.  While her misuse of that power is her responsibility, it should never be forgotten that he elected to give it to her in the first place.   If a man is not prepared to disagree with a woman and accept whatever consequences may result from that disagreement, then he is, as AF suggests, unsuitable for marriage and would do well to avoid it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-29T09:53:00+00:00"
}