{
  "url": "https://voxday.net/2006/08/31/mailvox-truth-in-fiction/",
  "scraped_at": "2026-01-08T21:16:30.297152",
  "title": "Mailvox: truth in fiction",
  "date_display": "August 31, 2006",
  "date_iso": "2006-08-31T11:07:00+00:00",
  "date_from_url": "2006-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SJ writes, with trembling fingers:</p><blockquote><p>You once commented in a blog negatively about LionWitchWardrobe (which I know that you generally like) regarding the appliances in the Beaver’s home and in the comments I attempted to defend their appearances. I generally bristle at any negative comment about any CS Lewis book or LOTR (them bein’ my favorite) and I am generally disappointed when I learn that people didn’t enjoy the books as much as I did.</p><p>Despite that, I am going to negatively comment on what I understand to be your favorite children’s book. With trepidation. To wit: There are (at least) four ways an author can handle the existence of the  Christian Religion in a fantasy book. The three ways I find acceptable are:</p><p>(1) Embrace it and make it integral to the story – you have done this in Eternal Warriors and I also enjoy it in Perretti (which, if I recall correctly, you haven’t read. I recommend it as entertainment, not literature,)</p><p>(2) Do not comment on it at all. For the most part, this is what Lewis does. We see Aslan as an allegory, but Christ is never mentioned. And in the first of the Space Trilogy, Ransom explains something like, “Our traditions say that . . .” but we hear nothing more of the conversation,</p><p>(3) Mention Christianity, call it false and move on. A lot of Arthur C. Clarke does this, and while I disagree with it, I know that there are atheists out there and the purely naturalistic worldview often make for very interesting fiction.</p><p>But the fourth way really bothers me. Treat Christianity as one of many truths and subordinate to the main premise. It is pretty quick, but this is what “Dark” does on Christmas day.</p><p>Since you have read this many times I’ll sum the story up just for my point. The Dark Powers are raging outside just after the service and the normal human pastor can feel them and he begins to pray for God’s protection and the old one says “No, Rector”</p><p>So there it is: Advice to not pray to God for help. Those last two words automatically disqualify it from being my favorite children’s book.</p><p>Later the Old One says “The battle is not his for the fighting” Okay. But it’s still should be okay for him to pray. Then six pages later, referring to “outside time” Will says “And all Gods are there and all the things they have ever stood for, and the opposite, too” The “opposite” part indicates to me that Cooper was not including demons or what not in the set of Gods (as you sometimes do) so it makes it fairly clear that she thinks of Christianity as in someway important, but not the most important. The ‘Old Ones’ Reality trumps it.</p><p>Doesn’t this bother you?</p><p>There is something like this in the “L’Engle” book (“Wrinkle in time”) which I can just barely remember but I recall a conversation where they listed people throughout history who were a step more advanced than the rest of us and Jesus was on the list. This is the same thing. Don’t put Jesus on a list. Make him the King of the list or take him off it entirely.</p><p>Harry Potter has it’s flaws and is certainly not literature, but, to its credit (in the two books I’ve read) never attempts to mix Christian Religion into it’s narrative. I am recalling your response to the letter I wrote to you after reading<br>your first book wondering how Dr. Boyd might handle the time travel part of your story when he doesn’t believe that the future exists yet. You (reasonably) responded “He is an intelligent man who is perfectly capable of understanding the difference between a serious theological work and a fantasy novel, which is why he doesn’t get too worked up about my playing around with various theological concepts.“</br></p><p>Well, he might not, and you might not, but I do. Even in fiction, if something goes strongly against my world view, it makes me like the book less, especially if I’m reading it to my children.</p><p>So now (as evidence to the contrary of what I just said, or so it seems) I’m reading ‘Tom Sawyer’ to them. In just the first few chapters: Lieing and Fighting are glorified (at least at face value) and church is shown to be boring and focused on showing off. But it makes my boys laugh, it make me laugh and it so much fun to read out loud. Oh well.</p></blockquote><p>There are two separate issues here.  First, the vaguely New Age, multiple paths towards Truth manner in which religion is handled by Susan Cooper and Madeleine L’Engle doesn’t trouble me at all.  Neither author is actually attempting to make any serious theological statement, Good and Evil are primarily used as a backdrop, as a means of creating an impression of a larger stage upon which the novels are played out.</p><p>One must keep in mind that both women are of a previous generation that was not entirely secularized, thus their work is essentially atheistic at heart but they are too steeped in the Christian culture of the West to abandon it entirely.  This is part of the source of their power, of course, most fully atheist works of modern fantasy tend to be weak and absolutely forgettable since they don’t draw effectively on what can either be considered the Real or the Mythic depending upon one’s perspective.</p><p>Indeed, I suspect that the lasting greatness of both “The Dark is Rising” and “A Wrinkle in Time” (I must say that I vastly prefer “A Swiftly Tilting Planet”, by the way), is somewhat dependent upon their lack of specifics, not only with regards to religion but also history.  Rather than explaining precisely how everything works, both writers have the skill to paint with impressions, which somehow leaves the reader with a picture that is more meaningful than one laid out with more precision in the particulars.  I expect JK Rowlings will be largely forgotten in 30 years, while Cooper and L’Engle are still being read.</p><p>As for your second point, it should be kept in mind that these are not children’s books.  They are for teenagers and precocious pre-teens, they are for those who are sufficiently developed to deal with partial truths and understand how they can be useful in understanding the fullness of the Truth.  I suspect you don’t fully understand that a writer’s basic objective in writing a work of fiction seldom involves the idea of presenting an argument to the reader, barring the obvious examples to the contrary such as Messrs. Jenkins and LaHaye or Sherri Tepper.</p><p>I don’t see my books as attempting to tell anyone anything, I see them more as posing questions and offering potential answers to those questions.  In the first book, the question is “why don’t we choose evil when it seems to offer us so much more of what we want?”  In the second, “how is it that an angry, bitter boy is pushed over the edge to become a killer when so many others aren’t?”  In the third, “is it possible that God not only plays dice with the Devil, but does so with loaded dice?”</p><p>Given that my skill is much inferior to both the aforementioned ladies, this may not always come through to the reader.   Mere brainpower is a poor substitute for true artistic talent.  At any rate, don’t forget that novels are entertainment, and while they may be <em>sopratutto</em> a thinking woman’s entertainment and occasionally provoke a thought or three on the part of the reader, it would be a mistake to place too much theological weight on them.</p></div>",
  "content_text": "SJ writes, with trembling fingers:\nYou once commented in a blog negatively about LionWitchWardrobe (which I know that you generally like) regarding the appliances in the Beaver’s home and in the comments I attempted to defend their appearances. I generally bristle at any negative comment about any CS Lewis book or LOTR (them bein’ my favorite) and I am generally disappointed when I learn that people didn’t enjoy the books as much as I did.\nDespite that, I am going to negatively comment on what I understand to be your favorite children’s book. With trepidation. To wit: There are (at least) four ways an author can handle the existence of the  Christian Religion in a fantasy book. The three ways I find acceptable are:\n(1) Embrace it and make it integral to the story – you have done this in Eternal Warriors and I also enjoy it in Perretti (which, if I recall correctly, you haven’t read. I recommend it as entertainment, not literature,)\n(2) Do not comment on it at all. For the most part, this is what Lewis does. We see Aslan as an allegory, but Christ is never mentioned. And in the first of the Space Trilogy, Ransom explains something like, “Our traditions say that . . .” but we hear nothing more of the conversation,\n(3) Mention Christianity, call it false and move on. A lot of Arthur C. Clarke does this, and while I disagree with it, I know that there are atheists out there and the purely naturalistic worldview often make for very interesting fiction.\nBut the fourth way really bothers me. Treat Christianity as one of many truths and subordinate to the main premise. It is pretty quick, but this is what “Dark” does on Christmas day.\nSince you have read this many times I’ll sum the story up just for my point. The Dark Powers are raging outside just after the service and the normal human pastor can feel them and he begins to pray for God’s protection and the old one says “No, Rector”\nSo there it is: Advice to not pray to God for help. Those last two words automatically disqualify it from being my favorite children’s book.\nLater the Old One says “The battle is not his for the fighting” Okay. But it’s still should be okay for him to pray. Then six pages later, referring to “outside time” Will says “And all Gods are there and all the things they have ever stood for, and the opposite, too” The “opposite” part indicates to me that Cooper was not including demons or what not in the set of Gods (as you sometimes do) so it makes it fairly clear that she thinks of Christianity as in someway important, but not the most important. The ‘Old Ones’ Reality trumps it.\nDoesn’t this bother you?\nThere is something like this in the “L’Engle” book (“Wrinkle in time”) which I can just barely remember but I recall a conversation where they listed people throughout history who were a step more advanced than the rest of us and Jesus was on the list. This is the same thing. Don’t put Jesus on a list. Make him the King of the list or take him off it entirely.\nHarry Potter has it’s flaws and is certainly not literature, but, to its credit (in the two books I’ve read) never attempts to mix Christian Religion into it’s narrative. I am recalling your response to the letter I wrote to you after reading\nyour first book wondering how Dr. Boyd might handle the time travel part of your story when he doesn’t believe that the future exists yet. You (reasonably) responded “He is an intelligent man who is perfectly capable of understanding the difference between a serious theological work and a fantasy novel, which is why he doesn’t get too worked up about my playing around with various theological concepts.“\nWell, he might not, and you might not, but I do. Even in fiction, if something goes strongly against my world view, it makes me like the book less, especially if I’m reading it to my children.\nSo now (as evidence to the contrary of what I just said, or so it seems) I’m reading ‘Tom Sawyer’ to them. In just the first few chapters: Lieing and Fighting are glorified (at least at face value) and church is shown to be boring and focused on showing off. But it makes my boys laugh, it make me laugh and it so much fun to read out loud. Oh well.\nThere are two separate issues here.  First, the vaguely New Age, multiple paths towards Truth manner in which religion is handled by Susan Cooper and Madeleine L’Engle doesn’t trouble me at all.  Neither author is actually attempting to make any serious theological statement, Good and Evil are primarily used as a backdrop, as a means of creating an impression of a larger stage upon which the novels are played out.\nOne must keep in mind that both women are of a previous generation that was not entirely secularized, thus their work is essentially atheistic at heart but they are too steeped in the Christian culture of the West to abandon it entirely.  This is part of the source of their power, of course, most fully atheist works of modern fantasy tend to be weak and absolutely forgettable since they don’t draw effectively on what can either be considered the Real or the Mythic depending upon one’s perspective.\nIndeed, I suspect that the lasting greatness of both “The Dark is Rising” and “A Wrinkle in Time” (I must say that I vastly prefer “A Swiftly Tilting Planet”, by the way), is somewhat dependent upon their lack of specifics, not only with regards to religion but also history.  Rather than explaining precisely how everything works, both writers have the skill to paint with impressions, which somehow leaves the reader with a picture that is more meaningful than one laid out with more precision in the particulars.  I expect JK Rowlings will be largely forgotten in 30 years, while Cooper and L’Engle are still being read.\nAs for your second point, it should be kept in mind that these are not children’s books.  They are for teenagers and precocious pre-teens, they are for those who are sufficiently developed to deal with partial truths and understand how they can be useful in understanding the fullness of the Truth.  I suspect you don’t fully understand that a writer’s basic objective in writing a work of fiction seldom involves the idea of presenting an argument to the reader, barring the obvious examples to the contrary such as Messrs. Jenkins and LaHaye or Sherri Tepper.\nI don’t see my books as attempting to tell anyone anything, I see them more as posing questions and offering potential answers to those questions.  In the first book, the question is “why don’t we choose evil when it seems to offer us so much more of what we want?”  In the second, “how is it that an angry, bitter boy is pushed over the edge to become a killer when so many others aren’t?”  In the third, “is it possible that God not only plays dice with the Devil, but does so with loaded dice?”\nGiven that my skill is much inferior to both the aforementioned ladies, this may not always come through to the reader.   Mere brainpower is a poor substitute for true artistic talent.  At any rate, don’t forget that novels are entertainment, and while they may be\nsopratutto\na thinking woman’s entertainment and occasionally provoke a thought or three on the part of the reader, it would be a mistake to place too much theological weight on them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-31T10:07:00+00:00"
}