{
  "url": "https://voxday.net/2006/08/30/mailvox-complex-valuations/",
  "scraped_at": "2026-01-08T21:16:22.982322",
  "title": "Mailvox: complex valuations",
  "date_display": "August 30, 2006",
  "date_iso": "2006-08-30T13:00:00+00:00",
  "date_from_url": "2006-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LE thinks it is difficult to entirely separate sexual values on the basis of gender:</p><blockquote><p>[Vox disputed that] men’s sexuality necessarily effects the value of a woman’s?</p><p>Here may lie the difference, is P more than just dollars and cents.  The sexual economy suggest it is but even so, P for a man is different than P for a woman….</p><p>Prolog – <br>A woman would argue, sexual value is more than dollars and cents it includes a element of desire… but for women desire is a function of dollars and cents, in other words, for women it is about the money… whereas for men it is more about the sexuality… both of which as predispositions of our cave man days…  Example if an old man has money but is not hot, he can still attract women (ask any old Texas oilman before he dies); whereas an old woman with lots of money is not as likely to attract a man…</br></p><p>answer –</p><p>Every little girls favorite fairy tale is Cinderella; Pretty woman, etc…  In those instances, is he prince charming because (1) he is hot, (2) he’s got money or (3) because there is competition for him.  I think we can all conclude that (3) is simply a function of (1) and (2).  Now if he’s hot but broke, a woman may be attracted to him in the sort term but realistically there is no happily ever after… there is no fantasy…  There is no Disney movie about the broke artist who marries the common girl, they live hand to mouth for the rest of their life but have great sex.. Except for Shreck, may be, but then again he owns the whole swamp…</p><p>On the other hand, if he’s rich but not so hot, woman is attracted not to him, but to his resources..  But when those resources are used to improve the sexual value of a woman – you now have the same woman but now better dressed, bobbled, and all other benefits of money – she becomes more attractive to other men (i.e. pretty woman).  (What do you know of good bone structure in a trailer park?).  Through his money, her sexual value goes up though she personally has done nothing but convert is dollars to improve her value.. Upon improving her value she can move to another man yet increasing her value more…(climbing the ladder)… If she looses his money in a nasty divorce, she is quickly divested of the “P” she converted from her rich man, unless she secures another quickly… Now contrast the above, if he is hot but has no money, there is no increase in value to her,thus men’s sexuality necessarily effects the value of a woman’s …  Therefore a man’s “P” directly affects a woman “P” through his dollars and cents.</p><p>Now a career woman has a “P” but that does little or nothing to improve a man’s “P”. (Paris Hilton doe not improve a mans sexuality; strip Paris Hilton of her father’s money does she still remain desirable?)  Her “P” is a lost opportunity cost in dollar and cents and to a certain degree her desirability which typically is inversely proportional… (i.e. 20, broke and hot – may equal – 40, well off and fair).  With age and the demands of work, the element of desirability goes down in the total valuation of “P”.  Ask your self who wants to hook up with a rich 60-year old woman?; in the converse who wants to hook up with a rich 60-year old man?  Based on market forces; a woman “P” in dollars in cents is minimal when compared to desirability.  Thus if you are a career woman, and elect to rely on dollars an cents, you bring little long term to the table when assessing sexual value.</p><p>Query, because of the sexual revolution women are reduced to produce?</p></blockquote><p>I still disagree, because this notion of a complex P wherein the man’s resources are factored into the equation doesn’t apply to most women.  Furthermore, many women don’t avail themselves of the opportunity to improve P even if male resources are available; there’s no shortage of women who could afford bigger breasts, personal trainers or straight teeth but choose to spend their husband’s money elsewhere.  Thus a modification to the PEN/5 formula would require a minimum of two additional variables.</p><p>This is unnecessary.  The sexual value formula merely represents a snapshot in time and it increases or decreases as circumstances change… simply by increasing N from the average 1.11 times per week to 3/week allows a woman to nearly triple her sexual value….  I expect most people wish their financial value was so easily modified to a similar degree.  P is rather less malleable, for although it can be increased in the short term, over time it will inevitably degrade.</p><p>I’ve been thinking about a similar valuation for men, but it’s probably quite simple.  Rate the guy’s looks from 1 to 5, (two being average) then multiply by his after-tax salary and divide by ten.  This should provide a rough guide to the average value of women interested in him.  Thus, to interest the elite 50k+ women, a man would either have to be unusually handsome and make 100k after taxes whereas the average guy would need to make at least $250k.</p></div>",
  "content_text": "LE thinks it is difficult to entirely separate sexual values on the basis of gender:\n[Vox disputed that] men’s sexuality necessarily effects the value of a woman’s?\nHere may lie the difference, is P more than just dollars and cents.  The sexual economy suggest it is but even so, P for a man is different than P for a woman….\nProlog –\nA woman would argue, sexual value is more than dollars and cents it includes a element of desire… but for women desire is a function of dollars and cents, in other words, for women it is about the money… whereas for men it is more about the sexuality… both of which as predispositions of our cave man days…  Example if an old man has money but is not hot, he can still attract women (ask any old Texas oilman before he dies); whereas an old woman with lots of money is not as likely to attract a man…\nanswer –\nEvery little girls favorite fairy tale is Cinderella; Pretty woman, etc…  In those instances, is he prince charming because (1) he is hot, (2) he’s got money or (3) because there is competition for him.  I think we can all conclude that (3) is simply a function of (1) and (2).  Now if he’s hot but broke, a woman may be attracted to him in the sort term but realistically there is no happily ever after… there is no fantasy…  There is no Disney movie about the broke artist who marries the common girl, they live hand to mouth for the rest of their life but have great sex.. Except for Shreck, may be, but then again he owns the whole swamp…\nOn the other hand, if he’s rich but not so hot, woman is attracted not to him, but to his resources..  But when those resources are used to improve the sexual value of a woman – you now have the same woman but now better dressed, bobbled, and all other benefits of money – she becomes more attractive to other men (i.e. pretty woman).  (What do you know of good bone structure in a trailer park?).  Through his money, her sexual value goes up though she personally has done nothing but convert is dollars to improve her value.. Upon improving her value she can move to another man yet increasing her value more…(climbing the ladder)… If she looses his money in a nasty divorce, she is quickly divested of the “P” she converted from her rich man, unless she secures another quickly… Now contrast the above, if he is hot but has no money, there is no increase in value to her,thus men’s sexuality necessarily effects the value of a woman’s …  Therefore a man’s “P” directly affects a woman “P” through his dollars and cents.\nNow a career woman has a “P” but that does little or nothing to improve a man’s “P”. (Paris Hilton doe not improve a mans sexuality; strip Paris Hilton of her father’s money does she still remain desirable?)  Her “P” is a lost opportunity cost in dollar and cents and to a certain degree her desirability which typically is inversely proportional… (i.e. 20, broke and hot – may equal – 40, well off and fair).  With age and the demands of work, the element of desirability goes down in the total valuation of “P”.  Ask your self who wants to hook up with a rich 60-year old woman?; in the converse who wants to hook up with a rich 60-year old man?  Based on market forces; a woman “P” in dollars in cents is minimal when compared to desirability.  Thus if you are a career woman, and elect to rely on dollars an cents, you bring little long term to the table when assessing sexual value.\nQuery, because of the sexual revolution women are reduced to produce?\nI still disagree, because this notion of a complex P wherein the man’s resources are factored into the equation doesn’t apply to most women.  Furthermore, many women don’t avail themselves of the opportunity to improve P even if male resources are available; there’s no shortage of women who could afford bigger breasts, personal trainers or straight teeth but choose to spend their husband’s money elsewhere.  Thus a modification to the PEN/5 formula would require a minimum of two additional variables.\nThis is unnecessary.  The sexual value formula merely represents a snapshot in time and it increases or decreases as circumstances change… simply by increasing N from the average 1.11 times per week to 3/week allows a woman to nearly triple her sexual value….  I expect most people wish their financial value was so easily modified to a similar degree.  P is rather less malleable, for although it can be increased in the short term, over time it will inevitably degrade.\nI’ve been thinking about a similar valuation for men, but it’s probably quite simple.  Rate the guy’s looks from 1 to 5, (two being average) then multiply by his after-tax salary and divide by ten.  This should provide a rough guide to the average value of women interested in him.  Thus, to interest the elite 50k+ women, a man would either have to be unusually handsome and make 100k after taxes whereas the average guy would need to make at least $250k.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-30T12:00:00+00:00"
}