{
  "url": "https://voxday.net/2006/08/01/neocons-are-nervous/",
  "scraped_at": "2026-01-08T21:14:06.097821",
  "title": "The neocons are nervous",
  "date_display": "August 1, 2006",
  "date_iso": "2006-08-01T15:28:00+00:00",
  "date_from_url": "2006-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So Michael Ledeen is lying again as <a href=\"http://article.nationalreview.com/?q=N2RlNjNjZWNlOTQzNTVjMTRjMWY4MzRkMDQzYmY5ZjM=\">he tries to inoculate himself and his fellow World Demokratic Revolutionists from criticism</a>:</p><blockquote><p>Meanwhile, a collection of frauds, writing in places like Rolling Stone, Vanity Fair, The New Yorker, and Mother Jones, continuously recycles a story saying that a neocon (code for “Jewish”) conspiracy duped Bush into going to war in Iraq, and is now arranging the invasion of Iran.</p></blockquote><p>Yes, because all those people just hate Jews, just like Mel Gibson.  I mean, they’ve got nothing better to do than just sit around hating Jews.  Come on!  You’d think that with the way in which the “anti-semitic” slur is fast losing its effectiveness, a bright guy like Michael Ledeen would know better than to try expanding it to encompass neoconservatism.</p><p>I was <a href=\"http://www.voxday.net/archive/2004/010504.html\">onto this fraud two years ago</a> when Joel Mowbray was pushing that line in his embarrassing “General Zinni, What A Ninny” column – wherein he absurdly attempted to claim that Zinni’s criticism of a bunch of non-Jewish neocons was proof of his <em>Judenhassen</em>.  Also, apparently Rush Limbaugh has signed onto the program of insisting that “neocon” is a code word for Jew.  Unfortunately for these would-be reality definers, when prominent neocons such as Fukuyama and the elder Kristol have openly defined its meaning, their task is hopeless.  At least Ledeen merely tries to sneak it in there via parentheses as if he knows it’s pointless.</p><p>I predict that by the time this latest Mideast crisis finally ends, “neocon” will be considered to be a more damning slur than “anti-semite”.</p></div>",
  "content_text": "So Michael Ledeen is lying again as\nhe tries to inoculate himself and his fellow World Demokratic Revolutionists from criticism\n:\nMeanwhile, a collection of frauds, writing in places like Rolling Stone, Vanity Fair, The New Yorker, and Mother Jones, continuously recycles a story saying that a neocon (code for “Jewish”) conspiracy duped Bush into going to war in Iraq, and is now arranging the invasion of Iran.\nYes, because all those people just hate Jews, just like Mel Gibson.  I mean, they’ve got nothing better to do than just sit around hating Jews.  Come on!  You’d think that with the way in which the “anti-semitic” slur is fast losing its effectiveness, a bright guy like Michael Ledeen would know better than to try expanding it to encompass neoconservatism.\nI was\nonto this fraud two years ago\nwhen Joel Mowbray was pushing that line in his embarrassing “General Zinni, What A Ninny” column – wherein he absurdly attempted to claim that Zinni’s criticism of a bunch of non-Jewish neocons was proof of his\nJudenhassen\n.  Also, apparently Rush Limbaugh has signed onto the program of insisting that “neocon” is a code word for Jew.  Unfortunately for these would-be reality definers, when prominent neocons such as Fukuyama and the elder Kristol have openly defined its meaning, their task is hopeless.  At least Ledeen merely tries to sneak it in there via parentheses as if he knows it’s pointless.\nI predict that by the time this latest Mideast crisis finally ends, “neocon” will be considered to be a more damning slur than “anti-semite”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-08-01T14:28:00+00:00"
}