{
  "url": "https://voxday.net/2017/08/23/1354-pages-free/",
  "scraped_at": "2025-12-19T10:21:13.175633",
  "title": "1,354 pages free",
  "date_display": "August 23, 2017",
  "date_iso": "2017-08-23T12:00:00+00:00",
  "date_from_url": "2017-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"clear: both; text-align: center;\"><a href=\"http://amzn.to/2iLEUmG\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"404\" data-original-width=\"512\" decoding=\"async\" fetchpriority=\"high\" height=\"252\" src=\"https://pbs.twimg.com/media/DH6KRptXcAAejnB.jpg\" width=\"320\"/></a></div><p>I’m pleased to be able to inform everyone that both <b><i><a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a></i></b> and <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b> are free ebooks today on Amazon. That is a combined 1,354 pages of truly epic fantasy, and will cost you literally nothing except the hours required to read them.<br> <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b><br> In Selenoth, the war drums are beating throughout the land. The savage orcs of Hagahorn and Zoth Ommog are on the move, imperiling Man, Dwarf, and Elf alike. The Houses Martial of Amorr have gone to war with each other, pitting legion against legion, and family against family, as civil war wracks the disintegrating Empire. In the north, inhuman wolf-demons besiege the last redoubt of Man in the White Sea, while in Savondir, the royal house of de Mirid desperately prepares to defend the kingdom against an invading army that is larger than any it has ever faced before. And in the underground realm of the King of Iron Mountain, a strange new enemy has been attacking dwarf villages throughout the Underdeep.<br> Beneath the widespread violence that has seized all Selenoth in its grasp, a select few are beginning to recognize the appearance of a historic pattern of almost unimaginable proportions. Are all these conflicts involving Orc, Elf, Man, and Dwarf the natural result of inevitable rivalries, or are they little more than battlegrounds in an ancient war that began long before the dawn of time?<br> <i><br> </br></i><b>From the reviews:</b></br></br></br></br></p><ul><li><i>“With this book, Vox Day has catapulted himself into the storied and rarefied rank of writers that sits just below The Master himself. That’s right, I went there. I just said that Vox Day has written a book that is nearly as good as J. R. R. Tolkien’s work.”</i></li><li><i>“It is the best fantasy book of the past 50 years.”</i></li><li><i>“As richly developed as its predecessor was, A Sea Of Skulls added many new dimensions to this world and the crisis it’s in. All the positives I spoke of in my review of A Throne Of Bones, and more, were leveled up.”</i></li><li><i>“Vox’s Selenoth is amazing. I can hardly wait for more. I am a big-time Tolkien and George Martin fan. Vox’s Selenoth has wiggled its way between Middle Earth and Westeros”</i></li><li><i>“Why did it take me so long to find Vox Day? What a great storyteller this man is, a grand master of multiverse chess.”</i></li></ul><div>As you may recall, <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b> is a Finalist for Best Fantasy Novel in the 2017 Dragon Awards. If you find it sufficiently compelling, you may wish <a href=\"http://application.dragoncon.org/dc_fan_awards_signup.php\">to vote for it here</a> before August 28th.</div></div>",
  "content_text": "I’m pleased to be able to inform everyone that both\nA THRONE OF BONES\nand\nA SEA OF SKULLS\nare free ebooks today on Amazon. That is a combined 1,354 pages of truly epic fantasy, and will cost you literally nothing except the hours required to read them.\nA SEA OF SKULLS\nIn Selenoth, the war drums are beating throughout the land. The savage orcs of Hagahorn and Zoth Ommog are on the move, imperiling Man, Dwarf, and Elf alike. The Houses Martial of Amorr have gone to war with each other, pitting legion against legion, and family against family, as civil war wracks the disintegrating Empire. In the north, inhuman wolf-demons besiege the last redoubt of Man in the White Sea, while in Savondir, the royal house of de Mirid desperately prepares to defend the kingdom against an invading army that is larger than any it has ever faced before. And in the underground realm of the King of Iron Mountain, a strange new enemy has been attacking dwarf villages throughout the Underdeep.\nBeneath the widespread violence that has seized all Selenoth in its grasp, a select few are beginning to recognize the appearance of a historic pattern of almost unimaginable proportions. Are all these conflicts involving Orc, Elf, Man, and Dwarf the natural result of inevitable rivalries, or are they little more than battlegrounds in an ancient war that began long before the dawn of time?\nFrom the reviews:\n“With this book, Vox Day has catapulted himself into the storied and rarefied rank of writers that sits just below The Master himself. That’s right, I went there. I just said that Vox Day has written a book that is nearly as good as J. R. R. Tolkien’s work.”\n“It is the best fantasy book of the past 50 years.”\n“As richly developed as its predecessor was, A Sea Of Skulls added many new dimensions to this world and the crisis it’s in. All the positives I spoke of in my review of A Throne Of Bones, and more, were leveled up.”\n“Vox’s Selenoth is amazing. I can hardly wait for more. I am a big-time Tolkien and George Martin fan. Vox’s Selenoth has wiggled its way between Middle Earth and Westeros”\n“Why did it take me so long to find Vox Day? What a great storyteller this man is, a grand master of multiverse chess.”\nAs you may recall,\nA SEA OF SKULLS\nis a Finalist for Best Fantasy Novel in the 2017 Dragon Awards. If you find it sufficiently compelling, you may wish\nto vote for it here\nbefore August 28th.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-23T11:00:00+00:00"
}