{
  "url": "https://voxday.net/2017/08/04/2017-dragon-award-finalists/",
  "scraped_at": "2025-12-18T07:25:15.676125",
  "title": "2017 Dragon Award Finalists",
  "date_display": "August 4, 2017",
  "date_iso": "2017-08-04T08:47:00+00:00",
  "date_from_url": "2017-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Congratulations to the Castalia House authors who were just named 2017 Dragon Award Finalists. By category:</p><p><b>Best Fantasy Novel</b></p><p><i><a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a></i> by Vox Day<br> <b><br/></b><br> <b>Best Young Adult / Middle Grade Novel</b></br></br></p><p><i><a href=\"http://amzn.to/2bKVwuD\">Swan Knight’s Son</a></i> by John C. Wright<br> <b><br/></b><br> <b>Best Military Science Fiction or Fantasy Novel</b><br> <i><br/></i><br> <i><a href=\"http://amzn.to/2jgAkQu\">Starship Liberator</a></i> by B.V. Larson and David VanDyke</br></br></br></br></p><p><b>Best Alternate History Novel</b><br> <i><br/></i><br> <i><a href=\"http://amzn.to/2pgk2I1\">No Gods, Only Daimons</a></i> by Kai Wai Cheah</br></br></p><p>To celebrate this announcement, both <a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a> and <i><a href=\"http://amzn.to/2pgk2I1\">No Gods, Only Daimons</a></i> have been made available to Kindle Unlimited subscribers. <a href=\"http://amzn.to/2bKVwuD\">Swan Knight’s Son</a> is already available on KU. Congratulations are also due to Castalia House friends Larry Correia, Brien Niemeier, L. Jagi Lamplighter, Jon del Arroz, Declan Finn, Lou Antonelli, and Richard Fox, all of whom were nominated in various categories. And thanks to everyone who made this happen by supporting us! Here is <a href=\"https://louantonelli.blogspot.com/2017/08/the-ballot-has-been-released-for-this.html\">the complete ballot</a><a href=\"https://www.blogger.com/\"></a>.</p><p>There are clearly no shoe-ins, as it’s clear that a lot more people, and a much broader swath of the science fiction, fantasy, and game markets are getting involved. Both Scalzi and Jemisin scored nominations. I was a little surprised that <i>Total War: Warhammer</i> didn’t make it in the Computer Game category, but I was pleased to see that <i>Gloomhaven </i>did in Board Games.</p><p>The main competition for <i>A Sea of Skulls</i> appears to be <i>Monster Hunter Memoirs: Grunge</i> by Larry Correia and John Ringo. Correia <i>and</i> Ringo? Yeah, it’s hard to like my odds there, given that both their fan bases are bigger than mine.</p><p>John C. Wright is up against his own wife as well as <i>The Hammer of Thor </i>by Rick Riordan, while B.V. Larson and David VanDyke would appear to be the slight favorites in their category, despite facing <i>Iron Dragoons</i> by Richard Fox, <i>Star Realms: Rescue Run</i> by Jon Del Arroz and <i>Caine’s Mutiny</i> by Charles E. Gannon. And Kai Wai Cheah has the daunting task of going up against both <i>Fallout: The Hot War</i> by Harry Turtledove and <i>The Last Days of New Paris </i>by China Mieville.</p><p>So, it would appear unlikely that Castalia House will take home two Dragons for a second straight year, but one never knows. Regardless, be sure to vote if you receive a ballot, and note that you can still sign up <a href=\"http://application.dragoncon.org/dc_fan_awards_signup.php\">to vote on the Finalists</a> before Tuesday, August 29th.</p></div>",
  "content_text": "Congratulations to the Castalia House authors who were just named 2017 Dragon Award Finalists. By category:\nBest Fantasy Novel\nA Sea of Skulls\nby Vox Day\nBest Young Adult / Middle Grade Novel\nSwan Knight’s Son\nby John C. Wright\nBest Military Science Fiction or Fantasy Novel\nStarship Liberator\nby B.V. Larson and David VanDyke\nBest Alternate History Novel\nNo Gods, Only Daimons\nby Kai Wai Cheah\nTo celebrate this announcement, both\nA Sea of Skulls\nand\nNo Gods, Only Daimons\nhave been made available to Kindle Unlimited subscribers.\nSwan Knight’s Son\nis already available on KU. Congratulations are also due to Castalia House friends Larry Correia, Brien Niemeier, L. Jagi Lamplighter, Jon del Arroz, Declan Finn, Lou Antonelli, and Richard Fox, all of whom were nominated in various categories. And thanks to everyone who made this happen by supporting us! Here is\nthe complete ballot\n.\nThere are clearly no shoe-ins, as it’s clear that a lot more people, and a much broader swath of the science fiction, fantasy, and game markets are getting involved. Both Scalzi and Jemisin scored nominations. I was a little surprised that\nTotal War: Warhammer\ndidn’t make it in the Computer Game category, but I was pleased to see that\nGloomhaven\ndid in Board Games.\nThe main competition for\nA Sea of Skulls\nappears to be\nMonster Hunter Memoirs: Grunge\nby Larry Correia and John Ringo. Correia\nand\nRingo? Yeah, it’s hard to like my odds there, given that both their fan bases are bigger than mine.\nJohn C. Wright is up against his own wife as well as\nThe Hammer of Thor\nby Rick Riordan, while B.V. Larson and David VanDyke would appear to be the slight favorites in their category, despite facing\nIron Dragoons\nby Richard Fox,\nStar Realms: Rescue Run\nby Jon Del Arroz and\nCaine’s Mutiny\nby Charles E. Gannon. And Kai Wai Cheah has the daunting task of going up against both\nFallout: The Hot War\nby Harry Turtledove and\nThe Last Days of New Paris\nby China Mieville.\nSo, it would appear unlikely that Castalia House will take home two Dragons for a second straight year, but one never knows. Regardless, be sure to vote if you receive a ballot, and note that you can still sign up\nto vote on the Finalists\nbefore Tuesday, August 29th.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-04T07:47:00+00:00"
}