{
  "url": "https://voxday.net/2017/08/29/a-disappointment/",
  "scraped_at": "2025-12-19T10:21:53.559367",
  "title": "A disappointment",
  "date_display": "August 29, 2017",
  "date_iso": "2017-08-29T13:00:00+00:00",
  "date_from_url": "2017-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>‘Game Of Thrones’ Audience Disappointed By Season Finale’s Bland, Uninspired Incest</b><br> <i>Criticizing the show’s reluctance to explore new creative ground, Game Of Thrones fans reported being disappointed Sunday by the bland, uninspired incest in the HBO drama’s season finale.</i><br> <i><br> </br></i><i>“You’d think this far into the show’s run they’d have found some new angles on incestuous relationships, but this was just more of the same, by-the-numbers intercourse between blood relatives we’ve seen before,” said local viewer Jaime Cohn, echoing the views of thousands of fans who complained about the series’ increasingly derivative depiction of sexual relations between siblings and other family members. “In the early seasons, it felt like the show’s creators weren’t afraid to take risks on fresh ideas like incest involving twins or even between multiple generations of the same family, but since then it hasn’t really progressed at all. By this point, they should be experimenting with things like group sex with identical quadruplets, but it’s pretty obvious that the writers are just on autopilot now.” </i><br> <i><br> </br></i><i>Despite their disappointment with the episode’s lackluster incest, fans almost unanimously agreed that the show’s latest season had staked out bold new territory in terms of narrative implausibility.</i><br> <i><br> </br></i>As for myself, I was a little shocked. There has been no rape at all this entire season. Which would seem impossible for <i>A Game of Thrones</i>, until you recall that the series has passed the material from George RR Martin’s novels. But I’m sure Martin will rectify this shocking and uncharacteristic omission when he finally gets around to writing the novelization of the TV series based on his previous novels.<br> There is still a long way to go, but I have to admit that I am increasingly confident that <b><i><a href=\"http://amzn.to/2iLEUmG\">ARTS OF DARK AND LIGHT</a></i></b> will eventually come to be seen as superior epic fantasy in comparison to A SONG OF ICE AND FIRE.</br></br></br></br></br></p></div>",
  "content_text": "‘Game Of Thrones’ Audience Disappointed By Season Finale’s Bland, Uninspired Incest\nCriticizing the show’s reluctance to explore new creative ground, Game Of Thrones fans reported being disappointed Sunday by the bland, uninspired incest in the HBO drama’s season finale.\n“You’d think this far into the show’s run they’d have found some new angles on incestuous relationships, but this was just more of the same, by-the-numbers intercourse between blood relatives we’ve seen before,” said local viewer Jaime Cohn, echoing the views of thousands of fans who complained about the series’ increasingly derivative depiction of sexual relations between siblings and other family members. “In the early seasons, it felt like the show’s creators weren’t afraid to take risks on fresh ideas like incest involving twins or even between multiple generations of the same family, but since then it hasn’t really progressed at all. By this point, they should be experimenting with things like group sex with identical quadruplets, but it’s pretty obvious that the writers are just on autopilot now.”\nDespite their disappointment with the episode’s lackluster incest, fans almost unanimously agreed that the show’s latest season had staked out bold new territory in terms of narrative implausibility.\nAs for myself, I was a little shocked. There has been no rape at all this entire season. Which would seem impossible for\nA Game of Thrones\n, until you recall that the series has passed the material from George RR Martin’s novels. But I’m sure Martin will rectify this shocking and uncharacteristic omission when he finally gets around to writing the novelization of the TV series based on his previous novels.\nThere is still a long way to go, but I have to admit that I am increasingly confident that\nARTS OF DARK AND LIGHT\nwill eventually come to be seen as superior epic fantasy in comparison to A SONG OF ICE AND FIRE.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-29T12:00:00+00:00"
}