{
  "url": "https://voxday.net/2017/08/20/affirmative-action-is-protection-money/",
  "scraped_at": "2025-12-19T10:20:52.406498",
  "title": "Affirmative Action is protection money",
  "date_display": "August 20, 2017",
  "date_iso": "2017-08-20T13:00:00+00:00",
  "date_from_url": "2017-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An astute article by Robert Weissberg points out <a href=\"http://www.unz.com/article/sacrificing-smart-asians-to-keep-the-racial-peace/\">the true purpose of affirmative action</a>, while illustrating why it can’t survive much longer:</p><blockquote><p>When confronting a sizable, potentially disruptive population unable or unwilling to assimilate, a perfect solution is beyond reach. Choices are only among the lesser of evils and, to repeat, under current conditions, race-driven affirmative action is conceivably the best of the worst. A hard-headed realist would draw a parallel with how big city merchants survive by paying off the police, building and food inspectors, and the Mafia. Racial preferences are just one more item on the cost-of-doing business list–the Danegeld.<br> In effect, racial preferences in elite higher education (and beneficiaries includes students, professors and the diversity-managing administrators) separates the top 10% measured in cognitive ability from their more violent down market racial compatriots. While this manufactured caste-like arrangement hardly guarantees racial peace (as the black-on-white crime rate, demonstrates) but it pretty much dampens the possibility of more collective, well-organized related upheavals, the types of disturbances that truly terrify the white establishment. Better to have the handsomely paid Cornel West pontificating about white racism at Princeton where he is a full professor than fulminating at some Ghetto street corner. This status driven divide just reflects human nature. Why would a black Yalie on Wall Street socialize with the bro’s left behind in the Hood? This is the strategy of preventing a large-scale, organized rebellion by decapitating its potential leadership. Violence is now just Chicago or Baltimore-style gang-banger intra-racial mayhem or various lone-wolf criminal attacks on whites.<br> Co-optation is a staple in the political management repertoire. The Soviet Union adsorbed what they called the “leading edge” into the Party (anyone exceptionally accomplished, from chess grandmasters or world-class athletes) to widen the divide the dominant elite, i.e., the Party, and hoi polloi. Election systems can be organized to guarantee a modicum of power to a handful of potential disruptors and with this position comes ample material benefits (think Maxine Waters). Monarchies have similarly managed potential strife by bestowing honors and titles on commoners. It is no accident that many radicals are routinely accused of “selling out” by their former colleagues in arms. In most instances the accusation is true, and this is by design.</br></br></p></blockquote><p>As John Derbyshire has noted, the USA is running out of young whites and Asians to sacrifice on the altar of Diversity. Average IQ is declining rapidly, and the value of the fake degrees being used to cut off the black populace from its natural leaders are falling even faster.<br> But then, this was always going to end one way, as Kipling warned us.<br> <i>We never pay anyone Dane-geld,</i><br> <i>No matter how trifling the cost;</i><br> <i>For the end of that game is oppression and shame,</i><br> <i>And the nation that pays it is lost!</i></br></br></br></br></br></p></div>",
  "content_text": "An astute article by Robert Weissberg points out\nthe true purpose of affirmative action\n, while illustrating why it can’t survive much longer:\nWhen confronting a sizable, potentially disruptive population unable or unwilling to assimilate, a perfect solution is beyond reach. Choices are only among the lesser of evils and, to repeat, under current conditions, race-driven affirmative action is conceivably the best of the worst. A hard-headed realist would draw a parallel with how big city merchants survive by paying off the police, building and food inspectors, and the Mafia. Racial preferences are just one more item on the cost-of-doing business list–the Danegeld.\nIn effect, racial preferences in elite higher education (and beneficiaries includes students, professors and the diversity-managing administrators) separates the top 10% measured in cognitive ability from their more violent down market racial compatriots. While this manufactured caste-like arrangement hardly guarantees racial peace (as the black-on-white crime rate, demonstrates) but it pretty much dampens the possibility of more collective, well-organized related upheavals, the types of disturbances that truly terrify the white establishment. Better to have the handsomely paid Cornel West pontificating about white racism at Princeton where he is a full professor than fulminating at some Ghetto street corner. This status driven divide just reflects human nature. Why would a black Yalie on Wall Street socialize with the bro’s left behind in the Hood? This is the strategy of preventing a large-scale, organized rebellion by decapitating its potential leadership. Violence is now just Chicago or Baltimore-style gang-banger intra-racial mayhem or various lone-wolf criminal attacks on whites.\nCo-optation is a staple in the political management repertoire. The Soviet Union adsorbed what they called the “leading edge” into the Party (anyone exceptionally accomplished, from chess grandmasters or world-class athletes) to widen the divide the dominant elite, i.e., the Party, and hoi polloi. Election systems can be organized to guarantee a modicum of power to a handful of potential disruptors and with this position comes ample material benefits (think Maxine Waters). Monarchies have similarly managed potential strife by bestowing honors and titles on commoners. It is no accident that many radicals are routinely accused of “selling out” by their former colleagues in arms. In most instances the accusation is true, and this is by design.\nAs John Derbyshire has noted, the USA is running out of young whites and Asians to sacrifice on the altar of Diversity. Average IQ is declining rapidly, and the value of the fake degrees being used to cut off the black populace from its natural leaders are falling even faster.\nBut then, this was always going to end one way, as Kipling warned us.\nWe never pay anyone Dane-geld,\nNo matter how trifling the cost;\nFor the end of that game is oppression and shame,\nAnd the nation that pays it is lost!",
  "tags": [
    "education",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-20T12:00:00+00:00"
}