{
  "url": "https://voxday.net/2017/08/16/antifa-alt-left/",
  "scraped_at": "2025-12-19T10:20:22.343226",
  "title": "Antifa = Alt Left",
  "date_display": "August 16, 2017",
  "date_iso": "2017-08-16T00:23:00+00:00",
  "date_from_url": "2017-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In one fell swoop, the God-Emperor <a href=\"http://www.latimes.com/politics/washington/la-na-essential-washington-updates-trump-blames-both-sides-for-1502828835-htmlstory.html\">changed the rhetorical game</a>:</p><blockquote><p>“What about the ‘alt-left’ that came charging at, as you say, the ‘alt-right’? Do they have any semblance of guilt?” Trump said. “They came charging with clubs in their hands,” he said of the counter-protesters.<br> Trump effectively reopened the debate, despite insistence from politicians in both parties that white supremacists and other racists deserved to be singled out.<br> “You had a group on one side that was mad, and you had a group on the other side that was violent. Nobody wants to say that, but I’ll say that,” he said.<br> Trump defended the cause of those who gathered to protest the removal of a statue honoring Gen. Robert E. Lee and the Confederacy.<br> “Was George Washington a slave owner. So will George Washington lose his status?” he said. “What do you think of Thomas Jefferson? Do you like him? … You’re changing history. You’re changing culture.”<br> While Trump condemned the driver who rammed the crowd and killed a counter-protester, he declined to label the action specifically as an act of terrorism.</br></br></br></br></br></p></blockquote><p>That’s the power of the bully pulpit. And that’s the work of a master of rhetoric in action. Trump is right to decline to label the action of the driver as terrorism, because the chances are extremely good that he’s never going to face trial.<br> This is not the first time someone has run over and killed protesters blocking the road. In previous cases, the drivers were found not guilty of any wrongdoing. No doubt the video of masked antifas smashing the car with metal bars is going to go a long way towards exculpating the killer driver.</br></p></div>",
  "content_text": "In one fell swoop, the God-Emperor\nchanged the rhetorical game\n:\n“What about the ‘alt-left’ that came charging at, as you say, the ‘alt-right’? Do they have any semblance of guilt?” Trump said. “They came charging with clubs in their hands,” he said of the counter-protesters.\nTrump effectively reopened the debate, despite insistence from politicians in both parties that white supremacists and other racists deserved to be singled out.\n“You had a group on one side that was mad, and you had a group on the other side that was violent. Nobody wants to say that, but I’ll say that,” he said.\nTrump defended the cause of those who gathered to protest the removal of a statue honoring Gen. Robert E. Lee and the Confederacy.\n“Was George Washington a slave owner. So will George Washington lose his status?” he said. “What do you think of Thomas Jefferson? Do you like him? … You’re changing history. You’re changing culture.”\nWhile Trump condemned the driver who rammed the crowd and killed a counter-protester, he declined to label the action specifically as an act of terrorism.\nThat’s the power of the bully pulpit. And that’s the work of a master of rhetoric in action. Trump is right to decline to label the action of the driver as terrorism, because the chances are extremely good that he’s never going to face trial.\nThis is not the first time someone has run over and killed protesters blocking the road. In previous cases, the drivers were found not guilty of any wrongdoing. No doubt the video of masked antifas smashing the car with metal bars is going to go a long way towards exculpating the killer driver.",
  "tags": [
    "law",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-15T23:23:00+00:00"
}