{
  "url": "https://voxday.net/2017/08/08/back-early/",
  "scraped_at": "2025-12-18T07:25:47.341481",
  "title": "Back early",
  "date_display": "August 8, 2017",
  "date_iso": "2017-08-08T02:23:00+00:00",
  "date_from_url": "2017-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Google’s CEO returns home early from vacation and sends a message:</p><blockquote><p>From: Sundar<br> Subject: Our words matter<br> This has been a very difficult few days. I wanted to provide an update on the memo that was circulated over this past week.<br> First, let me say that we strongly support the right of Googlers to express themselves, and much of what was in that memo is fair to debate, regardless of whether a vast majority of Googlers disagree with it. However, portions of the memo violate our Code of Conduct and cross the line by advancing harmful gender stereotypes in our workplace. Our job is to build great products for users that make a difference in their lives. To suggest a group of our colleagues have traits that make them less biologically suited to that work is offensive and not OK. It is contrary to our basic values and our Code of Conduct, which expects “each Googler to do their utmost to create a workplace culture that is free of harassment, intimidation, bias and unlawful discrimination.”<br> The memo has clearly impacted our co-workers, some of whom are hurting and feel judged based on their gender. Our co-workers shouldn’t have to worry that each time they open their mouths to speak in a meeting, they have to prove that they are not like the memo states, being “agreeable” rather than “assertive,” showing a “lower stress tolerance,” or being “neurotic.”<br> At the same time, there are co-workers who are questioning whether they can safely express their views in the workplace (especially those with a minority viewpoint). They too feel under threat, and that is also not OK. People must feel free to express dissent. So to be clear again, many points raised in the memo — such as the portions criticizing Google’s trainings, questioning the role of ideology in the workplace, and debating whether programs for women and underserved groups are sufficiently open to all — are important topics. The author had a right to express their views on those topics — we encourage an environment in which people can do this and it remains our policy to not take action against anyone for prompting these discussions.<br> The past few days have been very difficult for many at the company, and we need to find a way to debate issues on which we might disagree — while doing so in line with our Code of Conduct. I’d encourage each of you to make an effort over the coming days to reach out to those who might have different perspectives from your own. I will be doing the same.<br> I have been on work related travel in Africa and Europe the past couple of weeks and had just started my family vacation here this week. I have decided to return tomorrow as clearly there’s a lot more to discuss as a group — including how we create a more inclusive environment for all.<br> So please join me, along with members of the leadership team at a town hall on Thursday. Check your calendar soon for details.<br> — Sundar</br></br></br></br></br></br></br></br></br></p></blockquote><p>Translation: you can go ahead and fire him, because Code of Conduct, but we’ve got a problem here and we really need to figure out how to keep the whackjobs from getting completely out of hand.<br> But it’s always harder to get off the tiger without it eating you.</br></p></div>",
  "content_text": "Google’s CEO returns home early from vacation and sends a message:\nFrom: Sundar\nSubject: Our words matter\nThis has been a very difficult few days. I wanted to provide an update on the memo that was circulated over this past week.\nFirst, let me say that we strongly support the right of Googlers to express themselves, and much of what was in that memo is fair to debate, regardless of whether a vast majority of Googlers disagree with it. However, portions of the memo violate our Code of Conduct and cross the line by advancing harmful gender stereotypes in our workplace. Our job is to build great products for users that make a difference in their lives. To suggest a group of our colleagues have traits that make them less biologically suited to that work is offensive and not OK. It is contrary to our basic values and our Code of Conduct, which expects “each Googler to do their utmost to create a workplace culture that is free of harassment, intimidation, bias and unlawful discrimination.”\nThe memo has clearly impacted our co-workers, some of whom are hurting and feel judged based on their gender. Our co-workers shouldn’t have to worry that each time they open their mouths to speak in a meeting, they have to prove that they are not like the memo states, being “agreeable” rather than “assertive,” showing a “lower stress tolerance,” or being “neurotic.”\nAt the same time, there are co-workers who are questioning whether they can safely express their views in the workplace (especially those with a minority viewpoint). They too feel under threat, and that is also not OK. People must feel free to express dissent. So to be clear again, many points raised in the memo — such as the portions criticizing Google’s trainings, questioning the role of ideology in the workplace, and debating whether programs for women and underserved groups are sufficiently open to all — are important topics. The author had a right to express their views on those topics — we encourage an environment in which people can do this and it remains our policy to not take action against anyone for prompting these discussions.\nThe past few days have been very difficult for many at the company, and we need to find a way to debate issues on which we might disagree — while doing so in line with our Code of Conduct. I’d encourage each of you to make an effort over the coming days to reach out to those who might have different perspectives from your own. I will be doing the same.\nI have been on work related travel in Africa and Europe the past couple of weeks and had just started my family vacation here this week. I have decided to return tomorrow as clearly there’s a lot more to discuss as a group — including how we create a more inclusive environment for all.\nSo please join me, along with members of the leadership team at a town hall on Thursday. Check your calendar soon for details.\n— Sundar\nTranslation: you can go ahead and fire him, because Code of Conduct, but we’ve got a problem here and we really need to figure out how to keep the whackjobs from getting completely out of hand.\nBut it’s always harder to get off the tiger without it eating you.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-08T01:23:00+00:00"
}