{
  "url": "https://voxday.net/2017/08/27/bake-the-damn-cake/",
  "scraped_at": "2025-12-19T10:21:40.027290",
  "title": "Bake the damn cake",
  "date_display": "August 27, 2017",
  "date_iso": "2017-08-27T19:00:00+00:00",
  "date_from_url": "2017-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit observes that the Kennedy Ministry’s case against the SPLC <a href=\"https://pjmedia.com/instapundit/the-hidden-religious-freedom-clash/\">may have interesting implications</a> for Amazon:</p><blockquote><p>BAKE MY CAKE OR SUFFER THE PENALTIES: As Ed Driscoll reported yesterday, the D. James Kennedy Ministry is suing SPLC, GuideStar, and Amazon over “Hate” labeling. I’ve had a chance to go through the Complaint, and my view is the defamation claims may have enough merit to proceed, the Trademark claims are weak, but the most interesting thing — and what may be the most impacting aspect of this suit — is the claim under the Civil Rights Act, 42 U.S.C. 4 2000(a), which the Plaintiffs point out:<br> <i><br> </br></i><i>“Because the Amazon Defendants are operating a public accommodation(s), it is a violation of Title II of the Civil Rights Act of 1964, specifically 42 U.S.C. § 2000(a), for the Amazon Defendants to deny the Ministry the privileges and advantages of the AmazonSmile program on the basis of the Ministry’s religion and the beliefs that are inherent to that religion.”</i><br> Now here’s where it gets interesting. If the Commerce Clause gives government the authority to trump a businessman’s personal beliefs, even if couched as a First Amendment expression, then the same logic that requires Christian fundamentalists to bake “gay” wedding cakes against their beliefs ought to mean that Amazon has no right to deprive the Ministry of a public accommodation because they “don’t like” that Church’s view on gay marriage.<br> I’m betting if Amazon doesn’t settle, that this issue is headed to the Eleventh Circuit, and maybe even SCOTUS. This is right in Justice Gorsuch‘s wheelhouse. Stay tuned.</br></br></br></p></blockquote><p>It occurs to me that the Big Tech Left is handing the Right a golden opportunity for profitable lawfare. Whereas it might have been difficult before to argue that one has been materially harmed by defamation when falsely labeled a “Nazi” or a “White Supremacist”, the demonetization and deplatforming of various “Nazis” and “White Supremacists” is putting a material price tag on those labels.<br> If you’re a licensed attorney in the USA, the UK, or Australia, and you’re interested in helping out those who are being defamed in this manner, shoot me an email. It would appear to be an increasingly target-rich environment.</br></p></div>",
  "content_text": "Instapundit observes that the Kennedy Ministry’s case against the SPLC\nmay have interesting implications\nfor Amazon:\nBAKE MY CAKE OR SUFFER THE PENALTIES: As Ed Driscoll reported yesterday, the D. James Kennedy Ministry is suing SPLC, GuideStar, and Amazon over “Hate” labeling. I’ve had a chance to go through the Complaint, and my view is the defamation claims may have enough merit to proceed, the Trademark claims are weak, but the most interesting thing — and what may be the most impacting aspect of this suit — is the claim under the Civil Rights Act, 42 U.S.C. 4 2000(a), which the Plaintiffs point out:\n“Because the Amazon Defendants are operating a public accommodation(s), it is a violation of Title II of the Civil Rights Act of 1964, specifically 42 U.S.C. § 2000(a), for the Amazon Defendants to deny the Ministry the privileges and advantages of the AmazonSmile program on the basis of the Ministry’s religion and the beliefs that are inherent to that religion.”\nNow here’s where it gets interesting. If the Commerce Clause gives government the authority to trump a businessman’s personal beliefs, even if couched as a First Amendment expression, then the same logic that requires Christian fundamentalists to bake “gay” wedding cakes against their beliefs ought to mean that Amazon has no right to deprive the Ministry of a public accommodation because they “don’t like” that Church’s view on gay marriage.\nI’m betting if Amazon doesn’t settle, that this issue is headed to the Eleventh Circuit, and maybe even SCOTUS. This is right in Justice Gorsuch‘s wheelhouse. Stay tuned.\nIt occurs to me that the Big Tech Left is handing the Right a golden opportunity for profitable lawfare. Whereas it might have been difficult before to argue that one has been materially harmed by defamation when falsely labeled a “Nazi” or a “White Supremacist”, the demonetization and deplatforming of various “Nazis” and “White Supremacists” is putting a material price tag on those labels.\nIf you’re a licensed attorney in the USA, the UK, or Australia, and you’re interested in helping out those who are being defamed in this manner, shoot me an email. It would appear to be an increasingly target-rich environment.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-27T18:00:00+00:00"
}