{
  "url": "https://voxday.net/2017/08/11/beautiful-absolutely-beautiful/",
  "scraped_at": "2025-12-18T07:26:23.471835",
  "title": "Beautiful. Absolutely beautiful.",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T23:42:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The 2017 Hugo Award winners. I think we can state that the convergence of mainstream published “science fiction” is now complete. Notice anything about the winners?<br> Best Novel<br> The Obelisk Gate, by N. K. Jemisin (Orbit Books)<br> Best Novella<br> Every Heart a Doorway, by Seanan McGuire (Tor.com publishing)<br> Best Novelette<br> “The Tomato Thief”, by Ursula Vernon (Apex Magazine, January 2016)<br> Best Short Story<br> “Seasons of Glass and Iron”, by Amal El-Mohtar (The Starlit Wood: New Fairy Tales, Saga Press)<br> Best Related Work<br> Words Are My Matter: Writings About Life and Books, 2000-2016, by Ursula K. Le Guin (Small Beer)<br> Best Graphic Story<br> Monstress, Volume 1: Awakening, written by Marjorie Liu, illustrated by Sana Takeda (Image)<br> Best Dramatic Presentation (Long Form)<br> Arrival, screenplay by Eric Heisserer based on a short story by Ted Chiang, directed by Denis Villeneuve (21 Laps Entertainment/FilmNation Entertainment/Lava Bear Films)<br> Best Dramatic Presentation (Short Form)<br> The Expanse: “Leviathan Wakes”, written by Mark Fergus and Hawk Ostby, directed by Terry McDonough (SyFy)<br> Best Editor – Short Form<br> Ellen Datlow<br> Best Editor – Long Form<br> Liz Gorinsky<br> Best Professional Artist<br> Julie Dillon<br> Best Semiprozine<br> Uncanny Magazine, edited by Lynne M. Thomas &amp; Michael Damian Thomas, Michi Trota, Julia Rios, and podcast produced by Erika Ensign &amp; Steven Schapansky<br> Best Fanzine<br> Lady Business, edited by Clare, Ira, Jodie, KJ, Renay, and Susan<br> Best Fancast<br> Tea and Jeopardy, presented by Emma Newman with Peter Newman<br> Best Fan Writer<br> Abigail Nussbaum<br> Best Fan Artist<br> Elizabeth Leggett<br> Best Series<br> The Vorkosigan Saga, by Lois McMaster Bujold (Baen)<br> John W. Campbell Award for Best New Writer<br> Ada Palmer (1st year of eligibility)<br> The best part is that NK Jemisin is now the two-time Hugo Award winner for Best Novel. In succession.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "The 2017 Hugo Award winners. I think we can state that the convergence of mainstream published “science fiction” is now complete. Notice anything about the winners?\nBest Novel\nThe Obelisk Gate, by N. K. Jemisin (Orbit Books)\nBest Novella\nEvery Heart a Doorway, by Seanan McGuire (Tor.com publishing)\nBest Novelette\n“The Tomato Thief”, by Ursula Vernon (Apex Magazine, January 2016)\nBest Short Story\n“Seasons of Glass and Iron”, by Amal El-Mohtar (The Starlit Wood: New Fairy Tales, Saga Press)\nBest Related Work\nWords Are My Matter: Writings About Life and Books, 2000-2016, by Ursula K. Le Guin (Small Beer)\nBest Graphic Story\nMonstress, Volume 1: Awakening, written by Marjorie Liu, illustrated by Sana Takeda (Image)\nBest Dramatic Presentation (Long Form)\nArrival, screenplay by Eric Heisserer based on a short story by Ted Chiang, directed by Denis Villeneuve (21 Laps Entertainment/FilmNation Entertainment/Lava Bear Films)\nBest Dramatic Presentation (Short Form)\nThe Expanse: “Leviathan Wakes”, written by Mark Fergus and Hawk Ostby, directed by Terry McDonough (SyFy)\nBest Editor – Short Form\nEllen Datlow\nBest Editor – Long Form\nLiz Gorinsky\nBest Professional Artist\nJulie Dillon\nBest Semiprozine\nUncanny Magazine, edited by Lynne M. Thomas & Michael Damian Thomas, Michi Trota, Julia Rios, and podcast produced by Erika Ensign & Steven Schapansky\nBest Fanzine\nLady Business, edited by Clare, Ira, Jodie, KJ, Renay, and Susan\nBest Fancast\nTea and Jeopardy, presented by Emma Newman with Peter Newman\nBest Fan Writer\nAbigail Nussbaum\nBest Fan Artist\nElizabeth Leggett\nBest Series\nThe Vorkosigan Saga, by Lois McMaster Bujold (Baen)\nJohn W. Campbell Award for Best New Writer\nAda Palmer (1st year of eligibility)\nThe best part is that NK Jemisin is now the two-time Hugo Award winner for Best Novel. In succession.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-11T22:42:00+00:00"
}