{
  "url": "https://voxday.net/2017/08/13/ben-shapiros-twitterfesto/",
  "scraped_at": "2025-12-19T10:20:07.967475",
  "title": "Ben Shapiro’s Twitterfesto",
  "date_display": "August 13, 2017",
  "date_iso": "2017-08-13T16:31:00+00:00",
  "date_from_url": "2017-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Littlest Chickenhawk’s take on the Alt-Right. He’s concerned about the media lumping him in with us. To be fair, he’s right. He’s not one of us.</p><blockquote><p>The so-called alt-right is an evil movement having nothing to do with – and actively opposing – Constitutional conservatism. (1)<br> They’ve done an excellent job, with the media’s ignorant help, of portraying themselves as large and powerful (2)<br> And broadening their definition to include anyone who is anti-establishment or just likes memes. That’s not what they are. (3)<br> The alt-right has a very definite philosophy, articulated by people like Spencer, Taylor, and Vox Day (4)<br> And excused and popularized by people like Milo YIannopoulos. They were successful online in convincing key figures that they were (5)<br> An important constituency. Immoral politicians and advisors then made the conscious decision not to carve them off. (6)<br> Yes, that includes Trump and Bannon. (7)<br> Three elements assure their continued growth: pandering politicians and media figures catering to or ignoring them; (8)<br> Left-wingers labeling all right-wingers alt-right and therefore leading innocent people to believe that alt-right Judy means right; (9)<br> And left-wing violent groups like Antifa that drive fools into the belief that anyone who fights Antifa is necessarily an ally. (10)<br> We’re watching a tiny microcosm replay of brownshirts vs. reds in Weimar Germany. They’re even carrying the same flags. (11)<br> And leadership in media and especially the White House must actively and thunderously condemn the evil we’re watching metastasize. (END)</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>That’s all more or less true, up until point 8. We’re not dependent upon politicians and media figures catering to and ignoring us. That doesn’t even make sense. The best thing that ever happened to the Alt-Right was being actively denounced by Hillary Clinton.<br> And our continued growth is assured, not due to points 8, 9, and 10, but because Ben, and the cuckservatives, and the constitutional conservatives <i>will not lift a finger</i> to defend white Americans, or the European nations, from the globalist demographic assault of the last 52 years. To the contrary, they support that ongoing assault, with varying degrees of enthusiasm.</br></p></div>",
  "content_text": "The Littlest Chickenhawk’s take on the Alt-Right. He’s concerned about the media lumping him in with us. To be fair, he’s right. He’s not one of us.\nThe so-called alt-right is an evil movement having nothing to do with – and actively opposing – Constitutional conservatism. (1)\nThey’ve done an excellent job, with the media’s ignorant help, of portraying themselves as large and powerful (2)\nAnd broadening their definition to include anyone who is anti-establishment or just likes memes. That’s not what they are. (3)\nThe alt-right has a very definite philosophy, articulated by people like Spencer, Taylor, and Vox Day (4)\nAnd excused and popularized by people like Milo YIannopoulos. They were successful online in convincing key figures that they were (5)\nAn important constituency. Immoral politicians and advisors then made the conscious decision not to carve them off. (6)\nYes, that includes Trump and Bannon. (7)\nThree elements assure their continued growth: pandering politicians and media figures catering to or ignoring them; (8)\nLeft-wingers labeling all right-wingers alt-right and therefore leading innocent people to believe that alt-right Judy means right; (9)\nAnd left-wing violent groups like Antifa that drive fools into the belief that anyone who fights Antifa is necessarily an ally. (10)\nWe’re watching a tiny microcosm replay of brownshirts vs. reds in Weimar Germany. They’re even carrying the same flags. (11)\nAnd leadership in media and especially the White House must actively and thunderously condemn the evil we’re watching metastasize. (END)\nThat’s all more or less true, up until point 8. We’re not dependent upon politicians and media figures catering to and ignoring us. That doesn’t even make sense. The best thing that ever happened to the Alt-Right was being actively denounced by Hillary Clinton.\nAnd our continued growth is assured, not due to points 8, 9, and 10, but because Ben, and the cuckservatives, and the constitutional conservatives\nwill not lift a finger\nto defend white Americans, or the European nations, from the globalist demographic assault of the last 52 years. To the contrary, they support that ongoing assault, with varying degrees of enthusiasm.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-13T15:31:00+00:00"
}