{
  "url": "https://voxday.net/2017/08/19/better-early-than-late/",
  "scraped_at": "2025-12-19T10:20:47.984628",
  "title": "“Better early than late”",
  "date_display": "August 19, 2017",
  "date_iso": "2017-08-19T21:48:00+00:00",
  "date_from_url": "2017-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First France, <a href=\"http://www.dailymail.co.uk/news/article-4805660/Barcelona-s-chief-rabbi-urges-Jews-Israel.html\">now Spain</a>.</p><blockquote><p>Barcelona’s chief rabbi has urged Jews to move to Israel after warning that Europe has been ‘lost’ because of the threat from radical Islam…. In an interview with Jewish news agency JTA, he said: ‘I tell my congregants: Don’t think we’re here for good, and I encourage them to buy property in Israel. This place is lost. Don’t repeat the mistake of Algerian Jews, of Venezuelan Jews. Better early than late. Europe is lost.’</p></blockquote><p>That’s good advice, and it is entirely in line with what Israel’s Prime Minister recommends. And although there are those who really don’t like to hear it, it is absolutely pro-semitic advice that applies to the rest of the Diasporans around the world as well.<br> There are three things worthy of note here. First, this makes it abundantly clear that the Jews of France and Spain do not regard themselves as French nor Spanish in the end. They will not fight for their countries of residence when they have a homeland to which they can safely retreat. Which, of course, is perfectly understandable. But no such option exists for the actual French and Spanish peoples; my money is on the Spaniards, who bravely reclaimed their land and restored their nation after centuries of Islamic occupation.<br> The second thing is the observation smart people can genuinely see these things coming, sometimes more than a decade in advance. I was always impressed by the way Ludwig von Mises left Austria in 1934, several years before the Anschluss and five years before WWII actually began, simply due to his ability to read the tea leaves correctly.<br> The third thing is that Europe is <u>not</u> lost. Neither is America. Remember, nothing worth fighting for is lost until the very last man willing to fight for it surrenders or dies. The West is not simply going to lay down and die.<br> Never forget. <i>All we need is twelve.</i></br></br></br></br></p></div>",
  "content_text": "First France,\nnow Spain\n.\nBarcelona’s chief rabbi has urged Jews to move to Israel after warning that Europe has been ‘lost’ because of the threat from radical Islam…. In an interview with Jewish news agency JTA, he said: ‘I tell my congregants: Don’t think we’re here for good, and I encourage them to buy property in Israel. This place is lost. Don’t repeat the mistake of Algerian Jews, of Venezuelan Jews. Better early than late. Europe is lost.’\nThat’s good advice, and it is entirely in line with what Israel’s Prime Minister recommends. And although there are those who really don’t like to hear it, it is absolutely pro-semitic advice that applies to the rest of the Diasporans around the world as well.\nThere are three things worthy of note here. First, this makes it abundantly clear that the Jews of France and Spain do not regard themselves as French nor Spanish in the end. They will not fight for their countries of residence when they have a homeland to which they can safely retreat. Which, of course, is perfectly understandable. But no such option exists for the actual French and Spanish peoples; my money is on the Spaniards, who bravely reclaimed their land and restored their nation after centuries of Islamic occupation.\nThe second thing is the observation smart people can genuinely see these things coming, sometimes more than a decade in advance. I was always impressed by the way Ludwig von Mises left Austria in 1934, several years before the Anschluss and five years before WWII actually began, simply due to his ability to read the tea leaves correctly.\nThe third thing is that Europe is\nnot\nlost. Neither is America. Remember, nothing worth fighting for is lost until the very last man willing to fight for it surrenders or dies. The West is not simply going to lay down and die.\nNever forget.\nAll we need is twelve.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-19T20:48:00+00:00"
}