{
  "url": "https://voxday.net/2017/08/30/boycottcampingworld/",
  "scraped_at": "2025-12-19T10:21:56.766030",
  "title": "#BoycottCampingWorld",
  "date_display": "August 30, 2017",
  "date_iso": "2017-08-30T10:45:00+00:00",
  "date_from_url": "2017-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Fake American businessman, the CEO of Camping World, <a href=\"https://www.cnbc.com/2017/08/16/marcus-lemonis-if-youre-ok-with-what-trump-said-dont-shop-at-my-business.html\">does not want Trump-supporting customers</a>:</p><blockquote><p><b>Marcus Lemonis: If you’re OK with what Trump said, don’t shop at my business</b><br> “There’s no doubt that there is probably not many consumers in this country today that are in favor of what has been said in the last couple days and if they are, quite frankly, don’t shop at my business,” said Lemonis, who is CEO of Camping World and host of CNBC’s “The Profit.”<br> In a chaotic Tuesday news conference, Trump appeared to equate torch-bearing white nationalists with the protesters who demonstrated against them. Trump’s statements led to a wave of CEO resignations from his advisory councils and on Wednesday, Trump abruptly dissolved the councils. Trump’s announcement came shortly after a member of the Strategic and Policy Forum told CNBC the group had decided to disband.<br> Lemonis told “Power Lunch” he is “horrified” by what he’s been hearing and seeing from this administration.<br> He said it’s important that CEOs speak for themselves as individuals on policy and also speak for their companies as it relates to policy that affects their businesses. However, they should be very careful, he said. “I’m concerned about certain CEOs dancing on the fence, fearing retaliation or fearing something. It’s scary right now,” Lemonis said.</br></br></br></br></p></blockquote><p>Now that #BoycottCampingWorld is trending, the Fake American born in Lebanon quickly retreated and apologized, <a href=\"https://www.cnbc.com/2017/08/25/camping-world-ceo-lemonis-apologizes-for-charlottesville-remarks.html\">only not really</a>. It’s a pathetic piece of groveling pity theatre in which Lemonis attempts to simultaneously mitigate the damage to his company while continuing to virtue-signal. If the Camping World board has any sense of self-preservation at all, it will demand his resignation before the end of the week.</p><blockquote><p>When I came to this country as an infant I had no idea what would be in store for me. A place where most get a chance to succeed. With a loving family and a ton of luck I was given my shot. Now the road wasn’t as easy as some think. I wasn’t born with a silver spoon in my mouth but I was more fortunate than others in the sense of having two great parents, a roof, always food and clothing and provided a good education. During those years I had my own internal struggle like most do. Struggles that are kept secret in some cases and others than are out for all to see. As a kid, I was bullied. Now that doesn’t make me special or require any special privilege but it does stick with you. As I grew up I knew I needed to be someone and do something. It was the only way I could prove to myself and others that I was worth more than they thought of me but quite frankly needed for my own mental health. I am much more insecure than people know. I get depressed, sad, scared etc. but who cares we all do.<br> Over the last 15 years I have been blessed to be part of building a business with people that believed in me. Something new for me. I was given a chance to build something that I could leave as a lasting legacy. Even though I started experiencing success, I never quite felt fulfilled. It’s not about the money. I felt like I needed to do more, to contribute more. Thru those years I made mistakes. A lot of them. Struggled with personal relationships, mistreated friends, etc. I suppose that’s human but I couldn’t understand why. The last five years I spent my time working on my business but also dedicated my life to small business. It was a way for me to help the underdog. I never did it for the money or the attention but rather to fill a void. I felt like I had to do it to payback a place that gave me a break. I made plenty of mistakes during this process as well. Trusted people who I shouldn’t have, made deals I shouldn’t have and sometimes did it for the wrong reason. But who cares, we all make mistakes.<br> Over the last year I have, or at least I thought had, really grown. It’s funny but in my mind, I had grown up. I felt like I needed to consider how serious things got around here. Everything became intense and confrontational. Skin started to thicken, tensions started to rise and heels dug in. I suppose it’s more of a protective measure for me and probably others as well. Now in this moment no one person was to blame for this. I started having sensory overload. I’m sure over the last year I felt the need to be more careful, be less trusting and I maybe didn’t even know it was happening. You watch tv and everyone is arguing. Yes, everyone. You drive in your car and everyone is aggressive. And mistakes are made. As a child being bullied didn’t make me different or special it made me more sensitive, more forgiving, more focused and helping.<br> As I continued over the last several months to read, listen and observe I noticed that my conviction was weakening. I felt like I needed to just accept the way things are and move on. Which felt like a mistake. If you have noticed I have said mistake a bunch of times and I’m sure there are typos and grammar mistakes all over this free form written document. Sometimes those mistakes come out of my mouth. The mistake I made in the last week was not being clear. Do I wish that there was more speed of clarity and conviction around the violence? Yes Do I think that hate and violence has taken over everywhere? Yes<br> Do I think one person is to blame? No Do I think that there are two sides to every story? Yes While I stand strong on my position that violence, hate, bigotry is unacceptable from anyone regardless of what side you are on and that all of us need to be accountable, only I am accountable for my actions.<br> Last week I gave my opinion on what had happened. I made the mistake of letting my fear and emotion talk about subjects that I shouldn’t have. As the CEO of a business, I am responsible to take care of the people that work there. I opened my mouth and put them in harm’s way. While I know, that the headline published was taken out of context and I have to live with that.  There should have never been a headline and I gave a chance to live.<br> My apology is sincere. It is to my employees who have been forced to deal with this. I am nothing without you. I am here to serve, guide and protect you. I will work harder. Please forgive me. Please don’t punish them. I apologize to anyone who has supported their cause, their political preference, their candidate, their beliefs. I was Not raised this way and have always been taught to respect everyone. This is a free county and my fears shouldn’t be projected on anyone. I am asking for your forgiveness. I should have not disrespected that and will not again. I apologize to the people who have followed my show for years and have said they have learned so much and are inspired, who now say that have been let down and will never trust me again.<br> I DO NOT apologize to anyone who is in favor or hate, violence, bigotry or racism. And I will do my part to help eliminate it from both sides. One way I do that is by being an example. You are the reason I made this mistake. You took my common sense away and purpose. I will not let you beat me or beat me down. I am a man of conviction. Most of the time it’s what people like about me. In this case it’s quite the opposite. I have not written this because I worry about what it means to me financially, because that’s normally the response I hear when I say I’m sorry. I have written this because I know what has been my purpose up to now, which is to help people and I want to be able to continue that. People make mistakes. Obviously, this past week I’m the poster child.</br></br></br></br></br></br></br></p></blockquote><p>They will complain, of course, that we are taking their words out of context. That’s really too bad. But the principle of fair play dictates that both sides are allowed to play by the same rules.</p><div style=\"clear: both; text-align: center;\"><a href=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DIeAm4NVoAUJitI.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"400\" data-original-width=\"400\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DIeAm4NVoAUJitI.jpg\" width=\"400\"/></a></div></div>",
  "content_text": "A Fake American businessman, the CEO of Camping World,\ndoes not want Trump-supporting customers\n:\nMarcus Lemonis: If you’re OK with what Trump said, don’t shop at my business\n“There’s no doubt that there is probably not many consumers in this country today that are in favor of what has been said in the last couple days and if they are, quite frankly, don’t shop at my business,” said Lemonis, who is CEO of Camping World and host of CNBC’s “The Profit.”\nIn a chaotic Tuesday news conference, Trump appeared to equate torch-bearing white nationalists with the protesters who demonstrated against them. Trump’s statements led to a wave of CEO resignations from his advisory councils and on Wednesday, Trump abruptly dissolved the councils. Trump’s announcement came shortly after a member of the Strategic and Policy Forum told CNBC the group had decided to disband.\nLemonis told “Power Lunch” he is “horrified” by what he’s been hearing and seeing from this administration.\nHe said it’s important that CEOs speak for themselves as individuals on policy and also speak for their companies as it relates to policy that affects their businesses. However, they should be very careful, he said. “I’m concerned about certain CEOs dancing on the fence, fearing retaliation or fearing something. It’s scary right now,” Lemonis said.\nNow that #BoycottCampingWorld is trending, the Fake American born in Lebanon quickly retreated and apologized,\nonly not really\n. It’s a pathetic piece of groveling pity theatre in which Lemonis attempts to simultaneously mitigate the damage to his company while continuing to virtue-signal. If the Camping World board has any sense of self-preservation at all, it will demand his resignation before the end of the week.\nWhen I came to this country as an infant I had no idea what would be in store for me. A place where most get a chance to succeed. With a loving family and a ton of luck I was given my shot. Now the road wasn’t as easy as some think. I wasn’t born with a silver spoon in my mouth but I was more fortunate than others in the sense of having two great parents, a roof, always food and clothing and provided a good education. During those years I had my own internal struggle like most do. Struggles that are kept secret in some cases and others than are out for all to see. As a kid, I was bullied. Now that doesn’t make me special or require any special privilege but it does stick with you. As I grew up I knew I needed to be someone and do something. It was the only way I could prove to myself and others that I was worth more than they thought of me but quite frankly needed for my own mental health. I am much more insecure than people know. I get depressed, sad, scared etc. but who cares we all do.\nOver the last 15 years I have been blessed to be part of building a business with people that believed in me. Something new for me. I was given a chance to build something that I could leave as a lasting legacy. Even though I started experiencing success, I never quite felt fulfilled. It’s not about the money. I felt like I needed to do more, to contribute more. Thru those years I made mistakes. A lot of them. Struggled with personal relationships, mistreated friends, etc. I suppose that’s human but I couldn’t understand why. The last five years I spent my time working on my business but also dedicated my life to small business. It was a way for me to help the underdog. I never did it for the money or the attention but rather to fill a void. I felt like I had to do it to payback a place that gave me a break. I made plenty of mistakes during this process as well. Trusted people who I shouldn’t have, made deals I shouldn’t have and sometimes did it for the wrong reason. But who cares, we all make mistakes.\nOver the last year I have, or at least I thought had, really grown. It’s funny but in my mind, I had grown up. I felt like I needed to consider how serious things got around here. Everything became intense and confrontational. Skin started to thicken, tensions started to rise and heels dug in. I suppose it’s more of a protective measure for me and probably others as well. Now in this moment no one person was to blame for this. I started having sensory overload. I’m sure over the last year I felt the need to be more careful, be less trusting and I maybe didn’t even know it was happening. You watch tv and everyone is arguing. Yes, everyone. You drive in your car and everyone is aggressive. And mistakes are made. As a child being bullied didn’t make me different or special it made me more sensitive, more forgiving, more focused and helping.\nAs I continued over the last several months to read, listen and observe I noticed that my conviction was weakening. I felt like I needed to just accept the way things are and move on. Which felt like a mistake. If you have noticed I have said mistake a bunch of times and I’m sure there are typos and grammar mistakes all over this free form written document. Sometimes those mistakes come out of my mouth. The mistake I made in the last week was not being clear. Do I wish that there was more speed of clarity and conviction around the violence? Yes Do I think that hate and violence has taken over everywhere? Yes\nDo I think one person is to blame? No Do I think that there are two sides to every story? Yes While I stand strong on my position that violence, hate, bigotry is unacceptable from anyone regardless of what side you are on and that all of us need to be accountable, only I am accountable for my actions.\nLast week I gave my opinion on what had happened. I made the mistake of letting my fear and emotion talk about subjects that I shouldn’t have. As the CEO of a business, I am responsible to take care of the people that work there. I opened my mouth and put them in harm’s way. While I know, that the headline published was taken out of context and I have to live with that.  There should have never been a headline and I gave a chance to live.\nMy apology is sincere. It is to my employees who have been forced to deal with this. I am nothing without you. I am here to serve, guide and protect you. I will work harder. Please forgive me. Please don’t punish them. I apologize to anyone who has supported their cause, their political preference, their candidate, their beliefs. I was Not raised this way and have always been taught to respect everyone. This is a free county and my fears shouldn’t be projected on anyone. I am asking for your forgiveness. I should have not disrespected that and will not again. I apologize to the people who have followed my show for years and have said they have learned so much and are inspired, who now say that have been let down and will never trust me again.\nI DO NOT apologize to anyone who is in favor or hate, violence, bigotry or racism. And I will do my part to help eliminate it from both sides. One way I do that is by being an example. You are the reason I made this mistake. You took my common sense away and purpose. I will not let you beat me or beat me down. I am a man of conviction. Most of the time it’s what people like about me. In this case it’s quite the opposite. I have not written this because I worry about what it means to me financially, because that’s normally the response I hear when I say I’m sorry. I have written this because I know what has been my purpose up to now, which is to help people and I want to be able to continue that. People make mistakes. Obviously, this past week I’m the poster child.\nThey will complain, of course, that we are taking their words out of context. That’s really too bad. But the principle of fair play dictates that both sides are allowed to play by the same rules.",
  "tags": [
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-30T09:45:00+00:00"
}