{
  "url": "https://voxday.net/2017/08/08/breitbart-is-on-it/",
  "scraped_at": "2025-12-18T07:25:50.989727",
  "title": "Breitbart is on it.",
  "date_display": "August 8, 2017",
  "date_iso": "2017-08-08T13:06:00+00:00",
  "date_from_url": "2017-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yeah, this diversity debacle doesn’t promise to die down <a href=\"http://www.breitbart.com/tech/2017/08/07/revealed-inside-googles-sjw-cabal-blacklists/\">anytime soon</a>:</p><blockquote><p>Numerous individuals alleged to be members of Google’s management team have been caught bragging about forming blacklists to impact the careers of colleagues with different political beliefs.<br> In a series of screenshots from 2015 onwards provided to Breitbart News by a verified Google employee, individuals described as left-wing Google management employees can be seen discussing the ways they punish their colleagues both inside and out of the company.<br> “While Google appears to be doing very little to quell the hostile voices that exists inside the company, I want those hostile voices to know: I will never, ever hire hire/transfer you onto my team. Ever. I don’t care if you are perfect fit of technically excellent or whatever,” declared former employee Adam Fletcher in a post on Google’s internal, staff-only Google+ network: “Internal Plus.” “I will actively not work with you, even to the point where your team or product is impacted by this decision. I’ll communicate why to your manager if it comes up.”<br> “You’re being blacklisted by people at companies outside of Google,” he continued. “You might not have been aware of this, but people know, people talk. There are always social consequences.”</br></br></br></p></blockquote><p>Nothing new to readers here, but Breitbart has considerably more reach than I do. However, Allum Bokhari’s interview with a rebel Googler, “Hal”, is illuminating:</p><blockquote><p>Hal: Witch hunts are a well-known cultural problem at Google. The company is currently facing a Federal complaint filed by the National Labor Relations Board in April for interfering with employees’ legal right to discuss “workplace diversity and social justice initiatives.” The complaint alleges that Senior Vice President Urs Holzle and numerous managers in his organization actively stoked up witch hunts in 2015 and 2016 intended to muzzle low-level employees who raised concerns about the company’s practices. The trial is set for November.<br> Several managers have openly admitted to keeping blacklists of the employees in question, and preventing them from seeking work at other companies. There have been numerous cases in which social justice activists coordinated attempts to sabotage other employees’ performance reviews for expressing a different opinion. These have been raised to the Senior VP level, with no action taken whatsoever.<br> Allum Bokhari: What’s it like to work in such an environment? Do you think it damages employee output?<br> Hal: A lot of social justice activists essentially spend all day fighting the culture war, and get nothing done. The company has made it a point to hire more people like this. The diversity gospel has been woven into nearly everything the company does, to the point where senior leaders focus on diversity first and technology second. The companywide “Google Insider” emails used to talk about cool new tech, but now they’re entirely about social justice initiatives. Likewise, the weekly all-hands “TGIF” meetings used to focus on tech, but now they’re split about 50/50 between tech and identity politics signaling.<br> For conservative employees, this is obviously demoralizing, but it is also dangerous. Several have been driven out of the company or fired outright for sharing a dissenting view. Others have had their promotions denied or suffered other forms of deniable retaliation. Most of us just keep our heads down because we can’t afford to lose our jobs.</br></br></br></br></p></blockquote></div>",
  "content_text": "Yeah, this diversity debacle doesn’t promise to die down\nanytime soon\n:\nNumerous individuals alleged to be members of Google’s management team have been caught bragging about forming blacklists to impact the careers of colleagues with different political beliefs.\nIn a series of screenshots from 2015 onwards provided to Breitbart News by a verified Google employee, individuals described as left-wing Google management employees can be seen discussing the ways they punish their colleagues both inside and out of the company.\n“While Google appears to be doing very little to quell the hostile voices that exists inside the company, I want those hostile voices to know: I will never, ever hire hire/transfer you onto my team. Ever. I don’t care if you are perfect fit of technically excellent or whatever,” declared former employee Adam Fletcher in a post on Google’s internal, staff-only Google+ network: “Internal Plus.” “I will actively not work with you, even to the point where your team or product is impacted by this decision. I’ll communicate why to your manager if it comes up.”\n“You’re being blacklisted by people at companies outside of Google,” he continued. “You might not have been aware of this, but people know, people talk. There are always social consequences.”\nNothing new to readers here, but Breitbart has considerably more reach than I do. However, Allum Bokhari’s interview with a rebel Googler, “Hal”, is illuminating:\nHal: Witch hunts are a well-known cultural problem at Google. The company is currently facing a Federal complaint filed by the National Labor Relations Board in April for interfering with employees’ legal right to discuss “workplace diversity and social justice initiatives.” The complaint alleges that Senior Vice President Urs Holzle and numerous managers in his organization actively stoked up witch hunts in 2015 and 2016 intended to muzzle low-level employees who raised concerns about the company’s practices. The trial is set for November.\nSeveral managers have openly admitted to keeping blacklists of the employees in question, and preventing them from seeking work at other companies. There have been numerous cases in which social justice activists coordinated attempts to sabotage other employees’ performance reviews for expressing a different opinion. These have been raised to the Senior VP level, with no action taken whatsoever.\nAllum Bokhari: What’s it like to work in such an environment? Do you think it damages employee output?\nHal: A lot of social justice activists essentially spend all day fighting the culture war, and get nothing done. The company has made it a point to hire more people like this. The diversity gospel has been woven into nearly everything the company does, to the point where senior leaders focus on diversity first and technology second. The companywide “Google Insider” emails used to talk about cool new tech, but now they’re entirely about social justice initiatives. Likewise, the weekly all-hands “TGIF” meetings used to focus on tech, but now they’re split about 50/50 between tech and identity politics signaling.\nFor conservative employees, this is obviously demoralizing, but it is also dangerous. Several have been driven out of the company or fired outright for sharing a dissenting view. Others have had their promotions denied or suffered other forms of deniable retaliation. Most of us just keep our heads down because we can’t afford to lose our jobs.",
  "tags": [
    "corpocracy",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-08T12:06:00+00:00"
}