{
  "url": "https://voxday.net/2017/08/31/change-or-fall-behind/",
  "scraped_at": "2025-12-19T10:22:02.695641",
  "title": "Change or fall behind",
  "date_display": "August 31, 2017",
  "date_iso": "2017-08-31T10:09:00+00:00",
  "date_from_url": "2017-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Snidely Whiplash fails to understand why he’s not employed. Crew, who is not only of the Silicon Valley hiring class, but is the #2 Techstar and a member of the Infogalactic Star Council, is unable to set him straight.</p><blockquote><p>Bob: The companies who try to move don’t succeed. They can’t convince their employees to move with them, and they can’t find the people they need in other locations.</p><p>Crew: I think this is not true. What you have in Silicon Valley is enormous numbers of H1Bs, some of whom have been laid off in the latest layoff rounds but they vary greatly in quality and putting together a good team can be very difficult.</p><p>Crew: Certainly, where I am we need people but we cannot find them and we are in the heart of Silicon Valley, so we do without and things just take longer to do. And the real problem is finding people who know how to balance short-term business needs (implementing what the customer wants to get their business) with longer-term company needs (doing it in a way that is supportable over the long term and doesn’t paint you into a corner.)</p><p>Crew: Despite that I still find time to work on Infogalactic and a couple of open source software projects. The reality is that people don’t go for those who have been laid off in most cases. Personally, I would prefer to employ Americans … but Silicon Valley has driven many of them out …</p><p>Snidely: And with pathetic attitudes like that, you’re helping to drive them out.</p><p>Jack: You still looking Snidely?</p><p>Snidely Whiplash: Sadly, yes, Jack. White, laid off, and over 50. Crew up there won’t hire me, no matter my skills or experience, because he’s an idiot.</p></blockquote><p>I suggest that Snidely’s difficulty has less to do with his skills, his experience, or Crew’s purported idiocy than his personality. I’m not at all surprised to hear that he’s unemployed. He complains that Crew wouldn’t hire him, but I wouldn’t be inclined to hire him either. It’s one thing to not play particularly well with others, it’s another thing altogether to pride yourself on your complete inability to do so; even his self-selected moniker is an indication of misplaced pride. It’s not an accident that someone who elects to call himself “snide” reliably goes out of his way to say unnecessarily negative things about almost everything and everyone.</p><p>Snidely, <i>that’s</i> your main challenge. Not anti-American discrimination in tech. The moment I hear that negative, superior tone in a man’s voice, I immediately cross him off the list, whether he’s a programmer, an artist, or a writer. Sure, he may be directing it at something we mutually despise now, but I know perfectly well he’s going to be directing it at a co-worker, at the project, or at me before long. My experience has taught that such individuals never prove to be worth their downside, no matter how talented they are.</p><p>I’ll give you an example of that negative communication style right in that same thread.</p><p>This is how a normal person expresses his opinion:<i> “Hey, it would be great if you would release audio-only versions of the videos. I would prefer to listen to those.”</i><br><i><br/></i>That is a helpful, positive way to express an opinion. It’s a good idea too. Why not be sure to release the videos in podcast form or make them otherwise available for audio download? I expect we will do just that.</br></p><p>Now, this is how Snidely communicated the same idea: <i>“One thing I would encourage, as it’s probably a make-or-break for me, is to have just the audio portion. Frankly, you’re not that attractive, and both my money and my bandwidth are limited.”</i></p><p>Same idea, different delivery, and it inspires an entirely different reaction: <i>What the Hell? Fuck that guy! </i>One has to read it twice to even register what the relevant opinion is, so distracting is the negativity.</p><p>There are three problems in just two sentences. First, the tone is heavily negative (make-or-break, frankly, not that attractive, limited). Second, he twice tries to make the entire subject about him when it isn’t. Third, he insults my appearance, and even worse, he does it without any need to do so in order to make his case. It’s just egregious. Now, I could not care less what some 50-something man happens to think about my appearance, but that sort of comment is not going to go over at all well with the average individual who is vain enough to be making videos.</p><p>So, Snidely, why would you EVER say anything like that? You didn’t need to justify your preference for audio over video, because I was openly asking for everyone’s opinions. And why are you whining and complaining about who Crew hires or doesn’t hire? You not only haven’t given him any reason to consider hiring you other than empty public posturing, you’ve given him excellent cause to not even accept you as a volunteer for any of the high-profile projects he manages. That’s not intelligent. That’s self-sabotage.</p><p>Now, I understand that this is a very challenging labor environment. It’s stressful for everyone. Even those with seemingly secure jobs know that they could lose them at any time due to an untimely comment overheard by the wrong person, a corporate acquisition, or a corporate move. One friend of mine, long self-employed, was convinced by his wife to take a great job offer at one of the strongest, most successful Fortune 50 technology companies in the world, in the interest of stability. He was even assigned to a mission-critical project. I would have sworn he had some of the best job security on the planet.</p><p>Nine months later, the CEO announced that the corporation was shutting down all its activities in my friend’s state. Since my friend was mission-critical, he was given the opportunity to uproot his family and move across the country to a place they knew no one. He wisely declined. So much for stability and job security.</p><p>The point is that in this environment, you have to continually up your game. And whether your weakness is on the skills side, the experience side, or the personality side, you have to shore it up. As I mentioned in last night’s Darkstream, video was never my medium. It still isn’t my preferred one, but I have upped my video game, and I am going to continue to increase it because that is what I have to do if I am going to be at all relevant to the 90 percent of the population that is post-literate.</p><p>The times always change. We can either change with them or we can fall behind.</p></div>",
  "content_text": "Snidely Whiplash fails to understand why he’s not employed. Crew, who is not only of the Silicon Valley hiring class, but is the #2 Techstar and a member of the Infogalactic Star Council, is unable to set him straight.\nBob: The companies who try to move don’t succeed. They can’t convince their employees to move with them, and they can’t find the people they need in other locations.\nCrew: I think this is not true. What you have in Silicon Valley is enormous numbers of H1Bs, some of whom have been laid off in the latest layoff rounds but they vary greatly in quality and putting together a good team can be very difficult.\nCrew: Certainly, where I am we need people but we cannot find them and we are in the heart of Silicon Valley, so we do without and things just take longer to do. And the real problem is finding people who know how to balance short-term business needs (implementing what the customer wants to get their business) with longer-term company needs (doing it in a way that is supportable over the long term and doesn’t paint you into a corner.)\nCrew: Despite that I still find time to work on Infogalactic and a couple of open source software projects. The reality is that people don’t go for those who have been laid off in most cases. Personally, I would prefer to employ Americans … but Silicon Valley has driven many of them out …\nSnidely: And with pathetic attitudes like that, you’re helping to drive them out.\nJack: You still looking Snidely?\nSnidely Whiplash: Sadly, yes, Jack. White, laid off, and over 50. Crew up there won’t hire me, no matter my skills or experience, because he’s an idiot.\nI suggest that Snidely’s difficulty has less to do with his skills, his experience, or Crew’s purported idiocy than his personality. I’m not at all surprised to hear that he’s unemployed. He complains that Crew wouldn’t hire him, but I wouldn’t be inclined to hire him either. It’s one thing to not play particularly well with others, it’s another thing altogether to pride yourself on your complete inability to do so; even his self-selected moniker is an indication of misplaced pride. It’s not an accident that someone who elects to call himself “snide” reliably goes out of his way to say unnecessarily negative things about almost everything and everyone.\nSnidely,\nthat’s\nyour main challenge. Not anti-American discrimination in tech. The moment I hear that negative, superior tone in a man’s voice, I immediately cross him off the list, whether he’s a programmer, an artist, or a writer. Sure, he may be directing it at something we mutually despise now, but I know perfectly well he’s going to be directing it at a co-worker, at the project, or at me before long. My experience has taught that such individuals never prove to be worth their downside, no matter how talented they are.\nI’ll give you an example of that negative communication style right in that same thread.\nThis is how a normal person expresses his opinion:\n“Hey, it would be great if you would release audio-only versions of the videos. I would prefer to listen to those.”\nThat is a helpful, positive way to express an opinion. It’s a good idea too. Why not be sure to release the videos in podcast form or make them otherwise available for audio download? I expect we will do just that.\nNow, this is how Snidely communicated the same idea:\n“One thing I would encourage, as it’s probably a make-or-break for me, is to have just the audio portion. Frankly, you’re not that attractive, and both my money and my bandwidth are limited.”\nSame idea, different delivery, and it inspires an entirely different reaction:\nWhat the Hell? Fuck that guy!\nOne has to read it twice to even register what the relevant opinion is, so distracting is the negativity.\nThere are three problems in just two sentences. First, the tone is heavily negative (make-or-break, frankly, not that attractive, limited). Second, he twice tries to make the entire subject about him when it isn’t. Third, he insults my appearance, and even worse, he does it without any need to do so in order to make his case. It’s just egregious. Now, I could not care less what some 50-something man happens to think about my appearance, but that sort of comment is not going to go over at all well with the average individual who is vain enough to be making videos.\nSo, Snidely, why would you EVER say anything like that? You didn’t need to justify your preference for audio over video, because I was openly asking for everyone’s opinions. And why are you whining and complaining about who Crew hires or doesn’t hire? You not only haven’t given him any reason to consider hiring you other than empty public posturing, you’ve given him excellent cause to not even accept you as a volunteer for any of the high-profile projects he manages. That’s not intelligent. That’s self-sabotage.\nNow, I understand that this is a very challenging labor environment. It’s stressful for everyone. Even those with seemingly secure jobs know that they could lose them at any time due to an untimely comment overheard by the wrong person, a corporate acquisition, or a corporate move. One friend of mine, long self-employed, was convinced by his wife to take a great job offer at one of the strongest, most successful Fortune 50 technology companies in the world, in the interest of stability. He was even assigned to a mission-critical project. I would have sworn he had some of the best job security on the planet.\nNine months later, the CEO announced that the corporation was shutting down all its activities in my friend’s state. Since my friend was mission-critical, he was given the opportunity to uproot his family and move across the country to a place they knew no one. He wisely declined. So much for stability and job security.\nThe point is that in this environment, you have to continually up your game. And whether your weakness is on the skills side, the experience side, or the personality side, you have to shore it up. As I mentioned in last night’s Darkstream, video was never my medium. It still isn’t my preferred one, but I have upped my video game, and I am going to continue to increase it because that is what I have to do if I am going to be at all relevant to the 90 percent of the population that is post-literate.\nThe times always change. We can either change with them or we can fall behind.",
  "tags": [
    "Ilkotism",
    "philosophy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-31T09:09:00+00:00"
}