{
  "url": "https://voxday.net/2017/08/16/choose-your-enemies-wisely/",
  "scraped_at": "2025-12-19T10:20:25.387127",
  "title": "Choose your enemies wisely",
  "date_display": "August 16, 2017",
  "date_iso": "2017-08-16T15:28:00+00:00",
  "date_from_url": "2017-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If I were Jeff Bezos, I would <a href=\"https://www.independent.co.uk/news/business/news/donald-trump-amazon-value-5-billion-drop-off-shares-tweet-social-media-jeff-bezos-a7896266.html\">consider this a fair warning</a> and hasten to the White House to determine what the God-Emperor requires:</p><blockquote><p>Donald Trump wiped around $5.7bn dollars off the stock market valuation of Amazon in less than two hours on Wednesday, with a tweet attacking the online retail giant for “doing great damage to tax paying retailers”.<br> Amazon’s shares lost 1.2 per cent of their value in pre-market trading after Mr Trump’s comments.<br> The President tweeted: “Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the US are being hurt – many jobs being lost!”<br> Donald J. Trump ✔ @realDonaldTrump<br> <i>Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the U.S. are being hurt – many jobs being lost!</i></br></br></br></br></p></blockquote><p>Now, Amazon has been absolutely great to us. We have not had a single problem with them outside of the one time an SJW employee abused the power of his position, and they handled the situation beautifully. No complaints at all.<br> But given how Google, Twitter, and PayPal have been behaving, it is important that Amazon not follow their lead into an SJW-converged death spiral.</br></p></div>",
  "content_text": "If I were Jeff Bezos, I would\nconsider this a fair warning\nand hasten to the White House to determine what the God-Emperor requires:\nDonald Trump wiped around $5.7bn dollars off the stock market valuation of Amazon in less than two hours on Wednesday, with a tweet attacking the online retail giant for “doing great damage to tax paying retailers”.\nAmazon’s shares lost 1.2 per cent of their value in pre-market trading after Mr Trump’s comments.\nThe President tweeted: “Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the US are being hurt – many jobs being lost!”\nDonald J. Trump ✔ @realDonaldTrump\nAmazon is doing great damage to tax paying retailers. Towns, cities and states throughout the U.S. are being hurt – many jobs being lost!\nNow, Amazon has been absolutely great to us. We have not had a single problem with them outside of the one time an SJW employee abused the power of his position, and they handled the situation beautifully. No complaints at all.\nBut given how Google, Twitter, and PayPal have been behaving, it is important that Amazon not follow their lead into an SJW-converged death spiral.",
  "tags": [
    "corpocracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-16T14:28:00+00:00"
}