{
  "url": "https://voxday.net/2017/08/18/civil-war-2-0/",
  "scraped_at": "2025-12-19T10:20:35.824575",
  "title": "Civil War 2.0",
  "date_display": "August 18, 2017",
  "date_iso": "2017-08-18T10:13:00+00:00",
  "date_from_url": "2017-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whose side are you on, <a href=\"http://www.wnd.com/2017/08/americas-2nd-civil-war-2/\">asks Pat Buchanan</a>:</p><blockquote><p>First in his class at West Point, hero of the Mexican War, Lee was the man to whom President Lincoln turned to lead his army. But when Virginia seceded, Lee would not lift up his sword against his own people and chose to defend his home state rather than wage war upon her.<br> This veneration of Lee, wrote Richard Weaver, “appears in the saying attributed to a Confederate soldier, ‘The rest of us may have … descended from monkeys, but it took a God to make Marse Robert.’”<br> Growing up after World War II, this was accepted history.<br> Yet, on the militant left today, the name Lee evokes raw hatred and howls of “racist and traitor.” A clamor has arisen to have all statues of him and all Confederate soldiers and statesmen pulled down from their pedestals and put in museums or tossed onto trash piles.<br> What has changed since 1965?<br> It is not history. There have been no great new discoveries about Lee.<br> What has changed is America herself. She is not the same country. We have passed through a great social, cultural and moral revolution that has left us irretrievably divided on separate shores.<br> And the politicians are in panic….<br> While easy for Republicans to wash their hands of such odious elements as Nazis in Charlottesville, will they take up the defense of the monuments and statues that have defined our history, or capitulate to the icon-smashers?<br> In this Second American Civil War, whose side are you on?</br></br></br></br></br></br></br></br></br></p></blockquote><p>This is why the Fake News is so desperate to draw a mythical line between Nazi vs Not-Nazi, rather than Nationalist Right vs Globalist Left, as the situation actually requires, because they know they fall on the weaker side that is actively opposed to American heritage and history and tradition.<br> And it is also why they are desperate to hide the obvious link between the coming civil war and post-1965 immigration. History clearly shows that there are only two ways to stop this war. One is to proactively break up the United States and implement population transfers, the other is to restore the pre-1965 population demographics through mass repatriations.<br> Neither solution is likely. Man seldom takes the opportunity to avoid war. That’s why he is doomed to fight them. The citizens of the USA are not exceptional in this regard.</br></br></p></div>",
  "content_text": "Whose side are you on,\nasks Pat Buchanan\n:\nFirst in his class at West Point, hero of the Mexican War, Lee was the man to whom President Lincoln turned to lead his army. But when Virginia seceded, Lee would not lift up his sword against his own people and chose to defend his home state rather than wage war upon her.\nThis veneration of Lee, wrote Richard Weaver, “appears in the saying attributed to a Confederate soldier, ‘The rest of us may have … descended from monkeys, but it took a God to make Marse Robert.’”\nGrowing up after World War II, this was accepted history.\nYet, on the militant left today, the name Lee evokes raw hatred and howls of “racist and traitor.” A clamor has arisen to have all statues of him and all Confederate soldiers and statesmen pulled down from their pedestals and put in museums or tossed onto trash piles.\nWhat has changed since 1965?\nIt is not history. There have been no great new discoveries about Lee.\nWhat has changed is America herself. She is not the same country. We have passed through a great social, cultural and moral revolution that has left us irretrievably divided on separate shores.\nAnd the politicians are in panic….\nWhile easy for Republicans to wash their hands of such odious elements as Nazis in Charlottesville, will they take up the defense of the monuments and statues that have defined our history, or capitulate to the icon-smashers?\nIn this Second American Civil War, whose side are you on?\nThis is why the Fake News is so desperate to draw a mythical line between Nazi vs Not-Nazi, rather than Nationalist Right vs Globalist Left, as the situation actually requires, because they know they fall on the weaker side that is actively opposed to American heritage and history and tradition.\nAnd it is also why they are desperate to hide the obvious link between the coming civil war and post-1965 immigration. History clearly shows that there are only two ways to stop this war. One is to proactively break up the United States and implement population transfers, the other is to restore the pre-1965 population demographics through mass repatriations.\nNeither solution is likely. Man seldom takes the opportunity to avoid war. That’s why he is doomed to fight them. The citizens of the USA are not exceptional in this regard.",
  "tags": [
    "decline and fall",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-18T09:13:00+00:00"
}