{
  "url": "https://voxday.net/2017/08/23/cloudflare-ceo-ponders-his-action/",
  "scraped_at": "2025-12-19T10:21:16.124486",
  "title": "Cloudflare CEO ponders his action",
  "date_display": "August 23, 2017",
  "date_iso": "2017-08-23T18:00:00+00:00",
  "date_from_url": "2017-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the answer is, no, Mr. Prince, <a href=\"https://archive.fo/HRNTu#selection-185.0-185.126\">you were not right to pull the plug</a> on a Nazi website.</p><blockquote><p>I helped kick a group of neo-Nazis off the internet last week, but since then I’ve wondered whether I made the right decision…. At some level, it’s easy to fire Nazis as customers. They don’t pay you much, if anything, since Cloudflare offers a free version of its service. Our terms of use give us broad discretion to choose whom we allow to use our network. Beyond the horrible content, the Daily Stormer began claiming that we secretly supported their ideology, causing a major distraction to our team. Firing a Nazi customer gets you glowing notes from around the world thanking you for standing up to hate.<br> But a week later, I continue to worry about this power and the potential precedent being set. The reality of today’s internet is that if you are publishing anything even remotely controversial, your site will get cyberattacked. Without a massive global network similar to Cloudflare’s, it is nearly impossible to withstand the barrage. Only a small group of companies—names you know, like Facebook , Google and Microsoft , along with a handful of others you may not, like Cloudflare—have sufficient scale to keep their users online.<br> The upshot is that a few private companies have effectively become the gatekeepers to the public square—the blogs and social media that serve as today’s soapboxes and pamphlets. If a handful of tech executives decide to block you from their services, your content effectively can’t be on the internet.<br> Before terminating the Daily Stormer, Cloudflare’s policy had been to stay neutral to the content that used our network. We’d comply with the law in the jurisdictions where we operate, but we wouldn’t bow to political or public pressure to boot anyone off our network. And make no mistake, there is pressure: Hackers actually tweeted to us asking that we get out of the way so they could take down the Daily Stormer.<br> When standing up to government requests or angry Twitter demands to silence unpopular speech, it was powerful to be able to say we’d never terminated a customer due to political pressure. I’m not sure we can say that anymore.</br></br></br></br></p></blockquote><p>Dear Mr. Prince,<br> In answer to your question posed in the Wall Street Journal today, the answer is no. Here are five reasons why:</br></p><ul><li>You sacrificed Cloudflare’s moral authority and neutrality.</li><li>You contributed to the increasing fragmentation of the Internet.</li><li>You threw away any chance to meaningfully oppose the growing movement towards national Internet sovereignty. How can you possibly claim that China and Turkey, or any other government, don’t have the right to thought-police you when you are thought-policing others?</li><li>You encouraged other big tech companies to do the same, thereby leading tens of thousands of people to initiate backup plans in the event they are deplatformed for their opinions.</li><li>You gave in to the SJWs and informed them that you are susceptible to their pressure. You can safely expect further demands to functionally deplatform other sites under attack.</li></ul><p>I am no fan of the Daily Stormer. It is obnoxious and their writers have personally attacked me on more than one occasion. Nevertheless, I would encourage you to invite the site back to Cloudfare, while at the same time making a public statement that Cloudflare will no longer thought-police Internet content and will not deny its services to any site that is in compliance with the law.<br> Sincerely,<br> Vox Day</br></br></p></div>",
  "content_text": "And the answer is, no, Mr. Prince,\nyou were not right to pull the plug\non a Nazi website.\nI helped kick a group of neo-Nazis off the internet last week, but since then I’ve wondered whether I made the right decision…. At some level, it’s easy to fire Nazis as customers. They don’t pay you much, if anything, since Cloudflare offers a free version of its service. Our terms of use give us broad discretion to choose whom we allow to use our network. Beyond the horrible content, the Daily Stormer began claiming that we secretly supported their ideology, causing a major distraction to our team. Firing a Nazi customer gets you glowing notes from around the world thanking you for standing up to hate.\nBut a week later, I continue to worry about this power and the potential precedent being set. The reality of today’s internet is that if you are publishing anything even remotely controversial, your site will get cyberattacked. Without a massive global network similar to Cloudflare’s, it is nearly impossible to withstand the barrage. Only a small group of companies—names you know, like Facebook , Google and Microsoft , along with a handful of others you may not, like Cloudflare—have sufficient scale to keep their users online.\nThe upshot is that a few private companies have effectively become the gatekeepers to the public square—the blogs and social media that serve as today’s soapboxes and pamphlets. If a handful of tech executives decide to block you from their services, your content effectively can’t be on the internet.\nBefore terminating the Daily Stormer, Cloudflare’s policy had been to stay neutral to the content that used our network. We’d comply with the law in the jurisdictions where we operate, but we wouldn’t bow to political or public pressure to boot anyone off our network. And make no mistake, there is pressure: Hackers actually tweeted to us asking that we get out of the way so they could take down the Daily Stormer.\nWhen standing up to government requests or angry Twitter demands to silence unpopular speech, it was powerful to be able to say we’d never terminated a customer due to political pressure. I’m not sure we can say that anymore.\nDear Mr. Prince,\nIn answer to your question posed in the Wall Street Journal today, the answer is no. Here are five reasons why:\nYou sacrificed Cloudflare’s moral authority and neutrality.\nYou contributed to the increasing fragmentation of the Internet.\nYou threw away any chance to meaningfully oppose the growing movement towards national Internet sovereignty. How can you possibly claim that China and Turkey, or any other government, don’t have the right to thought-police you when you are thought-policing others?\nYou encouraged other big tech companies to do the same, thereby leading tens of thousands of people to initiate backup plans in the event they are deplatformed for their opinions.\nYou gave in to the SJWs and informed them that you are susceptible to their pressure. You can safely expect further demands to functionally deplatform other sites under attack.\nI am no fan of the Daily Stormer. It is obnoxious and their writers have personally attacked me on more than one occasion. Nevertheless, I would encourage you to invite the site back to Cloudfare, while at the same time making a public statement that Cloudflare will no longer thought-police Internet content and will not deny its services to any site that is in compliance with the law.\nSincerely,\nVox Day",
  "tags": [
    "politics",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-23T17:00:00+00:00"
}