{
  "url": "https://voxday.net/2017/08/30/compression-and-decompression/",
  "scraped_at": "2025-12-19T10:21:58.245353",
  "title": "Compression and decompression",
  "date_display": "August 30, 2017",
  "date_iso": "2017-08-30T13:00:00+00:00",
  "date_from_url": "2017-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The producers of A Game of Thrones <a href=\"https://newrepublic.com/article/144597/game-thrones-learned-wrong-lessons-george-rr-martin\">learned the wrong lessons</a> from George Martin’s mistakes:</p><blockquote><p>Too often over the last three seasons—particularly since “Hardhome” in season five, when the series began to chart its own course—the show’s secondary characters and plots have seemed lost. Game of Thrones just doesn’t have time for anyone who isn’t Jon, Daenerys, or the Night King anymore. The show has shed George R.R. Martin’s most frustrating tics, which ultimately weighed his story down: his insistence on meticulous world-building, on resisting deus ex machina resolutions, and on subverting fantasy tropes. But in racing toward the end—in giving fans the resolution they have demanded—Game of Thrones has over-learned from Martin’s mistakes, taking the story too far in the other direction.<br> Paradoxically, the show has also become grander, more ambitious than any television series before it. Season seven was cut to only seven episodes, as opposed to the ordinary ten, presumably to pay for all the action. Its showrunners needed money for its first naval battle, a dragon assault on the Lannister army, round two between Jon and the Night King, and, most spectacularly, an undead dragon taking down an 8,000-year-old magic wall made of ice. But for all of their scope and masterful aesthetic execution (particularly in the case of the horribly named “Loot Train Battle”), these scenes all lacked the punch of “Hardhome,” when Jon first confronts the Night King and the show’s stakes at long last come into view.<br> This is because they were in keeping with the show’s post-“Hardhome” modus operandi: moving pieces around to prepare for a final sprint to the finish. The naval battle at the beginning of season seven served to eliminate the Sand Snakes (who never worked anyway) and kick into gear Theon’s redemption arc (which was then ignored for the next several episodes). The assault on Casterly Rock came about for no other reason than to even the odds by taking the Unsullied out of the picture, though they reappeared in the finale with no explanation.<br> Most egregiously, the “Frozen Lake Battle” (also horribly named) was necessitated by a plan to capture a wight that made absolutely no sense at all. The reason for its existence was to neatly get things done, in this case to give the Night King a dragon and to provide an excuse for finally bringing all the show’s far-flung characters together. As well-executed as many of these plot developments were, they never arose naturally from the show’s characters—instead they were imposed by the show’s writers, who are suddenly very pressed for time….<br> The show’s other standouts have been largely abandoned or turned into secondary figures, including the Starks. The culmination of the Littlefinger plot was thrilling, but overall it was narrative thumb-twiddling, a way to take a character off the board while giving something for Arya and Sansa to do while Jon was away.<br> The sad truth is that this is probably where the novels are going as well. Martin has concocted many of his characters to buy time for his primary story. It is Martin’s great strength that so many of them—including a number who never made it into the show—are so rich and real, but they too are ultimately extraneous to the main plot revolving around Jon and Dany.</br></br></br></br></br></p></blockquote><p>Although I am contemptuous of George Martin as an individual, and although I am increasingly confident that <b><i><a href=\"http://amzn.to/2iLEUmG\">ARTS OF DARK AND LIGHT</a></i></b> will eventually be seen by most fans of epic fantasy to be considerably superior to A SONG OF ICE AND FIRE once both series are finished, I continue to look on the books and the HBO series alike as a tremendous learning experience, if not an irreplaceable one.<br> The truth is that I’m grateful to Martin for the various mistakes he has made. Without the tedious debacle that was <i>A Dance with Dragons</i>, I never would have even thought about daring to begin my own epic fantasy. And without his spiraling out of control thanks to the introduction of 13 new perspective characters, bringing him to a total of 22 in one book, I would never have learned the importance of keeping them under such tight discipline. Without his foolish decision to go back and untie the Mereen Knot, I would not have grasped the importance of allowing the greater story to flow naturally, and not getting caught up in always explaining exactly what happened to whom.<br> Here is what most readers, even most writers, simply don’t realize. Writing epic fantasy is very difficult. I would estimate that it’s about 5x more difficult than writing a novel of normal size, not counting the extra time required to account for the additional length. Not only that, but periodically publishing large books is the exact opposite of what a writer should do if he wants to maximize his book sales in the current environment. So, most writers simply cannot write epic fantasy, and even if they happen to possess the ability, they can’t afford to do so.<br> Then factor in the fact that several of those who have actually written epic fantasy have done so in the form of cheap Tolkien knockoffs, which provide no useful lessons to the aspiring epic writer, and perhaps you’ll understand why I appreciate the chance to learn from GRRM in real time. Here is how I rank the writers of epic fantasy:</br></br></br></p><ol><li>JRR Tolkien</li><li>Stephen Donaldson (Covenant)</li><li>Margaret Weis &amp; Terry Hickman (Dragonlance)</li><li>David Eddings (Belgariad)</li><li>Glen Cook</li><li>Steven Erikson</li><li>Raymond Feist</li><li>George RR Martin</li><li>Joe Abercrombie</li><li>CS Friedman</li><li>Tad Williams</li><li>Daniel Abraham</li><li>Brandon Sanderson</li><li>R. Scott Bakker</li><li>Mark Lawrence</li><li>Terry Brooks</li><li>Robert Jordan</li><li>Terry Goodkind</li></ol><div> Obviously, your mileage may vary, as may what you consider to be “epic fantasy”. I would have Susan Cooper, Lloyd Alexander, Tanith Lee, and Anne McCaffrey all ranked above Dragonlance, but their work is better categorized in other categories. It’s rather amusing to see how many “best epic fantasy” lists feature works with descriptions that begin “okay, it’s not actually epic fantasy, but [insert other sub-genre here]|.<br> I don’t know where AODAL will end up once it is complete. Towards the top, I hope. But there is only one way to find out, and that is to finish Vols. II through V.</br></div></div>",
  "content_text": "The producers of A Game of Thrones\nlearned the wrong lessons\nfrom George Martin’s mistakes:\nToo often over the last three seasons—particularly since “Hardhome” in season five, when the series began to chart its own course—the show’s secondary characters and plots have seemed lost. Game of Thrones just doesn’t have time for anyone who isn’t Jon, Daenerys, or the Night King anymore. The show has shed George R.R. Martin’s most frustrating tics, which ultimately weighed his story down: his insistence on meticulous world-building, on resisting deus ex machina resolutions, and on subverting fantasy tropes. But in racing toward the end—in giving fans the resolution they have demanded—Game of Thrones has over-learned from Martin’s mistakes, taking the story too far in the other direction.\nParadoxically, the show has also become grander, more ambitious than any television series before it. Season seven was cut to only seven episodes, as opposed to the ordinary ten, presumably to pay for all the action. Its showrunners needed money for its first naval battle, a dragon assault on the Lannister army, round two between Jon and the Night King, and, most spectacularly, an undead dragon taking down an 8,000-year-old magic wall made of ice. But for all of their scope and masterful aesthetic execution (particularly in the case of the horribly named “Loot Train Battle”), these scenes all lacked the punch of “Hardhome,” when Jon first confronts the Night King and the show’s stakes at long last come into view.\nThis is because they were in keeping with the show’s post-“Hardhome” modus operandi: moving pieces around to prepare for a final sprint to the finish. The naval battle at the beginning of season seven served to eliminate the Sand Snakes (who never worked anyway) and kick into gear Theon’s redemption arc (which was then ignored for the next several episodes). The assault on Casterly Rock came about for no other reason than to even the odds by taking the Unsullied out of the picture, though they reappeared in the finale with no explanation.\nMost egregiously, the “Frozen Lake Battle” (also horribly named) was necessitated by a plan to capture a wight that made absolutely no sense at all. The reason for its existence was to neatly get things done, in this case to give the Night King a dragon and to provide an excuse for finally bringing all the show’s far-flung characters together. As well-executed as many of these plot developments were, they never arose naturally from the show’s characters—instead they were imposed by the show’s writers, who are suddenly very pressed for time….\nThe show’s other standouts have been largely abandoned or turned into secondary figures, including the Starks. The culmination of the Littlefinger plot was thrilling, but overall it was narrative thumb-twiddling, a way to take a character off the board while giving something for Arya and Sansa to do while Jon was away.\nThe sad truth is that this is probably where the novels are going as well. Martin has concocted many of his characters to buy time for his primary story. It is Martin’s great strength that so many of them—including a number who never made it into the show—are so rich and real, but they too are ultimately extraneous to the main plot revolving around Jon and Dany.\nAlthough I am contemptuous of George Martin as an individual, and although I am increasingly confident that\nARTS OF DARK AND LIGHT\nwill eventually be seen by most fans of epic fantasy to be considerably superior to A SONG OF ICE AND FIRE once both series are finished, I continue to look on the books and the HBO series alike as a tremendous learning experience, if not an irreplaceable one.\nThe truth is that I’m grateful to Martin for the various mistakes he has made. Without the tedious debacle that was\nA Dance with Dragons\n, I never would have even thought about daring to begin my own epic fantasy. And without his spiraling out of control thanks to the introduction of 13 new perspective characters, bringing him to a total of 22 in one book, I would never have learned the importance of keeping them under such tight discipline. Without his foolish decision to go back and untie the Mereen Knot, I would not have grasped the importance of allowing the greater story to flow naturally, and not getting caught up in always explaining exactly what happened to whom.\nHere is what most readers, even most writers, simply don’t realize. Writing epic fantasy is very difficult. I would estimate that it’s about 5x more difficult than writing a novel of normal size, not counting the extra time required to account for the additional length. Not only that, but periodically publishing large books is the exact opposite of what a writer should do if he wants to maximize his book sales in the current environment. So, most writers simply cannot write epic fantasy, and even if they happen to possess the ability, they can’t afford to do so.\nThen factor in the fact that several of those who have actually written epic fantasy have done so in the form of cheap Tolkien knockoffs, which provide no useful lessons to the aspiring epic writer, and perhaps you’ll understand why I appreciate the chance to learn from GRRM in real time. Here is how I rank the writers of epic fantasy:\nJRR Tolkien\nStephen Donaldson (Covenant)\nMargaret Weis & Terry Hickman (Dragonlance)\nDavid Eddings (Belgariad)\nGlen Cook\nSteven Erikson\nRaymond Feist\nGeorge RR Martin\nJoe Abercrombie\nCS Friedman\nTad Williams\nDaniel Abraham\nBrandon Sanderson\nR. Scott Bakker\nMark Lawrence\nTerry Brooks\nRobert Jordan\nTerry Goodkind\nObviously, your mileage may vary, as may what you consider to be “epic fantasy”. I would have Susan Cooper, Lloyd Alexander, Tanith Lee, and Anne McCaffrey all ranked above Dragonlance, but their work is better categorized in other categories. It’s rather amusing to see how many “best epic fantasy” lists feature works with descriptions that begin “okay, it’s not actually epic fantasy, but [insert other sub-genre here]|.\nI don’t know where AODAL will end up once it is complete. Towards the top, I hope. But there is only one way to find out, and that is to finish Vols. II through V.",
  "tags": [
    "Rules of Writing",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-30T12:00:00+00:00"
}