{
  "url": "https://voxday.net/2017/08/18/conservatives-move-rightward/",
  "scraped_at": "2025-12-19T10:20:37.304422",
  "title": "Conservatives move rightward",
  "date_display": "August 18, 2017",
  "date_iso": "2017-08-18T13:00:00+00:00",
  "date_from_url": "2017-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Jefferson <a href=\"https://medium.com/@gewgleiscancer/charlottesville-the-hypocrisy-of-my-fellow-conservatives-9db53b56e174\">calls out the hypocrisy</a> of his fellow conservatives:</p><blockquote><p>Even though I’m a Christian, I tended to lean classically liberal and libertarian politically for years. But as NeoMarxism surfaced more and more on the left, it pushed me further right into conservatism. I enjoyed the ‘straight-talk’ of conservative personalities like Ben Shapiro and Steven Crowder. I enjoyed that they challenged the narratives of the left with facts and statistics. “Facts don’t care about your feelings”, Ben Shapiro’s famous motto, fit my personality very well. It was refreshing to hear people buck political correctness and state the facts. The pursuit of truth in spite of anyone’s emotions or political agendas should be paramount.<br> However, since the AltRight became more prominent in the past two years, and the subject of ethnicity had surfaced as a topic of discussion and debate in the right-wing, I began to notice a level of hypocrisy among my fellow conservatives.<br> Personalities like Shapiro, Crowder and Michael J.Knowles, who love to shame the left for their denial of statistical, scientific and observable differences between the sexes, suddenly would not give the same credence to the subject of statistical, scientific, and observable differences between ethnicities. They consistently demonize or dismiss members of the AltRight or others who would talk extensively on these subjects like Jared Taylor and Charles Murray. They would apply the leftist technique of ‘guilt by association’ to other conservatives who attended rallies where AltRight members happened to be, or who referenced studies by Taylor or Murray, even though these conservatives didn’t espouse their political views.<br> They attribute all verifiable differences between ethnicities as a cultural/environmental issue, which is a perfectly valid position, but they won’t even entertain the studies, facts, and statistics that support a potential genetic component. And then try to arrogantly shame people for exploring these interesting theories. Isn’t it the sign of a true intellectual to entertain ideas without dismissing or espousing them? Where is the intellectualism here? Is ethnic genetic differences the last true taboo?</br></br></br></p></blockquote><p>There is considerably more there, so read the whole thing. He’s right about the fact that conservatives are, understandably enough, very, very reluctant to give up on their civic nationalism and accept the reality of identity politics. But they will do so, they are doing so, because they have no other choice unless they are to follow Bill Kristol’s lead and openly acknowledge their own leftism.</p></div>",
  "content_text": "Thomas Jefferson\ncalls out the hypocrisy\nof his fellow conservatives:\nEven though I’m a Christian, I tended to lean classically liberal and libertarian politically for years. But as NeoMarxism surfaced more and more on the left, it pushed me further right into conservatism. I enjoyed the ‘straight-talk’ of conservative personalities like Ben Shapiro and Steven Crowder. I enjoyed that they challenged the narratives of the left with facts and statistics. “Facts don’t care about your feelings”, Ben Shapiro’s famous motto, fit my personality very well. It was refreshing to hear people buck political correctness and state the facts. The pursuit of truth in spite of anyone’s emotions or political agendas should be paramount.\nHowever, since the AltRight became more prominent in the past two years, and the subject of ethnicity had surfaced as a topic of discussion and debate in the right-wing, I began to notice a level of hypocrisy among my fellow conservatives.\nPersonalities like Shapiro, Crowder and Michael J.Knowles, who love to shame the left for their denial of statistical, scientific and observable differences between the sexes, suddenly would not give the same credence to the subject of statistical, scientific, and observable differences between ethnicities. They consistently demonize or dismiss members of the AltRight or others who would talk extensively on these subjects like Jared Taylor and Charles Murray. They would apply the leftist technique of ‘guilt by association’ to other conservatives who attended rallies where AltRight members happened to be, or who referenced studies by Taylor or Murray, even though these conservatives didn’t espouse their political views.\nThey attribute all verifiable differences between ethnicities as a cultural/environmental issue, which is a perfectly valid position, but they won’t even entertain the studies, facts, and statistics that support a potential genetic component. And then try to arrogantly shame people for exploring these interesting theories. Isn’t it the sign of a true intellectual to entertain ideas without dismissing or espousing them? Where is the intellectualism here? Is ethnic genetic differences the last true taboo?\nThere is considerably more there, so read the whole thing. He’s right about the fact that conservatives are, understandably enough, very, very reluctant to give up on their civic nationalism and accept the reality of identity politics. But they will do so, they are doing so, because they have no other choice unless they are to follow Bill Kristol’s lead and openly acknowledge their own leftism.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-18T12:00:00+00:00"
}