{
  "url": "https://voxday.net/2017/08/11/diversity-in-tech/",
  "scraped_at": "2025-12-18T07:26:16.158588",
  "title": "Diversity in tech",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T10:23:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A 5-time IT manager with 26 years of experience explains <a href=\"https://www.reddit.com/r/KotakuInAction/comments/6scd84/long_my_experience_as_a_hiring_manager_in_it/\">the reality of diversit</a>y in technology</p><blockquote><p><b>Large Tech Company – Team of 11</b><br> Diversity policy that caused me a lot of problems. I didn’t have the proper control over who I could interview and my main problem was finding competent engineers regardless of race or sex. I did end up interviewing a very diverse set of candidates which made the process extra grueling as I wasted time with so many under-qualified diversity candidates.<br> Some of these diversity interviews were my most memorable for how bad the candidates were. As an example an Indian woman with a very impressive resume and monster SQL background. Only interview I ended after 10 minutes because the candidate asked me what SELECT meant in an example statement I white boarded and asked her to correct. Turns out the recruiting company had rewritten her resume for her and she was just a blatant diversity candidate. I complained to my manager about this as a waste of my time and was reminded my team was all white and with only one female.<br> I did so many interviews I knew were I waste of my time that I started just trying a few new techniques on the candidates as interview practice for myself. It was such a waste of time for myself and the candidate and I felt bad wasting time but I had no choice. There was no chance I would hire them but HR’s method of forcing diversity just kept tossing bad candidates at me.<br> I eventually worked around the process by finding my own candidates and secretly pushing them through the screening process. I could have been fired for this but my resource problem was so bad I didn’t have a choice.<br> For unrelated reasons I left that position. The single female on my team was promoted to take my place, against my recommendation. She was a pretty good engineer but had no experience managing and the team fell apart less then a year after I left. All my former team members all told me it was due to the ruthless micromanagement by my replacement. In my experience, micromanagement is the behavior of a lot of new managers thrust into a job that is too big for them to handle regardless of sex/race. Also, I never filled the SQL dev position but my replacement did hire a different Indian women as the SQL dev. I did hear she was incompetent and fired after 6 months.<br> I learned from this to always have full hiring control of my team or be doomed to fail.</br></br></br></br></br></br></p></blockquote><p>Contra this, Google’s CEO, Pichai Sundararajan doubled down and claimed Google “really need to have people internally who represent the world in its totality. And yet, the company has yet to implement a policy of aggressively hiring Nazis, Eskimos, Christians, or Mbenga bushmen from Cameroon.</p><blockquote><p>“To the girls who dream of being an engineer or an entrepreneur, and who dream of creating amazing things, I want you to know that there’s a place for you in this industry, there’s a place for you at Google,” he told the crowd gathered at a company recreation field. “Don’t let anyone tell you otherwise,” he said to cheers and applause. “You belong here and we need you.”<br> Pichai told the audience, which included about 50 contest finalists from seven countries including the U.S., that seeing the girls gave him hope for the future.<br> “At Google we are very committed to building products for everyone in the world,” Pichai said. “To do that well, we really need to have people internally who represent the world in totality. It’s really important that more women and girls have the opportunity to participate in technology, to learn how to code, create and innovate.”</br></br></p></blockquote><p>Both perspectives can’t be correct.</p></div>",
  "content_text": "A 5-time IT manager with 26 years of experience explains\nthe reality of diversit\ny in technology\nLarge Tech Company – Team of 11\nDiversity policy that caused me a lot of problems. I didn’t have the proper control over who I could interview and my main problem was finding competent engineers regardless of race or sex. I did end up interviewing a very diverse set of candidates which made the process extra grueling as I wasted time with so many under-qualified diversity candidates.\nSome of these diversity interviews were my most memorable for how bad the candidates were. As an example an Indian woman with a very impressive resume and monster SQL background. Only interview I ended after 10 minutes because the candidate asked me what SELECT meant in an example statement I white boarded and asked her to correct. Turns out the recruiting company had rewritten her resume for her and she was just a blatant diversity candidate. I complained to my manager about this as a waste of my time and was reminded my team was all white and with only one female.\nI did so many interviews I knew were I waste of my time that I started just trying a few new techniques on the candidates as interview practice for myself. It was such a waste of time for myself and the candidate and I felt bad wasting time but I had no choice. There was no chance I would hire them but HR’s method of forcing diversity just kept tossing bad candidates at me.\nI eventually worked around the process by finding my own candidates and secretly pushing them through the screening process. I could have been fired for this but my resource problem was so bad I didn’t have a choice.\nFor unrelated reasons I left that position. The single female on my team was promoted to take my place, against my recommendation. She was a pretty good engineer but had no experience managing and the team fell apart less then a year after I left. All my former team members all told me it was due to the ruthless micromanagement by my replacement. In my experience, micromanagement is the behavior of a lot of new managers thrust into a job that is too big for them to handle regardless of sex/race. Also, I never filled the SQL dev position but my replacement did hire a different Indian women as the SQL dev. I did hear she was incompetent and fired after 6 months.\nI learned from this to always have full hiring control of my team or be doomed to fail.\nContra this, Google’s CEO, Pichai Sundararajan doubled down and claimed Google “really need to have people internally who represent the world in its totality. And yet, the company has yet to implement a policy of aggressively hiring Nazis, Eskimos, Christians, or Mbenga bushmen from Cameroon.\n“To the girls who dream of being an engineer or an entrepreneur, and who dream of creating amazing things, I want you to know that there’s a place for you in this industry, there’s a place for you at Google,” he told the crowd gathered at a company recreation field. “Don’t let anyone tell you otherwise,” he said to cheers and applause. “You belong here and we need you.”\nPichai told the audience, which included about 50 contest finalists from seven countries including the U.S., that seeing the girls gave him hope for the future.\n“At Google we are very committed to building products for everyone in the world,” Pichai said. “To do that well, we really need to have people internally who represent the world in totality. It’s really important that more women and girls have the opportunity to participate in technology, to learn how to code, create and innovate.”\nBoth perspectives can’t be correct.",
  "tags": [
    "corpocracy",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-11T09:23:00+00:00"
}