{
  "url": "https://voxday.net/2017/08/20/dont-argue-with-damore/",
  "scraped_at": "2025-12-19T10:20:49.441640",
  "title": "Don’t argue with Damore",
  "date_display": "August 20, 2017",
  "date_iso": "2017-08-20T01:09:00+00:00",
  "date_from_url": "2017-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’d think a reporter would be aware that he was overmatched when he went to interview the author of the Google manifesto:</p><blockquote><p>During an interview with Business Insider, Damore, who was fired from Google for publishing a viewpoint diversity manifesto, claimed he “was simply trying to fix the culture in many ways. And really help a lot of people who are currently marginalized at Google by pointing out these huge biases that we have in this monolithic culture where anyone with a dissenting view can’t even express themselves,” he continued, adding, “Really, it’s like being gay in the 1950s.”<br> “These conservatives have to stay in the closet and have to mask who they really are. And that’s a huge problem because there’s open discrimination against anyone who comes out of the closet as a conservative,” Damore explained. He sparred with Business Insider’s Steve Kovach, who tried to claim that Damore attacked women in his manifesto.<br> “I was simply talking about the population level distributions. And I specifically call out that we should never treat an individual differently based on this because there’s so much overlap,” stated Damore. “The document was simply trying to address why there may be fewer women in technology than men. And it never said anything about the women at Google being any different than the men at Google.”<br> This prompted Kovach to reply, “Not at Google. But broadly it made assumptions about women as a general population though, right?”<br> “It didn’t make assumptions. It stated scientific facts about the population level distribution,” Damore responded.<br> “OK. I mean, that’s obviously up for debate too,” Kovach claimed, forcing Damore to explain, “Not really. I mean, these are empirical facts.”<br> “The population level distributions are not up for debate,” he continued. “Those have been documented hundreds of times.”</br></br></br></br></br></br></p></blockquote><p>Clearly Damore did not realize that Mr. Kovach did not like the population level distributions. Therefore, they were an assumption, ergo subjective, consequently wrong. You’d think these SJWs would, sooner or later, get suspicious about the statistical improbability of their being absolutely right every single time.<br> Of course, if they grasped statistics, they wouldn’t be SJWs blithely refuting empirical facts as one man’s assumptions.</br></p></div>",
  "content_text": "You’d think a reporter would be aware that he was overmatched when he went to interview the author of the Google manifesto:\nDuring an interview with Business Insider, Damore, who was fired from Google for publishing a viewpoint diversity manifesto, claimed he “was simply trying to fix the culture in many ways. And really help a lot of people who are currently marginalized at Google by pointing out these huge biases that we have in this monolithic culture where anyone with a dissenting view can’t even express themselves,” he continued, adding, “Really, it’s like being gay in the 1950s.”\n“These conservatives have to stay in the closet and have to mask who they really are. And that’s a huge problem because there’s open discrimination against anyone who comes out of the closet as a conservative,” Damore explained. He sparred with Business Insider’s Steve Kovach, who tried to claim that Damore attacked women in his manifesto.\n“I was simply talking about the population level distributions. And I specifically call out that we should never treat an individual differently based on this because there’s so much overlap,” stated Damore. “The document was simply trying to address why there may be fewer women in technology than men. And it never said anything about the women at Google being any different than the men at Google.”\nThis prompted Kovach to reply, “Not at Google. But broadly it made assumptions about women as a general population though, right?”\n“It didn’t make assumptions. It stated scientific facts about the population level distribution,” Damore responded.\n“OK. I mean, that’s obviously up for debate too,” Kovach claimed, forcing Damore to explain, “Not really. I mean, these are empirical facts.”\n“The population level distributions are not up for debate,” he continued. “Those have been documented hundreds of times.”\nClearly Damore did not realize that Mr. Kovach did not like the population level distributions. Therefore, they were an assumption, ergo subjective, consequently wrong. You’d think these SJWs would, sooner or later, get suspicious about the statistical improbability of their being absolutely right every single time.\nOf course, if they grasped statistics, they wouldn’t be SJWs blithely refuting empirical facts as one man’s assumptions.",
  "tags": [
    "corpocracy",
    "technology",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-20T00:09:00+00:00"
}