{
  "url": "https://voxday.net/2017/08/14/economic-war/",
  "scraped_at": "2025-12-19T10:20:10.947159",
  "title": "Economic war",
  "date_display": "August 14, 2017",
  "date_iso": "2017-08-14T08:52:00+00:00",
  "date_from_url": "2017-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The culture war in the USA <a href=\"http://www.dailymail.co.uk/news/article-4786826/Nationalist-FIRED-Twitter-names-shames-protesters.html\">goes economic</a>:</p><blockquote><p>A white nationalist was fired from his job after Twitter users began naming and shaming alt-right supporters involved in yesterday’s deadly Charlottesville rally. The rally – which was described by the Southern Poverty Law Center as ‘the largest hate-gathering of its kind in decades in the United States’ – attracted thousands from neo-Nazi groups, the Ku Klux Klan and other far-right organizations.<br> It also culminated in a horrifying alleged attack on a group of antifascist counter-protesters as alleged white supremacist James Alex Fields Jr allegedly drove into a crowd, killing one person and injuring 19 more.<br> As the reverberations of that deadly assault continued to be felt on Sunday, Twitter user Yes, You’re Racist began naming and shaming those who were photographed waving torches and allying themselves with violent far-right extremists.</br></br></p></blockquote><p>Tit-for-tat is now in order. Do you have an employee who supports Black Lives Matter on Twitter? Fire them. Do you have any employees who are SJWs? Fire them. Anyone who puts rainbows on Facebook? Fire them.<br> If James Damore and Cole White can be fired for their beliefs, so can everyone else. Once a tactic has been legitimized by the Left, don’t hesitate to use it. The Left has made it very clear that peaceful coexistence is no longer possible, so stop trying to coexist with them.<br> This development isn’t something to fear. Why are they doing this now? Because they are terrified of the gathering momentum and they are desperate to somehow stop it.<br> Meanwhile, (((Ben Shapiro))) is still lying about the Alt-Right. It is correct to say that it <i>includes white nationalists</i>, but it is blatantly false to claim that it is entirely white nationalists, or that it is a white supremacist philosophy.<br> The fact that our enemies feel the need to lie about us and misrepresent our views is one of the strongest indicators that our views are convincing and catching on with more and more former conservatives and libertarians and liberals alike.<br> Meanwhile, GoDaddy signs up for Google’s economic war on everyone to the right of SJW.</br></br></br></br></br></p><blockquote><p>We informed The Daily Stormer that they have 24 hours to move the domain to another provider, as they have violated our terms of service.</p></blockquote><p>Build your own platforms. This is an imperative.</p></div>",
  "content_text": "The culture war in the USA\ngoes economic\n:\nA white nationalist was fired from his job after Twitter users began naming and shaming alt-right supporters involved in yesterday’s deadly Charlottesville rally. The rally – which was described by the Southern Poverty Law Center as ‘the largest hate-gathering of its kind in decades in the United States’ – attracted thousands from neo-Nazi groups, the Ku Klux Klan and other far-right organizations.\nIt also culminated in a horrifying alleged attack on a group of antifascist counter-protesters as alleged white supremacist James Alex Fields Jr allegedly drove into a crowd, killing one person and injuring 19 more.\nAs the reverberations of that deadly assault continued to be felt on Sunday, Twitter user Yes, You’re Racist began naming and shaming those who were photographed waving torches and allying themselves with violent far-right extremists.\nTit-for-tat is now in order. Do you have an employee who supports Black Lives Matter on Twitter? Fire them. Do you have any employees who are SJWs? Fire them. Anyone who puts rainbows on Facebook? Fire them.\nIf James Damore and Cole White can be fired for their beliefs, so can everyone else. Once a tactic has been legitimized by the Left, don’t hesitate to use it. The Left has made it very clear that peaceful coexistence is no longer possible, so stop trying to coexist with them.\nThis development isn’t something to fear. Why are they doing this now? Because they are terrified of the gathering momentum and they are desperate to somehow stop it.\nMeanwhile, (((Ben Shapiro))) is still lying about the Alt-Right. It is correct to say that it\nincludes white nationalists\n, but it is blatantly false to claim that it is entirely white nationalists, or that it is a white supremacist philosophy.\nThe fact that our enemies feel the need to lie about us and misrepresent our views is one of the strongest indicators that our views are convincing and catching on with more and more former conservatives and libertarians and liberals alike.\nMeanwhile, GoDaddy signs up for Google’s economic war on everyone to the right of SJW.\nWe informed The Daily Stormer that they have 24 hours to move the domain to another provider, as they have violated our terms of service.\nBuild your own platforms. This is an imperative.",
  "tags": [
    "corpocracy",
    "decline and fall",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-14T07:52:00+00:00"
}