{
  "url": "https://voxday.net/2017/08/24/excerpt-the-promethean/",
  "scraped_at": "2025-12-19T10:21:17.599918",
  "title": "EXCERPT: The Promethean",
  "date_display": "August 24, 2017",
  "date_iso": "2017-08-24T02:10:00+00:00",
  "date_from_url": "2017-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is an excerpt from Owen Stanley’s excellent new novel, <b><a href=\"http://amzn.to/2vWveNW\">THE PROMETHEAN</a></b>.</i><br> Despite Harry’s enormous wealth, he was dismayed when the estimates from Bill Grogan and Vishnu were finally presented to him, not to mention Wayne Ruger’s, which looked like the defence budget for a small but unusually belligerent third-world nation. The project was obviously going to need considerably more money than he had originally anticipated, and, unfortunately, most of his capital was tied up in various forms of investment that precluded easy liquidation. Like most billionaires of his class, he had less cash in his bank account than was carried by the average Uber driver.<br> He was sitting in his office with Jerry one morning, reviewing the three estimates, which, no matter how many times he read them over, obstinately refused to shrink, and discussing the inevitable cash-flow crisis they would entail. By now, Jerry had quite a good grasp of the British R&amp;D scene, and he suggested that Harry approach the Government’s Bio-Engineering Research Fund to see if they would consider offering some support to Project Frank.<br> “But if we do that,” Harry objected, “Frank won’t be a secret any longer. We can’t risk that.”<br> Jerry told him not to worry. “Granting agencies like the Fund deal with this problem of commercial sensitivity all the time. They have a very strict confidentiality policy that no details of any applications or grants are put in the public domain. None of our possible competitors is going to find out what we’re doing until it’s far too late.”<br> Not seeing any other way to move forward on the project, Harry reluctantly agreed to Jerry’s proposal. So they sent in an application containing the detailed specifications for Project Frank to the Fund, and, upon opening his morning mail a few weeks later, Harry was delighted to find a letter from Professor Price-Williams, the Fund’s Chairman, saying that they had been most impressed by the specifications and might, in due course, be able to offer a grant of up to four million pounds. But before the application could proceed any further, the project would have to be approved by their former Ethics Committee, since many of the projects supported by the Fund had applications in medicine and social welfare.<br> Rather ominously, the professor mentioned that the Ethics Committee had recently been renamed the Diversity and Inclusion Committee by the Department of Culture. But the CVs of the Committee members were enclosed, in order to give Mr. Hockenheimer the opportunity to prepare himself for the kind of questions they might put to him, and Professor Price-Williams wished him the best of luck.<br> The appointment with the Diversity and Inclusion Committee of the Bio-Engineering Research Fund turned out to be on a Friday afternoon at the Committee’s offices in a magnificent house overlooking Regents Park, one of the most desirable locations in London, and rented at vast expense by the Department of Culture.<br> The Government was lucky enough to be able to call upon a large pool of high-minded volunteers for such committees, who were happy to give impartial advice for the public good, without any recompense apart from their expenses. In this case, it is true, none of them happened to possess any scientific or engineering background whatever, let alone any qualifications to discuss robotics. Fortunately, practical knowledge of this kind was not considered necessary because the function of the Committee was to bring a more morally enlightened and humane perspective to the discussions that was beyond the limited mental horizon of engineers.<br> The Chairperson was a tall, handsome woman, Nkwandi Obolajuwan, who had been appointed to head the Committee when the Department found that she was not only a second-generation Nigerian immigrant, but also wheelchair-bound, which was believed to give her special insight into the challenges of marginalisation. Despite her triple handicaps of race, gender, and physical disability, she had nevertheless achieved a very comfortable life as a lawyer representing her fellow immigrants. To be sure, most of them happened to be very wealthy relatives of very corrupt African politicians and Middle Eastern royal families, but she did not think this was grounds for discriminating against them by refusing to help them. While she enjoyed her evenings in her luxurious apartment with a bottle of prosecco and some Charbonnel et Walker chocolates in front of the telly, she was tireless in her support of many worthy social justice causes, which had first brought her to the attention of the Department.<br> Percy Crump was the Committee’s self-appointed representative for the Fat Acceptance Movement. His very limited academic credits were largely in the field of Women’s Studies and it was through these that he had become aware of society’s persistent prejudice against women of ample proportions. He was naturally sympathetic to their plight because he was himself conspicuously overweight, and he had no sooner heard about the Fat Acceptance Movement than he became one of its better-known advocates. He had made a full-time career out of demanding concessions and the construction of special facilities by public transport companies, traffic engineers, and businesses to compensate himself and his fellow sufferers for all the discrimination and bigotry and daily microaggressions they endured from the so-called “normal.”<br> The committee’s token student, representing British youth, was Aminah Khan, a Muslim in a headscarf. Serious and orthodox, or as the less sympathetic might have called her, sullen and narrow-minded, she detested most aspects of Western culture and longed for the day when the infidels would finally submit to Allah. In the meantime, she was determined to assert the claims of Sharia law in decadent Britain.<br> Godfrey Sunderland was Lecturer in Protest Theory at the London School of Politics, and in his spare time, an activist for the People’s Antifascist Front. Originally from a wealthy family of aristocratic lineage, his blond dreadlocks nevertheless expressed his claim to have been born black in a white skin. “Race is just a cultural construct, man,” he would snap at anyone who dared to find his assertion of ‘wrongskin’ somewhat implausible. He regarded Nkwandi as a sellout to the system, not to say a coconut, because he particularly despised lawyers. In Godfrey’s opinion, lawyers accepted the whole rotten system of unjust power, and instead of undermining it, tried to work within it like maggots inside a corpse. When the Revolution came and the people took back the power that was rightfully theirs, there would be no need for lawyers who, if they were lucky, just might be allowed to slink away unharmed. And if they weren’t lucky, well….<br> The fifth member of the committee was a lesbian social worker, Toni Clark. She was a feminist and ill-disposed to men in general. Somewhat surprisingly, she did not regard gay men as allies in the LGBTQIAP+ alliance, but as hoggers of the political limelight, only interested in talking up their own status as victims, and just as prone as their straight brethren to pushing women to one side. She viewed Harry with disapproval, of course, not only because he was an American capitalist, but because his business activities objectified women in an offensive and blatantly heterosexist way.<br> The Committee had read Harry’s CV and the specifications for Project Frank prior to the meeting, and in the preliminary discussions its members had taken a distinctly hostile view of both Harry and his project. As a very white, very male, and very rich American capitalist who had literally built his fortune on the exploitation of women adorning themselves for the sexual pleasure of men, he was already politically suspect, and his project promised to be even worse.<br> While the technical specifications were almost entirely above their heads, they had grasped the general gist of Harry’s proposal, and as Nkwandi said when Harry took his seat at the end of the table, “Our main problem, Mr. Hockenheimer, is that your whole project has some dangerously elitist tendencies, and is markedly insensitive to just about every marginalised community in our society. We feel that it’s hard to combine the idea of a toy for the corporate elite with the principles of equality, diversity, and inclusion that guide this committee. If your project is approved, it is bound to become extremely well-known, and one may even say ‘iconic’, so we have to consider very carefully what kind of messages it will send to the general public.”<br> “I wasn’t really thinking about messages,” replied Harry. “My intention is merely to build and provide a great new technology to the public.”<br> “That’s all very well, Mr. Hockenheimer, but the fact is that in this case, the medium is the message. You simply can’t avoid sending messages in a project of this sort, and that’s why, I’m afraid, we’re going to require some drastic modifications before we can even consider approving it for funding. Perhaps I should explain that whereas the old Ethics Committee existed primarily to ensure there were no inappropriate conflicts of interest, the Diversity and Inclusion Committee has the much broader remit of ensuring that all the Fund’s projects adhere to the societally correct values of equality and social justice.”<br> Harry’s heart sank.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "This is an excerpt from Owen Stanley’s excellent new novel,\nTHE PROMETHEAN\n.\nDespite Harry’s enormous wealth, he was dismayed when the estimates from Bill Grogan and Vishnu were finally presented to him, not to mention Wayne Ruger’s, which looked like the defence budget for a small but unusually belligerent third-world nation. The project was obviously going to need considerably more money than he had originally anticipated, and, unfortunately, most of his capital was tied up in various forms of investment that precluded easy liquidation. Like most billionaires of his class, he had less cash in his bank account than was carried by the average Uber driver.\nHe was sitting in his office with Jerry one morning, reviewing the three estimates, which, no matter how many times he read them over, obstinately refused to shrink, and discussing the inevitable cash-flow crisis they would entail. By now, Jerry had quite a good grasp of the British R&D scene, and he suggested that Harry approach the Government’s Bio-Engineering Research Fund to see if they would consider offering some support to Project Frank.\n“But if we do that,” Harry objected, “Frank won’t be a secret any longer. We can’t risk that.”\nJerry told him not to worry. “Granting agencies like the Fund deal with this problem of commercial sensitivity all the time. They have a very strict confidentiality policy that no details of any applications or grants are put in the public domain. None of our possible competitors is going to find out what we’re doing until it’s far too late.”\nNot seeing any other way to move forward on the project, Harry reluctantly agreed to Jerry’s proposal. So they sent in an application containing the detailed specifications for Project Frank to the Fund, and, upon opening his morning mail a few weeks later, Harry was delighted to find a letter from Professor Price-Williams, the Fund’s Chairman, saying that they had been most impressed by the specifications and might, in due course, be able to offer a grant of up to four million pounds. But before the application could proceed any further, the project would have to be approved by their former Ethics Committee, since many of the projects supported by the Fund had applications in medicine and social welfare.\nRather ominously, the professor mentioned that the Ethics Committee had recently been renamed the Diversity and Inclusion Committee by the Department of Culture. But the CVs of the Committee members were enclosed, in order to give Mr. Hockenheimer the opportunity to prepare himself for the kind of questions they might put to him, and Professor Price-Williams wished him the best of luck.\nThe appointment with the Diversity and Inclusion Committee of the Bio-Engineering Research Fund turned out to be on a Friday afternoon at the Committee’s offices in a magnificent house overlooking Regents Park, one of the most desirable locations in London, and rented at vast expense by the Department of Culture.\nThe Government was lucky enough to be able to call upon a large pool of high-minded volunteers for such committees, who were happy to give impartial advice for the public good, without any recompense apart from their expenses. In this case, it is true, none of them happened to possess any scientific or engineering background whatever, let alone any qualifications to discuss robotics. Fortunately, practical knowledge of this kind was not considered necessary because the function of the Committee was to bring a more morally enlightened and humane perspective to the discussions that was beyond the limited mental horizon of engineers.\nThe Chairperson was a tall, handsome woman, Nkwandi Obolajuwan, who had been appointed to head the Committee when the Department found that she was not only a second-generation Nigerian immigrant, but also wheelchair-bound, which was believed to give her special insight into the challenges of marginalisation. Despite her triple handicaps of race, gender, and physical disability, she had nevertheless achieved a very comfortable life as a lawyer representing her fellow immigrants. To be sure, most of them happened to be very wealthy relatives of very corrupt African politicians and Middle Eastern royal families, but she did not think this was grounds for discriminating against them by refusing to help them. While she enjoyed her evenings in her luxurious apartment with a bottle of prosecco and some Charbonnel et Walker chocolates in front of the telly, she was tireless in her support of many worthy social justice causes, which had first brought her to the attention of the Department.\nPercy Crump was the Committee’s self-appointed representative for the Fat Acceptance Movement. His very limited academic credits were largely in the field of Women’s Studies and it was through these that he had become aware of society’s persistent prejudice against women of ample proportions. He was naturally sympathetic to their plight because he was himself conspicuously overweight, and he had no sooner heard about the Fat Acceptance Movement than he became one of its better-known advocates. He had made a full-time career out of demanding concessions and the construction of special facilities by public transport companies, traffic engineers, and businesses to compensate himself and his fellow sufferers for all the discrimination and bigotry and daily microaggressions they endured from the so-called “normal.”\nThe committee’s token student, representing British youth, was Aminah Khan, a Muslim in a headscarf. Serious and orthodox, or as the less sympathetic might have called her, sullen and narrow-minded, she detested most aspects of Western culture and longed for the day when the infidels would finally submit to Allah. In the meantime, she was determined to assert the claims of Sharia law in decadent Britain.\nGodfrey Sunderland was Lecturer in Protest Theory at the London School of Politics, and in his spare time, an activist for the People’s Antifascist Front. Originally from a wealthy family of aristocratic lineage, his blond dreadlocks nevertheless expressed his claim to have been born black in a white skin. “Race is just a cultural construct, man,” he would snap at anyone who dared to find his assertion of ‘wrongskin’ somewhat implausible. He regarded Nkwandi as a sellout to the system, not to say a coconut, because he particularly despised lawyers. In Godfrey’s opinion, lawyers accepted the whole rotten system of unjust power, and instead of undermining it, tried to work within it like maggots inside a corpse. When the Revolution came and the people took back the power that was rightfully theirs, there would be no need for lawyers who, if they were lucky, just might be allowed to slink away unharmed. And if they weren’t lucky, well….\nThe fifth member of the committee was a lesbian social worker, Toni Clark. She was a feminist and ill-disposed to men in general. Somewhat surprisingly, she did not regard gay men as allies in the LGBTQIAP+ alliance, but as hoggers of the political limelight, only interested in talking up their own status as victims, and just as prone as their straight brethren to pushing women to one side. She viewed Harry with disapproval, of course, not only because he was an American capitalist, but because his business activities objectified women in an offensive and blatantly heterosexist way.\nThe Committee had read Harry’s CV and the specifications for Project Frank prior to the meeting, and in the preliminary discussions its members had taken a distinctly hostile view of both Harry and his project. As a very white, very male, and very rich American capitalist who had literally built his fortune on the exploitation of women adorning themselves for the sexual pleasure of men, he was already politically suspect, and his project promised to be even worse.\nWhile the technical specifications were almost entirely above their heads, they had grasped the general gist of Harry’s proposal, and as Nkwandi said when Harry took his seat at the end of the table, “Our main problem, Mr. Hockenheimer, is that your whole project has some dangerously elitist tendencies, and is markedly insensitive to just about every marginalised community in our society. We feel that it’s hard to combine the idea of a toy for the corporate elite with the principles of equality, diversity, and inclusion that guide this committee. If your project is approved, it is bound to become extremely well-known, and one may even say ‘iconic’, so we have to consider very carefully what kind of messages it will send to the general public.”\n“I wasn’t really thinking about messages,” replied Harry. “My intention is merely to build and provide a great new technology to the public.”\n“That’s all very well, Mr. Hockenheimer, but the fact is that in this case, the medium is the message. You simply can’t avoid sending messages in a project of this sort, and that’s why, I’m afraid, we’re going to require some drastic modifications before we can even consider approving it for funding. Perhaps I should explain that whereas the old Ethics Committee existed primarily to ensure there were no inappropriate conflicts of interest, the Diversity and Inclusion Committee has the much broader remit of ensuring that all the Fund’s projects adhere to the societally correct values of equality and social justice.”\nHarry’s heart sank.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-24T01:10:00+00:00"
}