{
  "url": "https://voxday.net/2017/08/28/fake-ads/",
  "scraped_at": "2025-12-19T10:21:47.480346",
  "title": "Fake Ads",
  "date_display": "August 28, 2017",
  "date_iso": "2017-08-28T13:00:00+00:00",
  "date_from_url": "2017-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Facebook has already been caught multiple times, <a href=\"http://adland.tv/adnews/googles-ad-traffic-news-fake/294024572\">Google has been caught faking ad traffic:</a></p><blockquote><p>The WSJ is reporting that Google is issuing refunds to advertisers over “fake traffic,” and are now working on new safeguards against the issue.<br> <i>Google’s refunds amount to only a fraction of the total ad spending served to invalid traffic, which has left some advertising executives unsatisfied, the people familiar with the situation said. Google has offered to repay its “platform fee,” which ad buyers said typically ranges from about 7% to 10% of the total ad buy.</i><br> <i><br> </br></i><i>The company says this is appropriate, because it doesn’t control the rest of the money. Typically, advertisers use DoubleClick Bid Manager to target audiences across vast numbers of websites in seconds by connecting to dozens of online ad exchanges, marketplaces that connect buyers and publishers through real-time auctions.</i><br> As we at Adland have argued for years now, digital paid media is a fraud due to the many incidents of fake traffic, bots, and the smoke and mirrors that blind the less tech savvy clients. Last year, Russian bots earned 180 million by fake-watching ads all over the Google empire.<br> Google has participated in efforts to clean up the digital market, joining the industry initiative Ads.txt project launched back in May by the Interactive Advertising Bureau. They’re hoping to bring trust back into the digital ecosystem. But in the arms race between consumers who use ad blockers and ad networks making ads unblockable, unskippable and even more intrusive, the consumers are staying one step ahead. More importantly with each new fraud brought to light and the hundreds of millions wasted, it’s hard to believe clients take Google at face value much longer. Advertisers are finally figuring out that this is a house of cards, built by pretty graphs in slick interfaces that look great on paper but in reality does very little to drive sales.<br> Google’s latest crisis comes at the same time that it is removing content creators from the ability to monetize their content, policing Youtube like never before. Google’s policing doesn’t end there, however. In Professor Jordan Peterson’s case, they banned him from his entire account, including mail and calendar.<br> Bloomberg reports that Google has just begun their biggest crackdown on “extremist content”<br> <i><br> </br></i><i>The new restrictions, which target what Walker called “inflammatory religious or supremacist content,” are expected to hit a small fraction of videos, according to person familiar with the company. YouTube says it uploads over 400 hours of video a minute. Videos tagged by its new policy won’t be able to run ads or have comments posted, and won’t appear in any recommended lists on the video site. A warning screen will also appear before the videos, which will not be able to play when embedded on external websites. YouTube will let video creators contest the restrictions through an appeals process, a spokeswoman said.</i><br> If the appeals process is anything like what Adland encountered, then it will be labyrinthian, time-consuming and arbitrary. The only reason we were un-banned from Adsense the first time around, was because we knew someone who knew someone that worked at Google in Ireland. These days, the only replies we get are automatic. Adland.tv the domain has even been delisted from Google search completely, which we managed to fix, and we’re currently being heavily deranked for no apparent reason. Or perhaps these articles are the reason.<br> In dealing with international brand boycott of Google advertising, and cleaning house so that they no longer fund terrorism by running pre-roll Super Bowl ads on ISIS videos, Google is now again apologising and “tweaking” their system.</br></br></br></br></br></br></br></br></br></p></blockquote><p>The ad economy is increasingly a) monopolistic and b) fraudulent. I have never used AdSense or Facebook ads because I have never seen any indication whatsoever that they are effective or reliable. I did try using BookBub four times, but after they rejected both A THRONE OF BONES as well as Jerry Pournelle’s THERE WILL BE WAR for ad campaigns, I stopped using them.<br> What I have found to be effective is a) this blog, b) Larry Correia’s book bombs, c) the Amazon giveaways, and d) the two mailing lists. In other words, direct marketing. Indirect marketing, be it advertising in magazines or the various social media ad schemes, only appear to benefit the owner of the advertising vehicle rather than the advertiser.<br> Notice that YouTube still puts ads on videos it has demonetized. Such as those <a href=\"http://www.zerohedge.com/news/2017-08-27/youtube-economically-censors-ron-paul-labels-videos-not-suitable-all-advertisers\">produced by Ron Paul</a>.</br></br></p><blockquote><p>Former US Congressman Ron Paul has joined a growing list of independent political journalists and commentators who’re being economically punished by YouTube despite producing videos that routinely receive hundreds of thousands of views. In a tweet published Saturday, Wikileaks founder Julian Assange tweeted a screenshot of Paul’s “Liberty Report” page showing that his videos had been labeled “not suitable” for all advertisers by YouTube’s content arbiters.</p></blockquote></div>",
  "content_text": "As Facebook has already been caught multiple times,\nGoogle has been caught faking ad traffic:\nThe WSJ is reporting that Google is issuing refunds to advertisers over “fake traffic,” and are now working on new safeguards against the issue.\nGoogle’s refunds amount to only a fraction of the total ad spending served to invalid traffic, which has left some advertising executives unsatisfied, the people familiar with the situation said. Google has offered to repay its “platform fee,” which ad buyers said typically ranges from about 7% to 10% of the total ad buy.\nThe company says this is appropriate, because it doesn’t control the rest of the money. Typically, advertisers use DoubleClick Bid Manager to target audiences across vast numbers of websites in seconds by connecting to dozens of online ad exchanges, marketplaces that connect buyers and publishers through real-time auctions.\nAs we at Adland have argued for years now, digital paid media is a fraud due to the many incidents of fake traffic, bots, and the smoke and mirrors that blind the less tech savvy clients. Last year, Russian bots earned 180 million by fake-watching ads all over the Google empire.\nGoogle has participated in efforts to clean up the digital market, joining the industry initiative Ads.txt project launched back in May by the Interactive Advertising Bureau. They’re hoping to bring trust back into the digital ecosystem. But in the arms race between consumers who use ad blockers and ad networks making ads unblockable, unskippable and even more intrusive, the consumers are staying one step ahead. More importantly with each new fraud brought to light and the hundreds of millions wasted, it’s hard to believe clients take Google at face value much longer. Advertisers are finally figuring out that this is a house of cards, built by pretty graphs in slick interfaces that look great on paper but in reality does very little to drive sales.\nGoogle’s latest crisis comes at the same time that it is removing content creators from the ability to monetize their content, policing Youtube like never before. Google’s policing doesn’t end there, however. In Professor Jordan Peterson’s case, they banned him from his entire account, including mail and calendar.\nBloomberg reports that Google has just begun their biggest crackdown on “extremist content”\nThe new restrictions, which target what Walker called “inflammatory religious or supremacist content,” are expected to hit a small fraction of videos, according to person familiar with the company. YouTube says it uploads over 400 hours of video a minute. Videos tagged by its new policy won’t be able to run ads or have comments posted, and won’t appear in any recommended lists on the video site. A warning screen will also appear before the videos, which will not be able to play when embedded on external websites. YouTube will let video creators contest the restrictions through an appeals process, a spokeswoman said.\nIf the appeals process is anything like what Adland encountered, then it will be labyrinthian, time-consuming and arbitrary. The only reason we were un-banned from Adsense the first time around, was because we knew someone who knew someone that worked at Google in Ireland. These days, the only replies we get are automatic. Adland.tv the domain has even been delisted from Google search completely, which we managed to fix, and we’re currently being heavily deranked for no apparent reason. Or perhaps these articles are the reason.\nIn dealing with international brand boycott of Google advertising, and cleaning house so that they no longer fund terrorism by running pre-roll Super Bowl ads on ISIS videos, Google is now again apologising and “tweaking” their system.\nThe ad economy is increasingly a) monopolistic and b) fraudulent. I have never used AdSense or Facebook ads because I have never seen any indication whatsoever that they are effective or reliable. I did try using BookBub four times, but after they rejected both A THRONE OF BONES as well as Jerry Pournelle’s THERE WILL BE WAR for ad campaigns, I stopped using them.\nWhat I have found to be effective is a) this blog, b) Larry Correia’s book bombs, c) the Amazon giveaways, and d) the two mailing lists. In other words, direct marketing. Indirect marketing, be it advertising in magazines or the various social media ad schemes, only appear to benefit the owner of the advertising vehicle rather than the advertiser.\nNotice that YouTube still puts ads on videos it has demonetized. Such as those\nproduced by Ron Paul\n.\nFormer US Congressman Ron Paul has joined a growing list of independent political journalists and commentators who’re being economically punished by YouTube despite producing videos that routinely receive hundreds of thousands of views. In a tweet published Saturday, Wikileaks founder Julian Assange tweeted a screenshot of Paul’s “Liberty Report” page showing that his videos had been labeled “not suitable” for all advertisers by YouTube’s content arbiters.",
  "tags": [
    "Infogalactic",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-28T12:00:00+00:00"
}