{
  "url": "https://voxday.net/2017/08/24/ghe-sparemo/",
  "scraped_at": "2025-12-19T10:21:20.776383",
  "title": "Ghe sparemo",
  "date_display": "August 24, 2017",
  "date_iso": "2017-08-24T13:00:00+00:00",
  "date_from_url": "2017-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Most Serene City <a href=\"http://www.mirror.co.uk/news/world-news/well-send-straight-god-venice-11043606?service=responsive\">is not screwing around</a>:</p><blockquote><p>Venice’s right-wing mayor has ordered cops to shoot ANYONE who shouts ‘Allahu Akbar’ – rather than risk a terror attack . The phrase in Arabic for ‘God is greatest’ has been shouted in multiple terrorist incidents across the continent.<br> The Times reports that Italian mayor Luigi Brugnaro claimed that his city Venice was safer than Barcelona – where 14 people died being run down by a van last week.<br> Speaking at a conference in Rimini, north east Italy, he further revealed the extraordinary order he has given to armed police at one of the most popular tourist attractions in Europe. Brugnaro was applauded by delegates when he said: “In contrast with Barcelona, where they had not set up protection, we keep our guard up.<br> “If anyone runs into St Mark’s Square shouting ‘Allahu Akhbar’, we will take him down. A year ago I said within four paces, now within three. I will say it in Venetian: ‘Ghe Sparemo’ (We will shoot him).”</br></br></br></p></blockquote><p>This may mark the official beginning of Reconquista 2.0. Now, they’ll give the invaders a chance to behave and keep their mouths shut. It won’t be too terribly long before the policy will be to shoot on sight.<br> Cloudflare and Google should take note. THIS is what a sensible restriction on free speech looks like.<br> And this is a man who should be the next Prime Minister of Italy.<br> <i>“We also need a naval blockade against people coming into Italy from north Africa.”</i><br> – Luigi Brugnaro</br></br></br></br></p></div>",
  "content_text": "The Most Serene City\nis not screwing around\n:\nVenice’s right-wing mayor has ordered cops to shoot ANYONE who shouts ‘Allahu Akbar’ – rather than risk a terror attack . The phrase in Arabic for ‘God is greatest’ has been shouted in multiple terrorist incidents across the continent.\nThe Times reports that Italian mayor Luigi Brugnaro claimed that his city Venice was safer than Barcelona – where 14 people died being run down by a van last week.\nSpeaking at a conference in Rimini, north east Italy, he further revealed the extraordinary order he has given to armed police at one of the most popular tourist attractions in Europe. Brugnaro was applauded by delegates when he said: “In contrast with Barcelona, where they had not set up protection, we keep our guard up.\n“If anyone runs into St Mark’s Square shouting ‘Allahu Akhbar’, we will take him down. A year ago I said within four paces, now within three. I will say it in Venetian: ‘Ghe Sparemo’ (We will shoot him).”\nThis may mark the official beginning of Reconquista 2.0. Now, they’ll give the invaders a chance to behave and keep their mouths shut. It won’t be too terribly long before the policy will be to shoot on sight.\nCloudflare and Google should take note. THIS is what a sensible restriction on free speech looks like.\nAnd this is a man who should be the next Prime Minister of Italy.\n“We also need a naval blockade against people coming into Italy from north Africa.”\n– Luigi Brugnaro",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-24T12:00:00+00:00"
}