{
  "url": "https://voxday.net/2017/08/22/google-unvanishes-stats-prof/",
  "scraped_at": "2025-12-19T10:21:10.243126",
  "title": "Google unvanishes stats prof",
  "date_display": "August 22, 2017",
  "date_iso": "2017-08-22T18:00:00+00:00",
  "date_from_url": "2017-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zerohedge helped Salil Mehta get his email, blog, and other accounts back after they were <a href=\"http://www.zerohedge.com/news/2017-08-22/google-folds-restores-accounts-statistics-professor\">vanished by Google</a>.</p><blockquote><p>Yesterday we reported that in a shocking, and unexplained move, statistics professor Salil Mehta, adjunct professor at Columbia and Georgetown who teaches probability and data science and whose work has appeared on this website on numerous prior occasions, had been banned by Google on Friday, with his email, blog and other Google-linked accounts wiped clean and no longer accessible.<br> As we discussed yesterday, it was not clear what Salil did to provoke Google:<br> <i>On Friday afternoon East Coast Time by surprise, I was completely shut down in all my Google accounts (all of my gmail accounts, blog, all of my university pages that were on google sites, etc.) for no reason and no warning.  A number of us were stunned and unsure, but clearly we know at this point it wasn’t an accident.</i><br> As Salil explained, he had never engaged in political discourse, and his content was purely math/statistics-focused: “My background is clean, and without a political or social agenda.  I am not promoting any specific viewpoint.  I teach probability math and that’s it.  Have worked with both the Obama administration and advised on polling statistics for the Trump campaign, am an adjunct professor at three top universities, an editor of the peer-reviewed journal of the American Statistical Association, and wrote a best-selling statistics book (all the proceeds of which I gave to charity!)”<br> And yet, Salil’s attempts to get to the bottom of his purge were fruitless:<br> <i>I have followed their common “appeal” form but no response for three days.  Also connected with one of the VPs over the weekend and it still takes time until receiving this today!  Just more of a reflection of how cold a company can treat someone very poorly: without any information, and lack of ability to move forward in their life (can I get real reasons if any, can I get advance notice, can I get my contact list back from gmail, and why are university properties unrelated to my blog shut down?)</i><br> <i>We are going to be looking back on this time in Google’s history and those of other social media and know that they have done some very immoral and confusing things, and it has hurt their public reputation with decent people who wanted to grow into the next future with them.</i><br> Until yesterday, Google’s only response was a generic form statement it issues to every account that is “in violation of its Terms of Service.” That changed yesterday, because after our article detailing Salil’s plight went viral, and was read 300,000 times, Google responded and as of this morning, has restored all of Salil Metha’s accounts.</br></br></br></br></br></br></br></p></blockquote><p>That’s great and all, but the irony of someone being unvanished because he did NOT engage in any Constitutionally-protected political free speech is sizable indeed. Most people are not going to have the online might of Zerohedge behind them, or happen to be a politically unblemished minority professor who worked with the Obama administration, which means that most of us are beholden to the goodwill and commitment to Internet neutrality of the various social media giants.<br> Since these corporations are heavily converged, since SJWs always double down, and since the executives who are not themselves SJWs have repeatedly shown themselves to be too weak to stand up to much direct pressure from their internal SJWs, it is imperative that everyone who is to the right of Salil Metha have a backup plan <i>already in place and already implemented</i> starting <i>right now</i>. That means everything from email addresses, websites, and payment processors to ISPs and domain registry alternatives.<br> If you want to be accessible by our rapid response program and you are not VFM, you have four alternatives.</br></br></p><ol><li>Follow me on Twitter. This is the least preferable option since I anticipate a massive, multiplatform strike will be the next step after the surgical deplatformings and demonetizations prove ineffective. I am reliably informed that SJWs inside Twitter, Google, Facebook, and Paypal are already putting this plan together and are now working on figuring out how to sell it to the decision-makers at their respective corporations. Saner heads may prevail, in fact, they probably will prevail at Google and Paypal, since the executives there understand that further fracturing the Internet is not good for their future growth, but there are no guarantees, and as we know from our experience with Amazon, even a rogue strike or two by employees acting without permission or approval cannot be ruled out.</li><li>Follow me on Gab. This is safe, but not necessarily timely, particularly if you’re not already actively using Gab.</li><li><a href=\"http://www.milobookclub.com/2017/06/23/castalia-book-club/\">Sign up for the Book Club</a>. You’ll get 1-3 book announcements per month. This is the least disruptive option that ensures you are rapidly contacted.</li><li><a href=\"http://www.milobookclub.com/2017/07/09/meme-of-day/\">Sign up for the Daily Meme Wars</a>. You’ll get six emails per week, five with the Meme of the Day, and the sixth containing a summary and a poll to vote in the meme of the week. This is the option I’d prefer people to select, because #DailyMemeWars has proven to be increasingly effective social media artillery.</li></ol><div>You can, of course, do any combination of these or all four if you see fit. But the important thing is to do at least one of them. And remember, you can always reach me at my infogalactic email if my gmail address is vanished.</div></div>",
  "content_text": "Zerohedge helped Salil Mehta get his email, blog, and other accounts back after they were\nvanished by Google\n.\nYesterday we reported that in a shocking, and unexplained move, statistics professor Salil Mehta, adjunct professor at Columbia and Georgetown who teaches probability and data science and whose work has appeared on this website on numerous prior occasions, had been banned by Google on Friday, with his email, blog and other Google-linked accounts wiped clean and no longer accessible.\nAs we discussed yesterday, it was not clear what Salil did to provoke Google:\nOn Friday afternoon East Coast Time by surprise, I was completely shut down in all my Google accounts (all of my gmail accounts, blog, all of my university pages that were on google sites, etc.) for no reason and no warning.  A number of us were stunned and unsure, but clearly we know at this point it wasn’t an accident.\nAs Salil explained, he had never engaged in political discourse, and his content was purely math/statistics-focused: “My background is clean, and without a political or social agenda.  I am not promoting any specific viewpoint.  I teach probability math and that’s it.  Have worked with both the Obama administration and advised on polling statistics for the Trump campaign, am an adjunct professor at three top universities, an editor of the peer-reviewed journal of the American Statistical Association, and wrote a best-selling statistics book (all the proceeds of which I gave to charity!)”\nAnd yet, Salil’s attempts to get to the bottom of his purge were fruitless:\nI have followed their common “appeal” form but no response for three days.  Also connected with one of the VPs over the weekend and it still takes time until receiving this today!  Just more of a reflection of how cold a company can treat someone very poorly: without any information, and lack of ability to move forward in their life (can I get real reasons if any, can I get advance notice, can I get my contact list back from gmail, and why are university properties unrelated to my blog shut down?)\nWe are going to be looking back on this time in Google’s history and those of other social media and know that they have done some very immoral and confusing things, and it has hurt their public reputation with decent people who wanted to grow into the next future with them.\nUntil yesterday, Google’s only response was a generic form statement it issues to every account that is “in violation of its Terms of Service.” That changed yesterday, because after our article detailing Salil’s plight went viral, and was read 300,000 times, Google responded and as of this morning, has restored all of Salil Metha’s accounts.\nThat’s great and all, but the irony of someone being unvanished because he did NOT engage in any Constitutionally-protected political free speech is sizable indeed. Most people are not going to have the online might of Zerohedge behind them, or happen to be a politically unblemished minority professor who worked with the Obama administration, which means that most of us are beholden to the goodwill and commitment to Internet neutrality of the various social media giants.\nSince these corporations are heavily converged, since SJWs always double down, and since the executives who are not themselves SJWs have repeatedly shown themselves to be too weak to stand up to much direct pressure from their internal SJWs, it is imperative that everyone who is to the right of Salil Metha have a backup plan\nalready in place and already implemented\nstarting\nright now\n. That means everything from email addresses, websites, and payment processors to ISPs and domain registry alternatives.\nIf you want to be accessible by our rapid response program and you are not VFM, you have four alternatives.\nFollow me on Twitter. This is the least preferable option since I anticipate a massive, multiplatform strike will be the next step after the surgical deplatformings and demonetizations prove ineffective. I am reliably informed that SJWs inside Twitter, Google, Facebook, and Paypal are already putting this plan together and are now working on figuring out how to sell it to the decision-makers at their respective corporations. Saner heads may prevail, in fact, they probably will prevail at Google and Paypal, since the executives there understand that further fracturing the Internet is not good for their future growth, but there are no guarantees, and as we know from our experience with Amazon, even a rogue strike or two by employees acting without permission or approval cannot be ruled out.\nFollow me on Gab. This is safe, but not necessarily timely, particularly if you’re not already actively using Gab.\nSign up for the Book Club\n. You’ll get 1-3 book announcements per month. This is the least disruptive option that ensures you are rapidly contacted.\nSign up for the Daily Meme Wars\n. You’ll get six emails per week, five with the Meme of the Day, and the sixth containing a summary and a poll to vote in the meme of the week. This is the option I’d prefer people to select, because #DailyMemeWars has proven to be increasingly effective social media artillery.\nYou can, of course, do any combination of these or all four if you see fit. But the important thing is to do at least one of them. And remember, you can always reach me at my infogalactic email if my gmail address is vanished.",
  "tags": [
    "conspiracy",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-22T17:00:00+00:00"
}