{
  "url": "https://voxday.net/2017/08/08/google-takes-a-stand/",
  "scraped_at": "2025-12-18T07:25:49.152301",
  "title": "Google takes a stand",
  "date_display": "August 8, 2017",
  "date_iso": "2017-08-08T10:02:00+00:00",
  "date_from_url": "2017-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a bold move by Sundararajan. We’ll see how it works out for him. It was inevitable, because SJWs always double down, but the irony of Pichai Sundararajan, a high-caste Tamil Brahmin, <a href=\"http://uk.businessinsider.com/fired-google-employee-says-hes-exploring-all-possible-legal-remedies-2017-8?r=US&amp;IR=T\">firing an employee</a> for expressing his belief in biological inequality, is practically off the charts.</p><blockquote><p>Google has fired an employee who wrote an internal memo that ascribed gender inequality in the technology industry to biological differences. James Damore, the engineer who wrote the memo, confirmed his dismissal saying that he had been fired for “perpetuating gender stereotypes,” in an email to Reuters on Monday. Damore said he is exploring all possible legal remedies.</p></blockquote><p>As I observed after reading the Google CEO’s memo, Damore was doomed because Sundararajan had to mollify his insane SJW employee base, which right now is dancing and celebrating its own inevitable demise. Damore will be fine; he’s better off out of the SJW-converged madhouse and has already been offered jobs by Gab’s Andrew Torba and WikiLeaks’s Julian Assange. But Google will not be, because this is a clear signal to the key engineers in Search and AdWords that it is Time To Go.<br> DH, who is one of the Dread Ilk’s expert data guy’s, explains.</br></p><blockquote><p>All of Google is kept afloat by one thing only. Adwords. They have no other significant source of income after a decade or more of trying to diversify. Every other business is borderline trivial when compared to AdWords. All the moonshots have failed. All the R&amp;D has failed. It’s. All. AdWords.<br> The money-making core of Google is a tiny speck of its workforce, a tiny core of people who make AdWords work. The fear is not that 2/3 are SJWs, it’s that one or two or three of the key engineers, who are working on the next version of Search and Adwords, who are actively fighting and hardening against existential threats to the product, might walk, or even just do a slightly less great job.<br> Google is actually a very fragile company. They are ripe for disruption from a new player, or alternatively, to be drained from a few deep pocketed rivals. The entire bubble of online advertising stems from a belief that is often irrational that online advertising is effective at certain definitions of cost effectiveness.</br></br></p></blockquote><p>In other words, as the AdWords model fails, which is already happening, Google’s massive market cap is going to rapidly decline with it because all of its other businesses have failed to find traction. The company has observably entered the ideological death spiral that is the inevitable result of the Impossibility of Social Justice Convergence.</p></div>",
  "content_text": "It’s a bold move by Sundararajan. We’ll see how it works out for him. It was inevitable, because SJWs always double down, but the irony of Pichai Sundararajan, a high-caste Tamil Brahmin,\nfiring an employee\nfor expressing his belief in biological inequality, is practically off the charts.\nGoogle has fired an employee who wrote an internal memo that ascribed gender inequality in the technology industry to biological differences. James Damore, the engineer who wrote the memo, confirmed his dismissal saying that he had been fired for “perpetuating gender stereotypes,” in an email to Reuters on Monday. Damore said he is exploring all possible legal remedies.\nAs I observed after reading the Google CEO’s memo, Damore was doomed because Sundararajan had to mollify his insane SJW employee base, which right now is dancing and celebrating its own inevitable demise. Damore will be fine; he’s better off out of the SJW-converged madhouse and has already been offered jobs by Gab’s Andrew Torba and WikiLeaks’s Julian Assange. But Google will not be, because this is a clear signal to the key engineers in Search and AdWords that it is Time To Go.\nDH, who is one of the Dread Ilk’s expert data guy’s, explains.\nAll of Google is kept afloat by one thing only. Adwords. They have no other significant source of income after a decade or more of trying to diversify. Every other business is borderline trivial when compared to AdWords. All the moonshots have failed. All the R&D has failed. It’s. All. AdWords.\nThe money-making core of Google is a tiny speck of its workforce, a tiny core of people who make AdWords work. The fear is not that 2/3 are SJWs, it’s that one or two or three of the key engineers, who are working on the next version of Search and Adwords, who are actively fighting and hardening against existential threats to the product, might walk, or even just do a slightly less great job.\nGoogle is actually a very fragile company. They are ripe for disruption from a new player, or alternatively, to be drained from a few deep pocketed rivals. The entire bubble of online advertising stems from a belief that is often irrational that online advertising is effective at certain definitions of cost effectiveness.\nIn other words, as the AdWords model fails, which is already happening, Google’s massive market cap is going to rapidly decline with it because all of its other businesses have failed to find traction. The company has observably entered the ideological death spiral that is the inevitable result of the Impossibility of Social Justice Convergence.",
  "tags": [
    "#AltTech",
    "corpocracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-08T09:02:00+00:00"
}