{
  "url": "https://voxday.net/2017/08/09/google-has-feminism/",
  "scraped_at": "2025-12-18T07:26:05.564330",
  "title": "Google has feminism",
  "date_display": "August 9, 2017",
  "date_iso": "2017-08-09T21:37:00+00:00",
  "date_from_url": "2017-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And feminism is cancer. More inside information <a href=\"http://www.breitbart.com/tech/2017/08/09/rebels-of-google-management-verge-of-tears-trump-win/\">in Allum Bokhari’s latest</a> Rebels of Google series:</p><blockquote><p>“The worst part isn’t the ‘diversity.’” says Gordon “It’s the “inclusion” – the banner under which they justify dangerous pseudosciences like unconscious bias and microaggressions, and try to make them company policy.”<br> Ideological conformity at Google, says Gordon, is “far worse” than James Damore’s viewpoint diversity memo indicates.<br> “Google is run like a religious cult. Conform and carry out the rituals, and you’ll be rewarded and praised; ask any uncomfortable questions or offend the wrong people, and the threats and public shaming will be swift and ruthless. The religion in this case is a kind of intersectional feminism, its central tenets are Diversity and Inclusion, its demonic enemy is Bias, and its purifying rituals include humiliating forms of “training” that resemble Maoist struggle sessions.”<br> “This might sound crazy to a lot of your readers, but college students should understand, since it’s a similar culture.”<br> According to Gordon, efforts to terrorize employees over identity politics come from both managers and rank-and-file Googlers.<br> “The agitation ranges from very subtle (“it’s not OK,” “we cannot stand for this,” “these are shitty opinions”) to quite overt (“this is violently offensive,” “I will not tolerate,” “I could not in good conscience assign anyone to work with you”).”<br> “I’ve seen around 20-30 managers agitating this way, each of whom is in charge of anywhere from a few dozen to over a thousand employees. There are some very high-level people who consider the progressive agenda to be more important than the success and mental health of their teams.”<br> “I can’t categorically say that it goes up to “the very top”. However, as you now already know from James’s unceremoniously quick firing, the top brass are either sympathetic to or afraid of the mob.”</br></br></br></br></br></br></br></p></blockquote><p> </p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DG0HfkXXsAEqDH6.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"350\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DG0HfkXXsAEqDH6.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"350\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DG0HfkXXsAEqDH6.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20350%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "And feminism is cancer. More inside information\nin Allum Bokhari’s latest\nRebels of Google series:\n“The worst part isn’t the ‘diversity.’” says Gordon “It’s the “inclusion” – the banner under which they justify dangerous pseudosciences like unconscious bias and microaggressions, and try to make them company policy.”\nIdeological conformity at Google, says Gordon, is “far worse” than James Damore’s viewpoint diversity memo indicates.\n“Google is run like a religious cult. Conform and carry out the rituals, and you’ll be rewarded and praised; ask any uncomfortable questions or offend the wrong people, and the threats and public shaming will be swift and ruthless. The religion in this case is a kind of intersectional feminism, its central tenets are Diversity and Inclusion, its demonic enemy is Bias, and its purifying rituals include humiliating forms of “training” that resemble Maoist struggle sessions.”\n“This might sound crazy to a lot of your readers, but college students should understand, since it’s a similar culture.”\nAccording to Gordon, efforts to terrorize employees over identity politics come from both managers and rank-and-file Googlers.\n“The agitation ranges from very subtle (“it’s not OK,” “we cannot stand for this,” “these are shitty opinions”) to quite overt (“this is violently offensive,” “I will not tolerate,” “I could not in good conscience assign anyone to work with you”).”\n“I’ve seen around 20-30 managers agitating this way, each of whom is in charge of anywhere from a few dozen to over a thousand employees. There are some very high-level people who consider the progressive agenda to be more important than the success and mental health of their teams.”\n“I can’t categorically say that it goes up to “the very top”. However, as you now already know from James’s unceremoniously quick firing, the top brass are either sympathetic to or afraid of the mob.”",
  "tags": [
    "corpocracy",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-09T20:37:00+00:00"
}