{
  "url": "https://voxday.net/2017/08/08/history-and-the-limits-of-sjw-dishonesty/",
  "scraped_at": "2025-12-18T07:25:52.800523",
  "title": "History and the limits of SJW dishonesty",
  "date_display": "August 8, 2017",
  "date_iso": "2017-08-08T16:00:00+00:00",
  "date_from_url": "2017-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t bother looking for the limits of SJW stupidity or dishonesty. You will not find them. In an astonishingly inept attempt to defend the BBC and “historian” Mary Beard, one English SJW actually put forward the following defense, accompanied by a screenshot.<br> Dave Tooke‏ @burstdrum<br> <i>I answered your question. Even though it was a straw man. No one ever said mixed race families were typical (majority) of Roman Britain.</i><br> Dave Tooke‏ @burstdrum<br> <i>The BBC cartoon did not say “typical”. It merely suggested one such family as possible. Which it was.</i><br> This was the screenshot attached to the second tweet.</br></br></br></br></br></p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DGtO50zXYAILshi.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"454\" data-original-width=\"583\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DGtO50zXYAILshi.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"454\" data-original-width=\"583\" data-src=\"https://pbs.twimg.com/media/DGtO50zXYAILshi.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20583%20454%22%3E%3C/svg%3E\"/></a></div><p>In fairness, the SJW was undermined by the dishonesty of the BBC, which is the more significant aspect of this little story. You see, <a href=\"https://archive.fo/WiaiY\">this was how the video was described</a> 5 days ago, before BBC “historian” Mary Beard tried to school Paul Joseph Watson and was caught bullshitting by NN Taleb. Emphasis added.<br> <a href=\"https://archive.fo/WiaiY\">Original BBC Two description</a><br> <i>Life in Roman Britain is shown through the eyes of <b>a typical family </b>nearly 2000 years ago. The Romans bring towns to Britain, and also roads, forts, and Hadrian’s Wall, to keep out the Picts. The father is supervising the building of Hadrian’s Wall, while the son manages to lose his father’s special military scarf, or focale. This incident is used to explore Roman beliefs and religion, food and entertainment.</i><br> <a href=\"https://t.co/ByaDBGBLkx\"><br> </br></a><a href=\"https://t.co/ByaDBGBLkx\">Current BBC Two description</a><br> <i>Life in Roman Britain as seen through the eyes of <b>one family</b> nearly 2000 years ago. The Romans bring towns to Britain, and also roads, forts, and Hadrian’s Wall, to keep out the Picts. The father is supervising the building of Hadrian’s Wall, while his son manages to lose his father’s special military scarf, or focale. This incident is used to explore Roman beliefs and religion.</i><br> You see, with SJWs, it’s Fake News and Fake History all the way down. You can NEVER trust anything they say. Because – all together now – SJWS ALWAYS LIE.</br></br></br></br></br></p></div>",
  "content_text": "Don’t bother looking for the limits of SJW stupidity or dishonesty. You will not find them. In an astonishingly inept attempt to defend the BBC and “historian” Mary Beard, one English SJW actually put forward the following defense, accompanied by a screenshot.\nDave Tooke‏ @burstdrum\nI answered your question. Even though it was a straw man. No one ever said mixed race families were typical (majority) of Roman Britain.\nDave Tooke‏ @burstdrum\nThe BBC cartoon did not say “typical”. It merely suggested one such family as possible. Which it was.\nThis was the screenshot attached to the second tweet.\nIn fairness, the SJW was undermined by the dishonesty of the BBC, which is the more significant aspect of this little story. You see,\nthis was how the video was described\n5 days ago, before BBC “historian” Mary Beard tried to school Paul Joseph Watson and was caught bullshitting by NN Taleb. Emphasis added.\nOriginal BBC Two description\nLife in Roman Britain is shown through the eyes of\na typical family\nnearly 2000 years ago. The Romans bring towns to Britain, and also roads, forts, and Hadrian’s Wall, to keep out the Picts. The father is supervising the building of Hadrian’s Wall, while the son manages to lose his father’s special military scarf, or focale. This incident is used to explore Roman beliefs and religion, food and entertainment.\nCurrent BBC Two description\nLife in Roman Britain as seen through the eyes of\none family\nnearly 2000 years ago. The Romans bring towns to Britain, and also roads, forts, and Hadrian’s Wall, to keep out the Picts. The father is supervising the building of Hadrian’s Wall, while his son manages to lose his father’s special military scarf, or focale. This incident is used to explore Roman beliefs and religion.\nYou see, with SJWs, it’s Fake News and Fake History all the way down. You can NEVER trust anything they say. Because – all together now – SJWS ALWAYS LIE.",
  "tags": [
    "history",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-08T15:00:00+00:00"
}