{
  "url": "https://voxday.net/2017/08/28/how-sjws-react-to-defeat/",
  "scraped_at": "2025-12-19T10:21:48.953851",
  "title": "How SJWs react to defeat",
  "date_display": "August 28, 2017",
  "date_iso": "2017-08-28T17:22:00+00:00",
  "date_from_url": "2017-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An attempt to converge Node.js was successfully beaten back. But the SJWs who attacked it <a href=\"http://www.zdnet.com/article/after-governance-breakdown-node-js-leaders-fight-for-its-survival/\">aren’t giving up</a>.</p><blockquote><p>After years of battling a string of systematic failures of governance and leadership, the Node.js community, one of the largest collectives of software developers on the internet, reached a breaking point.<br> Node.js steers the ship for the powerful open-source web technology. It’s relied on by dozens of Fortune 500 companies, like Microsoft, Netflix, and PayPal, for their critical infrastructure and core operations.<br> Its stable governance isn’t just necessary for the businesses that rely on it, but also the core community that develops and advanced the widely-used technology.<br> But Monday saw a stream of resignations, one after the other throughout the day from Node.js’ technical steering committee (TSC), a group that manages the day-to-day governance for the Node.js project. A third of the committee had quit their positions by the end of the day, including its first woman member. Three of the resigned members said they will stay on the core technical committee (CTC), which oversees the project’s core collaborators and code contributors. One person has left the project entirely….<br> The community’s reliance on a code of conduct acts as the de facto HR department for the project, which lets participants and members contribute while treating others with respect. It’s meant to ensure a workplace free from harassment and unacceptable behavior, while promoting sharing of ideas in a constructive way, and to foster community growth.<br> But that code of conduct, as Kapke pointed out, doesn’t allow the stifling of free speech or marginalizing of people’s views or opinions that might be disagreed with. It’s designed to bring together a diverse range of people from different cultures, beliefs, genders, and backgrounds from across the world to work on a project and be treated fairly — a core value of any global collaborative open source project.<br> “There’s better value in having diversity than having some individual have the free speech that would work against others,” he said.<br> That toxic culture in Node.js’ governance has led to an inclusivity problem.<br> Williams’ began an inclusivity group of about a dozen people, an initiative aimed at ensuring fairness for everyone who wants to contribute to the community. The group eventually disbanded, accusing the leadership of “continued derailment” and opposition to proposals that the group argued would make the community more cohesive.<br> All the women and non-binary people left the group, as did several men, following the disbandment last August. Many have decided to leave the Node.js community altogether.<br> “Driving away contributors can be fatal in the open source world where most developers are essentially using their free time and volunteering to contribute,” said Rudolf Olah, a web developer, in a blog post. “It is already difficult enough to attract contributors to smaller projects, and larger projects, such as Node.js, need to be careful to make all contributors feel welcome,” he said.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Note that they left the “inclusivity group” immediately after their attempt to unseat a former director from the steering committe failed. Now they’re switching tactics, attempting to create pressure from outside, while at the same time trying – again – to fork the project.</p><blockquote><p>Moments after the failed leadership vote, Kat Marchán pushed the button that created Ayo.js, a new open-source project forked from Node.js. Ayo.js — a hat-tip to the Io.js (pronounced the same) project that forked from Node.js three years ago over a similar disenchantment over the software’s stewardship under its founding company Joyent — was born this week.<br> Days old, it’s already got a dozen developers and over a hundred people involved on the project’s chat platform, said Marchán.</br></p></blockquote><p>Of course, the SJW fork is going to fail – again – because people who are diverse and inclusive aren’t capable of running projects without the straight white males they disdain. If they could, they wouldn’t have to use codes of conduct, inclusivity groups, and trust &amp; safety councils to take over existing projects.<br> The steering committee really needs to clean house and encourage all the SJWs to move over to the fork as quickly as possible.</br></p></div>",
  "content_text": "An attempt to converge Node.js was successfully beaten back. But the SJWs who attacked it\naren’t giving up\n.\nAfter years of battling a string of systematic failures of governance and leadership, the Node.js community, one of the largest collectives of software developers on the internet, reached a breaking point.\nNode.js steers the ship for the powerful open-source web technology. It’s relied on by dozens of Fortune 500 companies, like Microsoft, Netflix, and PayPal, for their critical infrastructure and core operations.\nIts stable governance isn’t just necessary for the businesses that rely on it, but also the core community that develops and advanced the widely-used technology.\nBut Monday saw a stream of resignations, one after the other throughout the day from Node.js’ technical steering committee (TSC), a group that manages the day-to-day governance for the Node.js project. A third of the committee had quit their positions by the end of the day, including its first woman member. Three of the resigned members said they will stay on the core technical committee (CTC), which oversees the project’s core collaborators and code contributors. One person has left the project entirely….\nThe community’s reliance on a code of conduct acts as the de facto HR department for the project, which lets participants and members contribute while treating others with respect. It’s meant to ensure a workplace free from harassment and unacceptable behavior, while promoting sharing of ideas in a constructive way, and to foster community growth.\nBut that code of conduct, as Kapke pointed out, doesn’t allow the stifling of free speech or marginalizing of people’s views or opinions that might be disagreed with. It’s designed to bring together a diverse range of people from different cultures, beliefs, genders, and backgrounds from across the world to work on a project and be treated fairly — a core value of any global collaborative open source project.\n“There’s better value in having diversity than having some individual have the free speech that would work against others,” he said.\nThat toxic culture in Node.js’ governance has led to an inclusivity problem.\nWilliams’ began an inclusivity group of about a dozen people, an initiative aimed at ensuring fairness for everyone who wants to contribute to the community. The group eventually disbanded, accusing the leadership of “continued derailment” and opposition to proposals that the group argued would make the community more cohesive.\nAll the women and non-binary people left the group, as did several men, following the disbandment last August. Many have decided to leave the Node.js community altogether.\n“Driving away contributors can be fatal in the open source world where most developers are essentially using their free time and volunteering to contribute,” said Rudolf Olah, a web developer, in a blog post. “It is already difficult enough to attract contributors to smaller projects, and larger projects, such as Node.js, need to be careful to make all contributors feel welcome,” he said.\nNote that they left the “inclusivity group” immediately after their attempt to unseat a former director from the steering committe failed. Now they’re switching tactics, attempting to create pressure from outside, while at the same time trying – again – to fork the project.\nMoments after the failed leadership vote, Kat Marchán pushed the button that created Ayo.js, a new open-source project forked from Node.js. Ayo.js — a hat-tip to the Io.js (pronounced the same) project that forked from Node.js three years ago over a similar disenchantment over the software’s stewardship under its founding company Joyent — was born this week.\nDays old, it’s already got a dozen developers and over a hundred people involved on the project’s chat platform, said Marchán.\nOf course, the SJW fork is going to fail – again – because people who are diverse and inclusive aren’t capable of running projects without the straight white males they disdain. If they could, they wouldn’t have to use codes of conduct, inclusivity groups, and trust & safety councils to take over existing projects.\nThe steering committee really needs to clean house and encourage all the SJWs to move over to the fork as quickly as possible.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-28T16:22:00+00:00"
}