{
  "url": "https://voxday.net/2017/08/09/imposters-at-google/",
  "scraped_at": "2025-12-18T07:26:01.900041",
  "title": "Imposters at Google",
  "date_display": "August 9, 2017",
  "date_iso": "2017-08-09T16:00:00+00:00",
  "date_from_url": "2017-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CG has a theory:</p><blockquote><p>Mr. Damore has managed to spark the largest inflammation of Impostor Anxiety in recorded history.<br> Impostor Anxiety is not Impostor Syndrome as the Syndrome is associated with failure to recognize actual achievements while those suffering from IA are aware of their diminished ability relative to those around them,<br> They do not suffer from Dunning–Kruger though it may appear so from the outside sometimes. They are knowingly hiding behind a futile “fake it till you make it” facade that can sometimes carry them so long as resources remain flush.<br> Sufferers will sometimes mask over their Impostor Anxiety by trying to claim that they suffer from Imposter Syndrome. However this is self defeating as it only amplifies their anxiety due to knowing that at least some people around them know their true skill level, even others who also suffer from Impostor Anxiety and see through the charade.</br></br></br></p></blockquote><p>It makes sense. Just as AA beneficiaries know that they do not merit their places at the universities where they find themselves intellectually overmatched, tens of thousands of the more-recent hires at Google are perfectly aware that they would not have been good enough to get a job there just a few years ago.<br> James Damore has unmasked them for the inferior employees that they are, which is why they are both panicked and furious.</br></p></div>",
  "content_text": "CG has a theory:\nMr. Damore has managed to spark the largest inflammation of Impostor Anxiety in recorded history.\nImpostor Anxiety is not Impostor Syndrome as the Syndrome is associated with failure to recognize actual achievements while those suffering from IA are aware of their diminished ability relative to those around them,\nThey do not suffer from Dunning–Kruger though it may appear so from the outside sometimes. They are knowingly hiding behind a futile “fake it till you make it” facade that can sometimes carry them so long as resources remain flush.\nSufferers will sometimes mask over their Impostor Anxiety by trying to claim that they suffer from Imposter Syndrome. However this is self defeating as it only amplifies their anxiety due to knowing that at least some people around them know their true skill level, even others who also suffer from Impostor Anxiety and see through the charade.\nIt makes sense. Just as AA beneficiaries know that they do not merit their places at the universities where they find themselves intellectually overmatched, tens of thousands of the more-recent hires at Google are perfectly aware that they would not have been good enough to get a job there just a few years ago.\nJames Damore has unmasked them for the inferior employees that they are, which is why they are both panicked and furious.",
  "tags": [
    "corpocracy",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-09T15:00:00+00:00"
}