{
  "url": "https://voxday.net/2017/08/09/in-defense-of-the-dark-lord/",
  "scraped_at": "2025-12-18T07:25:54.617387",
  "title": "In defense of the dark lord",
  "date_display": "August 9, 2017",
  "date_iso": "2017-08-09T00:16:00+00:00",
  "date_from_url": "2017-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright reminds everyone that <a href=\"http://www.scifiwright.com/2017/08/in-praise-of-beale-2/\">we are on the same side</a>:</p><blockquote><p>In any case, I wanted to take the opportunity to calm frazzled nerves, and to emphasize in how few matters Vox Day and I disagree.<br> First, we both voted for Chuck Tingle for a Hugo Award. Love is real!<br> Second, we both support a permanent ban on further immigration into the United States, but would settle reluctantly for a fifty year ban. We both would prefer immigrants, if they must come, to be from civilized nations, and persons who clearly offer more to the nation than the likely burden their coming imposes.<br> Third, we both believe Mohammedanism is incompatible with Western Civilization. Koranic Law allows neither for the Rights of Man nor any republican form of government.<br> Fourth, neither of us believes coerced integration of the races is desirable nor possible. There is nothing wrong with a man seeking out his own kind.<br> Fifth, we both regard the ‘open borders’ and ‘New World Order’ and ‘One World Government’ type talk as treason against the United States and against the West.<br> Sixth, we both think feminism is cancer. Woman are happier and society is healthier when brides are young, and families are large.<br> Seventh, we both reject the strategy embraced by GOP politicos and pundits that noble defeat is better than crass victory. The Culture War is real, it is a war, and our side has suffered decades of humiliating defeats. A gentleman does not use the Marquis of Queensbury rules with a guttersnipe, a cur, a blackguard, or when facing a mob.<br> Eighth, we both call Western Civilization, the legacy of the Christian religion, Roman law, and Greek philosophy, the peak of human glory. It is worth defending; indeed, it is the only thing on this world worth defending. Everything else is cruelty, fatalism, superstition, and injustice.<br> Ninth, we are both nationalist, and both anti-globalist: there is no moral wrong with a nation existing nor with a nation prioritizing its own interests.<br> Tenth, he and I both believe that every race, nation, people, tongue and tribe has its own unique strengths and weaknesses, and possesses the sovereign right to dwell unmolested in the native culture it prefers. We both reject the subjugation of one ethnic group by another.<br> Eleventh, he and I hold similar views on war: imposing democracy by force, or imposing conversion by the edge of the sword, is both cruel and foolish.<br> Finally, he and I are both Christians, which means, we are both beloved sons of God living in a universe whose Creator has fashioned objective laws of logic, objective imperatives of morality, objective standards of truth and beauty, and also fashioned the human soul to crave and seek and be able to find these things.<br> The insane atheist world of moral subjectivism and cultural relativism, of deconstruction, postmodernism, and nihilism, he and I both see to be the work of darkness.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>For my part, I do not concern myself in the slightest with what John thinks. As with Martin van Creveld and Steve Keen, he is one of those rare talents who is to be cherished for that talent alone; everything else is noonday shadows in comparison.<br> And don’t forget, John showed himself to be loyal even before we were acquainted. As writer and editor, we know each other in a manner that is uniquely, and and at times even alarmingly, intimate. It’s hard to describe to someone who is not a novelist, but to write fiction is, to a certain extent, to bare the soul, especially to those who know how to read deeply and see the individual revealed in the textual creation.<br> John is a better man than I am. I admire and respect him, and not only for his incredible literary talent. I do not expect anyone to agree with me about all things, indeed, I do not know anyone who does, including myself from only a few years ago. Remember: the man who is a failure always manages to find disagreement with others, but the man who is successful will always find a way to find common ground with his friends and allies.</br></br></p></div>",
  "content_text": "John C. Wright reminds everyone that\nwe are on the same side\n:\nIn any case, I wanted to take the opportunity to calm frazzled nerves, and to emphasize in how few matters Vox Day and I disagree.\nFirst, we both voted for Chuck Tingle for a Hugo Award. Love is real!\nSecond, we both support a permanent ban on further immigration into the United States, but would settle reluctantly for a fifty year ban. We both would prefer immigrants, if they must come, to be from civilized nations, and persons who clearly offer more to the nation than the likely burden their coming imposes.\nThird, we both believe Mohammedanism is incompatible with Western Civilization. Koranic Law allows neither for the Rights of Man nor any republican form of government.\nFourth, neither of us believes coerced integration of the races is desirable nor possible. There is nothing wrong with a man seeking out his own kind.\nFifth, we both regard the ‘open borders’ and ‘New World Order’ and ‘One World Government’ type talk as treason against the United States and against the West.\nSixth, we both think feminism is cancer. Woman are happier and society is healthier when brides are young, and families are large.\nSeventh, we both reject the strategy embraced by GOP politicos and pundits that noble defeat is better than crass victory. The Culture War is real, it is a war, and our side has suffered decades of humiliating defeats. A gentleman does not use the Marquis of Queensbury rules with a guttersnipe, a cur, a blackguard, or when facing a mob.\nEighth, we both call Western Civilization, the legacy of the Christian religion, Roman law, and Greek philosophy, the peak of human glory. It is worth defending; indeed, it is the only thing on this world worth defending. Everything else is cruelty, fatalism, superstition, and injustice.\nNinth, we are both nationalist, and both anti-globalist: there is no moral wrong with a nation existing nor with a nation prioritizing its own interests.\nTenth, he and I both believe that every race, nation, people, tongue and tribe has its own unique strengths and weaknesses, and possesses the sovereign right to dwell unmolested in the native culture it prefers. We both reject the subjugation of one ethnic group by another.\nEleventh, he and I hold similar views on war: imposing democracy by force, or imposing conversion by the edge of the sword, is both cruel and foolish.\nFinally, he and I are both Christians, which means, we are both beloved sons of God living in a universe whose Creator has fashioned objective laws of logic, objective imperatives of morality, objective standards of truth and beauty, and also fashioned the human soul to crave and seek and be able to find these things.\nThe insane atheist world of moral subjectivism and cultural relativism, of deconstruction, postmodernism, and nihilism, he and I both see to be the work of darkness.\nFor my part, I do not concern myself in the slightest with what John thinks. As with Martin van Creveld and Steve Keen, he is one of those rare talents who is to be cherished for that talent alone; everything else is noonday shadows in comparison.\nAnd don’t forget, John showed himself to be loyal even before we were acquainted. As writer and editor, we know each other in a manner that is uniquely, and and at times even alarmingly, intimate. It’s hard to describe to someone who is not a novelist, but to write fiction is, to a certain extent, to bare the soul, especially to those who know how to read deeply and see the individual revealed in the textual creation.\nJohn is a better man than I am. I admire and respect him, and not only for his incredible literary talent. I do not expect anyone to agree with me about all things, indeed, I do not know anyone who does, including myself from only a few years ago. Remember: the man who is a failure always manages to find disagreement with others, but the man who is successful will always find a way to find common ground with his friends and allies.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-08T23:16:00+00:00"
}