{
  "url": "https://voxday.net/2017/08/06/iq-exaggeration-and-overrepresentation/",
  "scraped_at": "2025-12-18T07:25:33.051432",
  "title": "IQ, exaggeration, and overrepresentation",
  "date_display": "August 6, 2017",
  "date_iso": "2017-08-06T13:01:00+00:00",
  "date_from_url": "2017-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> Sargon‏ @Sargon_of_Akkad<br> Has the alt right come to terms with the fact the Jews are just better than they are?</br></p><p>Greg Matusow @gregmatusow<br> sounds like something a jew would say</br></p><p>Sargon‏ @Sargon_of_Akkad<br> Sounds like something a race realist who depends on IQ scores to say, you mean.</br></p><p>Supreme Dark Lord‏ @voxday<br> Your metric is incorrect, Sargon. First, there are 48 high-IQ Han, 11 high-IQ Europeans, and 5 high-IQ Japanese for every high-IQ Jew.</br></p><p>Sargon‏ @Sargon_of_Akkad<br> Of course, but that’s only because of population size.</br></p><p>Supreme Dark Lord‏ @voxday<br> Obviously. But you cannot claim they are not overrepresented in X because intelligent when there are 64 more intelligent non-Jews per Jew.</br></p><p>Supreme Dark Lord‏ @voxday<br> Second, average Jewish IQ is only 98, not 115.<br> Israel IQ = 95<br> Arab IQ (22.7%) = 84<br> Jewish IQ (77.3%) = 98</br></br></br></br></p></blockquote><p>Now, it occurred to me that while I knew the oft-heard claim of a 115 average IQ for Jews was a misleading substitution of a subset for the set, and I had also observed that the claim was almost certainly an exaggeration in light of the average Israeli IQ of 95, I’d never actually run the numbers. The first thing was to update the population percentages according to the latest Israeli demographics, which currently has the Jewish population at 75 percent and the non-Jewish population at 25 percent.</p><p>This resulted in an average Israeli Jewish population IQ of 98.7 percent, slightly higher than my original calculation. Now, the Ashkenazi are 47.5 percent of the Israeli Jewish population, which means that if their average IQ is 115, the <i>majority </i>of the Jewish population of Israel has an average IQ of only 83.7, which is TWO standard deviations lower, and is also lower than the average IQs of Jordan, Syria, Saudi Arabia, and Pakistan, as well as Nigeria, Uganda, and the Israeli-Arab population.</p><p>Does that strike you as likely? No, me neither.</p><p>There is one Israeli study that found the difference between Ashkenazi and non-Ashkenazi Jews in Israel to be 14 points. This would indicate an average Ashkenazi IQ of 106 and a non-Ashkenazi IQ of 92. This is considerably more credible, especially since it also happens to align with a number of studies on Ashkenazi IQ. Given that 74 percent of the global Jewish population is Ashkenazim, that means that the average Jewish IQ is 102.4.</p><p>So, average Jewish IQ is not particularly high, but is slightly higher than the European average, and considerably higher than the current US average, which I calculate to be around 95 and falling. Which, of course, is why high average intelligence is an inadequate explanation for the historical Jewish success in 20th-century America, as their level of comparative success is declining even as the IQ delta grows.</p></div>",
  "content_text": "Sargon‏ @Sargon_of_Akkad\nHas the alt right come to terms with the fact the Jews are just better than they are?\nGreg Matusow @gregmatusow\nsounds like something a jew would say\nSargon‏ @Sargon_of_Akkad\nSounds like something a race realist who depends on IQ scores to say, you mean.\nSupreme Dark Lord‏ @voxday\nYour metric is incorrect, Sargon. First, there are 48 high-IQ Han, 11 high-IQ Europeans, and 5 high-IQ Japanese for every high-IQ Jew.\nSargon‏ @Sargon_of_Akkad\nOf course, but that’s only because of population size.\nSupreme Dark Lord‏ @voxday\nObviously. But you cannot claim they are not overrepresented in X because intelligent when there are 64 more intelligent non-Jews per Jew.\nSupreme Dark Lord‏ @voxday\nSecond, average Jewish IQ is only 98, not 115.\nIsrael IQ = 95\nArab IQ (22.7%) = 84\nJewish IQ (77.3%) = 98\nNow, it occurred to me that while I knew the oft-heard claim of a 115 average IQ for Jews was a misleading substitution of a subset for the set, and I had also observed that the claim was almost certainly an exaggeration in light of the average Israeli IQ of 95, I’d never actually run the numbers. The first thing was to update the population percentages according to the latest Israeli demographics, which currently has the Jewish population at 75 percent and the non-Jewish population at 25 percent.\nThis resulted in an average Israeli Jewish population IQ of 98.7 percent, slightly higher than my original calculation. Now, the Ashkenazi are 47.5 percent of the Israeli Jewish population, which means that if their average IQ is 115, the\nmajority\nof the Jewish population of Israel has an average IQ of only 83.7, which is TWO standard deviations lower, and is also lower than the average IQs of Jordan, Syria, Saudi Arabia, and Pakistan, as well as Nigeria, Uganda, and the Israeli-Arab population.\nDoes that strike you as likely? No, me neither.\nThere is one Israeli study that found the difference between Ashkenazi and non-Ashkenazi Jews in Israel to be 14 points. This would indicate an average Ashkenazi IQ of 106 and a non-Ashkenazi IQ of 92. This is considerably more credible, especially since it also happens to align with a number of studies on Ashkenazi IQ. Given that 74 percent of the global Jewish population is Ashkenazim, that means that the average Jewish IQ is 102.4.\nSo, average Jewish IQ is not particularly high, but is slightly higher than the European average, and considerably higher than the current US average, which I calculate to be around 95 and falling. Which, of course, is why high average intelligence is an inadequate explanation for the historical Jewish success in 20th-century America, as their level of comparative success is declining even as the IQ delta grows.",
  "tags": [
    "science",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-06T12:01:00+00:00"
}