{
  "url": "https://voxday.net/2017/08/28/it-appears-diplomacy-failed/",
  "scraped_at": "2025-12-19T10:21:50.514946",
  "title": "It appears diplomacy failed",
  "date_display": "August 28, 2017",
  "date_iso": "2017-08-28T23:40:00+00:00",
  "date_from_url": "2017-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>North Korea <a href=\"http://www.dailymail.co.uk/news/article-4831230/North-Korea-launches-missile-Japan.html\">fires a missile</a> over Japan:</p><blockquote><p>North Korea has fired a missile that passed over northern Japan today. The government’s J-Alert text message warning system advised people in the area to take precautions and move to a ‘sturdy building or basement’.<br> The Japanese military did not attempt to shoot down the missile, which passed over Japanese territory around 6.06am local time. It broke into three pieces off the coast of Hokkaido and landed in the Pacific Ocean, around 700 miles east of Cape Erimo, after travelling 1,700m in eight minutes. It is the first time North Korea has fired a projectile over Japan since 2009.<br> The launch, from Pyongyang, comes after Seoul’s National Intelligence Service (NIS) told South Korean lawmakers at a closed door parliamentary session that it has detected signs of the secretive state preparing for another nuclear test at its Punggye-ri underground test site.</br></br></p></blockquote><p>How fortunate that the USA has pledged to send more troops to Afghanistan. That should totally help, especially given the fact that the Navy is on stand-down due to its demonstrated inability to avoid deadly, high-speed cargo ships.</p></div>",
  "content_text": "North Korea\nfires a missile\nover Japan:\nNorth Korea has fired a missile that passed over northern Japan today. The government’s J-Alert text message warning system advised people in the area to take precautions and move to a ‘sturdy building or basement’.\nThe Japanese military did not attempt to shoot down the missile, which passed over Japanese territory around 6.06am local time. It broke into three pieces off the coast of Hokkaido and landed in the Pacific Ocean, around 700 miles east of Cape Erimo, after travelling 1,700m in eight minutes. It is the first time North Korea has fired a projectile over Japan since 2009.\nThe launch, from Pyongyang, comes after Seoul’s National Intelligence Service (NIS) told South Korean lawmakers at a closed door parliamentary session that it has detected signs of the secretive state preparing for another nuclear test at its Punggye-ri underground test site.\nHow fortunate that the USA has pledged to send more troops to Afghanistan. That should totally help, especially given the fact that the Navy is on stand-down due to its demonstrated inability to avoid deadly, high-speed cargo ships.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-28T22:40:00+00:00"
}