{
  "url": "https://voxday.net/2017/08/13/its-too-late-liberals/",
  "scraped_at": "2025-12-19T10:20:06.452125",
  "title": "It’s too late, liberals",
  "date_display": "August 13, 2017",
  "date_iso": "2017-08-13T14:23:00+00:00",
  "date_from_url": "2017-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>White liberals <a href=\"https://archive.fo/y3UEO\">are beginning to realize</a> that Diversity doesn’t care about their ideology, but fully intends to devour them too:</p><blockquote><p>I’m a white man, so you should listen to absolutely nothing I say, at least on matters of social justice. I have no standing. No way to relate. My color and gender nullify me, and it gets worse: I grew up in the suburbs. Dad made six figures. We had a backyard pool. From the 10th through 12th grades, I attended private school. So the only proper way for me to check my privilege is to realize that it blinds me to others’ struggles and should gag me during discussions about the right responses to them.<br> But wait. I’m gay. And I mean gay from a different, darker day. In that pool and at that school, I sometimes quaked inside, fearful of what my future held. Back then — the 1970s — gay stereotypes went unchallenged, gay jokes drew hearty laughter and exponentially more Americans were closeted than out. We conducted our lives in whispers. Then AIDS spread, and we wore scarlet letters as we marched into the public square to plead with President Ronald Reagan for help. Our rallying cry, “silence = death,” defined marginalization as well as any words could.<br> So where does that leave me? Who does that make me? Oppressor or oppressed? Villain or victim? And does my legitimacy hinge on the answer?<br> To listen to some of the guardians of purity on the left, yes….<br> At the beginning of this column I shared the sorts of personal details that register most strongly with those Americans who tuck each of us into some hierarchy of blessedness and affliction. So you know some important things about me, but not the most important ones: how I responded to the random challenges on my path, who I met along the way, what I learned from them, the degree of curiosity I mustered and the values that I honed as a result.<br> Those construct my character, and shape my voice, to be embraced or dismissed on its own merits. My gayness no more redeems me than my whiteness disqualifies me. And neither, I hope, defines me.</br></br></br></br></br></p></blockquote><p>They rode the tiger. They used the tiger to attack their ideological enemies. Now the tiger is devouring them, and they still don’t have the discernment to identify the enemy or the courage to fight it.</p></div>",
  "content_text": "White liberals\nare beginning to realize\nthat Diversity doesn’t care about their ideology, but fully intends to devour them too:\nI’m a white man, so you should listen to absolutely nothing I say, at least on matters of social justice. I have no standing. No way to relate. My color and gender nullify me, and it gets worse: I grew up in the suburbs. Dad made six figures. We had a backyard pool. From the 10th through 12th grades, I attended private school. So the only proper way for me to check my privilege is to realize that it blinds me to others’ struggles and should gag me during discussions about the right responses to them.\nBut wait. I’m gay. And I mean gay from a different, darker day. In that pool and at that school, I sometimes quaked inside, fearful of what my future held. Back then — the 1970s — gay stereotypes went unchallenged, gay jokes drew hearty laughter and exponentially more Americans were closeted than out. We conducted our lives in whispers. Then AIDS spread, and we wore scarlet letters as we marched into the public square to plead with President Ronald Reagan for help. Our rallying cry, “silence = death,” defined marginalization as well as any words could.\nSo where does that leave me? Who does that make me? Oppressor or oppressed? Villain or victim? And does my legitimacy hinge on the answer?\nTo listen to some of the guardians of purity on the left, yes….\nAt the beginning of this column I shared the sorts of personal details that register most strongly with those Americans who tuck each of us into some hierarchy of blessedness and affliction. So you know some important things about me, but not the most important ones: how I responded to the random challenges on my path, who I met along the way, what I learned from them, the degree of curiosity I mustered and the values that I honed as a result.\nThose construct my character, and shape my voice, to be embraced or dismissed on its own merits. My gayness no more redeems me than my whiteness disqualifies me. And neither, I hope, defines me.\nThey rode the tiger. They used the tiger to attack their ideological enemies. Now the tiger is devouring them, and they still don’t have the discernment to identify the enemy or the courage to fight it.",
  "tags": [
    "media",
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-13T13:23:00+00:00"
}