{
  "url": "https://voxday.net/2017/08/27/its-not-that-bad/",
  "scraped_at": "2025-12-19T10:21:38.566925",
  "title": "It’s not that bad",
  "date_display": "August 27, 2017",
  "date_iso": "2017-08-27T17:29:00+00:00",
  "date_from_url": "2017-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it’s really not <a href=\"https://www.quora.com/Are-people-with-very-high-IQs-generally-happy/answer/Susanna-Viljanen\">that hard to figure out</a>, either.</p><blockquote><p>The concept of communication range was established by Leta Hollingworth. It is +/- 2 standard deviations (roughly 30 points) up or down on one’s own IQ. It denotes the range where meaningful interaction (communication, discussion, conversation and socializing) is possible. If the IQ difference between two persons is more than 30 points, the communication breaks up. The higher IQ person will look like an incomprehensible nerd and the lower IQ as a moronic dullard – and they will not find anything common.<br> +/- 30 points does not sound much, but once the IQ is past 135, the downsides are imminent. When someone has a perfectly mediocre IQ (100 for Caucasian average), his communication range is from IQ 70 to IQ 130, which covers some 98% of the whole population. But when it is 135, it is from 105 to 165, which is approximately 36% of population. And it gets worse: if it is 162, <i>your whole meaningful set of human interactions is restricted to Mensa qualifying people only (2% of whole population)</i>. Good luck for finding friends, acquaintances, colleagues – or spouse.<br> And it gets worse.<br> When the average IQ of a group is lower than the lower end of your communication range, the group will see you as a hostile outsider. They will do anything to bully you out of their presence. They will ostracize, excommunicate and oust you amongst themselves.<br> Sorry, but this is basic human psychology. Human group dynamics dictates that when the diversity grows too big, the group becomes incooperable – the group interaction becomes impossible. And high IQ means exactly that.<br> You may say that nobody must left behind and that mobbing and bullying is nasty and unacceptable, but our biology dictates otherwise. Exclusion is the basis for co-operation. A group which does not exclude people differing from the norm off or otherwise eliminate their presence, becomes dysfunctional.<br> Let me put this bluntly: every single human being with IQ of 135+ has experienced this exclusion, ousting and loneliness. The stereotype of a lonely genius does not come from empty air. It is cruel reality. And each and every human being with IQ of 135+ has experienced such unhappiness and misery the mediocre IQ people can not even imagine in their nightmares. I have cried my cubic metre of tears.<br> And this issue – that unhappiness is due to loneliness and the loneliness is due to the communication range – is something very few high IQ people ever realize.</br></br></br></br></br></br></br></p></blockquote><p>I suspect it is significant that this piece is written by a high IQ woman. It’s not only harder for them to find friends, it is MUCH harder for them to find romance. A man is just as happy with a less intelligent woman as a more intelligent woman, whereas a woman is unlikely to want to settle for a less intelligent man, just as she’s less inclined to settle for a shorter man.<br> I knew I was much more intelligent than the average from the age of four, but I had an even smarter friend from the age of five. So, while I certainly experienced my share of exclusion and ousting, I can’t honestly say I ever experienced much in the way of loneliness. And frankly, very intelligent kids tend to be more than a little obnoxious as well as somewhat dishonest with themselves; it’s fine if you decide to reject the way that people have settled on doing things, but then, you have to recognize that you are making a choice.<br> In that refusal to admit that they are making a choice, many a gamma male is made.</br></br></p></div>",
  "content_text": "And it’s really not\nthat hard to figure out\n, either.\nThe concept of communication range was established by Leta Hollingworth. It is +/- 2 standard deviations (roughly 30 points) up or down on one’s own IQ. It denotes the range where meaningful interaction (communication, discussion, conversation and socializing) is possible. If the IQ difference between two persons is more than 30 points, the communication breaks up. The higher IQ person will look like an incomprehensible nerd and the lower IQ as a moronic dullard – and they will not find anything common.\n+/- 30 points does not sound much, but once the IQ is past 135, the downsides are imminent. When someone has a perfectly mediocre IQ (100 for Caucasian average), his communication range is from IQ 70 to IQ 130, which covers some 98% of the whole population. But when it is 135, it is from 105 to 165, which is approximately 36% of population. And it gets worse: if it is 162,\nyour whole meaningful set of human interactions is restricted to Mensa qualifying people only (2% of whole population)\n. Good luck for finding friends, acquaintances, colleagues – or spouse.\nAnd it gets worse.\nWhen the average IQ of a group is lower than the lower end of your communication range, the group will see you as a hostile outsider. They will do anything to bully you out of their presence. They will ostracize, excommunicate and oust you amongst themselves.\nSorry, but this is basic human psychology. Human group dynamics dictates that when the diversity grows too big, the group becomes incooperable – the group interaction becomes impossible. And high IQ means exactly that.\nYou may say that nobody must left behind and that mobbing and bullying is nasty and unacceptable, but our biology dictates otherwise. Exclusion is the basis for co-operation. A group which does not exclude people differing from the norm off or otherwise eliminate their presence, becomes dysfunctional.\nLet me put this bluntly: every single human being with IQ of 135+ has experienced this exclusion, ousting and loneliness. The stereotype of a lonely genius does not come from empty air. It is cruel reality. And each and every human being with IQ of 135+ has experienced such unhappiness and misery the mediocre IQ people can not even imagine in their nightmares. I have cried my cubic metre of tears.\nAnd this issue – that unhappiness is due to loneliness and the loneliness is due to the communication range – is something very few high IQ people ever realize.\nI suspect it is significant that this piece is written by a high IQ woman. It’s not only harder for them to find friends, it is MUCH harder for them to find romance. A man is just as happy with a less intelligent woman as a more intelligent woman, whereas a woman is unlikely to want to settle for a less intelligent man, just as she’s less inclined to settle for a shorter man.\nI knew I was much more intelligent than the average from the age of four, but I had an even smarter friend from the age of five. So, while I certainly experienced my share of exclusion and ousting, I can’t honestly say I ever experienced much in the way of loneliness. And frankly, very intelligent kids tend to be more than a little obnoxious as well as somewhat dishonest with themselves; it’s fine if you decide to reject the way that people have settled on doing things, but then, you have to recognize that you are making a choice.\nIn that refusal to admit that they are making a choice, many a gamma male is made.",
  "tags": [
    "science",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-27T16:29:00+00:00"
}