{
  "url": "https://voxday.net/2017/08/16/labour-is-a-pro-rape-party/",
  "scraped_at": "2025-12-19T10:20:26.852993",
  "title": "Labour is a pro-rape party",
  "date_display": "August 16, 2017",
  "date_iso": "2017-08-16T18:47:00+00:00",
  "date_from_url": "2017-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>British women <a href=\"http://news.sky.com/story/sarah-champion-resigns-from-labour-shadow-cabinet-over-sun-article-10991388\">are clearly less important </a>than the sacred minorities dedicated to defiling them:</p><blockquote><p>A Labour MP has resigned from the shadow cabinet after saying Britain has “a problem with British Pakistani men raping and exploiting white girls”.<br> Sarah Champion, shadow women and equalities minister, apologised for her “extremely poor choice of words”, which appeared in a column in The Sun newspaper on Friday.<br> The MP for Rotherham’s piece was headlined: “British Pakistani men ARE raping and exploiting white girls… and it’s time we faced up to it.”<br> Her remarks came just days after 18 people were convicted of or admitted offences in a series of trials related to child sexual exploitation in Newcastle.<br> She wrote: “Britain has a problem with British-Pakistani men raping and exploiting white girls. There. I said it. Does that make me a racist? Or am I just prepared to call out this horrifying problem for what it is? For too long we have ignored the race of these abusers and, worse, tried to cover it up. No more. These people are predators and the common denominator is their ethnic heritage.”</br></br></br></br></p></blockquote><p>I wish I could say this is unbelievable. But it is only to be expected by the treacherous political class in Britain.</p></div>",
  "content_text": "British women\nare clearly less important\nthan the sacred minorities dedicated to defiling them:\nA Labour MP has resigned from the shadow cabinet after saying Britain has “a problem with British Pakistani men raping and exploiting white girls”.\nSarah Champion, shadow women and equalities minister, apologised for her “extremely poor choice of words”, which appeared in a column in The Sun newspaper on Friday.\nThe MP for Rotherham’s piece was headlined: “British Pakistani men ARE raping and exploiting white girls… and it’s time we faced up to it.”\nHer remarks came just days after 18 people were convicted of or admitted offences in a series of trials related to child sexual exploitation in Newcastle.\nShe wrote: “Britain has a problem with British-Pakistani men raping and exploiting white girls. There. I said it. Does that make me a racist? Or am I just prepared to call out this horrifying problem for what it is? For too long we have ignored the race of these abusers and, worse, tried to cover it up. No more. These people are predators and the common denominator is their ethnic heritage.”\nI wish I could say this is unbelievable. But it is only to be expected by the treacherous political class in Britain.",
  "tags": [
    "UK",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-16T17:47:00+00:00"
}