{
  "url": "https://voxday.net/2017/08/15/mailvox-the-pope-of-the-alt-right/",
  "scraped_at": "2025-12-19T10:20:17.932064",
  "title": "Mailvox: the Pope of the Alt-Right",
  "date_display": "August 15, 2017",
  "date_iso": "2017-08-15T10:54:00+00:00",
  "date_from_url": "2017-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>WS complained about my detached and contemplative approach.</p><blockquote><p>Maybe Vox figures he’s the Pope Benedict of the Alt-Right: the one who leads a contemplative life and assures us of his thoughts and prayers as we’re getting the snot beaten out of us.</p></blockquote><p>I found it mildly amusing that she thought I was thinking about them at all. There is a reason why I didn’t know who Jason Kessler was until yesterday. It was because I paid absolutely no attention to the rally in Charlottesville, despite apparently having been invited to speak there, until it made the news.<br> Neither Clausewitz nor van Creveld ever commanded in the field. Karl Marx was considerably more influential as an author than as a labor organizer. And it seems unlikely that Alexander the Great’s astonishing military success was entirely unrelated to the fact that he happened to have the greatest thinker in Man’s history as his personal tutor.<br> In light of the surprising discovery that the front man for the so-called “Unite the Right” rally was a left-wing Obama voter, I’ve been giving some thought to the assertions of some of the petty self-proclaimed national socialists that they are too of the right. In this vein, I thought it would be profitable to consult Leon Trotsky on the matter. His thoughts, expressed in the dramatically titled, but perceptive essay “The Fascist Danger Looms in Germany” are thought-provoking, if less useful than one might have assumed.</br></br></p><blockquote><p>In order that the social crisis may bring about the proletarian revolution, it is necessary that, besides other conditions, a decisive shift of the petty bourgeois classes occurs in the direction of the proletariat. This gives the proletariat a chance to put itself at the head of the nation as its leader.<br> The last election revealed — and this is where its principle symptomatic significance lies — a shift in the opposite direction. Under the blow of the crisis, the petty bourgeoisie swung, not in the direction of the proletarian revolution, but in the direction of the most extreme imperialist reaction, pulling behind it considerable sections of the proletariat.<br> The gigantic growth of National Socialism is an expression of two factors: a deep social crisis, throwing the petty bourgeois masses off balance, and the lack of a revolutionary party that would be regarded by the masses of the people as an acknowledged revolutionary leader. If the communist Party is the party of revolutionary hope, then fascism, as a mass movement, is the party of counter-revolutionary despair. When revolutionary hope embraces the whole proletarian mass, it inevitably pulls behind it on the road of revolution considerable and growing sections of the petty bourgeoisie. Precisely in this sphere the election revealed the opposite picture: counter-revolutionary despair embraced the petty bourgeois mass with such a force that it drew behind it many sections of the proletariat….<br> Fascism in Germany has become a real danger, as an acute expression of the helpless position of the bourgeois regime, the conservative role of the social democracy in this regime, and the accumulated powerlessness of the Communist Party to abolish it. Whoever denies this is either blind or a braggart….<br> The danger acquires particular acuteness in connection with the question of the tempo of development, which does not depend upon us alone. The malarial character of the political curve revealed by the election speaks for the fact that the tempo of development of the national crisis may turn out to be very speedy. In other words, the course of events in the very near future may resurrect in Germany, on a new historical plane, the old tragic contradiction between the maturity of a revolutionary situation, on the one hand, and the weakness and strategical impotence of the revolutionary party, on the other.</br></br></br></br></p></blockquote><p>Now, there is without question a social crisis across the West. A severe social crisis of historic proportions, arguably more serious than the one of the previous century. But in every case, the big bourgeoisie is allied with government bureaucracies and the ur-communists in revolutionary hope while both the petty bourgeoisie and the proletariat are increasingly inclined towards counter-revolutionary despair. Moreover, the class metric is largely irrelevant, because the dividing lines are far more clearly identified on identity grounds than on class grounds.<br> In other words, from the Trotskyite perspective, we’re in new territory here, and more sophisticated philosophical tools are required for useful analysis and prediction. But it is already clear that neither simple identity metrics nor conventional ideological metrics will alone suffice.</br></p></div>",
  "content_text": "WS complained about my detached and contemplative approach.\nMaybe Vox figures he’s the Pope Benedict of the Alt-Right: the one who leads a contemplative life and assures us of his thoughts and prayers as we’re getting the snot beaten out of us.\nI found it mildly amusing that she thought I was thinking about them at all. There is a reason why I didn’t know who Jason Kessler was until yesterday. It was because I paid absolutely no attention to the rally in Charlottesville, despite apparently having been invited to speak there, until it made the news.\nNeither Clausewitz nor van Creveld ever commanded in the field. Karl Marx was considerably more influential as an author than as a labor organizer. And it seems unlikely that Alexander the Great’s astonishing military success was entirely unrelated to the fact that he happened to have the greatest thinker in Man’s history as his personal tutor.\nIn light of the surprising discovery that the front man for the so-called “Unite the Right” rally was a left-wing Obama voter, I’ve been giving some thought to the assertions of some of the petty self-proclaimed national socialists that they are too of the right. In this vein, I thought it would be profitable to consult Leon Trotsky on the matter. His thoughts, expressed in the dramatically titled, but perceptive essay “The Fascist Danger Looms in Germany” are thought-provoking, if less useful than one might have assumed.\nIn order that the social crisis may bring about the proletarian revolution, it is necessary that, besides other conditions, a decisive shift of the petty bourgeois classes occurs in the direction of the proletariat. This gives the proletariat a chance to put itself at the head of the nation as its leader.\nThe last election revealed — and this is where its principle symptomatic significance lies — a shift in the opposite direction. Under the blow of the crisis, the petty bourgeoisie swung, not in the direction of the proletarian revolution, but in the direction of the most extreme imperialist reaction, pulling behind it considerable sections of the proletariat.\nThe gigantic growth of National Socialism is an expression of two factors: a deep social crisis, throwing the petty bourgeois masses off balance, and the lack of a revolutionary party that would be regarded by the masses of the people as an acknowledged revolutionary leader. If the communist Party is the party of revolutionary hope, then fascism, as a mass movement, is the party of counter-revolutionary despair. When revolutionary hope embraces the whole proletarian mass, it inevitably pulls behind it on the road of revolution considerable and growing sections of the petty bourgeoisie. Precisely in this sphere the election revealed the opposite picture: counter-revolutionary despair embraced the petty bourgeois mass with such a force that it drew behind it many sections of the proletariat….\nFascism in Germany has become a real danger, as an acute expression of the helpless position of the bourgeois regime, the conservative role of the social democracy in this regime, and the accumulated powerlessness of the Communist Party to abolish it. Whoever denies this is either blind or a braggart….\nThe danger acquires particular acuteness in connection with the question of the tempo of development, which does not depend upon us alone. The malarial character of the political curve revealed by the election speaks for the fact that the tempo of development of the national crisis may turn out to be very speedy. In other words, the course of events in the very near future may resurrect in Germany, on a new historical plane, the old tragic contradiction between the maturity of a revolutionary situation, on the one hand, and the weakness and strategical impotence of the revolutionary party, on the other.\nNow, there is without question a social crisis across the West. A severe social crisis of historic proportions, arguably more serious than the one of the previous century. But in every case, the big bourgeoisie is allied with government bureaucracies and the ur-communists in revolutionary hope while both the petty bourgeoisie and the proletariat are increasingly inclined towards counter-revolutionary despair. Moreover, the class metric is largely irrelevant, because the dividing lines are far more clearly identified on identity grounds than on class grounds.\nIn other words, from the Trotskyite perspective, we’re in new territory here, and more sophisticated philosophical tools are required for useful analysis and prediction. But it is already clear that neither simple identity metrics nor conventional ideological metrics will alone suffice.",
  "tags": [
    "#AltRight",
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-15T09:54:00+00:00"
}