{
  "url": "https://voxday.net/2017/08/11/mailvox-it-in-a-converged-company/",
  "scraped_at": "2025-12-18T07:26:19.817609",
  "title": "Mailvox: IT in a converged company",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T13:30:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>It will be poisonous if the tech right feels compelled to not only hide their beliefs but also to actively pretend to believe in progressive diversity values. This pretending will embitter them, probably pushing many to the more radical alt-right</i><br> This is EXACTLY what happened to me!<br> One HR director in particular was hard-core SJW and good friends with one of my managers so I was stuck.  One of the things she did that still sticks in my mind was an online training/brainwashing course where 1) we HAD to pass it in order to remain employed and we were told that this was because it was the company’s responsibility to demonstrate nondiscrimination in order to meet federal requirements – which was, first of all, bullcrap, and second, a way to shift the responsibility for the nonsense onto the employees. 2) it contained questions such as “Check the boxes next to groups which are discriminated against” and “white men” was an incorrect answer.  You could select it, and it would just make you redo the question over and over until you gave the “right” answer.<br> I wasn’t familiar at the time with Vaclav Havel’s “Power of the Powerless” but he totally nailed what was going on: the point wasn’t to make us believe something we didn’t agree with, the point was to make us complicit.<br> My reaction – which SHOULD have been to quit and find another job, but I wasn’t wise enough yet – was to manipulate my own responsibilities and the work that needed doing such that I could get everything done for the week in a couple hours, then spend the rest of the time goofing off and surfing the net.  Not a good use of time on my part; a worse use of employee resources by the people in charge.  My morale basically went to zero for several years as a result of these sorts of policies, and the value they got out of me correlated.<br> I’m out of IT now.  I’ve gotten the impression this sort of problem is too widespread for me to want to put up with it.</br></br></br></br></br></p></div>",
  "content_text": "It will be poisonous if the tech right feels compelled to not only hide their beliefs but also to actively pretend to believe in progressive diversity values. This pretending will embitter them, probably pushing many to the more radical alt-right\nThis is EXACTLY what happened to me!\nOne HR director in particular was hard-core SJW and good friends with one of my managers so I was stuck.  One of the things she did that still sticks in my mind was an online training/brainwashing course where 1) we HAD to pass it in order to remain employed and we were told that this was because it was the company’s responsibility to demonstrate nondiscrimination in order to meet federal requirements – which was, first of all, bullcrap, and second, a way to shift the responsibility for the nonsense onto the employees. 2) it contained questions such as “Check the boxes next to groups which are discriminated against” and “white men” was an incorrect answer.  You could select it, and it would just make you redo the question over and over until you gave the “right” answer.\nI wasn’t familiar at the time with Vaclav Havel’s “Power of the Powerless” but he totally nailed what was going on: the point wasn’t to make us believe something we didn’t agree with, the point was to make us complicit.\nMy reaction – which SHOULD have been to quit and find another job, but I wasn’t wise enough yet – was to manipulate my own responsibilities and the work that needed doing such that I could get everything done for the week in a couple hours, then spend the rest of the time goofing off and surfing the net.  Not a good use of time on my part; a worse use of employee resources by the people in charge.  My morale basically went to zero for several years as a result of these sorts of policies, and the value they got out of me correlated.\nI’m out of IT now.  I’ve gotten the impression this sort of problem is too widespread for me to want to put up with it.",
  "tags": [
    "corpocracy",
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-11T12:30:00+00:00"
}