{
  "url": "https://voxday.net/2017/08/30/mailvox-of-scraps-and-subscriptions/",
  "scraped_at": "2025-12-19T10:22:01.188006",
  "title": "Mailvox: of scraps and subscriptions",
  "date_display": "August 30, 2017",
  "date_iso": "2017-08-30T20:46:00+00:00",
  "date_from_url": "2017-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An email today from a sane man who finds himself caught up in a crazy world:</p><blockquote><p>I want you to know I appreciate what you are doing. I’m in tech and the number of pozzed out SJW folks I interact with on a daily basis in that capacity is nearly unbearable. It feels like fully 1/5 – 1/4th of all articles, blog posts, and podcast episodes I see out there on most feeds are identity politics bullshit these days. There seems to be an overbearing need for virtue signalling from guys that make six figures and can’t get an attractive girlfriend. It goes all the way up to a number of well-known blogger/podcasters who should have their lives together, based on the amount of income they bring in, but yet continue to white knight for fairly dubious (aka, low value) scraps of female attention.<br> I must also relate a story. I recently had dinner with a silicon valley startup dude (I say “dude”, because he was allegedly a founder, but not particularly successful) regarding the possibility of Silicon Valley startups outsourcing to other parts of the US (particularly the deep south and rust belt). I pointed out that low ping times, similar timezones and laws, and better optics around outsourcing might eventually make the numbers work well enough for at least some companies to try it out. It was at this point that I was subjected to an extended rant about how his company would never do that as (summarized) “we don’t want to hire people who are going to be bringing racism into the office and wanting to take time off in the fall to duck hunt and f#$% their sisters”. This individual stated this, loudly, in front of numerous witnesses without a hint of fear of consequences. It is this sort of behavior and the cucking I described in the previous paragraph that makes me believe that the alt-tech revolt is just getting started – I know dozens already who are hopping mad about this sort of thing and I send them to your blog. I certainly am motivated to help grease the skids for it.</br></p></blockquote><p>That is a great observation on the driving force behind Silicon Valley virtue-signaling, and it indicates that it is going to be possible to red-pill some of the seeming SJWs. They are operating on a false paradigm, and moreover, they have to, on some level, know it. <i>I mean, it just isn’t working for them</i>, is it.<br> But regardless, the Alt-Tech revolt is just getting started. We’ve set the Voxiversity launch date to September 11th, the Alt-Patronstarter site is already fully functional, and I’m putting the subscriptions together now. There will be six levels of monthly subscriptions, from $5 to $500, and while I have most of the rewards identified, I’m interested in hearing additional ideas from those of you intending to support this foray into video production.<br> The Alt Hero kickstarter will be launched two weeks after Voxiversity. It will not be a subscription, just a straightforward fund-or-kill 30-day campaign.<br> Share your thoughts.</br></br></br></p></div>",
  "content_text": "An email today from a sane man who finds himself caught up in a crazy world:\nI want you to know I appreciate what you are doing. I’m in tech and the number of pozzed out SJW folks I interact with on a daily basis in that capacity is nearly unbearable. It feels like fully 1/5 – 1/4th of all articles, blog posts, and podcast episodes I see out there on most feeds are identity politics bullshit these days. There seems to be an overbearing need for virtue signalling from guys that make six figures and can’t get an attractive girlfriend. It goes all the way up to a number of well-known blogger/podcasters who should have their lives together, based on the amount of income they bring in, but yet continue to white knight for fairly dubious (aka, low value) scraps of female attention.\nI must also relate a story. I recently had dinner with a silicon valley startup dude (I say “dude”, because he was allegedly a founder, but not particularly successful) regarding the possibility of Silicon Valley startups outsourcing to other parts of the US (particularly the deep south and rust belt). I pointed out that low ping times, similar timezones and laws, and better optics around outsourcing might eventually make the numbers work well enough for at least some companies to try it out. It was at this point that I was subjected to an extended rant about how his company would never do that as (summarized) “we don’t want to hire people who are going to be bringing racism into the office and wanting to take time off in the fall to duck hunt and f#$% their sisters”. This individual stated this, loudly, in front of numerous witnesses without a hint of fear of consequences. It is this sort of behavior and the cucking I described in the previous paragraph that makes me believe that the alt-tech revolt is just getting started – I know dozens already who are hopping mad about this sort of thing and I send them to your blog. I certainly am motivated to help grease the skids for it.\nThat is a great observation on the driving force behind Silicon Valley virtue-signaling, and it indicates that it is going to be possible to red-pill some of the seeming SJWs. They are operating on a false paradigm, and moreover, they have to, on some level, know it.\nI mean, it just isn’t working for them\n, is it.\nBut regardless, the Alt-Tech revolt is just getting started. We’ve set the Voxiversity launch date to September 11th, the Alt-Patronstarter site is already fully functional, and I’m putting the subscriptions together now. There will be six levels of monthly subscriptions, from $5 to $500, and while I have most of the rewards identified, I’m interested in hearing additional ideas from those of you intending to support this foray into video production.\nThe Alt Hero kickstarter will be launched two weeks after Voxiversity. It will not be a subscription, just a straightforward fund-or-kill 30-day campaign.\nShare your thoughts.",
  "tags": [
    "mailvox",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-30T19:46:00+00:00"
}