{
  "url": "https://voxday.net/2017/08/27/mailvox-whoop-de-damn-do/",
  "scraped_at": "2025-12-19T10:21:37.101422",
  "title": "Mailvox: whoop-de-damn-do",
  "date_display": "August 27, 2017",
  "date_iso": "2017-08-27T13:54:00+00:00",
  "date_from_url": "2017-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TB is concerned about the fact that I am being criticized:</p><blockquote><p>Holy shit, Mike Enoch went off on VD on their podcast from yesterday. I came here expecting a response. Your move, Vox.</p></blockquote><p>I’ll pass, thanks. Mike has a right to say whatever he thinks of me. And I’m not interested in his opinion, least of all concerning a subject I know superlatively well. I see no need to listen to his criticism much less respond to it.<br> RD informed us that “the TRS guys were quite unhappy that you pointed out Spencer isn’t of the Right.”</br></p><blockquote><p>In their latest podcast, TDS185 (which is paywalled), they spent from 1h:27m – 1h:44m railing against you (and Cernovich), as they feel betrayed.  They talk about how they respected your work, but that they believe you’ve turned on them since the unfortunate events in Charlottesville.<br> I can’t help but kind of like those guys.  They’re funny, and they have a lot of energy and have reached a lot of people. But Mike Enoch simply refuses to accept that their cock-up in Charlottesville provided a pretext for the current wave of literal iconoclasm and grave desecration.  And they really don’t have a firm intellectual understanding of actual National Socialism and why it’s defunct.<br> At the same time, they say they’ve accepted your advice that Nazi flags and so forth are bad optics, and must be avoided.  But they don’t credit you with it.</br></br></p></blockquote><p>The truth is what it is. This sort of “Jenny, did you hear what Billy said about Suzy” drama is of zero interest to me. I don’t know what they said. I don’t care what they said. I’m not attempting to curry favor with them or with anyone.<br> I’ve never been a movement guy. I don’t play particularly well with others, in part because I simply try to do what I think is right at the time. I don’t worry at all about what X is going to think about my opinion of Y. I stand by my friends, not because I agree with them or I believe their ideology to be flawless, but because they are my friends. That may not be enough for you, but it’s enough for me.<br> Also, I would point out that I have been the object of considerably more criticism than I have meted out. I’m not offering that as an excuse or a reason because it is neither; the criticism was merited regardless of the source. But I do think it suffices to dismiss the idea that I have betrayed anyone.</br></br></p></div>",
  "content_text": "TB is concerned about the fact that I am being criticized:\nHoly shit, Mike Enoch went off on VD on their podcast from yesterday. I came here expecting a response. Your move, Vox.\nI’ll pass, thanks. Mike has a right to say whatever he thinks of me. And I’m not interested in his opinion, least of all concerning a subject I know superlatively well. I see no need to listen to his criticism much less respond to it.\nRD informed us that “the TRS guys were quite unhappy that you pointed out Spencer isn’t of the Right.”\nIn their latest podcast, TDS185 (which is paywalled), they spent from 1h:27m – 1h:44m railing against you (and Cernovich), as they feel betrayed.  They talk about how they respected your work, but that they believe you’ve turned on them since the unfortunate events in Charlottesville.\nI can’t help but kind of like those guys.  They’re funny, and they have a lot of energy and have reached a lot of people. But Mike Enoch simply refuses to accept that their cock-up in Charlottesville provided a pretext for the current wave of literal iconoclasm and grave desecration.  And they really don’t have a firm intellectual understanding of actual National Socialism and why it’s defunct.\nAt the same time, they say they’ve accepted your advice that Nazi flags and so forth are bad optics, and must be avoided.  But they don’t credit you with it.\nThe truth is what it is. This sort of “Jenny, did you hear what Billy said about Suzy” drama is of zero interest to me. I don’t know what they said. I don’t care what they said. I’m not attempting to curry favor with them or with anyone.\nI’ve never been a movement guy. I don’t play particularly well with others, in part because I simply try to do what I think is right at the time. I don’t worry at all about what X is going to think about my opinion of Y. I stand by my friends, not because I agree with them or I believe their ideology to be flawless, but because they are my friends. That may not be enough for you, but it’s enough for me.\nAlso, I would point out that I have been the object of considerably more criticism than I have meted out. I’m not offering that as an excuse or a reason because it is neither; the criticism was merited regardless of the source. But I do think it suffices to dismiss the idea that I have betrayed anyone.",
  "tags": [
    "#AltRight",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-27T12:54:00+00:00"
}