{
  "url": "https://voxday.net/2017/08/10/mike-cernovich-alt-journalist/",
  "scraped_at": "2025-12-18T07:26:07.380410",
  "title": "Mike Cernovich, Alt Journalist",
  "date_display": "August 10, 2017",
  "date_iso": "2017-08-10T07:30:00+00:00",
  "date_from_url": "2017-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cernovich Media is on the rise; <a href=\"http://nymag.com/daily/intelligencer/2017/08/mike-cernovich-pivots-from-pizzagate-to-not-so-fake-news.html?utm_campaign=nym&amp;utm_source=tw&amp;utm_medium=s1\">a surprisingly respectful profile</a> on Mike by New York Magazine:</p><blockquote><p>Cernovich claims that on April 2 an anonymous source called him on Signal to tell him that former national security adviser Susan Rice had requested the disclosure of the identities of Americans — including many related to the Trump campaign and transition — in raw intelligence reports, a process known as “unmasking.” He wrote up the tip on Medium, and then watched as it took off on social media, with help from the Drudge Report, Kellyanne Conway, and Donald Trump Jr., the president’s son, who suggested that were the media not rigged, Cernovich would receive a Pulitzer Prize.<br> The press, however, didn’t give him much credit for his scoop. A single anonymous source does not typically meet the threshold for publishing news at most media outlets, for starters. And then there was the issue of taking Cernovich seriously at all, given that his earlier work included stuff like a video where a sickly muppet rendering of Clinton collapsed and rose from the dead repeatedly. So when Bloomberg View reported the same news on the morning of April 3, citing “U.S. officials familiar with the matter,” it was treated differently — with total legitimacy. The Atlantic, The Wall Street Journal, the New York Post, and the Washington Times, either unaware or dismissive of the fact that Cernovich was first, wrote that Bloomberg had broken the story. And when Cernovich was cited, by NBC for instance, it was typically within the context of stories that downplayed the newsworthiness of Rice’s actions — the implication being, if the Pizzagate loon is the one with the intel, perhaps the intel isn’t all it’s cracked up to be.<br> But by late July, everything had changed, both in how Cernovich perceived the Trump White House, and in how the press perceived Cernovich.<br> At 3:29 p.m. on July 28, Cernovich took to Twitter to report that a “source close to POTUS” informed him, “Reince has been told he’s out.” The president himself would not announce the decision until 4:49 p.m., while sitting aboard Air Force One on a tarmac in Washington. And although other reporters would go on to say they’d heard rumors of the decision before it came down, Cernovich had the advantage of operating without the barrier of an editor or publisher or any other organizational structure that might inhibit speed — but also lower the odds of a fuck-up.<br> “The reason that I’m so fast at what I do is — I’m not saying that I’m getting stories that nobody else has — the difference is that if a tip goes out to five people, and I know that it’s a reliable source, I just tweet it out,” he told me. “If you’re at a respectable news organization, that would be considered irresponsible. So, me, I’m just like, ‘Oh. Sounds good. This is a vetted source. I’m rocking and rolling. Let’s get out and get the conversation going.’”</br></br></br></br></p></blockquote><p>Some people might be a bit torqued at the way that Mike is doing some things differently now, but you shouldn’t be. Men like him and Milo and Jack are playing a very different game than men like Stefan and me. Different rules apply. I don’t support Mike because I agree with him on everything, I support him because he’s a good man and he is a friend.</p></div>",
  "content_text": "Cernovich Media is on the rise;\na surprisingly respectful profile\non Mike by New York Magazine:\nCernovich claims that on April 2 an anonymous source called him on Signal to tell him that former national security adviser Susan Rice had requested the disclosure of the identities of Americans — including many related to the Trump campaign and transition — in raw intelligence reports, a process known as “unmasking.” He wrote up the tip on Medium, and then watched as it took off on social media, with help from the Drudge Report, Kellyanne Conway, and Donald Trump Jr., the president’s son, who suggested that were the media not rigged, Cernovich would receive a Pulitzer Prize.\nThe press, however, didn’t give him much credit for his scoop. A single anonymous source does not typically meet the threshold for publishing news at most media outlets, for starters. And then there was the issue of taking Cernovich seriously at all, given that his earlier work included stuff like a video where a sickly muppet rendering of Clinton collapsed and rose from the dead repeatedly. So when Bloomberg View reported the same news on the morning of April 3, citing “U.S. officials familiar with the matter,” it was treated differently — with total legitimacy. The Atlantic, The Wall Street Journal, the New York Post, and the Washington Times, either unaware or dismissive of the fact that Cernovich was first, wrote that Bloomberg had broken the story. And when Cernovich was cited, by NBC for instance, it was typically within the context of stories that downplayed the newsworthiness of Rice’s actions — the implication being, if the Pizzagate loon is the one with the intel, perhaps the intel isn’t all it’s cracked up to be.\nBut by late July, everything had changed, both in how Cernovich perceived the Trump White House, and in how the press perceived Cernovich.\nAt 3:29 p.m. on July 28, Cernovich took to Twitter to report that a “source close to POTUS” informed him, “Reince has been told he’s out.” The president himself would not announce the decision until 4:49 p.m., while sitting aboard Air Force One on a tarmac in Washington. And although other reporters would go on to say they’d heard rumors of the decision before it came down, Cernovich had the advantage of operating without the barrier of an editor or publisher or any other organizational structure that might inhibit speed — but also lower the odds of a fuck-up.\n“The reason that I’m so fast at what I do is — I’m not saying that I’m getting stories that nobody else has — the difference is that if a tip goes out to five people, and I know that it’s a reliable source, I just tweet it out,” he told me. “If you’re at a respectable news organization, that would be considered irresponsible. So, me, I’m just like, ‘Oh. Sounds good. This is a vetted source. I’m rocking and rolling. Let’s get out and get the conversation going.’”\nSome people might be a bit torqued at the way that Mike is doing some things differently now, but you shouldn’t be. Men like him and Milo and Jack are playing a very different game than men like Stefan and me. Different rules apply. I don’t support Mike because I agree with him on everything, I support him because he’s a good man and he is a friend.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-10T06:30:00+00:00"
}