{
  "url": "https://voxday.net/2017/08/14/neocons-2-0/",
  "scraped_at": "2025-12-19T10:20:16.448963",
  "title": "Neocons 2.0",
  "date_display": "August 14, 2017",
  "date_iso": "2017-08-14T20:04:00+00:00",
  "date_from_url": "2017-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I said it’s not punching right to criticize the Alt-Reichtards, I had no idea how correct I was:</p><blockquote><p>Only a year ago, white supremacist and ‘Unite the Right’ leader, Jason Kessler, was said to be a supporter of former President Obama and the Occupy movement. According to the Southern Poverty Law Center, Kessler revealed his political transformation around November 2016, the same month then-candidate Donald Trump won the presidential election. In November, 2016, Kessler displayed a rightward shift according to SPLC during an attack on Charlottesville vice mayor Wes Bellamy who posted racist and vulgar tweets in 2011 and 2012.</p></blockquote><p>Didn’t we already go through this once before? How did that turn out for the Right?<br> Now, I’m all in favor of people seeing the light and all, but perhaps accepting these enthusiastic newcomers in positions of leadership is not the wisest course of action. Especially when they have shown that they are manifestly unprepared for it. I’m not saying there is no place for them on the Right, merely that one should think twice, or perhaps three times, before placing any confidence in them.<br> Criticizing these guys isn’t punching right. There are birds in my yard that have been right-wing longer than them. They are not even to the right of the average cuckservative. This may explain why, when I had Richard Spencer on Brainstorm, we were all surprised to discover that he was to nearly everyone’s left.<br> Identity politics are in the process of replacing ideology politics, but that means that ideology is no longer the sole metric, not that it is entirely irrelevant.</br></br></br></p></div>",
  "content_text": "When I said it’s not punching right to criticize the Alt-Reichtards, I had no idea how correct I was:\nOnly a year ago, white supremacist and ‘Unite the Right’ leader, Jason Kessler, was said to be a supporter of former President Obama and the Occupy movement. According to the Southern Poverty Law Center, Kessler revealed his political transformation around November 2016, the same month then-candidate Donald Trump won the presidential election. In November, 2016, Kessler displayed a rightward shift according to SPLC during an attack on Charlottesville vice mayor Wes Bellamy who posted racist and vulgar tweets in 2011 and 2012.\nDidn’t we already go through this once before? How did that turn out for the Right?\nNow, I’m all in favor of people seeing the light and all, but perhaps accepting these enthusiastic newcomers in positions of leadership is not the wisest course of action. Especially when they have shown that they are manifestly unprepared for it. I’m not saying there is no place for them on the Right, merely that one should think twice, or perhaps three times, before placing any confidence in them.\nCriticizing these guys isn’t punching right. There are birds in my yard that have been right-wing longer than them. They are not even to the right of the average cuckservative. This may explain why, when I had Richard Spencer on Brainstorm, we were all surprised to discover that he was to nearly everyone’s left.\nIdentity politics are in the process of replacing ideology politics, but that means that ideology is no longer the sole metric, not that it is entirely irrelevant.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-14T19:04:00+00:00"
}