{
  "url": "https://voxday.net/2017/08/16/on-the-fake-right/",
  "scraped_at": "2025-12-19T10:20:23.915382",
  "title": "On the Fake Right",
  "date_display": "August 16, 2017",
  "date_iso": "2017-08-16T12:26:00+00:00",
  "date_from_url": "2017-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neither neocons nor national socialists are of the ideological Right. Both groups are 100 percent Fake Right and rely upon deceit to try to worm their way into the genuine Right to drum up support on the basis of a few points of commonality because they are defeated left-wing factions.<br> This is nothing new. I was writing about this in 2004.<br> <i><br> </br></i><i>“Over a third of the 1920 Munich Manifesto precisely matched goals put forth by the American Democratic party, and that percentage more than doubled if one eliminates the historical aspects of the Nazi platform that simply have no application today.” </i><br> And before that, in 2003, I looked at the ideological spectrum on <a href=\"http://www.wnd.com/2003/09/20662/\">a party-by-party basis</a>.<br> The most common error is to postulate a Communist left-wing extreme opposed by an extreme Nazi right wing. Not only does this leave out a substantial body of political and philosophical thought, but the construction falls apart the moment the two socialist ideologies are compared. Any reasonable comparison inevitably forces the confused advocates of such a definition to assert that the spectrum is actually a circle, in which case the terms left and right, much less left-wing and right-wing, are wholly nonsensical.<br> Nor is the original usage of much utility today, since it represented the fundamental division of the pre-revolutionary French national assembly. Since very few nations feature a monarchy these days, and even fewer political parties espouse positions with regards to the Bourbon kings, this definition is now defunct. And the notion of basing the spectrum on progress, of course, begs the Marxian question. In other words, progress toward what? The worker’s paradise?<br> To find a stronger foundation for a proper political spectrum, it is necessary to delve into intellectual history. Looking back to ancient Greece, one finds striking similarities between the collectivism of Plato’s Republic and modern leftist thought. And likewise, the close relationship between the Aristotelian regard for the individual, the American Bill of Rights and today’s Libertarian Party is equally hard to escape.<br> Taking this fundamental dichotomy between the supremacy of the community and the primacy of the individual as a starting point, it becomes relatively easy to determine where an individual or party happens to fall on the political spectrum if communism is accepted as the anchoring point for the extreme left wing. The figure below illustrates where some of the most familiar political philosophies fall upon the spectrum based on an analysis of what I consider to be the ten most significant elements affecting individuals and their relationship to their government, followed by a point-by-point breakdown of how these positions were determined.<br> The ten issues were: Religious Freedom, Right to Life, Gun Control, State Money Standard, Private Property, Freedom of the Press, National Sovereignty, Standing Army, State Schools, Central State Authority<br> The totals:<br> 00 COMMUNIST<br> 15 NATIONAL SOCIALIST<br> 36 DEMOCRAT<br> 52 REPUBLICAN<br> 85 LIBERTARIAN<br> This is conclusive evidence that all National Socialists and all Alt-Reichtards are 100 percent Fake Right. They are not only to the Left of the Republicans, they are observably to the Left of the Democratic Party and the DNC.<br> Nor is the claim that they are pro-white even remotely convincing. First, the German national socialists killed more white people than anyone but their fellow left-wingers, the Communists. Second, the overwhelming majority of genuine national socialists in the world today are not white at all, they are Asian and Arab. And the Chinese version of national socialism both preceded and survived the German version.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><div style=\"clear: both; text-align: center;\"><a href=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHWiFRCWAAAoEOv.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"461\" data-original-width=\"460\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHWiFRCWAAAoEOv.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"461\" data-original-width=\"460\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHWiFRCWAAAoEOv.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20460%20461%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "Neither neocons nor national socialists are of the ideological Right. Both groups are 100 percent Fake Right and rely upon deceit to try to worm their way into the genuine Right to drum up support on the basis of a few points of commonality because they are defeated left-wing factions.\nThis is nothing new. I was writing about this in 2004.\n“Over a third of the 1920 Munich Manifesto precisely matched goals put forth by the American Democratic party, and that percentage more than doubled if one eliminates the historical aspects of the Nazi platform that simply have no application today.”\nAnd before that, in 2003, I looked at the ideological spectrum on\na party-by-party basis\n.\nThe most common error is to postulate a Communist left-wing extreme opposed by an extreme Nazi right wing. Not only does this leave out a substantial body of political and philosophical thought, but the construction falls apart the moment the two socialist ideologies are compared. Any reasonable comparison inevitably forces the confused advocates of such a definition to assert that the spectrum is actually a circle, in which case the terms left and right, much less left-wing and right-wing, are wholly nonsensical.\nNor is the original usage of much utility today, since it represented the fundamental division of the pre-revolutionary French national assembly. Since very few nations feature a monarchy these days, and even fewer political parties espouse positions with regards to the Bourbon kings, this definition is now defunct. And the notion of basing the spectrum on progress, of course, begs the Marxian question. In other words, progress toward what? The worker’s paradise?\nTo find a stronger foundation for a proper political spectrum, it is necessary to delve into intellectual history. Looking back to ancient Greece, one finds striking similarities between the collectivism of Plato’s Republic and modern leftist thought. And likewise, the close relationship between the Aristotelian regard for the individual, the American Bill of Rights and today’s Libertarian Party is equally hard to escape.\nTaking this fundamental dichotomy between the supremacy of the community and the primacy of the individual as a starting point, it becomes relatively easy to determine where an individual or party happens to fall on the political spectrum if communism is accepted as the anchoring point for the extreme left wing. The figure below illustrates where some of the most familiar political philosophies fall upon the spectrum based on an analysis of what I consider to be the ten most significant elements affecting individuals and their relationship to their government, followed by a point-by-point breakdown of how these positions were determined.\nThe ten issues were: Religious Freedom, Right to Life, Gun Control, State Money Standard, Private Property, Freedom of the Press, National Sovereignty, Standing Army, State Schools, Central State Authority\nThe totals:\n00 COMMUNIST\n15 NATIONAL SOCIALIST\n36 DEMOCRAT\n52 REPUBLICAN\n85 LIBERTARIAN\nThis is conclusive evidence that all National Socialists and all Alt-Reichtards are 100 percent Fake Right. They are not only to the Left of the Republicans, they are observably to the Left of the Democratic Party and the DNC.\nNor is the claim that they are pro-white even remotely convincing. First, the German national socialists killed more white people than anyone but their fellow left-wingers, the Communists. Second, the overwhelming majority of genuine national socialists in the world today are not white at all, they are Asian and Arab. And the Chinese version of national socialism both preceded and survived the German version.",
  "tags": [
    "#AltRetard",
    "#AltRight",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-16T11:26:00+00:00"
}