{
  "url": "https://voxday.net/2017/08/24/preserving-isis/",
  "scraped_at": "2025-12-19T10:21:19.280146",
  "title": "Preserving ISIS",
  "date_display": "August 24, 2017",
  "date_iso": "2017-08-24T11:32:00+00:00",
  "date_from_url": "2017-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is utter insanity. A strategic white paper by “a veteran authority on the Arab-Israeli conflict and strategic developments in the Mideast and expert on Israeli strategic doctrine” argues <a href=\"http://besacenter.org/perspectives-papers/destruction-islamic-state-strategic-mistake/\">for saving the monstrous Islamic State</a>.</p><blockquote><p>EXECUTIVE SUMMARY: The West should seek the further weakening of Islamic State, but not its destruction. A weak but functioning IS can undermine the appeal of the caliphate among radical Muslims; keep bad actors focused on one another rather than on Western targets; and hamper Iran’s quest for regional hegemony.<br> US Defense Secretary Ashton Carter recently gathered defense ministers from allied nations to plan what officials hope will be the decisive stage in the campaign to eradicate the Islamic State (IS) organization. This is a strategic mistake.<br> IS, a radical Islamist group, has killed thousands of people since it declared an Islamic caliphate in June 2014, with the Syrian city of Raqqa as its de facto capital. It captured tremendous international attention by swiftly conquering large swaths of land and by releasing gruesome pictures of beheadings and other means of execution.<br> But IS is primarily successful where there is a political void. Although the offensives in Syria and Iraq showed IS’s tactical capabilities, they were directed against failed states with weakened militaries. On occasions when the poorly trained IS troops have met well-organized opposition, even that of non-state entities like the Kurdish militias, the group’s performance has been less convincing. When greater military pressure was applied and Turkish support dwindled, IS went into retreat.<br> It is true that IS has ignited immense passion among many young and frustrated Muslims all over the world, and the caliphate idea holds great appeal among believers. But the relevant question is what can IS do, particularly in its current situation? The terrorist activities for which it recently took responsibility were perpetrated mostly by lone wolves who declared their allegiance to IS; they were not directed from Raqqa. On its own, IS is capable of only limited damage.<br> A weak IS is, counterintuitively, preferable to a destroyed IS. IS is a magnet for radicalized Muslims in countries throughout the world. These volunteers are easier targets to identify, saving intelligence work. They acquire destructive skills in the fields of Syria and Iraq that are of undoubted concern if they return home, but some of them acquire shaheed status while still away – a blessing for their home countries. If IS is fully defeated, more of these people are likely to come home and cause trouble.<br> If IS loses control over its territory, the energies that went into protecting and governing a state will be directed toward organizing more terrorist attacks beyond its borders. The collapse of IS will produce a terrorist diaspora that might further radicalize Muslim immigrants in the West. Most counter-terrorism agencies understand this danger. Prolonging the life of IS probably assures the deaths of more Muslim extremists at the hands of other bad guys in the Middle East, and is likely to spare the West several terrorist attacks.</br></br></br></br></br></br></p></blockquote><p>This is utter madness and lends support to the idea that ISIS was, if not an outright creation of a US-Israeli alliance, at least supported by both the United States and Israel. This is not realpolitik, or whatever its advocates might like to style it, it is hubris and dangerous lunacy.<br> These jokers claim to be expert strategists, and yet they reliably fail to predict even the most obvious events. And their advice is reliably terrible.</br></p></div>",
  "content_text": "This is utter insanity. A strategic white paper by “a veteran authority on the Arab-Israeli conflict and strategic developments in the Mideast and expert on Israeli strategic doctrine” argues\nfor saving the monstrous Islamic State\n.\nEXECUTIVE SUMMARY: The West should seek the further weakening of Islamic State, but not its destruction. A weak but functioning IS can undermine the appeal of the caliphate among radical Muslims; keep bad actors focused on one another rather than on Western targets; and hamper Iran’s quest for regional hegemony.\nUS Defense Secretary Ashton Carter recently gathered defense ministers from allied nations to plan what officials hope will be the decisive stage in the campaign to eradicate the Islamic State (IS) organization. This is a strategic mistake.\nIS, a radical Islamist group, has killed thousands of people since it declared an Islamic caliphate in June 2014, with the Syrian city of Raqqa as its de facto capital. It captured tremendous international attention by swiftly conquering large swaths of land and by releasing gruesome pictures of beheadings and other means of execution.\nBut IS is primarily successful where there is a political void. Although the offensives in Syria and Iraq showed IS’s tactical capabilities, they were directed against failed states with weakened militaries. On occasions when the poorly trained IS troops have met well-organized opposition, even that of non-state entities like the Kurdish militias, the group’s performance has been less convincing. When greater military pressure was applied and Turkish support dwindled, IS went into retreat.\nIt is true that IS has ignited immense passion among many young and frustrated Muslims all over the world, and the caliphate idea holds great appeal among believers. But the relevant question is what can IS do, particularly in its current situation? The terrorist activities for which it recently took responsibility were perpetrated mostly by lone wolves who declared their allegiance to IS; they were not directed from Raqqa. On its own, IS is capable of only limited damage.\nA weak IS is, counterintuitively, preferable to a destroyed IS. IS is a magnet for radicalized Muslims in countries throughout the world. These volunteers are easier targets to identify, saving intelligence work. They acquire destructive skills in the fields of Syria and Iraq that are of undoubted concern if they return home, but some of them acquire shaheed status while still away – a blessing for their home countries. If IS is fully defeated, more of these people are likely to come home and cause trouble.\nIf IS loses control over its territory, the energies that went into protecting and governing a state will be directed toward organizing more terrorist attacks beyond its borders. The collapse of IS will produce a terrorist diaspora that might further radicalize Muslim immigrants in the West. Most counter-terrorism agencies understand this danger. Prolonging the life of IS probably assures the deaths of more Muslim extremists at the hands of other bad guys in the Middle East, and is likely to spare the West several terrorist attacks.\nThis is utter madness and lends support to the idea that ISIS was, if not an outright creation of a US-Israeli alliance, at least supported by both the United States and Israel. This is not realpolitik, or whatever its advocates might like to style it, it is hubris and dangerous lunacy.\nThese jokers claim to be expert strategists, and yet they reliably fail to predict even the most obvious events. And their advice is reliably terrible.",
  "tags": [
    "conspiracy",
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-24T10:32:00+00:00"
}