{
  "url": "https://voxday.net/2017/08/24/priming-is-confirmed-fake-science/",
  "scraped_at": "2025-12-19T10:21:22.293757",
  "title": "Priming is confirmed fake science",
  "date_display": "August 24, 2017",
  "date_iso": "2017-08-24T16:45:00+00:00",
  "date_from_url": "2017-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s sometimes a pity that science doesn’t have a simple “that’s obvious BS” card. Because I absolutely would have played it when <a href=\"https://replicationindex.wordpress.com/2017/02/02/reconstruction-of-a-train-wreck-how-priming-research-went-of-the-rails/comment-page-1/\">the hypothesis of “priming”</a> was not merely hypothesized, but asserted to be solid scientific fact:</p><blockquote><p>In 2011, Nobel Laureate Daniel Kahneman published a popular book, “Thinking Fast and Slow”, about an important finding in social psychology.<br> In the same year, questions about the trustworthiness of social psychology were raised.  A Dutch social psychologist had fabricated data. Eventually over 50 of his articles would be retracted.  Another social psychologist published results that appeared to demonstrate the ability to foresee random future events (Bem, 2011). Few researchers believed these results and statistical analysis suggested that the results were not trustworthy (Francis, 2012; Schimmack, 2012).  Psychologists started to openly question the credibility of published results.<br> In the beginning of 2012, Doyen and colleagues published a failure to replicate a prominent study by John Bargh that was featured in Daniel Kahneman’s book.  A few month later, Daniel Kahneman distanced himself from Bargh’s research in an open email addressed to John Bargh (Young, 2012):<br> “As all of you know, of course, questions have been raised about the robustness of priming results…. your field is now the poster child for doubts about the integrity of psychological research… people have now attached a question mark to the field, and it is your responsibility to remove it… all I have personally at stake is that I recently wrote a book that emphasizes priming research as a new approach to the study of associative memory…Count me as a general believer… My reason for writing this letter is that I see a train wreck looming.”<br> Five years later, Kahneman’s concerns have been largely confirmed. Major studies in social priming research have failed to replicate and the replicability of results in social psychology is estimated to be only 25% (OSC, 2015).<br> Looking back, it is difficult to understand the uncritical acceptance of social priming as a fact.  In “Thinking Fast and Slow” Kahneman wrote “disbelief is not an option. The results are not made up, nor are they statistical flukes. You have no choice but to accept that the major conclusions of these studies are true.”<br> Yet, Kahneman could have seen the train wreck coming. In 1971, he co-authored an article about scientists’ “exaggerated confidence in the validity of conclusions based on small samples” (Tversky &amp; Kahneman, 1971, p. 105).  Yet, many of the studies described in Kahneman’s book had small samples.  For example, Bargh’s priming study used only 30 undergraduate students to demonstrate the effect.</br></br></br></br></br></br></p></blockquote><p>I pay very little attention to “studies show” science for this reason.</p></div>",
  "content_text": "It’s sometimes a pity that science doesn’t have a simple “that’s obvious BS” card. Because I absolutely would have played it when\nthe hypothesis of “priming”\nwas not merely hypothesized, but asserted to be solid scientific fact:\nIn 2011, Nobel Laureate Daniel Kahneman published a popular book, “Thinking Fast and Slow”, about an important finding in social psychology.\nIn the same year, questions about the trustworthiness of social psychology were raised.  A Dutch social psychologist had fabricated data. Eventually over 50 of his articles would be retracted.  Another social psychologist published results that appeared to demonstrate the ability to foresee random future events (Bem, 2011). Few researchers believed these results and statistical analysis suggested that the results were not trustworthy (Francis, 2012; Schimmack, 2012).  Psychologists started to openly question the credibility of published results.\nIn the beginning of 2012, Doyen and colleagues published a failure to replicate a prominent study by John Bargh that was featured in Daniel Kahneman’s book.  A few month later, Daniel Kahneman distanced himself from Bargh’s research in an open email addressed to John Bargh (Young, 2012):\n“As all of you know, of course, questions have been raised about the robustness of priming results…. your field is now the poster child for doubts about the integrity of psychological research… people have now attached a question mark to the field, and it is your responsibility to remove it… all I have personally at stake is that I recently wrote a book that emphasizes priming research as a new approach to the study of associative memory…Count me as a general believer… My reason for writing this letter is that I see a train wreck looming.”\nFive years later, Kahneman’s concerns have been largely confirmed. Major studies in social priming research have failed to replicate and the replicability of results in social psychology is estimated to be only 25% (OSC, 2015).\nLooking back, it is difficult to understand the uncritical acceptance of social priming as a fact.  In “Thinking Fast and Slow” Kahneman wrote “disbelief is not an option. The results are not made up, nor are they statistical flukes. You have no choice but to accept that the major conclusions of these studies are true.”\nYet, Kahneman could have seen the train wreck coming. In 1971, he co-authored an article about scientists’ “exaggerated confidence in the validity of conclusions based on small samples” (Tversky & Kahneman, 1971, p. 105).  Yet, many of the studies described in Kahneman’s book had small samples.  For example, Bargh’s priming study used only 30 undergraduate students to demonstrate the effect.\nI pay very little attention to “studies show” science for this reason.",
  "tags": [
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-24T15:45:00+00:00"
}