{
  "url": "https://voxday.net/2017/08/11/quis-custodiet-ipsos-custodes-2/",
  "scraped_at": "2025-12-18T07:26:14.324907",
  "title": "Quis custodiet ipsos custodes?",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T00:57:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Google’s CEO <a href=\"https://www.recode.net/2017/8/10/16128380/google-cancels-all-hands-meeting-controversy-memo\">cancels a scheduled company-wide “townhall meeting”</a> for fear of the public knowing who is doing what there.</p><blockquote><p>Google’s CEO Sundar Pichai has cancelled its much anticipated meeting to talk about gender issues today. The move came after some of its employees expressed concern over online harassment they had begun to receive after their questions and names have been published outside the company on a variety of largely alt-right sites.<br> “We had hoped to have a frank, open discussion today as we always do to bring us together and move forward. But our Dory questions appeared externally this afternoon, and on some websites Googlers are now being named personally,” wrote Pichai to employees. “Googlers are writing in, concerned about their safety and worried they may be ‘outed’ publicly for asking a question in the Town Hall.”<br> Pichai was set to address the search giant’s 60,000 employees in 30 minutes in an all-hands meeting about a recent post by recently fired employee James Damore.<br> Several sites like this one [literally, this one -VD] has been publishing internal discussion posts and giving out information on those employees. In addition, in a move that many Googlers found already disturbing, Damore did his first major interview with alt-right YouTube personality, Stefan Molyneux (ironic, I know, since Google owns the online video giant).</br></br></br></p></blockquote><p>It’s cute they think we’re not going to find out what their internal discussions concern. Google spies on us, we keep an eye on them. Seems fair.<br> They’ll strike back soon enough. We’re expecting it. My prediction is a “surprise” leak of their critics’ embarrassing emails and URL histories.</br></p></div>",
  "content_text": "Google’s CEO\ncancels a scheduled company-wide “townhall meeting”\nfor fear of the public knowing who is doing what there.\nGoogle’s CEO Sundar Pichai has cancelled its much anticipated meeting to talk about gender issues today. The move came after some of its employees expressed concern over online harassment they had begun to receive after their questions and names have been published outside the company on a variety of largely alt-right sites.\n“We had hoped to have a frank, open discussion today as we always do to bring us together and move forward. But our Dory questions appeared externally this afternoon, and on some websites Googlers are now being named personally,” wrote Pichai to employees. “Googlers are writing in, concerned about their safety and worried they may be ‘outed’ publicly for asking a question in the Town Hall.”\nPichai was set to address the search giant’s 60,000 employees in 30 minutes in an all-hands meeting about a recent post by recently fired employee James Damore.\nSeveral sites like this one [literally, this one -VD] has been publishing internal discussion posts and giving out information on those employees. In addition, in a move that many Googlers found already disturbing, Damore did his first major interview with alt-right YouTube personality, Stefan Molyneux (ironic, I know, since Google owns the online video giant).\nIt’s cute they think we’re not going to find out what their internal discussions concern. Google spies on us, we keep an eye on them. Seems fair.\nThey’ll strike back soon enough. We’re expecting it. My prediction is a “surprise” leak of their critics’ embarrassing emails and URL histories.",
  "tags": [
    "#AltRight",
    "corpocracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-10T23:57:00+00:00"
}