{
  "url": "https://voxday.net/2017/08/23/removing-racist-statues/",
  "scraped_at": "2025-12-19T10:21:11.699625",
  "title": "Removing racist statues",
  "date_display": "August 23, 2017",
  "date_iso": "2017-08-23T09:29:00+00:00",
  "date_from_url": "2017-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s about time humanity stopped honoring that horrific racist, <a href=\"https://amp.timeinc.net/time/4521241/ghana-gandhi-statue-removing/\">Gandhi</a>:</p><blockquote><p>Ghana has said it will remove a statue of Mahatma Gandhi from a university campus in the nation’s capital where it had sparked protests over the leader’s allegedly racist attitudes.<br> The statue, which was unveiled by Indian President Pranab Mukherjee during his visit to Ghana in June, was meant to symbolize friendship between the two countries, according to Ghana’s Ministry of Foreign Affairs. But professors and students at the University of Ghana called the statue “a slap in the face” because of Gandhi’s “racist identity.” They started an online petition calling for the statue’s removal.<br> The petition, which had more than 1,700 supporters on Thursday, cited letters Gandhi wrote during his time in South Africa as evidence that he advocated for the superiority of Indians over black Africans. It also took issue with his use of the derogatory term kaffir to refer to native Africans and criticized the lack of statues of African heroes and heroines on campus.</br></br></p></blockquote><p>Any criticism of the Ghanaian action would, of course, be racist. Also, colonialism. Needless to say, all statues of Martin Luther King need to come down at once, since he was a communist and an adulterer.<br> Hey, wrecking history is fun!</br></p></div>",
  "content_text": "It’s about time humanity stopped honoring that horrific racist,\nGandhi\n:\nGhana has said it will remove a statue of Mahatma Gandhi from a university campus in the nation’s capital where it had sparked protests over the leader’s allegedly racist attitudes.\nThe statue, which was unveiled by Indian President Pranab Mukherjee during his visit to Ghana in June, was meant to symbolize friendship between the two countries, according to Ghana’s Ministry of Foreign Affairs. But professors and students at the University of Ghana called the statue “a slap in the face” because of Gandhi’s “racist identity.” They started an online petition calling for the statue’s removal.\nThe petition, which had more than 1,700 supporters on Thursday, cited letters Gandhi wrote during his time in South Africa as evidence that he advocated for the superiority of Indians over black Africans. It also took issue with his use of the derogatory term kaffir to refer to native Africans and criticized the lack of statues of African heroes and heroines on campus.\nAny criticism of the Ghanaian action would, of course, be racist. Also, colonialism. Needless to say, all statues of Martin Luther King need to come down at once, since he was a communist and an adulterer.\nHey, wrecking history is fun!",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-23T08:29:00+00:00"
}