{
  "url": "https://voxday.net/2017/08/17/republicans-for-antifa/",
  "scraped_at": "2025-12-19T10:20:29.828438",
  "title": "Republicans for Antifa",
  "date_display": "August 17, 2017",
  "date_iso": "2017-08-17T10:28:00+00:00",
  "date_from_url": "2017-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Republican establishment has gone <a href=\"http://www.breitbart.com/big-government/2017/08/16/mccain-romney-rubio-join-republicans-antifa-club/\">openly pro-Communist</a>:</p><blockquote><p>As James Bond’s nemesis Auric Goldfinger famously observed, “Once is happenstance, twice is coincidence. The third time is enemy action.” On Tuesday evening, three prominent Republicans — Senator John McCain, Senator Marco Rubio, and 2012 presidential candidate Mitt Romney — endorsed the left-wing media’s preferred narrative and embraced the masked thugs of Antifa as heroes.<br> McCain and Romney used almost identical language, bending their knees to the media narrative that only two factions were present in Charlottesville during the awful events of last weekend: white supremacist Nazis and “Americans standing up to defy hate and bigotry.”<br> Mitt Romney ✔ @MittRomney<br> No, not the same. One side is racist, bigoted, Nazi. The other opposes racism and bigotry. Morally different universes.<br> John McCain ✔ @SenJohnMcCain<br> There’s no moral equivalency between racists &amp; Americans standing up to defy hate&amp; bigotry. The President of the United States should say so<br> Neither of these gentlemen can claim ignorance of Antifa; the reason both of them piped up is that President Donald Trump mentioned them in his Tuesday press conference. Left-wing politicians and media personalities responded by thundering “there is only one side” for all right-thinking Americans to be on, because there was only one squad of villains on the ground in Charlottesville.<br> McCain and Romney obediently bent the knee to this narrative. At the very least, they’re agreeing Antifa should be invisible, accepting the incredibly stupid idea that calling out their violence somehow dilutes criticism of the Tiki Torch Terror. Mentioning Antifa is damned under the left’s new doctrine of “Whataboutism,” which originally held that history began with the inauguration of President Trump and all prior Democrat sins were absolved, but has mutated into an unlimited free pass for the #Resistance to do whatever it takes to bring down the Trump administration without a peep of protest from tame Republicans.<br> Senator Marco Rubio went much, much further. He launched a brief tweetstorm that completely absolved Antifa of all responsibility for its actions in Charlottesville, blaming all violence “one hundred percent” on those who organized the events leading to the “Charlottesville terrorist attack”.</br></br></br></br></br></br></br></br></p></blockquote><p>A photo from the Communist 3rd International. Notice the Antifa flag at the center. This is what the Republican establishment now supports. This is why the Alt-Right is not only inevitable, it is the only real Right that remains.</p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DHa7LjOXcAAxIEv.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"575\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"287\" src=\"https://pbs.twimg.com/media/DHa7LjOXcAAxIEv.jpg\" width=\"400\"/></a></div></div>",
  "content_text": "The Republican establishment has gone\nopenly pro-Communist\n:\nAs James Bond’s nemesis Auric Goldfinger famously observed, “Once is happenstance, twice is coincidence. The third time is enemy action.” On Tuesday evening, three prominent Republicans — Senator John McCain, Senator Marco Rubio, and 2012 presidential candidate Mitt Romney — endorsed the left-wing media’s preferred narrative and embraced the masked thugs of Antifa as heroes.\nMcCain and Romney used almost identical language, bending their knees to the media narrative that only two factions were present in Charlottesville during the awful events of last weekend: white supremacist Nazis and “Americans standing up to defy hate and bigotry.”\nMitt Romney ✔ @MittRomney\nNo, not the same. One side is racist, bigoted, Nazi. The other opposes racism and bigotry. Morally different universes.\nJohn McCain ✔ @SenJohnMcCain\nThere’s no moral equivalency between racists & Americans standing up to defy hate& bigotry. The President of the United States should say so\nNeither of these gentlemen can claim ignorance of Antifa; the reason both of them piped up is that President Donald Trump mentioned them in his Tuesday press conference. Left-wing politicians and media personalities responded by thundering “there is only one side” for all right-thinking Americans to be on, because there was only one squad of villains on the ground in Charlottesville.\nMcCain and Romney obediently bent the knee to this narrative. At the very least, they’re agreeing Antifa should be invisible, accepting the incredibly stupid idea that calling out their violence somehow dilutes criticism of the Tiki Torch Terror. Mentioning Antifa is damned under the left’s new doctrine of “Whataboutism,” which originally held that history began with the inauguration of President Trump and all prior Democrat sins were absolved, but has mutated into an unlimited free pass for the #Resistance to do whatever it takes to bring down the Trump administration without a peep of protest from tame Republicans.\nSenator Marco Rubio went much, much further. He launched a brief tweetstorm that completely absolved Antifa of all responsibility for its actions in Charlottesville, blaming all violence “one hundred percent” on those who organized the events leading to the “Charlottesville terrorist attack”.\nA photo from the Communist 3rd International. Notice the Antifa flag at the center. This is what the Republican establishment now supports. This is why the Alt-Right is not only inevitable, it is the only real Right that remains.",
  "tags": [
    "cuckservative",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-17T09:28:00+00:00"
}