{
  "url": "https://voxday.net/2017/08/26/sebastian-gorka-resigns/",
  "scraped_at": "2025-12-19T10:21:34.140415",
  "title": "Sebastian Gorka resigns",
  "date_display": "August 26, 2017",
  "date_iso": "2017-08-26T13:00:00+00:00",
  "date_from_url": "2017-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another MAGA figure <a href=\"http://thefederalist.com/2017/08/25/breaking-sebastian-gorka-resigns-from-trump-administration/\">leaves the Trump administration</a>:</p><blockquote><p>Sebastian Gorka, the brusque national security aide to President Donald Trump, reportedly resigned his post as deputy assistant to the president late Friday.<br> The Federalist reports Gorka wrote a scathing resignation letter that sharply criticized the president’s newly unveiled strategy for the war in Afghanistan, and savaging White House rivals who he claims oppose the Trump agenda.<br> “[G]iven recent events, it is clear to me that forces that do not support the MAGA promise are – for now – ascendant within the White House,” Gorka wrote. “As a result, the best and most effective way I can support you, Mr. President, is from outside the People’s House.”<br> “Regrettably, outside of yourself, the individuals who most embodied and represented the policies that will ‘Make America Great Again,’ have been internally countered, systematically removed, or undermined in recent months.”</br></br></br></p></blockquote><p>It’s disappointing to see Trump surrounded by the same sort of anti-American politicos that made up the bulk of the Bush-Clinton-Bush-Obama administrations. But – and I cannot stress this enough – do not make the mistake of counting the God-Emperor out. Things are not always as they seem, and like Chesty Puller, Trump is at his best when he is surrounded by his enemies.<br> They can’t get away from him now.</br></p></div>",
  "content_text": "Another MAGA figure\nleaves the Trump administration\n:\nSebastian Gorka, the brusque national security aide to President Donald Trump, reportedly resigned his post as deputy assistant to the president late Friday.\nThe Federalist reports Gorka wrote a scathing resignation letter that sharply criticized the president’s newly unveiled strategy for the war in Afghanistan, and savaging White House rivals who he claims oppose the Trump agenda.\n“[G]iven recent events, it is clear to me that forces that do not support the MAGA promise are – for now – ascendant within the White House,” Gorka wrote. “As a result, the best and most effective way I can support you, Mr. President, is from outside the People’s House.”\n“Regrettably, outside of yourself, the individuals who most embodied and represented the policies that will ‘Make America Great Again,’ have been internally countered, systematically removed, or undermined in recent months.”\nIt’s disappointing to see Trump surrounded by the same sort of anti-American politicos that made up the bulk of the Bush-Clinton-Bush-Obama administrations. But – and I cannot stress this enough – do not make the mistake of counting the God-Emperor out. Things are not always as they seem, and like Chesty Puller, Trump is at his best when he is surrounded by his enemies.\nThey can’t get away from him now.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-26T12:00:00+00:00"
}