{
  "url": "https://voxday.net/2017/08/25/senior-officials-are-why-we-cant-have-america-back/",
  "scraped_at": "2025-12-19T10:21:23.812480",
  "title": "Senior officials are why we can’t have America back",
  "date_display": "August 25, 2017",
  "date_iso": "2017-08-25T00:00:00+00:00",
  "date_from_url": "2017-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The God-Emperor really needs to step up <a href=\"http://www.breitbart.com/big-government/2017/08/24/reports-globalists-white-house-oppose-trumps-border-wall-reforms/\">his White House-cleaning</a>:</p><blockquote><p>The same emphasis on tax cuts for the elite before immigration reform for voters was also cited by Axios on August 20, in an article which claimed to explain why top staff chose to stay in the White House amid elite hatred of his populist, wage-boosting, pro-American priorities. Axios reported:<br> <i>We talked to a half dozen senior administration officials, who range from dismayed but certain to stay, to disgusted and likely soon to leave. They all work closely with Trump and his senior team so, of course, wouldn’t talk on the record. Instead, they agreed to let us distill their thinking/rationale:</i><br> <i><br> </br></i><i>“You have no idea how much crazy stuff we kill”: The most common response centers on the urgent importance of having smart, sane people around Trump to fight his worst impulses. If they weren’t there, they say, we would have a trade war with China, massive deportations, and a government shutdown to force construction of a Southern wall.</i><br> <i><br> </br></i><i>“General Mattis needs us”: Many talk about their reluctance to bolt on their friends and colleagues who are fighting the good fight to force better Trump behavior/decisions. They rightly point out that together, they have learned how to ignore Trump’s rhetoric and, at times, collectively steer him to more conventional policy responses.</i></br></br></br></p></blockquote><p>Massive deportations, a government shutdown, and a big beautiful Wall? Sounds pretty damned good to me!<br> What is wrong, I wonder, with presidents who get elected on the basis of a few key issues, then allow themselves to get talked out of their campaign promises despite having seen how exactly the same process has never worked out for any previous president?<br> Deportations and a big border wall are what Americans want. The God-Emperor must listen to them, and not the elitist morons who supposedly work for him. If I were him, I’d fire every single senior administration official who advised against building the wall immediately.<br> He’s a man who understands the importance of loyalty, but the flip side of rewarding loyalty is being unmerciless to the disloyal.</br></br></br></p></div>",
  "content_text": "The God-Emperor really needs to step up\nhis White House-cleaning\n:\nThe same emphasis on tax cuts for the elite before immigration reform for voters was also cited by Axios on August 20, in an article which claimed to explain why top staff chose to stay in the White House amid elite hatred of his populist, wage-boosting, pro-American priorities. Axios reported:\nWe talked to a half dozen senior administration officials, who range from dismayed but certain to stay, to disgusted and likely soon to leave. They all work closely with Trump and his senior team so, of course, wouldn’t talk on the record. Instead, they agreed to let us distill their thinking/rationale:\n“You have no idea how much crazy stuff we kill”: The most common response centers on the urgent importance of having smart, sane people around Trump to fight his worst impulses. If they weren’t there, they say, we would have a trade war with China, massive deportations, and a government shutdown to force construction of a Southern wall.\n“General Mattis needs us”: Many talk about their reluctance to bolt on their friends and colleagues who are fighting the good fight to force better Trump behavior/decisions. They rightly point out that together, they have learned how to ignore Trump’s rhetoric and, at times, collectively steer him to more conventional policy responses.\nMassive deportations, a government shutdown, and a big beautiful Wall? Sounds pretty damned good to me!\nWhat is wrong, I wonder, with presidents who get elected on the basis of a few key issues, then allow themselves to get talked out of their campaign promises despite having seen how exactly the same process has never worked out for any previous president?\nDeportations and a big border wall are what Americans want. The God-Emperor must listen to them, and not the elitist morons who supposedly work for him. If I were him, I’d fire every single senior administration official who advised against building the wall immediately.\nHe’s a man who understands the importance of loyalty, but the flip side of rewarding loyalty is being unmerciless to the disloyal.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-24T23:00:00+00:00"
}