{
  "url": "https://voxday.net/2017/08/20/setbacks-are-not-defeat/",
  "scraped_at": "2025-12-19T10:20:50.913768",
  "title": "Setbacks are not defeat",
  "date_display": "August 20, 2017",
  "date_iso": "2017-08-20T10:43:00+00:00",
  "date_from_url": "2017-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Never confuse a tactical defeat, like the ambush rally in Charlottesville, with a strategic one. Look at the poll numbers <a href=\"https://apnews.com/10025226f5e54d96bda23524225b6897/Dems-risk-culture-war-fight-in-Charlottesville-response\">on the issue of historical heritage</a>:</p><blockquote><p>President Donald Trump’s widely criticized response to white supremacist violence in Virginia has left Democrats in a quandary: how to seize the moral high ground without getting sucked into a politically perilous culture war.<br> Democrats have denounced Trump for blaming “both sides” for deadly protests in Charlottesville, Virginia, and, more recently, for defending Confederate monuments.<br> But the party faces a complex task: While addressing race and history in ways that reflect the party’s values, Democrats also need to focus on issues like jobs and the economy that resonate with a wider range of voters, including white independents, ahead of the 2018 midterm election.<br> The party has been looking to answer Trump’s populism by crafting its own middle-class brand, yet Democratic leaders across multiple states now are pushing to take down Old South monuments like the one that ostensibly sparked the events in Charlottesville, and three rank-and-file House Democrats want to pursue a congressional censure of the president.<br> In interviews this week before his resignation was announced Friday, White House strategist Steve Bannon gleefully suggested Democrats are falling into a trap.<br> “I want them to talk about racism every day,” Bannon told The American Prospect, a liberal magazine. “If the left is focused on race and identity, and we go with economic nationalism, we can crush the Democrats.”<br> Trump himself has called Confederate memorials, most of them actually erected decades after the Civil War, “beautiful statues” that reflect “our nation’s history and culture.”<br> Polls taken after last weekend’s violence offer some evidence backing Bannon’s and Trump’s view. While polls found widespread disgust with white supremacists, a Marist Poll for NPR and PBS found that just 27 percent of adults queried believe Confederate monuments “should be removed because they are offensive.” About two out of three white and Latino respondents said they should remain, as did 44 percent of black respondents.</br></br></br></br></br></br></br></p></blockquote><p>No wonder Bannon is slavering to get back into action. I still believe Trump needs to BUILD THE WALL to ensure his reelection, but Defend American History is clearly a massively winning issue for him, both in the 2018 midterms and the 2020 presidential campaign.<br> Especially when idiot Republican establishment figures are scurrying to line up in defense of antifa. Sometimes a tactical defeat is more strategically useful than a victory, which in this case is a little ironic, considering that the Democrats were planning the precise opposite for Charlottesville.</br></p></div>",
  "content_text": "Never confuse a tactical defeat, like the ambush rally in Charlottesville, with a strategic one. Look at the poll numbers\non the issue of historical heritage\n:\nPresident Donald Trump’s widely criticized response to white supremacist violence in Virginia has left Democrats in a quandary: how to seize the moral high ground without getting sucked into a politically perilous culture war.\nDemocrats have denounced Trump for blaming “both sides” for deadly protests in Charlottesville, Virginia, and, more recently, for defending Confederate monuments.\nBut the party faces a complex task: While addressing race and history in ways that reflect the party’s values, Democrats also need to focus on issues like jobs and the economy that resonate with a wider range of voters, including white independents, ahead of the 2018 midterm election.\nThe party has been looking to answer Trump’s populism by crafting its own middle-class brand, yet Democratic leaders across multiple states now are pushing to take down Old South monuments like the one that ostensibly sparked the events in Charlottesville, and three rank-and-file House Democrats want to pursue a congressional censure of the president.\nIn interviews this week before his resignation was announced Friday, White House strategist Steve Bannon gleefully suggested Democrats are falling into a trap.\n“I want them to talk about racism every day,” Bannon told The American Prospect, a liberal magazine. “If the left is focused on race and identity, and we go with economic nationalism, we can crush the Democrats.”\nTrump himself has called Confederate memorials, most of them actually erected decades after the Civil War, “beautiful statues” that reflect “our nation’s history and culture.”\nPolls taken after last weekend’s violence offer some evidence backing Bannon’s and Trump’s view. While polls found widespread disgust with white supremacists, a Marist Poll for NPR and PBS found that just 27 percent of adults queried believe Confederate monuments “should be removed because they are offensive.” About two out of three white and Latino respondents said they should remain, as did 44 percent of black respondents.\nNo wonder Bannon is slavering to get back into action. I still believe Trump needs to BUILD THE WALL to ensure his reelection, but Defend American History is clearly a massively winning issue for him, both in the 2018 midterms and the 2020 presidential campaign.\nEspecially when idiot Republican establishment figures are scurrying to line up in defense of antifa. Sometimes a tactical defeat is more strategically useful than a victory, which in this case is a little ironic, considering that the Democrats were planning the precise opposite for Charlottesville.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-20T09:43:00+00:00"
}