{
  "url": "https://voxday.net/2017/08/13/sjws-are-the-tolkienian-devil/",
  "scraped_at": "2025-12-19T10:20:09.441266",
  "title": "SJWs are the Tolkienian devil",
  "date_display": "August 13, 2017",
  "date_iso": "2017-08-13T18:08:00+00:00",
  "date_from_url": "2017-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They create nothing. Like Melkor, all they can do is corrupt, pervert, and destroy. SF/F Grandmaster John C. Wright <a href=\"http://www.scifiwright.com/2017/08/sjw-shadow/\">waxes wroth</a> in response to the SJW version of The Shadow:</p><blockquote><p>Dynamite Comics just put out a new version of The Shadow. The Shadow is and has been my most deeply beloved character of my imaginative life.<br> They turned him into an SJW who lectures villains on their white privilege.<br> I am not making this up.<br> While in the middle of gunning down two Virginia Tech style mass murderers, The SJW Shadow tells them that they were born atop a pedistal of privilege, and their loss of power when the minorities lives improve erodes their “empire”, which is what drives them to their crimes.<br> Except that the shooter at Virginia Tech was Korean. Columbine guys were white, but were leftwing atheists, not angry white men. The Left yearns so badly to blame white men for mass murders, that they usually report the shooter is a Tea Party member. And it usually turns out to be a jihadist, or a Bernie supporter. But in a comic, the Leftist can reverse the polarity of reality, and have the most proto-Objectivist hardcore vigilante in comicbookdom turn into a morally ambiguous Antifas lefteroon.<br> The comic also pauses to have the viewpoint character, a Hispanic woman, say that there are no heroes in life, merely violent men. Heroes are merely gangsters in white hats.<br> Interesting message to put in a story about the most iconic vigilante of all time, the human version of an archangel of merciless wrath-of-heavenly vengeance.<br> And a thinly disguised version of President Trump appears on the telly in the background, as evidence of the sickness of the world for daring to regard good as better than evil.</br></br></br></br></br></br></br></p></blockquote><p>I can guarantee this is not happening with Alt-Hero. We will create. We will make anew. There will be heroes and there will be villains.<br> Coming soon.</br></p></div>",
  "content_text": "They create nothing. Like Melkor, all they can do is corrupt, pervert, and destroy. SF/F Grandmaster John C. Wright\nwaxes wroth\nin response to the SJW version of The Shadow:\nDynamite Comics just put out a new version of The Shadow. The Shadow is and has been my most deeply beloved character of my imaginative life.\nThey turned him into an SJW who lectures villains on their white privilege.\nI am not making this up.\nWhile in the middle of gunning down two Virginia Tech style mass murderers, The SJW Shadow tells them that they were born atop a pedistal of privilege, and their loss of power when the minorities lives improve erodes their “empire”, which is what drives them to their crimes.\nExcept that the shooter at Virginia Tech was Korean. Columbine guys were white, but were leftwing atheists, not angry white men. The Left yearns so badly to blame white men for mass murders, that they usually report the shooter is a Tea Party member. And it usually turns out to be a jihadist, or a Bernie supporter. But in a comic, the Leftist can reverse the polarity of reality, and have the most proto-Objectivist hardcore vigilante in comicbookdom turn into a morally ambiguous Antifas lefteroon.\nThe comic also pauses to have the viewpoint character, a Hispanic woman, say that there are no heroes in life, merely violent men. Heroes are merely gangsters in white hats.\nInteresting message to put in a story about the most iconic vigilante of all time, the human version of an archangel of merciless wrath-of-heavenly vengeance.\nAnd a thinly disguised version of President Trump appears on the telly in the background, as evidence of the sickness of the world for daring to regard good as better than evil.\nI can guarantee this is not happening with Alt-Hero. We will create. We will make anew. There will be heroes and there will be villains.\nComing soon.",
  "tags": [
    "Alt-Hero",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-13T17:08:00+00:00"
}