{
  "url": "https://voxday.net/2017/08/12/sjws-always-project/",
  "scraped_at": "2025-12-19T10:20:04.984624",
  "title": "SJWs always project",
  "date_display": "August 12, 2017",
  "date_iso": "2017-08-12T21:51:00+00:00",
  "date_from_url": "2017-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And what they are projecting is fear. Lots and lots of fear. SF-SJW David Gerrold rants on Facebook:</p><blockquote><p>“After my initial flash of anger more than two years ago, I have said little about rabid puppies, sad puppies, and their pathetic efforts to stuff the various ballot boxes for awards.<br> Several reasons. I consider their “movement” to be a sad desperate effort by angry little men, and because I have more important things to do than invest energy in self-destructive attention-bores. And finally, because negativity in some creates negativity in others — the only way to win that game is to not play.<br> But while the rabid puppies movement in SF is a mostly unimportant flicker, eventually to be forgotten as a momentary annoyance, it still has to be seen as a symptom of something worse, the rise of neo-nazis tactics in the national conversation.<br> It’s no accident that Vox Bray and Milo Yiannazinuts are working off the same page. They are not “the alt-right” — that’s a euphemism. They’re not just assholes, committed to specific cultural disruptions, they’re shit-magnets, hoping to create power by attracting the worst of the worst<br> as followers.<br> This week, the so-called “alt-right” have revealed themselves to be the fault-right. They have paraded through the streets of an American city waving the flags of treason and genocide.<br> Americans of good will have the right to be concerned. We have the right to be frustrated. And finally, we have the right to be justifiably angry at the behavior of spoiled little white boys.<br> The tiki-torch marchers have revealed themselves to be political illiterates, historically ignorant, and little more than a cluster of desperate little wannabe bullies. Their shouts of defiance are intended to intimidate the rest of us into fearful silence.<br> It won’t work.<br> Okay, it’ll work for a while. This week’s exercises in torch-waving and dick-waggling will inspire other, equally silly demonstrations of disloyalty to the American ideal.<br> But eventually — and it cannot come too soon for me — the men and women who have actually taken an oath to defend the United States and its Constitution will be called upon to deal with this attempt to create a new Civil War.<br> If I were a conspiracy theorist, I would argue that there are groups in this nation committed not only to a new Civil War, but ultimately the destruction of the United States government and the Constitution, so that they can replace it with a theocratic fascism.<br> If I were a conspiracy theorist, I would trace all this back to the Fred Koch’s funding of the John Birch Society and I would point out that the game plan they’ve been following for fifty years can be found in the Blue Book and the Black Book of that group — the English translations of Mein Kampf.<br> If I were a conspiracy theorist, I would further argue that the failure of the police to act against these thugs is a result of a decades-long campaign to infiltrate police departments with white supremacists.<br> But one doesn’t have to be a conspiracy theorist to see the dangers inherent in the neo-nazi tactics of those who falsely believe that their time has come. They are an ugly political minority, a cancer on the American soul.<br> We have not yet found our new Gandhi, our new Martin Luther King, our new Harvey Milk — but there will come a day when the rest of us find our voice and draw a line in the sand. Perhaps we need not a single voice, but a whole chorus of voices speaking out, calling shame on those who have become enemies of the very nation that nurtured them and protected their freedom.<br> The United States is a nation of immigrants, it is a nation whose strength is diversity. The promise of America is liberty and justice for all. When the all of us are ready to confront the some of us, there will likely be violence, that’s what they are working toward, that’s why they are working themselves into a blather — but if the last Civil War couldn’t break the Union, I doubt very much that this latest rabble of desperate and pathetic little losers will accomplish anything useful, except perhaps to give themselves further reasons to fester in self-destructive bitterness. They are pathetic, desperate, fearful little men.”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Another thing I noticed. SJWs not only always project, they’re always waiting for someone else to show up and do their fighting for them.</p></div>",
  "content_text": "And what they are projecting is fear. Lots and lots of fear. SF-SJW David Gerrold rants on Facebook:\n“After my initial flash of anger more than two years ago, I have said little about rabid puppies, sad puppies, and their pathetic efforts to stuff the various ballot boxes for awards.\nSeveral reasons. I consider their “movement” to be a sad desperate effort by angry little men, and because I have more important things to do than invest energy in self-destructive attention-bores. And finally, because negativity in some creates negativity in others — the only way to win that game is to not play.\nBut while the rabid puppies movement in SF is a mostly unimportant flicker, eventually to be forgotten as a momentary annoyance, it still has to be seen as a symptom of something worse, the rise of neo-nazis tactics in the national conversation.\nIt’s no accident that Vox Bray and Milo Yiannazinuts are working off the same page. They are not “the alt-right” — that’s a euphemism. They’re not just assholes, committed to specific cultural disruptions, they’re shit-magnets, hoping to create power by attracting the worst of the worst\nas followers.\nThis week, the so-called “alt-right” have revealed themselves to be the fault-right. They have paraded through the streets of an American city waving the flags of treason and genocide.\nAmericans of good will have the right to be concerned. We have the right to be frustrated. And finally, we have the right to be justifiably angry at the behavior of spoiled little white boys.\nThe tiki-torch marchers have revealed themselves to be political illiterates, historically ignorant, and little more than a cluster of desperate little wannabe bullies. Their shouts of defiance are intended to intimidate the rest of us into fearful silence.\nIt won’t work.\nOkay, it’ll work for a while. This week’s exercises in torch-waving and dick-waggling will inspire other, equally silly demonstrations of disloyalty to the American ideal.\nBut eventually — and it cannot come too soon for me — the men and women who have actually taken an oath to defend the United States and its Constitution will be called upon to deal with this attempt to create a new Civil War.\nIf I were a conspiracy theorist, I would argue that there are groups in this nation committed not only to a new Civil War, but ultimately the destruction of the United States government and the Constitution, so that they can replace it with a theocratic fascism.\nIf I were a conspiracy theorist, I would trace all this back to the Fred Koch’s funding of the John Birch Society and I would point out that the game plan they’ve been following for fifty years can be found in the Blue Book and the Black Book of that group — the English translations of Mein Kampf.\nIf I were a conspiracy theorist, I would further argue that the failure of the police to act against these thugs is a result of a decades-long campaign to infiltrate police departments with white supremacists.\nBut one doesn’t have to be a conspiracy theorist to see the dangers inherent in the neo-nazi tactics of those who falsely believe that their time has come. They are an ugly political minority, a cancer on the American soul.\nWe have not yet found our new Gandhi, our new Martin Luther King, our new Harvey Milk — but there will come a day when the rest of us find our voice and draw a line in the sand. Perhaps we need not a single voice, but a whole chorus of voices speaking out, calling shame on those who have become enemies of the very nation that nurtured them and protected their freedom.\nThe United States is a nation of immigrants, it is a nation whose strength is diversity. The promise of America is liberty and justice for all. When the all of us are ready to confront the some of us, there will likely be violence, that’s what they are working toward, that’s why they are working themselves into a blather — but if the last Civil War couldn’t break the Union, I doubt very much that this latest rabble of desperate and pathetic little losers will accomplish anything useful, except perhaps to give themselves further reasons to fester in self-destructive bitterness. They are pathetic, desperate, fearful little men.”\nAnother thing I noticed. SJWs not only always project, they’re always waiting for someone else to show up and do their fighting for them.",
  "tags": [
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-12T20:51:00+00:00"
}