{
  "url": "https://voxday.net/2017/08/11/squeaks/",
  "scraped_at": "2025-12-18T07:26:21.643752",
  "title": "Squeaks",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T15:51:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The following is an excerpt from one of the many hilarious stories in LawDog’s second straight bestseller, <b><a href=\"http://amzn.to/2tY41YU\">THE LAWDOG FILES: AFRICAN ADVENTURES</a>.</b></i><br> <b><i><br> </br></i></b><b><i>SQUEAKS, Part 1</i></b><br> <b><i><br> </br></i></b>Many, MANY moons ago—and don’t even ask, ’cause I won’t tell you—when I was still a pup, the family lived in Nigeria. We had a bungalow at the Odibo Estates, out near the Biafran border. Every evening peddlers, called traders, used to walk up and down the main road, offering various knick-knacks and merchandise for sale or trade.<br> <a href=\"https://www.amazon.com/LawDog-Files-African-Adventures-ebook/dp/B0742GD4B7/ref=as_li_ss_il?_encoding=UTF8&amp;psc=1&amp;refRID=KQDHXWQ89WNAM2QQNV45&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=d118d29574fafb0a6a6db9a7645587a4\" rel=\"noopener\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B0742GD4B7&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B0742GD4B7&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>Ali Cheap-Cheap was one of the busier traders, and he spent a lot of time on our front porch haggling with Mom. Now, Ali Cheap-Cheap was very proud of his ability to acquire just about anything you might want or need.<br> One evening, Mom was visiting on the front porch with the visiting wife of one of the English engineers. Said wife had never been outside of London before, and as a consequence, she loathed Africa. She and Mom were chattering and griping when along came Ali Cheap-Cheap. Old Ali Cheap-Cheap didn’t have anything that Mom or the English lady wanted, so, before he wandered off, he asked if, “Madams want for anything?”<br> The English lady got a funny look in her eye, tapped her snake-hide purse and said, “I want one of these.” “Yes, madam,” replied Ali, and off he trotted.<br> About three weeks later, Mom and her new English friend were on the front porch again, when along came Ali Cheap-Cheap. With a friend. Ali and friend had a cane pole slung over their shoulders, and there was a burlap bag hanging from said pole.<br> Now, at this point I should mention that also on the front porch, in addition to the two ladies, was a Mongoose-a-minium, in which lived our pet kusimanse, or as it is known to science, <i>Helogale parvula</i>, the pygmy mongoose. This Mongoose-a-minium had a Plexiglas ceiling which Dad had assured us was unbreakable.<br> Riiiight.<br> Up to the porch came Ali Cheap-Cheap and his buddy.<br> Mom was eyeing the burlap bag with some trepidation, having had some nasty experiences with what the locals tended to store in burlap bags, when Ali and buddy proudly lifted it and announced to the English lady, “Oh, madam! We have your beef!”<br> I should interject here that “beef” is bush slang for any animal.<br> Wait for it.<br> Mom had risen to her full height, and was about to order Ali to get his beef away from her house, when Squeaker, our pygmy mongoose, wandered out of his apartment, and screamed in sheer outrage. It was always amazing how much sheer volume that little hairball could put out. Ali and his buddy were startled by the shriek and dropped the burlap sack onto the Plexiglass roof of Squeaker’s residence.<br> The unbreakable glass promptly shattered and caused the burlap sack and its contents to fall into the Mongoose-a-minium. It turned out that inside said sack was one observably scared 15-foot python.<br> Squeaker, who was about the size and girth of a tennis ball, offered up a brief prayer to the Mongoose God for the meal he was about to partake of, and latched onto the snake’s tail with tooth and claw.<br> The snake discovered that he has been dumped into a place which reeks of mongoose, panicked and attempted to slide up the side of the Mongoose-a-minium and down onto the porch, but was hindered in doing so by Squeaker, who was not only still firmly attached to the python’s tail, but was bracing all four legs against the wall to prevent his meal from getting away.<br> Did I mention that the snake was approximately fifteen feet long?<br> Squeaker didn’t even slow him down.<br> The python hit the porch floor with Squeaks gnawing away at his tail like a chipmunk on speed, and noticed that, in the interest of ventilation, the sliding glass door in the front of our house was open about six inches.<br> Yep. You guessed it. In goes the snake.<br> Now, Dad and one of his Brit buddies named Tom were sitting in the house, drinking whiskey-and-sodas. Tom looked down and saw several yards of snake whip by, shrieked, and made a flat-footed, sitting-down leap all the way from the sofa to the top of the bar. Whereupon he proceeded to utter genteel curses upon all and sundry at the top of his lungs.<br> Dad looked down, lifted his feet, ensured that his drink didn’t tip over, and watched the snake haul scales with bemused interest. Dad didn’t ruffle easily.<br> <i>And yes, things just got crazier from there. If you haven’t acquired a copy of LawDog’s African adventures yet, you really must. It’s genuinely THAT funny.</i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "The following is an excerpt from one of the many hilarious stories in LawDog’s second straight bestseller,\nTHE LAWDOG FILES: AFRICAN ADVENTURES\n.\nSQUEAKS, Part 1\nMany, MANY moons ago—and don’t even ask, ’cause I won’t tell you—when I was still a pup, the family lived in Nigeria. We had a bungalow at the Odibo Estates, out near the Biafran border. Every evening peddlers, called traders, used to walk up and down the main road, offering various knick-knacks and merchandise for sale or trade.\nAli Cheap-Cheap was one of the busier traders, and he spent a lot of time on our front porch haggling with Mom. Now, Ali Cheap-Cheap was very proud of his ability to acquire just about anything you might want or need.\nOne evening, Mom was visiting on the front porch with the visiting wife of one of the English engineers. Said wife had never been outside of London before, and as a consequence, she loathed Africa. She and Mom were chattering and griping when along came Ali Cheap-Cheap. Old Ali Cheap-Cheap didn’t have anything that Mom or the English lady wanted, so, before he wandered off, he asked if, “Madams want for anything?”\nThe English lady got a funny look in her eye, tapped her snake-hide purse and said, “I want one of these.” “Yes, madam,” replied Ali, and off he trotted.\nAbout three weeks later, Mom and her new English friend were on the front porch again, when along came Ali Cheap-Cheap. With a friend. Ali and friend had a cane pole slung over their shoulders, and there was a burlap bag hanging from said pole.\nNow, at this point I should mention that also on the front porch, in addition to the two ladies, was a Mongoose-a-minium, in which lived our pet kusimanse, or as it is known to science,\nHelogale parvula\n, the pygmy mongoose. This Mongoose-a-minium had a Plexiglas ceiling which Dad had assured us was unbreakable.\nRiiiight.\nUp to the porch came Ali Cheap-Cheap and his buddy.\nMom was eyeing the burlap bag with some trepidation, having had some nasty experiences with what the locals tended to store in burlap bags, when Ali and buddy proudly lifted it and announced to the English lady, “Oh, madam! We have your beef!”\nI should interject here that “beef” is bush slang for any animal.\nWait for it.\nMom had risen to her full height, and was about to order Ali to get his beef away from her house, when Squeaker, our pygmy mongoose, wandered out of his apartment, and screamed in sheer outrage. It was always amazing how much sheer volume that little hairball could put out. Ali and his buddy were startled by the shriek and dropped the burlap sack onto the Plexiglass roof of Squeaker’s residence.\nThe unbreakable glass promptly shattered and caused the burlap sack and its contents to fall into the Mongoose-a-minium. It turned out that inside said sack was one observably scared 15-foot python.\nSqueaker, who was about the size and girth of a tennis ball, offered up a brief prayer to the Mongoose God for the meal he was about to partake of, and latched onto the snake’s tail with tooth and claw.\nThe snake discovered that he has been dumped into a place which reeks of mongoose, panicked and attempted to slide up the side of the Mongoose-a-minium and down onto the porch, but was hindered in doing so by Squeaker, who was not only still firmly attached to the python’s tail, but was bracing all four legs against the wall to prevent his meal from getting away.\nDid I mention that the snake was approximately fifteen feet long?\nSqueaker didn’t even slow him down.\nThe python hit the porch floor with Squeaks gnawing away at his tail like a chipmunk on speed, and noticed that, in the interest of ventilation, the sliding glass door in the front of our house was open about six inches.\nYep. You guessed it. In goes the snake.\nNow, Dad and one of his Brit buddies named Tom were sitting in the house, drinking whiskey-and-sodas. Tom looked down and saw several yards of snake whip by, shrieked, and made a flat-footed, sitting-down leap all the way from the sofa to the top of the bar. Whereupon he proceeded to utter genteel curses upon all and sundry at the top of his lungs.\nDad looked down, lifted his feet, ensured that his drink didn’t tip over, and watched the snake haul scales with bemused interest. Dad didn’t ruffle easily.\nAnd yes, things just got crazier from there. If you haven’t acquired a copy of LawDog’s African adventures yet, you really must. It’s genuinely THAT funny.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-11T14:51:00+00:00"
}