{
  "url": "https://voxday.net/2017/08/29/starbucks-is-not-the-answer/",
  "scraped_at": "2025-12-19T10:21:55.157416",
  "title": "Starbucks is not the answer",
  "date_display": "August 29, 2017",
  "date_iso": "2017-08-29T17:21:00+00:00",
  "date_from_url": "2017-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sadly, it turns out that putting a coffee shop and an art gallery on the corner <a href=\"https://jacobinmag.com/2017/08/new-urban-crisis-review-richard-florida\">is not the ticket</a> to economic revitalization:</p><blockquote><p>One of the most influential thinkers about cities in postwar America, wants you to know that he got almost everything about cities wrong.<br> If you live in an urban center in North America, the United Kingdom, or Australia, you are living in Richard Florida’s world. Fifteen years ago, he argued that an influx of what he called the “creative classes” — artists, hipsters, tech workers — were sparking economic growth in places like the Bay Area. Their tolerance, flexibility, and eccentricity dissolved the rigid structures of industrial production and replaced them with the kinds of workplaces and neighborhoods that attracted more young people and, importantly, more investment.<br> His observations quickly formed the basis of a set of breezy technical solutions. If decaying cities wanted to survive, they had to open cool bars, shabby-chic coffee shops, and art venues that attract young, educated, and tolerant residents. Eventually, the mysterious alchemy of the creative economy would build a new and prosperous urban core.<br> Today, even Florida recognizes that he was wrong. The rise of the creative class in places like New York, London, and San Francisco created economic growth only for the already rich, displacing the poor and working classes. The problems that once plagued inner cities have moved to the suburbs.<br> To make his case for the creative class, Florida subjected it to strange quantifications. Combining census data on occupation, education, “coolness factor” (based on the number of young people and the quality of “nightlife and culture”) and, bizarrely, the number of gay male residents, he developed a “Bohemia Index” to calculate this group’s magical effect on urban economic growth.<br> Florida reassures readers that all human beings are fundamentally creative animals, but only a third of us can make a living that way. The creative classes — to which you may, unknowingly, belong — include journalists, college professors, tech workers, graphic designers, and artists of any kind: basically anyone not working in the repetitious and decidedly uncreative manufacturing or service sectors.<br> The “creative classes” both diagnosed the present state of cities and offered recommendations for future action. Along with Jane Jacobs, Richard Florida has served as an inspiration for mayors, developers, and planners who pedestrianized streets, built bike lanes, and courted cultural attractions like art galleries and theaters.</br></br></br></br></br></br></p></blockquote><p>So, as it turns out, entertainment is not the core of the economy. Someone had better let Disney know the bad news. I suspect they’ll need to come up with some other metric that serves as a more accurate proxy for race.</p></div>",
  "content_text": "Sadly, it turns out that putting a coffee shop and an art gallery on the corner\nis not the ticket\nto economic revitalization:\nOne of the most influential thinkers about cities in postwar America, wants you to know that he got almost everything about cities wrong.\nIf you live in an urban center in North America, the United Kingdom, or Australia, you are living in Richard Florida’s world. Fifteen years ago, he argued that an influx of what he called the “creative classes” — artists, hipsters, tech workers — were sparking economic growth in places like the Bay Area. Their tolerance, flexibility, and eccentricity dissolved the rigid structures of industrial production and replaced them with the kinds of workplaces and neighborhoods that attracted more young people and, importantly, more investment.\nHis observations quickly formed the basis of a set of breezy technical solutions. If decaying cities wanted to survive, they had to open cool bars, shabby-chic coffee shops, and art venues that attract young, educated, and tolerant residents. Eventually, the mysterious alchemy of the creative economy would build a new and prosperous urban core.\nToday, even Florida recognizes that he was wrong. The rise of the creative class in places like New York, London, and San Francisco created economic growth only for the already rich, displacing the poor and working classes. The problems that once plagued inner cities have moved to the suburbs.\nTo make his case for the creative class, Florida subjected it to strange quantifications. Combining census data on occupation, education, “coolness factor” (based on the number of young people and the quality of “nightlife and culture”) and, bizarrely, the number of gay male residents, he developed a “Bohemia Index” to calculate this group’s magical effect on urban economic growth.\nFlorida reassures readers that all human beings are fundamentally creative animals, but only a third of us can make a living that way. The creative classes — to which you may, unknowingly, belong — include journalists, college professors, tech workers, graphic designers, and artists of any kind: basically anyone not working in the repetitious and decidedly uncreative manufacturing or service sectors.\nThe “creative classes” both diagnosed the present state of cities and offered recommendations for future action. Along with Jane Jacobs, Richard Florida has served as an inspiration for mayors, developers, and planners who pedestrianized streets, built bike lanes, and courted cultural attractions like art galleries and theaters.\nSo, as it turns out, entertainment is not the core of the economy. Someone had better let Disney know the bad news. I suspect they’ll need to come up with some other metric that serves as a more accurate proxy for race.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-29T16:21:00+00:00"
}