{
  "url": "https://voxday.net/2017/08/14/stupidity-is-no-substitute-for-strategy/",
  "scraped_at": "2025-12-19T10:20:12.445362",
  "title": "Stupidity is no substitute for strategy",
  "date_display": "August 14, 2017",
  "date_iso": "2017-08-14T13:00:00+00:00",
  "date_from_url": "2017-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.periscope.tv/voxday/1mnxemkkjQAxX\">This Darkstream</a> should amuse the Men of the West, who were arguing all along that the Alt-Reich were simply incapable of possessing any utility for defending America or the West. I thought they were extremists, but as it happens, they are nothing more than attention-seekers interested in “bantz” and “triggering the faggits” and “edgy” symbolism rather than actually seeking to win the cultural war.<br> It’s not “counter-signaling” or “punching right” to reject counterproductive morons who stubbornly refuse to learn anything from one failure after another. I stand by every single one of the 16 Points of the Alt-Right. But I have no more time or patience to spare for strategically-deficient cosplayers. Even Andrew Anglin appears to recognize this now.<br> <i>“Publicly aligning ourselves to an old and extinct political movement is not forward thinking, and it isn’t fresh… NS was a Hitler personality cult, when it comes right down to it.”</i><br> <i><br> </br></i>The Reichtards are Fake Right. Their claim to be the One True Alt-Right is totally laughable, as they are pro-EU, pro-single payer health insurance socialists. Punching them is punching Left.<br> Hence today’s <a href=\"https://twitter.com/voxday/status/897025153443475456\">Meme of the Day</a>.</br></br></br></br></p><div style=\"clear: both; text-align: center;\"><a href=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHLfdSSXgAAryka.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"236\" data-original-width=\"512\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHLfdSSXgAAryka.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"236\" data-original-width=\"512\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2017/08/DHLfdSSXgAAryka.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20236%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "This Darkstream\nshould amuse the Men of the West, who were arguing all along that the Alt-Reich were simply incapable of possessing any utility for defending America or the West. I thought they were extremists, but as it happens, they are nothing more than attention-seekers interested in “bantz” and “triggering the faggits” and “edgy” symbolism rather than actually seeking to win the cultural war.\nIt’s not “counter-signaling” or “punching right” to reject counterproductive morons who stubbornly refuse to learn anything from one failure after another. I stand by every single one of the 16 Points of the Alt-Right. But I have no more time or patience to spare for strategically-deficient cosplayers. Even Andrew Anglin appears to recognize this now.\n“Publicly aligning ourselves to an old and extinct political movement is not forward thinking, and it isn’t fresh… NS was a Hitler personality cult, when it comes right down to it.”\nThe Reichtards are Fake Right. Their claim to be the One True Alt-Right is totally laughable, as they are pro-EU, pro-single payer health insurance socialists. Punching them is punching Left.\nHence today’s\nMeme of the Day\n.",
  "tags": [
    "#AltRight",
    "Darkstream",
    "MPAI"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-14T12:00:00+00:00"
}