{
  "url": "https://voxday.net/2017/08/10/tech-conservatives-move-alt-right/",
  "scraped_at": "2025-12-18T07:26:12.473370",
  "title": "Tech conservatives move Alt Right",
  "date_display": "August 10, 2017",
  "date_iso": "2017-08-10T16:00:00+00:00",
  "date_from_url": "2017-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My free trade debate opponent, Dr. James Miller, has published a piece on Business Insider about the way in which conservatives like himself <a href=\"http://uk.businessinsider.com/get-ready-for-the-tech-alt-right-to-gain-influence-in-silicon-valley-2017-8?r=US&amp;IR=T\">are gravitating towards the Alt Right</a> under the growing pressure from SJWs in technology.</p><blockquote><p>Many Business Insider readers won’t trust an anonymous Breitbart interview, but for what’s relevant to this article, please do trust that this Googler’s views accurately reflects how many on the right think about SJWs.<br> Vox Day, a leader of the alt-right, wrote a book called <a href=\"http://amzn.to/1sBYA10\">“SJWs Always Lie”</a> with the explicit goal to “show you how SJWs operate, teach you how to see through their words, explain how to correctly anticipate their actions, and give you the weapons you need to successfully thwart their inevitable attempts to disqualify you, discredit you, and destroy your reputation.”<br> Damore’s firing is probably going to cause many Silicon Valley Republicans to prepare themselves by reading this book.<br> The key difference in tactics between the alt-right and traditional right is that the alt-right doesn’t place much value on playing fair, and they mock conservatives’ seeming desire to lose honorably. On a recent Periscope video Vox said that his supporters in tech companies (which he claims are numerous) should “be the second or third most enthusiastic SJW in your group.”<br> He considers SJWs to be the enemy that’s beyond reason. When a commentator suggested that publically supporting SJW views might give them legitimacy, Vox said “F— legitimacy. You are thinking like a conservative…”<br> It will be poisonous if the tech right feels compelled to not only hide their beliefs but also to actively pretend to believe in progressive diversity values. This pretending will embitter them, probably pushing many to the more radical alt-right…. Business works best if different political tribes don’t seek to crush others when they have a temporary upper-hand. If, however, the right perceived that SJWs are after them, it’s understandable (if regrettable) that they will treat SJWs likewise when they have the power.<br> Although the left greatly outnumbers the right in tech, if the right uses stealth tactics and the left doesn’t, the right might eventually gain an advantage in the career-destroying game because they will more easily locate high-value targets.<br> As a free market Republican, I dislike most of the alt-right policy views. But my kind are not inclined to fight an underhanded company by company dirty political war, while the alt-right is. If SJWs force the tech right into these fights, they will push them into the eager arms of the alt-right.</br></br></br></br></br></br></br></p></blockquote><p>People have no use for the McClellans and the parade ground generals once the shooting starts. They need Grants and Shermans and Pattons, and they know it. The Alt Right is the only right that fights. That is why it is the only Right that will command any allegiance from all the various right-leaning, pro-Western, pro-Christian, pro-freedom, pro-white, and pro-nationalist populations.</p></div>",
  "content_text": "My free trade debate opponent, Dr. James Miller, has published a piece on Business Insider about the way in which conservatives like himself\nare gravitating towards the Alt Right\nunder the growing pressure from SJWs in technology.\nMany Business Insider readers won’t trust an anonymous Breitbart interview, but for what’s relevant to this article, please do trust that this Googler’s views accurately reflects how many on the right think about SJWs.\nVox Day, a leader of the alt-right, wrote a book called\n“SJWs Always Lie”\nwith the explicit goal to “show you how SJWs operate, teach you how to see through their words, explain how to correctly anticipate their actions, and give you the weapons you need to successfully thwart their inevitable attempts to disqualify you, discredit you, and destroy your reputation.”\nDamore’s firing is probably going to cause many Silicon Valley Republicans to prepare themselves by reading this book.\nThe key difference in tactics between the alt-right and traditional right is that the alt-right doesn’t place much value on playing fair, and they mock conservatives’ seeming desire to lose honorably. On a recent Periscope video Vox said that his supporters in tech companies (which he claims are numerous) should “be the second or third most enthusiastic SJW in your group.”\nHe considers SJWs to be the enemy that’s beyond reason. When a commentator suggested that publically supporting SJW views might give them legitimacy, Vox said “F— legitimacy. You are thinking like a conservative…”\nIt will be poisonous if the tech right feels compelled to not only hide their beliefs but also to actively pretend to believe in progressive diversity values. This pretending will embitter them, probably pushing many to the more radical alt-right…. Business works best if different political tribes don’t seek to crush others when they have a temporary upper-hand. If, however, the right perceived that SJWs are after them, it’s understandable (if regrettable) that they will treat SJWs likewise when they have the power.\nAlthough the left greatly outnumbers the right in tech, if the right uses stealth tactics and the left doesn’t, the right might eventually gain an advantage in the career-destroying game because they will more easily locate high-value targets.\nAs a free market Republican, I dislike most of the alt-right policy views. But my kind are not inclined to fight an underhanded company by company dirty political war, while the alt-right is. If SJWs force the tech right into these fights, they will push them into the eager arms of the alt-right.\nPeople have no use for the McClellans and the parade ground generals once the shooting starts. They need Grants and Shermans and Pattons, and they know it. The Alt Right is the only right that fights. That is why it is the only Right that will command any allegiance from all the various right-leaning, pro-Western, pro-Christian, pro-freedom, pro-white, and pro-nationalist populations.",
  "tags": [
    "#AltRight",
    "#AltTech",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-10T15:00:00+00:00"
}