{
  "url": "https://voxday.net/2017/08/17/terror-attack-in-barcelona/",
  "scraped_at": "2025-12-19T10:20:32.773395",
  "title": "Terror attack in Barcelona",
  "date_display": "August 17, 2017",
  "date_iso": "2017-08-17T18:39:00+00:00",
  "date_from_url": "2017-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.reuters.com/article/us-spain-barcelona-idUSKCN1AX1W6?il=0\">Another truck attack</a>, this time kills 13+ in Spain:</p><blockquote><p>A van plowed into crowds in the heart of Barcelona on Thursday and Spanish media reported at least 13 people were killed, in what police said they were treating as a terrorist attack.<br> The death toll was reported by Cadena Ser radio, citing police sources. Police said some people were dead and injured but did not confirm the number of casualties. They said were searching for the driver of the van.<br> Spanish newspaper El Periodico said two armed men were holed up in a bar in Barcelona’s city center, and reported gunfire in the area, although it did not cite the source of the information.<br> It was not immediately clear whether the incidents were connected.<br> A source familiar with the initial U.S. government assessment said the incident appeared to be terrorism, and a White House spokeswoman said President Donald Trump was being kept abreast of the situation.</br></br></br></br></p></blockquote><p>They have to go back. What other answer is there? And where is El Cid? Where is St. James Matamoros?</p></div>",
  "content_text": "Another truck attack\n, this time kills 13+ in Spain:\nA van plowed into crowds in the heart of Barcelona on Thursday and Spanish media reported at least 13 people were killed, in what police said they were treating as a terrorist attack.\nThe death toll was reported by Cadena Ser radio, citing police sources. Police said some people were dead and injured but did not confirm the number of casualties. They said were searching for the driver of the van.\nSpanish newspaper El Periodico said two armed men were holed up in a bar in Barcelona’s city center, and reported gunfire in the area, although it did not cite the source of the information.\nIt was not immediately clear whether the incidents were connected.\nA source familiar with the initial U.S. government assessment said the incident appeared to be terrorism, and a White House spokeswoman said President Donald Trump was being kept abreast of the situation.\nThey have to go back. What other answer is there? And where is El Cid? Where is St. James Matamoros?",
  "tags": [
    "Clash of Civilizations",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-17T17:39:00+00:00"
}