{
  "url": "https://voxday.net/2017/08/19/the-economic-socialism-of-nazi-germany/",
  "scraped_at": "2025-12-19T10:20:45.017245",
  "title": "The economic socialism of Nazi Germany",
  "date_display": "August 19, 2017",
  "date_iso": "2017-08-19T13:00:00+00:00",
  "date_from_url": "2017-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>These observations – they can really only be considered “arguments” by the ignorant – are not new, but date back to the 1940 publication of <i>Human Action</i>, when Ludwig von Mises not only acknowledged the differences between Russian socialism and German socialism, both of which predated Hitler and the Nazi Party, <a href=\"https://mises.org/library/human-action-0/html/pp/865\">but explicates them</a> with his customary attention to relevant detail.<br> It’s particularly informative in light of the fact that Mises identified German socialism with Hindenberg, not Hitler. And it’s somewhat remarkable that the defenders of the false and ahistorical notion that the National Socialists were of the Right attempt to dismiss the whole subject as mere “economics”, when economics is merely the more scientific-sounding title for “political economy”, and the entire foundation for all socialisms is, and has always been, economic in nature.</br></p><blockquote><p>There are two patterns for the realization of socialism.<br> The first pattern (we may call it the Lenin or the Russian pattern) is purely bureaucratic. All plants, shops, and farms are formally nationalized (verstaatlicht); they are departments of the government operated by civil servants. Every unit of the apparatus of production stands in the same relation to the superior central organization as does a local post office to the office of the postmaster general.<br> The second pattern (we may call it the Hindenburg or German pattern) nominally and seemingly preserves private ownership of the means of production and keeps the appearance of ordinary markets, prices, wages, and interest rates. There are, however, no longer entrepreneurs, but only shop managers (Betriebsführer in the terminology of the Nazi legislation). These shop managers are seemingly instrumental in the conduct of the enterprises entrusted to them; they buy and sell, hire and discharge workers and remunerate their services, contract debts and pay interest and amortization. But in all their activities they are bound to obey unconditionally the orders issued by the government’s supreme office of production management.<br> This office (The Reichswirtschaftsministerium in Nazi Germany) tells the shop managers what and how to produce, at what prices and from whom to buy, at what prices and to whom to sell. It assigns every worker to his job and fixes his wages. It decrees to whom and on what terms the capitalists must entrust their funds. Market exchange is merely a sham. All the wages, prices, and interest rates are fixed by the government; they are wages, prices, and interest rates in appearance only; in fact they are merely quantitative terms in the government’s orders determining each citizen’s job, income, consumption, and standard of living. The government directs all production activities. The shop managers are subject to the government, not the consumers’ demand and the market’s price structure. This is socialism under the outward guise of the terminology of capitalism. Some labels of the capitalistic market economy are retained, but they signify something entirely different from what they mean in the market economy.</br></br></br></p></blockquote><p>Note that the <i>Reichswirtschaftsministerium</i>, originally <i>Reichswirtschaftsamt</i>, was the German Government’s Ministry of National Economy, and was established in 1917, two years prior to the creation of the German Worker’s Party, the predecessor of the National Socialist German Worker’s Party. The ministry was abolished in 1945.<br> What will likely strike the reader as ominous about this is the fact that the digitalization and bureaucratization of American corporatism is increasingly reminiscent of this German pattern of socialism that was adopted by the National Socialists in lieu of the Russian model. It’s also worth noting that just as the German political battle of the 1930s was fought between the Russian and German socialisms, the Chinese civil war of the 1940s was fought between Chinese and German socialisms. National socialism was a different socialism than the international socialism of the Marxists, but it was a competing socialism that was neither conceived nor defined by Adolf Hitler.<br> But since Mises is seldom read by anyone today, being much too difficult for the average individual, his observations are often forgotten. Which, no doubt, is why <a href=\"https://mises.org/library/why-nazism-was-socialism-and-why-socialism-totalitarian\">George Reisman attempted to spell the concept out more slowly</a> for the benefit of those incapable of deciphering Mises’s words 12 years ago.</br></br></p><blockquote><p>My purpose today is to make just two main points: (1) To show why Nazi Germany was a socialist state, not a capitalist one. And (2) to show why socialism, understood as an economic system based on government ownership of the means of production, positively requires a totalitarian dictatorship.<br> The identification of Nazi Germany as a socialist state was one of the many great contributions of Ludwig von Mises.<br> When one remembers that the word “Nazi” was an abbreviation for “der Nationalsozialistische Deutsche Arbeiters Partei — in English translation: the National Socialist German Workers’ Party — Mises’s identification might not appear all that noteworthy. For what should one expect the economic system of a country ruled by a party with “socialist” in its name to be but socialism?<br> Nevertheless, apart from Mises and his readers, practically no one thinks of Nazi Germany as a socialist state. It is far more common to believe that it represented a form of capitalism, which is what the Communists and all other Marxists have claimed….<br> De facto government ownership of the means of production, as Mises termed it, was logically implied by such fundamental collectivist principles embraced by the Nazis as that the common good comes before the private good and the individual exists as a means to the ends of the State. If the individual is a means to the ends of the State, so too, of course, is his property. Just as he is owned by the State, his property is also owned by the State.<br> But what specifically established de facto socialism in Nazi Germany was the introduction of price and wage controls in 1936. These were imposed in response to the inflation of the money supply carried out by the regime from the time of its coming to power in early 1933. The Nazi regime inflated the money supply as the means of financing the vast increase in government spending required by its programs of public works, subsidies, and rearmament. The price and wage controls were imposed in response to the rise in prices that began to result from the inflation.<br> The effect of the combination of inflation and price and wage controls is shortages, that is, a situation in which the quantities of goods people attempt to buy exceed the quantities available for sale.<br> Shortages, in turn, result in economic chaos. It’s not only that consumers who show up in stores early in the day are in a position to buy up all the stocks of goods and leave customers who arrive later, with nothing — a situation to which governments typically respond by imposing rationing. Shortages result in chaos throughout the economic system. They introduce randomness in the distribution of supplies between geographical areas, in the allocation of a factor of production among its different products, in the allocation of labor and capital among the different branches of the economic system.<br> In the face of the combination of price controls and shortages, the effect of a decrease in the supply of an item is not, as it would be in a free market, to raise its price and increase its profitability, thereby operating to stop the decrease in supply, or reverse it if it has gone too far. Price control prohibits the rise in price and thus the increase in profitability. At the same time, the shortages caused by price controls prevent increases in supply from reducing price and profitability. When there is a shortage, the effect of an increase in supply is merely a reduction in the severity of the shortage. Only when the shortage is totally eliminated does an increase in supply necessitate a decrease in price and bring about a decrease in profitability.<br> As a result, the combination of price controls and shortages makes possible random movements of supply without any effect on price and profitability. In this situation, the production of the most trivial and unimportant goods, even pet rocks, can be expanded at the expense of the production of the most urgently needed and important goods, such as life-saving medicines, with no effect on the price or profitability of either good. Price controls would prevent the production of the medicines from becoming more profitable as their supply decreased, while a shortage even of pet rocks prevented their production from becoming less profitable as their supply increased.<br> As Mises showed, to cope with such unintended effects of its price controls, the government must either abolish the price controls or add further measures, namely, precisely the control over what is produced, in what quantity, by what methods, and to whom it is distributed, which I referred to earlier. The combination of price controls with this further set of controls constitutes the de facto socialization of the economic system. For it means that the government then exercises all of the substantive powers of ownership.<br> This was the socialism instituted by the Nazis. And Mises calls it socialism on the German or Nazi pattern, in contrast to the more obvious socialism of the Soviets, which he calls socialism on the Russian or Bolshevik pattern.<br> Of course, socialism does not end the chaos caused by the destruction of the price system. It perpetuates it. And if it is introduced without the prior existence of price controls, its effect is to inaugurate that very chaos. This is because socialism is not actually a positive economic system. It is merely the negation of capitalism and its price system. As such, the essential nature of socialism is one and the same as the economic chaos resulting from the destruction of the price system by price and wage controls. (I want to point out that Bolshevik-style socialism’s imposition of a system of production quotas, with incentives everywhere to exceed the quotas, is a sure formula for universal shortages, just as exist under all around price and wage controls.)<br> At most, socialism merely changes the direction of the chaos. The government’s control over production may make possible a greater production of some goods of special importance to itself, but it does so only at the expense of wreaking havoc throughout the rest of the economic system. This is because the government has no way of knowing the effects on the rest of the economic system of its securing the production of the goods to which it attaches special importance.<br> The requirements of enforcing a system of price and wage controls shed major light on the totalitarian nature of socialism — most obviously, of course, on that of the German or Nazi variant of socialism, but also on that of Soviet-style socialism as well.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote></div>",
  "content_text": "These observations – they can really only be considered “arguments” by the ignorant – are not new, but date back to the 1940 publication of\nHuman Action\n, when Ludwig von Mises not only acknowledged the differences between Russian socialism and German socialism, both of which predated Hitler and the Nazi Party,\nbut explicates them\nwith his customary attention to relevant detail.\nIt’s particularly informative in light of the fact that Mises identified German socialism with Hindenberg, not Hitler. And it’s somewhat remarkable that the defenders of the false and ahistorical notion that the National Socialists were of the Right attempt to dismiss the whole subject as mere “economics”, when economics is merely the more scientific-sounding title for “political economy”, and the entire foundation for all socialisms is, and has always been, economic in nature.\nThere are two patterns for the realization of socialism.\nThe first pattern (we may call it the Lenin or the Russian pattern) is purely bureaucratic. All plants, shops, and farms are formally nationalized (verstaatlicht); they are departments of the government operated by civil servants. Every unit of the apparatus of production stands in the same relation to the superior central organization as does a local post office to the office of the postmaster general.\nThe second pattern (we may call it the Hindenburg or German pattern) nominally and seemingly preserves private ownership of the means of production and keeps the appearance of ordinary markets, prices, wages, and interest rates. There are, however, no longer entrepreneurs, but only shop managers (Betriebsführer in the terminology of the Nazi legislation). These shop managers are seemingly instrumental in the conduct of the enterprises entrusted to them; they buy and sell, hire and discharge workers and remunerate their services, contract debts and pay interest and amortization. But in all their activities they are bound to obey unconditionally the orders issued by the government’s supreme office of production management.\nThis office (The Reichswirtschaftsministerium in Nazi Germany) tells the shop managers what and how to produce, at what prices and from whom to buy, at what prices and to whom to sell. It assigns every worker to his job and fixes his wages. It decrees to whom and on what terms the capitalists must entrust their funds. Market exchange is merely a sham. All the wages, prices, and interest rates are fixed by the government; they are wages, prices, and interest rates in appearance only; in fact they are merely quantitative terms in the government’s orders determining each citizen’s job, income, consumption, and standard of living. The government directs all production activities. The shop managers are subject to the government, not the consumers’ demand and the market’s price structure. This is socialism under the outward guise of the terminology of capitalism. Some labels of the capitalistic market economy are retained, but they signify something entirely different from what they mean in the market economy.\nNote that the\nReichswirtschaftsministerium\n, originally\nReichswirtschaftsamt\n, was the German Government’s Ministry of National Economy, and was established in 1917, two years prior to the creation of the German Worker’s Party, the predecessor of the National Socialist German Worker’s Party. The ministry was abolished in 1945.\nWhat will likely strike the reader as ominous about this is the fact that the digitalization and bureaucratization of American corporatism is increasingly reminiscent of this German pattern of socialism that was adopted by the National Socialists in lieu of the Russian model. It’s also worth noting that just as the German political battle of the 1930s was fought between the Russian and German socialisms, the Chinese civil war of the 1940s was fought between Chinese and German socialisms. National socialism was a different socialism than the international socialism of the Marxists, but it was a competing socialism that was neither conceived nor defined by Adolf Hitler.\nBut since Mises is seldom read by anyone today, being much too difficult for the average individual, his observations are often forgotten. Which, no doubt, is why\nGeorge Reisman attempted to spell the concept out more slowly\nfor the benefit of those incapable of deciphering Mises’s words 12 years ago.\nMy purpose today is to make just two main points: (1) To show why Nazi Germany was a socialist state, not a capitalist one. And (2) to show why socialism, understood as an economic system based on government ownership of the means of production, positively requires a totalitarian dictatorship.\nThe identification of Nazi Germany as a socialist state was one of the many great contributions of Ludwig von Mises.\nWhen one remembers that the word “Nazi” was an abbreviation for “der Nationalsozialistische Deutsche Arbeiters Partei — in English translation: the National Socialist German Workers’ Party — Mises’s identification might not appear all that noteworthy. For what should one expect the economic system of a country ruled by a party with “socialist” in its name to be but socialism?\nNevertheless, apart from Mises and his readers, practically no one thinks of Nazi Germany as a socialist state. It is far more common to believe that it represented a form of capitalism, which is what the Communists and all other Marxists have claimed….\nDe facto government ownership of the means of production, as Mises termed it, was logically implied by such fundamental collectivist principles embraced by the Nazis as that the common good comes before the private good and the individual exists as a means to the ends of the State. If the individual is a means to the ends of the State, so too, of course, is his property. Just as he is owned by the State, his property is also owned by the State.\nBut what specifically established de facto socialism in Nazi Germany was the introduction of price and wage controls in 1936. These were imposed in response to the inflation of the money supply carried out by the regime from the time of its coming to power in early 1933. The Nazi regime inflated the money supply as the means of financing the vast increase in government spending required by its programs of public works, subsidies, and rearmament. The price and wage controls were imposed in response to the rise in prices that began to result from the inflation.\nThe effect of the combination of inflation and price and wage controls is shortages, that is, a situation in which the quantities of goods people attempt to buy exceed the quantities available for sale.\nShortages, in turn, result in economic chaos. It’s not only that consumers who show up in stores early in the day are in a position to buy up all the stocks of goods and leave customers who arrive later, with nothing — a situation to which governments typically respond by imposing rationing. Shortages result in chaos throughout the economic system. They introduce randomness in the distribution of supplies between geographical areas, in the allocation of a factor of production among its different products, in the allocation of labor and capital among the different branches of the economic system.\nIn the face of the combination of price controls and shortages, the effect of a decrease in the supply of an item is not, as it would be in a free market, to raise its price and increase its profitability, thereby operating to stop the decrease in supply, or reverse it if it has gone too far. Price control prohibits the rise in price and thus the increase in profitability. At the same time, the shortages caused by price controls prevent increases in supply from reducing price and profitability. When there is a shortage, the effect of an increase in supply is merely a reduction in the severity of the shortage. Only when the shortage is totally eliminated does an increase in supply necessitate a decrease in price and bring about a decrease in profitability.\nAs a result, the combination of price controls and shortages makes possible random movements of supply without any effect on price and profitability. In this situation, the production of the most trivial and unimportant goods, even pet rocks, can be expanded at the expense of the production of the most urgently needed and important goods, such as life-saving medicines, with no effect on the price or profitability of either good. Price controls would prevent the production of the medicines from becoming more profitable as their supply decreased, while a shortage even of pet rocks prevented their production from becoming less profitable as their supply increased.\nAs Mises showed, to cope with such unintended effects of its price controls, the government must either abolish the price controls or add further measures, namely, precisely the control over what is produced, in what quantity, by what methods, and to whom it is distributed, which I referred to earlier. The combination of price controls with this further set of controls constitutes the de facto socialization of the economic system. For it means that the government then exercises all of the substantive powers of ownership.\nThis was the socialism instituted by the Nazis. And Mises calls it socialism on the German or Nazi pattern, in contrast to the more obvious socialism of the Soviets, which he calls socialism on the Russian or Bolshevik pattern.\nOf course, socialism does not end the chaos caused by the destruction of the price system. It perpetuates it. And if it is introduced without the prior existence of price controls, its effect is to inaugurate that very chaos. This is because socialism is not actually a positive economic system. It is merely the negation of capitalism and its price system. As such, the essential nature of socialism is one and the same as the economic chaos resulting from the destruction of the price system by price and wage controls. (I want to point out that Bolshevik-style socialism’s imposition of a system of production quotas, with incentives everywhere to exceed the quotas, is a sure formula for universal shortages, just as exist under all around price and wage controls.)\nAt most, socialism merely changes the direction of the chaos. The government’s control over production may make possible a greater production of some goods of special importance to itself, but it does so only at the expense of wreaking havoc throughout the rest of the economic system. This is because the government has no way of knowing the effects on the rest of the economic system of its securing the production of the goods to which it attaches special importance.\nThe requirements of enforcing a system of price and wage controls shed major light on the totalitarian nature of socialism — most obviously, of course, on that of the German or Nazi variant of socialism, but also on that of Soviet-style socialism as well.",
  "tags": [
    "economics",
    "history",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-19T12:00:00+00:00"
}