{
  "url": "https://voxday.net/2017/08/18/the-trump-presidency-is-over/",
  "scraped_at": "2025-12-19T10:20:41.870886",
  "title": "“The Trump presidency is over”",
  "date_display": "August 18, 2017",
  "date_iso": "2017-08-18T23:56:00+00:00",
  "date_from_url": "2017-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As always, don’t count the God-Emperor out. Not even <a href=\"http://www.weeklystandard.com/bannon-the-trump-presidency-that-we-fought-for-and-won-is-over./article/2009355\">if Darth Bannon has</a>.</p><blockquote><p>“The Trump presidency that we fought for, and won, is over,” Bannon said Friday, shortly after confirming his departure. “We still have a huge movement, and we will make something of this Trump presidency. But that presidency is over. It’ll be something else. And there’ll be all kinds of fights, and there’ll be good days and bad days, but that presidency is over.”<br> It is plainly Bannon’s view that his departure is not a defeat for him personally, but for the ideology he’d urged upon the president, as reflected in Trump’s provocative inaugural address—in which he spoke of self-dealing Washington politicians, and their policies that led to the shuttered factories and broken lives of what he called “American carnage.” Bannon co-authored that speech (and privately complained that it had been toned down by West Wing moderates like Ivanka and Jared).<br> “Now, it’s gonna be Trump,” Bannon said. “The path forward on things like economic nationalism and immigration, and his ability to kind of move freely . . . I just think his ability to get anything done—particularly the bigger things, like the wall, the bigger, broader things that we fought for, it’s just gonna be that much harder.”<br> Bannon assigns blame for the thwarting of his program on “the West Wing Democrats,” but holds special disdain for the Washington establishment—especially those Republicans who have, he believes, willfully failed to provide Trump with meaningful victories.<br> And, he believes, things are about to get worse for Trump. “There’s about to be a jailbreak of these moderate guys on the Hill”—a stream of Republican dissent, which could become a flood.<br> Bannon says that he once confidently believed in the prospect of success for that version of the Trump presidency he now says is over. Asked what the turning point was, he says, “It’s the Republican establishment. The Republican establishment has no interest in Trump’s success on this. They’re not populists, they’re not nationalists, they had no interest in his program. Zero. It was a half-hearted attempt at Obamacare reform, it was no interest really on the infrastructure, they’ll do a very standard Republican version of taxes.<br> “What Trump ran on—border wall, where is the funding for the border wall, one of his central tenets, where have they been? Have they rallied around the Perdue-Cotton immigration bill? On what element of Trump’s program, besides tax cuts—which is going to be the standard marginal tax cut—where have they rallied to Trump’s cause? They haven’t.”<br> Bannon believes that those who will now try to influence Trump will hope to turn him in a sharply different direction.<br> “I think they’re going to try to moderate him,” he says. “I think he’ll sign a clean debt ceiling, I think you’ll see all this stuff. His natural tendency—and I think you saw it this week on Charlottesville—his actual default position is the position of his base, the position that got him elected. I think you’re going to see a lot of constraints on that. I think it’ll be much more conventional.”<br> But Bannon believes that Trump, with the help of Stephen K. Bannon, has already effected a lasting realignment of American politics.<br> As for himself, Bannon says the fight is just beginning.<br> “I feel jacked up,” he says. “Now I’m free. I’ve got my hands back on my weapons. Someone said, ‘it’s Bannon the Barbarian.’ I am definitely going to crush the opposition. There’s no doubt. I built a f***ing machine at Breitbart. And now I’m about to go back, knowing what I know, and we’re about to rev that machine up. And rev it up we will do.”</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I tend to suspect that Trump is not going to react well to the Republican establishment attempting to chain him and ride him like a newly broken horse. We’ll see.<br> The Darkstream <a href=\"https://www.periscope.tv/voxday/1mrGmmAjmWqGy\">on the subject</a>.</br></p></div>",
  "content_text": "As always, don’t count the God-Emperor out. Not even\nif Darth Bannon has\n.\n“The Trump presidency that we fought for, and won, is over,” Bannon said Friday, shortly after confirming his departure. “We still have a huge movement, and we will make something of this Trump presidency. But that presidency is over. It’ll be something else. And there’ll be all kinds of fights, and there’ll be good days and bad days, but that presidency is over.”\nIt is plainly Bannon’s view that his departure is not a defeat for him personally, but for the ideology he’d urged upon the president, as reflected in Trump’s provocative inaugural address—in which he spoke of self-dealing Washington politicians, and their policies that led to the shuttered factories and broken lives of what he called “American carnage.” Bannon co-authored that speech (and privately complained that it had been toned down by West Wing moderates like Ivanka and Jared).\n“Now, it’s gonna be Trump,” Bannon said. “The path forward on things like economic nationalism and immigration, and his ability to kind of move freely . . . I just think his ability to get anything done—particularly the bigger things, like the wall, the bigger, broader things that we fought for, it’s just gonna be that much harder.”\nBannon assigns blame for the thwarting of his program on “the West Wing Democrats,” but holds special disdain for the Washington establishment—especially those Republicans who have, he believes, willfully failed to provide Trump with meaningful victories.\nAnd, he believes, things are about to get worse for Trump. “There’s about to be a jailbreak of these moderate guys on the Hill”—a stream of Republican dissent, which could become a flood.\nBannon says that he once confidently believed in the prospect of success for that version of the Trump presidency he now says is over. Asked what the turning point was, he says, “It’s the Republican establishment. The Republican establishment has no interest in Trump’s success on this. They’re not populists, they’re not nationalists, they had no interest in his program. Zero. It was a half-hearted attempt at Obamacare reform, it was no interest really on the infrastructure, they’ll do a very standard Republican version of taxes.\n“What Trump ran on—border wall, where is the funding for the border wall, one of his central tenets, where have they been? Have they rallied around the Perdue-Cotton immigration bill? On what element of Trump’s program, besides tax cuts—which is going to be the standard marginal tax cut—where have they rallied to Trump’s cause? They haven’t.”\nBannon believes that those who will now try to influence Trump will hope to turn him in a sharply different direction.\n“I think they’re going to try to moderate him,” he says. “I think he’ll sign a clean debt ceiling, I think you’ll see all this stuff. His natural tendency—and I think you saw it this week on Charlottesville—his actual default position is the position of his base, the position that got him elected. I think you’re going to see a lot of constraints on that. I think it’ll be much more conventional.”\nBut Bannon believes that Trump, with the help of Stephen K. Bannon, has already effected a lasting realignment of American politics.\nAs for himself, Bannon says the fight is just beginning.\n“I feel jacked up,” he says. “Now I’m free. I’ve got my hands back on my weapons. Someone said, ‘it’s Bannon the Barbarian.’ I am definitely going to crush the opposition. There’s no doubt. I built a f***ing machine at Breitbart. And now I’m about to go back, knowing what I know, and we’re about to rev that machine up. And rev it up we will do.”\nI tend to suspect that Trump is not going to react well to the Republican establishment attempting to chain him and ride him like a newly broken horse. We’ll see.\nThe Darkstream\non the subject\n.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-18T22:56:00+00:00"
}