{
  "url": "https://voxday.net/2017/08/20/the-rise-of-the-american-nationalists/",
  "scraped_at": "2025-12-19T10:20:53.998831",
  "title": "The rise of the American nationalists",
  "date_display": "August 20, 2017",
  "date_iso": "2017-08-20T16:00:00+00:00",
  "date_from_url": "2017-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fact that the Republican establishment cannot understand the emotional appeal of this new Kid Rock song, or the pride possessed by those they dismiss as “white trash”, is why the God-Emperor will likely be more powerful after 2018 than he is now. Both Kid Rock and Trump represent is a civic nationalist, traditional American heritage spirit that is nevertheless identity-aware, if not pure identity politics, and stands directly in the way of the social justice, diversity, inclusivity, and equality Left.<br> It’s Alt Lite, not Alt Right. It’s populist, neither intellectual nor ideological. And while it’s ultimately insufficient, it nevertheless represents a tremendous step forward for Americans, because, unlike the Diversity Left, which hates America, and the Establishment Right, which cares about nothing except GDP and the well-being of the donor class, the Trump nationalists love America.<br> I think Kid Rock will win a Senate seat if he actually runs, because on the basis of this video alone, you can see that his rhetoric is powerful and his political instincts are formidable. Girls, guns, motor vehicles and beer is about as American as it gets, while the uncharacteristic absence of rebel flags and the inclusion of black rednecks is almost certainly significant given the demographics of Michigan. It’s not a bad song either.</br></br></p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/4KnAzpi4avo\" width=\"512\"></iframe></div></div>",
  "content_text": "The fact that the Republican establishment cannot understand the emotional appeal of this new Kid Rock song, or the pride possessed by those they dismiss as “white trash”, is why the God-Emperor will likely be more powerful after 2018 than he is now. Both Kid Rock and Trump represent is a civic nationalist, traditional American heritage spirit that is nevertheless identity-aware, if not pure identity politics, and stands directly in the way of the social justice, diversity, inclusivity, and equality Left.\nIt’s Alt Lite, not Alt Right. It’s populist, neither intellectual nor ideological. And while it’s ultimately insufficient, it nevertheless represents a tremendous step forward for Americans, because, unlike the Diversity Left, which hates America, and the Establishment Right, which cares about nothing except GDP and the well-being of the donor class, the Trump nationalists love America.\nI think Kid Rock will win a Senate seat if he actually runs, because on the basis of this video alone, you can see that his rhetoric is powerful and his political instincts are formidable. Girls, guns, motor vehicles and beer is about as American as it gets, while the uncharacteristic absence of rebel flags and the inclusion of black rednecks is almost certainly significant given the demographics of Michigan. It’s not a bad song either.",
  "tags": [
    "music",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-20T15:00:00+00:00"
}