{
  "url": "https://voxday.net/2017/08/21/the-promethean/",
  "scraped_at": "2025-12-19T10:20:56.961168",
  "title": "THE PROMETHEAN",
  "date_display": "August 21, 2017",
  "date_iso": "2017-08-21T09:47:00+00:00",
  "date_from_url": "2017-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.amazon.com/dp/B074Y9FN7Z/ref=as_li_ss_il?ie=UTF8&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=ff83a42970e30e5f6798b105d7660c1c\" rel=\"noopener\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B074Y9FN7Z&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B074Y9FN7Z&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><b><i><a href=\"http://amzn.to/2vWveNW\">THE PROMETHEAN</a></i></b> is a brutally funny novel exposing the utter insanity of modern academia and the world of technology. An extraordinary tale of ambition, social justice, and human folly, it combines the mordant wit of W. Somerset Maugham with a sense of humor reminiscent of P.G. Wodehouse.<br> When American billionaire Henry Hockenheimer discovers that conquering the corporate world is no longer enough for him on the eve of his 40th birthday, he decides to leave his mark on the world by creating the first Superman, a robot as intellectually brilliant as it is physically capable. But his ideas are thwarted on every side by the most brilliant minds of the academic world, from the AI researcher Dr. Vishnu Sharma to the wheelchair-bound head of the Diversity and Inclusion Committee of Her Majesty’s Government’s Bio-Engineering Research Fund, Nkwandi Obolajuwan, and, of course, Dr. Sydney Prout, formerly of the United Nations, now Special Adviser on Human Rights to the European Union.<br> And when Hockenheimer succeeds, despite all of the incredible obstacles placed in his way, he discovers that success can be the cruelest failure of all.<br> <b><i><a href=\"http://amzn.to/2vWveNW\">THE PROMETHEAN</a></i></b> is available at Amazon via ebook and Kindle Unlimited.<br> From the reviews:</br></br></br></br></p><ul><li><i>I do not remember which famous English authors use similar storytelling styles as satire, but Owen Stanley has generally followed their design and adapted it well to our age. His skewering of the EU and the diversity commission is written by a man with either first- or second-hand knowledge of these groups.</i></li><li><i>Absolutely delightful, not to mention timely, witty, thought-provoking and occasionally side-splitting. I was almost in need of surgery.</i></li></ul><div>I absolutely loved <i><b><a href=\"http://amzn.to/28Y2gEi\">THE MISSIONARIES</a></b></i>, which is both brilliant and hysterically funny. And to be honest, I consider successfully encouraging Dr. Stanley to write a second novel, which he originally had no plans to do, to be my single greatest success as an editor to date.</div></div>",
  "content_text": "THE PROMETHEAN\nis a brutally funny novel exposing the utter insanity of modern academia and the world of technology. An extraordinary tale of ambition, social justice, and human folly, it combines the mordant wit of W. Somerset Maugham with a sense of humor reminiscent of P.G. Wodehouse.\nWhen American billionaire Henry Hockenheimer discovers that conquering the corporate world is no longer enough for him on the eve of his 40th birthday, he decides to leave his mark on the world by creating the first Superman, a robot as intellectually brilliant as it is physically capable. But his ideas are thwarted on every side by the most brilliant minds of the academic world, from the AI researcher Dr. Vishnu Sharma to the wheelchair-bound head of the Diversity and Inclusion Committee of Her Majesty’s Government’s Bio-Engineering Research Fund, Nkwandi Obolajuwan, and, of course, Dr. Sydney Prout, formerly of the United Nations, now Special Adviser on Human Rights to the European Union.\nAnd when Hockenheimer succeeds, despite all of the incredible obstacles placed in his way, he discovers that success can be the cruelest failure of all.\nTHE PROMETHEAN\nis available at Amazon via ebook and Kindle Unlimited.\nFrom the reviews:\nI do not remember which famous English authors use similar storytelling styles as satire, but Owen Stanley has generally followed their design and adapted it well to our age. His skewering of the EU and the diversity commission is written by a man with either first- or second-hand knowledge of these groups.\nAbsolutely delightful, not to mention timely, witty, thought-provoking and occasionally side-splitting. I was almost in need of surgery.\nI absolutely loved\nTHE MISSIONARIES\n, which is both brilliant and hysterically funny. And to be honest, I consider successfully encouraging Dr. Stanley to write a second novel, which he originally had no plans to do, to be my single greatest success as an editor to date.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-21T08:47:00+00:00"
}