{
  "url": "https://voxday.net/2017/08/22/the-tech-crackdown-is-weakness/",
  "scraped_at": "2025-12-19T10:21:07.314711",
  "title": "The tech crackdown is weakness",
  "date_display": "August 22, 2017",
  "date_iso": "2017-08-22T12:41:00+00:00",
  "date_from_url": "2017-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As well as <a href=\"https://www.bloomberg.com/news/articles/2017-08-21/facebook-usage-among-teens-set-to-drop-in-u-s-emarketer-says\">an opportunity to foxnews the f——-</a> at Facebook, Wikipedia, Twitter, and the other social media giants.</p><blockquote><p>This year, the world’s largest social network will see a decline among teen users in the U.S., according to a forecast by EMarketer. It’s the first time the research company has predicted a fall in Facebook usage for any age group.<br> EMarketer predicts 14.5 million people from the ages of 12 to 17 will use Facebook in 2017, a drop of 3.4 percent from the prior year. Teens are migrating instead to Snap Inc.’s Snapchat and Instagram, the photo-sharing app that Facebook owns, the research company said Monday in a statement.<br> Facebook has continued to grow around the world, with more than 2 billion users this year, but younger people are finding it less compelling, said Oscar Orozco, a forecasting analyst at EMarketer.</br></br></p></blockquote><p>The Facebook/Twitter business model is an intrinsically fraudulent one, propped up by debt and ideology. Which means, of course, that their decline will be unexpectedly fast once it begins. And it is coming soon. Twitter has already ceased to grow. Facebook will follow suit soon. All they will succeed in doing is fracturing and further decentralizing the Internet, which will serve us, not them.<br> The reason they are cracking down hard now is that they realize their window of opportunity to do so is closing. This is why there is no reason to panic when another deplatforming happens. All that a deplatforming accomplishes is to ensure that a new platform will come into being to replace it.<br> Remember, there was a time not all that long ago when SJW fans of John Scalzi bragged that his blog traffic was vastly bigger than mine. Now that mine is more than 5x his, he switched to bragging about his 111,329 followers and 178 million annual Twitter impressions… and I am now on pace to equal or exceed his 2016 monthly average of 14.8 million Twitter impressions this month.<br> The world is a dynamic place. It will knock you down, but when you get up again, hardened by the experience, the experience only makes you that much more formidable.<br> That being said, the next anti-Right tech strike will be more systematic and multiplatform. I expect that if I am targeted, my accounts will be vanished from Twitter, Blogger, and Gmail simultaneously,  (I don’t really use Facebook or Paypal) which is why I am already set up with more reliable alternatives for literally every social media and payment platform, and have arranged for direct email access to every VFM, Book Club, and Daily Meme Wars member. If you want to make sure that you’re immediately alerted and provided with the alternatives, I recommend signing up for either <a href=\"http://www.milobookclub.com/2017/06/23/castalia-book-club/\">the Book Club</a> or if you don’t mind daily emails, <a href=\"http://www.milobookclub.com/2017/07/09/meme-of-day/\">the Daily Meme Wars</a>.</br></br></br></br></p></div>",
  "content_text": "As well as\nan opportunity to foxnews the f——-\nat Facebook, Wikipedia, Twitter, and the other social media giants.\nThis year, the world’s largest social network will see a decline among teen users in the U.S., according to a forecast by EMarketer. It’s the first time the research company has predicted a fall in Facebook usage for any age group.\nEMarketer predicts 14.5 million people from the ages of 12 to 17 will use Facebook in 2017, a drop of 3.4 percent from the prior year. Teens are migrating instead to Snap Inc.’s Snapchat and Instagram, the photo-sharing app that Facebook owns, the research company said Monday in a statement.\nFacebook has continued to grow around the world, with more than 2 billion users this year, but younger people are finding it less compelling, said Oscar Orozco, a forecasting analyst at EMarketer.\nThe Facebook/Twitter business model is an intrinsically fraudulent one, propped up by debt and ideology. Which means, of course, that their decline will be unexpectedly fast once it begins. And it is coming soon. Twitter has already ceased to grow. Facebook will follow suit soon. All they will succeed in doing is fracturing and further decentralizing the Internet, which will serve us, not them.\nThe reason they are cracking down hard now is that they realize their window of opportunity to do so is closing. This is why there is no reason to panic when another deplatforming happens. All that a deplatforming accomplishes is to ensure that a new platform will come into being to replace it.\nRemember, there was a time not all that long ago when SJW fans of John Scalzi bragged that his blog traffic was vastly bigger than mine. Now that mine is more than 5x his, he switched to bragging about his 111,329 followers and 178 million annual Twitter impressions… and I am now on pace to equal or exceed his 2016 monthly average of 14.8 million Twitter impressions this month.\nThe world is a dynamic place. It will knock you down, but when you get up again, hardened by the experience, the experience only makes you that much more formidable.\nThat being said, the next anti-Right tech strike will be more systematic and multiplatform. I expect that if I am targeted, my accounts will be vanished from Twitter, Blogger, and Gmail simultaneously,  (I don’t really use Facebook or Paypal) which is why I am already set up with more reliable alternatives for literally every social media and payment platform, and have arranged for direct email access to every VFM, Book Club, and Daily Meme Wars member. If you want to make sure that you’re immediately alerted and provided with the alternatives, I recommend signing up for either\nthe Book Club\nor if you don’t mind daily emails,\nthe Daily Meme Wars\n.",
  "tags": [
    "#AltTech",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-22T11:41:00+00:00"
}