{
  "url": "https://voxday.net/2017/08/29/the-terrible-cowardice/",
  "scraped_at": "2025-12-19T10:21:51.993354",
  "title": "The Terrible Cowardice",
  "date_display": "August 29, 2017",
  "date_iso": "2017-08-29T09:15:00+00:00",
  "date_from_url": "2017-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is a guest post from an occasional contributor who prefers to remain anonymous. Please don’t assume that he speaks for me or that I necessarily agree with any or all of his various assertions and conclusions.</i><br> <b>The Terrible Cowardice of the Left</b><br> I grew up in England.<br> I came of age as the Spice Girls were soaring to the top of the hit parade.  ‘I’ll tell you what I want, what I really, really want’ echoed from every bedroom.  Girls strode around proclaiming the new age of GIRL POWER, boys insisted – unconvincingly  – that they only listened to the Spice Girls for the music.  It was the dawn of a whole new age.<br> Well, actually it wasn’t.  But we thought it was.<br> There was a girl at my school who I’ll call Jane.  She was one of the blessed, as far as looks were concerned.  I don’t think there was a single boy who didn’t lust after her.  A smile from her could brighten up your whole day.  She would have been a cheerleader, if we’d had cheerleaders.<br> There was also a boy who I’ll call Kevin.  He was a nerd.  Spotty, glasses, slightly overweight, maybe not the ugliest boy in the school, but certainly in the bottom ten.  He was the kind of person whose mere existence attracted bullies. I’d known him since I was a child, but we’d never really been friends. People who stood too close to him got bullied too.<br> So one day, Kevin takes it into his head to ask Jane – yes, JANE – out.  I’d never thought he had it in him. I never dared ask her out. But he did it.<br> Jane gaped at him, let out an incredulous laugh and told him, in no uncertain terms, that she wouldn’t go out with him if he was the last person on Earth.  She ripped him a whole new one.  Kevin staggered off, looking as though someone had punched him in the head.  Boys laughed, glad that they hadn’t been the target of her wrath; girls laughed and chatted about Girl Power.  Jane’s victory would have made her the most popular girl in the class if she hadn’t already held that title. I imagine Kevin wanted to blink out of existence and die. But he had to keep coming into school for the remaining year. People were rubbing salt into his wounds until we left for university.<br> There was another person  in this little story.  Gaston – believe me, the name fits – was a football player.  He was handsome, muscular, and had a habit of playing cruel jokes on his victims.  He was the jock’s jock.  He’d once thought it was amusing to shove my head down the toilet, then yank down my trousers when I tried to escape.  He was popular because students preferred to have him on their side than against them. It won’t surprise you to hear that Gaston started to date Jane in our final year of school.<br> A few weeks before we left the building for the last time, we were in the gym for our regular torture session.  Jane was wearing a skirt an inch or two above the knee, drawing all of our eyes.  And then Gaston takes it into his head to flip her skirt up, exposing her underwear.  We all saw.<br> Jane let out a nervous little laugh and brushed her skirt back down.<br> I can imagine just how humiliated she must have felt, at that moment.  If I – a boy – hated having my bottom exposed, it must have been far worse for her.  Everyone had been looking at her bum.  I expected her to tear into Gaston with all the vitriol she’d hurled at Kevin.  Girl Power, you know?<br> She didn’t, of course.  She tried to pass it off as a joke, but I could tell she was upset.<br> But why didn’t she light into Gaston?  Why didn’t she dump his ass on the spot?<br> She was scared.  Kevin might have been a boy, but he was no threat to her.  There were plenty of girls who could have beaten him up, in that school.  Gaston could have broken her effortlessly.  He’d beaten me up, once or twice.  No one wanted to get on his bad side, even if it meant accepting public humiliation.  She let him get away with it.<br> No one else tried to stop him either.  Gaston committed blatant sexual assault and got away with it.  And who could blame them?  The teachers had very little power to discipline their charges.  None of the boys or girls wanted to make an enemy of him …<br> I have no idea what happened to any of them, after I left school.  And I don’t really care.<br> A brave man or woman is someone who stands up to great odds, accepting the risk of serious injury, or even death, in the name of their cause.  Sometimes, this is as simple as standing up in front of an angry crowd and speaking the truth; sometimes, it is as complex as multi-leveled combat operations.  Many on the Left say that they are brave, that they are putting everything on the line.  But is that actually true?<br> It is easy to stand up to someone as puny as Kevin.  Jane was in no danger.  Even if Kevin was strong enough to hurt her, I have no doubt that all the boys would have piled onto him before he could do real harm.  We didn’t have virtue-signalling in those days, but we certainly did have white knighting.  Gaston?  It’s a great deal harder to stand up to someone so strong, so popular, so entrenched as the good guy that it would be difficult to undermine him.<br> The thing I’ve noticed about the Left these days is that it is largely composed of cowards.<br> Pretend, for the moment, that you’re a feminist.  You believe, very firmly, that women should have equal rights to men.  You may even believe that women are superior to men.  So tell me, why aren’t you protesting the migrant crisis in Europe?  Why aren’t you standing up for the rights of Muslim women?  Why do you not see Radical Islam as a threat to your very existence?<br> One possible answer, of course, is that feminists are more concerned with problems closer to home.  (Which ignores the fact that this problem is moving increasingly closer to home.)  But another is far darker.  Feminists are scared.  Western men do not, in general, have a habit of beating or shooting women who defy them.  And those who do are not regarded as heroes by the rest of the male population.  But Islamists?  Radical Muslims regard feminism – the radical notion that women are human beings, as Marie Shear put it – as poison.  They do NOT regard women as human beings.<br> This problem is deeper than you might suppose.  A person raised in a different culture might have very different ideas about the way the world works than yourself.  The idea that a woman who doesn’t cover herself from head to toe is just asking for it is horrific, as far as I am concerned, but that doesn’t mean that migrants don’t have that opinion.  And the idea that they are going to instantly change, the moment they set foot in the West, is laughable.<br> All the concepts we take for granted, that a woman can say ‘no,’ that underage children are not to be touched, are not graven in stone.  They’re cultural norms that have become part of our lives so much that it is hard to believe that others don’t share them.  But they don’t.<br> Or pretend that you’re a homosexual.  Conservatives may dislike homosexuals, but radical Muslims throw homosexuals off buildings.  Which one of these is the true threat to homosexuals?  Why aren’t homosexuals protesting migrants?<br> Because they’re scared.<br> On one level, the political elites in both Europe and America managed to declare discussions about immigration taboo.  This had the effect, for better or worse, of pushing such matters into the hands of the far-right.  But it also made it impossible for feminists or homosexuals or other liberal groups to oppose immigration without being branded racists or worse.  And while a person from the Right may shrug off the charge of racism, a person from the Left would take it far more seriously.  The Descending Hierarchy of Victimhood puts Muslims below feminists and homosexuals, thus providing cover for anything they do to anyone above them.  Anyone who challenges Muslims is ‘punching down.’<br> But on another level, people who question radical Muslims, people who oppose them, are threatened, attacked and sometimes killed.  This is a very real problem.  Feminists and homosexuals and leftists in general are scared of being hurt and killed.  And who could blame them?  No one is immune to fear.  It is difficult to muster the bravery to fight back when you know that everyone will side against you, that  authority, however defined, will not protect you.  Instead, they choose to deny reality and attack people who can’t – who won’t – hit back.<br> The Left has long since cast aside its ability to make moral judgments.  It is incapable of understanding that a person who has had a bad upbringing – or whatever – still needs to suffer the consequences of their actions.  Instead, it has created a situation where real threats are ignored and imaginary threats are blown out of all proportion.  Few on the left dare to oppose it for fear of being smeared by the ‘racist’ brush.  And it has betrayed its own people.<br> The good thing about this is that more and more people are becoming aware that the emperor has no clothes.  The bad thing about this is that a great many innocent people, feminists and homosexuals and everything else, will suffer for the Left’s cowardice in the face of the true enemy.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "This is a guest post from an occasional contributor who prefers to remain anonymous. Please don’t assume that he speaks for me or that I necessarily agree with any or all of his various assertions and conclusions.\nThe Terrible Cowardice of the Left\nI grew up in England.\nI came of age as the Spice Girls were soaring to the top of the hit parade.  ‘I’ll tell you what I want, what I really, really want’ echoed from every bedroom.  Girls strode around proclaiming the new age of GIRL POWER, boys insisted – unconvincingly  – that they only listened to the Spice Girls for the music.  It was the dawn of a whole new age.\nWell, actually it wasn’t.  But we thought it was.\nThere was a girl at my school who I’ll call Jane.  She was one of the blessed, as far as looks were concerned.  I don’t think there was a single boy who didn’t lust after her.  A smile from her could brighten up your whole day.  She would have been a cheerleader, if we’d had cheerleaders.\nThere was also a boy who I’ll call Kevin.  He was a nerd.  Spotty, glasses, slightly overweight, maybe not the ugliest boy in the school, but certainly in the bottom ten.  He was the kind of person whose mere existence attracted bullies. I’d known him since I was a child, but we’d never really been friends. People who stood too close to him got bullied too.\nSo one day, Kevin takes it into his head to ask Jane – yes, JANE – out.  I’d never thought he had it in him. I never dared ask her out. But he did it.\nJane gaped at him, let out an incredulous laugh and told him, in no uncertain terms, that she wouldn’t go out with him if he was the last person on Earth.  She ripped him a whole new one.  Kevin staggered off, looking as though someone had punched him in the head.  Boys laughed, glad that they hadn’t been the target of her wrath; girls laughed and chatted about Girl Power.  Jane’s victory would have made her the most popular girl in the class if she hadn’t already held that title. I imagine Kevin wanted to blink out of existence and die. But he had to keep coming into school for the remaining year. People were rubbing salt into his wounds until we left for university.\nThere was another person  in this little story.  Gaston – believe me, the name fits – was a football player.  He was handsome, muscular, and had a habit of playing cruel jokes on his victims.  He was the jock’s jock.  He’d once thought it was amusing to shove my head down the toilet, then yank down my trousers when I tried to escape.  He was popular because students preferred to have him on their side than against them. It won’t surprise you to hear that Gaston started to date Jane in our final year of school.\nA few weeks before we left the building for the last time, we were in the gym for our regular torture session.  Jane was wearing a skirt an inch or two above the knee, drawing all of our eyes.  And then Gaston takes it into his head to flip her skirt up, exposing her underwear.  We all saw.\nJane let out a nervous little laugh and brushed her skirt back down.\nI can imagine just how humiliated she must have felt, at that moment.  If I – a boy – hated having my bottom exposed, it must have been far worse for her.  Everyone had been looking at her bum.  I expected her to tear into Gaston with all the vitriol she’d hurled at Kevin.  Girl Power, you know?\nShe didn’t, of course.  She tried to pass it off as a joke, but I could tell she was upset.\nBut why didn’t she light into Gaston?  Why didn’t she dump his ass on the spot?\nShe was scared.  Kevin might have been a boy, but he was no threat to her.  There were plenty of girls who could have beaten him up, in that school.  Gaston could have broken her effortlessly.  He’d beaten me up, once or twice.  No one wanted to get on his bad side, even if it meant accepting public humiliation.  She let him get away with it.\nNo one else tried to stop him either.  Gaston committed blatant sexual assault and got away with it.  And who could blame them?  The teachers had very little power to discipline their charges.  None of the boys or girls wanted to make an enemy of him …\nI have no idea what happened to any of them, after I left school.  And I don’t really care.\nA brave man or woman is someone who stands up to great odds, accepting the risk of serious injury, or even death, in the name of their cause.  Sometimes, this is as simple as standing up in front of an angry crowd and speaking the truth; sometimes, it is as complex as multi-leveled combat operations.  Many on the Left say that they are brave, that they are putting everything on the line.  But is that actually true?\nIt is easy to stand up to someone as puny as Kevin.  Jane was in no danger.  Even if Kevin was strong enough to hurt her, I have no doubt that all the boys would have piled onto him before he could do real harm.  We didn’t have virtue-signalling in those days, but we certainly did have white knighting.  Gaston?  It’s a great deal harder to stand up to someone so strong, so popular, so entrenched as the good guy that it would be difficult to undermine him.\nThe thing I’ve noticed about the Left these days is that it is largely composed of cowards.\nPretend, for the moment, that you’re a feminist.  You believe, very firmly, that women should have equal rights to men.  You may even believe that women are superior to men.  So tell me, why aren’t you protesting the migrant crisis in Europe?  Why aren’t you standing up for the rights of Muslim women?  Why do you not see Radical Islam as a threat to your very existence?\nOne possible answer, of course, is that feminists are more concerned with problems closer to home.  (Which ignores the fact that this problem is moving increasingly closer to home.)  But another is far darker.  Feminists are scared.  Western men do not, in general, have a habit of beating or shooting women who defy them.  And those who do are not regarded as heroes by the rest of the male population.  But Islamists?  Radical Muslims regard feminism – the radical notion that women are human beings, as Marie Shear put it – as poison.  They do NOT regard women as human beings.\nThis problem is deeper than you might suppose.  A person raised in a different culture might have very different ideas about the way the world works than yourself.  The idea that a woman who doesn’t cover herself from head to toe is just asking for it is horrific, as far as I am concerned, but that doesn’t mean that migrants don’t have that opinion.  And the idea that they are going to instantly change, the moment they set foot in the West, is laughable.\nAll the concepts we take for granted, that a woman can say ‘no,’ that underage children are not to be touched, are not graven in stone.  They’re cultural norms that have become part of our lives so much that it is hard to believe that others don’t share them.  But they don’t.\nOr pretend that you’re a homosexual.  Conservatives may dislike homosexuals, but radical Muslims throw homosexuals off buildings.  Which one of these is the true threat to homosexuals?  Why aren’t homosexuals protesting migrants?\nBecause they’re scared.\nOn one level, the political elites in both Europe and America managed to declare discussions about immigration taboo.  This had the effect, for better or worse, of pushing such matters into the hands of the far-right.  But it also made it impossible for feminists or homosexuals or other liberal groups to oppose immigration without being branded racists or worse.  And while a person from the Right may shrug off the charge of racism, a person from the Left would take it far more seriously.  The Descending Hierarchy of Victimhood puts Muslims below feminists and homosexuals, thus providing cover for anything they do to anyone above them.  Anyone who challenges Muslims is ‘punching down.’\nBut on another level, people who question radical Muslims, people who oppose them, are threatened, attacked and sometimes killed.  This is a very real problem.  Feminists and homosexuals and leftists in general are scared of being hurt and killed.  And who could blame them?  No one is immune to fear.  It is difficult to muster the bravery to fight back when you know that everyone will side against you, that  authority, however defined, will not protect you.  Instead, they choose to deny reality and attack people who can’t – who won’t – hit back.\nThe Left has long since cast aside its ability to make moral judgments.  It is incapable of understanding that a person who has had a bad upbringing – or whatever – still needs to suffer the consequences of their actions.  Instead, it has created a situation where real threats are ignored and imaginary threats are blown out of all proportion.  Few on the left dare to oppose it for fear of being smeared by the ‘racist’ brush.  And it has betrayed its own people.\nThe good thing about this is that more and more people are becoming aware that the emperor has no clothes.  The bad thing about this is that a great many innocent people, feminists and homosexuals and everything else, will suffer for the Left’s cowardice in the face of the true enemy.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-29T08:15:00+00:00"
}