{
  "url": "https://voxday.net/2017/08/12/the-underperformers-of-google/",
  "scraped_at": "2025-12-18T07:26:27.147747",
  "title": "The underperformers of Google",
  "date_display": "August 12, 2017",
  "date_iso": "2017-08-12T13:00:00+00:00",
  "date_from_url": "2017-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Further evidence that the Ivy League’s affirmative action is <a href=\"http://www.breitbart.com/tech/2017/08/11/googler-internal-project-white-asians-likely-succeed/\">rewarding the undeserving and the underperforming</a>:</p><blockquote><p>A Google Research project indicating that underrepresented minorities and Ivy League graduates were more likely to receive softball interviews at the company was shut down by Google’s human resources department upon seeing the results, according to an insider.<br> The Google insider (alias “Chuck”), who worked at the company for several years, was part of a team tasked with determining which Google employees were most likely to succeed at the company based on their interview feedback.<br> According to Chuck, the predictive model they created determined that employees who received mixed feedback at the interview stage performed far better than those who received only good feedback.<br> Those who were most likely to receive only good feedback (“inflated interview scores,” in the words of Chuck) tended to be Ivy League graduates or underrepresented minorities. Those who were most likely to receive mixed feedback (and, according to the model, go on to achieve the most success at Google) were more likely to be white and Asian men who did not go to Ivy League schools.<br> The insider’s team had been tasked with the project by Google’s HR department, but according to him, they promptly shut it down once they realized its results would not serve their goals.</br></br></br></br></p></blockquote><p>Google is an SJW-converged organization at war with reality. That is why it is doomed.</p></div>",
  "content_text": "Further evidence that the Ivy League’s affirmative action is\nrewarding the undeserving and the underperforming\n:\nA Google Research project indicating that underrepresented minorities and Ivy League graduates were more likely to receive softball interviews at the company was shut down by Google’s human resources department upon seeing the results, according to an insider.\nThe Google insider (alias “Chuck”), who worked at the company for several years, was part of a team tasked with determining which Google employees were most likely to succeed at the company based on their interview feedback.\nAccording to Chuck, the predictive model they created determined that employees who received mixed feedback at the interview stage performed far better than those who received only good feedback.\nThose who were most likely to receive only good feedback (“inflated interview scores,” in the words of Chuck) tended to be Ivy League graduates or underrepresented minorities. Those who were most likely to receive mixed feedback (and, according to the model, go on to achieve the most success at Google) were more likely to be white and Asian men who did not go to Ivy League schools.\nThe insider’s team had been tasked with the project by Google’s HR department, but according to him, they promptly shut it down once they realized its results would not serve their goals.\nGoogle is an SJW-converged organization at war with reality. That is why it is doomed.",
  "tags": [
    "SJW",
    "technology",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-12T12:00:00+00:00"
}