{
  "url": "https://voxday.net/2017/08/23/the-false-front-of-the-male-feminist/",
  "scraped_at": "2025-12-19T10:21:14.660665",
  "title": "The false front of the male feminist",
  "date_display": "August 23, 2017",
  "date_iso": "2017-08-23T13:00:00+00:00",
  "date_from_url": "2017-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joss Whedon is merely <a href=\"https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/\">the latest “male feminist” to be outed</a> as a sexual predator:</p><blockquote><p>There were times in our relationship that I was uncomfortable with the attention Joss paid other women. He always had a lot of female friends, but he told me it was because his mother raised him as a feminist, so he just liked women better. He said he admired and respected females, he didn’t lust after them. I believed him and trusted him. On the set of “Buffy,” Joss decided to have his first secret affair.<br> Fifteen years later, when he was done with our marriage and finally ready to tell the truth, he wrote me, “When I was running ‘Buffy,’ I was surrounded by beautiful, needy, aggressive young women. It felt like I had a disease, like something from a Greek myth. Suddenly I am a powerful producer and the world is laid out at my feet and I can’t touch it.” But he did touch it. He said he understood, “I would have to lie — or conceal some part of the truth — for the rest of my life,” but he did it anyway, hoping that first affair, “would be ENOUGH, that THEN we could move on and outlast it.”<br> Joss admitted that for the next decade and a half, he hid multiple affairs and a number of inappropriate emotional ones that he had with his actresses, co-workers, fans and friends, while he stayed married to me….<br> Despite understanding, on some level, that what he was doing was wrong, he never conceded the hypocrisy of being out in the world preaching feminist ideals, while at the same time, taking away my right to make choices for my life and my body based on the truth. He deceived me for 15 years, so he could have everything he wanted. I believed, everyone believed, that he was one of the good guys, committed to fighting for women’s rights, committed to our marriage, and to the women he worked with. But I now see how he used his relationship with me as a shield, both during and after our marriage, so no one would question his relationships with other women or scrutinize his writing as anything other than feminist.</br></br></br></p></blockquote><p>Male feminists are false fronts. They tend to be physically unattractive men who pose as feminists in order to obtain access to women by convincing them to let their guard down through publicly professing feminist ideology. They are easily obsessed by women and are highly prone to stalking them; John Scalzi’s account of being tempted to stalk Mary Robinette Kowal at a convention is downright creepy, although not nearly as creepy as the idea of Jim Hines being a rape counselor.<br> Rape Victim (sobbing): “He… he raped me!”<br> Jim Hines (slobbering): “Tell me about it. Tell me ALL about it!”</br></br></p><blockquote><p>Back in 2006, at Readercon(!) I was wandering around the dealer’s room when I saw John Joseph Adams talking to a woman I didn’t know. I knew JJA very casually, so I went up to say hello. The woman he was speaking to was the art director of Shimmer Magazine and her name was Mary Robinette Kowal. JJA introduced the two of us, and Mary and I started chatting and within about five minutes I was aware that I was really intensely attracted to her, in a way that actually kind of spooked me and which I was sure was immediately and clearly obvious, and possibly immediately and obviously creepy.<br> So here’s what I did. After a couple more minutes, I excused myself and went away, because I was working on the theory that if I was worried that I was coming across as creepy, I was in fact being creepy, and I didn’t want to do that both as a matter of personal inclination and also because this woman I had just met did noting to deserve me creeping all over her. Later, I saw her talking with a bunch of people I didn’t know, I didn’t go up and chat with her because I knew that the only reason I wanted to talk to that group of people is so that I could be near her, and that was a little creepy.<br> When some time after that she was with a group of people I did know and enjoyed talking to, I joined that group, made sure I didn’t focus all my attention on her and got to know her a little better by listening to her talk to others in the group and to the group in general, and talked to her like I talked to everyone else in the group. I didn’t hover near her. I definitely didn’t go out of my way to touch her. I made no great attempt to monopolize her time. When I did chat with her later one on one, I was mindful of how much of her time I was spending, and was paying attention to how she reacted to me to make sure I wasn’t overstaying my welcome. And so on.</br></br></p></blockquote><p>If that doesn’t strike you as creepy on its face, remember, the man <i>was married at the time</i>. There is definitely something deeply, insidiously wrong with any self-styled male feminist. Never forget that when they repeat their mantras of “don’t be evil” and “don’t inappropriately touch women”, they are <i>talking to themselves</i>.<br> In any event, Allum Bokhari’s take on l’affaire Whedon is without doubt the best one.<br> <i><br> </br></i><i>So, Joss Whedon used feminism to bang an endless succession of chicks and make some pretty non-feminist movies without anyone noticing. To be honest, my respect for the man has skyrocketed.</i></br></br></p></div>",
  "content_text": "Joss Whedon is merely\nthe latest “male feminist” to be outed\nas a sexual predator:\nThere were times in our relationship that I was uncomfortable with the attention Joss paid other women. He always had a lot of female friends, but he told me it was because his mother raised him as a feminist, so he just liked women better. He said he admired and respected females, he didn’t lust after them. I believed him and trusted him. On the set of “Buffy,” Joss decided to have his first secret affair.\nFifteen years later, when he was done with our marriage and finally ready to tell the truth, he wrote me, “When I was running ‘Buffy,’ I was surrounded by beautiful, needy, aggressive young women. It felt like I had a disease, like something from a Greek myth. Suddenly I am a powerful producer and the world is laid out at my feet and I can’t touch it.” But he did touch it. He said he understood, “I would have to lie — or conceal some part of the truth — for the rest of my life,” but he did it anyway, hoping that first affair, “would be ENOUGH, that THEN we could move on and outlast it.”\nJoss admitted that for the next decade and a half, he hid multiple affairs and a number of inappropriate emotional ones that he had with his actresses, co-workers, fans and friends, while he stayed married to me….\nDespite understanding, on some level, that what he was doing was wrong, he never conceded the hypocrisy of being out in the world preaching feminist ideals, while at the same time, taking away my right to make choices for my life and my body based on the truth. He deceived me for 15 years, so he could have everything he wanted. I believed, everyone believed, that he was one of the good guys, committed to fighting for women’s rights, committed to our marriage, and to the women he worked with. But I now see how he used his relationship with me as a shield, both during and after our marriage, so no one would question his relationships with other women or scrutinize his writing as anything other than feminist.\nMale feminists are false fronts. They tend to be physically unattractive men who pose as feminists in order to obtain access to women by convincing them to let their guard down through publicly professing feminist ideology. They are easily obsessed by women and are highly prone to stalking them; John Scalzi’s account of being tempted to stalk Mary Robinette Kowal at a convention is downright creepy, although not nearly as creepy as the idea of Jim Hines being a rape counselor.\nRape Victim (sobbing): “He… he raped me!”\nJim Hines (slobbering): “Tell me about it. Tell me ALL about it!”\nBack in 2006, at Readercon(!) I was wandering around the dealer’s room when I saw John Joseph Adams talking to a woman I didn’t know. I knew JJA very casually, so I went up to say hello. The woman he was speaking to was the art director of Shimmer Magazine and her name was Mary Robinette Kowal. JJA introduced the two of us, and Mary and I started chatting and within about five minutes I was aware that I was really intensely attracted to her, in a way that actually kind of spooked me and which I was sure was immediately and clearly obvious, and possibly immediately and obviously creepy.\nSo here’s what I did. After a couple more minutes, I excused myself and went away, because I was working on the theory that if I was worried that I was coming across as creepy, I was in fact being creepy, and I didn’t want to do that both as a matter of personal inclination and also because this woman I had just met did noting to deserve me creeping all over her. Later, I saw her talking with a bunch of people I didn’t know, I didn’t go up and chat with her because I knew that the only reason I wanted to talk to that group of people is so that I could be near her, and that was a little creepy.\nWhen some time after that she was with a group of people I did know and enjoyed talking to, I joined that group, made sure I didn’t focus all my attention on her and got to know her a little better by listening to her talk to others in the group and to the group in general, and talked to her like I talked to everyone else in the group. I didn’t hover near her. I definitely didn’t go out of my way to touch her. I made no great attempt to monopolize her time. When I did chat with her later one on one, I was mindful of how much of her time I was spending, and was paying attention to how she reacted to me to make sure I wasn’t overstaying my welcome. And so on.\nIf that doesn’t strike you as creepy on its face, remember, the man\nwas married at the time\n. There is definitely something deeply, insidiously wrong with any self-styled male feminist. Never forget that when they repeat their mantras of “don’t be evil” and “don’t inappropriately touch women”, they are\ntalking to themselves\n.\nIn any event, Allum Bokhari’s take on l’affaire Whedon is without doubt the best one.\nSo, Joss Whedon used feminism to bang an endless succession of chicks and make some pretty non-feminist movies without anyone noticing. To be honest, my respect for the man has skyrocketed.",
  "tags": [
    "SJW",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-23T12:00:00+00:00"
}