{
  "url": "https://voxday.net/2017/08/22/the-art-of-the-sucker/",
  "scraped_at": "2025-12-19T10:21:08.783677",
  "title": "The art of the sucker",
  "date_display": "August 22, 2017",
  "date_iso": "2017-08-22T16:08:00+00:00",
  "date_from_url": "2017-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The God-Emperor’s top aides <a href=\"http://www.mcclatchydc.com/news/politics-government/white-house/article168425547.html\">are trying to play him</a> the way Reagan and Thatcher were played:</p><blockquote><p>Trump aides plot a big immigration deal — that breaks a campaign promise. Donald Trump’s top aides are pushing him to protect young people brought into the country illegally as children — and then use the issue as a bargaining chip for a larger immigration deal — despite the president’s campaign vow to deport so-called Dreamers.<br> The White House officials want Trump to strike an ambitious deal with Congress that offers Dreamers protection in exchange for legislation that pays for a border wall and more detention facilities, curbs legal immigration and implements E-verify, an online system that allows businesses to check immigration status, according to a half-dozen people familiar with situation, most involved with the negotiations.<br> The group includes former and current White House chiefs of staff, Reince Priebus and John Kelly, the president’s daughter, Ivanka Trump, and her husband, Jared Kushner, who both serve as presidential advisers, they said. Others who have not been as vocal publicly about their stance but are thought to agree include Vice President Mike Pence, who as a congressman worked on a failed immigration deal that called for citizenship, National Security Adviser H.R. McMaster and Gary Cohn, a Democrat who serves as director of the National Economic Council.<br> “They are holding this out as a bargaining chip for other things,” said Ira Mehlman, a spokesman with the Federation for American Reform, a group that opposes protecting Dreamers and is in talks with the administration.<br> On the other side, a smaller group — including Attorney General Jeff Sessions and his former aides, Stephen Miller, who serves as Trump’s senior policy adviser, and Rick Dearborn, White House deputy chief of staff — opposes citizenship, according to sources familiar with the discussions.</br></br></br></br></p></blockquote><p>An ambitious immigration deal with Congress. That sounds familiar, how did that work out in 1986? It’s rather remarkable that an experienced negotiator like Donald Trump doesn’t seem to fully grasp the way in which <i>everything else he does</i> will be rendered entirely moot by giving in on immigration. This would appear to be a crucial nexus, and if handled incorrectly, has the potential to serve as his own “No New Taxes” moment, which you will recall sank a George Bush who had previously been riding very high in the polls and was widely expected to win reelection.<br> If Trump doesn’t build the wall and maintain a hard line on immigration, he will not win the 2020 election, as he will lose the base that has remained loyal to him throughout. It’s literally the one thing he cannot afford to do, which is why he should immediately fire any adviser, from his daughter on down, who is advising him to throw away his core support in pursuit of a mirage and approval from the Left that will never come.<br> Never abandon your base. Never abandon your core. If you do not understand this, you are absolutely guaranteed failure.<br> This really isn’t that hard. 1) Build the Wall. 2) They have to go back.</br></br></br></p></div>",
  "content_text": "The God-Emperor’s top aides\nare trying to play him\nthe way Reagan and Thatcher were played:\nTrump aides plot a big immigration deal — that breaks a campaign promise. Donald Trump’s top aides are pushing him to protect young people brought into the country illegally as children — and then use the issue as a bargaining chip for a larger immigration deal — despite the president’s campaign vow to deport so-called Dreamers.\nThe White House officials want Trump to strike an ambitious deal with Congress that offers Dreamers protection in exchange for legislation that pays for a border wall and more detention facilities, curbs legal immigration and implements E-verify, an online system that allows businesses to check immigration status, according to a half-dozen people familiar with situation, most involved with the negotiations.\nThe group includes former and current White House chiefs of staff, Reince Priebus and John Kelly, the president’s daughter, Ivanka Trump, and her husband, Jared Kushner, who both serve as presidential advisers, they said. Others who have not been as vocal publicly about their stance but are thought to agree include Vice President Mike Pence, who as a congressman worked on a failed immigration deal that called for citizenship, National Security Adviser H.R. McMaster and Gary Cohn, a Democrat who serves as director of the National Economic Council.\n“They are holding this out as a bargaining chip for other things,” said Ira Mehlman, a spokesman with the Federation for American Reform, a group that opposes protecting Dreamers and is in talks with the administration.\nOn the other side, a smaller group — including Attorney General Jeff Sessions and his former aides, Stephen Miller, who serves as Trump’s senior policy adviser, and Rick Dearborn, White House deputy chief of staff — opposes citizenship, according to sources familiar with the discussions.\nAn ambitious immigration deal with Congress. That sounds familiar, how did that work out in 1986? It’s rather remarkable that an experienced negotiator like Donald Trump doesn’t seem to fully grasp the way in which\neverything else he does\nwill be rendered entirely moot by giving in on immigration. This would appear to be a crucial nexus, and if handled incorrectly, has the potential to serve as his own “No New Taxes” moment, which you will recall sank a George Bush who had previously been riding very high in the polls and was widely expected to win reelection.\nIf Trump doesn’t build the wall and maintain a hard line on immigration, he will not win the 2020 election, as he will lose the base that has remained loyal to him throughout. It’s literally the one thing he cannot afford to do, which is why he should immediately fire any adviser, from his daughter on down, who is advising him to throw away his core support in pursuit of a mirage and approval from the Left that will never come.\nNever abandon your base. Never abandon your core. If you do not understand this, you are absolutely guaranteed failure.\nThis really isn’t that hard. 1) Build the Wall. 2) They have to go back.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-22T15:08:00+00:00"
}