{
  "url": "https://voxday.net/2017/08/18/the-man-in-the-arena/",
  "scraped_at": "2025-12-19T10:20:38.875893",
  "title": "The Man in the Arena",
  "date_display": "August 18, 2017",
  "date_iso": "2017-08-18T16:00:00+00:00",
  "date_from_url": "2017-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a nice <a href=\"https://www.menofthewest.net/the-man-in-the-arena/\">defense of yours truly</a> by Rabbi B at Men of the West. I don’t ask for anyone to defend me, but I do appreciate those of every race, religion, and even creed who are willing to stand beside me, or even just hold their fire long enough to pay a modicum of respect.</p><blockquote><p>There is an old saying that it’s the pioneers who take the arrows. This is most certainly true of Vox Day and perhaps ironically so, considering his Native American heritage. I think many would agree that Vox has certainly taken his fair share of arrows lately. Now, this may not qualify him as the undisputed leader of the Alt-right (and Vox is quite loathe to exalt or proclaim himself as a leader of anything), but I would argue that it certainly qualifies him as one of its unsung heroes.<br> Vox is simply a person who is committed to the truth; always has been and always will be, period. In Jewish parlance, he is a mensch. In an age where the truth is spun, disparaged, and cast to the ground to be trampled underfoot, Vox is not content to stand by and do nothing. Vox, to put it plainly, is a man who is valiant for the truth.<br> We find ourselves in a time where the end justifies the means and the truth be damned, and so Vox is not only going to be misunderstood and misrepresented due to his superior intellect for which many are simply no match, but even more so on account of the truths which he tirelessly expresses, champions, and defends day in and day out.<br> Because of his staunch commitment to the truth, he is inevitably going to make some enemies along the way and, consequently, he is going to be forced to endure and withstand a steady barrage of attacks from every quarter: the Left, the Right, the center, the cuckservatives, the neo-cons, the libertarians, the Alt-right, the Alt-lite, the you-fill-in-the-blank. There is no shortage of those who oppose the truth and who are unafraid and brazen enough to relentlessly attack the valiant vessels of the truth. Vox just happens to be such a vessel for a time such as this.</br></br></br></p></blockquote><p>The thing that I always try to keep in mind is that the truth is what it is, regardless of what you, or I, or anyone else, happen to think. Now, we see as through through a glass, darkly. So, be as ruthlessly honest with yourself as you can, and all the rest will tend to fall in line on its own.<br> I don’t expect everyone to agree with me. I don’t expect ANYONE to agree with me on everything. How could I, when I don’t always agree with my own ideas from five or ten years ago? What I expect is the aforementioned arrows, some merited, some not so much.<br> I don’t really care about labels and parties and movements and such. What I care about is the underlying ideas that they represent, in some cases accurately, in some cases not accurately at all. Because ideas are how we understand the truth, and whatever small fragments of the Truth that we are capable of comprehending.</br></br></p></div>",
  "content_text": "This is a nice\ndefense of yours truly\nby Rabbi B at Men of the West. I don’t ask for anyone to defend me, but I do appreciate those of every race, religion, and even creed who are willing to stand beside me, or even just hold their fire long enough to pay a modicum of respect.\nThere is an old saying that it’s the pioneers who take the arrows. This is most certainly true of Vox Day and perhaps ironically so, considering his Native American heritage. I think many would agree that Vox has certainly taken his fair share of arrows lately. Now, this may not qualify him as the undisputed leader of the Alt-right (and Vox is quite loathe to exalt or proclaim himself as a leader of anything), but I would argue that it certainly qualifies him as one of its unsung heroes.\nVox is simply a person who is committed to the truth; always has been and always will be, period. In Jewish parlance, he is a mensch. In an age where the truth is spun, disparaged, and cast to the ground to be trampled underfoot, Vox is not content to stand by and do nothing. Vox, to put it plainly, is a man who is valiant for the truth.\nWe find ourselves in a time where the end justifies the means and the truth be damned, and so Vox is not only going to be misunderstood and misrepresented due to his superior intellect for which many are simply no match, but even more so on account of the truths which he tirelessly expresses, champions, and defends day in and day out.\nBecause of his staunch commitment to the truth, he is inevitably going to make some enemies along the way and, consequently, he is going to be forced to endure and withstand a steady barrage of attacks from every quarter: the Left, the Right, the center, the cuckservatives, the neo-cons, the libertarians, the Alt-right, the Alt-lite, the you-fill-in-the-blank. There is no shortage of those who oppose the truth and who are unafraid and brazen enough to relentlessly attack the valiant vessels of the truth. Vox just happens to be such a vessel for a time such as this.\nThe thing that I always try to keep in mind is that the truth is what it is, regardless of what you, or I, or anyone else, happen to think. Now, we see as through through a glass, darkly. So, be as ruthlessly honest with yourself as you can, and all the rest will tend to fall in line on its own.\nI don’t expect everyone to agree with me. I don’t expect ANYONE to agree with me on everything. How could I, when I don’t always agree with my own ideas from five or ten years ago? What I expect is the aforementioned arrows, some merited, some not so much.\nI don’t really care about labels and parties and movements and such. What I care about is the underlying ideas that they represent, in some cases accurately, in some cases not accurately at all. Because ideas are how we understand the truth, and whatever small fragments of the Truth that we are capable of comprehending.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-18T15:00:00+00:00"
}