{
  "url": "https://voxday.net/2017/08/19/unintended-consequences-2/",
  "scraped_at": "2025-12-19T10:20:43.344274",
  "title": "Unintended consequences",
  "date_display": "August 19, 2017",
  "date_iso": "2017-08-19T09:11:00+00:00",
  "date_from_url": "2017-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why it never pays to overreact to what other people are doing. Be patient and observant, and you’ll see that <a href=\"https://renegadeinc.com/truth-will-not-be-googled/?utm_content=bufferc297b&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer\">there are usually silver linings</a> and new opportunities that are exposed by every action, however ill-intended:</p><blockquote><p>Earlier this week, internet hosting provider, GoDaddy, announced it had cancelled US neo-Nazi website, Daily Stormer, for posting an attack on Heather Heyer, the protester who was murdered at the Klan rally in Charlottesville last week. Google and CloudFlare likewise cancelled its registration after the site tried to move its hosting over to their respective services.<br> But while these hosting services are being congratulated by some – and condemned by others on free-speech grounds – for ensuring that those looking to commit violence have to work slightly harder to get access to their like-minded Nazi communities, those who own the means of transmission – namely Google, Facebook and Twitter – are still preventing the rest of us from accessing information that allows people to make sense of the world around us.<br> Earlier this month, Google altered its algorithm – allegedly in an attempt to address the ‘fake news’ problem – and in doing so, a broad array of anti-establishment news organisations, whistleblower, civil-rights and anti-war websites were censored from its search listings. But most people were too distracted by the opinions of some low-level engineer on Google’s diversity hiring policies and its intolerance of conservative views in the workplace to take notice.<br> The data released by WSWS shows that since Google altered its algorithm, Wikileaks experienced a 30% decline in traffic from Google searches. Democracy Now fell by 36%. Truthout dropped by 25%. Its own traffic dropped by 67% percent over the same period. Alternet saw a 63% decline in traffic. Media Matters saw a 36% drop in traffic. Counterpunch.org fell by 21%. The Intercept fell by 19%.<br> In May, WSWS was ranked 5th in Google searches for the keyword ‘socialism’. Today the WSWS is nowhere to be found in the top 200 searches for the same keyword. In addition, Google blocked every one of WSW’s top 45 search terms.<br> Aaron Kaufman, director of development at progressive news outlet, Common Dreams said that Google Search as a percentage of total traffic to the Common Dreams website has decreased nearly 50 percent since May.</br></br></br></br></br></p></blockquote><p>Of course, this really shouldn’t be a surprise. After all, as I have conclusively demonstrated, if you shoot at Nazis, you’re mostly going to hit leftists.<br> <i><br> </br></i><i>Google is not the only player in this censorship game. Earlier last year, anti-establishment information services – Renegade Inc included – experienced a 20% drop in traffic to its Facebook pages, after the social-network altered its algorithm, again, allegedly in an attempt to crack down on ‘fake news’.</i><br> Perhaps these leftist sites should stop attempting to push Fake News. It’s interesting to note that since this crackdown on Fake News, the traffic here has observably risen. I doubt there is any actual connection, but it is an amusingly timed coincidence.</br></br></p></div>",
  "content_text": "This is why it never pays to overreact to what other people are doing. Be patient and observant, and you’ll see that\nthere are usually silver linings\nand new opportunities that are exposed by every action, however ill-intended:\nEarlier this week, internet hosting provider, GoDaddy, announced it had cancelled US neo-Nazi website, Daily Stormer, for posting an attack on Heather Heyer, the protester who was murdered at the Klan rally in Charlottesville last week. Google and CloudFlare likewise cancelled its registration after the site tried to move its hosting over to their respective services.\nBut while these hosting services are being congratulated by some – and condemned by others on free-speech grounds – for ensuring that those looking to commit violence have to work slightly harder to get access to their like-minded Nazi communities, those who own the means of transmission – namely Google, Facebook and Twitter – are still preventing the rest of us from accessing information that allows people to make sense of the world around us.\nEarlier this month, Google altered its algorithm – allegedly in an attempt to address the ‘fake news’ problem – and in doing so, a broad array of anti-establishment news organisations, whistleblower, civil-rights and anti-war websites were censored from its search listings. But most people were too distracted by the opinions of some low-level engineer on Google’s diversity hiring policies and its intolerance of conservative views in the workplace to take notice.\nThe data released by WSWS shows that since Google altered its algorithm, Wikileaks experienced a 30% decline in traffic from Google searches. Democracy Now fell by 36%. Truthout dropped by 25%. Its own traffic dropped by 67% percent over the same period. Alternet saw a 63% decline in traffic. Media Matters saw a 36% drop in traffic. Counterpunch.org fell by 21%. The Intercept fell by 19%.\nIn May, WSWS was ranked 5th in Google searches for the keyword ‘socialism’. Today the WSWS is nowhere to be found in the top 200 searches for the same keyword. In addition, Google blocked every one of WSW’s top 45 search terms.\nAaron Kaufman, director of development at progressive news outlet, Common Dreams said that Google Search as a percentage of total traffic to the Common Dreams website has decreased nearly 50 percent since May.\nOf course, this really shouldn’t be a surprise. After all, as I have conclusively demonstrated, if you shoot at Nazis, you’re mostly going to hit leftists.\nGoogle is not the only player in this censorship game. Earlier last year, anti-establishment information services – Renegade Inc included – experienced a 20% drop in traffic to its Facebook pages, after the social-network altered its algorithm, again, allegedly in an attempt to crack down on ‘fake news’.\nPerhaps these leftist sites should stop attempting to push Fake News. It’s interesting to note that since this crackdown on Fake News, the traffic here has observably risen. I doubt there is any actual connection, but it is an amusingly timed coincidence.",
  "tags": [
    "corpocracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-19T08:11:00+00:00"
}