{
  "url": "https://voxday.net/2017/08/12/unite-the-white/",
  "scraped_at": "2025-12-18T07:26:25.313688",
  "title": "Unite the White",
  "date_display": "August 12, 2017",
  "date_iso": "2017-08-12T10:04:00+00:00",
  "date_from_url": "2017-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The media and the multiculti Left are gearing up for a new offensive in <a href=\"https://medium.com/@RVAwonk/unite-the-right-rally-reflects-a-growing-threat-of-extremism-in-america-e94f57b61980\">its war against the Alt-Right</a>:</p><blockquote><p>Unite the Right, Divide the Nation<br> Perhaps most troubling are the group dynamics at work here, which are indicative of an identity movement’s spiral towards violent extremism. Though the groups that will coalesce in Charlottesville represent a spectrum of far-right viewpoints, they all share a common goal: Redefining the boundaries of the American identity — i.e., what it means to be a “real” American, and who gets to be included in that group.<br> This process involves several steps, the first of which is framing the identity of the “in-group” (those deemed to be “real” Americans) as inseparable from the derogation of an “out-group” (those who aren’t included in an increasingly narrow construction of American identity). The groups that make up the Unite the Right rally have differing perspectives on exactly where to draw the line separating the in-group from the out-group. The definition of the out-group is flexible and may include Muslims, immigrants, Jews, African Americans, liberals, feminists, and more. This so-called “fluidity of groups” often accompanies the transition to extremism.</br></br></p></blockquote><p>But that’s just it. Paper Americans are not real Americans. They are Mexican. They are Chinese. They are Jews. They are <i>already members of a nation</i> that is not the American nation. And the myths of “proposition nations” and “nations of immigrants” “Judeo-Christian America” and “Black Roman Britain” notwithstanding, they will remain members of that distinct and sovereign nation regardless of where they reside.<br> A dog does not become a horse by virtue of being born in a stable.<br> It is not merely the Right that is being forcibly united whether it will or not. The next generation is already divided into White Americans and Not-White Not-Americans. Note, in particular, the difference between White girls and Black-Hispanic-Asian girls.</br></br></p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DG0kYI1VoAA6cf8.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"430\" data-original-width=\"665\" decoding=\"async\" fetchpriority=\"high\" height=\"258\" src=\"https://pbs.twimg.com/media/DG0kYI1VoAA6cf8.jpg\" width=\"400\"/></a></div><p>Now, all of the White cucks, conservatives, and liberals will still cluck and posture about how they are colorblind and so forth. But unlike the tango, it doesn’t take two to war or identity-politick. All politics in the USA are now identity politics, whether people realize it or not.</p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DHBIiBpXcAEPGHV.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"558\" data-original-width=\"671\" decoding=\"async\" height=\"266\" src=\"https://pbs.twimg.com/media/DHBIiBpXcAEPGHV.jpg\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"558\" data-original-width=\"671\" data-src=\"https://pbs.twimg.com/media/DHBIiBpXcAEPGHV.jpg\" decoding=\"async\" height=\"266\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20266%22%3E%3C/svg%3E\" width=\"320\"/></a></div></div>",
  "content_text": "The media and the multiculti Left are gearing up for a new offensive in\nits war against the Alt-Right\n:\nUnite the Right, Divide the Nation\nPerhaps most troubling are the group dynamics at work here, which are indicative of an identity movement’s spiral towards violent extremism. Though the groups that will coalesce in Charlottesville represent a spectrum of far-right viewpoints, they all share a common goal: Redefining the boundaries of the American identity — i.e., what it means to be a “real” American, and who gets to be included in that group.\nThis process involves several steps, the first of which is framing the identity of the “in-group” (those deemed to be “real” Americans) as inseparable from the derogation of an “out-group” (those who aren’t included in an increasingly narrow construction of American identity). The groups that make up the Unite the Right rally have differing perspectives on exactly where to draw the line separating the in-group from the out-group. The definition of the out-group is flexible and may include Muslims, immigrants, Jews, African Americans, liberals, feminists, and more. This so-called “fluidity of groups” often accompanies the transition to extremism.\nBut that’s just it. Paper Americans are not real Americans. They are Mexican. They are Chinese. They are Jews. They are\nalready members of a nation\nthat is not the American nation. And the myths of “proposition nations” and “nations of immigrants” “Judeo-Christian America” and “Black Roman Britain” notwithstanding, they will remain members of that distinct and sovereign nation regardless of where they reside.\nA dog does not become a horse by virtue of being born in a stable.\nIt is not merely the Right that is being forcibly united whether it will or not. The next generation is already divided into White Americans and Not-White Not-Americans. Note, in particular, the difference between White girls and Black-Hispanic-Asian girls.\nNow, all of the White cucks, conservatives, and liberals will still cluck and posture about how they are colorblind and so forth. But unlike the tango, it doesn’t take two to war or identity-politick. All politics in the USA are now identity politics, whether people realize it or not.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-12T09:04:00+00:00"
}