{
  "url": "https://voxday.net/2017/08/25/what-say-you-supporters/",
  "scraped_at": "2025-12-19T10:21:29.695621",
  "title": "What say you, supporters",
  "date_display": "August 25, 2017",
  "date_iso": "2017-08-25T17:10:00+00:00",
  "date_from_url": "2017-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I like to think that I know my own supporters’ minds better than the average individual, but I could be wrong. What say you?</p><blockquote><p>Vikfield‏ @vikfield<br> This was a really bad idea. You are dividing the right by forcing this meme. Please re-think this.<br> Supreme Dark Lord‏ @voxday<br> You can’t divide the Right by pointing out who is not, and has never been, of the Right. We tried this with the neocons, remember?<br> Vikfield‏ @vikfield  55m55 minutes ago<br> Btw, check out the RT and Like stats on this Meme vs your other #DailyMemeWars What you are doing is not popular with your own people<br> Supreme Dark Lord‏ @voxday<br> It wasn’t popular when I predicted the 2008 financial crisis either. I don’t give a quantum rat’s ass about popularity. I never have.<br> Vikfield‏ @vikfield<br> I’m not talking about popularity with the masses but within your own supporters. What you are doing is illogical and we can see that.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Vikfield is a genuine supporter of two years duration. So, I’m willing to hear him out and at least entertain the possibility that his assertion is correct. Here is the meme and the statistics compared to other recent #DailyMemeWars tweets. The tweet in question is italicized.</p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DH-7LbpWsAAunop.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"366\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DH-7LbpWsAAunop.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"366\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DH-7LbpWsAAunop.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20366%22%3E%3C/svg%3E\"/></a></div><p>Aug 25:  9,747 Impressions, 152 Likes, 136 Retweets<br> <i>Aug 24: 26,215 Impressions, 200 Likes, 143 Retweets</i><br> Aug 23: 21,539 Impressions, 271 Likes, 200 Retweets<br> Aug 22: 37,030 Impressions, 428 Likes, 305 Retweets<br> I have to admit, it’s not a spectacularly successful meme – far too wordy and rather esoteric – but I think it would be stretching it somewhat to claim that it is “not popular” with my own people. I am not going to back down on anything I’ve said, but I’m quite willing to hear your opinions concerning my take on the Fake Right.<br> Speaking of which, you’d think they’d learn. But they never do.</br></br></br></br></br></p><blockquote><p>Supreme Dark Lord @voxday<br> I don’t do rallies. Or events. Or conventions. I reject all speaking invitations and I have for 16 years.<br> Jason Kessler‏ @TheMadDimension<br> Is that because of your stutter?<br> Supreme Dark Lord‏ @voxday<br> No, it’s because of your face. Your soft, pasty-white, terrified face with tears running down it as a girl tackled you.</br></br></br></br></br></p></blockquote></div>",
  "content_text": "I like to think that I know my own supporters’ minds better than the average individual, but I could be wrong. What say you?\nVikfield‏ @vikfield\nThis was a really bad idea. You are dividing the right by forcing this meme. Please re-think this.\nSupreme Dark Lord‏ @voxday\nYou can’t divide the Right by pointing out who is not, and has never been, of the Right. We tried this with the neocons, remember?\nVikfield‏ @vikfield  55m55 minutes ago\nBtw, check out the RT and Like stats on this Meme vs your other #DailyMemeWars What you are doing is not popular with your own people\nSupreme Dark Lord‏ @voxday\nIt wasn’t popular when I predicted the 2008 financial crisis either. I don’t give a quantum rat’s ass about popularity. I never have.\nVikfield‏ @vikfield\nI’m not talking about popularity with the masses but within your own supporters. What you are doing is illogical and we can see that.\nVikfield is a genuine supporter of two years duration. So, I’m willing to hear him out and at least entertain the possibility that his assertion is correct. Here is the meme and the statistics compared to other recent #DailyMemeWars tweets. The tweet in question is italicized.\nAug 25:  9,747 Impressions, 152 Likes, 136 Retweets\nAug 24: 26,215 Impressions, 200 Likes, 143 Retweets\nAug 23: 21,539 Impressions, 271 Likes, 200 Retweets\nAug 22: 37,030 Impressions, 428 Likes, 305 Retweets\nI have to admit, it’s not a spectacularly successful meme – far too wordy and rather esoteric – but I think it would be stretching it somewhat to claim that it is “not popular” with my own people. I am not going to back down on anything I’ve said, but I’m quite willing to hear your opinions concerning my take on the Fake Right.\nSpeaking of which, you’d think they’d learn. But they never do.\nSupreme Dark Lord @voxday\nI don’t do rallies. Or events. Or conventions. I reject all speaking invitations and I have for 16 years.\nJason Kessler‏ @TheMadDimension\nIs that because of your stutter?\nSupreme Dark Lord‏ @voxday\nNo, it’s because of your face. Your soft, pasty-white, terrified face with tears running down it as a girl tackled you.",
  "tags": [
    "ELoE",
    "MemeWars"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-25T16:10:00+00:00"
}