{
  "url": "https://voxday.net/2017/08/03/what-part-of-cruelty-artist-do-they-no/",
  "scraped_at": "2025-12-18T07:25:10.174507",
  "title": "What part of “cruelty artist” do they not get?",
  "date_display": "August 3, 2017",
  "date_iso": "2017-08-03T12:00:00+00:00",
  "date_from_url": "2017-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do home run hitters ever stand there watching a nice fat pitch heading straight over the plate, and, as they start to swing, find themselves thinking, <i>I cannot believe he thought THAT was a good idea</i>?<br/></p><blockquote><p> Choy Li Fut Lady虎爪‏ @HungSingMA<br> Why does being a physicist make Brian Cox more intelligent? Btw, Liam Gallagher’s IQ is Higher than Einstein’s was.</br></p><p>Supreme Dark Lord‏ @voxday<br> <br> Because you have to be able to grasp the math involved. Most really smart people (150+) don’t work in intellectually elite professions.</br></br></p><p>Choy Li Fut Lady虎爪‏ @HungSingMA<br> So? Doesn’t mean people who are able to grasp the maths don’t do history.</br></p><p>Supreme Dark Lord‏ @voxday<br> True. But the highest measured IQ of 148 Cambridge faculty members was 139. Academics, on average, are third-rate intelligences.</br></p><p>Matthew L‏ @Blethigg<br> When asked what his IQ is: “I have no idea. People who boast about their IQ are losers.”<br>  – Steven Hawking</br></br></p><p>Supreme Dark Lord‏ @voxday<br> I bet he doesn’t know his 100-meter time either.</br></p></blockquote><p>The irony, of course, is that Steven Hawking himself is a wildly overrated academic <a href=\"http://www.milobookclub.com/2011/06/26/eco-on-hawking/\">who could not philosophize his way out of a box</a>. Like most popularizers, he is considerably less intelligent than his fans believe him to be. Hawking wouldn’t fare much better in a debate on religion or philosophy than he would in a footrace.</p><p>I discussed the concept of overrated intellectual elites in <a href=\"https://www.periscope.tv/voxday/1yNGamMyqqlGj\">last night’s Darkstream</a> on Our Third-Rate Intellectual Elites. There is an Easter Egg in there if you listen to the whole thing. I suspect it will amuse most of you.</p><p>Meanwhile, the outraged response to <a href=\"https://twitter.com/voxday/status/893067518901989378\">this tweet</a> should prove entertaining.</p><p>Supreme Dark Lord‏ @voxday<br> <i>For her next trick, “historian” @wmarybeard is going to defend Kevin Costner’s American accent in Robin Hood.</i></br></p><p>The creepy thing is that Mary Beard was attempting to justify BBC diversity propaganda aimed at children while obviously being aware that mass rape is “a way of creating a mixed society”. What are we supposed to conclude from this, that Rotherham is the modern equivalent of the Rape of the Sabine Women and therefore <a href=\"https://www.theatlantic.com/magazine/archive/2015/12/the-secret-of-romes-success/413143/\">justified in the name of diversity</a>?<br> <i><br/></i><br> <i>The Romans’ sense of their society as a hybrid one, Beard finds, is folded into their founding legends. Virgil’s Aeneid celebrates the Trojan hero who founded the city—a foreigner who, though he kills some of the native inhabitants, also unites the warring tribes. And without downplaying the horrific violence in the tale of Romulus and Remus and the rape of the Sabine women, Beard notes that the mass rape is portrayed not just as evidence of Roman aggression but as a way of creating a mixed society.</i><br> <i><br/></i><br> UPDATE: Mary Beard is already trying to run away from her own positions. Not that it will do her any good. It just adds two steps to the same conclusion. She’s also<a href=\"https://www.the-tls.co.uk/roman-britain-black-white/\"> cried to The Times</a> already.<br> <i><br/></i><br/></br></br></br></br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://files.gab.ai/image/59831ea0836f3.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"589\" data-original-width=\"613\" decoding=\"async\" fetchpriority=\"high\" height=\"383\" src=\"https://files.gab.ai/image/59831ea0836f3.jpeg\" width=\"400\"/></a></div><p><i><br/></i><br> UPDATE: Taleb pulls no punches, as usual.<br> <i><br/></i><br> NassimNicholasTaleb‏@nntaleb<br> <i>More </i><i>Evidence that Ms Beard is a bullshitter. She tried to degrade me to “pop risk” until I compated the “pop” to HERs. </i><i>Her report. </i><i>Bullshitter!</i></br></br></br></br></p><p>NassimNicholasTaleb‏@nntaleb<br> <i>If that’s how Mary Beard bullshits about her exchange with me, how can anyone trust her historical reports? </i><i>No more use for her.</i></br></p></div>",
  "content_text": "Do home run hitters ever stand there watching a nice fat pitch heading straight over the plate, and, as they start to swing, find themselves thinking,\nI cannot believe he thought THAT was a good idea\n?\nChoy Li Fut Lady虎爪‏ @HungSingMA\nWhy does being a physicist make Brian Cox more intelligent? Btw, Liam Gallagher’s IQ is Higher than Einstein’s was.\nSupreme Dark Lord‏ @voxday\nBecause you have to be able to grasp the math involved. Most really smart people (150+) don’t work in intellectually elite professions.\nChoy Li Fut Lady虎爪‏ @HungSingMA\nSo? Doesn’t mean people who are able to grasp the maths don’t do history.\nSupreme Dark Lord‏ @voxday\nTrue. But the highest measured IQ of 148 Cambridge faculty members was 139. Academics, on average, are third-rate intelligences.\nMatthew L‏ @Blethigg\nWhen asked what his IQ is: “I have no idea. People who boast about their IQ are losers.”\n– Steven Hawking\nSupreme Dark Lord‏ @voxday\nI bet he doesn’t know his 100-meter time either.\nThe irony, of course, is that Steven Hawking himself is a wildly overrated academic\nwho could not philosophize his way out of a box\n. Like most popularizers, he is considerably less intelligent than his fans believe him to be. Hawking wouldn’t fare much better in a debate on religion or philosophy than he would in a footrace.\nI discussed the concept of overrated intellectual elites in\nlast night’s Darkstream\non Our Third-Rate Intellectual Elites. There is an Easter Egg in there if you listen to the whole thing. I suspect it will amuse most of you.\nMeanwhile, the outraged response to\nthis tweet\nshould prove entertaining.\nSupreme Dark Lord‏ @voxday\nFor her next trick, “historian” @wmarybeard is going to defend Kevin Costner’s American accent in Robin Hood.\nThe creepy thing is that Mary Beard was attempting to justify BBC diversity propaganda aimed at children while obviously being aware that mass rape is “a way of creating a mixed society”. What are we supposed to conclude from this, that Rotherham is the modern equivalent of the Rape of the Sabine Women and therefore\njustified in the name of diversity\n?\nThe Romans’ sense of their society as a hybrid one, Beard finds, is folded into their founding legends. Virgil’s Aeneid celebrates the Trojan hero who founded the city—a foreigner who, though he kills some of the native inhabitants, also unites the warring tribes. And without downplaying the horrific violence in the tale of Romulus and Remus and the rape of the Sabine women, Beard notes that the mass rape is portrayed not just as evidence of Roman aggression but as a way of creating a mixed society.\nUPDATE: Mary Beard is already trying to run away from her own positions. Not that it will do her any good. It just adds two steps to the same conclusion. She’s also\ncried to The Times\nalready.\nUPDATE: Taleb pulls no punches, as usual.\nNassimNicholasTaleb‏@nntaleb\nMore\nEvidence that Ms Beard is a bullshitter. She tried to degrade me to “pop risk” until I compated the “pop” to HERs.\nHer report.\nBullshitter!\nNassimNicholasTaleb‏@nntaleb\nIf that’s how Mary Beard bullshits about her exchange with me, how can anyone trust her historical reports?\nNo more use for her.",
  "tags": [
    "rhetoric",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-03T11:00:00+00:00"
}