{
  "url": "https://voxday.net/2017/08/09/when-smart-guy-meets-smarter-guy/",
  "scraped_at": "2025-12-18T07:25:56.438880",
  "title": "When smart guy meets smarter guy",
  "date_display": "August 9, 2017",
  "date_iso": "2017-08-09T10:53:00+00:00",
  "date_from_url": "2017-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The result <a href=\"http://jackbaruth.com/?p=7152\">often looks like road kill</a>, because far too many smart guys, and girls, rely upon nothing more than bluffing and credentials, which only serve to intimidate the midwits and prevent them from noticing that they haven’t actually backed up their arguments.</p><blockquote><p>This is straight out of The Autism Spectrum Handbook For Winning Online Arguments, 3rd Ed. and it shows a common weakness of the inadequately socialized: they are rarely satisfied with anything other than a FLAWLESS VICTORY in a discussion despite the relative rarity of said victories. I think it probably goes back to when Zunger was the smartest kid in his classroom and he could easily demolish any argument with a list of pre-memorized facts and figures, seasoned liberally with the I’m-smarter-than-you-and-you-know-it attitude. Many people, including both commenters and authors at this blog, have fallen prey to that temptation, because most people of above-average intelligence have, at one time or another, been the smartest person in the room. Of course, to be the smartest person in your Ohio State Classroom you probably need to be a 95th-percentile intellect, while to do the same at Stanford maybe you’re one in a thousand — and that means there are still more than seven million of you out there.<br> <i><br> </br></i><i>1.I’m not going to spend any length of time on (1); if anyone wishes to provide details as to how nearly every statement about gender in that entire document is actively incorrect, and flies directly in the face of all research done in the field for decades, they should go for it. But I am neither a biologist, a psychologist, nor a sociologist, so I’ll leave that to someone else.</i><br> This “I’m not enough of an expert to explain why I’m right but I’m enough of an expert to know I’m right” business is a smart-guy boilerplate response. It can be ignored. There is plenty of scholarship out there that shows innate differences between men and women in nearly any category of which you could readily conceive. Here is just such a paper, which should appeal to Mr. Zunger because it is both a front-page Google result and a product of Stanford….<br> It’s plainly obvious from Zunger’s essay that the primary function of Google, as he currently understands it, is to cooperate and collaborate for the social good. It has nothing to do with writing good software or effective software. Anybody can do that now. Code doesn’t matter.<br> Mr. Zunger is a very smart man, and he is a scientist to boot. But here’s the thing about modern scientists: they are only trained focus on very small things. The days of the Victorian gentleman chemist are past us now. All of the big ideas that could possibly come to a classically-educated man relaxing on the Louis-Quatorze-era chair in his family estate’s library have been discovered. Today’s science is done by putting laser-like attention on finite areas of effort.<br> The problem with Google, and the problem with other modern software houses, is that they have decided to put their laser-like attention on things other than quality of product. They focus on diversity, social good, various arcane theories of user-interface design, and other things that have nothing to do with writing effective code. Unsurprisingly, they aren’t very good at doing any of those new tasks — and because they’ve abandoned the things that they used to do well, the foundations are slipping out from underneath them.<br> Today’s Google home page is a slow-loading mess compared to what it used to be, loaded with buggy features and featuring plenty of bugs. Browser-dependent, hugely bloated, more like the old Excite! homepage than anything a Google user would have enjoyed a decade ago. It’s simply not very good anymore. That should worry the people at Google. Fixing that should be a priority above “social good” or “diverse teams”. They should hire the smartest people and have them write the best code. Period. That’s what Google is supposed to do. Whenever Google does that, it succeeds. Whenever they try to change the world, it’s a ridiculous failure.<br> Which brings me to the funny part. From what I’ve read, Mr. Zunger’s primary accomplishment at Google was…<br> wait for it..<br> Google Plus. Which is<br> a) utter garbage<br> b) currently serving a user base that is 74% male.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I think one of my biggest advantages as a debater is that I grew up with a best friend whose IQ exceeds mine. I could not say anything without him playing devil’s advocate, and promptly ripping to shreds any baseless posturing or unsupported assertions.<br> Zunger’s empty posturing is remarkably common among the cognitive elite, particularly the professionals, who are frequently inclined to opine about matters on which they are not sufficiently informed. That, of course, is why they are so defensive when called out; they realize that the whole edifice will come crumbling down if deference is not paid to them, thereby allowing them to avoid their bluffs being called.<br> Smart people usually construct their arguments to impress midwits and normal people. Smarter people construct them with an eye to hypothetical critics who may be smarter than they are.</br></br></p></div>",
  "content_text": "The result\noften looks like road kill\n, because far too many smart guys, and girls, rely upon nothing more than bluffing and credentials, which only serve to intimidate the midwits and prevent them from noticing that they haven’t actually backed up their arguments.\nThis is straight out of The Autism Spectrum Handbook For Winning Online Arguments, 3rd Ed. and it shows a common weakness of the inadequately socialized: they are rarely satisfied with anything other than a FLAWLESS VICTORY in a discussion despite the relative rarity of said victories. I think it probably goes back to when Zunger was the smartest kid in his classroom and he could easily demolish any argument with a list of pre-memorized facts and figures, seasoned liberally with the I’m-smarter-than-you-and-you-know-it attitude. Many people, including both commenters and authors at this blog, have fallen prey to that temptation, because most people of above-average intelligence have, at one time or another, been the smartest person in the room. Of course, to be the smartest person in your Ohio State Classroom you probably need to be a 95th-percentile intellect, while to do the same at Stanford maybe you’re one in a thousand — and that means there are still more than seven million of you out there.\n1.I’m not going to spend any length of time on (1); if anyone wishes to provide details as to how nearly every statement about gender in that entire document is actively incorrect, and flies directly in the face of all research done in the field for decades, they should go for it. But I am neither a biologist, a psychologist, nor a sociologist, so I’ll leave that to someone else.\nThis “I’m not enough of an expert to explain why I’m right but I’m enough of an expert to know I’m right” business is a smart-guy boilerplate response. It can be ignored. There is plenty of scholarship out there that shows innate differences between men and women in nearly any category of which you could readily conceive. Here is just such a paper, which should appeal to Mr. Zunger because it is both a front-page Google result and a product of Stanford….\nIt’s plainly obvious from Zunger’s essay that the primary function of Google, as he currently understands it, is to cooperate and collaborate for the social good. It has nothing to do with writing good software or effective software. Anybody can do that now. Code doesn’t matter.\nMr. Zunger is a very smart man, and he is a scientist to boot. But here’s the thing about modern scientists: they are only trained focus on very small things. The days of the Victorian gentleman chemist are past us now. All of the big ideas that could possibly come to a classically-educated man relaxing on the Louis-Quatorze-era chair in his family estate’s library have been discovered. Today’s science is done by putting laser-like attention on finite areas of effort.\nThe problem with Google, and the problem with other modern software houses, is that they have decided to put their laser-like attention on things other than quality of product. They focus on diversity, social good, various arcane theories of user-interface design, and other things that have nothing to do with writing effective code. Unsurprisingly, they aren’t very good at doing any of those new tasks — and because they’ve abandoned the things that they used to do well, the foundations are slipping out from underneath them.\nToday’s Google home page is a slow-loading mess compared to what it used to be, loaded with buggy features and featuring plenty of bugs. Browser-dependent, hugely bloated, more like the old Excite! homepage than anything a Google user would have enjoyed a decade ago. It’s simply not very good anymore. That should worry the people at Google. Fixing that should be a priority above “social good” or “diverse teams”. They should hire the smartest people and have them write the best code. Period. That’s what Google is supposed to do. Whenever Google does that, it succeeds. Whenever they try to change the world, it’s a ridiculous failure.\nWhich brings me to the funny part. From what I’ve read, Mr. Zunger’s primary accomplishment at Google was…\nwait for it..\nGoogle Plus. Which is\na) utter garbage\nb) currently serving a user base that is 74% male.\nI think one of my biggest advantages as a debater is that I grew up with a best friend whose IQ exceeds mine. I could not say anything without him playing devil’s advocate, and promptly ripping to shreds any baseless posturing or unsupported assertions.\nZunger’s empty posturing is remarkably common among the cognitive elite, particularly the professionals, who are frequently inclined to opine about matters on which they are not sufficiently informed. That, of course, is why they are so defensive when called out; they realize that the whole edifice will come crumbling down if deference is not paid to them, thereby allowing them to avoid their bluffs being called.\nSmart people usually construct their arguments to impress midwits and normal people. Smarter people construct them with an eye to hypothetical critics who may be smarter than they are.",
  "tags": [
    "debate",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-09T09:53:00+00:00"
}