{
  "url": "https://voxday.net/2017/08/26/why-they-spy/",
  "scraped_at": "2025-12-19T10:21:32.670876",
  "title": "Why they spy",
  "date_display": "August 26, 2017",
  "date_iso": "2017-08-26T09:37:00+00:00",
  "date_from_url": "2017-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Triad Man <a href=\"https://darktriadman.com/2017/01/03/rifles-in-the-dark/\">explains the nature of government power</a>, and why the techno-corporate state has erected the panopticon, in an excerpt from <b><i><a href=\"http://amzn.to/2dUdBpa\">The Nine Laws</a></i></b>:</p><blockquote><p>Men rarely understand the nature of military power in the hands of governments.<br> The idiot believes that it is there to protect him, to enforce justice.<br> The common man thinks that it is used according to the law, sheltered within the principles of the culture.<br> The wise man assumes that human beings are fallible and their choices often self-serving; that the best interests and plans often reluctantly settle into the expedient and the tawdry.<br> The Dark Triad Man knows the truth:<br> State power is the tool of men with ruthless ambition, remorseless intention and brutal capacity who do not hesitate to shed blood, hide graves and rewrite history in their favor.<br> Concealment of capacity is among the most crucial components of freedom. For freedom exists in the dark world within a fearsome gradient, between the polarities of anarchy and totalitarianism, and at every spot between them the shade is merely a different hue of blood.<br> Thus concealment of plans from the organs of the State is vital to the preservation of freedom.<br> Concealment of networks from the agents of the State is the hypervigilant task of the insurgent.<br> Concealment of physical power from the intelligence of the State is the fearsome task of free men.<br> Do not trust the ruling power.<br> The ruling power always has more resources, more intelligence, more ruthlessness and more cruelty than you can imagine. And your survival depends upon concealment until the moment of decision.<br> The fool believes that his vote is a determining factor in the policies of the State.<br> The common man thinks that parties and coalitions and alliances represent his interests.<br> The wise man assumes that history and culture place boundaries on the system, which rights itself.<br> The Dark Triad Man accepts the truth: There is always a Caesar waiting with grim and immortal ambition, nestled in the heart of the nation, who seeks to rise to total power and views blood and atrocity and horror as mere laurels of valid drama upon his entitled brow.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Americans have been fortunate in the relatively mild nature of their ruling elite, which generously embraced the principle of <i>noblesse oblige</i>. But that elite has changed greatly in the last 60 years, and has largely abandoned that principle, which means Americans are unlikely to remain so fortunate for long.</p></div>",
  "content_text": "The Dark Triad Man\nexplains the nature of government power\n, and why the techno-corporate state has erected the panopticon, in an excerpt from\nThe Nine Laws\n:\nMen rarely understand the nature of military power in the hands of governments.\nThe idiot believes that it is there to protect him, to enforce justice.\nThe common man thinks that it is used according to the law, sheltered within the principles of the culture.\nThe wise man assumes that human beings are fallible and their choices often self-serving; that the best interests and plans often reluctantly settle into the expedient and the tawdry.\nThe Dark Triad Man knows the truth:\nState power is the tool of men with ruthless ambition, remorseless intention and brutal capacity who do not hesitate to shed blood, hide graves and rewrite history in their favor.\nConcealment of capacity is among the most crucial components of freedom. For freedom exists in the dark world within a fearsome gradient, between the polarities of anarchy and totalitarianism, and at every spot between them the shade is merely a different hue of blood.\nThus concealment of plans from the organs of the State is vital to the preservation of freedom.\nConcealment of networks from the agents of the State is the hypervigilant task of the insurgent.\nConcealment of physical power from the intelligence of the State is the fearsome task of free men.\nDo not trust the ruling power.\nThe ruling power always has more resources, more intelligence, more ruthlessness and more cruelty than you can imagine. And your survival depends upon concealment until the moment of decision.\nThe fool believes that his vote is a determining factor in the policies of the State.\nThe common man thinks that parties and coalitions and alliances represent his interests.\nThe wise man assumes that history and culture place boundaries on the system, which rights itself.\nThe Dark Triad Man accepts the truth: There is always a Caesar waiting with grim and immortal ambition, nestled in the heart of the nation, who seeks to rise to total power and views blood and atrocity and horror as mere laurels of valid drama upon his entitled brow.\nAmericans have been fortunate in the relatively mild nature of their ruling elite, which generously embraced the principle of\nnoblesse oblige\n. But that elite has changed greatly in the last 60 years, and has largely abandoned that principle, which means Americans are unlikely to remain so fortunate for long.",
  "tags": [
    "conspiracy",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-26T08:37:00+00:00"
}