{
  "url": "https://voxday.net/2017/08/11/why-i-dont-go-to-conventions/",
  "scraped_at": "2025-12-18T07:26:17.996544",
  "title": "Why I don’t go to conventions",
  "date_display": "August 11, 2017",
  "date_iso": "2017-08-11T13:00:00+00:00",
  "date_from_url": "2017-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This pretty much covers it, in a nutshell.</p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DG3emEbXkAAkYs7.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"600\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"300\" src=\"https://pbs.twimg.com/media/DG3emEbXkAAkYs7.jpg\" width=\"400\"/></a></div><p><i> </i></p><div style=\"text-align: center;\"><i>Romance and the Power of the Female Gaze panel with Donna Maree Hanson, Carrie Vaughn, Nick Hubble and Cassandra Rose Clarke. #Worldcon75</i></div><p>Ye cats. I don’t care how big and influential Castalia House becomes in the future. You will never, ever, see me at one of those things. My one experience 20 years ago at MiniCon was considerably more than enough for me.<br> Besides, I have far more important things to do. Tonight, two teams from my soccer club are playing a friendly; the veterans are playing the men’s second team. I am the starting left wing for the former, while Ender is a starter for the latter. The kid is brimming with confidence, claiming his team just has to keep it close until the second half, when they’re counting on us running out of gas. It’s not a bad strategy, since we probably have an average of 16 years per player on them. Our oldest player is a few months older than me, and he’s 22 years older than their oldest player.<br> I realized how much is on the line when I ran into the star of the first team yesterday. He asked if I was playing, and when I said that I was, said that he’d see me there. I was a little surprised (and concerned, since he is exceptional), but he explained that most of the first team guys are coming to watch. Which means the losers will not hear the end of it any time soon.</br></br></p></div>",
  "content_text": "This pretty much covers it, in a nutshell.\nRomance and the Power of the Female Gaze panel with Donna Maree Hanson, Carrie Vaughn, Nick Hubble and Cassandra Rose Clarke. #Worldcon75\nYe cats. I don’t care how big and influential Castalia House becomes in the future. You will never, ever, see me at one of those things. My one experience 20 years ago at MiniCon was considerably more than enough for me.\nBesides, I have far more important things to do. Tonight, two teams from my soccer club are playing a friendly; the veterans are playing the men’s second team. I am the starting left wing for the former, while Ender is a starter for the latter. The kid is brimming with confidence, claiming his team just has to keep it close until the second half, when they’re counting on us running out of gas. It’s not a bad strategy, since we probably have an average of 16 years per player on them. Our oldest player is a few months older than me, and he’s 22 years older than their oldest player.\nI realized how much is on the line when I ran into the star of the first team yesterday. He asked if I was playing, and when I said that I was, said that he’d see me there. I was a little surprised (and concerned, since he is exceptional), but he explained that most of the first team guys are coming to watch. Which means the losers will not hear the end of it any time soon.",
  "tags": [
    "Pink SF",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-11T12:00:00+00:00"
}