{
  "url": "https://voxday.net/2017/08/25/winning-the-rhetorical-battle/",
  "scraped_at": "2025-12-19T10:21:26.757931",
  "title": "Winning the rhetorical battle",
  "date_display": "August 25, 2017",
  "date_iso": "2017-08-25T13:00:00+00:00",
  "date_from_url": "2017-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.bbc.com/news/blogs-trending-41036631\">This successful memetic campaign is an object lesson</a> to every dialectic speaker tempted to show off how smart and righteous he is by sperging about someone else’s rhetorical sally.</p><blockquote><p>Far-right activists are using fake Twitter accounts and images of battered women to smear anti-fascist groups in the US, an online investigation has revealed. The online campaign is using fake Antifa (an umbrella term for anti-fascist protestors) Twitter accounts to claim anti-fascists promote physically abusing women who support US President Donald Trump or white supremacy.<br> Researcher Eliot Higgins of website Bellingcat found evidence that the campaign is being orchestrated on internet messageboard 4Chan by far-right sympathisers.<br> One image shows the slogan “53% of white women voted for Trump, 53% of white women should look like this”, above a photograph of a woman with a bruised and cut face and an anti-fascist symbol. The woman pictured is actually British actress Anna Friel and the photograph was taken for a Women’s Aid anti-domestic violence campaign in 2007.<br> The images first started circulating on social media late on 23 August with hashtags #PunchNazis, #MakeRacistsAfraidAgain and #BashTheFash. Accounts appearing to belong to anti-fascist groups tweeted the memes, calling on activists to physically attack women who voted for Trump.</br></br></br></p></blockquote><p>I retweeted one of the memes, which met with the following responses. First, from Antifa sympathizers crying foul, which is a sure sign of a meme’s effectiveness.</p><blockquote><p>Antifa LI‏ @RefuseFascismNY<br> its also fake. Notice how these battered women memes are ONLY showing up on alt-righty accounts? No attribution. Just a fake logo.<br> Far Right Watch‏ @Far_Right_Watch<br> Various US based Far Right Groups are creating both fake #AntiFa accounts and memes as their latest weapon. Few are fooled.<br> Taz Wake‏ @tazwake<br> If you have to fake an account to make your point, your point is probably wrong.<br> Patrick‏ @TrickFreee<br> Here’s another Daily Stormer troll waging information warfare on the United States. Literal information warfare, no one doing anything.</br></br></br></br></br></br></br></p></blockquote><p>Second, from dialectic-speaking spergs, who, despite more than 2,400 years of evidence to the contrary, continue to cling to the belief that “credibility” is the key to successful persuasion. Which, of course, is a little ironic, considering that the appeal to authority is a well-known logical fallacy. And it demonstrates, again, why dialectic-inclined spergs really need to learn to SHUT. THE. HELL. UP. when they happen to encounter rhetoric in the wild. You do not criticize a football coach’s play-calling by appealing to the rules of baseball. It is a category error.</p><blockquote><p>Spritz‏ @Halfamish<br> This is fake, from 4chan. They already do enough shit that we don’t have to spread lies. That only weakens our credibility.<br> goth vampire daddy‏ @admirableism<br> you’d think having to straight up lie about the opposition would make one realize their cause is shit. and yet here we are</br></br></br></p></blockquote><p>And third, from rhetoric speakers who grasp the brilliance of the 4chan campaign and the way that it simultaneously undermines Antifa’s rhetoric as well as reframes them in a manner that most third parties will find incredibly distasteful.</p><blockquote><p>Malt‏ @maltsphere<br> Confirmation for top tier memeing is when BBC write an article “exposing” it as a 4chan troll. Ignoring that this is what punch a nazi means<br> Jay 5.1@notjayfivekille<br> Replying to @voxday<br> This is a brilliant satire of Antifa and the savagery of alt-left politics.</br></br></br></br></p></blockquote><p>Remember, the most effective rhetoric communicates truth without necessarily being <i>literally </i>truthful in the details. It persuades through emotion, not reason, which is why it cannot be analyzed in the same way as a logical syllogism. Today’s #DailyMemeWars meme took the 4chan meme and went one level deeper, using nothing more than actual quotes from Antifa and Antifa-sympathetic media, for maximum memetic effect.<br> As always, we see that the Left is far better on the offensive than they are on defense. Which is why it is preferable for us to always seize the initiative and simply ignore their rhetorical attacks. The irony of people who constantly lie about their opponents complaining that they are not being portrayed accurately is significant, and is why their protests, even backed as they are by all the biggest media organs, are useless in the face of the rhetorical meme magic. And if you want to force-multiply these increasingly effective efforts, <a href=\"http://www.milobookclub.com/2017/07/09/meme-of-day/\">sign up for the Daily Meme Wars here</a>.</br></p><div style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DIEX5N8XgAEbUIG.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"281\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DIEX5N8XgAEbUIG.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"281\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DIEX5N8XgAEbUIG.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20281%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "This successful memetic campaign is an object lesson\nto every dialectic speaker tempted to show off how smart and righteous he is by sperging about someone else’s rhetorical sally.\nFar-right activists are using fake Twitter accounts and images of battered women to smear anti-fascist groups in the US, an online investigation has revealed. The online campaign is using fake Antifa (an umbrella term for anti-fascist protestors) Twitter accounts to claim anti-fascists promote physically abusing women who support US President Donald Trump or white supremacy.\nResearcher Eliot Higgins of website Bellingcat found evidence that the campaign is being orchestrated on internet messageboard 4Chan by far-right sympathisers.\nOne image shows the slogan “53% of white women voted for Trump, 53% of white women should look like this”, above a photograph of a woman with a bruised and cut face and an anti-fascist symbol. The woman pictured is actually British actress Anna Friel and the photograph was taken for a Women’s Aid anti-domestic violence campaign in 2007.\nThe images first started circulating on social media late on 23 August with hashtags #PunchNazis, #MakeRacistsAfraidAgain and #BashTheFash. Accounts appearing to belong to anti-fascist groups tweeted the memes, calling on activists to physically attack women who voted for Trump.\nI retweeted one of the memes, which met with the following responses. First, from Antifa sympathizers crying foul, which is a sure sign of a meme’s effectiveness.\nAntifa LI‏ @RefuseFascismNY\nits also fake. Notice how these battered women memes are ONLY showing up on alt-righty accounts? No attribution. Just a fake logo.\nFar Right Watch‏ @Far_Right_Watch\nVarious US based Far Right Groups are creating both fake #AntiFa accounts and memes as their latest weapon. Few are fooled.\nTaz Wake‏ @tazwake\nIf you have to fake an account to make your point, your point is probably wrong.\nPatrick‏ @TrickFreee\nHere’s another Daily Stormer troll waging information warfare on the United States. Literal information warfare, no one doing anything.\nSecond, from dialectic-speaking spergs, who, despite more than 2,400 years of evidence to the contrary, continue to cling to the belief that “credibility” is the key to successful persuasion. Which, of course, is a little ironic, considering that the appeal to authority is a well-known logical fallacy. And it demonstrates, again, why dialectic-inclined spergs really need to learn to SHUT. THE. HELL. UP. when they happen to encounter rhetoric in the wild. You do not criticize a football coach’s play-calling by appealing to the rules of baseball. It is a category error.\nSpritz‏ @Halfamish\nThis is fake, from 4chan. They already do enough shit that we don’t have to spread lies. That only weakens our credibility.\ngoth vampire daddy‏ @admirableism\nyou’d think having to straight up lie about the opposition would make one realize their cause is shit. and yet here we are\nAnd third, from rhetoric speakers who grasp the brilliance of the 4chan campaign and the way that it simultaneously undermines Antifa’s rhetoric as well as reframes them in a manner that most third parties will find incredibly distasteful.\nMalt‏ @maltsphere\nConfirmation for top tier memeing is when BBC write an article “exposing” it as a 4chan troll. Ignoring that this is what punch a nazi means\nJay 5.1@notjayfivekille\nReplying to @voxday\nThis is a brilliant satire of Antifa and the savagery of alt-left politics.\nRemember, the most effective rhetoric communicates truth without necessarily being\nliterally\ntruthful in the details. It persuades through emotion, not reason, which is why it cannot be analyzed in the same way as a logical syllogism. Today’s #DailyMemeWars meme took the 4chan meme and went one level deeper, using nothing more than actual quotes from Antifa and Antifa-sympathetic media, for maximum memetic effect.\nAs always, we see that the Left is far better on the offensive than they are on defense. Which is why it is preferable for us to always seize the initiative and simply ignore their rhetorical attacks. The irony of people who constantly lie about their opponents complaining that they are not being portrayed accurately is significant, and is why their protests, even backed as they are by all the biggest media organs, are useless in the face of the rhetorical meme magic. And if you want to force-multiply these increasingly effective efforts,\nsign up for the Daily Meme Wars here\n.",
  "tags": [
    "media",
    "MemeWars",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-08-25T12:00:00+00:00"
}