{
  "url": "https://voxday.net/2008/01/06/about-those-debates/",
  "scraped_at": "2026-01-08T22:06:29.392842",
  "title": "About those debates",
  "date_display": "January 6, 2008",
  "date_iso": "2008-01-06T10:45:00+00:00",
  "date_from_url": "2008-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Let’s see, NFL playoffs or nattering politicians.  Yeah, like I watched it.  And why bother, when <a href=\"http://vodkapundit.com/?p=9334\">Vodkapundit sums up everything we needed to know</a>:</p><blockquote><p>7:23pm FINALLY, Paul is talking his principles. He’s taking a stand against the national ID card in general, and the welfare state in general. I’ve never been so happy to be so wrong.</p><p>7:24pm Meanwhile, Romney interrupted to say how swell he likes <i>l</i>egal immigrants. Or, if I may translate, “Please vote for me, Latino peoples. Even though I am pasty and have religious ways strange to you.”</p><p>9:00pm Did you know that Hillary has experience? Experience with change? Change that only her experience, her experience with change, can bring about? And that she’s a woman, a woman bringing change with her experience of womanness? Yeah, me neither.</p><p>9:01pm I half-expected Richardson to claim to have womanly changes, too.</p></blockquote><p>As for the truly important stuff, I was wrong about the Redskins, but for one brief shining moment there when that freak kickoff gave them the ball in the red zone, I was feeling positively prognosisstic  And although the Jags nearly choked it away in the 4th, DG ultimately came through when it counted.</p><p>Confession: I fell asleep after Rothlisberger threw that pick at the end of the first half.  At that point, with Jax up 21-7 and both Fred and MJD running roughshod over the Steel Curtain it really looked like Game Over.  I should have known better.  Imagine what Big Ben could have done this year with a functional offensive line.</p></div>",
  "content_text": "Let’s see, NFL playoffs or nattering politicians.  Yeah, like I watched it.  And why bother, when\nVodkapundit sums up everything we needed to know\n:\n7:23pm FINALLY, Paul is talking his principles. He’s taking a stand against the national ID card in general, and the welfare state in general. I’ve never been so happy to be so wrong.\n7:24pm Meanwhile, Romney interrupted to say how swell he likes\nl\negal immigrants. Or, if I may translate, “Please vote for me, Latino peoples. Even though I am pasty and have religious ways strange to you.”\n9:00pm Did you know that Hillary has experience? Experience with change? Change that only her experience, her experience with change, can bring about? And that she’s a woman, a woman bringing change with her experience of womanness? Yeah, me neither.\n9:01pm I half-expected Richardson to claim to have womanly changes, too.\nAs for the truly important stuff, I was wrong about the Redskins, but for one brief shining moment there when that freak kickoff gave them the ball in the red zone, I was feeling positively prognosisstic  And although the Jags nearly choked it away in the 4th, DG ultimately came through when it counted.\nConfession: I fell asleep after Rothlisberger threw that pick at the end of the first half.  At that point, with Jax up 21-7 and both Fred and MJD running roughshod over the Steel Curtain it really looked like Game Over.  I should have known better.  Imagine what Big Ben could have done this year with a functional offensive line.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-06T10:45:00+00:00"
}