{
  "url": "https://voxday.net/2008/01/11/andrew-nails-i/",
  "scraped_at": "2026-01-08T22:07:17.432334",
  "title": "The queer beats down the drama queens",
  "date_display": "January 11, 2008",
  "date_iso": "2008-01-11T15:19:00+00:00",
  "date_from_url": "2008-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s another of those rare occasions wherein <a href=\"http://andrewsullivan.theatlantic.com/the_daily_dish/2008/01/the-south-carol.html\">I completely agree with Andrew Sullivan</a>:</p><blockquote><p>And, yes, thank God for Ron Paul.</p><p>No one else, except McCain, copped to the GOP’s rank betrayal of fiscal conservatism, limited government, prudent foreign policy and civil liberties. When he was asked to disown the 9/11 Truthers, he gave a revealing answer, and one that reflects on the newsletters issue. It just isn’t in his nature to adopt other people’s views, or to tell anyone else what to believe or what to say. He doesn’t just believe in libertarianism; he lives it. This means that he doesn’t have the instinct to police anyone else’s views or actions within the law or the Constitution.</p></blockquote><p>John Derbyshire, too, <a href=\"http://corner.nationalreview.com/post/?q=NTA3ZmRkNTdhY2Q5ZDQ5NWY4MDA4MWUxMGNmYTQxZTE=\">hasn’t backed down one iota from his support of Ron Paul</a>.  Neither have I.  The very fact that a portion of the supposedly conservative commentariat seriously believes that one individual is responsible for another individual’s words, let alone thinks that anyone who values human freedom or the U.S. Constitution might abandon his support for the only candidate supporting both in the race, only goes to demonstrate how far what now passess for conservatism has fallen from the real thing.</p><p>Since when do real conservatives believe words speak louder than actions anyhow?  (And since when do real conservatives think Martin Luther King is a sacred icon, for that matter?  Given all the drama-queening reactions, you would have thought Paul was accused of insulting Ronald Reagan, Winston Churchill and Margaret Thatcher.)  First the liars of the Left stole “liberal”, now we are witnessing the theft of “conservative” before our very eyes.</p><p>People often try to blame me for comments that are made here.  This is an intellectually shabby tactic, as there are literally hundreds of thousands of my own words from which to choose, and yet they still have to try to put words in my mouth in order to attack me.  But like Ron Paul, I am a practicing libertarian; a failure to respond to a comment is as likely to mean that I think it is completely insane as it is to indicate that I agree with it.  (Most likely, it means I think it’s obvious, idiotic or irrelevant, but then, I AM a superintelligence.)  As Derb says of Paul, if you’re crazy, I’m fine with it.</p><p>Today’s “conservatives”, being every bit as PC and prone to playing thought police as their “liberal” ideological kin, simply can’t seem to understand that your thoughts are not my responsibility.</p></div>",
  "content_text": "It’s another of those rare occasions wherein\nI completely agree with Andrew Sullivan\n:\nAnd, yes, thank God for Ron Paul.\nNo one else, except McCain, copped to the GOP’s rank betrayal of fiscal conservatism, limited government, prudent foreign policy and civil liberties. When he was asked to disown the 9/11 Truthers, he gave a revealing answer, and one that reflects on the newsletters issue. It just isn’t in his nature to adopt other people’s views, or to tell anyone else what to believe or what to say. He doesn’t just believe in libertarianism; he lives it. This means that he doesn’t have the instinct to police anyone else’s views or actions within the law or the Constitution.\nJohn Derbyshire, too,\nhasn’t backed down one iota from his support of Ron Paul\n.  Neither have I.  The very fact that a portion of the supposedly conservative commentariat seriously believes that one individual is responsible for another individual’s words, let alone thinks that anyone who values human freedom or the U.S. Constitution might abandon his support for the only candidate supporting both in the race, only goes to demonstrate how far what now passess for conservatism has fallen from the real thing.\nSince when do real conservatives believe words speak louder than actions anyhow?  (And since when do real conservatives think Martin Luther King is a sacred icon, for that matter?  Given all the drama-queening reactions, you would have thought Paul was accused of insulting Ronald Reagan, Winston Churchill and Margaret Thatcher.)  First the liars of the Left stole “liberal”, now we are witnessing the theft of “conservative” before our very eyes.\nPeople often try to blame me for comments that are made here.  This is an intellectually shabby tactic, as there are literally hundreds of thousands of my own words from which to choose, and yet they still have to try to put words in my mouth in order to attack me.  But like Ron Paul, I am a practicing libertarian; a failure to respond to a comment is as likely to mean that I think it is completely insane as it is to indicate that I agree with it.  (Most likely, it means I think it’s obvious, idiotic or irrelevant, but then, I AM a superintelligence.)  As Derb says of Paul, if you’re crazy, I’m fine with it.\nToday’s “conservatives”, being every bit as PC and prone to playing thought police as their “liberal” ideological kin, simply can’t seem to understand that your thoughts are not my responsibility.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-11T15:19:00+00:00"
}