{
  "url": "https://voxday.net/2008/01/11/another-liberal-fascism-interview/",
  "scraped_at": "2026-01-08T22:07:15.624419",
  "title": "Another Liberal Fascism interview",
  "date_display": "January 11, 2008",
  "date_iso": "2008-01-11T15:03:00+00:00",
  "date_from_url": "2008-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alex Koppelman of Salon does <a href=\"http://www.salon.com/news/feature/2008/01/11/goldberg/\">an excellent job questioning Jonah Goldberg about Liberal Fascism</a>.  It was interesting to see the difference between my interview with Jonah and this one, in which the interviewer is obviously more familiar with the outmoded ideological interpretation of Fascism.  Even the title of the piece demonstrates that Koppelman at least understood the book, even if he didn’t entirely agree with it.  I thought his question about the seeming dichotomy between progressive passivism and fascist militarism was very good, as was Goldberg’s explanation:</p><blockquote><p>What appealed to the Progressives about militarism was what William James calls this moral equivalent of war. It was that war brought out the best in society, as James put it, that it was the best tool then known for mobilization … That is what is fascistic about militarism, its utility as a mechanism for galvanizing society to join together, to drop their partisan differences, to move beyond ideology and get with the program. And liberalism today is, strictly speaking, pretty pacifistic. They’re not the ones who want to go to war all that much. But they’re still deeply enamored with this concept of the moral equivalent of war, that we should unite around common purposes.</p></blockquote><p>Goldberg also does a brilliant job of slamming his more intransigent critics, who not only haven’t read the book – and probably aren’t capable of understanding it even if they tried to – but are seriously attempting to ignore the entire text on the basis of the cover image.</p><p><i>“I’m perfectly glad to concede that people who do judge books by their covers or think it’s more important to read a title rather than read a book will be confused and jump to conclusions. But these are people that I don’t generally respect….  And if you can’t get past the cover and the title, then you’re not a serious book reader and you’re not really a serious person.”</i></p></div>",
  "content_text": "Alex Koppelman of Salon does\nan excellent job questioning Jonah Goldberg about Liberal Fascism\n.  It was interesting to see the difference between my interview with Jonah and this one, in which the interviewer is obviously more familiar with the outmoded ideological interpretation of Fascism.  Even the title of the piece demonstrates that Koppelman at least understood the book, even if he didn’t entirely agree with it.  I thought his question about the seeming dichotomy between progressive passivism and fascist militarism was very good, as was Goldberg’s explanation:\nWhat appealed to the Progressives about militarism was what William James calls this moral equivalent of war. It was that war brought out the best in society, as James put it, that it was the best tool then known for mobilization … That is what is fascistic about militarism, its utility as a mechanism for galvanizing society to join together, to drop their partisan differences, to move beyond ideology and get with the program. And liberalism today is, strictly speaking, pretty pacifistic. They’re not the ones who want to go to war all that much. But they’re still deeply enamored with this concept of the moral equivalent of war, that we should unite around common purposes.\nGoldberg also does a brilliant job of slamming his more intransigent critics, who not only haven’t read the book – and probably aren’t capable of understanding it even if they tried to – but are seriously attempting to ignore the entire text on the basis of the cover image.\n“I’m perfectly glad to concede that people who do judge books by their covers or think it’s more important to read a title rather than read a book will be confused and jump to conclusions. But these are people that I don’t generally respect….  And if you can’t get past the cover and the title, then you’re not a serious book reader and you’re not really a serious person.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-11T15:03:00+00:00"
}