{
  "url": "https://voxday.net/2008/01/03/atheist-dad-of-year/",
  "scraped_at": "2026-01-08T22:06:03.774656",
  "title": "Atheist Dad of the Year",
  "date_display": "January 3, 2008",
  "date_iso": "2008-01-03T01:05:00+00:00",
  "date_from_url": "2008-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If I were ever to have attacked atheism by arguing that on the rare occasions when atheists manage to successfully reproduce, their children would likely grow up possessing beliefs that are utterly immoral by Western moral norms and abhorrent to the average individual, many people would howl that I was unfairly engaging in baseless conjecture, regardless of the logic presented.</p><p>So, it’s more than a little amusing to see PZ Myers angrily defending <a href=\"http://scienceblogs.com/pharyngula/2008/01/just_when_you_think_slimy_sal.php\">his daughter’s public argument against anti-bestiality laws</a>.  Now, it’s certainly the girl’s right to advocate on behalf of whatever legal cause she feels is important to her, but this particular choice of subject really doesn’t provide the most convincing evidence against the oft-repeated charge that atheists are hopelessly immoral.  And if there’s nothing rationally objectionable about the practice, then from whence comes this defensive paternal outrage?</p><p>The ironic truth is that Miss Myers is absolutely correct; once the basic concept of Natural Law is abandoned, there is no rational basis for banning anything from necrophilia to cannibalism other than a vague sense of “ickiness” inherited from preceding generations possessed of a more conventional morality.  She is a far more rational atheist than most; it seems she is either too honest or too innocent to realize that a good moral parasite is supposed to coopt religious values, not openly admit that they make no sense sans their sky god source.</p><p>It’s even more amusing to see various Pharyngulans attempting to redefine the meaning of the word “condone”.  I have no idea what they’re attempting to accomplish by all the tap-dancing, as the girl’s argument is no more difficult to understand than my stance against the War on Drugs.</p><p>Now, it may be that <a href=\"http://scienceblogs.com/pharyngula/2006/08/bye_bye_beale.php\">corruption and wingnut Christianity go hand in hand</a>.  But at least wingnuts teach their kids not to pester the pets.</p><p>UPDATE – Catkiller asked about the libertarian position on dog-bothering.  It is the same as it is on any other issue, which is to recognize that legality is not synonymous with morality.  As far as the law is concerned, dog-bothering is a property rights matter.  Any law which is unenforceable or requires a massive and intrusive state bureaucracy to administer is a bad law that will likely result in government encroachment on basic human liberty.  The reason libertarians are unconcerned with anti-bestiality laws is that, unlike anti-drug laws, a huge Federal edifice has not been constructed upon them and millions of people are not languishing in jail due to their inability to resist the fatal temptations of foxy terriers.</p><p>What many of her critics and defenders alike fail to realize is that the pedagogical failings of the Atheist Dad of the Year are not revealed by <a href=\"http://skatje.com/?s=%22deep%2C+meaningful%22\">Miss Myers’s argument</a> that she does not believe dog-bothering should be illegal, but rather by the fact that she does not believe it is <i>morally wrong</i>.</p><p>Social mores are far more powerful than law, indeed, laws are often passed in order to use the power of government to attempt forcibly modifying those norms over time.  Sometimes it works, more often it doesn’t.  But if Americans still possessed the Right to Free Association, there would be no need for laws against individual moral failings, since the local community would possess the private means of punishing those whose immorality is deemed abhorrent to it.  In the absence of this right, the enforcement of moral standards is done through law and becomes little more than a power struggle between those who want to ban dog-bothering and those who want to ban god-bothering.</p><p>UPDATE II – Now you know why PZ teaches at a community college.  He can’t read, he can’t follow a logical train of thought, and he can’t distinguish between LAW and MORALITY:</p><blockquote><p>That Vox Day post is a hoot. First he chastises atheists for being immoral monsters, then he endorses a position that is identical to Skatje’s: that social mores can be more powerful than the force of law.  By his own argument, then, Day wants the laws that prevent him from humping dogs to be removed.</p></blockquote><p>My position is not identical to Skatje’s.  She is arguing that dog-bothering should not be illegal and that dog-bothering is not immoral.  I am arguing that dog-bothering laws are irrelevant and that dog-bothering is immoral.  PZ is confusing my answer about the pure libertarian position with my actual position; he should let his daughter defend herself, she’s obviously more capable of it than he is.</p></div>",
  "content_text": "If I were ever to have attacked atheism by arguing that on the rare occasions when atheists manage to successfully reproduce, their children would likely grow up possessing beliefs that are utterly immoral by Western moral norms and abhorrent to the average individual, many people would howl that I was unfairly engaging in baseless conjecture, regardless of the logic presented.\nSo, it’s more than a little amusing to see PZ Myers angrily defending\nhis daughter’s public argument against anti-bestiality laws\n.  Now, it’s certainly the girl’s right to advocate on behalf of whatever legal cause she feels is important to her, but this particular choice of subject really doesn’t provide the most convincing evidence against the oft-repeated charge that atheists are hopelessly immoral.  And if there’s nothing rationally objectionable about the practice, then from whence comes this defensive paternal outrage?\nThe ironic truth is that Miss Myers is absolutely correct; once the basic concept of Natural Law is abandoned, there is no rational basis for banning anything from necrophilia to cannibalism other than a vague sense of “ickiness” inherited from preceding generations possessed of a more conventional morality.  She is a far more rational atheist than most; it seems she is either too honest or too innocent to realize that a good moral parasite is supposed to coopt religious values, not openly admit that they make no sense sans their sky god source.\nIt’s even more amusing to see various Pharyngulans attempting to redefine the meaning of the word “condone”.  I have no idea what they’re attempting to accomplish by all the tap-dancing, as the girl’s argument is no more difficult to understand than my stance against the War on Drugs.\nNow, it may be that\ncorruption and wingnut Christianity go hand in hand\n.  But at least wingnuts teach their kids not to pester the pets.\nUPDATE – Catkiller asked about the libertarian position on dog-bothering.  It is the same as it is on any other issue, which is to recognize that legality is not synonymous with morality.  As far as the law is concerned, dog-bothering is a property rights matter.  Any law which is unenforceable or requires a massive and intrusive state bureaucracy to administer is a bad law that will likely result in government encroachment on basic human liberty.  The reason libertarians are unconcerned with anti-bestiality laws is that, unlike anti-drug laws, a huge Federal edifice has not been constructed upon them and millions of people are not languishing in jail due to their inability to resist the fatal temptations of foxy terriers.\nWhat many of her critics and defenders alike fail to realize is that the pedagogical failings of the Atheist Dad of the Year are not revealed by\nMiss Myers’s argument\nthat she does not believe dog-bothering should be illegal, but rather by the fact that she does not believe it is\nmorally wrong\n.\nSocial mores are far more powerful than law, indeed, laws are often passed in order to use the power of government to attempt forcibly modifying those norms over time.  Sometimes it works, more often it doesn’t.  But if Americans still possessed the Right to Free Association, there would be no need for laws against individual moral failings, since the local community would possess the private means of punishing those whose immorality is deemed abhorrent to it.  In the absence of this right, the enforcement of moral standards is done through law and becomes little more than a power struggle between those who want to ban dog-bothering and those who want to ban god-bothering.\nUPDATE II – Now you know why PZ teaches at a community college.  He can’t read, he can’t follow a logical train of thought, and he can’t distinguish between LAW and MORALITY:\nThat Vox Day post is a hoot. First he chastises atheists for being immoral monsters, then he endorses a position that is identical to Skatje’s: that social mores can be more powerful than the force of law.  By his own argument, then, Day wants the laws that prevent him from humping dogs to be removed.\nMy position is not identical to Skatje’s.  She is arguing that dog-bothering should not be illegal and that dog-bothering is not immoral.  I am arguing that dog-bothering laws are irrelevant and that dog-bothering is immoral.  PZ is confusing my answer about the pure libertarian position with my actual position; he should let his daughter defend herself, she’s obviously more capable of it than he is.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-03T01:05:00+00:00"
}