{
  "url": "https://voxday.net/2008/01/21/atheist-morality-and-iq-in-action/",
  "scraped_at": "2026-01-08T22:08:41.778412",
  "title": "TIA review akaAtheism in Action",
  "date_display": "January 21, 2008",
  "date_iso": "2008-01-21T10:55:00+00:00",
  "date_from_url": "2008-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s little more amusing than an atheist, specifically an atheist who repeatedly insists that atheists can too be just as moral as religious individuals, dishonestly attempting to pass off <a href=\"http://reasonoverreligion.blogspot.com/2007/12/commentary-irrational-atheist.html\">a review of a four-year old column as a review of my forthcoming book of the same name</a>.  I’m not surprised that Socrates’ Elegy doesn’t intend to read <i><a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1200445323&amp;sr=1-1\">The Irrational Atheist</a></i>, it’s pretty clear that he hasn’t read much by Dawkins, Harris, or Hitchens either.  One hopes not, anyhow, because he hasn’t remembered much of it, let alone understood any of it, if he has.</p><blockquote><p>Vox Day published an essay, The Irrational Atheist, on which I would like to give some feedback. Actually, I was asked to give my take on Day’s forthcoming book of the same title by Pink Kitty in a comment at MCB. After digesting this essay, I doubt that I will be reading his book.</p></blockquote><p>Jonah Goldberg’s more superficial critics judge his book by its cover.  That’s ridiculous, but they’re light years ahead of SE, who seriously <i>attempts to judge a 320-page book by a single  750-word op/ed column!</i> Nice trick; it certainly would have saved me a lot of reading if I had applied the same standard in judging <i>The God Delusion</i>, <i>Unweaving the Rainbow</i>, <i>The End of Faith</i>, <i>Consciousness Explained</i> and about a dozen other books.  Of course, I would have leaped to massive errors such as concluding that Sam Harris is a pro-Inquisition Catholic because of his article “In Defense of Torture”.  And remember, this guy sincerely thinks that he is the smart and rational one!</p><blockquote><p>Also, Mr. Day is not enhancing his credibility by referring to himself as a “forensic atheologist”, which he does in his blog description. Whatever.</p></blockquote><p>Perhaps.  Of course, it’s arguably rather less credibility-destroying than a) not reading what you’re supposed to be critiquing, and, b) failing to understand what little you have read.  In fact, I’d argue that I could call myself Pretty Princess Pooyan and still retain infinitely more intellectual credibility than the fragments possessed by what passes for an intellect here.</p><blockquote><p>Mr. Day begins, <i>The idea that he is a devotee of reason seeing through the outdated superstitions of other, lesser beings is the foremost conceit of the proud atheist.</i></p><p>O.K., Mr. Day is entitled to his opinion. But this opening statement is not supported by the argument presented in the essay, which is that religion is beneficial and necessary to civilization, therefore atheism is incorrect. He presents no argument that atheism is inherently erroneous. So I am not going to bestow any merit on his accusation of conceit. In addition, maligning those that refuse to accept that there is an omnipotent extra-natural entity that is directly invested in human affairs without providing some tangible evidence as justification is in itself an act of unmitigated hubris.</p></blockquote><p>Unsurprisingly, given his pitiable start, SE fails to grasp the salient point of the column.  I presented no argument that “atheism is inherently erroneous” in it because I was not arguing that “atheism is incorrect”.  (I don’t argue this in the book either, for that matter.)  “Most atheists are irrational” != “atheism is incorrect”; it is perfectly possible for one to reach a correct conclusion by an irrational path, in fact, both science and casual observation indicate that this is how most people reach most conclusions most of the time.  As I argue in the book, Man is a rationalizing creature, not a rational animal. Ironically, this is precisely the sort of rationalization one could logically expect from an atheist who is irrational enough to believe that “rationalism is virtuous”.</p><p>As for atheist conceit, there is not exactly a shortage of empirical evidence.  I refer him to Gary Wolf’s Wired article on the New Atheists, or really, just about any atheist blog.  Moreover, if we accept for the sake of argument his ridiculous statement that making a baseless assertion is, in itself an “act of unmitigated hubris”, he proves my point, at least with regards to his own atheist conceit.</p><blockquote><p>Mr. Day goes on, <i>That they also paved the way for the murderous excesses of the French Revolution and many other massacres in the name of human progress is usually considered an unfortunate coincidence by their philosophical descendants.</i></p><p>Even if that is true, “paved the way” is not synonymous with “were responsible for”. Rejecting the divine right of royalty also paved the way for the American Revolution. Can I infer that Mr. Day is advocating for divine right to be reinstated? That would be an unlikely position for a professed libertarian.</p></blockquote><p>No, and it would have been difficult for Meslier, Diderot, Rousseau, and Voltaire, etc, to be directly responsible for la Grande Terreur, being dead for at least five years and all.  I’m pleased to learn that unlike so many of his fellow atheists, SE doesn’t hold today’s Christians responsible for the acts of a Pope or pair of Spanish sovereigns dead for five centuries.  And yes, a libertarian would be a most unlikely advocate for “divine right”, (I think he must mean “the divine right of kings”), which is why it would be incredibly stupid to infer that I am an advocate of its reinstatement.  But given his performance thus far, I see no reason why SE should let that stop him.</p><blockquote><p>The phrase “many other massacres” is not supported by any references. Mr. Day invites the reader to use his imagination to fill in the blanks. By saying, <i>Without God, there is only the left-hand path of the philosopher. It leads invariably to Hell, by way of the guillotine, the gulag and the gas chamber.</i> one can infer that he is adding Nazi Germany and Soviet Russia to the French Revolution. However, Mr. Day gives no evidence that atheism was actually the cause of any atrocities related to those regimes. He merely invites the reader to make that assumption. For example, The Nazi regime was arguably for all intents and purposes Roman Catholic.</p></blockquote><p>There are no references in the column, there are many in the book.  SE doesn’t seem to understand that one is not obligated to prove anything in <i>an opinion column</i>, mostly because there isn’t space for it.  True, one could reasonably infer Nazi Germany, but incorrectly, as it is actually a reference to the gas chambers of atheist North Korea.  If he’d read the book, he’d know that, as well as know about the direct link between atheism and dozens of historical atrocities.  Furthermore, the Nazi regime was verifiably less Roman Catholic than the New Atheism is Anglican, obviously SE doesn’t judge Richard Dawkins and Christopher Hitchens by the same standard he judges Adolf Hitler.  SE obviously fails to understand how the very existence of the <i>Reichskonkordat</i> proves that Nazi Germany was not Catholic in any way; there is far more conclusive documentary evidence in the book as well.</p><blockquote><p>The advent of technology and advances in fields such as medicine is more than sufficient evidence for a reasonable person, even one with the least science education, to infer that by-and-large scientists know what they are talking about and that their interpretation of the natural order is credible. Yes, scientists do sometimes draw different conclusions, and theories are constantly revised as more evidence is discovered. That doesn’t mean it doesn’t work. If you are reading this using a computer, you have all the evidence you need. Bear in mind that science does not claim absolute certainty.</p></blockquote><p>This is one of the otherwise reasonable Daniel Dennett’s more foolish arguments, which I openly deride in the book.  In Dennett’s fo<br> rm, it states that because physicists know what they’re talking about and possess conceptual models that are precise to an incredible degree, we should accept at face value everything that biologists and sociologists say even though their conceptual models are horrendously inaccurate to the point of uselessness.  It’s a  transitive nonsense no more convincing in SE’s words than in Dennett’s.</br></p><blockquote><p>Mr. Day continues, <i>Whereas Christians and the faithful of other religions have good reason for attempting to live by the Golden Rule – they are commanded to do so – the atheist does not.</i></p><p>This is an unsupported assumption. The atheist has at least one good ethical motivation: self-interest in the preservation of civilization. Acting on this an atheist has at his disposal our common humanity: the body of knowledge we draw upon to establish codes of conduct, points of order, and define the rights and responsibilities we as citizens must observe in order to maintain civilization. While religion attempts to encompass some of this, albeit in a haphazard, dangerously inconsistent manner; the concept of common humanity transcends religious morality in that it is not exclusionary. Also, the atheist is never tempted to “play God” by claiming to speak for him.</p></blockquote><p>Is he seriously attempting to argue that Christians are not commanded to “Do unto others as you would have them do unto you”?  SE is hung up on the same concept that so eludes Christopher Hitchens, since there are as many atheisms as there are atheists, there is no universal standard – warrant, if you will – that one atheist can apply to another.  Sans moral parasitism, an atheist cannot be moral or immoral except by self-fiat, hence he is fundamentally amoral in the eyes of everyone else, including other atheists.  Philosophy is hard!</p><blockquote><p>Mr. Day argues, <i>Still, even the most admirable of atheists is nothing more than a moral parasite, living his life based on borrowed ethics. This is why, when pressed, the atheist will often attempt to hide his lack of conviction in his own beliefs behind some poorly formulated utilitarianism, or argue that he acts out of altruistic self-interest. But this is only post-facto rationalization, not reason or rational behavior.</i></p><p>This assertion is debatable, to put it charitably. If Mr. Day wants to throw out “poorly formulated utilitarianism” it would be more convincing if he were to cite at least one example. Also, the implication that religion is necessarily the source of human morality is misleading. The Golden Rule antedates Christianity, and every major existing religion as well. Religion may be a convenient “delivery mechanism”, with its “do this or else” mantra. But is it really all that effective?</p></blockquote><p>If SE had read the book, or even the New Atheist books, then he’d know the chief examples of “poorly formulated utilitarianism” is Sam Harris’s suffering/happiness ethic.  He’d also know that the Golden Rule is not the base of Christian morality or most other religious moralities, it is merely an ad hoc measure for applying the morality, not to be confused with the morality itself.  And he’d also know that compared to the alternatives, as practical philosophers from Seneca and Voltaire to Daniel Dennett have readily admitted, religion appears to be the only thing that is effective.</p><p>In case you’re interested in knowing what someone who has actually read the book has to say about it, SingleMind has taken a page from Bane and completed the first three parts of <a href=\"http://www.singlemind.net/?p=1704\">his multi-faceted review</a>:</p><blockquote><p>While I could spent lots of time discussing the fine points he made, The Irrational Atheist is perhaps a great handbook of examples for how to think and reason critically. Here are some key takeaways that Christians and non-Christians alike can appreciate:</p><p>* Always look for evidence. Reason without evidence is just untested hypothesis at best and gratuitous speculation at worst. Asserted as authoritative without results, it is misrepresentation. Done deliberately, it is fraud. <br>* Always look at the details.<br>* Never trust something just because it is repeated in academic circles.<br>* Be honest about what you find. <br>* Always ask the question, “Compared to what?”</br></br></br></br></p></blockquote></div>",
  "content_text": "There’s little more amusing than an atheist, specifically an atheist who repeatedly insists that atheists can too be just as moral as religious individuals, dishonestly attempting to pass off\na review of a four-year old column as a review of my forthcoming book of the same name\n.  I’m not surprised that Socrates’ Elegy doesn’t intend to read\nThe Irrational Atheist\n, it’s pretty clear that he hasn’t read much by Dawkins, Harris, or Hitchens either.  One hopes not, anyhow, because he hasn’t remembered much of it, let alone understood any of it, if he has.\nVox Day published an essay, The Irrational Atheist, on which I would like to give some feedback. Actually, I was asked to give my take on Day’s forthcoming book of the same title by Pink Kitty in a comment at MCB. After digesting this essay, I doubt that I will be reading his book.\nJonah Goldberg’s more superficial critics judge his book by its cover.  That’s ridiculous, but they’re light years ahead of SE, who seriously\nattempts to judge a 320-page book by a single  750-word op/ed column!\nNice trick; it certainly would have saved me a lot of reading if I had applied the same standard in judging\nThe God Delusion\n,\nUnweaving the Rainbow\n,\nThe End of Faith\n,\nConsciousness Explained\nand about a dozen other books.  Of course, I would have leaped to massive errors such as concluding that Sam Harris is a pro-Inquisition Catholic because of his article “In Defense of Torture”.  And remember, this guy sincerely thinks that he is the smart and rational one!\nAlso, Mr. Day is not enhancing his credibility by referring to himself as a “forensic atheologist”, which he does in his blog description. Whatever.\nPerhaps.  Of course, it’s arguably rather less credibility-destroying than a) not reading what you’re supposed to be critiquing, and, b) failing to understand what little you have read.  In fact, I’d argue that I could call myself Pretty Princess Pooyan and still retain infinitely more intellectual credibility than the fragments possessed by what passes for an intellect here.\nMr. Day begins,\nThe idea that he is a devotee of reason seeing through the outdated superstitions of other, lesser beings is the foremost conceit of the proud atheist.\nO.K., Mr. Day is entitled to his opinion. But this opening statement is not supported by the argument presented in the essay, which is that religion is beneficial and necessary to civilization, therefore atheism is incorrect. He presents no argument that atheism is inherently erroneous. So I am not going to bestow any merit on his accusation of conceit. In addition, maligning those that refuse to accept that there is an omnipotent extra-natural entity that is directly invested in human affairs without providing some tangible evidence as justification is in itself an act of unmitigated hubris.\nUnsurprisingly, given his pitiable start, SE fails to grasp the salient point of the column.  I presented no argument that “atheism is inherently erroneous” in it because I was not arguing that “atheism is incorrect”.  (I don’t argue this in the book either, for that matter.)  “Most atheists are irrational” != “atheism is incorrect”; it is perfectly possible for one to reach a correct conclusion by an irrational path, in fact, both science and casual observation indicate that this is how most people reach most conclusions most of the time.  As I argue in the book, Man is a rationalizing creature, not a rational animal. Ironically, this is precisely the sort of rationalization one could logically expect from an atheist who is irrational enough to believe that “rationalism is virtuous”.\nAs for atheist conceit, there is not exactly a shortage of empirical evidence.  I refer him to Gary Wolf’s Wired article on the New Atheists, or really, just about any atheist blog.  Moreover, if we accept for the sake of argument his ridiculous statement that making a baseless assertion is, in itself an “act of unmitigated hubris”, he proves my point, at least with regards to his own atheist conceit.\nMr. Day goes on,\nThat they also paved the way for the murderous excesses of the French Revolution and many other massacres in the name of human progress is usually considered an unfortunate coincidence by their philosophical descendants.\nEven if that is true, “paved the way” is not synonymous with “were responsible for”. Rejecting the divine right of royalty also paved the way for the American Revolution. Can I infer that Mr. Day is advocating for divine right to be reinstated? That would be an unlikely position for a professed libertarian.\nNo, and it would have been difficult for Meslier, Diderot, Rousseau, and Voltaire, etc, to be directly responsible for la Grande Terreur, being dead for at least five years and all.  I’m pleased to learn that unlike so many of his fellow atheists, SE doesn’t hold today’s Christians responsible for the acts of a Pope or pair of Spanish sovereigns dead for five centuries.  And yes, a libertarian would be a most unlikely advocate for “divine right”, (I think he must mean “the divine right of kings”), which is why it would be incredibly stupid to infer that I am an advocate of its reinstatement.  But given his performance thus far, I see no reason why SE should let that stop him.\nThe phrase “many other massacres” is not supported by any references. Mr. Day invites the reader to use his imagination to fill in the blanks. By saying,\nWithout God, there is only the left-hand path of the philosopher. It leads invariably to Hell, by way of the guillotine, the gulag and the gas chamber.\none can infer that he is adding Nazi Germany and Soviet Russia to the French Revolution. However, Mr. Day gives no evidence that atheism was actually the cause of any atrocities related to those regimes. He merely invites the reader to make that assumption. For example, The Nazi regime was arguably for all intents and purposes Roman Catholic.\nThere are no references in the column, there are many in the book.  SE doesn’t seem to understand that one is not obligated to prove anything in\nan opinion column\n, mostly because there isn’t space for it.  True, one could reasonably infer Nazi Germany, but incorrectly, as it is actually a reference to the gas chambers of atheist North Korea.  If he’d read the book, he’d know that, as well as know about the direct link between atheism and dozens of historical atrocities.  Furthermore, the Nazi regime was verifiably less Roman Catholic than the New Atheism is Anglican, obviously SE doesn’t judge Richard Dawkins and Christopher Hitchens by the same standard he judges Adolf Hitler.  SE obviously fails to understand how the very existence of the\nReichskonkordat\nproves that Nazi Germany was not Catholic in any way; there is far more conclusive documentary evidence in the book as well.\nThe advent of technology and advances in fields such as medicine is more than sufficient evidence for a reasonable person, even one with the least science education, to infer that by-and-large scientists know what they are talking about and that their interpretation of the natural order is credible. Yes, scientists do sometimes draw different conclusions, and theories are constantly revised as more evidence is discovered. That doesn’t mean it doesn’t work. If you are reading this using a computer, you have all the evidence you need. Bear in mind that science does not claim absolute certainty.\nThis is one of the otherwise reasonable Daniel Dennett’s more foolish arguments, which I openly deride in the book.  In Dennett’s fo\nrm, it states that because physicists know what they’re talking about and possess conceptual models that are precise to an incredible degree, we should accept at face value everything that biologists and sociologists say even though their conceptual models are horrendously inaccurate to the point of uselessness.  It’s a  transitive nonsense no more convincing in SE’s words than in Dennett’s.\nMr. Day continues,\nWhereas Christians and the faithful of other religions have good reason for attempting to live by the Golden Rule – they are commanded to do so – the atheist does not.\nThis is an unsupported assumption. The atheist has at least one good ethical motivation: self-interest in the preservation of civilization. Acting on this an atheist has at his disposal our common humanity: the body of knowledge we draw upon to establish codes of conduct, points of order, and define the rights and responsibilities we as citizens must observe in order to maintain civilization. While religion attempts to encompass some of this, albeit in a haphazard, dangerously inconsistent manner; the concept of common humanity transcends religious morality in that it is not exclusionary. Also, the atheist is never tempted to “play God” by claiming to speak for him.\nIs he seriously attempting to argue that Christians are not commanded to “Do unto others as you would have them do unto you”?  SE is hung up on the same concept that so eludes Christopher Hitchens, since there are as many atheisms as there are atheists, there is no universal standard – warrant, if you will – that one atheist can apply to another.  Sans moral parasitism, an atheist cannot be moral or immoral except by self-fiat, hence he is fundamentally amoral in the eyes of everyone else, including other atheists.  Philosophy is hard!\nMr. Day argues,\nStill, even the most admirable of atheists is nothing more than a moral parasite, living his life based on borrowed ethics. This is why, when pressed, the atheist will often attempt to hide his lack of conviction in his own beliefs behind some poorly formulated utilitarianism, or argue that he acts out of altruistic self-interest. But this is only post-facto rationalization, not reason or rational behavior.\nThis assertion is debatable, to put it charitably. If Mr. Day wants to throw out “poorly formulated utilitarianism” it would be more convincing if he were to cite at least one example. Also, the implication that religion is necessarily the source of human morality is misleading. The Golden Rule antedates Christianity, and every major existing religion as well. Religion may be a convenient “delivery mechanism”, with its “do this or else” mantra. But is it really all that effective?\nIf SE had read the book, or even the New Atheist books, then he’d know the chief examples of “poorly formulated utilitarianism” is Sam Harris’s suffering/happiness ethic.  He’d also know that the Golden Rule is not the base of Christian morality or most other religious moralities, it is merely an ad hoc measure for applying the morality, not to be confused with the morality itself.  And he’d also know that compared to the alternatives, as practical philosophers from Seneca and Voltaire to Daniel Dennett have readily admitted, religion appears to be the only thing that is effective.\nIn case you’re interested in knowing what someone who has actually read the book has to say about it, SingleMind has taken a page from Bane and completed the first three parts of\nhis multi-faceted review\n:\nWhile I could spent lots of time discussing the fine points he made, The Irrational Atheist is perhaps a great handbook of examples for how to think and reason critically. Here are some key takeaways that Christians and non-Christians alike can appreciate:\n* Always look for evidence. Reason without evidence is just untested hypothesis at best and gratuitous speculation at worst. Asserted as authoritative without results, it is misrepresentation. Done deliberately, it is fraud.\n* Always look at the details.\n* Never trust something just because it is repeated in academic circles.\n* Be honest about what you find.\n* Always ask the question, “Compared to what?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-21T10:55:00+00:00"
}