{
  "url": "https://voxday.net/2008/01/08/blog-pos-9/",
  "scraped_at": "2026-01-08T22:06:44.020574",
  "title": "The incoherent ideology of the Left",
  "date_display": "January 8, 2008",
  "date_iso": "2008-01-08T11:44:00+00:00",
  "date_from_url": "2008-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>IG emails in the interest of demonstrating the left-winger’s usual disinterest in intellectual coherency:</p><blockquote><p>Fascism is a form of extreme right-wing ideology that celebrates the nation or the race as an organic community transcending all otherloyalties. It emphasizes a myth of national or racial rebirth after a period of decline or destruction. To this end, fascism calls for a “spiritual revolution” against signs of moral decay such as individualism and materialism, and seeks to purge “alien” forces and groups that threaten the organic community. Fascism tends to celebrate masculinity, youth, mystical unity, and the regenerative power of violence. Often, but not always, it promotes racial superiority doctrines, ethnic persecution, imperialist expansion, and genocide.</p><p>At the same time, fascists may embrace a form of internationalism based on either racial or ideological solidarity across national boundaries. Usually fascism espouses open male supremacy, though sometimes it may also promote female solidarity and new opportunities for women of the privileged nation or race.</p><p>Fascism’s approach to politics is both populist–in that it seeks to activate “the people” as a whole against perceived oppressors or enemies–and elitist–in that it treats the people’s will as embodied in a select group, or often one supreme leader, from whom authority proceeds downward. Fascism seeks to organize a cadre-led mass movement in a drive to seize state power. It seeks to forcibly subordinate all spheres of society to its ideological vision of organic community, usually through a totalitarian state. Both as a movement and a regime, fascism uses mass organizations as a system of integration and control, and uses organized violence to suppress opposition, although the scale of violence varies widely.</p></blockquote><p>Notice that IG offers absolutely no evidence to explain his charge that fascism is “extreme right wing”, he doesn’t even attempt to explain the range of whatever political spectrum he is using.  (It’s obviously a very short one equivalent to a color spectum ranging all the way from purple to blue.)  He doesn’t bother to think about the dichotomy between the huge contradictions between what would then be two extreme right wings – the libertarian and the fascist – nor the huge similarities between a fascist extreme right wing and a communist extreme left wing.</p><p>The conventional academic’s dance is to insist that the spectrum is a circle, in which case the libertarian must be the ultimate centrist between two statist ideologies, which is neither useful in a pragmatic sense nor coherent in a philosophical one.</p><p>According to IG, who doesn’t even begin to address the strange fact of how nearly every leading Fascist, Nazi and fascist was not only a left-wing socialist, but continued to describe themselves as socialists throughout.  Note too his unavoidable self-contradictions: fascism is national but international, it is sexist but pro-women’s rights, populist but elitist.  How very ideologically definitive!  Moreover, nearly every point that he tries to make in order to prove fascism’s place on the Right applies nearly as well, or in more than a few cases, better, to every left-wing regime in history dating back to the French Revolution.  As Stalin correctly asserted, fascism is to the right of communism, but that’s not the salient point.  The salient point is that fascism <i>is distinctly to the left of nearly every other political ideology, including both classical and modern liberalism and libertarianism.</i></p><p>Anyone who still attempts to insist that fascism in all its various forms is not an ideology of the political Left is either historically ignorant, intellectually dishonest or willfully self-deceptive.</p></div>",
  "content_text": "IG emails in the interest of demonstrating the left-winger’s usual disinterest in intellectual coherency:\nFascism is a form of extreme right-wing ideology that celebrates the nation or the race as an organic community transcending all otherloyalties. It emphasizes a myth of national or racial rebirth after a period of decline or destruction. To this end, fascism calls for a “spiritual revolution” against signs of moral decay such as individualism and materialism, and seeks to purge “alien” forces and groups that threaten the organic community. Fascism tends to celebrate masculinity, youth, mystical unity, and the regenerative power of violence. Often, but not always, it promotes racial superiority doctrines, ethnic persecution, imperialist expansion, and genocide.\nAt the same time, fascists may embrace a form of internationalism based on either racial or ideological solidarity across national boundaries. Usually fascism espouses open male supremacy, though sometimes it may also promote female solidarity and new opportunities for women of the privileged nation or race.\nFascism’s approach to politics is both populist–in that it seeks to activate “the people” as a whole against perceived oppressors or enemies–and elitist–in that it treats the people’s will as embodied in a select group, or often one supreme leader, from whom authority proceeds downward. Fascism seeks to organize a cadre-led mass movement in a drive to seize state power. It seeks to forcibly subordinate all spheres of society to its ideological vision of organic community, usually through a totalitarian state. Both as a movement and a regime, fascism uses mass organizations as a system of integration and control, and uses organized violence to suppress opposition, although the scale of violence varies widely.\nNotice that IG offers absolutely no evidence to explain his charge that fascism is “extreme right wing”, he doesn’t even attempt to explain the range of whatever political spectrum he is using.  (It’s obviously a very short one equivalent to a color spectum ranging all the way from purple to blue.)  He doesn’t bother to think about the dichotomy between the huge contradictions between what would then be two extreme right wings – the libertarian and the fascist – nor the huge similarities between a fascist extreme right wing and a communist extreme left wing.\nThe conventional academic’s dance is to insist that the spectrum is a circle, in which case the libertarian must be the ultimate centrist between two statist ideologies, which is neither useful in a pragmatic sense nor coherent in a philosophical one.\nAccording to IG, who doesn’t even begin to address the strange fact of how nearly every leading Fascist, Nazi and fascist was not only a left-wing socialist, but continued to describe themselves as socialists throughout.  Note too his unavoidable self-contradictions: fascism is national but international, it is sexist but pro-women’s rights, populist but elitist.  How very ideologically definitive!  Moreover, nearly every point that he tries to make in order to prove fascism’s place on the Right applies nearly as well, or in more than a few cases, better, to every left-wing regime in history dating back to the French Revolution.  As Stalin correctly asserted, fascism is to the right of communism, but that’s not the salient point.  The salient point is that fascism\nis distinctly to the left of nearly every other political ideology, including both classical and modern liberalism and libertarianism.\nAnyone who still attempts to insist that fascism in all its various forms is not an ideology of the political Left is either historically ignorant, intellectually dishonest or willfully self-deceptive.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-08T11:44:00+00:00"
}