{
  "url": "https://voxday.net/2008/01/08/captain-underoos-laundry-lis/",
  "scraped_at": "2026-01-08T22:06:45.884816",
  "title": "Mitt Romney’s laundry list",
  "date_display": "January 8, 2008",
  "date_iso": "2008-01-08T12:54:00+00:00",
  "date_from_url": "2008-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Captain Underoos is all but finished.  Every day, he makes it more clear that he’s a <a href=\"http://article.nationalreview.com/?q=NTJhZDFjOTYzZGNhYjk0YWJiNGI4NTY1MDYwOWI0ZWE=\">first-rate phony and fifth-rate demagogue</a>:</p><blockquote><p>“There’s a message that I’ve been talking about from the beginning and that I’ve been hearing from you,” Romney said, “and that is that Washington is broken, that we have to see change in Washington.” On Romney’s left was a large blue poster with the message WASHINGTON IS BROKEN.</p><p>On Romney’s left, an equal-size sign said TO DO, and beneath it were the numbers 1-15. Number one was MAKE AMERICA SAFER, with in true Romney fashion three sub-headings, STRONGER MILITARY, BETTER INTELLIGENCE, AND STRENGTHEN ALLIANCES. Number two was END ILLEGAL IMMIGRATION. Number three was REDUCE TAXES; four was CUT THE PORK; five was BETTER CARE FOR VETERANS; six was HEALTH INSURANCE FOR EVERYONE; seven was END DEPENDENCE ON FOREIGN OIL; eight was MAKE GOVERNMENT SIMPLER, SMALLER; nine was GROW THE ECONOMY &amp; KEEP OUR JOBS; ten was FIX SOCIAL SECURITY; eleven was PUT PEOPLE AHEAD OF SELFISH INTEREST; twelve was STRENGTHEN OUR FAMILIES; and thirteen was BALANCE THE BUDGET. That was the end of it; numbers fourteen and fifteen were blank.</p><p>Romney explained that he had been keeping track of the topics people brought up at his “Ask Mitt Anything” meetings, and they formed the basis of the TO DO list. The list was literally unfinished, Romney said, which was why the last two positions were empty. He also confessed that number thirteen, BALANCE THE BUDGET, was not actually printed on the poster board but was lettered on blue tape, so hastily was the graphic put together. “You see at the bottom, it says BALANCE THE BUDGET and it looks like it was taped on?” Romney said. “It was. That was added yesterday, because I was in a meeting just like this in where were we?” Someone said Nashua. “Nashua. Thank you. I was in Nashua, and someone said, ‘How about balance the budget?’ I said absolutely, so we stuck it on there.”</p><p>You want to add a policy priority to the Romney administration, should there be one? Just say the word.</p></blockquote><p>I wouldn’t have thought it possible, but Romney may actually be a worse politician than Ron Paul, his executive hair notwithstanding.  Because if, unlike Paul, you can’t be sincere, then you have to at least be able to fake being sincere without making it completely obvious to all and sundry that you’re faking it.  To paraphrase Vodkapundit, Mitt Romney has experience. Experience with change. Change that only his experience, his experience with change, can bring about.</p><p>Meanwhile, back at NRO headquarters, Kathryn Jean fights back her tears at the thought of the conservative commentariat’s declining influence: <i>“Byron’s Piece this morning makes me sad.”</i> I’m guessing that both McCain and Romney will underperform somewhat, which should work to Huckabee’s – and to a lesser extent, Paul’s – advantage.</p></div>",
  "content_text": "Captain Underoos is all but finished.  Every day, he makes it more clear that he’s a\nfirst-rate phony and fifth-rate demagogue\n:\n“There’s a message that I’ve been talking about from the beginning and that I’ve been hearing from you,” Romney said, “and that is that Washington is broken, that we have to see change in Washington.” On Romney’s left was a large blue poster with the message WASHINGTON IS BROKEN.\nOn Romney’s left, an equal-size sign said TO DO, and beneath it were the numbers 1-15. Number one was MAKE AMERICA SAFER, with in true Romney fashion three sub-headings, STRONGER MILITARY, BETTER INTELLIGENCE, AND STRENGTHEN ALLIANCES. Number two was END ILLEGAL IMMIGRATION. Number three was REDUCE TAXES; four was CUT THE PORK; five was BETTER CARE FOR VETERANS; six was HEALTH INSURANCE FOR EVERYONE; seven was END DEPENDENCE ON FOREIGN OIL; eight was MAKE GOVERNMENT SIMPLER, SMALLER; nine was GROW THE ECONOMY & KEEP OUR JOBS; ten was FIX SOCIAL SECURITY; eleven was PUT PEOPLE AHEAD OF SELFISH INTEREST; twelve was STRENGTHEN OUR FAMILIES; and thirteen was BALANCE THE BUDGET. That was the end of it; numbers fourteen and fifteen were blank.\nRomney explained that he had been keeping track of the topics people brought up at his “Ask Mitt Anything” meetings, and they formed the basis of the TO DO list. The list was literally unfinished, Romney said, which was why the last two positions were empty. He also confessed that number thirteen, BALANCE THE BUDGET, was not actually printed on the poster board but was lettered on blue tape, so hastily was the graphic put together. “You see at the bottom, it says BALANCE THE BUDGET and it looks like it was taped on?” Romney said. “It was. That was added yesterday, because I was in a meeting just like this in where were we?” Someone said Nashua. “Nashua. Thank you. I was in Nashua, and someone said, ‘How about balance the budget?’ I said absolutely, so we stuck it on there.”\nYou want to add a policy priority to the Romney administration, should there be one? Just say the word.\nI wouldn’t have thought it possible, but Romney may actually be a worse politician than Ron Paul, his executive hair notwithstanding.  Because if, unlike Paul, you can’t be sincere, then you have to at least be able to fake being sincere without making it completely obvious to all and sundry that you’re faking it.  To paraphrase Vodkapundit, Mitt Romney has experience. Experience with change. Change that only his experience, his experience with change, can bring about.\nMeanwhile, back at NRO headquarters, Kathryn Jean fights back her tears at the thought of the conservative commentariat’s declining influence:\n“Byron’s Piece this morning makes me sad.”\nI’m guessing that both McCain and Romney will underperform somewhat, which should work to Huckabee’s – and to a lesser extent, Paul’s – advantage.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-08T12:54:00+00:00"
}