{
  "url": "https://voxday.net/2008/01/31/culture-women-wanted/",
  "scraped_at": "2026-01-08T22:10:04.663672",
  "title": "The culture women wanted",
  "date_display": "January 31, 2008",
  "date_iso": "2008-01-31T08:50:00+00:00",
  "date_from_url": "2008-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kay Hymowitz laments <a href=\"http://www.dallasnews.com/sharedcontent/dws/dn/opinion/points/stories/DN-hymowitz_27edi.ART0.State.Edition1.378ca5b.html\">the immaturity of the modern young man</a>. Vox Day reads it, shrugs, and goes back to the Plaguelands:</p><blockquote><p>But this history suggests an uncomfortable fact about the new SYM: He’s immature because he can be. We can argue endlessly about whether “masculinity” is natural or constructed – whether men are innately promiscuous, restless and slobby or socialized to be that way – but there’s no denying the lesson of today’s media marketplace: Give young men a choice between serious drama on the one hand, and Victoria’s Secret models, battling cyborgs, exploding toilets and the NFL on the other, and it’s the models, cyborgs, toilets and football by a mile.</p><p>For whatever reason, adolescence appears to be the young man’s default state, proving what anthropologists have discovered in cultures everywhere: It is marriage and children that turn boys into men. Now that the SYM can put off family into the hazily distant future, he can – and will – try to stay a child-man. Not only is no one asking that today’s twenty- or thirtysomething become a responsible husband and father – that is, grow up – but a freewheeling marketplace gives him everything he needs to settle down in pig’s heaven indefinitely.</p></blockquote><p>There was no shortage of women who didn’t like it when men were responsible for everything.  They wanted to vote, they wanted to work, they are demanding a turn to take the reins.  Fine, says the modern young  man, who has been subjected to 16 years of feminist propaganda  that women are just as good – better, in fact – than men at pretty much everything.  Not being given to whining and being largely practical, the young man is happy to leave the responsibility to the women who are demanding it.  Who in their right mind would trade models, games and football for marriage to some controlling bitch who’s as likely to leave you as not?</p><p>I certainly wouldn’t.  Yeah, I got married, but only because I got lucky and met a woman who looks like a VS model and is fine with the cyborgs and NFL as long as I keep it to what she considers a reasonable 12/7.</p><p>This is what matriarchy looks like. And until it collapses, as it most certainly will in a shorter period of time than anyone expects, we can expect to see more of this rational immaturity from men.  If Ms Hymowitz thinks it’s bad now, she should just wait until the MMOs get superintelligent, <i>Madden</i> installs a live link to NFL trades and injury updates and the inanimate sex dolls become animated sex droids.  You wanted to drive, women, now you’ve got the wheel.  Good luck with that.</p><p>Now, if you’ll excuse me, there’s an infestation of Skeletal Flayers in the Ruins of Andorhal that requires my attention.</p></div>",
  "content_text": "Kay Hymowitz laments\nthe immaturity of the modern young man\n. Vox Day reads it, shrugs, and goes back to the Plaguelands:\nBut this history suggests an uncomfortable fact about the new SYM: He’s immature because he can be. We can argue endlessly about whether “masculinity” is natural or constructed – whether men are innately promiscuous, restless and slobby or socialized to be that way – but there’s no denying the lesson of today’s media marketplace: Give young men a choice between serious drama on the one hand, and Victoria’s Secret models, battling cyborgs, exploding toilets and the NFL on the other, and it’s the models, cyborgs, toilets and football by a mile.\nFor whatever reason, adolescence appears to be the young man’s default state, proving what anthropologists have discovered in cultures everywhere: It is marriage and children that turn boys into men. Now that the SYM can put off family into the hazily distant future, he can – and will – try to stay a child-man. Not only is no one asking that today’s twenty- or thirtysomething become a responsible husband and father – that is, grow up – but a freewheeling marketplace gives him everything he needs to settle down in pig’s heaven indefinitely.\nThere was no shortage of women who didn’t like it when men were responsible for everything.  They wanted to vote, they wanted to work, they are demanding a turn to take the reins.  Fine, says the modern young  man, who has been subjected to 16 years of feminist propaganda  that women are just as good – better, in fact – than men at pretty much everything.  Not being given to whining and being largely practical, the young man is happy to leave the responsibility to the women who are demanding it.  Who in their right mind would trade models, games and football for marriage to some controlling bitch who’s as likely to leave you as not?\nI certainly wouldn’t.  Yeah, I got married, but only because I got lucky and met a woman who looks like a VS model and is fine with the cyborgs and NFL as long as I keep it to what she considers a reasonable 12/7.\nThis is what matriarchy looks like. And until it collapses, as it most certainly will in a shorter period of time than anyone expects, we can expect to see more of this rational immaturity from men.  If Ms Hymowitz thinks it’s bad now, she should just wait until the MMOs get superintelligent,\nMadden\ninstalls a live link to NFL trades and injury updates and the inanimate sex dolls become animated sex droids.  You wanted to drive, women, now you’ve got the wheel.  Good luck with that.\nNow, if you’ll excuse me, there’s an infestation of Skeletal Flayers in the Ruins of Andorhal that requires my attention.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-31T08:50:00+00:00"
}