{
  "url": "https://voxday.net/2008/01/18/daily-tia-talk_18/",
  "scraped_at": "2026-01-08T22:08:21.668239",
  "title": "Portrait of the Author as a Serial Killer",
  "date_display": "January 18, 2008",
  "date_iso": "2008-01-18T12:50:00+00:00",
  "date_from_url": "2008-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No new Amazon reviews today, but the sweetly sensitive soul that is Bane has taken the unusual approach of writing a serial review on his blog.  Here’s how he <a href=\"http://banedad.blogspot.com/2008/01/irrational-athiest.html\">describes it so far</a>:</p><blockquote><p>I have decided to start reviewing this book a chunk at a time. It is the kind of writing that compels me to write, and he does all of your thinking for you, so you don’t have to do anything but lay back and enjoy it. So far.</p><p>And what a work of art it is. So far. It grabs you by the nose with velvet gloved fingers, pulls you around where it wants you to go…I am reminded of the Francis Dollarhyde character in Manhunter, when he is giving the slide show to the creep reporter Freddy Lounds, saying <i>“Do you see?”</i> as he takes Freddy from one scene of horror to the next.</p></blockquote><p>It’s such a pity that the publisher didn’t query Bane for pre-release comments:  “Read this book – it’s like watching a massacre in slow motion!”  Actually, come to think of it, one of the editors did say that she wasn’t surprised to learn that I was involved with games because the book reminded her of one of those games where the player just walks in the room with a shotgun and shoots everything that moves.  So perhaps the Reaper’s Hairball has a salient point after all.</p><p>Speaking of shots, the OC has laid out his thoughts on <a href=\"http://rantingroom.blogspot.com/2008/01/of-market-surges-and-sales-rankings.html\">the best way to take part in the book surge</a> at the Ranting Room.  The essentials are: order your books between 9 PM Saturday to 9 PM Sunday (CST).  I’ll be kicking it off with <a href=\"http://www.cyber-line.com/\">an interview with Cyber-Line</a> on Saturday evening, then running a live blog during the Championship games, complete with regular surge updates.  So, whether you’re taking part or not, do swing by during the games.  We’ll be around.</p></div>",
  "content_text": "No new Amazon reviews today, but the sweetly sensitive soul that is Bane has taken the unusual approach of writing a serial review on his blog.  Here’s how he\ndescribes it so far\n:\nI have decided to start reviewing this book a chunk at a time. It is the kind of writing that compels me to write, and he does all of your thinking for you, so you don’t have to do anything but lay back and enjoy it. So far.\nAnd what a work of art it is. So far. It grabs you by the nose with velvet gloved fingers, pulls you around where it wants you to go…I am reminded of the Francis Dollarhyde character in Manhunter, when he is giving the slide show to the creep reporter Freddy Lounds, saying\n“Do you see?”\nas he takes Freddy from one scene of horror to the next.\nIt’s such a pity that the publisher didn’t query Bane for pre-release comments:  “Read this book – it’s like watching a massacre in slow motion!”  Actually, come to think of it, one of the editors did say that she wasn’t surprised to learn that I was involved with games because the book reminded her of one of those games where the player just walks in the room with a shotgun and shoots everything that moves.  So perhaps the Reaper’s Hairball has a salient point after all.\nSpeaking of shots, the OC has laid out his thoughts on\nthe best way to take part in the book surge\nat the Ranting Room.  The essentials are: order your books between 9 PM Saturday to 9 PM Sunday (CST).  I’ll be kicking it off with\nan interview with Cyber-Line\non Saturday evening, then running a live blog during the Championship games, complete with regular surge updates.  So, whether you’re taking part or not, do swing by during the games.  We’ll be around.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-18T12:50:00+00:00"
}