{
  "url": "https://voxday.net/2008/01/17/daily-tia-talk/",
  "scraped_at": "2026-01-08T22:08:03.402648",
  "title": "Daily TIA talk",
  "date_display": "January 17, 2008",
  "date_iso": "2008-01-17T11:13:00+00:00",
  "date_from_url": "2008-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1200483996&amp;sr=1-1\">two of the latest reviews</a> of <i>The Irrational Atheist</i> to appear, and I am given to understand that one may be forthcoming soon from the nightmare that is Bane.  One shudders to think what he could do with the ammunition I have given him… my apologies in advance.</p><blockquote><p>Salt writes: <i>“Funny, adroit, and a metaphorical bombs-away, Day delivers a big one on the “Unholy Trinity”…. This book is not recommended for late night reading, as you’ll be howling here and there and waking the neighborhood dogs.”</i></p><p>Tom E. writes: <i>Very well researched and footnoted. *NOT* a religious book, but one that exposes the fallacies of the new atheist movement of Dawkins, et al. </i></p></blockquote><p>Tom’s statement about the abolition of religion might be a bit unintentionally misleading here, because while that aspect is theoretically encompassed by one or two of my points, these are historical points not necessarily relevant to most atheism today, Onfray excluded.  Indeed, one thing that I stress is the way the authoritarian impulse present in most atheism is not actually tied to anything religious or even anti-religious, but rather stems from the logical consequence of the need to force moral compliance in the absence of any convincing rationale for universal application.  “Morality could be theoretically be based on X” != “Anyone will buy into X-based morality”.   Thus, the potential threat from this impulse is not merely to religion and the religious, but to the irreligious as well.  It’s a much more fundamental problem than most people understand, regardless of their creed.  (Daniel Dennett, to his great credit, does grasp this.)</p><p>“Thus spake the Most High” may be considered ludicrous by some, but has historically proven to be perfectly sufficent for the great majority of the population; certainly more inherently compelling than “well, how would you feel?”  Utilitarian happiness/suffering metrics may be superficially appealing to the shallow thinker, but they fall apart logically and empirically after even a modicum of reflection and/or research.</p><p>Regarding Salt’s quixotic Latin, I had best leave that for him to explain.</p><p>Surge.  Saturday Evening.  Soon.</p></div>",
  "content_text": "Here’s\ntwo of the latest reviews\nof\nThe Irrational Atheist\nto appear, and I am given to understand that one may be forthcoming soon from the nightmare that is Bane.  One shudders to think what he could do with the ammunition I have given him… my apologies in advance.\nSalt writes:\n“Funny, adroit, and a metaphorical bombs-away, Day delivers a big one on the “Unholy Trinity”…. This book is not recommended for late night reading, as you’ll be howling here and there and waking the neighborhood dogs.”\nTom E. writes:\nVery well researched and footnoted. *NOT* a religious book, but one that exposes the fallacies of the new atheist movement of Dawkins, et al.\nTom’s statement about the abolition of religion might be a bit unintentionally misleading here, because while that aspect is theoretically encompassed by one or two of my points, these are historical points not necessarily relevant to most atheism today, Onfray excluded.  Indeed, one thing that I stress is the way the authoritarian impulse present in most atheism is not actually tied to anything religious or even anti-religious, but rather stems from the logical consequence of the need to force moral compliance in the absence of any convincing rationale for universal application.  “Morality could be theoretically be based on X” != “Anyone will buy into X-based morality”.   Thus, the potential threat from this impulse is not merely to religion and the religious, but to the irreligious as well.  It’s a much more fundamental problem than most people understand, regardless of their creed.  (Daniel Dennett, to his great credit, does grasp this.)\n“Thus spake the Most High” may be considered ludicrous by some, but has historically proven to be perfectly sufficent for the great majority of the population; certainly more inherently compelling than “well, how would you feel?”  Utilitarian happiness/suffering metrics may be superficially appealing to the shallow thinker, but they fall apart logically and empirically after even a modicum of reflection and/or research.\nRegarding Salt’s quixotic Latin, I had best leave that for him to explain.\nSurge.  Saturday Evening.  Soon.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-17T11:13:00+00:00"
}