{
  "url": "https://voxday.net/2008/01/09/despair-no/",
  "scraped_at": "2026-01-08T22:06:55.087015",
  "title": "Despair not",
  "date_display": "January 9, 2008",
  "date_iso": "2008-01-09T15:46:00+00:00",
  "date_from_url": "2008-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know some of you are a little down about the back of the hand that the “Live Free or Die” voters showed to Ron Paul, and by extension, the basic concepts of freedom, human liberty and small government.  (Well, not Bane, of course, considering his three-fer yesterday with Paul and Obama both losing and the upset win for Ms Sexy Cankles.  Throw in a fat-bottomed peasant woman, a few dead Iraqis, and a new C&amp;C expansion pack and that big, sensitive heart would have given out from a surfeit of sheer happiness.)</p><p>The reality is that it was always going to be this way.  Today’s snowball’s chance is no different than yesterday’s.  Rationally, you know it.  Spiritually, you know it.  Emotionally, you know it.  This doesn’t make your defiance pointless or worthless, to the contrary, it makes it all the more important.  When you resist the elite’s siren call to serfdom, you are not battling for your country, that fate was settled long ago.  You are battling for your soul and for your mind.  That’s not only a battle well worth fighting, it’s one that no one else can fight for you.</p><p><i>Die Gedanken, sie sind frei</i>, a man once said.  Only you can enslave your thoughts, and despair and bitterness are forms of slavery in themselves.  So, keep your wits about you, pop some popcorn, and enjoy the show.  You have front row seats at what may be one of the more interesting points in world history and it would truly be a shame to not make the most of them.</p><p>Of course, I doubt that’s why Captain Ed <a href=\"http://www.captainsquartersblog.com/mt/archives/016567.php\">seems so pleased</a> with the death knell for small government conservatism in America:</p><blockquote><p>It’s been more than 14 hours since I posted about the TNR story, and so far … nothing. I really expected to find scores of outraged commentary in the Disqus moderation queue when I woke up this morning, but so far, it’s been as quiet as a church mouse.</p></blockquote><p>That’s likely because those who value freedom are in the process ceasing to concern themselves with those who don’t.  While we’ll never stop standing up for that which we believe, there’s no point in wasting time casting pearls before the stubbornly swinish.  I certainly saw no reason to educate the willfully ignorant about a story that was refuted long ago by both Texas Monthly and the New York Times.  I was amused, however, to see one of his commenters add: “Goodbye Paulistinians — please, don’t ever come back!”</p><p>Don’t worry, we won’t.  Remember this, those of you who belong to the unwanted ten percent, when those who spurn you today are begging you to return to the Republican fold in November because the Lizard Queen is about to win the Mostest Importantest Election Ever.  Remember: you’re crazy, they don’t want you or your ideals, and serfdom is no more desirable when preceded by an (R).</p><p>To quote the great Emmitt Smith: “Don’t quit, don’t even quit!”</p></div>",
  "content_text": "I know some of you are a little down about the back of the hand that the “Live Free or Die” voters showed to Ron Paul, and by extension, the basic concepts of freedom, human liberty and small government.  (Well, not Bane, of course, considering his three-fer yesterday with Paul and Obama both losing and the upset win for Ms Sexy Cankles.  Throw in a fat-bottomed peasant woman, a few dead Iraqis, and a new C&C expansion pack and that big, sensitive heart would have given out from a surfeit of sheer happiness.)\nThe reality is that it was always going to be this way.  Today’s snowball’s chance is no different than yesterday’s.  Rationally, you know it.  Spiritually, you know it.  Emotionally, you know it.  This doesn’t make your defiance pointless or worthless, to the contrary, it makes it all the more important.  When you resist the elite’s siren call to serfdom, you are not battling for your country, that fate was settled long ago.  You are battling for your soul and for your mind.  That’s not only a battle well worth fighting, it’s one that no one else can fight for you.\nDie Gedanken, sie sind frei\n, a man once said.  Only you can enslave your thoughts, and despair and bitterness are forms of slavery in themselves.  So, keep your wits about you, pop some popcorn, and enjoy the show.  You have front row seats at what may be one of the more interesting points in world history and it would truly be a shame to not make the most of them.\nOf course, I doubt that’s why Captain Ed\nseems so pleased\nwith the death knell for small government conservatism in America:\nIt’s been more than 14 hours since I posted about the TNR story, and so far … nothing. I really expected to find scores of outraged commentary in the Disqus moderation queue when I woke up this morning, but so far, it’s been as quiet as a church mouse.\nThat’s likely because those who value freedom are in the process ceasing to concern themselves with those who don’t.  While we’ll never stop standing up for that which we believe, there’s no point in wasting time casting pearls before the stubbornly swinish.  I certainly saw no reason to educate the willfully ignorant about a story that was refuted long ago by both Texas Monthly and the New York Times.  I was amused, however, to see one of his commenters add: “Goodbye Paulistinians — please, don’t ever come back!”\nDon’t worry, we won’t.  Remember this, those of you who belong to the unwanted ten percent, when those who spurn you today are begging you to return to the Republican fold in November because the Lizard Queen is about to win the Mostest Importantest Election Ever.  Remember: you’re crazy, they don’t want you or your ideals, and serfdom is no more desirable when preceded by an (R).\nTo quote the great Emmitt Smith: “Don’t quit, don’t even quit!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-09T15:46:00+00:00"
}