{
  "url": "https://voxday.net/2008/01/25/dialogue-auf-deutsc/",
  "scraped_at": "2026-01-08T22:09:20.424646",
  "title": "A dialogue auf Deutsch",
  "date_display": "January 25, 2008",
  "date_iso": "2008-01-25T09:30:00+00:00",
  "date_from_url": "2008-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://tell-em-to-get-stuffed.blogspot.com/\">Mad Aussie</a> simply can’t resist a chance to chaff the Chermans:</p><blockquote><p>German 1: “What does he mean by hilarious?”</p><p>German 2: “They call it laughing, they laugh.”</p><p>German 1: “Laughing?”</p><p>German 2: “They use it to mock us.”</p><p>German 1: “They must die.”</p><p>German 2: “We must wait. Let them laugh. They can laugh. They will not laugh when we finish with our grand plan.”</p><p>German 1: “I do not like the laughing.”</p></blockquote><p>That made me laugh, but it’s not the funniest thing I’ve ever read about Jamie, though.  The funniest thing I ever read about Jamie wasn’t anything that he wrote, but when I received an email a few years ago from a critic to whose post I had responded and linked.  Jamie had followed the link and posted a few of his characteristicly quixotic comments on the humor-impaired critic’s site, which led to the following email showing up in my Inbox: <i>“Who is this guy Jamie?  I can’t understand a single thing he writes.  Is he crazy?”</i></p><p>To which I answered in the affirmative, of course.  And since we’re talking about Jamie, I leave you with an item from his very useful and informative Global Report:</p><blockquote><p>US Secretary of State Condoleezza Rice said Thursday the challenges facing Colombia will only get harder if a trade deal with Washington doesn’t pass, as she met with union members during a visit to try to revive the pact. The union members want regulations and restrictions in the USA removed from some of their goods, specifically, cocaine.</p></blockquote></div>",
  "content_text": "The\nMad Aussie\nsimply can’t resist a chance to chaff the Chermans:\nGerman 1: “What does he mean by hilarious?”\nGerman 2: “They call it laughing, they laugh.”\nGerman 1: “Laughing?”\nGerman 2: “They use it to mock us.”\nGerman 1: “They must die.”\nGerman 2: “We must wait. Let them laugh. They can laugh. They will not laugh when we finish with our grand plan.”\nGerman 1: “I do not like the laughing.”\nThat made me laugh, but it’s not the funniest thing I’ve ever read about Jamie, though.  The funniest thing I ever read about Jamie wasn’t anything that he wrote, but when I received an email a few years ago from a critic to whose post I had responded and linked.  Jamie had followed the link and posted a few of his characteristicly quixotic comments on the humor-impaired critic’s site, which led to the following email showing up in my Inbox:\n“Who is this guy Jamie?  I can’t understand a single thing he writes.  Is he crazy?”\nTo which I answered in the affirmative, of course.  And since we’re talking about Jamie, I leave you with an item from his very useful and informative Global Report:\nUS Secretary of State Condoleezza Rice said Thursday the challenges facing Colombia will only get harder if a trade deal with Washington doesn’t pass, as she met with union members during a visit to try to revive the pact. The union members want regulations and restrictions in the USA removed from some of their goods, specifically, cocaine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-25T09:30:00+00:00"
}