{
  "url": "https://voxday.net/2008/01/23/dr-helen-dives-in/",
  "scraped_at": "2026-01-08T22:09:03.765234",
  "title": "Dr. Helen dives in",
  "date_display": "January 23, 2008",
  "date_iso": "2008-01-23T10:44:00+00:00",
  "date_from_url": "2008-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://drhelen.blogspot.com/2008/01/irrational-atheist.html\">familiarizes herself with an eminently fascinating tome</a>:</p><blockquote><p>I spent part of the day reading Vox Day’s new book, <i>The Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens</i>. You might know Vox Day from his blog and interesting take on feminist issues–he always has something provocative to add to that particular conversation and his book proves to be just as stimulating in regards to religion and faith….  The book is definitely thought provoking and worth a read if you are interested in the topic!</p></blockquote><p>As you’ve probably seen from the post down the page, it didn’t take long for a clueless atheist – apparently a university professor in this case – to read her post and be inspired to perform irrational atheist tricks.  One can only imagine how hysterical the guy’s response would have been if he’d actually read the book and encountered the line about “assuming that one equates education with pieces of paper collected from paper-selling institutions.”</p><p>UPDATE – Instapundit hasn’t read it yet, but <a href=\"http://instapundit.com/archives2/014418.php\">reaches an accurate conclusion</a> nevertheless: <i>IN THE MAIL: Blogger Vox Day’s The Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens. Judging from the jacket copy, it’s not so much pro-God as anti-atheist.</i></p></div>",
  "content_text": "And\nfamiliarizes herself with an eminently fascinating tome\n:\nI spent part of the day reading Vox Day’s new book,\nThe Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens\n. You might know Vox Day from his blog and interesting take on feminist issues–he always has something provocative to add to that particular conversation and his book proves to be just as stimulating in regards to religion and faith….  The book is definitely thought provoking and worth a read if you are interested in the topic!\nAs you’ve probably seen from the post down the page, it didn’t take long for a clueless atheist – apparently a university professor in this case – to read her post and be inspired to perform irrational atheist tricks.  One can only imagine how hysterical the guy’s response would have been if he’d actually read the book and encountered the line about “assuming that one equates education with pieces of paper collected from paper-selling institutions.”\nUPDATE – Instapundit hasn’t read it yet, but\nreaches an accurate conclusion\nnevertheless:\nIN THE MAIL: Blogger Vox Day’s The Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens. Judging from the jacket copy, it’s not so much pro-God as anti-atheist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-23T10:44:00+00:00"
}