{
  "url": "https://voxday.net/2008/01/02/excellence-in-literary-auto-eroticis/",
  "scraped_at": "2026-01-08T22:05:54.586872",
  "title": "Excellence in literary auto-eroticism",
  "date_display": "January 2, 2008",
  "date_iso": "2008-01-02T05:33:00+00:00",
  "date_from_url": "2008-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of my disdain for all things New York, these are the ten books that the New York Times claims were <a href=\"http://www.nytimes.com/2007/12/09/books/review/10-best-2007.html?_r=1&amp;oref=slogin\">the best books of 2007</a>.  I leave it to you to determine whose description of them is more accurate:</p><blockquote><p><i>Fiction aka Thinly Disguised Autobiography</i></p><p>MAN GONE DOWN<br>By Michael Thomas. A black writer writes about how hard life is for a black writer.</br></p><p>OUT STEALING HORSES<br>By Per Petterson. Translated by Anne Born.  A Norwegian writer writes about how hard life is for a Norwegian writer.  This masterful epitome of Scandinavian literature goes a long way towards explaining why all literate Scandinavians drink heavily.</br></p><p>THE SAVAGE DETECTIVES<br>By Roberto Bolaño. Translated by Natasha Wimmer.  A whacky writer writes whackily about the whacky shenanigans of some whacky writers. The so-called “romp” entirely fails to be even moderately amusing.</br></p><p>THEN WE CAME TO THE END<br>By Joshua Ferris. A writer who desperately wishes he’d been a part of the dot com boom indulges in literary schadenfreude about how life may look easy for investment bankers and technology executives, but actually, it’s hard.  At least he wishes it was.</br></p><p>TREE OF SMOKE<br>By Denis Johnson. A writer who has never felt truly alive since protesting the Vietnam War ended writes about how hard he imagines life must have been for those who fought in the Vietnam War.</br></p><p><i>Nonfiction</i></p><p>IMPERIAL LIFE IN THE EMERALD CITY: Inside Iraq’s Green Zone.<br>By Rajiv Chandrasekaran. A Washington Post journalist who visited the Green Zone for a week writes about how frightening and scary life is inside the Green Zone.  Also, it’s hard on visitors.</br></p><p>LITTLE HEATHENS: Hard Times and High Spirits on an Iowa Farm During the Great Depression. By Mildred Armstrong Kalish. An white woman from Iowa has to reach back almost sixty years in order to write about how hard life is for a white woman in Iowa.</p><p>THE NINE: Inside the Secret World of the Supreme Court.<br>By Jeffrey Toobin. Doubleday, $27.95. A Washington lawyer writes about a law court in Washington DC.  No one who isn’t a Washington lawyer cares.</br></p><p>THE ORDEAL OF ELIZABETH MARSH: A Woman in World History.<br>By Linda Colley. A woman no one has ever heard of writes about how life was hard for an 18th century woman that no one has ever heard of.  No one cares.</br></p><p>THE REST IS NOISE: Listening to the Twentieth Century.<br>By Alex Ross. Farrar, Straus &amp; Giroux, $30. The New Yorker’s music critic writes about music that was played in New York City at one time or another.  No one outside of New York City cares.</br></p></blockquote><p>You have to admit, after perusing this list, that whole concept of a post-literate culture suddenly isn’t looking so terrible after all.</p></div>",
  "content_text": "Speaking of my disdain for all things New York, these are the ten books that the New York Times claims were\nthe best books of 2007\n.  I leave it to you to determine whose description of them is more accurate:\nFiction aka Thinly Disguised Autobiography\nMAN GONE DOWN\nBy Michael Thomas. A black writer writes about how hard life is for a black writer.\nOUT STEALING HORSES\nBy Per Petterson. Translated by Anne Born.  A Norwegian writer writes about how hard life is for a Norwegian writer.  This masterful epitome of Scandinavian literature goes a long way towards explaining why all literate Scandinavians drink heavily.\nTHE SAVAGE DETECTIVES\nBy Roberto Bolaño. Translated by Natasha Wimmer.  A whacky writer writes whackily about the whacky shenanigans of some whacky writers. The so-called “romp” entirely fails to be even moderately amusing.\nTHEN WE CAME TO THE END\nBy Joshua Ferris. A writer who desperately wishes he’d been a part of the dot com boom indulges in literary schadenfreude about how life may look easy for investment bankers and technology executives, but actually, it’s hard.  At least he wishes it was.\nTREE OF SMOKE\nBy Denis Johnson. A writer who has never felt truly alive since protesting the Vietnam War ended writes about how hard he imagines life must have been for those who fought in the Vietnam War.\nNonfiction\nIMPERIAL LIFE IN THE EMERALD CITY: Inside Iraq’s Green Zone.\nBy Rajiv Chandrasekaran. A Washington Post journalist who visited the Green Zone for a week writes about how frightening and scary life is inside the Green Zone.  Also, it’s hard on visitors.\nLITTLE HEATHENS: Hard Times and High Spirits on an Iowa Farm During the Great Depression. By Mildred Armstrong Kalish. An white woman from Iowa has to reach back almost sixty years in order to write about how hard life is for a white woman in Iowa.\nTHE NINE: Inside the Secret World of the Supreme Court.\nBy Jeffrey Toobin. Doubleday, $27.95. A Washington lawyer writes about a law court in Washington DC.  No one who isn’t a Washington lawyer cares.\nTHE ORDEAL OF ELIZABETH MARSH: A Woman in World History.\nBy Linda Colley. A woman no one has ever heard of writes about how life was hard for an 18th century woman that no one has ever heard of.  No one cares.\nTHE REST IS NOISE: Listening to the Twentieth Century.\nBy Alex Ross. Farrar, Straus & Giroux, $30. The New Yorker’s music critic writes about music that was played in New York City at one time or another.  No one outside of New York City cares.\nYou have to admit, after perusing this list, that whole concept of a post-literate culture suddenly isn’t looking so terrible after all.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-02T05:33:00+00:00"
}