{
  "url": "https://voxday.net/2008/01/16/first-tia-reviews/",
  "scraped_at": "2026-01-08T22:07:55.946099",
  "title": "The first TIA reviews appear",
  "date_display": "January 16, 2008",
  "date_iso": "2008-01-16T11:47:00+00:00",
  "date_from_url": "2008-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Attention all one-star-rating, non-reading “reviewers”… you may now <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1200483996&amp;sr=1-1\">start your engines</a>:</p><blockquote><p><b>Digital Cowboy</b> writes: <i>“I read this book in a very short time because I couldn’t let go of it. I had high expectations for this book and Vox managed to exceed them. It was far more humorous than I expected, for one. I’ve always loved his writing style and I particularly enjoy the irreverence. I’ve described it to others as “what most people would call arrogance but as we say in Texas, ‘It ain’t braggin’ if ya done it.'”  With this book Vox did it. It’s an irrefutable case that he makes largely because he avoids the silly mistakes most Christians make when responding to atheists – primarily, appealing to authority that they don’t recognize. Vox says in the preface that he will battle them on their terms – their chosen ground of logic and reason – and he does it overwhelmingly and convincingly….  I almost feel sorry for his targets. He’s left them no wiggle room at all.</i></p><p><b>D. Christensen</b> writes: <i>This is not just a polemic against the New Atheists; the best part is that for each of the subjects he lists some glaring logical and factual errors….  Harris, et al, have really got their credibility on the line now, and they are going to have to respond. If they don’t, that ommission will be just as glaring.</i></p></blockquote><p>I’m very pleased to see that a certain theme appears to be emerging in the various reviews beyond, “hey, I liked it”.  I did not set out to write a Christian apologetic, but rather an entirely secular assault and readers appear to be grasping that.  One of the pre-release readers, a fellow BenBella author named Read Mercer Schuchardt, an Assistant Professor of Communication at Wheaton College, had this to say about TIA: <i>“Day’s work is a healthy kick in the head to the comfortably numb. Using their own claims against them, he uses logic, reason, and rhetoric to reveal that atheists are the new fanatics, and that we should all—religious or irreligious— be very wary of their schemes. G. K. Chesterton once remarked that without God, there would be no atheists; Day updates this by showing how atheism itself is an evolutionary dead-end. A provocative, gutsy, and in-your-face book, but eminently enjoyable reading.”</i></p><p>Please note that posting these reviews should not be interpreted as a hint to order the book from Amazon today.  It’s Saturday that would be the ideal time to do so if you happen to feel so moved.</p><p>By the way, please don’t worry that this blog is going to turn into an all-TIA, all-the-time hair-braiding fest.  Yes, there will probably be a fair amount of posts related to it over the next week or two, but if you’re not interested in the subject, don’t worry, there will be even more posts on other, unrelated subjects as well.</p><p>UPDATE – Amazon must be policing its reviews and tag associations.  I just noticed that TIA is no longer associated with “crap”, “total inanity” and “doughy pantload”.  I always thought those associations were interesting considering that the book wasn’t even available yet although I have to admit, I did find the behavior to be most amusing on the part of such a rational, intelligent, and open-minded collection of highly evolved primates.</p></div>",
  "content_text": "Attention all one-star-rating, non-reading “reviewers”… you may now\nstart your engines\n:\nDigital Cowboy\nwrites:\n“I read this book in a very short time because I couldn’t let go of it. I had high expectations for this book and Vox managed to exceed them. It was far more humorous than I expected, for one. I’ve always loved his writing style and I particularly enjoy the irreverence. I’ve described it to others as “what most people would call arrogance but as we say in Texas, ‘It ain’t braggin’ if ya done it.'”  With this book Vox did it. It’s an irrefutable case that he makes largely because he avoids the silly mistakes most Christians make when responding to atheists – primarily, appealing to authority that they don’t recognize. Vox says in the preface that he will battle them on their terms – their chosen ground of logic and reason – and he does it overwhelmingly and convincingly….  I almost feel sorry for his targets. He’s left them no wiggle room at all.\nD. Christensen\nwrites:\nThis is not just a polemic against the New Atheists; the best part is that for each of the subjects he lists some glaring logical and factual errors….  Harris, et al, have really got their credibility on the line now, and they are going to have to respond. If they don’t, that ommission will be just as glaring.\nI’m very pleased to see that a certain theme appears to be emerging in the various reviews beyond, “hey, I liked it”.  I did not set out to write a Christian apologetic, but rather an entirely secular assault and readers appear to be grasping that.  One of the pre-release readers, a fellow BenBella author named Read Mercer Schuchardt, an Assistant Professor of Communication at Wheaton College, had this to say about TIA:\n“Day’s work is a healthy kick in the head to the comfortably numb. Using their own claims against them, he uses logic, reason, and rhetoric to reveal that atheists are the new fanatics, and that we should all—religious or irreligious— be very wary of their schemes. G. K. Chesterton once remarked that without God, there would be no atheists; Day updates this by showing how atheism itself is an evolutionary dead-end. A provocative, gutsy, and in-your-face book, but eminently enjoyable reading.”\nPlease note that posting these reviews should not be interpreted as a hint to order the book from Amazon today.  It’s Saturday that would be the ideal time to do so if you happen to feel so moved.\nBy the way, please don’t worry that this blog is going to turn into an all-TIA, all-the-time hair-braiding fest.  Yes, there will probably be a fair amount of posts related to it over the next week or two, but if you’re not interested in the subject, don’t worry, there will be even more posts on other, unrelated subjects as well.\nUPDATE – Amazon must be policing its reviews and tag associations.  I just noticed that TIA is no longer associated with “crap”, “total inanity” and “doughy pantload”.  I always thought those associations were interesting considering that the book wasn’t even available yet although I have to admit, I did find the behavior to be most amusing on the part of such a rational, intelligent, and open-minded collection of highly evolved primates.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-16T11:47:00+00:00"
}