{
  "url": "https://voxday.net/2008/01/04/huck-and-magic-negro/",
  "scraped_at": "2026-01-08T22:06:16.585567",
  "title": "Huck and the Magic Negro",
  "date_display": "January 4, 2008",
  "date_iso": "2008-01-04T13:20:00+00:00",
  "date_from_url": "2008-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Iowa was a big win for both Mike Huckabee and Barack Obama.  Of the two winners, I think Huckabee has a better chance of riding Iowa momentum onto victory, but time will tell.  Obama’s upset of Hillary Clinton is certainly a pleasant surprise, as anything that sets back the Lizard Queen is good news for everyone, but I still think he’s ultimately competing for a VP slot rather than representing a genuine threat to the anointed one.  Setback and triumphant comeback makes for a much better story than a grim and uneventful march to the Cherry Blossom Throne, after all.</p><p>The best thing about Huckabee’s ascendance, however temporary, is summarized by David Brooks in the New York Times.  He writes in <a href=\"http://www.nytimes.com/2008/01/04/opinion/04brooks.html?_r=1&amp;hp&amp;oref=slogin\">“The Two Earthquakes”</a>:</p><blockquote><p>While Romney embodies the leadership class, Huckabee went after it. He criticized Wall Street and K Street. Most importantly, he sensed that conservatives do not believe their own movement is well led. He took on Rush Limbaugh, the Club for Growth and even President Bush. The old guard threw everything they had at him, and their diminished power is now exposed.</p></blockquote><p>Huckabee is no lover of freedom and it’s no accident that those who still think well of George W. Bush overwhelmingly supported him, but it’s impossible to mourn the declining influence of the Republican elite that championed Bush the Elder, Bob Dole and Bush the Younger.  I’ve long had the impression that WND reached more Republicans than NRO, the fact that the Chuck Norris-endorsed candidate absolutely trounced the National Review-approved one despite being heavily outspent tends to support this notion, at least for one week.  A Huckabee upset in New Hampshire would confirm the hypothesis that the old guard has completely lost touch with the general party.</p><p>While I’m disappointed that Ron Paul didn’t do better – although he did outperform most pre-caucus media polls and did well enough to stay in the game – I’m not surprised.  Freedom is a tough sell in this day and age.  And there’s no reason to feel upset about the average voter’s unwillingness to interfere with the status quo or stand up for an oft-violated Constitution, especially not in light of this old Chinese poem from <i>Romance of the Three Kingdoms</i></p><p><i>The rebel Tung conceived the foul design<br>To thrust the king aside and wrong his line.<br>With folded arms, the courtiers stood, save one<br>Ting Kuan, who dared to cry that wrong was done.</br></br></br></i></p><p>It should hardly be necessary to inform the reader who is wise to the ways of this world that Ting Kuan “was removed and summarily put to death.”  The luxurious chains that Americans wear will always chafe those who love liberty, but it must also be recognized that they are far from the worst that humanity has endured.</p><p>By the way, here’s the results.  It’s telling that Fox will permit Giuliani, whose actual votes are down around where the polls have long suggested Paul’s would be, to participate in the pre-New Hampshire debate.  Yes, I know Giuliani “isn’t competing” in Iowa or New Hampshire, but if he’s not competing there, then why allow him to participate?  He isn’t competing because he isn’t competitive there, and my guess is that he will be equally uncompetitive in a lot of other states soon.</p><p>34 Huckabee<br>25 Romney<br>13 Thompson<br>13 McCain<br>10 Paul<br>03 Giuliani</br></br></br></br></br></p><p>38 Obama<br>30 Edwards<br>29 Clinton<br>02 Richardson<br>01 Biden</br></br></br></br></p></div>",
  "content_text": "Iowa was a big win for both Mike Huckabee and Barack Obama.  Of the two winners, I think Huckabee has a better chance of riding Iowa momentum onto victory, but time will tell.  Obama’s upset of Hillary Clinton is certainly a pleasant surprise, as anything that sets back the Lizard Queen is good news for everyone, but I still think he’s ultimately competing for a VP slot rather than representing a genuine threat to the anointed one.  Setback and triumphant comeback makes for a much better story than a grim and uneventful march to the Cherry Blossom Throne, after all.\nThe best thing about Huckabee’s ascendance, however temporary, is summarized by David Brooks in the New York Times.  He writes in\n“The Two Earthquakes”\n:\nWhile Romney embodies the leadership class, Huckabee went after it. He criticized Wall Street and K Street. Most importantly, he sensed that conservatives do not believe their own movement is well led. He took on Rush Limbaugh, the Club for Growth and even President Bush. The old guard threw everything they had at him, and their diminished power is now exposed.\nHuckabee is no lover of freedom and it’s no accident that those who still think well of George W. Bush overwhelmingly supported him, but it’s impossible to mourn the declining influence of the Republican elite that championed Bush the Elder, Bob Dole and Bush the Younger.  I’ve long had the impression that WND reached more Republicans than NRO, the fact that the Chuck Norris-endorsed candidate absolutely trounced the National Review-approved one despite being heavily outspent tends to support this notion, at least for one week.  A Huckabee upset in New Hampshire would confirm the hypothesis that the old guard has completely lost touch with the general party.\nWhile I’m disappointed that Ron Paul didn’t do better – although he did outperform most pre-caucus media polls and did well enough to stay in the game – I’m not surprised.  Freedom is a tough sell in this day and age.  And there’s no reason to feel upset about the average voter’s unwillingness to interfere with the status quo or stand up for an oft-violated Constitution, especially not in light of this old Chinese poem from\nRomance of the Three Kingdoms\nThe rebel Tung conceived the foul design\nTo thrust the king aside and wrong his line.\nWith folded arms, the courtiers stood, save one\nTing Kuan, who dared to cry that wrong was done.\nIt should hardly be necessary to inform the reader who is wise to the ways of this world that Ting Kuan “was removed and summarily put to death.”  The luxurious chains that Americans wear will always chafe those who love liberty, but it must also be recognized that they are far from the worst that humanity has endured.\nBy the way, here’s the results.  It’s telling that Fox will permit Giuliani, whose actual votes are down around where the polls have long suggested Paul’s would be, to participate in the pre-New Hampshire debate.  Yes, I know Giuliani “isn’t competing” in Iowa or New Hampshire, but if he’s not competing there, then why allow him to participate?  He isn’t competing because he isn’t competitive there, and my guess is that he will be equally uncompetitive in a lot of other states soon.\n34 Huckabee\n25 Romney\n13 Thompson\n13 McCain\n10 Paul\n03 Giuliani\n38 Obama\n30 Edwards\n29 Clinton\n02 Richardson\n01 Biden",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-04T13:20:00+00:00"
}