{
  "url": "https://voxday.net/2008/01/19/in-defense-of-burning-widows/",
  "scraped_at": "2026-01-08T22:08:28.962105",
  "title": "In defense of burning widows",
  "date_display": "January 19, 2008",
  "date_iso": "2008-01-19T10:14:00+00:00",
  "date_from_url": "2008-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Regarding an article – by a woman, of course – which complains that <a href=\"http://drhelen.blogspot.com/2008/01/its-payback-time-for-that-damn.html\">men are retiring too soon</a> to give their wives the ability to sit around and do nothing after they are dead:</p><blockquote><p>Yes, those troublesome men. They die earlier than women and therefore should work longer to provide for their merry widow in retirement. Shouldn’t it be the other way around? It seems to me that if you are going to die sooner, you will have a shorter retirement to enjoy and therefore, you should retire sooner, not later. But, naturally, the writer looks at what is best for women, so guys, get back to work so your wife won’t have to.</p><p>Or on the other hand, maybe someone should suggest to wives that since their husbands will be supporting them long after they’re gone, maybe the wives should try to make the few years their husbands have remaining a bit more pleasant.</p></blockquote><p>Now, I fully expect to give my family the means to provide for themselves long after I have departed the premises.  I believe it’s the right thing to do and I think the British ban on widow-burning not only made for a great story – “we have a tradition too….” – but was a meaningful expansion of Western civilization.  Still, reading that matriarchal advocate’s obnoxious article is enough to make the most sensitive over-feminized male Democrat wonder if perhaps the Hindus might have had a point with that whole <i>suttee</i> thing.</p></div>",
  "content_text": "Regarding an article – by a woman, of course – which complains that\nmen are retiring too soon\nto give their wives the ability to sit around and do nothing after they are dead:\nYes, those troublesome men. They die earlier than women and therefore should work longer to provide for their merry widow in retirement. Shouldn’t it be the other way around? It seems to me that if you are going to die sooner, you will have a shorter retirement to enjoy and therefore, you should retire sooner, not later. But, naturally, the writer looks at what is best for women, so guys, get back to work so your wife won’t have to.\nOr on the other hand, maybe someone should suggest to wives that since their husbands will be supporting them long after they’re gone, maybe the wives should try to make the few years their husbands have remaining a bit more pleasant.\nNow, I fully expect to give my family the means to provide for themselves long after I have departed the premises.  I believe it’s the right thing to do and I think the British ban on widow-burning not only made for a great story – “we have a tradition too….” – but was a meaningful expansion of Western civilization.  Still, reading that matriarchal advocate’s obnoxious article is enough to make the most sensitive over-feminized male Democrat wonder if perhaps the Hindus might have had a point with that whole\nsuttee\nthing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-19T10:14:00+00:00"
}