{
  "url": "https://voxday.net/2008/01/07/interview-with-jonah-goldberg/",
  "scraped_at": "2026-01-08T22:06:36.754353",
  "title": "Interview with Jonah Goldberg",
  "date_display": "January 7, 2008",
  "date_iso": "2008-01-07T08:00:00+00:00",
  "date_from_url": "2008-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed Jonah Goldberg, author of <a href=\"”http://www.amazon.com/Liberal-Fascism-American-Mussolini-Politics/dp/0385511841”\">Liberal Fascism: The Secret History of the American Left, From Mussolini to the Politics of Meaning</a>, on December 29th.</i></p><p><b>Let’s start with the title of <i>Liberal Fascism</i>.  You derived it from H.G. Wells, who you point out was not only known as a science fiction author but also as an important public intellectual responsible for coining the term.  When you look at  science fiction, there’s often an underlying assumption that mankind will be unified in the future.  Is this fascist aspect of science fiction also an inheritance from H.G. Wells?</b></p><p>I think what makes the best science fiction, what distinguishes good science fiction from bad science fiction, is that the technology and the futuristic setting are mechanisms by which we highlight certain eternal truths.  The gizmos and all that stuff, they tickle our fancy, but at the end of the day, when science fiction is actually literature, it is pointing to the fact that human nature has no history.  Human beings are still human beings and these new contexts elucidate certain truths that perhaps we can’t see embedded in our everyday lives, but come to the fore when put against a new backdrop.   It’s one of the most important things about good science fiction, it’s one of the things I love about the Dune books, for example.</p><p>That said, there is a fundamental human desire to recreate the feeling of the tribe.  In fact, that informs my total view about fascism, communism and all of the other forms of totalitarianism, as they are fundamentally reactionary in their desire to recreate with the State that sense of belonging and meaning that in primordial times we got from the tribe.  It’s essentially modern tribalism.  In a lot of science fiction, you get this desire to imagine a future where there is this Parliament of Man and we are all one human tribe amidst a lot of alien tribes scattered throughout the universe.  There is a fascistic impulse in that desire, there’s a utopian desire to recreate that sense of belonging to a Brotherhood of Man that comes out in a lot of science fiction.  I wouldn’t want to swear that it all comes out of H.G. Wells, though, I don’t know his fictional ouvre that well.</p><p><b>You drew an important connection between fascism and the Social Gospel of the American progressives as well as Hillary Clinton’s “politics of meaning”.  That leaped out at me, since after quoting Gentile about “the sacralization of politics,  Giordano Bruno Guerri wrote in <a href=\"http://www.librimondadori.it/web/mondadori/scheda-libro?isbn=978880442117&amp;autoreUUID=556de7c9-9ea9-11dc-9517-454a8637094f\">Fascisti</a> that “Fascism was the first experiment in institutionalizing this new secular religion since the time of the French Revolution.”  Isn’t this Italian perspective on Italian Fascism practically identical to what you’re saying about the broader fascism and its connection to Clinton and the progressives?</b></p><p>Yeah, I wanted to get into a lot of Eric Voegelin and all that in the book, but my publisher kept saying this is highbrow enough, we don’t want to scare away readers.  I’m very much in the Voegelin camp about how what unites what we call modern liberalism, progressivism, socialism, all of these isms, is the desire to immanentize the eschaton, the desire to sacralize life through politics, technology and the State’s manipulation of technology.  That was explicit in a lot of the Fascist intellectuals around Mussolini and it was explicit in a lot of the ideologues around Hitler as well.  The Nazis – I shouldn’t say all since it was a more ideologically heterodox movement than you might think – a lot of them wanted to replace the Bible with Mein Kampf, to change Christmas carols and call Hitler “the Redeemer” and so forth.</p><p>In pre-modern times, the tribe was not merely a political institution.  The notion of politics as we understand it today is a very modern one.  The tribe was a religious institution as much as anything else and the distinction between religion and politics was very small.  Everything from ancestor worship to the deification of the collective to the belief in a chosen people and all of the rest, these things are rich in the concept of tribalism.  Eugene Weber has this great passage about the fascist dictator, primarily Mussolini, where he no longer believes in God but he still believes he is elected by a cause greater than himself and he can’t figure out, if it’s not God, then who has anointed him?  For some, it’s cold historical forces, for others it’s destiny, but it’s this religious impulse that manifests itself through fascist politics.  Among scholars, that concept is almost not controversial anymore.  Michael Burleigh has done some great work recently on this sacralization of politics.</p><p><b>You know, Guerri says the reason the Fascist regime was less dramatic than the German and Soviet regimes was because Italians were weak Catholics.  So when they replaced their religion with the secular religion, they became weak Fascists as well.</b></p><p>I think that’s right.  Michael Ledeen has many detractors when it comes to contemporary politics, but he was a very serious scholar of Italian Fascism in his previous career.  One of the things that first got me interested in this topic was over ten years ago when Ledeen gave a talk at AEI.  It was very interesting and at the end, a buddy of mine turned to me and said: “I think what he is saying is that Nazism was really bad because they had the Black Forest and terrible weather, and Italian Fascism wasn’t that bad because the Italians are a bunch of nice people.”  That’s a really grotesque way to put it, and yet there’s a certain truth there.  These sorts of isms are going to bring out the character of a people.  No idea so sets fire to the minds of men that it erases their culture, their background, or their fundamental psychological understanding of the world.  Certainly not on a mass scale.</p><p><b>It’s very Eddie Izzard: “We are all Fascists now…. ciao!”</b></p><p>There’s a story that Ledeen tells about a restaurant.  One of the things that Mussolini did in this very Jamesian way was to declare all of these domestic policy wars, these moral equivalents of war.  There was the Battle of the Grains and the Battle of the Births, and one of them was the Battle of the Flies, because there was so much disease going around Italy back then.  Anyhow, this guy goes into a restaurant and sees there’s flies all over the place, so he asks what’s going on with the war against them.  The waiter says “well, the flies won.”  That’s a very Italian perspective.  One of the things I learned while writing the book is that there’s this glib association of fascism with anti-semitism, and while one can’t say that the Italians were completely blameless in that regard, at the end of the day, anti-semitism was just completely contrary to Italian history and culture.  Italy was polyglot, multi-ethnic and Catholic, so whatever anti-semitism was there was theological, not biological; the Catholic Church’s position was that Jews could be saved, not that they should be eradicated like vermin.  I wanted to do an entire chapter on this but it was just too far afield.  The heroism and decency of thousands upon thousands of Italians when it came to the Jews is one of the incredibly untold stories of that era.  Anti-semitism and Italian Fascism are just not kindred phenomena.</p><p><b>Some of your critics focus on the fact that you’re not an academic, so should the fact that no book like this has been written in the sixty years since the end of the Fascist regime be taken as evidence that you’re just smoking crack, or is it an indictment of the academy?</b></p><p>Since I’m currently not smoking crack, I personally take it as an indictment of the academy.  I plead absolutely guilty that I’m not an academic, I mean, how am I going to deny that?  I thi<br> nk there’s a certain guild mentality that comes into play where a lot of academics try to shoot the messenger and say the substance of what I have to say doesn’t matter because I don’t carry the right guild card in my wallet.</br></p><p>My Dad, who died two years ago, never finished his PhD but he had a Master’s in philosophy, he was working on his PhD in East European history and he was a serious Jewish intellectual autodidact.  I grew up having conversations with him about this stuff from a very young age and I’ve always been interested in it.  I think it is a fascinating commentary on academia that  I had to learn about most of this stuff from non-academics.  There’s a lot of this in Paul Johnson and in Ledeen, and there are a few academics who have made some of these points, James Gregor has, Josh Muravchik’s <i>History of Socialism</i> was very useful for a lot of this stuff.  Basically, this just doesn’t fit into the group-think and so you get bludgeoned for daring to say that the emperor has no clothes.</p><p>As Tom Wolfe said in the blurb for the book, it’s the greatest hoax in modern history that we were convinced that Fascism and National Socialism were phenomena of the Right.  I take it as a badge of honor that I’m not an academic, shame on them that no one else has written this book.</p><p><b>What did you mean when you said that it’s not an Ann Coulter book in <a href=\"http://politicscentral.com/2007/12/27/the_glenn_and_helen_show_jonah.php\">your interview on the Glenn &amp; Helen Show</a>?</b></p><p>It’s a response to this jabbering fraction of a man named <a href=\"http://www.slate.com/id/2149119/\">Tim Noah at Slate</a> who has been insisting for about four years, sight unseen, that I have written what he calls an Ann Coulter book.  And by that I mean a bomb-throwing book that sheds heat, not light.  Now, I think there’s a place for them and I think there’s more serious argumentation in Ann Coulter’s books than a lot of people on the Left are willing to concede because they don’t want to give her arguments any credence.  But at the same time, it is indisputable that Ann is something of a performance artist.  She is most useful for entertaining people who already agree with her and for providing ammunition and morale to her side.  She does not go into a college lecture hall and persuade very many people who are sitting on the fence on an issue.</p><p>I didn’t want to write that kind of book.  Ramesh Ponnuru has been a great influence on me and one of the things he often says is that he is much more interested in dealing with liberalism’s best arguments rather than its worst ones.  I think a lot of people on the Right, a lot of people in punditry generally, have gotten very comfortable playing these games of simply looking for the weakest link in the other side’s chain and entirely ignoring the stronger ones.  This book is aimed at the strongest links, or at least that’s what my intent was.  I’ll leave it to other people to decide how successful I was.</p><p><b>I think the most interesting thing about your book is that despite the fact that you’ve been writing as a political pundit for some time now – in fact, one could even argue that you’re the most significant right-wing pundit of our generation at this point – you’ve actually managed to write a book that is intellectually serious.  Few of your peers have done so.  Is that because they’re just too accustomed to focusing on the weak link or is there another reason?</b></p><p>Actually, I just discovered in course of preparing the promotional stuff that I am the most widely syndicated columnist in America under the age of forty.</p><p><b>I believe it.  My WND column was briefly syndicated by Universal Press Syndicate.  I think the Dallas Morning News picked it up for about two seconds before one of their editors actually read it and ran away scared.</b></p><p>That should tell you something.  There are sacrifices that have to be made to write a broadly syndicated column in terms of highfalutiness and so forth, you have to just sort of say what you’re going to say and get out.  It’s only when you reach a certain level, like George Will has, that you can start writing above your readers.  But it’s very difficult to get there unless you pitch it at a broader level.</p><p><b>Back to the question.  Why have you been able to do what so many other pundits have demonstrably been unable to do with their books?</b></p><p>There are some political pundits who have written serious books, it kind of depends how you define pundit.  Tom Sowell has written some great books.  I think <a href=\"http://www.amazon.com/Party-Death-Democrats-Courts-Disregard/dp/1596980044/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1199622297&amp;sr=8-1\">Party of Death</a> was a very good book and it was treated very shabbily by a lot of people.  But I generally agree with you, there is something going on out there and I think part of it has to do with the nature of publishing and how the influence of talk radio has changed publishing in a lot of ways.  A lot of people buy books to have them rather than to read them, so the pressure on authors to write serious books is much lower than it used to be.  When there was a misprint in one of Andrew Sullivan’s books and the first half of chapter six and the second half of chapter seven were interposed or whatever for something like half of the print run, the publishers didn’t want to recall the book because they thought it didn’t really matter at that point.  People are selling books as conversation pieces and they often go unread.  I don’t want to be too invidious about other columnists’ books, but what motivated me was the thought that you only write your first book once.</p><p>I kind of fell backwards into punditry and I’ve had this rap from my detractors for a very long time about how I’m not a serious guy and there’s all this idiotic stuff, really fact-free, about nepotism and whatnot, so I had something to prove.  My Dad died in 2005, he was an enormous influence on me and I wanted to write a book that he would be proud of.  It’s dedicated to him.  I could have done a column book or I could have done a humor book a long time ago.  I had offers to do books on the Clinton scandal thanks to my notoriety there and I turned them all down because I wanted to write a real book instead.  I think conservatism generally is suffering from a dearth of real books.  Forget syndicated columnists per se, there’s just this glut of smashmouth books out there that don’t tackle hard things.  It’s been a long time since <i>The Closing of the American Mind</i>.  I went with an editor in Adam Bellow who has a serious track record with serious books, and gave him the first option because I wanted to work with him.  He had a specific mission to keep me from going too gonzo and all the rest, keeping me focused on what I wanted to do and I’m very grateful to him for it.  I just had the fire in the belly to write a serious book and I hope that’s what I’ve done.</p><p><b>It’s interesting that you should mention <a href=\"http://www.amazon.com/Closing-American-Mind-Allan-Bloom/dp/0671657151\">The Closing of the American Mind</a> because one of the things that struck me as I was reading <i>Liberal Fascism</i> is that this is potentially one of the most important political books since that because it’s such a fundamentally necessary book for people to understand the political spectrum.  That’s why I was so enthusiastic about it.  Now, speaking stylistically, was the reason for the biographical approach in place of a more methodical one intended as a commentary on the ideology itself or did you have some other reason for it?</b></p><p>There’s a couple different reasons.  It was going to be a long book and people need a narrative, they need a story to hang those concepts on.  Adam and I struggled with this a lot, because I really wanted to do all sorts of stuff about the French Revolution, on the Social Gospel, and dive into these more ideational discussions, but as an editor, Adam just kept saying that while it’s fine to touch on that kind of stuff,  yo<br> u’ve got to hang it off of someone’s saddlebag.  The reader needs a narrative arc to follow some of these things.  We also get into a lot of conceptual trouble when we start thinking about ideas being things in and of themselves, separate from human-lived lives.  So much of fascism and the Left’s understanding of fascism is informed by this emotional understanding of human nature.  The fascist personality type and all that, the idea that conservatives are mentally hard-wired to be fascistic.</br></p><p><b>The Authoritarian Mind</b></p><p>Yeah, exactly!  Since this is the way people think about these things, it’s very useful to actually look at the personifications of these phenomenons and talk about them as real human beings and show where that person, the actual person who personifies these ideas, actually lived on the ideological spectrum, what actions he took and how we would view them in today’s context.  Otherwise, you get into a lot of trouble cherry-picking.  I wanted to concentrate on the people who personified these ideas.  No one is going to deny Hitler was a Nazi.  No one is going to deny that Mussolini was an Italian Fascist.  Focusing on them allowed me to nail down a lot of things that otherwise might have gotten lost.</p><p><b>So it wasn’t the brilliant metaphor for ideological pragmatism that I thought it might be?</b></p><p>Alas, no.</p><p><b>If libertarianism is the opposite of communism and fascism is founded on a cult of action, can’t we then conclude that inactivism is the polar opposite of fascism?</b></p><p>Yes!  I think that the fundamentally unfascistic insight that conservatism and libertarianism share is the idea that their political philosophies are only partial philosophies of life.  I know a lot of very socially conservative libertarians who go to church every week, are very strict with their kids and adhere to traditional moral values, but they’re libertarians!  Then you’ve got political conservatives, myself included, who are fairly libertine in their attitudes and their day-to-day lives, but they have a certain view about how politics should be ordered.  That is the unfascistic thing, we see politics as only one small sphere of life.  What unites fascism, communism and all these other isms is this idea of holism, the idea that politics is a total philosophy of life, that the personal is political, that the State and the collective come before the individual, and that the warp and woof of daily life should be informed by political imperatives.</p><p><b>Tutto nello stato, niente al di fuori dello stato, nulla contro lo stato.</b></p><p>Everything inside the State, nothing outside the State.</p><p><b>You mentioned that writing <i>Liberal Fascism</i> has made you more libertarian.  How did that come about?</b></p><p>One of the things I’ve really come to appreciate is the importance of dogma.  There need to be some taboos, some fundamental dogmatic roadblocks.  One of the things that writing this book has reinforced in me is that it is always safe to bet that government involvement is a bad idea.  That may not always be the case, but the burden of proof always has to be on the other guy to demonstrate why the government should get involved.  The first-do-no-harm principle is strong.  I still call myself a conservative,, though, I am a conservative, and I believe in the importance of tradition that Hayek is okay with and a lot of contemporary libertarians aren’t.  One of the things that kind of scares me about what’s happening the Right these days is that we’re getting into this right-wing progressivism, this right-wing Social Gospel and a lot of people have made their peace with the idea of a big activist government so long as it’s activist in the direction of so-called conservative values.  I think that is a really dangerous game.</p><p><b>You talk about the temptation of conservatives towards the end of the book.  Is it imperial neoconservatism, heroic strong government conservatism or compassionate conservatism that represents the greatest fascistic temptation to conservatives?</b></p><p>I would say that it is heroic conservatism AND compassionate conservatism, since they are essentially the same thing.  Heroic conservatism is compassionate conservatism 2.0.  Or maybe heroic is version 1.5, and Mike Huckabee’s conservatism is 2.0.</p><p>The neoconservative thing is much more complicated.  I am very much open to a lot of the complaints about what has happened to so-called neoconservatism in recent years.  If the Iraq project hasn’t been a legitimate cause for introspection and a personal inventory of one’s mistakes, then you haven’t been paying attention.  But historically, neoconservatism, at least prior to 2000, was deeply informed by things like the Law of Unintended Consequences and the limits of reform.  So, I don’t think it’s particularly fascistic, although I think you could make a much stronger argument that it took a fascistic turn when we started getting into this national greatness stuff which is very remniscent of Herbert Crowley’s liberal New Nationalism of the World War I era.  But that national greatness conservatism is not neoconservatism, it is something different!  We get into this problematic area when we call Bill Kristol, David Brooks and these other guys neoconservatives and therefore say that neoconservatism means national greatness when that’s just simply not the case.</p><p>Bill Kristol never called himself a neocon.  Irving Kristol, who was a neocon, was never into national greatness, he never believed in that stuff and I don’t believe that neoconservatism is remotely fascistic.  It certainly pales in comparison to the stuff that we get from compassionate conservatism, anyhow.</p></div>",
  "content_text": "Vox Day interviewed Jonah Goldberg, author of\nLiberal Fascism: The Secret History of the American Left, From Mussolini to the Politics of Meaning\n, on December 29th.\nLet’s start with the title of\nLiberal Fascism\n.  You derived it from H.G. Wells, who you point out was not only known as a science fiction author but also as an important public intellectual responsible for coining the term.  When you look at  science fiction, there’s often an underlying assumption that mankind will be unified in the future.  Is this fascist aspect of science fiction also an inheritance from H.G. Wells?\nI think what makes the best science fiction, what distinguishes good science fiction from bad science fiction, is that the technology and the futuristic setting are mechanisms by which we highlight certain eternal truths.  The gizmos and all that stuff, they tickle our fancy, but at the end of the day, when science fiction is actually literature, it is pointing to the fact that human nature has no history.  Human beings are still human beings and these new contexts elucidate certain truths that perhaps we can’t see embedded in our everyday lives, but come to the fore when put against a new backdrop.   It’s one of the most important things about good science fiction, it’s one of the things I love about the Dune books, for example.\nThat said, there is a fundamental human desire to recreate the feeling of the tribe.  In fact, that informs my total view about fascism, communism and all of the other forms of totalitarianism, as they are fundamentally reactionary in their desire to recreate with the State that sense of belonging and meaning that in primordial times we got from the tribe.  It’s essentially modern tribalism.  In a lot of science fiction, you get this desire to imagine a future where there is this Parliament of Man and we are all one human tribe amidst a lot of alien tribes scattered throughout the universe.  There is a fascistic impulse in that desire, there’s a utopian desire to recreate that sense of belonging to a Brotherhood of Man that comes out in a lot of science fiction.  I wouldn’t want to swear that it all comes out of H.G. Wells, though, I don’t know his fictional ouvre that well.\nYou drew an important connection between fascism and the Social Gospel of the American progressives as well as Hillary Clinton’s “politics of meaning”.  That leaped out at me, since after quoting Gentile about “the sacralization of politics,  Giordano Bruno Guerri wrote in\nFascisti\nthat “Fascism was the first experiment in institutionalizing this new secular religion since the time of the French Revolution.”  Isn’t this Italian perspective on Italian Fascism practically identical to what you’re saying about the broader fascism and its connection to Clinton and the progressives?\nYeah, I wanted to get into a lot of Eric Voegelin and all that in the book, but my publisher kept saying this is highbrow enough, we don’t want to scare away readers.  I’m very much in the Voegelin camp about how what unites what we call modern liberalism, progressivism, socialism, all of these isms, is the desire to immanentize the eschaton, the desire to sacralize life through politics, technology and the State’s manipulation of technology.  That was explicit in a lot of the Fascist intellectuals around Mussolini and it was explicit in a lot of the ideologues around Hitler as well.  The Nazis – I shouldn’t say all since it was a more ideologically heterodox movement than you might think – a lot of them wanted to replace the Bible with Mein Kampf, to change Christmas carols and call Hitler “the Redeemer” and so forth.\nIn pre-modern times, the tribe was not merely a political institution.  The notion of politics as we understand it today is a very modern one.  The tribe was a religious institution as much as anything else and the distinction between religion and politics was very small.  Everything from ancestor worship to the deification of the collective to the belief in a chosen people and all of the rest, these things are rich in the concept of tribalism.  Eugene Weber has this great passage about the fascist dictator, primarily Mussolini, where he no longer believes in God but he still believes he is elected by a cause greater than himself and he can’t figure out, if it’s not God, then who has anointed him?  For some, it’s cold historical forces, for others it’s destiny, but it’s this religious impulse that manifests itself through fascist politics.  Among scholars, that concept is almost not controversial anymore.  Michael Burleigh has done some great work recently on this sacralization of politics.\nYou know, Guerri says the reason the Fascist regime was less dramatic than the German and Soviet regimes was because Italians were weak Catholics.  So when they replaced their religion with the secular religion, they became weak Fascists as well.\nI think that’s right.  Michael Ledeen has many detractors when it comes to contemporary politics, but he was a very serious scholar of Italian Fascism in his previous career.  One of the things that first got me interested in this topic was over ten years ago when Ledeen gave a talk at AEI.  It was very interesting and at the end, a buddy of mine turned to me and said: “I think what he is saying is that Nazism was really bad because they had the Black Forest and terrible weather, and Italian Fascism wasn’t that bad because the Italians are a bunch of nice people.”  That’s a really grotesque way to put it, and yet there’s a certain truth there.  These sorts of isms are going to bring out the character of a people.  No idea so sets fire to the minds of men that it erases their culture, their background, or their fundamental psychological understanding of the world.  Certainly not on a mass scale.\nIt’s very Eddie Izzard: “We are all Fascists now…. ciao!”\nThere’s a story that Ledeen tells about a restaurant.  One of the things that Mussolini did in this very Jamesian way was to declare all of these domestic policy wars, these moral equivalents of war.  There was the Battle of the Grains and the Battle of the Births, and one of them was the Battle of the Flies, because there was so much disease going around Italy back then.  Anyhow, this guy goes into a restaurant and sees there’s flies all over the place, so he asks what’s going on with the war against them.  The waiter says “well, the flies won.”  That’s a very Italian perspective.  One of the things I learned while writing the book is that there’s this glib association of fascism with anti-semitism, and while one can’t say that the Italians were completely blameless in that regard, at the end of the day, anti-semitism was just completely contrary to Italian history and culture.  Italy was polyglot, multi-ethnic and Catholic, so whatever anti-semitism was there was theological, not biological; the Catholic Church’s position was that Jews could be saved, not that they should be eradicated like vermin.  I wanted to do an entire chapter on this but it was just too far afield.  The heroism and decency of thousands upon thousands of Italians when it came to the Jews is one of the incredibly untold stories of that era.  Anti-semitism and Italian Fascism are just not kindred phenomena.\nSome of your critics focus on the fact that you’re not an academic, so should the fact that no book like this has been written in the sixty years since the end of the Fascist regime be taken as evidence that you’re just smoking crack, or is it an indictment of the academy?\nSince I’m currently not smoking crack, I personally take it as an indictment of the academy.  I plead absolutely guilty that I’m not an academic, I mean, how am I going to deny that?  I thi\nnk there’s a certain guild mentality that comes into play where a lot of academics try to shoot the messenger and say the substance of what I have to say doesn’t matter because I don’t carry the right guild card in my wallet.\nMy Dad, who died two years ago, never finished his PhD but he had a Master’s in philosophy, he was working on his PhD in East European history and he was a serious Jewish intellectual autodidact.  I grew up having conversations with him about this stuff from a very young age and I’ve always been interested in it.  I think it is a fascinating commentary on academia that  I had to learn about most of this stuff from non-academics.  There’s a lot of this in Paul Johnson and in Ledeen, and there are a few academics who have made some of these points, James Gregor has, Josh Muravchik’s\nHistory of Socialism\nwas very useful for a lot of this stuff.  Basically, this just doesn’t fit into the group-think and so you get bludgeoned for daring to say that the emperor has no clothes.\nAs Tom Wolfe said in the blurb for the book, it’s the greatest hoax in modern history that we were convinced that Fascism and National Socialism were phenomena of the Right.  I take it as a badge of honor that I’m not an academic, shame on them that no one else has written this book.\nWhat did you mean when you said that it’s not an Ann Coulter book in\nyour interview on the Glenn & Helen Show\n?\nIt’s a response to this jabbering fraction of a man named\nTim Noah at Slate\nwho has been insisting for about four years, sight unseen, that I have written what he calls an Ann Coulter book.  And by that I mean a bomb-throwing book that sheds heat, not light.  Now, I think there’s a place for them and I think there’s more serious argumentation in Ann Coulter’s books than a lot of people on the Left are willing to concede because they don’t want to give her arguments any credence.  But at the same time, it is indisputable that Ann is something of a performance artist.  She is most useful for entertaining people who already agree with her and for providing ammunition and morale to her side.  She does not go into a college lecture hall and persuade very many people who are sitting on the fence on an issue.\nI didn’t want to write that kind of book.  Ramesh Ponnuru has been a great influence on me and one of the things he often says is that he is much more interested in dealing with liberalism’s best arguments rather than its worst ones.  I think a lot of people on the Right, a lot of people in punditry generally, have gotten very comfortable playing these games of simply looking for the weakest link in the other side’s chain and entirely ignoring the stronger ones.  This book is aimed at the strongest links, or at least that’s what my intent was.  I’ll leave it to other people to decide how successful I was.\nI think the most interesting thing about your book is that despite the fact that you’ve been writing as a political pundit for some time now – in fact, one could even argue that you’re the most significant right-wing pundit of our generation at this point – you’ve actually managed to write a book that is intellectually serious.  Few of your peers have done so.  Is that because they’re just too accustomed to focusing on the weak link or is there another reason?\nActually, I just discovered in course of preparing the promotional stuff that I am the most widely syndicated columnist in America under the age of forty.\nI believe it.  My WND column was briefly syndicated by Universal Press Syndicate.  I think the Dallas Morning News picked it up for about two seconds before one of their editors actually read it and ran away scared.\nThat should tell you something.  There are sacrifices that have to be made to write a broadly syndicated column in terms of highfalutiness and so forth, you have to just sort of say what you’re going to say and get out.  It’s only when you reach a certain level, like George Will has, that you can start writing above your readers.  But it’s very difficult to get there unless you pitch it at a broader level.\nBack to the question.  Why have you been able to do what so many other pundits have demonstrably been unable to do with their books?\nThere are some political pundits who have written serious books, it kind of depends how you define pundit.  Tom Sowell has written some great books.  I think\nParty of Death\nwas a very good book and it was treated very shabbily by a lot of people.  But I generally agree with you, there is something going on out there and I think part of it has to do with the nature of publishing and how the influence of talk radio has changed publishing in a lot of ways.  A lot of people buy books to have them rather than to read them, so the pressure on authors to write serious books is much lower than it used to be.  When there was a misprint in one of Andrew Sullivan’s books and the first half of chapter six and the second half of chapter seven were interposed or whatever for something like half of the print run, the publishers didn’t want to recall the book because they thought it didn’t really matter at that point.  People are selling books as conversation pieces and they often go unread.  I don’t want to be too invidious about other columnists’ books, but what motivated me was the thought that you only write your first book once.\nI kind of fell backwards into punditry and I’ve had this rap from my detractors for a very long time about how I’m not a serious guy and there’s all this idiotic stuff, really fact-free, about nepotism and whatnot, so I had something to prove.  My Dad died in 2005, he was an enormous influence on me and I wanted to write a book that he would be proud of.  It’s dedicated to him.  I could have done a column book or I could have done a humor book a long time ago.  I had offers to do books on the Clinton scandal thanks to my notoriety there and I turned them all down because I wanted to write a real book instead.  I think conservatism generally is suffering from a dearth of real books.  Forget syndicated columnists per se, there’s just this glut of smashmouth books out there that don’t tackle hard things.  It’s been a long time since\nThe Closing of the American Mind\n.  I went with an editor in Adam Bellow who has a serious track record with serious books, and gave him the first option because I wanted to work with him.  He had a specific mission to keep me from going too gonzo and all the rest, keeping me focused on what I wanted to do and I’m very grateful to him for it.  I just had the fire in the belly to write a serious book and I hope that’s what I’ve done.\nIt’s interesting that you should mention\nThe Closing of the American Mind\nbecause one of the things that struck me as I was reading\nLiberal Fascism\nis that this is potentially one of the most important political books since that because it’s such a fundamentally necessary book for people to understand the political spectrum.  That’s why I was so enthusiastic about it.  Now, speaking stylistically, was the reason for the biographical approach in place of a more methodical one intended as a commentary on the ideology itself or did you have some other reason for it?\nThere’s a couple different reasons.  It was going to be a long book and people need a narrative, they need a story to hang those concepts on.  Adam and I struggled with this a lot, because I really wanted to do all sorts of stuff about the French Revolution, on the Social Gospel, and dive into these more ideational discussions, but as an editor, Adam just kept saying that while it’s fine to touch on that kind of stuff,  yo\nu’ve got to hang it off of someone’s saddlebag.  The reader needs a narrative arc to follow some of these things.  We also get into a lot of conceptual trouble when we start thinking about ideas being things in and of themselves, separate from human-lived lives.  So much of fascism and the Left’s understanding of fascism is informed by this emotional understanding of human nature.  The fascist personality type and all that, the idea that conservatives are mentally hard-wired to be fascistic.\nThe Authoritarian Mind\nYeah, exactly!  Since this is the way people think about these things, it’s very useful to actually look at the personifications of these phenomenons and talk about them as real human beings and show where that person, the actual person who personifies these ideas, actually lived on the ideological spectrum, what actions he took and how we would view them in today’s context.  Otherwise, you get into a lot of trouble cherry-picking.  I wanted to concentrate on the people who personified these ideas.  No one is going to deny Hitler was a Nazi.  No one is going to deny that Mussolini was an Italian Fascist.  Focusing on them allowed me to nail down a lot of things that otherwise might have gotten lost.\nSo it wasn’t the brilliant metaphor for ideological pragmatism that I thought it might be?\nAlas, no.\nIf libertarianism is the opposite of communism and fascism is founded on a cult of action, can’t we then conclude that inactivism is the polar opposite of fascism?\nYes!  I think that the fundamentally unfascistic insight that conservatism and libertarianism share is the idea that their political philosophies are only partial philosophies of life.  I know a lot of very socially conservative libertarians who go to church every week, are very strict with their kids and adhere to traditional moral values, but they’re libertarians!  Then you’ve got political conservatives, myself included, who are fairly libertine in their attitudes and their day-to-day lives, but they have a certain view about how politics should be ordered.  That is the unfascistic thing, we see politics as only one small sphere of life.  What unites fascism, communism and all these other isms is this idea of holism, the idea that politics is a total philosophy of life, that the personal is political, that the State and the collective come before the individual, and that the warp and woof of daily life should be informed by political imperatives.\nTutto nello stato, niente al di fuori dello stato, nulla contro lo stato.\nEverything inside the State, nothing outside the State.\nYou mentioned that writing\nLiberal Fascism\nhas made you more libertarian.  How did that come about?\nOne of the things I’ve really come to appreciate is the importance of dogma.  There need to be some taboos, some fundamental dogmatic roadblocks.  One of the things that writing this book has reinforced in me is that it is always safe to bet that government involvement is a bad idea.  That may not always be the case, but the burden of proof always has to be on the other guy to demonstrate why the government should get involved.  The first-do-no-harm principle is strong.  I still call myself a conservative,, though, I am a conservative, and I believe in the importance of tradition that Hayek is okay with and a lot of contemporary libertarians aren’t.  One of the things that kind of scares me about what’s happening the Right these days is that we’re getting into this right-wing progressivism, this right-wing Social Gospel and a lot of people have made their peace with the idea of a big activist government so long as it’s activist in the direction of so-called conservative values.  I think that is a really dangerous game.\nYou talk about the temptation of conservatives towards the end of the book.  Is it imperial neoconservatism, heroic strong government conservatism or compassionate conservatism that represents the greatest fascistic temptation to conservatives?\nI would say that it is heroic conservatism AND compassionate conservatism, since they are essentially the same thing.  Heroic conservatism is compassionate conservatism 2.0.  Or maybe heroic is version 1.5, and Mike Huckabee’s conservatism is 2.0.\nThe neoconservative thing is much more complicated.  I am very much open to a lot of the complaints about what has happened to so-called neoconservatism in recent years.  If the Iraq project hasn’t been a legitimate cause for introspection and a personal inventory of one’s mistakes, then you haven’t been paying attention.  But historically, neoconservatism, at least prior to 2000, was deeply informed by things like the Law of Unintended Consequences and the limits of reform.  So, I don’t think it’s particularly fascistic, although I think you could make a much stronger argument that it took a fascistic turn when we started getting into this national greatness stuff which is very remniscent of Herbert Crowley’s liberal New Nationalism of the World War I era.  But that national greatness conservatism is not neoconservatism, it is something different!  We get into this problematic area when we call Bill Kristol, David Brooks and these other guys neoconservatives and therefore say that neoconservatism means national greatness when that’s just simply not the case.\nBill Kristol never called himself a neocon.  Irving Kristol, who was a neocon, was never into national greatness, he never believed in that stuff and I don’t believe that neoconservatism is remotely fascistic.  It certainly pales in comparison to the stuff that we get from compassionate conservatism, anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-07T08:00:00+00:00"
}