{
  "url": "https://voxday.net/2008/01/14/irrational-atheist-in-transi/",
  "scraped_at": "2026-01-08T22:07:35.766138",
  "title": "The Irrational Atheistin transit",
  "date_display": "January 14, 2008",
  "date_iso": "2008-01-14T11:48:00+00:00",
  "date_from_url": "2008-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always make a practice of pre-ordering my own books from Amazon to alert me as to when the book actually becomes available, which is usually prior to the scheduled release date.  After getting an email from them informing me that <i>The Irrational Atheist</i> was on its way, I talked with the Original Cyberpunk and we decided to move the TIA surge forward to this coming weekend, the 19th and 20th.  The OC will post the relevant instructions for everyone who is interested in participating on his blog and I’ll link to them once they’re up.</p><p>If you just can’t wait, hey, go ahead and order one now and give the second one to a friend or whatever, but I’d really prefer for you to participate in the surge if you’re only intending to buy one.  Yes, of course I will make some money off these book sales, but that’s honestly of tertiary significance because the importance of the surge and the book’s ultimate success is directly tied to my ability to publish – not write – more books.  Regardless of how TIA is received by the market, I will always continue writing and making my books available electronically, but publishers tend to place a certain priority on actually selling dead tree copies.  So, if you want to see more of my work in print, please seriously consider ordering several copies of TIA from Amazon next weekend.</p><p>In the interest of putting my royalties where my mouth and my position on IP are, I’m very pleased to inform you that Glenn, my very open-minded and forward-thinking publisher at <a href=\"http://www.benbellabooks.com/\">BenBella Books</a>, graciously worded the book contract in such a way as to give me the right to release the complete electronic text of <i>The Irrational Atheist</i> in multiple formats on the book’s official launch date.  This will be done in a Radiohead-style pay-what-you-want format, which includes the ability to pay nothing if you like.  There is absolutely no obligation to pay anything, so critics and fans alike may download the ebook for free in good conscience if they so choose.  Any proceeds derived from these downloads will be divided between BenBella Books and me just like any other book revenues.</p><p>Thank you very much for your enthusiasm, your support and even your criticism.  Without those three things, TIA would never have been written, let alone published.  As far as critical response to the book goes, you probably already know that John Derbyshire, an atheist, named TIA one of his 2007 holiday recommendations for NRO.  So, it may further interest you to know that <a href=\"http://www.jacobneedleman.com/bio.htm\">the philosopher Jacob Needleman</a>, the author of <i>The American Soul</i>, had this to say about TIA:</p><p><i>“Mr. Day has made a much-needed contribution to the religious/atheist controversy by significantly raising the intellectual level of the entire debate.”</i></p><p>I was, of course, delighted that Dr. Needleman didn’t happen to mention anything about the way I lowered its tone.  It’s probably safe to say that this is the only book on the subject which begins with an unprintable quote from Tupac Shakur.</p></div>",
  "content_text": "I always make a practice of pre-ordering my own books from Amazon to alert me as to when the book actually becomes available, which is usually prior to the scheduled release date.  After getting an email from them informing me that\nThe Irrational Atheist\nwas on its way, I talked with the Original Cyberpunk and we decided to move the TIA surge forward to this coming weekend, the 19th and 20th.  The OC will post the relevant instructions for everyone who is interested in participating on his blog and I’ll link to them once they’re up.\nIf you just can’t wait, hey, go ahead and order one now and give the second one to a friend or whatever, but I’d really prefer for you to participate in the surge if you’re only intending to buy one.  Yes, of course I will make some money off these book sales, but that’s honestly of tertiary significance because the importance of the surge and the book’s ultimate success is directly tied to my ability to publish – not write – more books.  Regardless of how TIA is received by the market, I will always continue writing and making my books available electronically, but publishers tend to place a certain priority on actually selling dead tree copies.  So, if you want to see more of my work in print, please seriously consider ordering several copies of TIA from Amazon next weekend.\nIn the interest of putting my royalties where my mouth and my position on IP are, I’m very pleased to inform you that Glenn, my very open-minded and forward-thinking publisher at\nBenBella Books\n, graciously worded the book contract in such a way as to give me the right to release the complete electronic text of\nThe Irrational Atheist\nin multiple formats on the book’s official launch date.  This will be done in a Radiohead-style pay-what-you-want format, which includes the ability to pay nothing if you like.  There is absolutely no obligation to pay anything, so critics and fans alike may download the ebook for free in good conscience if they so choose.  Any proceeds derived from these downloads will be divided between BenBella Books and me just like any other book revenues.\nThank you very much for your enthusiasm, your support and even your criticism.  Without those three things, TIA would never have been written, let alone published.  As far as critical response to the book goes, you probably already know that John Derbyshire, an atheist, named TIA one of his 2007 holiday recommendations for NRO.  So, it may further interest you to know that\nthe philosopher Jacob Needleman\n, the author of\nThe American Soul\n, had this to say about TIA:\n“Mr. Day has made a much-needed contribution to the religious/atheist controversy by significantly raising the intellectual level of the entire debate.”\nI was, of course, delighted that Dr. Needleman didn’t happen to mention anything about the way I lowered its tone.  It’s probably safe to say that this is the only book on the subject which begins with an unprintable quote from Tupac Shakur.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-14T11:48:00+00:00"
}