{
  "url": "https://voxday.net/2008/01/13/its-conspiracy-my-brotha/",
  "scraped_at": "2026-01-08T22:07:30.230624",
  "title": "It’s a conspiracy, my brotha",
  "date_display": "January 13, 2008",
  "date_iso": "2008-01-13T17:53:00+00:00",
  "date_from_url": "2008-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The resident NFL conspiracy theorist announces this week’s results prior to kickoff:</p><blockquote><p>Okay, so far they’re staying right on script.  My guess is that this was Favre’s big farewell performance for the home-town fans, and that next week he’s going to choke big time and the Packers will get stomped in Dallas. BUT….I could be wrong, this may *not* have been Favre’s farewell performance tonight, in which case the Colts and Giants win tomorrow, the Packers beat the Giants in a squeaker in Lambeau next week, and Favre goes out in a blaze of glory in a rematch of Superbowl XXXI, as the Packers fight tooth and claw to pull a come-from-behind victory over the Patriots. For further explication, go watch the James Caan version of “Rollerball.”</p><p>Bread and circuses, chum.  Bread and circuses…</p><p>New England should win handily tonight.  It’s too early for them to<br>suffer the humiliating defeat that will end their season.  That<br>happens in the Superbowl.  (Remember your own principles.  Everyone<br>loves a winner, but everyone hates a winner who make it look too easy, and watching a hero win is nowhere near as gratifying as watching a hero fall. The most powerful human emotion is schadenfreude.)</br></br></br></p><p><i>[And later, after post-game exchange of email about the New England win and the Redemption of Ryan Grant theme.]</i></p><p>PS: Even [omitted] picked up on the Redemption of Ryan Grant sub-plot, though, possibly because the AP wire service story used the word “redemption” in the headline and at least twice again in the body.  I think Grant did his job admirably, considering that the Packers needed to spot the Seahawks 14 points just to keep it from looking like a lopsided blowout. Maybe Favre was getting tired of throwing strategic interceptions.</p><p>The Grant sub-plot settles it. Since he came to the Packers after a few years as a benchwarmer for the Giants, this means the Giants beat Dallas today, so that not only do we get the Average Joes Triumph Over The Smug All-Stars story today, but next week’s game at Lambeau becomes Grant’s Revenge.</p></blockquote><p>In light of this elucidation, I couldn’t help but notice that the broadcasters actually had a little video piece prepared that began with the words “this week’s theme is REVENGE”.  It was like something straight out of the WWF.</p><p>And yes, this is your Divisional Playoff discussion post.</p></div>",
  "content_text": "The resident NFL conspiracy theorist announces this week’s results prior to kickoff:\nOkay, so far they’re staying right on script.  My guess is that this was Favre’s big farewell performance for the home-town fans, and that next week he’s going to choke big time and the Packers will get stomped in Dallas. BUT….I could be wrong, this may *not* have been Favre’s farewell performance tonight, in which case the Colts and Giants win tomorrow, the Packers beat the Giants in a squeaker in Lambeau next week, and Favre goes out in a blaze of glory in a rematch of Superbowl XXXI, as the Packers fight tooth and claw to pull a come-from-behind victory over the Patriots. For further explication, go watch the James Caan version of “Rollerball.”\nBread and circuses, chum.  Bread and circuses…\nNew England should win handily tonight.  It’s too early for them to\nsuffer the humiliating defeat that will end their season.  That\nhappens in the Superbowl.  (Remember your own principles.  Everyone\nloves a winner, but everyone hates a winner who make it look too easy, and watching a hero win is nowhere near as gratifying as watching a hero fall. The most powerful human emotion is schadenfreude.)\n[And later, after post-game exchange of email about the New England win and the Redemption of Ryan Grant theme.]\nPS: Even [omitted] picked up on the Redemption of Ryan Grant sub-plot, though, possibly because the AP wire service story used the word “redemption” in the headline and at least twice again in the body.  I think Grant did his job admirably, considering that the Packers needed to spot the Seahawks 14 points just to keep it from looking like a lopsided blowout. Maybe Favre was getting tired of throwing strategic interceptions.\nThe Grant sub-plot settles it. Since he came to the Packers after a few years as a benchwarmer for the Giants, this means the Giants beat Dallas today, so that not only do we get the Average Joes Triumph Over The Smug All-Stars story today, but next week’s game at Lambeau becomes Grant’s Revenge.\nIn light of this elucidation, I couldn’t help but notice that the broadcasters actually had a little video piece prepared that began with the words “this week’s theme is REVENGE”.  It was like something straight out of the WWF.\nAnd yes, this is your Divisional Playoff discussion post.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-13T17:53:00+00:00"
}