{
  "url": "https://voxday.net/2008/01/24/its-not-cherman-thang/",
  "scraped_at": "2026-01-08T22:09:16.678268",
  "title": "It’s a freedom thang",
  "date_display": "January 24, 2008",
  "date_iso": "2008-01-24T19:21:00+00:00",
  "date_from_url": "2008-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You wouldn’t understand…. <a href=\"http://libjag.blogspot.com/2008/01/youre-what.html\">This is absolutely hilarious</a>, coming as it does courtesy of a gentleman hailing from the past and future Reich:</p><blockquote><p>This morning, I stumbled upon a very popular blog (judging by the number of comments per post) titled Vox Popoli. The author, who calls himself Vox Day (bonus points for the pseudonym), refers to himself as “Christian Libertarian”.</p><p>I lol’d.</p><p>How can you be a Christian apologetic and a libertarian? Libertarianism is all about the non-aggression principle. Live and let live.  Christianity, on the other hand, is all about telling people what to do and what not to do.</p></blockquote><p>Where to start?  First, libertarianism incorporates a non-aggression principle, but it is by no means all about non-aggression.  In fact, it may actually require aggression because what it is actually all about is limiting government power to the bare minimum required by a society.  Hence the focus on LIBERTY.  Liberty, (let me explain to those unfamiliar with the concept), is when the government has neither the right nor the ability to kill large quantities of its resident religious minorities or seize children and take them away from their parents because it disapproves of their failure to be sufficiently brainwashed by the government’s propaganda factories.</p><p>Second, I’m not a Christian apologist, as almost every single book review of TIA that has appeared so far makes clear.  I am a destroyer of disbelief,* as the “Atheism Delenda Est” on the back cover should make clear?  Why would a libertarian want to destroy atheism?  Probably because of the demonstrable historical link between atheism and the libertarian antithesis, totalitarianism.  And yes, that link is documented in detail and its <i>raison d’etre</i> is explored in the book.  Third, Christianity most definitely is NOT about telling people what to do or not do, quite the opposite, in fact.  There is a certain parable about a log and and an eye that the adept Bible scholar may, perhaps, recall.  Now, I admit that German Christianity may very well be all about telling people what to do, but I expect that has rather more to do with the German and rather less to do with the Christianity.</p><p>Reading an atheist German opine on Christian libertarianism is rather like watching a penguin attempt to explain the migratory patterns of the Lesser Cuckoo.</p><p><i>* by “disbelief” I mean the assertion of active belief in a negative inherent in atheism as opposed to the “how the Hell should I know” lack of belief better described as agnosticism.</i></p></div>",
  "content_text": "You wouldn’t understand….\nThis is absolutely hilarious\n, coming as it does courtesy of a gentleman hailing from the past and future Reich:\nThis morning, I stumbled upon a very popular blog (judging by the number of comments per post) titled Vox Popoli. The author, who calls himself Vox Day (bonus points for the pseudonym), refers to himself as “Christian Libertarian”.\nI lol’d.\nHow can you be a Christian apologetic and a libertarian? Libertarianism is all about the non-aggression principle. Live and let live.  Christianity, on the other hand, is all about telling people what to do and what not to do.\nWhere to start?  First, libertarianism incorporates a non-aggression principle, but it is by no means all about non-aggression.  In fact, it may actually require aggression because what it is actually all about is limiting government power to the bare minimum required by a society.  Hence the focus on LIBERTY.  Liberty, (let me explain to those unfamiliar with the concept), is when the government has neither the right nor the ability to kill large quantities of its resident religious minorities or seize children and take them away from their parents because it disapproves of their failure to be sufficiently brainwashed by the government’s propaganda factories.\nSecond, I’m not a Christian apologist, as almost every single book review of TIA that has appeared so far makes clear.  I am a destroyer of disbelief,* as the “Atheism Delenda Est” on the back cover should make clear?  Why would a libertarian want to destroy atheism?  Probably because of the demonstrable historical link between atheism and the libertarian antithesis, totalitarianism.  And yes, that link is documented in detail and its\nraison d’etre\nis explored in the book.  Third, Christianity most definitely is NOT about telling people what to do or not do, quite the opposite, in fact.  There is a certain parable about a log and and an eye that the adept Bible scholar may, perhaps, recall.  Now, I admit that German Christianity may very well be all about telling people what to do, but I expect that has rather more to do with the German and rather less to do with the Christianity.\nReading an atheist German opine on Christian libertarianism is rather like watching a penguin attempt to explain the migratory patterns of the Lesser Cuckoo.\n* by “disbelief” I mean the assertion of active belief in a negative inherent in atheism as opposed to the “how the Hell should I know” lack of belief better described as agnosticism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-24T19:21:00+00:00"
}