{
  "url": "https://voxday.net/2008/01/23/its-not-his-fau/",
  "scraped_at": "2026-01-08T22:08:58.259707",
  "title": "It’s not his fault",
  "date_display": "January 23, 2008",
  "date_iso": "2008-01-23T09:45:00+00:00",
  "date_from_url": "2008-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Socrates Elegy admits what we’ve <a href=\"http://reasonoverreligion.blogspot.com/2007/12/commentary-irrational-atheist.html\">already concluded is obvious</a>:</p><blockquote><p>Mr. Day has accused me of being stupid, uneducated and not well-read. I do not deny that.  But, on the other hand, I do not need to be smart, educated, and well-read to know that 2+2=4.</p></blockquote><p>Very true.  The problem is that the existence or non-existence of God != simple addition.  If it were, then the discussion would not have continued for lo, these many centuries, nor would Messrs. Dawkins, Harris, and Hitchens feel the need to write so many books about it.  Nevertheless, I suddenly feel a deep sense of compassion – well, okay, a mild twinge of it – for SE, since it’s quite clear from <a href=\"http://drhelen.blogspot.com/2008/01/irrational-atheist.html\">the comments on Dr. Helen’s blog</a> regarding her post on <i>The Irrational Atheist</i> that his maleducation is not his fault.</p><p>It seems SE has a professor named William, who wrote: <i>“Vox Day’s essay is full of assumptions based on conceit, hubris and absurdity. You can watch his reasoning being taken down by one of my students on his blog. Rather amusing, really.</i> Clearly not being one to examine the facts before leaping to a conclusion, Professor William rivals Sam Harris for an ability to combine certainty with logical incoherence.  By way of example, consider William’s statement: <i>“Good science never upholds tenets of ‘absolute certainty,’ but religious sure does, with out any supporting evidence.”</i></p><p>But even if “good science never upholds tenets of ‘absolute certainty'”, this says nothing about the point Professor William was supposed to be addressing, which is whether atheists rely on science with asolute certainty or not.  Second, it’s abundantly clear that Professor William doesn’t understand what the term “evidence” means, as there is a great deal of legally admissible evidence for many religions.  Perhaps he means “scientific evidence”, but that is far from the only kind of evidence, in fact, it is considered inherently weaker than many forms of evidence and for good reason due to its ever-mutating nature.</p><p>As everyone here knows, I did not stop calling myself a “forensic atheologist” due to Professor William’s student.  I didn’t stop calling myself a “Japanese scientist because of SE either, in fact, I delight in my status as both a forensic atheologist and a Japanese scientist, such as it is.  I have modified the sub-title accordingly, now that the book is available and the book cover is on display here.</p><p>What was truly amusing, however, was the way that Professor William first said that I am <i>“lacking the intellectual integrity to stand up to an amateur critical thinker.”</i> Then, when David pointed out to him that I did, in fact, possess the intellectual integrity to stand up to the aforementioned young man, Professor William promptly reversed himself in order to claim he found it amusing <i>“that Vox Day would devote an entire lengthy post defending himself from the critique of my student.”</i></p><p>Of course, I wasn’t “defending myself”, I was mocking a nonsensical and incompetent attempt to judge a new 320-page book on the basis of a four-year old, 750-word op/ed column.  And yet one can’t really blame SE, his actions were the natural result of receiving an “education” from an incompetent, hypocritical and intellectually dishonest professoriat.</p></div>",
  "content_text": "Socrates Elegy admits what we’ve\nalready concluded is obvious\n:\nMr. Day has accused me of being stupid, uneducated and not well-read. I do not deny that.  But, on the other hand, I do not need to be smart, educated, and well-read to know that 2+2=4.\nVery true.  The problem is that the existence or non-existence of God != simple addition.  If it were, then the discussion would not have continued for lo, these many centuries, nor would Messrs. Dawkins, Harris, and Hitchens feel the need to write so many books about it.  Nevertheless, I suddenly feel a deep sense of compassion – well, okay, a mild twinge of it – for SE, since it’s quite clear from\nthe comments on Dr. Helen’s blog\nregarding her post on\nThe Irrational Atheist\nthat his maleducation is not his fault.\nIt seems SE has a professor named William, who wrote:\n“Vox Day’s essay is full of assumptions based on conceit, hubris and absurdity. You can watch his reasoning being taken down by one of my students on his blog. Rather amusing, really.\nClearly not being one to examine the facts before leaping to a conclusion, Professor William rivals Sam Harris for an ability to combine certainty with logical incoherence.  By way of example, consider William’s statement:\n“Good science never upholds tenets of ‘absolute certainty,’ but religious sure does, with out any supporting evidence.”\nBut even if “good science never upholds tenets of ‘absolute certainty'”, this says nothing about the point Professor William was supposed to be addressing, which is whether atheists rely on science with asolute certainty or not.  Second, it’s abundantly clear that Professor William doesn’t understand what the term “evidence” means, as there is a great deal of legally admissible evidence for many religions.  Perhaps he means “scientific evidence”, but that is far from the only kind of evidence, in fact, it is considered inherently weaker than many forms of evidence and for good reason due to its ever-mutating nature.\nAs everyone here knows, I did not stop calling myself a “forensic atheologist” due to Professor William’s student.  I didn’t stop calling myself a “Japanese scientist because of SE either, in fact, I delight in my status as both a forensic atheologist and a Japanese scientist, such as it is.  I have modified the sub-title accordingly, now that the book is available and the book cover is on display here.\nWhat was truly amusing, however, was the way that Professor William first said that I am\n“lacking the intellectual integrity to stand up to an amateur critical thinker.”\nThen, when David pointed out to him that I did, in fact, possess the intellectual integrity to stand up to the aforementioned young man, Professor William promptly reversed himself in order to claim he found it amusing\n“that Vox Day would devote an entire lengthy post defending himself from the critique of my student.”\nOf course, I wasn’t “defending myself”, I was mocking a nonsensical and incompetent attempt to judge a new 320-page book on the basis of a four-year old, 750-word op/ed column.  And yet one can’t really blame SE, his actions were the natural result of receiving an “education” from an incompetent, hypocritical and intellectually dishonest professoriat.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-23T09:45:00+00:00"
}