{
  "url": "https://voxday.net/2008/01/03/joe-carter-on-campaign/",
  "scraped_at": "2026-01-08T22:06:05.602078",
  "title": "Joe Carter on the campaign",
  "date_display": "January 3, 2008",
  "date_iso": "2008-01-03T06:01:00+00:00",
  "date_from_url": "2008-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://www.evangelicaloutpost.com/archives/004158.html#more\">an extremely interesting post from Joe at EO</a>, must-reading for anyone paying any attention to the Republican primary.  He’s a pretty sunny guy in general, so his uncharacteristic dislike for the Romney campaign is remarkable.  It’s a pity he doesn’t simply share whatever story the campaign media is sitting on now; the whole point of blogdom is that it isn’t journalism so there’s no reason to abide by their hypothetical standards.</p><p>But I also have to note that I find it incredible that the individual who is capable of discerning this:</p><p><i>My Opinion of Giuliani…Hasn’t Changed — Is he still in the race? Why? Mayor Bloomberg has a better chance of being the next President.</i></p><p>is also capable of declaring this:</p><p><i>The Ron Paul Phenomenon is Not About Ron Paul  — It will take a more astute political mind than I possess to comprehend this Ron Paul phenomenon. All I know is that it has less to do with the candidate than about people’s desire for something different. When Rod Dreher, Andrew Sullivan, Vox Day, John Derbyshire, and the 9/11 Truthers all agree on a candidate its safe to say that they aren’t all seeing the same thing.</i></p><p>This isn’t the first post to indicate that Joe appears to be constitutionally incapable of grasping the fundamental point of libertarianism.  He doesn’t understand that the diverse collection of individuals he mentioned all do see precisely the same thing in Ron Paul, mostly because he cannot.  And yet, he’s right, the Ron Paul phenomenon isn’t about Ron Paul, it is about human liberty.  Unlike Huckabee, Romney, McCain and Giuliani supporters, Ron Paul’s fans aren’t looking for a Daddy figure who will run the State the way they want it run, they want someone who will refrain from running the greater part of it.  This holds true regardless of what particular area of government intervention they most dislike.</p><p>The Crunchy Republican Rod Dreher wants to be left alone so that he can live free and crunchy.  The Log Cabin Republican Andrew Sullivan is often ambivalent about what he wants, but in the end he correctly surmised that gays will be better off being left alone living free and gay instead of trying to use the government to impose their lavender agenda on everyone and risking getting the opposite crammed down their throats instead.  The Christian Libertarian is viciously opposed to all central government across the board and the Atheist Evolutionist Derbyshire is fed up with the constant failure of conservative leaders to actually conserve anything worthwhile as well as the repeated failures of aggressive interventionist foreign policy.  The 9/11 Truthers are confident that the very last thing Ron Paul would ever do is stage a Maine/Lusitania/Pearl Harbor/Gulf of Tonkin incident in order to justify a foreign military conflict.</p><p>Ron Paul is not representing all things to everyone, the very heart of his appeal is that he represents nothing to anyone.  And nothing is precisely what a lot of very different people want from the federal government.</p></div>",
  "content_text": "This is\nan extremely interesting post from Joe at EO\n, must-reading for anyone paying any attention to the Republican primary.  He’s a pretty sunny guy in general, so his uncharacteristic dislike for the Romney campaign is remarkable.  It’s a pity he doesn’t simply share whatever story the campaign media is sitting on now; the whole point of blogdom is that it isn’t journalism so there’s no reason to abide by their hypothetical standards.\nBut I also have to note that I find it incredible that the individual who is capable of discerning this:\nMy Opinion of Giuliani…Hasn’t Changed — Is he still in the race? Why? Mayor Bloomberg has a better chance of being the next President.\nis also capable of declaring this:\nThe Ron Paul Phenomenon is Not About Ron Paul  — It will take a more astute political mind than I possess to comprehend this Ron Paul phenomenon. All I know is that it has less to do with the candidate than about people’s desire for something different. When Rod Dreher, Andrew Sullivan, Vox Day, John Derbyshire, and the 9/11 Truthers all agree on a candidate its safe to say that they aren’t all seeing the same thing.\nThis isn’t the first post to indicate that Joe appears to be constitutionally incapable of grasping the fundamental point of libertarianism.  He doesn’t understand that the diverse collection of individuals he mentioned all do see precisely the same thing in Ron Paul, mostly because he cannot.  And yet, he’s right, the Ron Paul phenomenon isn’t about Ron Paul, it is about human liberty.  Unlike Huckabee, Romney, McCain and Giuliani supporters, Ron Paul’s fans aren’t looking for a Daddy figure who will run the State the way they want it run, they want someone who will refrain from running the greater part of it.  This holds true regardless of what particular area of government intervention they most dislike.\nThe Crunchy Republican Rod Dreher wants to be left alone so that he can live free and crunchy.  The Log Cabin Republican Andrew Sullivan is often ambivalent about what he wants, but in the end he correctly surmised that gays will be better off being left alone living free and gay instead of trying to use the government to impose their lavender agenda on everyone and risking getting the opposite crammed down their throats instead.  The Christian Libertarian is viciously opposed to all central government across the board and the Atheist Evolutionist Derbyshire is fed up with the constant failure of conservative leaders to actually conserve anything worthwhile as well as the repeated failures of aggressive interventionist foreign policy.  The 9/11 Truthers are confident that the very last thing Ron Paul would ever do is stage a Maine/Lusitania/Pearl Harbor/Gulf of Tonkin incident in order to justify a foreign military conflict.\nRon Paul is not representing all things to everyone, the very heart of his appeal is that he represents nothing to anyone.  And nothing is precisely what a lot of very different people want from the federal government.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-03T06:01:00+00:00"
}