{
  "url": "https://voxday.net/2008/01/07/learning-from-television/",
  "scraped_at": "2026-01-08T22:06:38.571856",
  "title": "Learning from television",
  "date_display": "January 7, 2008",
  "date_iso": "2008-01-07T11:24:00+00:00",
  "date_from_url": "2008-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of intellectually flawed and insubstantial books written by political pundits, I had to laugh out loud when watching a History Channel program entitled <i>The Imperial Japanese Navy</i> this morning.  It was inspired by a comment by <a href=\"http://www.hoover.org/bios/peattie.html\">Mark Peattie of the Hoover Institute</a>, whose specialty is Modern Japanese military, naval, and imperial history.  Peattie said that most Americans still don’t understand that the Japanese military interest in America was peripheral, it was merely a consequence of their need to protect the flank of their primary focus on controlling the Dutch East Indies and the resources there.  They even had a pretty animated map graphic illustrating the concept.</p><p>When one’s grasp of a historical situation doesn’t even rise to the level of a one-hour pop television history, it would probably be wise to avoid the temptation to write books about it.</p></div>",
  "content_text": "Speaking of intellectually flawed and insubstantial books written by political pundits, I had to laugh out loud when watching a History Channel program entitled\nThe Imperial Japanese Navy\nthis morning.  It was inspired by a comment by\nMark Peattie of the Hoover Institute\n, whose specialty is Modern Japanese military, naval, and imperial history.  Peattie said that most Americans still don’t understand that the Japanese military interest in America was peripheral, it was merely a consequence of their need to protect the flank of their primary focus on controlling the Dutch East Indies and the resources there.  They even had a pretty animated map graphic illustrating the concept.\nWhen one’s grasp of a historical situation doesn’t even rise to the level of a one-hour pop television history, it would probably be wise to avoid the temptation to write books about it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-07T11:24:00+00:00"
}