{
  "url": "https://voxday.net/2008/01/18/lewis-1-pullman-0/",
  "scraped_at": "2026-01-08T22:08:23.479048",
  "title": "Lewis 1, Pullman 0",
  "date_display": "January 18, 2008",
  "date_iso": "2008-01-18T23:28:00+00:00",
  "date_from_url": "2008-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The cultural war <a href=\"http://kylesmithonline.com/?p=848\">is not entirely lost as yet</a>:</p><blockquote><p>The movie [The Golden Compass] tanked so badly that the second and third installments are not going to be made (it did fairly well overseas, but unfortunately for New Line Cinema, that didn’t help because it pre-sold those rights).</p></blockquote><p>Gee, such a shame.  Pullman has no one but himself to blame, considering that he went out of his way to set his godless work against the much-beloved <i>Chronicles of Narnia</i>.  That might escape notice in a series of books, but it was never going to sneak past anyone once it became a reasonably high-profile movie.</p><p>One could, of course, argue that the diluted atheism of the movie was one reason it failed.  However, I suspect a movie that had pushed the very anti-religious elements that were dialed back in the film would have made it an even bigger failure.  And film is a lousy medium for most books anyhow, look how badly <i>The Dark is Rising</i> was abused and, unsurprisingly enough, how poorly it did.</p><p>Rule #1 – when seeking a mass-market hit, do try to recall that turning off your built-in base will guarantee failure, because any advantages derived will be completely overwhelmed by the negative word of mouth from the only people who actually care what you’re doing.  People may be stupid, but they’re not stupid enough to blindly support something that destroys the very object of their affection.</p></div>",
  "content_text": "The cultural war\nis not entirely lost as yet\n:\nThe movie [The Golden Compass] tanked so badly that the second and third installments are not going to be made (it did fairly well overseas, but unfortunately for New Line Cinema, that didn’t help because it pre-sold those rights).\nGee, such a shame.  Pullman has no one but himself to blame, considering that he went out of his way to set his godless work against the much-beloved\nChronicles of Narnia\n.  That might escape notice in a series of books, but it was never going to sneak past anyone once it became a reasonably high-profile movie.\nOne could, of course, argue that the diluted atheism of the movie was one reason it failed.  However, I suspect a movie that had pushed the very anti-religious elements that were dialed back in the film would have made it an even bigger failure.  And film is a lousy medium for most books anyhow, look how badly\nThe Dark is Rising\nwas abused and, unsurprisingly enough, how poorly it did.\nRule #1 – when seeking a mass-market hit, do try to recall that turning off your built-in base will guarantee failure, because any advantages derived will be completely overwhelmed by the negative word of mouth from the only people who actually care what you’re doing.  People may be stupid, but they’re not stupid enough to blindly support something that destroys the very object of their affection.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-18T23:28:00+00:00"
}