{
  "url": "https://voxday.net/2008/01/18/look-before-you-leap/",
  "scraped_at": "2026-01-08T22:08:12.591527",
  "title": "Look before you leap",
  "date_display": "January 18, 2008",
  "date_iso": "2008-01-18T08:43:00+00:00",
  "date_from_url": "2008-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And do a little research before you argue.  Crypticlife attempts to exculpate the actions of the secular speech-haters at La Sapienza:</p><blockquote><p>These protestors are not in executory positions of power, and aren’t about to murder or jail anyone….  And yet you claim a group of protestors is “authoritarian”</p></blockquote><p>Michael Ledeen <a href=\"http://corner.nationalreview.com/post/?q=MjdiNDExM2VjNjQzZjFmZTk3Njk2YmIxYjFlN2VmZmM=\">notes on The Corner</a>: <i>“I taught for several years at the “La Sapienza” University in Rome, back in the seventies. Lots of terrific students, incredible colleagues, and plenty of political terror. One of the most distinguished men in Rome, a member of the Supreme Court, was gunned down in his car in the middle of the “campus.” Other unpopular professors were beaten up, a couple were locked in elevators for half a day or more. Exams were all oral, and I had to deal with “student collectives” who wanted to march into the exam room in groups of thirty or so, then I would ask a question and they would decide who would answer.</i></p><p>Yes, yes I do consider this particular group of protestors to be very authoritarian indeed.  Would-be totalitarians, in fact.  I’m not going to pretend that I knew about this particular murder or the collective oral exams, but I do happen to know a bit about Italy in general, so I’m not at all surprised to learn about any of this.  The European Left is very different than the American Left, among other things, it really doesn’t bother to hide its intentions.</p><p>Instead of attempting to steal identities such as “liberal” and “conservative”, the European leftist proudly calls himself a socialist or communist.  (Anarchist merely means anti the current government, these “anarchists” actually tend to favor MORE government, ironically enough.)  The fact that his political positions are generally quite similar to those of the average American Democrat is, I am sure, mere happenstance.</p></div>",
  "content_text": "And do a little research before you argue.  Crypticlife attempts to exculpate the actions of the secular speech-haters at La Sapienza:\nThese protestors are not in executory positions of power, and aren’t about to murder or jail anyone….  And yet you claim a group of protestors is “authoritarian”\nMichael Ledeen\nnotes on The Corner\n:\n“I taught for several years at the “La Sapienza” University in Rome, back in the seventies. Lots of terrific students, incredible colleagues, and plenty of political terror. One of the most distinguished men in Rome, a member of the Supreme Court, was gunned down in his car in the middle of the “campus.” Other unpopular professors were beaten up, a couple were locked in elevators for half a day or more. Exams were all oral, and I had to deal with “student collectives” who wanted to march into the exam room in groups of thirty or so, then I would ask a question and they would decide who would answer.\nYes, yes I do consider this particular group of protestors to be very authoritarian indeed.  Would-be totalitarians, in fact.  I’m not going to pretend that I knew about this particular murder or the collective oral exams, but I do happen to know a bit about Italy in general, so I’m not at all surprised to learn about any of this.  The European Left is very different than the American Left, among other things, it really doesn’t bother to hide its intentions.\nInstead of attempting to steal identities such as “liberal” and “conservative”, the European leftist proudly calls himself a socialist or communist.  (Anarchist merely means anti the current government, these “anarchists” actually tend to favor MORE government, ironically enough.)  The fact that his political positions are generally quite similar to those of the average American Democrat is, I am sure, mere happenstance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-18T08:43:00+00:00"
}