{
  "url": "https://voxday.net/2008/01/28/mailvox-confusing-bug-collectors/",
  "scraped_at": "2026-01-08T22:09:38.801412",
  "title": "Mailvox: confusing the bug collectors",
  "date_display": "January 28, 2008",
  "date_iso": "2008-01-28T17:34:00+00:00",
  "date_from_url": "2008-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neither Katarina nor her atheist friends with whom she’s been debating are very clear on what Dawkins and I are discussing:</p><blockquote><p>This is a type of point that I in years past would make to the atheists with whom I spoke. It seemed to become apparent, however, based on the responses of some of them, that the basis of the point itself is incorrect.</p><p>So what if the earth had had a different atmosphere and temperature and everything else? A different type of life may have evolved on it. It means nothing of a creator’s deliberate design. We would have evolved to breathe something else, to have different needs for temperature and light and dark, we may have become highly intelligent fish people if the planet had no land and only water. The point is that the attempted basis for the improbability of all this being so “ideal for life” is itself flawed because it is making a false assumption and projecting it backwards in time, trying to apply a present reality of the outcome of evolution onto a past creation event as if only under these circumstances we have could there have been life.</p><p>It is a point that has been since held meaningless by the intelligent atheists with whom I interact, and I abandoned it long ago. I am wondering if this is correct or incorrect you may tell us, I mean if you have a rebuttal to what I am saying here or if it is in fact a valid point. I have thought that it is.</p></blockquote><p>I have an excellent rebuttal… none of this has anything whatsoever to do with the anthropic principle.  In the excerpt from TIA published in today’s column, I entirely conceded the biological argument to Dawkins for the purposes of argument because I didn’t need to contest it in order to demonstrate the flaws in the central “unrebuttable” argument of <i>The God Delusion</i>.</p><p>There’s no need to argue about hypothetical aquamen, the point of the anthropic principle is that there is no life, no Earth and no universe if just one of the physical constants are modified ever so slightly.  Evolution doesn’t get around this for the very simple reason that it has nothing to do with physics; this is precisely why Dawkins says, however nonsensically in the context: <i>“We don’t yet have an equivalent crane for physics. Some kind of multiverse theory could in principle do for physics the same explanatory work as Darwinism does for biology.</i>“</p><p>And perhaps it could, if any evidence for it existed, which it doesn’t.  I don’t waste much time discussing evolution, as in my opinion it’s a constantly fluctuating unscience largely dependent on backdated, ever-mutating models which holds little more interest for me than scientology.  But regardless of your level of interest or confidence in the theory of evolution by natural selection, you’d have to be pretty crazy to try using it as the basis of a discussion concerning mathematical probability and physics.</p></div>",
  "content_text": "Neither Katarina nor her atheist friends with whom she’s been debating are very clear on what Dawkins and I are discussing:\nThis is a type of point that I in years past would make to the atheists with whom I spoke. It seemed to become apparent, however, based on the responses of some of them, that the basis of the point itself is incorrect.\nSo what if the earth had had a different atmosphere and temperature and everything else? A different type of life may have evolved on it. It means nothing of a creator’s deliberate design. We would have evolved to breathe something else, to have different needs for temperature and light and dark, we may have become highly intelligent fish people if the planet had no land and only water. The point is that the attempted basis for the improbability of all this being so “ideal for life” is itself flawed because it is making a false assumption and projecting it backwards in time, trying to apply a present reality of the outcome of evolution onto a past creation event as if only under these circumstances we have could there have been life.\nIt is a point that has been since held meaningless by the intelligent atheists with whom I interact, and I abandoned it long ago. I am wondering if this is correct or incorrect you may tell us, I mean if you have a rebuttal to what I am saying here or if it is in fact a valid point. I have thought that it is.\nI have an excellent rebuttal… none of this has anything whatsoever to do with the anthropic principle.  In the excerpt from TIA published in today’s column, I entirely conceded the biological argument to Dawkins for the purposes of argument because I didn’t need to contest it in order to demonstrate the flaws in the central “unrebuttable” argument of\nThe God Delusion\n.\nThere’s no need to argue about hypothetical aquamen, the point of the anthropic principle is that there is no life, no Earth and no universe if just one of the physical constants are modified ever so slightly.  Evolution doesn’t get around this for the very simple reason that it has nothing to do with physics; this is precisely why Dawkins says, however nonsensically in the context:\n“We don’t yet have an equivalent crane for physics. Some kind of multiverse theory could in principle do for physics the same explanatory work as Darwinism does for biology.\n“\nAnd perhaps it could, if any evidence for it existed, which it doesn’t.  I don’t waste much time discussing evolution, as in my opinion it’s a constantly fluctuating unscience largely dependent on backdated, ever-mutating models which holds little more interest for me than scientology.  But regardless of your level of interest or confidence in the theory of evolution by natural selection, you’d have to be pretty crazy to try using it as the basis of a discussion concerning mathematical probability and physics.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-28T17:34:00+00:00"
}