{
  "url": "https://voxday.net/2008/01/29/mailvox-wnd-and-ron-pau/",
  "scraped_at": "2026-01-08T22:09:46.186704",
  "title": "Mailvox: WND and Ron Paul",
  "date_display": "January 29, 2008",
  "date_iso": "2008-01-29T12:27:00+00:00",
  "date_from_url": "2008-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GC wants to know what I think of WND’s lack of support for Ron Paul:</p><blockquote><p>I read recently your words of endorsement for Ron Paul.  They were as eloquent as Dr. Paul is the man for the times.  But I wonder, how do you square the lack of coverage of Dr. Paul by WND/Joseph Farrah with your own personal views.  Isn’t what WND is doing as it relates to Dr. Paul no different than what the MSM media are doing?  The cynical, and increasingly more likely, scenario is that Mr. Farrah is doing nothing more than providing a faux side for people to join to do battle against “them” (the Democrates, especially Hillary) when in reality, the republicans are just as corrupt.</p><p>Every right-wing pundit I listen to, every conservative columnist that I read all said/say they would immediately jump on the band wagon of a candidate if he would merely support the constitution.  Along comes Ron Paul and all those same guys simply pretend he doesn’t exist.  What gives?</p><p>I would love to see you write an article examining this phenomenon.  Corner some of these guys and force them to come clean on why they are ignoring the only guy in the race among either of the two major parties who everyone KNOWS will follow the constitution to the letter.</p></blockquote><p>First, WND has collectively demonstrated more support for Ron Paul than nearly any other site featuring political commentary.  Both Ilana Mercer and I have endorsed him, and if it’s not as big a news item as our colleague’s endorsement of Mike Huckabee, well, neither one of us is as famous as Chuck Norris nor did Ron Paul score an upset win in Iowa.  Second, I’m hardly in a position to complain about what WND’s editors <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59928\">elect to put on their front page</a> now, am I?</p><p>As for those supposedly right-wing self-proclaimed conservative pundits, well, as I have said before, it pains me to have to point out to adults that sometimes people say things that are not true.  The truth is that most of the conservative commentariat is not conservative.  Most of them do not support the U.S. Constitution.  This is easily verified by simply comparing their written positions on various issues with the Constititution.  And the same is true of the “conservative” politicians they support, from George W. Bush to John McCain and Mitt Romney.</p><p>That’s not the case with Mr. Farah.  He’s honest, but he’s a journalist by trade and training and so tends to think about politics in horse race terms.  This means that he’s not inclined to support the best guy regardless, but rather the best guy he considers to have a decent chance.  Since Ron Paul has never really fit that description, he’s just not inclined to give him the time of day.  This makes sense from his primarily tactical perspective.</p><p>Being rather more inclined to view things from a strategic perspective myself, I see absolutely no benefit to a Republican win in 2008 anyhow.  The economic, political and military winds are seriously ill-omened and whoever wins will be held responsible for the consequences over the next decade.  This is the best possible time for pundits to hold to pure principle; the fact that none of them are doing so despite having such a great excuse is less a condemnation of principles which very few of them happen to hold anyway, (most columnists care less about who wins than they do about being able to say they backed the winner), but rather a demonstration of their inability to think beyond tomorrow.  I’ve found it very interesting to see that many of the commentators I most respect have tended to either support Ron Paul or refrain from endorsing anyone.</p></div>",
  "content_text": "GC wants to know what I think of WND’s lack of support for Ron Paul:\nI read recently your words of endorsement for Ron Paul.  They were as eloquent as Dr. Paul is the man for the times.  But I wonder, how do you square the lack of coverage of Dr. Paul by WND/Joseph Farrah with your own personal views.  Isn’t what WND is doing as it relates to Dr. Paul no different than what the MSM media are doing?  The cynical, and increasingly more likely, scenario is that Mr. Farrah is doing nothing more than providing a faux side for people to join to do battle against “them” (the Democrates, especially Hillary) when in reality, the republicans are just as corrupt.\nEvery right-wing pundit I listen to, every conservative columnist that I read all said/say they would immediately jump on the band wagon of a candidate if he would merely support the constitution.  Along comes Ron Paul and all those same guys simply pretend he doesn’t exist.  What gives?\nI would love to see you write an article examining this phenomenon.  Corner some of these guys and force them to come clean on why they are ignoring the only guy in the race among either of the two major parties who everyone KNOWS will follow the constitution to the letter.\nFirst, WND has collectively demonstrated more support for Ron Paul than nearly any other site featuring political commentary.  Both Ilana Mercer and I have endorsed him, and if it’s not as big a news item as our colleague’s endorsement of Mike Huckabee, well, neither one of us is as famous as Chuck Norris nor did Ron Paul score an upset win in Iowa.  Second, I’m hardly in a position to complain about what WND’s editors\nelect to put on their front page\nnow, am I?\nAs for those supposedly right-wing self-proclaimed conservative pundits, well, as I have said before, it pains me to have to point out to adults that sometimes people say things that are not true.  The truth is that most of the conservative commentariat is not conservative.  Most of them do not support the U.S. Constitution.  This is easily verified by simply comparing their written positions on various issues with the Constititution.  And the same is true of the “conservative” politicians they support, from George W. Bush to John McCain and Mitt Romney.\nThat’s not the case with Mr. Farah.  He’s honest, but he’s a journalist by trade and training and so tends to think about politics in horse race terms.  This means that he’s not inclined to support the best guy regardless, but rather the best guy he considers to have a decent chance.  Since Ron Paul has never really fit that description, he’s just not inclined to give him the time of day.  This makes sense from his primarily tactical perspective.\nBeing rather more inclined to view things from a strategic perspective myself, I see absolutely no benefit to a Republican win in 2008 anyhow.  The economic, political and military winds are seriously ill-omened and whoever wins will be held responsible for the consequences over the next decade.  This is the best possible time for pundits to hold to pure principle; the fact that none of them are doing so despite having such a great excuse is less a condemnation of principles which very few of them happen to hold anyway, (most columnists care less about who wins than they do about being able to say they backed the winner), but rather a demonstration of their inability to think beyond tomorrow.  I’ve found it very interesting to see that many of the commentators I most respect have tended to either support Ron Paul or refrain from endorsing anyone.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-29T12:27:00+00:00"
}