{
  "url": "https://voxday.net/2008/01/23/mailvox-shut-up-and-read/",
  "scraped_at": "2026-01-08T22:09:01.943374",
  "title": "Mailvox: Shut up and read",
  "date_display": "January 23, 2008",
  "date_iso": "2008-01-23T10:06:00+00:00",
  "date_from_url": "2008-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t want to be too hard on Mike, since he is clearly open-minded enough to give <i>The Irrational Atheist</i> a fair shake, at least in theory.  And in fairness to him, there’s no shortage of Christians who will have a problem with the very first sentence of the first chapter.  But since he wrote that he would welcome any arguments in response to his email, I shall grant him the same respect that I grant to all my critics, which is to say, I will post his argument in its entirety and respond to it with my usual reserve:</p><blockquote><p>You lost my respect on the nineth paragraph of the preface. You showed your Bill O Rilley extreamist colors condeming the organization that helps protect peoples rights under the constitution. Namely the ACLU. Typical of traditional religious extreamist wanting to take away individual rights becouse it may not seem to follow your superstitions.You seem to hold so called historical traditions as automaticly right and should not be questioned or changed just because it may be flawed. Example AD and BC being changed. Maybe it was changed because it was just another Christian thing that made nonchristians think Christians were trying to make the world theirs.</p></blockquote><p>While it pains me to have to repeatedly point this out to adults, people and organizations often say things that simply aren’t true.  The ACLU does defend SOME Constitutional rights, however, it actually attacks those Constiutional rights which happen to conflict with its left-wing ideology.  When is the last time that the ACLU defended the Constitutional Right to Free Association, for example?  Also, I am a libertarian who is <a href=\"http://www.voxday.net/archive/2004/072604.html\">no friend of Bill O’Reilly</a>, and I am a far more extreme advocate of individual rights than the ACLU has ever been in its most fevered dreams.  It is unwise to leap to conclusions about a book based on the very first thing inside it that upsets your conceptual applecart.  Regarding BC/BCE, as someone recently pointed out here, it’s pretty stupid to rename the epoch while still basing it on the supposed time of Jesus Christ’s birth.  Of course, all the Year Ones of the various revolutionary calendars haven’t shown much staying power.</p><blockquote><p>I think that was one of the main points of Sam Harris’s book.You seem to miss the main point. All belief in god is based on some ancient tradition and writings that the believer takes on blind faith to be true. The fact that there are many differient beliefs means everyone thinks the other is dead wrong.This seems to lead to war and other unreasonable disputes.Sure many nonreligious beliefs also lead to war and disputes but that just makes two wrongs.</p></blockquote><p>I suggest that Mike read Chapter VII: The End of Sam Harris.  Also Chapter V: Sam Tzu and the Art of War and Chapter VI: The War Delusion.</p><blockquote><p>Religious doctrine is near impossible to get someone to comprimise on becouse they interpret thier belief to be the perfect word of god. I cant imagine a more dangerous recipie for disaster. This is why I think the whole theory of a god seems implausable.I think our concience our understanding of history,our open dialog of opinions to be weighed logicaly is our better hope for a peacefull and moral society.</p></blockquote><p>If Mike can’t imagine a more dangerous recipe for disaster, I suggest reading Chapter III: The Case Against Science and Chapter XI: The Robespierre of Atheism.</p><blockquote><p>Sure it will never be perfect becouse evolution didnt make us to be perfect.We only have the reality that has been delt us.Lets not waste time pretending and wishing there is something other than reality and start trying to solve problems based on hard facts and reason not someting somebody said his god said in an ancient book. I think blind devotion to something you cant really know for fact will always make your statistics twist and dance to mean what you want to try to prove the unprovable.You will allways will have a bias that cant be reasoned with.</p></blockquote><p>This isn’t entirely unreasonable, but is more than a little ironic considering what comes next.</p><blockquote><p>I have read all three of the books you are disputing and do agree with thier general ideas, but not all the ideas or details. To be quibling with the details you lose the main arguement! You even conciede this in the begining of the book! Your details look as bias as you say thiers are bias. Its all about the three hundred pound god in the room! If yor argument doesnt address the probabillity of god then your attack means nothing to me. I suspect you are only really trying to create that all important seed of doubt to the believers. We all know thats all they need. Your friends at fox news have perfected the he said she said seed of doubt to an art.</p></blockquote><p>First, I have <a href=\"http://www.voxday.net/archive/2004/102504.html\">no friends at Fox News</a>.  Second, Mike has clearly forgotten what Dawkins explicitly states is the main argument of <i>The God Delusion</i>, which I refute in painstaking, step-by-step detail in Chapter VIII: Darwin’s Judas, in the process directly addressesing the probability argument which so interests Mike.  (I note that “the main argument” of the other two books is not that which he believes it to be.)  Third, Mike does a spectacular job proving my point about the fundamental irrationality of atheism.  I am not saying the facts and details put forth by the Unholy Trinity are biased, I AM PROVING THEY ARE FACTUALLY INCORRECT.  This means that the arguments they have made which are based on those facts are also incorrect.  Mike is saying that he doesn’t care about the demonstrable flaws in the atheist arguments, he doesn’t care about the illogic involved, he only cares about the conclusion with which he concurs.</p><p>THIS IS NOT REASON, THIS IS INTUITION!</p><p>There are rational atheists.  There are rational arguments for doubt and even for agnosticism.  But as Mike demonstrates, there is no such thing as rational atheism and the sad truth of the matter is that most self-styled “rationalists” are far from “rational empiricists” and would be much more accurately described as “intuitionists”.  Of course, this accuracy in labeling would make the fundamental weakness of their intellectual position patently obvious to all and sundry, so they attempt to coopt a title to which they have no right whatsoever.</p><p>The moral of the story: read, then critique.</p></div>",
  "content_text": "I don’t want to be too hard on Mike, since he is clearly open-minded enough to give\nThe Irrational Atheist\na fair shake, at least in theory.  And in fairness to him, there’s no shortage of Christians who will have a problem with the very first sentence of the first chapter.  But since he wrote that he would welcome any arguments in response to his email, I shall grant him the same respect that I grant to all my critics, which is to say, I will post his argument in its entirety and respond to it with my usual reserve:\nYou lost my respect on the nineth paragraph of the preface. You showed your Bill O Rilley extreamist colors condeming the organization that helps protect peoples rights under the constitution. Namely the ACLU. Typical of traditional religious extreamist wanting to take away individual rights becouse it may not seem to follow your superstitions.You seem to hold so called historical traditions as automaticly right and should not be questioned or changed just because it may be flawed. Example AD and BC being changed. Maybe it was changed because it was just another Christian thing that made nonchristians think Christians were trying to make the world theirs.\nWhile it pains me to have to repeatedly point this out to adults, people and organizations often say things that simply aren’t true.  The ACLU does defend SOME Constitutional rights, however, it actually attacks those Constiutional rights which happen to conflict with its left-wing ideology.  When is the last time that the ACLU defended the Constitutional Right to Free Association, for example?  Also, I am a libertarian who is\nno friend of Bill O’Reilly\n, and I am a far more extreme advocate of individual rights than the ACLU has ever been in its most fevered dreams.  It is unwise to leap to conclusions about a book based on the very first thing inside it that upsets your conceptual applecart.  Regarding BC/BCE, as someone recently pointed out here, it’s pretty stupid to rename the epoch while still basing it on the supposed time of Jesus Christ’s birth.  Of course, all the Year Ones of the various revolutionary calendars haven’t shown much staying power.\nI think that was one of the main points of Sam Harris’s book.You seem to miss the main point. All belief in god is based on some ancient tradition and writings that the believer takes on blind faith to be true. The fact that there are many differient beliefs means everyone thinks the other is dead wrong.This seems to lead to war and other unreasonable disputes.Sure many nonreligious beliefs also lead to war and disputes but that just makes two wrongs.\nI suggest that Mike read Chapter VII: The End of Sam Harris.  Also Chapter V: Sam Tzu and the Art of War and Chapter VI: The War Delusion.\nReligious doctrine is near impossible to get someone to comprimise on becouse they interpret thier belief to be the perfect word of god. I cant imagine a more dangerous recipie for disaster. This is why I think the whole theory of a god seems implausable.I think our concience our understanding of history,our open dialog of opinions to be weighed logicaly is our better hope for a peacefull and moral society.\nIf Mike can’t imagine a more dangerous recipe for disaster, I suggest reading Chapter III: The Case Against Science and Chapter XI: The Robespierre of Atheism.\nSure it will never be perfect becouse evolution didnt make us to be perfect.We only have the reality that has been delt us.Lets not waste time pretending and wishing there is something other than reality and start trying to solve problems based on hard facts and reason not someting somebody said his god said in an ancient book. I think blind devotion to something you cant really know for fact will always make your statistics twist and dance to mean what you want to try to prove the unprovable.You will allways will have a bias that cant be reasoned with.\nThis isn’t entirely unreasonable, but is more than a little ironic considering what comes next.\nI have read all three of the books you are disputing and do agree with thier general ideas, but not all the ideas or details. To be quibling with the details you lose the main arguement! You even conciede this in the begining of the book! Your details look as bias as you say thiers are bias. Its all about the three hundred pound god in the room! If yor argument doesnt address the probabillity of god then your attack means nothing to me. I suspect you are only really trying to create that all important seed of doubt to the believers. We all know thats all they need. Your friends at fox news have perfected the he said she said seed of doubt to an art.\nFirst, I have\nno friends at Fox News\n.  Second, Mike has clearly forgotten what Dawkins explicitly states is the main argument of\nThe God Delusion\n, which I refute in painstaking, step-by-step detail in Chapter VIII: Darwin’s Judas, in the process directly addressesing the probability argument which so interests Mike.  (I note that “the main argument” of the other two books is not that which he believes it to be.)  Third, Mike does a spectacular job proving my point about the fundamental irrationality of atheism.  I am not saying the facts and details put forth by the Unholy Trinity are biased, I AM PROVING THEY ARE FACTUALLY INCORRECT.  This means that the arguments they have made which are based on those facts are also incorrect.  Mike is saying that he doesn’t care about the demonstrable flaws in the atheist arguments, he doesn’t care about the illogic involved, he only cares about the conclusion with which he concurs.\nTHIS IS NOT REASON, THIS IS INTUITION!\nThere are rational atheists.  There are rational arguments for doubt and even for agnosticism.  But as Mike demonstrates, there is no such thing as rational atheism and the sad truth of the matter is that most self-styled “rationalists” are far from “rational empiricists” and would be much more accurately described as “intuitionists”.  Of course, this accuracy in labeling would make the fundamental weakness of their intellectual position patently obvious to all and sundry, so they attempt to coopt a title to which they have no right whatsoever.\nThe moral of the story: read, then critique.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-23T10:06:00+00:00"
}