{
  "url": "https://voxday.net/2008/01/21/mccain-on-brain/",
  "scraped_at": "2026-01-08T22:08:43.644182",
  "title": "McCain on the brain",
  "date_display": "January 21, 2008",
  "date_iso": "2008-01-21T12:38:00+00:00",
  "date_from_url": "2008-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I mentioned McCensorship <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59780\">in my column today</a> but that strikes me as too abstract and shockingly devoid of my characteristic cruelty in assigning appellations.  Zeno suggests “John Insane”, but to be fair to Sen. McCain, the only significant insanity I see is on the part of the Republican Party for giving him serious consideration as a presidential candidate.  Although one does have to wonder what on Earth the good people of Arizona are thinking in repeatedly inflicting him upon the rest of the nation as their representative in the U.S. Senate.</p><p>Personally, I don’t think it matters much as he’ll probably be out of the picture before long, but in the event that he’s going to stick around through November, I’m leaning towards McManiac.  Got any better ideas – ideas that are printable?</p><p>UPATE –  I am always amused by this response to my columns: <i>who the hell is vox day and why should anyone care what it thinks</i>.  Yes, for how can we possibly think without the properly authorized authorities to inform us exactly what we should be thinking?  You know, I too have a dream.  I have a dream that one day, an idea will be judged upon the content of its substance, not the character of the individual who happened to mention it.</p></div>",
  "content_text": "I mentioned McCensorship\nin my column today\nbut that strikes me as too abstract and shockingly devoid of my characteristic cruelty in assigning appellations.  Zeno suggests “John Insane”, but to be fair to Sen. McCain, the only significant insanity I see is on the part of the Republican Party for giving him serious consideration as a presidential candidate.  Although one does have to wonder what on Earth the good people of Arizona are thinking in repeatedly inflicting him upon the rest of the nation as their representative in the U.S. Senate.\nPersonally, I don’t think it matters much as he’ll probably be out of the picture before long, but in the event that he’s going to stick around through November, I’m leaning towards McManiac.  Got any better ideas – ideas that are printable?\nUPATE –  I am always amused by this response to my columns:\nwho the hell is vox day and why should anyone care what it thinks\n.  Yes, for how can we possibly think without the properly authorized authorities to inform us exactly what we should be thinking?  You know, I too have a dream.  I have a dream that one day, an idea will be judged upon the content of its substance, not the character of the individual who happened to mention it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-21T12:38:00+00:00"
}