{
  "url": "https://voxday.net/2008/01/10/national-review-or-us-weekly/",
  "scraped_at": "2026-01-08T22:06:58.951727",
  "title": "National Review or US Weekly?",
  "date_display": "January 10, 2008",
  "date_iso": "2008-01-10T00:25:00+00:00",
  "date_from_url": "2008-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sweet <a href=\"http://corner.nationalreview.com/post/?q=MDIxZDU4YTEyMjEyMGMwOWE5ZWMyNDkwZmE2MjI4MzY=\">William F. Buckley on a popsicle stick</a>!  What’s next, home-made holiday decorations with John Derbyshire?  Are Ramesh Ponnuru, Rich Lowry and David Freddoso going to cooperate on a team knitting project?  Can we anticipate a special Bloggingheads video featuring Jonah and Peter braiding each other’s hair?  Will Kathryn Jean advise girls just when to let that special boy reach second base?  It’s ESPN’s Page 2 all over again:</p><blockquote><p>So, Sarkozy wins election as prime minister of France, pretends to live with his second wife who had previously left him, and apparently did so again, secretly divorces said wife and announces it as a fait accompli, then starts ostentatiously dating Carla Bruni, a former model who is now a singer. He makes sure to be photographed in bathing suits on a beach in Egypt, thereby offending the Muslim natives, but very effectively showing off his girlfriend’s fabulous figure. Now he announces that the relationship is “serious,” and floats rumors of marriage.</p><p>The question is, does marrying the trophy girlfriend five minutes after the ex-wife dumped him make him look better or worse.</p></blockquote><p>I think I speak for a sizeable percentage of current and former National Review subscribers when I say: WHO GIVES A FLYING, FORNICATING RODENT’S POSTERIOR about who, or what, a French politician is dating in his spare time!</p><p>I seem to recall a historical epoch when conservatives didn’t give a damn about cheese-eating surrender monkeys, period.  Yes, this is just National Review’s Corner, not the magazine proper, but seriously, it’s hardly a wonder that today’s conservatism is mutating into big government liberalism lite with ideological champions like this standing atop history, pondering where European politicos are placing their penises.  Silver lining: if you didn’t understand where that scathing contempt for the current state of conservative punditry which may have peeked through just a little bit during the <i>Liberal Fascism</i> interview came from, well, perhaps this insightful and important post on the current state of French politics may explain a part of it.</p><p>On a tangential and largely unrelated note – I’m hardly a Frum fan, but say what you will about the man, at least he’s a political pundit who still harbors an interest in actual American politics – I found this comment about his new book to be somewhat amusing:</p><blockquote><p>I’m delighted by the media attention. But I have to confess, it’s becoming clear to me: <a href=\"http://frum.nationalreview.com/post/?q=MDgwOWM3YTJiZmM0MWViNjM5ZGFiNWMyNTA2ZTBjMzQ=\">Republicans and conservatives are very resistant to the message</a> of <i>Comeback</i>.</p></blockquote><p>I haven’t read it, so I don’t have an opinion on it.  But if it’s anything like <i>An End to Evil</i>, one can only conclude Republicans and conservatives probably SHOULD be very resistant to its message, which based on the publisher’s Amazon description apparently includes the following:</p><p><i>A conservative commitment to make private-sector health insurance available to every American – NO</i></p><p>Lower taxes on savings and investment financed by higher taxes on energy and pollution – NO</p><p>Federal policies to encourage larger families – DEPENDS</p><p>Major reductions in unskilled immigration – YES, DEFINITELY</p><p>A genuinely compassionate conservatism, including a conservative campaign for prison reform and government action against the public health disaster of obesity – FINE… HOLY CATS, YOU DIDN’T SAY THIS WAS A COMEDY, MR. FRUM!</p><p>A new conservative environmentalism that promotes nuclear power in place of coal and oil – WHATVER</p><p>Higher ethical standards inside the conservative movement and the Republican party – YES, LONG OVERDUE</p><p>A renewed commitment to expand and rebuild the armed forces of the United States—to crush terrorism—and get ready for the coming challenge from China – MUTUALLY EXCLUSIVE GOALS</p><p>Again, I can’t speak for the book proper, but as for this little list of ideological cross-dressing, it’s an incoherent and self-contradictory platform that has no chance of either being adopted by the Republican party or being meaningful in any significant fashion.  Frum’s may have a point about the limited appeal of genuine conservatism today, but what’s the point of killing conservatism to save the party brand?</p></div>",
  "content_text": "Sweet\nWilliam F. Buckley on a popsicle stick\n!  What’s next, home-made holiday decorations with John Derbyshire?  Are Ramesh Ponnuru, Rich Lowry and David Freddoso going to cooperate on a team knitting project?  Can we anticipate a special Bloggingheads video featuring Jonah and Peter braiding each other’s hair?  Will Kathryn Jean advise girls just when to let that special boy reach second base?  It’s ESPN’s Page 2 all over again:\nSo, Sarkozy wins election as prime minister of France, pretends to live with his second wife who had previously left him, and apparently did so again, secretly divorces said wife and announces it as a fait accompli, then starts ostentatiously dating Carla Bruni, a former model who is now a singer. He makes sure to be photographed in bathing suits on a beach in Egypt, thereby offending the Muslim natives, but very effectively showing off his girlfriend’s fabulous figure. Now he announces that the relationship is “serious,” and floats rumors of marriage.\nThe question is, does marrying the trophy girlfriend five minutes after the ex-wife dumped him make him look better or worse.\nI think I speak for a sizeable percentage of current and former National Review subscribers when I say: WHO GIVES A FLYING, FORNICATING RODENT’S POSTERIOR about who, or what, a French politician is dating in his spare time!\nI seem to recall a historical epoch when conservatives didn’t give a damn about cheese-eating surrender monkeys, period.  Yes, this is just National Review’s Corner, not the magazine proper, but seriously, it’s hardly a wonder that today’s conservatism is mutating into big government liberalism lite with ideological champions like this standing atop history, pondering where European politicos are placing their penises.  Silver lining: if you didn’t understand where that scathing contempt for the current state of conservative punditry which may have peeked through just a little bit during the\nLiberal Fascism\ninterview came from, well, perhaps this insightful and important post on the current state of French politics may explain a part of it.\nOn a tangential and largely unrelated note – I’m hardly a Frum fan, but say what you will about the man, at least he’s a political pundit who still harbors an interest in actual American politics – I found this comment about his new book to be somewhat amusing:\nI’m delighted by the media attention. But I have to confess, it’s becoming clear to me:\nRepublicans and conservatives are very resistant to the message\nof\nComeback\n.\nI haven’t read it, so I don’t have an opinion on it.  But if it’s anything like\nAn End to Evil\n, one can only conclude Republicans and conservatives probably SHOULD be very resistant to its message, which based on the publisher’s Amazon description apparently includes the following:\nA conservative commitment to make private-sector health insurance available to every American – NO\nLower taxes on savings and investment financed by higher taxes on energy and pollution – NO\nFederal policies to encourage larger families – DEPENDS\nMajor reductions in unskilled immigration – YES, DEFINITELY\nA genuinely compassionate conservatism, including a conservative campaign for prison reform and government action against the public health disaster of obesity – FINE… HOLY CATS, YOU DIDN’T SAY THIS WAS A COMEDY, MR. FRUM!\nA new conservative environmentalism that promotes nuclear power in place of coal and oil – WHATVER\nHigher ethical standards inside the conservative movement and the Republican party – YES, LONG OVERDUE\nA renewed commitment to expand and rebuild the armed forces of the United States—to crush terrorism—and get ready for the coming challenge from China – MUTUALLY EXCLUSIVE GOALS\nAgain, I can’t speak for the book proper, but as for this little list of ideological cross-dressing, it’s an incoherent and self-contradictory platform that has no chance of either being adopted by the Republican party or being meaningful in any significant fashion.  Frum’s may have a point about the limited appeal of genuine conservatism today, but what’s the point of killing conservatism to save the party brand?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-10T00:25:00+00:00"
}