{
  "url": "https://voxday.net/2008/01/29/no-need-for-strawmen/",
  "scraped_at": "2026-01-08T22:09:42.562283",
  "title": "No need for strawmen",
  "date_display": "January 29, 2008",
  "date_iso": "2008-01-29T08:25:00+00:00",
  "date_from_url": "2008-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People sometimes wonder why I demonstrate such open contempt for atheism.  I don’t fear atheists, I certainly don’t respect most of them – although I do respect atheist individuals such as Jonathan Haidt, Daniel Dennett and Brent Rasmussen, who have earned it – and I find that the lay atheist, like his heroes, tends to be incredibly obnoxious.  Mono Ape provides an excellent example of why this contempt is not merely justified, but demanded.  It would be easy to think that he is simply stupid based on the way he relies on assumptions, intuition and faulty logic rather than simply looking at the available evidence, except that one runs into this behavior time and time and time again with outspoken atheists.  Combined with their usual assertion of rational superiority and their demonstrated knowledge of common atheist talking points, this behavior increasingly tends to indicate intentional dishonesty rather than mere ignorance or unintellligence.  Mono Apes quotes my interview with Joseph Farah and writes:</p><blockquote><p><i>“… Dawkins’s stupid assertion that a religious upbringing is worse than sexual child abuse”</i></p><p>Professor Dawkins has never said any such thing. He had said that labelling a child ‘Christian’, ‘Muslim’, etc. is “a form of abuse”.</p></blockquote><p>He did say it, by his own admission.  He also wrote it: <i>““Once, in the question time after a lecture in Dublin, I was asked what I thought about the widely publicized cases of sexual abuse by Catholic priests in Ireland. I replied that, as horrible as sexual abuse no doubt was, the damage was arguably less than the long-term psychological damage inflicted by bringing up the child Catholic in the first place.”</i> – Richard Dawkins, The God Delusion, p. 317.  Dawkins then spends nine pages half-heartedly defending this assertion without ever examining the long-term psychological damage of sexual abuse.  Strike one.</p><blockquote><p>“Dawkins thinks humanity should follow Darwin just long enough to cast off Jesus Christ, then ditch Darwin in favor of following Richard Dawkins’ opinion on life, the universe and everything”</p><p>A ludicrous assertion without a shred of evidence to back it up.</p></blockquote><p>First, it’s bizarre to insist that one must present documented evidence in every op/ed column and interview.  And there’s loads of evidence to back this up in, unsurprisingly enough, Richard Dawkins’s writing: <i>“‘Let us understand, once for all, that the ethical progress of society depends not on imitating the cosmic process, still less in running away from it, but in combating it.”  That is G.C. Williams’s recommendation today and it is mine.”</i> – Richard Dawkins, A Devil’s Chaplain, p. 10.  And in <i>The God Delusion</i>, he pushes his form of secular humanism, including his personal recommendations for replacing at least four of the Ten Commandments in favor of commandments that he, the Archbishop of Oxford, has penned.</p><p><i>• Enjoy your own sex life (so long as it damages nobody else) and leave others to enjoy theirs in private whatever their inclinations, which are none of your business.<br>• Do not discriminate or oppress on the basis of sex, race or (as far as possible) species.<br>• Do not indoctrinate your children. Teach them how to think for themselves, how to evaluate evidence, and how to disagree with you.<br>• Value the future on a timescale longer than your own.</br></br></br></i></p><blockquote><p>So, rather than using “reason, science and historical documentation” to argue “the atheists into an inescapable corner”, you’ve employed blatant and crude straw men, ad hominem and hysterical, baseless assertions? Doesn’t bode well for the quality of the rest of the book, does it?</p></blockquote><p>“blatant and crude straw men, ad hominem and hysterical, baseless assertions” is a very strange way to describe accurate summaries supported by direct quotes from the original sources.  I will leave it to the reader to determine how this bodes for my book.  Sadly, Mono Ape is far from the first to attempt criticizing it without bothering to read it.</p><blockquote><p>“… atheism will never be a widespread phenomenon”</p><p>Someone better ‘phone Sweden and let them know – up to ~80% of Swedes profess no belief in gods, fairies, etc.</p></blockquote><p>Actually, the Eurostat report to which Mono Ape is obviously referring reports that “23% of Swedish citizens responded that “they believe there is a God”, whereas 53% answered that “they believe there is some sort of spirit or life force” and 23% that “they do not believe there is any sort of spirit, God, or life force”.”  100-(53+23)!=~80.  First Harris, then Dawkins, now this guy… what is it with atheists and their math delusions?  As I noted in TIA, the highest percentage of reported atheists anywhere in the West is the 32 percent reported in France by a very questionable Financial Times poll which is more than 2x the largest number reported in every other study, including much more extensive ones.</p><blockquote><p>The ‘irrational’ atheists will look forward to dismantling the rest of the book when it becomes available for download.</p></blockquote><p>I have no doubt whatsoever that they will do a similarly thorough and conclusive job of it, in keeping with this spectacular example.</p><p>Is Mono Ape ignorant or intellectually dishonest?  I really don’t know which is the more appropriate description of this feeble attempt at a critique <i>of an interview</i>, you’ll have to decide for yourselves.  But I have no need to create strawmen to attack, to be honest, the straw men I’d construct would almost surely be sturdier and more viable than the cases presented by the living, breathing atheists who seek to criticize me.</p></div>",
  "content_text": "People sometimes wonder why I demonstrate such open contempt for atheism.  I don’t fear atheists, I certainly don’t respect most of them – although I do respect atheist individuals such as Jonathan Haidt, Daniel Dennett and Brent Rasmussen, who have earned it – and I find that the lay atheist, like his heroes, tends to be incredibly obnoxious.  Mono Ape provides an excellent example of why this contempt is not merely justified, but demanded.  It would be easy to think that he is simply stupid based on the way he relies on assumptions, intuition and faulty logic rather than simply looking at the available evidence, except that one runs into this behavior time and time and time again with outspoken atheists.  Combined with their usual assertion of rational superiority and their demonstrated knowledge of common atheist talking points, this behavior increasingly tends to indicate intentional dishonesty rather than mere ignorance or unintellligence.  Mono Apes quotes my interview with Joseph Farah and writes:\n“… Dawkins’s stupid assertion that a religious upbringing is worse than sexual child abuse”\nProfessor Dawkins has never said any such thing. He had said that labelling a child ‘Christian’, ‘Muslim’, etc. is “a form of abuse”.\nHe did say it, by his own admission.  He also wrote it:\n““Once, in the question time after a lecture in Dublin, I was asked what I thought about the widely publicized cases of sexual abuse by Catholic priests in Ireland. I replied that, as horrible as sexual abuse no doubt was, the damage was arguably less than the long-term psychological damage inflicted by bringing up the child Catholic in the first place.”\n– Richard Dawkins, The God Delusion, p. 317.  Dawkins then spends nine pages half-heartedly defending this assertion without ever examining the long-term psychological damage of sexual abuse.  Strike one.\n“Dawkins thinks humanity should follow Darwin just long enough to cast off Jesus Christ, then ditch Darwin in favor of following Richard Dawkins’ opinion on life, the universe and everything”\nA ludicrous assertion without a shred of evidence to back it up.\nFirst, it’s bizarre to insist that one must present documented evidence in every op/ed column and interview.  And there’s loads of evidence to back this up in, unsurprisingly enough, Richard Dawkins’s writing:\n“‘Let us understand, once for all, that the ethical progress of society depends not on imitating the cosmic process, still less in running away from it, but in combating it.”  That is G.C. Williams’s recommendation today and it is mine.”\n– Richard Dawkins, A Devil’s Chaplain, p. 10.  And in\nThe God Delusion\n, he pushes his form of secular humanism, including his personal recommendations for replacing at least four of the Ten Commandments in favor of commandments that he, the Archbishop of Oxford, has penned.\n• Enjoy your own sex life (so long as it damages nobody else) and leave others to enjoy theirs in private whatever their inclinations, which are none of your business.\n• Do not discriminate or oppress on the basis of sex, race or (as far as possible) species.\n• Do not indoctrinate your children. Teach them how to think for themselves, how to evaluate evidence, and how to disagree with you.\n• Value the future on a timescale longer than your own.\nSo, rather than using “reason, science and historical documentation” to argue “the atheists into an inescapable corner”, you’ve employed blatant and crude straw men, ad hominem and hysterical, baseless assertions? Doesn’t bode well for the quality of the rest of the book, does it?\n“blatant and crude straw men, ad hominem and hysterical, baseless assertions” is a very strange way to describe accurate summaries supported by direct quotes from the original sources.  I will leave it to the reader to determine how this bodes for my book.  Sadly, Mono Ape is far from the first to attempt criticizing it without bothering to read it.\n“… atheism will never be a widespread phenomenon”\nSomeone better ‘phone Sweden and let them know – up to ~80% of Swedes profess no belief in gods, fairies, etc.\nActually, the Eurostat report to which Mono Ape is obviously referring reports that “23% of Swedish citizens responded that “they believe there is a God”, whereas 53% answered that “they believe there is some sort of spirit or life force” and 23% that “they do not believe there is any sort of spirit, God, or life force”.”  100-(53+23)!=~80.  First Harris, then Dawkins, now this guy… what is it with atheists and their math delusions?  As I noted in TIA, the highest percentage of reported atheists anywhere in the West is the 32 percent reported in France by a very questionable Financial Times poll which is more than 2x the largest number reported in every other study, including much more extensive ones.\nThe ‘irrational’ atheists will look forward to dismantling the rest of the book when it becomes available for download.\nI have no doubt whatsoever that they will do a similarly thorough and conclusive job of it, in keeping with this spectacular example.\nIs Mono Ape ignorant or intellectually dishonest?  I really don’t know which is the more appropriate description of this feeble attempt at a critique\nof an interview\n, you’ll have to decide for yourselves.  But I have no need to create strawmen to attack, to be honest, the straw men I’d construct would almost surely be sturdier and more viable than the cases presented by the living, breathing atheists who seek to criticize me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-29T08:25:00+00:00"
}