{
  "url": "https://voxday.net/2008/01/02/now-they-figure-it-ou/",
  "scraped_at": "2026-01-08T22:06:01.927239",
  "title": "NOW they figure it out?",
  "date_display": "January 2, 2008",
  "date_iso": "2008-01-02T18:04:00+00:00",
  "date_from_url": "2008-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m astonished by <a href=\"http://corner.nationalreview.com/post/?q=ZTc4ZDc4OGZhNDMzMDViNTk2MGUyYmE2OWQyYTRhNjU=\">the tone of surprise in Mark Steyn’s Corner post</a> about Giuliani’s unacceptability to nearly the entire Republican base.  This is not news, it’s precisely why I picked him in 2005 as being the most likely Republican sacrificial lamb in the elite’s attempt to hand the election to Hillary.</p><blockquote><p>I’m struck by how fierce hostility to the Mayor is. The media put this down to problems with “social conservatives”, but that underestimates the scale of the problem. Granite State libertarians and small-government types find his gun record unacceptable. Base-wise, that doesn’t leave a lot.</p></blockquote><p>How is this news?  Steyn is just noticing this NOW?  How in the name of the Galapagos Islands can anyone pay any attention to the political analysis of any commentator who seriously believed that Giuliani was ever a serious and viable candidate for the Presidency as a Republican?  (He could have been viable, perhaps, if he had switched parties and run as a Democrat.)  The only thing that’s surprising about any of this is that Giuliani is so utterly abhorrent to conservatives that he can’t even convincingly play the role of the fall guy.</p><p>Giuliani actually has less appeal to me than Obama, and I would vote for Captain Underoos before I’d vote for the Magic Negro.  I mean, both Romney and McCain are manifestly ridiculous as Republican candidates for various reasons, but one could at least construct a hypothetical case for why Republicans might support them.  What was supposed the basis of Giuliani’s appeal, that he “saved” New York City?  The problem, of course, is that at least one-third of the nation – and probably half of all Republicans – DESPISE New York City.  I know I do.</p><p>Like the TV show Heroes, NRO’s Manhattan conservatives just don’t seem to understand that New York!=world.  Merely calling him “the Mayor” is enough to cause a non-coastal to curl his lip at the Lisper.  I don’t subscribe to identity politics, much less geography politics, but it’s becoming increasingly apparent that the good folks at National Review have literally no idea what’s going on between the Left Coast and the other Left Coast.</p><p>UPDATE – I couldn’t help but notice that the difference between the reasons for supporting their chosen candidates given by these three libertarian-leaning professors polled by Volokh, two Ron Paul revolutionaries and one Giuliani supporter, is almost too funny for words.  You can read <a href=\"http://volokh.com/archives/archive_2007_12_30-2008_01_05.shtml#1199296287\">the thoughtful advocacy</a> of Ron Paul’s candidacy…. and the Giuliani supporter’s justification?  Well, <a href=\"http://volokh.com/archives/archive_2007_12_30-2008_01_05.shtml#1199295861\">he lived in New York City once</a>.  At least the man manages to accurately summarize the totality of Giuliani’s appeal.  Pity that that appeal is, at best, meaningless to <i>most of the 292 million people who live in that small part of the country that is not New York City.</i></p></div>",
  "content_text": "I’m astonished by\nthe tone of surprise in Mark Steyn’s Corner post\nabout Giuliani’s unacceptability to nearly the entire Republican base.  This is not news, it’s precisely why I picked him in 2005 as being the most likely Republican sacrificial lamb in the elite’s attempt to hand the election to Hillary.\nI’m struck by how fierce hostility to the Mayor is. The media put this down to problems with “social conservatives”, but that underestimates the scale of the problem. Granite State libertarians and small-government types find his gun record unacceptable. Base-wise, that doesn’t leave a lot.\nHow is this news?  Steyn is just noticing this NOW?  How in the name of the Galapagos Islands can anyone pay any attention to the political analysis of any commentator who seriously believed that Giuliani was ever a serious and viable candidate for the Presidency as a Republican?  (He could have been viable, perhaps, if he had switched parties and run as a Democrat.)  The only thing that’s surprising about any of this is that Giuliani is so utterly abhorrent to conservatives that he can’t even convincingly play the role of the fall guy.\nGiuliani actually has less appeal to me than Obama, and I would vote for Captain Underoos before I’d vote for the Magic Negro.  I mean, both Romney and McCain are manifestly ridiculous as Republican candidates for various reasons, but one could at least construct a hypothetical case for why Republicans might support them.  What was supposed the basis of Giuliani’s appeal, that he “saved” New York City?  The problem, of course, is that at least one-third of the nation – and probably half of all Republicans – DESPISE New York City.  I know I do.\nLike the TV show Heroes, NRO’s Manhattan conservatives just don’t seem to understand that New York!=world.  Merely calling him “the Mayor” is enough to cause a non-coastal to curl his lip at the Lisper.  I don’t subscribe to identity politics, much less geography politics, but it’s becoming increasingly apparent that the good folks at National Review have literally no idea what’s going on between the Left Coast and the other Left Coast.\nUPDATE – I couldn’t help but notice that the difference between the reasons for supporting their chosen candidates given by these three libertarian-leaning professors polled by Volokh, two Ron Paul revolutionaries and one Giuliani supporter, is almost too funny for words.  You can read\nthe thoughtful advocacy\nof Ron Paul’s candidacy…. and the Giuliani supporter’s justification?  Well,\nhe lived in New York City once\n.  At least the man manages to accurately summarize the totality of Giuliani’s appeal.  Pity that that appeal is, at best, meaningless to\nmost of the 292 million people who live in that small part of the country that is not New York City.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-02T18:04:00+00:00"
}