{
  "url": "https://voxday.net/2008/01/22/of-decks-and-stacking-thereof/",
  "scraped_at": "2026-01-08T22:08:54.588954",
  "title": "Of decks and the stacking thereof",
  "date_display": "January 22, 2008",
  "date_iso": "2008-01-22T14:40:00+00:00",
  "date_from_url": "2008-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ complains that <a href=\"http://scienceblogs.com/pharyngula/2008/01/hitchens_has_big_brass_ones.php\">Christopher Hitchens can’t expect fair moderation</a>:</p><blockquote><p>t takes some confidence to charge into this: Hitchens will be debating Jay Richards (of the Discovery Institute), with Ben Stein as “moderator”, in an event sponsored by the Stanford IDEA club. The creationists are stacking the deck against him rather thoroughly.</p></blockquote><p>You know, I don’t recall ever seeing PZ complain about a debate featuring a Democratic politician versus a Republican politician with the likes of Chris Matthews or Wolf Blitzer mediating….</p><p>As for the Hitchens-Richards debate, ye cats, I think I’d pay to avoid witnessing that debacle.  I don’t know who Richards is and Hitchens knows less about evolution than PZ thinks your average creationist does.  Of course, anyone who’s read <i>god is Not Great</i> is aware that Hitchens isn’t one to let his complete ignorance of the subject matter to slow him down in the slightest.</p></div>",
  "content_text": "PZ complains that\nChristopher Hitchens can’t expect fair moderation\n:\nt takes some confidence to charge into this: Hitchens will be debating Jay Richards (of the Discovery Institute), with Ben Stein as “moderator”, in an event sponsored by the Stanford IDEA club. The creationists are stacking the deck against him rather thoroughly.\nYou know, I don’t recall ever seeing PZ complain about a debate featuring a Democratic politician versus a Republican politician with the likes of Chris Matthews or Wolf Blitzer mediating….\nAs for the Hitchens-Richards debate, ye cats, I think I’d pay to avoid witnessing that debacle.  I don’t know who Richards is and Hitchens knows less about evolution than PZ thinks your average creationist does.  Of course, anyone who’s read\ngod is Not Great\nis aware that Hitchens isn’t one to let his complete ignorance of the subject matter to slow him down in the slightest.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-22T14:40:00+00:00"
}