{
  "url": "https://voxday.net/2008/01/05/only-serious-candidate/",
  "scraped_at": "2026-01-08T22:06:22.025628",
  "title": "America or Mexameristan",
  "date_display": "January 5, 2008",
  "date_iso": "2008-01-05T09:25:00+00:00",
  "date_from_url": "2008-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Paul <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59551\">comes out hard against migration</a>:</p><blockquote><p>A controversial new anti-illegal-immigration ad by GOP presidential hopeful Ron Paul has sent his libertarian supporters into high dudgeon, but it’s getting rave reviews from border-security hawks, including some Homeland Security officials.</p><p>In a surprise move, the strict constitutionalist has taken aim at the 14th Amendment as part of a proposal to control growing illegal immigration. U.S. Rep. Paul, R-Texas, proposes repealing the provision that gives automatic citizenship to children born in the U.S., even if their parents enter the country illegally.</p><p>“Ron Paul wants border security now,” his new campaign ad asserts. “Physically secure the border. No amnesty. No welfare to illegal aliens. End birthright citizenship. No more student visas from terrorist nations.”</p></blockquote><p>This ad should be of significant appeal to those Americans who prefer America to Mexameristan and should make it increasingly difficult for the media to continue misrepresenting his position by conflating it with the Libertarian Party one.  And this is good news, as it’s a vital and necessary policy on which the other candidates should be forced to explain their position.</p><p>I suspect the number of voters who are interested in increasing the number of <a href=\"http://www.washingtontimes.com/apps/pbcs.dll/article?AID=/20080103/NATION/673817768/1001\">honor killings</a> and <a href=\"http://www.nytimes.com/2007/12/18/world/americas/18mexico.html\">country music murders</a> bears a direct relationship to the number of new citizens that have been created in the last two decades.</p><p>Pat Buchanan <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59545\">clearly recognizes this</a>, although he would appear to be leaning slightly towards Huckabee rather than Paul on the basis of the former’s economic populism: <i>What has alienated America is the Bush bellicosity, the my-way-or-the-highway free-trade ideology, the refusal to defend the border with the implication that anyone who wants to preserve the country he grew up in is some kind of bigot. The Party of Reagan is losing the country because it is no longer the party of the principles, policies and persona of Reagan, as applied to the problems of our time. </i></p></div>",
  "content_text": "Ron Paul\ncomes out hard against migration\n:\nA controversial new anti-illegal-immigration ad by GOP presidential hopeful Ron Paul has sent his libertarian supporters into high dudgeon, but it’s getting rave reviews from border-security hawks, including some Homeland Security officials.\nIn a surprise move, the strict constitutionalist has taken aim at the 14th Amendment as part of a proposal to control growing illegal immigration. U.S. Rep. Paul, R-Texas, proposes repealing the provision that gives automatic citizenship to children born in the U.S., even if their parents enter the country illegally.\n“Ron Paul wants border security now,” his new campaign ad asserts. “Physically secure the border. No amnesty. No welfare to illegal aliens. End birthright citizenship. No more student visas from terrorist nations.”\nThis ad should be of significant appeal to those Americans who prefer America to Mexameristan and should make it increasingly difficult for the media to continue misrepresenting his position by conflating it with the Libertarian Party one.  And this is good news, as it’s a vital and necessary policy on which the other candidates should be forced to explain their position.\nI suspect the number of voters who are interested in increasing the number of\nhonor killings\nand\ncountry music murders\nbears a direct relationship to the number of new citizens that have been created in the last two decades.\nPat Buchanan\nclearly recognizes this\n, although he would appear to be leaning slightly towards Huckabee rather than Paul on the basis of the former’s economic populism:\nWhat has alienated America is the Bush bellicosity, the my-way-or-the-highway free-trade ideology, the refusal to defend the border with the implication that anyone who wants to preserve the country he grew up in is some kind of bigot. The Party of Reagan is losing the country because it is no longer the party of the principles, policies and persona of Reagan, as applied to the problems of our time.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-05T09:25:00+00:00"
}