{
  "url": "https://voxday.net/2008/01/28/open-mind-of-atheis/",
  "scraped_at": "2026-01-08T22:09:36.928978",
  "title": "The open mind of the atheist",
  "date_display": "January 28, 2008",
  "date_iso": "2008-01-28T09:06:00+00:00",
  "date_from_url": "2008-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think it may amuse you nearly as much as it amused me to learn that you can’t pay a self-proclaimed freethinker.  A little more than a week ago, I happened to read Dr. PZ Myers heartwrenching plea <a href=\"http://scienceblogs.com/pharyngula/2008/01/tune_in_sunday_morning.php\">to help the poor starving atheists at Air America</a>.  PZ, who features in not one, but two TIA cameos, is apparently a regular guest on the show and he made this request:</p><blockquote><p>Remember—every Sunday at 9am, you Minnesotans (and clever others) can listen to the Minnesota Atheists radio program on Air America. Tune in tomorrow — it’s especially important since I’ve heard that Air America has actually already lost one advertiser because they had the gall to actually allow atheists to broadcast on their show. We’ll have to demonstrate that the program can get a strong audience, so listen in, call in, and if you have a business that you advertise on the radio, think about buying some time on the show.</p></blockquote><p>Being a soft-hearted, compassionate and ecumenical chap, I was quite naturally touched by their plight and outraged at the callous decision of that nameless advertiser to deny the important and timely message of God’s continued non-existence to the listeners of America.  (Complete with updates on the status of Generalissimo Francisco Franco on the hour, no doubt.)  Choking back my tears, I determined that I would stand in the gap in this dire time of need, for did I not have a book forthcoming that would be of no little interest to the very audience which made bestsellers out of the presumably uninspired scribblings of Richard Dawkins, Sam Harris, and yea, even Christopher Hitchens?</p><p>So, a week ago, I sent MN Atheists the following email: <i>“I am interested in becoming an advertiser of your new radio show on Air America.  Please let me know about your various sponsorship and advertising options.” </i></p><p>They responded with an email that neglected to provide the requested information, but instead mentioned that my website appeared to be a very conservative and religious one, and that it hadn’t occurred to them to “advertise our opposition”.  I replied: <i>“It’s a libertarian site, not conservative one, but I am a Christian, yes….  I’m simply interested in knowing your standard rates for the various advertising packages because I expect many atheists will be interested in reading my forthcoming book, <b>The Irrational Atheist</b>, just as many Christians, including myself, have read the various books by Richard Dawkins, Sam Harris and company.”</i></p><p>I still didn’t receive any information on their advertising rates, in fact, I didn’t receive anything for three more days, until after a third email to them, MN Atheists finally informed me that while atheists and Christians might read each other’s books, they had no intention of permitting me to advertise <i>The Irrational Atheist</i> on their show.</p><p>Now, don’t get me wrong, denying an advertisement for TIA on their show is ABSOLUTELY their right.  MN Atheists have the right to turn down advertising sponsorships for “Minnesota Atheists Talk”, just as Air America’s former advertisers have the right to pull their sponsorships.  Still, the decision to reject Christian advertising for their radio show would appear to render PZ’s plea about the importance of their need for advertisers to be more than a little empty, and I suggest that the rational observer should treat any claim by MN Atheists to be open-minded, freethinking or financially needy with the same high level of skepticism that MN Atheists themselves show the Holy Bible.</p><p>As for any complaints about advertisers leaving Air America over their atheism, well, that obviously merits nothing more than merciless ridicule.  What’s good for the godless is good for the gander.</p></div>",
  "content_text": "I think it may amuse you nearly as much as it amused me to learn that you can’t pay a self-proclaimed freethinker.  A little more than a week ago, I happened to read Dr. PZ Myers heartwrenching plea\nto help the poor starving atheists at Air America\n.  PZ, who features in not one, but two TIA cameos, is apparently a regular guest on the show and he made this request:\nRemember—every Sunday at 9am, you Minnesotans (and clever others) can listen to the Minnesota Atheists radio program on Air America. Tune in tomorrow — it’s especially important since I’ve heard that Air America has actually already lost one advertiser because they had the gall to actually allow atheists to broadcast on their show. We’ll have to demonstrate that the program can get a strong audience, so listen in, call in, and if you have a business that you advertise on the radio, think about buying some time on the show.\nBeing a soft-hearted, compassionate and ecumenical chap, I was quite naturally touched by their plight and outraged at the callous decision of that nameless advertiser to deny the important and timely message of God’s continued non-existence to the listeners of America.  (Complete with updates on the status of Generalissimo Francisco Franco on the hour, no doubt.)  Choking back my tears, I determined that I would stand in the gap in this dire time of need, for did I not have a book forthcoming that would be of no little interest to the very audience which made bestsellers out of the presumably uninspired scribblings of Richard Dawkins, Sam Harris, and yea, even Christopher Hitchens?\nSo, a week ago, I sent MN Atheists the following email:\n“I am interested in becoming an advertiser of your new radio show on Air America.  Please let me know about your various sponsorship and advertising options.”\nThey responded with an email that neglected to provide the requested information, but instead mentioned that my website appeared to be a very conservative and religious one, and that it hadn’t occurred to them to “advertise our opposition”.  I replied:\n“It’s a libertarian site, not conservative one, but I am a Christian, yes….  I’m simply interested in knowing your standard rates for the various advertising packages because I expect many atheists will be interested in reading my forthcoming book,\nThe Irrational Atheist\n, just as many Christians, including myself, have read the various books by Richard Dawkins, Sam Harris and company.”\nI still didn’t receive any information on their advertising rates, in fact, I didn’t receive anything for three more days, until after a third email to them, MN Atheists finally informed me that while atheists and Christians might read each other’s books, they had no intention of permitting me to advertise\nThe Irrational Atheist\non their show.\nNow, don’t get me wrong, denying an advertisement for TIA on their show is ABSOLUTELY their right.  MN Atheists have the right to turn down advertising sponsorships for “Minnesota Atheists Talk”, just as Air America’s former advertisers have the right to pull their sponsorships.  Still, the decision to reject Christian advertising for their radio show would appear to render PZ’s plea about the importance of their need for advertisers to be more than a little empty, and I suggest that the rational observer should treat any claim by MN Atheists to be open-minded, freethinking or financially needy with the same high level of skepticism that MN Atheists themselves show the Holy Bible.\nAs for any complaints about advertisers leaving Air America over their atheism, well, that obviously merits nothing more than merciless ridicule.  What’s good for the godless is good for the gander.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-28T09:06:00+00:00"
}