{
  "url": "https://voxday.net/2008/01/27/passionate-profession/",
  "scraped_at": "2026-01-08T22:09:29.640781",
  "title": "The passionate “profession”",
  "date_display": "January 27, 2008",
  "date_iso": "2008-01-27T12:28:00+00:00",
  "date_from_url": "2008-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re clueless and you get paid by a media organization to demonstrate that cluelessness in public, <a href=\"http://piquancy.blogspot.com/2008/01/is-money-only-difference-between.html\">you’re a journalist</a>.  If you think that having heard of something once or having been there once means that you know all about that concept or location, you’re a journalist.  If you write about yourself every single freaking time you touch the keyboard, then you’re either a blogger or a female journalist working for ESPN.  (Okay, that’s not quite fair, the ESPN ladies occasionally write about lesbian rights and the WNBA, assuming those are actually two different topics.)  If you ever a) publish pictures of bikini-clad and/or naked women, b) sprinkle your text with four-letter words considered vulgar, or c) mention the forbidden words “Ron Paul”, you are clearly a blogger.</p><blockquote><p>While debating this topic with a journalist friend, it suddenly heated up and she said that journalism requires passion and that I do not have this passion and more importantly I would not understand this passion.</p></blockquote><p>And my journalist acquaintances wonder when I show open amusement at their passionate insistence that they are practicing a genuine “profession”.  I think it actually upsets a few of them that I so vehemently deny being a journalist in any way shape or form, or maybe it’s just my oft-stated belief that prostitution is a more venerable and more honorable calling.</p></div>",
  "content_text": "If you’re clueless and you get paid by a media organization to demonstrate that cluelessness in public,\nyou’re a journalist\n.  If you think that having heard of something once or having been there once means that you know all about that concept or location, you’re a journalist.  If you write about yourself every single freaking time you touch the keyboard, then you’re either a blogger or a female journalist working for ESPN.  (Okay, that’s not quite fair, the ESPN ladies occasionally write about lesbian rights and the WNBA, assuming those are actually two different topics.)  If you ever a) publish pictures of bikini-clad and/or naked women, b) sprinkle your text with four-letter words considered vulgar, or c) mention the forbidden words “Ron Paul”, you are clearly a blogger.\nWhile debating this topic with a journalist friend, it suddenly heated up and she said that journalism requires passion and that I do not have this passion and more importantly I would not understand this passion.\nAnd my journalist acquaintances wonder when I show open amusement at their passionate insistence that they are practicing a genuine “profession”.  I think it actually upsets a few of them that I so vehemently deny being a journalist in any way shape or form, or maybe it’s just my oft-stated belief that prostitution is a more venerable and more honorable calling.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-27T12:28:00+00:00"
}