{
  "url": "https://voxday.net/2008/01/18/ponnuru-slaps-down-david-fru/",
  "scraped_at": "2026-01-08T22:08:14.440207",
  "title": "Ponnuru slaps down David Frum",
  "date_display": "January 18, 2008",
  "date_iso": "2008-01-18T09:01:00+00:00",
  "date_from_url": "2008-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I haven’t read <i>Comeback</i>.  Nor am I likely to, considering the author’s very poor track record when it comes to political analysis.  (Given that he’s quite good at exhortation, I have no idea why he insists on banging his head on a wall that is obviously beyond his ability to either scale or knock down.)  But even from Frum’s own brief description of the book, it was quite clear that if his diagnosis of conservatism’s plight was correct – and it may well be – his prescribed treatment could not possibly be, <a href=\"http://article.nationalreview.com/?q=Mzg3NDE2YzllNDkxZDg5OWZkYWQ4NzJiMmE1MGYxNjU=\">as Ramesh confirms</a>:</p><blockquote><p>[L]et me point out that in an entire book about how conservatives and Republicans can make a comeback, at no point does Frum offer a word of advice about which voters are likely recruits for a new center-right coalition. So it isn’t as though Frum can say that the strategy he recommends is superior to the one Lowry and I discuss. He has none….  (My chief problem with Frum’s “empiricism” is that it is mostly theoretical.)</p></blockquote><p>And that, in a nutshell, is why Frum is such a terrible analyst despite his stylistic skills and intelligence.  Very much like the New Atheists, he substitutes logic for data and calls it an empirical approach.  This oxymoronic approach allows a thinker to assemble trains of thought that sound plausible enough, but are bound to end up as flaming wreckage as soon as they run up against reality or a genuinely empirical thinker who has taken the time to assemble the relevant factual information.</p><p>It also explains his bizarre position on currency economics, as he avoids taking the long and appalling history of fiat currencies into account by simply ignoring the literal centuries of empirical data on their historical performance in favor of Keynesian theory.</p></div>",
  "content_text": "I haven’t read\nComeback\n.  Nor am I likely to, considering the author’s very poor track record when it comes to political analysis.  (Given that he’s quite good at exhortation, I have no idea why he insists on banging his head on a wall that is obviously beyond his ability to either scale or knock down.)  But even from Frum’s own brief description of the book, it was quite clear that if his diagnosis of conservatism’s plight was correct – and it may well be – his prescribed treatment could not possibly be,\nas Ramesh confirms\n:\n[L]et me point out that in an entire book about how conservatives and Republicans can make a comeback, at no point does Frum offer a word of advice about which voters are likely recruits for a new center-right coalition. So it isn’t as though Frum can say that the strategy he recommends is superior to the one Lowry and I discuss. He has none….  (My chief problem with Frum’s “empiricism” is that it is mostly theoretical.)\nAnd that, in a nutshell, is why Frum is such a terrible analyst despite his stylistic skills and intelligence.  Very much like the New Atheists, he substitutes logic for data and calls it an empirical approach.  This oxymoronic approach allows a thinker to assemble trains of thought that sound plausible enough, but are bound to end up as flaming wreckage as soon as they run up against reality or a genuinely empirical thinker who has taken the time to assemble the relevant factual information.\nIt also explains his bizarre position on currency economics, as he avoids taking the long and appalling history of fiat currencies into account by simply ignoring the literal centuries of empirical data on their historical performance in favor of Keynesian theory.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-18T09:01:00+00:00"
}