{
  "url": "https://voxday.net/2008/01/19/ponnuru-tires-of-punching-fru/",
  "scraped_at": "2026-01-08T22:08:25.324687",
  "title": "Ponnuru tires of punching Frum",
  "date_display": "January 19, 2008",
  "date_iso": "2008-01-19T08:48:00+00:00",
  "date_from_url": "2008-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://corner.nationalreview.com/post/?q=OWQ5YjhmNzdlNGZkMTFmMmE1ZTg4MDJhZmU4YTdiMmM=\">goes to the ground and pound</a>:</p><blockquote><p>As for my comment that Frum’s empiricism is theoretical, let me amplify it here: Frum has a knack for finding the arresting fact that is interesting, if true. The trouble is that too many of his facts are not true. I find that none of his facts can be trusted without independent verification. Again and again when one looks at the evidence underlying his claims, it falls short.</p></blockquote><p>Reading this, the first thing I thought was “yeah, that’s going to sting”.  And the second thing was “I’ll bet Frum is going to be dumb enough to demand some examples from Ramesh.”  After all, based on <a href=\"http://www.milobookclub.com/2008/01/01/wrong-by-his-own-standard/\">our recent experience of him</a>, Frum has the courage and judgment of an intoxicated man determined to enter the tiger’s cage.</p><p>So it didn’t surprise me in the least when Frum did exactly as I’d thought he would, <a href=\"http://frum.nationalreview.com/post/?q=ZDU3OWMzZjU4NTkwYzc3ZmVhNGRmMGZkZTM5MTA0M2M=\">making this all-too-predictable defense in which he only manages to set himself up for a jaw-breaking smackdown</a>: <i>“Well, since I myself provide the verification in the form of dozens of footnotes citing Census, Federal Reserve, polling, and other data, the task of testing the truth of what I say should not prove too difficult.  But so narrowly literal a response does not do justice to the weird combination of vitriol and grandiosity that increasingly characterizes Ramesh’s contributions to this discussion.”</i></p><p>One can almost hear Ramesh sighing and shaking his head before he unloads.  In response to Frum’s “dozens of footnotes”, he points out how Frum, rather like the proverbial Nietzsche-reading ape, may cite the Census, the Federal Reserve, polling and other data, <i>but he does not understand it!</i> By way of specific example, Ramesh shows how Frum confuses an increase OF 10,000 to 60,000 (in other words, from 50,000 to 60,000) with an increase FROM 10,000 to 60,000.</p><blockquote><p><b>Frum’s Reign of Error</b></p><p>A sixfold increase in the Latino population—that’s a striking illustration of several of the trends Frum writes about in his book…. Later I checked Frum’s footnote, which directs you to a New York Times story. Here’s what it says:</p><p><i>According to the Louisiana Health and Population Survey, released in November, the number of Latinos living in households in Orleans and Jefferson Parishes has increased by about 10,000 since 2004, to 60,000.</i></p><p>So instead of a 500 percent increase, there was a 20 percent increase. There’s David Frum’s vaunted empiricism for you.</p><p>I didn’t have time to check every claim in the book. Usually when I did check one of his claims, though, it didn’t bear out…. I will persist in holding that his book has some real insights about what’s wrong with conservatism. But among its flaws is a pervasive sloppiness with the facts it prides itself on facing.</p></blockquote><p>Garbage in, garbage out.  Instead of trying to defend his shoddy work and making bitchy little comments about what he imagines is Ponnuru’s grandiosity, Frum would do better to accept the criticism and learn to be more meticulous.  He would also be wise to stop trying to pick arguments with people who are more empirically minded and eminently capable of calling him out on his ignorant flights of logical fantasy.</p><p>For as Eco quotes Aquinas: “<i>vires coporales subicuintur viribus animalibus, vires animales intellectualbus, et intellectuales practicae speculativis… ideo simpliciter veritas dignior est et excellentior et fortior.”</i></p></div>",
  "content_text": "And\ngoes to the ground and pound\n:\nAs for my comment that Frum’s empiricism is theoretical, let me amplify it here: Frum has a knack for finding the arresting fact that is interesting, if true. The trouble is that too many of his facts are not true. I find that none of his facts can be trusted without independent verification. Again and again when one looks at the evidence underlying his claims, it falls short.\nReading this, the first thing I thought was “yeah, that’s going to sting”.  And the second thing was “I’ll bet Frum is going to be dumb enough to demand some examples from Ramesh.”  After all, based on\nour recent experience of him\n, Frum has the courage and judgment of an intoxicated man determined to enter the tiger’s cage.\nSo it didn’t surprise me in the least when Frum did exactly as I’d thought he would,\nmaking this all-too-predictable defense in which he only manages to set himself up for a jaw-breaking smackdown\n:\n“Well, since I myself provide the verification in the form of dozens of footnotes citing Census, Federal Reserve, polling, and other data, the task of testing the truth of what I say should not prove too difficult.  But so narrowly literal a response does not do justice to the weird combination of vitriol and grandiosity that increasingly characterizes Ramesh’s contributions to this discussion.”\nOne can almost hear Ramesh sighing and shaking his head before he unloads.  In response to Frum’s “dozens of footnotes”, he points out how Frum, rather like the proverbial Nietzsche-reading ape, may cite the Census, the Federal Reserve, polling and other data,\nbut he does not understand it!\nBy way of specific example, Ramesh shows how Frum confuses an increase OF 10,000 to 60,000 (in other words, from 50,000 to 60,000) with an increase FROM 10,000 to 60,000.\nFrum’s Reign of Error\nA sixfold increase in the Latino population—that’s a striking illustration of several of the trends Frum writes about in his book…. Later I checked Frum’s footnote, which directs you to a New York Times story. Here’s what it says:\nAccording to the Louisiana Health and Population Survey, released in November, the number of Latinos living in households in Orleans and Jefferson Parishes has increased by about 10,000 since 2004, to 60,000.\nSo instead of a 500 percent increase, there was a 20 percent increase. There’s David Frum’s vaunted empiricism for you.\nI didn’t have time to check every claim in the book. Usually when I did check one of his claims, though, it didn’t bear out…. I will persist in holding that his book has some real insights about what’s wrong with conservatism. But among its flaws is a pervasive sloppiness with the facts it prides itself on facing.\nGarbage in, garbage out.  Instead of trying to defend his shoddy work and making bitchy little comments about what he imagines is Ponnuru’s grandiosity, Frum would do better to accept the criticism and learn to be more meticulous.  He would also be wise to stop trying to pick arguments with people who are more empirically minded and eminently capable of calling him out on his ignorant flights of logical fantasy.\nFor as Eco quotes Aquinas: “\nvires coporales subicuintur viribus animalibus, vires animales intellectualbus, et intellectuales practicae speculativis… ideo simpliciter veritas dignior est et excellentior et fortior.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-19T08:48:00+00:00"
}