{
  "url": "https://voxday.net/2008/01/24/principles-of-illogic/",
  "scraped_at": "2026-01-08T22:09:07.431055",
  "title": "Principles of illogic",
  "date_display": "January 24, 2008",
  "date_iso": "2008-01-24T09:06:00+00:00",
  "date_from_url": "2008-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know most college graduates are very poorly educated.  But one would think that even a maleducated individual might be able to discern the difference between an actual principle of logic and a well-known quote from a pop scientist:</p><blockquote><p>I can now move on to logical principles that are easy to grasp that, since their discovery, have proven to be valuable tools in advancing the human condition just as assuredly as the wheel and fire have.  One of these principles states that, “extraordinary claims require extraordinary evidence.” Any claim that contravenes the natural order is extraordinary.</p></blockquote><p>First, our intrepid college atheist clearly isn’t aware that this “time-tested” principle of logic is merely a popular Carl Sagan quote.  Ironically, one can just as conclusively “prove” the existence of God with another time-tested principle of logic from the same source: “Absence of evidence is not evidence of absence.”</p><p>However, this “time-tested principle” actually appears to date all the way back to 1987 and a professor of sociology named Marcello Truzzi who founded the <i>Skeptical Inquirer</i>.  Not only has it been markedly less useful to humanity than the wheel and fire, it’s entirely useless since it doesn’t define “extraordinary” with any useful metric.  It is the intellectual offspring of David Hume’s oxymoronic statement that only a miracle can prove a miracle.  So, even if David Hume had witnessed such a conclusive miracle-proving miracle, his only means of proving it to others would be to provide testimonial eyewitness evidence of the very sort that he previously claimed insufficient to prove what he now knows to be true.</p><p>However one may reaonably describe the “extraordinary claims” principle, “logical” and “time-tested” are not among the options.  Nor has it proven to be useful to anyone other than atheists attempting to snow the insufficiently educated.</p></div>",
  "content_text": "I know most college graduates are very poorly educated.  But one would think that even a maleducated individual might be able to discern the difference between an actual principle of logic and a well-known quote from a pop scientist:\nI can now move on to logical principles that are easy to grasp that, since their discovery, have proven to be valuable tools in advancing the human condition just as assuredly as the wheel and fire have.  One of these principles states that, “extraordinary claims require extraordinary evidence.” Any claim that contravenes the natural order is extraordinary.\nFirst, our intrepid college atheist clearly isn’t aware that this “time-tested” principle of logic is merely a popular Carl Sagan quote.  Ironically, one can just as conclusively “prove” the existence of God with another time-tested principle of logic from the same source: “Absence of evidence is not evidence of absence.”\nHowever, this “time-tested principle” actually appears to date all the way back to 1987 and a professor of sociology named Marcello Truzzi who founded the\nSkeptical Inquirer\n.  Not only has it been markedly less useful to humanity than the wheel and fire, it’s entirely useless since it doesn’t define “extraordinary” with any useful metric.  It is the intellectual offspring of David Hume’s oxymoronic statement that only a miracle can prove a miracle.  So, even if David Hume had witnessed such a conclusive miracle-proving miracle, his only means of proving it to others would be to provide testimonial eyewitness evidence of the very sort that he previously claimed insufficient to prove what he now knows to be true.\nHowever one may reaonably describe the “extraordinary claims” principle, “logical” and “time-tested” are not among the options.  Nor has it proven to be useful to anyone other than atheists attempting to snow the insufficiently educated.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-24T09:06:00+00:00"
}