{
  "url": "https://voxday.net/2008/01/19/rack-rally-and-surge/",
  "scraped_at": "2026-01-08T22:08:30.764988",
  "title": "Rack, rally and SURGE",
  "date_display": "January 19, 2008",
  "date_iso": "2008-01-19T19:19:00+00:00",
  "date_from_url": "2008-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the plan for tonight, as I’m going to try to get a bit of sleep, then throw down a few <i>cappuci</i> before appearing on Kriston’s <a href=\"http://www.cyber-line.com\">Cyber-Line show</a> at 10:15 PM (CST).  Swing by and see if any of the Ilk manage to score any points according to Nate’s scoreboard.  The book surge starts an hour and fifteen minutes before that and will run from 9 PM tonight to 9 PM tomorrow night, (again Central time), so it occurs to me that perhaps I should offer those still sitting on the fence some reasons to consider participating in <a href=\"http://rantingroom.blogspot.com/2008/01/of-market-surges-and-sales-rankings.html\">the Amazon order surge</a>.</p><p>1.  As anticipated, the media has decided that whereas the New Atheists are an Exciting Story requiring extensive coverage, all responses to them are old news and should not be mentioned in the press for any reason.  Only a higher profile, like <i>The Irrational Atheist</i> becoming a bestseller of one sort or another, will force the general media to acknowledge its existence.   Thanks to my iconoclastic standing in both the conservative and Christian medias, the same is apparently true for those as well.  You’d think for all the complaints that have been written about Dawkins and company, there would have been a lot of interest in TIA.  But according to the publicist, even Christianity Today is sticking with the “old news” line.  Because, you know, no one ever wrote anything about God or atheism before 2003….</p><p>2.  Christians often find themselves encountering the same atheist talking points over and over and over again. TIA provides the Christian with detailed, well-documented and devastating responses to most of the ones you’ve heard before and more than a few that you haven’t.  And yet, unlike most of the books with which it is occasionally confused, TIA is not an apologetic, it is an assault.</p><p>3.  Many children raised in religious homes are sheltered and never have the benefit of hearing the best arguments for atheism in an environment that does not foster it.  So, when they first encounter them in the university setting, they are ill-prepared to understand the full extent to which they are being sold a false bill of goods.  For the university student or university student-to-be, TIA is equally effective as an intellectual vaccination or post-facto antidote.</p><p>4.  Many atheists consider themselves to be the heirs of the Enlightenment and champions of human reason.  TIA is an avowed challenge to that claim as well as to many reasons historically given to justify non-belief in God and/or anti-religious sentiments.  Anyone who is genuinely dedicated to reason should feel at least some responsibility to give these challenges a dispassionate, even-handed examination.</p><p>5.  If you’re a longtime fan, then you’ll know that this is one of the few times you’ll be given the chance to vote with your dollar.  I’m not going to pull a Sally Struthers on you and pretend that I need the money; most of you know perfectly well that I don’t.  But this isn’t about the money and I certainly wouldn’t ask you to participate if it was.  And if you can’t afford it, no worries, I’ll have free downloads of the text available in two weeks.</p><p>Perhaps some of those here can think of one or two additional reasons, but whatever your motivation, I hope you’ll consider taking part in the TIA surge over the coming 24 hours.  For the most effective way to participate, <a href=\"http://rantingroom.blogspot.com/2008/01/of-market-surges-and-sales-rankings.html\">here are the instructions for doing so</a>.</p></div>",
  "content_text": "That’s the plan for tonight, as I’m going to try to get a bit of sleep, then throw down a few\ncappuci\nbefore appearing on Kriston’s\nCyber-Line show\nat 10:15 PM (CST).  Swing by and see if any of the Ilk manage to score any points according to Nate’s scoreboard.  The book surge starts an hour and fifteen minutes before that and will run from 9 PM tonight to 9 PM tomorrow night, (again Central time), so it occurs to me that perhaps I should offer those still sitting on the fence some reasons to consider participating in\nthe Amazon order surge\n.\n1.  As anticipated, the media has decided that whereas the New Atheists are an Exciting Story requiring extensive coverage, all responses to them are old news and should not be mentioned in the press for any reason.  Only a higher profile, like\nThe Irrational Atheist\nbecoming a bestseller of one sort or another, will force the general media to acknowledge its existence.   Thanks to my iconoclastic standing in both the conservative and Christian medias, the same is apparently true for those as well.  You’d think for all the complaints that have been written about Dawkins and company, there would have been a lot of interest in TIA.  But according to the publicist, even Christianity Today is sticking with the “old news” line.  Because, you know, no one ever wrote anything about God or atheism before 2003….\n2.  Christians often find themselves encountering the same atheist talking points over and over and over again. TIA provides the Christian with detailed, well-documented and devastating responses to most of the ones you’ve heard before and more than a few that you haven’t.  And yet, unlike most of the books with which it is occasionally confused, TIA is not an apologetic, it is an assault.\n3.  Many children raised in religious homes are sheltered and never have the benefit of hearing the best arguments for atheism in an environment that does not foster it.  So, when they first encounter them in the university setting, they are ill-prepared to understand the full extent to which they are being sold a false bill of goods.  For the university student or university student-to-be, TIA is equally effective as an intellectual vaccination or post-facto antidote.\n4.  Many atheists consider themselves to be the heirs of the Enlightenment and champions of human reason.  TIA is an avowed challenge to that claim as well as to many reasons historically given to justify non-belief in God and/or anti-religious sentiments.  Anyone who is genuinely dedicated to reason should feel at least some responsibility to give these challenges a dispassionate, even-handed examination.\n5.  If you’re a longtime fan, then you’ll know that this is one of the few times you’ll be given the chance to vote with your dollar.  I’m not going to pull a Sally Struthers on you and pretend that I need the money; most of you know perfectly well that I don’t.  But this isn’t about the money and I certainly wouldn’t ask you to participate if it was.  And if you can’t afford it, no worries, I’ll have free downloads of the text available in two weeks.\nPerhaps some of those here can think of one or two additional reasons, but whatever your motivation, I hope you’ll consider taking part in the TIA surge over the coming 24 hours.  For the most effective way to participate,\nhere are the instructions for doing so\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-19T19:19:00+00:00"
}