{
  "url": "https://voxday.net/2008/01/10/red-flags/",
  "scraped_at": "2026-01-08T22:07:06.253731",
  "title": "Red flags",
  "date_display": "January 10, 2008",
  "date_iso": "2008-01-10T16:57:00+00:00",
  "date_from_url": "2008-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always marveled at how some of the Austrian economists had the foresight to depart Austria and Germany so long before the evil of the Nazi regime became apparent to the world at large.  Now, I’m wondering how so many Americans can be so blind as to fail to recognize the mutation of their nation <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=59616\">into a police terror state</a>:</p><blockquote><p>The mother of an 11-year-old boy abducted by SWAT team members and taken to a hospital after he was bruised while horsing around is warning members of her community of the “Nazi” tactics she endured, including a statement from the officers that her “rights” were “only in the movies.”</p><p>The case involves Jon Shiflet, who injured himself while trying to grab the handle of a door on a car his sister was driving. He slipped and fell to the pavement, hitting his head. His parents treated him for the injury and rejected paramedics’ demands that they be allowed to take him to a hospital. “One (officer) grabbed my daughter Beth (18 years), who also had a gun to her face, slammed her down and kneed her in the back and held her in that position… My sons Adam (14) and Noah (only 7) lay down willingly, yet they were still forced to put their hands behind their backs and were yelled at to keep their heads down….</p><p>“I asked if I could make a phone call and was told, ‘no.’ My daughter asked if that wasn’t one of our rights. The reply was made, ‘That’s only in the movies,'” she told WND.</p></blockquote><p>This sort of thing is more common than you think and it’s definitely not going to stop, it’s only going get worse as the definition of “terrorist” is expanded and the economy heads south.  Politics won’t stop it, as both major parties strongly favor the expansion of central state power.  Home invasions like these simply don’t happen often in most other civilized nations; America may have once been the most free country in the world but that just isn’t the case any longer.</p><p>The sheriff says <a href=\"http://www.postindependent.com/article/20080109/VALLEYNEWS/933433845/0/FRONTPAGE\">he felt he had no choice</a>: “I was given a court order, and I really don’t feel I have any choice but to comply with that court order.”</p><p>Good thing the court didn’t tell him to round up a few Jews instead of kidnapping a little boy from his home.  The moral of this tale of two stories: <i>always surreptitiously record the cops</i>.</p></div>",
  "content_text": "I always marveled at how some of the Austrian economists had the foresight to depart Austria and Germany so long before the evil of the Nazi regime became apparent to the world at large.  Now, I’m wondering how so many Americans can be so blind as to fail to recognize the mutation of their nation\ninto a police terror state\n:\nThe mother of an 11-year-old boy abducted by SWAT team members and taken to a hospital after he was bruised while horsing around is warning members of her community of the “Nazi” tactics she endured, including a statement from the officers that her “rights” were “only in the movies.”\nThe case involves Jon Shiflet, who injured himself while trying to grab the handle of a door on a car his sister was driving. He slipped and fell to the pavement, hitting his head. His parents treated him for the injury and rejected paramedics’ demands that they be allowed to take him to a hospital. “One (officer) grabbed my daughter Beth (18 years), who also had a gun to her face, slammed her down and kneed her in the back and held her in that position… My sons Adam (14) and Noah (only 7) lay down willingly, yet they were still forced to put their hands behind their backs and were yelled at to keep their heads down….\n“I asked if I could make a phone call and was told, ‘no.’ My daughter asked if that wasn’t one of our rights. The reply was made, ‘That’s only in the movies,'” she told WND.\nThis sort of thing is more common than you think and it’s definitely not going to stop, it’s only going get worse as the definition of “terrorist” is expanded and the economy heads south.  Politics won’t stop it, as both major parties strongly favor the expansion of central state power.  Home invasions like these simply don’t happen often in most other civilized nations; America may have once been the most free country in the world but that just isn’t the case any longer.\nThe sheriff says\nhe felt he had no choice\n: “I was given a court order, and I really don’t feel I have any choice but to comply with that court order.”\nGood thing the court didn’t tell him to round up a few Jews instead of kidnapping a little boy from his home.  The moral of this tale of two stories:\nalways surreptitiously record the cops\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-10T16:57:00+00:00"
}