{
  "url": "https://voxday.net/2008/01/17/remarkable/",
  "scraped_at": "2026-01-08T22:08:10.730808",
  "title": "Remarkable",
  "date_display": "January 17, 2008",
  "date_iso": "2008-01-17T20:01:00+00:00",
  "date_from_url": "2008-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I realize that it’s not exactly up there with <i>The God Delusion</i> spending something like 1000 straight weeks as a New York Times bestseller or whatever, or <i>Liberal Fascism</i> leaping right to #1 in Politics and #1 overall on Amazon.  But considering that the book isn’t even officially available yet and the most rabid Ilk are holding off on ordering – or at least ordering another copy – until this Saturday evening, I think it’s amazing that <i>The Irrational Atheist</i> already ranks in the top 15k overall and the top 15 in Atheism.  I mean, when everyone got together on the <i>Rebel Moon</i> shot, the OC and I were hoping that it just might hit the top 10k.</p><p>Given my notoriously disturbing take on things, I really don’t expect vast quantities of people to pay much attention to what I’m thinking.  So, it’s both delightful and a little alarming to realize that this isn’t likely to be just another novel that will never be reviewed anywhere or another random column fired off on Sunday afternoon before the football starts.</p><p>But I feel pretty good. I’m not scared at all. I feel kind of… I feel kind of invincible.</p></div>",
  "content_text": "I realize that it’s not exactly up there with\nThe God Delusion\nspending something like 1000 straight weeks as a New York Times bestseller or whatever, or\nLiberal Fascism\nleaping right to #1 in Politics and #1 overall on Amazon.  But considering that the book isn’t even officially available yet and the most rabid Ilk are holding off on ordering – or at least ordering another copy – until this Saturday evening, I think it’s amazing that\nThe Irrational Atheist\nalready ranks in the top 15k overall and the top 15 in Atheism.  I mean, when everyone got together on the\nRebel Moon\nshot, the OC and I were hoping that it just might hit the top 10k.\nGiven my notoriously disturbing take on things, I really don’t expect vast quantities of people to pay much attention to what I’m thinking.  So, it’s both delightful and a little alarming to realize that this isn’t likely to be just another novel that will never be reviewed anywhere or another random column fired off on Sunday afternoon before the football starts.\nBut I feel pretty good. I’m not scared at all. I feel kind of… I feel kind of invincible.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-17T20:01:00+00:00"
}