{
  "url": "https://voxday.net/2008/01/18/rush-limbaugh-right-and-wrong/",
  "scraped_at": "2026-01-08T22:08:16.288408",
  "title": "DAVID Limbaugh, right and wrong",
  "date_display": "January 18, 2008",
  "date_iso": "2008-01-18T10:03:00+00:00",
  "date_from_url": "2008-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59755\">The radio giant’s BROTHER’S endorsement</a> is much better than Ann Coulter’s, anyhow.  Give him his due:</p><blockquote><p>Commentators are citing the unpredictability of the Republican primary contests as proof that Reagan conservatism is dead when precisely the opposite conclusion is warranted.  The main reason the conventional wisdom is being shattered in the primaries is that conservative voters, so far, have not been persuaded there is an electable, reliable conservative in the race.</p><p>But as I’ve stated before, I believe Fred Thompson is a reliable, consistent conservative. There are others in the field I could support, but not without some reservations. The more I learn about Fred and observe him in action, the more convinced I become that he’s the right choice.</p></blockquote><p>David is correct to state, as <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59758\">Pat Buchanan also notes</a>, that Reagan conservatism isn’t dead or lacking broad support among the base, it’s merely lacking support among the political and media elite who call themselves conservatives but are actually nothing of the sort.  The problem is that while Fred Thompson is far from the worst candidate and is unlikely to do much to push the country further towards the abyss himself, neither would he resist the forces that are doing their damndest to force the country to take the plunge.  And, it’s worth noting that he’s probably less likely to win than Ron Paul or Dennis Kucinich.</p><p>Sure, it’s a pity that neither David nor his brother responded affirmatively to my request and threw their support to the only Republican looking forward, but it’s hardly unexpected.  But there’s absolutely no reason for despair because Ron Paul was never terribly concerned about winning, he is primarily in the race to build a coalition of freedom-lovers who are capable of providing the nucleus required to relaunch the American project once the inevitable collapse comes.</p><p>MEA CULPA – Inexcusable error confusing Rush and David there, especially since David and I exchange email every so often.  My only defense is that I didn’t access the column from the Commentary page and it never occurred to me for one second that WND would consider David’s endorsement to be front page news.  I mean, David is one of WND’s better columnists, but my readership is no smaller than his and I don’t recall my endorsement of Ron Paul being worthy of the front page.</p><p>I don’t know if the headline editor – it wouldn’t have been Mr. Farah, by the way – was simply juicing it up or if this is leading towards a Thompson endorsement by WND.  I assume the former, but you never know.</p></div>",
  "content_text": "The radio giant’s BROTHER’S endorsement\nis much better than Ann Coulter’s, anyhow.  Give him his due:\nCommentators are citing the unpredictability of the Republican primary contests as proof that Reagan conservatism is dead when precisely the opposite conclusion is warranted.  The main reason the conventional wisdom is being shattered in the primaries is that conservative voters, so far, have not been persuaded there is an electable, reliable conservative in the race.\nBut as I’ve stated before, I believe Fred Thompson is a reliable, consistent conservative. There are others in the field I could support, but not without some reservations. The more I learn about Fred and observe him in action, the more convinced I become that he’s the right choice.\nDavid is correct to state, as\nPat Buchanan also notes\n, that Reagan conservatism isn’t dead or lacking broad support among the base, it’s merely lacking support among the political and media elite who call themselves conservatives but are actually nothing of the sort.  The problem is that while Fred Thompson is far from the worst candidate and is unlikely to do much to push the country further towards the abyss himself, neither would he resist the forces that are doing their damndest to force the country to take the plunge.  And, it’s worth noting that he’s probably less likely to win than Ron Paul or Dennis Kucinich.\nSure, it’s a pity that neither David nor his brother responded affirmatively to my request and threw their support to the only Republican looking forward, but it’s hardly unexpected.  But there’s absolutely no reason for despair because Ron Paul was never terribly concerned about winning, he is primarily in the race to build a coalition of freedom-lovers who are capable of providing the nucleus required to relaunch the American project once the inevitable collapse comes.\nMEA CULPA – Inexcusable error confusing Rush and David there, especially since David and I exchange email every so often.  My only defense is that I didn’t access the column from the Commentary page and it never occurred to me for one second that WND would consider David’s endorsement to be front page news.  I mean, David is one of WND’s better columnists, but my readership is no smaller than his and I don’t recall my endorsement of Ron Paul being worthy of the front page.\nI don’t know if the headline editor – it wouldn’t have been Mr. Farah, by the way – was simply juicing it up or if this is leading towards a Thompson endorsement by WND.  I assume the former, but you never know.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-18T10:03:00+00:00"
}