{
  "url": "https://voxday.net/2008/01/30/sacrificial-lamb-is-gone/",
  "scraped_at": "2026-01-08T22:09:57.310505",
  "title": "The sacrificial lamb is gone",
  "date_display": "January 30, 2008",
  "date_iso": "2008-01-30T10:07:00+00:00",
  "date_from_url": "2008-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Long live <a href=\"http://apnews.myway.com/article/20080130/D8UFV4G80.html\">the new sacrificial lamb</a>… until November, anyhow:</p><blockquote><p>Rudy Giuliani, who bet his presidential hopes on Florida only to come in third, prepared to quit the race Tuesday and endorse his friendliest rival, John McCain.</p></blockquote><p>While I’m still standing by my 2003 prediction of a president Rodham-Clinton, my ability to read the tea leaves with regards to the Republicans hasn’t been very good.  I initially thought Pataki might be the unelectable Republican selected to take the fall, (although I did suggest Giuliani as the other probability, as he indeed turned out to be), but as I noted before the primaries began, Giuliani was such a horrendous candidate that he couldn’t even fulfill his appointed role.</p><p>But Democrats need not fear, both McCain and Romney are eminently capable of being defeated in the same landslide that was intended for Giuliani.  It doesn’t actually matter which of them is nominated to play Bob Dole redux.  (Rameshh Ponnuru <a href=\"http://corner.nationalreview.com/post/?q=MDVjNTc1YjY1ZjZkZDg0ODIyMGY3YzkyNzVkM2RhN2M=\">notices the similarity</a> as well, although I doubt he is fully aware of its significance: <i>“It has seemed a bit like the 1996 race. McCain is Dole: the old war hero who has run before, who does not enthuse either economic or social conservatives but has a pretty conservative record.”</i>)</p><p>Giuliani’s theme of “I saved New York City” was always self-destructive.  Given how a significant portion of the rest of the country feels about NYC, it probably cost him more votes than it gained him, especially in a state with no shortage of people who are happy to have shaken its dust from their flip-flops.</p></div>",
  "content_text": "Long live\nthe new sacrificial lamb\n… until November, anyhow:\nRudy Giuliani, who bet his presidential hopes on Florida only to come in third, prepared to quit the race Tuesday and endorse his friendliest rival, John McCain.\nWhile I’m still standing by my 2003 prediction of a president Rodham-Clinton, my ability to read the tea leaves with regards to the Republicans hasn’t been very good.  I initially thought Pataki might be the unelectable Republican selected to take the fall, (although I did suggest Giuliani as the other probability, as he indeed turned out to be), but as I noted before the primaries began, Giuliani was such a horrendous candidate that he couldn’t even fulfill his appointed role.\nBut Democrats need not fear, both McCain and Romney are eminently capable of being defeated in the same landslide that was intended for Giuliani.  It doesn’t actually matter which of them is nominated to play Bob Dole redux.  (Rameshh Ponnuru\nnotices the similarity\nas well, although I doubt he is fully aware of its significance:\n“It has seemed a bit like the 1996 race. McCain is Dole: the old war hero who has run before, who does not enthuse either economic or social conservatives but has a pretty conservative record.”\n)\nGiuliani’s theme of “I saved New York City” was always self-destructive.  Given how a significant portion of the rest of the country feels about NYC, it probably cost him more votes than it gained him, especially in a state with no shortage of people who are happy to have shaken its dust from their flip-flops.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-30T10:07:00+00:00"
}