{
  "url": "https://voxday.net/2008/01/15/someone-just-couldnt-wai/",
  "scraped_at": "2026-01-08T22:07:46.826911",
  "title": "Someone just couldn’t wait",
  "date_display": "January 15, 2008",
  "date_iso": "2008-01-15T12:39:00+00:00",
  "date_from_url": "2008-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was amused to receive the following email from someone at BenBella:</p><blockquote><p>From this morning to right now, the book has moved up more than 300,000 spots on the Amazon ranking!</p></blockquote><p>You know, if they’re that happy about TIA’s movement into the top 200,000, I imagine they’ll be downright delighted about what will transpire this weekend.  One nice thing about working with a smaller publishing house is that there’s not only a lot more attention to detail, but also genuine enthusiasm about little things that no one would even notice at the giant publishers.</p><p>Anyhow, I am informed that the pre-orders are beginning to show up now, so I’d encourage those of you who have read it to let us know what you think about it here, and to post a review at Amazon as well.  It would certainly be nice to have something to counter-balance the inevitable one-star reviews from the non-readers.  Amazon really should have a simple check-box for the morons of the left and right alike that would state the following:</p><p><i>“I have not read this, but I know it is a Bad Book because the title indicates the author has probably written something I don’t like.  I wish this book had never been published and I hope no one reads it.”</i></p><p>Speaking of amusement, I have a feeling that this guy is <a href=\"http://waywardfundamentalist.wordpress.com/2008/01/14/no-wonder-the-world-thinks-were-fakes/\">going to be somewhat conflicted</a> about the book as well.  I am a gamer-for-life and as with the other languages I speak, it occasionally shows.  I don’t have a problem with Christians who object to this, but my impression is that the man who referred to some of his own critics as sons of vipers understands perfectly well why I refer to certain individuals in a specific way.</p><p>I have nothing but the back of my hand and a dismissive snort of contempt for those who will inevitably attempt to dismiss my case because of the insufficiently respectful manner in which it is made.  As Jonah Goldberg has recently experienced, there will be critics who are very quick to point out that I am not an academic.  That’s quite true, so there’s no rational grounds for expecting me to abide by academia’s prissy rhetorical etiquette.</p><p>By the way, this current list of Amazon’s top ten best-selling books is why I don’t tend to worry too much about how my books sell.</p><p>1.  Happy for No Reason: 7 Steps to Being Happy from the Inside Out <br>2.  Eat, Pray, Love: One Woman’s Search for Everything Across Italy, India and Indonesia<br>3.  Eat This Not That: Thousands of Simple Food Swaps That Can Save You 10, 20, 30 Pounds-or More! <br>4. A Thousand Splendid Suns <br>5. Three Cups of Tea: One Man’s Mission to Promote Peace . . . One School at a Time <br>6.  Liberal Fascism: The Secret History of the American Left, From Mussolini to the Politics of Meaning <br>7.  In Defense of Food: An Eater’s Manifesto<br>8.  The Appeal <br>9.  Water for Elephants: A Novel<br>10. Plum Lucky (Stephanie Plum Novels)</br></br></br></br></br></br></br></br></br></p><p>If I simply wanted to sell books, I’d write a work of “non-fiction” dedicated to explaining how fat, mature women are the truly sexy sophisticates of l’amore, a tell-all about my summer of hot, passionate romance with a sweetly chunky, middle-aged American woman in the Cinque Terre.</p></div>",
  "content_text": "I was amused to receive the following email from someone at BenBella:\nFrom this morning to right now, the book has moved up more than 300,000 spots on the Amazon ranking!\nYou know, if they’re that happy about TIA’s movement into the top 200,000, I imagine they’ll be downright delighted about what will transpire this weekend.  One nice thing about working with a smaller publishing house is that there’s not only a lot more attention to detail, but also genuine enthusiasm about little things that no one would even notice at the giant publishers.\nAnyhow, I am informed that the pre-orders are beginning to show up now, so I’d encourage those of you who have read it to let us know what you think about it here, and to post a review at Amazon as well.  It would certainly be nice to have something to counter-balance the inevitable one-star reviews from the non-readers.  Amazon really should have a simple check-box for the morons of the left and right alike that would state the following:\n“I have not read this, but I know it is a Bad Book because the title indicates the author has probably written something I don’t like.  I wish this book had never been published and I hope no one reads it.”\nSpeaking of amusement, I have a feeling that this guy is\ngoing to be somewhat conflicted\nabout the book as well.  I am a gamer-for-life and as with the other languages I speak, it occasionally shows.  I don’t have a problem with Christians who object to this, but my impression is that the man who referred to some of his own critics as sons of vipers understands perfectly well why I refer to certain individuals in a specific way.\nI have nothing but the back of my hand and a dismissive snort of contempt for those who will inevitably attempt to dismiss my case because of the insufficiently respectful manner in which it is made.  As Jonah Goldberg has recently experienced, there will be critics who are very quick to point out that I am not an academic.  That’s quite true, so there’s no rational grounds for expecting me to abide by academia’s prissy rhetorical etiquette.\nBy the way, this current list of Amazon’s top ten best-selling books is why I don’t tend to worry too much about how my books sell.\n1.  Happy for No Reason: 7 Steps to Being Happy from the Inside Out\n2.  Eat, Pray, Love: One Woman’s Search for Everything Across Italy, India and Indonesia\n3.  Eat This Not That: Thousands of Simple Food Swaps That Can Save You 10, 20, 30 Pounds-or More!\n4. A Thousand Splendid Suns\n5. Three Cups of Tea: One Man’s Mission to Promote Peace . . . One School at a Time\n6.  Liberal Fascism: The Secret History of the American Left, From Mussolini to the Politics of Meaning\n7.  In Defense of Food: An Eater’s Manifesto\n8.  The Appeal\n9.  Water for Elephants: A Novel\n10. Plum Lucky (Stephanie Plum Novels)\nIf I simply wanted to sell books, I’d write a work of “non-fiction” dedicated to explaining how fat, mature women are the truly sexy sophisticates of l’amore, a tell-all about my summer of hot, passionate romance with a sweetly chunky, middle-aged American woman in the Cinque Terre.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-15T12:39:00+00:00"
}