{
  "url": "https://voxday.net/2008/01/22/stay-away-from-career-women/",
  "scraped_at": "2026-01-08T22:08:52.752786",
  "title": "Stay away from career women",
  "date_display": "January 22, 2008",
  "date_iso": "2008-01-22T11:31:00+00:00",
  "date_from_url": "2008-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s increasingly understood that they’re <a href=\"http://www.telegraph.co.uk/portal/main.jhtml;jsessionid=ADWYYAOYLB3EZQFIQMFSFF4AVCBQ0IV0?xml=/portal/2008/01/22/ftfaithful122.xml\">far more inclined to marital infidelity</a> than the average woman:</p><blockquote><p>Over a five-month period, I talked to almost 100 middle-class professionals, both male and female, who confessed to being unfaithful.  What was remarkable was that not one of the women said they felt guilty. And those who believed they might get emotionally involved tried to work out hard-headed strategies of dealing with it.</p></blockquote><p>Women are always attracted to the top dog.  This doesn’t mean that they’re necessarily going to do anything about it, but throw a woman into an office environment and she’s going to have an entirely natural desire to mate with the modern equivalent of the tribe leader, or his likely successors.  Combine that with the necessary narcissism of a woman who puts her children and household behind her work priorities as well as the all-too-common female ethic of personal happiness <i>uber alles</i> and you have the perfect storm for marital infidelity.</p><p>A professional procurer <a href=\"http://www.telegraph.co.uk/portal/main.jhtml;jsessionid=EQMFNU5IYDKA1QFIQMGCFFWAVCBQUIV0?xml=/portal/2008/01/21/ftfaithful121.xml\">knows who his customers are</a>: <i>He meets each applicant personally and over a drink or two finds out his or her needs and desires. He then provides three carefully chosen individuals at a time for them to chose from.  His clients are wide-ranging. “I have all sorts of high-ranking professionals come to me and, recently, far more women. Many of my female clients are psychotherapists. I haven’t a clue why.</i></p><p>The unpredictable emotions of situational love and gamma male gigolos aside, I can’t think of a single rational reason why a man should intentionally elect to marry a woman who decides to seriously pursue a career.  Wife and mother is a full-time occupation and a far more important one to society and the human race than 99 percent of what passes for the so-called careers of the full-time professional woman.  No one of either sex can have it all, and a decision to become a professional woman is a very clear public statement of where a woman’s priorities are.  (Hint: not you, not the children, not the family.)</p><p>There will always be exceptions, of course, and there’s certainly no shortage of non-career women who don’t wish to work but do so in order to support their families, but the fact that researchers are concluding that professional women’s marriages are inordinately likely to end in infidelity and divorce should come as no surprise, it is simply the logical probability.</p><p>I and most of my married male friends – highly educated and successful men to a man – have stayed away from career women.  Unsurprisingly, there is not a single incident of divorce, separation or even infidelity in that social circle of which I am aware except the one guy who married a professional peer and found himself divorced within five years.  I have four good female friends who are equally well-educated – the two with elite B-school MBAs have both been home with the kids for years, the two with the careers are both unmarried and childless.</p><p>This advice may sound terribly clinical, I know, but in truth it’s just the rational conclusion of applying logic and probability to the empirical data that’s available.</p></div>",
  "content_text": "It’s increasingly understood that they’re\nfar more inclined to marital infidelity\nthan the average woman:\nOver a five-month period, I talked to almost 100 middle-class professionals, both male and female, who confessed to being unfaithful.  What was remarkable was that not one of the women said they felt guilty. And those who believed they might get emotionally involved tried to work out hard-headed strategies of dealing with it.\nWomen are always attracted to the top dog.  This doesn’t mean that they’re necessarily going to do anything about it, but throw a woman into an office environment and she’s going to have an entirely natural desire to mate with the modern equivalent of the tribe leader, or his likely successors.  Combine that with the necessary narcissism of a woman who puts her children and household behind her work priorities as well as the all-too-common female ethic of personal happiness\nuber alles\nand you have the perfect storm for marital infidelity.\nA professional procurer\nknows who his customers are\n:\nHe meets each applicant personally and over a drink or two finds out his or her needs and desires. He then provides three carefully chosen individuals at a time for them to chose from.  His clients are wide-ranging. “I have all sorts of high-ranking professionals come to me and, recently, far more women. Many of my female clients are psychotherapists. I haven’t a clue why.\nThe unpredictable emotions of situational love and gamma male gigolos aside, I can’t think of a single rational reason why a man should intentionally elect to marry a woman who decides to seriously pursue a career.  Wife and mother is a full-time occupation and a far more important one to society and the human race than 99 percent of what passes for the so-called careers of the full-time professional woman.  No one of either sex can have it all, and a decision to become a professional woman is a very clear public statement of where a woman’s priorities are.  (Hint: not you, not the children, not the family.)\nThere will always be exceptions, of course, and there’s certainly no shortage of non-career women who don’t wish to work but do so in order to support their families, but the fact that researchers are concluding that professional women’s marriages are inordinately likely to end in infidelity and divorce should come as no surprise, it is simply the logical probability.\nI and most of my married male friends – highly educated and successful men to a man – have stayed away from career women.  Unsurprisingly, there is not a single incident of divorce, separation or even infidelity in that social circle of which I am aware except the one guy who married a professional peer and found himself divorced within five years.  I have four good female friends who are equally well-educated – the two with elite B-school MBAs have both been home with the kids for years, the two with the careers are both unmarried and childless.\nThis advice may sound terribly clinical, I know, but in truth it’s just the rational conclusion of applying logic and probability to the empirical data that’s available.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-22T11:31:00+00:00"
}