{
  "url": "https://voxday.net/2008/01/15/such-surprise-2/",
  "scraped_at": "2026-01-08T22:07:41.275127",
  "title": "Such a surprise",
  "date_display": "January 15, 2008",
  "date_iso": "2008-01-15T11:33:00+00:00",
  "date_from_url": "2008-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It wasn’t hard <a href=\"http://www.voxday.net/archive/2001/091401.html\">to see this one coming</a>.  However, I think the American public is wearying of all the scare talk, so they’ll probably need to stage another Maine/Lusitania/Tonkin/Northwoods if they’re going to get everyone to bite on Patriot Act III:</p><blockquote><p>Spychief Mike McConnell is drafting a plan to protect America’s cyberspace that will raise privacy issues and make the current debate over surveillance law look like “a walk in the park,” McConnell tells The New Yorker in the issue set to hit newsstands Monday….</p><p>At issue, McConnell acknowledges, is that in order to accomplish his plan, <a href=\"http://blogs.wsj.com/washwire/2008/01/13/dancing-spychief-wants-to-tap-into-cyberspace/\">the government must have the ability to read all the information crossing the Internet in the United States</a> in order to protect it from abuse. Congressional aides tell The Journal that they, too, are also anticipating a fight over civil liberties that will rival the battles over the Foreign Intelligence Surveillance Act.</p></blockquote><p>Fortunately, freedom lovers have a trump card this time around.  When it’s the government and national security versus free images of naked women, you have to bet on the latter.  I can already imagine the hissy fits being thrown when I write the requisite “In Defense of Internet Porn” article.</p></div>",
  "content_text": "It wasn’t hard\nto see this one coming\n.  However, I think the American public is wearying of all the scare talk, so they’ll probably need to stage another Maine/Lusitania/Tonkin/Northwoods if they’re going to get everyone to bite on Patriot Act III:\nSpychief Mike McConnell is drafting a plan to protect America’s cyberspace that will raise privacy issues and make the current debate over surveillance law look like “a walk in the park,” McConnell tells The New Yorker in the issue set to hit newsstands Monday….\nAt issue, McConnell acknowledges, is that in order to accomplish his plan,\nthe government must have the ability to read all the information crossing the Internet in the United States\nin order to protect it from abuse. Congressional aides tell The Journal that they, too, are also anticipating a fight over civil liberties that will rival the battles over the Foreign Intelligence Surveillance Act.\nFortunately, freedom lovers have a trump card this time around.  When it’s the government and national security versus free images of naked women, you have to bet on the latter.  I can already imagine the hissy fits being thrown when I write the requisite “In Defense of Internet Porn” article.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-15T11:33:00+00:00"
}