{
  "url": "https://voxday.net/2008/01/16/that-word-does-not-mean/",
  "scraped_at": "2026-01-08T22:07:57.802616",
  "title": "That word does not mean",
  "date_display": "January 16, 2008",
  "date_iso": "2008-01-16T15:01:00+00:00",
  "date_from_url": "2008-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What you think it means.  NRO’s editors claim that despite his promises to bring a new Federal public-private partnership to Detroit to revive the auto industry, Mitt Romney is <a href=\"http://article.nationalreview.com/?q=N2FlNGQyMDBjMDA2MDI2NmQ0ODQzODc4NTBlZWNmZmQ=\">the most conservative “viable” candidate</a>.  Meanwhile, just down the page, J.J. Pitney Jr. notes that Romney appears to be the least electable of the “major” Republican candidates. <i>“According to recent trial-heat surveys, Romney would lose to either Hillary Clinton or Barack Obama by the widest margins of any major Republican candidate.”</i></p><p>I don’t know about you, but I’m very much enjoying the increasing insanity of this election campaign.  The Republicans are imploding one after another, Hillary nearly lost to no one and her closest rival is an admitted drug user* who belongs to an African supremacist church.  America, how very richly you deserve the government you are going to get!  And though our reasons may differ, I find myself in agreement with <a href=\"http://scienceblogs.com/pharyngula/2008/01/huckabee_is_a_raving_lunatic.php#comments\">everyone’s favorite science educator</a>:</p><blockquote><p>I’m feeling a bit like I’m watching a whole country merrily running towards that cliff right now.</p></blockquote><p>The hilarious thing about PZ and company is that they completely fail to understand that they are right there running in the midst of the rest of the lemmings.  Huckabee and Hillary are going in exactly the same direction and they’re not the only ones.</p><p>*<i>Not that there’s anything wrong with that, we ARE libertarians.</i></p></div>",
  "content_text": "What you think it means.  NRO’s editors claim that despite his promises to bring a new Federal public-private partnership to Detroit to revive the auto industry, Mitt Romney is\nthe most conservative “viable” candidate\n.  Meanwhile, just down the page, J.J. Pitney Jr. notes that Romney appears to be the least electable of the “major” Republican candidates.\n“According to recent trial-heat surveys, Romney would lose to either Hillary Clinton or Barack Obama by the widest margins of any major Republican candidate.”\nI don’t know about you, but I’m very much enjoying the increasing insanity of this election campaign.  The Republicans are imploding one after another, Hillary nearly lost to no one and her closest rival is an admitted drug user* who belongs to an African supremacist church.  America, how very richly you deserve the government you are going to get!  And though our reasons may differ, I find myself in agreement with\neveryone’s favorite science educator\n:\nI’m feeling a bit like I’m watching a whole country merrily running towards that cliff right now.\nThe hilarious thing about PZ and company is that they completely fail to understand that they are right there running in the midst of the rest of the lemmings.  Huckabee and Hillary are going in exactly the same direction and they’re not the only ones.\n*\nNot that there’s anything wrong with that, we ARE libertarians.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-16T15:01:00+00:00"
}