{
  "url": "https://voxday.net/2008/01/28/tia-reviews-and-interview/",
  "scraped_at": "2026-01-08T22:09:35.115026",
  "title": "TIA reviews and interview",
  "date_display": "January 28, 2008",
  "date_iso": "2008-01-28T09:00:00+00:00",
  "date_from_url": "2008-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ian McCleod of the Clan McLeod <a href=\"http://ianmcleod.blogspot.com/2008/01/irrational-atheist-blurb.html\">declares a winner</a>:</p><blockquote><p>Vox Day’s new book raises the bar in the debate between Theists and Atheists. Rather than resort to traditional modes of debate favored by Christians, Vox Day plays by the rules of the opposition, and wins.</p><p>Vox’s arguments are exquisitely documented and impressively reasoned. His annihilation of the “Religion Causes War” myth ought to ruin any anti-religionist’s day (I find it the most convincing and potentially useful argument in the book, though your mileage may vary.) The Irrational Atheist attacks the three pillars of New Atheism, not by proving that there is a god, but by proving that their arguments are not the paragon of rationality they bill them to be.</p></blockquote><p>Pretty Lady is surprised, so much so that she gives out a “<a href=\"http://ohprettylady.blogspot.com/2008/01/literary-award.html\">Literary Award</a>“:</p><blockquote><p>Pretty Lady is shocked. She did not, truly, believe it to be possible.</p><p>But she must give credit where credit is due. Ladies and gentlemen, she gives you Vox Day, who in his recently released little tome, The Irrational Atheist, has proven himself a greater Master of the Footnote than David Foster Wallace himself!!!</p><p>Indeed. Vox plays his footnotes like a veritable fugue, striking an insouciant balance between formidable scholarship and a fey, swashbuckling sarcasm that never overbalances into the sort of ramble that makes a person seriously wonder if Mr. Wallace forgot to take his ADD meds today….  Incidentally, Vox has also left a smoking hole in the turf where Sammy Harris used to stand, whining, and for this, Pretty Lady is profoundly grateful.</p></blockquote><p>Blonde Moment <a href=\"http://ablondmoment.blogspot.com/2008/01/irrational-atheists-review.html\">appreciates the service</a>:</p><blockquote><p>Day provides a valuable service to Christians, particularly those who are not capable of pulling apart arguments against God. I strongly recommend the book.</p></blockquote><p>And WND’s own Joseph Farah is inspired <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59905\">to ask a few questions</a>:</p><blockquote><p><b>Farah:</b> What are the consequences of widespread atheism?</p><p><b>Day:</b> There are none, because atheism will never be a widespread phenomenon. Like socialism, it’s a parasitic phenomenon that can’t survive on its own. As Chesterton pointed out long ago, atheism rapidly mutates into paganism and diverse forms of spiritual absurdity. And we’re already seeing signs that the post-Christian West is returning to paganism; it’s not transforming into some sort of shiny, super-rational, post-superstitious science fiction society.</p><p><b>Farah</b>: Why do you refer to Richard Dawkins as Darwin’s Judas?</p><p><b>Day</b>: He only finds Darwin useful insofar as his theory of evolution by natural selection can be used to eliminate the basis for a belief in a Creator God. As Dawkins states in his own words, he’s “a passionate anti-Darwinian” with regards to the proper conduct of human affairs. Dawkins thinks humanity should follow Darwin just long enough to cast off Jesus Christ, then ditch Darwin in favor of following Richard Dawkins’ opinion on life, the universe and everything. Just like philosophers, you can always count on a scientist to come around eventually to the concept of rule by scientist-king.</p></blockquote></div>",
  "content_text": "Ian McCleod of the Clan McLeod\ndeclares a winner\n:\nVox Day’s new book raises the bar in the debate between Theists and Atheists. Rather than resort to traditional modes of debate favored by Christians, Vox Day plays by the rules of the opposition, and wins.\nVox’s arguments are exquisitely documented and impressively reasoned. His annihilation of the “Religion Causes War” myth ought to ruin any anti-religionist’s day (I find it the most convincing and potentially useful argument in the book, though your mileage may vary.) The Irrational Atheist attacks the three pillars of New Atheism, not by proving that there is a god, but by proving that their arguments are not the paragon of rationality they bill them to be.\nPretty Lady is surprised, so much so that she gives out a “\nLiterary Award\n“:\nPretty Lady is shocked. She did not, truly, believe it to be possible.\nBut she must give credit where credit is due. Ladies and gentlemen, she gives you Vox Day, who in his recently released little tome, The Irrational Atheist, has proven himself a greater Master of the Footnote than David Foster Wallace himself!!!\nIndeed. Vox plays his footnotes like a veritable fugue, striking an insouciant balance between formidable scholarship and a fey, swashbuckling sarcasm that never overbalances into the sort of ramble that makes a person seriously wonder if Mr. Wallace forgot to take his ADD meds today….  Incidentally, Vox has also left a smoking hole in the turf where Sammy Harris used to stand, whining, and for this, Pretty Lady is profoundly grateful.\nBlonde Moment\nappreciates the service\n:\nDay provides a valuable service to Christians, particularly those who are not capable of pulling apart arguments against God. I strongly recommend the book.\nAnd WND’s own Joseph Farah is inspired\nto ask a few questions\n:\nFarah:\nWhat are the consequences of widespread atheism?\nDay:\nThere are none, because atheism will never be a widespread phenomenon. Like socialism, it’s a parasitic phenomenon that can’t survive on its own. As Chesterton pointed out long ago, atheism rapidly mutates into paganism and diverse forms of spiritual absurdity. And we’re already seeing signs that the post-Christian West is returning to paganism; it’s not transforming into some sort of shiny, super-rational, post-superstitious science fiction society.\nFarah\n: Why do you refer to Richard Dawkins as Darwin’s Judas?\nDay\n: He only finds Darwin useful insofar as his theory of evolution by natural selection can be used to eliminate the basis for a belief in a Creator God. As Dawkins states in his own words, he’s “a passionate anti-Darwinian” with regards to the proper conduct of human affairs. Dawkins thinks humanity should follow Darwin just long enough to cast off Jesus Christ, then ditch Darwin in favor of following Richard Dawkins’ opinion on life, the universe and everything. Just like philosophers, you can always count on a scientist to come around eventually to the concept of rule by scientist-king.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-28T09:00:00+00:00"
}