{
  "url": "https://voxday.net/2008/01/22/what-do-you-want-to-know/",
  "scraped_at": "2026-01-08T22:08:50.930534",
  "title": "What do you want to know?",
  "date_display": "January 22, 2008",
  "date_iso": "2008-01-22T09:45:00+00:00",
  "date_from_url": "2008-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Farah is going to be interviewing me about <i>The Irrational Atheist</i> for WND, and like all editors, he’s happy to offload the actual work on others.  He has some specific questions for me already, but since he knows that “the people who read your blog probably have a few questions too”, he’s willing to ask some of them on behalf of the readership for publication on WND.</p><p>So, fire away in the comments, Mr. Farah will pick a few of them and I’ll answer those.  They should be straightforward questions about something specific and directly related to the book, he’s not going to be selecting any statements in the guise of convoluted questions or questions about tangential issues.</p><p>Speaking of WND, you can now buy <i><a href=\"http://shop.wnd.com/store/item.asp?DEPARTMENT_ID=6&amp;SUBDEPARTMENT_ID=23&amp;ITEM_ID=2267\">The Irrational Atheist</a></i> there from the WND store.  Mr. Farah, who was one of the first to read the book, even put in a nice word for it himself there.</p></div>",
  "content_text": "Mr. Farah is going to be interviewing me about\nThe Irrational Atheist\nfor WND, and like all editors, he’s happy to offload the actual work on others.  He has some specific questions for me already, but since he knows that “the people who read your blog probably have a few questions too”, he’s willing to ask some of them on behalf of the readership for publication on WND.\nSo, fire away in the comments, Mr. Farah will pick a few of them and I’ll answer those.  They should be straightforward questions about something specific and directly related to the book, he’s not going to be selecting any statements in the guise of convoluted questions or questions about tangential issues.\nSpeaking of WND, you can now buy\nThe Irrational Atheist\nthere from the WND store.  Mr. Farah, who was one of the first to read the book, even put in a nice word for it himself there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-22T09:45:00+00:00"
}