{
  "url": "https://voxday.net/2008/01/06/why-women-are-always-angry/",
  "scraped_at": "2026-01-08T22:06:27.539834",
  "title": "Why women are always angry",
  "date_display": "January 6, 2008",
  "date_iso": "2008-01-06T10:01:00+00:00",
  "date_from_url": "2008-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think any of the five writers surveyed <a href=\"http://women.timesonline.co.uk/tol/life_and_style/women/article3121399.ece\">on the question of women’s anger</a> hit it on the nail, although it’s certainly amusing that two of them were less interested in examining the subject raised than explaining why women’s anger is actually a good thing.  One guess as to which sex those two might happen to be….  This guy sounds rather like an acquaintance of mine when he describes his mine field of a relationship:</p><blockquote><p>They do seem to be terribly angry these days, don’t they, women? I’ve always assumed it’s because of something we’ve done, we men. But that’s a sexist and solipsistic response which only makes them all the angrier….  There’s a window of about five days in the month when she acts like a normal person, smiles, says please and thank you, doesn’t wander around with the bread knife held aloft. For the rest of the time you just tiptoe around her with a haunted expression. I know it’s something I’ve done, or not done. Or something we’ve done, we men.</p></blockquote><p>I’m not sure if the theoretically liberated women of today are actually any angrier than their supposedly oppressed sisters of yesteryear, but one of my theories about the constant state of fury in which so many women live today is that it has more to do with their pride and the perception of the variance between how they would like to be regarded by those around them and how they know they are actually regarded.  For example, I can’t help but recall a memorable telephone conversation with a woman who intensely disliked the fact that I never paid any attention to anything she said.  And yet, without my even asking her about a particular subject, she offered three mutually exclusive statements about it; even if I had been inclined to believe her in the first place I would have no way of knowing what to believe!  Not being interested in arguing about something of little interest to me, I ignored all of it, which quite likely infuriated her more than being called on her morass of self-contradictions would have done.</p><p>If you want to be taken seriously, you must, at the very least, avoid talking utter nonsense.  If you want to be considered successful, you must first find success.  If you want to be valued, you must provide value.  If you want to be liked, you must be likeable.  Talking about things, spinning and trying to frame the topic to your best advantage, is largely irrelevant.  The superficial always ultimately bows to the substantial.</p><p>I also don’t agree with the notion put forth by the one man’s notion that men are habitually angry as well, but it’s all repressed rather than expressed.  Obviously, some of them are, but I don’t think that it’s pent-up anger is killing so many men via stress-related strokes and heart attacks.  I think it is despair.  It is truly striking how many men I know that are largely without much hope regarding the problems of their daily life and any prospects of its improvement.  The single men look wistfully on the family lives of the married men, the married men look enviously on the carefree lives of the single men.  Sure, there’s probably somewhat of a grass-is-greener effect, but then, why would a man who describes his divorce as the best two million dollars he ever spent go and get married again not long after the divorce is final?</p><p>It seems the only conclusion that we can reasonably confirm is that everyone of both sexes is more or less IRRATIONAL and that looking for a rational reason behind women’s unhappiness or men’s despair may be more than a little akin to a snipe hunt.  Find joy where you can, find hope where you can, and be satisfied that unlike so many angry and despairing individuals, you are still capable of doing so.</p><p>And one thing every wise individual should do is to pay attention to the warning signs that are almost always there.  Men, don’t date a bitter or angry girl no matter how cute and spicy you think she is.  One day, you won’t.  Women, don’t date a saturnine man, no matter how dark and sexy you find him to be.  One day, you won’t.</p></div>",
  "content_text": "I don’t think any of the five writers surveyed\non the question of women’s anger\nhit it on the nail, although it’s certainly amusing that two of them were less interested in examining the subject raised than explaining why women’s anger is actually a good thing.  One guess as to which sex those two might happen to be….  This guy sounds rather like an acquaintance of mine when he describes his mine field of a relationship:\nThey do seem to be terribly angry these days, don’t they, women? I’ve always assumed it’s because of something we’ve done, we men. But that’s a sexist and solipsistic response which only makes them all the angrier….  There’s a window of about five days in the month when she acts like a normal person, smiles, says please and thank you, doesn’t wander around with the bread knife held aloft. For the rest of the time you just tiptoe around her with a haunted expression. I know it’s something I’ve done, or not done. Or something we’ve done, we men.\nI’m not sure if the theoretically liberated women of today are actually any angrier than their supposedly oppressed sisters of yesteryear, but one of my theories about the constant state of fury in which so many women live today is that it has more to do with their pride and the perception of the variance between how they would like to be regarded by those around them and how they know they are actually regarded.  For example, I can’t help but recall a memorable telephone conversation with a woman who intensely disliked the fact that I never paid any attention to anything she said.  And yet, without my even asking her about a particular subject, she offered three mutually exclusive statements about it; even if I had been inclined to believe her in the first place I would have no way of knowing what to believe!  Not being interested in arguing about something of little interest to me, I ignored all of it, which quite likely infuriated her more than being called on her morass of self-contradictions would have done.\nIf you want to be taken seriously, you must, at the very least, avoid talking utter nonsense.  If you want to be considered successful, you must first find success.  If you want to be valued, you must provide value.  If you want to be liked, you must be likeable.  Talking about things, spinning and trying to frame the topic to your best advantage, is largely irrelevant.  The superficial always ultimately bows to the substantial.\nI also don’t agree with the notion put forth by the one man’s notion that men are habitually angry as well, but it’s all repressed rather than expressed.  Obviously, some of them are, but I don’t think that it’s pent-up anger is killing so many men via stress-related strokes and heart attacks.  I think it is despair.  It is truly striking how many men I know that are largely without much hope regarding the problems of their daily life and any prospects of its improvement.  The single men look wistfully on the family lives of the married men, the married men look enviously on the carefree lives of the single men.  Sure, there’s probably somewhat of a grass-is-greener effect, but then, why would a man who describes his divorce as the best two million dollars he ever spent go and get married again not long after the divorce is final?\nIt seems the only conclusion that we can reasonably confirm is that everyone of both sexes is more or less IRRATIONAL and that looking for a rational reason behind women’s unhappiness or men’s despair may be more than a little akin to a snipe hunt.  Find joy where you can, find hope where you can, and be satisfied that unlike so many angry and despairing individuals, you are still capable of doing so.\nAnd one thing every wise individual should do is to pay attention to the warning signs that are almost always there.  Men, don’t date a bitter or angry girl no matter how cute and spicy you think she is.  One day, you won’t.  Women, don’t date a saturnine man, no matter how dark and sexy you find him to be.  One day, you won’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-01-06T10:01:00+00:00"
}