{
  "url": "https://voxday.net/2020/04/14/an-arkhaven-subscription/",
  "scraped_at": "2025-12-21T12:51:03.003138",
  "title": "An Arkhaven subscription",
  "date_display": "April 14, 2020",
  "date_iso": "2020-04-14T10:04:12+00:00",
  "date_from_url": "2020-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.patreon.com/ArkhavenComics\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"200\" data-original-width=\"141\" decoding=\"async\" src=\"https://social.infogalactic.com/images/posts/810ad090-0a70-44ec-8556-02bdc8f999f4/medium-9b125658d2f6baa488759b9eddddc425.png?v=63754010131\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"200\" data-original-width=\"141\" data-src=\"https://social.infogalactic.com/images/posts/810ad090-0a70-44ec-8556-02bdc8f999f4/medium-9b125658d2f6baa488759b9eddddc425.png?v=63754010131\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20141%20200%22%3E%3C/svg%3E\"/></a>A number of people have been asking for some form of <a href=\"https://www.patreon.com/ArkhavenComics\">Arkhaven subscription</a> for over a year now, and as I’ve mentioned, I’ve been reluctant to commit to that for various reasons, most of them related to a lack of confidence about our ability to fulfil the necessary commitments involved. And I’m still not willing to commit to a new print comic from the same series being released every month, as there are too many moving parts involved in the process to be certain that we can do that, while the collapse of the retail market obviously further complicates things in that regard.</p><p>However, the recent developments concerning the ongoing crash of the mainstream comics industry and the discovery of the massive Webtoons market has caused us to modify our strategic thinking, especially due to the way that the latter is presently tied to a certain company with which Replatformers will be familiar. In light of this recalibration, we have decided to make available <a href=\"https://www.patreon.com/ArkhavenComics\">an Arkhaven subscription</a> for The Legend Chuck Dixon, beginning with <i><a href=\"https://www.webtoons.com/en/challenge/chuck-dixons-avalon/list?title_no=412218\">Chuck Dixon’s Avalon</a></i>, which is the first of what we hope will be many of his Arkhaven comics available in episodic format on Webtoons.</p><p>There are currently four levels of support for <a href=\"https://www.patreon.com/ArkhavenComics\">the new comics subscription</a>. Initially, the rewards are focused on utilizing existing content, some of which has never before been released from The Legend’s archives, but once we hit certain levels, the rewards will change to reflect our ability to provide new content, including brand new series from The Legend as well as more of his literary adaptations such as <i>Right Ho, Jeeves</i>, <i>The Hobbit</i>, and <i>A Throne of Bones</i>. The image on the upper left is a sketch for the cover of the first issue of the latter. The levels are stackable, so Collector’s Only will include the other three.</p><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.patreon.com/ArkhavenComics\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"532\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://social.infogalactic.com/images/posts/dac8c7e6-0e73-436c-a5b2-219ade43a1a6/original-8ee499db89ba8405f8888fa453e3615d.jpg?v=63754011295\" width=\"212\"/></a></div><ul><li>$1 Ace’s Army</li><li>$3 Lawdog’s Legion</li><li>$5 Rebel’s Renegades</li><li>$20 Collector’s Only</li></ul><p>We haven’t set any formal goals yet, but we probably need to be around $3k monthly before we can reasonably commit to providing pure subscriber-driven content, which would result in a) weekly digital episodes, b) gold logo single issues for the subscribers, and c) retail omnibuses (with subscriber’s discount) of the new comic. In the meantime, we have begun the episodic offensive. Speaking of which, I’m pleased to be able to announce the first weekly episodes of both <i><a href=\"https://www.webtoons.com/en/challenge/right-ho-jeeves/list?title_no=414742\">Right Ho, Jeeves</a></i> and <a href=\"https://www.webtoons.com/en/challenge/althero/list?title_no=413189\">Alt★Hero</a>. We intend to begin with three weekly series, expanding that to five as soon as the relevant artists are brought up to speed on the new format.</p><p>This is a critical moment in the war for the comics industry. And while we’re too small to be in a position to win that war yet, this is an excellent opportunity for us to gain ground in preparation for the next round. Even if you’re not interested in comics, or in a position to subscribe, I would encourage you to subscribe to the various weekly series at Webtoons, as that is a free and easy way to take part in this. I realize that this isn’t exactly what some of you have been asking for, but I believe this is a necessary first step towards that.</p><p>On a related note, an illustrator and <a href=\"https://flickr.com/photos/185031950@N06/albums/72157711474436901\">fan of a certain French superhero</a> sent this excellent portrayal of Dynamique contemplating the ongoing collapse of establishment comics. I think it is fair to say that it is a matter of absolutely no concern to her.</p></div></div>",
  "content_text": "A number of people have been asking for some form of\nArkhaven subscription\nfor over a year now, and as I’ve mentioned, I’ve been reluctant to commit to that for various reasons, most of them related to a lack of confidence about our ability to fulfil the necessary commitments involved. And I’m still not willing to commit to a new print comic from the same series being released every month, as there are too many moving parts involved in the process to be certain that we can do that, while the collapse of the retail market obviously further complicates things in that regard.\nHowever, the recent developments concerning the ongoing crash of the mainstream comics industry and the discovery of the massive Webtoons market has caused us to modify our strategic thinking, especially due to the way that the latter is presently tied to a certain company with which Replatformers will be familiar. In light of this recalibration, we have decided to make available\nan Arkhaven subscription\nfor The Legend Chuck Dixon, beginning with\nChuck Dixon’s Avalon\n, which is the first of what we hope will be many of his Arkhaven comics available in episodic format on Webtoons.\nThere are currently four levels of support for\nthe new comics subscription\n. Initially, the rewards are focused on utilizing existing content, some of which has never before been released from The Legend’s archives, but once we hit certain levels, the rewards will change to reflect our ability to provide new content, including brand new series from The Legend as well as more of his literary adaptations such as\nRight Ho, Jeeves\n,\nThe Hobbit\n, and\nA Throne of Bones\n. The image on the upper left is a sketch for the cover of the first issue of the latter. The levels are stackable, so Collector’s Only will include the other three.\n$1 Ace’s Army\n$3 Lawdog’s Legion\n$5 Rebel’s Renegades\n$20 Collector’s Only\nWe haven’t set any formal goals yet, but we probably need to be around $3k monthly before we can reasonably commit to providing pure subscriber-driven content, which would result in a) weekly digital episodes, b) gold logo single issues for the subscribers, and c) retail omnibuses (with subscriber’s discount) of the new comic. In the meantime, we have begun the episodic offensive. Speaking of which, I’m pleased to be able to announce the first weekly episodes of both\nRight Ho, Jeeves\nand\nAlt★Hero\n. We intend to begin with three weekly series, expanding that to five as soon as the relevant artists are brought up to speed on the new format.\nThis is a critical moment in the war for the comics industry. And while we’re too small to be in a position to win that war yet, this is an excellent opportunity for us to gain ground in preparation for the next round. Even if you’re not interested in comics, or in a position to subscribe, I would encourage you to subscribe to the various weekly series at Webtoons, as that is a free and easy way to take part in this. I realize that this isn’t exactly what some of you have been asking for, but I believe this is a necessary first step towards that.\nOn a related note, an illustrator and\nfan of a certain French superhero\nsent this excellent portrayal of Dynamique contemplating the ongoing collapse of establishment comics. I think it is fair to say that it is a matter of absolutely no concern to her.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-14T09:04:12+00:00"
}