{
  "url": "https://voxday.net/2020/04/13/and-then-they-came-for-anime/",
  "scraped_at": "2025-12-21T12:50:57.513804",
  "title": "And then they came for anime",
  "date_display": "April 13, 2020",
  "date_iso": "2020-04-13T11:16:51+00:00",
  "date_from_url": "2020-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is literally nothing that is safe from SJWs. Not even being part of a foreign industry conducted in a foreign language that they don’t understand <a href=\"https://www.rt.com/op-ed/485508-sjw-destroy-anime-cencorship/\">is enough to protect one</a> from their rapacious and never-ending demands to submit to their narrative:</p><blockquote><p>Fans of Japanese animation are getting increasingly angry at the politically correct reworking of the cartoons when they’re translated into English.</p><p>A recent announcement about anime production has alarmed consumers worried about the intrusion of political correctness into their entertainment. Funimation, a company that translates and distributes anime in English and which has a long record of censoring the English-language versions of the original Japanese shows, has joined a key committee overseeing anime production….</p><p>‘The Rising of the Shield Hero’ was deemed controversial in the USA because it included a storyline about a false accusation of rape. In the politically correct era of the Me Too movement, the suggestion that a woman might make a false accusation was considered provocative. The listen-and-believe agenda was deemed to apply to fiction. If Western partners – so politicised and vulnerable to social media pressure – were involved in assessing storylines, would such a plot be approved?</p><p>Western companies, staffed by individuals with assertive political and social outlooks, will attempt to influence Japanese studios, imposing their own beliefs. When progressives have the ability to meddle in the creative process they will not hold back, even if it leads to disastrous financial consequences. We already have evidence of this in the collapse of American superhero comics.</p><p>If you are not a fan of anime or manga, why should you care? Evidence shows that incremental expansion of control within culture affects us all. Political correctness in pop culture has already distorted production and reception of card games, video games, comics, movies and other areas. In high culture, moralising authoritarians exert powerful domination over fiction publication, theatre, ballet and museums, even leaving aside academia. Suppression of creativity and diversity of thought will continue and expand unless we actively expose and oppose it.</p></blockquote><p>This is why we fight back every single time, in every single industry, no matter how seemingly insignificant. And as will be announced later today, we’re taking the opportunity of the SJW-inspired collapse in establishment superhero comics mentioned in the article to take back the ground that has been conceded to them.</p><p>Sometimes people ask me why I bother with comics when it obviously is not an area of particular interest to me. And it’s not, to be sure, as I have previously pointed out on the Darkstream, unless you read Eco and Dante in the original Italian, Goethe and Nietzsche in the original German, and Balzac in the original French, and your favorite authors are Eco, Hesse, and Murakami, you can’t possibly even hope to aspire to my level of literary snobdom. You need not remind me of the comic genre’s dearth of intellectual value; the fact that Neil Gaiman’s <i>Sandman</i> is considered the creme de la creme of comics should be a major point of embarrassment rather than pride.</p><p>But if you consider the level of influence Hollywood has had over Western culture for the last sixty years, then simply consider the list of movies that performed best at the box office, it is patently obvious that comics is one battleground that must not be conceded to the enemies of Western civilization.</p></div>",
  "content_text": "There is literally nothing that is safe from SJWs. Not even being part of a foreign industry conducted in a foreign language that they don’t understand\nis enough to protect one\nfrom their rapacious and never-ending demands to submit to their narrative:\nFans of Japanese animation are getting increasingly angry at the politically correct reworking of the cartoons when they’re translated into English.\nA recent announcement about anime production has alarmed consumers worried about the intrusion of political correctness into their entertainment. Funimation, a company that translates and distributes anime in English and which has a long record of censoring the English-language versions of the original Japanese shows, has joined a key committee overseeing anime production….\n‘The Rising of the Shield Hero’ was deemed controversial in the USA because it included a storyline about a false accusation of rape. In the politically correct era of the Me Too movement, the suggestion that a woman might make a false accusation was considered provocative. The listen-and-believe agenda was deemed to apply to fiction. If Western partners – so politicised and vulnerable to social media pressure – were involved in assessing storylines, would such a plot be approved?\nWestern companies, staffed by individuals with assertive political and social outlooks, will attempt to influence Japanese studios, imposing their own beliefs. When progressives have the ability to meddle in the creative process they will not hold back, even if it leads to disastrous financial consequences. We already have evidence of this in the collapse of American superhero comics.\nIf you are not a fan of anime or manga, why should you care? Evidence shows that incremental expansion of control within culture affects us all. Political correctness in pop culture has already distorted production and reception of card games, video games, comics, movies and other areas. In high culture, moralising authoritarians exert powerful domination over fiction publication, theatre, ballet and museums, even leaving aside academia. Suppression of creativity and diversity of thought will continue and expand unless we actively expose and oppose it.\nThis is why we fight back every single time, in every single industry, no matter how seemingly insignificant. And as will be announced later today, we’re taking the opportunity of the SJW-inspired collapse in establishment superhero comics mentioned in the article to take back the ground that has been conceded to them.\nSometimes people ask me why I bother with comics when it obviously is not an area of particular interest to me. And it’s not, to be sure, as I have previously pointed out on the Darkstream, unless you read Eco and Dante in the original Italian, Goethe and Nietzsche in the original German, and Balzac in the original French, and your favorite authors are Eco, Hesse, and Murakami, you can’t possibly even hope to aspire to my level of literary snobdom. You need not remind me of the comic genre’s dearth of intellectual value; the fact that Neil Gaiman’s\nSandman\nis considered the creme de la creme of comics should be a major point of embarrassment rather than pride.\nBut if you consider the level of influence Hollywood has had over Western culture for the last sixty years, then simply consider the list of movies that performed best at the box office, it is patently obvious that comics is one battleground that must not be conceded to the enemies of Western civilization.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-13T10:16:51+00:00"
}