{
  "url": "https://voxday.net/2020/04/25/bad-news-for-biden/",
  "scraped_at": "2025-12-21T12:52:08.346772",
  "title": "Bad news for Biden",
  "date_display": "April 25, 2020",
  "date_iso": "2020-04-25T11:54:05+00:00",
  "date_from_url": "2020-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the extremely unlikely event he is ever elected President, Joe Biden will need <a href=\"https://www.catholicnewsagency.com/news/dutch-supreme-court-rules-doctors-can-euthanize-dementia-patients-31228\">to avoid visiting The Netherlands</a>:</p><blockquote class=\"tr_bq\"><p>The Supreme Court of the Netherlands ruled on Tuesday, April 21, that it is lawful for doctors to euthanize patients with severe dementia…. Lower courts had previously ruled that a doctor had not acted improperly when he euthanized a 74-year-old woman with advanced dementia, even though the woman had to be repeatedly sedated and physically restrained during the procedure. </p></blockquote><p>I don’t see Creepy Joe’s dementia as necessarily being a serious impediment to his prospective Presidency, though. Let’s face it, Obama was a better President than most of us expected <i>because</i> he spent most of the time he wasn’t on the golf course stoned and watching ESPN.</p></div>",
  "content_text": "In the extremely unlikely event he is ever elected President, Joe Biden will need\nto avoid visiting The Netherlands\n:\nThe Supreme Court of the Netherlands ruled on Tuesday, April 21, that it is lawful for doctors to euthanize patients with severe dementia…. Lower courts had previously ruled that a doctor had not acted improperly when he euthanized a 74-year-old woman with advanced dementia, even though the woman had to be repeatedly sedated and physically restrained during the procedure.\nI don’t see Creepy Joe’s dementia as necessarily being a serious impediment to his prospective Presidency, though. Let’s face it, Obama was a better President than most of us expected\nbecause\nhe spent most of the time he wasn’t on the golf course stoned and watching ESPN.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-25T10:54:05+00:00"
}