{
  "url": "https://voxday.net/2020/04/10/balance-ton-porc/",
  "scraped_at": "2025-12-21T12:50:40.125662",
  "title": "Balance ton porc",
  "date_display": "April 10, 2020",
  "date_iso": "2020-04-10T14:19:37+00:00",
  "date_from_url": "2020-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That means “denounce your pig”, which is the French equivalent of the #MeToo movement. It occurs to me that at some point in the near future, it’s going to suddenly strike everyone across the West what actually inspired the periodical pogroms of history. Because it’s rapidly becoming apparent what that inspiration was and why we are headed for another round of them.</p><blockquote><p>Gabriel Matzneff never tried to hide what he was. And why should he? In France’s highbrow intellectual circles, sexual deviancy has always tended to be something that ‘right-thinking’ liberals celebrate.</p><p>The writer and philosopher, now 83, was therefore elevated to fame in 1974 when he published a highbrow defence of child sex called <i>Les Moins De Seize Ans</i> which argued that ‘sleeping with a girl or a boy is a … baptismal challenge, a sacred adventure’.</p><p>His book was widely admired in literary Paris, where it was then fashionable to regard paedophiles as a sort of oppressed minority, seeking to rebel against traditional middle-class values.</p><p>Matzneff became a regular on TV, as a studio guest on a famous arts programme and was granted a column in newspaper Le Monde.</p><p>He signed lucrative book deals with prestigious publishers Gallimard and built friendships with a host of establishment figures, from designer Yves Saint Laurent to the future President Francois Mitterrand, who declared him a ‘hedonist inspiration’. The nation’s great and good continued to celebrate this self-confessed paedophile after the publication in 1985 of his explicit diaries <i>Un Galop d’Enfer</i>, in which he not only spoke of seducing young schoolgirls but also recalled regular visits to child prostitutes in the Philippines. On these trips, he wrote: ‘Sometimes, I’ll have as many as four boys, from eight to 14 years old, in my bed at the same time.’</p><p>Far from being chucked in jail, this candid admission saw Matzneff likened by the country’s intellectual elite to Vladimir Nabokov, the author of Lolita. He was garlanded with major state honours, becoming an Officer of Arts and Letters and Knight of the Order of National Merit.</p></blockquote><p>Already, you can safely assume it’s one of two things. And since Matzneff doesn’t exactly sound like your average Trekkie, one consults Wikipedia….</p><p><i>Matzneff came from a family of Russian émigrés who settled in France after 1917. </i></p><p>Quelle surprise.</p></div>",
  "content_text": "That means “denounce your pig”, which is the French equivalent of the #MeToo movement. It occurs to me that at some point in the near future, it’s going to suddenly strike everyone across the West what actually inspired the periodical pogroms of history. Because it’s rapidly becoming apparent what that inspiration was and why we are headed for another round of them.\nGabriel Matzneff never tried to hide what he was. And why should he? In France’s highbrow intellectual circles, sexual deviancy has always tended to be something that ‘right-thinking’ liberals celebrate.\nThe writer and philosopher, now 83, was therefore elevated to fame in 1974 when he published a highbrow defence of child sex called\nLes Moins De Seize Ans\nwhich argued that ‘sleeping with a girl or a boy is a … baptismal challenge, a sacred adventure’.\nHis book was widely admired in literary Paris, where it was then fashionable to regard paedophiles as a sort of oppressed minority, seeking to rebel against traditional middle-class values.\nMatzneff became a regular on TV, as a studio guest on a famous arts programme and was granted a column in newspaper Le Monde.\nHe signed lucrative book deals with prestigious publishers Gallimard and built friendships with a host of establishment figures, from designer Yves Saint Laurent to the future President Francois Mitterrand, who declared him a ‘hedonist inspiration’. The nation’s great and good continued to celebrate this self-confessed paedophile after the publication in 1985 of his explicit diaries\nUn Galop d’Enfer\n, in which he not only spoke of seducing young schoolgirls but also recalled regular visits to child prostitutes in the Philippines. On these trips, he wrote: ‘Sometimes, I’ll have as many as four boys, from eight to 14 years old, in my bed at the same time.’\nFar from being chucked in jail, this candid admission saw Matzneff likened by the country’s intellectual elite to Vladimir Nabokov, the author of Lolita. He was garlanded with major state honours, becoming an Officer of Arts and Letters and Knight of the Order of National Merit.\nAlready, you can safely assume it’s one of two things. And since Matzneff doesn’t exactly sound like your average Trekkie, one consults Wikipedia….\nMatzneff came from a family of Russian émigrés who settled in France after 1917.\nQuelle surprise.",
  "tags": [
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-10T13:19:37+00:00"
}