{
  "url": "https://voxday.net/2020/04/06/but-which-god/",
  "scraped_at": "2025-12-21T12:50:16.960786",
  "title": "But WHICH god?",
  "date_display": "April 6, 2020",
  "date_iso": "2020-04-06T10:50:42+00:00",
  "date_from_url": "2020-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.unz.com/article/enshrining-god-in-the-constitution-robespierres-great-idea/\">This defense of Robespierre</a> is fascinating, illustrating as it does that one of the architects of the French Revolution was very different than he is commonly portrayed today. He was certainly much more sound than the average intellectual today on atheists and atheism. But I am not so certain as the author of the article that the god of which he was speaking was necessarily the Christian God.</p><blockquote><p>Robespierre castigated the irreligion that prevailed in the aristocracy and the high clergy, with bishops like Talleyrand openly boasting of lying every Sunday. A gap had widened between the clerical hierarchy and the country priests. Among the latter, many were responsible for drafting the peasants’ cahiers de doléances. The counter-revolutionary bishop Charles de Coucy, of La Rochelle, said in 1797 that the Revolution was “started by the bad priests.” For Robespierre, they were the “good priests” whom the people of the countryside needed.</p><p>Robespierre was inflexible against the priests who submitted to the pope by refusing to take an oath on the Civil Constitution (voted July 12, 1790). But he also opposed, until his last breath, any plan to abolish the funds allocated to Catholic worship under the same Civil Constitution. He also opposed, but in vain, the new Republican calendar, with its ten-day week aimed at “suppressing Sunday,” by the admission of its inventor Charles-Gilbert Romme.</p><p>Robespierre’s worst enemies were the militant atheists, the Enragés like Pierre-Gaspard Chaumette or Jacques-René Hébert, who unleashed the movement for dechristianization in November 1793, and started closing the churches in Paris or transforming them into “Temples of Reason”, with the slogan “death is an eternal sleep” posted on the gates of cemeteries. Robespierre condemned “those men who have no other merit than that of adorning themselves with an anti-religious zeal,” and who “throw trouble and discord among us” (Club des Jacobins, November 21 1793). In his speech to the National Convention of December 5, 1793, he accused the dechristianizers of acting secretly for the counter-revolution. Indeed, “hostile foreign powers support the dechristianization of France as a policy pushing rural France into conflict with the Republic for religious reasons and thus recruiting armies against the Republic in Vendée and in Belgium.” By exploiting the violence of militant atheist extremists, these foreign powers have two aims: “the first to recruit the Vendée, to alienate the peoples of the French nation and to use philosophy for the destruction of freedom; the second, to disturb public tranquility in the interior, and to distract all minds, when it is necessary to collect them to lay the unshakable foundations of the Revolution.”</p><p>Again in his “Report against Philosophism and for the Freedom of Worship” (November 21, 1793), Robespierre again castigated the grotesque cults of Reason instituted in churches by atheist fanatics:</p><p><i>“By what right do they come to disturb the freedom of worship, in the name of freedom, and attack fanaticism with a new fanaticism? By what right do they degenerate the solemn tributes paid to pure truth, in eternal and ridiculous pranks? Why should they be allowed to play with the dignity of the people in this way, and to tie the bells of madness to the very scepter of philosophy?”</i></p></blockquote><p>Anyhow, it’s a very good article that is well worth reading in its entirety.</p></div>",
  "content_text": "This defense of Robespierre\nis fascinating, illustrating as it does that one of the architects of the French Revolution was very different than he is commonly portrayed today. He was certainly much more sound than the average intellectual today on atheists and atheism. But I am not so certain as the author of the article that the god of which he was speaking was necessarily the Christian God.\nRobespierre castigated the irreligion that prevailed in the aristocracy and the high clergy, with bishops like Talleyrand openly boasting of lying every Sunday. A gap had widened between the clerical hierarchy and the country priests. Among the latter, many were responsible for drafting the peasants’ cahiers de doléances. The counter-revolutionary bishop Charles de Coucy, of La Rochelle, said in 1797 that the Revolution was “started by the bad priests.” For Robespierre, they were the “good priests” whom the people of the countryside needed.\nRobespierre was inflexible against the priests who submitted to the pope by refusing to take an oath on the Civil Constitution (voted July 12, 1790). But he also opposed, until his last breath, any plan to abolish the funds allocated to Catholic worship under the same Civil Constitution. He also opposed, but in vain, the new Republican calendar, with its ten-day week aimed at “suppressing Sunday,” by the admission of its inventor Charles-Gilbert Romme.\nRobespierre’s worst enemies were the militant atheists, the Enragés like Pierre-Gaspard Chaumette or Jacques-René Hébert, who unleashed the movement for dechristianization in November 1793, and started closing the churches in Paris or transforming them into “Temples of Reason”, with the slogan “death is an eternal sleep” posted on the gates of cemeteries. Robespierre condemned “those men who have no other merit than that of adorning themselves with an anti-religious zeal,” and who “throw trouble and discord among us” (Club des Jacobins, November 21 1793). In his speech to the National Convention of December 5, 1793, he accused the dechristianizers of acting secretly for the counter-revolution. Indeed, “hostile foreign powers support the dechristianization of France as a policy pushing rural France into conflict with the Republic for religious reasons and thus recruiting armies against the Republic in Vendée and in Belgium.” By exploiting the violence of militant atheist extremists, these foreign powers have two aims: “the first to recruit the Vendée, to alienate the peoples of the French nation and to use philosophy for the destruction of freedom; the second, to disturb public tranquility in the interior, and to distract all minds, when it is necessary to collect them to lay the unshakable foundations of the Revolution.”\nAgain in his “Report against Philosophism and for the Freedom of Worship” (November 21, 1793), Robespierre again castigated the grotesque cults of Reason instituted in churches by atheist fanatics:\n“By what right do they come to disturb the freedom of worship, in the name of freedom, and attack fanaticism with a new fanaticism? By what right do they degenerate the solemn tributes paid to pure truth, in eternal and ridiculous pranks? Why should they be allowed to play with the dignity of the people in this way, and to tie the bells of madness to the very scepter of philosophy?”\nAnyhow, it’s a very good article that is well worth reading in its entirety.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-06T09:50:42+00:00"
}