{
  "url": "https://voxday.net/2020/04/11/correcting-the-fake-narrative/",
  "scraped_at": "2025-12-21T12:50:45.647715",
  "title": "Correcting the Fake Narrative",
  "date_display": "April 11, 2020",
  "date_iso": "2020-04-11T09:06:34+00:00",
  "date_from_url": "2020-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Fake News has been attempting <a href=\"https://theothermccain.com/2020/04/10/jan-30-we-still-believe-the-immediate-risk-to-the-american-public-is-low/\">to retroactively establish a fake narrative</a> about President Trump’s robust response to Corona-chan:</p><blockquote><p>One of the repeated lies of the anti-Trump media is that the president failed to do what was necessary to prevent the spread of this disease. We are told, by Democrats and the media, that President Trump “wasted” six weeks during which he should have been . . . Well, doing something more than what he did, which was actually quite a lot.</p><p>On Jan. 29, Trump announced the formation of his Coronavirus Task Force, headed by HHS Secretary Alex Azar, and including the CDC director Dr. Redfield, who retired from the Army medical service with the rank of colonel, and whose medical specialty is viruses. On Jan. 31, Trump announced a ban on travel from China, which was controversial at the time. The same day Trump announced the ban, Joe Biden, campaigning in Iowa, accused the president of “hysterical xenophobia,” saying Trump was leading with “fearmongering . . . instead of science.”</p><p>The claim that Trump is “anti-science” has become part of the media’s narrative about the COVID-19 outbreak. Supposedly, a bias against science explains why the president didn’t do whatever it was that his critics, with the benefit of hindsight, say he should have done. What he actually did, however, was entirely in keeping with what the medical experts would have advised, given the circumstances. With only six known coronavirus cases in the U.S., five of them were people who had just returned from Wuhan, and the sixth was a household member of one of these travelers. So the first thing to do, obviously, was stop the arrival of more infected people from China, where the pandemic began and at the time had just been recognized as a “global emergency” by the WHO.</p><p>OK, so what happened next? As of Feb. 26 — nearly a month after Trump had created the coronavirus task force — there were still only 15 known cases of the disease in the United States. It was on Feb. 28 that Case No. 16 was identified in Santa Clara County, California:</p><p>At that point — where the 16th case had just been identified — there was not a single known COVID-19 case in New York or New Jersey. The only known case on the East Coast up to that point, was a man who had recently arrived in Boston from Wuhan, China, in late January. At that time, Boston Public Health Commission director Rita Nieves said, “The risk to the general public remains low.” And this continued to be the case throughout February, so that if you want to cherry-pick quotes by President Trump during that time saying that he believed we had the problem under control, and that the Wuhan coronavirus posed no serious risk to Americans, so what? <i>This was the consensus of the medical community at the time.</i></p></blockquote><p>Let’s not forget that when Trump declared the China travel ban nearly a month before the medical community decided that the virus posed a serious risk to Americans, he was castigated for doing this by the very same people who are criticizing him for not having done enough now.</p></div>",
  "content_text": "The Fake News has been attempting\nto retroactively establish a fake narrative\nabout President Trump’s robust response to Corona-chan:\nOne of the repeated lies of the anti-Trump media is that the president failed to do what was necessary to prevent the spread of this disease. We are told, by Democrats and the media, that President Trump “wasted” six weeks during which he should have been . . . Well, doing something more than what he did, which was actually quite a lot.\nOn Jan. 29, Trump announced the formation of his Coronavirus Task Force, headed by HHS Secretary Alex Azar, and including the CDC director Dr. Redfield, who retired from the Army medical service with the rank of colonel, and whose medical specialty is viruses. On Jan. 31, Trump announced a ban on travel from China, which was controversial at the time. The same day Trump announced the ban, Joe Biden, campaigning in Iowa, accused the president of “hysterical xenophobia,” saying Trump was leading with “fearmongering . . . instead of science.”\nThe claim that Trump is “anti-science” has become part of the media’s narrative about the COVID-19 outbreak. Supposedly, a bias against science explains why the president didn’t do whatever it was that his critics, with the benefit of hindsight, say he should have done. What he actually did, however, was entirely in keeping with what the medical experts would have advised, given the circumstances. With only six known coronavirus cases in the U.S., five of them were people who had just returned from Wuhan, and the sixth was a household member of one of these travelers. So the first thing to do, obviously, was stop the arrival of more infected people from China, where the pandemic began and at the time had just been recognized as a “global emergency” by the WHO.\nOK, so what happened next? As of Feb. 26 — nearly a month after Trump had created the coronavirus task force — there were still only 15 known cases of the disease in the United States. It was on Feb. 28 that Case No. 16 was identified in Santa Clara County, California:\nAt that point — where the 16th case had just been identified — there was not a single known COVID-19 case in New York or New Jersey. The only known case on the East Coast up to that point, was a man who had recently arrived in Boston from Wuhan, China, in late January. At that time, Boston Public Health Commission director Rita Nieves said, “The risk to the general public remains low.” And this continued to be the case throughout February, so that if you want to cherry-pick quotes by President Trump during that time saying that he believed we had the problem under control, and that the Wuhan coronavirus posed no serious risk to Americans, so what?\nThis was the consensus of the medical community at the time.\nLet’s not forget that when Trump declared the China travel ban nearly a month before the medical community decided that the virus posed a serious risk to Americans, he was castigated for doing this by the very same people who are criticizing him for not having done enough now.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-11T08:06:34+00:00"
}