{
  "url": "https://voxday.net/2020/04/18/dtg-goes-nationwide/",
  "scraped_at": "2025-12-21T12:51:32.016799",
  "title": "DtG goes nationwide",
  "date_display": "April 18, 2020",
  "date_iso": "2020-04-18T17:00:57+00:00",
  "date_from_url": "2020-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>USA Today ran an article on prepping and mentioned Castalia’s own David the Good and <a href=\"https://eu.usatoday.com/story/tech/reviewedcom/2020/03/20/8-items-preppers-recommend-emergency-like-coronavirus-crisis/2887673001/\">his survival masterpiece</a>.</p><blockquote><p>Not everyone has the privilege of owning land, but even having a backyard can offer opportunities not available to apartment dwellers, like starting a garden or raising chickens. Many preppers even had remote “bug out” locations in rural areas perfect for social isolation.</p><p>If you had a time machine, you might want to go back in time and buy 50 acres, but your best bet now is to use what you have. Our supply chain is being stressed to its limits, and even if barren shelves are more a symptom of panic buying than an actual shortage, anything we can do to relieve stress on the supply chain will help. Spring is almost here, so now is the perfect time. You might need less space than you think: Steven Cornett in San Diego started his own commercial farm on a mere quarter of an acre.</p><p>Here are some resources to get gardening fast:</p><ul><li>Steve Solomon’s <i>Gardening When It Counts</i>, which is just what it sounds like.</li><li>Mel Bartholomew’s <i>All New Square Foot Gardening</i>. The late Mel Bartholomew wasn’t what you’d call a survivalist, but his intensive, low-labor method is as close as you can get in terms of a “gardening quick fix,” especially if you have easy access to water.</li><li>David the Good’s <i>Grow or Die: The Good Guide to Survival Gardening</i>, which again, is just what it sounds like. David outlines the best crops to plant for survival, how to fertilize with your own urine, and even how to grow your own tobacco. His YouTube channel is a wealth of information.</li></ul></blockquote><p>You can pick up a paperback copy of <i>Grow or Die </i><a href=\"https://www.amazon.com/Grow-Die-Guide-Survival-Gardening/dp/9527065712/\">at Amazon</a>. Because this is the one book you do NOT want to have only in ebook.</p></div>",
  "content_text": "USA Today ran an article on prepping and mentioned Castalia’s own David the Good and\nhis survival masterpiece\n.\nNot everyone has the privilege of owning land, but even having a backyard can offer opportunities not available to apartment dwellers, like starting a garden or raising chickens. Many preppers even had remote “bug out” locations in rural areas perfect for social isolation.\nIf you had a time machine, you might want to go back in time and buy 50 acres, but your best bet now is to use what you have. Our supply chain is being stressed to its limits, and even if barren shelves are more a symptom of panic buying than an actual shortage, anything we can do to relieve stress on the supply chain will help. Spring is almost here, so now is the perfect time. You might need less space than you think: Steven Cornett in San Diego started his own commercial farm on a mere quarter of an acre.\nHere are some resources to get gardening fast:\nSteve Solomon’s\nGardening When It Counts\n, which is just what it sounds like.\nMel Bartholomew’s\nAll New Square Foot Gardening\n. The late Mel Bartholomew wasn’t what you’d call a survivalist, but his intensive, low-labor method is as close as you can get in terms of a “gardening quick fix,” especially if you have easy access to water.\nDavid the Good’s\nGrow or Die: The Good Guide to Survival Gardening\n, which again, is just what it sounds like. David outlines the best crops to plant for survival, how to fertilize with your own urine, and even how to grow your own tobacco. His YouTube channel is a wealth of information.\nYou can pick up a paperback copy of\nGrow or Die\nat Amazon\n. Because this is the one book you do NOT want to have only in ebook.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-18T16:00:57+00:00"
}