{
  "url": "https://voxday.net/2020/04/09/experiments/",
  "scraped_at": "2025-12-21T12:50:32.729504",
  "title": "Experiments",
  "date_display": "April 9, 2020",
  "date_iso": "2020-04-09T18:50:27+00:00",
  "date_from_url": "2020-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No blogging today since I’ve been working on some experiments as well as the Replatforming. You can see <a href=\"https://www.webtoons.com/en/challenge/chuck-dixons-avalon/the-street-rules-straight-up-cash/viewer?title_no=412218&amp;episode_no=1\">one of those experiments here</a>, which is the first episode of <i>Chuck Dixon’s Avalon, The Street Rules, Episode 1: Straight-up Cash</i>. We’re still sorting out how some sort of comics-related subscription can be structured, but it increasingly appears that one will be viable in one form or another. Feel free to share any ideas you have about support tiers, rewards, and so forth if this is something you want us to do.</p><p>This is a very different approach to comics, but it is a very sensible one that accomodates the new interface realities. And this happens to be a very opportune time for Arkhaven to aggressively move forward in light of the chaos consuming the establishment comics industry.</p><p>I also have some good news for the Castalia Library / Junior Classics crowd. The first Library book is now scheduled to be bound next week. Only the Library, however, not the Libraria, as the goatskins are still stuck in Italy courtesy of Corona-chan.</p></div>",
  "content_text": "No blogging today since I’ve been working on some experiments as well as the Replatforming. You can see\none of those experiments here\n, which is the first episode of\nChuck Dixon’s Avalon, The Street Rules, Episode 1: Straight-up Cash\n. We’re still sorting out how some sort of comics-related subscription can be structured, but it increasingly appears that one will be viable in one form or another. Feel free to share any ideas you have about support tiers, rewards, and so forth if this is something you want us to do.\nThis is a very different approach to comics, but it is a very sensible one that accomodates the new interface realities. And this happens to be a very opportune time for Arkhaven to aggressively move forward in light of the chaos consuming the establishment comics industry.\nI also have some good news for the Castalia Library / Junior Classics crowd. The first Library book is now scheduled to be bound next week. Only the Library, however, not the Libraria, as the goatskins are still stuck in Italy courtesy of Corona-chan.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-09T17:50:27+00:00"
}