{
  "url": "https://voxday.net/2020/04/12/i-thought-they-believed-all-women/",
  "scraped_at": "2025-12-21T12:50:55.660178",
  "title": "I thought they believed all women?",
  "date_display": "April 12, 2020",
  "date_iso": "2020-04-12T17:20:07+00:00",
  "date_from_url": "2020-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://dnyuz.com/2020/04/12/examining-tara-reades-sexual-assault-allegation-against-joe-biden/\">The New York Times hasn’t decided</a> whether Creepy Joe Biden should be canceled or not. What’s the matter, can’t they get George Soros on the phone in New Zealand or wherever he is hiding out?</p><blockquote><p>A former Senate aide who last year accused Joseph R. Biden Jr. of inappropriate touching has made an allegation of sexual assault against the former vice president, the Democratic Party’s presumptive presidential nominee this fall.</p><p>The former aide, Tara Reade, who briefly worked as a staff assistant in Mr. Biden’s Senate office, told The New York Times that in 1993, Mr. Biden pinned her to a wall in a Senate building, reached under her clothing and penetrated her with his fingers. A friend said that Ms. Reade told her the details of the allegation at the time. Another friend and a brother of Ms. Reade’s said she told them over the years about a traumatic sexual incident involving Mr. Biden.</p><p>A spokeswoman for Mr. Biden said the allegation was false. In interviews, several people who worked in the Senate office with Ms. Reade said they did not recall any talk of such an incident or similar behavior by Mr. Biden toward her or any women. Two office interns who worked directly with Ms. Reade said they were unaware of the allegation or any treatment that troubled her.</p><p>Last year, Ms. Reade and seven other women came forward to accuse Mr. Biden of kissing, hugging or touching them in ways that made them feel uncomfortable. Ms. Reade told The Times then that Mr. Biden had publicly stroked her neck, wrapped his fingers in her hair and touched her in ways that made her uncomfortable.</p><p>Soon after Ms. Reade made the new allegation, in a podcast interview released on March 25, The Times began reporting on her account and seeking corroboration through interviews, documents and other sources. The Times interviewed Ms. Reade on multiple days over hours, as well as those she told about Mr. Biden’s behavior and other friends. The Times has also interviewed lawyers who spoke to Ms. Reade about her allegation; nearly two dozen people who worked with Mr. Biden during the early 1990s, including many who worked with Ms. Reade; and the other seven women who criticized Mr. Biden last year, to discuss their experiences with him.</p><p>No other allegation about sexual assault surfaced in the course of reporting, nor did any former Biden staff members corroborate any details of Ms. Reade’s allegation. The Times found no pattern of sexual misconduct by Mr. Biden, beyond the hugs, kisses and touching that women previously said made them uncomfortable.</p></blockquote><p>Translation: Because it is still possible that Creepy Joe might be the Democratic Party’s presidential candidate,<i> the New York Times </i>found no pattern of sexual misconduct beyond the sexual misconduct that it couldn’t hope to plausibly deny.</p></div>",
  "content_text": "The New York Times hasn’t decided\nwhether Creepy Joe Biden should be canceled or not. What’s the matter, can’t they get George Soros on the phone in New Zealand or wherever he is hiding out?\nA former Senate aide who last year accused Joseph R. Biden Jr. of inappropriate touching has made an allegation of sexual assault against the former vice president, the Democratic Party’s presumptive presidential nominee this fall.\nThe former aide, Tara Reade, who briefly worked as a staff assistant in Mr. Biden’s Senate office, told The New York Times that in 1993, Mr. Biden pinned her to a wall in a Senate building, reached under her clothing and penetrated her with his fingers. A friend said that Ms. Reade told her the details of the allegation at the time. Another friend and a brother of Ms. Reade’s said she told them over the years about a traumatic sexual incident involving Mr. Biden.\nA spokeswoman for Mr. Biden said the allegation was false. In interviews, several people who worked in the Senate office with Ms. Reade said they did not recall any talk of such an incident or similar behavior by Mr. Biden toward her or any women. Two office interns who worked directly with Ms. Reade said they were unaware of the allegation or any treatment that troubled her.\nLast year, Ms. Reade and seven other women came forward to accuse Mr. Biden of kissing, hugging or touching them in ways that made them feel uncomfortable. Ms. Reade told The Times then that Mr. Biden had publicly stroked her neck, wrapped his fingers in her hair and touched her in ways that made her uncomfortable.\nSoon after Ms. Reade made the new allegation, in a podcast interview released on March 25, The Times began reporting on her account and seeking corroboration through interviews, documents and other sources. The Times interviewed Ms. Reade on multiple days over hours, as well as those she told about Mr. Biden’s behavior and other friends. The Times has also interviewed lawyers who spoke to Ms. Reade about her allegation; nearly two dozen people who worked with Mr. Biden during the early 1990s, including many who worked with Ms. Reade; and the other seven women who criticized Mr. Biden last year, to discuss their experiences with him.\nNo other allegation about sexual assault surfaced in the course of reporting, nor did any former Biden staff members corroborate any details of Ms. Reade’s allegation. The Times found no pattern of sexual misconduct by Mr. Biden, beyond the hugs, kisses and touching that women previously said made them uncomfortable.\nTranslation: Because it is still possible that Creepy Joe might be the Democratic Party’s presidential candidate,\nthe New York Times\nfound no pattern of sexual misconduct beyond the sexual misconduct that it couldn’t hope to plausibly deny.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-12T16:20:07+00:00"
}