{
  "url": "https://voxday.net/2020/04/25/its-not-exactly-plagiarism/",
  "scraped_at": "2025-12-21T12:52:12.024789",
  "title": "It’s not exactly plagiarism",
  "date_display": "April 25, 2020",
  "date_iso": "2020-04-25T23:24:49+00:00",
  "date_from_url": "2020-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But it’s hardly indicative of one a brilliant creative mind either. When I read <i>The Sandman</i> in preparation for writing comics, I occasionally had the strange feeling that I’d read it before, and not simply because Gaiman was mining a lot of stories and characters with which I was familiar from ancient mythology. I’ve been on a Tanith Lee kick of late, and it suddenly occurred to me why the Endless, and Delirium in particular, were so familiar:</p><p>Delirium: <i>The youngest of the Endless, Delirium appears as a young girl whose form changes the most frequently of any of the Endless, based on the random fluctuations of her temperament. She has wild multicolored hair and eccentric, mismatched clothes. Her only permanent physical characteristic is that one of her eyes is emerald green (usually the right side) and the other pale blue with silver flecks (usually the left side), but even those sometimes switch between left and right. Her sigil is an abstract, shapeless blob of colors. Her speech is portrayed in standard graphic novel block-caps, characterized by wavy, unpredictable orientation and a multi-colored gradient background. She was once known as Delight, but some traumatic event (of which even Destiny does not know the particulars) caused her to change into her current role. Her sigil as Delight was a flower.</i></p><p>Note that <i>The Sandman</i> ran for 75 issues from January 1989 to March 1996.</p><p><i>The main character of The Sandman is Dream, also known as Morpheus and other names, who is one of the seven Endless. The other Endless are Destiny, Death, Desire, Despair, Delirium (formerly Delight), and Destruction (also known as ‘The Prodigal’). The series is famous for Gaiman’s trademark use of anthropomorphic personification of various metaphysical entities, while also blending mythology and history in its horror setting within the DC Universe.</i><br><i><br/></i>Now consider this passage from <i>Delirium’s Master</i>, the third of Tanith Lee’s <i>Flat Earth</i> series, which was published in 1981. I’ve actually quoted from it here before; it’s the novel that contains her excellent tale of how the Snake became the Cat and thereby fooled Man.</br></p><p><i>There were then five Lords of Darkness. Uhlume, Lord Death, was one, whose citadel stood at the Earth’s core, but who came and went in the world at random. Another was Wickedness, in the person of the Prince of Demons, Azhrarn the Beautiful, whose city of Druhim Vanashta lay also underground, and who came and went in the world only by night, since demonkind abjured the sun (wisely, for it could burn them to smoke or cinders). The earth was flat, and marvelous, and had room then for such beings. But it is not remembered where a certain third Lord of Darkness made his abode, nor perhaps had he much space for private life, for he must be always everywhere.</i><br><i><br/></i><i>His name was Chuz, Prince Chuz, and he was this way. To come on him from his right side, he was a handsome man in the splendor of his youth. His hair was a blond mane couthly combed to silk, his eye, being lowered, had long gilded lashes, his lip was chiseled, his tanned skin burnished. On his hand he wore a glove of fine white leather, and on his foot a shoe of the same, and on his tall and slender body the belted robe was rich and purple-dark. “Beauteous noble young man,” said those that came to his right side. But those who approached him from the left side, shrank and hesitated to speak at all. From the left side, Chuz was a male hag on whom age had scratched his boldest signatures, still peculiarly handsome it was true, but gaunt and terrible, a snarling lip, a hollowed cheek, if anything more foul because he was fair. The skin of this man was corpse gray, and the matted hair the shade of drying blood, and his scaly eyelid, being lowered, had lashes of the same color. The left hand lay naked on the damson robe, which this side was tattered and stained, and the left foot poked naked from under it. When Chuz took a step, you saw the sole of that gray-white foot was black, and when he lifted that gray-white hand, the palm was black, and the nails were long and hooked, and red as if painted from a woman’s lacquer-pot. Then again, if Chuz raised his eyes on either side, you saw the balls of them were black, the irises red, the pupils tarnished, like old brass. And if Chuz laughed, which now and then he did, his teeth were made of bronze.</i><br><i><br/></i><i>Worst of all, was to come on Chuz from the front and see both aspects of him at once, still worse if then he raised his eyes and opened his mouth. (Though it is believed that all men, at one time or another, had glimpsed Chuz from behind.) And who was Chuz? His other name was Madness.</i></br></br></p><p>It’s not plagiarism, but it does tend to lend credence to my opinion that Gaiman is overrated as a writer. He certainly doesn’t compare to the late Ms Lee.</p></div>",
  "content_text": "But it’s hardly indicative of one a brilliant creative mind either. When I read\nThe Sandman\nin preparation for writing comics, I occasionally had the strange feeling that I’d read it before, and not simply because Gaiman was mining a lot of stories and characters with which I was familiar from ancient mythology. I’ve been on a Tanith Lee kick of late, and it suddenly occurred to me why the Endless, and Delirium in particular, were so familiar:\nDelirium:\nThe youngest of the Endless, Delirium appears as a young girl whose form changes the most frequently of any of the Endless, based on the random fluctuations of her temperament. She has wild multicolored hair and eccentric, mismatched clothes. Her only permanent physical characteristic is that one of her eyes is emerald green (usually the right side) and the other pale blue with silver flecks (usually the left side), but even those sometimes switch between left and right. Her sigil is an abstract, shapeless blob of colors. Her speech is portrayed in standard graphic novel block-caps, characterized by wavy, unpredictable orientation and a multi-colored gradient background. She was once known as Delight, but some traumatic event (of which even Destiny does not know the particulars) caused her to change into her current role. Her sigil as Delight was a flower.\nNote that\nThe Sandman\nran for 75 issues from January 1989 to March 1996.\nThe main character of The Sandman is Dream, also known as Morpheus and other names, who is one of the seven Endless. The other Endless are Destiny, Death, Desire, Despair, Delirium (formerly Delight), and Destruction (also known as ‘The Prodigal’). The series is famous for Gaiman’s trademark use of anthropomorphic personification of various metaphysical entities, while also blending mythology and history in its horror setting within the DC Universe.\nNow consider this passage from\nDelirium’s Master\n, the third of Tanith Lee’s\nFlat Earth\nseries, which was published in 1981. I’ve actually quoted from it here before; it’s the novel that contains her excellent tale of how the Snake became the Cat and thereby fooled Man.\nThere were then five Lords of Darkness. Uhlume, Lord Death, was one, whose citadel stood at the Earth’s core, but who came and went in the world at random. Another was Wickedness, in the person of the Prince of Demons, Azhrarn the Beautiful, whose city of Druhim Vanashta lay also underground, and who came and went in the world only by night, since demonkind abjured the sun (wisely, for it could burn them to smoke or cinders). The earth was flat, and marvelous, and had room then for such beings. But it is not remembered where a certain third Lord of Darkness made his abode, nor perhaps had he much space for private life, for he must be always everywhere.\nHis name was Chuz, Prince Chuz, and he was this way. To come on him from his right side, he was a handsome man in the splendor of his youth. His hair was a blond mane couthly combed to silk, his eye, being lowered, had long gilded lashes, his lip was chiseled, his tanned skin burnished. On his hand he wore a glove of fine white leather, and on his foot a shoe of the same, and on his tall and slender body the belted robe was rich and purple-dark. “Beauteous noble young man,” said those that came to his right side. But those who approached him from the left side, shrank and hesitated to speak at all. From the left side, Chuz was a male hag on whom age had scratched his boldest signatures, still peculiarly handsome it was true, but gaunt and terrible, a snarling lip, a hollowed cheek, if anything more foul because he was fair. The skin of this man was corpse gray, and the matted hair the shade of drying blood, and his scaly eyelid, being lowered, had lashes of the same color. The left hand lay naked on the damson robe, which this side was tattered and stained, and the left foot poked naked from under it. When Chuz took a step, you saw the sole of that gray-white foot was black, and when he lifted that gray-white hand, the palm was black, and the nails were long and hooked, and red as if painted from a woman’s lacquer-pot. Then again, if Chuz raised his eyes on either side, you saw the balls of them were black, the irises red, the pupils tarnished, like old brass. And if Chuz laughed, which now and then he did, his teeth were made of bronze.\nWorst of all, was to come on Chuz from the front and see both aspects of him at once, still worse if then he raised his eyes and opened his mouth. (Though it is believed that all men, at one time or another, had glimpsed Chuz from behind.) And who was Chuz? His other name was Madness.\nIt’s not plagiarism, but it does tend to lend credence to my opinion that Gaiman is overrated as a writer. He certainly doesn’t compare to the late Ms Lee.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-25T22:24:49+00:00"
}