{
  "url": "https://voxday.net/2020/04/12/looks-like-that-worked/",
  "scraped_at": "2025-12-21T12:50:53.793260",
  "title": "Looks like that worked",
  "date_display": "April 12, 2020",
  "date_iso": "2020-04-12T16:33:53+00:00",
  "date_from_url": "2020-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things we’ve learned over the last 18 months is how different artists work in very different ways. This tends to pose a range of complications, some trivial, some more challenging, in attempting to assemble the various elements into a complete whole in different formats.</p><p>One obvious candidate for Webtoons was <i>Right Ho, Jeeves</i>, but our initial assumption was that it would not be possible to break apart the page files in a manner that permitted reassembly in the vertical format popularized by the Korean manwha comics. However, a little experimentation proved to be unexpectedly fruitful, and has permitted the launch of Arkhaven’s second series there.</p><p>So, if you’re interested, have a look at <a href=\"https://www.webtoons.com/en/challenge/right-ho-jeeves/list?title_no=414742\">the first episode of <i>Right Ho, Jeeves</i>.</a> We expect to have three weekly series running there on an ongoing basis.</p></div>",
  "content_text": "One of the things we’ve learned over the last 18 months is how different artists work in very different ways. This tends to pose a range of complications, some trivial, some more challenging, in attempting to assemble the various elements into a complete whole in different formats.\nOne obvious candidate for Webtoons was\nRight Ho, Jeeves\n, but our initial assumption was that it would not be possible to break apart the page files in a manner that permitted reassembly in the vertical format popularized by the Korean manwha comics. However, a little experimentation proved to be unexpectedly fruitful, and has permitted the launch of Arkhaven’s second series there.\nSo, if you’re interested, have a look at\nthe first episode of\nRight Ho, Jeeves\n.\nWe expect to have three weekly series running there on an ongoing basis.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-12T15:33:53+00:00"
}