{
  "url": "https://voxday.net/2020/04/23/the-nature-of-the-conflict/",
  "scraped_at": "2025-12-21T12:51:59.169775",
  "title": "The nature of the conflict",
  "date_display": "April 23, 2020",
  "date_iso": "2020-04-23T14:20:01+00:00",
  "date_from_url": "2020-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Saker always has interesting and informative analyses, but the one thing he simply can’t seem to grasp is <a href=\"https://www.unz.com/tsaker/the-anglozionists-are-launching-a-strategic-psyop-against-china/\">the nature of the struggle</a> between Team Trump and the Deep State. I find this strange, since he clearly grasps the idea that there is no singular and unitary ruling elite in the West, but rather, a class of predatory rivals constantly jockeying for position:</p><blockquote class=\"tr_bq\"><p>A quick study of history shows that when exploiting elites are doing great, they all faithfully support each other, but when things start to go south, they immediately turn on each other. The best recent example of this phenomenon is the schism in the US ruling elites who, since the election of Trump, have immediately turned on each other and are now viciously fighting like “spiders in a can” (to use a Russian expression). In fact, this is so true that it can even be used as a very reliable diagnostic tool: when your enemies are all united, then they are probably confident in their victory, but as soon as they turn on each other, you *know* that things are looking very bad for your opponents. Likewise, we now see how southern Europeans are getting really angry with their northern “EU allies” (Macron seems to be falling in line behind Trump even if he uses a more careful and diplomatic language). Finally, the way the US CIA has one foreign policy, the Pentagon another and Foggy Bottom one of its own (even if limited to sanctions and finger-pointing) tells you pretty much all you need to know to see how deep the systemic crisis of the Empire has become.</p></blockquote><p>My suspicion is that since the Saker is not a religious man, he does not understand the nature of the vicious fighting is quite literally a battle between good and evil, between those who worship the Christian God the Father and those who serve the god of this world.</p><p>It’s a war between those who would protect children and those who prey upon them. Which is why we can be confident that the Saker’s narrow focus on traditional foreign policy tends to lead him astray; President Trump is the only reason that the USA is not already at war with Russia, China, and Iran.</p></div>",
  "content_text": "The Saker always has interesting and informative analyses, but the one thing he simply can’t seem to grasp is\nthe nature of the struggle\nbetween Team Trump and the Deep State. I find this strange, since he clearly grasps the idea that there is no singular and unitary ruling elite in the West, but rather, a class of predatory rivals constantly jockeying for position:\nA quick study of history shows that when exploiting elites are doing great, they all faithfully support each other, but when things start to go south, they immediately turn on each other. The best recent example of this phenomenon is the schism in the US ruling elites who, since the election of Trump, have immediately turned on each other and are now viciously fighting like “spiders in a can” (to use a Russian expression). In fact, this is so true that it can even be used as a very reliable diagnostic tool: when your enemies are all united, then they are probably confident in their victory, but as soon as they turn on each other, you *know* that things are looking very bad for your opponents. Likewise, we now see how southern Europeans are getting really angry with their northern “EU allies” (Macron seems to be falling in line behind Trump even if he uses a more careful and diplomatic language). Finally, the way the US CIA has one foreign policy, the Pentagon another and Foggy Bottom one of its own (even if limited to sanctions and finger-pointing) tells you pretty much all you need to know to see how deep the systemic crisis of the Empire has become.\nMy suspicion is that since the Saker is not a religious man, he does not understand the nature of the vicious fighting is quite literally a battle between good and evil, between those who worship the Christian God the Father and those who serve the god of this world.\nIt’s a war between those who would protect children and those who prey upon them. Which is why we can be confident that the Saker’s narrow focus on traditional foreign policy tends to lead him astray; President Trump is the only reason that the USA is not already at war with Russia, China, and Iran.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-04-23T13:20:01+00:00"
}