{
  "url": "https://voxday.net/2020/07/07/a-tale-of-two-filings/",
  "scraped_at": "2025-12-21T13:00:28.995902",
  "title": "A tale of two filings",
  "date_display": "July 7, 2020",
  "date_iso": "2020-07-07T17:01:43+00:00",
  "date_from_url": "2020-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This complete lack of a response to one of the core elements of the dispute pretty much tells you everything you need to know about how next week’s hearing is likely to go.</p><ul><li>JAMS issued a second letter on March 12, 2020, stating that JAMS would not issue a blanket stay for numerous separate arbitrations.  Specifically, the March 12 JAMS Letter stated: “Patreon’s Terms of Use state that arbitrations ‘may only take place on an individual basis’ and no ‘grouping of parties is allowed.’  (Terms of Use, pages 4 – 5). </li><li>In fact, this matter is subject to dismissal under even the Purported Amendment.  The dispute resolution clause expressly states that “[n]o class arbitrations or other grouping of parties is allowed.”  Patreon, here, has made a grouping of Defendants.  By its own terms, it is not entitled to file this suit and seek the relief it requests.  Patreon is not entitled to an injunction that covers 72 defendants as a group—just as Patreon chose to deny Defendants the ability to join as a group and engage in collective action, it cannot now be allowed to obtain an injunction in violation of that term.</li><li>– DEFENDANTS’ OPPOSITION TO MOTION FOR ISSUANCE OF PRELIMINARY INJUNCTION</li></ul><p>SEARCH “grouping”</p><p><i>no matches found</i></p><p>– PLAINTIFF PATREON, INC.’S REPLY IN SUPPORT OF REQUEST FOR PRELIMINARY INJUNCTION [Filed concurrently with Declarations of Colin Sullivan and Tyler M. Layton in Support of Reply]</p><p>The irony is that Patreon is now complaining about the way a number of the Bears being sued have put Patreon on notice that they will find themselves facing more arbitrations due to Patreon’s breach of contract involved in bringing the group lawsuit. Their Head of Legal cried about it in their most recent filing with a classic “this just proves” argument that would almost make one mistake him for a bowtie-wearing <i>National Review</i> conservative.</p><blockquote class=\"tr_bq\"><p>On July 2, 2020, I received emails from 15 Defendants, informing me that unless Patreon withdraws this lawsuit, they intend to commence new arbitrations before JAMS claiming that Patreon’s filing of this lawsuit, to enforce the amended Terms of Use, is a breach of the Terms of Use.  Given that Defendants are already challenging the amended Terms of Use in their already pending arbitrations, this confirms that Defendants’ actual goal is to multiply the number of duplicative proceedings to maximize costs to Patreon, in the hopes they can eventually exceed Patreon’s ability to pay.  That outcome would be an irreparable harm.<br>– Declaration of Colin Sullivan in Support of Reply</br></p></blockquote><p>It doesn’t prove anything of the sort. To the contrary, informing Patreon that new arbitrations will be commenced if the breach of contract isn’t cured is <u>exactly</u> what Patreon’s Terms of Use <u>require</u> the Bears to do in light of Patreon’s obvious breach of the contract, as spelled out in the very emails about which he is complaining.</p><blockquote><p>I am sending you this notice pursuant to the procedures stipulated in Patreon’s Terms of Use to inform Pateron, Inc. that the filing of case CGC-20-584586 against myself and 71 other individuals constitutes a blatant breach of its own Terms, which, as you know, clearly prohibit the grouping of parties.</p><p><i>No class arbitrations or other grouping of parties is allowed. By agreeing to these terms you are waiving your right to trial by jury or to participate in a class action or representative proceeding; we are also waiving these rights.</i></p></blockquote><p>Patreon very clearly waived its rights to participate in the very lawsuit it filed. They not only have no right to an emergency injunction, they have no right to be in that courtroom for those purposes at all. So, they should hardly be surprised when the people they are suing call them out for that.</p></div>",
  "content_text": "This complete lack of a response to one of the core elements of the dispute pretty much tells you everything you need to know about how next week’s hearing is likely to go.\nJAMS issued a second letter on March 12, 2020, stating that JAMS would not issue a blanket stay for numerous separate arbitrations.  Specifically, the March 12 JAMS Letter stated: “Patreon’s Terms of Use state that arbitrations ‘may only take place on an individual basis’ and no ‘grouping of parties is allowed.’  (Terms of Use, pages 4 – 5).\nIn fact, this matter is subject to dismissal under even the Purported Amendment.  The dispute resolution clause expressly states that “[n]o class arbitrations or other grouping of parties is allowed.”  Patreon, here, has made a grouping of Defendants.  By its own terms, it is not entitled to file this suit and seek the relief it requests.  Patreon is not entitled to an injunction that covers 72 defendants as a group—just as Patreon chose to deny Defendants the ability to join as a group and engage in collective action, it cannot now be allowed to obtain an injunction in violation of that term.\n– DEFENDANTS’ OPPOSITION TO MOTION FOR ISSUANCE OF PRELIMINARY INJUNCTION\nSEARCH “grouping”\nno matches found\n– PLAINTIFF PATREON, INC.’S REPLY IN SUPPORT OF REQUEST FOR PRELIMINARY INJUNCTION [Filed concurrently with Declarations of Colin Sullivan and Tyler M. Layton in Support of Reply]\nThe irony is that Patreon is now complaining about the way a number of the Bears being sued have put Patreon on notice that they will find themselves facing more arbitrations due to Patreon’s breach of contract involved in bringing the group lawsuit. Their Head of Legal cried about it in their most recent filing with a classic “this just proves” argument that would almost make one mistake him for a bowtie-wearing\nNational Review\nconservative.\nOn July 2, 2020, I received emails from 15 Defendants, informing me that unless Patreon withdraws this lawsuit, they intend to commence new arbitrations before JAMS claiming that Patreon’s filing of this lawsuit, to enforce the amended Terms of Use, is a breach of the Terms of Use.  Given that Defendants are already challenging the amended Terms of Use in their already pending arbitrations, this confirms that Defendants’ actual goal is to multiply the number of duplicative proceedings to maximize costs to Patreon, in the hopes they can eventually exceed Patreon’s ability to pay.  That outcome would be an irreparable harm.\n– Declaration of Colin Sullivan in Support of Reply\nIt doesn’t prove anything of the sort. To the contrary, informing Patreon that new arbitrations will be commenced if the breach of contract isn’t cured is\nexactly\nwhat Patreon’s Terms of Use\nrequire\nthe Bears to do in light of Patreon’s obvious breach of the contract, as spelled out in the very emails about which he is complaining.\nI am sending you this notice pursuant to the procedures stipulated in Patreon’s Terms of Use to inform Pateron, Inc. that the filing of case CGC-20-584586 against myself and 71 other individuals constitutes a blatant breach of its own Terms, which, as you know, clearly prohibit the grouping of parties.\nNo class arbitrations or other grouping of parties is allowed. By agreeing to these terms you are waiving your right to trial by jury or to participate in a class action or representative proceeding; we are also waiving these rights.\nPatreon very clearly waived its rights to participate in the very lawsuit it filed. They not only have no right to an emergency injunction, they have no right to be in that courtroom for those purposes at all. So, they should hardly be surprised when the people they are suing call them out for that.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-07T16:01:43+00:00"
}