{
  "url": "https://voxday.net/2020/07/28/at-least-we-have-a-good-idea/",
  "scraped_at": "2025-12-21T13:02:34.396824",
  "title": "At least we have a good idea",
  "date_display": "July 28, 2020",
  "date_iso": "2020-07-28T09:26:21+00:00",
  "date_from_url": "2020-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How the USA <a href=\"https://nationalinterest.org/feature/mike-pompeo-just-declared-americas-new-china-policy-regime-change-165639\">is going to come to an end</a> by 2033:</p><blockquote><p>Secretary of State Mike Pompeo, from the podium at the Richard Nixon Presidential Library and Museum in Yorba Linda, California, laid out in no uncertain terms what the administration wanted to do and how it planned to go about accomplishing its ambitious aims.</p><p>America, the secretary of state said, has effectively ditched five decades of “engagement” policy and is now embracing a policy now out of favor across the American policy establishment: regime change.</p><p>Formally, the State Department still “engages” China, Pompeo said, but “simply to demand fairness and reciprocity.” Gone are the days when American diplomats engaged China to support the Communist Party. Too often in the past, U.S. presidents rescued Chinese communism, three times—Nixon in 1972, Bush in 1989, and Clinton in 1999—in particular.</p><p>More importantly, Pompeo said there would be a new form of engagement. “We must also engage and empower the Chinese people—a dynamic, freedom-loving people who are completely distinct from the Chinese Communist Party,” he said. “That begins with in-person diplomacy.”</p></blockquote><p>This is a spectacularly disastrous policy and it is coming straight from the neocon imperialists. (I note that on the same page as the linked article, there is featured a cover of an issue of <i>National Interest</i> entitled “The Case for Kissinger”.) After all, “regime change” has worked so well in Southeast Asia for the last sixty years, right? It’s hard to know where to even start criticizing this policy because no part of it makes any sense at all. Pompeo may have produced the single most idiotic speech related to diplomacy and war of which I’ve ever heard.</p><p>First, the Chinese people are no more freedom-loving than the Afghans, the Iraqis, or the Vietnamese. Their dynamism is irrelevant, and as suspect as the purported “natural conservatism” of Hispanics. Second, the Chinese government is not the business of the American people. Third, this is an acknowledgement of a new cold war, not between the United States and China as it appears on the surface, but between the Jewish and Chinese nations. Pompeo is speaking for his neocon masters and the USA, its people, and its military, are being utilized as a weapon against China.</p><p>Fourth, there is no shortage of in-person diplomacy available with the four million Han who now reside in the United States. If I had to bet on regime change, I’d bet on the larger country successfully invading the smaller one being the party to impose it.</p><p>It will be interesting to see if the President stands by these assertions about his administration or if he begins moving to jettison Pompeo as he has previously ejected other neocon puppets working for him. Because while the USA can win a trade war with China, it is likely to lose any other kind of war with it, and given the neocons’ failure to force regime change on Syria and Venezuela, it is very hard to imagine they will be more successful with China.</p><p>And fifth, Pompeo said “It’s time for free nations to act.” But Americans are not a free nation.</p></div>",
  "content_text": "How the USA\nis going to come to an end\nby 2033:\nSecretary of State Mike Pompeo, from the podium at the Richard Nixon Presidential Library and Museum in Yorba Linda, California, laid out in no uncertain terms what the administration wanted to do and how it planned to go about accomplishing its ambitious aims.\nAmerica, the secretary of state said, has effectively ditched five decades of “engagement” policy and is now embracing a policy now out of favor across the American policy establishment: regime change.\nFormally, the State Department still “engages” China, Pompeo said, but “simply to demand fairness and reciprocity.” Gone are the days when American diplomats engaged China to support the Communist Party. Too often in the past, U.S. presidents rescued Chinese communism, three times—Nixon in 1972, Bush in 1989, and Clinton in 1999—in particular.\nMore importantly, Pompeo said there would be a new form of engagement. “We must also engage and empower the Chinese people—a dynamic, freedom-loving people who are completely distinct from the Chinese Communist Party,” he said. “That begins with in-person diplomacy.”\nThis is a spectacularly disastrous policy and it is coming straight from the neocon imperialists. (I note that on the same page as the linked article, there is featured a cover of an issue of\nNational Interest\nentitled “The Case for Kissinger”.) After all, “regime change” has worked so well in Southeast Asia for the last sixty years, right? It’s hard to know where to even start criticizing this policy because no part of it makes any sense at all. Pompeo may have produced the single most idiotic speech related to diplomacy and war of which I’ve ever heard.\nFirst, the Chinese people are no more freedom-loving than the Afghans, the Iraqis, or the Vietnamese. Their dynamism is irrelevant, and as suspect as the purported “natural conservatism” of Hispanics. Second, the Chinese government is not the business of the American people. Third, this is an acknowledgement of a new cold war, not between the United States and China as it appears on the surface, but between the Jewish and Chinese nations. Pompeo is speaking for his neocon masters and the USA, its people, and its military, are being utilized as a weapon against China.\nFourth, there is no shortage of in-person diplomacy available with the four million Han who now reside in the United States. If I had to bet on regime change, I’d bet on the larger country successfully invading the smaller one being the party to impose it.\nIt will be interesting to see if the President stands by these assertions about his administration or if he begins moving to jettison Pompeo as he has previously ejected other neocon puppets working for him. Because while the USA can win a trade war with China, it is likely to lose any other kind of war with it, and given the neocons’ failure to force regime change on Syria and Venezuela, it is very hard to imagine they will be more successful with China.\nAnd fifth, Pompeo said “It’s time for free nations to act.” But Americans are not a free nation.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-28T08:26:21+00:00"
}