{
  "url": "https://voxday.net/2020/07/26/china-is-stoking-racial-tensions/",
  "scraped_at": "2025-12-21T13:02:19.695091",
  "title": "China is “stoking racial tensions”",
  "date_display": "July 26, 2020",
  "date_iso": "2020-07-26T08:44:54+00:00",
  "date_from_url": "2020-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of course the Chinese are <a href=\"https://www.foxnews.com/media/gordon-chang-reacts-to-houston-consulate-order-china-is-stoking-racial-tensions\">helping fan the flames</a> of the demographic fire that is going to destroy the United States of America. Why wouldn’t they do so? The US military and its ability to intervene in Asia is the only thing that currently stands between China and the regional dominance it seeks, and if the USA collapses, China can avoid the need for a war with a very real possibility of turning into World War III.</p><blockquote><p>China is stoking racial tensions in the United States, Fox News Asia analyst Gordon Chang stated Wednesday. In an interview on “America’s Newsroom,”  Chang pointed out that the reason the State Department said the Chinese consulate in Houston was ordered shut this week was that it was “involved in intellectual property theft” and because they “wanted to protect the information of U.S. individuals.”</p><p>“Also, there are stories that this consulate had links with protest groups in the United States providing financial and logistical support. That’s unconfirmed,” he added. “But, what is confirmed is that the Chinese Foreign Ministry and the Communist Party’s global ties have been engaged in a malicious disinformation campaign, deliberately stoking racial tensions in the U.S.</p><p>“And, U.S. Customs has seized items coming from China this year that would be very handy for protesters,” Chang noted.</p></blockquote><p>Of course, it would be considerably more meaningful if Fox News or anyone else in the mainstream media would also report honestly on the way another nation has been doing exactly the same thing <a href=\"https://en.wikipedia.org/wiki/Emanuel_Celler\">since 1923</a>.</p><p><i>Celler made his first important speech on the House floor during consideration of the Johnson-Reed Immigration Act of 1924. Three years earlier, Congress had imposed a quota that limited immigration for persons of any nationality to 3 percent of that nationality present in the United States in 1910, with an annual admission limit of 356,000 immigrants. This national origin system was structured to preserve the ethnic and religious identity of the United States by reducing immigration from Eastern and Southern Europe, thereby excluding many Jews, Catholics, among others. Celler was vehemently opposed to the Johnson-Reed Act, which passed the isolationist Congress and was signed into law. Celler had found his cause and for the next four decades he vigorously spoke out in favor of eliminating the national origin quotas as a basis for immigration restriction.</i><br><i><br/></i>The Chinese may well finish the demolition of the USA, but they obviously are not the nation responsible for starting it.</br></p></div>",
  "content_text": "Of course the Chinese are\nhelping fan the flames\nof the demographic fire that is going to destroy the United States of America. Why wouldn’t they do so? The US military and its ability to intervene in Asia is the only thing that currently stands between China and the regional dominance it seeks, and if the USA collapses, China can avoid the need for a war with a very real possibility of turning into World War III.\nChina is stoking racial tensions in the United States, Fox News Asia analyst Gordon Chang stated Wednesday. In an interview on “America’s Newsroom,”  Chang pointed out that the reason the State Department said the Chinese consulate in Houston was ordered shut this week was that it was “involved in intellectual property theft” and because they “wanted to protect the information of U.S. individuals.”\n“Also, there are stories that this consulate had links with protest groups in the United States providing financial and logistical support. That’s unconfirmed,” he added. “But, what is confirmed is that the Chinese Foreign Ministry and the Communist Party’s global ties have been engaged in a malicious disinformation campaign, deliberately stoking racial tensions in the U.S.\n“And, U.S. Customs has seized items coming from China this year that would be very handy for protesters,” Chang noted.\nOf course, it would be considerably more meaningful if Fox News or anyone else in the mainstream media would also report honestly on the way another nation has been doing exactly the same thing\nsince 1923\n.\nCeller made his first important speech on the House floor during consideration of the Johnson-Reed Immigration Act of 1924. Three years earlier, Congress had imposed a quota that limited immigration for persons of any nationality to 3 percent of that nationality present in the United States in 1910, with an annual admission limit of 356,000 immigrants. This national origin system was structured to preserve the ethnic and religious identity of the United States by reducing immigration from Eastern and Southern Europe, thereby excluding many Jews, Catholics, among others. Celler was vehemently opposed to the Johnson-Reed Act, which passed the isolationist Congress and was signed into law. Celler had found his cause and for the next four decades he vigorously spoke out in favor of eliminating the national origin quotas as a basis for immigration restriction.\nThe Chinese may well finish the demolition of the USA, but they obviously are not the nation responsible for starting it.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-26T07:44:54+00:00"
}