{
  "url": "https://voxday.net/2020/07/13/court-hearing-today/",
  "scraped_at": "2025-12-21T13:01:02.166876",
  "title": "Court hearing today",
  "date_display": "July 13, 2020",
  "date_iso": "2020-07-13T18:28:10+00:00",
  "date_from_url": "2020-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>CGC-20-584586 (PATREON, INC. VS. PAUL MICHAEL AYURE ET AL)</b><br>will be heard at 12:30 PM Eastern and should go a long way towards ending the ongoing dispute between Owen, the 72 Bears, and Patreon.</br></p><p>Discuss amongst yourselves. Make predictions if you like, play armchair lawyer if you wish, and provide a running commentary for those who can’t watch if you’re so inclined, but be polite and respectful to all the parties.</p><p><b>UPDATE: </b>The tentative ruling has been published on the Superior Court site by the judge.</p><p><i>Patreon seeks a preliminary injunction to enjoin defendants “from continuing to pursue improper claims against Patreon in JAMS arbitration,” pending this Court’s consideration and final adjudication of Patreon’s complaint for declaratory judgment. Defendants are individual claimants in 72 pending JAMS arbitration proceedings against Patreon. Patreon claims that those claims are barred by its Terms of Use. <b><u>Patreon’s request for a preliminary injunction is denied</u></b>, for several reasons.</i><br><i><br/></i>And so it is back to arbitration they go, to face the reality of 91 defaulted arbitrations, among others.</br></p><p><b>UPDATE: </b>The hearing went about as well as it could reasonably go, but the judge is not going to issue a ruling yet because Patreon’s lawyers produced some new arguments based on some new precedents that weren’t in their copious filings. So, the judge graciously allowed them more rope with which to hang themselves, since the reason they produced the new arguments was because their previous arguments had already been rejected. Randazza has ten days to rebut the relevance of the new citations, then the judge will issue his ruling.</p><p>This, by the way, is why Randazza was so uncharacteristically unchallenging, even when Patreon was making totally false claims about having provided sufficient notice. He did make one very substantive and well-substantiated point, however, about the date of the applicable terms being from “the date of accrual”, or the date on which notice was given, rather than from the date of the actual filing as Patreon has been arguing. Which, of course, renders Patreon’s entire case a non-starter.</p><p>As for what will happen next, there are two important things to note here. First, the emergency injunction was not granted. Second, none of these new issues to be addressed have anything to do with the injunction. So, in addition to the evidence of the reasoning behind the tentative ruling, what we can deduce is that the judge is not merely going to reject the injunction, he is probably going to throw out the case in his ruling.</p></div>",
  "content_text": "CGC-20-584586 (PATREON, INC. VS. PAUL MICHAEL AYURE ET AL)\nwill be heard at 12:30 PM Eastern and should go a long way towards ending the ongoing dispute between Owen, the 72 Bears, and Patreon.\nDiscuss amongst yourselves. Make predictions if you like, play armchair lawyer if you wish, and provide a running commentary for those who can’t watch if you’re so inclined, but be polite and respectful to all the parties.\nUPDATE:\nThe tentative ruling has been published on the Superior Court site by the judge.\nPatreon seeks a preliminary injunction to enjoin defendants “from continuing to pursue improper claims against Patreon in JAMS arbitration,” pending this Court’s consideration and final adjudication of Patreon’s complaint for declaratory judgment. Defendants are individual claimants in 72 pending JAMS arbitration proceedings against Patreon. Patreon claims that those claims are barred by its Terms of Use.\nPatreon’s request for a preliminary injunction is denied\n, for several reasons.\nAnd so it is back to arbitration they go, to face the reality of 91 defaulted arbitrations, among others.\nUPDATE:\nThe hearing went about as well as it could reasonably go, but the judge is not going to issue a ruling yet because Patreon’s lawyers produced some new arguments based on some new precedents that weren’t in their copious filings. So, the judge graciously allowed them more rope with which to hang themselves, since the reason they produced the new arguments was because their previous arguments had already been rejected. Randazza has ten days to rebut the relevance of the new citations, then the judge will issue his ruling.\nThis, by the way, is why Randazza was so uncharacteristically unchallenging, even when Patreon was making totally false claims about having provided sufficient notice. He did make one very substantive and well-substantiated point, however, about the date of the applicable terms being from “the date of accrual”, or the date on which notice was given, rather than from the date of the actual filing as Patreon has been arguing. Which, of course, renders Patreon’s entire case a non-starter.\nAs for what will happen next, there are two important things to note here. First, the emergency injunction was not granted. Second, none of these new issues to be addressed have anything to do with the injunction. So, in addition to the evidence of the reasoning behind the tentative ruling, what we can deduce is that the judge is not merely going to reject the injunction, he is probably going to throw out the case in his ruling.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-13T17:28:10+00:00"
}