{
  "url": "https://voxday.net/2020/07/30/patreon-denied-preliminary-injunction/",
  "scraped_at": "2025-12-21T13:02:45.823592",
  "title": "Patreon denied preliminary injunction",
  "date_display": "July 30, 2020",
  "date_iso": "2020-07-30T10:04:04+00:00",
  "date_from_url": "2020-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Superior Court of San Francisco:</p><blockquote><p>2020-07-29<span style=\"white-space: pre;\"> </span>LAW AND MOTION, 302, PREVIOUSLY SUBMITTED ON JUL-13-2020, ORDER TO SHOW CAUSE RE PRELIMINARY INJUNCTION IS TAKEN OFF CALENDAR PURSUANT TO THE ORDER DENYING PRELIMINARY INJUNCTION, FILED ON JUL-29-2020. (D302)<span style=\"white-space: pre;\"> </span></p><p>2020-07-29<span style=\"white-space: pre;\"> </span>ORDER DENYING PRELIMINARY INJUNCTION</p></blockquote><p>There was also a hearing in Owen’s arbitration concerning Patreon’s motion for summary judgment today. That ruling won’t be given until next week, but based on what the lawyers have said, I think it is very, very unlikely that the arbitrator isn’t going to permit the arbitration to proceed to the final hearing.</p><p>So far, so good. Especially in light of the Commerce Department <a href=\"https://www.commerce.gov/news/press-releases/2020/07/commerce-department-files-petition-clarify-liability-protections-online\">filing a petition</a> to prevent the social media platforms from performing their little publisher/platform dance to avoid responsibility for their own actions.</p><p>The text of the judge’s order denying the injunction and declining to interfere in the 72 arbitrations has been posted publicly and can be read below. It is essentially the tentative ruling plus the judge addressing Patreon’s additional citations; read the whole thing for a good understanding of where the situation stands at this point in the process.</p><p><a name=\"more\"></a>SUPERIOR COURT OF THE STATE OF CALIFORNIA<br>FOR THE COUNTY OF SAN FRANCISCO</br></p><p>ORDER DENYING PRELIMINARY INJUNCTION</p><p>Patreon seeks a preliminary injunction to enjoin defendants “from continuing to pursue improper claims against Patreon in JAMS arbitration,” pending this Court’s consideration and final adjudication of Patreon’s complaint for declaratory judgment. Defendants are individual claimants in 72 pending JAMS arbitration proceedings against Patreon. Patreon claims that those claims are barred by its Terms of Use because they involve nonarbitrable claims. Patreon’s request for a preliminary injunction is denied, for several reasons.</p><p><i>First</i>, Patreon fails to show that it will suffer any irreparable injury or interim harm if an injunction does not issue. JAMS has agreed to determine the threshold jurisdictional issues Patreon raises and will afford Patreon an opportunity to object to its jurisdiction in the course of the arbitration proceedings. If Patreon is correct that Defendants’ claims are not arbitrable or are outside the scope of the parties’ agreements, the arbitrators presumably will rule in its favor on those issues. Merely having to incur expense in order to participate in arbitration proceedings is not irreparable harm.</p><p><i>Second</i>, Patreon fails to show a reasonable likelihood of prevailing on its claims. Even if Patreon were correct that Defendants’ claims are not arbitrable, those issues are for the arbitrator, not the court, to decide. “An arbitration provision’s reference to, or incorporation of, arbitration rules that give the arbitrator the power or responsibility to decide issues of arbitrability may constitute clear and unmistakable evidence the parties intended the arbitrator to decide those issues.” {Aanderud v. Superior Court (2017) 13 Cal.App.5th 880, 892 [arbitration provision’s reference to JAMS rules that assign issues of arbitrability to the arbitrator “evidences the parties’ clear and unmistakable intent to submit issues of arbitrability to the arbitrator”].) Rule 8(b) of the JAMS Streamlined Arbitration Rules provides, “Jurisdictional and arbitrability disputes, including disputes over the formation, existence, validity, interpretation or scope of the agreement under which Arbitration is sought, and who are proper Parties to the Arbitration, shall be submitted to and ruled on by the Arbitrator. The Arbitrator has the authority to determine jurisdiction and arbitrability issues as a preliminary matter.” Indeed, Patreon asserts that a JAMS arbitrator has already ruled in its favor in a similar case. (Reply at 4 n.3.)</p><p><i>Third</i>, California courts rarely grant the extraordinary relief Patreon seeks here: an injunction interfering with an ongoing contractual arbitration proceeding. “Once a dispute is submitted to arbitration, the [California Arbitration Act] contemplates limited, if any, judicial involvement. ‘Typically, those who enter into arbitration agreements expect that their dispute will be resolved without necessity for any contact with the courts. [Citation.] ‘It is the job of the arbitrator, not the court, to resolve all questions needed to determine the controversy.’” {Briggs v. Resolution Remedies (2008) 168 Cal.App.4th 1395, 1400.) That conclusion is “especially true” where, as here, “the arbitration began without the need to seek a court order compelling arbitration.” {Id. at 1401.) As another court has explained, “An arbitration has a life of its own outside the judicial system. The trial court may not step into a case submitted to arbitration and tell the arbitrator what to do and when to do it.” (Titan/Value Equities Group, Inc, v. Superior Court (1994) 29 Cal.App.4th 482, 487-489 [trial court exceeded its jurisdiction when it attempted to remedy arbitration delay by ordering arbitration to proceed under stated conditions subject to reinstatement on trial calendar].)</p><p>To be sure, Patreon is correct that this principle is not an inflexible one. However, the cases Patreon cited for the first time at the hearing do not support its position, either because no issue was actually raised or decided on appeal as to the propriety of such injunctive relief, or because they are readily distinguishable on their facts. (See, e.g., Brooks v. AmeriHome Mortgage Company, LLC (2020) 47 Cal.App.5th 624, 629, pet. fo r review filed, No. S261879 (June 9, 2020) [court issued preliminary injunction to enjoin arbitration of PAGA claim, which employer conceded was “nonarbitrable” under controlling authority]; Stasz v. Schwab (2004) 121 Cal.App.4th 420, 426-427, 442 [affirming judgment confirming arbitrator’s award; opinion notes that trial court denied repeated requests to stay arbitration proceedings, but suggests in dicta, citing federal authority, that “[i]f an arbitrator or sponsoring organization mistakenly accepts jurisdiction, a party may either seek judicial relief to enjoin the arbitration or object to jurisdiction in the arbitration proceedings and raise the lack of jurisdiction as a ground for vacating the award”]; Delta Dental Plan v. Banasky (1994) 27 Cal.App.4th 1598, 1602 [affirming summary judgment for dental plan; opinion notes that the AAA advised the parties it would resume the arbitration unless there were a court order staying arbitration]; International Film Investors v. Arbitration Tribunal of Directors Guild (1984) 152 Cal.App.3d 699,704 [dismissing appeal from judgment following trial court’s denial of petition for writ of prohibition seeking to prevent commencement of arbitration proceedings]; N.A.M.E.S. v. Singer (1979) 90 Cal.App.3d 653 [reversing order dismissing petition to confirm arbitration award]; Windsor Mills, Inc. v. Collins &amp; Aikman Corp. (1972) 25 Cal.App.3d 987 [affirming judgment denying petition to compel arbitration and preliminary injunction against arbitration proceedings initiated by seller during pendency of buyer’s action for damages on ground that there was no agreement to arbitrate because buyer was unaware of arbitration provision].)</p><p><i>Briggs </i>is closely analogous. There, the arbitrator stayed an uninsured motorist arbitration pending a determination of the insured’s entitlement to workers’ compensation benefits. The insured sought a petition for writ of mandate, which the trial court denied on its merits. The Court of Appeal affirmed on other grounds, holding that “the trial court lacked the authority to review a discretionary, prehearing order of an arbitrator.” (168 Cal.App.4th at 1397.) As it explained, “the trial court conducted what amounted to a de novo review of an arbitrator’s interlocutory order, something it had no statutory authority to review for any reason.” (Id. at 1401.) Here, Patreon is effectively seeking similar relief: immediate review of JAMS’ interlocutory orders submitting the contested issues to the arbitrators for decision, rather than immediately granting Patreon’s objections to arbitration or its alternative request to issue a blanket stay of the arbitration proceedings pending a ruling on Patreon’s request for coordination of those arbitrations. Under Briggs, the Court lacks authority to review those administrative decisions.</p><p>Accordingly, the court DENIES Patreon’s request for a preliminary injunction.</p><p>IT IS SO ORDERED.</p></div>",
  "content_text": "From the Superior Court of San Francisco:\n2020-07-29\nLAW AND MOTION, 302, PREVIOUSLY SUBMITTED ON JUL-13-2020, ORDER TO SHOW CAUSE RE PRELIMINARY INJUNCTION IS TAKEN OFF CALENDAR PURSUANT TO THE ORDER DENYING PRELIMINARY INJUNCTION, FILED ON JUL-29-2020. (D302)\n2020-07-29\nORDER DENYING PRELIMINARY INJUNCTION\nThere was also a hearing in Owen’s arbitration concerning Patreon’s motion for summary judgment today. That ruling won’t be given until next week, but based on what the lawyers have said, I think it is very, very unlikely that the arbitrator isn’t going to permit the arbitration to proceed to the final hearing.\nSo far, so good. Especially in light of the Commerce Department\nfiling a petition\nto prevent the social media platforms from performing their little publisher/platform dance to avoid responsibility for their own actions.\nThe text of the judge’s order denying the injunction and declining to interfere in the 72 arbitrations has been posted publicly and can be read below. It is essentially the tentative ruling plus the judge addressing Patreon’s additional citations; read the whole thing for a good understanding of where the situation stands at this point in the process.\nSUPERIOR COURT OF THE STATE OF CALIFORNIA\nFOR THE COUNTY OF SAN FRANCISCO\nORDER DENYING PRELIMINARY INJUNCTION\nPatreon seeks a preliminary injunction to enjoin defendants “from continuing to pursue improper claims against Patreon in JAMS arbitration,” pending this Court’s consideration and final adjudication of Patreon’s complaint for declaratory judgment. Defendants are individual claimants in 72 pending JAMS arbitration proceedings against Patreon. Patreon claims that those claims are barred by its Terms of Use because they involve nonarbitrable claims. Patreon’s request for a preliminary injunction is denied, for several reasons.\nFirst\n, Patreon fails to show that it will suffer any irreparable injury or interim harm if an injunction does not issue. JAMS has agreed to determine the threshold jurisdictional issues Patreon raises and will afford Patreon an opportunity to object to its jurisdiction in the course of the arbitration proceedings. If Patreon is correct that Defendants’ claims are not arbitrable or are outside the scope of the parties’ agreements, the arbitrators presumably will rule in its favor on those issues. Merely having to incur expense in order to participate in arbitration proceedings is not irreparable harm.\nSecond\n, Patreon fails to show a reasonable likelihood of prevailing on its claims. Even if Patreon were correct that Defendants’ claims are not arbitrable, those issues are for the arbitrator, not the court, to decide. “An arbitration provision’s reference to, or incorporation of, arbitration rules that give the arbitrator the power or responsibility to decide issues of arbitrability may constitute clear and unmistakable evidence the parties intended the arbitrator to decide those issues.” {Aanderud v. Superior Court (2017) 13 Cal.App.5th 880, 892 [arbitration provision’s reference to JAMS rules that assign issues of arbitrability to the arbitrator “evidences the parties’ clear and unmistakable intent to submit issues of arbitrability to the arbitrator”].) Rule 8(b) of the JAMS Streamlined Arbitration Rules provides, “Jurisdictional and arbitrability disputes, including disputes over the formation, existence, validity, interpretation or scope of the agreement under which Arbitration is sought, and who are proper Parties to the Arbitration, shall be submitted to and ruled on by the Arbitrator. The Arbitrator has the authority to determine jurisdiction and arbitrability issues as a preliminary matter.” Indeed, Patreon asserts that a JAMS arbitrator has already ruled in its favor in a similar case. (Reply at 4 n.3.)\nThird\n, California courts rarely grant the extraordinary relief Patreon seeks here: an injunction interfering with an ongoing contractual arbitration proceeding. “Once a dispute is submitted to arbitration, the [California Arbitration Act] contemplates limited, if any, judicial involvement. ‘Typically, those who enter into arbitration agreements expect that their dispute will be resolved without necessity for any contact with the courts. [Citation.] ‘It is the job of the arbitrator, not the court, to resolve all questions needed to determine the controversy.’” {Briggs v. Resolution Remedies (2008) 168 Cal.App.4th 1395, 1400.) That conclusion is “especially true” where, as here, “the arbitration began without the need to seek a court order compelling arbitration.” {Id. at 1401.) As another court has explained, “An arbitration has a life of its own outside the judicial system. The trial court may not step into a case submitted to arbitration and tell the arbitrator what to do and when to do it.” (Titan/Value Equities Group, Inc, v. Superior Court (1994) 29 Cal.App.4th 482, 487-489 [trial court exceeded its jurisdiction when it attempted to remedy arbitration delay by ordering arbitration to proceed under stated conditions subject to reinstatement on trial calendar].)\nTo be sure, Patreon is correct that this principle is not an inflexible one. However, the cases Patreon cited for the first time at the hearing do not support its position, either because no issue was actually raised or decided on appeal as to the propriety of such injunctive relief, or because they are readily distinguishable on their facts. (See, e.g., Brooks v. AmeriHome Mortgage Company, LLC (2020) 47 Cal.App.5th 624, 629, pet. fo r review filed, No. S261879 (June 9, 2020) [court issued preliminary injunction to enjoin arbitration of PAGA claim, which employer conceded was “nonarbitrable” under controlling authority]; Stasz v. Schwab (2004) 121 Cal.App.4th 420, 426-427, 442 [affirming judgment confirming arbitrator’s award; opinion notes that trial court denied repeated requests to stay arbitration proceedings, but suggests in dicta, citing federal authority, that “[i]f an arbitrator or sponsoring organization mistakenly accepts jurisdiction, a party may either seek judicial relief to enjoin the arbitration or object to jurisdiction in the arbitration proceedings and raise the lack of jurisdiction as a ground for vacating the award”]; Delta Dental Plan v. Banasky (1994) 27 Cal.App.4th 1598, 1602 [affirming summary judgment for dental plan; opinion notes that the AAA advised the parties it would resume the arbitration unless there were a court order staying arbitration]; International Film Investors v. Arbitration Tribunal of Directors Guild (1984) 152 Cal.App.3d 699,704 [dismissing appeal from judgment following trial court’s denial of petition for writ of prohibition seeking to prevent commencement of arbitration proceedings]; N.A.M.E.S. v. Singer (1979) 90 Cal.App.3d 653 [reversing order dismissing petition to confirm arbitration award]; Windsor Mills, Inc. v. Collins & Aikman Corp. (1972) 25 Cal.App.3d 987 [affirming judgment denying petition to compel arbitration and preliminary injunction against arbitration proceedings initiated by seller during pendency of buyer’s action for damages on ground that there was no agreement to arbitrate because buyer was unaware of arbitration provision].)\nBriggs\nis closely analogous. There, the arbitrator stayed an uninsured motorist arbitration pending a determination of the insured’s entitlement to workers’ compensation benefits. The insured sought a petition for writ of mandate, which the trial court denied on its merits. The Court of Appeal affirmed on other grounds, holding that “the trial court lacked the authority to review a discretionary, prehearing order of an arbitrator.” (168 Cal.App.4th at 1397.) As it explained, “the trial court conducted what amounted to a de novo review of an arbitrator’s interlocutory order, something it had no statutory authority to review for any reason.” (Id. at 1401.) Here, Patreon is effectively seeking similar relief: immediate review of JAMS’ interlocutory orders submitting the contested issues to the arbitrators for decision, rather than immediately granting Patreon’s objections to arbitration or its alternative request to issue a blanket stay of the arbitration proceedings pending a ruling on Patreon’s request for coordination of those arbitrations. Under Briggs, the Court lacks authority to review those administrative decisions.\nAccordingly, the court DENIES Patreon’s request for a preliminary injunction.\nIT IS SO ORDERED.",
  "tags": [
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-30T09:04:04+00:00"
}