{
  "url": "https://voxday.net/2020/07/21/the-ideas-percolate/",
  "scraped_at": "2025-12-21T13:01:51.178842",
  "title": "The ideas percolate",
  "date_display": "July 21, 2020",
  "date_iso": "2020-07-21T12:00:04+00:00",
  "date_from_url": "2020-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit <a href=\"https://pjmedia.com/instapundit/388445/\">notes the excision</a> of the SJW executives, and the entire SJW marketing team, from the Red Bull organization:</p><blockquote class=\"tr_bq\"><p>“Have you ever heard of the phrase, ‘get woke, go broke?’ It turns out there is a simple way to prevent this, and it involves firing people indiscriminately, until the rest of the employees realize that the only way they are going to be able to keep their jobs is by being professional, and keeping their kook politics out of the workplace. <i>Pour encourager les autres.</i>”</p></blockquote><p>However, some Instapundit commenters took exception to his failure to mention the relatively obvious connection to my book <i>Corporate Cancer, </i>which prescribes precisely this response to SJW employees attempting to converge the organization.</p><blockquote><p>Come on Glenn, this merits a plug for Vox Day’s important book Corporate Cancer for biz owners and senior mgt, as well as his earlier books SJWs Always Lie, etc, meant more for individuals/employees. You can disagree with him on other issues, but he is dead right on this.<br>– newscaper</br></p><p>Persona non grata. I wish I had screenshot the comment but Reynolds once complained that he already had to keep certain people off the website. The context was on complaints about the endless links to cucks tho, he didn’t give any names.<br>– SameOl’SantaRiaCult ShakinChic</br></p></blockquote><p>First, understand and accept that it is the <i>ideas </i>that matter, not the <i>author</i>. I don’t care if hostile organizations such as <i>The New York Times</i> and <i>Nature </i>don’t properly credit me for destroying the “religion causes war” hypothesis or if economics journals don’t give me credit for predicting the financial crisis of 2008 and the labor mobility argument that disproves both comparative advantage and the various arguments for free trade.</p><p>I know that what I’ve done has made a difference, which is the only thing that matters. The entire system is set up to deny credit, status, and fame to the genuinely innovative while awarding it to mediocrities who have taken the ticket. It is, therefore, a meaningful badge of honor to have the system deny one the fruits of one’s achievements.</p><p>Second, Instapundit and the Insta-wife have always been very gracious to Castalia House. If they are no longer in a position to do so, I very much doubt that it has anything to do with their personal inclinations. I don’t know precisely what constraints PJ Media imposes on its bloggers, but I do know that it imposes some constraints on them. And it would not surprise me in the slightest if one of them was any reference to me, my books, or this blog.</p><p>And let’s face it, what blogger, given complete autonomy, would ever permit Ed Driscoll and Stephen Green to turn his blog into another tedious NRO-style ALL AIPAC ALL THE TIME site?</p></div>",
  "content_text": "Instapundit\nnotes the excision\nof the SJW executives, and the entire SJW marketing team, from the Red Bull organization:\n“Have you ever heard of the phrase, ‘get woke, go broke?’ It turns out there is a simple way to prevent this, and it involves firing people indiscriminately, until the rest of the employees realize that the only way they are going to be able to keep their jobs is by being professional, and keeping their kook politics out of the workplace.\nPour encourager les autres.\n”\nHowever, some Instapundit commenters took exception to his failure to mention the relatively obvious connection to my book\nCorporate Cancer,\nwhich prescribes precisely this response to SJW employees attempting to converge the organization.\nCome on Glenn, this merits a plug for Vox Day’s important book Corporate Cancer for biz owners and senior mgt, as well as his earlier books SJWs Always Lie, etc, meant more for individuals/employees. You can disagree with him on other issues, but he is dead right on this.\n– newscaper\nPersona non grata. I wish I had screenshot the comment but Reynolds once complained that he already had to keep certain people off the website. The context was on complaints about the endless links to cucks tho, he didn’t give any names.\n– SameOl’SantaRiaCult ShakinChic\nFirst, understand and accept that it is the\nideas\nthat matter, not the\nauthor\n. I don’t care if hostile organizations such as\nThe New York Times\nand\nNature\ndon’t properly credit me for destroying the “religion causes war” hypothesis or if economics journals don’t give me credit for predicting the financial crisis of 2008 and the labor mobility argument that disproves both comparative advantage and the various arguments for free trade.\nI know that what I’ve done has made a difference, which is the only thing that matters. The entire system is set up to deny credit, status, and fame to the genuinely innovative while awarding it to mediocrities who have taken the ticket. It is, therefore, a meaningful badge of honor to have the system deny one the fruits of one’s achievements.\nSecond, Instapundit and the Insta-wife have always been very gracious to Castalia House. If they are no longer in a position to do so, I very much doubt that it has anything to do with their personal inclinations. I don’t know precisely what constraints PJ Media imposes on its bloggers, but I do know that it imposes some constraints on them. And it would not surprise me in the slightest if one of them was any reference to me, my books, or this blog.\nAnd let’s face it, what blogger, given complete autonomy, would ever permit Ed Driscoll and Stephen Green to turn his blog into another tedious NRO-style ALL AIPAC ALL THE TIME site?",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-21T11:00:04+00:00"
}