{
  "url": "https://voxday.net/2020/07/13/the-armchair-lawyers/",
  "scraped_at": "2025-12-21T13:00:59.252688",
  "title": "The armchair lawyers",
  "date_display": "July 13, 2020",
  "date_iso": "2020-07-13T00:57:45+00:00",
  "date_from_url": "2020-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really fascinating to see how all these armchair lawyers are crawling out of the woodwork to denounce Owen Benjamin and the Bears <a href=\"https://www.patheos.com/blogs/rolltodisbelieve/2020/07/11/owen-benjamin-and-his-personal-army-collided-with-reality/\">for fighting back</a> against deplatforming.</p><blockquote><p><i>How That Worked Out.</i></p><p>Whatever Owen Benjamin and his fans thought would happen, Patreon’s actual response was to sue 72 of those fanboys. According to that Daily Dot article:</p><p>“This lawsuit is about keeping hate speech off of Patreon,” the company told the Daily Dot via email. “We won’t allow former users to extort Patreon, and are moving these frivolous claims to court where they belong.”</p><p>Hmm, they don’t sound in the slightest bit nervous about anything. Maybe that’s because they instituted two rules in January to “both [prohibit] users from filing claims based on the platform kicking off someone else and [require] any who do so to pay the company’s attorney’s fees and costs.”</p><p>And the fanboys’ claims were filed a solid month later, in February.</p><p>Oops!</p><p>So it seems unlikely that the fanboys will come anywhere close to success here — and may be on the hook for a lot of money if/when they lose.</p></blockquote><p>And it’s even more remarkable to see how they don’t let their absolute ignorance of both the facts and the law get in the way of their opinions.</p><p>First, Owen never filed a lawsuit. Second, none of the Bears ever filed a lawsuit. This blithering cretin doesn’t even know the difference between arbitration and court, despite the quote from Patreon which specifically refers to that difference. Third, Patreon has never once claimed that Owen or any of the Bears ever put any hate speech on their platform, so it’s fascinating to be informed that their lawsuit is about a nonexistent event that never happened.</p><p>Fourth, two rules weren’t instituted in January, they were instituted on December 20, 2019. Fifth, the Bears’ claims weren’t filed in February, they were filed on January 3, 2020. Of course, the significance of that latter date escapes her, because she clearly knows nothing about 1281.97, otherwise known as <b>Material breach for failure to pay fees before arbitration can proceed</b>, which came into effect on January 1, 2020, and states:</p><p><i>If the fees or costs to initiate an arbitration proceeding are not paid within 30 days after the due date, the drafting party is in material breach of the arbitration agreement, is in default of the arbitration.</i></p><p>Due to its failure to pay the fees within the statute-required time limit, Patreon is currently in material breach of the arbitration agreement and is in default <u>of all 91 of the backer arbitrations</u>. Not only that, but the two rules they applied by deceptively changing the Terms of Use will not allow them to escape their defaulted arbitrations in court because the second rule directly violates 1284.3 (a):</p><p><i>No neutral arbitrator or private arbitration company shall administer a consumer arbitration under any agreement or rule requiring that a consumer who is a party to the arbitration pay the fees and costs incurred by an opposing party if the consumer does not prevail in the arbitration, including, but not limited to, the fees and costs of the arbitrator, provider organization, attorney, or witnesses.</i></p><p>There are other reasons as well, but that’s the easiest one for the ignorant to grasp. Perhaps the funniest thing about the article is the way in which it inadvertently demonstrates how Patreon’s lawyers simply ignore both California law and the arbitration rules.</p><p><i>“The Parties will not offer as evidence, and the Arbitrator shall neither admit into the record nor consider, prior settlement offers by the Parties.”</i><br><i><br/></i>Anyhow, everyone will know quite a bit more tomorrow, after the judge rules on Patreon’s request.</br></p></div>",
  "content_text": "It’s really fascinating to see how all these armchair lawyers are crawling out of the woodwork to denounce Owen Benjamin and the Bears\nfor fighting back\nagainst deplatforming.\nHow That Worked Out.\nWhatever Owen Benjamin and his fans thought would happen, Patreon’s actual response was to sue 72 of those fanboys. According to that Daily Dot article:\n“This lawsuit is about keeping hate speech off of Patreon,” the company told the Daily Dot via email. “We won’t allow former users to extort Patreon, and are moving these frivolous claims to court where they belong.”\nHmm, they don’t sound in the slightest bit nervous about anything. Maybe that’s because they instituted two rules in January to “both [prohibit] users from filing claims based on the platform kicking off someone else and [require] any who do so to pay the company’s attorney’s fees and costs.”\nAnd the fanboys’ claims were filed a solid month later, in February.\nOops!\nSo it seems unlikely that the fanboys will come anywhere close to success here — and may be on the hook for a lot of money if/when they lose.\nAnd it’s even more remarkable to see how they don’t let their absolute ignorance of both the facts and the law get in the way of their opinions.\nFirst, Owen never filed a lawsuit. Second, none of the Bears ever filed a lawsuit. This blithering cretin doesn’t even know the difference between arbitration and court, despite the quote from Patreon which specifically refers to that difference. Third, Patreon has never once claimed that Owen or any of the Bears ever put any hate speech on their platform, so it’s fascinating to be informed that their lawsuit is about a nonexistent event that never happened.\nFourth, two rules weren’t instituted in January, they were instituted on December 20, 2019. Fifth, the Bears’ claims weren’t filed in February, they were filed on January 3, 2020. Of course, the significance of that latter date escapes her, because she clearly knows nothing about 1281.97, otherwise known as\nMaterial breach for failure to pay fees before arbitration can proceed\n, which came into effect on January 1, 2020, and states:\nIf the fees or costs to initiate an arbitration proceeding are not paid within 30 days after the due date, the drafting party is in material breach of the arbitration agreement, is in default of the arbitration.\nDue to its failure to pay the fees within the statute-required time limit, Patreon is currently in material breach of the arbitration agreement and is in default\nof all 91 of the backer arbitrations\n. Not only that, but the two rules they applied by deceptively changing the Terms of Use will not allow them to escape their defaulted arbitrations in court because the second rule directly violates 1284.3 (a):\nNo neutral arbitrator or private arbitration company shall administer a consumer arbitration under any agreement or rule requiring that a consumer who is a party to the arbitration pay the fees and costs incurred by an opposing party if the consumer does not prevail in the arbitration, including, but not limited to, the fees and costs of the arbitrator, provider organization, attorney, or witnesses.\nThere are other reasons as well, but that’s the easiest one for the ignorant to grasp. Perhaps the funniest thing about the article is the way in which it inadvertently demonstrates how Patreon’s lawyers simply ignore both California law and the arbitration rules.\n“The Parties will not offer as evidence, and the Arbitrator shall neither admit into the record nor consider, prior settlement offers by the Parties.”\nAnyhow, everyone will know quite a bit more tomorrow, after the judge rules on Patreon’s request.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-12T23:57:45+00:00"
}