{
  "url": "https://voxday.net/2020/07/27/you-cant-fix-convergence/",
  "scraped_at": "2025-12-21T13:02:27.399476",
  "title": "You can’t fix convergence",
  "date_display": "July 27, 2020",
  "date_iso": "2020-07-27T13:43:24+00:00",
  "date_from_url": "2020-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader emails about Wikipedia’s new code of conduct:</p><blockquote><p>There is a big SJW convergence step happening on Wikipedia right now. They are trying to impose an universal code of conduct on all Wikimedia projects to be more “inclusive” and target “harassment”. Aka the same old bullshit as always. Only this time it would target something as big as all of the Wikipedias in all of their languages (another hilariously hypocritical example of SJW imposing their standards on different peoples and cultures, btw). <a href=\"https://meta.wikimedia.org/wiki/Universal_Code_of_Conduct\">The new code</a> would be retroactive as well, apparently, so already closed cases could be opened again.</p><p>In the meantime they are also setting up an interim “<a href=\"https://en.wikipedia.org/wiki/Wikipedia:Village_pump_(WMF)#Interim_Trust_&amp;_Safety_Case_Review_Committee\">case review committee</a>“, just to be able to start doing this shit as fast as possible:</p><p>They are clearly trying to close this process as fast as possible, even doing it during summer when a lot of users are enjoying their holidays. I wonder if something could be done to stop it or limit its effect. Maybe some users that have been on Wikipedia for a while could work on it somehow. I don’t know if you have any ideas about that.</p></blockquote><p>Why would we want to stop it? We’ve already provided everyone with <a href=\"https://infogalactic.com/info/Main_Page\">the ideal alternative</a>. People have got to learn to stop crying, stop complaining, and stop trying to fix the enemy and simply start making use of the existing alternatives instead.</p></div>",
  "content_text": "A reader emails about Wikipedia’s new code of conduct:\nThere is a big SJW convergence step happening on Wikipedia right now. They are trying to impose an universal code of conduct on all Wikimedia projects to be more “inclusive” and target “harassment”. Aka the same old bullshit as always. Only this time it would target something as big as all of the Wikipedias in all of their languages (another hilariously hypocritical example of SJW imposing their standards on different peoples and cultures, btw).\nThe new code\nwould be retroactive as well, apparently, so already closed cases could be opened again.\nIn the meantime they are also setting up an interim “\ncase review committee\n“, just to be able to start doing this shit as fast as possible:\nThey are clearly trying to close this process as fast as possible, even doing it during summer when a lot of users are enjoying their holidays. I wonder if something could be done to stop it or limit its effect. Maybe some users that have been on Wikipedia for a while could work on it somehow. I don’t know if you have any ideas about that.\nWhy would we want to stop it? We’ve already provided everyone with\nthe ideal alternative\n. People have got to learn to stop crying, stop complaining, and stop trying to fix the enemy and simply start making use of the existing alternatives instead.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-07-27T12:43:24+00:00"
}