{
  "url": "https://voxday.net/2010/05/12/ban-swa/",
  "scraped_at": "2026-01-08T23:26:57.223216",
  "title": "Ban SWAT",
  "date_display": "May 12, 2010",
  "date_iso": "2010-05-12T17:15:00+00:00",
  "date_from_url": "2010-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They are totally out of control.  They murder pets, murder innocent people, lie about it after the fact, and usually get away with “accidents” like killing young mothers and maiming babies.  Reason’s Radley Balko has long been in the forefront of <a href=\"http://reason.com/archives/2010/05/11/a-drug-raid-goes-viral\">the war on the War on Drugs</a>:</p><blockquote><p>On February 11, the Columbia, Missouri, police department’s SWAT team served a drug warrant at the home of Jonathan Whitworth and Brittany Montgomery. Police say that eight days earlier they had received a tip from a confidential informant that Whitworth had a large supply of marijuana in his home. They say they first conducted a trash pull, and found marijuana residue in the family’s garbage. During the raid, police shot and killed the family’s pit bull. At least one bullet ricocheted, injuring the family’s pet corgi. Whitworth, Montgomery, and their 7-year-old son were at home at the time. The incident <a href=\"http://www.columbiatribune.com/news/2010/feb/23/family-questions-swat-drug-search-that-led-to/\"> was written up</a> in the Columbia <i>Daily Tribune,</i> noted on a few blogs that cover drug policy (<a href=\"http://reason.com/blog/2010/02/27/swat-team-endangers-child-pare\">including a  post</a> I put up here at <i>Reason</i>), and then largely forgotten for several weeks.</p><p> On April 28, I received an email from Montgomery. She had seen my post at <i>Reason</i> and read an account of <a href=\"http://www.cato.org/pub_display.php?pub_id=6476\">some of my reporting on SWAT teams</a> published in <i>Reader’s Digest</i>. She said she was reading to her son in his bedroom at the time of the raid. Her husband had just returned home from work. Police fired on their pets within seconds of entering the home.</p><p>“I’ve never felt so violated or more victimized in my life,” Montgomery wrote. “It’s absolutely the most helpless and hopeless feeling I could ever imagine. I can’t sleep right … and I am constantly paranoid. It’s a horrible feeling … to lose the safety and security I thought I was entitled to in my own home. Nobody protected us that night, my son and I were locked in the back of a police car for nearly four hours on a school night while they destroyed my home.”</p><p>According to Montgomery, when the couple’s neighbors inquired about the raid, they were told that the SWAT team had merely conducted a drill, and no shots were fired. When neighbors learned from the family that this was a lie, they began writing to the department and the <i>Daily Tribune</i> to demand answers. When the couple discovered the police had videotaped the raid, they requested a copy of the video. Montgomery said in her email that the copy they were initially given had no audio, and the incriminating (to the police) portions of the video had been removed.</p><p>On February 23, the <i>Daily Tribune</i> published its first story on the raid. The paper made its own request for the SWAT video, which the police department initially denied. On April 20, Jonathan Whitworth pleaded guilty to a single charge of possession of drug paraphernalia. He wasn’t even charged for the minor amount of marijuana in his home (marijuana for personal use has been decriminalized in Columbia). He was issued a $300 fine. On April 27, the <i>Daily Tribune</i> made a formal request for the video, which it received on April 30, with full audio and with no visuals removed. <a href=\"http://www.columbiatribune.com/news/2010/may/03/drug-raid-inquiry-is-ongoing/\"> The paper posted the video</a> with an accompanying article on May 3. On May 5, <a href=\"http://reason.com/blog/2010/05/05/video-of-swat-raid-on-missouri\">I posted it here at <i>Reason</i></a>, and the video went viral.</p><p>The police department has since conceded it was unaware that there were pets or a child in the home at the time of the raid. A spokesman for the Columbia Police Department initially said police had to conduct the raid immediately before the drug supply could be moved, a statement later shown to be false when police revealed the raid was conducted more than a week after the initial tip.</p></blockquote><p>Police SWAT teams are provably more dangerous to Americans than the Taliban, al Qaeda, Osama bin Laden combined.  They are far more dangerous than Saddam Hussein and the Republican Guard ever were.  So, it is long past time for states and communities to begin outlawing both SWAT teams and the no-knock raids they commit on a regular basis.</p></div>",
  "content_text": "They are totally out of control.  They murder pets, murder innocent people, lie about it after the fact, and usually get away with “accidents” like killing young mothers and maiming babies.  Reason’s Radley Balko has long been in the forefront of\nthe war on the War on Drugs\n:\nOn February 11, the Columbia, Missouri, police department’s SWAT team served a drug warrant at the home of Jonathan Whitworth and Brittany Montgomery. Police say that eight days earlier they had received a tip from a confidential informant that Whitworth had a large supply of marijuana in his home. They say they first conducted a trash pull, and found marijuana residue in the family’s garbage. During the raid, police shot and killed the family’s pit bull. At least one bullet ricocheted, injuring the family’s pet corgi. Whitworth, Montgomery, and their 7-year-old son were at home at the time. The incident\nwas written up\nin the Columbia\nDaily Tribune,\nnoted on a few blogs that cover drug policy (\nincluding a  post\nI put up here at\nReason\n), and then largely forgotten for several weeks.\nOn April 28, I received an email from Montgomery. She had seen my post at\nReason\nand read an account of\nsome of my reporting on SWAT teams\npublished in\nReader’s Digest\n. She said she was reading to her son in his bedroom at the time of the raid. Her husband had just returned home from work. Police fired on their pets within seconds of entering the home.\n“I’ve never felt so violated or more victimized in my life,” Montgomery wrote. “It’s absolutely the most helpless and hopeless feeling I could ever imagine. I can’t sleep right … and I am constantly paranoid. It’s a horrible feeling … to lose the safety and security I thought I was entitled to in my own home. Nobody protected us that night, my son and I were locked in the back of a police car for nearly four hours on a school night while they destroyed my home.”\nAccording to Montgomery, when the couple’s neighbors inquired about the raid, they were told that the SWAT team had merely conducted a drill, and no shots were fired. When neighbors learned from the family that this was a lie, they began writing to the department and the\nDaily Tribune\nto demand answers. When the couple discovered the police had videotaped the raid, they requested a copy of the video. Montgomery said in her email that the copy they were initially given had no audio, and the incriminating (to the police) portions of the video had been removed.\nOn February 23, the\nDaily Tribune\npublished its first story on the raid. The paper made its own request for the SWAT video, which the police department initially denied. On April 20, Jonathan Whitworth pleaded guilty to a single charge of possession of drug paraphernalia. He wasn’t even charged for the minor amount of marijuana in his home (marijuana for personal use has been decriminalized in Columbia). He was issued a $300 fine. On April 27, the\nDaily Tribune\nmade a formal request for the video, which it received on April 30, with full audio and with no visuals removed.\nThe paper posted the video\nwith an accompanying article on May 3. On May 5,\nI posted it here at\nReason\n, and the video went viral.\nThe police department has since conceded it was unaware that there were pets or a child in the home at the time of the raid. A spokesman for the Columbia Police Department initially said police had to conduct the raid immediately before the drug supply could be moved, a statement later shown to be false when police revealed the raid was conducted more than a week after the initial tip.\nPolice SWAT teams are provably more dangerous to Americans than the Taliban, al Qaeda, Osama bin Laden combined.  They are far more dangerous than Saddam Hussein and the Republican Guard ever were.  So, it is long past time for states and communities to begin outlawing both SWAT teams and the no-knock raids they commit on a regular basis.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-12T16:15:00+00:00"
}