{
  "url": "https://voxday.net/2010/05/18/clitorectomies-for-american-girls/",
  "scraped_at": "2026-01-08T23:27:22.625469",
  "title": "Clitorectomies for American girls",
  "date_display": "May 18, 2010",
  "date_iso": "2010-05-18T17:13:00+00:00",
  "date_from_url": "2010-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wasn’t <a href=\"http://www.nytimes.com/2010/05/07/health/policy/07cuts.html\">this sort of thing</a> an old PJ O’Rourke joke?</p><blockquote><p>In a controversial change to a longstanding policy concerning the practice of female circumcision in some African and Asian cultures, the American Academy of Pediatrics is suggesting that American doctors be given permission to perform a ceremonial pinprick or “nick” on girls from these cultures if it would keep their families from sending them overseas for the full circumcision.</p><p>The academy’s committee on bioethics, in a policy statement last week, said some pediatricians had suggested that current federal law, which “makes criminal any nonmedical procedure performed on the genitals” of a girl in the United States, has had the unintended consequence of driving some families to take their daughters to other countries to undergo mutilation.</p><p>“It might be more effective if federal and state laws enabled pediatricians to reach out to families by offering a ritual nick as a possible compromise to avoid greater harm,” the group said.</p></blockquote><p>Shoot them full of poison and mutilate their genitals… albeit only in a <i>symbolic</i> manner.  And that’s assuming they don’t get vaccuumed out of the womb in the first place.  Needless to say, I’m not one of those National Greatness evangelicals who believes America is blessed.  I merely wonder how long it is before the American Academy of Pediatrics signs off on the full mutilation.</p><p>The advocates of the Melting Pot never seem to recall that the contents of the pot depend completely upon what goes into it.</p></div>",
  "content_text": "Wasn’t\nthis sort of thing\nan old PJ O’Rourke joke?\nIn a controversial change to a longstanding policy concerning the practice of female circumcision in some African and Asian cultures, the American Academy of Pediatrics is suggesting that American doctors be given permission to perform a ceremonial pinprick or “nick” on girls from these cultures if it would keep their families from sending them overseas for the full circumcision.\nThe academy’s committee on bioethics, in a policy statement last week, said some pediatricians had suggested that current federal law, which “makes criminal any nonmedical procedure performed on the genitals” of a girl in the United States, has had the unintended consequence of driving some families to take their daughters to other countries to undergo mutilation.\n“It might be more effective if federal and state laws enabled pediatricians to reach out to families by offering a ritual nick as a possible compromise to avoid greater harm,” the group said.\nShoot them full of poison and mutilate their genitals… albeit only in a\nsymbolic\nmanner.  And that’s assuming they don’t get vaccuumed out of the womb in the first place.  Needless to say, I’m not one of those National Greatness evangelicals who believes America is blessed.  I merely wonder how long it is before the American Academy of Pediatrics signs off on the full mutilation.\nThe advocates of the Melting Pot never seem to recall that the contents of the pot depend completely upon what goes into it.",
  "tags": [
    "Invasion",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-18T16:13:00+00:00"
}