{
  "url": "https://voxday.net/2010/05/06/familiar-pattern/",
  "scraped_at": "2026-01-08T23:26:24.715037",
  "title": "A familiar pattern",
  "date_display": "May 6, 2010",
  "date_iso": "2010-05-06T08:26:00+00:00",
  "date_from_url": "2010-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It didn’t surprise me in the slightest to learn Marion Jones was on steroids when she was regularly breaking 11 with such ease in the 100.  It was about as surprising as learning that Ben Johnson didn’t add what looked like about 50 pounds of muscle in three years naturally.  Having trained with NCAA D1 female sprinters myself, I can say that it is usually obvious what is and is not possible without chemical enhancement.  There is no special “intense weightlifting regimen” that provides magical results.  And technique doesn’t shave off seconds; speed is something you either have or you don’t.</p><p><a href=\"http://www.nytimes.com/2010/05/02/magazine/02jones-t.html?hpw=&amp;pagewanted=all\">The New York Times article about her</a> is a good one and one can’t help but wish her well in her quest to play in the WNBA.  [Insert Sports Guy joke here.]  But what I found most interesting about her cautionary tale was how she followed what has increasingly become the American woman’s path to delta.</p><blockquote><p>As delicate as the past is, Jones reveals little outward bitterness. The pain seems to be largely walled off, at least from the public. But also, she is content with her family life, including her marriage to Thompson. Jones’s first husband, Hunter, was gruff, possessive and like a “bodyguard,” says Tiffany Weatherford-Jackson, one of Jones’s closest friends from U.N.C. Then there was Tim Montgomery, the biological father of Monty and a “party boy,” Weatherford-Jackson said. A former Olympic sprinter and an admitted doper, Montgomery is in prison for heading up a multimillion-dollar check-fraud scheme and for dealing heroin.  Thompson, by contrast, is settled and devoted to his family. (“Marion says I’m predictable,” he told me one evening, referring to Jones’s teasing him about his taste in food and movies. “I tell her I’m stable.”) Thompson, a former sprinter who won a bronze medal for Barbados in the 2000 Olympics, is now finishing an advice book for student athletes. “We only wish we had met earlier in our lives,” Jones said one afternoon wistfully.</p></blockquote><p>It’s not that women actively dislike the “beta providers”, or as I prefer to identify them, the deltas.  It’s merely that they are not sexually drawn to them in the way they are attracted to the brooding control freaks and the unpredictable bad boys.  It is the Heathcliff of <i>Wuthering Heights</i> and the mad, bad, and dangerous-to-know Lord Byron who are the archetypes of innumerable women’s fantasies, not the stable and upstanding Ward Cleaver.</p><p>What many men fail to understand, however, is that women know perfectly well that a stable and predictable man is much better for them and their children than sexually-charged submission or abandoned chaos, but to use the Freudian terms, their ids are at odds with their egos.  Or, if you prefer the Roissyesque verbiage, it is thought versus tingle.  This is why the gamma strategy of patiently waiting around for the woman of his dreams to “come to her senses” or as XKCD put it, “give in”, is actually a perfectly viable long-term strategy, so long as it is understood that it may come at the cost of raising another man’s children with a sadder, older version of the woman who first drew his attention.</p><p>Fortunately for the children, that’s a price some men are perfectly willing to pay.  I think they should be commended – for the children’s sake – rather than scorned, even if the enabling aspect of their behavior is unfortunate.  But that’s a tangential issue, the main thing to take away from this is that deltas should understand that sending out “beta provider” signals is almost as much as a turn-off to young excitement-seeking women as it is a turn-on to older resource-seeking women.  Of course, depending upon your personal circumstances, the former may be far less of a problem than the latter.</p></div>",
  "content_text": "It didn’t surprise me in the slightest to learn Marion Jones was on steroids when she was regularly breaking 11 with such ease in the 100.  It was about as surprising as learning that Ben Johnson didn’t add what looked like about 50 pounds of muscle in three years naturally.  Having trained with NCAA D1 female sprinters myself, I can say that it is usually obvious what is and is not possible without chemical enhancement.  There is no special “intense weightlifting regimen” that provides magical results.  And technique doesn’t shave off seconds; speed is something you either have or you don’t.\nThe New York Times article about her\nis a good one and one can’t help but wish her well in her quest to play in the WNBA.  [Insert Sports Guy joke here.]  But what I found most interesting about her cautionary tale was how she followed what has increasingly become the American woman’s path to delta.\nAs delicate as the past is, Jones reveals little outward bitterness. The pain seems to be largely walled off, at least from the public. But also, she is content with her family life, including her marriage to Thompson. Jones’s first husband, Hunter, was gruff, possessive and like a “bodyguard,” says Tiffany Weatherford-Jackson, one of Jones’s closest friends from U.N.C. Then there was Tim Montgomery, the biological father of Monty and a “party boy,” Weatherford-Jackson said. A former Olympic sprinter and an admitted doper, Montgomery is in prison for heading up a multimillion-dollar check-fraud scheme and for dealing heroin.  Thompson, by contrast, is settled and devoted to his family. (“Marion says I’m predictable,” he told me one evening, referring to Jones’s teasing him about his taste in food and movies. “I tell her I’m stable.”) Thompson, a former sprinter who won a bronze medal for Barbados in the 2000 Olympics, is now finishing an advice book for student athletes. “We only wish we had met earlier in our lives,” Jones said one afternoon wistfully.\nIt’s not that women actively dislike the “beta providers”, or as I prefer to identify them, the deltas.  It’s merely that they are not sexually drawn to them in the way they are attracted to the brooding control freaks and the unpredictable bad boys.  It is the Heathcliff of\nWuthering Heights\nand the mad, bad, and dangerous-to-know Lord Byron who are the archetypes of innumerable women’s fantasies, not the stable and upstanding Ward Cleaver.\nWhat many men fail to understand, however, is that women know perfectly well that a stable and predictable man is much better for them and their children than sexually-charged submission or abandoned chaos, but to use the Freudian terms, their ids are at odds with their egos.  Or, if you prefer the Roissyesque verbiage, it is thought versus tingle.  This is why the gamma strategy of patiently waiting around for the woman of his dreams to “come to her senses” or as XKCD put it, “give in”, is actually a perfectly viable long-term strategy, so long as it is understood that it may come at the cost of raising another man’s children with a sadder, older version of the woman who first drew his attention.\nFortunately for the children, that’s a price some men are perfectly willing to pay.  I think they should be commended – for the children’s sake – rather than scorned, even if the enabling aspect of their behavior is unfortunate.  But that’s a tangential issue, the main thing to take away from this is that deltas should understand that sending out “beta provider” signals is almost as much as a turn-off to young excitement-seeking women as it is a turn-on to older resource-seeking women.  Of course, depending upon your personal circumstances, the former may be far less of a problem than the latter.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-06T07:26:00+00:00"
}