{
  "url": "https://voxday.net/2010/05/14/madness-season-is-coming/",
  "scraped_at": "2026-01-08T23:27:04.182130",
  "title": "The Madness Season cometh",
  "date_display": "May 14, 2010",
  "date_iso": "2010-05-14T13:15:00+00:00",
  "date_from_url": "2010-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The harsh and unforgiving realities of history, economics, sociobiology, mathematics, and socionomics are all pointing firmly <a href=\"http://roissy.wordpress.com/2010/05/13/spinsterhood-bastard-children-are-our-future/\">to the same conclusion</a>:</p><blockquote><p>The irony is that in the course of dismantling millennia of biologically-grounded cultural tradition and enacting their hypergamous sexual utopia, women have unwittingly made life more difficult for all but the most attractive of them. The result has been more cougars, more sluts, and more demand for DNA paternity testing. To prevent this edifice from crumbling under its own weight entirely, massive redistributive payments from men to women in the form of welfare, alimony, punitive child support (even from men who aren’t the biological fathers!), female- and child-friendly workplaces, legal injustice (women in general do not give a shit about justice), corporate-sponsored daycare, PC extortion, sexual harassment claims, and divorce theft have had to be ruthlessly administered and enforced by the thugs of the rapidly metastasizing elite-created police state. Remove these security and resource transfers and safety nets and you will see the feminist utopia crumble within one generation….  an alpha cock carousel that spins relentlessly until society crumbles under the weight of declining productive native population, rising orc horde populations, and wildings by all those fatherless bastard boys raised by empowered single moms.</p><p>It’s all so clear as day and yet our so-called smarties continue jabbering about comparative advantage, relationship complementarity, and immigration-fueled cheap chalupas.  It’s funny until the pleasurecrats and statusticians have no gated communities left in which to escape.</p><p>And then it’s hilarious.</p></blockquote><p>It is interesting to see how an intelligent observer who has chosen a very different path than I have, personally, professionally, and philosophically, has been noting precisely the same problems at work in <a href=\"http://www.livevideo.com/video/1EFA01743AB2491F99D063C46158820B/idiocracy-intro.aspx\">the decline of the West</a>.  I pay far less attention to the whys and wherefores of the feminist utopia than others who recognize its destructive, dystopian nature, but my background in economics has given me the ability to see how just how fragile is the foundation that momentarily supports it.  But the Dark Lord’s choice is to toast marshmallows as Rome burns whereas I prefer to plant seeds in the hope of an eventual rebirth of civilization.  Now, nothing goes straight up or straight down; the pre-Greece optimism is a perfect example of Wave 2 optimism that we will see, again and again, amidst the long march to a bottom that will probably not take place for decades, or if we are unfortunate, centuries.</p><p>But even if global civilization collapses, pockets of civilization will survive.  The Church will survive.  God’s grand experiment will continue.  That is why I have concluded that despair and nihilism, even the hedonistic nihilism of the sort that the Dark Lord expounds, is not the answer.</p></div>",
  "content_text": "The harsh and unforgiving realities of history, economics, sociobiology, mathematics, and socionomics are all pointing firmly\nto the same conclusion\n:\nThe irony is that in the course of dismantling millennia of biologically-grounded cultural tradition and enacting their hypergamous sexual utopia, women have unwittingly made life more difficult for all but the most attractive of them. The result has been more cougars, more sluts, and more demand for DNA paternity testing. To prevent this edifice from crumbling under its own weight entirely, massive redistributive payments from men to women in the form of welfare, alimony, punitive child support (even from men who aren’t the biological fathers!), female- and child-friendly workplaces, legal injustice (women in general do not give a shit about justice), corporate-sponsored daycare, PC extortion, sexual harassment claims, and divorce theft have had to be ruthlessly administered and enforced by the thugs of the rapidly metastasizing elite-created police state. Remove these security and resource transfers and safety nets and you will see the feminist utopia crumble within one generation….  an alpha cock carousel that spins relentlessly until society crumbles under the weight of declining productive native population, rising orc horde populations, and wildings by all those fatherless bastard boys raised by empowered single moms.\nIt’s all so clear as day and yet our so-called smarties continue jabbering about comparative advantage, relationship complementarity, and immigration-fueled cheap chalupas.  It’s funny until the pleasurecrats and statusticians have no gated communities left in which to escape.\nAnd then it’s hilarious.\nIt is interesting to see how an intelligent observer who has chosen a very different path than I have, personally, professionally, and philosophically, has been noting precisely the same problems at work in\nthe decline of the West\n.  I pay far less attention to the whys and wherefores of the feminist utopia than others who recognize its destructive, dystopian nature, but my background in economics has given me the ability to see how just how fragile is the foundation that momentarily supports it.  But the Dark Lord’s choice is to toast marshmallows as Rome burns whereas I prefer to plant seeds in the hope of an eventual rebirth of civilization.  Now, nothing goes straight up or straight down; the pre-Greece optimism is a perfect example of Wave 2 optimism that we will see, again and again, amidst the long march to a bottom that will probably not take place for decades, or if we are unfortunate, centuries.\nBut even if global civilization collapses, pockets of civilization will survive.  The Church will survive.  God’s grand experiment will continue.  That is why I have concluded that despair and nihilism, even the hedonistic nihilism of the sort that the Dark Lord expounds, is not the answer.",
  "tags": [
    "society",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-14T12:15:00+00:00"
}