{
  "url": "https://voxday.net/2010/05/28/mailvox-libertarian-success/",
  "scraped_at": "2026-01-08T23:28:03.466809",
  "title": "Mailvox: libertarian success",
  "date_display": "May 28, 2010",
  "date_iso": "2010-05-28T10:07:00+00:00",
  "date_from_url": "2010-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JY asks about the prospects for an applied libertarian society:</p><blockquote><p>Do you believe that the success of applied Libertarianism is at all related to a society’s “collective morality”? The question I’m dealing with is whether a form of limited government, which some Libertarian’s advocate, is sustainable apart from a moral society (in this case, by “moral society” I mean one that closely aligns with the general Judeo-Christian ethic).</p></blockquote><p>Not in the slightest.  Libertarianism is a secular defense mechanism against evil; a moral Christian society can tolerate and survive big government much better than a purely secular one due to the limits built into Christian morality.  Those limits will be violated from time to time, Man being fallen, but the centuries-long history of hundreds of Christian near-absolute rulers who never once engaged in the sort of routine butchery of their people that secular irreligious rulers regularly do shows that it is secular and immoral societies that are the most in need of libertarian government.</p><p>The problem is not that people are not Christian enough to pursue libertarian government, it is that they are not intelligent enough.  Anyone who seeks special favors from a government empowered to grant them is a self-interested, shortsighted, gambling fool, because the government that can give can also take away and will do so whenever its own interest comes into conflict with the individuals.</p><p>Non-libertarians want cheap government health care, but they don’t want the government to deny them care or euthanize them when their health care threatens to become expensive.  The problem is that most people are insufficiently intelligent to recognize that the former necessarily dictates the latter.</p><p>UPDATE – TZ points out an omission: <i>I don’t think you answered the question that was asked: “whether a form of limited government, which some Libertarian’s advocate, is sustainable apart from a moral society”</i></p><p>Fair enough.  Okay, my answer is this: no form of limited government is sustainable in the long term because no form of government is permanently sustainable.  The most that can be said is that a moral society can be sustained longer than an immoral one, regardless of whether the form of government is limited or unlimited.</p><blockquote><p>What books would you recommend for a young person (teen) just forming political ideas, leaning libertarian?</p></blockquote><p>A lot of Robert Heinlein. <i>The Moon is a Harsh Mistress</i> and <i>Tunnel in the Sky</i> are probably the two best. <i>Atlas Shrugged</i> by Ayn Rand is the conventional work that has probably has the most influence on current libertarians.  Orwell’s <i>1984</i> isn’t libertarian per se, but is well worth reading.  And Hayek’s <i>Road to Serfdom</i> is a must.  Unfortunately, I haven’t read much in the way of explicitly libertarian philosophy or ideology that I find worth recommending.</p></div>",
  "content_text": "JY asks about the prospects for an applied libertarian society:\nDo you believe that the success of applied Libertarianism is at all related to a society’s “collective morality”? The question I’m dealing with is whether a form of limited government, which some Libertarian’s advocate, is sustainable apart from a moral society (in this case, by “moral society” I mean one that closely aligns with the general Judeo-Christian ethic).\nNot in the slightest.  Libertarianism is a secular defense mechanism against evil; a moral Christian society can tolerate and survive big government much better than a purely secular one due to the limits built into Christian morality.  Those limits will be violated from time to time, Man being fallen, but the centuries-long history of hundreds of Christian near-absolute rulers who never once engaged in the sort of routine butchery of their people that secular irreligious rulers regularly do shows that it is secular and immoral societies that are the most in need of libertarian government.\nThe problem is not that people are not Christian enough to pursue libertarian government, it is that they are not intelligent enough.  Anyone who seeks special favors from a government empowered to grant them is a self-interested, shortsighted, gambling fool, because the government that can give can also take away and will do so whenever its own interest comes into conflict with the individuals.\nNon-libertarians want cheap government health care, but they don’t want the government to deny them care or euthanize them when their health care threatens to become expensive.  The problem is that most people are insufficiently intelligent to recognize that the former necessarily dictates the latter.\nUPDATE – TZ points out an omission:\nI don’t think you answered the question that was asked: “whether a form of limited government, which some Libertarian’s advocate, is sustainable apart from a moral society”\nFair enough.  Okay, my answer is this: no form of limited government is sustainable in the long term because no form of government is permanently sustainable.  The most that can be said is that a moral society can be sustained longer than an immoral one, regardless of whether the form of government is limited or unlimited.\nWhat books would you recommend for a young person (teen) just forming political ideas, leaning libertarian?\nA lot of Robert Heinlein.\nThe Moon is a Harsh Mistress\nand\nTunnel in the Sky\nare probably the two best.\nAtlas Shrugged\nby Ayn Rand is the conventional work that has probably has the most influence on current libertarians.  Orwell’s\n1984\nisn’t libertarian per se, but is well worth reading.  And Hayek’s\nRoad to Serfdom\nis a must.  Unfortunately, I haven’t read much in the way of explicitly libertarian philosophy or ideology that I find worth recommending.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-28T09:07:00+00:00"
}