{
  "url": "https://voxday.net/2010/05/21/mailvox-whitewashing-of-lincoln/",
  "scraped_at": "2026-01-08T23:27:39.867694",
  "title": "Mailvox: the whitewashing of Lincoln",
  "date_display": "May 21, 2010",
  "date_iso": "2010-05-21T18:12:00+00:00",
  "date_from_url": "2010-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s kind of sad when Electric Six presents a more accurate view of Abraham Lincoln than most mainstream historians.  AJ wishes to better understand why:</p><blockquote><p>My father recommended to me a book called “The Real Lincoln: A New Look at Abraham Lincoln, His Agenda, and an Unnecessary War” by Thomas DiLorenzo. I’m not sure if you’ve read it or heard of it – I’m guessing that you have – but this book’s main focus is Lincoln’s rape of the Constitution, and the downfall of state sovereignty.  Checking out the sources DiLorenzo used – as amateur as I may be in that area – they all look legit.</p><p>I’ve never really been a Lincoln fan in the first place, but this book made me sick to my stomach.  Other books I have read and sources I have looked at, among them Murray Rothbard’s “Just War”, corroborate all of the evidence that Lincoln was a liar, power hungry, and a sociopath of the highest order.  His Emancipation Proclamation was designed to provoke slave uprisings in states where the North did not have control, knowing full well that only women and children remained in those areas – yet it is hailed and revered as one of the greatest and most moving speeches ever given by a president.  He has his face on Mount Rushmore, on our currency, a memorial in DC, and his own day in February – the same man who suspended the writ of habeas corpus, muzzled the press when it spoke out against him, imprisoned thousands of NORTHERNERS for political dissent (re: clamoring for peaceful secession) and is described as a dictator by even his most ardent of historians (though a benevolent one, they insist).</p><p>If people knew the truth about Lincoln – specifically the blacks who hold him up as the Great Emancipator, despite his desire to ship them all out to Africa and/or South America to preserve the “purity” of America – life in America would be drastically changed.  And if they saw the similarities between the goings on before the War of Northern Aggression and what’s going on now, they might see some disquieting parallels.  The only difference is that our current president doesn’t have to muzzle the media – they’re his already.  The least of his crimes were against civil liberties, and the worst was starting the bloodiest war on American soil for the sole reason of destroying state sovereignty.  Dishonesty in science and archaeology usually just annoys me, but I consider it par for the course. The same goes for most historians, but this is just too great to ignore.  This makes me angry, and it should make everyone else angry, too, if they weren’t so historically ignorant.</p><p>I’m sure you know all of this already, and have probably written about it before, but my question is this: WHY have historians ignored Lincoln’s obvious agenda and wickedness?  Why have they painted him in such a false light?  I understand this isn’t anything new for history writing, but all of the evidence is there.  I understand dishonesty in certain arenas, but against a corrupt politician? Historians usually revel in that sort of thing.  Why does Lincoln get a free pass?</p></blockquote><p>AJ answered her own question when she said <i>“If people knew the truth about Lincoln… life in America would be drastically changed.”</i> Lincoln is a secular saint for the same reason that the Roman Senate deified Octavian Augustus – he was the first emperor of Imperial America.  Lincoln was, without a doubt, the worst president the united States of America because he murdered what had been a free and voluntary republican confederation in the name of a Federal Union imposed by violence.</p><p>Naturally, the would-be totalitarians of today revere him.  But every freedom-loving American, black or white, should mark the end of the Republic by him.  Sic semper tyrannis.</p></div>",
  "content_text": "It’s kind of sad when Electric Six presents a more accurate view of Abraham Lincoln than most mainstream historians.  AJ wishes to better understand why:\nMy father recommended to me a book called “The Real Lincoln: A New Look at Abraham Lincoln, His Agenda, and an Unnecessary War” by Thomas DiLorenzo. I’m not sure if you’ve read it or heard of it – I’m guessing that you have – but this book’s main focus is Lincoln’s rape of the Constitution, and the downfall of state sovereignty.  Checking out the sources DiLorenzo used – as amateur as I may be in that area – they all look legit.\nI’ve never really been a Lincoln fan in the first place, but this book made me sick to my stomach.  Other books I have read and sources I have looked at, among them Murray Rothbard’s “Just War”, corroborate all of the evidence that Lincoln was a liar, power hungry, and a sociopath of the highest order.  His Emancipation Proclamation was designed to provoke slave uprisings in states where the North did not have control, knowing full well that only women and children remained in those areas – yet it is hailed and revered as one of the greatest and most moving speeches ever given by a president.  He has his face on Mount Rushmore, on our currency, a memorial in DC, and his own day in February – the same man who suspended the writ of habeas corpus, muzzled the press when it spoke out against him, imprisoned thousands of NORTHERNERS for political dissent (re: clamoring for peaceful secession) and is described as a dictator by even his most ardent of historians (though a benevolent one, they insist).\nIf people knew the truth about Lincoln – specifically the blacks who hold him up as the Great Emancipator, despite his desire to ship them all out to Africa and/or South America to preserve the “purity” of America – life in America would be drastically changed.  And if they saw the similarities between the goings on before the War of Northern Aggression and what’s going on now, they might see some disquieting parallels.  The only difference is that our current president doesn’t have to muzzle the media – they’re his already.  The least of his crimes were against civil liberties, and the worst was starting the bloodiest war on American soil for the sole reason of destroying state sovereignty.  Dishonesty in science and archaeology usually just annoys me, but I consider it par for the course. The same goes for most historians, but this is just too great to ignore.  This makes me angry, and it should make everyone else angry, too, if they weren’t so historically ignorant.\nI’m sure you know all of this already, and have probably written about it before, but my question is this: WHY have historians ignored Lincoln’s obvious agenda and wickedness?  Why have they painted him in such a false light?  I understand this isn’t anything new for history writing, but all of the evidence is there.  I understand dishonesty in certain arenas, but against a corrupt politician? Historians usually revel in that sort of thing.  Why does Lincoln get a free pass?\nAJ answered her own question when she said\n“If people knew the truth about Lincoln… life in America would be drastically changed.”\nLincoln is a secular saint for the same reason that the Roman Senate deified Octavian Augustus – he was the first emperor of Imperial America.  Lincoln was, without a doubt, the worst president the united States of America because he murdered what had been a free and voluntary republican confederation in the name of a Federal Union imposed by violence.\nNaturally, the would-be totalitarians of today revere him.  But every freedom-loving American, black or white, should mark the end of the Republic by him.  Sic semper tyrannis.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-21T17:12:00+00:00"
}