{
  "url": "https://voxday.net/2010/05/20/mailvox-humble-reques/",
  "scraped_at": "2026-01-08T23:27:32.542428",
  "title": "Mailvox: a humble request",
  "date_display": "May 20, 2010",
  "date_iso": "2010-05-20T13:15:00+00:00",
  "date_from_url": "2010-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PC has found the Common Sense dialogue to be of no little interest and has a few questions:</p><blockquote><p>Love the blog and hope that you can answer a few questions for me.  Your correspondence with Common Sense Atheism made me reconsider many of my thoughts on Christianity and God.  Like him, I felt in command of the fundamentals of Christian theology when all I know are Bible stories and sermons from my youth.  And it bothers me that I have neglected a large field of intellectual inquiry.  However, many of the Christians I meet and evangelical literature I come across are just as inane as the childish arguments for atheism that are too common on the internet.  I am glad to have found in you an intelligent advocate who can discuss these topics without nonsense.</p><p>How do I begin to erase this deficit?  What are some books that I can read this summer to learn the doctrine of Christianity?  Where can I find intelligent arguments for the existence of God?  Are local priests and ministers generally good discussion partners?</p><p>I’m a mathematician, so I like my theory raw.  Don’t be afraid to lay the good stuff on me.</p><p>On a different note, I am interested in your conversion to Christianity, how a self-proclaimed internet superintelligence discovered and accepted belief.  Also, you mention occasionally that one of your reasons for faith is because you saw evil in the world.  Could you elaborate on this?  What do you mean by evil?  What are some examples?</p></blockquote><p>First, always remember that most people are inane.  Most people are <i>idiots</i> no matter what they do or do not believe.  If you find an honest and intelligent interlocutor in any area, then cherish him regardless of how similar or divergent your views happen to be.  Synchronicity of perspective is not an intrinsic hallmark of intelligence.</p><p>Second, I must freely admit that I am overdue in writing my response to Luke’s last post.  I’m not the least bit apologetic about my tardiness, mind you, as we just went gold on a year-long software project yesterday and I’m still in the process of gradually reanimating from development zombie mode.  As will soon become clear, Luke and I are so far apart in philosophical areas that have absolutely nothing to do with religion that our differences of opinion with regards to Christianity almost pale in comparison.  But it should take the discourse in an interesting and perhaps unexpected direction.</p><p>Third, I think it is absolutely refreshing whenever someone steps back to reconsider what they actually do and do not know, contra their previous assumptions.  As much as I might brutally tear into Luke, or anyone else, for mistaking their half-remembered fragments of childhood knowledge for a comprehensive grasp of a subject, it’s actually an entirely normal failure to revisit the past.  I remember being astounded when SB dryly asked me why I thought the crust was the healthiest part of the bread… the real reason was that someone had once told me that as a young child and I had never once bothered to actually stop and think about the matter.  And the observable fact is that most people never stop and think about anything they have been told by their parents, their teachers, and their professors.  So, it should come as no surprise at all that most atheists raised in a Christian tradition should belatedly discover that they really don’t know that much about the simple theological facts of the faith they are rejecting… in the unlikely event they ever stop long enough to seriously consider the matter.</p><p>This is why I tend to take an atheist who abandons a religious faith after the age of 30 much more seriously than the normal teenage deconvert.  Think about this for a second:  How many of your decisions made in your teen years do you still think were particularly wise or intelligent today?  And every childhood deconvert I have ever questioned has simply had Daddy issues of one sort or another.  You can usually identify the latter sort by their emotional reactions to religion.</p><p>As for learning about the Christian faith and theology, the two best books with which to begin are <i>Letters From a Skeptic</i> by Greg Boyd and <i>Mere Christianity</i> by CS Lewis.  I would follow that with <i><a href=\"http://intothewoods.org/home/2010/chestertons-orthodoxy/\">Orthodoxy</a></i> by GK Chesterton, and <i>Cynic, Sage, or Son of God</i>, also by Boyd.  Then re-read the four Gospels.  As for priests and ministers, well, I wouldn’t expect too much out of them other than a reasonably accurate summation of the theology.  Remember, they are called to be shepherds of the flock, not providers of intellectual discourse to the highly intelligent.  This isn’t to say that no priest or minister is capable of it, but it’s really somewhat of a category error to seek it from them.</p><p>Regarding evil, I simply mean behavior that is described as evil or wickedness in the Bible as well as the influences, autonomous or otherwise, that encourage that behavior.  I see it in the world and I see it in myself.  I have seen it in the transparent lies of an almost-innocent child, in the irrational fury of a hysterical woman, in the maddened glee of a violent man, and throughout the blood-soaked pages of history.  I have seen it in the rich and the poor, in the brilliant and the dim, and in the beautiful and the ugly.  Once, like many an arrogant non-believer before me, I thought I could construct my own valid moral code and live by it.  And, like everyone but the nihilists, I failed.  Not spectacularly, but worse, ludicrously and unneccessarily.</p><p>As for evil, you know what it is.  It is everything from the first lie you tell your parents and that senseless momentary impulse to smash your fist into an unsuspecting person’s face as they walk by to the Ten Persecutions of Imperial Rome and the Killing Fields.  I have no doubt that you have heard the little whispers in the back of your mind from time to time just like everyone else.  There are two parts to evil, the temptation and the submission.  When the submission finally comes, when the resistance finally fails, it feels absolutely liberating at first and it is only after a period of repeated acts of submission that one gradually discovers apparent how enslaving evil truly is.  Hence the apparent theological dichotomy of finding freedom through bending the knee before the Lord Jesus Christ.</p><p>I think that unless one understands that evil is in some senses desirable to every man and woman, one cannot even begin to make sense of the Christian faith.  Unfortunately, many if not most Christians take the admonition to hate evil and twist it into an erroneous dogma that insists evil is not and cannot be enjoyable.  And yet, no matter how terrible the act, it always feels either good or necessary at the moment of action.  This is just one of the many ways in which I find the Christian perspective to be more observably accurate than the current scientific ones.</p><p>I do not speak about my personal experience with anyone.  This is for several reasons, but primarily because I understand that personal experiences are not an objective basis for rational argument.  In addition, I know that atheists reject personal experience as a basis for belief even in the case of their own experiences, or at least they claim to do so.  So, there is clearly no point in it.  The atheist who queries, even sincerely and in good faith, about someone else’s experience is attempting to put himself in the position of prosecutor and judge and I have no interest in playing star witness and public defender.</p><p>I tend to doubt this response answered all of your questions, but at least it should suffice to give you a starting point on your investigation.  And before you begin reading anything, I highly recommend contemplating the significance of John 20:24-31.  I think many atheists who are conditioned to believe in the idea of a blind Christian faith and its supposed arrogance, would do well to become familiar with what is indubitably the genuine Christian attitude towards doubts and doubters.</p></div>",
  "content_text": "PC has found the Common Sense dialogue to be of no little interest and has a few questions:\nLove the blog and hope that you can answer a few questions for me.  Your correspondence with Common Sense Atheism made me reconsider many of my thoughts on Christianity and God.  Like him, I felt in command of the fundamentals of Christian theology when all I know are Bible stories and sermons from my youth.  And it bothers me that I have neglected a large field of intellectual inquiry.  However, many of the Christians I meet and evangelical literature I come across are just as inane as the childish arguments for atheism that are too common on the internet.  I am glad to have found in you an intelligent advocate who can discuss these topics without nonsense.\nHow do I begin to erase this deficit?  What are some books that I can read this summer to learn the doctrine of Christianity?  Where can I find intelligent arguments for the existence of God?  Are local priests and ministers generally good discussion partners?\nI’m a mathematician, so I like my theory raw.  Don’t be afraid to lay the good stuff on me.\nOn a different note, I am interested in your conversion to Christianity, how a self-proclaimed internet superintelligence discovered and accepted belief.  Also, you mention occasionally that one of your reasons for faith is because you saw evil in the world.  Could you elaborate on this?  What do you mean by evil?  What are some examples?\nFirst, always remember that most people are inane.  Most people are\nidiots\nno matter what they do or do not believe.  If you find an honest and intelligent interlocutor in any area, then cherish him regardless of how similar or divergent your views happen to be.  Synchronicity of perspective is not an intrinsic hallmark of intelligence.\nSecond, I must freely admit that I am overdue in writing my response to Luke’s last post.  I’m not the least bit apologetic about my tardiness, mind you, as we just went gold on a year-long software project yesterday and I’m still in the process of gradually reanimating from development zombie mode.  As will soon become clear, Luke and I are so far apart in philosophical areas that have absolutely nothing to do with religion that our differences of opinion with regards to Christianity almost pale in comparison.  But it should take the discourse in an interesting and perhaps unexpected direction.\nThird, I think it is absolutely refreshing whenever someone steps back to reconsider what they actually do and do not know, contra their previous assumptions.  As much as I might brutally tear into Luke, or anyone else, for mistaking their half-remembered fragments of childhood knowledge for a comprehensive grasp of a subject, it’s actually an entirely normal failure to revisit the past.  I remember being astounded when SB dryly asked me why I thought the crust was the healthiest part of the bread… the real reason was that someone had once told me that as a young child and I had never once bothered to actually stop and think about the matter.  And the observable fact is that most people never stop and think about anything they have been told by their parents, their teachers, and their professors.  So, it should come as no surprise at all that most atheists raised in a Christian tradition should belatedly discover that they really don’t know that much about the simple theological facts of the faith they are rejecting… in the unlikely event they ever stop long enough to seriously consider the matter.\nThis is why I tend to take an atheist who abandons a religious faith after the age of 30 much more seriously than the normal teenage deconvert.  Think about this for a second:  How many of your decisions made in your teen years do you still think were particularly wise or intelligent today?  And every childhood deconvert I have ever questioned has simply had Daddy issues of one sort or another.  You can usually identify the latter sort by their emotional reactions to religion.\nAs for learning about the Christian faith and theology, the two best books with which to begin are\nLetters From a Skeptic\nby Greg Boyd and\nMere Christianity\nby CS Lewis.  I would follow that with\nOrthodoxy\nby GK Chesterton, and\nCynic, Sage, or Son of God\n, also by Boyd.  Then re-read the four Gospels.  As for priests and ministers, well, I wouldn’t expect too much out of them other than a reasonably accurate summation of the theology.  Remember, they are called to be shepherds of the flock, not providers of intellectual discourse to the highly intelligent.  This isn’t to say that no priest or minister is capable of it, but it’s really somewhat of a category error to seek it from them.\nRegarding evil, I simply mean behavior that is described as evil or wickedness in the Bible as well as the influences, autonomous or otherwise, that encourage that behavior.  I see it in the world and I see it in myself.  I have seen it in the transparent lies of an almost-innocent child, in the irrational fury of a hysterical woman, in the maddened glee of a violent man, and throughout the blood-soaked pages of history.  I have seen it in the rich and the poor, in the brilliant and the dim, and in the beautiful and the ugly.  Once, like many an arrogant non-believer before me, I thought I could construct my own valid moral code and live by it.  And, like everyone but the nihilists, I failed.  Not spectacularly, but worse, ludicrously and unneccessarily.\nAs for evil, you know what it is.  It is everything from the first lie you tell your parents and that senseless momentary impulse to smash your fist into an unsuspecting person’s face as they walk by to the Ten Persecutions of Imperial Rome and the Killing Fields.  I have no doubt that you have heard the little whispers in the back of your mind from time to time just like everyone else.  There are two parts to evil, the temptation and the submission.  When the submission finally comes, when the resistance finally fails, it feels absolutely liberating at first and it is only after a period of repeated acts of submission that one gradually discovers apparent how enslaving evil truly is.  Hence the apparent theological dichotomy of finding freedom through bending the knee before the Lord Jesus Christ.\nI think that unless one understands that evil is in some senses desirable to every man and woman, one cannot even begin to make sense of the Christian faith.  Unfortunately, many if not most Christians take the admonition to hate evil and twist it into an erroneous dogma that insists evil is not and cannot be enjoyable.  And yet, no matter how terrible the act, it always feels either good or necessary at the moment of action.  This is just one of the many ways in which I find the Christian perspective to be more observably accurate than the current scientific ones.\nI do not speak about my personal experience with anyone.  This is for several reasons, but primarily because I understand that personal experiences are not an objective basis for rational argument.  In addition, I know that atheists reject personal experience as a basis for belief even in the case of their own experiences, or at least they claim to do so.  So, there is clearly no point in it.  The atheist who queries, even sincerely and in good faith, about someone else’s experience is attempting to put himself in the position of prosecutor and judge and I have no interest in playing star witness and public defender.\nI tend to doubt this response answered all of your questions, but at least it should suffice to give you a starting point on your investigation.  And before you begin reading anything, I highly recommend contemplating the significance of John 20:24-31.  I think many atheists who are conditioned to believe in the idea of a blind Christian faith and its supposed arrogance, would do well to become familiar with what is indubitably the genuine Christian attitude towards doubts and doubters.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-20T12:15:00+00:00"
}