{
  "url": "https://voxday.net/2010/05/31/mailvox-iq-vs-genius/",
  "scraped_at": "2026-01-08T23:28:18.096489",
  "title": "Mailvox: IQ vs genius",
  "date_display": "May 31, 2010",
  "date_iso": "2010-05-31T13:15:00+00:00",
  "date_from_url": "2010-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MB inquires about my relative dearth of creative accomplishment:</p><blockquote><p>Would you care to expound on the idea that simply possessing a genius IQ in no way presupposes that the owner will produce genius art work or scientific discovery?  For example, I perused your novel Summa Elvetica and within the the first few pages could discern that your prose was workman-like and ordinary (as opposed to Shakespeare or my own fiction).</p><p>Whereas your discursive prose and arguments are a cut above the general punditry.  I would surmise that focus has much to do with it. You have focused little on what makes for profound and beautiful in the creative, I would guess, and more on other things.</p><p>So, do you feel disappointed that your creative work is weak while your opinion work is excellent, or simply practice the art for the pleasure and not the result as so many guitarists enjoy strumming a few tunes while incapable of demonstrating the instrument’s potential and scope?</p></blockquote><p>First, I reject the idea of genius-level intelligence.  Intelligence is real and IQ is a reasonable measure of it, but it is not synonymous with genius.  Intelligence is nothing more than raw intellectual capacity while genius is a proven form of intellectual achievement.  There are geniuses who do not have an unusually high level of intelligence while the vast majority high-IQ level individuals are not geniuses.  That latter category, I regretfully have to admit at this point, would appear to include me… although should my most recent technological innovation achieve a sufficient level of success, people will eventually reach an entirely different conclusion.  Suddenly the dilettante vanishes and is replaced by the Renaissance Man.  Such are the vagaries of reputation.</p><p>I must also take exception to MB’s description of <i>Summa Elvetica</i> as a weak creative work based on what appears to have been more of a perusal than an actual reading.  While its prose is admittedly no more than functional, when viewed from a structural perspective, SE is arguably among the most creative works of fantasy fiction to be published in recent years.  I think it would be a travesty to ignore those aspects and simply lump the novel in with all of the stagnant vampire and zombie fluff that has been published of late.  Consider, for example that the Black Gate reviewer actually confused the fictional Question of <i>Aelven anima</i> with a real one composed by Thomas Aquinas.  I may not be playing the guitar as well as the more notable soloists, but I am indubitably playing it in a different and innovative manner.  In any case, I like playing it regardless of the result.</p><p>Now, as to the notion of whether my creative works have been hampered by my lack of focus, that is almost surely the case.  But not to any great extent.  Due to diminishing marginal returns, I don’t think that focusing more on fiction would significantly improve my prose style.  Based on my extensive reading, I believe you either have it or you don’t, and I simply don’t.  Compared to the writers I admire, I am wholly mediocre when it comes to writing prose and it is only my intelligence that permits me to surmount that on occasion by adding other elements that readers of a more intellectual inclination may find interesting.  I don’t think my commentary is actually any better in that regard, it’s just that the bar is set so low by the professional journalists that practically anything looks good by comparison.  It’s much harder to come out well in a comparison with Tanith Lee and Guy de Maupassant than with Ann Coulter and Maureen Dowd.</p><p>Also, in the case of commentary, those aforementioned other elements are much more important than the prose.  No one cares how beautifully you might happen to write about bond yield spreads, but they care a great deal about knowing if you have correctly ascertained the next area of debt contagion.</p></div>",
  "content_text": "MB inquires about my relative dearth of creative accomplishment:\nWould you care to expound on the idea that simply possessing a genius IQ in no way presupposes that the owner will produce genius art work or scientific discovery?  For example, I perused your novel Summa Elvetica and within the the first few pages could discern that your prose was workman-like and ordinary (as opposed to Shakespeare or my own fiction).\nWhereas your discursive prose and arguments are a cut above the general punditry.  I would surmise that focus has much to do with it. You have focused little on what makes for profound and beautiful in the creative, I would guess, and more on other things.\nSo, do you feel disappointed that your creative work is weak while your opinion work is excellent, or simply practice the art for the pleasure and not the result as so many guitarists enjoy strumming a few tunes while incapable of demonstrating the instrument’s potential and scope?\nFirst, I reject the idea of genius-level intelligence.  Intelligence is real and IQ is a reasonable measure of it, but it is not synonymous with genius.  Intelligence is nothing more than raw intellectual capacity while genius is a proven form of intellectual achievement.  There are geniuses who do not have an unusually high level of intelligence while the vast majority high-IQ level individuals are not geniuses.  That latter category, I regretfully have to admit at this point, would appear to include me… although should my most recent technological innovation achieve a sufficient level of success, people will eventually reach an entirely different conclusion.  Suddenly the dilettante vanishes and is replaced by the Renaissance Man.  Such are the vagaries of reputation.\nI must also take exception to MB’s description of\nSumma Elvetica\nas a weak creative work based on what appears to have been more of a perusal than an actual reading.  While its prose is admittedly no more than functional, when viewed from a structural perspective, SE is arguably among the most creative works of fantasy fiction to be published in recent years.  I think it would be a travesty to ignore those aspects and simply lump the novel in with all of the stagnant vampire and zombie fluff that has been published of late.  Consider, for example that the Black Gate reviewer actually confused the fictional Question of\nAelven anima\nwith a real one composed by Thomas Aquinas.  I may not be playing the guitar as well as the more notable soloists, but I am indubitably playing it in a different and innovative manner.  In any case, I like playing it regardless of the result.\nNow, as to the notion of whether my creative works have been hampered by my lack of focus, that is almost surely the case.  But not to any great extent.  Due to diminishing marginal returns, I don’t think that focusing more on fiction would significantly improve my prose style.  Based on my extensive reading, I believe you either have it or you don’t, and I simply don’t.  Compared to the writers I admire, I am wholly mediocre when it comes to writing prose and it is only my intelligence that permits me to surmount that on occasion by adding other elements that readers of a more intellectual inclination may find interesting.  I don’t think my commentary is actually any better in that regard, it’s just that the bar is set so low by the professional journalists that practically anything looks good by comparison.  It’s much harder to come out well in a comparison with Tanith Lee and Guy de Maupassant than with Ann Coulter and Maureen Dowd.\nAlso, in the case of commentary, those aforementioned other elements are much more important than the prose.  No one cares how beautifully you might happen to write about bond yield spreads, but they care a great deal about knowing if you have correctly ascertained the next area of debt contagion.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-31T12:15:00+00:00"
}