{
  "url": "https://voxday.net/2010/05/19/mailvox-in-which-we-point-and-laug/",
  "scraped_at": "2026-01-08T23:27:26.255352",
  "title": "Mailvox: In which we point and laugh",
  "date_display": "May 19, 2010",
  "date_iso": "2010-05-19T18:21:00+00:00",
  "date_from_url": "2010-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keller demonstrates to all and sundry that he doesn’t have to worry about demonstrating his insecurity by joining Mensa:</p><blockquote><p>There is nothing, nothing, more insecure than belonging to Mensa. I don’t think Molotov Mitchell or his wife are very smart….  Yes, there is nothing insecure about wasting money to have a meaningless membership in a “smarty” club. Ha, I mean what a lame, pathetic, girly thing. It’s like paying money to belong to a “Big Penis Club.” God forbid we verify your intelligence or penis size, we just have to see the membership card and you’ve won the argument!</p></blockquote><p>It is eminently clear that Keller isn’t smart enough to figure out how Mensa works.  If Mensa were, in fact, a “Big Penis Club”, it would most certainly require the third-party verification of your penis size. Hence the requirement <i>to take an intelligence test</i> in order to qualify for membership in Mensa.  In fact, according to a 2003 survey of 5,000 men, Mensa is roughly the IQ equivalent of having an 8.15-inch penis.</p><p>Now, as to whether one considers Mr. Mitchell or his wife to be very smart or not, that completely depends upon one’s perspective.  The Mensa requirement is not terribly high; there are approximately 120 million individuals on the planet capable of qualifying.  However, if someone is a Mensa member, then he possesses incontrovertible evidence that he is more intelligent than 5.88 billion of the people on the planet.  And that’s assuming that the individual barely squeaked past the Mensa bar, it’s entirely possible that he is oen of the few Mensans who are as far beyond the Mensa requirements as the requirements themselves are beyond the average 100 IQ individual.</p><p>As for insecurities, I can honestly say that I have never met an insecure Mensan.  Of course, I’ve never been to a meeting or anything, and as is probably abundantly clear to most of the regulars by now, my membership is little more than one of the many tools in the AWCA arsenal.  But since the subject of personal insecurity was raised, I would be remiss if I failed to note that getting one’s panties in a bunch over someone else’s <i>membership card</i> is hardly a reliable indicator of a confident and self-contained personality.  A reaction to Mensa membership always tends to remind me of those poor independents who spent four years walking around a Greek-dominated campus complaining about fraternities and wearing a GDI sweatshirt.</p></div>",
  "content_text": "Keller demonstrates to all and sundry that he doesn’t have to worry about demonstrating his insecurity by joining Mensa:\nThere is nothing, nothing, more insecure than belonging to Mensa. I don’t think Molotov Mitchell or his wife are very smart….  Yes, there is nothing insecure about wasting money to have a meaningless membership in a “smarty” club. Ha, I mean what a lame, pathetic, girly thing. It’s like paying money to belong to a “Big Penis Club.” God forbid we verify your intelligence or penis size, we just have to see the membership card and you’ve won the argument!\nIt is eminently clear that Keller isn’t smart enough to figure out how Mensa works.  If Mensa were, in fact, a “Big Penis Club”, it would most certainly require the third-party verification of your penis size. Hence the requirement\nto take an intelligence test\nin order to qualify for membership in Mensa.  In fact, according to a 2003 survey of 5,000 men, Mensa is roughly the IQ equivalent of having an 8.15-inch penis.\nNow, as to whether one considers Mr. Mitchell or his wife to be very smart or not, that completely depends upon one’s perspective.  The Mensa requirement is not terribly high; there are approximately 120 million individuals on the planet capable of qualifying.  However, if someone is a Mensa member, then he possesses incontrovertible evidence that he is more intelligent than 5.88 billion of the people on the planet.  And that’s assuming that the individual barely squeaked past the Mensa bar, it’s entirely possible that he is oen of the few Mensans who are as far beyond the Mensa requirements as the requirements themselves are beyond the average 100 IQ individual.\nAs for insecurities, I can honestly say that I have never met an insecure Mensan.  Of course, I’ve never been to a meeting or anything, and as is probably abundantly clear to most of the regulars by now, my membership is little more than one of the many tools in the AWCA arsenal.  But since the subject of personal insecurity was raised, I would be remiss if I failed to note that getting one’s panties in a bunch over someone else’s\nmembership card\nis hardly a reliable indicator of a confident and self-contained personality.  A reaction to Mensa membership always tends to remind me of those poor independents who spent four years walking around a Greek-dominated campus complaining about fraternities and wearing a GDI sweatshirt.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-19T17:21:00+00:00"
}