{
  "url": "https://voxday.net/2010/05/03/never-listen-to-female-advice-abou/",
  "scraped_at": "2026-01-08T23:26:08.119579",
  "title": "Never listen to female advice about women",
  "date_display": "May 3, 2010",
  "date_iso": "2010-05-03T13:13:00+00:00",
  "date_from_url": "2010-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://drhelen.blogspot.com/2010/05/and-now-you-will-have-to-pay-price.html\">This would be why</a>.  Dr. Helen linked to a woman who maintains a site called “How to Train Your Man”.  Here’s her perspective on what women want:</p><blockquote><p>You can’t blame guys for feeling exasperated.  We expect them to be psychic and to know what we’re thinking. As in the Dodge commercial, many men think that if they “behave,” their woman will be happy. If they disappoint us, we are unreasonable, intolerant, unpredictable, moody, PMS-ing or nagging.  Sometimes it seems that it’s never enough.  It’s really not men’s fault for not knowing what women really want.  So here it is, simply.  Women want three things from men:  someone who cares about them, someone who will listen and respond honestly, and someone they can share a laugh with.  In other words, a good friend.  Everything else falls under one of these categories.</p></blockquote><p>Interesting.  And hypothetically useful information, although it sounds an awful lot like what <a href=\"http://xkcd.com/513/\">the patient deltas and whiteknighting gammas believe</a>.  For an alternative perspective, here’s what the Dark Lord of Intersexual Relations says women want:</p><blockquote><p>The strongest woman and the most strident feminist wants to be led by, and to submit to, a more powerful man. Polarity is the core of a healthy loving relationship. She does not want the prerogative to walk all over you with her capricious demands and mercurial moods. Her emotions are a hurricane, her soul a saboteur. Think of yourself as a bulwark against her tempest. When she grasps for a pillar to steady herself against the whipping winds or yearns for an authority figure to foil her worst instincts, it is you who has to be there… strong, solid, unshakable and immovable.</p></blockquote><p>Now, based on everything you know about women, based on everything that has been discussed here about women, which perspective do you think is more reflective of observable reality?  And don’t you find it just a little bit suspicious that the three things the self-appointed Man Trainer declares women want happen to be three things that can be just as easily provided by other women?</p><p>If you’re undecided, consider why Dr. Helen was linking to the Man Trainer in the first place.  It was because of this statement to her husband:</p><blockquote><p>Thank you for going shopping. However, you didn’t get the sausage in the casing because you resent having to go to the grocery store. It’s passive aggressive and uncool.  And now, you will have to pay the price.</p></blockquote><p>In just three sentences, the Man Trainer reveals four of the worst common female attributes.  Ingratitude, logical incoherence, motive imputation, and assuming the simultaneous roles of plaintiff, prosecutor, judge, and executioner. Needless to say, if one was going to lay odds, they would heavily favor the probability that this woman will be bitter, angry and divorced while Roissy is still feeding on the attractive 20-something she-lawyers that pass through Washington DC.</p><p>In summary, the correct way for a man to respond to a Man Trainer is in much the same fashion that Montecore responded to Roy Horn.</p></div>",
  "content_text": "This would be why\n.  Dr. Helen linked to a woman who maintains a site called “How to Train Your Man”.  Here’s her perspective on what women want:\nYou can’t blame guys for feeling exasperated.  We expect them to be psychic and to know what we’re thinking. As in the Dodge commercial, many men think that if they “behave,” their woman will be happy. If they disappoint us, we are unreasonable, intolerant, unpredictable, moody, PMS-ing or nagging.  Sometimes it seems that it’s never enough.  It’s really not men’s fault for not knowing what women really want.  So here it is, simply.  Women want three things from men:  someone who cares about them, someone who will listen and respond honestly, and someone they can share a laugh with.  In other words, a good friend.  Everything else falls under one of these categories.\nInteresting.  And hypothetically useful information, although it sounds an awful lot like what\nthe patient deltas and whiteknighting gammas believe\n.  For an alternative perspective, here’s what the Dark Lord of Intersexual Relations says women want:\nThe strongest woman and the most strident feminist wants to be led by, and to submit to, a more powerful man. Polarity is the core of a healthy loving relationship. She does not want the prerogative to walk all over you with her capricious demands and mercurial moods. Her emotions are a hurricane, her soul a saboteur. Think of yourself as a bulwark against her tempest. When she grasps for a pillar to steady herself against the whipping winds or yearns for an authority figure to foil her worst instincts, it is you who has to be there… strong, solid, unshakable and immovable.\nNow, based on everything you know about women, based on everything that has been discussed here about women, which perspective do you think is more reflective of observable reality?  And don’t you find it just a little bit suspicious that the three things the self-appointed Man Trainer declares women want happen to be three things that can be just as easily provided by other women?\nIf you’re undecided, consider why Dr. Helen was linking to the Man Trainer in the first place.  It was because of this statement to her husband:\nThank you for going shopping. However, you didn’t get the sausage in the casing because you resent having to go to the grocery store. It’s passive aggressive and uncool.  And now, you will have to pay the price.\nIn just three sentences, the Man Trainer reveals four of the worst common female attributes.  Ingratitude, logical incoherence, motive imputation, and assuming the simultaneous roles of plaintiff, prosecutor, judge, and executioner. Needless to say, if one was going to lay odds, they would heavily favor the probability that this woman will be bitter, angry and divorced while Roissy is still feeding on the attractive 20-something she-lawyers that pass through Washington DC.\nIn summary, the correct way for a man to respond to a Man Trainer is in much the same fashion that Montecore responded to Roy Horn.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-03T12:13:00+00:00"
}