{
  "url": "https://voxday.net/2010/05/23/no-sympathy/",
  "scraped_at": "2026-01-08T23:27:45.318573",
  "title": "No sympathy",
  "date_display": "May 23, 2010",
  "date_iso": "2010-05-23T15:40:00+00:00",
  "date_from_url": "2010-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given the present anti-father legal regime, why would any man feel any pity whatsoever for this clueless British mother <a href=\"http://www.newsoftheworld.co.uk/news/814292/A-devastated-British-mum-says-she-was-tricked-into-losing-son-to-his-scheming-Qatari-gran.html\">who signed custody of her son away</a> to her dead husband’s relatives?</p><blockquote><p>Rebecca Jones signed legal papers written in Arabic and witnessed by her dead husband’s family – believing they were about an inheritance for her boy Adam.  But instead the documents gave full custody to 77-year-old Mariam Al Madhaiki – who immediately swept the frightened child away from Rebecca and enrolled him in an Islamic school in Qatar.  Last week, to Rebecca’s dismay, Sharia judges in the Middle East state THREW OUT her appeal to win him back after a seven-month battle – despite Adam sobbing in court: “I want my mother.”</p><p>The judges ruled she can see her son twice a week for just FOUR HOURS, supervised by cops in a room. Now the 43-year-old mum from Sheffield is going to the High Court to try to get justice over what she calls a “kidnap”.</p><p>“I was tricked into it. This is completely against the rights of my child and me as his mother,” she said.</p></blockquote><p>So she lost custody of her son.  Boo freaking hoo.  Precisely how is that any worse than what happens every single day to men who are divorced by their wives, robbed of their children, and stripped of their assets?  At least she had the option to NOT sign a contract she couldn’t read in a foreign country and she still gets to see him every week.  Moreover, she doesn’t have to foot the bill for his expenses or the lifestyle of her in-laws either.</p><p>Notice the tone of the article.  Newspapers don’t even bother to report on men losing their children because it happens so often and it is something that many journalists outright support.  But if a <i>mother</i> loses custody of her child, then naturally it must be grounds for an international incident.</p><p>To be honest, I have zero sympathy for any Western woman who is foolish enough to get romantically involved with an Arab man these days regardless of how the relationship eventually implodes.  The difference between Western and Middle Eastern legal and marital norms have been well known for at least two decades now, so there’s no excuse for claiming one didn’t know about them.  And of course they all act charmingly modernized at first, it’s not as if anyone was ever likely to get a date riding around on a camel shrieking “death to the infidel!”</p></div>",
  "content_text": "Given the present anti-father legal regime, why would any man feel any pity whatsoever for this clueless British mother\nwho signed custody of her son away\nto her dead husband’s relatives?\nRebecca Jones signed legal papers written in Arabic and witnessed by her dead husband’s family – believing they were about an inheritance for her boy Adam.  But instead the documents gave full custody to 77-year-old Mariam Al Madhaiki – who immediately swept the frightened child away from Rebecca and enrolled him in an Islamic school in Qatar.  Last week, to Rebecca’s dismay, Sharia judges in the Middle East state THREW OUT her appeal to win him back after a seven-month battle – despite Adam sobbing in court: “I want my mother.”\nThe judges ruled she can see her son twice a week for just FOUR HOURS, supervised by cops in a room. Now the 43-year-old mum from Sheffield is going to the High Court to try to get justice over what she calls a “kidnap”.\n“I was tricked into it. This is completely against the rights of my child and me as his mother,” she said.\nSo she lost custody of her son.  Boo freaking hoo.  Precisely how is that any worse than what happens every single day to men who are divorced by their wives, robbed of their children, and stripped of their assets?  At least she had the option to NOT sign a contract she couldn’t read in a foreign country and she still gets to see him every week.  Moreover, she doesn’t have to foot the bill for his expenses or the lifestyle of her in-laws either.\nNotice the tone of the article.  Newspapers don’t even bother to report on men losing their children because it happens so often and it is something that many journalists outright support.  But if a\nmother\nloses custody of her child, then naturally it must be grounds for an international incident.\nTo be honest, I have zero sympathy for any Western woman who is foolish enough to get romantically involved with an Arab man these days regardless of how the relationship eventually implodes.  The difference between Western and Middle Eastern legal and marital norms have been well known for at least two decades now, so there’s no excuse for claiming one didn’t know about them.  And of course they all act charmingly modernized at first, it’s not as if anyone was ever likely to get a date riding around on a camel shrieking “death to the infidel!”",
  "tags": [
    "trainwreck",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-23T14:40:00+00:00"
}