{
  "url": "https://voxday.net/2010/05/23/poor-will-always-be-with-you/",
  "scraped_at": "2026-01-08T23:27:47.122067",
  "title": "The poor will always be with you",
  "date_display": "May 23, 2010",
  "date_iso": "2010-05-23T18:30:00+00:00",
  "date_from_url": "2010-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which the New York Times’s best liberal writer flirts with the idea of <a href=\"http://www.nytimes.com/2010/05/23/opinion/23kristof.html?hp\">reviving Western imperialism</a> after belatedly discovering that not everyone is inclined to behave like an upper middle class liberal New Yorker:</p><blockquote><p>Two M.I.T. economists, Abhijit Banerjee and Esther Duflo, found that the world’s poor  typically spend about 2 percent of their income educating their children, and often larger percentages on alcohol and tobacco: 4 percent in rural Papua New Guinea, 6 percent in Indonesia, 8 percent in Mexico. The indigent also spend significant sums on soft drinks, prostitution and extravagant festivals.</p><p>Look, I don’t want to be an unctuous party-pooper. But I’ve seen too many children dying of malaria for want of a bed net that the father tells me is unaffordable, even as he spends larger sums on liquor. If we want Mr. Obamza’s children to get an education and sleep under a bed net — well, the simplest option is for their dad to spend fewer evenings in the bar.</p></blockquote><p>Naturally, Kristof thinks the idea is to give – GIVE – women more control.  How very white and neo-colonial of him to decide how Africans should live their lives.  And, <a href=\"http://www.drunkard.com/issues/10_04/10-04-soused-africa.htm\">as PJ Tobia, who is not PJ O’Rourke, points out</a>, they already have control, indeed, the African social system appears to be arranged so that women can keep their men happily occupied with doing nothing but drink while leaving them free to get the work done.</p><p><i>The best part about all of this is that these guys are able  to sit around long enough to get drunk on a drink that has almost no alcohol content. For one thing, their wives know exactly where they are, whom they are with, and what they are doing, and don’t have a big problem with it. For another, as these men sit and drink, the village comes to them. Boys will make the rounds of each Chibuku bar, selling cigarettes. A village woman will arrive with pieces of meat on a skewer or hardboiled eggs with little baggies of salt and hot-pepper flakes on the side. Down the street someone may be roasting corn or making maize fritters. The whole community does their part so the drinking can continue uninterrupted.</i></p><p>In short, the drinkers of Africa have it made. Sure, they have no healthcare, the literacy rate is among the lowest in the world, and December through March is the “famine season,” but they can drink and hang with their friends pretty much all day. Also, the word “nag” doesn’t even exist in any of the more than two-dozen languages spoken in the region.</p><p>What rural African regions lack in material wealth, infrastructure, and modern conveniences, they more than make up for in drunken leisure time.</p><p>When you put it that way, it’s clear there are worse ways to spend your life.  Raise your carton of Chibuku and drink to  great grass hut matriarchy!</p></div>",
  "content_text": "In which the New York Times’s best liberal writer flirts with the idea of\nreviving Western imperialism\nafter belatedly discovering that not everyone is inclined to behave like an upper middle class liberal New Yorker:\nTwo M.I.T. economists, Abhijit Banerjee and Esther Duflo, found that the world’s poor  typically spend about 2 percent of their income educating their children, and often larger percentages on alcohol and tobacco: 4 percent in rural Papua New Guinea, 6 percent in Indonesia, 8 percent in Mexico. The indigent also spend significant sums on soft drinks, prostitution and extravagant festivals.\nLook, I don’t want to be an unctuous party-pooper. But I’ve seen too many children dying of malaria for want of a bed net that the father tells me is unaffordable, even as he spends larger sums on liquor. If we want Mr. Obamza’s children to get an education and sleep under a bed net — well, the simplest option is for their dad to spend fewer evenings in the bar.\nNaturally, Kristof thinks the idea is to give – GIVE – women more control.  How very white and neo-colonial of him to decide how Africans should live their lives.  And,\nas PJ Tobia, who is not PJ O’Rourke, points out\n, they already have control, indeed, the African social system appears to be arranged so that women can keep their men happily occupied with doing nothing but drink while leaving them free to get the work done.\nThe best part about all of this is that these guys are able  to sit around long enough to get drunk on a drink that has almost no alcohol content. For one thing, their wives know exactly where they are, whom they are with, and what they are doing, and don’t have a big problem with it. For another, as these men sit and drink, the village comes to them. Boys will make the rounds of each Chibuku bar, selling cigarettes. A village woman will arrive with pieces of meat on a skewer or hardboiled eggs with little baggies of salt and hot-pepper flakes on the side. Down the street someone may be roasting corn or making maize fritters. The whole community does their part so the drinking can continue uninterrupted.\nIn short, the drinkers of Africa have it made. Sure, they have no healthcare, the literacy rate is among the lowest in the world, and December through March is the “famine season,” but they can drink and hang with their friends pretty much all day. Also, the word “nag” doesn’t even exist in any of the more than two-dozen languages spoken in the region.\nWhat rural African regions lack in material wealth, infrastructure, and modern conveniences, they more than make up for in drunken leisure time.\nWhen you put it that way, it’s clear there are worse ways to spend your life.  Raise your carton of Chibuku and drink to  great grass hut matriarchy!",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-23T17:30:00+00:00"
}