{
  "url": "https://voxday.net/2010/05/06/post-american-public-schools/",
  "scraped_at": "2026-01-08T23:26:26.551846",
  "title": "Post-american public schools",
  "date_display": "May 6, 2010",
  "date_iso": "2010-05-06T14:11:00+00:00",
  "date_from_url": "2010-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>American symbols <a href=\"http://news.yahoo.com/video/sacramentocbs13-15751210/students-sent-home-over-american-flag-shirts-19585803\">are now out of bounds</a> in what is still, for the time being, technically America.  Did you really think that importing tens millions of Mexicans was going to change <i>the Mexicans</i>?  The Melting Pot is a myth popularized by a Jewish immigrant to England who never lived in the United States, supported pacifism, feminism, and was a fervent Zionist.  If the pro-immigration politicians and their supporters want to live in a third-world socialist hellhole so badly, why don’t we simply send them all there rather than permitting them to import millions of their precious immigrants here?</p><p>And, I wonder, how long will it be before the North Mexico Yankee Corps follows suit and bans the American flag?</p></div>",
  "content_text": "American symbols\nare now out of bounds\nin what is still, for the time being, technically America.  Did you really think that importing tens millions of Mexicans was going to change\nthe Mexicans\n?  The Melting Pot is a myth popularized by a Jewish immigrant to England who never lived in the United States, supported pacifism, feminism, and was a fervent Zionist.  If the pro-immigration politicians and their supporters want to live in a third-world socialist hellhole so badly, why don’t we simply send them all there rather than permitting them to import millions of their precious immigrants here?\nAnd, I wonder, how long will it be before the North Mexico Yankee Corps follows suit and bans the American flag?",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-06T13:11:00+00:00"
}