{
  "url": "https://voxday.net/2010/05/15/question-for-equalitarians/",
  "scraped_at": "2026-01-08T23:27:11.541260",
  "title": "A question for equalitarians",
  "date_display": "May 15, 2010",
  "date_iso": "2010-05-15T20:42:00+00:00",
  "date_from_url": "2010-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Stove raises <a href=\"http://web.maths.unsw.edu.au/~jim/women.html\">an interesting point</a>:</p><blockquote><p>In the past almost everyone, whether man or woman, learned or unlearned, believed the intellectual capacity of women to be inferior to that of men. Even now this is, I think, the belief of most people in most parts of the world. In this article my main object is simply to remind the reader of what the evidence is, and always was, for this old belief, and of how strong that evidence is.</p><p>An opposite belief has become widely current in the last few years, in societies like our own: the belief that the intellectual capacity of women is on the whole equal to that of men. If I could, I would discuss here the reasons for the sudden adoption by many people of this opinion. But I cannot, because I have not been able to find any reasons for it, as distinct from causes of it. The equality-theory (as I will call it) is not embraced on the grounds of any startling facts which have only lately come to light. It is not embraced on the grounds of some old familiar facts which have been misunderstood until lately. It is not embraced, as far as I can see, on any grounds at all, but from mere prejudice and passion. If you ask people, “What evidence is there for the equality-theory?”, you do not get an answer (though you are likely to get other things).  Rather, the question is felt to be somehow improper, morally or intellectually, and is thought not to deserve any answer.</p><p>I do not know why it should be thought so. The question is a perfectly proper one morally and intellectually, and should not be hard to answer. That men and women have the same intellectual capacity is not, after all, a self-evident proposition, like (say) “7 + 5 = 12” nor is it something just obvious, like (say) the sun’s rising in the east. So if it is rational to believe it, there must be evidence for it: facts which lead to it by good reasoning. But where is that evidence to be found?</p></blockquote><p>I have to admit, this does make me curious.  So, here’s a question for the equalitarian readers here.  Why do you believe that the intellectual capacity of women is equal to that of men?  What evidence has convinced you that this is, in fact, the case?  Alternatively, if you happen believe that the intellectual capacity of women is superior to that of men, what evidence has caused you to conclude that men have an inferior intellectual capacity?</p><p>I have to admit, I have never, ever understood any aspect of equalitarianism, except of course as a rhetorical and ideological device or legal pretense.  There are so many differences between two individuals of identical genetic inheritage that I marvel at the notion that there is even any <i>possibility</i> of  material equality between two individuals or two groups of individuals.  So, if you do genuinely believe in the intellectual equality of the sexes, here is your opportunity to educate me.</p><p>Now, it must be pointed out that a greater intellectual capacity is not necessarily a good thing, either for the individual or for the world around him.  The world would have been a much better place had Lenin been born with an IQ of 85, for example.  And there is copious evidence that financial success is more reliably achieved by those who do not possess the greatest cognitive capacity.  But because it is considered a <i>desirable</i> thing, this tends to pollute the discourse with a whole host of emotional detritus.  Nevertheless, the evidence is what it is, regardless of how you, me, or anyone else happens to feel about it.</p></div>",
  "content_text": "David Stove raises\nan interesting point\n:\nIn the past almost everyone, whether man or woman, learned or unlearned, believed the intellectual capacity of women to be inferior to that of men. Even now this is, I think, the belief of most people in most parts of the world. In this article my main object is simply to remind the reader of what the evidence is, and always was, for this old belief, and of how strong that evidence is.\nAn opposite belief has become widely current in the last few years, in societies like our own: the belief that the intellectual capacity of women is on the whole equal to that of men. If I could, I would discuss here the reasons for the sudden adoption by many people of this opinion. But I cannot, because I have not been able to find any reasons for it, as distinct from causes of it. The equality-theory (as I will call it) is not embraced on the grounds of any startling facts which have only lately come to light. It is not embraced on the grounds of some old familiar facts which have been misunderstood until lately. It is not embraced, as far as I can see, on any grounds at all, but from mere prejudice and passion. If you ask people, “What evidence is there for the equality-theory?”, you do not get an answer (though you are likely to get other things).  Rather, the question is felt to be somehow improper, morally or intellectually, and is thought not to deserve any answer.\nI do not know why it should be thought so. The question is a perfectly proper one morally and intellectually, and should not be hard to answer. That men and women have the same intellectual capacity is not, after all, a self-evident proposition, like (say) “7 + 5 = 12” nor is it something just obvious, like (say) the sun’s rising in the east. So if it is rational to believe it, there must be evidence for it: facts which lead to it by good reasoning. But where is that evidence to be found?\nI have to admit, this does make me curious.  So, here’s a question for the equalitarian readers here.  Why do you believe that the intellectual capacity of women is equal to that of men?  What evidence has convinced you that this is, in fact, the case?  Alternatively, if you happen believe that the intellectual capacity of women is superior to that of men, what evidence has caused you to conclude that men have an inferior intellectual capacity?\nI have to admit, I have never, ever understood any aspect of equalitarianism, except of course as a rhetorical and ideological device or legal pretense.  There are so many differences between two individuals of identical genetic inheritage that I marvel at the notion that there is even any\npossibility\nof  material equality between two individuals or two groups of individuals.  So, if you do genuinely believe in the intellectual equality of the sexes, here is your opportunity to educate me.\nNow, it must be pointed out that a greater intellectual capacity is not necessarily a good thing, either for the individual or for the world around him.  The world would have been a much better place had Lenin been born with an IQ of 85, for example.  And there is copious evidence that financial success is more reliably achieved by those who do not possess the greatest cognitive capacity.  But because it is considered a\ndesirable\nthing, this tends to pollute the discourse with a whole host of emotional detritus.  Nevertheless, the evidence is what it is, regardless of how you, me, or anyone else happens to feel about it.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-15T19:42:00+00:00"
}