{
  "url": "https://voxday.net/2010/05/19/republican-spin/",
  "scraped_at": "2026-01-08T23:27:28.062499",
  "title": "Republican spin",
  "date_display": "May 19, 2010",
  "date_iso": "2010-05-19T22:28:00+00:00",
  "date_from_url": "2010-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Krauthammer suggests that Kentucky Republicans chose for Rand Paul over the establishment candidate, Grayson, because they don’t like <i>Obama</i>:</p><blockquote><p>Well, I think that‘s the most amazing phenomenon of this day. He came literally out of nowhere. And when you compare him — politically he’s not exactly like his father, Ron Paul, but Ron Paul when he ran for the presidency in ‘08 was a bit of a joke. He was way out there.</p><p>It tells you how much our country has changed in two years that that kind of libertarianism was considered kind of kooky at the time, and now his son who is less libertarian, he’s more sort of centrist, but still – he’s really challenging the Republican establishment . . .</p><p>This has been I think the amazing story of the last year. Look, the tea party, which is behind Paul, barely existed a year ago. . . .</p><p>This is I think a tribute to how radical is the Obama agenda — the spontaneous reaction to overreach, a trillion-dollar stimulus, a health-care takeover, and cap-and-trade, all of that at the beginning of a term. This is an amazing, spontaneous phenomenon, and we‘re going to see a lot of its effects tonight.</p></blockquote><p>Right, it can’t <i>possibly</i> be because Bush and his <i>establishment Republican</i> White House rammed the bank bailout down the throats of an unwilling America.  What a pathetic attempt at co-option.  It’s not hard to see  that the Republican leadership absolutely hates what is happening and is getting concerned that their plans to send another Dole/McCain sacrificial goat up against Obama in 2012 may be falling apart.  Ron Paul wasn’t a joke in 2008, but Charles Krauthammer is most certainly a joke in 2010.</p></div>",
  "content_text": "Charles Krauthammer suggests that Kentucky Republicans chose for Rand Paul over the establishment candidate, Grayson, because they don’t like\nObama\n:\nWell, I think that‘s the most amazing phenomenon of this day. He came literally out of nowhere. And when you compare him — politically he’s not exactly like his father, Ron Paul, but Ron Paul when he ran for the presidency in ‘08 was a bit of a joke. He was way out there.\nIt tells you how much our country has changed in two years that that kind of libertarianism was considered kind of kooky at the time, and now his son who is less libertarian, he’s more sort of centrist, but still – he’s really challenging the Republican establishment . . .\nThis has been I think the amazing story of the last year. Look, the tea party, which is behind Paul, barely existed a year ago. . . .\nThis is I think a tribute to how radical is the Obama agenda — the spontaneous reaction to overreach, a trillion-dollar stimulus, a health-care takeover, and cap-and-trade, all of that at the beginning of a term. This is an amazing, spontaneous phenomenon, and we‘re going to see a lot of its effects tonight.\nRight, it can’t\npossibly\nbe because Bush and his\nestablishment Republican\nWhite House rammed the bank bailout down the throats of an unwilling America.  What a pathetic attempt at co-option.  It’s not hard to see  that the Republican leadership absolutely hates what is happening and is getting concerned that their plans to send another Dole/McCain sacrificial goat up against Obama in 2012 may be falling apart.  Ron Paul wasn’t a joke in 2008, but Charles Krauthammer is most certainly a joke in 2010.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-19T21:28:00+00:00"
}