{
  "url": "https://voxday.net/2010/05/21/rookie-mistake/",
  "scraped_at": "2026-01-08T23:27:38.055049",
  "title": "Rookie mistake",
  "date_display": "May 21, 2010",
  "date_iso": "2010-05-21T13:45:00+00:00",
  "date_from_url": "2010-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rand Paul hasn’t quite figured out the art of dealing with critics looking for gotchas:</p><blockquote><p>Rand Paul is coming under attack for things he said about the Civil Rights Act of 1964, which outlawed race discrimination in privately owned restaurants and hotels.</p></blockquote><p>First of all, I would absolutely voted against the Civil Rights Act of 1964 which is an egregious violation against property rights as well as the Constitutional Right of Free Association.  That being said, it is remarkably stupid for any <i>politician</i>, of any party, to comment upon what he would or would not have done had he been voting on a bill 46 years ago.</p><p>The correct response would have been to say: “Rachel, I have no more intention of speculating about how I would have voted on the Civil Rights Act of 1964 than I have of speculating how I would have voted on the Declaration of War against Spain of 1898 or the Proclamation of Imperial Divinity of 14 AD.  I was not a Senator in either Washington DC or Rome at the time of those previous votes, and while hypothetical speculation is always interesting, it’s simply not relevant to a Kentucky Senate campaign in 2010.”</p><p>Of course, if she pressed further, I would answer the question as if she had asked about the Augustan godhood.  “Well, Rachel, there’s no question that Octavian accomplished great things and reunified the empire after it was riven by a series of failed triumvirates and the subsequent civil wars, but I’m not sure it actually required the mind of a deity to outthink Marc Antony.”  If your interlocutor is being silly, the idea is to respond in a way that highlights the inherent silliness of his approach, not be dragged down into the mire of the ridiculous.</p></div>",
  "content_text": "Rand Paul hasn’t quite figured out the art of dealing with critics looking for gotchas:\nRand Paul is coming under attack for things he said about the Civil Rights Act of 1964, which outlawed race discrimination in privately owned restaurants and hotels.\nFirst of all, I would absolutely voted against the Civil Rights Act of 1964 which is an egregious violation against property rights as well as the Constitutional Right of Free Association.  That being said, it is remarkably stupid for any\npolitician\n, of any party, to comment upon what he would or would not have done had he been voting on a bill 46 years ago.\nThe correct response would have been to say: “Rachel, I have no more intention of speculating about how I would have voted on the Civil Rights Act of 1964 than I have of speculating how I would have voted on the Declaration of War against Spain of 1898 or the Proclamation of Imperial Divinity of 14 AD.  I was not a Senator in either Washington DC or Rome at the time of those previous votes, and while hypothetical speculation is always interesting, it’s simply not relevant to a Kentucky Senate campaign in 2010.”\nOf course, if she pressed further, I would answer the question as if she had asked about the Augustan godhood.  “Well, Rachel, there’s no question that Octavian accomplished great things and reunified the empire after it was riven by a series of failed triumvirates and the subsequent civil wars, but I’m not sure it actually required the mind of a deity to outthink Marc Antony.”  If your interlocutor is being silly, the idea is to respond in a way that highlights the inherent silliness of his approach, not be dragged down into the mire of the ridiculous.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-21T12:45:00+00:00"
}