{
  "url": "https://voxday.net/2010/05/31/scientific-american-and-social-autis/",
  "scraped_at": "2026-01-08T23:28:19.900048",
  "title": "Scientific American and social autism",
  "date_display": "May 31, 2010",
  "date_iso": "2010-05-31T17:15:00+00:00",
  "date_from_url": "2010-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scientific American reports on a study which implies that atheism may be a form of <i>virtual</i> <a href=\"http://www.scientificamerican.com/blog/post.cfm?id=people-with-aspergers-less-likely-t-2010-05-29\">Asperger’s Syndrome</a>:</p><blockquote><p>Bethany T. Heywood, a graduate student at Queens University Belfast, asked 27 people with Asperger’s Syndrome, a mild type of autism that involves impaired social cognition, about significant events in their lives. Working with experimental psychologist Jesse M. Bering (author of the Bering in Mind blog and a frequent contributor to Scientific American Mind), she asked them to speculate about why these important events happened—for instance, why they had gone through an illness or why they met a significant other. As compared with 34 neurotypical people, those with Asperger’s syndrome were significantly less likely to invoke a teleological response—for example, saying the event was meant to unfold in a particular way or explaining that God had a hand in it. They were more likely to invoke a natural cause (such as blaming an illness on a virus they thought they were exposed to) or to give a descriptive response, explaining the event again in a different way.</p><p>In a second experiment, Heywood and Bering compared 27 people with Asperger’s with 34 neurotypical people who are atheists. The atheists, as expected, often invoked anti-teleological responses such as “there is no reason why; things just happen.” The people with Asperger’s were significantly less likely to offer such anti-teleological explanations than the atheists, indicating they were not engaged in teleological thinking at all. (The atheists, in contrast, revealed themselves to be reasoning teleologically, but then they rejected those thoughts.)</p></blockquote><p>This sounds a more than a little sketchy in the usual social science manner; it’s actually a smaller sample size than was the case in the utterly unscientific comparison of the high AS Quotient average reported by atheist Pharyngula readers to the neurotypical range reported by regular readers here at VP, which involved more than 100 individuals.  I think it would be more illuminating to learn whether those diagnosed with Asperger’s Syndrome or full-blown autism are more or less likely to be atheists, as the reported predilection for non-teleological thinking suggests that those suffering from this form of mental impairment would be tend to be predisposed towards atheism and materialism.</p><p>Of course, the existence of neurotypical atheists should not be a surprise since many atheists do not exhibit the impaired social cognition that is the hallmark of the militant New Atheists.  This is why it is always important to distinguish between the individual who merely happens to lack belief in gods from the anti-religious socially autistic crusaders who simply cannot understand that your religious beliefs, whatever they might be, are no legitimate concern of theirs.</p><p>And while we’re on the subject of impaired social cognition, I found this comment on the article to be as amusing as it is ironic. <i>“Socially speaking, the world is full of all kinds of people, but the atheists I choose to associate with are outspoken because of their innate consideration and compassion in light of another’s plight with respect to primitive irrational superstitions.”</i></p></div>",
  "content_text": "Scientific American reports on a study which implies that atheism may be a form of\nvirtual\nAsperger’s Syndrome\n:\nBethany T. Heywood, a graduate student at Queens University Belfast, asked 27 people with Asperger’s Syndrome, a mild type of autism that involves impaired social cognition, about significant events in their lives. Working with experimental psychologist Jesse M. Bering (author of the Bering in Mind blog and a frequent contributor to Scientific American Mind), she asked them to speculate about why these important events happened—for instance, why they had gone through an illness or why they met a significant other. As compared with 34 neurotypical people, those with Asperger’s syndrome were significantly less likely to invoke a teleological response—for example, saying the event was meant to unfold in a particular way or explaining that God had a hand in it. They were more likely to invoke a natural cause (such as blaming an illness on a virus they thought they were exposed to) or to give a descriptive response, explaining the event again in a different way.\nIn a second experiment, Heywood and Bering compared 27 people with Asperger’s with 34 neurotypical people who are atheists. The atheists, as expected, often invoked anti-teleological responses such as “there is no reason why; things just happen.” The people with Asperger’s were significantly less likely to offer such anti-teleological explanations than the atheists, indicating they were not engaged in teleological thinking at all. (The atheists, in contrast, revealed themselves to be reasoning teleologically, but then they rejected those thoughts.)\nThis sounds a more than a little sketchy in the usual social science manner; it’s actually a smaller sample size than was the case in the utterly unscientific comparison of the high AS Quotient average reported by atheist Pharyngula readers to the neurotypical range reported by regular readers here at VP, which involved more than 100 individuals.  I think it would be more illuminating to learn whether those diagnosed with Asperger’s Syndrome or full-blown autism are more or less likely to be atheists, as the reported predilection for non-teleological thinking suggests that those suffering from this form of mental impairment would be tend to be predisposed towards atheism and materialism.\nOf course, the existence of neurotypical atheists should not be a surprise since many atheists do not exhibit the impaired social cognition that is the hallmark of the militant New Atheists.  This is why it is always important to distinguish between the individual who merely happens to lack belief in gods from the anti-religious socially autistic crusaders who simply cannot understand that your religious beliefs, whatever they might be, are no legitimate concern of theirs.\nAnd while we’re on the subject of impaired social cognition, I found this comment on the article to be as amusing as it is ironic.\n“Socially speaking, the world is full of all kinds of people, but the atheists I choose to associate with are outspoken because of their innate consideration and compassion in light of another’s plight with respect to primitive irrational superstitions.”",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-31T16:15:00+00:00"
}