{
  "url": "https://voxday.net/2010/05/10/so-bankrupt-indeed/",
  "scraped_at": "2026-01-08T23:26:46.322984",
  "title": "So bankrupt indeed",
  "date_display": "May 10, 2010",
  "date_iso": "2010-05-10T19:26:00+00:00",
  "date_from_url": "2010-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps Helicopter Ben needs to tell Fannie Mae to <a href=\"http://market-ticker.denninger.net/archives/2301-The-Bankrupt-Gets-More-Bankrupt-Fannie.html\">relax and enjoy the grass shoots</a> and GDP growth:</p><blockquote><p><i>“When Treasury provides the requested funds, the aggregate liquidation preference on the senior preferred stock will be $84.6 billion, which will require an annualized dividend of approximately $8.5 billion. This amount exceeds our reported annual net income for each of the last eight fiscal years, in most cases by a significant margin.”</i></p><p>This, in English, means “We do not earn enough in a quarter to pay the dividend – that is, the interest on the borrowed money.”</p></blockquote><p>So it’s not just homeowners who can’t pay their mortgages anymore.  By the way, I don’t mean to worry anyone unduly, but I seem to recall that FNMA was the last big investment made by Ben Bernanke prior to this weekend’s Euro stabilization gambit.  I’m beginning to think we’d be better off turning the Federal Reserve over to Goldman Sachs.  After all, their traders <a href=\"http://market-ticker.denninger.net/archives/2300-What-Are-The-Odds-GS.html\">didn’t lose money on a single business day</a> during the first quarter.  They must be really good!</p></div>",
  "content_text": "Perhaps Helicopter Ben needs to tell Fannie Mae to\nrelax and enjoy the grass shoots\nand GDP growth:\n“When Treasury provides the requested funds, the aggregate liquidation preference on the senior preferred stock will be $84.6 billion, which will require an annualized dividend of approximately $8.5 billion. This amount exceeds our reported annual net income for each of the last eight fiscal years, in most cases by a significant margin.”\nThis, in English, means “We do not earn enough in a quarter to pay the dividend – that is, the interest on the borrowed money.”\nSo it’s not just homeowners who can’t pay their mortgages anymore.  By the way, I don’t mean to worry anyone unduly, but I seem to recall that FNMA was the last big investment made by Ben Bernanke prior to this weekend’s Euro stabilization gambit.  I’m beginning to think we’d be better off turning the Federal Reserve over to Goldman Sachs.  After all, their traders\ndidn’t lose money on a single business day\nduring the first quarter.  They must be really good!",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-10T18:26:00+00:00"
}