{
  "url": "https://voxday.net/2010/05/11/supremes-and-equality-my/",
  "scraped_at": "2026-01-08T23:26:48.169282",
  "title": "The Supremes and the equality myth",
  "date_display": "May 11, 2010",
  "date_iso": "2010-05-11T10:11:00+00:00",
  "date_from_url": "2010-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not particularly concerned about presidential Supreme Court nominees since most appointees by both parties have zero respect for the Constitution as written.  I find Obama’s present stealth nominee to be more amusing than anything, considering how she wishes to throw out literal centuries of tradition, jurisprudence, and free speech rights <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=152305\">in favor of a nonexistent concept</a>:</p><blockquote><p>President Obama’s nominee for the Supreme Court, Elena Kagan, argued certain forms of speech that promote “racial or gender inequality” could be “disappeared.”  In her few academic papers, Kagan evidences strong beliefs for court intervention in speech, going so far as to posit First Amendment speech should be weighed against “societal costs.”</p><p>In her 1993 article “Regulation of Hate Speech and Pornography After R.A.V,” for the University of Chicago Law Review, Kagan writes:</p><p>“I take it as a given that we live in a society marred by racial and gender inequality, that certain forms of speech perpetuate and promote this inequality, and that the uncoerced disappearance of such speech would be cause for great elation.”</p></blockquote><p>All societies are “marred” by racial and gender inequality because there has never been any equality of any kind in any society.  And there never will be.  It would be as reasonable, and as meaningful, to write that society is marred by the absence of flying pink unicorns and that the magical appearance of those wonderful creatures would be cause for great elation.</p><p>As a bonus, Kagan’s blathering also demolishes the idea that the Left is as vehement in its defense of the First Amendment as the Right is in its defense of the Second.</p></div>",
  "content_text": "I’m not particularly concerned about presidential Supreme Court nominees since most appointees by both parties have zero respect for the Constitution as written.  I find Obama’s present stealth nominee to be more amusing than anything, considering how she wishes to throw out literal centuries of tradition, jurisprudence, and free speech rights\nin favor of a nonexistent concept\n:\nPresident Obama’s nominee for the Supreme Court, Elena Kagan, argued certain forms of speech that promote “racial or gender inequality” could be “disappeared.”  In her few academic papers, Kagan evidences strong beliefs for court intervention in speech, going so far as to posit First Amendment speech should be weighed against “societal costs.”\nIn her 1993 article “Regulation of Hate Speech and Pornography After R.A.V,” for the University of Chicago Law Review, Kagan writes:\n“I take it as a given that we live in a society marred by racial and gender inequality, that certain forms of speech perpetuate and promote this inequality, and that the uncoerced disappearance of such speech would be cause for great elation.”\nAll societies are “marred” by racial and gender inequality because there has never been any equality of any kind in any society.  And there never will be.  It would be as reasonable, and as meaningful, to write that society is marred by the absence of flying pink unicorns and that the magical appearance of those wonderful creatures would be cause for great elation.\nAs a bonus, Kagan’s blathering also demolishes the idea that the Left is as vehement in its defense of the First Amendment as the Right is in its defense of the Second.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-11T09:11:00+00:00"
}