{
  "url": "https://voxday.net/2010/05/05/united-states-yankee-corps/",
  "scraped_at": "2026-01-08T23:26:22.883818",
  "title": "The United States Yankee Corps",
  "date_display": "May 5, 2010",
  "date_iso": "2010-05-05T17:15:00+00:00",
  "date_from_url": "2010-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was raised to revere the Marine Corps my entire life.  I have always harbored the greatest respect for the many Marines I have met through the years.  But I have absolutely no doubt that my grandfather, who fought in WWII and Korea and was declared a Marine’s Marine by the Commandant of the Corps himself, would be bewildered by the rejection of the American South by what should <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=149729\">apparently be renamed the United States Yankee Corps</a>:</p><blockquote><p>Straight out of high school, one 18-year-old Tennessee man was determined to serve his country as a Marine. His friend said he passed the pre-enlistment tests and physical exams and looked forward with excitement to the day he would ship out to boot camp. But there would be no shouting drill instructors, no rigorous physical training and no action-packed stories for the aspiring Marine to share with his family.  Shortly before he was scheduled to leave Nashville for boot camp, the Marine Corps rejected him….  When the young recruit didn’t go to boot camp, Andrews learned of his rejection based on his tattoo of the Confederate battle flag on his shoulder.</p></blockquote><p>It would be educational to see what would happen if Southerners refused to enlist and re-enlist until ludicrous ban on Southern heritage and Southron pride is rescinded.  Without the South, the Marine Corps would find itself transformed into a mercenary force largely populated by gangsters looking to acquire combat training and Mexicans seeking citizenship.  Of course, if that’s the ultimate objective of the policy, then we can expect that the ban on the Confederate Battle flag will only be the first step and it won’t be long before other patriotic symbols such as the Gadsden Flag and the Betsy Ross Flag are banned as well.  Does anyone believe a UN or Mexican flag would be cause for similar rejection?</p><p>Speaking of Mexico, it is already on the verge of <s>civil war</s> violent revolt in the north.  This makes me wonder, how long will it be until Round Two?</p></div>",
  "content_text": "I was raised to revere the Marine Corps my entire life.  I have always harbored the greatest respect for the many Marines I have met through the years.  But I have absolutely no doubt that my grandfather, who fought in WWII and Korea and was declared a Marine’s Marine by the Commandant of the Corps himself, would be bewildered by the rejection of the American South by what should\napparently be renamed the United States Yankee Corps\n:\nStraight out of high school, one 18-year-old Tennessee man was determined to serve his country as a Marine. His friend said he passed the pre-enlistment tests and physical exams and looked forward with excitement to the day he would ship out to boot camp. But there would be no shouting drill instructors, no rigorous physical training and no action-packed stories for the aspiring Marine to share with his family.  Shortly before he was scheduled to leave Nashville for boot camp, the Marine Corps rejected him….  When the young recruit didn’t go to boot camp, Andrews learned of his rejection based on his tattoo of the Confederate battle flag on his shoulder.\nIt would be educational to see what would happen if Southerners refused to enlist and re-enlist until ludicrous ban on Southern heritage and Southron pride is rescinded.  Without the South, the Marine Corps would find itself transformed into a mercenary force largely populated by gangsters looking to acquire combat training and Mexicans seeking citizenship.  Of course, if that’s the ultimate objective of the policy, then we can expect that the ban on the Confederate Battle flag will only be the first step and it won’t be long before other patriotic symbols such as the Gadsden Flag and the Betsy Ross Flag are banned as well.  Does anyone believe a UN or Mexican flag would be cause for similar rejection?\nSpeaking of Mexico, it is already on the verge of\ncivil war\nviolent revolt in the north.  This makes me wonder, how long will it be until Round Two?",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-05T16:15:00+00:00"
}