{
  "url": "https://voxday.net/2010/05/28/yes-it-shows/",
  "scraped_at": "2026-01-08T23:28:05.323685",
  "title": "Yes, it shows",
  "date_display": "May 28, 2010",
  "date_iso": "2010-05-28T14:15:00+00:00",
  "date_from_url": "2010-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers provides <a href=\"http://scienceblogs.com/pharyngula/2010/05/another_courtier_speaks_up.php\">an illuminating example</a> of the careful logic and deep thought that goes into so much atheist reasoning:</p><blockquote><p>A couple of years ago, I sat down one morning, bemused by yet another bit of empty apologetics from god’s sycophants, and banged out a short bit of amusement called The Courtier’s Reply. It got picked up everywhere, to my surprise. I mean, seriously, I have to confess that I whipped that out in 20 minutes, no edits or rewrites, just shazam, it’s done.</p></blockquote><p>That’s certainly amusing, if not exactly surprising to anyone who has read it.  As I <a href=\"http://www.milobookclub.com/2009/10/22/beyond-epic-fai/\">have mentioned before</a>, The Courtier’s Reply is a blitheringly stupid attempt to justify atheist ignorance of that which they are criticizing.  In his recent post, PZ tries to claim otherwise, but the fact of the matter is that whatever PZ’s original purpose may have been, that purpose is not synonymous with either its logical consequences or how it is habitually utilized by atheists who refer to it.  He states <i>“they see the Courtier’s Reply as an attempt to excuse atheists from bothering with theology at all, when it’s quite the opposite: it’s a rebuke to theologians, pointing out that going on at length about rarefied epiphenomena and delicate points of dogma is a waste of time when you haven’t even established the central point of the matter, a reasonable justification for believing in a god or gods, period.”</i></p><p>Of course, being cited to excuse atheists from bothering with theology at all is exactly how The Courtier’s Reply is utilized; it is the ONLY way it is utilized.  PZ’s attempt to provide a belated defense is easily proven to be false by no less than Richard Dawkins himself, <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/guest_contributors/article1779771.ece\">who publicly cited it as an excuse for his own ignorance</a> of theology in the Times.</p><blockquote><p><b>You can’t criticise religion without detailed study of learned books on theology.</b></p><p>If, as one self-consciously intellectual critic wished, I had expounded the epistemological differences between Aquinas and Duns Scotus, Eriugena on subjectivity, Rahner on grace or Moltmann on hope (as he vainly hoped I would), my book would have been more than a surprise bestseller, it would have been a miracle. I would happily have forgone bestsellerdom had there been the slightest hope of Duns Scotus illuminating my central question: does God exist? But I need engage only those few theologians who at least acknowledge the question, rather than blithely assuming God as a premise. For the rest, I cannot better the “Courtier’s Reply” on P. Z. Myers’s splendid Pharyngula website, where he takes me to task for outing the Emperor’s nudity while ignoring learned tomes on ruffled pantaloons and silken underwear.</p></blockquote><p>As if Richard Dawkins knows the first thing about the theology of Thomas Aquinas, Duns Scotus, Tertullian, or even CS Lewis.  But this example of Dawkins is far from the only one and many more can be found on PZ’s own site for those with the fortitude to slog through that swamp of pseudo-scientific smuggery.  The core problem with The Courtier’s Reply is that it is a category error.  PZ does not understand that while the discussion of God’s Will or divine characteristics are conceptually related to discussions of God’s existence, they are not synonymous.  The Courtier’s Reply is that of the innumerate individual claiming that because no one has ever shown him a “one” or a “two”, it is a waste of time for mathematicians to go on at length about rarefied imaginary numbers and delicate points of calculus.  The fact that religion and the theology from which it derives makes real, material, and observable differences in the lives of its practitioners, be they for good or for ill, is sufficient to justify its study regardless of whether one can establish its ultimate source to the satisfaction of scientists or not.  And only a complete ignoramus who knows nothing of history, economics, socionomics, or demographics would be foolish enough to assert that the material effects of theological differences are too unimportant to bother with the matter.</p><p>The thing that is so ridiculous about latter day atheists like PZ is that they are not only theologically ignorant, but they know next to nothing about secular philosophy either.  Intelligent atheists have known for decades that science can never provide the replacement for religion that fantasists like PZ and Sam Harris believe it can for the simple reason that science does not and cannot dictate values.  This is why a strong dedication to rational science, with or without the additional complication of atheism, so readily produces monstrous leaders like Hitler, Lenin, and Stalin in such short order, monsters of the sort that were so few and far between in the centuries prior to the Enlightenment.</p><p>Theology is the precise opposite of useless because it provides that which science intrinsically cannot; a basic framework upon which guidelines for human behavior can be structured in a viable manner that is coherent, self-consistent and understandable even to the non-believer.  Consider how it is entirely normal for the atheist to criticize the Christian for failing to live up to the standards set by Christian theology; to what scientific standard can the non-atheist ever hope to hold the atheist?</p><p>Myers further demonstrates his astounding ignorance when he claims: <i>“Science provides tangible evidence of its accuracy and importance. Religion makes excuses for its absence of the same.   There is no “rich tradition of rigorous inquiry” in religion, as we can see from its lack of progress, and the apologists are deluding themselves when they claim there is.”</i> And yet, ironically enough, there is no shortage of empirical evidence, <i>scientific</i> evidence, demonstrating both the accuracy and importance of religion.  PZ’s incompetent blathering would be entirely amusing, were it not for the panoply of self-deluded idiots at Pharyngula that actually take the man’s illogical meanderings seriously.  But, if nothing else, the forthcoming book he mentions should provide for a deliciously target-rich environment.</p><p>UPDATE – Buttressing my point about how mathematics, among other disciplines, demonstrates the philosophical absurdity and irrelevance of The Courtier’s Reply, wrf3 quotes from <i>Introduction to Artificial Intelligence</i> by Philip C. Jackson:</p><p>“[T]he mathematical theory of Euclidean geometry gives us certain axioms or postulates concerning the undefined concepts of “point,” “line,” “plane,” “between,” etc.; the “thing” described by this theory is a “geometry,” consisting of interrelationships existing among lines, points, planes, circles, spaces, etc.</p><p>The ingredients of a mathematical theory, then, are the following:</p><p>1. A set of basic words (e.g. “point,” “line,” “between,” “distance,” “x,” “y,” “not,” “implies,” “for all,”) that refer to different objects, relations between objects, variables, logical connectives, quantifiers, and so on. These are the undefined words or symbols of the theory.</p><p>2. A set of basic sentences made of these basic words. These basic sentences are the axioms or postulates of the theory.</p><p>3. A set of logical rules, also made of these basic words, that tell us how to derive new statements from the ones we are given.”</p><p>If one is so foolish as to take The Courtier’s Reply seriously, one must then throw out all mathematics since mathematicians haven’t established the central point of the matter, a reasonable justification for believing in the undefined words or symbols of the theory.  As I have said on numerous occasions before, the New Atheists are logical incompetents and philosophical ignoramuses.  This is precisely why I have referred to them from the very start as The Clowns of Reason.</p></div>",
  "content_text": "PZ Myers provides\nan illuminating example\nof the careful logic and deep thought that goes into so much atheist reasoning:\nA couple of years ago, I sat down one morning, bemused by yet another bit of empty apologetics from god’s sycophants, and banged out a short bit of amusement called The Courtier’s Reply. It got picked up everywhere, to my surprise. I mean, seriously, I have to confess that I whipped that out in 20 minutes, no edits or rewrites, just shazam, it’s done.\nThat’s certainly amusing, if not exactly surprising to anyone who has read it.  As I\nhave mentioned before\n, The Courtier’s Reply is a blitheringly stupid attempt to justify atheist ignorance of that which they are criticizing.  In his recent post, PZ tries to claim otherwise, but the fact of the matter is that whatever PZ’s original purpose may have been, that purpose is not synonymous with either its logical consequences or how it is habitually utilized by atheists who refer to it.  He states\n“they see the Courtier’s Reply as an attempt to excuse atheists from bothering with theology at all, when it’s quite the opposite: it’s a rebuke to theologians, pointing out that going on at length about rarefied epiphenomena and delicate points of dogma is a waste of time when you haven’t even established the central point of the matter, a reasonable justification for believing in a god or gods, period.”\nOf course, being cited to excuse atheists from bothering with theology at all is exactly how The Courtier’s Reply is utilized; it is the ONLY way it is utilized.  PZ’s attempt to provide a belated defense is easily proven to be false by no less than Richard Dawkins himself,\nwho publicly cited it as an excuse for his own ignorance\nof theology in the Times.\nYou can’t criticise religion without detailed study of learned books on theology.\nIf, as one self-consciously intellectual critic wished, I had expounded the epistemological differences between Aquinas and Duns Scotus, Eriugena on subjectivity, Rahner on grace or Moltmann on hope (as he vainly hoped I would), my book would have been more than a surprise bestseller, it would have been a miracle. I would happily have forgone bestsellerdom had there been the slightest hope of Duns Scotus illuminating my central question: does God exist? But I need engage only those few theologians who at least acknowledge the question, rather than blithely assuming God as a premise. For the rest, I cannot better the “Courtier’s Reply” on P. Z. Myers’s splendid Pharyngula website, where he takes me to task for outing the Emperor’s nudity while ignoring learned tomes on ruffled pantaloons and silken underwear.\nAs if Richard Dawkins knows the first thing about the theology of Thomas Aquinas, Duns Scotus, Tertullian, or even CS Lewis.  But this example of Dawkins is far from the only one and many more can be found on PZ’s own site for those with the fortitude to slog through that swamp of pseudo-scientific smuggery.  The core problem with The Courtier’s Reply is that it is a category error.  PZ does not understand that while the discussion of God’s Will or divine characteristics are conceptually related to discussions of God’s existence, they are not synonymous.  The Courtier’s Reply is that of the innumerate individual claiming that because no one has ever shown him a “one” or a “two”, it is a waste of time for mathematicians to go on at length about rarefied imaginary numbers and delicate points of calculus.  The fact that religion and the theology from which it derives makes real, material, and observable differences in the lives of its practitioners, be they for good or for ill, is sufficient to justify its study regardless of whether one can establish its ultimate source to the satisfaction of scientists or not.  And only a complete ignoramus who knows nothing of history, economics, socionomics, or demographics would be foolish enough to assert that the material effects of theological differences are too unimportant to bother with the matter.\nThe thing that is so ridiculous about latter day atheists like PZ is that they are not only theologically ignorant, but they know next to nothing about secular philosophy either.  Intelligent atheists have known for decades that science can never provide the replacement for religion that fantasists like PZ and Sam Harris believe it can for the simple reason that science does not and cannot dictate values.  This is why a strong dedication to rational science, with or without the additional complication of atheism, so readily produces monstrous leaders like Hitler, Lenin, and Stalin in such short order, monsters of the sort that were so few and far between in the centuries prior to the Enlightenment.\nTheology is the precise opposite of useless because it provides that which science intrinsically cannot; a basic framework upon which guidelines for human behavior can be structured in a viable manner that is coherent, self-consistent and understandable even to the non-believer.  Consider how it is entirely normal for the atheist to criticize the Christian for failing to live up to the standards set by Christian theology; to what scientific standard can the non-atheist ever hope to hold the atheist?\nMyers further demonstrates his astounding ignorance when he claims:\n“Science provides tangible evidence of its accuracy and importance. Religion makes excuses for its absence of the same.   There is no “rich tradition of rigorous inquiry” in religion, as we can see from its lack of progress, and the apologists are deluding themselves when they claim there is.”\nAnd yet, ironically enough, there is no shortage of empirical evidence,\nscientific\nevidence, demonstrating both the accuracy and importance of religion.  PZ’s incompetent blathering would be entirely amusing, were it not for the panoply of self-deluded idiots at Pharyngula that actually take the man’s illogical meanderings seriously.  But, if nothing else, the forthcoming book he mentions should provide for a deliciously target-rich environment.\nUPDATE – Buttressing my point about how mathematics, among other disciplines, demonstrates the philosophical absurdity and irrelevance of The Courtier’s Reply, wrf3 quotes from\nIntroduction to Artificial Intelligence\nby Philip C. Jackson:\n“[T]he mathematical theory of Euclidean geometry gives us certain axioms or postulates concerning the undefined concepts of “point,” “line,” “plane,” “between,” etc.; the “thing” described by this theory is a “geometry,” consisting of interrelationships existing among lines, points, planes, circles, spaces, etc.\nThe ingredients of a mathematical theory, then, are the following:\n1. A set of basic words (e.g. “point,” “line,” “between,” “distance,” “x,” “y,” “not,” “implies,” “for all,”) that refer to different objects, relations between objects, variables, logical connectives, quantifiers, and so on. These are the undefined words or symbols of the theory.\n2. A set of basic sentences made of these basic words. These basic sentences are the axioms or postulates of the theory.\n3. A set of logical rules, also made of these basic words, that tell us how to derive new statements from the ones we are given.”\nIf one is so foolish as to take The Courtier’s Reply seriously, one must then throw out all mathematics since mathematicians haven’t established the central point of the matter, a reasonable justification for believing in the undefined words or symbols of the theory.  As I have said on numerous occasions before, the New Atheists are logical incompetents and philosophical ignoramuses.  This is precisely why I have referred to them from the very start as The Clowns of Reason.",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-05-28T13:15:00+00:00"
}