{
  "url": "https://voxday.net/2022/09/30/a-gatekeeper-discovers-iq/",
  "scraped_at": "2026-01-08T13:33:02.815967",
  "title": "A Gatekeeper Discovers IQ",
  "date_display": "September 30, 2022",
  "date_iso": "2022-09-30T12:22:32+00:00",
  "date_from_url": "2022-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just as they’ve recently done with Christian Nationalism, the gatekeepers of the Right are beginning to discover that <a href=\"https://thezman.com/wordpress/?p=28299\">immigration affects IQ</a>, and consequently, the shape of society.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The flow of people from the south into America is having a clear impact on IQ. The claim is that the people coming in will get smarter by standing on the better dirt in the United States, but it will take four or five generations for that to happen. That is roughly a century. While that is happening, the population of low IQ people rises. This is happening rather quickly due to the age distribution of the white population.</p><p>For example, using government data, whites have an average IQ of 100, blacks are at 85 and the new people are around 90. This is consistent with what Richwine found in his research and what subsequent research has shown. This is one of those times when the official government position mirrors reality. That means that the average IQ in the United States in 1950 was around 98. By 1980, with the uptick in immigration and decline in white fertility, the average was just over 97.</p><p>In other words, with very stable demographics and little immigration, the average IQ in the United States had not changed very much in thirty years. This would explain why the country was able to pull out of the cultural lunacy of the prior decades and turn things around so quickly. There were a lot of smart people. Societies with high average intelligence also have a much larger number of smart people. These are the people who solve the problems made by other smart people.</p><p>By 2000, the effects of immigration were showing up in the test scores. The average IQ of the country, based on the new demographic mix, was below 97. By 2020 the average had fallen to below 96. In another decade it will fall below 95 and when the white population is a minority, it will be around 93.</p><cite><em>The Great Dimming</em>, The Z Blog, 20 September 2022</cite></blockquote><p>Now, you might wonder about the strange reference to “the better dirt in the United States”. Or, perhaps, the way in which it appears to avoid the use of the more common term “the Magic Dirt” as well as any reference to the specific individual who has been pointing this out for some time. Consider the following passage from a book published seven years ago.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Without question the worst effect caused by 50 years of failure, and the one most likely to have the most severe long-term consequences, is the negative effect immigration has had on the collective national intelligence. Researchers around the world have observed that the nations of the West have been gradually becoming less intelligent; the Danish military measured a 1.5 point decline in the average IQ of its soldiers between 1998 and 2014, while the average British 14-year-old lost two IQ points from 1980 to 2008. The same is true for the USA, where a three-point average IQ gain that took place after the Melting Pot migration ended has been entirely reversed as a result of immigration from lower-IQ nations.</p><p>By multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.</p><p>Even the left-wing British paper, <em>the Guardian</em>, was recently forced to take note of this phenomenon, as it reported that scientists have determined genes influence academic ability across all subjects, and that as much as 60 percent of the observed differences between various population groups can be explained by genetic factors. So, the mass migration of the last 50 years has been materially dysgenic and has literally made Americans stupider on average. It’s not just you, mass entertainment really has been dumbed down in recent decades in order to appeal to what is an even lower common denominator than before.</p><p>Whatever one thinks of these changes, this is one of the fastest demographic transformations of a nation in recorded human history, and it is the direct result of public policy.</p><cite><em>CUCKSERVATIVE</em> by Vox Day and John Red Eagle, 4 December 2015</cite></blockquote><p>What I find significant about the Z-man’s post is that even mediocrities who assiduously refuse to mention me except to attempt to minimize my hypothetical influence are now being forced by events to address the issues that I’ve been highlighting for more than 20 years, because the observable reality can no longer be ignored.</p><p>Now, I don’t take the Z-man seriously and neither should you. I stopped reading him regularly once it became clear that he is <span style=\"text-decoration: underline;\"><a href=\"https://voxday.net/2020/01/11/too-short-and-too-dishonest-for-the-ride/\">a confirmed liar</a></span> who doesn’t hesitate to try to shape his readers’ opinions despite his complete ignorance of the facts. His gatekeeping role can be seen clearly in the way he follows the lead of the <em>Daily Wire</em> with regards to certain unmentionables who must not be mentioned for fear that his readers might become tempted to leave the intellectual corral he has constructed.</p><p>On that note, it’s rather amusing how, in a discussion of various concepts that will be familiar to you even without being named, most of those involved are less willing than Jordan Peterson to Name the Voldemort.</p><ul class=\"wp-block-list\"><li>There is a certain blogger who has a very outsized opinion of his intelligence. I used to think he was exaggerating somewhat when he said that we could have diversity or we could have running water. No longer do I think he is exaggerating. Nothing explains the way our world runs and has developed the way IQ does. it is the one element of social science that has been battle-tested and still stands. The liberal intelligentsia spent decades trying to disprove it, innate intelligence, and genetically-derived abilities of a population. It sure seems like their final stab at it was Jared Diamond’s stupid book, but once that failed, they just banned it.</li><li>Said blogger does tend to be self aggrandizing, but that does not automatically make his conclusions wrong. He has been proven correct, in my opinion, in a number of areas.</li><li>His main point of hubris was that taxonomy of male archetypes. The taxonomy itself is self-evident even without the greek letters: you’ve got jocks, jocks-in-waiting, nerds, normies, and losers. Then our friend realized he was a nerd so he had to add an extra category of “cool nerd who everybody likes even though he’s a jerk” which only exists in TV shows written by narcissistic nerds like Rick and Morty or House MD.</li><li>The disdain people in the dissident right have of him is a reflection of some of the flaws of the DR. He is one of the few people making headway in the culture war. They sperg out about his quirks and his comics. Those comics are reaching a lot of people. Like it or not, comic books are a good way to reach young people.</li><li>That blogger has been pretty prescient lately and I’ve come around to agreeing with many of his conclusions about China.</li></ul><p>It’s even more amusing to see how they cling to their assumptions even as they cite the evidence against them. But in fairness, once formed, assumptions are hard to recognize, let alone break. As for “the disdain people in the dissident right” harbor for me, well, the dissident right is welcome to join the very long line. Pretty much every group from CAIR and the ADL and SFWA and ComicsGate and Tor Books and Thomas Nelson and the Sad Puppies and the conservative media and the Red Cross and the Google executives and the Swiss media share that disdain. Boo-freaking-hoo.</p><p>None of them need me and I certainly don’t need them. All that matters is that everyone who attempts to shape, spin, and shade the truth will be exposed by the harsh light of reality in the end, myself included.</p><p><strong>UPDATE: </strong>It’s been pointed out to me that the Z-man has been pulling this gatekeeping stuff <a href=\"http://thezman.com/wordpress/?p=5746\">for a LONG time</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Steve Sailer has been having a lot of fun with the cooing over Raj Chetty’s big project, pointing out the many methodological flaws. In John Derbyshire’s latest transmission from the bunker, he introduces us to a new term that describes what Sailer has been discussing. It is called “Magic Dirt Theory.” The dirt in places like Utah where children do very well possess special qualities that are lacking in the dirt of places where children do poorly. Magic Dirt Theory is what’s behind the push to export troublesome populations out to the suburbs.</p><cite>Practical Magic, The Z-Blog, 1 November 2015</cite></blockquote><p><strong>NB: </strong><em>Observant minds will note my error in the last sentence of the quoted passage. I should not have used the term “nation”, but rather “polity” or “society”. It is the US <span style=\"text-decoration: underline;\">polity</span> that has been transformed while the American <span style=\"text-decoration: underline;\">nation</span> has been suppressed.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/3e593ee5-31ad-43b3-85f7-6931cd329354\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just as they’ve recently done with Christian Nationalism, the gatekeepers of the Right are beginning to discover that\nimmigration affects IQ\n, and consequently, the shape of society.\nThe flow of people from the south into America is having a clear impact on IQ. The claim is that the people coming in will get smarter by standing on the better dirt in the United States, but it will take four or five generations for that to happen. That is roughly a century. While that is happening, the population of low IQ people rises. This is happening rather quickly due to the age distribution of the white population.\nFor example, using government data, whites have an average IQ of 100, blacks are at 85 and the new people are around 90. This is consistent with what Richwine found in his research and what subsequent research has shown. This is one of those times when the official government position mirrors reality. That means that the average IQ in the United States in 1950 was around 98. By 1980, with the uptick in immigration and decline in white fertility, the average was just over 97.\nIn other words, with very stable demographics and little immigration, the average IQ in the United States had not changed very much in thirty years. This would explain why the country was able to pull out of the cultural lunacy of the prior decades and turn things around so quickly. There were a lot of smart people. Societies with high average intelligence also have a much larger number of smart people. These are the people who solve the problems made by other smart people.\nBy 2000, the effects of immigration were showing up in the test scores. The average IQ of the country, based on the new demographic mix, was below 97. By 2020 the average had fallen to below 96. In another decade it will fall below 95 and when the white population is a minority, it will be around 93.\nThe Great Dimming\n, The Z Blog, 20 September 2022\nNow, you might wonder about the strange reference to “the better dirt in the United States”. Or, perhaps, the way in which it appears to avoid the use of the more common term “the Magic Dirt” as well as any reference to the specific individual who has been pointing this out for some time. Consider the following passage from a book published seven years ago.\nWithout question the worst effect caused by 50 years of failure, and the one most likely to have the most severe long-term consequences, is the negative effect immigration has had on the collective national intelligence. Researchers around the world have observed that the nations of the West have been gradually becoming less intelligent; the Danish military measured a 1.5 point decline in the average IQ of its soldiers between 1998 and 2014, while the average British 14-year-old lost two IQ points from 1980 to 2008. The same is true for the USA, where a three-point average IQ gain that took place after the Melting Pot migration ended has been entirely reversed as a result of immigration from lower-IQ nations.\nBy multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.\nEven the left-wing British paper,\nthe Guardian\n, was recently forced to take note of this phenomenon, as it reported that scientists have determined genes influence academic ability across all subjects, and that as much as 60 percent of the observed differences between various population groups can be explained by genetic factors. So, the mass migration of the last 50 years has been materially dysgenic and has literally made Americans stupider on average. It’s not just you, mass entertainment really has been dumbed down in recent decades in order to appeal to what is an even lower common denominator than before.\nWhatever one thinks of these changes, this is one of the fastest demographic transformations of a nation in recorded human history, and it is the direct result of public policy.\nCUCKSERVATIVE\nby Vox Day and John Red Eagle, 4 December 2015\nWhat I find significant about the Z-man’s post is that even mediocrities who assiduously refuse to mention me except to attempt to minimize my hypothetical influence are now being forced by events to address the issues that I’ve been highlighting for more than 20 years, because the observable reality can no longer be ignored.\nNow, I don’t take the Z-man seriously and neither should you. I stopped reading him regularly once it became clear that he is\na confirmed liar\nwho doesn’t hesitate to try to shape his readers’ opinions despite his complete ignorance of the facts. His gatekeeping role can be seen clearly in the way he follows the lead of the\nDaily Wire\nwith regards to certain unmentionables who must not be mentioned for fear that his readers might become tempted to leave the intellectual corral he has constructed.\nOn that note, it’s rather amusing how, in a discussion of various concepts that will be familiar to you even without being named, most of those involved are less willing than Jordan Peterson to Name the Voldemort.\nThere is a certain blogger who has a very outsized opinion of his intelligence. I used to think he was exaggerating somewhat when he said that we could have diversity or we could have running water. No longer do I think he is exaggerating. Nothing explains the way our world runs and has developed the way IQ does. it is the one element of social science that has been battle-tested and still stands. The liberal intelligentsia spent decades trying to disprove it, innate intelligence, and genetically-derived abilities of a population. It sure seems like their final stab at it was Jared Diamond’s stupid book, but once that failed, they just banned it.\nSaid blogger does tend to be self aggrandizing, but that does not automatically make his conclusions wrong. He has been proven correct, in my opinion, in a number of areas.\nHis main point of hubris was that taxonomy of male archetypes. The taxonomy itself is self-evident even without the greek letters: you’ve got jocks, jocks-in-waiting, nerds, normies, and losers. Then our friend realized he was a nerd so he had to add an extra category of “cool nerd who everybody likes even though he’s a jerk” which only exists in TV shows written by narcissistic nerds like Rick and Morty or House MD.\nThe disdain people in the dissident right have of him is a reflection of some of the flaws of the DR. He is one of the few people making headway in the culture war. They sperg out about his quirks and his comics. Those comics are reaching a lot of people. Like it or not, comic books are a good way to reach young people.\nThat blogger has been pretty prescient lately and I’ve come around to agreeing with many of his conclusions about China.\nIt’s even more amusing to see how they cling to their assumptions even as they cite the evidence against them. But in fairness, once formed, assumptions are hard to recognize, let alone break. As for “the disdain people in the dissident right” harbor for me, well, the dissident right is welcome to join the very long line. Pretty much every group from CAIR and the ADL and SFWA and ComicsGate and Tor Books and Thomas Nelson and the Sad Puppies and the conservative media and the Red Cross and the Google executives and the Swiss media share that disdain. Boo-freaking-hoo.\nNone of them need me and I certainly don’t need them. All that matters is that everyone who attempts to shape, spin, and shade the truth will be exposed by the harsh light of reality in the end, myself included.\nUPDATE:\nIt’s been pointed out to me that the Z-man has been pulling this gatekeeping stuff\nfor a LONG time\n.\nSteve Sailer has been having a lot of fun with the cooing over Raj Chetty’s big project, pointing out the many methodological flaws. In John Derbyshire’s latest transmission from the bunker, he introduces us to a new term that describes what Sailer has been discussing. It is called “Magic Dirt Theory.” The dirt in places like Utah where children do very well possess special qualities that are lacking in the dirt of places where children do poorly. Magic Dirt Theory is what’s behind the push to export troublesome populations out to the suburbs.\nPractical Magic, The Z-Blog, 1 November 2015\nNB:\nObservant minds will note my error in the last sentence of the quoted passage. I should not have used the term “nation”, but rather “polity” or “society”. It is the US\npolity\nthat has been transformed while the American\nnation\nhas been suppressed.\nDISCUSS ON SG",
  "tags": [
    "anklebiters",
    "immigration",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-30T23:03:23+00:00"
}