{
  "url": "https://voxday.net/2022/09/08/a-masterpiece-of-progress/",
  "scraped_at": "2026-01-08T13:30:24.023828",
  "title": "A Masterpiece of Progress",
  "date_display": "September 8, 2022",
  "date_iso": "2022-09-08T10:14:10+00:00",
  "date_from_url": "2022-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Woke Critic explains that <a href=\"https://www.youtube.com/watch?v=9_Zf36uQp8o\">we’ve all got it wrong</a>, that THE RINGS OF POWER are actually better than THE LORD OF THE RINGS, and that it is a defining moment in the history of the world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Every generation there comes along a work of cinema or television that transcends the medium. It is no longer a movie or TV show: it is a work of art. A masterpiece. A production so profound that you wonder if it should be displayed in the galleries at the Louvre.</p><p>That magnificent day has arrived, ladies and gentlemen.</p><p>Amazon’s The Rings of Power is not only a television gift from the gods, it is better than the original cinematic The Lord of the Rings trilogy. Peter Jackson, step aside, and welcome the true heir to the Lord of the Rings throne.</p><p>Here’s why The Rings of Power is a masterpiece.</p><p>The cinemascape of the Peter Jackson trilogy was littered with strong, white males. Frodo and Sam, the ringbearers, entrusted with destroying the one ring ahead of a female, even though they were three feet tall. Aragorn, the king everyone had been waiting for, when a Queen would have sufficed. Gandalf, the magical old white male, in eternal battle with… other magical old white males. The Rings of Power has brought Middle Earth into the 21st Century. No longer is this a world of men. Indeed, it is a world of women. All the main characters have estrogen in abundance.</p><p>Take Galadriel, for instance, a side character in the trilogy. Now she is the driving force through the whole saga. Strong, independent, and utterly brilliant. Where men err, she is right. Always right. Every idea, every solution works. Men who do not follow her lead… lead themselves to the grave. She can cut through oceans like an ocean liner, climb mountains like Sly Stallone and dunk more shots than Michael Jordan.</p><p>Frodo and Sam. No. Now we have Nori Brandyfoot and Poppy Proudfellow. All the same characteristics, quirks and mannerisms as the iconic duo, but now completely female. Why have male characters when we can have female characters? This is 2022, after all. It is much more progressive to have two women in such roles. Like Galadrial, they are never wrong and never weak. A true inspiration for humankind.</p><p>Bronwyn, another female character brutally ignored by the men in the village. Not for long, however. When all the males laugh at her expense, she is the one who has the last laugh. She quickly shows them that she was right about the orcs all along and assumes the leadership role. Another inspiring moment for everyone watching.</p><p>Fear not, dear viewer. There are white male characters. Such as this one. He arrives on the screen in a burning scrapheap and his prospects do not improve much from there. He screams gibberish at young ladies and looks like he just walked out a homeless shelter. A true lesson in progression.</p><p>White males, your time is up. This not a world of men. It is a world of women.</p><p>The Rings of Power is not just a television production, but a message to the world that racism is over. Future generations will look back and say this was the defining moment where everything changed.</p></blockquote><p>It’s hard to argue with that. Impossible, really. Sadly, it appears that most of us are missing this masterpiece of progress, as I took a pair of polls, on both SocialGalactic and Gab, in order to see how many people in the greater community are watching this triump of post-racist consciousness. Now, given that I am arguably one of the top-five living epic fantasy writers – which isn’t that impressive given how few novelists are capable of writing epic-length works – one would expect that my readers would be far more inclined to watch <em>The Rings of Power</em> than the norm. This is especially true given that we have a strong Tolkien contingent that obsessively reads the published notes, visits Hobbit museums, and subscribes to the Forge of Tolkien.</p><ul class=\"wp-block-list\"><li>SG: 237 did not watch, 6 watched, in part or in full</li><li>GAB: 1,339 did not watch, 35 watched in part, 37 watched both episodes.</li></ul><p>This is pretty astonishing for a very high fantasy-friendly crowd. Yes, the polls are unscientific and self-reported, but even so, the numbers are less than one-quarter of what I would have assumed. And it tends to support the Samba.tv numbers that indicate the public rejection of the production is going to be a catastrophe for Amazon Studios. I would not be at all surprised if the second season is cancelled, or if it isn’t, a complete reboot is ordered for Season Three.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0a4a505e-b5f4-4834-bc2a-64fffbe12998\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Woke Critic explains that\nwe’ve all got it wrong\n, that THE RINGS OF POWER are actually better than THE LORD OF THE RINGS, and that it is a defining moment in the history of the world.\nEvery generation there comes along a work of cinema or television that transcends the medium. It is no longer a movie or TV show: it is a work of art. A masterpiece. A production so profound that you wonder if it should be displayed in the galleries at the Louvre.\nThat magnificent day has arrived, ladies and gentlemen.\nAmazon’s The Rings of Power is not only a television gift from the gods, it is better than the original cinematic The Lord of the Rings trilogy. Peter Jackson, step aside, and welcome the true heir to the Lord of the Rings throne.\nHere’s why The Rings of Power is a masterpiece.\nThe cinemascape of the Peter Jackson trilogy was littered with strong, white males. Frodo and Sam, the ringbearers, entrusted with destroying the one ring ahead of a female, even though they were three feet tall. Aragorn, the king everyone had been waiting for, when a Queen would have sufficed. Gandalf, the magical old white male, in eternal battle with… other magical old white males. The Rings of Power has brought Middle Earth into the 21st Century. No longer is this a world of men. Indeed, it is a world of women. All the main characters have estrogen in abundance.\nTake Galadriel, for instance, a side character in the trilogy. Now she is the driving force through the whole saga. Strong, independent, and utterly brilliant. Where men err, she is right. Always right. Every idea, every solution works. Men who do not follow her lead… lead themselves to the grave. She can cut through oceans like an ocean liner, climb mountains like Sly Stallone and dunk more shots than Michael Jordan.\nFrodo and Sam. No. Now we have Nori Brandyfoot and Poppy Proudfellow. All the same characteristics, quirks and mannerisms as the iconic duo, but now completely female. Why have male characters when we can have female characters? This is 2022, after all. It is much more progressive to have two women in such roles. Like Galadrial, they are never wrong and never weak. A true inspiration for humankind.\nBronwyn, another female character brutally ignored by the men in the village. Not for long, however. When all the males laugh at her expense, she is the one who has the last laugh. She quickly shows them that she was right about the orcs all along and assumes the leadership role. Another inspiring moment for everyone watching.\nFear not, dear viewer. There are white male characters. Such as this one. He arrives on the screen in a burning scrapheap and his prospects do not improve much from there. He screams gibberish at young ladies and looks like he just walked out a homeless shelter. A true lesson in progression.\nWhite males, your time is up. This not a world of men. It is a world of women.\nThe Rings of Power is not just a television production, but a message to the world that racism is over. Future generations will look back and say this was the defining moment where everything changed.\nIt’s hard to argue with that. Impossible, really. Sadly, it appears that most of us are missing this masterpiece of progress, as I took a pair of polls, on both SocialGalactic and Gab, in order to see how many people in the greater community are watching this triump of post-racist consciousness. Now, given that I am arguably one of the top-five living epic fantasy writers – which isn’t that impressive given how few novelists are capable of writing epic-length works – one would expect that my readers would be far more inclined to watch\nThe Rings of Power\nthan the norm. This is especially true given that we have a strong Tolkien contingent that obsessively reads the published notes, visits Hobbit museums, and subscribes to the Forge of Tolkien.\nSG: 237 did not watch, 6 watched, in part or in full\nGAB: 1,339 did not watch, 35 watched in part, 37 watched both episodes.\nThis is pretty astonishing for a very high fantasy-friendly crowd. Yes, the polls are unscientific and self-reported, but even so, the numbers are less than one-quarter of what I would have assumed. And it tends to support the Samba.tv numbers that indicate the public rejection of the production is going to be a catastrophe for Amazon Studios. I would not be at all surprised if the second season is cancelled, or if it isn’t, a complete reboot is ordered for Season Three.\nDISCUSS ON SG",
  "tags": [
    "film",
    "Hellmouth",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-08T10:37:31+00:00"
}