{
  "url": "https://voxday.net/2022/09/13/a-second-front/",
  "scraped_at": "2026-01-08T13:30:59.338023",
  "title": "A Second Front",
  "date_display": "September 13, 2022",
  "date_iso": "2022-09-13T01:16:58+00:00",
  "date_from_url": "2022-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although not the one we were anticipating.</p><p><strong>ITEM: </strong>Azerbaijan officially confirms it is systematically striking targets on the sovereign territory of Armenia.</p><p><strong>ITEM: </strong>Armenia is triggering CSTO article to request assistance from Russia amid Azerbaijani attack on the Republic of Armenia.</p><p>Azerbaijan won the <a href=\"https://infogalactic.com/info/2020_Nagorno-Karabakh_war\">2020 Nargorno-Karabakh war</a> and is supported by NATO, so it’s pretty obvious that this is an attempt to increase the pressure on Russia in the aftermath of the recent Ukrainian offensive. However, I doubt more war by proxy is going to impress the Russians, especially when they are already directly targeting Germany with their rhetoric.</p><p><em><a href=\"https://social.infogalactic.com/micropost/21ba2f3c-7f5f-431c-82a7-8f34b5be5070\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Although not the one we were anticipating.\nITEM:\nAzerbaijan officially confirms it is systematically striking targets on the sovereign territory of Armenia.\nITEM:\nArmenia is triggering CSTO article to request assistance from Russia amid Azerbaijani attack on the Republic of Armenia.\nAzerbaijan won the\n2020 Nargorno-Karabakh war\nand is supported by NATO, so it’s pretty obvious that this is an attempt to increase the pressure on Russia in the aftermath of the recent Ukrainian offensive. However, I doubt more war by proxy is going to impress the Russians, especially when they are already directly targeting Germany with their rhetoric.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-13T01:17:01+00:00"
}