{
  "url": "https://voxday.net/2022/09/23/correction-5/",
  "scraped_at": "2026-01-08T13:32:11.747205",
  "title": "Correction",
  "date_display": "September 23, 2022",
  "date_iso": "2022-09-23T10:39:46+00:00",
  "date_from_url": "2022-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger <a href=\"https://www.market-ticker.org/akcs-www?singlepost=3893030\">commented on my post</a> yesterday:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Vox could have emailed me and asked about such a thing as he opined in relationship to what I believe, but he didn’t.</p><p>You see, it fits with a “gotta be this way” pronouncement to not do so.</p><p>It also allows one to hide behind “trust the plan” (of God, if you prefer) which, from my point of view, isn’t much different than those who buy into the “Q” crap.</p><p>‘Nuff said.</p></blockquote><p>Fair enough, I stand corrected. I should not have assumed that Karl was not a religious man, simply because many, if not most, religious people nevertheless do not analyze current events through a religious or spiritual lens. It would have been more accurate to say something like this:</p><p><em>It is very difficult, if not impossible, for those analyzing events from a rational or a materialist perspective to connect the events of today with the pattern of historic manifestations of the same evil that is now ascendant, no matter how well they happen to analyze those events.</em></p><p>Karl’s particular beliefs are not relevant here, which is why I did not ask him about them and why I should not have even mentioned them. But I think my point generally stands, as evidenced by <a href=\"https://www.market-ticker.org/akcs-www?singlepost=3893060\">his subsequent comment</a> about his perspective on current events.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I don’t dislike Vox and do read him from time to time.</p><p>My view of how spirituality has been twisted and abused through the ages both as a foil (“if you do that you’ll go to HELL!”) and a shield behind which one can evade doing what they know damn well is both right AND necessary (“God will judge; its not my place”) however, is well-documented and I’ve said so many times. The latter is especially invidious and, in my opinion, responsible for an unbelievable number of wrongs that various people get away with despite the fact that they did it being common knowledge and that the act deserves punishment also being not only common knowledge but in many cases near-universal consensus.</p><p>You need only look at the current VUMC controversy with them allegedly being involved in cutting off kids dicks and tits, perhaps with both drugs and knives. That predates Covid by quite a lot, yet in point of fact it is no different in fundamental character than their pronouncements vis-a-vis the virus and various public pronouncements surrounding it.</p><p>Risk assessment and personal autonomy be damned; there was money to be made and thus it was. At its core that’s the bottom line and it requires nothing further to see.</p><p>I do have a beef with those who claim that this is some spiritual war between good and evil (e.g. God and Satan, light and dark, pick ’em) and then, having identified the problem as such, refuse to join the battle when they claim to be on the good side.</p><p>Exactly how committed to that viewpoint is said person?</p></blockquote><p>While I share Karl’s outrage and frustration about religious passivity and the refusal of Christians to reject obvious evil and to judge the wicked when it is both necessary and appropriate for them to do so, his response underlines the very point I was attempting to make. There is, absolutely and unquestionably, a monetary angle to the VUMC controversy. That’s valid and it is an important part of the equation. But there is also a very wicked spiritual angle as well; the obsession with homosexuality and transgenderism is ancient and unnatural, and it is an unmistakable sign of a satanic submission to Baphomet on the part of someone influential in that organization. One cannot fully understand the situation, or correctly anticipate the future consequences, unless one factors both the material and the spiritual elements into the analytical model.</p><p>It’s not an accident that the same ghastly evils, homosexuality, transgenderism, pedophilia, and child sacrifice, keep reappearing in the late stages of societies given completely over to more common evils such as lust, sloth, and greed. In the absence of a comprehensive theology of evil, we must make do with recognizing its historical patterns, and one observable pattern is that submission to Mammon in the form of usury and greed tends to precede submission to Asmodeus in the form of conventional lust, eventually followed by submission to Baphomet and Moloch, among others.</p><p>It even provides us with a predictive model; such societies are usually destroyed utterly by other, less corrupt societies that regard them, quite rightly, with horror and revulsion. And certainly that scenario is much easier to envision today than it was even three years ago.</p><p>As for the valid question of how committed one is if one does not join the battle, I would merely observe that we are reliably informed that “our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the spiritual forces of evil in the heavenly realms.”</p><p>When the time comes to take material action, you will know because your conscience will guide you. God will call some to be martyrs, some to be crusaders, and some to be inquisitors. The <em>Pax Christiana</em> of Jesus Christ is enforced with the sword he ordered his followers to buy. The evil will be confronted and the wicked will be defeated. But in the meantime, until the time comes, we must act as witnesses and as fearless speakers for the truth.</p><p>And of all the speakers for the truth today, Karl Denninger is one of the most intrepid. Which is why this is not a criticism of the man, it is merely an expression of my hope that he will see even more clearly, and analyze even more effectively, as the ancient elements of the ongoing conflict continue to come in focus over time.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e9e3b01b-9cf8-4df7-bd91-4fb9797148c7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger\ncommented on my post\nyesterday:\nVox could have emailed me and asked about such a thing as he opined in relationship to what I believe, but he didn’t.\nYou see, it fits with a “gotta be this way” pronouncement to not do so.\nIt also allows one to hide behind “trust the plan” (of God, if you prefer) which, from my point of view, isn’t much different than those who buy into the “Q” crap.\n‘Nuff said.\nFair enough, I stand corrected. I should not have assumed that Karl was not a religious man, simply because many, if not most, religious people nevertheless do not analyze current events through a religious or spiritual lens. It would have been more accurate to say something like this:\nIt is very difficult, if not impossible, for those analyzing events from a rational or a materialist perspective to connect the events of today with the pattern of historic manifestations of the same evil that is now ascendant, no matter how well they happen to analyze those events.\nKarl’s particular beliefs are not relevant here, which is why I did not ask him about them and why I should not have even mentioned them. But I think my point generally stands, as evidenced by\nhis subsequent comment\nabout his perspective on current events.\nI don’t dislike Vox and do read him from time to time.\nMy view of how spirituality has been twisted and abused through the ages both as a foil (“if you do that you’ll go to HELL!”) and a shield behind which one can evade doing what they know damn well is both right AND necessary (“God will judge; its not my place”) however, is well-documented and I’ve said so many times. The latter is especially invidious and, in my opinion, responsible for an unbelievable number of wrongs that various people get away with despite the fact that they did it being common knowledge and that the act deserves punishment also being not only common knowledge but in many cases near-universal consensus.\nYou need only look at the current VUMC controversy with them allegedly being involved in cutting off kids dicks and tits, perhaps with both drugs and knives. That predates Covid by quite a lot, yet in point of fact it is no different in fundamental character than their pronouncements vis-a-vis the virus and various public pronouncements surrounding it.\nRisk assessment and personal autonomy be damned; there was money to be made and thus it was. At its core that’s the bottom line and it requires nothing further to see.\nI do have a beef with those who claim that this is some spiritual war between good and evil (e.g. God and Satan, light and dark, pick ’em) and then, having identified the problem as such, refuse to join the battle when they claim to be on the good side.\nExactly how committed to that viewpoint is said person?\nWhile I share Karl’s outrage and frustration about religious passivity and the refusal of Christians to reject obvious evil and to judge the wicked when it is both necessary and appropriate for them to do so, his response underlines the very point I was attempting to make. There is, absolutely and unquestionably, a monetary angle to the VUMC controversy. That’s valid and it is an important part of the equation. But there is also a very wicked spiritual angle as well; the obsession with homosexuality and transgenderism is ancient and unnatural, and it is an unmistakable sign of a satanic submission to Baphomet on the part of someone influential in that organization. One cannot fully understand the situation, or correctly anticipate the future consequences, unless one factors both the material and the spiritual elements into the analytical model.\nIt’s not an accident that the same ghastly evils, homosexuality, transgenderism, pedophilia, and child sacrifice, keep reappearing in the late stages of societies given completely over to more common evils such as lust, sloth, and greed. In the absence of a comprehensive theology of evil, we must make do with recognizing its historical patterns, and one observable pattern is that submission to Mammon in the form of usury and greed tends to precede submission to Asmodeus in the form of conventional lust, eventually followed by submission to Baphomet and Moloch, among others.\nIt even provides us with a predictive model; such societies are usually destroyed utterly by other, less corrupt societies that regard them, quite rightly, with horror and revulsion. And certainly that scenario is much easier to envision today than it was even three years ago.\nAs for the valid question of how committed one is if one does not join the battle, I would merely observe that we are reliably informed that “our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the spiritual forces of evil in the heavenly realms.”\nWhen the time comes to take material action, you will know because your conscience will guide you. God will call some to be martyrs, some to be crusaders, and some to be inquisitors. The\nPax Christiana\nof Jesus Christ is enforced with the sword he ordered his followers to buy. The evil will be confronted and the wicked will be defeated. But in the meantime, until the time comes, we must act as witnesses and as fearless speakers for the truth.\nAnd of all the speakers for the truth today, Karl Denninger is one of the most intrepid. Which is why this is not a criticism of the man, it is merely an expression of my hope that he will see even more clearly, and analyze even more effectively, as the ancient elements of the ongoing conflict continue to come in focus over time.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-23T12:13:10+00:00"
}