{
  "url": "https://voxday.net/2022/09/27/doug-wilson-is-a-boomer-fraud/",
  "scraped_at": "2026-01-08T13:32:36.250184",
  "title": "Doug Wilson is a Boomer Fraud",
  "date_display": "September 27, 2022",
  "date_iso": "2022-09-27T11:16:33+00:00",
  "date_from_url": "2022-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s nothing but <a href=\"https://dougwils.com/books-and-culture/s7-engaging-the-culture/kin-skin-and-sin.html\">dance, dance, dance and the usual bullshit</a> derived from Galatians 3:28 and Colossians 3:11.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There is no way to defend Western culture (which has been a major aspect of my calling in life), without incurring the charge of racism. This is a standard tactic of the Left. And in my experience, there have been many conservative Christians who would have joined in with this effort earlier if there hadn’t been all these darn kinists out there doing their level best to make the charge seem plausible. So rather than say that kinists were Christian nationalists before it was cool, I would prefer to say that kinists were playing the role of a dog in the manger—not really enjoying their brand of conservatism, and by their fringe behavior preventing others from wanting to join them. Schlebusch is skeptical of our motives, but I can still state them plainly. <em>Conservative Christians aren’t worth a cultural dime if they aren’t routinely accused of being racists, and conservative Christians aren’t worth a cultural dime if the accusation has any merit or substance.</em></p><p>So of course, kinism only starts to look like a responsible option in demented times. You know, I find that I am using the word demented far more often than I used to. But it has to be admitted that kinism can start to look reasonable in comparison to what the commies are doing. This is because the commies despise whiteness far more than the kinists love it.</p><p>But you also have to realize that it only looks like a responsible option in the same way that a Calvin-Klein-hot-couple-in-their-skivvies ad looked back in the eighties, you know, sultry and miserable, when compared with a couple of body positive type models in one of their ads today, in which the probable-girl-unit has a beard, and the guy-unit is probably pregnant. The former ad was certainly sinful and worldly, while the latter is demented. See? There is that word again.</p><p>All of this is to say that the powers that be (with most of them being as white as the back of Elizabeth Warren’s knees) are doing their level best to make it appear like the kinists are the only ones who haven’t taken a complete leave of their senses. So why do I still want to cordon that kinist realm off with yellow caution tape like I do?</p></blockquote><p>Here is how you know Doug Wilson is an inversive snake who has been appointed Gatekeeper for the rising nationalists by Clown World: he’s playing all the usual word games, in this case, by substituting “kinism” for “racism”. While I’m all for necessary neologisms, this construction is not only unnecessary, but it is clearly being utilized for rhetorical rather than dialectical purposes. The term does not clarify anything, but rather, adds to the chaos that cloaks the evil intent of the wicked.</p><p>Not only is Wilson intentionally misapplying the two verses from Galatians and Colossians, not only does he have at least one seriously suspect relationship with a convicted pedophile, not only does he delicately avoid referencing (((certain fellow white people))), and not only does he celebrate what he calls “gospel cosmopolitanism”, but he goes directly against Timothy 5:8 .</p><p><em>But if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.</em></p><p>How is Wilson providing for those of his own house when he aggressively provides cover for those attempting to burn it down? Or when he attacks those who are attempting to put out the fires?</p><p>At the end of the day, Wilson is observably more concerned about his equalitarian Boomer ideals than anything else. He doesn’t hate wickedness or pedophilia or global satanry “with the heat of a thousand suns”, just “ethnic animosity”. OK, Boomer.</p><p>He’s not just a Boomer fraud, he’s an <em>irrelevant </em>Boomer fraud. Getting comfortable in bed with satanists and child molesters is no problem for Wilson, so long as there is no merit or substance to be found in accusing him of defending the right of a people to exist, to live among their own kind in their own way, to speak their own language, and to worship in their own way without being forced to accept the presence or the interference of others.</p><p>As part of the American Indian remnant, I know perfectly well where all of this “anti-racism” was born and where it is heading. But Europeans are the Indians now.</p><ul class=\"wp-block-list\"><li><em><em>“</em>A great general has said that the only good Indian is a dead one, and that high sanction of his destruction has been an enormous factor in promoting Indian massacres. In a sense, I agree with the sentiment, but only in this: that all the Indian there is in the race should be dead. Kill the Indian in him, and save the man.<em>”</em></em> <em>– </em>Col. Richard Henry Pratt, 1892</li><li><em>“Segregating any class or race of people apart from the rest of the people kills the progress of the segregated people or hinders their growth. Association of races and classes is necessary to destroy racism and classism.”</em> – Gen. Richard Henry Pratt, 1902</li></ul><p>The good news is that the fact religious posturers like Wilson feel the need to utilize new rhetorical terms to defend their equalitarian inversions indicates that the rhetorical force of “racism” has been spent. Which means we can probably anticipate a new term to replace “anti-semitism” to appear on the public scene soon.</p><p>The only meaningful perspective by which intellectuals, idealogues, figureheads, and frauds can be judged is how well their words stand up before the clarifying light of the Good, the Beautiful, and the True. Doug Wilson’s “kinism” rhetoric fails all three aspects. He’s little more than a Christian version of Jordan Peterson and Ben Shapiro, and he’s intended to serve the same purpose of corralling conservatives and keeping them away from the genuine Christian nationalism that will never submit to global satanry and its Babelism.</p><p>In summary, Doug Wilson is offering a false imitation of nationalism in much the same way Jordan Peterson offered a false imitation of Christianity.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7c3d391c-eedb-4a96-b95c-caa65427a966\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s nothing but\ndance, dance, dance and the usual bullshit\nderived from Galatians 3:28 and Colossians 3:11.\nThere is no way to defend Western culture (which has been a major aspect of my calling in life), without incurring the charge of racism. This is a standard tactic of the Left. And in my experience, there have been many conservative Christians who would have joined in with this effort earlier if there hadn’t been all these darn kinists out there doing their level best to make the charge seem plausible. So rather than say that kinists were Christian nationalists before it was cool, I would prefer to say that kinists were playing the role of a dog in the manger—not really enjoying their brand of conservatism, and by their fringe behavior preventing others from wanting to join them. Schlebusch is skeptical of our motives, but I can still state them plainly.\nConservative Christians aren’t worth a cultural dime if they aren’t routinely accused of being racists, and conservative Christians aren’t worth a cultural dime if the accusation has any merit or substance.\nSo of course, kinism only starts to look like a responsible option in demented times. You know, I find that I am using the word demented far more often than I used to. But it has to be admitted that kinism can start to look reasonable in comparison to what the commies are doing. This is because the commies despise whiteness far more than the kinists love it.\nBut you also have to realize that it only looks like a responsible option in the same way that a Calvin-Klein-hot-couple-in-their-skivvies ad looked back in the eighties, you know, sultry and miserable, when compared with a couple of body positive type models in one of their ads today, in which the probable-girl-unit has a beard, and the guy-unit is probably pregnant. The former ad was certainly sinful and worldly, while the latter is demented. See? There is that word again.\nAll of this is to say that the powers that be (with most of them being as white as the back of Elizabeth Warren’s knees) are doing their level best to make it appear like the kinists are the only ones who haven’t taken a complete leave of their senses. So why do I still want to cordon that kinist realm off with yellow caution tape like I do?\nHere is how you know Doug Wilson is an inversive snake who has been appointed Gatekeeper for the rising nationalists by Clown World: he’s playing all the usual word games, in this case, by substituting “kinism” for “racism”. While I’m all for necessary neologisms, this construction is not only unnecessary, but it is clearly being utilized for rhetorical rather than dialectical purposes. The term does not clarify anything, but rather, adds to the chaos that cloaks the evil intent of the wicked.\nNot only is Wilson intentionally misapplying the two verses from Galatians and Colossians, not only does he have at least one seriously suspect relationship with a convicted pedophile, not only does he delicately avoid referencing (((certain fellow white people))), and not only does he celebrate what he calls “gospel cosmopolitanism”, but he goes directly against Timothy 5:8 .\nBut if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.\nHow is Wilson providing for those of his own house when he aggressively provides cover for those attempting to burn it down? Or when he attacks those who are attempting to put out the fires?\nAt the end of the day, Wilson is observably more concerned about his equalitarian Boomer ideals than anything else. He doesn’t hate wickedness or pedophilia or global satanry “with the heat of a thousand suns”, just “ethnic animosity”. OK, Boomer.\nHe’s not just a Boomer fraud, he’s an\nirrelevant\nBoomer fraud. Getting comfortable in bed with satanists and child molesters is no problem for Wilson, so long as there is no merit or substance to be found in accusing him of defending the right of a people to exist, to live among their own kind in their own way, to speak their own language, and to worship in their own way without being forced to accept the presence or the interference of others.\nAs part of the American Indian remnant, I know perfectly well where all of this “anti-racism” was born and where it is heading. But Europeans are the Indians now.\n“\nA great general has said that the only good Indian is a dead one, and that high sanction of his destruction has been an enormous factor in promoting Indian massacres. In a sense, I agree with the sentiment, but only in this: that all the Indian there is in the race should be dead. Kill the Indian in him, and save the man.\n”\n–\nCol. Richard Henry Pratt, 1892\n“Segregating any class or race of people apart from the rest of the people kills the progress of the segregated people or hinders their growth. Association of races and classes is necessary to destroy racism and classism.”\n– Gen. Richard Henry Pratt, 1902\nThe good news is that the fact religious posturers like Wilson feel the need to utilize new rhetorical terms to defend their equalitarian inversions indicates that the rhetorical force of “racism” has been spent. Which means we can probably anticipate a new term to replace “anti-semitism” to appear on the public scene soon.\nThe only meaningful perspective by which intellectuals, idealogues, figureheads, and frauds can be judged is how well their words stand up before the clarifying light of the Good, the Beautiful, and the True. Doug Wilson’s “kinism” rhetoric fails all three aspects. He’s little more than a Christian version of Jordan Peterson and Ben Shapiro, and he’s intended to serve the same purpose of corralling conservatives and keeping them away from the genuine Christian nationalism that will never submit to global satanry and its Babelism.\nIn summary, Doug Wilson is offering a false imitation of nationalism in much the same way Jordan Peterson offered a false imitation of Christianity.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-27T15:35:27+00:00"
}