{
  "url": "https://voxday.net/2022/09/18/i-suspect-theyre-dragging-their-feet/",
  "scraped_at": "2026-01-08T13:31:37.800525",
  "title": "I Suspect They’re Dragging Their Feet",
  "date_display": "September 18, 2022",
  "date_iso": "2022-09-18T13:35:56+00:00",
  "date_from_url": "2022-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it’s going to take a lot longer <a href=\"https://www.rt.com/news/563037-germany-agrees-provide-ukraine-howitzers/\">than 30 months</a> once the power goes out:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Germany has agreed to provide 18 self-propelled RCH-155 howitzers to Ukraine, on top of the heavy weaponry that Berlin has already pledged to hand over, <em>Die Welt </em>has claimed. However, the first shipment is at least 30 months away, the outlet reported Saturday, citing the manufacturer.</p></blockquote><p>In 30 months, it’s entirely possible that neither Ukraine nor the EU will exist. And I’m not the only one who is skeptical that <a href=\"https://www.rt.com/news/563047-orban-ukraine-eu-sanctions/\">the EU can survive being used</a> by the US neocons to fight an economic proxy war for them.</p><p>Orban again lashed out at EU sanctions imposed on Russia over its military operation in Ukraine, saying the bloc had shot itself in the foot with those curbs. The energy crisis, which occurred as a result of those restrictions, could force 40% of European industry to shut down this winter, he reportedly added.</p><p>In his speech, the Hungarian leader also allegedly revealed that European leaders are expected to decide on prolonging the sanctions for another six months later in autumn, insisting that an attempt should be made to prevent that extension.</p><p>The way things are going now, the eurozone and the EU itself could cease to exist by 2030, Orban was quoted as saying.</p><p><em><a href=\"https://social.infogalactic.com/micropost/df098e47-8b2a-42fe-a514-d8b864c3e376\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And it’s going to take a lot longer\nthan 30 months\nonce the power goes out:\nGermany has agreed to provide 18 self-propelled RCH-155 howitzers to Ukraine, on top of the heavy weaponry that Berlin has already pledged to hand over,\nDie Welt\nhas claimed. However, the first shipment is at least 30 months away, the outlet reported Saturday, citing the manufacturer.\nIn 30 months, it’s entirely possible that neither Ukraine nor the EU will exist. And I’m not the only one who is skeptical that\nthe EU can survive being used\nby the US neocons to fight an economic proxy war for them.\nOrban again lashed out at EU sanctions imposed on Russia over its military operation in Ukraine, saying the bloc had shot itself in the foot with those curbs. The energy crisis, which occurred as a result of those restrictions, could force 40% of European industry to shut down this winter, he reportedly added.\nIn his speech, the Hungarian leader also allegedly revealed that European leaders are expected to decide on prolonging the sanctions for another six months later in autumn, insisting that an attempt should be made to prevent that extension.\nThe way things are going now, the eurozone and the EU itself could cease to exist by 2030, Orban was quoted as saying.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-18T15:13:29+00:00"
}