{
  "url": "https://voxday.net/2022/09/28/suspect-identified/",
  "scraped_at": "2026-01-08T13:32:41.753374",
  "title": "Suspect Identified",
  "date_display": "September 28, 2022",
  "date_iso": "2022-09-28T10:02:33+00:00",
  "date_from_url": "2022-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that the Russians not only know that the USA sabotaged the two natural gas pipelines to Germany, but they know <a href=\"https://twitter.com/AZmilitary1/status/1574758898086694912\">which US Navy ship was responsible</a> and how the attack was carried out.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>An expeditionary detachment of US Navy ships led by the universal amphibious assault ship USS <em>Kearsarge </em>days ago was in the Baltic Sea. It was 30 km from the site of the alleged sabotage on the Nord Stream-1 gas pipeline and 50 km from the threads of Nord Stream-2 gas pipeline.</p><p>On September 2, interesting maneuvers performed by an American helicopter with the call sign FFAB123. Then it was assumed that this board was from the USS <em>Kearsarge </em>air wing, and today more details were looked. According to the website http://ads-b.nl , this call sign was used by 6 boards that day, of which we managed to establish the side numbers of three. All of them are Sikorsky MH-60S.</p><p>By superimposing the FFAB123 route on the scheme of yesterday’s accident, we get a rather interesting result — the helicopter either flew along the Nord Stream-2 highway, or even between the points where the accident occurred.</p><p>And finally, we need to pay attention to <a href=\"https://seapowermagazine.org/baltops-22-a-perfect-opportunity-for-research-and-resting-new-technology/\">the June article in <em>Sea Power</em></a>, where the Americans brag about experiments in the field of underwater drones, which they put on exercises BALTOPS 22 — just in the area of the island of Bronholm. And YES,there was US military training there</p></blockquote><p>Meanwhile, the Baltic Pipe project is going live, shipping natural gas from Denmark to Poland, and will be running at full capacity at the end of November.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On Saturday, September 24, 2022, Energinet notified the gas market that the Baltic Pipe gas pipeline can be commissioned at full capacity from the end of November 2022, a little more than one month before planned. Energinet planned to commission Baltic Pipe with partial capacity from October 1, 2022, and with full capacity of up to 10 billion cubic metres of gas annually from January 1, 2023.</p></blockquote><p>The most logical explanation for the Nord Stream attacks is that the US Navy destroyed the pipeline in order to prevent Germany from surrendering to Russia, and making it dependent on Poland instead. And since all four referendums went Russia’s way, it would appear that we’ll find out what Russia’s response is within the next 3-4 weeks.</p><p><strong>UPDATE:</strong> Some Eastern European countries are clearly expecting conflict in the near future.</p><p><em>Poland and Bulgaria’s foreign ministries are recommending all of their citizens leave Russia by any means possible.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/68b55401-6537-46a5-afda-3cce6e5a3d3f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It appears that the Russians not only know that the USA sabotaged the two natural gas pipelines to Germany, but they know\nwhich US Navy ship was responsible\nand how the attack was carried out.\nAn expeditionary detachment of US Navy ships led by the universal amphibious assault ship USS\nKearsarge\ndays ago was in the Baltic Sea. It was 30 km from the site of the alleged sabotage on the Nord Stream-1 gas pipeline and 50 km from the threads of Nord Stream-2 gas pipeline.\nOn September 2, interesting maneuvers performed by an American helicopter with the call sign FFAB123. Then it was assumed that this board was from the USS\nKearsarge\nair wing, and today more details were looked. According to the website http://ads-b.nl , this call sign was used by 6 boards that day, of which we managed to establish the side numbers of three. All of them are Sikorsky MH-60S.\nBy superimposing the FFAB123 route on the scheme of yesterday’s accident, we get a rather interesting result — the helicopter either flew along the Nord Stream-2 highway, or even between the points where the accident occurred.\nAnd finally, we need to pay attention to\nthe June article in\nSea Power\n, where the Americans brag about experiments in the field of underwater drones, which they put on exercises BALTOPS 22 — just in the area of the island of Bronholm. And YES,there was US military training there\nMeanwhile, the Baltic Pipe project is going live, shipping natural gas from Denmark to Poland, and will be running at full capacity at the end of November.\nOn Saturday, September 24, 2022, Energinet notified the gas market that the Baltic Pipe gas pipeline can be commissioned at full capacity from the end of November 2022, a little more than one month before planned. Energinet planned to commission Baltic Pipe with partial capacity from October 1, 2022, and with full capacity of up to 10 billion cubic metres of gas annually from January 1, 2023.\nThe most logical explanation for the Nord Stream attacks is that the US Navy destroyed the pipeline in order to prevent Germany from surrendering to Russia, and making it dependent on Poland instead. And since all four referendums went Russia’s way, it would appear that we’ll find out what Russia’s response is within the next 3-4 weeks.\nUPDATE:\nSome Eastern European countries are clearly expecting conflict in the near future.\nPoland and Bulgaria’s foreign ministries are recommending all of their citizens leave Russia by any means possible.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-28T12:56:42+00:00"
}