{
  "url": "https://voxday.net/2022/09/06/the-globalists-have-lost-control/",
  "scraped_at": "2026-01-08T13:30:09.252958",
  "title": "The Globalists Have Lost Control",
  "date_display": "September 6, 2022",
  "date_iso": "2022-09-06T09:59:04+00:00",
  "date_from_url": "2022-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And they know it, as demonstrated by <a href=\"https://www.eugyppius.com/p/the-terrifying-vacuity-of-klaus-schwab\">a review of Klaus Schwab’s book</a>, <em>The Great Reset</em>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>The Great Reset</em> is not a book that begins with a fully-formed argument, which it seeks to articulate through successive proofs. Nor is it a book that finds its purpose along the way. It is of that still more miserable variety, that is always on the verge of discovering what it means to say, but can never quite get there. I have a vision of Schwab in his study, typing furiously with extended index fingers like a bicephalic chicken, marshalling all his meagre powers to reconstruct the very unexpected pandemic in which he found himself, such that it might better resemble the kind of global ESG stakeholder capitalism woo crisis that Schwab would really prefer to pronounce upon. “We must get back to my pet themes” is what Schwab is trying to tell us in <em>The Great Reset</em>. It is above all a childish book…</p><p>An interesting point is how much pessimism Schwab harbours about the future prospects of globalisation. He writes that “hyperglobalization” (whatever that is) “has lost all its political and social capital and defending it is no longer politically tenable” (p. 112f.), and that even normal globalisation is in decline. Thus politicians must strive “to manage” its “retreat” by making it “more inclusive and equitable,” as well as “sustainable, both socially and environmentally” (p. 112). These are curious admissions, and if you take them at face value, you’d begin to think that the Davos set really do feel under threat, especially from the left, and no small part of their political programme represents some kind of confused effort to appease imagined opponents.</p><p>Schwab writes that the pandemic happened because of “a vacuum in global governance” and because “international cooperation was non-existent or limited” (p. 115). He reveals a real childish yearning for “global governance” (p. 118), lest we end up “in a world in which nobody is in charge” (p. 114). The undercurrent of fear returns, and the pandemic recedes from view as a mere example of the kinds of disasters that will befall us if the globalist institutions fail:</p><p><em>There is no time to waste. If we do not improve the functioning and legitimacy of our global institutions, the world will soon become unmanageable and very dangerous. There cannot be a lasting recovery without a global strategic framework of governance… The more nationalism and isolationism pervade the global polity, the greater the chance that global governance loses its relevance. </em>(p. 113)</p></blockquote><p>Kissinger, being rather smarter than Schwab, recognized the historical trend years ago. But the vacuity of Schwab and his anti-intellectual cohorts should not be terrifying. Because it’s now manifestly obvious that one has to be more than a little vacuous in order to cling to the retarded idea that centralization and globalization is going to make anything better for the human race.</p><p>The globalists have nothing going for them except inertia, credit money, and influence. And history clearly demonstrates that such things will not be sufficient for them to withstand the rising power, both material and intellectual, of the nations.</p><p><em><a href=\"https://social.infogalactic.com/micropost/62e8e4db-a47a-4f0b-bdc8-a37a853d4a14\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And they know it, as demonstrated by\na review of Klaus Schwab’s book\n,\nThe Great Reset\n:\nThe Great Reset\nis not a book that begins with a fully-formed argument, which it seeks to articulate through successive proofs. Nor is it a book that finds its purpose along the way. It is of that still more miserable variety, that is always on the verge of discovering what it means to say, but can never quite get there. I have a vision of Schwab in his study, typing furiously with extended index fingers like a bicephalic chicken, marshalling all his meagre powers to reconstruct the very unexpected pandemic in which he found himself, such that it might better resemble the kind of global ESG stakeholder capitalism woo crisis that Schwab would really prefer to pronounce upon. “We must get back to my pet themes” is what Schwab is trying to tell us in\nThe Great Reset\n. It is above all a childish book…\nAn interesting point is how much pessimism Schwab harbours about the future prospects of globalisation. He writes that “hyperglobalization” (whatever that is) “has lost all its political and social capital and defending it is no longer politically tenable” (p. 112f.), and that even normal globalisation is in decline. Thus politicians must strive “to manage” its “retreat” by making it “more inclusive and equitable,” as well as “sustainable, both socially and environmentally” (p. 112). These are curious admissions, and if you take them at face value, you’d begin to think that the Davos set really do feel under threat, especially from the left, and no small part of their political programme represents some kind of confused effort to appease imagined opponents.\nSchwab writes that the pandemic happened because of “a vacuum in global governance” and because “international cooperation was non-existent or limited” (p. 115). He reveals a real childish yearning for “global governance” (p. 118), lest we end up “in a world in which nobody is in charge” (p. 114). The undercurrent of fear returns, and the pandemic recedes from view as a mere example of the kinds of disasters that will befall us if the globalist institutions fail:\nThere is no time to waste. If we do not improve the functioning and legitimacy of our global institutions, the world will soon become unmanageable and very dangerous. There cannot be a lasting recovery without a global strategic framework of governance… The more nationalism and isolationism pervade the global polity, the greater the chance that global governance loses its relevance.\n(p. 113)\nKissinger, being rather smarter than Schwab, recognized the historical trend years ago. But the vacuity of Schwab and his anti-intellectual cohorts should not be terrifying. Because it’s now manifestly obvious that one has to be more than a little vacuous in order to cling to the retarded idea that centralization and globalization is going to make anything better for the human race.\nThe globalists have nothing going for them except inertia, credit money, and influence. And history clearly demonstrates that such things will not be sufficient for them to withstand the rising power, both material and intellectual, of the nations.\nDISCUSS ON SG",
  "tags": [
    "Book Review",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-06T09:59:06+00:00"
}