{
  "url": "https://voxday.net/2022/09/27/the-us-shuts-off-europes-lights/",
  "scraped_at": "2026-01-08T13:32:34.385938",
  "title": "The US Shuts Off Europe’s Lights",
  "date_display": "September 27, 2022",
  "date_iso": "2022-09-27T09:28:57+00:00",
  "date_from_url": "2022-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Less than 24 hours after Nord Stream 2 abruptly went down, Nord Stream 1 <a href=\"https://www.eugyppius.com/p/apparent-sabotage-disables-nord-stream?\">has been sabotaged as well</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Yesterday evening, pressure in the undersea Nord Stream 2 pipeline suddenly collapsed, and gas could be seen bubbling to the surface of the Baltic Sea near the Danish island of Bornholm. Shortly afterwards, reports came of a total collapse in the pressure of our other major undersea pipeline connection to Russia, Nord Stream 1, indicating a further rupture.</p><p><strong>Government officials assume that the damage is intentional, and the result of an attack by foreign forces:</strong></p><p><em>Due to the timing, the fact that three separate pipelines were affected, and the severe pressure losses in Nord Stream 1, officials expect the worst. “We can no longer imagine any scenario other than a targeted attack,” said a person privy to the assessment by the federal government and federal authorities. They added: “Everything speaks against a coincidence.”</em></p><p><em>Such an attack on the seabed would be anything but trivial; it would have to be carried out with special forces – for example, by navy divers or a submarine, people informed of initial assessments said.</em></p><p><em>With regard to responsibility for the alleged attacks, two possibilities are being discussed. First, according to initial speculation, Ukrainian or Ukrainian-affiliated forces could be responsible. With the temporary shutdown of the Nord Stream pipelines, gas deliveries from Russia to Germany and Central Europe would only be possible via the Yamal pipelinje running through Poland or the Ukrainian pipeline network.</em></p><p>The piece that I’ve bolded is of course a lightly disguised reference to the United States or NATO. This should surprise nobody: President Biden said in early February that in the event of a Russian invasion of Ukraine, “there will be no longer a Nord Stream 2, we will bring an end to it.”</p></blockquote><p>These are clear and obvious acts of war, not only against Russia, but against Western Europe as well. And not only is the Unidentified State Actor the primary suspect, with the means and the motivation to destroy the pipelines, but the Commander-in-Chief of the US military <a href=\"https://twitter.com/abc/status/1490792461979078662?s=46&amp;t=kJAzCn_j-narPVNJR3kuww\">publicly threatened</a> to do what has apparently now been done.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Biden: “If Russia invades, that means tanks or troops crossing the border of Ukraine, again, then there will be no longer a Nord Stream 2. We will bring an end to it.”</p><p>Reporter: “But how will you do that, exactly, since the project, the control of the project, is in Germany’s control?”</p><p>Biden: “We will. I promise you, we will be able to do that.”</p><cite>ABC News, 7 February 2022</cite></blockquote><p>Gonzalo Lira is absolutely right. This is the modern equivalent of Cortez burning his ships upon arrival in the New World. Occam’s Razor strongly suggests that the global imperialists headquartered in the USA are attempting to prevent the Europeans from surrendering to Russia and thereby freeing themselves from the satanic New World Order.</p><p><em>“Now I realize that the Americans will stop at nothing to destroy all of their allies. Because what’s really happening is that the global American empire is collapsing and they are lashing out in all directions.”</em></p><p>At this point, every nation on Earth would have to be crazy to cooperate with the US government in any way, much less comply with its demands. This destruction of Europe’s energy lifelines underlines the truth of Henry Kissinger’s famous aphorism: <em>“To be an enemy of the US is dangerous, but to be a friend is fatal.”</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/0b151274-57ce-43a2-b4a8-65c37a10e000\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Less than 24 hours after Nord Stream 2 abruptly went down, Nord Stream 1\nhas been sabotaged as well\n.\nYesterday evening, pressure in the undersea Nord Stream 2 pipeline suddenly collapsed, and gas could be seen bubbling to the surface of the Baltic Sea near the Danish island of Bornholm. Shortly afterwards, reports came of a total collapse in the pressure of our other major undersea pipeline connection to Russia, Nord Stream 1, indicating a further rupture.\nGovernment officials assume that the damage is intentional, and the result of an attack by foreign forces:\nDue to the timing, the fact that three separate pipelines were affected, and the severe pressure losses in Nord Stream 1, officials expect the worst. “We can no longer imagine any scenario other than a targeted attack,” said a person privy to the assessment by the federal government and federal authorities. They added: “Everything speaks against a coincidence.”\nSuch an attack on the seabed would be anything but trivial; it would have to be carried out with special forces – for example, by navy divers or a submarine, people informed of initial assessments said.\nWith regard to responsibility for the alleged attacks, two possibilities are being discussed. First, according to initial speculation, Ukrainian or Ukrainian-affiliated forces could be responsible. With the temporary shutdown of the Nord Stream pipelines, gas deliveries from Russia to Germany and Central Europe would only be possible via the Yamal pipelinje running through Poland or the Ukrainian pipeline network.\nThe piece that I’ve bolded is of course a lightly disguised reference to the United States or NATO. This should surprise nobody: President Biden said in early February that in the event of a Russian invasion of Ukraine, “there will be no longer a Nord Stream 2, we will bring an end to it.”\nThese are clear and obvious acts of war, not only against Russia, but against Western Europe as well. And not only is the Unidentified State Actor the primary suspect, with the means and the motivation to destroy the pipelines, but the Commander-in-Chief of the US military\npublicly threatened\nto do what has apparently now been done.\nBiden: “If Russia invades, that means tanks or troops crossing the border of Ukraine, again, then there will be no longer a Nord Stream 2. We will bring an end to it.”\nReporter: “But how will you do that, exactly, since the project, the control of the project, is in Germany’s control?”\nBiden: “We will. I promise you, we will be able to do that.”\nABC News, 7 February 2022\nGonzalo Lira is absolutely right. This is the modern equivalent of Cortez burning his ships upon arrival in the New World. Occam’s Razor strongly suggests that the global imperialists headquartered in the USA are attempting to prevent the Europeans from surrendering to Russia and thereby freeing themselves from the satanic New World Order.\n“Now I realize that the Americans will stop at nothing to destroy all of their allies. Because what’s really happening is that the global American empire is collapsing and they are lashing out in all directions.”\nAt this point, every nation on Earth would have to be crazy to cooperate with the US government in any way, much less comply with its demands. This destruction of Europe’s energy lifelines underlines the truth of Henry Kissinger’s famous aphorism:\n“To be an enemy of the US is dangerous, but to be a friend is fatal.”\nDISCUSS ON SG",
  "tags": [
    "globalism",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-27T11:21:38+00:00"
}