{
  "url": "https://voxday.net/2016/09/10/alt-white-and-alt-wes/",
  "scraped_at": "2025-12-18T01:53:36.433076",
  "title": "Alt-White and Alt-West",
  "date_display": "September 10, 2016",
  "date_iso": "2016-09-10T10:17:00+00:00",
  "date_from_url": "2016-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the chief pieces of evidence concerning the fact that #GamerGate was a primarily left-wing group is the way in which many of the supporters of the #AltRight are observably ignorant of the basic tenets of the most successful anti-SJW, anti-media action since the cultural war began. Every group and every movement has its tone and purity police, and usually, their activities are totally counterproductive. Consider <a href=\"https://www.reddit.com/r/KotakuInAction/comments/3kohb8/opinion_discussion_political_correctness_and/\">this observation</a> from the central rallying point of the GamerGate left, KotakuInAction:</p><blockquote class=\"tr_bq\"><p> I’m finding it hard to believe this needs to be said, but since it appears that Mark Kern (AKA Grummz) got mobbed, from within GG, by tone-policing PC assholes who took umbrage with him referring to Nyberg as “he” instead of “she”, to the point that he decided to quit GG, losing us a valuable ally and supporter, it would seem that this indeed needs to be said: <b>Political correctness and tone-policing have no place in GamerGate.</b></p></blockquote><p>Now, this doesn’t mean that entryism is not a serious potential problem or that there are those individuals who are best kept at arms-length, or further, for one reason or another. But in general, the tone and purity police are a much bigger problem in the early stages.</p><p>Therefore, in the interest of educating those interested in learning the tactics of those who have successfully used them in the past, it may be useful to read this document, which was widely accepted throughout GamerGate and helps explain how we successfully addressed the problem.</p><blockquote><div style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> All of the following are counterproductive and damage ourselves ONLY:</div><div style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> <strong style=\"box-sizing: border-box;\">No objectives, no goals, no demands, no philosophies, no lists.</strong></div><ul style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 18.59px; list-style-position: outside; margin: 10px 2em; padding: 0px;\"><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> It screws up the framing of the issue by forcing us to focus on specific issues.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> The corrupt journos will adhere to the letter of the list and not the spirit. They will find a way to weasel around them.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> The second nobody is looking, they’ll go back to being dishonest.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> This idea was put forth by a well-meaning PR person, not someone experienced in consumer activity. PR is the journo’s game. Not ours.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> It divides us into the goals we each specifically want and we don’t all want the same things. What appeases you will not appease another etc.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Demands are things that terrorists make. We are a consumer revolt. We are not violent. We are not underhanded. We are not a political movement.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Philosophies are for philosophers, not consumer revolts. We don’t need philosophy to obtain the moral high ground, the opposition has already given it to us. We have no benefit in philosophies.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Goals are for games, not a consumer revolt.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Objectives are for military operations, not a consumer revolt.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Lists are for nerds.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> It is true that it may increase our numbers (in an absolute sense, but we’re still divided over the goals) because people have specific things to champion. However, this will bring us fence-sitters and those of weak will and not people that will do the work of writing emails and investigation of corruption. If they aren’t invested on the merits, they aren’t invested and thus are not helpful.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We do not need clear end points. If people are discouraged by a perceived lack of progress, take a break. This is an extended and long-term approach and you must take breaks. If you need specific goals for yourself, participate 2 or 3 days a week. Phrase it in those terms. Creating goals is not necessary.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> It does not help people get into this. What does help people get into this is a more coherent and concise set of facts that they can evaluate and come to their own conclusions.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Numbers are not an argument. Facts create numbers. Numbers don’t necessarily create facts.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Phrasing these goals incorrectly will put them as lines in the sand. We cannot change them once they’re satisfied. We cannot move goalposts like they do.</div></li></ul><div style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> <strong style=\"box-sizing: border-box;\">No narrative changing.</strong></div><ul style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 18.59px; list-style-position: outside; margin: 10px 2em; padding: 0px;\"><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> As we are a consumer revolt and not a political movement, we do not need a narrative.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Narratives are for PR. PR is the journo’s game. Not ours.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We let the opposition change the narrative for themselves as they’ve done time and again for the last month.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We will go as far politically as we must (as we’ve been forced to do so far), but have no inherent desire to do so.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> If a person is energized by narrative, they are in the wrong place. Narratives change and we would lose them when it changes anyway. Additionally, it’s unlikely that people that aren’t participating on the merits will do the requisite work involved.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We are about facts, logic, and reason. A narrative is a way of spinning these. We have no spin. Only truth.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We are actually inclusive and this has been demonstrated already. There is no need to push this or any message.</div></li></ul><div style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> <strong style=\"box-sizing: border-box;\">No leaders.</strong></div><ul style=\"background-color: #eeeeee; box-sizing: border-box; color: #333333; font-family: Roboto, Arial, sans-serif; font-size: 13px; line-height: 18.59px; list-style-position: outside; margin: 10px 2em; padding: 0px;\"><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> This is a 100% shill idea put forward by the opposition to make it easy to play the identity game. This is their bread and butter and they will co-opt or ruin anything that they can get their hands on.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> We’ve lasted for a month and counting with no real dictators. We should continue this trend.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> There are currently no weak points to attack.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> As attacks against individuals intensify (people have lost jobs, been sent mafia-esque messages in the mail, and have been severely harassed for being involved), it’s clear that giving them heads that are more important than others is a bad idea.</div></li><li style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><div style=\"box-sizing: border-box; line-height: 19.5px; margin-bottom: 7px; margin-top: 7px; padding: 0px;\"> Even discussing who you would pick implies some kind of extra importance. We do not want this. We’re all in this together.</div></li></ul><ul></ul><p> This is a section of a longer document, and was conceived as a comprehensive rebuttal to help GamerGaters address a specific type of shill known as The Changer. Other shills to watch out for included The Fear Monger, The Defeatist, The Dismissive, The False Flag, The Politico, The Discreditor, The Misdirector, The Uncertain, The Slider, and The Self-Shiller; the longer document recommended specific responses to deal with each of them. It may strike you as paranoid, but I personally witnessed multiple shills of each of these types, as SJWs repeatedly tried to infiltrate and redirect what, despite outsiders’ best efforts to categorize it as a hate group, a terrorist group, and a Twitter-based charade, remained a consumer revolt focused tightly on the corrupt games media.</p></blockquote><p>Now, obviously not all of these lessons are applicable to the #AltRight, because the #AltRight is a political movement, not a consumer revolt, it is positive and prescriptive in nature as opposed to being intrinsically defensive like #GamerGate, and it is addressing a very wide range of societal and historical issues instead of being obsessively focused on a single issue and industry at a specific point in time.</p><p>Nevertheless, it is clear that there is an intrinsic tension within the Alt-Right, which is not necessarily a bad thing. On the one side is the Alt-White, which is pure white nationalist and predominantly pagan or atheist. This could be thought of as the NPI or Spencerian Alt-Right. On the other is the Alt-West, which is omni-nationalist and pro-Christian. I suspect Jared Taylor and RamZPaul are more of this persuasion, but I could be wrong. Regardless, it is the branch in which I would place myself. All of the <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">16 Points of the Alt-Right</a> with which even Richard Spencer himself only has a few quibbles, can reasonably be considered an Alt-West perspective.</p><p>But perhaps rather than thinking of them as branches, it is more helpful to think of them as roots, each being sustained by different pools, supporting the same glorious tree of Western Civilization. Because it is vital to understand that for the Alt-Right to be successful over time, Alt-White and Alt-West must continue to cooperate, refrain from internecine conflict, and continue to stand by each other in the face of the coming media assaults in the same way that GamerGate/KiA and GamerGate/chan did. (And believe me, the conceptual spectrum of the Alt-Right is CONSIDERABLY more narrow than that of GamerGate. Since they were able to coexist and cooperate, we definitely can.) Any claims to be the One True Strain of the Alt-Right are spurious and should be rejected by all sides, as anyone who subscribes to what Lawrence Murray has laid out as <a href=\"http://www.counter-currents.com/2016/03/the-fight-for-the-alt-right/\">the Alt-Right’s big tent</a> is correctly characterized, at the very least, as an ally of the Alt-Right.</p><p>Besides, as we all know, the only true apotheosis of Pepe is Kek.</p><p>It is worse than a waste of time, it is totally counterproductive to shoot at allies. In GamerGate, we had a simple and straightforward response to the shills, tone police, and self-appointed purity police who repeatedly attempted to redirect our efforts away from the primary target of the game journos: SHUT UP AND EMAIL. I suggest that both branches of the Alt-Right, Alt-White and Alt-West, would do very well to adopt a similar policy, especially as various shills do their best to divide and conquer. We would be foolish to do as the Left does, and spend vast quantities of time and effort seeking out and denouncing splittists, reactionaries, and false consciousnesses.</p><p>SHUT UP AND SHOOT LEFT.</p><p>Remember, it’s all very well to get excited about the fact that the media is paying attention to the Alt-Right, but never forget that the reason they are doing so is in order to discredit, disqualify, and destroy it and everyone who is associated with it. Don’t help them do it. The media game is to anoint and behead leaders, and they will always attempt to redefine you in the process, <a href=\"http://www.thedailybeast.com/articles/2016/09/09/alt-right-leaders-we-aren-t-racist-we-just-hate-jews.html?via=desktop&amp;source=twitter\">as Betsy Woodruff demonstrates</a> at the Daily Beast:</p><blockquote class=\"tr_bq\"><p> So the Alt-Right—helmed by the trio who gathered at The Willard on Friday—is the most extreme example of a shift on the American right: away from a nostalgic conservative focus on restoring the values of the Founders, and towards a forward-focused nationalism that prioritizes drastic limits on immigration and open hostility to globalism.</p></blockquote><p>But if that forward-focused nationalism sounds good to you, then regardless of whether you are more Alt-White or Alt-West, you are at the very least sympathetic to the Alt-Right.</p></div>",
  "content_text": "One of the chief pieces of evidence concerning the fact that #GamerGate was a primarily left-wing group is the way in which many of the supporters of the #AltRight are observably ignorant of the basic tenets of the most successful anti-SJW, anti-media action since the cultural war began. Every group and every movement has its tone and purity police, and usually, their activities are totally counterproductive. Consider\nthis observation\nfrom the central rallying point of the GamerGate left, KotakuInAction:\nI’m finding it hard to believe this needs to be said, but since it appears that Mark Kern (AKA Grummz) got mobbed, from within GG, by tone-policing PC assholes who took umbrage with him referring to Nyberg as “he” instead of “she”, to the point that he decided to quit GG, losing us a valuable ally and supporter, it would seem that this indeed needs to be said:\nPolitical correctness and tone-policing have no place in GamerGate.\nNow, this doesn’t mean that entryism is not a serious potential problem or that there are those individuals who are best kept at arms-length, or further, for one reason or another. But in general, the tone and purity police are a much bigger problem in the early stages.\nTherefore, in the interest of educating those interested in learning the tactics of those who have successfully used them in the past, it may be useful to read this document, which was widely accepted throughout GamerGate and helps explain how we successfully addressed the problem.\nAll of the following are counterproductive and damage ourselves ONLY:\nNo objectives, no goals, no demands, no philosophies, no lists.\nIt screws up the framing of the issue by forcing us to focus on specific issues.\nThe corrupt journos will adhere to the letter of the list and not the spirit. They will find a way to weasel around them.\nThe second nobody is looking, they’ll go back to being dishonest.\nThis idea was put forth by a well-meaning PR person, not someone experienced in consumer activity. PR is the journo’s game. Not ours.\nIt divides us into the goals we each specifically want and we don’t all want the same things. What appeases you will not appease another etc.\nDemands are things that terrorists make. We are a consumer revolt. We are not violent. We are not underhanded. We are not a political movement.\nPhilosophies are for philosophers, not consumer revolts. We don’t need philosophy to obtain the moral high ground, the opposition has already given it to us. We have no benefit in philosophies.\nGoals are for games, not a consumer revolt.\nObjectives are for military operations, not a consumer revolt.\nLists are for nerds.\nIt is true that it may increase our numbers (in an absolute sense, but we’re still divided over the goals) because people have specific things to champion. However, this will bring us fence-sitters and those of weak will and not people that will do the work of writing emails and investigation of corruption. If they aren’t invested on the merits, they aren’t invested and thus are not helpful.\nWe do not need clear end points. If people are discouraged by a perceived lack of progress, take a break. This is an extended and long-term approach and you must take breaks. If you need specific goals for yourself, participate 2 or 3 days a week. Phrase it in those terms. Creating goals is not necessary.\nIt does not help people get into this. What does help people get into this is a more coherent and concise set of facts that they can evaluate and come to their own conclusions.\nNumbers are not an argument. Facts create numbers. Numbers don’t necessarily create facts.\nPhrasing these goals incorrectly will put them as lines in the sand. We cannot change them once they’re satisfied. We cannot move goalposts like they do.\nNo narrative changing.\nAs we are a consumer revolt and not a political movement, we do not need a narrative.\nNarratives are for PR. PR is the journo’s game. Not ours.\nWe let the opposition change the narrative for themselves as they’ve done time and again for the last month.\nWe will go as far politically as we must (as we’ve been forced to do so far), but have no inherent desire to do so.\nIf a person is energized by narrative, they are in the wrong place. Narratives change and we would lose them when it changes anyway. Additionally, it’s unlikely that people that aren’t participating on the merits will do the requisite work involved.\nWe are about facts, logic, and reason. A narrative is a way of spinning these. We have no spin. Only truth.\nWe are actually inclusive and this has been demonstrated already. There is no need to push this or any message.\nNo leaders.\nThis is a 100% shill idea put forward by the opposition to make it easy to play the identity game. This is their bread and butter and they will co-opt or ruin anything that they can get their hands on.\nWe’ve lasted for a month and counting with no real dictators. We should continue this trend.\nThere are currently no weak points to attack.\nAs attacks against individuals intensify (people have lost jobs, been sent mafia-esque messages in the mail, and have been severely harassed for being involved), it’s clear that giving them heads that are more important than others is a bad idea.\nEven discussing who you would pick implies some kind of extra importance. We do not want this. We’re all in this together.\nThis is a section of a longer document, and was conceived as a comprehensive rebuttal to help GamerGaters address a specific type of shill known as The Changer. Other shills to watch out for included The Fear Monger, The Defeatist, The Dismissive, The False Flag, The Politico, The Discreditor, The Misdirector, The Uncertain, The Slider, and The Self-Shiller; the longer document recommended specific responses to deal with each of them. It may strike you as paranoid, but I personally witnessed multiple shills of each of these types, as SJWs repeatedly tried to infiltrate and redirect what, despite outsiders’ best efforts to categorize it as a hate group, a terrorist group, and a Twitter-based charade, remained a consumer revolt focused tightly on the corrupt games media.\nNow, obviously not all of these lessons are applicable to the #AltRight, because the #AltRight is a political movement, not a consumer revolt, it is positive and prescriptive in nature as opposed to being intrinsically defensive like #GamerGate, and it is addressing a very wide range of societal and historical issues instead of being obsessively focused on a single issue and industry at a specific point in time.\nNevertheless, it is clear that there is an intrinsic tension within the Alt-Right, which is not necessarily a bad thing. On the one side is the Alt-White, which is pure white nationalist and predominantly pagan or atheist. This could be thought of as the NPI or Spencerian Alt-Right. On the other is the Alt-West, which is omni-nationalist and pro-Christian. I suspect Jared Taylor and RamZPaul are more of this persuasion, but I could be wrong. Regardless, it is the branch in which I would place myself. All of the\n16 Points of the Alt-Right\nwith which even Richard Spencer himself only has a few quibbles, can reasonably be considered an Alt-West perspective.\nBut perhaps rather than thinking of them as branches, it is more helpful to think of them as roots, each being sustained by different pools, supporting the same glorious tree of Western Civilization. Because it is vital to understand that for the Alt-Right to be successful over time, Alt-White and Alt-West must continue to cooperate, refrain from internecine conflict, and continue to stand by each other in the face of the coming media assaults in the same way that GamerGate/KiA and GamerGate/chan did. (And believe me, the conceptual spectrum of the Alt-Right is CONSIDERABLY more narrow than that of GamerGate. Since they were able to coexist and cooperate, we definitely can.) Any claims to be the One True Strain of the Alt-Right are spurious and should be rejected by all sides, as anyone who subscribes to what Lawrence Murray has laid out as\nthe Alt-Right’s big tent\nis correctly characterized, at the very least, as an ally of the Alt-Right.\nBesides, as we all know, the only true apotheosis of Pepe is Kek.\nIt is worse than a waste of time, it is totally counterproductive to shoot at allies. In GamerGate, we had a simple and straightforward response to the shills, tone police, and self-appointed purity police who repeatedly attempted to redirect our efforts away from the primary target of the game journos: SHUT UP AND EMAIL. I suggest that both branches of the Alt-Right, Alt-White and Alt-West, would do very well to adopt a similar policy, especially as various shills do their best to divide and conquer. We would be foolish to do as the Left does, and spend vast quantities of time and effort seeking out and denouncing splittists, reactionaries, and false consciousnesses.\nSHUT UP AND SHOOT LEFT.\nRemember, it’s all very well to get excited about the fact that the media is paying attention to the Alt-Right, but never forget that the reason they are doing so is in order to discredit, disqualify, and destroy it and everyone who is associated with it. Don’t help them do it. The media game is to anoint and behead leaders, and they will always attempt to redefine you in the process,\nas Betsy Woodruff demonstrates\nat the Daily Beast:\nSo the Alt-Right—helmed by the trio who gathered at The Willard on Friday—is the most extreme example of a shift on the American right: away from a nostalgic conservative focus on restoring the values of the Founders, and towards a forward-focused nationalism that prioritizes drastic limits on immigration and open hostility to globalism.\nBut if that forward-focused nationalism sounds good to you, then regardless of whether you are more Alt-White or Alt-West, you are at the very least sympathetic to the Alt-Right.",
  "tags": [
    "#AltRight",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-10T09:17:00+00:00"
}