{
  "url": "https://voxday.net/2016/09/27/brainstorm-alt-right-or-alt-white/",
  "scraped_at": "2025-12-18T01:56:32.354776",
  "title": "Brainstorm: Alt-Right or Alt-White?",
  "date_display": "September 27, 2016",
  "date_iso": "2016-09-27T15:30:00+00:00",
  "date_from_url": "2016-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m pleased to announce that tomorrow night, Greg Johnson, the Alt-Right editor of <i>Counter-Currents</i>, will be joining me to <strike>engage in a battle to the death for the exclusive ownership of the soul of the Alt-Right</strike> discuss the current state of the Alt-Right, whether there is a meaningful distinction to be made between Alt-White and Alt-West, and if there is any meaning to the term Alt-Right beyond that of white nationalism.</p><p>It promises to be an interesting discussion. This Brainstorm session will be held at 7 PM Eastern tomorrow night, September 28th, and it is open, so anyone is welcome to attend although there is only room for 1,000 participants.</p><p>You can <a href=\"https://attendee.gotowebinar.com/register/5177867814118292481\">sign up for it here</a>.</p></div>",
  "content_text": "I’m pleased to announce that tomorrow night, Greg Johnson, the Alt-Right editor of\nCounter-Currents\n, will be joining me to\nengage in a battle to the death for the exclusive ownership of the soul of the Alt-Right\ndiscuss the current state of the Alt-Right, whether there is a meaningful distinction to be made between Alt-White and Alt-West, and if there is any meaning to the term Alt-Right beyond that of white nationalism.\nIt promises to be an interesting discussion. This Brainstorm session will be held at 7 PM Eastern tomorrow night, September 28th, and it is open, so anyone is welcome to attend although there is only room for 1,000 participants.\nYou can\nsign up for it here\n.",
  "tags": [
    "#AltRight",
    "#AltWest",
    "Brainstorm"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-27T14:30:00+00:00"
}