{
  "url": "https://voxday.net/2016/09/28/brainstorm-with-greg-johnson/",
  "scraped_at": "2025-12-18T01:56:45.980552",
  "title": "Brainstorm with Greg Johnson",
  "date_display": "September 28, 2016",
  "date_iso": "2016-09-28T20:31:00+00:00",
  "date_from_url": "2016-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just a reminder that tonight at 7 PM Eastern we’ll be holding a Brainstorm with Greg Johnson, the editor of Counter Currents, to discuss the current state of the Alt-Right. It promises to be an interesting discussion. This Brainstorm session is open, so anyone is welcome to attend. 300 people are already signed up. Some of the questions that have already been sent in are as follows:</p><ul><li>Would it be better for movement solidarity if the Alt-White remain a subset of the Alt-Right and what would that mean for the movement?</li><li>Besides our own countries, what other countries are worth defending, if any?</li><li>Is there any way develop a coherent definition for the Alt-Right movement to prevent provocateurs like Milo Yiannopoulos from entering? </li><li>How does the Alt-White and Alt-Right see the problem of white genocide and low birth/replacement rates? What do both camps see as solutions to these problems?</li><li>What is the biggest issue right now that the Alt-Right and the Alt-White thinks that our movement should be focusing on?</li><li>Does the Alt-Right and Alt-White agree on a strategy for either Trump or Hillary winning the US election? Can you discuss both scenarios?</li></ul><p>If you’re interested in attending, you can <a href=\"https://attendee.gotowebinar.com/register/5177867814118292481\">sign up for it here</a>.</p><p>In the meantime, another part of the Alt-White <a href=\"http://www.dailystormer.com/stormer-book-club-crusade-the-final-solution-to-the-milo-problem/\">has decided to go full retard</a>. The mainstream media couldn’t bring Milo down, Twitter couldn’t bring Milo down, Black Lives Matter couldn’t bring Milo down, but the swastika panties are going to succeed where everyone else has completely failed!</p><blockquote><p> I am hereby declaring a Holy Crusade against Milo Yiannopoulos, who is the single greatest threat our movement has at this time.</p><p>He is our arch-nemesis.</p><p>We need to stop this kike.</p><p>His plan is working. He is taking our brand, our symbols, and turning them against us for a neocon-Jew conservative agenda. He is rewriting our narrative, while taking everything that we have created to use for his own KIKE purposes.</p><p>This is the Plan</p><p>We are going to be at every single event Milo holds, publicly confront him and put it on YouTube. We are going to show his people that the real Alt-Right exists and that we despise him, that the hoax Alt-Right he’s created doesn’t exist.</p></blockquote><p>I know Milo. Milo is my friend. And I can <i>guarantee</i> you that this is <i>exactly </i>what Milo was hoping someone would do. There is nothing that will clean up his mainstream image like having a handful of Nazis publicly shrieking how much they hate the poor gay Jew. This is the sort of PR not even Milo can buy.</p><p>They’re not going to so much as ruffle his glorious hair. They’re going to get him a show on Fox.</p></div>",
  "content_text": "Just a reminder that tonight at 7 PM Eastern we’ll be holding a Brainstorm with Greg Johnson, the editor of Counter Currents, to discuss the current state of the Alt-Right. It promises to be an interesting discussion. This Brainstorm session is open, so anyone is welcome to attend. 300 people are already signed up. Some of the questions that have already been sent in are as follows:\nWould it be better for movement solidarity if the Alt-White remain a subset of the Alt-Right and what would that mean for the movement?\nBesides our own countries, what other countries are worth defending, if any?\nIs there any way develop a coherent definition for the Alt-Right movement to prevent provocateurs like Milo Yiannopoulos from entering?\nHow does the Alt-White and Alt-Right see the problem of white genocide and low birth/replacement rates? What do both camps see as solutions to these problems?\nWhat is the biggest issue right now that the Alt-Right and the Alt-White thinks that our movement should be focusing on?\nDoes the Alt-Right and Alt-White agree on a strategy for either Trump or Hillary winning the US election? Can you discuss both scenarios?\nIf you’re interested in attending, you can\nsign up for it here\n.\nIn the meantime, another part of the Alt-White\nhas decided to go full retard\n. The mainstream media couldn’t bring Milo down, Twitter couldn’t bring Milo down, Black Lives Matter couldn’t bring Milo down, but the swastika panties are going to succeed where everyone else has completely failed!\nI am hereby declaring a Holy Crusade against Milo Yiannopoulos, who is the single greatest threat our movement has at this time.\nHe is our arch-nemesis.\nWe need to stop this kike.\nHis plan is working. He is taking our brand, our symbols, and turning them against us for a neocon-Jew conservative agenda. He is rewriting our narrative, while taking everything that we have created to use for his own KIKE purposes.\nThis is the Plan\nWe are going to be at every single event Milo holds, publicly confront him and put it on YouTube. We are going to show his people that the real Alt-Right exists and that we despise him, that the hoax Alt-Right he’s created doesn’t exist.\nI know Milo. Milo is my friend. And I can\nguarantee\nyou that this is\nexactly\nwhat Milo was hoping someone would do. There is nothing that will clean up his mainstream image like having a handful of Nazis publicly shrieking how much they hate the poor gay Jew. This is the sort of PR not even Milo can buy.\nThey’re not going to so much as ruffle his glorious hair. They’re going to get him a show on Fox.",
  "tags": [
    "#AltRight",
    "Brainstorm"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-28T19:31:00+00:00"
}