{
  "url": "https://voxday.net/2016/09/08/convergence-at-airbnb-2/",
  "scraped_at": "2025-12-18T01:53:25.320942",
  "title": "Convergence at AirBnB",
  "date_display": "September 8, 2016",
  "date_iso": "2016-09-08T19:00:00+00:00",
  "date_from_url": "2016-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What a pity the stock is not public, because it’s time to short AirBNB. They are no longer in the business of providing connecting people who need places to stay with people who have places to rent, they are now <a href=\"https://techcrunch.com/2016/09/08/airbnb-plan-fix-racism-discrimination/\">converged and in the business of social justice</a>:</p><blockquote><p> Airbnb has been under fire lately for instances of racism and discrimination exhibited by some hosts on the home-sharing platform. In order to combat that, Airbnb is making several positive changes to the platform and its company policies, Airbnb CEO Brian Chesky sent in an email to hosts and guests this morning.</p><p>This includes guaranteeing short-term bookings for people who have been discriminated against, deemphasizing the use of user photos, blocking out availability if a host claims a space is taken when it really isn’t and working to increase the number of Instant Book listings, which don’t require hosts to approve specific guests, to one million by the beginning of 2017.</p><p>“Discrimination is the opposite of belonging, and its existence on our platform jeopardizes this core mission,” Chesky wrote. “Bias and discrimination have no place on Airbnb, and we have zero tolerance for them. Unfortunately, we have been slow to address these problems, and for this I am sorry. I take responsibility for any pain or frustration this has caused members of our community. We will not only make this right; we will work to set an example that other companies can follow.”</p><p>Airbnb’s issues with racism date back to at least late last year, when a Harvard study showed that renters with black-sounding names were less likely to receive a booking through the site. Then, in June, an Airbnb host in North Carolina canceled a booking on a black person and sent her a slew of racist insults. Shortly after that incident, Chesky said that racism is not allowed on the platform and Airbnb permanently banned the host.</p><p>Later that month, the Congressional Black Caucus urged Airbnb to take further action in addressing the issues of racism and discrimination on the company’s platform, citing how Title II of 1964 Civil Rights Act prohibits discrimination in places like hotels and motels on the basis of race, color, religion or national origin.</p><p>Today, Laura Murphy, former head of the American Civil Liberties Union’s Washington D.C. office, laid out Airbnb’s game plan for tackling instances of racism and discrimination on the platform. Airbnb has been working with Murphy since June to ensure that the company is doing everything it can to fight racism.</p></blockquote><p>“Even as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters, and no institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.”<br> – from <i><b><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie: Taking Down the Thought Police</a></b></i></br></p></div>",
  "content_text": "What a pity the stock is not public, because it’s time to short AirBNB. They are no longer in the business of providing connecting people who need places to stay with people who have places to rent, they are now\nconverged and in the business of social justice\n:\nAirbnb has been under fire lately for instances of racism and discrimination exhibited by some hosts on the home-sharing platform. In order to combat that, Airbnb is making several positive changes to the platform and its company policies, Airbnb CEO Brian Chesky sent in an email to hosts and guests this morning.\nThis includes guaranteeing short-term bookings for people who have been discriminated against, deemphasizing the use of user photos, blocking out availability if a host claims a space is taken when it really isn’t and working to increase the number of Instant Book listings, which don’t require hosts to approve specific guests, to one million by the beginning of 2017.\n“Discrimination is the opposite of belonging, and its existence on our platform jeopardizes this core mission,” Chesky wrote. “Bias and discrimination have no place on Airbnb, and we have zero tolerance for them. Unfortunately, we have been slow to address these problems, and for this I am sorry. I take responsibility for any pain or frustration this has caused members of our community. We will not only make this right; we will work to set an example that other companies can follow.”\nAirbnb’s issues with racism date back to at least late last year, when a Harvard study showed that renters with black-sounding names were less likely to receive a booking through the site. Then, in June, an Airbnb host in North Carolina canceled a booking on a black person and sent her a slew of racist insults. Shortly after that incident, Chesky said that racism is not allowed on the platform and Airbnb permanently banned the host.\nLater that month, the Congressional Black Caucus urged Airbnb to take further action in addressing the issues of racism and discrimination on the company’s platform, citing how Title II of 1964 Civil Rights Act prohibits discrimination in places like hotels and motels on the basis of race, color, religion or national origin.\nToday, Laura Murphy, former head of the American Civil Liberties Union’s Washington D.C. office, laid out Airbnb’s game plan for tackling instances of racism and discrimination on the platform. Airbnb has been working with Murphy since June to ensure that the company is doing everything it can to fight racism.\n“Even as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters, and no institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.”\n– from\nSJWs Always Lie: Taking Down the Thought Police",
  "tags": [
    "corpocracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-08T18:00:00+00:00"
}