{
  "url": "https://voxday.net/2016/09/28/curiosity-and-cognitive-paradigms/",
  "scraped_at": "2025-12-18T01:56:37.884486",
  "title": "Curiosity and cognitive paradigms",
  "date_display": "September 28, 2016",
  "date_iso": "2016-09-28T08:44:00+00:00",
  "date_from_url": "2016-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As time has passed, I have realized that my ability to easily defeat other intelligent, educated people in debate has considerably less to do with my intelligence and more to do with what appears to be a higher degree of curiosity, which doesn’t actually have much, if anything, to do with intelligence or formal education.</p><p>As has often been noted here, Man is a rationalizing animal. And what I have increasingly noted of late is that most people devote most of their intelligence to rationalizing what they already think to be true than they do to figuring out what they think is not true. This desire to rationalize rather than learn is, quite possibly, the intelligent individual’s biggest intellectual weakness.</p><p>Now, we all do it to varying degrees. But the more we do it, the more absurd and indefensible and self-contradictory positions we will take. Thus we see the monetarists seriously discussing the outlawing of paper money, evolutionists denying the existence of species, anthropologists presenting literal fiction in the place of history or archeological science, and Christians arguing the virgin birth of a non-divine individual.</p><p>But this is only one form of the rationalization process. The other one is to base one’s opinion on conclusions drawn from incomplete information, to argue on the basis of knowing about something rather than genuinely knowing it. Those of us who have graduated from good colleges are particularly susceptible to this, as we have been <i>introduced </i>to a broad range of classics, we have listened to lectures from professors deeply steeped in them so that we recognize them and know a little bit about them, but the truth is that we don’t really know much of anything concerning their details.</p><p>Which is why we will so often see someone saying that Marx is wrong without have the least conception of what he might be wrong about, declaring that Fukuyama’s declaration of the end of history is stupid on its face without understanding what Fukuyama meant by “history” – and any would-be intellectual should be humiliated upon the realization that his level of knowledge doesn’t rise to the level of a pop song by Jesus Jones from 26 years ago – and appealing to all things “quantum” without even being able to define “quantum mechanics”.</p><p>Complicating this is the common preference for binary thinking, or if you want to sound more philosophical, Abelardian philosophy. “It is so or it is not so” is the binary thinker’s mantra; the concept of necessary, but not sufficient eludes him. Consider two contrary examples from the comments on Huntington’s book, <i>The Clash of Civilizations</i>, yesterday.</p><blockquote><p> “I suspect that it might be easier to start with worship of blood, soil and nature and work up from there.  The popularity of paganism should be no mystery.”</p><p>“I would go further, and say not only that Christianity is needed for Western Civilization, I say Christianity IS Western Civilization. You can see from that why the appeal of the Alt-Right, claiming that my racial identity trumps my Church, is an idea not even worth discussing.”</p></blockquote><p>Despite being directly opposed, both statements are equally silly, and both are similarly ignorant. Anyone who has read even part of Huntington’s book will instantly recognize that neither commenter has read it. The first comment violates the recounting of the history of the various civilizations in general and Western civilization in particular. Given that even a sophisticated religion such as Buddhism has proven insufficient to support the development of a major civilization, and even the highest, most noble forms of virtuous Roman paganism failed to compete successfully with Christianity, it is obvious that working up from the sort of pre-civilized animism that the commenter recommends would not be easier than metaphorically taking whips to the temple and reforming the Christian churches. In fact, it is improbable to the point of being a virtual impossibility.</p><p>As for the idea that Christianity IS Western Civilization, this is a historical and definitional absurdity. While religion is much more important in defining civilizations than the secular students of liberal democracy would like to admit, a civilization is considerably more than its definitive religion. Thus, both the following statements by Huntington are both true:</p><ol><li>People of the same race can be deeply divided by civilization; people of different races may be united by civilization….The crucial distinctions among human groups concern their values, beliefs, institutions, and social structures, not their physical size, head shapes, and skin colors.</li><li>A civilization is the broadest cultural entity. Villages, regions, ethnic groups, nationalities, religious groups, all have distinct cultures at different levels of cultural heterogeneity. It is defined both by common objective elements, such as language, history, religion, customs, institutions, and by the subjective self-identification of people. People have levels of identity: a resident of Rome may define himself with varying degrees of intensity as a Roman, an Italian, a Catholic, a Christian, a European, a Westerner. The civilization to which he belongs is the broadest level of identification with which he strongly identifies.</li></ol><p> First, an individual’s values, beliefs, institutions, and social structures are heavily influenced by his race; race and culture are deeply intertwined. Second, Christianity is not Western civilization, it is merely one of the most important aspects of Western civilization; as the Alt-Right sees it, Christianity is one of the three necessary components. The idea that one’s racial identity trumps one’s religion is not worth discussing because it is irrelevant, both to the Alt-Right and to the civilizational paradigm. Both religion and race are necessary components of a civilization, but are insufficient in themselves. This should be entirely obvious from the start, given that neither religion nor race are recognized synonyms for civilization.</p><p>Third, the fact that there are three other major Christian civilizations besides Western civilization, Byzantine, Orthodox, and Latin American, (to say nothing of minor Christian civilizations such as Ethiopean) means that Western civilization cannot be Christianity and Christianity cannot be Western civilization. <i>That </i>is an idea that is not worth discussing, because it is as obviously and mathematically untrue as the statement that 1+3.5=1.</p><p>Now, we can argue whether a society of Chinese Christians will be more Sinic than Western or more Western than Sinic. I strongly incline towards the former view myself, though I would not view the matter as completely unworthy of discussion. But regardless, we should all be able to concur that it will not be Japanese or Muslim, or, for that matter, neoliberal.</p><p>And furthermore, the civilizational paradigm tends to highlight why Alt-West and Alt-White are not necessarily in competition with each other. Alt-White is less an alternative to Alt-West than a subset of it, as Alt-West is focused on the civilizational level, while Alt-White is focused on the national level. However, it also indicates that the Alt-White is going to have to come to terms with the necessity of Christianity to its own objectives if it is going to find any success going forward.</p><p>It can, of course, reject the civilizational paradigm, but that is a suboptimal response given the way it is increasingly clear that the civilizational paradigm is vastly superior in explanatory and predictive terms to either the bipolar superpower paradigm that preceded it or the universalist neoliberal paradigm that was supposed to succeed the superpower model.</p></div>",
  "content_text": "As time has passed, I have realized that my ability to easily defeat other intelligent, educated people in debate has considerably less to do with my intelligence and more to do with what appears to be a higher degree of curiosity, which doesn’t actually have much, if anything, to do with intelligence or formal education.\nAs has often been noted here, Man is a rationalizing animal. And what I have increasingly noted of late is that most people devote most of their intelligence to rationalizing what they already think to be true than they do to figuring out what they think is not true. This desire to rationalize rather than learn is, quite possibly, the intelligent individual’s biggest intellectual weakness.\nNow, we all do it to varying degrees. But the more we do it, the more absurd and indefensible and self-contradictory positions we will take. Thus we see the monetarists seriously discussing the outlawing of paper money, evolutionists denying the existence of species, anthropologists presenting literal fiction in the place of history or archeological science, and Christians arguing the virgin birth of a non-divine individual.\nBut this is only one form of the rationalization process. The other one is to base one’s opinion on conclusions drawn from incomplete information, to argue on the basis of knowing about something rather than genuinely knowing it. Those of us who have graduated from good colleges are particularly susceptible to this, as we have been\nintroduced\nto a broad range of classics, we have listened to lectures from professors deeply steeped in them so that we recognize them and know a little bit about them, but the truth is that we don’t really know much of anything concerning their details.\nWhich is why we will so often see someone saying that Marx is wrong without have the least conception of what he might be wrong about, declaring that Fukuyama’s declaration of the end of history is stupid on its face without understanding what Fukuyama meant by “history” – and any would-be intellectual should be humiliated upon the realization that his level of knowledge doesn’t rise to the level of a pop song by Jesus Jones from 26 years ago – and appealing to all things “quantum” without even being able to define “quantum mechanics”.\nComplicating this is the common preference for binary thinking, or if you want to sound more philosophical, Abelardian philosophy. “It is so or it is not so” is the binary thinker’s mantra; the concept of necessary, but not sufficient eludes him. Consider two contrary examples from the comments on Huntington’s book,\nThe Clash of Civilizations\n, yesterday.\n“I suspect that it might be easier to start with worship of blood, soil and nature and work up from there.  The popularity of paganism should be no mystery.”\n“I would go further, and say not only that Christianity is needed for Western Civilization, I say Christianity IS Western Civilization. You can see from that why the appeal of the Alt-Right, claiming that my racial identity trumps my Church, is an idea not even worth discussing.”\nDespite being directly opposed, both statements are equally silly, and both are similarly ignorant. Anyone who has read even part of Huntington’s book will instantly recognize that neither commenter has read it. The first comment violates the recounting of the history of the various civilizations in general and Western civilization in particular. Given that even a sophisticated religion such as Buddhism has proven insufficient to support the development of a major civilization, and even the highest, most noble forms of virtuous Roman paganism failed to compete successfully with Christianity, it is obvious that working up from the sort of pre-civilized animism that the commenter recommends would not be easier than metaphorically taking whips to the temple and reforming the Christian churches. In fact, it is improbable to the point of being a virtual impossibility.\nAs for the idea that Christianity IS Western Civilization, this is a historical and definitional absurdity. While religion is much more important in defining civilizations than the secular students of liberal democracy would like to admit, a civilization is considerably more than its definitive religion. Thus, both the following statements by Huntington are both true:\nPeople of the same race can be deeply divided by civilization; people of different races may be united by civilization….The crucial distinctions among human groups concern their values, beliefs, institutions, and social structures, not their physical size, head shapes, and skin colors.\nA civilization is the broadest cultural entity. Villages, regions, ethnic groups, nationalities, religious groups, all have distinct cultures at different levels of cultural heterogeneity. It is defined both by common objective elements, such as language, history, religion, customs, institutions, and by the subjective self-identification of people. People have levels of identity: a resident of Rome may define himself with varying degrees of intensity as a Roman, an Italian, a Catholic, a Christian, a European, a Westerner. The civilization to which he belongs is the broadest level of identification with which he strongly identifies.\nFirst, an individual’s values, beliefs, institutions, and social structures are heavily influenced by his race; race and culture are deeply intertwined. Second, Christianity is not Western civilization, it is merely one of the most important aspects of Western civilization; as the Alt-Right sees it, Christianity is one of the three necessary components. The idea that one’s racial identity trumps one’s religion is not worth discussing because it is irrelevant, both to the Alt-Right and to the civilizational paradigm. Both religion and race are necessary components of a civilization, but are insufficient in themselves. This should be entirely obvious from the start, given that neither religion nor race are recognized synonyms for civilization.\nThird, the fact that there are three other major Christian civilizations besides Western civilization, Byzantine, Orthodox, and Latin American, (to say nothing of minor Christian civilizations such as Ethiopean) means that Western civilization cannot be Christianity and Christianity cannot be Western civilization.\nThat\nis an idea that is not worth discussing, because it is as obviously and mathematically untrue as the statement that 1+3.5=1.\nNow, we can argue whether a society of Chinese Christians will be more Sinic than Western or more Western than Sinic. I strongly incline towards the former view myself, though I would not view the matter as completely unworthy of discussion. But regardless, we should all be able to concur that it will not be Japanese or Muslim, or, for that matter, neoliberal.\nAnd furthermore, the civilizational paradigm tends to highlight why Alt-West and Alt-White are not necessarily in competition with each other. Alt-White is less an alternative to Alt-West than a subset of it, as Alt-West is focused on the civilizational level, while Alt-White is focused on the national level. However, it also indicates that the Alt-White is going to have to come to terms with the necessity of Christianity to its own objectives if it is going to find any success going forward.\nIt can, of course, reject the civilizational paradigm, but that is a suboptimal response given the way it is increasingly clear that the civilizational paradigm is vastly superior in explanatory and predictive terms to either the bipolar superpower paradigm that preceded it or the universalist neoliberal paradigm that was supposed to succeed the superpower model.",
  "tags": [
    "#AltRight",
    "#AltWest",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-28T07:44:00+00:00"
}