{
  "url": "https://voxday.net/2016/09/04/direita-alternativa-16-pontos/",
  "scraped_at": "2025-12-18T01:52:21.977243",
  "title": "Direita Alternativa: 16 Pontos",
  "date_display": "September 4, 2016",
  "date_iso": "2016-09-04T00:00:00+00:00",
  "date_from_url": "2016-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"western\" lang=\"pt-PT\"> 1. A direita alternativa situa-se<br> ideologicamente à direita. Socialistas não pertencem à direita<br> alternativa. Progressistas não pertencem à direita alternativa.<br> Liberais não pertencem à direita alternativa. Comunistas,<br> marxistas, marxistas culturais e neoconservadores não pertencem à<br> direita alternativa.</br></br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 2. A direita alternativa é uma<br> alternativa ao movimento conservador vigente nos EUA, cujos<br> princípios se encontram nominalmente encapsulados nos <u><a href=\"http://tradutoresdedireita.org/os-dez-principios-conservadores/\">10<br> princípios conservadores de Russel Kirk</br></a></u>, mas<br> que acabou por regredir para o progressismo. É também uma<br> alternativa ao libertarismo.</br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 3. A direita alternativa não é uma<br> atitude defensiva e rejeita o conceito da derrota nobre e íntegra. É<br> uma filosofia ofensiva vanguardista, em todas as acepções do termo.<br> A direita alternativa acredita na vitória através da persistência<br> e de um estado de harmonia com a ciência, a realidade, a tradição<br> cultural e as lições da História.</br></br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 4. A direita alternativa crê que a<br> civilização ocidental é o auge das conquistas da Humanidade e<br> apoia os seus três pilares fundamentais: o Cristianismo, as nações<br> europeias e o legado greco-romano.</br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 5. A direita alternativa é aberta e<br> declaradamente nacionalista. Apoia todos os nacionalismos e o direito<br> de todas as nações a existirem de forma homogénea e não<br> adulterada pela invasão e imigração estrangeiras.</br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 6. A direita alternativa é<br> anti-globalista. Opõe-se a todos os grupos que pugnam pelos ideais e<br> objectivos globalistas.</br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 7. A direita alternativa é<br> anti-igualitária. Rejeita a noção de igualdade pelo mesmo motivo<br> que rejeita a noção de unicórnios e duendes, ciente de que a<br> igualdade entre humanos não existe em qualquer forma observável,<br> seja ela científica, legal, material, intelectual, sexual ou<br> espiritual.</br></br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 8. A direita alternativa apoia o<br> método científico. Aceita as conclusões vigentes do método<br> científico, mas compreende que a) estas conclusões estão sujeitas<br> a serem revistas no futuro, b) a ciência é susceptível à<br> corrupção, e c) o dito consenso científico não é baseado em<br> ciência, mas em democracia, e que, como tal, é intrinsecamente<br> não-científico.</br></br></br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 9. A direita alternativa acredita que<br> a política se subordina à cultura, que, por sua vez, se subordina à<br> identidade.</br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 10. A direita alternativa opõe-se ao<br> governo ou domínio de qualquer grupo étnico nativo por qualquer<br> outro, sobretudo na terra natal do povo dominado. A direita<br> alternativa opõe-se à obtenção de influência excessiva de<br> qualquer grupo étnico não-nativo numa sociedade, seja através do<br> nepotismo, do tribalismo ou de qualquer outro método.</br></br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 11. A direita alternativa compreende<br> que a diversidade aliada à proximidade leva à guerra.</br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 12. A direita alternativa não quer<br> saber o que dela pensam.</br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 13. A direita alternativa rejeita o<br> livre comércio internacional e a liberdade de circulação que o<br> livre comércio exige. Os benefícios do livre comércio<br> <i>intranacional</i> não são prova dos benefícios do livre<br> comércio internacional.</br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 14. A direita alternativa crê que há<br> que assegurar a existência dos povos de ascendência europeia e um<br> futuro para as crianças de ascendência europeia.</br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 15. A direita alternativa não crê<br> na superioridade geral de qualquer raça, nação, povo ou<br> subespécie. Cada raça, nação, povo e subespécie tem as suas<br> próprias forças e fraquezas, e detém o direito soberano de viver<br> em paz na cultura nativa que prefere.</br></br></br></br></div><div class=\"western\" lang=\"pt-PT\"></div><div class=\"western\" lang=\"pt-PT\"> 16. A direita alternativa é uma<br> filosofia que valoriza a paz entre as várias nações do mundo e que<br> se opõe a guerras que se destinam a impor os valores de uma nação<br> noutras, bem como tentativas de exterminar nações individuais<br> através da guerra, do genocídio, da imigração ou assimilação<br> genética.</br></br></br></br></br></div><p></p><div class=\"western\" lang=\"pt-PT\"> Em suma, a direita alternativa é uma<br> ideologia ocidental que acredita na ciência, na história, na<br> realidade, o direito das nações genéticas a existirem e a<br> governarem-se de acordo com os seus próprios interesses.</br></br></br></div></div>",
  "content_text": "1. A direita alternativa situa-se\nideologicamente à direita. Socialistas não pertencem à direita\nalternativa. Progressistas não pertencem à direita alternativa.\nLiberais não pertencem à direita alternativa. Comunistas,\nmarxistas, marxistas culturais e neoconservadores não pertencem à\ndireita alternativa.\n2. A direita alternativa é uma\nalternativa ao movimento conservador vigente nos EUA, cujos\nprincípios se encontram nominalmente encapsulados nos\n10\nprincípios conservadores de Russel Kirk\n, mas\nque acabou por regredir para o progressismo. É também uma\nalternativa ao libertarismo.\n3. A direita alternativa não é uma\natitude defensiva e rejeita o conceito da derrota nobre e íntegra. É\numa filosofia ofensiva vanguardista, em todas as acepções do termo.\nA direita alternativa acredita na vitória através da persistência\ne de um estado de harmonia com a ciência, a realidade, a tradição\ncultural e as lições da História.\n4. A direita alternativa crê que a\ncivilização ocidental é o auge das conquistas da Humanidade e\napoia os seus três pilares fundamentais: o Cristianismo, as nações\neuropeias e o legado greco-romano.\n5. A direita alternativa é aberta e\ndeclaradamente nacionalista. Apoia todos os nacionalismos e o direito\nde todas as nações a existirem de forma homogénea e não\nadulterada pela invasão e imigração estrangeiras.\n6. A direita alternativa é\nanti-globalista. Opõe-se a todos os grupos que pugnam pelos ideais e\nobjectivos globalistas.\n7. A direita alternativa é\nanti-igualitária. Rejeita a noção de igualdade pelo mesmo motivo\nque rejeita a noção de unicórnios e duendes, ciente de que a\nigualdade entre humanos não existe em qualquer forma observável,\nseja ela científica, legal, material, intelectual, sexual ou\nespiritual.\n8. A direita alternativa apoia o\nmétodo científico. Aceita as conclusões vigentes do método\ncientífico, mas compreende que a) estas conclusões estão sujeitas\na serem revistas no futuro, b) a ciência é susceptível à\ncorrupção, e c) o dito consenso científico não é baseado em\nciência, mas em democracia, e que, como tal, é intrinsecamente\nnão-científico.\n9. A direita alternativa acredita que\na política se subordina à cultura, que, por sua vez, se subordina à\nidentidade.\n10. A direita alternativa opõe-se ao\ngoverno ou domínio de qualquer grupo étnico nativo por qualquer\noutro, sobretudo na terra natal do povo dominado. A direita\nalternativa opõe-se à obtenção de influência excessiva de\nqualquer grupo étnico não-nativo numa sociedade, seja através do\nnepotismo, do tribalismo ou de qualquer outro método.\n11. A direita alternativa compreende\nque a diversidade aliada à proximidade leva à guerra.\n12. A direita alternativa não quer\nsaber o que dela pensam.\n13. A direita alternativa rejeita o\nlivre comércio internacional e a liberdade de circulação que o\nlivre comércio exige. Os benefícios do livre comércio\nintranacional\nnão são prova dos benefícios do livre\ncomércio internacional.\n14. A direita alternativa crê que há\nque assegurar a existência dos povos de ascendência europeia e um\nfuturo para as crianças de ascendência europeia.\n15. A direita alternativa não crê\nna superioridade geral de qualquer raça, nação, povo ou\nsubespécie. Cada raça, nação, povo e subespécie tem as suas\npróprias forças e fraquezas, e detém o direito soberano de viver\nem paz na cultura nativa que prefere.\n16. A direita alternativa é uma\nfilosofia que valoriza a paz entre as várias nações do mundo e que\nse opõe a guerras que se destinam a impor os valores de uma nação\nnoutras, bem como tentativas de exterminar nações individuais\natravés da guerra, do genocídio, da imigração ou assimilação\ngenética.\nEm suma, a direita alternativa é uma\nideologia ocidental que acredita na ciência, na história, na\nrealidade, o direito das nações genéticas a existirem e a\ngovernarem-se de acordo com os seus próprios interesses.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-03T23:00:00+00:00"
}