{
  "url": "https://voxday.net/2016/09/09/gondors-choice/",
  "scraped_at": "2025-12-18T01:53:29.035447",
  "title": "Gondor’s choice",
  "date_display": "September 9, 2016",
  "date_iso": "2016-09-09T11:00:00+00:00",
  "date_from_url": "2016-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright <a href=\"http://www.scifiwright.com/2016/09/hillarys-speech-on-the-alt-right/\">laments what he sees as internecine warfare</a> on the Right in the place of a unified effort against the Left:</p><blockquote><p> The Dems are merely the political arm of the darkness.</p><p>It was the Reds who invented the idea of Critical Theory, that is, accuse Christendom of each and every imperfection imaginable, especially in areas, such as race relations or the equality of sexes, where the criticism cannot exist outside Christendom. It was done to weaken confidence in Western institutions, especially the Church, the family, the marketplace, the townhall, the entertainment industry, the courts, the academy, and the press.</p><p>Over the decades, the press was captured partly and then fully, then the academy (which is now merely a seminary for Leftism), then the courts of law (which began systematically to undermine rule of law), and Hollywood (Sen McCarthy was right, and the Hollywood ten were commies) and then townhall (which was taken over by a donor caste of Leftwing millionaires, with whom Trump broke ranks and turned against).</p><p>Wall Street was basically bought and broken to the whip after the sabotage by the government of the housing market, the student loan industry, the motor car industry, and health care practice. The marketplace is firmly under Leftist control, which is ironic, since the millionaires learned that by funding politicians who denounce them, the millionaires can maintain their wealth and power and suppress free market competition.</p><p>The family was successfully smashed to bits among the inner city blacks, American Indians living on reservations, and poor whites. No fault divorce is to blame, and the normalization and celebration of sodomy is the victory lap.</p><p>The Anglican and Episcopalian denominations have spat in the face of Christ and embraced Caesar, and kneel to give oral sexual favors to the homosex lobby, so these congregations had declared their fealty to antichrist. The Roman Catholic Church, a fair and strong fortress, still holds out, but the press has decided on a policy of pretending Pope Francis is one of them, and many an unwary reader, including Catholics who should know better, are deceived.</p><p>The darkness is on the brink of absolute victory. The last few lamps are fluttering and guttering and the oil is scarce.</p><p>And there is still no organized opposition to any of this.</p><p>For a time, I had some hope in the voters electrified by Trump, but, like the Tea Party, both the mainstream conservatives and the newer movements and the treasonous establishment GOP have decided to fritter away their energy attacking and provoking attacks from each other. Instead of riding to the aid of Gondor, the Riders of Rohan decided this was the best moment to loot Minas Tirith.</p></blockquote><p>What I think the estimable Mr. Wright has failed to observe is that the ideological Right has turned out to have considerably less intellectual integrity than most of us previously believed it to possess. Who would have imagined even one year ago that relatively high-profile conservatives such as Mark Levin, Bill Kristol, Ross Douthat, Russell Moore, and George Will would openly turn against the Republican candidate for President? (I know, Levin has since done a 180, but still.) Who would have thought that media conservatives such as (((Jonah Goldberg))), (((Cathy Young))), (((Jeff Goldstein))) and (((Ben Shapiro))) would take orders from Hillary Clinton, follow the lead of the Washington Post, NPR, the Atlantic, and the New Yorker, and launch a concerted assault on the ideological Right?</p><p>I suggest Mr. Wright has the analogy wrong. Gondor is under siege and divided, and in his despair, Denethor has thrown in with Mordor and Isengard and sent half his army to march with the orcs, the Uruk-Hai, and the Haradrim against Rohan and the remnants of the West.</p><p>The transition from ideological politics to identity politics is difficult to understand for many and even more difficult to accept for some, particularly those whose identities are complicated and whose connections are mixed. But that doesn’t change the reality that the transition is upon us, is in increasing effect, and cannot be stopped or denied.</p><p>In fact, the only reason Hillary Clinton and the Left are still even in the game today is due to the 60-million strong invasion of the West by the orcs and the Haradrim. Two-thirds of whites support Trump. If the men of Gondor want to survive, if they want to defeat the armies of Mordor, they have to a) stop expecting Rohan to accept their outmoded and self-destructive lead, b) stop attacking Rohan for focusing on the primary issues rather than their preferred targets, c) focus on fighting the actual enemy.</p><p>Here is the essential strategic point. Even if you prefer ideological politics, the historical statistics, the polls, and the politics of the countries from which the immigrants have come all make it very clear that the <i>only </i>way to win ideologically is to get on board with identity politics.</p><p>I’ve been reading Charles Oman’s incredible <i>History of the Peninsular War</i>. It’s an incredibly detailed history; I’m still in the middle of Volume I of VII. One of the things that struck me most in my reading so far is that the most important French advantage over the Spanish was their artillery, as several of their sieges of Spanish towns failed for want of enough guns. It was also hard for all three armies, French, Spanish, and British, to come by enough horses and mules to transport the artillery; occasionally guns on both sides were left behind due to insufficient animals. However, despite the courage of the Spanish irregulars, who did not hesitate to try to defend mountain passes and river crossings against much larger French forces, I saw no sign that they ever focused their attacks on the horses pulling the guns in order to neutralize the element that posed the most significant danger to them.</p><p>In case the historical analogy is not sufficiently clear, immigration and diversity are the big guns of the Left. Without them, they cannot win.</p><p>In light of that, conservatives and independents must now choose for what and with whom they will stand: a diverse USA, globalism, and the Left, or a white America, nationalism, and the Alt-Right. There are no other meaningful options.</p></div>",
  "content_text": "John C. Wright\nlaments what he sees as internecine warfare\non the Right in the place of a unified effort against the Left:\nThe Dems are merely the political arm of the darkness.\nIt was the Reds who invented the idea of Critical Theory, that is, accuse Christendom of each and every imperfection imaginable, especially in areas, such as race relations or the equality of sexes, where the criticism cannot exist outside Christendom. It was done to weaken confidence in Western institutions, especially the Church, the family, the marketplace, the townhall, the entertainment industry, the courts, the academy, and the press.\nOver the decades, the press was captured partly and then fully, then the academy (which is now merely a seminary for Leftism), then the courts of law (which began systematically to undermine rule of law), and Hollywood (Sen McCarthy was right, and the Hollywood ten were commies) and then townhall (which was taken over by a donor caste of Leftwing millionaires, with whom Trump broke ranks and turned against).\nWall Street was basically bought and broken to the whip after the sabotage by the government of the housing market, the student loan industry, the motor car industry, and health care practice. The marketplace is firmly under Leftist control, which is ironic, since the millionaires learned that by funding politicians who denounce them, the millionaires can maintain their wealth and power and suppress free market competition.\nThe family was successfully smashed to bits among the inner city blacks, American Indians living on reservations, and poor whites. No fault divorce is to blame, and the normalization and celebration of sodomy is the victory lap.\nThe Anglican and Episcopalian denominations have spat in the face of Christ and embraced Caesar, and kneel to give oral sexual favors to the homosex lobby, so these congregations had declared their fealty to antichrist. The Roman Catholic Church, a fair and strong fortress, still holds out, but the press has decided on a policy of pretending Pope Francis is one of them, and many an unwary reader, including Catholics who should know better, are deceived.\nThe darkness is on the brink of absolute victory. The last few lamps are fluttering and guttering and the oil is scarce.\nAnd there is still no organized opposition to any of this.\nFor a time, I had some hope in the voters electrified by Trump, but, like the Tea Party, both the mainstream conservatives and the newer movements and the treasonous establishment GOP have decided to fritter away their energy attacking and provoking attacks from each other. Instead of riding to the aid of Gondor, the Riders of Rohan decided this was the best moment to loot Minas Tirith.\nWhat I think the estimable Mr. Wright has failed to observe is that the ideological Right has turned out to have considerably less intellectual integrity than most of us previously believed it to possess. Who would have imagined even one year ago that relatively high-profile conservatives such as Mark Levin, Bill Kristol, Ross Douthat, Russell Moore, and George Will would openly turn against the Republican candidate for President? (I know, Levin has since done a 180, but still.) Who would have thought that media conservatives such as (((Jonah Goldberg))), (((Cathy Young))), (((Jeff Goldstein))) and (((Ben Shapiro))) would take orders from Hillary Clinton, follow the lead of the Washington Post, NPR, the Atlantic, and the New Yorker, and launch a concerted assault on the ideological Right?\nI suggest Mr. Wright has the analogy wrong. Gondor is under siege and divided, and in his despair, Denethor has thrown in with Mordor and Isengard and sent half his army to march with the orcs, the Uruk-Hai, and the Haradrim against Rohan and the remnants of the West.\nThe transition from ideological politics to identity politics is difficult to understand for many and even more difficult to accept for some, particularly those whose identities are complicated and whose connections are mixed. But that doesn’t change the reality that the transition is upon us, is in increasing effect, and cannot be stopped or denied.\nIn fact, the only reason Hillary Clinton and the Left are still even in the game today is due to the 60-million strong invasion of the West by the orcs and the Haradrim. Two-thirds of whites support Trump. If the men of Gondor want to survive, if they want to defeat the armies of Mordor, they have to a) stop expecting Rohan to accept their outmoded and self-destructive lead, b) stop attacking Rohan for focusing on the primary issues rather than their preferred targets, c) focus on fighting the actual enemy.\nHere is the essential strategic point. Even if you prefer ideological politics, the historical statistics, the polls, and the politics of the countries from which the immigrants have come all make it very clear that the\nonly\nway to win ideologically is to get on board with identity politics.\nI’ve been reading Charles Oman’s incredible\nHistory of the Peninsular War\n. It’s an incredibly detailed history; I’m still in the middle of Volume I of VII. One of the things that struck me most in my reading so far is that the most important French advantage over the Spanish was their artillery, as several of their sieges of Spanish towns failed for want of enough guns. It was also hard for all three armies, French, Spanish, and British, to come by enough horses and mules to transport the artillery; occasionally guns on both sides were left behind due to insufficient animals. However, despite the courage of the Spanish irregulars, who did not hesitate to try to defend mountain passes and river crossings against much larger French forces, I saw no sign that they ever focused their attacks on the horses pulling the guns in order to neutralize the element that posed the most significant danger to them.\nIn case the historical analogy is not sufficiently clear, immigration and diversity are the big guns of the Left. Without them, they cannot win.\nIn light of that, conservatives and independents must now choose for what and with whom they will stand: a diverse USA, globalism, and the Left, or a white America, nationalism, and the Alt-Right. There are no other meaningful options.",
  "tags": [
    "#AltRight",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-09T10:00:00+00:00"
}