{
  "url": "https://voxday.net/2016/09/06/hillary-appears-to-have-parkinsons/",
  "scraped_at": "2025-12-18T01:52:55.771065",
  "title": "Hillary appears to have Parkinson’s Disease",
  "date_display": "September 6, 2016",
  "date_iso": "2016-09-06T08:16:00+00:00",
  "date_from_url": "2016-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That is the conclusion of a a board-certified Anesthesiologist with 36 years of experience, backed up by the observations of a) a victim of Parkinson’s Disease and b) a registered nurse who cares for patients with Parkinson’s Disease.</p><blockquote><p> <a href=\"http://www.dangerandplay.com/2016/08/12/hillary-clinton-has-parkinsons-disease-physician-confirms/\">HRC probably has PD</a>.</p><p>She has had clinical symptoms for a minimum of 4 years, and probably much longer, given that the fall leading to her head injury required a significant progression of the disease. All of her bizarre physical actions since that time fit nicely into the spectrum of signs that we expect in PD. And since PD explains all of them, we have a high probability of a correct diagnosis. It has almost certainly been treated with levodopa. Some of her symptoms may be related to this drug treatment.</p><p>It is most curious that all of the bizarre physical signs seem to be in 2016 videos. HRC was a public figure in 2015, with a lot of campaign work underway. Yet all of the oddities seem to be within the last several months. This suggests a significant progression of her PD. We also know that her contact with the public has been rigidly controlled. She has not done news conferences during the campaign. These would be highly stressful to a PD sufferer and would elicit many PD signs.</p><p>PD is a chronic disease with a downhill prognosis. HRC’s instability and frequent cough suggest that her PD is advanced. This is not a good outlook for someone running for the Presidency. The office of the President is one of the highest stress jobs in the world. Stress sets off PD episodes, which render the sufferer incapable of proper response.</p><p>At this point, a bit of speculation seems appropriate. HRC talks about her yoga sessions. But no one we know of has ever documented one. It is possible that this is cover for sessions designed to teach her coping mechanisms for PD or for rest breaks. Exhaustion makes PD worse.</p><p>HRC’s coughing suggests that her swallowing disorder is advanced, placing her closer to an aspiration pneumonia that would disable or kill her. That’s bad enough, but PD has one more, even more dangerous step in its progression.</p></blockquote><p><a href=\"http://www.dangerandplay.com/2016/08/12/hillary-clinton-has-parkinsons-disease-physician-confirms/\">Read the whole thing</a> at Mike Cernovich’s place. This is more than a meme, it is a medical observation by an expert. It is increasingly obvious to even the most casual observer that something is seriously wrong with Hillary Clinton, and given what appears to be her rapid decline, it’s probably not something that the media can conceal for much longer the way they did with Woodrow Wilson, FDR, and John F. Kennedy.</p><p>Mike also noted on Twitter that the treatment for dysphagia is <a href=\"https://pbs.twimg.com/media/CrpmrHsVIAAMUvh.jpg\">the use of thickened liquids</a>, which explains why Hillary has been observed refusing bottles of water in favor of specially prepared glasses.</p></div>",
  "content_text": "That is the conclusion of a a board-certified Anesthesiologist with 36 years of experience, backed up by the observations of a) a victim of Parkinson’s Disease and b) a registered nurse who cares for patients with Parkinson’s Disease.\nHRC probably has PD\n.\nShe has had clinical symptoms for a minimum of 4 years, and probably much longer, given that the fall leading to her head injury required a significant progression of the disease. All of her bizarre physical actions since that time fit nicely into the spectrum of signs that we expect in PD. And since PD explains all of them, we have a high probability of a correct diagnosis. It has almost certainly been treated with levodopa. Some of her symptoms may be related to this drug treatment.\nIt is most curious that all of the bizarre physical signs seem to be in 2016 videos. HRC was a public figure in 2015, with a lot of campaign work underway. Yet all of the oddities seem to be within the last several months. This suggests a significant progression of her PD. We also know that her contact with the public has been rigidly controlled. She has not done news conferences during the campaign. These would be highly stressful to a PD sufferer and would elicit many PD signs.\nPD is a chronic disease with a downhill prognosis. HRC’s instability and frequent cough suggest that her PD is advanced. This is not a good outlook for someone running for the Presidency. The office of the President is one of the highest stress jobs in the world. Stress sets off PD episodes, which render the sufferer incapable of proper response.\nAt this point, a bit of speculation seems appropriate. HRC talks about her yoga sessions. But no one we know of has ever documented one. It is possible that this is cover for sessions designed to teach her coping mechanisms for PD or for rest breaks. Exhaustion makes PD worse.\nHRC’s coughing suggests that her swallowing disorder is advanced, placing her closer to an aspiration pneumonia that would disable or kill her. That’s bad enough, but PD has one more, even more dangerous step in its progression.\nRead the whole thing\nat Mike Cernovich’s place. This is more than a meme, it is a medical observation by an expert. It is increasingly obvious to even the most casual observer that something is seriously wrong with Hillary Clinton, and given what appears to be her rapid decline, it’s probably not something that the media can conceal for much longer the way they did with Woodrow Wilson, FDR, and John F. Kennedy.\nMike also noted on Twitter that the treatment for dysphagia is\nthe use of thickened liquids\n, which explains why Hillary has been observed refusing bottles of water in favor of specially prepared glasses.",
  "tags": [
    "health care",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-06T07:16:00+00:00"
}