{
  "url": "https://voxday.net/2016/09/23/mailvox-alt-rights-big-ten/",
  "scraped_at": "2025-12-18T01:55:48.176974",
  "title": "Mailvox: the Alt-Right’s big tent",
  "date_display": "September 23, 2016",
  "date_iso": "2016-09-23T09:48:00+00:00",
  "date_from_url": "2016-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader produces a graphic meant to illustrate the full spectrum of the broader Alt-Right. Agree with it or not, I think it is a good first start on beginning to meme the other aspects of the Alt-Right.</p><blockquote><p> Your observations on the intrinsic branches, or roots, of the Alt-Right greatly helped clarify my own understanding of how the “big tent” ideology and its connected sub-identities would best interact each other. I agree with you that a forward-looking, symbiotic mutualism between the distinct Alt-White and Alt-West branches is desirable at this time. The Alt-White Scotsmen busy administering purity tests, “that person is no true Alt-Right…” have obviously missed point #12: <i>The Alt-Right doesn’t care what you think of it</i>. Any branch on the Alt-Right tree that doesn’t shut up and produce desirable fruit will be best ignored until it withers away.</p><p>I also concur that the implicit tension between the two current branches of the Alt-Right is actually beneficial. There should be healthy, competitive tendency for each Alt-branch to seek out the most effective tactics for its immediate survival and subsequent growth. Attempts to impose one group’s identity &amp; tactics onto the other, or merge the two would be as effective as giving a marathon runner two right shoes and then tying his legs together.</p><p>In reading through the vigorous chiseling of the comments in the “ALTRIGHT: 16 POINTS”, I attempted to make an initial visual depiction of what I could grasp. At that time, I was primarily focused on symbolically distilling out some of the identity politics/tactics of the Alt-Right:</p><p>– Opposes the Left<br> – Opposes the ideas of Equality, Diversity, Tolerance, Progress, Control<br> – Fights on the identity/culture level<br> – Accepts any that are willing to fight who subscribe to some/all of its tenets<br> – Maintains the higher ground (what makes life better?)<br> – Recognizes the uphill fight requires more energy</br></br></br></br></br></p><p>It does have flaws, which I can recognize: seems to imply/advocate defensive or reactive tactics, much too wordy, doesn’t delineate between the Alt-branches, etc. Praise kek that it did, indeed, lead to a second, more successful attempt which is in more alignment with the clear, tactical understanding of the Alt-Right:</p><p>I. Alt-Right is forward-looking and not defensive.<br> II. Alt-White and Alt-West are independent and distinct branches.<br> III. Their success, either individually or together, results in success of the Alt-Right.<br> IV. Other Alt-branches can be added, as long as they share enough of the same philosophy and direction.<br> V. Alt-Lite can be considered allies, as long as they are not interfering with the two primary branches.<br> VI. Fighting between branches or internally within a branch is not constructive.<br> VII. Each branch can be arranged however they see fit (or add their own sub-branches, e.g. Alt-White:US and Alt-West:German).<br> VIII. Stronger individual branches and a broad collection of branches is ultimately beneficial to the Alt-Right<br> IX. No branch is more important than the others nor leads the other branches<br> X. The head of the Alt-Right is Pepe</br></br></br></br></br></br></br></br></br></p><p>This iconography does raise the question of “what other viable Alt-branches are there?” for the Alt-Right. I would not be surprised to see Alt-Masculinity be a potential ally given the success and philosophical direction of Roosh.</p></blockquote><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://3.bp.blogspot.com/-AYh0Osh8pUM/V-T1gEpKA9I/AAAAAAAACIU/g-UAPemiDFIwdqPChQtswEBVd1omdXE2QCLcB/s1600/altright2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"166\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/09/altright2.png\" width=\"400\"/></a></div><p> I would propose rather than “Alt-Lite groups”, the top six phalanxes represent intellectual strains, from Stormfront to NPI and the Dread Ilk. Or perhaps it would be more effective if six “leaders” were named, beginning with Richard Spencer, and for the lulz, Donald Trump. I leave it to the commenters to hash out which six individuals merit being named, but Jared Taylor and RamZPaul are two obvious candidates. Milo, not so much.</p><p>I also think, that for the purposes of Twitter meming, it would be best to have Alt-White on top, Alt-West in the middle, and Alt-Lite on the bottom, leaving out the word “Branch”, which is implied by the three separate groups. No meme should ever have a “fill-in-the blank” aspect to it.</p></div>",
  "content_text": "A reader produces a graphic meant to illustrate the full spectrum of the broader Alt-Right. Agree with it or not, I think it is a good first start on beginning to meme the other aspects of the Alt-Right.\nYour observations on the intrinsic branches, or roots, of the Alt-Right greatly helped clarify my own understanding of how the “big tent” ideology and its connected sub-identities would best interact each other. I agree with you that a forward-looking, symbiotic mutualism between the distinct Alt-White and Alt-West branches is desirable at this time. The Alt-White Scotsmen busy administering purity tests, “that person is no true Alt-Right…” have obviously missed point #12:\nThe Alt-Right doesn’t care what you think of it\n. Any branch on the Alt-Right tree that doesn’t shut up and produce desirable fruit will be best ignored until it withers away.\nI also concur that the implicit tension between the two current branches of the Alt-Right is actually beneficial. There should be healthy, competitive tendency for each Alt-branch to seek out the most effective tactics for its immediate survival and subsequent growth. Attempts to impose one group’s identity & tactics onto the other, or merge the two would be as effective as giving a marathon runner two right shoes and then tying his legs together.\nIn reading through the vigorous chiseling of the comments in the “ALTRIGHT: 16 POINTS”, I attempted to make an initial visual depiction of what I could grasp. At that time, I was primarily focused on symbolically distilling out some of the identity politics/tactics of the Alt-Right:\n– Opposes the Left\n– Opposes the ideas of Equality, Diversity, Tolerance, Progress, Control\n– Fights on the identity/culture level\n– Accepts any that are willing to fight who subscribe to some/all of its tenets\n– Maintains the higher ground (what makes life better?)\n– Recognizes the uphill fight requires more energy\nIt does have flaws, which I can recognize: seems to imply/advocate defensive or reactive tactics, much too wordy, doesn’t delineate between the Alt-branches, etc. Praise kek that it did, indeed, lead to a second, more successful attempt which is in more alignment with the clear, tactical understanding of the Alt-Right:\nI. Alt-Right is forward-looking and not defensive.\nII. Alt-White and Alt-West are independent and distinct branches.\nIII. Their success, either individually or together, results in success of the Alt-Right.\nIV. Other Alt-branches can be added, as long as they share enough of the same philosophy and direction.\nV. Alt-Lite can be considered allies, as long as they are not interfering with the two primary branches.\nVI. Fighting between branches or internally within a branch is not constructive.\nVII. Each branch can be arranged however they see fit (or add their own sub-branches, e.g. Alt-White:US and Alt-West:German).\nVIII. Stronger individual branches and a broad collection of branches is ultimately beneficial to the Alt-Right\nIX. No branch is more important than the others nor leads the other branches\nX. The head of the Alt-Right is Pepe\nThis iconography does raise the question of “what other viable Alt-branches are there?” for the Alt-Right. I would not be surprised to see Alt-Masculinity be a potential ally given the success and philosophical direction of Roosh.\nI would propose rather than “Alt-Lite groups”, the top six phalanxes represent intellectual strains, from Stormfront to NPI and the Dread Ilk. Or perhaps it would be more effective if six “leaders” were named, beginning with Richard Spencer, and for the lulz, Donald Trump. I leave it to the commenters to hash out which six individuals merit being named, but Jared Taylor and RamZPaul are two obvious candidates. Milo, not so much.\nI also think, that for the purposes of Twitter meming, it would be best to have Alt-White on top, Alt-West in the middle, and Alt-Lite on the bottom, leaving out the word “Branch”, which is implied by the three separate groups. No meme should ever have a “fill-in-the blank” aspect to it.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-23T08:48:00+00:00"
}