{
  "url": "https://voxday.net/2016/09/01/more-american-history/",
  "scraped_at": "2025-12-18T01:51:54.237602",
  "title": "More (((American))) history",
  "date_display": "September 1, 2016",
  "date_iso": "2016-09-01T09:26:00+00:00",
  "date_from_url": "2016-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In response to <a href=\"http://www.milobookclub.com/2016/08/30/assimilationist-liars/\">my pointing out the self-serving historical revisionism</a> of certain (((immigrants))), several people claimed that not only were there several Jews involved in the Revolutionary War, but that the war would not have been won without the financing of a Polish Jew by the name of Haym Solomon, who, I was informed, was “the primary financier” of the war.</p><p>Several of them cited a theme that I subsequently noticed on Twitter:</p><blockquote><p> Mac ‏@Macdad25<br> Haym Solomon was instrumental in financing the US in the Revolutionary War. So thank a Jew today</br></p><p>Mordechai Lightstone‏@Motte<br> @Yair_Rosenberg is @bryanjfischer aware that Jews helped win the Revolutionary War, including Haym Solomon who helped finance it?</br></p><p> Ina Gilmore ‏@inagilmore<br> Reading: <i>Forgotten Patriot The Story of Haym Solomon</i> by David Allen Lewis. Financed Revolutionary War with over 40 billion US 2005 dollars</br></p></blockquote><p>The implied idea that this forgotten patriot merited mention with the likes of George Washington and Thomas Jefferson due to his “instrumental”, and indeed, presumably single-handed financing of the war struck me as highly unlikely, although I supposed that since Messrs. (((Greenspan))), (((Bernanke))) and Ms (((Yellen))) have effectively destroyed 97 percent of the value of the current U.S. dollar, it was not entirely unthinkable that Mr. (((Haym))) might have been involved in whatever led to the phrase “not worth a Continental”. However, this notion was easily determined to be incorrect.</p><p>As is my custom once my B.S. detector is triggered, I looked into the documented facts of the matter. I learned the truth is that Haym Solomon was, in fact, a legitimate Revolutionary War hero. He was a spy, he was captured by the British twice, he risked his life for the colonial cause, and as the agent to the French consul as well as the paymaster for the French forces in North America, he was able to broker the sale of bills of exchange from France and Holland and help Robert Morris raise money for the war.</p><p>In all, he raised $650,000, a not-insubstantial sum, which amounts to $16,644,272.43 in 2015 dollars. (1913 to 2015 data is the CPI. Inflation data from 1665 to 1912 is from a historical study by  Robert Sahr at Oregon State University.)</p><p>However, it is also worth mentioning that $650,000 was 1/1327th of the total $862,688,500 that the <i>Journal of the American Revolution</i> <a href=\"https://allthingsliberty.com/2015/02/how-was-the-revolutionary-war-paid-for/\">estimates was spent</a> by the Continental Congress and various other revolutionary parties on the Revolutionary War. To say that Mr. Haym’s contribution to the winning effort is exaggerated by the revisionists is to put it mildly. And note that most of the significant efforts to honor that contribution were made more than 150 years later, well after the revisionists had begun rewriting American history.</p><ul><li>In 1939, Warner Brothers released <i>Sons of Liberty</i>, a short film starring Claude Rains as Salomon.</li><li>In 1941, the writer Howard Fast wrote a book <i>Haym Salomon, Son of Liberty</i>.</li><li>In 1941, the Heald Square Monument, a sculpture designed by Lorado Taft was erected at Wacker Drive and Wabash Avenue in downtown Chicago. Taft began the work but died in 1936. It was completed by his associate, Leonard Crunelle. The monument depicts George Washington flanked by Salomon and Robert Morris and grasping hands with both men.</li><li>In 1943, the United States liberty ship SS Haym Salomon was named in his honor</li><li>In 1946, a memorial statue was erected to Salomon at Hollenbeck Park in Los Angeles. The statue was rededicated in 2008 at Pan-Pacific Park in the Fairfax District, where it can be found on the corner of Gardner and Third Street.</li></ul><p>In summary, Haym Soloman’s legitimately heroic contributions to the American Revolution have been coopted, exaggerated, and weaponized as rhetoric in order to further the false historical revisionism of the deceitful, self-serving (((proponents))) of “the melting pot”, “the nation of immigrants”, and “Judeo-Christian values”. And those exaggerated contributions are now cited by various opponents of the Alt-Right in a futile effort to obscure the historical fact of America having been founded as a very real White and Christian nation, both material and distinct from the current multi-ethnic imperial state known as the USA.</p><p>These revisionist efforts are somewhat ironic, because Solomon’s domestic political efforts tend to support the Alt-Right’s perspective on history, identity politics, and the predictable effects of non-native interference in politics.</p><ul><li><i>In 1783, Salomon was among the prominent Jews involved in the successful effort to have the Pennsylvania Council of Censors remove the religious test oath required for office-holding under the State Constitution.</i></li></ul><div> Plus ça change, plus c’est la même chose. <a href=\"http://www.campaign1776.org/revolutionary-war/facts-of-the-american.html?referrer=http://www.campaign1776.org?referrer=http://www.campaign1776.org/revolutionary-war/facts-of-the-american.html\">Furthermore</a>, of the 376,000 Continental soldiers and militia members who fought in the Revolutionary War, less than 100 were Jews. It is also interesting to note that only 7,000 blacks fought for the revolutionaries, versus 20,000 blacks who fought for the British.</div></div>",
  "content_text": "In response to\nmy pointing out the self-serving historical revisionism\nof certain (((immigrants))), several people claimed that not only were there several Jews involved in the Revolutionary War, but that the war would not have been won without the financing of a Polish Jew by the name of Haym Solomon, who, I was informed, was “the primary financier” of the war.\nSeveral of them cited a theme that I subsequently noticed on Twitter:\nMac ‏@Macdad25\nHaym Solomon was instrumental in financing the US in the Revolutionary War. So thank a Jew today\nMordechai Lightstone‏@Motte\n@Yair_Rosenberg is @bryanjfischer aware that Jews helped win the Revolutionary War, including Haym Solomon who helped finance it?\nIna Gilmore ‏@inagilmore\nReading:\nForgotten Patriot The Story of Haym Solomon\nby David Allen Lewis. Financed Revolutionary War with over 40 billion US 2005 dollars\nThe implied idea that this forgotten patriot merited mention with the likes of George Washington and Thomas Jefferson due to his “instrumental”, and indeed, presumably single-handed financing of the war struck me as highly unlikely, although I supposed that since Messrs. (((Greenspan))), (((Bernanke))) and Ms (((Yellen))) have effectively destroyed 97 percent of the value of the current U.S. dollar, it was not entirely unthinkable that Mr. (((Haym))) might have been involved in whatever led to the phrase “not worth a Continental”. However, this notion was easily determined to be incorrect.\nAs is my custom once my B.S. detector is triggered, I looked into the documented facts of the matter. I learned the truth is that Haym Solomon was, in fact, a legitimate Revolutionary War hero. He was a spy, he was captured by the British twice, he risked his life for the colonial cause, and as the agent to the French consul as well as the paymaster for the French forces in North America, he was able to broker the sale of bills of exchange from France and Holland and help Robert Morris raise money for the war.\nIn all, he raised $650,000, a not-insubstantial sum, which amounts to $16,644,272.43 in 2015 dollars. (1913 to 2015 data is the CPI. Inflation data from 1665 to 1912 is from a historical study by  Robert Sahr at Oregon State University.)\nHowever, it is also worth mentioning that $650,000 was 1/1327th of the total $862,688,500 that the\nJournal of the American Revolution\nestimates was spent\nby the Continental Congress and various other revolutionary parties on the Revolutionary War. To say that Mr. Haym’s contribution to the winning effort is exaggerated by the revisionists is to put it mildly. And note that most of the significant efforts to honor that contribution were made more than 150 years later, well after the revisionists had begun rewriting American history.\nIn 1939, Warner Brothers released\nSons of Liberty\n, a short film starring Claude Rains as Salomon.\nIn 1941, the writer Howard Fast wrote a book\nHaym Salomon, Son of Liberty\n.\nIn 1941, the Heald Square Monument, a sculpture designed by Lorado Taft was erected at Wacker Drive and Wabash Avenue in downtown Chicago. Taft began the work but died in 1936. It was completed by his associate, Leonard Crunelle. The monument depicts George Washington flanked by Salomon and Robert Morris and grasping hands with both men.\nIn 1943, the United States liberty ship SS Haym Salomon was named in his honor\nIn 1946, a memorial statue was erected to Salomon at Hollenbeck Park in Los Angeles. The statue was rededicated in 2008 at Pan-Pacific Park in the Fairfax District, where it can be found on the corner of Gardner and Third Street.\nIn summary, Haym Soloman’s legitimately heroic contributions to the American Revolution have been coopted, exaggerated, and weaponized as rhetoric in order to further the false historical revisionism of the deceitful, self-serving (((proponents))) of “the melting pot”, “the nation of immigrants”, and “Judeo-Christian values”. And those exaggerated contributions are now cited by various opponents of the Alt-Right in a futile effort to obscure the historical fact of America having been founded as a very real White and Christian nation, both material and distinct from the current multi-ethnic imperial state known as the USA.\nThese revisionist efforts are somewhat ironic, because Solomon’s domestic political efforts tend to support the Alt-Right’s perspective on history, identity politics, and the predictable effects of non-native interference in politics.\nIn 1783, Salomon was among the prominent Jews involved in the successful effort to have the Pennsylvania Council of Censors remove the religious test oath required for office-holding under the State Constitution.\nPlus ça change, plus c’est la même chose.\nFurthermore\n, of the 376,000 Continental soldiers and militia members who fought in the Revolutionary War, less than 100 were Jews. It is also interesting to note that only 7,000 blacks fought for the revolutionaries, versus 20,000 blacks who fought for the British.",
  "tags": [
    "#AltRight",
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-01T08:26:00+00:00"
}