{
  "url": "https://voxday.net/2016/09/02/nobody-ever-did-nothing/",
  "scraped_at": "2025-12-18T01:52:07.232706",
  "title": "The Balkanization of SF/F",
  "date_display": "September 2, 2016",
  "date_iso": "2016-09-02T09:23:00+00:00",
  "date_from_url": "2016-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the course of his long, deep dive into historical science fiction and fantasy, Castalia’s Jeffro Johnson <a href=\"http://www.castaliahouse.com/dawn-of-the-skeksis-science-fictions-most-damaging-split/\">has noticed a few trends</a>:</p><blockquote><p> We’ve spent a lot of time here delving into the ups and downs of several movements within science fiction and fantasy– the Campbellian Revolution, the New Wave, the tremendous changes that occurred in publishing in the late seventies, etc. We’ve broken stories here uncovering how both fandom and publishing are pretty well divorced from the pulp era today. Most things the casual reader has heard about the pulps are flat out wrong. Even just the news that fans in the seventies would have been familiar with a good seven decade’s worth of fantasy and science fiction classics generally comes as a shock to people.</p><p>As we’ve delved into the history of the field, the year 1980 seems to keep coming up as a major turning point. It’s a running theme, really. Just as one example of that: I have repeatedly hammered the point of how ideologically diverse fantasy and science fiction was in the seventies. Orson Scott Card says that all changed in the eighties. Here’s another: people writing negative reviews about books they used to love when they were kids? It’s almost like whole swaths of people have been actively conditioned to despise anything written before 1980!</p><p>Now, there really is something to this. It is very difficult to talk about this in mixed company, too. For one thing, there’s always people like Sheila Williams around that are quick to point out that times change. If she has a sufficiently large Greek Chorus on hand, every single observation about what’s happening gets dismissed to the point where nothing ever seems to have happened and there are practically no trends whatsoever. The subtext is always, “nothing to see here.”</p><p>I have to say, though, “times change” and “there are no trends” do not add up.</p><p>So where does that leave us? It means that something happened and it’s danged hard to talk about it. Let’s say we get all the boring people out of the room, pour a couple of beers, and take a stab at figuring this out. We still won’t get anywhere. Why not? Because the one thing you can’t do in these conversations is indicate that maybe someone somewhere maybe had a hand in bringing this about.</p><p>What happens if you veer into that territory? People get very uncomfortable very quickly. You’re not, uh, some kind of conspiracy theorist, are you?! It’s weird, too. The more documented evidence you have to back up your observations, the crazier you look. You might as well not even try. The conversation will not recover from otherwise intelligent people bending over backwards to make sure you know that they want nothing to do with this. Also, they will laugh at you!</p></blockquote><p>Brad Torgersen cites MC Hogarth’s comments on her con experiences, and <a href=\"https://bradrtorgersen.wordpress.com/2016/08/26/the-mote-in-gernsbacks-eye/\">notes that intolerance has become the chief hallmark</a> of the Tolerant Equalitarian Progressive Inclusive and Diverse SF-SJWs.</p><blockquote><p> <i>I attended a con once where the toastmaster said that they wanted all conservatives to “hurry up and die and leave the planet to the rest of us. No wait, they can stay as long as we can have their money.” And people applauded. That person wasn’t kicked out of the convention. They were feted and congratulated while I sat in the audience, pale and trembling, listening to the people around me cheer my demise. I have never, ever forgotten that moment. Or all the threatening ones after, both generalized or intimate, like the man who leaned into my face and told me the world would be better off without me and people like me. No one stepped in to tell him that he shouldn’t say such things. The people standing around us just nodded or smiled. One of them even said before leaving, “Your time is over. We don’t need you anymore, [expletive here].”</i></p><p>The mandarins of SF/F expend a lot of energy wrapping themselves in the flag of tolerance. But as any conservative can tell you, that tolerance runs pretty much one-way. A tolerance conversation (liberal to conservative) in SF/F often goes like this, “Hello, I am a tolerant caring compassionate liberal, and you’re not. You will sit there and politely listen to all of my ideas and theories, and not say a word. I will sit here and listen to all of your ideas and theories, and then I will explain to you why you’re a dirty bigot and a hater and an evil human being. We will both agree I am right, and you will apologize for being bad.”</p><p>That, dear friends, is how “tolerance” works in SF/F at this time.</p><p>I’ve discussed this at length with Orson Scott Card — he being well acquainted with the tolerance charade — and he says it didn’t used to be like this before 1980. Oh, to be sure, there were plenty of fans, authors, and editors on the left-wing side of the aisle. But it wasn’t so vindictive, nor so personal. You could sit at a table with conservatives, liberals, anarchists, libertarians, and have a rousing verbal melee of competing ideas, but at the end of it, you’d still be able to shake hands, and walk away comrades in the field. That began to change (perhaps not coincidentally) about the time Ronald Reagan took his seat in the Oval Office. Gradually, in dribs and drabs, the dominant left-wing culture of SF/F has traded in true tolerance, for a kind of totalitarian double-think 1984 version of tolerance — people and ideas labeled ‘intolerant’ don’t have to be tolerated. In 2016, with tender snowflakes floating around in SF/F like it’s a mild blizzard, anyone can be labeled ‘intolerant’ for any reason, logical or not.</p></blockquote><p>It’s a little strange that the SF-SJWs still don’t understand that the trends that once so favored them are increasingly weighted against them. They’ve poisoned at least one-third, and possibly as much as two-thirds of their former audience against them, and while they’re mocking million-selling self-published authors as “vanity authors” and growing publishing houses such as Castalia as “vanity presses”, the gates they’ve been keeping with such vigilance are protecting towers of increasingly negative worth, as mainstream publishers are suing even very successful authors <a href=\"https://www.theguardian.com/books/2016/aug/31/pride-and-prejudice-and-zombies-author-sued-by-publisher-hachette-seth-grahame-smith\">to take their advances back</a>.</p><p>Meanwhile, Castalia House is already selling more books than any but the very biggest authors in science fiction. We passed 50 books in our catalog last month, and we are now receiving an increasing number of submissions from familiar names and even SFWA members. We’ve just begun to make foreign rights deals and develop our relationships with traditional foreign publishers, and perhaps most surprisingly of all, in August, 24 percent of our sales were in print.</p><p>SF/F has already been balkanized. They stopped reading our stuff in the mid-1980s and we began to stop reading theirs in the mid-2000s. Since our side is bigger than theirs, our authors are already bigger than theirs, they just don’t realize that Vaughn Heppner, BV Larson, and David VanDyke sell millions of books to their hundreds of thousands. Do you know who was the #1 SF author on Amazon in 2011? Castalia House’s own Nick Cole.</p><p>And as more moderate readers give up on Pink SF and stop buying from SJW-converged publishers like Tor Books, we’ll continue to grow and they’ll continue to shrink. As evidence, <a href=\"https://bradrtorgersen.wordpress.com/2016/08/26/the-mote-in-gernsbacks-eye/#comment-19056\">consider this comment</a> from Brad Torgersen’s site:</p><blockquote class=\"tr_bq\"><p> I feel the call to give my testimony re Balkanization … I’m already gone. I’m a reader and a fan, not a writer. Not a TrueFan, but a fan on my own terms. I cannot remember the last time I bought a SFF novel that was published by any ancien regime publisher other than Baen. I’ve been a voter in the Hugos a couple times – what I read in those packets was largely ho-hum wastes of time. Some of the Sad noms were interesting, but not all. When I saw the title Space Raptor on this year’s list, I turned away for the final time – clearly, VD has taken the field and a little part of me hopes he burns it and salts it for a thousand years, but I have no interest in being part of that movement.</p></blockquote><p>Ah, yes. It’s like hearing angels sing.</p></div>",
  "content_text": "In the course of his long, deep dive into historical science fiction and fantasy, Castalia’s Jeffro Johnson\nhas noticed a few trends\n:\nWe’ve spent a lot of time here delving into the ups and downs of several movements within science fiction and fantasy– the Campbellian Revolution, the New Wave, the tremendous changes that occurred in publishing in the late seventies, etc. We’ve broken stories here uncovering how both fandom and publishing are pretty well divorced from the pulp era today. Most things the casual reader has heard about the pulps are flat out wrong. Even just the news that fans in the seventies would have been familiar with a good seven decade’s worth of fantasy and science fiction classics generally comes as a shock to people.\nAs we’ve delved into the history of the field, the year 1980 seems to keep coming up as a major turning point. It’s a running theme, really. Just as one example of that: I have repeatedly hammered the point of how ideologically diverse fantasy and science fiction was in the seventies. Orson Scott Card says that all changed in the eighties. Here’s another: people writing negative reviews about books they used to love when they were kids? It’s almost like whole swaths of people have been actively conditioned to despise anything written before 1980!\nNow, there really is something to this. It is very difficult to talk about this in mixed company, too. For one thing, there’s always people like Sheila Williams around that are quick to point out that times change. If she has a sufficiently large Greek Chorus on hand, every single observation about what’s happening gets dismissed to the point where nothing ever seems to have happened and there are practically no trends whatsoever. The subtext is always, “nothing to see here.”\nI have to say, though, “times change” and “there are no trends” do not add up.\nSo where does that leave us? It means that something happened and it’s danged hard to talk about it. Let’s say we get all the boring people out of the room, pour a couple of beers, and take a stab at figuring this out. We still won’t get anywhere. Why not? Because the one thing you can’t do in these conversations is indicate that maybe someone somewhere maybe had a hand in bringing this about.\nWhat happens if you veer into that territory? People get very uncomfortable very quickly. You’re not, uh, some kind of conspiracy theorist, are you?! It’s weird, too. The more documented evidence you have to back up your observations, the crazier you look. You might as well not even try. The conversation will not recover from otherwise intelligent people bending over backwards to make sure you know that they want nothing to do with this. Also, they will laugh at you!\nBrad Torgersen cites MC Hogarth’s comments on her con experiences, and\nnotes that intolerance has become the chief hallmark\nof the Tolerant Equalitarian Progressive Inclusive and Diverse SF-SJWs.\nI attended a con once where the toastmaster said that they wanted all conservatives to “hurry up and die and leave the planet to the rest of us. No wait, they can stay as long as we can have their money.” And people applauded. That person wasn’t kicked out of the convention. They were feted and congratulated while I sat in the audience, pale and trembling, listening to the people around me cheer my demise. I have never, ever forgotten that moment. Or all the threatening ones after, both generalized or intimate, like the man who leaned into my face and told me the world would be better off without me and people like me. No one stepped in to tell him that he shouldn’t say such things. The people standing around us just nodded or smiled. One of them even said before leaving, “Your time is over. We don’t need you anymore, [expletive here].”\nThe mandarins of SF/F expend a lot of energy wrapping themselves in the flag of tolerance. But as any conservative can tell you, that tolerance runs pretty much one-way. A tolerance conversation (liberal to conservative) in SF/F often goes like this, “Hello, I am a tolerant caring compassionate liberal, and you’re not. You will sit there and politely listen to all of my ideas and theories, and not say a word. I will sit here and listen to all of your ideas and theories, and then I will explain to you why you’re a dirty bigot and a hater and an evil human being. We will both agree I am right, and you will apologize for being bad.”\nThat, dear friends, is how “tolerance” works in SF/F at this time.\nI’ve discussed this at length with Orson Scott Card — he being well acquainted with the tolerance charade — and he says it didn’t used to be like this before 1980. Oh, to be sure, there were plenty of fans, authors, and editors on the left-wing side of the aisle. But it wasn’t so vindictive, nor so personal. You could sit at a table with conservatives, liberals, anarchists, libertarians, and have a rousing verbal melee of competing ideas, but at the end of it, you’d still be able to shake hands, and walk away comrades in the field. That began to change (perhaps not coincidentally) about the time Ronald Reagan took his seat in the Oval Office. Gradually, in dribs and drabs, the dominant left-wing culture of SF/F has traded in true tolerance, for a kind of totalitarian double-think 1984 version of tolerance — people and ideas labeled ‘intolerant’ don’t have to be tolerated. In 2016, with tender snowflakes floating around in SF/F like it’s a mild blizzard, anyone can be labeled ‘intolerant’ for any reason, logical or not.\nIt’s a little strange that the SF-SJWs still don’t understand that the trends that once so favored them are increasingly weighted against them. They’ve poisoned at least one-third, and possibly as much as two-thirds of their former audience against them, and while they’re mocking million-selling self-published authors as “vanity authors” and growing publishing houses such as Castalia as “vanity presses”, the gates they’ve been keeping with such vigilance are protecting towers of increasingly negative worth, as mainstream publishers are suing even very successful authors\nto take their advances back\n.\nMeanwhile, Castalia House is already selling more books than any but the very biggest authors in science fiction. We passed 50 books in our catalog last month, and we are now receiving an increasing number of submissions from familiar names and even SFWA members. We’ve just begun to make foreign rights deals and develop our relationships with traditional foreign publishers, and perhaps most surprisingly of all, in August, 24 percent of our sales were in print.\nSF/F has already been balkanized. They stopped reading our stuff in the mid-1980s and we began to stop reading theirs in the mid-2000s. Since our side is bigger than theirs, our authors are already bigger than theirs, they just don’t realize that Vaughn Heppner, BV Larson, and David VanDyke sell millions of books to their hundreds of thousands. Do you know who was the #1 SF author on Amazon in 2011? Castalia House’s own Nick Cole.\nAnd as more moderate readers give up on Pink SF and stop buying from SJW-converged publishers like Tor Books, we’ll continue to grow and they’ll continue to shrink. As evidence,\nconsider this comment\nfrom Brad Torgersen’s site:\nI feel the call to give my testimony re Balkanization … I’m already gone. I’m a reader and a fan, not a writer. Not a TrueFan, but a fan on my own terms. I cannot remember the last time I bought a SFF novel that was published by any ancien regime publisher other than Baen. I’ve been a voter in the Hugos a couple times – what I read in those packets was largely ho-hum wastes of time. Some of the Sad noms were interesting, but not all. When I saw the title Space Raptor on this year’s list, I turned away for the final time – clearly, VD has taken the field and a little part of me hopes he burns it and salts it for a thousand years, but I have no interest in being part of that movement.\nAh, yes. It’s like hearing angels sing.",
  "tags": [
    "Castalia House",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-02T08:23:00+00:00"
}