{
  "url": "https://voxday.net/2016/09/01/nrx-and-altrig/",
  "scraped_at": "2025-12-18T01:52:01.778149",
  "title": "NRx and AltRight",
  "date_display": "September 1, 2016",
  "date_iso": "2016-09-01T18:24:00+00:00",
  "date_from_url": "2016-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although a few people have attempted to shoehorn me into the “Dark Enlightenment” or classify me as a “Neoreactionary”, I’ve never considered myself part of NRx like I do the AltRight. That’s mostly because I don’t think NRx exists in the same material manner that the AltRight clearly does, and also because I find its preference for elevated Akademiesprache to be obscurantist faggotry, to put it in AltRight terms. And frankly, Butch Leghorn’s <a href=\"https://poseidonawoke.wordpress.com/2016/08/31/nrx-vs-altright/\">attempt to delineate the essential differences</a> between the two doesn’t appear to be particularly meaningful, as he attempts to do so primarily on the basis of social class.</p><blockquote><p> <b>NRx is Middle Class</b></p><p>According to Curt’s table, NRx is middle class. Some might take offense and argue that it is upper-middle class. Sure, the leaders of NRx are likely upper-middle class, but the average NRxer is solidly middle class. Software engineering is a middle class profession. People who run teams of middle class professionals are upper-middle class (CTOs, CIOs, CEOs, Directors, etc). The middle class is not a salary range: it is an ability range. The middle class are those who have the ability to engage in the system of production. This is why the middle class seeks liberty: because given freedom to choose their means of production, they will choose and perform, because they can. As an aside, this is why working classes are less interested in liberty, because they simply can’t capitalize on it within the system of production to nearly the level of the middle class. And the lower and under classes have zero interest in liberty, because they are completely unable to capitalize within the system of production; they desire security, not liberty (and that’s what self-interested politicians trade them in return for votes).</p><p>We can argue about the parameters of classes, and we should. We should define them. We need to understand their roles and to define the behaviors that makes one a ‘good’ member of any class, because these behaviors and actors do exist in every class. We just need to incentivize them properly, which is why we must define and understand them.</p><p>The middle class has certain behaviors which make them middle class. They follow norms of propriety. I was right when I wrote that NRx is Right Brahmin Signalling. From the SJW encyclopedia: “Brahmin is a varna (caste) in Hinduism specialising as priests, teachers (acharya) and protectors of sacred learning across generations”. NRx is a group of teachers and priests, solidly middle class and exhibiting middle class mores and norms, such as the prohibition on ridicule, mockery, libel and slander.</p><p><b>AltRight is Working Class</b></p><p>The working classes do not share the middle class values and prohibitions on ridicule, mockery, libel and slander. I have seen very clearly the revulsion of NRx to the coarse meming of the AltRight. The NRx aspersions about ‘populism’ of the AltRight. This is simply the middle class reaction to working class norms.</p><p>The thing is: the middle class needs the working class. They will do the jobs that the middle class just won’t do. Say, for example, openly attack with vitriolic hostility the enemies of Western Civilization using Pepe and Le Happy Merchant memes. Or say, engage in ‘high energy’ physical activities which raise the cost of the status quo on the controlling elite. Once the cost of the status quo is high enough, then that controlling elite will accede to the demands of the Right. Who will formulate these demands? Ultimately, the aristocratic class will, with large input from the scholarly classes. Who will implement these demands at the local levels? Obviously, the people who organize all production, the middle class, under the direction of the upper middle class, with the ‘real’ work being done by the working classes at the direction of the middle class.</p></blockquote><p>This strikes me as a failure to grasp the AltRight, much as various attempts by everyone from NPR to NRO have failed, albeit a considerably more friendly failure. Actually, to be fair, it’s considerably better than NPR managed, as NPR somehow managed to get itself so confused that it declared Milo and Allum to be the joint leaders of the AltRight, which was certainly a surprise to both of them as well as everyone else.</p><p>While Butch is correct to observe that AltRight is not beholden to conventional middle class concerns about niceness and etiquette and public approval from the authorities and goodthinkers, he fails to observe that the AltRight is, despite its exuberant vulgarity, every bit as intellectually formidable as NRx. Indeed, even the mainstream media has felt the need to warn the unsuspecting and the uninformed not to underestimate us simply because we utilize frog memes and some of the most appallingly crude forms of rhetoric.</p><p>I have nothing against NRx, and indeed, consider them to be more or less allies, but the idea that we need them in order to formulate a moral license to defend our nations or Western civilization is simply not the case. Butch himself says that “NRx will become an integral part in granting this moral license or it will fade into irrelevancy”, which is why I expect that the compatible elements of NRx will eventually be subsumed by the AltRight, while the incompatible elements – and I have no idea which elements are compatible and which are not – will become increasingly irrelevant over time.</p><p>The AltRight has high energy, it has enthusiasm, it has talent, it has brains, and most importantly, it has courage. It understands that it has very little, if anything, to lose, because if the West fails, the future is favelas as far as the eye can see. We have no need of delicate middle-class intellectuals to do our thinking for us because they daren’t soil their uncalloused hands with the necessary dirty work.</p><p>To paraphrase #GamerGate, stop pontificating, shut up, and meme.</p></div>",
  "content_text": "Although a few people have attempted to shoehorn me into the “Dark Enlightenment” or classify me as a “Neoreactionary”, I’ve never considered myself part of NRx like I do the AltRight. That’s mostly because I don’t think NRx exists in the same material manner that the AltRight clearly does, and also because I find its preference for elevated Akademiesprache to be obscurantist faggotry, to put it in AltRight terms. And frankly, Butch Leghorn’s\nattempt to delineate the essential differences\nbetween the two doesn’t appear to be particularly meaningful, as he attempts to do so primarily on the basis of social class.\nNRx is Middle Class\nAccording to Curt’s table, NRx is middle class. Some might take offense and argue that it is upper-middle class. Sure, the leaders of NRx are likely upper-middle class, but the average NRxer is solidly middle class. Software engineering is a middle class profession. People who run teams of middle class professionals are upper-middle class (CTOs, CIOs, CEOs, Directors, etc). The middle class is not a salary range: it is an ability range. The middle class are those who have the ability to engage in the system of production. This is why the middle class seeks liberty: because given freedom to choose their means of production, they will choose and perform, because they can. As an aside, this is why working classes are less interested in liberty, because they simply can’t capitalize on it within the system of production to nearly the level of the middle class. And the lower and under classes have zero interest in liberty, because they are completely unable to capitalize within the system of production; they desire security, not liberty (and that’s what self-interested politicians trade them in return for votes).\nWe can argue about the parameters of classes, and we should. We should define them. We need to understand their roles and to define the behaviors that makes one a ‘good’ member of any class, because these behaviors and actors do exist in every class. We just need to incentivize them properly, which is why we must define and understand them.\nThe middle class has certain behaviors which make them middle class. They follow norms of propriety. I was right when I wrote that NRx is Right Brahmin Signalling. From the SJW encyclopedia: “Brahmin is a varna (caste) in Hinduism specialising as priests, teachers (acharya) and protectors of sacred learning across generations”. NRx is a group of teachers and priests, solidly middle class and exhibiting middle class mores and norms, such as the prohibition on ridicule, mockery, libel and slander.\nAltRight is Working Class\nThe working classes do not share the middle class values and prohibitions on ridicule, mockery, libel and slander. I have seen very clearly the revulsion of NRx to the coarse meming of the AltRight. The NRx aspersions about ‘populism’ of the AltRight. This is simply the middle class reaction to working class norms.\nThe thing is: the middle class needs the working class. They will do the jobs that the middle class just won’t do. Say, for example, openly attack with vitriolic hostility the enemies of Western Civilization using Pepe and Le Happy Merchant memes. Or say, engage in ‘high energy’ physical activities which raise the cost of the status quo on the controlling elite. Once the cost of the status quo is high enough, then that controlling elite will accede to the demands of the Right. Who will formulate these demands? Ultimately, the aristocratic class will, with large input from the scholarly classes. Who will implement these demands at the local levels? Obviously, the people who organize all production, the middle class, under the direction of the upper middle class, with the ‘real’ work being done by the working classes at the direction of the middle class.\nThis strikes me as a failure to grasp the AltRight, much as various attempts by everyone from NPR to NRO have failed, albeit a considerably more friendly failure. Actually, to be fair, it’s considerably better than NPR managed, as NPR somehow managed to get itself so confused that it declared Milo and Allum to be the joint leaders of the AltRight, which was certainly a surprise to both of them as well as everyone else.\nWhile Butch is correct to observe that AltRight is not beholden to conventional middle class concerns about niceness and etiquette and public approval from the authorities and goodthinkers, he fails to observe that the AltRight is, despite its exuberant vulgarity, every bit as intellectually formidable as NRx. Indeed, even the mainstream media has felt the need to warn the unsuspecting and the uninformed not to underestimate us simply because we utilize frog memes and some of the most appallingly crude forms of rhetoric.\nI have nothing against NRx, and indeed, consider them to be more or less allies, but the idea that we need them in order to formulate a moral license to defend our nations or Western civilization is simply not the case. Butch himself says that “NRx will become an integral part in granting this moral license or it will fade into irrelevancy”, which is why I expect that the compatible elements of NRx will eventually be subsumed by the AltRight, while the incompatible elements – and I have no idea which elements are compatible and which are not – will become increasingly irrelevant over time.\nThe AltRight has high energy, it has enthusiasm, it has talent, it has brains, and most importantly, it has courage. It understands that it has very little, if anything, to lose, because if the West fails, the future is favelas as far as the eye can see. We have no need of delicate middle-class intellectuals to do our thinking for us because they daren’t soil their uncalloused hands with the necessary dirty work.\nTo paraphrase #GamerGate, stop pontificating, shut up, and meme.",
  "tags": [
    "#AltRight",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-01T17:24:00+00:00"
}