{
  "url": "https://voxday.net/2016/09/21/of-alt-west-and-alt-white/",
  "scraped_at": "2025-12-18T01:55:30.793524",
  "title": "Of Alt-West and Alt-White",
  "date_display": "September 21, 2016",
  "date_iso": "2016-09-21T15:00:00+00:00",
  "date_from_url": "2016-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The question is not whether there are at least two distinct branches of the Alt-Right already or not, but whether the Alt-White branch can get its swastika panties sufficiently unbunched to cooperate with the Alt-West and the Alt-Lite in the pursuit of its stated objectives, or if it is more interested in competitive navel-gazing and purity-spiraling.</p><p>After a few run-ins with true-believing Stormfronters who have been Alt-Right since the distant dawn of primordial identity politics in 2010, both here and on Twitter, it has become abundantly clear that the combination of a legitimate fear of entryism and an understandable case of spotlight envy, the Alt-White is having some serious trouble dealing with the inevitable problems of success and popularity.</p><p>It’s rather like a company that has sales that are rapidly growing. The increase in demand for your products is great, but it is still a real problem. How are you going to get the additional products made? How are you going to pay for them? Are these new customers going to stick around or will they disappear before you can even expand your manufacturing capacity? These are good problems to have, but they are definitely problems that will need to be addressed.</p><p>First, is a distinction really necessary? Yes, without question. This should be obvious, since Alt-White, Alt-West, and Alt-Light are all different strains of identity-based thought that are all also observably distinct from mainstream conservatism or libertarianism. In this sense, all three are ALTernatives to the traditional RIGHT. Hence the Spencer-coined term.</p><p>Second, should all three be considered Alt-Right? Here I would argue no, that while it is reasonable to describe both Alt-White and Alt-West as Alt-Right, the Alt-Lite should not be. The reason is that while both Alt-White and Alt-West sign on to the greater part of <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">the 16 Points of the Alt-Right</a> I’ve laid out, and which most Alt-Rightists have generally endorsed, the various people who make up the Alt-Lite are all over the place with regards to most of them.</p><p>The Alt-Lite, in other words, is the larval form of the Alt-Right, which means that they are not, practically speaking, Alt-Right in any meaningful or functional sense. They are merely those still undergoing the intellectual transition that most Alt-Rightists have made, at one point or another. Alt-Lite is a transitional stage, not an end point.</p><p>By contrast, the Alt-White and Alt-West are both destinations. Once one gravitates towards one branch or the other, or as may be the case, is directed there by virtue of one’s identity, one is simply not going to eventually move towards the other one. This leads us to the third question, what are the key differences between the Alt-White and the Alt-West. The following are my observations; I am quite willing to be corrected by someone who can speak more credibly for the Alt-White.</p><ol><li>Alt-White is for whites only. Alt-West is pan-racial and pan-national, which should not be confused with being multicultural or equalitarian or pro-diversity in the egalitarian sense.</li><li>Alt-White is primarily concerned with white nationalism, and secondarily concerned with European nationalisms. Within the Alt-White, there is already a discussion concerning what the difference between a generic white nationalism and the specific European nationalisms are; I suspect there will eventually be a further distinction between American and European branches of the Alt-White. While the Alt-West supports white nationalism, that is not its sole concern, as it supports all nationalism, European or otherwise.</li><li>Alt-White is neutral to hostile on Christianity. Alt-West is strongly pro-Christian, as it believes Christianity to be one of the three pillars of Western Civilization aka the historical Christendom. Pro-Christian includes, but does not require, actually being a Christian.</li><li>Alt-White is neutral to hostile on Israel. Alt-West is pro-Israel, as it supports all nationalist homelands.</li><li>Alt-White is hostile to very hostile to all Jews everywhere. Alt-West is friendly to Israeli Jews while hostile to globalist Jews and anti-nationalist Jews.</li><li>Alt-White has a romantic view of National Socialism. Alt-West regards it as a suicidally stupid but semiotically useful form of German nationalism.</li><li>Alt-White is neutral to pro-white imperialism. Alt-West is anti-imperialism, as it regards imperalism as being societally enervating and self-destructive.</li></ol><p>As you can see, within the context of both the 16 Points and the grand political spectrum, Alt-White and Alt-West are largely in accord. They generally share a philosophy and a direction, but their priorities and perspectives are different. More importantly, with the possible exception of Christianity in the long term, there is very little reason for conflict between Alt-White and Alt-West, indeed, the distinction between the two eliminates the Alt-White’s primary objection to the Alt-West, which is the possibility of  being sidelined by the media and by the larger potential appeal of the Alt-West.</p><p>Some have accused me, and Milo, and several others, of wanting to assume the mantle of leading the Alt-Right. That is the exact opposite of the truth. In fact, one personal benefit of articulating the distinction between the two primary branches of the Alt-Right is that it makes it clear that a) there can be no unitary leader, and b) even if there could be, that unitary leader could not possibly be me due to my identity as an American Indian and member of La Raza.</p><p>The more significant benefit is to quell the fears of the Alt-White that they will be sidelined by their more numerous allies. But the Alt-West needs nothing from the Alt-White, and by establishing a separate identity, a much broader spectrum of members are made possible while respecting the rigid borders of the Alt-White. Regardless, the simple fact of the matter is that the Alt-White is not the only alternative to mainstream conservatism.</p><p>There are much bigger battles ahead than settling the question of whether Christianity is a necessary component of Western Civilization or not. Because we know the white race is absolutely a necessary component of it, and that is why, whether one is inclined towards the Alt-White or the Alt-West, every member of the Alt-Right who values both whites and the West has immediate and mid-range objectives remain exactly the same.</p><p>As before, this is not intended to be a definitive delineation of the differences between the two branches of the Alt-Right, but the starting point for an intelligent discussion. Keep it civil and substantive as those more interested in posturing will be spammed. As for those who will claim that Alt-West, Alt-White, and Alt-Lite are not genuine “things”, keep in mind that as a political taxonomist, I am creating nothing. I am merely describing what observably already exists.</p></div>",
  "content_text": "The question is not whether there are at least two distinct branches of the Alt-Right already or not, but whether the Alt-White branch can get its swastika panties sufficiently unbunched to cooperate with the Alt-West and the Alt-Lite in the pursuit of its stated objectives, or if it is more interested in competitive navel-gazing and purity-spiraling.\nAfter a few run-ins with true-believing Stormfronters who have been Alt-Right since the distant dawn of primordial identity politics in 2010, both here and on Twitter, it has become abundantly clear that the combination of a legitimate fear of entryism and an understandable case of spotlight envy, the Alt-White is having some serious trouble dealing with the inevitable problems of success and popularity.\nIt’s rather like a company that has sales that are rapidly growing. The increase in demand for your products is great, but it is still a real problem. How are you going to get the additional products made? How are you going to pay for them? Are these new customers going to stick around or will they disappear before you can even expand your manufacturing capacity? These are good problems to have, but they are definitely problems that will need to be addressed.\nFirst, is a distinction really necessary? Yes, without question. This should be obvious, since Alt-White, Alt-West, and Alt-Light are all different strains of identity-based thought that are all also observably distinct from mainstream conservatism or libertarianism. In this sense, all three are ALTernatives to the traditional RIGHT. Hence the Spencer-coined term.\nSecond, should all three be considered Alt-Right? Here I would argue no, that while it is reasonable to describe both Alt-White and Alt-West as Alt-Right, the Alt-Lite should not be. The reason is that while both Alt-White and Alt-West sign on to the greater part of\nthe 16 Points of the Alt-Right\nI’ve laid out, and which most Alt-Rightists have generally endorsed, the various people who make up the Alt-Lite are all over the place with regards to most of them.\nThe Alt-Lite, in other words, is the larval form of the Alt-Right, which means that they are not, practically speaking, Alt-Right in any meaningful or functional sense. They are merely those still undergoing the intellectual transition that most Alt-Rightists have made, at one point or another. Alt-Lite is a transitional stage, not an end point.\nBy contrast, the Alt-White and Alt-West are both destinations. Once one gravitates towards one branch or the other, or as may be the case, is directed there by virtue of one’s identity, one is simply not going to eventually move towards the other one. This leads us to the third question, what are the key differences between the Alt-White and the Alt-West. The following are my observations; I am quite willing to be corrected by someone who can speak more credibly for the Alt-White.\nAlt-White is for whites only. Alt-West is pan-racial and pan-national, which should not be confused with being multicultural or equalitarian or pro-diversity in the egalitarian sense.\nAlt-White is primarily concerned with white nationalism, and secondarily concerned with European nationalisms. Within the Alt-White, there is already a discussion concerning what the difference between a generic white nationalism and the specific European nationalisms are; I suspect there will eventually be a further distinction between American and European branches of the Alt-White. While the Alt-West supports white nationalism, that is not its sole concern, as it supports all nationalism, European or otherwise.\nAlt-White is neutral to hostile on Christianity. Alt-West is strongly pro-Christian, as it believes Christianity to be one of the three pillars of Western Civilization aka the historical Christendom. Pro-Christian includes, but does not require, actually being a Christian.\nAlt-White is neutral to hostile on Israel. Alt-West is pro-Israel, as it supports all nationalist homelands.\nAlt-White is hostile to very hostile to all Jews everywhere. Alt-West is friendly to Israeli Jews while hostile to globalist Jews and anti-nationalist Jews.\nAlt-White has a romantic view of National Socialism. Alt-West regards it as a suicidally stupid but semiotically useful form of German nationalism.\nAlt-White is neutral to pro-white imperialism. Alt-West is anti-imperialism, as it regards imperalism as being societally enervating and self-destructive.\nAs you can see, within the context of both the 16 Points and the grand political spectrum, Alt-White and Alt-West are largely in accord. They generally share a philosophy and a direction, but their priorities and perspectives are different. More importantly, with the possible exception of Christianity in the long term, there is very little reason for conflict between Alt-White and Alt-West, indeed, the distinction between the two eliminates the Alt-White’s primary objection to the Alt-West, which is the possibility of  being sidelined by the media and by the larger potential appeal of the Alt-West.\nSome have accused me, and Milo, and several others, of wanting to assume the mantle of leading the Alt-Right. That is the exact opposite of the truth. In fact, one personal benefit of articulating the distinction between the two primary branches of the Alt-Right is that it makes it clear that a) there can be no unitary leader, and b) even if there could be, that unitary leader could not possibly be me due to my identity as an American Indian and member of La Raza.\nThe more significant benefit is to quell the fears of the Alt-White that they will be sidelined by their more numerous allies. But the Alt-West needs nothing from the Alt-White, and by establishing a separate identity, a much broader spectrum of members are made possible while respecting the rigid borders of the Alt-White. Regardless, the simple fact of the matter is that the Alt-White is not the only alternative to mainstream conservatism.\nThere are much bigger battles ahead than settling the question of whether Christianity is a necessary component of Western Civilization or not. Because we know the white race is absolutely a necessary component of it, and that is why, whether one is inclined towards the Alt-White or the Alt-West, every member of the Alt-Right who values both whites and the West has immediate and mid-range objectives remain exactly the same.\nAs before, this is not intended to be a definitive delineation of the differences between the two branches of the Alt-Right, but the starting point for an intelligent discussion. Keep it civil and substantive as those more interested in posturing will be spammed. As for those who will claim that Alt-West, Alt-White, and Alt-Lite are not genuine “things”, keep in mind that as a political taxonomist, I am creating nothing. I am merely describing what observably already exists.",
  "tags": [
    "#AltRight",
    "#AltWest",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-21T14:00:00+00:00"
}