{
  "url": "https://voxday.net/2016/09/16/refueling-tank/",
  "scraped_at": "2025-12-18T01:54:34.822489",
  "title": "Refueling the tank",
  "date_display": "September 16, 2016",
  "date_iso": "2016-09-16T08:36:00+00:00",
  "date_from_url": "2016-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://blog.dilbert.com/post/150449295541/when-reality-turned-inside-out\">This essay</a> by Scott Adams struck a familiar chord:</p><blockquote><p> How do I know Trump has mastered the skill of converting humiliation into energy? The signs are all there. For example…</p><p>Trump has entered one high-risk business after another, guaranteeing that he would experience a large number of setbacks, failures, and humiliations. People don’t run toward humiliation unless they know they can convert that negative energy to fuel. When you see someone succeed across multiple unrelated fields, that’s often a sign of a Master Persuader who feeds on both success and failure. You are watching Trump do exactly that, right in front of your eyes. He has converted every “gaffe” into news coverage. He eats bad news and converts it into fuel.</p><p>Many of you have watched me do the same thing. You’ve watched as I jumped fields from corporate America to cartooning. Then I became an author of business-related books. I opened two restaurants that didn’t work out. I tried lots of stuff that failed miserably. Now I’m talking about the presidential election. What do all of those things have in common?</p><p>I risked public humiliation in each case.</p><p>And in each case, lots of people told me “Keep your day job.” On a typical day, dozens of strangers insult my body, my personality, my brain, my integrity, and lots more. Like Trump, I consume it as fuel. And it is a learned skill.</p><p>You might have noticed that both Trump and I are quick to attack anyone who attacks us. Observers tell me I shouldn’t do that, because it makes me appear thin-skinned. Observers tell Trump the same thing. But observers are missing one important thing: We use the critics to refuel</p><p>If you were an alien from another planet, and you observed a lion killing a gazelle, you might think that lion was angry at its prey. You might think the lion was insulted that the gazelle was using its watering hole. What did the gazelle do to deserve that treatment? Is the lion being thin-skinned?</p><p>Trust me when I tell you that sometimes the lion is just eating.</p></blockquote><p>Not long after the release of<i> Liberal Fascism</i>, Jonah Goldberg asked me how I handled the constant criticism to which we were both subjected. He tended to find it enervating, and wondered how I seemed to be energized by it. I explained that as a naturally lazy individual from a wealthy family, I needed a pretty good reason to put down a book and get off the couch, and the hatred of people I dislike served as a sufficiently motivating factor.</p><p>Disturbed put it best: “open up your hate and let it flow into me.”</p><p>I don’t think I’ve missed a single day blogging since I decided VP had to pass up Whatever in terms of traffic. It now has 5x more daily traffic, but I won’t be content until I also have more Twitter followers and more book sales than McRapey. The object is not to win, but to vanquish.</p><p>(This may amuse only me, but perhaps you recall Scalzi’s false claims of having 50,000 readers per day. Now, readers aren’t pageviews, so it’s not a precise comparison, but VP hasn’t had a single day as low as 50,000 pageviews in more than six weeks. 63,078 is the daily nadir in that time frame.)</p><p>Carnegie seeks embarrassment, Trump seeks failure, Adams seeks humiliation, and I seek hate, but it’s all the same thing: converting negative energy into fuel. When people ask me where I find the energy to do the various things I do every day, well, there are Saudi-sized oil fields of hatred out there.</p><p>Now, obviously I am far less successful than Trump or Adams. So, perhaps humiliation is a better goad than hatred. Or perhaps they convert negative energy more efficiently than I do. Or perhaps they’re just more fortunate. But regardless, it should be apparent that if you can teach yourself to feed on your critics rather than fear them, you will likely find the consequences to be beneficial. And, of course, to feed on them, you need to do something that inspires them to exist.</p></div>",
  "content_text": "This essay\nby Scott Adams struck a familiar chord:\nHow do I know Trump has mastered the skill of converting humiliation into energy? The signs are all there. For example…\nTrump has entered one high-risk business after another, guaranteeing that he would experience a large number of setbacks, failures, and humiliations. People don’t run toward humiliation unless they know they can convert that negative energy to fuel. When you see someone succeed across multiple unrelated fields, that’s often a sign of a Master Persuader who feeds on both success and failure. You are watching Trump do exactly that, right in front of your eyes. He has converted every “gaffe” into news coverage. He eats bad news and converts it into fuel.\nMany of you have watched me do the same thing. You’ve watched as I jumped fields from corporate America to cartooning. Then I became an author of business-related books. I opened two restaurants that didn’t work out. I tried lots of stuff that failed miserably. Now I’m talking about the presidential election. What do all of those things have in common?\nI risked public humiliation in each case.\nAnd in each case, lots of people told me “Keep your day job.” On a typical day, dozens of strangers insult my body, my personality, my brain, my integrity, and lots more. Like Trump, I consume it as fuel. And it is a learned skill.\nYou might have noticed that both Trump and I are quick to attack anyone who attacks us. Observers tell me I shouldn’t do that, because it makes me appear thin-skinned. Observers tell Trump the same thing. But observers are missing one important thing: We use the critics to refuel\nIf you were an alien from another planet, and you observed a lion killing a gazelle, you might think that lion was angry at its prey. You might think the lion was insulted that the gazelle was using its watering hole. What did the gazelle do to deserve that treatment? Is the lion being thin-skinned?\nTrust me when I tell you that sometimes the lion is just eating.\nNot long after the release of\nLiberal Fascism\n, Jonah Goldberg asked me how I handled the constant criticism to which we were both subjected. He tended to find it enervating, and wondered how I seemed to be energized by it. I explained that as a naturally lazy individual from a wealthy family, I needed a pretty good reason to put down a book and get off the couch, and the hatred of people I dislike served as a sufficiently motivating factor.\nDisturbed put it best: “open up your hate and let it flow into me.”\nI don’t think I’ve missed a single day blogging since I decided VP had to pass up Whatever in terms of traffic. It now has 5x more daily traffic, but I won’t be content until I also have more Twitter followers and more book sales than McRapey. The object is not to win, but to vanquish.\n(This may amuse only me, but perhaps you recall Scalzi’s false claims of having 50,000 readers per day. Now, readers aren’t pageviews, so it’s not a precise comparison, but VP hasn’t had a single day as low as 50,000 pageviews in more than six weeks. 63,078 is the daily nadir in that time frame.)\nCarnegie seeks embarrassment, Trump seeks failure, Adams seeks humiliation, and I seek hate, but it’s all the same thing: converting negative energy into fuel. When people ask me where I find the energy to do the various things I do every day, well, there are Saudi-sized oil fields of hatred out there.\nNow, obviously I am far less successful than Trump or Adams. So, perhaps humiliation is a better goad than hatred. Or perhaps they convert negative energy more efficiently than I do. Or perhaps they’re just more fortunate. But regardless, it should be apparent that if you can teach yourself to feed on your critics rather than fear them, you will likely find the consequences to be beneficial. And, of course, to feed on them, you need to do something that inspires them to exist.",
  "tags": [
    "anklebiters",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-16T07:36:00+00:00"
}