{
  "url": "https://voxday.net/2016/09/26/setting-record-straig/",
  "scraped_at": "2025-12-18T01:56:25.029797",
  "title": "Setting the record straight",
  "date_display": "September 26, 2016",
  "date_iso": "2016-09-26T20:00:00+00:00",
  "date_from_url": "2016-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Knowles writes an unfortunately inaccurate and misleading <a href=\"http://www.dailywire.com/news/9441/actual-conservatives-guide-alt-right-8-things-you-michael-knowles#\">Actual Conservative’s Guide to the Alt-Right</a>:</p><blockquote class=\"tr_bq\"><p> The white nationalist blogger better known by his pen name Vox Day, who counts as a central tenet of the Alt-Right that “we must secure the existence of white people and a future for white children,” which represents one half of the white nationalist, neo-Nazi numerical symbol 1488. (That phrase contains 14 words, while 8 refers to the eighth letter of the alphabet, H, which doubled represents “Heil Hitler.”)</p></blockquote><p>First, while I support white nationalism and see it as a necessary aspect of preserving Western Civilization, I am neither a white nationalist nor am I entirely white. I am an American Indian and I am a red reservationist who sees no reason to believe that whites deserve sovereign nations any less than we Indians do.</p><p>Second, why would Mr. Knowles, or anyone else of any race who is not a monster, oppose securing a future for white children? There is a massive difference between the 14 words, which I fully support, and the 88 precepts, most of which I do not.</p><p>As for Hitler, he was a cretin, a lunatic, a fool, and almost certainly the worst German leader in history, with the possible exception of Angela Merkel. I am not a 1488er in any sense of the word.</p><blockquote class=\"tr_bq\"><p> The Alt-Right loves Christendom but rejects Christianity. The Alt-Right admires Christendom primarily for uniting the continent and forging white European identity. As such it also reveres European paganism, much like the Nazis did, and its synthesis within certain aspects of Christianity. But when it comes to faith, many Alt-Right thinkers describe themselves as atheists, agnostics, and lapsed Christians. AlternativeRight.com published a feature on the movement and paganism in which Alt-Right writer Stephen McNallen explains, “I am a pagan because it is the only way I can be true to who, and what, I am. I am a pagan because the best things in our civilization come from pre-Christian Europe.” He goes on to describe his aversion to Christianity because it “lacks any roots in blood or soil” and consequently can “claim the allegiance of all the human race.”</p><p>Dark imagery runs rampant, from Yarvin’s philosophy to Vox Day’s preferred title “supreme dark lord.” All reject Christian egalitarianism and universalism. Ironically one of the few Alt-Right thinkers to proclaim his Christian faith, Vox Day, explicitly rejects spiritual equality among the races as a central tenet of Alt-Right philosophy, explaining, “Human equality does not exist in any observable scientific, legal, material, intellectual, sexual, or spiritual form.” [Italics added] But despite rejecting the substance of Christianity, the movement has spawned its own satirical religion around the meme culture that has come to typify the Alt-Right online.</p></blockquote><p>This is simply an exaggeration, presumably meant to appeal to Churchians. While there is a strong pagan strain to the white nationalist elements of the Alt-Right, most of the Alt-Right, even within the Alt-White strain, respect Christianity and cherish Christendom. What the writer fails to grasp is that <i>Christian doctrine </i>rejects egalitarianism and universalism outside of the Church, and rejects egalitarianism even within the Church. Remember, no one ever cites the “all are equal in Christ Jesus verse to claim that there are no differences between men and women or support same-sex parody-marriage.</p><blockquote class=\"tr_bq\"><p> The Alt-Right wants to burn American politics to the ground. The Alt-Right most immediately opposes conservatism, as Youth for Western Civilization founder Kevin Deanna explained in his Taki’s Magazine and AlternativeRight.com piece titled “The Impossibility of Conservatism.” The Alt-Right contains a who’s-who of right-wing voices that have been “purged” from the conservative movement by William F. Buckley and National Review, like Peter Brimelow and John Derbyshire, and Alt-Right leaders like Vox Day described the movement in an interview as “the heirs to those like the John Birch Society who were read out of the conservative movement.” Steve Bannon, who refashioned the website of conservative icon Andrew Breitbart into “the platform for the Alt-Right,” has encouraged activists to “turn on the hate” and “burn this bitch down.” But while conservatism is its most immediate target, the Alt-Right seeks to destroy a far older, more central American idea referenced frequently by Ronald Reagan and dating back beyond Abraham Lincoln’s Gettysburg Address and Alexis de Tocqueville’s Democracy In America to John Winthrop’s “City On A Hill” sermon: America as a proposition nation.</p></blockquote><p>Well, that’s pretty much correct. American politics merit being burned to the ground, and in fact, are in the process of being radically transformed by the changing societal demographics. However, we are reliably informed by Ben Sanderson that I am “not a thought leader in the alt right”, and I’m sure we all recognize that Ben Sanderson is the definitive voice with regards to this matter. I mean, we’re talking about BEN SANDERSON!</p><p>But regardless of who is, or is not, a leader, the relevant point is that we are all very well aware that “America as a proposition nation”, a “melting pot”, and “a nation of immigrants” are 19th century myths pushed  on the public by 20th century immigrants.</p><p>And it has to be said that the Knowles article is considerably better than the attempted rebuttal of Jared Taylor by (((Ben Cohen))) in American Thinker, entitled “Mainstream Conservatives and the Alt-Right”, which declares that because Hawaii hasn’t devolved into Haiti yet, <a href=\"http://www.americanthinker.com/articles/2016/09/mainstream_conservatives_and_the_altright.html\">whites are unnecessary to American civilization</a>:</p><blockquote><p> Where Taylor goes wrong – very wrong, in fact – is in his unhealthy fixation on race. Taylor is correct that most of what we love about America was created by white people; he is wrong to believe that only white people can sustain American civilization.</p><p>Interestingly, Taylor’s hypothesis has already been tested. In 1959, Congress admitted to the union a state that was overwhelmingly non-white. Has that state transformed into a third-world hell hole? A dictatorship? No.</p><p>By all measures Hawaii is doing pretty well. Hawaii’s residents enjoy the eighth-highest median income of any state in the Union, according to 2014 figures. Meanwhile, West Virginia which is almost exclusively white has the second lowest median house hold income in the United States. If you believe the key to keeping America great is keeping America white, it’s hard to explain why Hawaii is thriving and West Virginia is not.</p><p>Non-Hispanic whites compose roughly 40% of New Mexico’s population, with the rest being a mixture of Hispanics and American Indians. New Mexico isn’t rich, (43rd in median income), but it isn’t a “third-world hell hole.”</p><p>A similar argument could be made for California, which has the third-highest median income.</p></blockquote><p>How very <i>conservative</i>. Notice that mainstream conservatism now not only denies America is a specific historical nation, but denies that the very nation who created a state for themselves are necessary for the state or their posterity! Because the “nation” is not a nation, but an idea and <i>only </i>an idea.</p><p>If these literally anti-American, anti-Constitution, and anti-white arguments are the best ones that mainstream conservatism can muster against the Alt-Right, conservatism is going to die out faster than I’d ever imagined.</p></div>",
  "content_text": "Michael Knowles writes an unfortunately inaccurate and misleading\nActual Conservative’s Guide to the Alt-Right\n:\nThe white nationalist blogger better known by his pen name Vox Day, who counts as a central tenet of the Alt-Right that “we must secure the existence of white people and a future for white children,” which represents one half of the white nationalist, neo-Nazi numerical symbol 1488. (That phrase contains 14 words, while 8 refers to the eighth letter of the alphabet, H, which doubled represents “Heil Hitler.”)\nFirst, while I support white nationalism and see it as a necessary aspect of preserving Western Civilization, I am neither a white nationalist nor am I entirely white. I am an American Indian and I am a red reservationist who sees no reason to believe that whites deserve sovereign nations any less than we Indians do.\nSecond, why would Mr. Knowles, or anyone else of any race who is not a monster, oppose securing a future for white children? There is a massive difference between the 14 words, which I fully support, and the 88 precepts, most of which I do not.\nAs for Hitler, he was a cretin, a lunatic, a fool, and almost certainly the worst German leader in history, with the possible exception of Angela Merkel. I am not a 1488er in any sense of the word.\nThe Alt-Right loves Christendom but rejects Christianity. The Alt-Right admires Christendom primarily for uniting the continent and forging white European identity. As such it also reveres European paganism, much like the Nazis did, and its synthesis within certain aspects of Christianity. But when it comes to faith, many Alt-Right thinkers describe themselves as atheists, agnostics, and lapsed Christians. AlternativeRight.com published a feature on the movement and paganism in which Alt-Right writer Stephen McNallen explains, “I am a pagan because it is the only way I can be true to who, and what, I am. I am a pagan because the best things in our civilization come from pre-Christian Europe.” He goes on to describe his aversion to Christianity because it “lacks any roots in blood or soil” and consequently can “claim the allegiance of all the human race.”\nDark imagery runs rampant, from Yarvin’s philosophy to Vox Day’s preferred title “supreme dark lord.” All reject Christian egalitarianism and universalism. Ironically one of the few Alt-Right thinkers to proclaim his Christian faith, Vox Day, explicitly rejects spiritual equality among the races as a central tenet of Alt-Right philosophy, explaining, “Human equality does not exist in any observable scientific, legal, material, intellectual, sexual, or spiritual form.” [Italics added] But despite rejecting the substance of Christianity, the movement has spawned its own satirical religion around the meme culture that has come to typify the Alt-Right online.\nThis is simply an exaggeration, presumably meant to appeal to Churchians. While there is a strong pagan strain to the white nationalist elements of the Alt-Right, most of the Alt-Right, even within the Alt-White strain, respect Christianity and cherish Christendom. What the writer fails to grasp is that\nChristian doctrine\nrejects egalitarianism and universalism outside of the Church, and rejects egalitarianism even within the Church. Remember, no one ever cites the “all are equal in Christ Jesus verse to claim that there are no differences between men and women or support same-sex parody-marriage.\nThe Alt-Right wants to burn American politics to the ground. The Alt-Right most immediately opposes conservatism, as Youth for Western Civilization founder Kevin Deanna explained in his Taki’s Magazine and AlternativeRight.com piece titled “The Impossibility of Conservatism.” The Alt-Right contains a who’s-who of right-wing voices that have been “purged” from the conservative movement by William F. Buckley and National Review, like Peter Brimelow and John Derbyshire, and Alt-Right leaders like Vox Day described the movement in an interview as “the heirs to those like the John Birch Society who were read out of the conservative movement.” Steve Bannon, who refashioned the website of conservative icon Andrew Breitbart into “the platform for the Alt-Right,” has encouraged activists to “turn on the hate” and “burn this bitch down.” But while conservatism is its most immediate target, the Alt-Right seeks to destroy a far older, more central American idea referenced frequently by Ronald Reagan and dating back beyond Abraham Lincoln’s Gettysburg Address and Alexis de Tocqueville’s Democracy In America to John Winthrop’s “City On A Hill” sermon: America as a proposition nation.\nWell, that’s pretty much correct. American politics merit being burned to the ground, and in fact, are in the process of being radically transformed by the changing societal demographics. However, we are reliably informed by Ben Sanderson that I am “not a thought leader in the alt right”, and I’m sure we all recognize that Ben Sanderson is the definitive voice with regards to this matter. I mean, we’re talking about BEN SANDERSON!\nBut regardless of who is, or is not, a leader, the relevant point is that we are all very well aware that “America as a proposition nation”, a “melting pot”, and “a nation of immigrants” are 19th century myths pushed  on the public by 20th century immigrants.\nAnd it has to be said that the Knowles article is considerably better than the attempted rebuttal of Jared Taylor by (((Ben Cohen))) in American Thinker, entitled “Mainstream Conservatives and the Alt-Right”, which declares that because Hawaii hasn’t devolved into Haiti yet,\nwhites are unnecessary to American civilization\n:\nWhere Taylor goes wrong – very wrong, in fact – is in his unhealthy fixation on race. Taylor is correct that most of what we love about America was created by white people; he is wrong to believe that only white people can sustain American civilization.\nInterestingly, Taylor’s hypothesis has already been tested. In 1959, Congress admitted to the union a state that was overwhelmingly non-white. Has that state transformed into a third-world hell hole? A dictatorship? No.\nBy all measures Hawaii is doing pretty well. Hawaii’s residents enjoy the eighth-highest median income of any state in the Union, according to 2014 figures. Meanwhile, West Virginia which is almost exclusively white has the second lowest median house hold income in the United States. If you believe the key to keeping America great is keeping America white, it’s hard to explain why Hawaii is thriving and West Virginia is not.\nNon-Hispanic whites compose roughly 40% of New Mexico’s population, with the rest being a mixture of Hispanics and American Indians. New Mexico isn’t rich, (43rd in median income), but it isn’t a “third-world hell hole.”\nA similar argument could be made for California, which has the third-highest median income.\nHow very\nconservative\n. Notice that mainstream conservatism now not only denies America is a specific historical nation, but denies that the very nation who created a state for themselves are necessary for the state or their posterity! Because the “nation” is not a nation, but an idea and\nonly\nan idea.\nIf these literally anti-American, anti-Constitution, and anti-white arguments are the best ones that mainstream conservatism can muster against the Alt-Right, conservatism is going to die out faster than I’d ever imagined.",
  "tags": [
    "#AltRight",
    "#AltWest",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-26T19:00:00+00:00"
}