{
  "url": "https://voxday.net/2016/09/03/straight-from-source/",
  "scraped_at": "2025-12-18T01:52:16.502991",
  "title": "Straight from the source",
  "date_display": "September 3, 2016",
  "date_iso": "2016-09-03T12:00:00+00:00",
  "date_from_url": "2016-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Daily Stormer’s <a href=\"http://www.dailystormer.com/a-normies-guide-to-the-alt-right/\">guide to the Alt-Right</a>:</p><blockquote><p> <b>An Accurate History of the Alt-Right</b></p><p>Roughly four years ago, a new type of White nationalist movement began to form on the internet. This was mostly made-up of young people who were formulating ideas with minimal influence from prior White nationalist movements.</p><p>It was a situation of different online subcultures (some of which were influenced by older offline movements) coming together. These groups collided, based on their having reached common conclusions, and the result is what is now called the Alt-Right.</p><p>I am going to layout here these various factions, and what ultimately led them toward this center-point where we have all met. The campaign of Donald Trump is effectively the nexus of that centerpoint.</p><p>Note that there is quite a bit of overlap between these various communities, with many people – myself included – having traveled through more than one. Breaking them down into specific categories just makes it easier to grasp the overall development of the different threads of thought.</p></blockquote><p>While there will no doubt be those who are <i>uncomfortable </i>with the more extreme elements of the Alt-Right, particularly on the part of conservatives and libertarians who would totally join it if only it didn’t involve making common cause with <i>those people</i>, it is absolutely necessary to adopt a variant of the principle of Ronald Reagan, which is no enemies on the Right. A tendency to delicately recoil from anyone willing to articulate, let alone actually fight for, their own people’s interests is one of the fatal flaws of conservatism, which at its core is little more than an aesthetic philosophy of noble defeat.</p><p>We are Aristotelians here, after all. A is A, and A cannot be Not-A. So, either guilt-by-association is legitimate and applicable to everyone or it is illegitimate and cannot be applied to anyone. This means that if being Alt-Right makes you a member of the German National Socialist Workers Party and an anti-Semite responsible for the Holocaust by association, then keep in mind that being a Jew, a Christian Zionist, an anti-racist, or a philosemite makes you one of these fine gentlemen by association.</p><p></p><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"246\" src=\"https://www.youtube.com/embed/-leWJ84EUns\" width=\"438\"></iframe></div><p> <i>Old Jew: They are animals. The non-Jews are animals. Beasts. It is written.</i><br> <i><br/></i><br> <i>Reporter: It is not written here.</i><br> <i><br/></i><br> <i>Old Jew:It is written… ah, you are right. It isn’t written. There is an explanation why they are.</i><br> <i><br/></i><br> <i>Reporter: Hold on, that is what I want to understand.</i><br> <i><br/></i><br> <i>Old Jew:It says “you are called human and the non-Jews are not called human”, that is what is written.</i><br> <i><br/></i><br> <i>Reporter: Not called human?</i><br> <i><br/></i><br> <i>Old Jew:We don’t call them human.</i><br> <i><br/></i><br> <i>Reporter: So what do we call them? </i><br> <i><br/></i><br> <i>Old Jew:Human is in the image of God. Human is something that is different from animals. If a person acts like an animal, so he is like an animal. Each person needs to control himself. The Jews control themselves. If the evil inclination tells them to do something and they don’t do it, so then he is a person, because he has intellect.</i><br> <i><br/></i><br> <i>Reporter: So someone who is not Jewish, who does what is good, is he a person or is he not a person?</i><br> <i><br/></i><br> <i>Old Jew:Also, he needs to do normal things.</i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><i>Reporter: What I don’t understand is, all the non-Jews are, how did you call them?</i><br> <i><br/></i><br> <i>Old Jew: Beasts. If they have no direction.</i><br> <i><br/></i><br> <i>Young Jew: The word human refers to the image of God. He is the image of God. That is the meaning of “human”. We changed it, meaning the Jewish people changed it, to acting more humane. You need to act like a human being, but in principle it is based on God, and people are based on God because we are in His image so He called us human. The non-Jews are… God made them so they will….</i><br> <i><br/></i><br> <i>Old Jew: So they will serve the Jews. All the non-Jews that you see all around the world, the billions, they exist just for the Jew’s benefit. We don’t see it so we don’t know exactly.</i><br> <i><br/></i><br> <i>Young Jew:  Hold on. Today we are still in exile, so automatically they don’t yet serve us completely. Only partially.</i><br> <i><br/></i><br> <i>Old Jew: When the Messiah will come each one of us will have… how many?</i><br> <i><br/></i><br> <i>Young Jew: Thousands. Hundreds.</i><br> <i><br/></i><br> <i>Old Jew: 2,800 slaves.</i><br> <i><br/></i><br> <i>Reporter: In the meantime, the Messiah is not here, so how do they serve us now?</i><br> <i><br/></i><br> <i>Young Jew: They build us cars. We don’t know. Apartments, buildings. They do everything.</i><br> <i><br/></i><br> <i>Reporter: Who do they build for?</i><br> <i><br/></i><br> <i>Young Jew: Us. They serve the Jews.</i><br> <i><br/></i><br/> <i>Reporter: There are also Jews who do that work.</i><br/> <i><br/></i><br/> <i>Young Jew: Hardly any.</i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p> Now, consider the following questions:</p><ol><li>Are you a subhuman beast?</li><li>Do you accept the assertion that you, your children, or your grandchildren are destined to be one of a Jew’s 2,800 slaves?</li><li>Do you exist solely “for the Jew’s benefit”?</li></ol><p>Now, if you answered “no” to any of those questions, does that make you a Nazi and an anti-Semite?</p><p>What I found particularly interesting is that <a href=\"http://plancksconstant.org/blog1/2015/08/when_the_messiah_comes_every_jew_will_have_2800_sl.html\">some sites explicitly claim</a> that the anti-Gentile quotes from the Talmud, including the one about 2,800 slaves, are fake, so either the video is an elaborate hoax or the debunking sites are knowingly attempting to deceive those looking for the truth. The fact that Judaism is a religion of ethnic supremacy should also make it clear that there is nothing “Judeo-Christian” about the America that was founded to recognize “No King but Jesus”. Christians are advised to bless Israel and refrain from cursing it, they are nowhere commanded to serve the Jews as slaves.</p><p>Don’t try to play the NAJALT game, especially not if you’ve already claimed that the Alt-Right are all Nazis because Stormfront and Pepe. I do not accept the evil and dishonest principle of “rules for thee but not for me” because A can never be Not-A. As I have repeatedly observed with regards to the Rabid Puppies campaign against the SF-SJWs, the use of a tactic against us automatically legitimates our use of it. The Alt-Right does not believe in noble defeat. The Alt-Right believes in winning. Throw a swastika at us, we’ll throw Le Happy Merchant right back at you without a moment’s hesitation. Or a swastika, for that matter.</p><p>Now, where I part company with the Stormfronters is that I don’t believe the Jews are the root of all evil on this planet. I believe that Man’s fallen nature and the Prince of this World are, and that the obnoxious pride of the people represented in that video is merely one of many manifestations of Man’s sinful folly. But regardless, only a suicidal madman or a dedicated virtue-signaler would oppose or restrain <i>any </i>opponent of the dehumanization and literal enslavement of more than 7 billion people on the planet.</p><p>If you can’t bring yourself to stand up against your own dehumanization for fear that someone, somewhere, might retroactively blame the Holocaust on you, then perhaps they are right and you are a slave. You certainly wear their chains upon your mind.</p><p>Whatever your particular strain of Alt-Right may be, you should have no trouble agreeing with the conclusion of Anglin’s article.</p><p><i>As long as everyone involved keeps doing exactly what they’re doing right now, we can only continue to expand. There is no other option. Our ideas are winning. The only threat of failure is if in trying to go mainstream we decide to compromise. However, because of the nature of this internet-based movement, where the mob has a very real voice and can say it loudly when they disagree with the direction something is going in, there is not any real chance anyone pushing a compromise could be successful.</i><br/> <i><br/></i><br/> No matter who you are, no matter what you are, if you are a thinking man or woman, sooner or later you are going to have to make a fundamental decision. Am I going to serve the truth and follow it wherever it leads me, or am I going to give up and accept the lies with which I am bombarded on a daily basis? Never forget, it is the broad and easy way that leads to destruction, not the hard and narrow one.</p></div>",
  "content_text": "The Daily Stormer’s\nguide to the Alt-Right\n:\nAn Accurate History of the Alt-Right\nRoughly four years ago, a new type of White nationalist movement began to form on the internet. This was mostly made-up of young people who were formulating ideas with minimal influence from prior White nationalist movements.\nIt was a situation of different online subcultures (some of which were influenced by older offline movements) coming together. These groups collided, based on their having reached common conclusions, and the result is what is now called the Alt-Right.\nI am going to layout here these various factions, and what ultimately led them toward this center-point where we have all met. The campaign of Donald Trump is effectively the nexus of that centerpoint.\nNote that there is quite a bit of overlap between these various communities, with many people – myself included – having traveled through more than one. Breaking them down into specific categories just makes it easier to grasp the overall development of the different threads of thought.\nWhile there will no doubt be those who are\nuncomfortable\nwith the more extreme elements of the Alt-Right, particularly on the part of conservatives and libertarians who would totally join it if only it didn’t involve making common cause with\nthose people\n, it is absolutely necessary to adopt a variant of the principle of Ronald Reagan, which is no enemies on the Right. A tendency to delicately recoil from anyone willing to articulate, let alone actually fight for, their own people’s interests is one of the fatal flaws of conservatism, which at its core is little more than an aesthetic philosophy of noble defeat.\nWe are Aristotelians here, after all. A is A, and A cannot be Not-A. So, either guilt-by-association is legitimate and applicable to everyone or it is illegitimate and cannot be applied to anyone. This means that if being Alt-Right makes you a member of the German National Socialist Workers Party and an anti-Semite responsible for the Holocaust by association, then keep in mind that being a Jew, a Christian Zionist, an anti-racist, or a philosemite makes you one of these fine gentlemen by association.\nOld Jew: They are animals. The non-Jews are animals. Beasts. It is written.\nReporter: It is not written here.\nOld Jew:It is written… ah, you are right. It isn’t written. There is an explanation why they are.\nReporter: Hold on, that is what I want to understand.\nOld Jew:It says “you are called human and the non-Jews are not called human”, that is what is written.\nReporter: Not called human?\nOld Jew:We don’t call them human.\nReporter: So what do we call them?\nOld Jew:Human is in the image of God. Human is something that is different from animals. If a person acts like an animal, so he is like an animal. Each person needs to control himself. The Jews control themselves. If the evil inclination tells them to do something and they don’t do it, so then he is a person, because he has intellect.\nReporter: So someone who is not Jewish, who does what is good, is he a person or is he not a person?\nOld Jew:Also, he needs to do normal things.\nReporter: What I don’t understand is, all the non-Jews are, how did you call them?\nOld Jew: Beasts. If they have no direction.\nYoung Jew: The word human refers to the image of God. He is the image of God. That is the meaning of “human”. We changed it, meaning the Jewish people changed it, to acting more humane. You need to act like a human being, but in principle it is based on God, and people are based on God because we are in His image so He called us human. The non-Jews are… God made them so they will….\nOld Jew: So they will serve the Jews. All the non-Jews that you see all around the world, the billions, they exist just for the Jew’s benefit. We don’t see it so we don’t know exactly.\nYoung Jew:  Hold on. Today we are still in exile, so automatically they don’t yet serve us completely. Only partially.\nOld Jew: When the Messiah will come each one of us will have… how many?\nYoung Jew: Thousands. Hundreds.\nOld Jew: 2,800 slaves.\nReporter: In the meantime, the Messiah is not here, so how do they serve us now?\nYoung Jew: They build us cars. We don’t know. Apartments, buildings. They do everything.\nReporter: Who do they build for?\nYoung Jew: Us. They serve the Jews.\nReporter: There are also Jews who do that work.\nYoung Jew: Hardly any.\nNow, consider the following questions:\nAre you a subhuman beast?\nDo you accept the assertion that you, your children, or your grandchildren are destined to be one of a Jew’s 2,800 slaves?\nDo you exist solely “for the Jew’s benefit”?\nNow, if you answered “no” to any of those questions, does that make you a Nazi and an anti-Semite?\nWhat I found particularly interesting is that\nsome sites explicitly claim\nthat the anti-Gentile quotes from the Talmud, including the one about 2,800 slaves, are fake, so either the video is an elaborate hoax or the debunking sites are knowingly attempting to deceive those looking for the truth. The fact that Judaism is a religion of ethnic supremacy should also make it clear that there is nothing “Judeo-Christian” about the America that was founded to recognize “No King but Jesus”. Christians are advised to bless Israel and refrain from cursing it, they are nowhere commanded to serve the Jews as slaves.\nDon’t try to play the NAJALT game, especially not if you’ve already claimed that the Alt-Right are all Nazis because Stormfront and Pepe. I do not accept the evil and dishonest principle of “rules for thee but not for me” because A can never be Not-A. As I have repeatedly observed with regards to the Rabid Puppies campaign against the SF-SJWs, the use of a tactic against us automatically legitimates our use of it. The Alt-Right does not believe in noble defeat. The Alt-Right believes in winning. Throw a swastika at us, we’ll throw Le Happy Merchant right back at you without a moment’s hesitation. Or a swastika, for that matter.\nNow, where I part company with the Stormfronters is that I don’t believe the Jews are the root of all evil on this planet. I believe that Man’s fallen nature and the Prince of this World are, and that the obnoxious pride of the people represented in that video is merely one of many manifestations of Man’s sinful folly. But regardless, only a suicidal madman or a dedicated virtue-signaler would oppose or restrain\nany\nopponent of the dehumanization and literal enslavement of more than 7 billion people on the planet.\nIf you can’t bring yourself to stand up against your own dehumanization for fear that someone, somewhere, might retroactively blame the Holocaust on you, then perhaps they are right and you are a slave. You certainly wear their chains upon your mind.\nWhatever your particular strain of Alt-Right may be, you should have no trouble agreeing with the conclusion of Anglin’s article.\nAs long as everyone involved keeps doing exactly what they’re doing right now, we can only continue to expand. There is no other option. Our ideas are winning. The only threat of failure is if in trying to go mainstream we decide to compromise. However, because of the nature of this internet-based movement, where the mob has a very real voice and can say it loudly when they disagree with the direction something is going in, there is not any real chance anyone pushing a compromise could be successful.\nNo matter who you are, no matter what you are, if you are a thinking man or woman, sooner or later you are going to have to make a fundamental decision. Am I going to serve the truth and follow it wherever it leads me, or am I going to give up and accept the lies with which I am bombarded on a daily basis? Never forget, it is the broad and easy way that leads to destruction, not the hard and narrow one.",
  "tags": [
    "#AltRight",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-03T11:00:00+00:00"
}