{
  "url": "https://voxday.net/2016/09/25/taxonomy-vs-marketing/",
  "scraped_at": "2025-12-18T01:56:15.760582",
  "title": "Taxonomy vs marketing",
  "date_display": "September 25, 2016",
  "date_iso": "2016-09-25T22:41:00+00:00",
  "date_from_url": "2016-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure that many in the Alt-White understand the concept of branding very well despite their concerns on that score. More importantly, they’re either projecting or confusing me with others when they express concerns about my interest in subverting anything, let alone their activities. There is a division of opinion in the Alt-White over everything that is not Alt-White but could, reasonably, be described as Alt-Right. I tend to agree with Michael Bell’s opinion, <a href=\"http://www.counter-currents.com/2016/09/the-caste-system-of-the-alt-right/\">as he wrote</a>:</p><blockquote class=\"tr_bq\"><p> While we pursue our goal of fully occupying the helm of the Alt Right, we must recognize that those who are not fully on board with all of our principles can nonetheless be considered a part of the Alt Right provided they aid us in our efforts and do not work to contradict us. Many of these types can eventually be turned into full White Nationalists anyway, as their views are only a few inches away from ours. To quote Lawrence Murray, “The big tent is worth preserving to persevere against our common enemies, for our struggle is revolutionary.”</p></blockquote><p>Notice that key phrase: “our goal of fully occupying the helm of the Alt Right”. It’s just a goal. It’s not a reality, an identity, or anything material, it’s an objective. It’s not an unreasonable objective, especially since their efforts are necessary, though not sufficient, to preserve Western civilization. Greg Johnson himself has freely admitted that most of what the Alt Right actually means predates the NPI sense, he is merely attempting to fill what he calls “a vacuum”, but it cannot be a vacuum because there is a long history of the Alternative Right that has been read out of the conservative movement for generations.</p><p>Fashy McQueen represents the view opposed to Michael Bell, and the weakness of his position can be readily seen in the way <a href=\"http://www.counter-currents.com/2016/09/the-caste-system-of-the-alt-right/#comment-1367140\">he presents his case</a>:</p><blockquote class=\"tr_bq\"><p> “Alt-Right” has become an internationally-recognized brand that only fools would carelessly dilute or abandon. Nazi Shitlords™ know the importance of branding, terminology, and propaganda. They use these weapons every day. And the term “Alt-Right” has become their most powerful weapon in attacking the enemy, and recruiting the masses into White Nationalism at an exponential rate….  The name “Alt-Right” has become the most powerful brand of White Nationalism in over 70 years. And it happened almost by accident. The stars aligned. It may never happen again.</p></blockquote><p>This is the same magical thinking that is used to justify calling crippled people “handicapable” and negroes “blacks”, then “Afro-Americans”, then “African-Americans”.  It is the belief that an object or a concept is intrinsically altered by the label. But if Greg Johnson is correct and Alt Right means literally nothing more than “White Nationalist”, then it will soon be as effective and appealing a brand as “White Nationalist” presently is. The underlying essence is not changed one iota by calling X something else, such as Y, so long as it remains fundamentally X.</p><p>This small-tent Alt-White is not only caught in the trap of magical thinking, it genuinely can’t distinguish between friend, ally, and enemy. Also from Fashy’s extended comment:</p><blockquote class=\"tr_bq\"><p> Vox Day is currently attempting his own subversive version of redefining the Alt-Right to include himself, and to purge the Alt-Right’s staunchly White Nationalist core. These hostile attempts to redefine the term “Alt-Right” must be fought mercilessly — not invited.</p></blockquote><p>First, I will again point out that I am not redefining anything. The Alt-White is, <i>by their own admission</i>, attempting to redefine Alt-Right in order to claim it for themselves and themselves alone. Are they really the only Alternative Right? Are they the only genuine alternative to mainstream conservatism? No, obviously not.</p><p>So, how are all those alternative right people, who subscribe many or even most of the 16 Points I have laid out, but are not a full-blown “White Nationalist”, or as I would put it, Alt-White, to be described? What do they call themselves? Even Fashy admits they considerably outnumber his “Alt-Right”, after all. It accomplishes nothing to simply pretend that they don’t exist, as much as the Left would like to do so.</p><p>Second, the reality is that whatever those people call themselves WILL become the dominant alternative to the mainstream right, because they ARE the strongest alternative to it. The Alt-White is only a subset of that, a vital subset, to be sure, but a subset nonetheless. Is it better for the Alt-White to be part of the Alt-Right, or is it better for the Alt-Right to be part of this nameless alternative to the mainstream Right? But whether we call it the Alt-Right or the Nameless Broad-Spectrum Alternative, that is the primary alternative.</p><p>I suspect the Alt-White has a hard time accepting the observable limits to their subset because they are mostly Americans, and are therefore blind to the fact that the vast majority of white European nationalists are not, and will never be, generic white nationalists. I have repeatedly tried to explain this, on both TRS and the Counter-Currents podcast as well as here on VP, and their only response to date has been that they think they can sense a generic white consciousness beginning to come into being.</p><p>And it’s true, they surely can… in the USA where generic whites are under attack for being white and where the Republican Party is in the process of being transformed into the White American Party. That is not the case in Europe, and <i>it will not be the case</i>, because the generic aspect is working in precisely the opposite direction here, as Muslims of many diverse nations are lumped together as generic Muslims and are thereby beginning to form a generic “Euro-Muslim” identity. Moreover, Europeans are hostile to pan-Europeanism in a way that most Americans don’t understand due to the egregious, anti-democratic excesses of the European Union. The British people just voted to get out of the European Union, so it should be readily apparent that they’re not even remotely inclined to sign up for generic white pan-nationalism.</p><p>In any event, it should be obvious that I am not even remotely hostile to white nationalism nor do I have any intention of subverting it for any purpose, let alone a nefarious one. I am not at all concerned about being excluded from anything; as longtime readers here know, I really don’t go in for joining things as a general rule but prefer to do my own thing. Fortunately, the big-tent branch seems to more or less grasp this, as Bell writes of his Fourth Tier of the Alt-Right</p><blockquote class=\"tr_bq\"><p> Beneath this caste I would place the people who work to combat the professional and intellectual thuggery of the Social Justice Warriors and very particular Leftist narratives, but who don’t have any kind of overarching pro-White, pro-Western, or anti-Semitic ideology driving it. Author and video-game designer Vox Day goes here. In fact, I would elect him the leader of this caste if such a thing existed. He was an outspoken supporter of Gamergate and organized the Rabid Puppies movement, which at its core sought to diminish the influence of Left-minded authors like George R. R. Martin over the science-fiction Hugo Awards. Rather than giving awards to books about transexual vampires fighting against homophobic dragons, Day and his followers felt that the science fiction community should once again seek to emulate luminaries like J. R. R. Tolkien and Frank Herbert, who were essentially pro-Western and Right-wing in their thought. His book SJWs Always Lie is a must read for every member of the Alt Right. Of course, he is only part-white and does not explicitly push a pro-white or pro-Western agenda (though he comes close.)</p></blockquote><p>Regardless of whether one’s interest is taxonomic or marketing, it is worthwhile to discuss these matters with those who don’t share one’s opinion, which is why I have invited Greg Johnson to appear on a public Brainstorm to discuss Alt-Right, Alt-White, and Alt-Lite, and to present his own perspective on the subject.</p></div>",
  "content_text": "I’m not sure that many in the Alt-White understand the concept of branding very well despite their concerns on that score. More importantly, they’re either projecting or confusing me with others when they express concerns about my interest in subverting anything, let alone their activities. There is a division of opinion in the Alt-White over everything that is not Alt-White but could, reasonably, be described as Alt-Right. I tend to agree with Michael Bell’s opinion,\nas he wrote\n:\nWhile we pursue our goal of fully occupying the helm of the Alt Right, we must recognize that those who are not fully on board with all of our principles can nonetheless be considered a part of the Alt Right provided they aid us in our efforts and do not work to contradict us. Many of these types can eventually be turned into full White Nationalists anyway, as their views are only a few inches away from ours. To quote Lawrence Murray, “The big tent is worth preserving to persevere against our common enemies, for our struggle is revolutionary.”\nNotice that key phrase: “our goal of fully occupying the helm of the Alt Right”. It’s just a goal. It’s not a reality, an identity, or anything material, it’s an objective. It’s not an unreasonable objective, especially since their efforts are necessary, though not sufficient, to preserve Western civilization. Greg Johnson himself has freely admitted that most of what the Alt Right actually means predates the NPI sense, he is merely attempting to fill what he calls “a vacuum”, but it cannot be a vacuum because there is a long history of the Alternative Right that has been read out of the conservative movement for generations.\nFashy McQueen represents the view opposed to Michael Bell, and the weakness of his position can be readily seen in the way\nhe presents his case\n:\n“Alt-Right” has become an internationally-recognized brand that only fools would carelessly dilute or abandon. Nazi Shitlords™ know the importance of branding, terminology, and propaganda. They use these weapons every day. And the term “Alt-Right” has become their most powerful weapon in attacking the enemy, and recruiting the masses into White Nationalism at an exponential rate….  The name “Alt-Right” has become the most powerful brand of White Nationalism in over 70 years. And it happened almost by accident. The stars aligned. It may never happen again.\nThis is the same magical thinking that is used to justify calling crippled people “handicapable” and negroes “blacks”, then “Afro-Americans”, then “African-Americans”.  It is the belief that an object or a concept is intrinsically altered by the label. But if Greg Johnson is correct and Alt Right means literally nothing more than “White Nationalist”, then it will soon be as effective and appealing a brand as “White Nationalist” presently is. The underlying essence is not changed one iota by calling X something else, such as Y, so long as it remains fundamentally X.\nThis small-tent Alt-White is not only caught in the trap of magical thinking, it genuinely can’t distinguish between friend, ally, and enemy. Also from Fashy’s extended comment:\nVox Day is currently attempting his own subversive version of redefining the Alt-Right to include himself, and to purge the Alt-Right’s staunchly White Nationalist core. These hostile attempts to redefine the term “Alt-Right” must be fought mercilessly — not invited.\nFirst, I will again point out that I am not redefining anything. The Alt-White is,\nby their own admission\n, attempting to redefine Alt-Right in order to claim it for themselves and themselves alone. Are they really the only Alternative Right? Are they the only genuine alternative to mainstream conservatism? No, obviously not.\nSo, how are all those alternative right people, who subscribe many or even most of the 16 Points I have laid out, but are not a full-blown “White Nationalist”, or as I would put it, Alt-White, to be described? What do they call themselves? Even Fashy admits they considerably outnumber his “Alt-Right”, after all. It accomplishes nothing to simply pretend that they don’t exist, as much as the Left would like to do so.\nSecond, the reality is that whatever those people call themselves WILL become the dominant alternative to the mainstream right, because they ARE the strongest alternative to it. The Alt-White is only a subset of that, a vital subset, to be sure, but a subset nonetheless. Is it better for the Alt-White to be part of the Alt-Right, or is it better for the Alt-Right to be part of this nameless alternative to the mainstream Right? But whether we call it the Alt-Right or the Nameless Broad-Spectrum Alternative, that is the primary alternative.\nI suspect the Alt-White has a hard time accepting the observable limits to their subset because they are mostly Americans, and are therefore blind to the fact that the vast majority of white European nationalists are not, and will never be, generic white nationalists. I have repeatedly tried to explain this, on both TRS and the Counter-Currents podcast as well as here on VP, and their only response to date has been that they think they can sense a generic white consciousness beginning to come into being.\nAnd it’s true, they surely can… in the USA where generic whites are under attack for being white and where the Republican Party is in the process of being transformed into the White American Party. That is not the case in Europe, and\nit will not be the case\n, because the generic aspect is working in precisely the opposite direction here, as Muslims of many diverse nations are lumped together as generic Muslims and are thereby beginning to form a generic “Euro-Muslim” identity. Moreover, Europeans are hostile to pan-Europeanism in a way that most Americans don’t understand due to the egregious, anti-democratic excesses of the European Union. The British people just voted to get out of the European Union, so it should be readily apparent that they’re not even remotely inclined to sign up for generic white pan-nationalism.\nIn any event, it should be obvious that I am not even remotely hostile to white nationalism nor do I have any intention of subverting it for any purpose, let alone a nefarious one. I am not at all concerned about being excluded from anything; as longtime readers here know, I really don’t go in for joining things as a general rule but prefer to do my own thing. Fortunately, the big-tent branch seems to more or less grasp this, as Bell writes of his Fourth Tier of the Alt-Right\nBeneath this caste I would place the people who work to combat the professional and intellectual thuggery of the Social Justice Warriors and very particular Leftist narratives, but who don’t have any kind of overarching pro-White, pro-Western, or anti-Semitic ideology driving it. Author and video-game designer Vox Day goes here. In fact, I would elect him the leader of this caste if such a thing existed. He was an outspoken supporter of Gamergate and organized the Rabid Puppies movement, which at its core sought to diminish the influence of Left-minded authors like George R. R. Martin over the science-fiction Hugo Awards. Rather than giving awards to books about transexual vampires fighting against homophobic dragons, Day and his followers felt that the science fiction community should once again seek to emulate luminaries like J. R. R. Tolkien and Frank Herbert, who were essentially pro-Western and Right-wing in their thought. His book SJWs Always Lie is a must read for every member of the Alt Right. Of course, he is only part-white and does not explicitly push a pro-white or pro-Western agenda (though he comes close.)\nRegardless of whether one’s interest is taxonomic or marketing, it is worthwhile to discuss these matters with those who don’t share one’s opinion, which is why I have invited Greg Johnson to appear on a public Brainstorm to discuss Alt-Right, Alt-White, and Alt-Lite, and to present his own perspective on the subject.",
  "tags": [
    "#AltRight",
    "#AltWest"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-25T21:41:00+00:00"
}