{
  "url": "https://voxday.net/2016/09/01/the-new-william-f-buckley/",
  "scraped_at": "2025-12-18T01:51:56.278348",
  "title": "The new William F. Buckley",
  "date_display": "September 1, 2016",
  "date_iso": "2016-09-01T12:00:00+00:00",
  "date_from_url": "2016-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a bit ironic. Universal Press Syndicate signed me to a syndication contract with the idea that I would gradually come to replace their big syndicate star, William F. Buckley, because they considered me to be the most intellectually formidable of the “young” columnists then on the political scene. Needless to say, that didn’t happen, as they were totally unable to place my column anywhere except, briefly, with the <i>Dallas Morning News</i>.</p><p>As it turns out, it’s Jonah Goldberg who has turned out to be the true heir to William F. Buckley, as he is attempting to repeat his predecessor’s example in reading the 160,000-strong John Birch Society out of the conservative movement in a column entitled <a href=\"http://www.nationalreview.com/node/439522/print\">“Time to John Birch the Alt-Right</a>“.</p><blockquote><p> There is a diversity of views among the self-described alt-right. But the one unifying sentiment is racism — or what they like to call “racialism” or “race realism.” In the words of one alt-right leader, Jared Taylor, “the races are not equal and equivalent.” On Monday, Taylor asserted on NPR’s “Diane Rehm Show” that racialism — not religion, economics, etc. — is the one issue that unites alt-righters.</p><p>If you read the writings of leading alt-righters, it is impossible to come to any other conclusion. Some are avowed white supremacists. Some eschew talk of supremacy and instead focus on the need for racial separation to protect “white identity.” But one can’t talk about the alt-right knowledgeably without recognizing their racism.</p><p>And yet that is exactly what some conservatives seem intent on doing. For example, my friend Hugh Hewitt, the influential talk-radio host, has been arguing that there is a “narrow” alt-right made up of a “execrable anti-Semitic, white supremacist fringe” but also a “broad alt-right” made up of frustrated tea partiers and others who are simply hostile to the GOP establishment and any form of immigration reform that falls short of mass deportation.</p><p>This isn’t just wrong, it’s madness. The alt-righters are a politically insignificant band. Why claim that a group dedicated to overthrowing conservatism for a white-nationalist fantasy is in fact a member of the conservative coalition? Why muddy a distinction the alt-righters are eager to keep clear?</p><p>In the 1960s, the fledgling conservative movement was faced with a similar dilemma. The John Birch Society was a paranoid outfit dedicated to the theory that the U.S. government was controlled by communists. It said even Dwight Eisenhower was a Red (to which the conservative political theorist Russell Kirk replied, “Ike’s not a Communist, he’s a golfer”).</p><p>William F. Buckley recognized that the Birchers were being used by the liberal media to “anathematize the entire American right wing.” At first, his magazine, National Review (where I often hang my hat), tried to argue that the problem was just a narrow “lunatic fringe” of Birchers, and not the rank and file. But very quickly, the editors recognized that the broader movement needed to be denounced and defenestrated.</p></blockquote><p>Jonah even went on his friend Hugh Hewitt’s show and tried to get him to sign on to a campaign against the Alt-Right, to which Hugh, through either common sense, or, more likely, cowardice and fear of losing part of his audience, was obviously reluctant to endorse:</p><blockquote><p> HH: We have been having a Twitter back and forth, and I actually don’t think we disagree. We just disagree maybe on a statement of the facts. Would you define the alt right?</p><p>JG: I know what you’re about to do. And then you’re going to say well, there’s this other version of the alt right. I am willing to defer to the definition of the alt right that the people who created and lead the alt right movement use, which is an, the one thing that unites them, Jared Taylor was on Diane Rehm the other day. Jared Taylor is a leading racist…</p><p>HH: Good. Please.</p><p>JG: …a member of the white alt right. And he says that there are a lot of different views among the alt right. Some are Christian, some are Odinists. Some are this, some are that. But the one thing they all agree on is what they call racial realism, or racialism, which is just a social science sounding term for racism. They believe that, if you read Richard Host, if you read Richard Spencer at the NPI, who leads an alt right think tank, if you actually read the people who created the term, who have been pushing this stuff, the one thing they all agree on is that we need to organize this society on the assumption that white people are genetically superior, or that white culture is inherently superior, and that we should have either state-imposed or culturally-imposed segregation between the races, no race mixing with the lower brown people. And I take them at their word, that that’s the stuff that they believe. And I think rather than poisoning or blurring that distinction, we should take them at their word and say we want nothing to do with any of that. And I know that you want nothing to do with any of that. I don’t dispute that for a moment. Where I disagree with you is this idea that we should sort of talk about this broader alt right that is just for the wall, or likes Donald Trump. No. What we should say is this is not your group to them, too. These are not disaffected tea partiers. These are people who we have a fundamental, first principle disagreement with. And any movement that has them in it, doesn’t have me in it, and vice versa.</p><p>HH: I agree 100% with that. Now does the term alt right get used exclusively in that fashion?</p><p>JG: No, which is one of the things that we should be doing, is we should be helping sharpen the distinction, not blur the distinction. I agree with you. There are a lot of people who don’t know what the alt right is. I live in these swamps. I’ve been having these fights for 20 years. I didn’t hear the term alt right until Donald Trump came up. But I know a lot of the people behind the alt right, because I’ve been getting it, they’ve been attacking me and then saying nasty anti-Semitic stuff to me since I started working at National Review. I mean, people are like, the guys at VDARE and these other places, they’ve all coalesced around this idea of the alt right, and it is not a coalitional idea where they want to be part of the conservative movement. It’s that they want to replace the conservative movement.</p><p>HH: And they have to be driven out of the Republican Party.</p><p>JG: Yes.</p><p>HH: I’m speaking as a partisan now. As William F. Buckley led the effort to drive the Birchers out of the party, so must genuine conservatives drive out what you and I agree is the core alt right.</p><p>JG: Right.</p><p>HH: In the process of doing that, I do not want people who are not familiar with how you and I believe it to be understood by the people who invented the term to think that they are being exiled. That is my fear, because I believe a lot of people, and I’ve seen it everywhere I go, say they are alt right, and they don’t know that Jonah Goldberg would then classify them as supremacist.</p><p>JG: Well, I wouldn’t necessarily classify them as supremacists, either. I would classify them as wrong.</p><p>HH: Yes.</p><p>JG: They’re using the term wrong. And in politics, you know, specifically, you know, I wrote a whole book which you were very kind to about the importance of labels and why they matter, and the importance of ideology and why it matters, and that we shouldn’t fall into this thing that labels don’t matter. Labels matter a great deal. The labels you choose for yourself matter a great deal. And sometimes, people choose their labels incorrectly. And so rather than say, rather than work from the assumption that someone says they’re an alt-righter, and say well, you know, I don’t know that that means you’re a racist, I would say well, what did you, you know, educate them. And people need to be educated about this.</p></blockquote><p>It’s rather like watching monkeys puzzle over a computer and start licking the keyboard and putting the mouse in their mouths in order to figure out how to make it work. It is two long time ideologists trying, and failing, to make sense of identity politics. And speaking of identity, how many of the growing number of people who describe themselves as Alt-Right, who watch Stefan’s videos or read Richard Spencer’s articles or listen to The Right Stuff or Red Ice podcats or look over my <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">16 Points</a> with approval, do you believe to be so concerned that Jonah Goldberg – Jonah F. Goldberg! – would classify them as supremacists that they will flee from the brand with all due alacrity?</p><p>This is AAA Grade cuckservative projection: the belief that the key to all persuasion is to convince the other person that failing to do as you want will lead to someone calling you racist.</p><p>Point 12: The Alt-Right doesn’t care what you think of it.</p><p>Jonah isn’t as stupid as he sometimes appears to be. He understands, as he makes clear in the Hewitt interview, that he cannot expect to be as successful in banishing the Alt-Right from the public discourse or the Republican Party as Buckley was in purging the Birchers from the conservative movement. He knows we have no interest in being a part of it; any lingering doubts about the rhetorical effectiveness of “cuckservative” should be put to rest by that glorious moment when Hewitt recoils in horror from the mere mention of it and prissily hisses “Oh, I <i>hate </i>that!”</p><p>The cuckservatives fear and hate the Alt-Right for one simple reason. We are not their friends. We are not their allies. We are their replacements. They like to call us Nazis, well, to extend the Nazi analogy a bit further, conservatives are the Hindenburg party, in both senses of the term.</p><p>And as Mr. X pointed out on Twitter: <i>“Everyone shouting “Birchers” like getting rid of them was great should remember that they were mostly right about communists in government.”</i></p></div>",
  "content_text": "It’s a bit ironic. Universal Press Syndicate signed me to a syndication contract with the idea that I would gradually come to replace their big syndicate star, William F. Buckley, because they considered me to be the most intellectually formidable of the “young” columnists then on the political scene. Needless to say, that didn’t happen, as they were totally unable to place my column anywhere except, briefly, with the\nDallas Morning News\n.\nAs it turns out, it’s Jonah Goldberg who has turned out to be the true heir to William F. Buckley, as he is attempting to repeat his predecessor’s example in reading the 160,000-strong John Birch Society out of the conservative movement in a column entitled\n“Time to John Birch the Alt-Right\n“.\nThere is a diversity of views among the self-described alt-right. But the one unifying sentiment is racism — or what they like to call “racialism” or “race realism.” In the words of one alt-right leader, Jared Taylor, “the races are not equal and equivalent.” On Monday, Taylor asserted on NPR’s “Diane Rehm Show” that racialism — not religion, economics, etc. — is the one issue that unites alt-righters.\nIf you read the writings of leading alt-righters, it is impossible to come to any other conclusion. Some are avowed white supremacists. Some eschew talk of supremacy and instead focus on the need for racial separation to protect “white identity.” But one can’t talk about the alt-right knowledgeably without recognizing their racism.\nAnd yet that is exactly what some conservatives seem intent on doing. For example, my friend Hugh Hewitt, the influential talk-radio host, has been arguing that there is a “narrow” alt-right made up of a “execrable anti-Semitic, white supremacist fringe” but also a “broad alt-right” made up of frustrated tea partiers and others who are simply hostile to the GOP establishment and any form of immigration reform that falls short of mass deportation.\nThis isn’t just wrong, it’s madness. The alt-righters are a politically insignificant band. Why claim that a group dedicated to overthrowing conservatism for a white-nationalist fantasy is in fact a member of the conservative coalition? Why muddy a distinction the alt-righters are eager to keep clear?\nIn the 1960s, the fledgling conservative movement was faced with a similar dilemma. The John Birch Society was a paranoid outfit dedicated to the theory that the U.S. government was controlled by communists. It said even Dwight Eisenhower was a Red (to which the conservative political theorist Russell Kirk replied, “Ike’s not a Communist, he’s a golfer”).\nWilliam F. Buckley recognized that the Birchers were being used by the liberal media to “anathematize the entire American right wing.” At first, his magazine, National Review (where I often hang my hat), tried to argue that the problem was just a narrow “lunatic fringe” of Birchers, and not the rank and file. But very quickly, the editors recognized that the broader movement needed to be denounced and defenestrated.\nJonah even went on his friend Hugh Hewitt’s show and tried to get him to sign on to a campaign against the Alt-Right, to which Hugh, through either common sense, or, more likely, cowardice and fear of losing part of his audience, was obviously reluctant to endorse:\nHH: We have been having a Twitter back and forth, and I actually don’t think we disagree. We just disagree maybe on a statement of the facts. Would you define the alt right?\nJG: I know what you’re about to do. And then you’re going to say well, there’s this other version of the alt right. I am willing to defer to the definition of the alt right that the people who created and lead the alt right movement use, which is an, the one thing that unites them, Jared Taylor was on Diane Rehm the other day. Jared Taylor is a leading racist…\nHH: Good. Please.\nJG: …a member of the white alt right. And he says that there are a lot of different views among the alt right. Some are Christian, some are Odinists. Some are this, some are that. But the one thing they all agree on is what they call racial realism, or racialism, which is just a social science sounding term for racism. They believe that, if you read Richard Host, if you read Richard Spencer at the NPI, who leads an alt right think tank, if you actually read the people who created the term, who have been pushing this stuff, the one thing they all agree on is that we need to organize this society on the assumption that white people are genetically superior, or that white culture is inherently superior, and that we should have either state-imposed or culturally-imposed segregation between the races, no race mixing with the lower brown people. And I take them at their word, that that’s the stuff that they believe. And I think rather than poisoning or blurring that distinction, we should take them at their word and say we want nothing to do with any of that. And I know that you want nothing to do with any of that. I don’t dispute that for a moment. Where I disagree with you is this idea that we should sort of talk about this broader alt right that is just for the wall, or likes Donald Trump. No. What we should say is this is not your group to them, too. These are not disaffected tea partiers. These are people who we have a fundamental, first principle disagreement with. And any movement that has them in it, doesn’t have me in it, and vice versa.\nHH: I agree 100% with that. Now does the term alt right get used exclusively in that fashion?\nJG: No, which is one of the things that we should be doing, is we should be helping sharpen the distinction, not blur the distinction. I agree with you. There are a lot of people who don’t know what the alt right is. I live in these swamps. I’ve been having these fights for 20 years. I didn’t hear the term alt right until Donald Trump came up. But I know a lot of the people behind the alt right, because I’ve been getting it, they’ve been attacking me and then saying nasty anti-Semitic stuff to me since I started working at National Review. I mean, people are like, the guys at VDARE and these other places, they’ve all coalesced around this idea of the alt right, and it is not a coalitional idea where they want to be part of the conservative movement. It’s that they want to replace the conservative movement.\nHH: And they have to be driven out of the Republican Party.\nJG: Yes.\nHH: I’m speaking as a partisan now. As William F. Buckley led the effort to drive the Birchers out of the party, so must genuine conservatives drive out what you and I agree is the core alt right.\nJG: Right.\nHH: In the process of doing that, I do not want people who are not familiar with how you and I believe it to be understood by the people who invented the term to think that they are being exiled. That is my fear, because I believe a lot of people, and I’ve seen it everywhere I go, say they are alt right, and they don’t know that Jonah Goldberg would then classify them as supremacist.\nJG: Well, I wouldn’t necessarily classify them as supremacists, either. I would classify them as wrong.\nHH: Yes.\nJG: They’re using the term wrong. And in politics, you know, specifically, you know, I wrote a whole book which you were very kind to about the importance of labels and why they matter, and the importance of ideology and why it matters, and that we shouldn’t fall into this thing that labels don’t matter. Labels matter a great deal. The labels you choose for yourself matter a great deal. And sometimes, people choose their labels incorrectly. And so rather than say, rather than work from the assumption that someone says they’re an alt-righter, and say well, you know, I don’t know that that means you’re a racist, I would say well, what did you, you know, educate them. And people need to be educated about this.\nIt’s rather like watching monkeys puzzle over a computer and start licking the keyboard and putting the mouse in their mouths in order to figure out how to make it work. It is two long time ideologists trying, and failing, to make sense of identity politics. And speaking of identity, how many of the growing number of people who describe themselves as Alt-Right, who watch Stefan’s videos or read Richard Spencer’s articles or listen to The Right Stuff or Red Ice podcats or look over my\n16 Points\nwith approval, do you believe to be so concerned that Jonah Goldberg – Jonah F. Goldberg! – would classify them as supremacists that they will flee from the brand with all due alacrity?\nThis is AAA Grade cuckservative projection: the belief that the key to all persuasion is to convince the other person that failing to do as you want will lead to someone calling you racist.\nPoint 12: The Alt-Right doesn’t care what you think of it.\nJonah isn’t as stupid as he sometimes appears to be. He understands, as he makes clear in the Hewitt interview, that he cannot expect to be as successful in banishing the Alt-Right from the public discourse or the Republican Party as Buckley was in purging the Birchers from the conservative movement. He knows we have no interest in being a part of it; any lingering doubts about the rhetorical effectiveness of “cuckservative” should be put to rest by that glorious moment when Hewitt recoils in horror from the mere mention of it and prissily hisses “Oh, I\nhate\nthat!”\nThe cuckservatives fear and hate the Alt-Right for one simple reason. We are not their friends. We are not their allies. We are their replacements. They like to call us Nazis, well, to extend the Nazi analogy a bit further, conservatives are the Hindenburg party, in both senses of the term.\nAnd as Mr. X pointed out on Twitter:\n“Everyone shouting “Birchers” like getting rid of them was great should remember that they were mostly right about communists in government.”",
  "tags": [
    "#AltRight",
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-01T11:00:00+00:00"
}