{
  "url": "https://voxday.net/2016/09/29/the-petty-evil-of-william-f-buckley/",
  "scraped_at": "2025-12-18T01:56:53.658142",
  "title": "The petty evil of William F. Buckley",
  "date_display": "September 29, 2016",
  "date_iso": "2016-09-29T15:00:00+00:00",
  "date_from_url": "2016-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anonymous Conservative <a href=\"http://www.anonymousconservative.com/blog/william-f-buckley-a-case-study-in-narcissistic-personality-disorder/\">exposes the thought policeman of the conservative establishment</a> to have been a malignant narcissist:</p><blockquote><p> Jonah Goldberg recently said it was time to John Birch the Alt-right. Good luck with that, numbnuts, as an economic apocalypse approaches and the nation finds itself overrun with your Establishment-approved, religion-of-peace amigos. You’ll be lucky to one day escape the mob that is coming yourself. I look on this piece as my get out of jail free card, should I ever have the misfortune to be captured in Jonah’s vicinity.</p><p>So I am free to discuss things like this openly now. If the Cuckservative Establishment wants to attack the Alt-right, lets take a look at their saintly standard bearer through the lens of Narcissistic Personality Disorder. Our source material will be the piece written by his son in the <i>New York Times</i>. At the time I read it, I was repulsed by what appears to be a case of pretty severe Malignant Narcissistic Personality Disorder. Here I will explain why, after quotes from the article.</p><p>First is the picture of him. Notice how despite his youth, you can still see the glassy, disconnected eyes. And the sneer of contempt, almost to the point of a growl with an upcurled lip, which is manifest on the left side of his face, and masked on the right side. That facial asymmetry always seems to hold when I see something aberrant. Faces are handed, and the left side almost never hides the demons within as well as the right.</p><p>Now the article.</p><p><i>Pup’s self-medicating was, I’d venture, a chemical extension of the control he asserted over every other aspect of his life. The term “control freak” is pejorative. Put it this way: Few great men — and I use the term precisely, for Pup was a great man — do not assert total control over their domains…</i><br> <i><br/></i><br> <i>He was invariably the sunniest and most pleasant creature in the room. The moods of those in attendance upon him — Mum’s, mainly — did not always match his.</i><br> <i><br/></i><br> <i>A TV remote control in the hands of an autocrat of the entertainment room becomes a “Star Trek” phaser set on stun. He and Mum might be watching “Murder on the Orient Express” with a half-dozen guests when, just as a key plot point was being introduced, suddenly the screen would fill with a documentary on Che Guevara or the Tuareg nomads of the Sahara…</i><br> <i><br/></i><br> <i>There, the three of us would eat one of Julian the cook’s delicious meals on trays and watch a movie. I say “a movie,” but “movies” would be more accurate, since several minutes in, without bothering to say, “Let’s watch something else,” he’d simply change the channel. One day, when I was out of town and called to check in, Danny reported, with a somewhat-strained chuckle, “We watched parts of five movies last night…”</i><br> <i><br/></i><br> <i>Once or twice during the convalescence, I became so splutteringly frustrated after the fourth or fifth channel change that I silently stormed out of the room.</i></br></br></br></br></br></br></br></br></p><p>I know what Buckley was doing because I have seen this mind in action. That storming out was what Buckley wanted. Think about it. He was watching those shows. Was he not drawn into them? Was his interest alone not piqued to see the climactic resolution unfold? Was his boredom climaxing at the exact moment everyone else’s interest was maximally invested?</p><p>The satisfaction he felt when everyone else was enraged at that critical moment was more pleasurable to him than seeing the plot twists revealed…. Buckley was not a great man. He was, like all narcissists, an insecure, mentally damaged coward, elevated to his position by an establishment that saw him as a useful idiot who would happily suppress the most fierce advocates for freedom, from John Birch to Ayn Rand.</p></blockquote><p>I never, ever liked Buckley’s writing. There was always something that was distinctly off about it to me. There was never any depth or substance to it; there is more meat to a single chapter of Sam Huntington than there is in Buckley’s entire oeuvre. His columns never seemed to hit the target, and his novels were meandering and pointless. Yes, he was intelligent and influential, but always in the most shallow and superficial manner. It is not even remotely surprising to me that the establishment he constructed and policed has not long survived his death. In a different situation, he would have been a dictator, and probably have met with much the same fate as a Mussolini.</p><p>Read the whole thing. The incident with the boat at Christmas makes it very clear that there was definitely something seriously psychologically wrong with the man. He was basically the real-life version of Ricky Bobby’s father in <i>Talladega Nights</i>, if the father had punched out the waitress and burned down the Applebee’s instead of just mouthing off to her and being thrown out.</p><p>AC explains the driving motivation of the intelligent malignant narcissist:  <i>This is the cerebral narcissist’s dream – tangible proof which they can handle in their brain, that everyone else is an idiot, and they are the smart one. It relieves the great insecurity which drives them unrelentingly to try and one-up everyone else.</i></p><p>This is why I don’t worry about to those who can admit that they have failed, admit that they are wrong, and don’t feel the need to inappropriately flaunt their intelligence at all times, but keep a very wary eye on those who are never wrong, always win, and claim even the most abject defeat to be a victory in disguise. They’re not all malignant narcissists, they may only be garden-variety Gamma secret kings, but in no circumstances can any of them be trusted in any way.</p><p>Notice how often Christopher Buckley tried to reason with his father, to absolutely no avail. That’s an unwinnable scenario with malignant narcissists, it is the <i>Kobayashi Maru</i>. Don’t argue with them, don’t try to correct them, don’t try to fix things for them, don’t enable them in any way, just keep your distance, keep them out of your life, and leave them to their delusional hellholes.</p></div>",
  "content_text": "Anonymous Conservative\nexposes the thought policeman of the conservative establishment\nto have been a malignant narcissist:\nJonah Goldberg recently said it was time to John Birch the Alt-right. Good luck with that, numbnuts, as an economic apocalypse approaches and the nation finds itself overrun with your Establishment-approved, religion-of-peace amigos. You’ll be lucky to one day escape the mob that is coming yourself. I look on this piece as my get out of jail free card, should I ever have the misfortune to be captured in Jonah’s vicinity.\nSo I am free to discuss things like this openly now. If the Cuckservative Establishment wants to attack the Alt-right, lets take a look at their saintly standard bearer through the lens of Narcissistic Personality Disorder. Our source material will be the piece written by his son in the\nNew York Times\n. At the time I read it, I was repulsed by what appears to be a case of pretty severe Malignant Narcissistic Personality Disorder. Here I will explain why, after quotes from the article.\nFirst is the picture of him. Notice how despite his youth, you can still see the glassy, disconnected eyes. And the sneer of contempt, almost to the point of a growl with an upcurled lip, which is manifest on the left side of his face, and masked on the right side. That facial asymmetry always seems to hold when I see something aberrant. Faces are handed, and the left side almost never hides the demons within as well as the right.\nNow the article.\nPup’s self-medicating was, I’d venture, a chemical extension of the control he asserted over every other aspect of his life. The term “control freak” is pejorative. Put it this way: Few great men — and I use the term precisely, for Pup was a great man — do not assert total control over their domains…\nHe was invariably the sunniest and most pleasant creature in the room. The moods of those in attendance upon him — Mum’s, mainly — did not always match his.\nA TV remote control in the hands of an autocrat of the entertainment room becomes a “Star Trek” phaser set on stun. He and Mum might be watching “Murder on the Orient Express” with a half-dozen guests when, just as a key plot point was being introduced, suddenly the screen would fill with a documentary on Che Guevara or the Tuareg nomads of the Sahara…\nThere, the three of us would eat one of Julian the cook’s delicious meals on trays and watch a movie. I say “a movie,” but “movies” would be more accurate, since several minutes in, without bothering to say, “Let’s watch something else,” he’d simply change the channel. One day, when I was out of town and called to check in, Danny reported, with a somewhat-strained chuckle, “We watched parts of five movies last night…”\nOnce or twice during the convalescence, I became so splutteringly frustrated after the fourth or fifth channel change that I silently stormed out of the room.\nI know what Buckley was doing because I have seen this mind in action. That storming out was what Buckley wanted. Think about it. He was watching those shows. Was he not drawn into them? Was his interest alone not piqued to see the climactic resolution unfold? Was his boredom climaxing at the exact moment everyone else’s interest was maximally invested?\nThe satisfaction he felt when everyone else was enraged at that critical moment was more pleasurable to him than seeing the plot twists revealed…. Buckley was not a great man. He was, like all narcissists, an insecure, mentally damaged coward, elevated to his position by an establishment that saw him as a useful idiot who would happily suppress the most fierce advocates for freedom, from John Birch to Ayn Rand.\nI never, ever liked Buckley’s writing. There was always something that was distinctly off about it to me. There was never any depth or substance to it; there is more meat to a single chapter of Sam Huntington than there is in Buckley’s entire oeuvre. His columns never seemed to hit the target, and his novels were meandering and pointless. Yes, he was intelligent and influential, but always in the most shallow and superficial manner. It is not even remotely surprising to me that the establishment he constructed and policed has not long survived his death. In a different situation, he would have been a dictator, and probably have met with much the same fate as a Mussolini.\nRead the whole thing. The incident with the boat at Christmas makes it very clear that there was definitely something seriously psychologically wrong with the man. He was basically the real-life version of Ricky Bobby’s father in\nTalladega Nights\n, if the father had punched out the waitress and burned down the Applebee’s instead of just mouthing off to her and being thrown out.\nAC explains the driving motivation of the intelligent malignant narcissist:\nThis is the cerebral narcissist’s dream – tangible proof which they can handle in their brain, that everyone else is an idiot, and they are the smart one. It relieves the great insecurity which drives them unrelentingly to try and one-up everyone else.\nThis is why I don’t worry about to those who can admit that they have failed, admit that they are wrong, and don’t feel the need to inappropriately flaunt their intelligence at all times, but keep a very wary eye on those who are never wrong, always win, and claim even the most abject defeat to be a victory in disguise. They’re not all malignant narcissists, they may only be garden-variety Gamma secret kings, but in no circumstances can any of them be trusted in any way.\nNotice how often Christopher Buckley tried to reason with his father, to absolutely no avail. That’s an unwinnable scenario with malignant narcissists, it is the\nKobayashi Maru\n. Don’t argue with them, don’t try to correct them, don’t try to fix things for them, don’t enable them in any way, just keep your distance, keep them out of your life, and leave them to their delusional hellholes.",
  "tags": [
    "media",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-29T14:00:00+00:00"
}