{
  "url": "https://voxday.net/2016/09/21/the-true-christian-teaching-on/",
  "scraped_at": "2025-12-18T01:55:26.357441",
  "title": "The true Christian teaching on immigration",
  "date_display": "September 21, 2016",
  "date_iso": "2016-09-21T10:59:00+00:00",
  "date_from_url": "2016-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contra the current churchian and papal perspectives, <a href=\"http://www.returntoorder.org/2014/07/saint-thomas-say-immigration-2/\">the traditional Christian teaching on immigration</a> is that the common good of the nation must be considered first, not whatever happens to most benefit the potential immigrant. This analysis of St. Thomas Aquinas’s work makes clear what was repeatedly demonstrated in <i><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></i>, which is that what churchians are doing with regards to immigration is not Christian at all, but are the works of a false faith that is intrinsically anti-Christian.</p><blockquote><p> Immigration is a modern problem and so some might think that the medieval Saint Thomas would have no opinion about the problem. And yet, he does. One has only to look in his masterpiece, the Summa Theologica, in the second part of the first part, question 105, article 3 (I-II, Q. 105, Art. 3). There one finds his analysis based on biblical insights that can add to the national debate. They are entirely applicable to the present.</p><p>Saint Thomas: <i>“Man’s relations with foreigners are twofold: peaceful, and hostile: and in directing both kinds of relation the Law contained suitable precepts.”</i></p><p>Commentary: In making this affirmation, Saint Thomas affirms that not all immigrants are equal. Every nation has the right to decide which immigrants are beneficial, that is, “peaceful,” to the common good. As a matter of self-defense, the State can reject those criminal elements, traitors, enemies and others who it deems harmful or “hostile” to its citizens.</p><p>The second thing he affirms is that the manner of dealing with immigration is determined by law in the cases of both beneficial and “hostile” immigration. The State has the right and duty to apply its law.</p><p>Saint Thomas: <i>“For the Jews were offered three opportunities of peaceful relations with foreigners. First, when foreigners passed through their land as travelers. Secondly, when they came to dwell in their land as newcomers. And in both these respects the Law made kind provision in its precepts: for it is written (Exodus 22:21): ’Thou shalt not molest a stranger [advenam]’; and again (Exodus 22:9): ’Thou shalt not molest a stranger [peregrino].’”</i></p><p>Commentary: Here Saint Thomas acknowledges the fact that others will want to come to visit or even stay in the land for some time. Such foreigners deserved to be treated with charity, respect and courtesy, which is due to any human of good will. In these cases, the law can and should protect foreigners from being badly treated or molested.</p><p>Saint Thomas: <i>“Thirdly, when any foreigners wished to be admitted entirely to their fellowship and mode of worship. With regard to these a certain order was observed. For they were not at once admitted to citizenship: just as it was law with some nations that no one was deemed a citizen except after two or three generations, as the Philosopher says (Polit. iii, 1).”</i></p><p>Commentary: Saint Thomas recognizes that there will be those who will want to stay and become citizens of the lands they visit. However, he sets as the first condition for acceptance a desire to integrate fully into what would today be considered the culture and life of the nation.</p><p>A second condition is that the granting of citizenship would not be immediate. The integration process takes time. People need to adapt themselves to the nation. He quotes the philosopher Aristotle as saying this process was once deemed to take two or three generations. Saint Thomas himself does not give a timeframe for this integration, but he does admit that it can take a long time.</p><p>Saint Thomas: <i>“The reason for this was that if foreigners were allowed to meddle with the affairs of a nation as soon as they settled down in its midst, many dangers might occur, since the foreigners not yet having the common good firmly at heart might attempt something hurtful to the people.”</i></p><p>Commentary: The common sense of Saint Thomas is certainly not politically correct but it is logical. The theologian notes that living in a nation is a complex thing. It takes time to know the issues affecting the nation. Those familiar with the long history of their nation are in the best position to make the long-term decisions about its future. It is harmful and unjust to put the future of a place in the hands of those recently arrived, who, although through no fault of their own, have little idea of what is happening or has happened in the nation. Such a policy could lead to the destruction of the nation.</p><p>As an illustration of this point, Saint Thomas later notes that the Jewish people did not treat all nations equally since those nations closer to them were more quickly integrated into the population than those who were not as close. Some hostile peoples were not to be admitted at all into full fellowship due to their enmity toward the Jewish people.</p><p>These are some of the thoughts of Saint Thomas Aquinas on the matter of immigration based on biblical principles. It is clear that immigration must have two things in mind: the first is the nation’s unity; and the second is the common good.</p><p>Immigration should have as its goal integration, not disintegration or segregation. The immigrant should not only desire to assume the benefits but the responsibilities of joining into the full fellowship of the nation. By becoming a citizen, a person becomes part of a broad family over the long term and not a shareholder in a joint stock company seeking only short-term self-interest.</p><p>Secondly, Saint Thomas teaches that immigration must have in mind the common good; it cannot destroy or overwhelm a nation.</p><p>This explains why so many Americans experience uneasiness caused by massive and disproportional immigration. Such policy artificially introduces a situation that destroys common points of unity and overwhelms the ability of a society to absorb new elements organically into a unified culture. The common good is no longer considered.</p></blockquote></div>",
  "content_text": "Contra the current churchian and papal perspectives,\nthe traditional Christian teaching on immigration\nis that the common good of the nation must be considered first, not whatever happens to most benefit the potential immigrant. This analysis of St. Thomas Aquinas’s work makes clear what was repeatedly demonstrated in\nCuckservative\n, which is that what churchians are doing with regards to immigration is not Christian at all, but are the works of a false faith that is intrinsically anti-Christian.\nImmigration is a modern problem and so some might think that the medieval Saint Thomas would have no opinion about the problem. And yet, he does. One has only to look in his masterpiece, the Summa Theologica, in the second part of the first part, question 105, article 3 (I-II, Q. 105, Art. 3). There one finds his analysis based on biblical insights that can add to the national debate. They are entirely applicable to the present.\nSaint Thomas:\n“Man’s relations with foreigners are twofold: peaceful, and hostile: and in directing both kinds of relation the Law contained suitable precepts.”\nCommentary: In making this affirmation, Saint Thomas affirms that not all immigrants are equal. Every nation has the right to decide which immigrants are beneficial, that is, “peaceful,” to the common good. As a matter of self-defense, the State can reject those criminal elements, traitors, enemies and others who it deems harmful or “hostile” to its citizens.\nThe second thing he affirms is that the manner of dealing with immigration is determined by law in the cases of both beneficial and “hostile” immigration. The State has the right and duty to apply its law.\nSaint Thomas:\n“For the Jews were offered three opportunities of peaceful relations with foreigners. First, when foreigners passed through their land as travelers. Secondly, when they came to dwell in their land as newcomers. And in both these respects the Law made kind provision in its precepts: for it is written (Exodus 22:21): ’Thou shalt not molest a stranger [advenam]’; and again (Exodus 22:9): ’Thou shalt not molest a stranger [peregrino].’”\nCommentary: Here Saint Thomas acknowledges the fact that others will want to come to visit or even stay in the land for some time. Such foreigners deserved to be treated with charity, respect and courtesy, which is due to any human of good will. In these cases, the law can and should protect foreigners from being badly treated or molested.\nSaint Thomas:\n“Thirdly, when any foreigners wished to be admitted entirely to their fellowship and mode of worship. With regard to these a certain order was observed. For they were not at once admitted to citizenship: just as it was law with some nations that no one was deemed a citizen except after two or three generations, as the Philosopher says (Polit. iii, 1).”\nCommentary: Saint Thomas recognizes that there will be those who will want to stay and become citizens of the lands they visit. However, he sets as the first condition for acceptance a desire to integrate fully into what would today be considered the culture and life of the nation.\nA second condition is that the granting of citizenship would not be immediate. The integration process takes time. People need to adapt themselves to the nation. He quotes the philosopher Aristotle as saying this process was once deemed to take two or three generations. Saint Thomas himself does not give a timeframe for this integration, but he does admit that it can take a long time.\nSaint Thomas:\n“The reason for this was that if foreigners were allowed to meddle with the affairs of a nation as soon as they settled down in its midst, many dangers might occur, since the foreigners not yet having the common good firmly at heart might attempt something hurtful to the people.”\nCommentary: The common sense of Saint Thomas is certainly not politically correct but it is logical. The theologian notes that living in a nation is a complex thing. It takes time to know the issues affecting the nation. Those familiar with the long history of their nation are in the best position to make the long-term decisions about its future. It is harmful and unjust to put the future of a place in the hands of those recently arrived, who, although through no fault of their own, have little idea of what is happening or has happened in the nation. Such a policy could lead to the destruction of the nation.\nAs an illustration of this point, Saint Thomas later notes that the Jewish people did not treat all nations equally since those nations closer to them were more quickly integrated into the population than those who were not as close. Some hostile peoples were not to be admitted at all into full fellowship due to their enmity toward the Jewish people.\nThese are some of the thoughts of Saint Thomas Aquinas on the matter of immigration based on biblical principles. It is clear that immigration must have two things in mind: the first is the nation’s unity; and the second is the common good.\nImmigration should have as its goal integration, not disintegration or segregation. The immigrant should not only desire to assume the benefits but the responsibilities of joining into the full fellowship of the nation. By becoming a citizen, a person becomes part of a broad family over the long term and not a shareholder in a joint stock company seeking only short-term self-interest.\nSecondly, Saint Thomas teaches that immigration must have in mind the common good; it cannot destroy or overwhelm a nation.\nThis explains why so many Americans experience uneasiness caused by massive and disproportional immigration. Such policy artificially introduces a situation that destroys common points of unity and overwhelms the ability of a society to absorb new elements organically into a unified culture. The common good is no longer considered.",
  "tags": [
    "Christianity",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-21T09:59:00+00:00"
}