{
  "url": "https://voxday.net/2016/09/17/the-idiot-intellectuals/",
  "scraped_at": "2025-12-18T01:54:49.142482",
  "title": "The idiot intellectuals",
  "date_display": "September 17, 2016",
  "date_iso": "2016-09-17T15:09:00+00:00",
  "date_from_url": "2016-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nassim Nicholas Taleb explains why the world desperately needs to ignore the idiot intellectuals who presently rule it:</p><blockquote><p> What we have been seeing worldwide, from India to the UK to the US, is the rebellion against the inner circle of no-skin-in-the-game policymaking “clerks” and journalists-insiders, that class of paternalistic semi-intellectual experts with some Ivy league, Oxford-Cambridge, or similar label-driven education who are telling the rest of us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think… and 5) who to vote for.</p><p>But the problem is the one-eyed following the blind: these self-described members of the “intelligenzia” can’t find a coconut in Coconut Island, meaning they aren’t intelligent enough to define intelligence hence fall into circularities — but their main skill is capacity to pass exams written by people like them. With psychology papers replicating less than 40%, dietary advice reversing after 30 years of fatphobia, macroeconomic analysis working worse than astrology, the appointment of Bernanke, who was less than clueless of the risks, and pharmaceutical trials replicating at best only 1/3 of the time, people are perfectly entitled to rely on their own ancestral instinct and listen to their grandmothers (or Montaigne and such filtered classical knowledge) with a better track record than these policymaking goons.</p><p>Indeed one can see that these academico-bureaucrats who feel entitled to run our lives aren’t even rigorous, whether in medical statistics or policymaking. They cant tell science from scientism — in fact in their eyes scientism looks more scientific than real science. (For instance it is trivial to show the following: much of what the Cass-Sunstein-Richard Thaler types — those who want to “nudge” us into some behavior — much of what they call “rational” or “irrational” comes from their misunderstanding of probability theory and cosmetic use of first-order models.) They are also prone to mistake the ensemble for the linear aggregation of its components as we saw in the chapter extending the minority rule.</p></blockquote><p>I could not agree more. One thing I have noticed, regularly and reliably, is that the professional class of the so-called cognitive elite <i>are simply not that smart</i>. I mean, they’re not exactly stupid, but most of them are 2SD midwits who are <i>considerably </i>less intelligent than Taleb, me, or most of the genuinely smart people that I know.</p><p>Remember <a href=\"http://www.milobookclub.com/2015/05/18/the-excluded/\">the lesson of the Excluded</a>: “The probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133. It then falls about 1/3 by 140. By 150 IQ the probability has fallen by 97%! In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.”</p><p>Or as Taleb puts it: “Beware the semi-erudite who thinks he is an erudite. He fails to naturally detect sophistry. The IYI pathologizes others for doing things he doesn’t understand without ever realizing it is his understanding that may be limited.”</p></div>",
  "content_text": "Nassim Nicholas Taleb explains why the world desperately needs to ignore the idiot intellectuals who presently rule it:\nWhat we have been seeing worldwide, from India to the UK to the US, is the rebellion against the inner circle of no-skin-in-the-game policymaking “clerks” and journalists-insiders, that class of paternalistic semi-intellectual experts with some Ivy league, Oxford-Cambridge, or similar label-driven education who are telling the rest of us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think… and 5) who to vote for.\nBut the problem is the one-eyed following the blind: these self-described members of the “intelligenzia” can’t find a coconut in Coconut Island, meaning they aren’t intelligent enough to define intelligence hence fall into circularities — but their main skill is capacity to pass exams written by people like them. With psychology papers replicating less than 40%, dietary advice reversing after 30 years of fatphobia, macroeconomic analysis working worse than astrology, the appointment of Bernanke, who was less than clueless of the risks, and pharmaceutical trials replicating at best only 1/3 of the time, people are perfectly entitled to rely on their own ancestral instinct and listen to their grandmothers (or Montaigne and such filtered classical knowledge) with a better track record than these policymaking goons.\nIndeed one can see that these academico-bureaucrats who feel entitled to run our lives aren’t even rigorous, whether in medical statistics or policymaking. They cant tell science from scientism — in fact in their eyes scientism looks more scientific than real science. (For instance it is trivial to show the following: much of what the Cass-Sunstein-Richard Thaler types — those who want to “nudge” us into some behavior — much of what they call “rational” or “irrational” comes from their misunderstanding of probability theory and cosmetic use of first-order models.) They are also prone to mistake the ensemble for the linear aggregation of its components as we saw in the chapter extending the minority rule.\nI could not agree more. One thing I have noticed, regularly and reliably, is that the professional class of the so-called cognitive elite\nare simply not that smart\n. I mean, they’re not exactly stupid, but most of them are 2SD midwits who are\nconsiderably\nless intelligent than Taleb, me, or most of the genuinely smart people that I know.\nRemember\nthe lesson of the Excluded\n: “The probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133. It then falls about 1/3 by 140. By 150 IQ the probability has fallen by 97%! In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.”\nOr as Taleb puts it: “Beware the semi-erudite who thinks he is an erudite. He fails to naturally detect sophistry. The IYI pathologizes others for doing things he doesn’t understand without ever realizing it is his understanding that may be limited.”",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-17T14:09:00+00:00"
}