{
  "url": "https://voxday.net/2016/09/30/the-age-of-orc/",
  "scraped_at": "2025-12-18T01:57:08.365112",
  "title": "The Age of the Orc",
  "date_display": "September 30, 2016",
  "date_iso": "2016-09-30T17:30:00+00:00",
  "date_from_url": "2016-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dyskord fails to grasp the importance of priorities with regards to the survival of the West:</p><blockquote><p> All the talk of socialism as if its a valid form of government and wont lead to the same failed mess it always degrades into is laughable. I mean seriously now these socialists have jumped on the alt right bandwagon and under the guise of white nationalism proclaim socialism a white concept that only failed because of the inferior genetic or whatever faults of the OTHER races. Another pathetic excuse for a truly foolish system of governance.</p><p>I have to ask Vox, if a group of alt white Communists start proclaiming us and others false flag bearers will you accept them as valid by dint of being white nationalists.<br> At this rate the alt right should it succeed will fall into the same traps which led to the current decline.</br></p><p>I support the 14 words. I believe that in the history of the world only Western Civilization has raised individual men and women to a level of safety, security and freedom unprecedented in recorded history. I believe that nowhere outside of Europe or current predominantly white former colonies like New Zealand and Australia does democracy and Western values prevail. However not all white peoples are equal. In fact today pale-skinned latino’s are considered white. A century ago Italians weren’t considered white. The same regarding the Irish.</p><p>I’m not trying to dispose of the alt white or rally against them. By all means lets work together. But this acceptance of Socialism as valid is IMO disheartening. The rise of the right across Europe in my understanding is a refutation of socialism and its fruits.</p></blockquote><p>First, let’s get one thing perfectly clear. In any non-white West, some form of socialism may be the best case scenario. It is more likely that there won’t be an economic system that is recognizable as a coherent Western system of any kind. After all, what is the best way to describe the economies of Mexico, Colombia, Saudi Arabia, or Malaysia?</p><p>Second, identity always trumps ideology in the end. I don’t accept socialist economics any more than I accept the idea that 1+1=37 or that the Merovingian dynasty was descended from Jesus Christ. But every mass movement needs the participation of the left side of the bell curve too. The socialists of the Alt-Right are no more harmful to the core cause of the Alt-Right at this point in time than are the free traders, the monetarists, or the Keynesians. Their collective economic ignorance is irrelevant.</p><p>The largest invasion in human history is taking place and its consequences are going to shake the world for decades, possibly centuries. The Men of the West have laid down their guard and been invaded en masse by orcs and goblins and other creatures; even their cradles are filled with changelings.</p><p>Consider this: there are fewer than 1,000 speakers of my tribe’s language alive today. It will be extinct by 2150. My tribe’s blood is more diluted than that of the Numenoreans of Middle Earth; it is entirely possible that one day, your grandchildren’s claim to be white will be scoffed at in much the same way some scoff at my claim to be American Indian. The same thing has already been happening to the American tribe for more than 150 years, to the point that the very definition of “American” has already been altered beyond all recognition.</p><p>The propositionals and universalists among us are wrong, Wrong, WRONG, because they refuse to read history, refuse to listen to us, and refuse to pay any attention to what the orcs and goblins themselves are saying. They believe, erroneously, that orcs and goblins are not only no different under the skin, but also want to be men just like them. But the truth is, they don’t. Orcs and goblins want to continue to be exactly what they are, they simply want to pillage and rule in the West in exactly the same manner they do elsewhere.</p><p>As Sam Huntington noted 20 years ago, our values are not theirs:<br> <i><br/></i><br> <i>The author of another cross-cultural survey of individualism and collectivism similarly highlighted the dominance of individualism in the West compared to the prevalence of collectivism elsewhere and concluded that “the values that are most important in the West are least important worldwide.”</i><br> <i><br/></i>Not just less important, LEAST important. The West will not transform the orcs or their values through its magic dirt. To the contrary, they will do as immigrants have always done, and transform the West into the Not-West, just as America has already been transformed into Not-America by not-Americans.</br></br></br></p><p>And yet, the Men of the West not only will not fight the invaders, they will not even cease to open their arms, their legs, their hearts, and their homes to them. What we are witnessing, what we are <i>participating in</i>, is nothing less than a civilizational mass suicide.</p></div>",
  "content_text": "Dyskord fails to grasp the importance of priorities with regards to the survival of the West:\nAll the talk of socialism as if its a valid form of government and wont lead to the same failed mess it always degrades into is laughable. I mean seriously now these socialists have jumped on the alt right bandwagon and under the guise of white nationalism proclaim socialism a white concept that only failed because of the inferior genetic or whatever faults of the OTHER races. Another pathetic excuse for a truly foolish system of governance.\nI have to ask Vox, if a group of alt white Communists start proclaiming us and others false flag bearers will you accept them as valid by dint of being white nationalists.\nAt this rate the alt right should it succeed will fall into the same traps which led to the current decline.\nI support the 14 words. I believe that in the history of the world only Western Civilization has raised individual men and women to a level of safety, security and freedom unprecedented in recorded history. I believe that nowhere outside of Europe or current predominantly white former colonies like New Zealand and Australia does democracy and Western values prevail. However not all white peoples are equal. In fact today pale-skinned latino’s are considered white. A century ago Italians weren’t considered white. The same regarding the Irish.\nI’m not trying to dispose of the alt white or rally against them. By all means lets work together. But this acceptance of Socialism as valid is IMO disheartening. The rise of the right across Europe in my understanding is a refutation of socialism and its fruits.\nFirst, let’s get one thing perfectly clear. In any non-white West, some form of socialism may be the best case scenario. It is more likely that there won’t be an economic system that is recognizable as a coherent Western system of any kind. After all, what is the best way to describe the economies of Mexico, Colombia, Saudi Arabia, or Malaysia?\nSecond, identity always trumps ideology in the end. I don’t accept socialist economics any more than I accept the idea that 1+1=37 or that the Merovingian dynasty was descended from Jesus Christ. But every mass movement needs the participation of the left side of the bell curve too. The socialists of the Alt-Right are no more harmful to the core cause of the Alt-Right at this point in time than are the free traders, the monetarists, or the Keynesians. Their collective economic ignorance is irrelevant.\nThe largest invasion in human history is taking place and its consequences are going to shake the world for decades, possibly centuries. The Men of the West have laid down their guard and been invaded en masse by orcs and goblins and other creatures; even their cradles are filled with changelings.\nConsider this: there are fewer than 1,000 speakers of my tribe’s language alive today. It will be extinct by 2150. My tribe’s blood is more diluted than that of the Numenoreans of Middle Earth; it is entirely possible that one day, your grandchildren’s claim to be white will be scoffed at in much the same way some scoff at my claim to be American Indian. The same thing has already been happening to the American tribe for more than 150 years, to the point that the very definition of “American” has already been altered beyond all recognition.\nThe propositionals and universalists among us are wrong, Wrong, WRONG, because they refuse to read history, refuse to listen to us, and refuse to pay any attention to what the orcs and goblins themselves are saying. They believe, erroneously, that orcs and goblins are not only no different under the skin, but also want to be men just like them. But the truth is, they don’t. Orcs and goblins want to continue to be exactly what they are, they simply want to pillage and rule in the West in exactly the same manner they do elsewhere.\nAs Sam Huntington noted 20 years ago, our values are not theirs:\nThe author of another cross-cultural survey of individualism and collectivism similarly highlighted the dominance of individualism in the West compared to the prevalence of collectivism elsewhere and concluded that “the values that are most important in the West are least important worldwide.”\nNot just less important, LEAST important. The West will not transform the orcs or their values through its magic dirt. To the contrary, they will do as immigrants have always done, and transform the West into the Not-West, just as America has already been transformed into Not-America by not-Americans.\nAnd yet, the Men of the West not only will not fight the invaders, they will not even cease to open their arms, their legs, their hearts, and their homes to them. What we are witnessing, what we are\nparticipating in\n, is nothing less than a civilizational mass suicide.",
  "tags": [
    "#AltRight",
    "#AltWest",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-30T16:30:00+00:00"
}