{
  "url": "https://voxday.net/2016/09/27/the-color-run-story-of-courage_27/",
  "scraped_at": "2025-12-18T01:56:30.545232",
  "title": "The Color Run: a story of courage, endurance, and ninjas, part III",
  "date_display": "September 27, 2016",
  "date_iso": "2016-09-27T12:00:00+00:00",
  "date_from_url": "2016-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.milobookclub.com/2016/09/25/the-color-run-story-of-courage/\">Part I</a> | <a href=\"http://www.milobookclub.com/2016/09/26/the-color-run-story-of-courage_26/\">Part II</a></p><p>“It was you!” I told the man who had just saved my life. “I mean, you were the one who took out the ghazis who were planning to hit GGinParis!”</p><p>Cernovich had gotten word from his extensive global network of the ghazis’ arrival in the 12 Arrondissement, and we’d taken the four-man security team I’d hired with us to neutralize them the night before the meetup, but someone had gotten to them first. And that someone was standing right in front of me.</p><p>The little Japanese man shrugged and continued cleaning the blood off his wakizashi, then slipped it into a cunningly concealed back-scabbard that was all but undetectable under his Color Run t-shirt. He looked about as innocuous as a runner could look, if that runner wasn’t standing over the dead bodies of two corporate ninjas-for-hire.</p><p>“Let us just say you have an angel looking over you, Mr. Day. Certain parties do not deem it in their interest that you be removed from the Great Game at this time.” He looked around the forest, then seemed to spot what he was looking for and bent over to retrieve it. It was the kukri I’d dropped, and he handed it to me. “Don’t ask me who. Like these two rent-a-shadows, I am but a humble laborer working for his rice bowl.”</p><p>“A day-laborer, one might say.” Hey, give me a break. I’d just barely survived a twin combat ninja assault, and not through any fault of my own.</p><p>“No, I take contracts by the job,” he said. “Forget what they tell you. They just trying to throw you off. It wasn’t Scalzi. It was Rambo.”</p><p>“Sylvester Stallone?” I said in disbelief. I knew Sly held a grudge about Jennifer, but that was a long time ago, before they were even dating, let alone married. “Come on, he’s been over that for decades.”</p><p>“No, not the Rocky man. Rambo! Cat Rambo, the Iron Lady of SFWA.”</p><p>“Oh,” I said. “Seriously? I always thought she was saner than the rest of those lunatics.”</p><p>“She stone cold killer. Have the balls that Scalzi and Gould never did. You big threat, they scared you kill Tor, they lose lots of money. No more book contracts, no more dues.”</p><p>“If she’s worried about Tor going under, then she should put out a contract on Scalzi, not me. Or whatever idiot at Barnes &amp; Noble is trying to turn their bookstores into restaurants.”</p><p>“Not my problem. But good thing she hire these Singapore rent-boys. Cheap, no-good fake shinobis. No respect for tradition. Now come, we must finish the course. I don’t think there is more, but I cannot be sure. We must run together now, and you must run fast!”</p><p>“Wait, I don’t even know your name!”</p><p>“Call me Tokei. Tokei Buredo.”</p><p>The Blade that Watches? I tended to doubt his mother named him that, but it certainly seemed fitting to me.  I bowed to him from the waist. “Domo arigato gozaimasu, Tokei-san.”</p><p>He bowed back, rather less deeply. “Do itashimashita, Day-san.” He clapped his hands. “Now, let us run!”</p><p>“Shouldn’t we bury the bodies or something?”</p><p>“No time! The police will be looking at anyone who take long time to run once they discover the bodies. We must run quickly, for good alibi!”</p><p>My heart sank at the prospect of running even faster than before. But before we got going, we went to the lake, where I managed to wash most of the dead ninja’s blood off my arms and face. There was nothing to do about the bloodstains on my shirt, but Tokei-san pointed out that we would soon be at the red station, and no one would think anything of a few red stains after that. Fortunately, the paper with the number on it had taken most of the splatter, so I simply unpinned it and threw it in the trash.</p><p>Tokei-san set a pace considerably faster than I would have liked, which meant that were were only being passed by severely overweight men and women who were strolling along the course arm-in-arm, talking with each other. I tried to maintain a wary eye, but soon found myself focusing on simply breathing, putting one foot in front of the other, and trying not to collapse. I figured Tokei-san would alert me to any threats that presented themselves.</p><p>We managed to make it to the red station without incident, although we did have one nervous moment when a policeman guiding the runners the correct way at a junction seemed to eye the incongruous colors on my shirt a little too closely. But I waved cheerfully to him and he responded to me a thumbs up, so we avoided that potential pitfall.</p><p>“Can’t we slow down?” I begged Tokei-san, but he was having none of it. He began a rather detailed monologue under his breath, and while I couldn’t quite make all of it out, it was fairly clear that most of it was devoted to my various shortcomings of character, genetics, willpower, and general level of fitness. Among others.</p><p>After we reached the final color station and were liberally splashed with purple powder, I was on the verge of collapse.</p><p>“You go on,” I told him. “Leave me here. I’m only holding you back!”</p><p>“You think this is a war movie or something?” Tokei-san spat contemptuously, then reached into his pocket. “Oh well, I didn’t want this, but….”</p><p>His hand moved swiftly to my neck, and I felt a sting.</p><p>“Ouch!” What the Hell was that?” Then, a sudden energy seemed to fill me and I was suffused with an amazing sense of strength and well-being. All the pain and exhaustion vanished, and I felt ready, willing, and able to wrestle a tiger. No, make that two tigers. Two big, angry, Siberian tigers on steroids.</p><p>“Old ninja trick. Made from extract of fugu. You feel better now. If you lucky, heart don’t explode.” As I looked at him in disbelief and clutched at my chest, he shrugged. “Where you think idea of power-ups came from in first place, video game boy? Now Ctrl-Alt-run!”</p><p><a href=\"https://2.bp.blogspot.com/-TllTKDJwwY4/V-pDArzedmI/AAAAAAAACJQ/siav4Zmeb_gVuCvIT4nFMpAqR0SQwEmwwCLcB/s1600/VD_finish.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"280\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/09/VD_finish.jpg\" width=\"320\"/></a>I tried to feel if my heart was pounding particularly hard or was about to explode, but if it was, I couldn’t tell. Well, whatever. I was feeling too good to worry about it now.</p><p>“Let’s finish this bitch!” I roared, and took off sprinting towards the end of the course.</p><p>“Not so fast, fool gaijin!” he shouted, but I was too amped to pay any attention. We ran the last kilometer in record time, zooming past sweating, panting, exhausted runners as if we were on the Autobahn. Tokei-san was breathing hard, but I felt as if I’d just come off the curve of the 200 and shifted into 6th gear to pass up the sprinters in the outer lanes. We rounded the last turn, and when I spotted the colorful arched banners that marked the finish line, I actually managed to pick up the pace. A loud cheer went up as the spectators at the end saw us sprinting to a strong finish. I threw my arms up in triumph as I crossed the line, with Tokei-san right behind me.</p><p>Spacebunny was there, along with the rest of our group, all clapping and cheering and dancing to the pounding techno music that was booming out of the huge amplifiers that had been set up nearby. She had gotten her tutu back, and came running up to me with a look of relief on her face, which was quickly replaced by concern when she saw my shirt.</p><p>“That’s not powder, that’s blood!” she declared. “Are you hurt?”</p><p>“It’s not mine.” I kissed her cheerfully, but then the adrenaline boost or whatever it was begin to fade, and I swayed. All the pains and aches of the brutal 5 kilometer run, which I suppose was actually more like 3.5 kilometers due to the shortcut, but whatever, seemed to hit my body at once. I took that as a good sign that my heart wasn’t going to explode, although I did wonder if perhaps a little lay-down and a few hours of massage and aromatherapy would be in order. “They had me, but Tokei-san took them out.”</p><p>“Who?” she said, looking around in bewilderment.</p><p>“The little Japanese guy, with the glasses and the headband.” I looked back and forth. Tokei-san was nowhere to be found. “He was right there with me a second ago! He ran the whole last half of the course with me! He gave me this injection of pufferfish power-up, and I tell you, it was like crack mixed with Ventolin and Dianabol!”</p><p>“Honey, I saw you. You crossed the finish line alone,” she said, worry lines creasing her forehead. “Are you sure you’re feeling all right?”</p><p>“I’m fine,” I assured her. And I was. I placed my hands together and made a little bow. I had a feeling that “Tokei Buredo”, The Blade that Watches, was watching over us from somewhere from the shadows of the nearby trees. But had my mysterious benefactor really been sent by a powerful corporate “angel” as he’d claimed, or was he, himself, an angel of some kind? And was it just my fugu-addled mind or had he inadvertently given me a clue as to who was actually paying for his services?</p><p>I decided that it was a mystery that demanded future contemplation, as I certainly wasn’t going to find any answers today. For the time being, I accepted my participation medal with well-merited pride, then joined Spacebunny and the others dancing in celebration behind the finish line. True story. After all, have you not seen the pictures to prove it?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://scontent-frt3-1.xx.fbcdn.net/t31.0-8/s960x960/14324535_10209831441318313_7253555134167265698_o.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"https://scontent-frt3-1.xx.fbcdn.net/t31.0-8/s960x960/14324535_10209831441318313_7253555134167265698_o.jpg\" width=\"253\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://scontent-frt3-1.xx.fbcdn.net/t31.0-8/s960x960/14324535_10209831441318313_7253555134167265698_o.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20253%20320%22%3E%3C/svg%3E\" width=\"253\"/></a></div><p><i><br/></i><br> <i><br/></i><br> <i>Thanks very much to all of you who donated so generously to the King’s College research. Your collective donation to the Color Run is one of the seven largest the anti-Crohn’s program has ever received. The second component of the vaccine is presently being manufactured and will soon be in quality control checks. Human trials will begin in December, and the researchers should have some idea of whether the cure is safe or not by August next year, and whether or not it is effective by August 2018.</i><br> <i><br/></i><br> <i>Crohn’s is a brutal and ugly disease. It is less fatal than many diseases which quite rightly receive more attention from the medical community, but it is dangerous, difficult, and demoralizing. I have the utmost respect for those who suffer from it, because it is a battle they have to fight every single day. And I really appreciate what all of you have done to help them fight it, because it gives them strength by helping them understand that they are not alone in their struggle against this insidious opponent.</i><br> <i><br/></i><br> <i>And more importantly, you have contributed towards bringing their everyday battle to a victorious and healthy end. Spacebunny and I will not forget that.</i></br></br></br></br></br></br></p></div>",
  "content_text": "Part I\n|\nPart II\n“It was you!” I told the man who had just saved my life. “I mean, you were the one who took out the ghazis who were planning to hit GGinParis!”\nCernovich had gotten word from his extensive global network of the ghazis’ arrival in the 12 Arrondissement, and we’d taken the four-man security team I’d hired with us to neutralize them the night before the meetup, but someone had gotten to them first. And that someone was standing right in front of me.\nThe little Japanese man shrugged and continued cleaning the blood off his wakizashi, then slipped it into a cunningly concealed back-scabbard that was all but undetectable under his Color Run t-shirt. He looked about as innocuous as a runner could look, if that runner wasn’t standing over the dead bodies of two corporate ninjas-for-hire.\n“Let us just say you have an angel looking over you, Mr. Day. Certain parties do not deem it in their interest that you be removed from the Great Game at this time.” He looked around the forest, then seemed to spot what he was looking for and bent over to retrieve it. It was the kukri I’d dropped, and he handed it to me. “Don’t ask me who. Like these two rent-a-shadows, I am but a humble laborer working for his rice bowl.”\n“A day-laborer, one might say.” Hey, give me a break. I’d just barely survived a twin combat ninja assault, and not through any fault of my own.\n“No, I take contracts by the job,” he said. “Forget what they tell you. They just trying to throw you off. It wasn’t Scalzi. It was Rambo.”\n“Sylvester Stallone?” I said in disbelief. I knew Sly held a grudge about Jennifer, but that was a long time ago, before they were even dating, let alone married. “Come on, he’s been over that for decades.”\n“No, not the Rocky man. Rambo! Cat Rambo, the Iron Lady of SFWA.”\n“Oh,” I said. “Seriously? I always thought she was saner than the rest of those lunatics.”\n“She stone cold killer. Have the balls that Scalzi and Gould never did. You big threat, they scared you kill Tor, they lose lots of money. No more book contracts, no more dues.”\n“If she’s worried about Tor going under, then she should put out a contract on Scalzi, not me. Or whatever idiot at Barnes & Noble is trying to turn their bookstores into restaurants.”\n“Not my problem. But good thing she hire these Singapore rent-boys. Cheap, no-good fake shinobis. No respect for tradition. Now come, we must finish the course. I don’t think there is more, but I cannot be sure. We must run together now, and you must run fast!”\n“Wait, I don’t even know your name!”\n“Call me Tokei. Tokei Buredo.”\nThe Blade that Watches? I tended to doubt his mother named him that, but it certainly seemed fitting to me.  I bowed to him from the waist. “Domo arigato gozaimasu, Tokei-san.”\nHe bowed back, rather less deeply. “Do itashimashita, Day-san.” He clapped his hands. “Now, let us run!”\n“Shouldn’t we bury the bodies or something?”\n“No time! The police will be looking at anyone who take long time to run once they discover the bodies. We must run quickly, for good alibi!”\nMy heart sank at the prospect of running even faster than before. But before we got going, we went to the lake, where I managed to wash most of the dead ninja’s blood off my arms and face. There was nothing to do about the bloodstains on my shirt, but Tokei-san pointed out that we would soon be at the red station, and no one would think anything of a few red stains after that. Fortunately, the paper with the number on it had taken most of the splatter, so I simply unpinned it and threw it in the trash.\nTokei-san set a pace considerably faster than I would have liked, which meant that were were only being passed by severely overweight men and women who were strolling along the course arm-in-arm, talking with each other. I tried to maintain a wary eye, but soon found myself focusing on simply breathing, putting one foot in front of the other, and trying not to collapse. I figured Tokei-san would alert me to any threats that presented themselves.\nWe managed to make it to the red station without incident, although we did have one nervous moment when a policeman guiding the runners the correct way at a junction seemed to eye the incongruous colors on my shirt a little too closely. But I waved cheerfully to him and he responded to me a thumbs up, so we avoided that potential pitfall.\n“Can’t we slow down?” I begged Tokei-san, but he was having none of it. He began a rather detailed monologue under his breath, and while I couldn’t quite make all of it out, it was fairly clear that most of it was devoted to my various shortcomings of character, genetics, willpower, and general level of fitness. Among others.\nAfter we reached the final color station and were liberally splashed with purple powder, I was on the verge of collapse.\n“You go on,” I told him. “Leave me here. I’m only holding you back!”\n“You think this is a war movie or something?” Tokei-san spat contemptuously, then reached into his pocket. “Oh well, I didn’t want this, but….”\nHis hand moved swiftly to my neck, and I felt a sting.\n“Ouch!” What the Hell was that?” Then, a sudden energy seemed to fill me and I was suffused with an amazing sense of strength and well-being. All the pain and exhaustion vanished, and I felt ready, willing, and able to wrestle a tiger. No, make that two tigers. Two big, angry, Siberian tigers on steroids.\n“Old ninja trick. Made from extract of fugu. You feel better now. If you lucky, heart don’t explode.” As I looked at him in disbelief and clutched at my chest, he shrugged. “Where you think idea of power-ups came from in first place, video game boy? Now Ctrl-Alt-run!”\nI tried to feel if my heart was pounding particularly hard or was about to explode, but if it was, I couldn’t tell. Well, whatever. I was feeling too good to worry about it now.\n“Let’s finish this bitch!” I roared, and took off sprinting towards the end of the course.\n“Not so fast, fool gaijin!” he shouted, but I was too amped to pay any attention. We ran the last kilometer in record time, zooming past sweating, panting, exhausted runners as if we were on the Autobahn. Tokei-san was breathing hard, but I felt as if I’d just come off the curve of the 200 and shifted into 6th gear to pass up the sprinters in the outer lanes. We rounded the last turn, and when I spotted the colorful arched banners that marked the finish line, I actually managed to pick up the pace. A loud cheer went up as the spectators at the end saw us sprinting to a strong finish. I threw my arms up in triumph as I crossed the line, with Tokei-san right behind me.\nSpacebunny was there, along with the rest of our group, all clapping and cheering and dancing to the pounding techno music that was booming out of the huge amplifiers that had been set up nearby. She had gotten her tutu back, and came running up to me with a look of relief on her face, which was quickly replaced by concern when she saw my shirt.\n“That’s not powder, that’s blood!” she declared. “Are you hurt?”\n“It’s not mine.” I kissed her cheerfully, but then the adrenaline boost or whatever it was begin to fade, and I swayed. All the pains and aches of the brutal 5 kilometer run, which I suppose was actually more like 3.5 kilometers due to the shortcut, but whatever, seemed to hit my body at once. I took that as a good sign that my heart wasn’t going to explode, although I did wonder if perhaps a little lay-down and a few hours of massage and aromatherapy would be in order. “They had me, but Tokei-san took them out.”\n“Who?” she said, looking around in bewilderment.\n“The little Japanese guy, with the glasses and the headband.” I looked back and forth. Tokei-san was nowhere to be found. “He was right there with me a second ago! He ran the whole last half of the course with me! He gave me this injection of pufferfish power-up, and I tell you, it was like crack mixed with Ventolin and Dianabol!”\n“Honey, I saw you. You crossed the finish line alone,” she said, worry lines creasing her forehead. “Are you sure you’re feeling all right?”\n“I’m fine,” I assured her. And I was. I placed my hands together and made a little bow. I had a feeling that “Tokei Buredo”, The Blade that Watches, was watching over us from somewhere from the shadows of the nearby trees. But had my mysterious benefactor really been sent by a powerful corporate “angel” as he’d claimed, or was he, himself, an angel of some kind? And was it just my fugu-addled mind or had he inadvertently given me a clue as to who was actually paying for his services?\nI decided that it was a mystery that demanded future contemplation, as I certainly wasn’t going to find any answers today. For the time being, I accepted my participation medal with well-merited pride, then joined Spacebunny and the others dancing in celebration behind the finish line. True story. After all, have you not seen the pictures to prove it?\nThanks very much to all of you who donated so generously to the King’s College research. Your collective donation to the Color Run is one of the seven largest the anti-Crohn’s program has ever received. The second component of the vaccine is presently being manufactured and will soon be in quality control checks. Human trials will begin in December, and the researchers should have some idea of whether the cure is safe or not by August next year, and whether or not it is effective by August 2018.\nCrohn’s is a brutal and ugly disease. It is less fatal than many diseases which quite rightly receive more attention from the medical community, but it is dangerous, difficult, and demoralizing. I have the utmost respect for those who suffer from it, because it is a battle they have to fight every single day. And I really appreciate what all of you have done to help them fight it, because it gives them strength by helping them understand that they are not alone in their struggle against this insidious opponent.\nAnd more importantly, you have contributed towards bringing their everyday battle to a victorious and healthy end. Spacebunny and I will not forget that.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-27T11:00:00+00:00"
}