{
  "url": "https://voxday.net/2016/09/26/the-color-run-story-of-courage_26/",
  "scraped_at": "2025-12-18T01:56:17.644151",
  "title": "The Color Run: a story of courage, endurance, and ninjas, part II",
  "date_display": "September 26, 2016",
  "date_iso": "2016-09-26T10:32:00+00:00",
  "date_from_url": "2016-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing I failed to make clear in <a href=\"http://www.milobookclub.com/2016/09/25/the-color-run-story-of-courage/\">the first part of my story</a> about surviving the Color Run is that there were over 10,000 people taking part in it. Not only that, but the start was staggered, so that a constant flow of runners were going through the course. That’s why, when I made my way back onto the trail after taking out the spotter for the Singapore hit team, I was immediately caught up in a torrent of runners, their white shirts stained blue from the first color station, who were running considerably faster than I had been previously running myself.</p><p>I joined them, but I hadn’t run far when I saw a flash of pink and yellow that was, incongruously, moving <i>against </i>the blue-and-white flow of runners. It was Spacebunny, easy to spot in her bikini-and-tutu lack of attire, and she had come back for me after my failure to arrive at the next color station in a timely manner.</p><p><a href=\"https://4.bp.blogspot.com/-fEz4V2LEVqw/V-j24S7c2_I/AAAAAAAACJA/fdBGcXJqaxgSm5WahJteZLj4n4PYI8XegCLcB/s1600/SB_unicorn.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"150\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/09/SB_unicorn.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2016/09/SB_unicorn.jpg\" decoding=\"async\" height=\"150\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20150%22%3E%3C/svg%3E\" width=\"200\"/></a>“What happened?” she exclaimed as we met up and stepped off to the side of the trail. “Even <i>you </i>can’t possibly take that long to run two kilometers. I got worried, and when none of the security unicorns I hired said they’d seen you, I ran back to find you.”</p><p>“Spotter,” I gasped, being badly out of breath after having run at least another 80 meters. “Singapore!”</p><p>“Ah,” she said, understanding instantly. “You’re saying there is a two-man team of corporate assault ninjas from that security company that operates behind the false front of a wealth management division of Deutsche Bank in Singapore, the one that Big Dan used to work for, somewhere on the course up ahead! I assume you took out the spotter. Is that what delayed you?”</p><p>I nodded and wished I’d remembered to bring my inhaler, as she’d recommended the night before. I also found myself wondering what the hourly rate for a team of security unicorns might be and how much hiring one was going to cost me. To tell you the truth, I wasn’t impressed with their performance thus far.</p><p>“Any idea where they are?”</p><p>“Yellow!” I said, plucking at my shirt.</p><p>“They’re waiting at the yellow station? Probably right after it. That gives me an idea.” Spacebunny put her hands on her tutu-covered hips and frowned. “Okay, so here’s what we’ll do. You’ll cut through the forest while I run the course. I’ll run ahead and find a bald guy, and get him to put on my tutu before he goes through the yellow station. That will distract the hitters, it will take them a few seconds before they realize it isn’t you, and you can take them out then.”</p><p>“Unicorns?”</p><p>“No, they’re paid to keep an eye out for you, not take on corporate assault ninjas. You’ll have to do it yourself.”</p><p>I couldn’t argue with her logic. But, it occurred to me, there was another problem.</p><p>“How are you going to get the guy to put on the tutu?” I had recovered sufficiently to speak in full sentences, if short ones.</p><div></div><p>She stared at me in sympathy a moment, then made a gesture with both hands as if to say “I am a pretty blonde gym bunny wearing a bikini and I could make the average middle-aged guy rip out his testicles and juggle them for me just by smiling and asking pretty please, so I think I can handle this without any trouble, thank you very much.” Then she slipped out of her tutu, causing numerous heads to whip around, and one young man ran directly into a large oak tree.</p><p>“See?” she winked and ran off with her tutu in hand, wearing nothing but her blue bikini. It belatedly occurred to me that I was wearing a tutu at that very moment myself, and at her behest, no less, so any doubts in her ability to convince others to do the same were more than a little ironic, to say nothing of misplaced.</p><p>As per the plan, I cut across the forest to the trail on the far side, thankfully cutting at least 1.5 kilometers off my route. It turned out that this side of the course ran along a lake shore, and I had to decide whether the yellow station was to my left or to my right. A glance at the passing runners revealed that their shirts were stained and spotted with yellow to go with the green and the blue, so I slipped back into the trees and quietly made my way to the right, against the flow of the runners.</p><p>Soon the yellow station came into view, and there, sure enough, were the pair of corporate ninjas, both standing about five meters into the trees in a position giving them an excellent view of the runners coming out of the yellow station, where volunteers in yellow t-shirts were showering everyone with yellow dust that tasted rather like the interior of a snail shell left out in the sun for weeks from which the snail meat had mostly, but not entirely, rotted.</p><p>I waited until I saw the man in the yellow tutu emerging from the clouds of yellow dust and their attention was entirely focused on him, just as Spacebunny intended. I slipped closer, took out a pair of shuriken from my fanny pack, and nailed both of them with two well-practiced flicks of the wrist. As they whirled around, surprise and agony etched upon their faces, I unbuckled my fanny pack, stepped out from behind a tree, and held it up in front of them.</p><p>“I have the antidote in here,” I lied. “Tell me who sent you after me and I’ll give it to you.”</p><p>To my surprise, the ninja on the left laughed. He wasn’t true Japanese, he was Ainu, and his accent in English gave away his Asahikawa origins.</p><p>“Chilean, I think,” he said, as he reached into a pocket and took out a small plastic box, and opened it to reveal 24 styrettes. There were two of each kind, and each pair was marked with a different kanji indicating a poison. “You are too predictable, Day-san. Do you think we did not know about Madrid?”</p><p>He injected himself first, then handed a similarly-labeled styrette to his silent companion, who did the same.  In a matter of seconds, they were no longer showing any signs of being poisoned, and upon recovering, they both drew razor-sharp katanas from the matte-black scabbards they were wearing. I pulled my mini-kukri out of the fanny pack, but I have to admit, I didn’t much like my odds. Both ninjas were wearing stab vests with panels that were probably titanium alloy inserts, plus full tactical combat gear down to the elbow pads, while I was protected by nothing but a white t-shirt and a multi-colored tutu. And I was outnumbered.</p><p>“John Scalzi sends his regards,” the previously silent one said. Then they attacked, moving as one, with all the grim fury of two ronin avenging their fallen master. I managed to avoid the first two strokes, either of which would have cut me in two, and lashed out with a Flowing River strike that should have disemboweled the Asahikawa man, but the blade bounced right off the stab vest’s belly plate with no more effect than rain falling on a stone.</p><p>I whirled around to meet them again, but this time, the quiet one’s do-uchi was a feint, and when I sidestepped the strike that wasn’t there, he adroitly went to the ground, hooked my ankle, and sent me sprawling. My kukri flew from my hand as I fell, leaving me unarmed. The Asahikawa man was on me as quick as a flash; he stood over me with his katana raised, point downward, and I knew that there was nothing I could do to stop him from pinning me to the ground. A single thought flashed through my mind. “Wow, some people are really going to be pissed that I didn’t finish <i>A Sea of Skulls</i> first!”</p><p>Then, without warning, the man’s head flew from his body and blood fountained over me as if we were at the red station. The weight of his armored body nearly took my wind away as it collapsed on top of me. With no little effort, I managed to push the fallen ninja’s corpse off me, and scrambled to my feet in time to see a small, slender, bespectacled Japanese man wearing a runner’s outfit standing over the motionless body of the other ninja with a dripping wakizashi in his hand. He looked familiar, somehow, but I could not for the life of me imagine who he was or where I had seen him before.</p><p>He turned and raised a finger, as if admonishing me. “Never rely upon the same tactic twice, Mr. Day. Particularly not twice in succession. It makes you far too easy to anticipate.”</p><p>Then I realized where it was that I had seen him. Paris. Cernovich. A midnight strike. Four ghazis sprawled lifeless in a cheap hotel room overlooking the Gare du Nord, and a shadow slipping out the window just as we burst in.</p><p>More to come….</p></div>",
  "content_text": "One thing I failed to make clear in\nthe first part of my story\nabout surviving the Color Run is that there were over 10,000 people taking part in it. Not only that, but the start was staggered, so that a constant flow of runners were going through the course. That’s why, when I made my way back onto the trail after taking out the spotter for the Singapore hit team, I was immediately caught up in a torrent of runners, their white shirts stained blue from the first color station, who were running considerably faster than I had been previously running myself.\nI joined them, but I hadn’t run far when I saw a flash of pink and yellow that was, incongruously, moving\nagainst\nthe blue-and-white flow of runners. It was Spacebunny, easy to spot in her bikini-and-tutu lack of attire, and she had come back for me after my failure to arrive at the next color station in a timely manner.\n“What happened?” she exclaimed as we met up and stepped off to the side of the trail. “Even\nyou\ncan’t possibly take that long to run two kilometers. I got worried, and when none of the security unicorns I hired said they’d seen you, I ran back to find you.”\n“Spotter,” I gasped, being badly out of breath after having run at least another 80 meters. “Singapore!”\n“Ah,” she said, understanding instantly. “You’re saying there is a two-man team of corporate assault ninjas from that security company that operates behind the false front of a wealth management division of Deutsche Bank in Singapore, the one that Big Dan used to work for, somewhere on the course up ahead! I assume you took out the spotter. Is that what delayed you?”\nI nodded and wished I’d remembered to bring my inhaler, as she’d recommended the night before. I also found myself wondering what the hourly rate for a team of security unicorns might be and how much hiring one was going to cost me. To tell you the truth, I wasn’t impressed with their performance thus far.\n“Any idea where they are?”\n“Yellow!” I said, plucking at my shirt.\n“They’re waiting at the yellow station? Probably right after it. That gives me an idea.” Spacebunny put her hands on her tutu-covered hips and frowned. “Okay, so here’s what we’ll do. You’ll cut through the forest while I run the course. I’ll run ahead and find a bald guy, and get him to put on my tutu before he goes through the yellow station. That will distract the hitters, it will take them a few seconds before they realize it isn’t you, and you can take them out then.”\n“Unicorns?”\n“No, they’re paid to keep an eye out for you, not take on corporate assault ninjas. You’ll have to do it yourself.”\nI couldn’t argue with her logic. But, it occurred to me, there was another problem.\n“How are you going to get the guy to put on the tutu?” I had recovered sufficiently to speak in full sentences, if short ones.\nShe stared at me in sympathy a moment, then made a gesture with both hands as if to say “I am a pretty blonde gym bunny wearing a bikini and I could make the average middle-aged guy rip out his testicles and juggle them for me just by smiling and asking pretty please, so I think I can handle this without any trouble, thank you very much.” Then she slipped out of her tutu, causing numerous heads to whip around, and one young man ran directly into a large oak tree.\n“See?” she winked and ran off with her tutu in hand, wearing nothing but her blue bikini. It belatedly occurred to me that I was wearing a tutu at that very moment myself, and at her behest, no less, so any doubts in her ability to convince others to do the same were more than a little ironic, to say nothing of misplaced.\nAs per the plan, I cut across the forest to the trail on the far side, thankfully cutting at least 1.5 kilometers off my route. It turned out that this side of the course ran along a lake shore, and I had to decide whether the yellow station was to my left or to my right. A glance at the passing runners revealed that their shirts were stained and spotted with yellow to go with the green and the blue, so I slipped back into the trees and quietly made my way to the right, against the flow of the runners.\nSoon the yellow station came into view, and there, sure enough, were the pair of corporate ninjas, both standing about five meters into the trees in a position giving them an excellent view of the runners coming out of the yellow station, where volunteers in yellow t-shirts were showering everyone with yellow dust that tasted rather like the interior of a snail shell left out in the sun for weeks from which the snail meat had mostly, but not entirely, rotted.\nI waited until I saw the man in the yellow tutu emerging from the clouds of yellow dust and their attention was entirely focused on him, just as Spacebunny intended. I slipped closer, took out a pair of shuriken from my fanny pack, and nailed both of them with two well-practiced flicks of the wrist. As they whirled around, surprise and agony etched upon their faces, I unbuckled my fanny pack, stepped out from behind a tree, and held it up in front of them.\n“I have the antidote in here,” I lied. “Tell me who sent you after me and I’ll give it to you.”\nTo my surprise, the ninja on the left laughed. He wasn’t true Japanese, he was Ainu, and his accent in English gave away his Asahikawa origins.\n“Chilean, I think,” he said, as he reached into a pocket and took out a small plastic box, and opened it to reveal 24 styrettes. There were two of each kind, and each pair was marked with a different kanji indicating a poison. “You are too predictable, Day-san. Do you think we did not know about Madrid?”\nHe injected himself first, then handed a similarly-labeled styrette to his silent companion, who did the same.  In a matter of seconds, they were no longer showing any signs of being poisoned, and upon recovering, they both drew razor-sharp katanas from the matte-black scabbards they were wearing. I pulled my mini-kukri out of the fanny pack, but I have to admit, I didn’t much like my odds. Both ninjas were wearing stab vests with panels that were probably titanium alloy inserts, plus full tactical combat gear down to the elbow pads, while I was protected by nothing but a white t-shirt and a multi-colored tutu. And I was outnumbered.\n“John Scalzi sends his regards,” the previously silent one said. Then they attacked, moving as one, with all the grim fury of two ronin avenging their fallen master. I managed to avoid the first two strokes, either of which would have cut me in two, and lashed out with a Flowing River strike that should have disemboweled the Asahikawa man, but the blade bounced right off the stab vest’s belly plate with no more effect than rain falling on a stone.\nI whirled around to meet them again, but this time, the quiet one’s do-uchi was a feint, and when I sidestepped the strike that wasn’t there, he adroitly went to the ground, hooked my ankle, and sent me sprawling. My kukri flew from my hand as I fell, leaving me unarmed. The Asahikawa man was on me as quick as a flash; he stood over me with his katana raised, point downward, and I knew that there was nothing I could do to stop him from pinning me to the ground. A single thought flashed through my mind. “Wow, some people are really going to be pissed that I didn’t finish\nA Sea of Skulls\nfirst!”\nThen, without warning, the man’s head flew from his body and blood fountained over me as if we were at the red station. The weight of his armored body nearly took my wind away as it collapsed on top of me. With no little effort, I managed to push the fallen ninja’s corpse off me, and scrambled to my feet in time to see a small, slender, bespectacled Japanese man wearing a runner’s outfit standing over the motionless body of the other ninja with a dripping wakizashi in his hand. He looked familiar, somehow, but I could not for the life of me imagine who he was or where I had seen him before.\nHe turned and raised a finger, as if admonishing me. “Never rely upon the same tactic twice, Mr. Day. Particularly not twice in succession. It makes you far too easy to anticipate.”\nThen I realized where it was that I had seen him. Paris. Cernovich. A midnight strike. Four ghazis sprawled lifeless in a cheap hotel room overlooking the Gare du Nord, and a shadow slipping out the window just as we burst in.\nMore to come….",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-26T09:32:00+00:00"
}