{
  "url": "https://voxday.net/2016/09/08/the-libertarian-case-for-free-trade/",
  "scraped_at": "2025-12-18T01:53:15.699426",
  "title": "The Libertarian Case for Free Trade",
  "date_display": "September 8, 2016",
  "date_iso": "2016-09-08T08:20:00+00:00",
  "date_from_url": "2016-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Tom Woods graciously granted me permission to publish the complete transcript of his recent show with Gene Epstein, with whom he discussed the libertarian case for free trade, and in doing so, criticized my case against free trade. If you prefer to listen to Episode 728 of the <a href=\"https://www.google.ch/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwj-8pSoqf_OAhXK0RoKHU0eAtAQFggeMAA&amp;url=http%3A%2F%2Ftomwoods.com%2F&amp;usg=AFQjCNGZEuY8scfs6pHbUIGMInhQNPlsSQ&amp;sig2=9_SxHrijlRZZ_llKRKoebQ\">Tom Woods show</a>, you can do so by clicking on the title. Read the whole thing. I will respond to Mr. Epstein in detail in a future post.</i></p><p><b><a href=\"http://tomwoods.com/podcast/ep-728-can-libertarians-make-a-decent-case-for-free-trade/#disqus_thread\">Episode 728: Can Libertarians Make a Decent Case for Free Trade?</a></b></p><p>Guest: Gene Epstein</p><p>WOODS: All right, let’s get down to business. I want to talk about free trade. You’ve got a great column on the subject that’s linked to at TomWoods.com. So let me start it off this way, because I want to frame the issue the way critics of free trade have been framing it for the past 10 or 20 years in particulars. They’ll say — now, the mercantilists were different, because they didn’t have free traders around whom they could accuse of being academic pointy-heads out of touch with the real world, but anti-free traders today do have that.</p><p>And what they say is, what am I supposed to believe: your theories or my own eyes? The fact is in the wake of free trade I see all these towns that have been decimated because the plant left, and everything’s boarded up, and the white workers all on Oxycontin or whatever, and their families are devastated, and they’ve got social pathologies. This has gone all over middle class America; it’s devastated America, because we can’t possibly compete with people who live in countries with no regulation and where they earn 10 cents an hour. And you pointy-heads keep telling me that some day this is all going to work out, but look, I can see the devastation everywhere. And that matters to me more than your academic theory in a textbook.</p><p>How do you — not that you have to give every single argument right now, but how do you attack that kind of angle on the question?</p><p> EPSTEIN: Well, I think you pose it very well, pose the challenge very well, and I do first want to lead, so to speak, with my chin as a libertarian and say that libertarian principles dictate that we should have the freedom to trade, whether it be with a foreigner or with somebody domestic. Nobody has a right to interfere in our right to trade with whomever we please when we perceive mutual benefit.</p><p>Now, with that said, since we are Austrians we recognize that people have all kinds of values and attitudes when it comes to freedom to trade. It is a fascinating fact that the first 20 years after World War II Jewish people did not buy German cars. I happen to know that firsthand. My father refused to buy a German car, and in fact, by the 1980s he would only buy American-made cars. So if you are concerned, if you are convinced that your right to trade freely is harming other people or is helping people you think are evil, then go ahead and buy American. Exercise your freedom.</p><p>But apart from that, it’s very clear then that we are potentially interested in the consequences of our exercise of freedom, and my article attempted to address that.</p><p>The problem does indeed get back to Bastiat’s statement about the evidence of things unseen. You see some concentrated pain. Some people did lose their jobs, who have to find other jobs, and who, by the way, by and large when people lose their jobs, the next job they get does not pay as well as the job they lost. All of that is quite true.</p><p>However, when you look at our deficits, when you look at it from any standpoint, you begin with the fact that the trade deficit of the US in total is 3% of gross domestic product. Then when you’ve examined all of the estimates about jobs lost to foreign trade — and what I did is I took the highest possible estimate. I then raised it. I then found that it accounts for about 3% of all jobs lost in the domestic economy. So my point then was that if you’re going to be against jobs lost, then you ought to also be against the other 97%. One thing you ought to do, for example, is quit buying on the Internet, because you know what that has done? That has destroyed possibly, probably, millions of jobs in the retail sector, or at least hundreds of thousands of jobs. So if you care about not destroying jobs, then be consistent in your behavior.</p><p>And then, what’s the evidence of things unseen? The people who go to Walmart —mainly, by the way, the lower half of income receivers of the population — are getting bargains because Walmart is basically selling them cheap imported goods. And so if you actually look at the benefits, then the benefits are enormous. However, I’d hasten to say that we Austrians are not utilitarians. There is no way to balance out benefits and costs. I only say approximately we’re talking about the pain to the relative handful of people who lose their jobs, 3% of the population, 3% of job losers; we’re not talking about the other 97%.</p><p>But ultimately at the end of the day it’s a matter of ethics. Do people have a right to think for themselves about how they’re going to spend their money? Do I have a right to buy from Walmart, even though Walmart is selling me products made by Chinese people? I happen to think that’s a good thing to do, because that’s giving very, very poor people better job opportunities than they otherwise would have gotten.</p><p> WOODS: All right, so there’s the problem. I mean, you just stated it. There would be people who would come along and say, I don’t feel like my job in this world is to make Chinese people richer. What matters to me are the people who are closest to me, whom I have the most fraternal affection for. And those people would be people in my family, my neighborhood, and in a series of concentric circles. And the biggest of those circles is the US of A. There is no circle outside of that. I couldn’t care less what happens in Canada, Mexico, anywhere else in the world, China — I don’t care. So I care about the income of American middle class people, and you, Eugene, are saying that we’re going to get cheap goods for them. But if they have no job or if they have a crummy burger-flipping job, the cheap goods are just a wash at best.</p><p> EPSTEIN: Well, the first answer, as a libertarian and as an Austrian, which you and I, Tom, owe these people, is to say that, just like my father would only buy an American car, then I would tell Vox Day, by the way, who debated this issue with Bob Murphy, establish a website, a competitor with Amazon. Call it the Vox Day Buy American Website. And that will steer people into goods that they might want to buy, which would only be made in the USA.</p><p>And I guess it would mean, for example, that you don’t drink coffee anymore, since it’s grown abroad, but perhaps then somebody’s going to respond and grow coffee at many times the cost that it would normally cost, and grow it in a greenhouse. If you want a movement in that direction, do it. It is your perfect right to do so under the principles of libertarianism and under the basic notion of the Austrians, which is that people do not just spend their money in accordance with what is cheap. They have all kinds of other considerations in so doing.</p><p>However, do not interfere with my right to disagree with you and to buy from Chinese people abroad who are desperately poor. Then in terms of consequences, please understand that by probably through your actions, you are costing many, many more jobs lost across the economy. Then also recognize that by opposing companies like Walmart, you are denying people of limited means the opportunity to buy cheap goods.</p><p>But at the end of the day, utilitarianism cannot resolve this matter. The only thing that can resolve this matter is your right to exercise your free choice. I can only lay out the options for you and tell you that that is not the way I exercise my right to free choice because of the reasons that I outlined; however, if you think you can persuade people to have values in this regard — certainly Donald Trump seems to have caught an impulse among people to be super patriotic. Certainly Vox Day made it very clear that he is a nationalist. That’s his value? Fine. I would only tell him he’s not a libertarian. And he has the right, however, to push his nationalism as far as he can possibly persuade people to go along with it.</p><p> WOODS: I have some questions that aren’t just devil’s advocate questions, that are more “let’s elaborate on the argument,” but there’s one more I want to throw at you, and here it is: I’ve heard the argument that the replacement jobs that people get when they get displaced from their current employment because of free trade — and you point out that the number there is actually quite small. But let’s say, all right, they get displace from their jobs. The jobs that they get after that are all low income; they’re burger flipping-type jobs, or the jobs are so high tech that a high school graduate can’t do them. And so this led Gary North to say, when he was asked what are low skilled people going to do in the future, this robotic future, what are they going to do in this future of free trade, and his answer was, “Less.” Do you have a less grim outlook than that, Gene?</p><p> EPSTEIN: Well, I think I do. I again first want to emphasize something that surprises people, but it actually should be fairly evident in people who read the economic news and track unemployment insurance claims. In the 1950s, a million people a month filed for new unemployment claims. That was in the 1950s before international trade was very large. In fact, the US had an even balance of trade in merchandise trade in the 1950s, and yet a million people filed for new unemployment insurance claims every month. In the recent period, the Bureau of Labor Statistics has been tracking it even more carefully, tracing jobs destroyed to firms that downsize, tracing it to bankruptcies. And they find that it’s been running, again, about a million a month on a yearly basis. By the way, in the short run it’s even bigger, but it’s about a million people a month.</p><p>Now, I took the largest possible estimates — I spurned the estimates that were more careful from peer-reviewed research about jobs lost to foreign trade over the last 15 years, and I took the left-wing Economic Policy Institute’s estimates, and then I raised them by a certain amount. And I found that on an annual basis, the number of people who lost their jobs to foreign trade was the approximate equivalent, a little bit larger, than one week’s worth of new unemployment insurance claims. However, if it’s concentrated I guess people are more aware of it. If it’s concentrated in a particular community.</p><p>So my point then was what about the other 97%. What kind of hypocrisy is it on the part of people who will ship their income expenditures, who abandon the deli on the corner because they don’t like the sandwiches or who will buy from Amazon and not go to the local bricks and mortar store and destroy jobs, and yet they think they’re so concerned about those people who lose jobs to foreigners.</p><p>Now in particular, to get to your question about what people do when they lose their jobs, there is a great deal — the research, by the way, is very, very misty about this. People just talk in broad brush strokes about where people go who actually want to seek opportunities to do something else. But if we’re talking about a million people a month who lose their jobs — by the way, in the late 1990s it was actually 1.3, 1.4 million against a smaller base, and yet jobs creation was enormous. We find that when the economy is even more dynamic, more people lose their jobs and more people go on to other jobs.</p><p>In terms of the research about what happens to people who lose their jobs, the one thing that we can indeed be sure of is the same thing that happened to me when I lost my job from the New York Stock Exchange, is that I started at Barron’s at a lower salary. And indeed, anybody who loses — by and large, people who lose their jobs start at lower salaries. But the burger-flipping image that is invoked probably does not capture the reality about someone who really does search for a job. If you search for a job, you can apply for Uber, you can do that 50 hours a week. There is in fact — there are plenty of jobs out there, plenty available. Again, the image of a sort of bipolar economy in which there are no decent jobs — no decent jobs in construction, no decent jobs in driving cars, in driving trucks — all of that is way exaggerated.</p><p>And so indeed, people suffer, but again, if you’re concerned about people suffering, why don’t you stop consuming from Amazon, because you should be concerned about the 97% of the job losers who lose their jobs for reasons other than foreign trade. You should bear in mind again that the trade deficit is 3% of GDP, and indeed on top of that you should bear in mind that foreign trade creates jobs through all kinds of channels. The US, by the way, because of globalization, has an enormous surplus in services trade. Now of course, that tends to be high-end, but actually a huge part of services trade is tourism. People do come to the US, and tourism by and large is employment of people of limited means. There’s low-level employment. There are jobs available.</p><p>Now of course when you mentioned robots, Tom, that opens up a whole new question about what’s going to happen. The main thing I would have to tell people who are so concerned about robotics is that for all practical purposes, wants are infinite. You know, 110, 130 years ago if I were to tell you that the 60 to 70 to 80% of the people who are on the farm is going to shrink to 1% 120 years from now, I guess those who are concerned about that robotic replacement of labor would also be predicting mass unemployment. The fact of the matter that if wants are for all practical purposes infinite, then if we allow the market to operate there will be plenty of jobs for all, although there may indeed be, instead of a two-day weekend, a three-day weekend.</p><p>Maybe that will happen as well, which is of course also part of the evolution of work over the last 100, 120 years. People worked 50 to 60 hours a week, and now they work 40, 41 hours a week. So that happens too. There’s a labor-leisure tradeoff. But the idea that robotics are something new strikes me as a historical. Robots have been replacing labor to one degree or another for many, many years.</p><p>Let me throw in the Milton Friedman anecdote about his observation of an Egyptian project in which the workers were using hand shovels, and he said why are they using hand shovels rather than steam shovels, and the bureaucrat in charge said, well, this is not just a program for greater infrastructure; it’s a job-producing program. And of course Friedman’s quip was, well, then they shouldn’t be using shovels; they should be using spoons if you want to produce more jobs from this project. The economy is not in the business of producing jobs. There should be in a decently functioning economy plenty of jobs for all, and there should indeed be in a decently functioning entrepreneurial economy plenty of opportunity for people who lose their jobs to do a midcourse correction and start another kind of employment.</p><p>But at the end of the day, if it’s all about people in distress who have to be helped, then that’s another discussion for libertarians to have. There will indeed be in any economy people who through no fault of their own have had bad luck and have had difficulty, and I of course believe that there’s plenty of private money available to help those people. But that too is a different discussion.</p><p> WOODS: All right, I’ve got a few more things I want to ask you, but first let’s thank our sponsor. Okay, there are a few things I still want to get to here.</p><p> EPSTEIN: Okay.</p><p> WOODS: One of them is the point you make in the article about the way cheap imports actually contribute to other jobs.</p><p> EPSTEIN: Yeah.</p><p> WOODS: So if my industry needs inexpensive steel to survive, and you’re telling me that the way to increase jobs is to put a tariff on steel, you’re actually going to decrease jobs in my industry. So talk about that.</p><p> EPSTEIN: That’s right, absolutely, and that’s one of the channels through which free trade actually helps jobs. You know, why not talk to — if you are so self-righteous about causing people to lose their jobs, then demanding tariffs, like you speak, again, to those people who don’t realize that they are suffering from tariffs, as in the case you cited. Business by and large — by the way, free trade from China and from abroad is not consumer goods; it’s by and large intermediate inputs that business buys. And those cheap inputs of course make it cheaper for the business to operate and make it possible for that business to employ more people.</p><p>The other part about globalization and the rise of mass communication is indeed the huge surplus in services, the fact that tourism is booming. The other third channel through which free trade creates jobs is that foreigners who get dollars from having sold us goods have a surplus of dollars, and they make huge investments in businesses in the US. There’s an enormous belt of auto companies in the South that are run by foreigners: Japan, others, they operate in the US.</p><p>And by and large, by the way, manufacturing in the domestic market makes good business sense. It’s a very old story. You want the finished product to be in the domestic market, because you want your manufacturing center to be very sensitive to the domestic market for the cars you want to sell.</p><p>So in fact, manufacturing output in the US is nearly almost at its record high, which was reached in 2007. Again, that’s manufacturing output is nearly at the record high of 2007, much of it owned by foreigners, who are using dollars that they get to invest in the US. So in fact, the 3% estimate that I did for the jobs lost was strictly on the debit side. Nobody has bothered to do any decent audit of jobs created. This indeed is difficult research to do, but we know that 3% is probably exaggerated.</p><p>But again, at the end of the day it comes back to ethics, because I can’t — I’ll tell you an interesting analogy in my view. Those who push for the minimum wage, raising the minimum wage, many of them admit that you’ll destroy some jobs. Then they say, well, you know, you’ll destroy — maybe 2% or 3% of low-wage workers will get dumped on the ash heap, but what about that other 97% that will see raises? And it’s very odd that that’s okay with them. That 3% who’s going to be dumped on the ash heap, by the way, are usually the most marginal and unskilled people. But their utilitarian calculus says, well, if it’s going to raise it by several bucks for the other 97%, then why not?</p><p>And so that’s what they say in that case, but when we say from the other case, in terms of utilitarianism, look at all the millions of people who are benefitting as consumers, who go to Walmart, who buy cheap goods, the workers who benefit as workers when cheap goods are bought. Look at all those people, and they are far more numerous than the relative handful of people who lose their jobs. Those people say, oh, no, no, that’s unfair. Suddenly they’re defending the minority in that case, rather than — and we’re defending the majority when we make a utilitarian argument in terms of free trade. And our roles are reversed when we talk about minimum wage.</p><p>But at the end of the day, the only way to resolve this argument is that, in terms of the minimum wage, that’s the free transaction between business and labor. That’s what you’re interfering in. Similarly in terms of free trade, that’s my freedom, your freedom, to spend our money for perceived gain with anybody else as we see fit. That includes business, and it includes individuals.</p><p>And that’s where, by the way — if I may segue for the moment into what Vox Day was saying — he made it very clear when he said, for example — and I jotted down some of the things he said when he was debating Bob Murphy about free trade. He says, I don’t trust government, but I trust corporations even less. He said, I’m a nationalist, not a globalist. He said — now, what does that mean in terms of not trusting government but trusting corporations even less?</p><p>Well, he seemed to be overlooking the reality that these corporations, unless they engage in crony capitalism, are essentially businesses that are trying to sell us goods. And I don’t have to buy their goods. I can just say no, and I can buy domestic if I want to. Or if I don’t buy domestic, I can simply refuse to buy from them. I should tell Vox Day, you try to refuse to buy from the government, refuse to pay your taxes. You’re going to be thrown in jail. And so he was making a very clear choice. He was choosing government over the free market by trusting corporations even less.</p><p>And then when he said he’s a nationalist not a globalist, what does “globalism” mean? Globalism simple means in terms of the free market, my right to buy from companies that import from China. That’s all. Or from any other country. I don’t have to exercise that right. I can refuse to do so. But a nationalist is somebody who declares the right of a nation state, of politicians to dictate to us about what we want to buy. And so again, he was making a very clear ethical choice. His utilitarian arguments I believe were often shoddy in any case, and Bob I think had him dead to rights on certain points, but essentially he was saying I am not a libertarian; I’m a nationalist. I believe that politicians should be in charge, because even though I don’t trust them, I trust corporations even less. That was his point.</p><p>And then when he even further said that some people are smart but other people are not so smart, that’s why we have government, for all its faults, I mean, the way to make people dumb of course is for dumb politicians to dictate to them what their choices should be. And this of course was where Adam Smith came in sounding like Bastiat, when Adam Smith wrote, and I quote, from my column quoting Adam Smith, that the power to interfere with free international trade would “nowhere be so dangerous as in the hands of a man with folly and presumption enough to fancy himself fit to exercise it.”</p><p>I believe that Vox, again, is investing in these politicians the believe that their folly, their idea that they are smart and so many people are dumb, and therefore they have the right to decide what these people will buy with their money, I think that’s presumption. The idea that they know what they want to buy is a question, but the idea that they have the right to interfere with other people’s right to buy because in Vox’s view they aren’t so smart, he’s clearly drawing a line in the sand.</p><p>He is clearly saying for all its faults we’ve got to trust the politicians, because again, ignoring, I mean, Bastiat, who said a long time ago that if people are basically incompetent, how does it follow that when you turn them into regulators and political bureaucrats they suddenly become smart and have a right to rule over the rest of us. Isn’t it possible that these politicians are going to become corrupt? But in any case, in any case, our fundamental belief is in the right of anybody, whether he passes an IQ test with Vox Day or not, to be able to exercise his or her right to engage in trade in however he sees fit.</p><p> WOODS: All right, before I let you go — I mean, this has been great; it’s great information. I feel guilty asking you another question, but I am going to ask you one more. What about people who say — I don’t want to mention any names — the people who say it’s important for us to make things in this country? We don’t make anything anymore, and you can’t have an economy based entirely on services. We need to make things. We need manufacturing.</p><p>And my thought has always been, well, you’re telling me a doctor doesn’t do anything worthwhile? I mean, a lot of people who don’t produce tangible things do add an awful lot of value to this. But what’s your answer to that, that we need to make stuff?</p><p> EPSTEIN: Well, I mean, of course that’s a great question. You hear that all the time. It’s sort of a faith-based statement. But of course first empirically — and it’s really, as I mentioned, not surprising for reasons I stated — that manufacturing is slightly below its all-time peak hit in 2007. So manufacturing hasn’t grown as fast as other things, but just for starters let’s get to reality and recognize that manufacturing does operate, and by and large it’s because manufacturers know that at least for the high end of finishing goods, finishing cars, they want their manufacturing outlet to be close to the domestic market. So we do make things.</p><p>But second, “making things”? Does a chef not make food? We have restaurants. They’re in effect taking raw materials and turning it into finished products. That’s restaurants, and that’s very ubiquitous. They make many things as well. And then in fact “making things,” is not agriculture making something as well? Well, that’s growing stuff, taking it out of the ground, preparing it, later on milling it into bread. All of those things are making things also.</p><p>But of course when we insist on the fact that empirically they’re a little bit off when they say we don’t make things because farming, manufacturing, preparing food, all of that is very, very ubiquitous in this economy and consists of making things, you know, if you want to make things as you’re indicating, Tom, then I guess we just don’t need physicians to operate on us. We don’t need teachers. We don’t need Tom Woods either, I guess, and we don’t need me, because we don’t make things.</p><p>But indeed, at the end of the day, since we provide services that people want to buy, like haircuts — that doesn’t make things, although it sort of makes a better head — it’s all rather theological in any case. At the end of the day, what we want to do is respond to the market economy, allow people to exercise their right to buy what they need to buy. And it might turn out they want to buy services from people that are relatively intangible. They may want to get a massage; they may want to get a pedicure. All of those things they choose to buy because they value those services.</p><p>So at the end of the day, again, it gets down to a libertarian ethic, which is that if nobody wanted to buy any of these services, that would be fine with me, because I don’t run other people’s lives. But since people do want to buy these services and they want to buy some goods —</p><p>And indeed what’s the other broad point that’s taken place in the world? What’s taken place in the world is that we have these economies like China, like in India, that are suffering because of the enormous, horrible legacy of different forms of socialism that kept these people poor. And so we now have open trade with rich countries in the world and very, very poor people, whose alternatives for employment are very, very sketchy, very, very low paid. And so they can make goods, and they can better themselves by selling and exporting these goods to the rest of us. We have advancements in container shipping that make it possible to ship these goods. It’s basically a positive development for the world that these poor people in China are getting better employment, are lifting themselves out of $1 and $2 a day poverty to sell us these goods and to make things for the rest of us.</p><p>And then we in the rich countries, this rich, enormous country, can find plenty of job opportunities for those people who no longer make the same things that the cheap labor Chinese people make. And then again, if we remember that we still have a turbulent entrepreneurial economy in which jobs are destroyed every month to the tune of a million a month, then we recognize that we cannot do without our dynamic economy. We should make the most of it. And that’s marching in a very different direction from what the anti-free trade people, where they want us to march.</p><p> WOODS: All right, well, we’ll leave the conversation there. I’m going to link to your excellent column, again, at TomWoods.com. I’ve got to keep a closer eye on your columns, because every one of them seems to have an episode in it. I don’t know if I can — you know we’ll have to pick the bes ones so I don’t drive you crazy, but I’m glad we were able to do this.</p><p> EPSTEIN: Tom, it’s always a pleasure, and let’s do it again soon.</p></div>",
  "content_text": "Tom Woods graciously granted me permission to publish the complete transcript of his recent show with Gene Epstein, with whom he discussed the libertarian case for free trade, and in doing so, criticized my case against free trade. If you prefer to listen to Episode 728 of the\nTom Woods show\n, you can do so by clicking on the title. Read the whole thing. I will respond to Mr. Epstein in detail in a future post.\nEpisode 728: Can Libertarians Make a Decent Case for Free Trade?\nGuest: Gene Epstein\nWOODS: All right, let’s get down to business. I want to talk about free trade. You’ve got a great column on the subject that’s linked to at TomWoods.com. So let me start it off this way, because I want to frame the issue the way critics of free trade have been framing it for the past 10 or 20 years in particulars. They’ll say — now, the mercantilists were different, because they didn’t have free traders around whom they could accuse of being academic pointy-heads out of touch with the real world, but anti-free traders today do have that.\nAnd what they say is, what am I supposed to believe: your theories or my own eyes? The fact is in the wake of free trade I see all these towns that have been decimated because the plant left, and everything’s boarded up, and the white workers all on Oxycontin or whatever, and their families are devastated, and they’ve got social pathologies. This has gone all over middle class America; it’s devastated America, because we can’t possibly compete with people who live in countries with no regulation and where they earn 10 cents an hour. And you pointy-heads keep telling me that some day this is all going to work out, but look, I can see the devastation everywhere. And that matters to me more than your academic theory in a textbook.\nHow do you — not that you have to give every single argument right now, but how do you attack that kind of angle on the question?\nEPSTEIN: Well, I think you pose it very well, pose the challenge very well, and I do first want to lead, so to speak, with my chin as a libertarian and say that libertarian principles dictate that we should have the freedom to trade, whether it be with a foreigner or with somebody domestic. Nobody has a right to interfere in our right to trade with whomever we please when we perceive mutual benefit.\nNow, with that said, since we are Austrians we recognize that people have all kinds of values and attitudes when it comes to freedom to trade. It is a fascinating fact that the first 20 years after World War II Jewish people did not buy German cars. I happen to know that firsthand. My father refused to buy a German car, and in fact, by the 1980s he would only buy American-made cars. So if you are concerned, if you are convinced that your right to trade freely is harming other people or is helping people you think are evil, then go ahead and buy American. Exercise your freedom.\nBut apart from that, it’s very clear then that we are potentially interested in the consequences of our exercise of freedom, and my article attempted to address that.\nThe problem does indeed get back to Bastiat’s statement about the evidence of things unseen. You see some concentrated pain. Some people did lose their jobs, who have to find other jobs, and who, by the way, by and large when people lose their jobs, the next job they get does not pay as well as the job they lost. All of that is quite true.\nHowever, when you look at our deficits, when you look at it from any standpoint, you begin with the fact that the trade deficit of the US in total is 3% of gross domestic product. Then when you’ve examined all of the estimates about jobs lost to foreign trade — and what I did is I took the highest possible estimate. I then raised it. I then found that it accounts for about 3% of all jobs lost in the domestic economy. So my point then was that if you’re going to be against jobs lost, then you ought to also be against the other 97%. One thing you ought to do, for example, is quit buying on the Internet, because you know what that has done? That has destroyed possibly, probably, millions of jobs in the retail sector, or at least hundreds of thousands of jobs. So if you care about not destroying jobs, then be consistent in your behavior.\nAnd then, what’s the evidence of things unseen? The people who go to Walmart —mainly, by the way, the lower half of income receivers of the population — are getting bargains because Walmart is basically selling them cheap imported goods. And so if you actually look at the benefits, then the benefits are enormous. However, I’d hasten to say that we Austrians are not utilitarians. There is no way to balance out benefits and costs. I only say approximately we’re talking about the pain to the relative handful of people who lose their jobs, 3% of the population, 3% of job losers; we’re not talking about the other 97%.\nBut ultimately at the end of the day it’s a matter of ethics. Do people have a right to think for themselves about how they’re going to spend their money? Do I have a right to buy from Walmart, even though Walmart is selling me products made by Chinese people? I happen to think that’s a good thing to do, because that’s giving very, very poor people better job opportunities than they otherwise would have gotten.\nWOODS: All right, so there’s the problem. I mean, you just stated it. There would be people who would come along and say, I don’t feel like my job in this world is to make Chinese people richer. What matters to me are the people who are closest to me, whom I have the most fraternal affection for. And those people would be people in my family, my neighborhood, and in a series of concentric circles. And the biggest of those circles is the US of A. There is no circle outside of that. I couldn’t care less what happens in Canada, Mexico, anywhere else in the world, China — I don’t care. So I care about the income of American middle class people, and you, Eugene, are saying that we’re going to get cheap goods for them. But if they have no job or if they have a crummy burger-flipping job, the cheap goods are just a wash at best.\nEPSTEIN: Well, the first answer, as a libertarian and as an Austrian, which you and I, Tom, owe these people, is to say that, just like my father would only buy an American car, then I would tell Vox Day, by the way, who debated this issue with Bob Murphy, establish a website, a competitor with Amazon. Call it the Vox Day Buy American Website. And that will steer people into goods that they might want to buy, which would only be made in the USA.\nAnd I guess it would mean, for example, that you don’t drink coffee anymore, since it’s grown abroad, but perhaps then somebody’s going to respond and grow coffee at many times the cost that it would normally cost, and grow it in a greenhouse. If you want a movement in that direction, do it. It is your perfect right to do so under the principles of libertarianism and under the basic notion of the Austrians, which is that people do not just spend their money in accordance with what is cheap. They have all kinds of other considerations in so doing.\nHowever, do not interfere with my right to disagree with you and to buy from Chinese people abroad who are desperately poor. Then in terms of consequences, please understand that by probably through your actions, you are costing many, many more jobs lost across the economy. Then also recognize that by opposing companies like Walmart, you are denying people of limited means the opportunity to buy cheap goods.\nBut at the end of the day, utilitarianism cannot resolve this matter. The only thing that can resolve this matter is your right to exercise your free choice. I can only lay out the options for you and tell you that that is not the way I exercise my right to free choice because of the reasons that I outlined; however, if you think you can persuade people to have values in this regard — certainly Donald Trump seems to have caught an impulse among people to be super patriotic. Certainly Vox Day made it very clear that he is a nationalist. That’s his value? Fine. I would only tell him he’s not a libertarian. And he has the right, however, to push his nationalism as far as he can possibly persuade people to go along with it.\nWOODS: I have some questions that aren’t just devil’s advocate questions, that are more “let’s elaborate on the argument,” but there’s one more I want to throw at you, and here it is: I’ve heard the argument that the replacement jobs that people get when they get displaced from their current employment because of free trade — and you point out that the number there is actually quite small. But let’s say, all right, they get displace from their jobs. The jobs that they get after that are all low income; they’re burger flipping-type jobs, or the jobs are so high tech that a high school graduate can’t do them. And so this led Gary North to say, when he was asked what are low skilled people going to do in the future, this robotic future, what are they going to do in this future of free trade, and his answer was, “Less.” Do you have a less grim outlook than that, Gene?\nEPSTEIN: Well, I think I do. I again first want to emphasize something that surprises people, but it actually should be fairly evident in people who read the economic news and track unemployment insurance claims. In the 1950s, a million people a month filed for new unemployment claims. That was in the 1950s before international trade was very large. In fact, the US had an even balance of trade in merchandise trade in the 1950s, and yet a million people filed for new unemployment insurance claims every month. In the recent period, the Bureau of Labor Statistics has been tracking it even more carefully, tracing jobs destroyed to firms that downsize, tracing it to bankruptcies. And they find that it’s been running, again, about a million a month on a yearly basis. By the way, in the short run it’s even bigger, but it’s about a million people a month.\nNow, I took the largest possible estimates — I spurned the estimates that were more careful from peer-reviewed research about jobs lost to foreign trade over the last 15 years, and I took the left-wing Economic Policy Institute’s estimates, and then I raised them by a certain amount. And I found that on an annual basis, the number of people who lost their jobs to foreign trade was the approximate equivalent, a little bit larger, than one week’s worth of new unemployment insurance claims. However, if it’s concentrated I guess people are more aware of it. If it’s concentrated in a particular community.\nSo my point then was what about the other 97%. What kind of hypocrisy is it on the part of people who will ship their income expenditures, who abandon the deli on the corner because they don’t like the sandwiches or who will buy from Amazon and not go to the local bricks and mortar store and destroy jobs, and yet they think they’re so concerned about those people who lose jobs to foreigners.\nNow in particular, to get to your question about what people do when they lose their jobs, there is a great deal — the research, by the way, is very, very misty about this. People just talk in broad brush strokes about where people go who actually want to seek opportunities to do something else. But if we’re talking about a million people a month who lose their jobs — by the way, in the late 1990s it was actually 1.3, 1.4 million against a smaller base, and yet jobs creation was enormous. We find that when the economy is even more dynamic, more people lose their jobs and more people go on to other jobs.\nIn terms of the research about what happens to people who lose their jobs, the one thing that we can indeed be sure of is the same thing that happened to me when I lost my job from the New York Stock Exchange, is that I started at Barron’s at a lower salary. And indeed, anybody who loses — by and large, people who lose their jobs start at lower salaries. But the burger-flipping image that is invoked probably does not capture the reality about someone who really does search for a job. If you search for a job, you can apply for Uber, you can do that 50 hours a week. There is in fact — there are plenty of jobs out there, plenty available. Again, the image of a sort of bipolar economy in which there are no decent jobs — no decent jobs in construction, no decent jobs in driving cars, in driving trucks — all of that is way exaggerated.\nAnd so indeed, people suffer, but again, if you’re concerned about people suffering, why don’t you stop consuming from Amazon, because you should be concerned about the 97% of the job losers who lose their jobs for reasons other than foreign trade. You should bear in mind again that the trade deficit is 3% of GDP, and indeed on top of that you should bear in mind that foreign trade creates jobs through all kinds of channels. The US, by the way, because of globalization, has an enormous surplus in services trade. Now of course, that tends to be high-end, but actually a huge part of services trade is tourism. People do come to the US, and tourism by and large is employment of people of limited means. There’s low-level employment. There are jobs available.\nNow of course when you mentioned robots, Tom, that opens up a whole new question about what’s going to happen. The main thing I would have to tell people who are so concerned about robotics is that for all practical purposes, wants are infinite. You know, 110, 130 years ago if I were to tell you that the 60 to 70 to 80% of the people who are on the farm is going to shrink to 1% 120 years from now, I guess those who are concerned about that robotic replacement of labor would also be predicting mass unemployment. The fact of the matter that if wants are for all practical purposes infinite, then if we allow the market to operate there will be plenty of jobs for all, although there may indeed be, instead of a two-day weekend, a three-day weekend.\nMaybe that will happen as well, which is of course also part of the evolution of work over the last 100, 120 years. People worked 50 to 60 hours a week, and now they work 40, 41 hours a week. So that happens too. There’s a labor-leisure tradeoff. But the idea that robotics are something new strikes me as a historical. Robots have been replacing labor to one degree or another for many, many years.\nLet me throw in the Milton Friedman anecdote about his observation of an Egyptian project in which the workers were using hand shovels, and he said why are they using hand shovels rather than steam shovels, and the bureaucrat in charge said, well, this is not just a program for greater infrastructure; it’s a job-producing program. And of course Friedman’s quip was, well, then they shouldn’t be using shovels; they should be using spoons if you want to produce more jobs from this project. The economy is not in the business of producing jobs. There should be in a decently functioning economy plenty of jobs for all, and there should indeed be in a decently functioning entrepreneurial economy plenty of opportunity for people who lose their jobs to do a midcourse correction and start another kind of employment.\nBut at the end of the day, if it’s all about people in distress who have to be helped, then that’s another discussion for libertarians to have. There will indeed be in any economy people who through no fault of their own have had bad luck and have had difficulty, and I of course believe that there’s plenty of private money available to help those people. But that too is a different discussion.\nWOODS: All right, I’ve got a few more things I want to ask you, but first let’s thank our sponsor. Okay, there are a few things I still want to get to here.\nEPSTEIN: Okay.\nWOODS: One of them is the point you make in the article about the way cheap imports actually contribute to other jobs.\nEPSTEIN: Yeah.\nWOODS: So if my industry needs inexpensive steel to survive, and you’re telling me that the way to increase jobs is to put a tariff on steel, you’re actually going to decrease jobs in my industry. So talk about that.\nEPSTEIN: That’s right, absolutely, and that’s one of the channels through which free trade actually helps jobs. You know, why not talk to — if you are so self-righteous about causing people to lose their jobs, then demanding tariffs, like you speak, again, to those people who don’t realize that they are suffering from tariffs, as in the case you cited. Business by and large — by the way, free trade from China and from abroad is not consumer goods; it’s by and large intermediate inputs that business buys. And those cheap inputs of course make it cheaper for the business to operate and make it possible for that business to employ more people.\nThe other part about globalization and the rise of mass communication is indeed the huge surplus in services, the fact that tourism is booming. The other third channel through which free trade creates jobs is that foreigners who get dollars from having sold us goods have a surplus of dollars, and they make huge investments in businesses in the US. There’s an enormous belt of auto companies in the South that are run by foreigners: Japan, others, they operate in the US.\nAnd by and large, by the way, manufacturing in the domestic market makes good business sense. It’s a very old story. You want the finished product to be in the domestic market, because you want your manufacturing center to be very sensitive to the domestic market for the cars you want to sell.\nSo in fact, manufacturing output in the US is nearly almost at its record high, which was reached in 2007. Again, that’s manufacturing output is nearly at the record high of 2007, much of it owned by foreigners, who are using dollars that they get to invest in the US. So in fact, the 3% estimate that I did for the jobs lost was strictly on the debit side. Nobody has bothered to do any decent audit of jobs created. This indeed is difficult research to do, but we know that 3% is probably exaggerated.\nBut again, at the end of the day it comes back to ethics, because I can’t — I’ll tell you an interesting analogy in my view. Those who push for the minimum wage, raising the minimum wage, many of them admit that you’ll destroy some jobs. Then they say, well, you know, you’ll destroy — maybe 2% or 3% of low-wage workers will get dumped on the ash heap, but what about that other 97% that will see raises? And it’s very odd that that’s okay with them. That 3% who’s going to be dumped on the ash heap, by the way, are usually the most marginal and unskilled people. But their utilitarian calculus says, well, if it’s going to raise it by several bucks for the other 97%, then why not?\nAnd so that’s what they say in that case, but when we say from the other case, in terms of utilitarianism, look at all the millions of people who are benefitting as consumers, who go to Walmart, who buy cheap goods, the workers who benefit as workers when cheap goods are bought. Look at all those people, and they are far more numerous than the relative handful of people who lose their jobs. Those people say, oh, no, no, that’s unfair. Suddenly they’re defending the minority in that case, rather than — and we’re defending the majority when we make a utilitarian argument in terms of free trade. And our roles are reversed when we talk about minimum wage.\nBut at the end of the day, the only way to resolve this argument is that, in terms of the minimum wage, that’s the free transaction between business and labor. That’s what you’re interfering in. Similarly in terms of free trade, that’s my freedom, your freedom, to spend our money for perceived gain with anybody else as we see fit. That includes business, and it includes individuals.\nAnd that’s where, by the way — if I may segue for the moment into what Vox Day was saying — he made it very clear when he said, for example — and I jotted down some of the things he said when he was debating Bob Murphy about free trade. He says, I don’t trust government, but I trust corporations even less. He said, I’m a nationalist, not a globalist. He said — now, what does that mean in terms of not trusting government but trusting corporations even less?\nWell, he seemed to be overlooking the reality that these corporations, unless they engage in crony capitalism, are essentially businesses that are trying to sell us goods. And I don’t have to buy their goods. I can just say no, and I can buy domestic if I want to. Or if I don’t buy domestic, I can simply refuse to buy from them. I should tell Vox Day, you try to refuse to buy from the government, refuse to pay your taxes. You’re going to be thrown in jail. And so he was making a very clear choice. He was choosing government over the free market by trusting corporations even less.\nAnd then when he said he’s a nationalist not a globalist, what does “globalism” mean? Globalism simple means in terms of the free market, my right to buy from companies that import from China. That’s all. Or from any other country. I don’t have to exercise that right. I can refuse to do so. But a nationalist is somebody who declares the right of a nation state, of politicians to dictate to us about what we want to buy. And so again, he was making a very clear ethical choice. His utilitarian arguments I believe were often shoddy in any case, and Bob I think had him dead to rights on certain points, but essentially he was saying I am not a libertarian; I’m a nationalist. I believe that politicians should be in charge, because even though I don’t trust them, I trust corporations even less. That was his point.\nAnd then when he even further said that some people are smart but other people are not so smart, that’s why we have government, for all its faults, I mean, the way to make people dumb of course is for dumb politicians to dictate to them what their choices should be. And this of course was where Adam Smith came in sounding like Bastiat, when Adam Smith wrote, and I quote, from my column quoting Adam Smith, that the power to interfere with free international trade would “nowhere be so dangerous as in the hands of a man with folly and presumption enough to fancy himself fit to exercise it.”\nI believe that Vox, again, is investing in these politicians the believe that their folly, their idea that they are smart and so many people are dumb, and therefore they have the right to decide what these people will buy with their money, I think that’s presumption. The idea that they know what they want to buy is a question, but the idea that they have the right to interfere with other people’s right to buy because in Vox’s view they aren’t so smart, he’s clearly drawing a line in the sand.\nHe is clearly saying for all its faults we’ve got to trust the politicians, because again, ignoring, I mean, Bastiat, who said a long time ago that if people are basically incompetent, how does it follow that when you turn them into regulators and political bureaucrats they suddenly become smart and have a right to rule over the rest of us. Isn’t it possible that these politicians are going to become corrupt? But in any case, in any case, our fundamental belief is in the right of anybody, whether he passes an IQ test with Vox Day or not, to be able to exercise his or her right to engage in trade in however he sees fit.\nWOODS: All right, before I let you go — I mean, this has been great; it’s great information. I feel guilty asking you another question, but I am going to ask you one more. What about people who say — I don’t want to mention any names — the people who say it’s important for us to make things in this country? We don’t make anything anymore, and you can’t have an economy based entirely on services. We need to make things. We need manufacturing.\nAnd my thought has always been, well, you’re telling me a doctor doesn’t do anything worthwhile? I mean, a lot of people who don’t produce tangible things do add an awful lot of value to this. But what’s your answer to that, that we need to make stuff?\nEPSTEIN: Well, I mean, of course that’s a great question. You hear that all the time. It’s sort of a faith-based statement. But of course first empirically — and it’s really, as I mentioned, not surprising for reasons I stated — that manufacturing is slightly below its all-time peak hit in 2007. So manufacturing hasn’t grown as fast as other things, but just for starters let’s get to reality and recognize that manufacturing does operate, and by and large it’s because manufacturers know that at least for the high end of finishing goods, finishing cars, they want their manufacturing outlet to be close to the domestic market. So we do make things.\nBut second, “making things”? Does a chef not make food? We have restaurants. They’re in effect taking raw materials and turning it into finished products. That’s restaurants, and that’s very ubiquitous. They make many things as well. And then in fact “making things,” is not agriculture making something as well? Well, that’s growing stuff, taking it out of the ground, preparing it, later on milling it into bread. All of those things are making things also.\nBut of course when we insist on the fact that empirically they’re a little bit off when they say we don’t make things because farming, manufacturing, preparing food, all of that is very, very ubiquitous in this economy and consists of making things, you know, if you want to make things as you’re indicating, Tom, then I guess we just don’t need physicians to operate on us. We don’t need teachers. We don’t need Tom Woods either, I guess, and we don’t need me, because we don’t make things.\nBut indeed, at the end of the day, since we provide services that people want to buy, like haircuts — that doesn’t make things, although it sort of makes a better head — it’s all rather theological in any case. At the end of the day, what we want to do is respond to the market economy, allow people to exercise their right to buy what they need to buy. And it might turn out they want to buy services from people that are relatively intangible. They may want to get a massage; they may want to get a pedicure. All of those things they choose to buy because they value those services.\nSo at the end of the day, again, it gets down to a libertarian ethic, which is that if nobody wanted to buy any of these services, that would be fine with me, because I don’t run other people’s lives. But since people do want to buy these services and they want to buy some goods —\nAnd indeed what’s the other broad point that’s taken place in the world? What’s taken place in the world is that we have these economies like China, like in India, that are suffering because of the enormous, horrible legacy of different forms of socialism that kept these people poor. And so we now have open trade with rich countries in the world and very, very poor people, whose alternatives for employment are very, very sketchy, very, very low paid. And so they can make goods, and they can better themselves by selling and exporting these goods to the rest of us. We have advancements in container shipping that make it possible to ship these goods. It’s basically a positive development for the world that these poor people in China are getting better employment, are lifting themselves out of $1 and $2 a day poverty to sell us these goods and to make things for the rest of us.\nAnd then we in the rich countries, this rich, enormous country, can find plenty of job opportunities for those people who no longer make the same things that the cheap labor Chinese people make. And then again, if we remember that we still have a turbulent entrepreneurial economy in which jobs are destroyed every month to the tune of a million a month, then we recognize that we cannot do without our dynamic economy. We should make the most of it. And that’s marching in a very different direction from what the anti-free trade people, where they want us to march.\nWOODS: All right, well, we’ll leave the conversation there. I’m going to link to your excellent column, again, at TomWoods.com. I’ve got to keep a closer eye on your columns, because every one of them seems to have an episode in it. I don’t know if I can — you know we’ll have to pick the bes ones so I don’t drive you crazy, but I’m glad we were able to do this.\nEPSTEIN: Tom, it’s always a pleasure, and let’s do it again soon.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-08T07:20:00+00:00"
}