{
  "url": "https://voxday.net/2016/09/25/which-cernovich-book-should-you-read/",
  "scraped_at": "2025-12-18T01:56:12.110309",
  "title": "Which Cernovich book should you read first?",
  "date_display": "September 25, 2016",
  "date_iso": "2016-09-25T15:00:00+00:00",
  "date_from_url": "2016-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Cernovich considers the question: which book should you read first? <i><a href=\"http://amzn.to/2dreTI5\">Gorilla Mindset</a></i> or <i><a href=\"http://amzn.to/2cTxbm6\">Danger &amp; Play</a></i>?</p><blockquote><p> A lot of people ask me whether they should read <i>Gorilla Mindset</i> or <i>Danger &amp; Pla</i>y: Mike Cernovich’s Guide to Life first. It’s a complicated question, so here’s the short answer:<br/></p><ul><li>If you are over 18 and enjoy edgier content, read <i>Danger &amp; Play</i> first.</li><li>If you’re under 18 or want a more accessible, helpful version of me, then read <i>Gorilla Mindset</i> first.</li></ul><p>Every man, woman, and child can benefit from <i>Gorilla Mindset</i>. <i>Danger  Play</i> is for dominant adult men and the women who want to understand their mindset.<i> Gorilla Mindset</i> is my general interest book.</p><p>Women read <i>Gorilla Mindset</i>. Aggressive alpha men read <i>Gorilla Mindset</i>. Teenagers read it. You could bring <i>Gorilla Mindset</i> to church. There’s zero politics in it. You wouldn’t know which political candidate I support.</p><p><i>Danger &amp; Play</i> is my edgier, aggressive book.</p><p>Long-time blog readers prefer <i>Danger &amp; Play</i> to <i>Gorilla Mindset</i>. That doesn’t mean one book is better than the other. As Vox Day observed in his review of <i>Danger &amp; Play</i>:<br> <i><br/></i><br> <i>It’s not a book you would necessarily want to give to a young man under the age of 18. The saltiness and worldliness of the book is not inappropriate, nor is it particularly offensive by modern standards, but it does tend to preclude giving it to teenagers or putting it in your local school library. I didn’t hesitate to have my son read Gorilla Mindset, I would probably wait until he was 18 or 19 to have him read Danger &amp; Play: Essays on Embracing Masculinity.</i></br></br></p><p>That’s a fair criticism, and indeed <i>Danger &amp; Play</i> is a niche book.</p></blockquote><p>Actually, it’s not criticism at all. It’s just aimed at a different, more specific, and older market. I would recommend starting with <i><a href=\"http://amzn.to/2dreTI5\">Gorilla Mindset</a></i> because it is less personal and more practical. It’s advice for <i>your </i>life. <i><a href=\"http://amzn.to/2cTxbm6\">Danger &amp; Play</a></i>, on the other hand, helps you better understand the author of <i>Gorilla Mindset</i>, how he originally derived and developed its lessons, and how he has applied them in <i>his </i>life. In other words, the latter provides a deeper understanding of the former, therefore the former should be read first.</p></div>",
  "content_text": "Mike Cernovich considers the question: which book should you read first?\nGorilla Mindset\nor\nDanger & Play\n?\nA lot of people ask me whether they should read\nGorilla Mindset\nor\nDanger & Pla\ny: Mike Cernovich’s Guide to Life first. It’s a complicated question, so here’s the short answer:\nIf you are over 18 and enjoy edgier content, read\nDanger & Play\nfirst.\nIf you’re under 18 or want a more accessible, helpful version of me, then read\nGorilla Mindset\nfirst.\nEvery man, woman, and child can benefit from\nGorilla Mindset\n.\nDanger  Play\nis for dominant adult men and the women who want to understand their mindset.\nGorilla Mindset\nis my general interest book.\nWomen read\nGorilla Mindset\n. Aggressive alpha men read\nGorilla Mindset\n. Teenagers read it. You could bring\nGorilla Mindset\nto church. There’s zero politics in it. You wouldn’t know which political candidate I support.\nDanger & Play\nis my edgier, aggressive book.\nLong-time blog readers prefer\nDanger & Play\nto\nGorilla Mindset\n. That doesn’t mean one book is better than the other. As Vox Day observed in his review of\nDanger & Play\n:\nIt’s not a book you would necessarily want to give to a young man under the age of 18. The saltiness and worldliness of the book is not inappropriate, nor is it particularly offensive by modern standards, but it does tend to preclude giving it to teenagers or putting it in your local school library. I didn’t hesitate to have my son read Gorilla Mindset, I would probably wait until he was 18 or 19 to have him read Danger & Play: Essays on Embracing Masculinity.\nThat’s a fair criticism, and indeed\nDanger & Play\nis a niche book.\nActually, it’s not criticism at all. It’s just aimed at a different, more specific, and older market. I would recommend starting with\nGorilla Mindset\nbecause it is less personal and more practical. It’s advice for\nyour\nlife.\nDanger & Play\n, on the other hand, helps you better understand the author of\nGorilla Mindset\n, how he originally derived and developed its lessons, and how he has applied them in\nhis\nlife. In other words, the latter provides a deeper understanding of the former, therefore the former should be read first.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-25T14:00:00+00:00"
}