{
  "url": "https://voxday.net/2016/09/28/why-he-was-wrong-about-christianity/",
  "scraped_at": "2025-12-18T01:56:36.065441",
  "title": "Why he was wrong about Christianity",
  "date_display": "September 28, 2016",
  "date_iso": "2016-09-28T00:23:00+00:00",
  "date_from_url": "2016-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I am familiar with the concept expressed by Sam Huntington’s civilizational paradigm and have actually read the famous essay in <i>Foreign Affairs</i> called “The Clash of Civilizations”, I am a little embarrassed to say that I made the typical college mistake of assuming that knowledge <i>about </i>the concept was an adequate substitute for detailed knowledge <i>of </i>the concept. Which is to say that I’d never read the book that is the expansion of the esssay, which mistake I am presently correcting now.</p><p>It’s a brilliant, brilliant book that goes well beyond the refutation of Fukuyama’s silly “History is Over and We’re All Liberal Democrats Now” paradigm and already it has me thinking about how the civilizational paradigm affects the reality of the Alt-Right. And it occurs to me that one of the keys to the success of the Alt-West is going to be a) Christians realizing that Churchianity is not Christianity and driving it out of their institutions and places of worship combined with b) non-Christians realizing that Christianity is, far from being a societal negative, a societal <i>necessity </i>for any Western civilization.</p><p>Tom Howard’s journey away from Christianity into antiquity, <a href=\"http://www.newstatesman.com/politics/religion/2016/09/tom-holland-why-i-was-wrong-about-christianity\">then back again</a>, is one that I expect will be repeated by many an apostate, agnostic, and even atheist.</p><blockquote><p> When I was a boy, my upbringing as a Christian was forever being weathered by the gale force of my enthusiasms. First, there were dinosaurs. I vividly remember my shock when, at Sunday school one day, I opened a children’s Bible and found an illustration on its first page of Adam and Eve with a brachiosaur. Six years old I may have been, but of one thing – to my regret – I was rock-solid certain: no human being had ever seen a sauropod. That the teacher seemed not to care about this error only compounded my sense of outrage and bewilderment. A faint shadow of doubt, for the first time, had been brought to darken my Christian faith.</p><p>With time, it darkened further still. My obsession with dinosaurs – glamorous, ­ferocious, extinct – evolved seamlessly into an obsession with ancient empires. When I read the Bible, the focus of my fascination was less the children of Israel or Jesus and his disciples than their adversaries: the Egyptians, the Assyrians, the Romans. In a similar manner, although I vaguely continued to believe in God, I found Him infinitely less charismatic than my favourite Olympians: Apollo, Athena, Dionysus. Rather than lay down laws and condemn other deities as demons, they preferred to enjoy themselves. And if they were vain, selfish and cruel, that only served to endow them with the allure of rock stars.</p><p>By the time I came to read Edward Gibbon and the other great writers of the Enlightenment, I was more than ready to accept their interpretation of history: that the triumph of Christianity had ushered in an “age of superstition and credulity”, and that modernity was founded on the dusting down of long-forgotten classical values. My childhood instinct to think of the biblical God as the po-faced enemy of liberty and fun was rationalised. The defeat of paganism had ushered in the reign of Nobodaddy, and of all the crusaders, inquisitors and black-hatted puritans who had served as his acolytes. Colour and excitement had been drained from the world. “Thou hast conquered, O pale Galilean,” Swinburne wrote, echoing the apocryphal lament of Julian the Apostate, the last pagan emperor of Rome. “The world has grown grey from thy breath.” Instinctively, I agreed.</p><p>So, perhaps it was no surprise that I should have continued to cherish classical antiquity as the period that most stirred and inspired me. When I came to write my first work of history, Rubicon, I chose a subject that had been particularly close to the hearts of the philosophes: the age of Cicero. The theme of my second, Persian Fire, was one that even in the 21st century was serving Hollywood, as it had served Montaigne and Byron, as an archetype of the triumph of liberty over despotism: the Persian invasions of Greece.</p><p>The years I spent writing these studies of the classical world – living intimately in the company of Leonidas and of Julius Caesar, of the hoplites who had died at Thermopylae and of the legionaries who had triumphed at Alesia – only confirmed me in my fascination: for Sparta and Rome, even when subjected to the minutest historical inquiry, did not cease to seem possessed of the qualities of an apex predator. They continued to stalk my imaginings as they had always done – like a tyrannosaur.</p><p>Yet giant carnivores, however wondrous, are by their nature terrifying. The longer I spent immersed in the study of classical antiquity, the more alien and unsettling I came to find it. The values of Leonidas, whose people had practised a peculiarly murderous form of eugenics, and trained their young to kill uppity Untermenschen by night, were nothing that I recognised as my own; nor were those of Caesar, who was reported to have killed a million Gauls and enslaved a million more. It was not just the extremes of callousness that I came to find shocking, but the lack of a sense that the poor or the weak might have any intrinsic value. As such, the founding conviction of the Enlightenment – that it owed nothing to the faith into which most of its greatest figures had been born – increasingly came to seem to me unsustainable.</p></blockquote><p>What Howard learned is something I pointed out in a controverial WND column called “<a href=\"http://www.wnd.com/2005/12/33737/\">The Morality of Rape</a>“, in which I noted that the very idea that rape is wrong, let alone a crime against the state, is an intrinsically Christian concept. The inescapable conclusion is that one simply cannot separate religion from culture, much less from civilization; indeed, Huntington observes that the strongest identifying element of the eight competing major civilizations is, in fact, religion.</p><blockquote class=\"tr_bq\"><p> Blood, language, religion, way of life, were what the Greeks had in common and what distinguished them from the Persians and other non-Greeks. Of all the objective elements which define civilizations, however, the most important usually is religion, as the Athenians emphasized. To a very large degree, the major civilizations in human history have been closely identified with the world’s great religions; and people who share ethnicity and language but differ in religion may slaughter each other, as happened in Lebanon, the former Yugoslavia, and the Subcontinent.</p></blockquote></div>",
  "content_text": "Although I am familiar with the concept expressed by Sam Huntington’s civilizational paradigm and have actually read the famous essay in\nForeign Affairs\ncalled “The Clash of Civilizations”, I am a little embarrassed to say that I made the typical college mistake of assuming that knowledge\nabout\nthe concept was an adequate substitute for detailed knowledge\nof\nthe concept. Which is to say that I’d never read the book that is the expansion of the esssay, which mistake I am presently correcting now.\nIt’s a brilliant, brilliant book that goes well beyond the refutation of Fukuyama’s silly “History is Over and We’re All Liberal Democrats Now” paradigm and already it has me thinking about how the civilizational paradigm affects the reality of the Alt-Right. And it occurs to me that one of the keys to the success of the Alt-West is going to be a) Christians realizing that Churchianity is not Christianity and driving it out of their institutions and places of worship combined with b) non-Christians realizing that Christianity is, far from being a societal negative, a societal\nnecessity\nfor any Western civilization.\nTom Howard’s journey away from Christianity into antiquity,\nthen back again\n, is one that I expect will be repeated by many an apostate, agnostic, and even atheist.\nWhen I was a boy, my upbringing as a Christian was forever being weathered by the gale force of my enthusiasms. First, there were dinosaurs. I vividly remember my shock when, at Sunday school one day, I opened a children’s Bible and found an illustration on its first page of Adam and Eve with a brachiosaur. Six years old I may have been, but of one thing – to my regret – I was rock-solid certain: no human being had ever seen a sauropod. That the teacher seemed not to care about this error only compounded my sense of outrage and bewilderment. A faint shadow of doubt, for the first time, had been brought to darken my Christian faith.\nWith time, it darkened further still. My obsession with dinosaurs – glamorous, ­ferocious, extinct – evolved seamlessly into an obsession with ancient empires. When I read the Bible, the focus of my fascination was less the children of Israel or Jesus and his disciples than their adversaries: the Egyptians, the Assyrians, the Romans. In a similar manner, although I vaguely continued to believe in God, I found Him infinitely less charismatic than my favourite Olympians: Apollo, Athena, Dionysus. Rather than lay down laws and condemn other deities as demons, they preferred to enjoy themselves. And if they were vain, selfish and cruel, that only served to endow them with the allure of rock stars.\nBy the time I came to read Edward Gibbon and the other great writers of the Enlightenment, I was more than ready to accept their interpretation of history: that the triumph of Christianity had ushered in an “age of superstition and credulity”, and that modernity was founded on the dusting down of long-forgotten classical values. My childhood instinct to think of the biblical God as the po-faced enemy of liberty and fun was rationalised. The defeat of paganism had ushered in the reign of Nobodaddy, and of all the crusaders, inquisitors and black-hatted puritans who had served as his acolytes. Colour and excitement had been drained from the world. “Thou hast conquered, O pale Galilean,” Swinburne wrote, echoing the apocryphal lament of Julian the Apostate, the last pagan emperor of Rome. “The world has grown grey from thy breath.” Instinctively, I agreed.\nSo, perhaps it was no surprise that I should have continued to cherish classical antiquity as the period that most stirred and inspired me. When I came to write my first work of history, Rubicon, I chose a subject that had been particularly close to the hearts of the philosophes: the age of Cicero. The theme of my second, Persian Fire, was one that even in the 21st century was serving Hollywood, as it had served Montaigne and Byron, as an archetype of the triumph of liberty over despotism: the Persian invasions of Greece.\nThe years I spent writing these studies of the classical world – living intimately in the company of Leonidas and of Julius Caesar, of the hoplites who had died at Thermopylae and of the legionaries who had triumphed at Alesia – only confirmed me in my fascination: for Sparta and Rome, even when subjected to the minutest historical inquiry, did not cease to seem possessed of the qualities of an apex predator. They continued to stalk my imaginings as they had always done – like a tyrannosaur.\nYet giant carnivores, however wondrous, are by their nature terrifying. The longer I spent immersed in the study of classical antiquity, the more alien and unsettling I came to find it. The values of Leonidas, whose people had practised a peculiarly murderous form of eugenics, and trained their young to kill uppity Untermenschen by night, were nothing that I recognised as my own; nor were those of Caesar, who was reported to have killed a million Gauls and enslaved a million more. It was not just the extremes of callousness that I came to find shocking, but the lack of a sense that the poor or the weak might have any intrinsic value. As such, the founding conviction of the Enlightenment – that it owed nothing to the faith into which most of its greatest figures had been born – increasingly came to seem to me unsustainable.\nWhat Howard learned is something I pointed out in a controverial WND column called “\nThe Morality of Rape\n“, in which I noted that the very idea that rape is wrong, let alone a crime against the state, is an intrinsically Christian concept. The inescapable conclusion is that one simply cannot separate religion from culture, much less from civilization; indeed, Huntington observes that the strongest identifying element of the eight competing major civilizations is, in fact, religion.\nBlood, language, religion, way of life, were what the Greeks had in common and what distinguished them from the Persians and other non-Greeks. Of all the objective elements which define civilizations, however, the most important usually is religion, as the Athenians emphasized. To a very large degree, the major civilizations in human history have been closely identified with the world’s great religions; and people who share ethnicity and language but differ in religion may slaughter each other, as happened in Lebanon, the former Yugoslavia, and the Subcontinent.",
  "tags": [
    "#AltWest",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-09-27T23:23:00+00:00"
}