{
  "url": "https://voxday.net/2023/10/30/a-review-of-plutarchs-lives/",
  "scraped_at": "2026-01-08T14:13:54.782050",
  "title": "A Review of PLUTARCH’S LIVES",
  "date_display": "October 30, 2023",
  "date_iso": "2023-10-30T11:13:19+00:00",
  "date_from_url": "2023-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Synard <a href=\"https://gab.com/CharlesSynyard/posts/111316021796898597\">reviews the Castalia Library publication</a> of the two-volume behemoth after devoting two years to reading the whole thing.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>After more than two years chipping away at the colossal classic, finished reading <em>Plutarch’s Lives</em>. This was the Castalia Library leatherbound edition, limited to 750, and uses the Bernadotte Perrin translation. Two years may seem like a while for a recommended pair of books, but these tomes total something like 1600 pages, so even turning a page every day, this is how long it will take, so a considerable commitment for all but the fastest readers.</p><p>Many of these biographies are of exciting, admirable statesmen, and so it is no wonder that in centuries past, Plutarch was enjoyed by boys for the battlefield action, good examples to follow, and witticisms. After a few lives of semi-legendary Greek and Roman founders, this is almost all drum-and-trumpet history, and more often than not, the subject meets a violent death! Even the rhetoricians who make it in end up little more than propagandists for some power-hungry faction. Clearly, the <em>Lives </em>as a whole are much too long for practical use in instruction; it would be challenging to fit them into a single academic year, and even then there would be gaps. Besides, after a while, the <em>Lives </em>start to blend together, and it can feel like you‘re reading about a compsoite or averaged Greco-Roman marching his troops around, swapping wives, and saying amusing things, so the most distinctive <em>Lives </em>should be set apart, as the student will have a better chance of retaining the information. For an advanced placement high school course, or a 100 or 200 level college course, I think these ten select <em>Lives </em>would give students a rich taste of classical history, while more than holding interest and providing fruitful inspiration to greatness in our times:</p><p>—Lycurgus and Numa, wise founding lawgivers<br/>—Alexander and Julius Caesar, unparalleled conquerors<br/>—Agis &amp; Cleomenes and the Gracchi, attempted restorers in a decadent age<br/>—Timoleon and Brutus, supernatural intervention in human affairs?</p><p>In English translation, Plutarch is the canonical writer I have read who most closely follows one of the standards of writing that was most drilled into us in my school days: the thesis statement. Because the Lives are mostly paired, Plutarch usually includes prefatory remarks to explain why the two belong together, and then follows the biographies with a comparison.</p></blockquote><p>Read the rest of it there. This is the sort of book review that I really like to see, because it reviews the book rather than just discussing the reader’s reaction to the book. One thing that many reviewers fail to grasp is that the subject of the review should be the thing reviewed, not the reviewer himself.</p><p>Obviously, many editions that purport to be Plutarch’s <em>Lives </em>are actually an abridgement of them, which is normally abhorrent to us; we’d rather divide a massive tome into two or even three volumes rather than cut it down to a size that will not destroy itself on the bookshelf with the assistance of gravity over time. But, in the event that we ever decide to do a Homeschooling subscription, an abridged version of Plutarch might make sense.</p><p>While the Library edition is now out of stock, there are about 20 copies of <a href=\"https://arkhavencomics.com/product/plutarchv1_libraria/\">the more exclusive, superdeluxe Libraria edition</a> available.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60204\" decoding=\"async\" fetchpriority=\"high\" height=\"652\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-84.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-84.png 512w, https://voxday.net/wp-content/uploads/2023/10/image-84-236x300.png 236w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/3c8c7503-fccd-4077-9f53-28a1cdde8c89\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Charles Synard\nreviews the Castalia Library publication\nof the two-volume behemoth after devoting two years to reading the whole thing.\nAfter more than two years chipping away at the colossal classic, finished reading\nPlutarch’s Lives\n. This was the Castalia Library leatherbound edition, limited to 750, and uses the Bernadotte Perrin translation. Two years may seem like a while for a recommended pair of books, but these tomes total something like 1600 pages, so even turning a page every day, this is how long it will take, so a considerable commitment for all but the fastest readers.\nMany of these biographies are of exciting, admirable statesmen, and so it is no wonder that in centuries past, Plutarch was enjoyed by boys for the battlefield action, good examples to follow, and witticisms. After a few lives of semi-legendary Greek and Roman founders, this is almost all drum-and-trumpet history, and more often than not, the subject meets a violent death! Even the rhetoricians who make it in end up little more than propagandists for some power-hungry faction. Clearly, the\nLives\nas a whole are much too long for practical use in instruction; it would be challenging to fit them into a single academic year, and even then there would be gaps. Besides, after a while, the\nLives\nstart to blend together, and it can feel like you‘re reading about a compsoite or averaged Greco-Roman marching his troops around, swapping wives, and saying amusing things, so the most distinctive\nLives\nshould be set apart, as the student will have a better chance of retaining the information. For an advanced placement high school course, or a 100 or 200 level college course, I think these ten select\nLives\nwould give students a rich taste of classical history, while more than holding interest and providing fruitful inspiration to greatness in our times:\n—Lycurgus and Numa, wise founding lawgivers\n—Alexander and Julius Caesar, unparalleled conquerors\n—Agis & Cleomenes and the Gracchi, attempted restorers in a decadent age\n—Timoleon and Brutus, supernatural intervention in human affairs?\nIn English translation, Plutarch is the canonical writer I have read who most closely follows one of the standards of writing that was most drilled into us in my school days: the thesis statement. Because the Lives are mostly paired, Plutarch usually includes prefatory remarks to explain why the two belong together, and then follows the biographies with a comparison.\nRead the rest of it there. This is the sort of book review that I really like to see, because it reviews the book rather than just discussing the reader’s reaction to the book. One thing that many reviewers fail to grasp is that the subject of the review should be the thing reviewed, not the reviewer himself.\nObviously, many editions that purport to be Plutarch’s\nLives\nare actually an abridgement of them, which is normally abhorrent to us; we’d rather divide a massive tome into two or even three volumes rather than cut it down to a size that will not destroy itself on the bookshelf with the assistance of gravity over time. But, in the event that we ever decide to do a Homeschooling subscription, an abridged version of Plutarch might make sense.\nWhile the Library edition is now out of stock, there are about 20 copies of\nthe more exclusive, superdeluxe Libraria edition\navailable.\nDISCUSS ON SG",
  "tags": [
    "Book Review",
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-30T13:01:23+00:00"
}