{
  "url": "https://voxday.net/2023/10/28/a-warning-for-americans/",
  "scraped_at": "2026-01-08T14:13:43.322471",
  "title": "A Warning for Americans",
  "date_display": "October 28, 2023",
  "date_iso": "2023-10-28T11:10:09+00:00",
  "date_from_url": "2023-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And for everyone else who just wants to be left alone. Sometimes, being left alone isn’t an option. Sooner or later, you may be forced to make a choice regarding for whom you will fight, like the people of Ukraine who now fight themselves conscripted and forced to fight for Clown World, NATO, and the Kiev regime. Simplicius quotes a letter <a href=\"https://simplicius76.substack.com/p/sitrep-102723-ukraines-prospects\">from an award-winning Russian writer</a> who volunteered for the Russian Army and is now fighting on the front lines at Avdeevka:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Do I feel sorry for them? No. They killed and injured my friends, they want to kill me every day. I don’t feel sorry for them. Although, for the most part, the people who stand against us are not rabid Nazis, but ordinary Hataskrayniks who were forcibly driven to slaughter.</p><p>But if you look at everything in its entirety, it was they who brought Ukraine to its current state. That same silent majority who don’t care about Bandera, or the Russians, or the USA – as long as their farm, kindergarten, pigs are not touched, as long as they don’t run out of vodka and lard.</p><p>They didn’t care about the Maidan, about the shelling of Donetsk and Lugansk, about the genocide of the Russian population, about the murders of children, women and the elderly, about Azov’s torture, about language bans, about the split in faith… And then it turned out that they couldn’t sit it out, that you have to take a machine gun and die for the interests and goals of NATO.</p><p>And then they hated us, with a fierce, terrible hatred. Because their little farmstead world collapsed. Because this war reminds them every day of their cowardice, weakness and silence. And in their anger they blame us for everything, because they are afraid to look in the mirror and ask themselves uncomfortable questions.</p></blockquote><p>These reluctant Ukrainian soldiers would have been wiser, and they would have had a much better chance of surviving, if they had stood against the Kiev regime instead of doing nothing until they found themselves forced to fight for it. Because, as enemies from Japan to France and Germany have learned over the centuries, Russia very seldom loses its wars.</p><p>It all sounds a little too familiar, doesn’t it, as the USA goes to undeclared war again in defense of Israel and the collapsing Clown World Order.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e5db021c-57f9-4d6e-b244-b4577f5dcbd9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And for everyone else who just wants to be left alone. Sometimes, being left alone isn’t an option. Sooner or later, you may be forced to make a choice regarding for whom you will fight, like the people of Ukraine who now fight themselves conscripted and forced to fight for Clown World, NATO, and the Kiev regime. Simplicius quotes a letter\nfrom an award-winning Russian writer\nwho volunteered for the Russian Army and is now fighting on the front lines at Avdeevka:\nDo I feel sorry for them? No. They killed and injured my friends, they want to kill me every day. I don’t feel sorry for them. Although, for the most part, the people who stand against us are not rabid Nazis, but ordinary Hataskrayniks who were forcibly driven to slaughter.\nBut if you look at everything in its entirety, it was they who brought Ukraine to its current state. That same silent majority who don’t care about Bandera, or the Russians, or the USA – as long as their farm, kindergarten, pigs are not touched, as long as they don’t run out of vodka and lard.\nThey didn’t care about the Maidan, about the shelling of Donetsk and Lugansk, about the genocide of the Russian population, about the murders of children, women and the elderly, about Azov’s torture, about language bans, about the split in faith… And then it turned out that they couldn’t sit it out, that you have to take a machine gun and die for the interests and goals of NATO.\nAnd then they hated us, with a fierce, terrible hatred. Because their little farmstead world collapsed. Because this war reminds them every day of their cowardice, weakness and silence. And in their anger they blame us for everything, because they are afraid to look in the mirror and ask themselves uncomfortable questions.\nThese reluctant Ukrainian soldiers would have been wiser, and they would have had a much better chance of surviving, if they had stood against the Kiev regime instead of doing nothing until they found themselves forced to fight for it. Because, as enemies from Japan to France and Germany have learned over the centuries, Russia very seldom loses its wars.\nIt all sounds a little too familiar, doesn’t it, as the USA goes to undeclared war again in defense of Israel and the collapsing Clown World Order.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-28T11:10:11+00:00"
}