{
  "url": "https://voxday.net/2023/10/08/an-informative-analogy/",
  "scraped_at": "2026-01-08T14:11:22.158888",
  "title": "An Informative Analogy",
  "date_display": "October 8, 2023",
  "date_iso": "2023-10-08T00:07:04+00:00",
  "date_from_url": "2023-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.zerohedge.com/geopolitical/israel-state-war-hamas-after-palestinian-militants-launch-unprecedented-incursion\">An open admission</a> that the recent Hamas attacks are akin to the historical Japanese attack on the USA:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Former Israel Defense Forces (IDF) international spokesperson Jonathan Conricus has summed up what this day means for Israel, calling in the country’s “Pearl Harbor” moment.</p><p>“The entire system failed. It’s not just one component. It’s the entire defense architecture that evidently failed to provide the necessary defense for Israeli civilians,” he told CNN of the surprise invasion from Gaza militants. “This is a Pearl Harbor type of moment for Israel, where there was reality up until today, and then there will be reality after today.”</p></blockquote><p>So, did it fail or was it turned off? If this truly was Israel’s “Pearl Harbor”, then we know it didn’t fail. Remember, the most effective rhetoric <em>points toward the truth…</em></p><p>“There will be a mighty vengeance for this dark day” doesn’t quite live up to the standard set by “a date which will live in infamy,” though.</p><p><strong>UPDATE: </strong>It’s becoming increasingly likely that this is all very cold-blooded geopolitical theatre that is an attempt to ensure that the Middle East conflict becomes the second WW III front instead of the South East Asian conflict.</p><ul class=\"wp-block-list\"><li><em>I say with certainty this was a “stand-down” order – they do indeed have a very expensive “obstacle” to prevent this, sophisticated tracking surveillance with remote operated machine gun emplacements, and even if they were “overrun by surprise” which is IMPOSSIBLE, the IAF has Apache helicopters for this case, and there were NONE airborne until at least 6 hours later (when hostages were being taken back to Gaza, and the terrorist were coming and going as they pleased in great numbers). The Navy managed to destroy every single enemy that attempted a mass distributed coastal landing without a single loss.</em></li><li><em>None of the above (eight separate border security systems listed) was working. Hamas militants were able to cross open ground and infiltrate into multiple Israeli cities and yeshuvim without detection or being challenged. Hamas militants were even able to make it back into Gaza afterwards with the bodies of captured soldiers, civilians and vehicles. Somehow every single security measure was ineffective. This does not make sense.</em></li><li><em>“Hamas is a creature of Israel.”</em> – Yassir Arafat</li><li><em>Over 800 Israeli settlers storm Al-Aqsa compound during Jewish Sukkot holiday. Rabbis, heads of settlement associations and far-right university lecturers were among 832 people who stormed the Al-Aqsa Mosque compound on Thursday morning.</em></li><li>Iron Dome appears to have been turned off rather than overwhelmed.</li><li><em>Since Saturday, Israel has struck more than 400 targets it says are ‘linked’ to Hamas and the Palestinian Islamic Jihad. This is not unusual in itself. This time, however, jets have also been targeting the houses of top Hamas commanders and political leaders, sending a message to the group that their whereabouts are well known.</em></li></ul><p>The logical conclusion is that the Hamas attacks were provoked and knowingly permitted by the Netanyahu government and the IDF, in much the same way the Japanese attack on Pearl Harbor was provoked and knowingly permitted by the Roosevelt administration and the US Navy. It’s what I think can be best described as a Green Flag rather than a False Flag.</p><p>The purpose of permitting such a large-scale Green Flag at such apparent cost to the Israeli citizenry appears to be two-fold. One, to provide a justification for an IDF attack on Gaza that could range from a punitive short-term incursion to a full-scale Hama-style assault that amounts to ethnic cleansing. Two, and much more important, to provoke Hezbollah into attacking northern Israel and using that as a means of drawing Iran into what Netanyahu has already declared is a “war”, with the ultimate aim of forcing the USA to abandon its support of Ukraine and Taiwan and focus its military resources on Israel instead.</p><p>It looks like a very risky bet at first glance, especially in light of the possibility that China and Russia could support Iran more effectively than the USA can support Israel, but it could be considered a necessary gamble given the way it is now obvious to every military strategist that US econo-military power, and its concomitant ability to successfully intervene in the Middle East, is in rapid decline. If Israel is going to fight a war with Iran, and for whatever reason, both the neocons and the Israeli Right have been seeking that war for at least 40 years, the time to do so with any reasonable probability of success is right now, under the aegis of WWIII.</p><p>But even if Israel is unsuccessful in drawing Iran into direct conflict – and I think they will be unsuccessful in doing so – achieving the elimination of Gaza as Plan B would be seen as a major win by the Israeli Right as well as a significant improvement in the strategic challenge presented by the post-Pax American world.</p><p><strong>UPDATE: </strong>Please note that I wrote the above before the news that Hezbollah and the IDF have exchanged artillery fire in the north. However, what is being reported as “Hezbollah attacks” and “the northern front” do not appear to be much more serious than the organization’s previous statement about “monitoring the situation.”</p><p><em>Hezbollah has officially joined the attack by Palestinian armed factions against Israel by launching attacks from southern Lebanon. In a statement released on October 8 morning, Hezbollah announced that it had attacked three sites of the Israeli Defense Forces (IDF) in the occupied Shebaa Farms in support of “the glorious Palestinian resistance and the struggling and patient Palestinian people.”</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/f04ee665-6741-4a78-91d7-9545075356be\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An open admission\nthat the recent Hamas attacks are akin to the historical Japanese attack on the USA:\nFormer Israel Defense Forces (IDF) international spokesperson Jonathan Conricus has summed up what this day means for Israel, calling in the country’s “Pearl Harbor” moment.\n“The entire system failed. It’s not just one component. It’s the entire defense architecture that evidently failed to provide the necessary defense for Israeli civilians,” he told CNN of the surprise invasion from Gaza militants. “This is a Pearl Harbor type of moment for Israel, where there was reality up until today, and then there will be reality after today.”\nSo, did it fail or was it turned off? If this truly was Israel’s “Pearl Harbor”, then we know it didn’t fail. Remember, the most effective rhetoric\npoints toward the truth…\n“There will be a mighty vengeance for this dark day” doesn’t quite live up to the standard set by “a date which will live in infamy,” though.\nUPDATE:\nIt’s becoming increasingly likely that this is all very cold-blooded geopolitical theatre that is an attempt to ensure that the Middle East conflict becomes the second WW III front instead of the South East Asian conflict.\nI say with certainty this was a “stand-down” order – they do indeed have a very expensive “obstacle” to prevent this, sophisticated tracking surveillance with remote operated machine gun emplacements, and even if they were “overrun by surprise” which is IMPOSSIBLE, the IAF has Apache helicopters for this case, and there were NONE airborne until at least 6 hours later (when hostages were being taken back to Gaza, and the terrorist were coming and going as they pleased in great numbers). The Navy managed to destroy every single enemy that attempted a mass distributed coastal landing without a single loss.\nNone of the above (eight separate border security systems listed) was working. Hamas militants were able to cross open ground and infiltrate into multiple Israeli cities and yeshuvim without detection or being challenged. Hamas militants were even able to make it back into Gaza afterwards with the bodies of captured soldiers, civilians and vehicles. Somehow every single security measure was ineffective. This does not make sense.\n“Hamas is a creature of Israel.”\n– Yassir Arafat\nOver 800 Israeli settlers storm Al-Aqsa compound during Jewish Sukkot holiday. Rabbis, heads of settlement associations and far-right university lecturers were among 832 people who stormed the Al-Aqsa Mosque compound on Thursday morning.\nIron Dome appears to have been turned off rather than overwhelmed.\nSince Saturday, Israel has struck more than 400 targets it says are ‘linked’ to Hamas and the Palestinian Islamic Jihad. This is not unusual in itself. This time, however, jets have also been targeting the houses of top Hamas commanders and political leaders, sending a message to the group that their whereabouts are well known.\nThe logical conclusion is that the Hamas attacks were provoked and knowingly permitted by the Netanyahu government and the IDF, in much the same way the Japanese attack on Pearl Harbor was provoked and knowingly permitted by the Roosevelt administration and the US Navy. It’s what I think can be best described as a Green Flag rather than a False Flag.\nThe purpose of permitting such a large-scale Green Flag at such apparent cost to the Israeli citizenry appears to be two-fold. One, to provide a justification for an IDF attack on Gaza that could range from a punitive short-term incursion to a full-scale Hama-style assault that amounts to ethnic cleansing. Two, and much more important, to provoke Hezbollah into attacking northern Israel and using that as a means of drawing Iran into what Netanyahu has already declared is a “war”, with the ultimate aim of forcing the USA to abandon its support of Ukraine and Taiwan and focus its military resources on Israel instead.\nIt looks like a very risky bet at first glance, especially in light of the possibility that China and Russia could support Iran more effectively than the USA can support Israel, but it could be considered a necessary gamble given the way it is now obvious to every military strategist that US econo-military power, and its concomitant ability to successfully intervene in the Middle East, is in rapid decline. If Israel is going to fight a war with Iran, and for whatever reason, both the neocons and the Israeli Right have been seeking that war for at least 40 years, the time to do so with any reasonable probability of success is right now, under the aegis of WWIII.\nBut even if Israel is unsuccessful in drawing Iran into direct conflict – and I think they will be unsuccessful in doing so – achieving the elimination of Gaza as Plan B would be seen as a major win by the Israeli Right as well as a significant improvement in the strategic challenge presented by the post-Pax American world.\nUPDATE:\nPlease note that I wrote the above before the news that Hezbollah and the IDF have exchanged artillery fire in the north. However, what is being reported as “Hezbollah attacks” and “the northern front” do not appear to be much more serious than the organization’s previous statement about “monitoring the situation.”\nHezbollah has officially joined the attack by Palestinian armed factions against Israel by launching attacks from southern Lebanon. In a statement released on October 8 morning, Hezbollah announced that it had attacked three sites of the Israeli Defense Forces (IDF) in the occupied Shebaa Farms in support of “the glorious Palestinian resistance and the struggling and patient Palestinian people.”\nDISCUSS ON SG",
  "tags": [
    "history",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-08T15:38:23+00:00"
}