{
  "url": "https://voxday.net/2023/10/18/dont-bark-if-you-wont-bite/",
  "scraped_at": "2026-01-08T14:12:30.271149",
  "title": "Don’t Bark if You Won’t Bite",
  "date_display": "October 18, 2023",
  "date_iso": "2023-10-18T08:23:20+00:00",
  "date_from_url": "2023-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Israel is frantically backpedaling after more than a week of bloodthirsty threats to completely cleanse Gaza of Palestinians have been very poorly received by the world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Iran’s foreign minister declared on Wednesday that ‘time is over’ for Israel, as Joe Biden was set to arrive in Tel Aviv to try and calm a rapidly-spiraling situation, with anti-Israel protests flaring up across the region.</p><p>The foreign minister’s message echoes one posted by Iran’s embassy in Syria that tweeted ‘Time is Up’ in Hebrew.</p></blockquote><p>It’s unclear what the messages referred to, but came after an air strike on a Gaza hospital on Tuesday killed at least 500 people, according to Palestinian authorities… IDF claims video shows misfiring Gaza rocket was to blame for hospital carnage: Footage shows missile exploding in the sky before blast that left hundreds dead – as Israel furiously denies it was behind devastating strike.</p></blockquote><p>Let’s get this straight. To the best of our knowledge, there isn’t a single rocket, of the thousands that have been fired at Israel, that managed to harm even a dozen people when it was aimed at a target and operated properly. But we’re supposed to believe that a single misfiring rocket managed to somehow blow up more than 500 people when it went awry.</p><p>Furthermore, we’re supposed to believe that the Israeli government, which possesses much more powerful missiles and bombs than Hamas, and which has been very loudly threatening to kill every man, woman, and child in Gaza, wouldn’t blow up a hospital when they’ve been aggressively bombing civilian apartment buildings and vehicles.</p><p>Right.</p><p>It’s not looking good for Israel when even Turkey, which until recently had been quite friendly with it, now appears to have sided with the Palestinians, as pro-Palestinian protests take place across Europe.</p><p><em>Israel advised its citizens to leave Türkiye immediately on Tuesday, citing the heightened threat of terrorist attacks amid widespread outrage over the deadly missile strike on a hospital in the Gaza Strip. </em></p><p>The Kalergi plan of encouraging Muslim immigration into white, Christian countries so popular with the likes of Ben Shapiro and Barbara Lerner Spectre appears to be backfiring rather badly.</p><p>I was wondering why Israel’s recent PR failures have been even more observably incompetent than the supposed failures of its intelligence agencies, and I am reliably informed that it is due to the fact that its architects are nearly as old and out-of-touch as the US gerontocracy. They’re still operating on a 1980s Cold War model primarily designed to appeal to American Boomers, which is why they don’t realize how insane their attempts to establish an Official Story sound in the ears of everyone from Generation X and younger around the world.</p><p>This really isn’t that hard. You can’t cry about genocide for 50 years and then think that you can get away with openly committing one yourself. You can’t bomb hospitals, kill large quantities of civilians, and still claim that you’re the victim, even if it is in reprisal. And most importantly, <em>never threaten to do anything for which you don’t wish to assume responsibility.</em></p><p><strong>UPDATE:</strong> It appears the Israeli PR organization is more than a little discombobulated by its unanticipated ineffectiveness. Their efforts are to no avail, literally no one except Ben Shapiro and Mark Levin even pretend to believe them, and even those two are just faking it anyhow. The sound signature <a href=\"https://gab.com/WallofPeople/posts/111252682880501216\">indicates a JDAM bomb</a> of the sort that the US recently “rushed to Israel”. Which is why it’s that “heartbreaking” that underlines what a bunch of sociopaths these propagandists are.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59984\" decoding=\"async\" fetchpriority=\"high\" height=\"527\" sizes=\"(max-width: 338px) 100vw, 338px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-43.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-43.png 338w, https://voxday.net/wp-content/uploads/2023/10/image-43-192x300.png 192w\" width=\"338\"/></figure></div><p><strong>UPDATE:</strong> The hospital that was bombed was a Christian one. And we all know that the people who literally spit on Christians in the street are ever so respectful of Christian institutions. It will be fascinating to see how the Boomer Churchians attempt to explain that one away.</p><p><em>Al Ahli Arab Hospital is one of the oldest in Gaza, operating since the early 1880s. Initially it was a Christian medical mission and is known by many locals as the Baptist Hospital. It had been functioning as a free community clinic run by the Episcopal Diocese of Jerusalem of the Middle-Eastern branch of the Anglican Church.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/0d0be9be-453b-4ad8-9f09-4f36e00a4658\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Israel is frantically backpedaling after more than a week of bloodthirsty threats to completely cleanse Gaza of Palestinians have been very poorly received by the world.\nIran’s foreign minister declared on Wednesday that ‘time is over’ for Israel, as Joe Biden was set to arrive in Tel Aviv to try and calm a rapidly-spiraling situation, with anti-Israel protests flaring up across the region.\nThe foreign minister’s message echoes one posted by Iran’s embassy in Syria that tweeted ‘Time is Up’ in Hebrew.\nIt’s unclear what the messages referred to, but came after an air strike on a Gaza hospital on Tuesday killed at least 500 people, according to Palestinian authorities… IDF claims video shows misfiring Gaza rocket was to blame for hospital carnage: Footage shows missile exploding in the sky before blast that left hundreds dead – as Israel furiously denies it was behind devastating strike.\nLet’s get this straight. To the best of our knowledge, there isn’t a single rocket, of the thousands that have been fired at Israel, that managed to harm even a dozen people when it was aimed at a target and operated properly. But we’re supposed to believe that a single misfiring rocket managed to somehow blow up more than 500 people when it went awry.\nFurthermore, we’re supposed to believe that the Israeli government, which possesses much more powerful missiles and bombs than Hamas, and which has been very loudly threatening to kill every man, woman, and child in Gaza, wouldn’t blow up a hospital when they’ve been aggressively bombing civilian apartment buildings and vehicles.\nRight.\nIt’s not looking good for Israel when even Turkey, which until recently had been quite friendly with it, now appears to have sided with the Palestinians, as pro-Palestinian protests take place across Europe.\nIsrael advised its citizens to leave Türkiye immediately on Tuesday, citing the heightened threat of terrorist attacks amid widespread outrage over the deadly missile strike on a hospital in the Gaza Strip.\nThe Kalergi plan of encouraging Muslim immigration into white, Christian countries so popular with the likes of Ben Shapiro and Barbara Lerner Spectre appears to be backfiring rather badly.\nI was wondering why Israel’s recent PR failures have been even more observably incompetent than the supposed failures of its intelligence agencies, and I am reliably informed that it is due to the fact that its architects are nearly as old and out-of-touch as the US gerontocracy. They’re still operating on a 1980s Cold War model primarily designed to appeal to American Boomers, which is why they don’t realize how insane their attempts to establish an Official Story sound in the ears of everyone from Generation X and younger around the world.\nThis really isn’t that hard. You can’t cry about genocide for 50 years and then think that you can get away with openly committing one yourself. You can’t bomb hospitals, kill large quantities of civilians, and still claim that you’re the victim, even if it is in reprisal. And most importantly,\nnever threaten to do anything for which you don’t wish to assume responsibility.\nUPDATE:\nIt appears the Israeli PR organization is more than a little discombobulated by its unanticipated ineffectiveness. Their efforts are to no avail, literally no one except Ben Shapiro and Mark Levin even pretend to believe them, and even those two are just faking it anyhow. The sound signature\nindicates a JDAM bomb\nof the sort that the US recently “rushed to Israel”. Which is why it’s that “heartbreaking” that underlines what a bunch of sociopaths these propagandists are.\nUPDATE:\nThe hospital that was bombed was a Christian one. And we all know that the people who literally spit on Christians in the street are ever so respectful of Christian institutions. It will be fascinating to see how the Boomer Churchians attempt to explain that one away.\nAl Ahli Arab Hospital is one of the oldest in Gaza, operating since the early 1880s. Initially it was a Christian medical mission and is known by many locals as the Baptist Hospital. It had been functioning as a free community clinic run by the Episcopal Diocese of Jerusalem of the Middle-Eastern branch of the Anglican Church.\nDISCUSS ON SG",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-18T13:50:28+00:00"
}