{
  "url": "https://voxday.net/2023/10/15/from-the-maine-to-the-maddox/",
  "scraped_at": "2026-01-08T14:12:13.811068",
  "title": "From the Maine to the Maddox",
  "date_display": "October 15, 2023",
  "date_iso": "2023-10-15T17:21:04+00:00",
  "date_from_url": "2023-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The stage has been set for another Gulf of Tonkin-style incident. Remember, from the <em>USS Maine</em> to the <em>USS Morton</em>, false flags and fake enemy attacks at sea is how the USA customarily justified its foreign wars. The following is from a book about baseball, of all things.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>While Ralph Houk and Johnny Keane were carrying out their embarrassing charade [with the New York Yankees], in Washington, DC., President Johnson, running for reelection after finishing John Kennedy’s term, was leading an unsuspecting American public into a devastating war with a charade of his own.</p><p>In late September it was reported by the State Department that two American destroyers, the<em> Richard Edward</em> and the <em>Morton</em>, were fired upon by four attacking North Vietnamese gunboats, seemingly all poor shots as no damage to the American ships was reported. The Republican presidential nominee, Barry Goldwater, proclaimed, “As sure as the sun sets, we are at war.” The North Vietnamese swore that none of their ships attacked anyone. Johnson, firm, told the American people that the Vietnamese were lying.</p><p>The Pentagon had some doubts as to whether the attacks ever did take place, and there was censorship of letters from American seamen on the two ships who tried to write home that they had not been attacked. One sailor, whose letter got through the censorship, wrote that North Vietnamese ships were sighted. We shot at them, the sailor wrote home. “They didn’t shoot at us. Johnson, gearing the country for war, coerced Congress, citing the attack on our ships, into backing his escalation of the fighting in Vietnam.</p><p>Before the Tonkin Gulf incident, only 190 U.S. soldiers had been killed. “Before I send American G.I.’s into war,” Johnson said, “I must consider every facet very carefully.” After Johnson’s term, 25,000 American soldiers lay dead in the hostile rice paddies of a devastated country.</p></blockquote><p>In fact, the USA staged not one, but two Gulf of Tonkin incidents in order to justify its war in Vietnam. Two days prior, the USS <em>Maddox </em>had also had a confrontation with North Vietnamese torpedo boats after repeatedly intruding upon Vietnam’s territorial waters in an attempt to provoke the Vietnamese into firing at it.</p><p>So don’t fall for whatever naval event is being staged in the eastern Mediterranean in the coming weeks, or the solemn pronouncements about how “we are at war”.</p><p><em>The Pentagon has dispatched a second US Navy carrier strike group to the eastern Mediterranean in a move that will deliver additional American firepower to the waters near Israel as fears mount that its war with Hamas could worsen and spiral into a regional conflict. The USS Dwight D. Eisenhower Carrier Strike Group is moving into the area “as part of our effort to deter hostile actions against Israel or any efforts toward widening this war following Hamas’s attack on Israel,” Defense Secretary Lloyd Austin said in a statement on Saturday. The strike group includes the aircraft carrier USS Dwight D. Eisenhower, the guided-missile cruiser USS Philippine Sea, and guided-missile destroyers USS Gravely and USS Mason.</em></p><p><strong>UPDATE: </strong>A note about the two USN carriers sent to the region from a reader.</p><p><em>Something worth noting about the two carriers sent to Israel. One is the oldest nuclear carrier on the east coast, nearing end of life. The other is the newest carrier, which has been plagued with expensive technical issues. One being sunk would spare the Navy the hassle of decommissioning and defueling down the road. The other being sunk would spare the headache and hassle of trying to fix a badly designed carrier.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/b1200832-19f4-4e0e-9380-09058ae6434d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The stage has been set for another Gulf of Tonkin-style incident. Remember, from the\nUSS Maine\nto the\nUSS Morton\n, false flags and fake enemy attacks at sea is how the USA customarily justified its foreign wars. The following is from a book about baseball, of all things.\nWhile Ralph Houk and Johnny Keane were carrying out their embarrassing charade [with the New York Yankees], in Washington, DC., President Johnson, running for reelection after finishing John Kennedy’s term, was leading an unsuspecting American public into a devastating war with a charade of his own.\nIn late September it was reported by the State Department that two American destroyers, the\nRichard Edward\nand the\nMorton\n, were fired upon by four attacking North Vietnamese gunboats, seemingly all poor shots as no damage to the American ships was reported. The Republican presidential nominee, Barry Goldwater, proclaimed, “As sure as the sun sets, we are at war.” The North Vietnamese swore that none of their ships attacked anyone. Johnson, firm, told the American people that the Vietnamese were lying.\nThe Pentagon had some doubts as to whether the attacks ever did take place, and there was censorship of letters from American seamen on the two ships who tried to write home that they had not been attacked. One sailor, whose letter got through the censorship, wrote that North Vietnamese ships were sighted. We shot at them, the sailor wrote home. “They didn’t shoot at us. Johnson, gearing the country for war, coerced Congress, citing the attack on our ships, into backing his escalation of the fighting in Vietnam.\nBefore the Tonkin Gulf incident, only 190 U.S. soldiers had been killed. “Before I send American G.I.’s into war,” Johnson said, “I must consider every facet very carefully.” After Johnson’s term, 25,000 American soldiers lay dead in the hostile rice paddies of a devastated country.\nIn fact, the USA staged not one, but two Gulf of Tonkin incidents in order to justify its war in Vietnam. Two days prior, the USS\nMaddox\nhad also had a confrontation with North Vietnamese torpedo boats after repeatedly intruding upon Vietnam’s territorial waters in an attempt to provoke the Vietnamese into firing at it.\nSo don’t fall for whatever naval event is being staged in the eastern Mediterranean in the coming weeks, or the solemn pronouncements about how “we are at war”.\nThe Pentagon has dispatched a second US Navy carrier strike group to the eastern Mediterranean in a move that will deliver additional American firepower to the waters near Israel as fears mount that its war with Hamas could worsen and spiral into a regional conflict. The USS Dwight D. Eisenhower Carrier Strike Group is moving into the area “as part of our effort to deter hostile actions against Israel or any efforts toward widening this war following Hamas’s attack on Israel,” Defense Secretary Lloyd Austin said in a statement on Saturday. The strike group includes the aircraft carrier USS Dwight D. Eisenhower, the guided-missile cruiser USS Philippine Sea, and guided-missile destroyers USS Gravely and USS Mason.\nUPDATE:\nA note about the two USN carriers sent to the region from a reader.\nSomething worth noting about the two carriers sent to Israel. One is the oldest nuclear carrier on the east coast, nearing end of life. The other is the newest carrier, which has been plagued with expensive technical issues. One being sunk would spare the Navy the hassle of decommissioning and defueling down the road. The other being sunk would spare the headache and hassle of trying to fix a badly designed carrier.\nDISCUSS ON SG",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-16T00:12:18+00:00"
}