{
  "url": "https://voxday.net/2023/10/29/lonesome-october/",
  "scraped_at": "2026-01-08T14:13:50.395514",
  "title": "Lonesome October",
  "date_display": "October 29, 2023",
  "date_iso": "2023-10-29T11:36:53+00:00",
  "date_from_url": "2023-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not too late to read the book in the appropriate month. The Dark Herald <a href=\"https://arkhavencomics.com/2023/10/26/book-discussion-a-night-in-the-lonesome-october-by-roger-zelazny/\">pays tribute</a> to an increasingly forgotten fantasy great and one of his more original novels.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>A Night in the Lonesome October</em> was Zelazny’s love letter to the old Universal horror movies as well as classic authors in the field. He dedicated the book to Shelley, Poe, Doyle, Lovecraft, plus a couple of relative newcomers Bradbury and Bloch. Also, Terhune but that was mostly because of the dog.</p><p>This is a book where the style of the story’s telling outweighs the narrative and that is perfectly fine because it is the style that matters the most. The narrative itself is just for fun, although Zelazny makes the reader figure it out for himself.</p><p>The book is constructed as a diary of Snuff the Dog. Each chapter of the book corresponds to a date in the month of October, the climax as you have guessed is on Halloween. Snuff used to be something else, somewhere else, but in this time and place, he is Jack’s Dog. Jack as you already know has to do his work at night and yes Jack does have a very big knife.</p><p>Jack and Snuff are part of a faction called the Closers, it takes quite a while before you find out what they are closing. There is another faction called the Openers and they are in opposition to the Closers. It’s more than a little difficult to tell which side are the good guys and which the bad because their methods are rather similar and early in the story they can’t really tell which side the other is on either. It is all part of the Great Game.</p><p>The Openers and Closers are familiar to you. There is the Good Doctor and his secret Creation, the Great Detective, the Mad Russian Monk, the Count, the Fallen Priest, and Larry Talbot. Each of these Player in the Great Game has an animal familiar with human sapience. Except for Larry who is of course his own best friend.</p><p>At the start of the Game things are very cordial between the players, the Great Game is only played every few decades so there is a sense of comradery… At first. But as the month progresses, alliances are formed which are followed by betrayals, naturally. Then Players start being eliminated, that too is part of the Great Game. Finally, the remaining Players and their familiars gather in a certain place where the rite that will decide the fate of the world will be decided.</p></blockquote><p>Although it may not show, Roger Zelazny is probably one of the more significant influences on my own writing. And while <em>Lord of Light</em> is my favorite of his novels and the epic <em>Amber </em>series is the most similar in scale, <em>A Night in the Lonesome October</em> is easily the one that has proved to be most influential.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0450c269-0b2a-41c0-9ffd-478f33d56c56\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s not too late to read the book in the appropriate month. The Dark Herald\npays tribute\nto an increasingly forgotten fantasy great and one of his more original novels.\nA Night in the Lonesome October\nwas Zelazny’s love letter to the old Universal horror movies as well as classic authors in the field. He dedicated the book to Shelley, Poe, Doyle, Lovecraft, plus a couple of relative newcomers Bradbury and Bloch. Also, Terhune but that was mostly because of the dog.\nThis is a book where the style of the story’s telling outweighs the narrative and that is perfectly fine because it is the style that matters the most. The narrative itself is just for fun, although Zelazny makes the reader figure it out for himself.\nThe book is constructed as a diary of Snuff the Dog. Each chapter of the book corresponds to a date in the month of October, the climax as you have guessed is on Halloween. Snuff used to be something else, somewhere else, but in this time and place, he is Jack’s Dog. Jack as you already know has to do his work at night and yes Jack does have a very big knife.\nJack and Snuff are part of a faction called the Closers, it takes quite a while before you find out what they are closing. There is another faction called the Openers and they are in opposition to the Closers. It’s more than a little difficult to tell which side are the good guys and which the bad because their methods are rather similar and early in the story they can’t really tell which side the other is on either. It is all part of the Great Game.\nThe Openers and Closers are familiar to you. There is the Good Doctor and his secret Creation, the Great Detective, the Mad Russian Monk, the Count, the Fallen Priest, and Larry Talbot. Each of these Player in the Great Game has an animal familiar with human sapience. Except for Larry who is of course his own best friend.\nAt the start of the Game things are very cordial between the players, the Great Game is only played every few decades so there is a sense of comradery… At first. But as the month progresses, alliances are formed which are followed by betrayals, naturally. Then Players start being eliminated, that too is part of the Great Game. Finally, the remaining Players and their familiars gather in a certain place where the rite that will decide the fate of the world will be decided.\nAlthough it may not show, Roger Zelazny is probably one of the more significant influences on my own writing. And while\nLord of Light\nis my favorite of his novels and the epic\nAmber\nseries is the most similar in scale,\nA Night in the Lonesome October\nis easily the one that has proved to be most influential.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2023-10-29T11:37:36+00:00"
}