{
  "url": "https://voxday.net/2023/10/18/not-one-for-the-faint-of-heart/",
  "scraped_at": "2026-01-08T14:12:31.769864",
  "title": "Not One for the Faint of Heart",
  "date_display": "October 18, 2023",
  "date_iso": "2023-10-18T18:30:28+00:00",
  "date_from_url": "2023-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m neither a gourmet nor a gourmand. Nor am I a food blogger. While I can recognize and appreciate good food, I don’t pretend to be an expert on any of the branches of the culinary arts. But I am fortunate enough to be acquainted with a few recognized world-class maestros in two or three of them, and one of those maestros is an Italian pizza artist extraordinaire.</p><p>His October <em>Cighialotta </em>was, quite honestly, one of the best pizzas I’ve ever experienced. And it was an experience, albeit not one for the faint of heart. Wild boar, or <em>cinghiale </em>as the Italians call it, is a very strong flavor, which was why I was a little dubious about the idea of basing a pizza around it. But desperate times like these call for daring measures, and it turned out that balanced with artichokes, carmelized onions, and a particular cheese, the wild boar proves to be intense rather than overpowering. Combine the pizza with a decent Primitivo from the South, and the experience becomes sublime, if not transformative.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59990\" decoding=\"async\" fetchpriority=\"high\" height=\"373\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-45.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-45.png 512w, https://voxday.net/wp-content/uploads/2023/10/image-45-300x219.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/810af2fe-3f2c-40ad-85ca-e5777cd5f23e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m neither a gourmet nor a gourmand. Nor am I a food blogger. While I can recognize and appreciate good food, I don’t pretend to be an expert on any of the branches of the culinary arts. But I am fortunate enough to be acquainted with a few recognized world-class maestros in two or three of them, and one of those maestros is an Italian pizza artist extraordinaire.\nHis October\nCighialotta\nwas, quite honestly, one of the best pizzas I’ve ever experienced. And it was an experience, albeit not one for the faint of heart. Wild boar, or\ncinghiale\nas the Italians call it, is a very strong flavor, which was why I was a little dubious about the idea of basing a pizza around it. But desperate times like these call for daring measures, and it turned out that balanced with artichokes, carmelized onions, and a particular cheese, the wild boar proves to be intense rather than overpowering. Combine the pizza with a decent Primitivo from the South, and the experience becomes sublime, if not transformative.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2023-10-18T18:36:05+00:00"
}