{
  "url": "https://voxday.net/2023/10/21/the-global-south-is-lost/",
  "scraped_at": "2026-01-08T14:12:53.673956",
  "title": "The Global South is Lost",
  "date_display": "October 21, 2023",
  "date_iso": "2023-10-21T14:50:13+00:00",
  "date_from_url": "2023-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One unanticipated outcome of the recent flareup in the Middle East is that it appears to have put <a href=\"https://www.rt.com/news/585313-west-lost-global-south/\">the final nail in the coffin</a> of the Clown World Order by making it clear that the so-called “rules-based order” does not actually have any genuine principles or rules, thereby ensuring widespread global preference for the sovereign nations of the Multipolarity over the Imperial USA and its occupied satrapies.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Attempts by the US and its allies to <em>“paint Moscow as a global pariah”</em> have been <em>“poisoned”</em> by the rush to support Israeli retaliation against Hamas in Gaza, the<em> Financial Times </em>reported on Wednesday, citing more than a dozen officials.</p><p>“We have definitely lost the battle in the Global South,” one senior G7 diplomat was quoted as saying. “All the work we have done with the Global South [over Ukraine] has been lost… Forget about rules, forget about world order. They won’t ever listen to us again.”</p><p>“What we said about Ukraine has to apply to Gaza. Otherwise we lose all our credibility,” the official added. “The Brazilians, the South Africans, the Indonesians: why should they ever believe what we say about human rights?”</p> <cite>West ‘lost’ Global South over Israel, Financial Times, 18 October 2023</cite></blockquote><p>Now, this is apparently shocking news to the inhabitants of Clown World as well as its rulers, but it was always inevitable. The “Israel exception” to decades of baseless assertions about democracy and human rights and respect for indigenous peoples was never going to survive the Internet anyhow, nor was “the plight of the poor, oppressed Jewish people who never did nothing bad to nobody” ever going to cut any ice with anyone but high-trust, soft-hearted ignoramuses with no sense of history.</p><p>And it’s a particularly bad look for Israel to be observed to be “defending itself” by continuously expanding its territory. Considering that a significant percentage of the Global South has historical experience with violent colonization of its ancestral lands, it should not be much of a surprise that there is a natural tendency for those nations to instinctively side with the Palestinians. Indeed, those who are old enough will recall how many US-resident Jews vehemently supported the blacks in South Africa on much flimsier historical claims than those presently possessed by the Palestinians.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60047\" decoding=\"async\" fetchpriority=\"high\" height=\"586\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-54.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-54.png 512w, https://voxday.net/wp-content/uploads/2023/10/image-54-262x300.png 262w\" width=\"512\"/></figure></div><p>But as the <em>Financial Times</em> points out, it is the juxtaposition of Clown World’s position on the Russia-Ukraine situation with it’s position on the Israel-Palestinian situation that has probably been the most harmful to its credibility in the eyes of the Global South. Ukraine’s crimes against the Russians in the Donbass, and the 9,900 Russians killed there between 2014 and 2022, were far in excess of the various crimes committed by Hamas in the same timeframe, and yet the global media has spent the last 19 months relentlessly decrying Russian actions that have been considerably more restrained, given Russia’s capabilities, than the total ethnic cleansing or even extermination of the Palestinians now being threatened all over social media in response to a single Hamas raid.</p><p>Clown World is deranged and dying. One hopes the Great Powers of the Multipolarity will use their power and influence in a more circumspect and generally beneficial manner once it is gone.</p><p><strong>UPDATE: </strong>Clown World is going to try to succeed itself.</p><p><em>The current US-led world order has “sort of run out of steam,” but Washington will shape the system that replaces it, US President Joe Biden told supporters on Saturday.</em></p><p>No, it really won’t.</p><p><a href=\"https://social.infogalactic.com/micropost/4c49fa28-09dd-4cab-920d-735c4fbc9819\">DISCUSS ON SG</a></p></div>",
  "content_text": "One unanticipated outcome of the recent flareup in the Middle East is that it appears to have put\nthe final nail in the coffin\nof the Clown World Order by making it clear that the so-called “rules-based order” does not actually have any genuine principles or rules, thereby ensuring widespread global preference for the sovereign nations of the Multipolarity over the Imperial USA and its occupied satrapies.\nAttempts by the US and its allies to\n“paint Moscow as a global pariah”\nhave been\n“poisoned”\nby the rush to support Israeli retaliation against Hamas in Gaza, the\nFinancial Times\nreported on Wednesday, citing more than a dozen officials.\n“We have definitely lost the battle in the Global South,” one senior G7 diplomat was quoted as saying. “All the work we have done with the Global South [over Ukraine] has been lost… Forget about rules, forget about world order. They won’t ever listen to us again.”\n“What we said about Ukraine has to apply to Gaza. Otherwise we lose all our credibility,” the official added. “The Brazilians, the South Africans, the Indonesians: why should they ever believe what we say about human rights?”\nWest ‘lost’ Global South over Israel, Financial Times, 18 October 2023\nNow, this is apparently shocking news to the inhabitants of Clown World as well as its rulers, but it was always inevitable. The “Israel exception” to decades of baseless assertions about democracy and human rights and respect for indigenous peoples was never going to survive the Internet anyhow, nor was “the plight of the poor, oppressed Jewish people who never did nothing bad to nobody” ever going to cut any ice with anyone but high-trust, soft-hearted ignoramuses with no sense of history.\nAnd it’s a particularly bad look for Israel to be observed to be “defending itself” by continuously expanding its territory. Considering that a significant percentage of the Global South has historical experience with violent colonization of its ancestral lands, it should not be much of a surprise that there is a natural tendency for those nations to instinctively side with the Palestinians. Indeed, those who are old enough will recall how many US-resident Jews vehemently supported the blacks in South Africa on much flimsier historical claims than those presently possessed by the Palestinians.\nBut as the\nFinancial Times\npoints out, it is the juxtaposition of Clown World’s position on the Russia-Ukraine situation with it’s position on the Israel-Palestinian situation that has probably been the most harmful to its credibility in the eyes of the Global South. Ukraine’s crimes against the Russians in the Donbass, and the 9,900 Russians killed there between 2014 and 2022, were far in excess of the various crimes committed by Hamas in the same timeframe, and yet the global media has spent the last 19 months relentlessly decrying Russian actions that have been considerably more restrained, given Russia’s capabilities, than the total ethnic cleansing or even extermination of the Palestinians now being threatened all over social media in response to a single Hamas raid.\nClown World is deranged and dying. One hopes the Great Powers of the Multipolarity will use their power and influence in a more circumspect and generally beneficial manner once it is gone.\nUPDATE:\nClown World is going to try to succeed itself.\nThe current US-led world order has “sort of run out of steam,” but Washington will shape the system that replaces it, US President Joe Biden told supporters on Saturday.\nNo, it really won’t.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Russia",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-22T11:19:48+00:00"
}