{
  "url": "https://voxday.net/2023/10/01/the-saga-of-the-baen-exemplar/",
  "scraped_at": "2026-01-08T14:10:39.681898",
  "title": "The Saga of the Baen Exemplar",
  "date_display": "October 1, 2023",
  "date_iso": "2023-10-01T14:16:53+00:00",
  "date_from_url": "2023-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Jon is a sociopathic grifter who goes through life trying to insert himself into other peoples’ troubles to try and score clout for himself. He starts shit for others and then cries how he’s a victim. When you take exception to him fucking people over for clout he will say everybody but him is a secret leftist sell out and you just hate him because he’s “Christian”. Do not trust him. He’s fucking cancer. Seriously. I can’t accentuate this enough. Trust him at your own peril. That dude is the proverbial wolf in sheep’s clothing.</em></p><ul class=\"wp-block-list\"><li>Larry Correia, 25 September 2023</li></ul><p>I have zero interest in saying anything negative about Larry Correia or contributing to the never-ending stream of Baen-related drama. I’ve never had any problem with him, personal or professional. He’s a significant figure of the right-wing cultural scene and I like both his <em>Monster Hunter</em> and <em>Grimoire </em>novels. <em>Quantum Mortis: A Man Disrupted </em>was a conscious attempt to out gun-porn Larry in a science fiction setting. And even our disagreement about the ideal way to handle the Hugo Awards led directly to my favorite experience of my entire literary career, the epic two-year Rabid Puppies rampage, for which I will always be grateful.</p><p>However, given the public nature of these accusations about a valued contributor to both Arktoons and Unauthorized, I would be remiss if I did not clearly state for the record that <span style=\"text-decoration: underline;\">Larry Correia is flat-out wrong about Jon Del Arroz</span>. Larry is flat-out and <em>provably </em>wrong. I can testify, from personal experience, that Jon is neither “fucking cancer” nor a “vile fucker”, and that it’s both unprofessional and incorrect for any established writer to assert that he is.</p><p>Unauthorized subscribers who wish to hear Jon’s take can watch his UATV-exclusive video <a href=\"https://unauthorized.tv/video/827052/\">on the subject</a>.</p><p>And since we’re speaking of Jon Del Arroz, I’m pleased to observe that his novel <em>JUSTIFIED</em>, the first in <em>The Saga of the Nano Templar</em>, launched in episodic format <a href=\"https://www.arkhaven.com/comics/sci-fi/the-saga-of-the-nano-templar/ready-for-action\">on Arktoons today</a>.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.arkhaven.com/comics/sci-fi/the-saga-of-the-nano-templar/ready-for-action\"><img alt=\"\" class=\"wp-image-59688\" decoding=\"async\" fetchpriority=\"high\" height=\"784\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-2.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-2.png 512w, https://voxday.net/wp-content/uploads/2023/10/image-2-196x300.png 196w\" width=\"512\"/></a></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/b13c78c2-2127-4181-97a2-c52b2715741e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Jon is a sociopathic grifter who goes through life trying to insert himself into other peoples’ troubles to try and score clout for himself. He starts shit for others and then cries how he’s a victim. When you take exception to him fucking people over for clout he will say everybody but him is a secret leftist sell out and you just hate him because he’s “Christian”. Do not trust him. He’s fucking cancer. Seriously. I can’t accentuate this enough. Trust him at your own peril. That dude is the proverbial wolf in sheep’s clothing.\nLarry Correia, 25 September 2023\nI have zero interest in saying anything negative about Larry Correia or contributing to the never-ending stream of Baen-related drama. I’ve never had any problem with him, personal or professional. He’s a significant figure of the right-wing cultural scene and I like both his\nMonster Hunter\nand\nGrimoire\nnovels.\nQuantum Mortis: A Man Disrupted\nwas a conscious attempt to out gun-porn Larry in a science fiction setting. And even our disagreement about the ideal way to handle the Hugo Awards led directly to my favorite experience of my entire literary career, the epic two-year Rabid Puppies rampage, for which I will always be grateful.\nHowever, given the public nature of these accusations about a valued contributor to both Arktoons and Unauthorized, I would be remiss if I did not clearly state for the record that\nLarry Correia is flat-out wrong about Jon Del Arroz\n. Larry is flat-out and\nprovably\nwrong. I can testify, from personal experience, that Jon is neither “fucking cancer” nor a “vile fucker”, and that it’s both unprofessional and incorrect for any established writer to assert that he is.\nUnauthorized subscribers who wish to hear Jon’s take can watch his UATV-exclusive video\non the subject\n.\nAnd since we’re speaking of Jon Del Arroz, I’m pleased to observe that his novel\nJUSTIFIED\n, the first in\nThe Saga of the Nano Templar\n, launched in episodic format\non Arktoons today\n.\nDISCUSS ON SG",
  "tags": [
    "books",
    "SFWA",
    "UATV"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-01T14:33:07+00:00"
}