{
  "url": "https://voxday.net/2023/10/11/thus-spake-spacebunny/",
  "scraped_at": "2026-01-08T14:11:44.698590",
  "title": "Thus Spake Spacebunny",
  "date_display": "October 11, 2023",
  "date_iso": "2023-10-11T14:08:05+00:00",
  "date_from_url": "2023-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An SG reader reads Gab:</p><p><em>This comment is the written equivalent of watching someone get thrown off a roof onto concrete. You can almost hear the crunch.</em></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>MILO: </strong>For all the times I had to read “YOUR JUST JEALUOS” and sit baffled wondering what exactly I was supposed to be envying. It has been so immensely satisfying to see the same mediocre midwit screen names sulkily and silently reappear on Telegram trying to forget Jordan Peterson ever happened</p><p><strong>WILLIAM: </strong>I suspect it’s not so much that you cannot grasp the wisdom that Peterson brings to the table as it is being contrarian simply for the sake of eliciting a response. Perhaps not textbook trolling, but certainly in the same ballpark.</p><p><strong>SB:</strong> Imagine still falling for Peterson’s drug-induced prattle this far in.</p><p><strong>WILLIAM: </strong>So, I’ve got two “he’s a drug addict” and one “he’s a paid-for shill” responses. I’ve been reading Dostoevsky and Solzhenitsyn recently – one of which warned his people against what we’re entering into now, and the other who lived through it and fought back against it. Peterson frequently references them, and the way he talks demonstrates a deep understanding of the evil they were fighting against – something he is committed to fighting himself. So what’s the real problem? Is he just not snide and mean enough? Is it that he’s not telling you who to hate?</p><p><strong>SB: </strong>Wanda: To call you stupid would be an insult to stupid people. I’ve known sheep who could outwit you. I’ve worn dresses with higher IQs, but you think you’re an intellectual, don’t you, ape?</p><p>Otto: Apes don’t read philosophy.</p><p>Wanda: Yes they do, Otto, they just don’t understand it.</p><p>Congratulations – you’re Otto.</p><p>Go here https://voxday.net/?s=peterson and start reading – there are pages of posts dedicated to explaining to idiots like you why Peterson is an evil fraud.</p></blockquote><p>I just can’t imagine how she managed to get herself kicked off Elon’s bastion of free speech… again.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59869\" decoding=\"async\" fetchpriority=\"high\" height=\"548\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/10/image-25.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/10/image-25.png 512w, https://voxday.net/wp-content/uploads/2023/10/image-25-280x300.png 280w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/9c002660-76ed-4abe-9111-42ebb5f22457\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An SG reader reads Gab:\nThis comment is the written equivalent of watching someone get thrown off a roof onto concrete. You can almost hear the crunch.\nMILO:\nFor all the times I had to read “YOUR JUST JEALUOS” and sit baffled wondering what exactly I was supposed to be envying. It has been so immensely satisfying to see the same mediocre midwit screen names sulkily and silently reappear on Telegram trying to forget Jordan Peterson ever happened\nWILLIAM:\nI suspect it’s not so much that you cannot grasp the wisdom that Peterson brings to the table as it is being contrarian simply for the sake of eliciting a response. Perhaps not textbook trolling, but certainly in the same ballpark.\nSB:\nImagine still falling for Peterson’s drug-induced prattle this far in.\nWILLIAM:\nSo, I’ve got two “he’s a drug addict” and one “he’s a paid-for shill” responses. I’ve been reading Dostoevsky and Solzhenitsyn recently – one of which warned his people against what we’re entering into now, and the other who lived through it and fought back against it. Peterson frequently references them, and the way he talks demonstrates a deep understanding of the evil they were fighting against – something he is committed to fighting himself. So what’s the real problem? Is he just not snide and mean enough? Is it that he’s not telling you who to hate?\nSB:\nWanda: To call you stupid would be an insult to stupid people. I’ve known sheep who could outwit you. I’ve worn dresses with higher IQs, but you think you’re an intellectual, don’t you, ape?\nOtto: Apes don’t read philosophy.\nWanda: Yes they do, Otto, they just don’t understand it.\nCongratulations – you’re Otto.\nGo here https://voxday.net/?s=peterson and start reading – there are pages of posts dedicated to explaining to idiots like you why Peterson is an evil fraud.\nI just can’t imagine how she managed to get herself kicked off Elon’s bastion of free speech… again.\nDISCUSS ON SG",
  "tags": [
    "Jordanetics",
    "MPAI"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-10-11T14:18:28+00:00"
}