{
  "url": "https://voxday.net/2007/01/12/allliance-in-e-f-f-e-c/",
  "scraped_at": "2026-01-08T21:28:08.477496",
  "title": "The Allliance in E-F-F-E-C-T",
  "date_display": "January 12, 2007",
  "date_iso": "2007-01-12T08:24:00+00:00",
  "date_from_url": "2007-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Otherwise known as effect.  In the event that you feel the insensible desire to tickle your eardrums with my sweet, dulcet tones, <a href=\"http://www.fraterslibertas.com/\">the good Fraters</a> and company are determined to give you that just that chance on Saturday at noon Central.  And thanks to the blessings of technology given to us by Al Gore, you <a href=\"http://www.mainstreamnetwork.com/listen/player.asp?station=wwtc-am\">can listen live</a> even if you’re not within three blocks of Eagan.</p><p>We shall be discussing everything from the sartorial performance art of Steve Jobs and Bill Belichick, the pigskin prognosticating capabilities of Hugh Hewitt, the military mastery of Sam Tzu, the apocalyptic semiotics of Posh Spice’s move to Los Angeles to the probability of capturing live unicorns in Iraq.</p><p>Or something like that.  As for those of you who will undoubtedly be feeling the urge to remind me that I said I was swearing off radio about now, do settle down and remember that I pointedly excluded the Northern Alliance gang from that vow of radio silence.</p></div>",
  "content_text": "Otherwise known as effect.  In the event that you feel the insensible desire to tickle your eardrums with my sweet, dulcet tones,\nthe good Fraters\nand company are determined to give you that just that chance on Saturday at noon Central.  And thanks to the blessings of technology given to us by Al Gore, you\ncan listen live\neven if you’re not within three blocks of Eagan.\nWe shall be discussing everything from the sartorial performance art of Steve Jobs and Bill Belichick, the pigskin prognosticating capabilities of Hugh Hewitt, the military mastery of Sam Tzu, the apocalyptic semiotics of Posh Spice’s move to Los Angeles to the probability of capturing live unicorns in Iraq.\nOr something like that.  As for those of you who will undoubtedly be feeling the urge to remind me that I said I was swearing off radio about now, do settle down and remember that I pointedly excluded the Northern Alliance gang from that vow of radio silence.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-12T08:24:00+00:00"
}