{
  "url": "https://voxday.net/2007/01/21/book-review-jennifer-morgue/",
  "scraped_at": "2026-01-08T21:29:03.808212",
  "title": "Book review: The Jennifer Morgue",
  "date_display": "January 21, 2007",
  "date_iso": "2007-01-21T19:55:00+00:00",
  "date_from_url": "2007-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>THE JENNIFER MORGUE</b><br>Charles Stross<br>Rating: 7 of 10</br></br></p><p>Charles Stross is quite possibly at the forefront of the generation of science fiction and fantasy writers who are just now entering their literary prime.  His books are inventive, innovative and crammed full of ideas; even when his references are lost on the reader they are not wasted, as Stross effectively uses them to paint the scene for the less technical reader in much the same manner that Umberto Eco drops arcane Latin references to dazzles the insufficiently erudite.*   Even one who does not know TCP/IP from PCP or possesses too little technosavvy to fully grok the joke is still cheerfully allowed in on it so he can at least grin, if not guffaw.</p><p><em>The Jennifer Morgue</em> is the follow-up to the excellent <em>The Atrocity Archive</em>, which introduced Laundry agent Bob Howard, a oft-bewildered operative caught up in a secret aspect of the modern world that is a twisted concoction made up of equal parts Ian Fleming and H.P. Lovecraft, plus a strong dash of Scott Adams.  It’s definitely a worthy sequel, but despite making intriguingly effective use of one of Lovecraft’s most striking stories, I didn’t enjoy it quite as much as its predecessor.  This was almost surely due to the cocktail being two-parts Fleming and one-part Lovecraft this time, a reversal of the previous recipe.</p><p>As always, Stross sets a dizzying pace, hurling Haut Teknosprach and extreme squamousity at the reader with equal ease and enthusiasm.  As with an increasing number of Stross’s works, <i>The Jennifer Morgue</i> leaves one frowning at the last page, feeling rather deprived that there isn’t more.  The hardcover published by Golden Gryphon also includes a short story that is a not terribly interesting take on massive multiplayer games and a much more interesting essay entitled “The Golden Age of Spying”.</p><p>STYLE:  4 of 5</p><p>Somehow, one wouldn’t think that a book so heavily dependent on government bureaucracy for its humor would do anything but plod, but Stross arguably plods less than any writer active in the genre today.  He dashes from one event to the next, and is capable of turning the most mundane meeting of bureaucrats into an imaginative eruption of occultic violence.  So quickly does the book fly along that the division into chapters is almost irrelevant, the pace and the pounding are such that a radio edit of Ministry’s <em>Jesus Built My Hot Rod </em>springs insensibly to mind.  This is not to say the prose is sparse, far from it, but even the most heavily technical gobbledy-gook flies off the page, as if William Gibson not only knew how computers worked when he wrote Neuromancer, but also happened to be snorting methamphetamine while writing it.</p><p>STORY:  3 of 5</p><p>A extremely twisted variant on the evil Bond villain with a white cat attempting to take over the world, with more than a bit of Innsmouth and technological trappings thrown in.  Bob Howard has another field assignment, only this time it involves a trip to Germany, to say nothing of the tuxedo, the Walther PPK and the beautifully seductive foreign agent.  Although Stross doesn’t hold back on the blood or the rugoseness, it’s a rather lighter tale that smacks more of action-adventure than the action-horror of <em>The Atrocity Archive</em>.  But if the plot is more inventively complicated this time, it’s also a bit too dependent upon a joke that is, in my opinion, excessively foreshadowed.</p><p>CREATIVITY: 5 of 5</p><p>Mindbogglingly clever.  Stross’s ability to take esoteric material and weave it into an exciting, intricate story is simply unmatched.  His sly humor, no doubt honed to a razor’s edge by years of working in IT, pervades the book; who else could come up with such a perfect metaphor for the unspeakable evils of Microsoft Office.  It’s not so much the plot and its twists that are clever, although they most certainly are, but rather the metaphors and the masterful amalgamation of vastly disparate elements that cause the reader to shake his head and wonder at the author’s madly inventive mind.</p><p>CHARACTERS: 2 of 5</p><p>There are people.  They have feelings which are largely appropos to the situation.  But other than accurately portraying the insecure-around-girls technogeek (who nevertheless gets to nail the hot chix) and the soulless bureaucrats, this isn’t the author’s forte.  And that’s just fine, this book is about fun and cleverness, not the human condition.</p><p><b>TEXT SAMPLE:</b></p><p><i>When you go summoning extra-dimensional entities, there are certain precautions you should be sure to take.</i></p><p>For starters, you can forget garlic, bibles, and candles: they don’t work.  Instead, you need to start with serious electrical insulation to stop them from blowing your brain out your ears.  Once you’ve got yourself grounded you also need to pay attention to the existence of special optical high-bandwidth channels that demons may attempt to use to download themselves into your nervous system – they’re called “eyeballs”.  Timesharing your hypothalamus with alien brain-eaters is not recommended if you wish to live long enough to claim your index-linked, state-earnings-related pension; it’s about on a par with tap dancing on the London Underground’s third rail in terms of health and safety.  So you need to ensure you’re optically isolated as well. <b> Do not stare into laser cavity with remaining eye</b>, as the safety notice puts it.</p><p>Most demons are as dumb as a sack full of hammers.  This does not mean they’re safe to mess with, any more than a C++ compiler is “safe” in the hands of an enthusiastic computer science undergrad.  Some people can mess up anything and computational demonology adds a new and unwelcome meaning to terms like “memory leak” and “debugger”.</p><p>*<em>Otherwise known as everyone who isn’t Umberto Eco.</em></p></div>",
  "content_text": "THE JENNIFER MORGUE\nCharles Stross\nRating: 7 of 10\nCharles Stross is quite possibly at the forefront of the generation of science fiction and fantasy writers who are just now entering their literary prime.  His books are inventive, innovative and crammed full of ideas; even when his references are lost on the reader they are not wasted, as Stross effectively uses them to paint the scene for the less technical reader in much the same manner that Umberto Eco drops arcane Latin references to dazzles the insufficiently erudite.*   Even one who does not know TCP/IP from PCP or possesses too little technosavvy to fully grok the joke is still cheerfully allowed in on it so he can at least grin, if not guffaw.\nThe Jennifer Morgue\nis the follow-up to the excellent\nThe Atrocity Archive\n, which introduced Laundry agent Bob Howard, a oft-bewildered operative caught up in a secret aspect of the modern world that is a twisted concoction made up of equal parts Ian Fleming and H.P. Lovecraft, plus a strong dash of Scott Adams.  It’s definitely a worthy sequel, but despite making intriguingly effective use of one of Lovecraft’s most striking stories, I didn’t enjoy it quite as much as its predecessor.  This was almost surely due to the cocktail being two-parts Fleming and one-part Lovecraft this time, a reversal of the previous recipe.\nAs always, Stross sets a dizzying pace, hurling Haut Teknosprach and extreme squamousity at the reader with equal ease and enthusiasm.  As with an increasing number of Stross’s works,\nThe Jennifer Morgue\nleaves one frowning at the last page, feeling rather deprived that there isn’t more.  The hardcover published by Golden Gryphon also includes a short story that is a not terribly interesting take on massive multiplayer games and a much more interesting essay entitled “The Golden Age of Spying”.\nSTYLE:  4 of 5\nSomehow, one wouldn’t think that a book so heavily dependent on government bureaucracy for its humor would do anything but plod, but Stross arguably plods less than any writer active in the genre today.  He dashes from one event to the next, and is capable of turning the most mundane meeting of bureaucrats into an imaginative eruption of occultic violence.  So quickly does the book fly along that the division into chapters is almost irrelevant, the pace and the pounding are such that a radio edit of Ministry’s\nJesus Built My Hot Rod\nsprings insensibly to mind.  This is not to say the prose is sparse, far from it, but even the most heavily technical gobbledy-gook flies off the page, as if William Gibson not only knew how computers worked when he wrote Neuromancer, but also happened to be snorting methamphetamine while writing it.\nSTORY:  3 of 5\nA extremely twisted variant on the evil Bond villain with a white cat attempting to take over the world, with more than a bit of Innsmouth and technological trappings thrown in.  Bob Howard has another field assignment, only this time it involves a trip to Germany, to say nothing of the tuxedo, the Walther PPK and the beautifully seductive foreign agent.  Although Stross doesn’t hold back on the blood or the rugoseness, it’s a rather lighter tale that smacks more of action-adventure than the action-horror of\nThe Atrocity Archive\n.  But if the plot is more inventively complicated this time, it’s also a bit too dependent upon a joke that is, in my opinion, excessively foreshadowed.\nCREATIVITY: 5 of 5\nMindbogglingly clever.  Stross’s ability to take esoteric material and weave it into an exciting, intricate story is simply unmatched.  His sly humor, no doubt honed to a razor’s edge by years of working in IT, pervades the book; who else could come up with such a perfect metaphor for the unspeakable evils of Microsoft Office.  It’s not so much the plot and its twists that are clever, although they most certainly are, but rather the metaphors and the masterful amalgamation of vastly disparate elements that cause the reader to shake his head and wonder at the author’s madly inventive mind.\nCHARACTERS: 2 of 5\nThere are people.  They have feelings which are largely appropos to the situation.  But other than accurately portraying the insecure-around-girls technogeek (who nevertheless gets to nail the hot chix) and the soulless bureaucrats, this isn’t the author’s forte.  And that’s just fine, this book is about fun and cleverness, not the human condition.\nTEXT SAMPLE:\nWhen you go summoning extra-dimensional entities, there are certain precautions you should be sure to take.\nFor starters, you can forget garlic, bibles, and candles: they don’t work.  Instead, you need to start with serious electrical insulation to stop them from blowing your brain out your ears.  Once you’ve got yourself grounded you also need to pay attention to the existence of special optical high-bandwidth channels that demons may attempt to use to download themselves into your nervous system – they’re called “eyeballs”.  Timesharing your hypothalamus with alien brain-eaters is not recommended if you wish to live long enough to claim your index-linked, state-earnings-related pension; it’s about on a par with tap dancing on the London Underground’s third rail in terms of health and safety.  So you need to ensure you’re optically isolated as well.\nDo not stare into laser cavity with remaining eye\n, as the safety notice puts it.\nMost demons are as dumb as a sack full of hammers.  This does not mean they’re safe to mess with, any more than a C++ compiler is “safe” in the hands of an enthusiastic computer science undergrad.  Some people can mess up anything and computational demonology adds a new and unwelcome meaning to terms like “memory leak” and “debugger”.\n*\nOtherwise known as everyone who isn’t Umberto Eco.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-21T19:55:00+00:00"
}