{
  "url": "https://voxday.net/2007/01/04/cthulhu-weeps-as-he-sleeps/",
  "scraped_at": "2026-01-08T21:27:14.936087",
  "title": "Cthulhu weeps as he sleeps",
  "date_display": "January 4, 2007",
  "date_iso": "2007-01-04T09:04:00+00:00",
  "date_from_url": "2007-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amynda confirms my opinion that <a href=\"http://pandagon.net/2007/01/03/girl-logic-is-almost-as-feeble-as-sexist-logic/#more-4459\">feminism is a form of environmental retardation</a>:</p><blockquote><p>What “we’ve always done” is rape, for those who understandably don’t want to click over and read the whole post.</p></blockquote><p>Once can only assume that she doesn’t want her readers to click over and read the whole post, because if they did, those few capable of passing a fourth-grade reading comprehension test would immediately recognize that what “we’ve always done” is to carry guns, legally or otherwise.  The nice thing about Amynda is that one doesn’t have to wonder if she’s evil or stupid, as she regularly demonstrates her unique ability to combine the two into a single beautiful Platonian ideal of feminism.</p><p>Those who can’t understand why I enjoy reading her probably don’t grasp the deeper appeal of Maupassant when the syphilis kicked in either.</p><blockquote><p>it’s clear he wants my attention very badly….</p></blockquote><p>Well, naturally. <a href=\"http://acsprod.mccombs.utexas.edu/facstaff/display/results/display_record.asp?entity_uid=110691\">Who wouldn’t</a>?  She is as beautiful as she is brilliant.</p><p>The Coven did its part by contributing some amusing expositions on their haphazard relationship to reality and the English language:</p><blockquote><p>Oh, my God. I’d looked all over the internets for one of his books, even his own website didn’t sell them at the time. I think like maybe one of his fantasy books is in a library somewhere in central Ohio, but that’s as close as I’d ever been to one. People who claim to know say his stuff is laughably awful, and I’d love to take a peek at one myself.</p></blockquote><p>Apparently she didn’t looked very hard, or grasp that complicated “click on the cover” interface.  Or perhaps that complicated <a href=\"http://www.ereader.com/product/detail/15007\">eReader install</a> was simply too much:</p><p><em>“Um, Colin?  Is this computer a Windows or a Symbian?”</em><br>“It’s a Mac, Kyso.  A Macintosh.  Click on that one.”<br><em>Don’t you tell me what to do, Mr. Patriarchy!  Your Masculinist Techno-Oppression of Women won’t last forever, you know!”</em><br>“I’m sorry.  I am a worm.  I am evil.  Please throw rocks at me.”<br><em>You don’t deserve to have rocks thrown at you, you pathetic potential rapist!”  (clicks once)  “Um, I don’t think it worked, there’s this grey box now.”</em><br>“Okay, so click on Save to Disk… I mean, you can if you want….”<br><em>It’s my body and I’ll click if I want to!”</em></br></br></br></br></br></br></p><p>As for the quality of my fantasy novels, I’ll freely admit that the first one was rather weak, but I’ll happily match the second or the third against any of the novels nominated for the Nebula last year, except for <em>Jonathan Strange and Mr. Norrill</em> and <em>Going Postal</em>.  Better yet, compare them with any novel written by Nebula winner Catharine Asaro….  Regardless, the worst review from any professional secular reviewer was 3 out of 5, which hardly strikes me as “laughably awful”.</p><p>And after basing most of its criticism on my theology – which seemed a little odd given that it’s a fantasy novel, but whatever – Publisher’s Weekly wrote this about <em>The World in Shadow</em>: “an excellent job of capturing the rarefied world of high school, and both Christian and fallen teenagers are painted with some sympathy. His chapters are headed by epigraphs ranging from the Bible to rock music to blockbuster movies, which lend the book a hip edge. The novel’s driving tension is an evil plan to stage a Columbine-like massacre at the senior prom. Some of the best (and most disturbing) writing occurs in the sections that try to imagine the inner worlds of the killers….”</p><p>Unfortunately, there are very few reviews of my novels since most SFWA reviewers are openly prejudiced against anything with a religious flavor.  I have exchanged email with several well-known fantasy and science fiction reviewers in the past and was informed that they simply won’t read anything that they consider to have Christian content.  That’s their right, of course, but it’s simply false to assert that the reviews are negative.</p><blockquote><p>So, he writes shitty sci-fi and thinks that women are inherently unable to write sci-fi. This could explain much.</p></blockquote><p>No, he writes mediocre FANTASY, thank you very much indeed, and thinks the reason that women ALMOST NEVER write HARD science fiction, (which is really not up for debate as this dearth is an occasional topic of discussion in the SFWA), is because they are extremely disinclined to specialize in the hard sciences.  Even when they major and obtain advanced degrees in them, they seldom maintain their interest in the field for long.</p><p>For example, when John Scalzi and I were arguing about this topic on the Tor editors’ blog, Electrolite, he cited one female professor’s Astrophysics major as evidence of her interest in the hard sciences… but that professor is now teaching Queer theory in Indian film.  (Seriously, I’m not joking.)  That Astrophysics major no more makes her a hard scientist than my East Asian Studies major makes me Japanese.  In short, my opinion is that the potential pool of women capable of writing hard science fiction is too small to produce the critical mass required, and as Catharine Asaro demonstrates, even those who can do it would rather write romance novels.  Or, as is more likely these days, vampire and were-seal porn.</p><p>Zuzu from Feministe demonstrates her acumen with the language.</p><blockquote><p>So how’s Vox’s daddy doing in prison?</p></blockquote><p>Dad’s not in prison, which was sort of the point of those newspaper headlines last summer.  Of course, one really can’t expect a feminist to be able to distinguish between “fugitive” and “felon”.  Nouns are hard!</p><p>Marcy, on the other hand, has trouble with adjectives:</p><blockquote><p>He’s a Christian Libertarian? How do you work that? I thought Ayn Rand was an atheist.</p></blockquote><p>In the English language, the adjective preceding the noun is there to MODIFY it.  In this case, “Christian” modifies the noun “Libertarian” in much the same way that “Social” and “Christian” are both used to modify “Democrat” and therefore distinguish the SDP from the CDU.  Furthermore, Ayn Rand defined Objectivism, not libertarianism.</p><p>In practice, this means that I am a firm libertarian on most matters, but anti-abortion.  I am also anti-open immigration, but that is solely on utilitarian grounds.</p></div>",
  "content_text": "Amynda confirms my opinion that\nfeminism is a form of environmental retardation\n:\nWhat “we’ve always done” is rape, for those who understandably don’t want to click over and read the whole post.\nOnce can only assume that she doesn’t want her readers to click over and read the whole post, because if they did, those few capable of passing a fourth-grade reading comprehension test would immediately recognize that what “we’ve always done” is to carry guns, legally or otherwise.  The nice thing about Amynda is that one doesn’t have to wonder if she’s evil or stupid, as she regularly demonstrates her unique ability to combine the two into a single beautiful Platonian ideal of feminism.\nThose who can’t understand why I enjoy reading her probably don’t grasp the deeper appeal of Maupassant when the syphilis kicked in either.\nit’s clear he wants my attention very badly….\nWell, naturally.\nWho wouldn’t\n?  She is as beautiful as she is brilliant.\nThe Coven did its part by contributing some amusing expositions on their haphazard relationship to reality and the English language:\nOh, my God. I’d looked all over the internets for one of his books, even his own website didn’t sell them at the time. I think like maybe one of his fantasy books is in a library somewhere in central Ohio, but that’s as close as I’d ever been to one. People who claim to know say his stuff is laughably awful, and I’d love to take a peek at one myself.\nApparently she didn’t looked very hard, or grasp that complicated “click on the cover” interface.  Or perhaps that complicated\neReader install\nwas simply too much:\n“Um, Colin?  Is this computer a Windows or a Symbian?”\n“It’s a Mac, Kyso.  A Macintosh.  Click on that one.”\nDon’t you tell me what to do, Mr. Patriarchy!  Your Masculinist Techno-Oppression of Women won’t last forever, you know!”\n“I’m sorry.  I am a worm.  I am evil.  Please throw rocks at me.”\nYou don’t deserve to have rocks thrown at you, you pathetic potential rapist!”  (clicks once)  “Um, I don’t think it worked, there’s this grey box now.”\n“Okay, so click on Save to Disk… I mean, you can if you want….”\nIt’s my body and I’ll click if I want to!”\nAs for the quality of my fantasy novels, I’ll freely admit that the first one was rather weak, but I’ll happily match the second or the third against any of the novels nominated for the Nebula last year, except for\nJonathan Strange and Mr. Norrill\nand\nGoing Postal\n.  Better yet, compare them with any novel written by Nebula winner Catharine Asaro….  Regardless, the worst review from any professional secular reviewer was 3 out of 5, which hardly strikes me as “laughably awful”.\nAnd after basing most of its criticism on my theology – which seemed a little odd given that it’s a fantasy novel, but whatever – Publisher’s Weekly wrote this about\nThe World in Shadow\n: “an excellent job of capturing the rarefied world of high school, and both Christian and fallen teenagers are painted with some sympathy. His chapters are headed by epigraphs ranging from the Bible to rock music to blockbuster movies, which lend the book a hip edge. The novel’s driving tension is an evil plan to stage a Columbine-like massacre at the senior prom. Some of the best (and most disturbing) writing occurs in the sections that try to imagine the inner worlds of the killers….”\nUnfortunately, there are very few reviews of my novels since most SFWA reviewers are openly prejudiced against anything with a religious flavor.  I have exchanged email with several well-known fantasy and science fiction reviewers in the past and was informed that they simply won’t read anything that they consider to have Christian content.  That’s their right, of course, but it’s simply false to assert that the reviews are negative.\nSo, he writes shitty sci-fi and thinks that women are inherently unable to write sci-fi. This could explain much.\nNo, he writes mediocre FANTASY, thank you very much indeed, and thinks the reason that women ALMOST NEVER write HARD science fiction, (which is really not up for debate as this dearth is an occasional topic of discussion in the SFWA), is because they are extremely disinclined to specialize in the hard sciences.  Even when they major and obtain advanced degrees in them, they seldom maintain their interest in the field for long.\nFor example, when John Scalzi and I were arguing about this topic on the Tor editors’ blog, Electrolite, he cited one female professor’s Astrophysics major as evidence of her interest in the hard sciences… but that professor is now teaching Queer theory in Indian film.  (Seriously, I’m not joking.)  That Astrophysics major no more makes her a hard scientist than my East Asian Studies major makes me Japanese.  In short, my opinion is that the potential pool of women capable of writing hard science fiction is too small to produce the critical mass required, and as Catharine Asaro demonstrates, even those who can do it would rather write romance novels.  Or, as is more likely these days, vampire and were-seal porn.\nZuzu from Feministe demonstrates her acumen with the language.\nSo how’s Vox’s daddy doing in prison?\nDad’s not in prison, which was sort of the point of those newspaper headlines last summer.  Of course, one really can’t expect a feminist to be able to distinguish between “fugitive” and “felon”.  Nouns are hard!\nMarcy, on the other hand, has trouble with adjectives:\nHe’s a Christian Libertarian? How do you work that? I thought Ayn Rand was an atheist.\nIn the English language, the adjective preceding the noun is there to MODIFY it.  In this case, “Christian” modifies the noun “Libertarian” in much the same way that “Social” and “Christian” are both used to modify “Democrat” and therefore distinguish the SDP from the CDU.  Furthermore, Ayn Rand defined Objectivism, not libertarianism.\nIn practice, this means that I am a firm libertarian on most matters, but anti-abortion.  I am also anti-open immigration, but that is solely on utilitarian grounds.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-04T09:04:00+00:00"
}