{
  "url": "https://voxday.net/2007/01/25/dilbert-in-prison-showers/",
  "scraped_at": "2026-01-08T21:29:24.287193",
  "title": "Dilbert in the prison showers",
  "date_display": "January 25, 2007",
  "date_iso": "2007-01-25T08:58:00+00:00",
  "date_from_url": "2007-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Adams <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2007/01/atheists_in_jai.html\">dips his toe</a> into the swamp of moral superiority claims:</p><blockquote><p>Have you ever wondered what percentage of prison inmates are atheists? It must be a lot, given that non-believers have no moral center and spend most of their days robbing, and killing, and sodomizing farm animals. That’s what you do when you have no morality.</p><p>According to Adherents.com, 16% of the world’s 6.25 billion people are non-religious. That includes atheists, agnostics, and secular humanists. That’s just over 1 billion godless (and Budahless) infidels.</p><p>According to <a href=\"http://www.homeoffice.gov.uk/rds/pdfs2/r188.pdf\">this</a>, there are 8.75 million people in jail in the entire world. And that includes people who haven’t been convicted. Hmm. That seems too low by about, um, a billion infidels that should be behind bars….</p><p>In other words, only 8 million of the 1 BILLION non-believers who damned well SHOULD be in prison are actually there. There is only one conclusion that I can draw from this rigorous scientific analysis: Atheists are lazy.</p></blockquote><p>Skipping over the obvious answer to this tongue-in-cheek version of a common defense of atheism – moral inertia causes non-believers to behave similarly to believers for a generation or three – there are a few ways we can test this assertion of superior atheist behavior by traditional moral standards.</p><p>1.  There should be a lower percentage of atheists in jail than in the population.<br>2.  Those imprisoned who participate in prison ministries should have a higher rate of recidivism.<br>3.  Crime rates should decline as religious belief declines.</br></br></p><p>I’ve already dealt with the first topic, as the English survey showed that atheists/agnostics were overrepresented in English prisons by 105.8 percent.  In other words, atheist Englishmen were more than twice as likely to be convicted criminals as the average Englishman.  Amusingly enough, this is roughly the same ratio that Adams himself suggests, as he cites 16 percent of the population being non-religious compared to 33 percent of his hypothetical jail population being non-religious.  As a defense of atheism, it’s certainly an original one, if perhaps sub-optimal.</p><p>Second, a 1990 study on the effectiveness of prison ministries concluded the following: <em>The group’s study involved 190 prisoners who between 1975 and 1979 had taken part in Christian discipleship training, and a similar number who had not, matched by age, race, gender and other factors. Both groups had been released from prison eight to 14 years prior to the study.</em></p><p>It found that the religion-trained ones had an 11 percentage point lower recidivism rate than the control group. Forty percent of the religion-schooled group committed new offenses, while 51 percent of the others did so.  The religiously trained group also had a longer crime-free period following release, and when they did commit new crimes, the crimes were less severe compared to past offenses. The control group had increased crime-severity.</p><p>Strike two.</p><p>As for the third factor, consider France, which was found to be the most atheist country in Europe, with 33 percent of those polled declaring that they did not believe in any sort of spirit, God, or life force.  France also has the fastest rising crime rate in Europe, 16 percent compared to the EU average of 4 percent, (International Review of Crime Statistics) and also led the EU with the greatest increase in violent crime (50% from 1997 to 2001 compared to an EU average of 22 percent.)</p><p>Personally, I suspect this increasing crime rate in France is far more likely to be the result of a surfeit of young Muslims in the inner cities, but that’s a matter for another day.  The point is that not only is there no evidence to suggest that atheists are better behaved than the average individual, but there is a plethora of evidence suggesting that they are demonstrably more likely to behave badly by both traditional moral and legal measures.</p><p>If we accept the concepts, for which there is some evidence, that a) atheists are smarter and better-educated, and b) smarter and better-educated people are less likely to be in prison, then atheism must be a truly negative force indeed if it is powerful enough to overcome a pair of powerful positive correlations as evidenced by the disproportionate number of atheists in prison.</p></div>",
  "content_text": "Scott Adams\ndips his toe\ninto the swamp of moral superiority claims:\nHave you ever wondered what percentage of prison inmates are atheists? It must be a lot, given that non-believers have no moral center and spend most of their days robbing, and killing, and sodomizing farm animals. That’s what you do when you have no morality.\nAccording to Adherents.com, 16% of the world’s 6.25 billion people are non-religious. That includes atheists, agnostics, and secular humanists. That’s just over 1 billion godless (and Budahless) infidels.\nAccording to\nthis\n, there are 8.75 million people in jail in the entire world. And that includes people who haven’t been convicted. Hmm. That seems too low by about, um, a billion infidels that should be behind bars….\nIn other words, only 8 million of the 1 BILLION non-believers who damned well SHOULD be in prison are actually there. There is only one conclusion that I can draw from this rigorous scientific analysis: Atheists are lazy.\nSkipping over the obvious answer to this tongue-in-cheek version of a common defense of atheism – moral inertia causes non-believers to behave similarly to believers for a generation or three – there are a few ways we can test this assertion of superior atheist behavior by traditional moral standards.\n1.  There should be a lower percentage of atheists in jail than in the population.\n2.  Those imprisoned who participate in prison ministries should have a higher rate of recidivism.\n3.  Crime rates should decline as religious belief declines.\nI’ve already dealt with the first topic, as the English survey showed that atheists/agnostics were overrepresented in English prisons by 105.8 percent.  In other words, atheist Englishmen were more than twice as likely to be convicted criminals as the average Englishman.  Amusingly enough, this is roughly the same ratio that Adams himself suggests, as he cites 16 percent of the population being non-religious compared to 33 percent of his hypothetical jail population being non-religious.  As a defense of atheism, it’s certainly an original one, if perhaps sub-optimal.\nSecond, a 1990 study on the effectiveness of prison ministries concluded the following:\nThe group’s study involved 190 prisoners who between 1975 and 1979 had taken part in Christian discipleship training, and a similar number who had not, matched by age, race, gender and other factors. Both groups had been released from prison eight to 14 years prior to the study.\nIt found that the religion-trained ones had an 11 percentage point lower recidivism rate than the control group. Forty percent of the religion-schooled group committed new offenses, while 51 percent of the others did so.  The religiously trained group also had a longer crime-free period following release, and when they did commit new crimes, the crimes were less severe compared to past offenses. The control group had increased crime-severity.\nStrike two.\nAs for the third factor, consider France, which was found to be the most atheist country in Europe, with 33 percent of those polled declaring that they did not believe in any sort of spirit, God, or life force.  France also has the fastest rising crime rate in Europe, 16 percent compared to the EU average of 4 percent, (International Review of Crime Statistics) and also led the EU with the greatest increase in violent crime (50% from 1997 to 2001 compared to an EU average of 22 percent.)\nPersonally, I suspect this increasing crime rate in France is far more likely to be the result of a surfeit of young Muslims in the inner cities, but that’s a matter for another day.  The point is that not only is there no evidence to suggest that atheists are better behaved than the average individual, but there is a plethora of evidence suggesting that they are demonstrably more likely to behave badly by both traditional moral and legal measures.\nIf we accept the concepts, for which there is some evidence, that a) atheists are smarter and better-educated, and b) smarter and better-educated people are less likely to be in prison, then atheism must be a truly negative force indeed if it is powerful enough to overcome a pair of powerful positive correlations as evidenced by the disproportionate number of atheists in prison.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-25T08:58:00+00:00"
}