{
  "url": "https://voxday.net/2007/01/09/it-is-good-to-hate-frenc/",
  "scraped_at": "2026-01-08T21:27:50.152489",
  "title": "It is good to hate the French",
  "date_display": "January 9, 2007",
  "date_iso": "2007-01-09T12:58:00+00:00",
  "date_from_url": "2007-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet <a href=\"http://www.timesonline.co.uk/article/0,,2099-2527428,00.html\">another reason</a>:</p><blockquote><p>My latest book, American Vertigo, is an account of a journey I took through the US. I wrote it because I thought that for a European intellectual there was nothing more important than to understand what was happening in America, to go and tell the Americans what was wrong with their society.</p></blockquote><p>This is the sort of “intellectual” whose ass I’d like to kick, then explain to him that the ass-kicking was actually a metaphorical piece of performance art intended to raise consciousness about the suppression of the French language by the global English hegemony and that anyone who is not honored to have played a vital role in such an important, revolutionary speaking of truth to power must be a complete Philistine.</p><p>Of course, he isn’t actually wrong.  There is nothing more important than for a French intellectual than to take a vacation in America, albeit <em>because there isn’t anything of any significance whatsoever that actually requires the participation of French intellectuals.</em> Regardless, few things give me more pleasure than being handed the opportunity to go through the following exchange:</p><p>French guy pontificating: “Americans, of course, only speak English.  Did you know that only one in ten billion Americans even have a passport?”</p><p>VD:  “Actually I speak Italian.  And German.”</p><p>French guy: “Really?  But you don’t speak French?”</p><p>VD:  “Why on Earth would I want to do that?  Hey look!  A snail!”</p></div>",
  "content_text": "Yet\nanother reason\n:\nMy latest book, American Vertigo, is an account of a journey I took through the US. I wrote it because I thought that for a European intellectual there was nothing more important than to understand what was happening in America, to go and tell the Americans what was wrong with their society.\nThis is the sort of “intellectual” whose ass I’d like to kick, then explain to him that the ass-kicking was actually a metaphorical piece of performance art intended to raise consciousness about the suppression of the French language by the global English hegemony and that anyone who is not honored to have played a vital role in such an important, revolutionary speaking of truth to power must be a complete Philistine.\nOf course, he isn’t actually wrong.  There is nothing more important than for a French intellectual than to take a vacation in America, albeit\nbecause there isn’t anything of any significance whatsoever that actually requires the participation of French intellectuals.\nRegardless, few things give me more pleasure than being handed the opportunity to go through the following exchange:\nFrench guy pontificating: “Americans, of course, only speak English.  Did you know that only one in ten billion Americans even have a passport?”\nVD:  “Actually I speak Italian.  And German.”\nFrench guy: “Really?  But you don’t speak French?”\nVD:  “Why on Earth would I want to do that?  Hey look!  A snail!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-09T12:58:00+00:00"
}