{
  "url": "https://voxday.net/2007/01/04/like-alcohol-and-cars/",
  "scraped_at": "2026-01-08T21:27:22.245412",
  "title": "Like alcohol and cars",
  "date_display": "January 4, 2007",
  "date_iso": "2007-01-04T17:55:00+00:00",
  "date_from_url": "2007-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Girls and logic don’t mix so well.  In fact, based on my personal experience, you’re more likely <a href=\"http://firelion.livejournal.com/460611.html\">to see a crash</a> when you mix the latter:</p><blockquote><p><em>She explicitly illustrates a problem I’ve noticed with women who resent the way the world works: they confuse consequence with punishment.</em></p><p>Reminder here, the “consequence” in question is being raped. It’s a “consequence” of being a woman and getting drunk in a bar. And that’s just the way the world works, so lie back and try to enjoy it, sweetie. Rejecting that in any way is just a foot-stomping girl-tantrum because you just don’t comprehend reality.</p></blockquote><p>Does Spinner actually deny that getting raped is a possible consequence of being a woman and getting drunk in a bar?  That wouldn’t leave her the chance to get outraged and pose, so presumably not.  But if so, she need merely let us know and we can consider that argument… it won’t be a long one.</p><p>If she admits that it is a possible consequence, that a woman is more likely to get raped under those circumstances than a woman who gets drunk at home or stays sober in a bar, then there’s really not much to discuss.  Spinner can’t reasonably complain about the increased probability any more than the girl who gets drunk and drives her car can complain about the increased probability of denting her fender.</p><p>The fact is that some men do rape.  It is an incontravertible fact.  There will always be individuals who will rape, lie, cheat, steal and kill.  This is the planet Earth, not Happy-happy Unicorn Land, and it’s a far more vicious place than these maleducated intellectual virgins, whose childish little minds have never been soiled with a rational thought, will ever realize until they actually leave their little suburban world for ten minutes and experience what the rest of the world is like.</p><p>Oh, they’ve had their perilous near-rape experiences with a boy wearing Abercrombie &amp; Fitch who drank too many Coors Lights and <em>came this close</em> to touching them, you know, <em>there</em>, but they’ve never spoken with a Laotian refugee who lost half his family to utopian idealists building a better world.  They don’t know any Russian strippers who whored themselves in order to escape the post-mortem paroxysms of the Soviet Union’s demise, because it paid so much better than their nursing degrees.  They don’t even drive down Martin Luther King Jr. Boulevard, for that matter.</p><p>Ask those strippers how much an education matters when the utopian idealists finally get their chance to run things.</p><p>The choice is not between rejecting reality and lying back and relaxing, it’s about taking responsibility for your own life, for your own actions and your own decisions or refusing to accept it.  No one is saying you can’t play with fire, do what you want, it’s up to you.  But don’t expect a whole lot of sympathy when you get burned either.</p><p>Life is all about probability.  All you can do is improve your odds or worsen them.  Which option you choose is up to you.</p></div>",
  "content_text": "Girls and logic don’t mix so well.  In fact, based on my personal experience, you’re more likely\nto see a crash\nwhen you mix the latter:\nShe explicitly illustrates a problem I’ve noticed with women who resent the way the world works: they confuse consequence with punishment.\nReminder here, the “consequence” in question is being raped. It’s a “consequence” of being a woman and getting drunk in a bar. And that’s just the way the world works, so lie back and try to enjoy it, sweetie. Rejecting that in any way is just a foot-stomping girl-tantrum because you just don’t comprehend reality.\nDoes Spinner actually deny that getting raped is a possible consequence of being a woman and getting drunk in a bar?  That wouldn’t leave her the chance to get outraged and pose, so presumably not.  But if so, she need merely let us know and we can consider that argument… it won’t be a long one.\nIf she admits that it is a possible consequence, that a woman is more likely to get raped under those circumstances than a woman who gets drunk at home or stays sober in a bar, then there’s really not much to discuss.  Spinner can’t reasonably complain about the increased probability any more than the girl who gets drunk and drives her car can complain about the increased probability of denting her fender.\nThe fact is that some men do rape.  It is an incontravertible fact.  There will always be individuals who will rape, lie, cheat, steal and kill.  This is the planet Earth, not Happy-happy Unicorn Land, and it’s a far more vicious place than these maleducated intellectual virgins, whose childish little minds have never been soiled with a rational thought, will ever realize until they actually leave their little suburban world for ten minutes and experience what the rest of the world is like.\nOh, they’ve had their perilous near-rape experiences with a boy wearing Abercrombie & Fitch who drank too many Coors Lights and\ncame this close\nto touching them, you know,\nthere\n, but they’ve never spoken with a Laotian refugee who lost half his family to utopian idealists building a better world.  They don’t know any Russian strippers who whored themselves in order to escape the post-mortem paroxysms of the Soviet Union’s demise, because it paid so much better than their nursing degrees.  They don’t even drive down Martin Luther King Jr. Boulevard, for that matter.\nAsk those strippers how much an education matters when the utopian idealists finally get their chance to run things.\nThe choice is not between rejecting reality and lying back and relaxing, it’s about taking responsibility for your own life, for your own actions and your own decisions or refusing to accept it.  No one is saying you can’t play with fire, do what you want, it’s up to you.  But don’t expect a whole lot of sympathy when you get burned either.\nLife is all about probability.  All you can do is improve your odds or worsen them.  Which option you choose is up to you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-04T17:55:00+00:00"
}