{
  "url": "https://voxday.net/2007/01/16/mailvox-how-is-she-still-single/",
  "scraped_at": "2026-01-08T21:28:37.858580",
  "title": "Mailvox: How is she still single?",
  "date_display": "January 16, 2007",
  "date_iso": "2007-01-16T09:35:00+00:00",
  "date_from_url": "2007-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JC emailed me <a href=\"http://blog.myspace.com/index.cfm?fuseaction=blog.view&amp;friendID=147579906&amp;blogID=217750789&amp;MyToken=78ccd762-35e9-4582-a4fb-3d9692458210\">this MySpace blog post</a>.  I’m sure all the married guys will be lamenting that they’re not in a position to pursue this angel descended to Earth… as if they could ever deserve her!</p><blockquote><p>This should weed out who are losers and who are friends. In a man this is what I need.</p><p>1- You should own your own home by the age of 30. No excuses. I don’t care if your exwife took you. You should have been man enough to be financially stable enough to at least walk away with something. I am too old to be starting fresh financially and I do have a lifestyle to maintain. I was married to a very wealthy man before and I dont intend to take a step bckward.</p><p>2- You should make more money than me. I will not be there to support your lifestyle at all. I am working because I need something to do during the day but I dont want to continue to do it fulltime. If you don’t make enough to both have a very nice house and new cars and buy me the nice things I deserve plus an allowance you are just not grown up enough to have me. I wont lie. I am high maintainance. Deal with it or dont ask me out.</p><p>3- You should understand that as a woman you must earn me. This is both financial but emotional. My hormones change every day and until you are a woman and can understand that deal with it. yes I am fickle and subject to change my mind. Its a womans peroggotive. If you cant deal with my mood swings move along. You should be there for me no matter how cranky I am.</p><p>4- I do cook when I am in the mood but I don’t clean. I am not a maid. If you like your place clean you should make enough to hire a cleaning service because i should be worth more than that to you and you shouldnt expect that of me. You cant expect me to cook for you regularly either. I do have a job and a life. I cook when I want to not when you want me to.</p><p>5- Child care. I love my kids but I am not a nanny. I mostly work because I cant stand being around kids all day. I need my me time to get away. I need weekends away on a regular basis so you should be able to afford that. I am open to having more kids but if I go through the pain and suffering to have the kid you should do the sleepless nights thing or hire a nanny and if your kids are whiny brats than let their mom keep them. I dont have time or energy to fix your kids.</p><p>6- Staying in shape. You must have nice abs. If I had a mans metabolism I would. If I didn’t have kids I would. You have no excuse. I am sorry but I am just not attracted to guys who dont take care of themselves.</p><p>I am sorry this rant but come on guys grow up and get with it. If you fit the bill email me and let me know. If you dont them delete me from your friends and dont email me anymore. Sorry but this is the way it is and better to get it out of the way now than to spend all sorts of time dating before we figure these things out about each other.</p></blockquote><p>On the one hand, at least she’s honest.  One has to give her full credit for that.  On the other… well, let’s just say it’s not a massive surprise that her “very wealthy” ex-husband found it within himself to make the selfless sacrifice required to let her spread her wings and fly.  I particularly liked the “you have no excuse, but I do” mentality.  Ye cats!</p><p>Speaking of which, the part I found interesting about <a href=\"http://www.telegraph.co.uk/portal/main.jhtml;jsessionid=M3RHM1N5CQW5HQFIQMGCFGGAVCBQUIV0?xml=/portal/2007/01/16/ftwives116.xml\">this English article on toxic wives</a> is that the pattern involves a start as an educated, high-flying career girl.  In such cases, the job is merely the ticket for entry into the happy hunting grounds.  Don’t ever trust a woman who says she wants to stay home with the kids but doesn’t exhibit any signs of actually wanting to be around them.</p><p>I disagree, of course, that the solution is to “marry an equal” and split the bills.  One would do far better to look for a young woman whose chief ambition is to be a wife and mother, not a useless layabout, such women often work as nannies, unsurprisingly, and they’re often very attractive too.</p><p>It worked for Tiger Woods and me, anyhow.</p></div>",
  "content_text": "JC emailed me\nthis MySpace blog post\n.  I’m sure all the married guys will be lamenting that they’re not in a position to pursue this angel descended to Earth… as if they could ever deserve her!\nThis should weed out who are losers and who are friends. In a man this is what I need.\n1- You should own your own home by the age of 30. No excuses. I don’t care if your exwife took you. You should have been man enough to be financially stable enough to at least walk away with something. I am too old to be starting fresh financially and I do have a lifestyle to maintain. I was married to a very wealthy man before and I dont intend to take a step bckward.\n2- You should make more money than me. I will not be there to support your lifestyle at all. I am working because I need something to do during the day but I dont want to continue to do it fulltime. If you don’t make enough to both have a very nice house and new cars and buy me the nice things I deserve plus an allowance you are just not grown up enough to have me. I wont lie. I am high maintainance. Deal with it or dont ask me out.\n3- You should understand that as a woman you must earn me. This is both financial but emotional. My hormones change every day and until you are a woman and can understand that deal with it. yes I am fickle and subject to change my mind. Its a womans peroggotive. If you cant deal with my mood swings move along. You should be there for me no matter how cranky I am.\n4- I do cook when I am in the mood but I don’t clean. I am not a maid. If you like your place clean you should make enough to hire a cleaning service because i should be worth more than that to you and you shouldnt expect that of me. You cant expect me to cook for you regularly either. I do have a job and a life. I cook when I want to not when you want me to.\n5- Child care. I love my kids but I am not a nanny. I mostly work because I cant stand being around kids all day. I need my me time to get away. I need weekends away on a regular basis so you should be able to afford that. I am open to having more kids but if I go through the pain and suffering to have the kid you should do the sleepless nights thing or hire a nanny and if your kids are whiny brats than let their mom keep them. I dont have time or energy to fix your kids.\n6- Staying in shape. You must have nice abs. If I had a mans metabolism I would. If I didn’t have kids I would. You have no excuse. I am sorry but I am just not attracted to guys who dont take care of themselves.\nI am sorry this rant but come on guys grow up and get with it. If you fit the bill email me and let me know. If you dont them delete me from your friends and dont email me anymore. Sorry but this is the way it is and better to get it out of the way now than to spend all sorts of time dating before we figure these things out about each other.\nOn the one hand, at least she’s honest.  One has to give her full credit for that.  On the other… well, let’s just say it’s not a massive surprise that her “very wealthy” ex-husband found it within himself to make the selfless sacrifice required to let her spread her wings and fly.  I particularly liked the “you have no excuse, but I do” mentality.  Ye cats!\nSpeaking of which, the part I found interesting about\nthis English article on toxic wives\nis that the pattern involves a start as an educated, high-flying career girl.  In such cases, the job is merely the ticket for entry into the happy hunting grounds.  Don’t ever trust a woman who says she wants to stay home with the kids but doesn’t exhibit any signs of actually wanting to be around them.\nI disagree, of course, that the solution is to “marry an equal” and split the bills.  One would do far better to look for a young woman whose chief ambition is to be a wife and mother, not a useless layabout, such women often work as nannies, unsurprisingly, and they’re often very attractive too.\nIt worked for Tiger Woods and me, anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-16T09:35:00+00:00"
}