{
  "url": "https://voxday.net/2007/01/21/nfl-today/",
  "scraped_at": "2026-01-08T21:29:01.934326",
  "title": "NFL Today",
  "date_display": "January 21, 2007",
  "date_iso": "2007-01-21T13:29:00+00:00",
  "date_from_url": "2007-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the NFC championship, I have to go with the Saints.  It makes me uncomfortable, going with the crowd and the fairy tale, but it’s the logical thing to do.  Home field and weather go to the Bears, there’s no obvious coaching edge although my suspicions tend to favor Payton over Smith, and while the seasonal DVOA don’t strongly favor the Saints offense over the Bears defense or the Bears offense over the Saints defense, the Bears appear to be declining on both sides of the ball.</p><p>The one thing that makes me very nervous about this pick is the special teams.  They are the X-factor here, and if the Bears pull out a win, I’d expect it to be consistent special teams superiority giving the Bears field advantage plus a big play or two making the difference.  But the Saints beat a very solid Eagles team last weekend, while the Bears needed OT to beat a very mediocre Seattle squad.  It’s that, plus the combination of Brees’ superiority over Grossman, that makes me go with New Orleans.</p><p>On the AFC side, I have to commend the Baseball Savant* for his good fortune, if not his acumen.  I don’t think Indianapolis deserved to win either the Kansas City or the Baltimore game, but they did.  Still, I think the Colts have ridden their horseshoe luck as far as it will take them and that Belichick’s coaching superiority will prove the difference.</p><p>The Patriots are at a disadvantage, but a smaller one than they faced last week against San Diego.  The Colts’ offense is marginally better than the Chargers’, (1 to 2) but their defense is worse and their special teams are much, much worse. (27 and 26 to 14 and 3).  And to those people who ask, sarcastically, if it was Belichick’s coaching that made the difference in Troy Brown stripping Marlon McCree of the ball after McCree’s interception, I answer: no, but the coaching delta certainly did.</p><p>A Patriots player won’t make that mistake, not so much because he’s coached not to, but because he’s <em>selected</em> not to.  McCree knew perfectly well what the situation was, and as he said after the game, he’d do it again because he was “trying to make a touchdown”. <em>ON FOURTH DOWN IN THE FOURTH FREAKING QUARTER!  OF A DIVISIONAL ROUND PLAYOFF GAME!</em> If you sign and play me-first players who are perfectly willing to risk the conference championship over a chance to be a star, that’s on the GM and it’s on the coach as well.  Bad things will happen, and at the worst possible time.</p><p>And it’s <s>Peyton Manning</s> not as if the Colts <s>Dwight Freeney</s> have any players who are known more for flashy stats than <s>Marvin Harrison</s> a commitment to winning as a team, right?</p><p>I think the Patriots will win without giving Vinatieri a chance to do unto them as he has hitherto done unto others.  But it sure would be nice to see the Sports Guy’s Ultimate Betrayal scenario play out.</p><p>Regardless, enjoy the games… it’s going to be a long spring and summer without so much as a World Cup to fill the void.</p><p>*<em>The difference between the Baseball Savant and me is this: he’s 6-2 in the playoffs <a href=\"http://baseballsavant.blogspot.com/2007/01/indianapolis-colts-felix-hernandez.html\">and proud of it</a>, I’m 6-2 and irritated… but then, that’s why they call him the BASEBALL Savant.</em></p><p>PS – by the way, if you’re one of those football writers who has been moaning all week about another Patriots-Colts playoff game, then go kill yourself.  Seriously.  Or at least go and find another job doing something you’re actually interested in.  If you’re truly not interested in the AFC Championship today, then you’re not a football fan.  Not a serious one, not a casual one, whatever it is you might happen to be, you’re absolutely nothing where the sport is concerned and you have absolutely nothing to say about it.</p><p>PPS – What is going on in Pittsburgh?  From the Pittsburgh Tribune-Review:</p><p><em>Russ Grimm has been offered and has accepted the Steelers’ head coaching position, a source in Pittsburgh confirmed late Saturday.  Grimm, 47, succeeds Bill Cowher, who coached the Steelers for 15 seasons before resigning Jan. 5. The hiring of Grimm will be announced Monday at a news conference.</em></p><p>ESPN and SI.com, Sports Illustrated’s Web site, reported yesterday that Minnesota Vikings defensive coordinator Mike Tomlin had been chosen to replace Cowher. </p></div>",
  "content_text": "In the NFC championship, I have to go with the Saints.  It makes me uncomfortable, going with the crowd and the fairy tale, but it’s the logical thing to do.  Home field and weather go to the Bears, there’s no obvious coaching edge although my suspicions tend to favor Payton over Smith, and while the seasonal DVOA don’t strongly favor the Saints offense over the Bears defense or the Bears offense over the Saints defense, the Bears appear to be declining on both sides of the ball.\nThe one thing that makes me very nervous about this pick is the special teams.  They are the X-factor here, and if the Bears pull out a win, I’d expect it to be consistent special teams superiority giving the Bears field advantage plus a big play or two making the difference.  But the Saints beat a very solid Eagles team last weekend, while the Bears needed OT to beat a very mediocre Seattle squad.  It’s that, plus the combination of Brees’ superiority over Grossman, that makes me go with New Orleans.\nOn the AFC side, I have to commend the Baseball Savant* for his good fortune, if not his acumen.  I don’t think Indianapolis deserved to win either the Kansas City or the Baltimore game, but they did.  Still, I think the Colts have ridden their horseshoe luck as far as it will take them and that Belichick’s coaching superiority will prove the difference.\nThe Patriots are at a disadvantage, but a smaller one than they faced last week against San Diego.  The Colts’ offense is marginally better than the Chargers’, (1 to 2) but their defense is worse and their special teams are much, much worse. (27 and 26 to 14 and 3).  And to those people who ask, sarcastically, if it was Belichick’s coaching that made the difference in Troy Brown stripping Marlon McCree of the ball after McCree’s interception, I answer: no, but the coaching delta certainly did.\nA Patriots player won’t make that mistake, not so much because he’s coached not to, but because he’s\nselected\nnot to.  McCree knew perfectly well what the situation was, and as he said after the game, he’d do it again because he was “trying to make a touchdown”.\nON FOURTH DOWN IN THE FOURTH FREAKING QUARTER!  OF A DIVISIONAL ROUND PLAYOFF GAME!\nIf you sign and play me-first players who are perfectly willing to risk the conference championship over a chance to be a star, that’s on the GM and it’s on the coach as well.  Bad things will happen, and at the worst possible time.\nAnd it’s\nPeyton Manning\nnot as if the Colts\nDwight Freeney\nhave any players who are known more for flashy stats than\nMarvin Harrison\na commitment to winning as a team, right?\nI think the Patriots will win without giving Vinatieri a chance to do unto them as he has hitherto done unto others.  But it sure would be nice to see the Sports Guy’s Ultimate Betrayal scenario play out.\nRegardless, enjoy the games… it’s going to be a long spring and summer without so much as a World Cup to fill the void.\n*\nThe difference between the Baseball Savant and me is this: he’s 6-2 in the playoffs\nand proud of it\n, I’m 6-2 and irritated… but then, that’s why they call him the BASEBALL Savant.\nPS – by the way, if you’re one of those football writers who has been moaning all week about another Patriots-Colts playoff game, then go kill yourself.  Seriously.  Or at least go and find another job doing something you’re actually interested in.  If you’re truly not interested in the AFC Championship today, then you’re not a football fan.  Not a serious one, not a casual one, whatever it is you might happen to be, you’re absolutely nothing where the sport is concerned and you have absolutely nothing to say about it.\nPPS – What is going on in Pittsburgh?  From the Pittsburgh Tribune-Review:\nRuss Grimm has been offered and has accepted the Steelers’ head coaching position, a source in Pittsburgh confirmed late Saturday.  Grimm, 47, succeeds Bill Cowher, who coached the Steelers for 15 seasons before resigning Jan. 5. The hiring of Grimm will be announced Monday at a news conference.\nESPN and SI.com, Sports Illustrated’s Web site, reported yesterday that Minnesota Vikings defensive coordinator Mike Tomlin had been chosen to replace Cowher.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-21T13:29:00+00:00"
}