{
  "url": "https://voxday.net/2007/01/04/on-sun-tzu-for-shadowin/",
  "scraped_at": "2026-01-08T21:27:18.616602",
  "title": "On Sun Tzu for Shadowin",
  "date_display": "January 4, 2007",
  "date_iso": "2007-01-04T11:21:00+00:00",
  "date_from_url": "2007-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I addressed Shadowin’s point <a href=\"http://www.milobookclub.com/2006/11/10/mailvox-of-war-and-warfare/\">back in November</a>, now that I’m looking at this material with more attention to detail, I believe I can provide him with a more satisfactory answer to the question of Sun Tzu and the presence of religion as a factor in war-making.</p><p>Shadowin was rightly suspicious of my claim that Sun Tzu didn’t mention anything about religion, given that the Five Constant Factors of the art of war that must to be taken into account when seeking to determine the conditions obtaining in the field are: Moral Law, Heaven, Earth, The Commander, and Method and Discipline.</p><p>This would, upon first glance, appear to conclusively demonstrate that I am wrong.  However, since I am multi-lingual and happened to study an amount of Chinese history along the way, I am perhaps a little less likely to be thrown off by cultural miscommunications than the average American.</p><p>Heaven is easily dealt with, as Sun Tzu himself defines it as signifying: “night and day, cold and heat, times and seasons.”  In other words, “Heaven” merely means the environmental setting in which the battle takes place, it has no religious significance to the military strategist whatsoever, regardless of whether he happens to believe those settings are defined by a deity or not.</p><p>Sun Tzu clearly did not see the modification of Heaven as the general’s concern, or else he would have certainly recommended whatever actions were best indicated to achieve an ideal one, just as he did in some detail with regards to the ways in which a general might achieve a favorable Earth.</p><p>As for Moral Law, I contend that it is best translated as morale, as this is such a vital tactical concern that nearly every tactical wargame incorporates it in some measure.  In Advanced Squad Leader, for example, it is one of the three primary elements, along with firepower and movement.</p><p>Translator Lionel Giles considers this possibility, “One might be tempted to render it by ‘morale’, were it not considered as an attribute of the ruler in ss. 13”, but prefers “is in harmony with his subjects”.</p><p>I understand his reasoning given the wording of I. 13 (1): <em>“Which of the two sovereigns is imbued with the Moral law?”</em>, but I think the concept of morale encompasses the  concept of being in harmony with the subjects.  Leadership and morale are generally considered to be closely related matters, (in the case of ASL, the primary role of the former is to act as a modifier on the latter), so I think Giles’ distinction here is an artificial and unneccesary one.</p><p>Of course, I’m handicapped by being unable to read the original Chinese, so if anyone has any comments on this score, I’d be interested in hearing them.</p></div>",
  "content_text": "Although I addressed Shadowin’s point\nback in November\n, now that I’m looking at this material with more attention to detail, I believe I can provide him with a more satisfactory answer to the question of Sun Tzu and the presence of religion as a factor in war-making.\nShadowin was rightly suspicious of my claim that Sun Tzu didn’t mention anything about religion, given that the Five Constant Factors of the art of war that must to be taken into account when seeking to determine the conditions obtaining in the field are: Moral Law, Heaven, Earth, The Commander, and Method and Discipline.\nThis would, upon first glance, appear to conclusively demonstrate that I am wrong.  However, since I am multi-lingual and happened to study an amount of Chinese history along the way, I am perhaps a little less likely to be thrown off by cultural miscommunications than the average American.\nHeaven is easily dealt with, as Sun Tzu himself defines it as signifying: “night and day, cold and heat, times and seasons.”  In other words, “Heaven” merely means the environmental setting in which the battle takes place, it has no religious significance to the military strategist whatsoever, regardless of whether he happens to believe those settings are defined by a deity or not.\nSun Tzu clearly did not see the modification of Heaven as the general’s concern, or else he would have certainly recommended whatever actions were best indicated to achieve an ideal one, just as he did in some detail with regards to the ways in which a general might achieve a favorable Earth.\nAs for Moral Law, I contend that it is best translated as morale, as this is such a vital tactical concern that nearly every tactical wargame incorporates it in some measure.  In Advanced Squad Leader, for example, it is one of the three primary elements, along with firepower and movement.\nTranslator Lionel Giles considers this possibility, “One might be tempted to render it by ‘morale’, were it not considered as an attribute of the ruler in ss. 13”, but prefers “is in harmony with his subjects”.\nI understand his reasoning given the wording of I. 13 (1):\n“Which of the two sovereigns is imbued with the Moral law?”\n, but I think the concept of morale encompasses the  concept of being in harmony with the subjects.  Leadership and morale are generally considered to be closely related matters, (in the case of ASL, the primary role of the former is to act as a modifier on the latter), so I think Giles’ distinction here is an artificial and unneccesary one.\nOf course, I’m handicapped by being unable to read the original Chinese, so if anyone has any comments on this score, I’d be interested in hearing them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-04T11:21:00+00:00"
}