{
  "url": "https://voxday.net/2007/01/15/one-word-song/",
  "scraped_at": "2026-01-08T21:28:26.928924",
  "title": "One word song",
  "date_display": "January 15, 2007",
  "date_iso": "2007-01-15T11:56:00+00:00",
  "date_from_url": "2007-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found this little discussion over whether I had coined the neologism “omniderigence” to be a little strange.  I don’t mind my critics, I particularly appreciate those who force me to stay sharp and keep my logic on the straight and narrow.</p><p>But I don’t understand those who appear to harbor some distaste for giving credit where credit is due.  Now, it’s entirely possible that someone else invented the concept and the word as well, if calculus can be invented in two different places by two different people on this planet – to say nothing of the likelihood of its discovery by alien civilizations – then something this obvious has surely been thought of by someone else too.  Of course, it took me more than three decades to think about it, so it’s also possible that no one else has ever bothered.</p><p>This exchange was on a forum somewhere in the midst of a commonplace debate on a varient of the supposed omnipotence-omniscience incompatibility:</p><blockquote><p>Omniderigent…lol, at least give Vox Day the credit.</p><p><em>Actually, Vox Day isn’t the only source of said word</em></p><p>If so, then “omniderigent” is simply formed by adding the prefix “omni-” to it. Vox Day can claim they made it up all they want, but that’s like me claiming I just made up the word “omniliterate”.</p></blockquote><p>This is a strange way of viewing etymology, considering that Wikipedia regularly credits neologists with inventing very similar constructions such as “homosexual”.  The relevant point isn’t that anyone could do it, but that someone did and that it is useful.  It is quite likely that I am the only English speaker on the planet to have made use of Umberto Eco’s word, <em>celodurismo</em>, so it will not likely appear in a dictionary any time soon and therefore cannot be considered an English word.  “Omniderigent” may not be a word yet, but if it provides a useful linguistic service for those interested in discussing divine matters, it will eventually become a word, if not, then it won’t.</p><p>I was quite surprised when I was searching for a way to describe those who believe that God has an all-encompassing plan that dictates how many pull-ups I will do when I quit typing this and go to the gym.  (My guess is that He has three sets of ten in mind, but I shall be patient and wait to discover how this perfect workout will unfold.)  But I couldn’t find anything useful, so I was forced to resort to messing around in Latin.</p><p>So, woo-hoo, that’s one for me.  Next song!</p></div>",
  "content_text": "I found this little discussion over whether I had coined the neologism “omniderigence” to be a little strange.  I don’t mind my critics, I particularly appreciate those who force me to stay sharp and keep my logic on the straight and narrow.\nBut I don’t understand those who appear to harbor some distaste for giving credit where credit is due.  Now, it’s entirely possible that someone else invented the concept and the word as well, if calculus can be invented in two different places by two different people on this planet – to say nothing of the likelihood of its discovery by alien civilizations – then something this obvious has surely been thought of by someone else too.  Of course, it took me more than three decades to think about it, so it’s also possible that no one else has ever bothered.\nThis exchange was on a forum somewhere in the midst of a commonplace debate on a varient of the supposed omnipotence-omniscience incompatibility:\nOmniderigent…lol, at least give Vox Day the credit.\nActually, Vox Day isn’t the only source of said word\nIf so, then “omniderigent” is simply formed by adding the prefix “omni-” to it. Vox Day can claim they made it up all they want, but that’s like me claiming I just made up the word “omniliterate”.\nThis is a strange way of viewing etymology, considering that Wikipedia regularly credits neologists with inventing very similar constructions such as “homosexual”.  The relevant point isn’t that anyone could do it, but that someone did and that it is useful.  It is quite likely that I am the only English speaker on the planet to have made use of Umberto Eco’s word,\ncelodurismo\n, so it will not likely appear in a dictionary any time soon and therefore cannot be considered an English word.  “Omniderigent” may not be a word yet, but if it provides a useful linguistic service for those interested in discussing divine matters, it will eventually become a word, if not, then it won’t.\nI was quite surprised when I was searching for a way to describe those who believe that God has an all-encompassing plan that dictates how many pull-ups I will do when I quit typing this and go to the gym.  (My guess is that He has three sets of ten in mind, but I shall be patient and wait to discover how this perfect workout will unfold.)  But I couldn’t find anything useful, so I was forced to resort to messing around in Latin.\nSo, woo-hoo, that’s one for me.  Next song!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-15T11:56:00+00:00"
}