{
  "url": "https://voxday.net/2007/01/19/proud-to-be-democra/",
  "scraped_at": "2026-01-08T21:28:56.428571",
  "title": "Proud to be a Democrat",
  "date_display": "January 19, 2007",
  "date_iso": "2007-01-19T16:30:00+00:00",
  "date_from_url": "2007-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>“The attempt to require political bloggers to register as lobbyists previously reported by Slashdot has been stripped out of the lobbying reform bill. The vote was 55 to 43 to defeat the provision. All 48 Republicans, as well as 7 Democrats, voted against requiring bloggers to register; all 43 votes in favor of keeping the registration provision were by Democrats.”</p></blockquote><p>Remember, Democrats are the Champions of Free Speech.  And I’m off for a ride on my unicorn.  With Adriana Lima.</p><p><em>And I’m proud to be a Democrat, a moral exemplary<br>And you won’t forget my rectitude, because I’ll lecture on it daily.<br>I gladly stand up next to you and tell you how you should live.<br>‘Cause there ain’t no doubt I love this land<br>May Natural Selection, over a period of time sufficient to engender noticeable differentiation, happen to favor the descendants of the inhabitants of this artificial construction that is currently known as a “country”, although without necessarily discriminating against people, particularly those with darker skin, who happen to cross its arbitrary “borders” at any time now or in the future, although of course we know that it’s really all up to random chance anyhow and it doesn’t really matter since by then Humynkind should have matured enough to accept global governance under the United Nations.</br></br></br></br></em></p></div>",
  "content_text": "“The attempt to require political bloggers to register as lobbyists previously reported by Slashdot has been stripped out of the lobbying reform bill. The vote was 55 to 43 to defeat the provision. All 48 Republicans, as well as 7 Democrats, voted against requiring bloggers to register; all 43 votes in favor of keeping the registration provision were by Democrats.”\nRemember, Democrats are the Champions of Free Speech.  And I’m off for a ride on my unicorn.  With Adriana Lima.\nAnd I’m proud to be a Democrat, a moral exemplary\nAnd you won’t forget my rectitude, because I’ll lecture on it daily.\nI gladly stand up next to you and tell you how you should live.\n‘Cause there ain’t no doubt I love this land\nMay Natural Selection, over a period of time sufficient to engender noticeable differentiation, happen to favor the descendants of the inhabitants of this artificial construction that is currently known as a “country”, although without necessarily discriminating against people, particularly those with darker skin, who happen to cross its arbitrary “borders” at any time now or in the future, although of course we know that it’s really all up to random chance anyhow and it doesn’t really matter since by then Humynkind should have matured enough to accept global governance under the United Nations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-19T16:30:00+00:00"
}