{
  "url": "https://voxday.net/2007/01/11/wrath-of-angels-first-review/",
  "scraped_at": "2026-01-08T21:27:59.385188",
  "title": "The Wrath of Angels – first review",
  "date_display": "January 11, 2007",
  "date_iso": "2007-01-11T11:20:00+00:00",
  "date_from_url": "2007-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco emails a review:</p><blockquote><p>The Wrath of Angels is the third volume in the Eternal Warriors trilogy.  In it, the author continues with his story line of the Earthly/Otherworldly battle between the Fallen Angels and the Guardians, but in this installment a wrinkle is added in which multiple (at least three) factions of the Fallen Angels are threatening and warring with each other.</p><p>Whereas the first book, The War in Heaven, is set largely off earth (in Heaven and on other worlds), and the second book, The World in Shadow, almost completely takes place in the Twin Cities of Minnesota, this book largely focuses on the country of England. We follow a new character, who has more than one name but is usually referred to as Puck, and his Quest to save his former king… in order to prevent a more evil queen from attacking and causing great destruction to both mortal and immortal beings in England.</p><p>This sounds a bit complicated and it is. As a person not versed in myth and mythology, I often wished as I read that I knew a bit more about Faeries, for example, or beings moving into tertius, quintus or septus modes, (walking Shadow), but in all cases these terms are defined in context or are not required knowledge. In any case the author manages to give us cues as to Puck’s plan, at least on a high level, and we know to some degree where the story is progressing.</p><p>Except where there are surprises. There are more than a few, and they are, in turn, horrifying, disappointing, relieving and humorous.</p><p>And in the process of following Puck’s progress, we revisit several familiar characters from the first two books and we are given first hand experience with more than one familiar legend.</p><p>Again, almost all of the book is from the perspective of two characters, one immortal (Puck) and the other, later, a mortal. This book comes from an Overtly Christian worldview, but in this one, the author gets a little more specific as to into what kind of Evangelic Christianity his fictional world is shaped.</p><p>My first impression is that it is my favorite of the trilogy.</p><p>Now to positives and negatives, but I should note that as a reader, I am biased to like this book for three reasons:</p><p>1. I am a Christian and it my hope that this book might serve to propagate the Gospel (although I think that of the three, this book does the least of what you might call evangelizing.)</p><p>2. I am from the Twin Cities and as before it is a kick to see streets, bridges and Barnes and Noble Bookstores mentioned that I am very familiar with.</p><p>3. The author is a friend of mine and I would like very much for this book to do well. So for these reasons and the fact that I generally like the book, I will start with the negatives and end with the positives.</p><p> Negatives:</p><p>Character: It would seem to me that if a human teenager has experienced extremely supernatural events that she attributes to a saving and loving God, she would not have as her primary sources of reading material Cosmopolitan and InStyle magazine. Not so here.</p><p>Cover: Okay, this is picky on my part and the complaint is not really about the written book per se, but if one buys a book from a Christian author, one should not fear that his kids might see it. Seriously, do we need not one but two nearly undressed women on the cover? I felt the need to keep it on top of my seven foot high book shelf.</p><p>Character: We are told that since this is a fantasy book, we reader/reviewers have no right to complain about theology espoused in it. Fair enough. An author’s world is his own. But when the Angelic Champion… sounds somewhat Anne Graham Lottish while giving the author’s view of what God doesn’t do, well, it rankles a bit.  Can I say that?</p><p>There that wasn’t so bad, was it? This is by no means all of what caused at least minor disgruntlement on my part, but it gives a flavor.</p><p>On to Positives:</p><p>Style: Surprisingly, this book is somewhat less dark than either of its predecessors (especially World) and is more down to earth and focused in direction than War. You might even call it an adventure. And as I mentioned previously, I enjoyed the humor. There is something refreshing about a captive facing torture and death mocking (with success) his captor. And what with the subject matter of one of the chapters, it makes sense that there are not one, but three and a half (by my count) Monty Python references (a subject I am , perhaps regrettably, more well versed that the Fae.)</p><p>But why didn’t he say “none shall pass”?  Why?</p><p>Style: I read this book in three weeks after spending two years reading Stephenson’s Baroque Trilogy (Yes, that makes two books in a row where scenes take place in the sewers of London) I must say it was somewhat of a relief to read this one, with it’s more straightforward approach. Stephenson is very good, but the author’s writing is more, shall we say, taut.</p><p>Character: Puck is a thoroughly enjoyable character who in turn irritates and amuses almost everyone he comes into contact with. He is focused on his goal and goes for it, despite his reputation as less than respectable. He is also one of the greater sources of surprise. I also enjoyed seeing Leviathan again and his strong persona shines.</p><p>Creativity: There are questions asked by the author in this book that took quite a bit of out-of- the-box thinking. What if the Nephilim are still around and are extant as many of the legends we hear about in horror stories?  What if some of the Fallen found other things to spend their time with than merely tempting humans?  How would the good side of the immortals deal with a battle between two groups of warring fallen angels?  What would it feel like for a human to gain Angelic powers?  This book brings the concept of the Fallen far beyond Screwtape.</p><p>The author has created an intricate and fleshed out world which makes one wonder how many short stories and back stories he has in his mind unwritten. I would certainly want to read them if he ever got around to it.</p></blockquote><p>That was a fair review of the book in my opinion, even if the deeper brilliance of it appears to have escaped him….  And if you’re curious to see if Jamsco’s opinions are justified, you can <a href=\"http://voxday.net/mart/THE%20WRATH%20OF%20ANGELS.pdf\">download the book</a> and judge for yourself.  If you’re not interested in my fiction, but are still on the look-out for a good novel or two, I’d strongly recommend The Atrocity Archive and The Jennifer Morgue by Charles Stross.  I just re-read the former in preparation for the latter, which I am reading now.</p><p>I’ll be posting other reviews here as they come in, postive or negative.  I will edit them for plot spoilers, as I have done in two instances here, but that’s it.</p></div>",
  "content_text": "Jamsco emails a review:\nThe Wrath of Angels is the third volume in the Eternal Warriors trilogy.  In it, the author continues with his story line of the Earthly/Otherworldly battle between the Fallen Angels and the Guardians, but in this installment a wrinkle is added in which multiple (at least three) factions of the Fallen Angels are threatening and warring with each other.\nWhereas the first book, The War in Heaven, is set largely off earth (in Heaven and on other worlds), and the second book, The World in Shadow, almost completely takes place in the Twin Cities of Minnesota, this book largely focuses on the country of England. We follow a new character, who has more than one name but is usually referred to as Puck, and his Quest to save his former king… in order to prevent a more evil queen from attacking and causing great destruction to both mortal and immortal beings in England.\nThis sounds a bit complicated and it is. As a person not versed in myth and mythology, I often wished as I read that I knew a bit more about Faeries, for example, or beings moving into tertius, quintus or septus modes, (walking Shadow), but in all cases these terms are defined in context or are not required knowledge. In any case the author manages to give us cues as to Puck’s plan, at least on a high level, and we know to some degree where the story is progressing.\nExcept where there are surprises. There are more than a few, and they are, in turn, horrifying, disappointing, relieving and humorous.\nAnd in the process of following Puck’s progress, we revisit several familiar characters from the first two books and we are given first hand experience with more than one familiar legend.\nAgain, almost all of the book is from the perspective of two characters, one immortal (Puck) and the other, later, a mortal. This book comes from an Overtly Christian worldview, but in this one, the author gets a little more specific as to into what kind of Evangelic Christianity his fictional world is shaped.\nMy first impression is that it is my favorite of the trilogy.\nNow to positives and negatives, but I should note that as a reader, I am biased to like this book for three reasons:\n1. I am a Christian and it my hope that this book might serve to propagate the Gospel (although I think that of the three, this book does the least of what you might call evangelizing.)\n2. I am from the Twin Cities and as before it is a kick to see streets, bridges and Barnes and Noble Bookstores mentioned that I am very familiar with.\n3. The author is a friend of mine and I would like very much for this book to do well. So for these reasons and the fact that I generally like the book, I will start with the negatives and end with the positives.\nNegatives:\nCharacter: It would seem to me that if a human teenager has experienced extremely supernatural events that she attributes to a saving and loving God, she would not have as her primary sources of reading material Cosmopolitan and InStyle magazine. Not so here.\nCover: Okay, this is picky on my part and the complaint is not really about the written book per se, but if one buys a book from a Christian author, one should not fear that his kids might see it. Seriously, do we need not one but two nearly undressed women on the cover? I felt the need to keep it on top of my seven foot high book shelf.\nCharacter: We are told that since this is a fantasy book, we reader/reviewers have no right to complain about theology espoused in it. Fair enough. An author’s world is his own. But when the Angelic Champion… sounds somewhat Anne Graham Lottish while giving the author’s view of what God doesn’t do, well, it rankles a bit.  Can I say that?\nThere that wasn’t so bad, was it? This is by no means all of what caused at least minor disgruntlement on my part, but it gives a flavor.\nOn to Positives:\nStyle: Surprisingly, this book is somewhat less dark than either of its predecessors (especially World) and is more down to earth and focused in direction than War. You might even call it an adventure. And as I mentioned previously, I enjoyed the humor. There is something refreshing about a captive facing torture and death mocking (with success) his captor. And what with the subject matter of one of the chapters, it makes sense that there are not one, but three and a half (by my count) Monty Python references (a subject I am , perhaps regrettably, more well versed that the Fae.)\nBut why didn’t he say “none shall pass”?  Why?\nStyle: I read this book in three weeks after spending two years reading Stephenson’s Baroque Trilogy (Yes, that makes two books in a row where scenes take place in the sewers of London) I must say it was somewhat of a relief to read this one, with it’s more straightforward approach. Stephenson is very good, but the author’s writing is more, shall we say, taut.\nCharacter: Puck is a thoroughly enjoyable character who in turn irritates and amuses almost everyone he comes into contact with. He is focused on his goal and goes for it, despite his reputation as less than respectable. He is also one of the greater sources of surprise. I also enjoyed seeing Leviathan again and his strong persona shines.\nCreativity: There are questions asked by the author in this book that took quite a bit of out-of- the-box thinking. What if the Nephilim are still around and are extant as many of the legends we hear about in horror stories?  What if some of the Fallen found other things to spend their time with than merely tempting humans?  How would the good side of the immortals deal with a battle between two groups of warring fallen angels?  What would it feel like for a human to gain Angelic powers?  This book brings the concept of the Fallen far beyond Screwtape.\nThe author has created an intricate and fleshed out world which makes one wonder how many short stories and back stories he has in his mind unwritten. I would certainly want to read them if he ever got around to it.\nThat was a fair review of the book in my opinion, even if the deeper brilliance of it appears to have escaped him….  And if you’re curious to see if Jamsco’s opinions are justified, you can\ndownload the book\nand judge for yourself.  If you’re not interested in my fiction, but are still on the look-out for a good novel or two, I’d strongly recommend The Atrocity Archive and The Jennifer Morgue by Charles Stross.  I just re-read the former in preparation for the latter, which I am reading now.\nI’ll be posting other reviews here as they come in, postive or negative.  I will edit them for plot spoilers, as I have done in two instances here, but that’s it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-01-11T11:20:00+00:00"
}