{
  "url": "https://voxday.net/2012/04/05/barca-machine/",
  "scraped_at": "2025-12-14T04:51:23.341339",
  "title": "The Barca machine",
  "date_display": "April 5, 2012",
  "date_iso": "2012-04-05T09:00:00+00:00",
  "date_from_url": "2012-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Grantland’s game diary for the second leg of <a href=\"http://www.grantland.com/blog/the-triangle/post/_/id/23039/champions-league-retro-diary-iii-barcelona-ac-milan\">the Milan-Barca quarterfinal</a>:</p><blockquote><p>Brian: Sometimes I watch a bit of play that just knocks me over the head with WHAT A WEIRD TEAM BARCELONA IS. They just won that penalty by bypassing a couple of completely plausible shots in order to stroke the ball around in the area like they were playing a very casual game of hot potato. They were literally trying NOT to pass the ball into the back of the net, and now it’s 1-0.</p><p>If you’re the heads-up display in the Barca-player visual-software interface, how do you decide when to light up for “shoot”? There are like nine floating circles that have to converge, at which point the software runs an algorithm that determines whether the resulting shot would be beautiful.</p></blockquote><p>Three things struck me most about watching Barca effortlessly beat the Rossoneri.  First, it’s like watching the Harlem Globetrotters.  They don’t just make the pass instead of taking the shot, they make <i>another</i> pass, and sometimes a third, before taking the shot, and sometimes <i>this all takes place inside the opposing box</i>.  I’ve never seen anything like it.  They don’t so much waste opportunities as blatantly ignore them.</p><p>Second, they press frighteningly well.  I would estimate that at least one-third, and possibly as much as one-half, of Milan’s attempts to clear the ball were intercepted or otherwise failed.   As if it wasn’t bad enough that the Milan defense was playing back on its heels in full, catenaccio from the start, but no sooner did they take the ball away than they lost it, usually in their own half of the field.</p><p>Third, Barca stretches the field horizontally better than any team I’ve ever seen.  There was always a winger on the far side of the ball, but instead of crossing the balls in the air, the wingers would push the ball inside, force the defender to commit, then a) try to beat him, b) pass off to Messi, or c) pass off to the central midfielder coming up in support.  Their entire game is played on the ground, which makes sense given that their front six appear to average about 5’6″.  They just keep passing and slashing and pressing until the defense cracks, then instead of shooting, pass three more times for good measure, before finally deigning to make an attempt on goal.</p><p>I would have been more annoyed by the two penalties awarded Barca were it not for the fact that the fouls were legitimate, and at least the first time, the ball should have already been in the net twice over by the time the foul occurred.  The final score was 3-1, but it could just as easily have been 6-1.  That’s not to say Barca is invulnerable, as neither their defense nor their keeper impressed me.  A big, fast team with the benefit of a laissez faire referee could beat them, assuming they didn’t run out of steam chasing the little guys around.</p></div>",
  "content_text": "Grantland’s game diary for the second leg of\nthe Milan-Barca quarterfinal\n:\nBrian: Sometimes I watch a bit of play that just knocks me over the head with WHAT A WEIRD TEAM BARCELONA IS. They just won that penalty by bypassing a couple of completely plausible shots in order to stroke the ball around in the area like they were playing a very casual game of hot potato. They were literally trying NOT to pass the ball into the back of the net, and now it’s 1-0.\nIf you’re the heads-up display in the Barca-player visual-software interface, how do you decide when to light up for “shoot”? There are like nine floating circles that have to converge, at which point the software runs an algorithm that determines whether the resulting shot would be beautiful.\nThree things struck me most about watching Barca effortlessly beat the Rossoneri.  First, it’s like watching the Harlem Globetrotters.  They don’t just make the pass instead of taking the shot, they make\nanother\npass, and sometimes a third, before taking the shot, and sometimes\nthis all takes place inside the opposing box\n.  I’ve never seen anything like it.  They don’t so much waste opportunities as blatantly ignore them.\nSecond, they press frighteningly well.  I would estimate that at least one-third, and possibly as much as one-half, of Milan’s attempts to clear the ball were intercepted or otherwise failed.   As if it wasn’t bad enough that the Milan defense was playing back on its heels in full, catenaccio from the start, but no sooner did they take the ball away than they lost it, usually in their own half of the field.\nThird, Barca stretches the field horizontally better than any team I’ve ever seen.  There was always a winger on the far side of the ball, but instead of crossing the balls in the air, the wingers would push the ball inside, force the defender to commit, then a) try to beat him, b) pass off to Messi, or c) pass off to the central midfielder coming up in support.  Their entire game is played on the ground, which makes sense given that their front six appear to average about 5’6″.  They just keep passing and slashing and pressing until the defense cracks, then instead of shooting, pass three more times for good measure, before finally deigning to make an attempt on goal.\nI would have been more annoyed by the two penalties awarded Barca were it not for the fact that the fouls were legitimate, and at least the first time, the ball should have already been in the net twice over by the time the foul occurred.  The final score was 3-1, but it could just as easily have been 6-1.  That’s not to say Barca is invulnerable, as neither their defense nor their keeper impressed me.  A big, fast team with the benefit of a laissez faire referee could beat them, assuming they didn’t run out of steam chasing the little guys around.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-05T08:00:00+00:00"
}