{
  "url": "https://voxday.net/2012/04/23/classic-hero/",
  "scraped_at": "2025-12-14T04:52:44.307673",
  "title": "A classic hero",
  "date_display": "April 23, 2012",
  "date_iso": "2012-04-23T18:37:00+00:00",
  "date_from_url": "2012-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>You are Aeneas. You’ve got the weight of the world on your shoulders but sometimes you just need to focus on the task at hand and stop moaning! Sometimes your relentless drive can make you seem cold-hearted but you are compassionate and a selfless leader.</i></p><p>How very odd!  I thought surely I’d end up as Odysseus.  Anyhow, <a href=\"http://blog.oxforddictionaries.com/2012/04/which-classical-character-are-you/\">the quiz</a> is to celebrate the release of a new edition of the Oxford Classical Dictionary.  And speaking of classics, I have to express my deep gratitude to SL, whom I met yesterday for an excellent three-wine lunch on a beautiful afternoon overlooking the uncharacteristically sunny Langhe.  He also gave me a set of the famous Eleventh Edition of the Encyclopedia Britannica, which is already established in my bookshelf on two shelves just under my cherished Cambridge Medieval History.  It makes for fascinating reading, and I’ve already encountered a monastic order, hitherto unbeknownst to me, that I’m considering how to incorporate into the new novel.</p></div>",
  "content_text": "You are Aeneas. You’ve got the weight of the world on your shoulders but sometimes you just need to focus on the task at hand and stop moaning! Sometimes your relentless drive can make you seem cold-hearted but you are compassionate and a selfless leader.\nHow very odd!  I thought surely I’d end up as Odysseus.  Anyhow,\nthe quiz\nis to celebrate the release of a new edition of the Oxford Classical Dictionary.  And speaking of classics, I have to express my deep gratitude to SL, whom I met yesterday for an excellent three-wine lunch on a beautiful afternoon overlooking the uncharacteristically sunny Langhe.  He also gave me a set of the famous Eleventh Edition of the Encyclopedia Britannica, which is already established in my bookshelf on two shelves just under my cherished Cambridge Medieval History.  It makes for fascinating reading, and I’ve already encountered a monastic order, hitherto unbeknownst to me, that I’m considering how to incorporate into the new novel.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-23T17:37:00+00:00"
}