{
  "url": "https://voxday.net/2012/04/20/deeper-and-deeper-2/",
  "scraped_at": "2025-12-14T04:52:33.291208",
  "title": "Deeper and deeper",
  "date_display": "April 20, 2012",
  "date_iso": "2012-04-20T14:06:00+00:00",
  "date_from_url": "2012-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The discussion at R. Scott Bakker’s Three Pound Brain <a href=\"http://rsbakker.wordpress.com/2012/04/12/over-easy-versus-hard-embroiled/\">has continued</a> and sprouted numerous branches, and yet Wängsty himself has thus far resolutely refused to provide any definition of “certainty” or “uncertainty” despite the fact that his entire philosophical framework appears to rest upon them.  Here is but one of several comments that I have made there in answering the various questions of his commenters even as Bakker continues to avoid answering mine.</p><p>Why is he so reluctant to provide definitions for his central terms?  Is he afraid that his entire philosophical edifice will tumble to the ground if he exposes it to criticism?  Or is it only that the certainty of a definition would be less moral than the uncertainty of a non-definition, so he is simply attempting to abide by the ethos of his doubt-filled creed?</p><blockquote><p></p><div class=\"comment-text\"> First, I’d like to point out that I’ve been answering many questions, whereas Scott still hasn’t deigned to define<br> certainty or uncertainty for us, which has prevented us from proceeding<br> with the main subject.  So, how about it, Scott?  Are you cool with the<br> dictionary definitions or is Delavagus correct and you have something<br> else in mind?</br></br></br></br></div><div class=\"comment-text\"> <b>Just for the sake of clarity, you advocate attempting to convince<br> all women to voluntarily not work. You don’t advocate forcing them to<br> not work, right?</br></br></b></div><div class=\"comment-text\"> I don’t think it’s necessary to force anyone not to work.  Most women<br> of the important class don’t really want to, not after they have actual<br> experience of it.  But I would go a little farther than simply<br> attempting to convince women, I advise removing the incentives that<br> encourage women to enter the labor force and provide them with<br> incentives to bear and raise children instead.<br> The basic problem is that since the doubling of women in the labor<br> force from 1950 to 1975, and concomitant reduction of wage rates,<br> married women who don’t want to work are forced to if they wish to<br> maintain the standard of living a one-income family once had.</br></br></br></br></br></br></br></br></br></div><div class=\"comment-text\"> <b>Is this [changing  positions on the drug war] really an example of you being (proven) wrong, though? It was incompatable with your beliefs. </b></div><div class=\"comment-text\"> Yes.  A friend pointed out the logical inconsistency to me.</div><div class=\"comment-text\"> <b>Is there some method by which you could be shown to be wrong on<br> the womens rights (or even shown to not be so certain of how it aught to<br> be)? You seem to say your belief changed – but what was the changing<br> method and can anyone else have a hand in that?</br></br></br></b></div><div class=\"comment-text\"> Of course.  But it’s unlikely, since I’ve looked at it in more depth<br> than most.  The method involved looking at the societal effects over the<br> course of the last 90 years, and it rapidly became clear that the<br> predictions made by opponents of women’s suffrage were largely correct<br> and those made by its supporters were incorrect.  Furthermore, there are<br> a whole host of problems, mostly rooted in economics, that were never<br> anticipated by either side.</br></br></br></br></br></br></div><div class=\"comment-text\"> <b>Seems a legacy argument? Legacy, Eg: Well, if we give all these<br> slaves freedom, who will work the plantation! Economic ruin! Thus<br> slavery aught to continue.</br></br></b></div><div class=\"comment-text\"> No, you’re making the mistake of confusing a forward-looking<br> perspective with a retrospective one.  In the correct analogy to the<br> case we’re discussing, we’re considering that pro-slavery argument from<br> amidst the economic ruins.  As it happens, that pro-slavery argument was<br> subsequently proven wrong by events, as were the pro-suffrage<br> arguments.</br></br></br></br></br></div><div class=\"comment-text\"> <b>if we assume that women are technically human, and we assert that<br> we value human liberty, shouldn’t we support their desire to work as<br> much as we would support a man’s desire to smoke some nice (almost)<br> harmless weed due to both being a special case of general human liberty ?</br></br></br></b></div><div class=\"comment-text\"> Not necessarily.  This is the common error committed by many of my<br> fellow libertarians.  For example, consider open borders.  That<br> seemingly libertarian position is actually anti-freedom, as there would<br> be nothing to stop China from sending 30 million Chinese to the UK and<br> 55 million to the USA, gaining voting rights, then voting to sign a<br> treaty of surrender to the Chinese government.  Maximizing human liberty<br> in the aggregate is not perfectly synonymous with maximizing all<br> individual human liberty.</br></br></br></br></br></br></br></div><div class=\"comment-text\"> <b>However, if he supports bypassing persuasion and going straight<br> for coercion, things take a decidedly ominous turn. But relying only on<br> persuasion immediately suggests the practical improbability of the<br> proposition, and this is why I think it’s proper to feel uneasy about<br> even theoretically suggesting it. What really is the point to suggesting<br> a counterfactual that has no chance of being realized?</br></br></br></br></br></b></div><div class=\"comment-text\"> There is a long gap between persuasion and coercion.  As I said, I<br> favor incentives, not force.  But it’s not a counterfactual that has no<br> chance of being realized.  The coercion and oppression of Western women<br> by force will come if their behavioral trends are not changed, and<br> changed in the next 30 years.  The socio-sexual and demographic trends<br> are fairly clear.  Who would have imagined, in 1973, when wages peaked<br> and the divorce/abortion equalitarian program was implemented into US<br> law, that there would be honor killings in the USA and Europe only<br> thirty years later?<br> Societies that rest upon structural incoherencies always collapse<br> sooner or later.  Feminist equalitarianism is actually a less coherent<br> and less realistic ideology than Soviet communism was, and it probably<br> won’t last the 72 years that the Soviet system did.  It’s only been 39<br> years and the problems are rapidly building up throughout the West.</br></br></br></br></br></br></br></br></br></br></br></br></br></div></blockquote></div>",
  "content_text": "The discussion at R. Scott Bakker’s Three Pound Brain\nhas continued\nand sprouted numerous branches, and yet Wängsty himself has thus far resolutely refused to provide any definition of “certainty” or “uncertainty” despite the fact that his entire philosophical framework appears to rest upon them.  Here is but one of several comments that I have made there in answering the various questions of his commenters even as Bakker continues to avoid answering mine.\nWhy is he so reluctant to provide definitions for his central terms?  Is he afraid that his entire philosophical edifice will tumble to the ground if he exposes it to criticism?  Or is it only that the certainty of a definition would be less moral than the uncertainty of a non-definition, so he is simply attempting to abide by the ethos of his doubt-filled creed?\nFirst, I’d like to point out that I’ve been answering many questions, whereas Scott still hasn’t deigned to define\ncertainty or uncertainty for us, which has prevented us from proceeding\nwith the main subject.  So, how about it, Scott?  Are you cool with the\ndictionary definitions or is Delavagus correct and you have something\nelse in mind?\nJust for the sake of clarity, you advocate attempting to convince\nall women to voluntarily not work. You don’t advocate forcing them to\nnot work, right?\nI don’t think it’s necessary to force anyone not to work.  Most women\nof the important class don’t really want to, not after they have actual\nexperience of it.  But I would go a little farther than simply\nattempting to convince women, I advise removing the incentives that\nencourage women to enter the labor force and provide them with\nincentives to bear and raise children instead.\nThe basic problem is that since the doubling of women in the labor\nforce from 1950 to 1975, and concomitant reduction of wage rates,\nmarried women who don’t want to work are forced to if they wish to\nmaintain the standard of living a one-income family once had.\nIs this [changing  positions on the drug war] really an example of you being (proven) wrong, though? It was incompatable with your beliefs.\nYes.  A friend pointed out the logical inconsistency to me.\nIs there some method by which you could be shown to be wrong on\nthe womens rights (or even shown to not be so certain of how it aught to\nbe)? You seem to say your belief changed – but what was the changing\nmethod and can anyone else have a hand in that?\nOf course.  But it’s unlikely, since I’ve looked at it in more depth\nthan most.  The method involved looking at the societal effects over the\ncourse of the last 90 years, and it rapidly became clear that the\npredictions made by opponents of women’s suffrage were largely correct\nand those made by its supporters were incorrect.  Furthermore, there are\na whole host of problems, mostly rooted in economics, that were never\nanticipated by either side.\nSeems a legacy argument? Legacy, Eg: Well, if we give all these\nslaves freedom, who will work the plantation! Economic ruin! Thus\nslavery aught to continue.\nNo, you’re making the mistake of confusing a forward-looking\nperspective with a retrospective one.  In the correct analogy to the\ncase we’re discussing, we’re considering that pro-slavery argument from\namidst the economic ruins.  As it happens, that pro-slavery argument was\nsubsequently proven wrong by events, as were the pro-suffrage\narguments.\nif we assume that women are technically human, and we assert that\nwe value human liberty, shouldn’t we support their desire to work as\nmuch as we would support a man’s desire to smoke some nice (almost)\nharmless weed due to both being a special case of general human liberty ?\nNot necessarily.  This is the common error committed by many of my\nfellow libertarians.  For example, consider open borders.  That\nseemingly libertarian position is actually anti-freedom, as there would\nbe nothing to stop China from sending 30 million Chinese to the UK and\n55 million to the USA, gaining voting rights, then voting to sign a\ntreaty of surrender to the Chinese government.  Maximizing human liberty\nin the aggregate is not perfectly synonymous with maximizing all\nindividual human liberty.\nHowever, if he supports bypassing persuasion and going straight\nfor coercion, things take a decidedly ominous turn. But relying only on\npersuasion immediately suggests the practical improbability of the\nproposition, and this is why I think it’s proper to feel uneasy about\neven theoretically suggesting it. What really is the point to suggesting\na counterfactual that has no chance of being realized?\nThere is a long gap between persuasion and coercion.  As I said, I\nfavor incentives, not force.  But it’s not a counterfactual that has no\nchance of being realized.  The coercion and oppression of Western women\nby force will come if their behavioral trends are not changed, and\nchanged in the next 30 years.  The socio-sexual and demographic trends\nare fairly clear.  Who would have imagined, in 1973, when wages peaked\nand the divorce/abortion equalitarian program was implemented into US\nlaw, that there would be honor killings in the USA and Europe only\nthirty years later?\nSocieties that rest upon structural incoherencies always collapse\nsooner or later.  Feminist equalitarianism is actually a less coherent\nand less realistic ideology than Soviet communism was, and it probably\nwon’t last the 72 years that the Soviet system did.  It’s only been 39\nyears and the problems are rapidly building up throughout the West.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-20T13:06:00+00:00"
}