{
  "url": "https://voxday.net/2012/04/24/democracy-vs-aristocracy/",
  "scraped_at": "2025-12-14T04:52:47.992852",
  "title": "Democracy vs Aristocracy",
  "date_display": "April 24, 2012",
  "date_iso": "2012-04-24T08:53:00+00:00",
  "date_from_url": "2012-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times asks Tyler Cowen about <a href=\"http://www.nytimes.com/roomfordebate/2012/04/23/in-europe-now-what/democracy-is-having-its-say-in-europe\">the present state of the EU</a>:</p><blockquote><p> Today, very few countries in the euro zone are capable of making credible commitments or binding agreements with the others.  Quite simply, democracy is having its say. The French soon may elect a left-wing candidate who, in essence, wants to exempt France from fiscal rules and place more fiscal risk on Germany. The Dutch can no longer form a governmental consensus on the budget. The Irish will be putting the fiscal compact up for a referendum, and the Greeks are holding an election in May. Even in Germany there could be problems holding together the ruling coalition.</p><p>In general, voters are unwilling to give up their say over policy, or to regard the European Union or euro zone as necessarily superior to national interests. When it comes to the specifics, it appears increasingly likely that at least one national electorate will pull the plug on the entire set of bailouts and austerity programs.</p><p>There is no way to pull off the required cross-national agreements. Resources are being drained from euro zone banks, which are contracting their lending to business. This will make the current recession worse, which in turn will necessitate further unpopular policies, including cuts in government spending. Euro zone countries will become more nationalistic in hard times, and more likely to vote against incumbent governments, no matter what the specific issue at stake. It is hard to see a stabilizing outcome, so the best bet is on a crack-up of some of Europe’s major economies, including Spain and Italy.</p><p>There is an old saying in economics, namely “no monetary union without a corresponding fiscal union.” It could be added “no fiscal union without a corresponding electoral union.” In the longer run, we will probably end up with none of these institutions.</p><p>The euro zone probably was unworkable from the beginning, and now we are seeing why.</p></blockquote><p>What we’re seeing here is the last desperate gasps of democracy as the new aristocratic age struggles to be born.  The outcome of the current crisis is far from certain, but at least we’re now able to see relatively clearly what the most likely possibilities are. <a href=\"http://online.wsj.com/article/SB10001424052702303459004577359552117811814.html?mod=WSJ_hp_us_mostpop_read\">The collapse of the Dutch government</a> and the surge of the anti-EU National Front in France show that the strategy of the European political elite, which is to offer the people a choice between pro-EU Party A and pro-EU Party B, is no longer working.  Even in the UK, which is slightly insulated from the problems of the Euro thanks to its retention of the pound sterling, the popularity of UKIP is now growing rapidly due to the recognition that there isn’t any meaningful euroskepticism in the Conservative Party anymore.  (Note to Daniel Hannan – you’re a leader, not a follower, and so it’s time to switch to UKIP).</p><p>Since the European masses are turning against the EU, the next tactic of the EU elite will be to suborn leaders like the Socialist Hollande, who are elected on moderately anti-EU promises.  I expect Hollande to turn around and stab his left-wing nationalist followers in the back by embracing the austerity programs designed to keep the banks out of default, thus assuring that Marine Le Pen and the National Front will have a real chance of winning the next set of French elections.  But the overall pressure is growing, and so when the bait-and-switch tactics fail, the new European aristocracy will turn to the solution they’ve imposed in Italy and Greece, which is to altogether abandon democratic rule.  Right now, these aristocratic interregnums are short-term, but no doubt another debt or currency crisis will provide the justification for extending them where they already exist and imposing them where they don’t.  The only way they can push for the political and fiscal union for which the monetary union was the bait is by throwing out all but the last vestiges of democratic government.</p><p>But the long-awaited nationalist tide is just beginning to rise, which is an excellent thing considering the monstrous and authoritarian nature of the globalist aristocracy.  The potential problem is that in order to smash the edifice constructed by the ruling aristocracy, the nationalist pendulum will swing farther than it needs to.  Thanks to the machinations of the multiculturalists, there are no shortage of scapegoats readily on hand for the angry and newly nationalistic natives; in fact, one wonders if the elite’s encouragement of mass immigration might have been intended as a means of both distracting and marginalizing the nationalist forces from the start.  Either way, it’s already clear that it won’t work; the National Front won 30 percent of the real French vote and similar results will be seen in other elections across Europe.</p></div>",
  "content_text": "The New York Times asks Tyler Cowen about\nthe present state of the EU\n:\nToday, very few countries in the euro zone are capable of making credible commitments or binding agreements with the others.  Quite simply, democracy is having its say. The French soon may elect a left-wing candidate who, in essence, wants to exempt France from fiscal rules and place more fiscal risk on Germany. The Dutch can no longer form a governmental consensus on the budget. The Irish will be putting the fiscal compact up for a referendum, and the Greeks are holding an election in May. Even in Germany there could be problems holding together the ruling coalition.\nIn general, voters are unwilling to give up their say over policy, or to regard the European Union or euro zone as necessarily superior to national interests. When it comes to the specifics, it appears increasingly likely that at least one national electorate will pull the plug on the entire set of bailouts and austerity programs.\nThere is no way to pull off the required cross-national agreements. Resources are being drained from euro zone banks, which are contracting their lending to business. This will make the current recession worse, which in turn will necessitate further unpopular policies, including cuts in government spending. Euro zone countries will become more nationalistic in hard times, and more likely to vote against incumbent governments, no matter what the specific issue at stake. It is hard to see a stabilizing outcome, so the best bet is on a crack-up of some of Europe’s major economies, including Spain and Italy.\nThere is an old saying in economics, namely “no monetary union without a corresponding fiscal union.” It could be added “no fiscal union without a corresponding electoral union.” In the longer run, we will probably end up with none of these institutions.\nThe euro zone probably was unworkable from the beginning, and now we are seeing why.\nWhat we’re seeing here is the last desperate gasps of democracy as the new aristocratic age struggles to be born.  The outcome of the current crisis is far from certain, but at least we’re now able to see relatively clearly what the most likely possibilities are.\nThe collapse of the Dutch government\nand the surge of the anti-EU National Front in France show that the strategy of the European political elite, which is to offer the people a choice between pro-EU Party A and pro-EU Party B, is no longer working.  Even in the UK, which is slightly insulated from the problems of the Euro thanks to its retention of the pound sterling, the popularity of UKIP is now growing rapidly due to the recognition that there isn’t any meaningful euroskepticism in the Conservative Party anymore.  (Note to Daniel Hannan – you’re a leader, not a follower, and so it’s time to switch to UKIP).\nSince the European masses are turning against the EU, the next tactic of the EU elite will be to suborn leaders like the Socialist Hollande, who are elected on moderately anti-EU promises.  I expect Hollande to turn around and stab his left-wing nationalist followers in the back by embracing the austerity programs designed to keep the banks out of default, thus assuring that Marine Le Pen and the National Front will have a real chance of winning the next set of French elections.  But the overall pressure is growing, and so when the bait-and-switch tactics fail, the new European aristocracy will turn to the solution they’ve imposed in Italy and Greece, which is to altogether abandon democratic rule.  Right now, these aristocratic interregnums are short-term, but no doubt another debt or currency crisis will provide the justification for extending them where they already exist and imposing them where they don’t.  The only way they can push for the political and fiscal union for which the monetary union was the bait is by throwing out all but the last vestiges of democratic government.\nBut the long-awaited nationalist tide is just beginning to rise, which is an excellent thing considering the monstrous and authoritarian nature of the globalist aristocracy.  The potential problem is that in order to smash the edifice constructed by the ruling aristocracy, the nationalist pendulum will swing farther than it needs to.  Thanks to the machinations of the multiculturalists, there are no shortage of scapegoats readily on hand for the angry and newly nationalistic natives; in fact, one wonders if the elite’s encouragement of mass immigration might have been intended as a means of both distracting and marginalizing the nationalist forces from the start.  Either way, it’s already clear that it won’t work; the National Front won 30 percent of the real French vote and similar results will be seen in other elections across Europe.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-24T07:53:00+00:00"
}