{
  "url": "https://voxday.net/2012/04/11/deported/",
  "scraped_at": "2025-12-14T04:51:58.433250",
  "title": "“The Deported”",
  "date_display": "April 11, 2012",
  "date_iso": "2012-04-11T19:00:00+00:00",
  "date_from_url": "2012-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In honor of The Original Cyberpunk belatedly getting <a href=\"http://www.amazon.com/dp/B007T3N0XK\">the March issue of Stupefying Stories</a> out the door, which as I mentioned contains one of my short stories, I’m posting the story that was published in <a href=\"http://www.amazon.com/Stupefying-Stories-October-2011-ebook/dp/B005T5B9YC/ref=sr_1_sc_1?s=digital-text&amp;ie=UTF8&amp;qid=1334162291&amp;sr=1-1-spell\">the October 2011 issue</a>.  Ten points if you can correctly identify the author whose style I imitated here – and if you happen to already know, please keep your mouth shut and let those who don’t see if they can guess it.  “The Deported” was written in keeping with the “ghost story” theme of the October issue, but the most frightening thing about it may be that the Italian town in which it is set was all but destroyed by flooding and mudslides in the same month the anthology was published.</p><p><b>The Deported</b><br> <i>Stupefying Stories</i>, October 2011<br> Vox Day</br></br></p><p>It was the fourth day of our summer holiday in Vernazza, a little fishing village in the Cinque Terre. We had spent the morning on a charming hike through the hills, lunched in Monterosso al Mare, then enjoyed a languid afternoon in the sun on the beach there. After hiking back and taking a brief but restorative nap, the six of us had reconvened for the evening on the terrace overlooking the sea. We were well into our second bottle of prosecco as Francois attempted to convince Bertrand’s wife, Michèle, that one could not genuinely claim to be an atheist and yet still believe in ghosts.</p><p>“There is more to a term than its etymology, <i>ma cherie</i>,” he declared, punctuating his words with an authoritative jab of his cigarette. “When we reject the possibility of existence of gods, we are necessarily rejecting with it the very idea of the supernatural. If one cannot see it, or touch it, or experience it in any material manner, then it is entirely apparent that it simply does not exist.”</p><p>“But what about love?” Michèle protested. She was an intelligent, educated woman, without a religious bone in her slender body, but she did harbor a lamentable affection for crystals, feng shui, and any number of fashionable absurdities. “What about hate?”</p><p>I reached out to place my glass on the side table when I noticed a smile on the face of the young German man sitting to our left. I had seen him before. He arrived in Vernazza the day after us, but apparently alone, for we had not seen him in the company of anyone other than the occasional waiter since then. He nodded to me, which I found to be a little surprising, as we had, of course, been speaking French. The German, for such I naturally assumed him to be, was a big, beefy fellow, with a sun-reddened face and the sort of fine blond hair that is all too liable to disappear before a man’s fortieth year.</p><p>“Pardon me, <i>monsieur</i>, I merely happened to overhear the conversation,” he said in fluent, if provincial, French. “It reminded me of something.”</p><p>“Ghosts or gods?” I asked him. The others, surprised to hear the German speaking our language, stopped talking and turned to listen to us.</p><p>“Perhaps both. Perhaps neither. Who can say?” He gave a shrug that was almost Gallic in its fatalism. “I only know there are things in this world that neither priest nor scientist can explain to my satisfaction. Things I have seen with my own eyes.”</p><p>“Do you believe in God?” Bertrand leaned over and asked in an aggressive tone. He is one of my oldest and dearest friends, but at times, he can be a trial. He lost his beloved father at the age of seven in an automobile accident and has been demanding answers of God and anyone who is foolish enough to admit to believing in God ever since.</p><p>But the blond man only chuckled at his vehemence and raised his glass of red wine in an ironic salute. “I am Swiss. Of course I believe in God. Do we not worship Mammon?”</p><p>“Don’t we all,” Michèle said theatrically. Everyone laughed except Bertrand.</p><p>The Swiss’s name was Beat Kistler. He was, he explained, from an old family in the canton of Zurich, but his mother was Vaudoise and he was awarded a criminology degree by the University of Lausanne. After graduation, he joined the Geneva police force and in his third year was reassigned to a task force assisting the Swiss Federal Migration Office in processing immigrants who were seeking asylum. And it was there, in the detention center, that he had seen something that he found inexplicable, even now. We were all interested to hear his mysterious story, for it was eminently clear that he was an educated and level-headed man. He told us his tale without resort to drama, in a calm and relaxed manner.</p><p>“The first thing you must understand,” he said, “is that most of the asylum seekers we see in the federal system are Africans. Nigerians are the most common. They’re economic migrants, of course, but somewhere along the way, word gets around the community that if they can present themselves as political victims, there is a chance they will be able to receive a residence permit and stay in the country. We can’t allow most of them to remain, you understand, because they have no skills, they have no means of supporting themselves, and they simply cannot afford to live in such an expensive country. The franc is very high, you know. And, in any event, we have no room for them; there literally isn’t anywhere for them to live. The city of Lagos alone has more people than we have in all of Switzerland.</p><p>“The Migration Office reviews about fifteen thousand applicants per year. About a third of them can be sent immediately to other European states, because the Dublin accord requires them to apply for asylum in the state that served as their port of entry. So we send them to Italy, Spain, or in some cases, to you, in France. Another third leave on their own once we explain to them that they will not, under any circumstances, be permitted to remain. But the remainder—ah, well, that is where things occasionally get out of order.</p><p>“You should hear the lies they tell. Many times, they are most amusing. The sort of young men who are adventurous enough to make it all the way to Switzerland from Africa seldom have much in the way of education and so it’s not uncommon for them to fail to properly understand what their legal advisers are telling them to say. So we hear men claiming they are facing female genital mutilation should they be forced to return home, or telling us their entire family was killed in a massacre even though we already have the rejected applications from three of their brothers in our files. Occasionally a story will check out and permission will be granted, but only in the most extreme cases. Out of the two thousand Nigerians who applied last year, I think perhaps one or two were given residence. The rest, we must somehow transport back to their home country.”</p><p>“Only one or two?” my wife protested. “Out of thousands? Surely you could take more!”</p><p>Beat smiled and shook his head. “A fifth of our residents are already foreigners as it is. And recall, none of these people are being oppressed or tortured in any way, in which case we would have a moral duty to help them. They simply want to live off the Swiss people. It’s not possible.”</p><p>“Enough about the Africans, what about the ghosts!” Bertrand was getting impatient.</p><p>“Before you can understand the significance of this, my friends, you must first accept the context of the situation. But I see that you have grasped the general idea, therefore I shall move on to the specific case of which I speak.</p><p>“Two years ago, I met a Nigerian man who did not fit the description of the sort of asylum seekers we are accustomed to see every day. He was older, in his fifties, and instead of giving his religion as either Christian or Muslim, his file showed that he was classified as an animist. The traditional religions are officially recognized in Nigeria, and in fact many of those who call themselves Christians or Muslims still pay due regard to their tribal gods and ancestral spirits.</p><p>“I was tasked to accompany the social worker who was assigned to interview him for his appeal hearing. This was necessary because both the asylum seekers and the deportees are held in detainment facilities, and, like prisoners everywhere, they sometimes get unruly. It’s mostly those who have already been sentenced to deportation, since they have little to lose if they behave badly, but sometimes the asylum seekers forget themselves and get out of hand as well.</p><p>“The contrast between the facilities and the inhabitants is stark. It is literally black and white. Most of the facilities are very new, all squares and fluorescent lighting, with undecorated walls painted white and the ceilings and floors covered with white tile. You cannot imagine a more lifeless and sterile environment. The Nigerians, on the other hand, are very dark-skinned and full of life. When they are happy, they sing and smile, and some of them play a sort of rhythmic music with their hands on the walls to which the others dance. Of course, some of them, particularly the less intelligent, are demoralized by their incarceration. In such cases, their behavior at times borders on the bestial. They glare and they snarl, they beg and they plead, at times they offer their bodies for pleasure, other times they spit at anyone who walks past their cells.</p><p>“This man was not one of the ones who act like animals. He had a dignity to him, and his file showed he had been a man of some substance in Lagos. His brother, now deceased, was a senior official in the Ministry of Finance, but he was closely tied to the progressive opposition party, which accounted for his emigration from the country after the corrupt election of 2007 that was essentially stolen by the party in power today.</p><p>“He spoke English; better English than I do. When the social worker interviewed him, he explained in a very lucid and coherent manner that to return to Nigeria meant death, not only for him, but for everyone around him. The reason he gave was that he had been cursed by an Igbo shaman in the employ of the new finance minister, the same man who was responsible for his brother’s death. He told us he was a shaman himself, but his ancestral spirits had been defeated by the shaman’s spirits during the conflict that surrounded the election in 2007.”</p><p>Michèle and I laughed. Bertrand snorted. “How did the immigration judge view that?”</p><p>“The social worker tried several times to explain to him that his appeal would be rejected, as ancestral spirits are not listed among the potential justifications for asylum accepted by the foreign office, but the Nigerian was absolutely insistent. He said he would not lie and he was absolutely convinced that his return would prove fatal, because the Igbo spirits would not permit it. As I said, he was a serious, dignified man, and if his claim hadn’t been so clearly impossible, one might have almost found it to be persuasive.</p><p>“I don’t know if the social worker actually cited the spirits or how things went at the hearing, all I know is that the appeal was unsuccessful, which of course was hardly surprising. The whole incident was very strange, but at the time I thought nothing more of it until two months later, when my entire unit was summoned in the middle of the night to help the Securitas guards deal with a riot that had broken out at that very facility. We were sent in wearing full riot gear, although we were only armed with mace and batons. We left our shields in the bus they used to bring us there, since they would only get in the way.”</p><p>“You must have been very frightened,” interjected Aurélie, Francois’s partner of the last five years.</p><p>“No, for the most part we were annoyed at being dragged from the comfort of our beds. A few of the more aggressive lads, they were bragging about how they were going to break heads and so forth, you know the type. But mostly we just wanted to go in, get the job done, and hopefully return in time to get a few hours of sleep before the sun came up. I’d been on duty since the morning at the federal court in Bern, so my main feeling was one of exhaustion.</p><p>“Once we entered, we quickly realized it wasn’t a riot. All the lights were out, but the facility technicians said there was no loss of power, which was confusing. Our helmets have flashlights, so we switched them on and entered. There was screaming, but they were screams of terror, not the wordless roaring you hear when a crowd is out of control, and they were coming from somewhere deep inside the building. The asylum seekers were still in their cells, but most of the deportees were gathered in the cafeteria and out of their heads with fear. They weren’t rioting; they’d broken out of their cells because they were all scared to death of something. They greeted us with hugs and tears, as if we were their saviors. Right about then, the screams stopped. I think the sudden silence, more than anything else, started to make us feel nervous.</p><p>“Our captain talked one of them, a big man with a shaved head, into leading us towards the deportee cells from where the screams had been coming. Most of the cells were empty, but then we came upon a cell with a closed door. The captain had the keys, so he unlocked it and discovered two dead Nigerians inside. Their eyes were open, but they were dead and there wasn’t a mark on them. The deportee who was acting as our guide was shaking a little, but he said he was a Jesus man and ‘the shadow that kill’ couldn’t touch him. We passed two more locked cells and found a pair of dead Nigerians inside both of them, and again, the dead men were unmarked.</p><p>“Now remember, it was pitch black down there, except for our helmet lights, which aren’t as powerful as they should be. I thought I heard something, so I took my baton out, shook it out to its full length, and went to investigate. I looked in a cell on the other side of the hall, and first things I saw were two eyes; big, round, white eyes, almost like when your automobile catches a fox’s eyes along the side of the road. Then I saw the rest of it…</p><p>“I must have shouted because there were eight or nine lights shining into the cell almost right away.”</p><p>“The old man, the shaman—,” breathed Francois.</p><p>“Precisely,” nodded the Swiss. “He was crouched over the body of his cellmate, eating his heart!   It was him we had heard screaming earlier; the cellmate, because the shaman had painted all sorts of evil-looking symbols on the walls of their cell in his blood, before finally taking his heart and killing him. He must have been doing it for an hour or more, because the floor was completely covered in blood. When they counted later, there were more than one hundred separate symbols on the walls.”</p><p>“What did the symbols mean?”</p><p>“The psychologists asked him that later. We didn’t ask questions then, you see, we just unlocked the cell, threw open the door, maced him and put him in shackles. There wasn’t anything we could do for the cellmate, of course. But the symbols; that’s the intriguing thing. He told the psychologists they were to summon the spirits of the Igbo ancestors and offer them the lives of the men in the cells around him as an attempt to appease them. He said the six men who died in the other cells meant that his offering had been accepted, but it was all to no avail since we had interrupted him before he could finish the ritual. His cellmate was Igbo, so that’s why he had to eat his heart; to sort of make himself Igbo, in a way, so the spirits would see him as one of theirs and leave him alone when he returned to Lagos.”</p><p>“That sounds rather heartless of the man,” Bertrand commented wryly.</p><p>“Bertrand!” Michèle protested. “But didn’t you say you had to unlock his cell when you found him?”</p><p>“It was definitely locked. So were the other cells. But the other men were definitely dead as well and the times of their deaths were consistent with the time that the lights went out and the riot started.”</p><p>“Interesting,” mused Bertrand. “Of course, these other Nigerians were uneducated, superstitious, and more or less animists for the most part. Therefore, it is safe to assume they were highly susceptible to suggestion. You said that even the Christian man was terrified. So, if they knew he was a shaman and became aware of what he intended, it’s entirely possible that they were quite literally frightened to death!”</p><p>“But that doesn’t explain the lights,” I pointed out.</p><p>“That might have merely been an unfortunate coincidence.”</p><p>“The lights came on a few minutes after we maced the shaman,” the Swiss explained. “But that’s not the end of my story. Three months after the riot, my friend Walther and I were assigned to the squad that accompanies the deportation flight to Lagos. When we reviewed the deportee list, I recognized one of the names as belonging to the man I’d last seen devouring his companion’s heart. I will not lie; at that moment I felt such a fear as I have never known before. I heard no voice, but suddenly I understood the message, as clearly as you hear me speak to you now, that I should not, under any circumstances, board that flight. The ancestral spirits had been strong enough to kill six healthy young men a continent away—and the ritual to appease them was a failure.</p><p>“I made some excuse to my captain, told him I was unwell or something, I don’t recall. To my shame, I did not do more than make a half-hearted attempt to convince Walther to avoid the flight as well. I arranged to have lunch with him, but when I mentioned my fears, he laughed at me for being an irrational, superstitious fool and I was too embarrassed to argue the point with him. I bitterly regretted that a week later, when I received a telephone call from my captain. He told me that the Swiss flight from Zurich to Lagos had gone down not long after entering Nigerian airspace. There were no survivors.”</p><p>“Oh my God,” breathed Michèle.</p><p>“How awful for you,” said my wife.</p><p>The Swiss only smiled ruefully and lit a cigarette. He inhaled thoughtfully, and tapped out the small amount of ash on the tip. “Rather more awful for Walther and the others, I should think.”</p><p>“What caused the crash?” I asked. “I can’t imagine the aviation authorities attributed it to angry ancestral spirits.”</p><p>“After the black box was analyzed, the experts concluded that the co-pilot had fallen asleep and the pilot had a heart attack. But to my mind, that sounds like an attempt to explain away the inexplicable. There was no mechanical failure; no signs of distress from the cockpit. Unfortunately the plane burned, so conjecture was all that was left to them, in the absence of anything conclusive from the black box.”</p><p>He looked at Bertrand. “So, have you an explanation for me, other than an unfortunate string of unlikely coincidences?”</p><p>Bertrand, to his credit, wasn’t inclined to bluster. “I fear you have anticipated me, <i>monsieur</i>. Of course, I am hardly an expert on aviation.”</p><p>We were all quick to protest the idea that Bertrand might be anything less than expert on everything. It was an old joke among us. Amidst the laughter, the Swiss extinguished his cigarette and rose from his chair.</p><p>“Ladies, gentlemen, I bid you <i>une bonne soirée</i> and a pleasant remainder to your vacation. And I hope my little tale has not disturbed you.”</p><p>Bertrand and I hastened to assure him that it was impossible, as we had enjoyed it immensely. Were we not all français, hailing from that most rational of nations? We bade him farewell, and the last we saw of him was his broad back, as he returned to the bar inside.</p><p>But later that evening, as my wife slept by my side, there was a soft knock on my door. It was Bertrand, and he was holding his iPad. “Come outside and look at this,” he whispered.</p><p>I followed him out to the patio where we had been drinking earlier that evening. We could hear the sound of the sea below us, but where there had been a broad expanse of clear blue water only a few hours before, there was now nothing but a vast black emptiness, devoid of reflections from the shore or even the pinpricks of starlight that animated the night sky above. The glow of the tablet screen was so bright against the darkness that it was almost painful to my eyes. And what had been unthinkable under the warm glow of the Italian sun suddenly seemed all too possible, when standing above the inky abyss of the Mediterranean at midnight.</p><p>“I looked it up. A flight from Zurich to Lagos that was carrying twenty deportees, eight police, and the two pilots went down about eighteen months ago.”</p><p>“So that much was true, anyhow.”</p><p>We stared out at the black depths of the sea. It was a quiet evening and the Moon was obscured by clouds that had crept in under the cover of darkness. The waves lapped at the rocky shoreline hundreds of meters below us, indifferent, mindless, uncaring, exactly as they had one thousand, two thousand, three thousand years ago.</p><p>“This doesn’t prove anything about the existence of ghosts, much less God,” Bertrand suddenly declared.</p><p>“Of course not,” I said. “But still….”</p><p>“But still,” he agreed.</p></div>",
  "content_text": "In honor of The Original Cyberpunk belatedly getting\nthe March issue of Stupefying Stories\nout the door, which as I mentioned contains one of my short stories, I’m posting the story that was published in\nthe October 2011 issue\n.  Ten points if you can correctly identify the author whose style I imitated here – and if you happen to already know, please keep your mouth shut and let those who don’t see if they can guess it.  “The Deported” was written in keeping with the “ghost story” theme of the October issue, but the most frightening thing about it may be that the Italian town in which it is set was all but destroyed by flooding and mudslides in the same month the anthology was published.\nThe Deported\nStupefying Stories\n, October 2011\nVox Day\nIt was the fourth day of our summer holiday in Vernazza, a little fishing village in the Cinque Terre. We had spent the morning on a charming hike through the hills, lunched in Monterosso al Mare, then enjoyed a languid afternoon in the sun on the beach there. After hiking back and taking a brief but restorative nap, the six of us had reconvened for the evening on the terrace overlooking the sea. We were well into our second bottle of prosecco as Francois attempted to convince Bertrand’s wife, Michèle, that one could not genuinely claim to be an atheist and yet still believe in ghosts.\n“There is more to a term than its etymology,\nma cherie\n,” he declared, punctuating his words with an authoritative jab of his cigarette. “When we reject the possibility of existence of gods, we are necessarily rejecting with it the very idea of the supernatural. If one cannot see it, or touch it, or experience it in any material manner, then it is entirely apparent that it simply does not exist.”\n“But what about love?” Michèle protested. She was an intelligent, educated woman, without a religious bone in her slender body, but she did harbor a lamentable affection for crystals, feng shui, and any number of fashionable absurdities. “What about hate?”\nI reached out to place my glass on the side table when I noticed a smile on the face of the young German man sitting to our left. I had seen him before. He arrived in Vernazza the day after us, but apparently alone, for we had not seen him in the company of anyone other than the occasional waiter since then. He nodded to me, which I found to be a little surprising, as we had, of course, been speaking French. The German, for such I naturally assumed him to be, was a big, beefy fellow, with a sun-reddened face and the sort of fine blond hair that is all too liable to disappear before a man’s fortieth year.\n“Pardon me,\nmonsieur\n, I merely happened to overhear the conversation,” he said in fluent, if provincial, French. “It reminded me of something.”\n“Ghosts or gods?” I asked him. The others, surprised to hear the German speaking our language, stopped talking and turned to listen to us.\n“Perhaps both. Perhaps neither. Who can say?” He gave a shrug that was almost Gallic in its fatalism. “I only know there are things in this world that neither priest nor scientist can explain to my satisfaction. Things I have seen with my own eyes.”\n“Do you believe in God?” Bertrand leaned over and asked in an aggressive tone. He is one of my oldest and dearest friends, but at times, he can be a trial. He lost his beloved father at the age of seven in an automobile accident and has been demanding answers of God and anyone who is foolish enough to admit to believing in God ever since.\nBut the blond man only chuckled at his vehemence and raised his glass of red wine in an ironic salute. “I am Swiss. Of course I believe in God. Do we not worship Mammon?”\n“Don’t we all,” Michèle said theatrically. Everyone laughed except Bertrand.\nThe Swiss’s name was Beat Kistler. He was, he explained, from an old family in the canton of Zurich, but his mother was Vaudoise and he was awarded a criminology degree by the University of Lausanne. After graduation, he joined the Geneva police force and in his third year was reassigned to a task force assisting the Swiss Federal Migration Office in processing immigrants who were seeking asylum. And it was there, in the detention center, that he had seen something that he found inexplicable, even now. We were all interested to hear his mysterious story, for it was eminently clear that he was an educated and level-headed man. He told us his tale without resort to drama, in a calm and relaxed manner.\n“The first thing you must understand,” he said, “is that most of the asylum seekers we see in the federal system are Africans. Nigerians are the most common. They’re economic migrants, of course, but somewhere along the way, word gets around the community that if they can present themselves as political victims, there is a chance they will be able to receive a residence permit and stay in the country. We can’t allow most of them to remain, you understand, because they have no skills, they have no means of supporting themselves, and they simply cannot afford to live in such an expensive country. The franc is very high, you know. And, in any event, we have no room for them; there literally isn’t anywhere for them to live. The city of Lagos alone has more people than we have in all of Switzerland.\n“The Migration Office reviews about fifteen thousand applicants per year. About a third of them can be sent immediately to other European states, because the Dublin accord requires them to apply for asylum in the state that served as their port of entry. So we send them to Italy, Spain, or in some cases, to you, in France. Another third leave on their own once we explain to them that they will not, under any circumstances, be permitted to remain. But the remainder—ah, well, that is where things occasionally get out of order.\n“You should hear the lies they tell. Many times, they are most amusing. The sort of young men who are adventurous enough to make it all the way to Switzerland from Africa seldom have much in the way of education and so it’s not uncommon for them to fail to properly understand what their legal advisers are telling them to say. So we hear men claiming they are facing female genital mutilation should they be forced to return home, or telling us their entire family was killed in a massacre even though we already have the rejected applications from three of their brothers in our files. Occasionally a story will check out and permission will be granted, but only in the most extreme cases. Out of the two thousand Nigerians who applied last year, I think perhaps one or two were given residence. The rest, we must somehow transport back to their home country.”\n“Only one or two?” my wife protested. “Out of thousands? Surely you could take more!”\nBeat smiled and shook his head. “A fifth of our residents are already foreigners as it is. And recall, none of these people are being oppressed or tortured in any way, in which case we would have a moral duty to help them. They simply want to live off the Swiss people. It’s not possible.”\n“Enough about the Africans, what about the ghosts!” Bertrand was getting impatient.\n“Before you can understand the significance of this, my friends, you must first accept the context of the situation. But I see that you have grasped the general idea, therefore I shall move on to the specific case of which I speak.\n“Two years ago, I met a Nigerian man who did not fit the description of the sort of asylum seekers we are accustomed to see every day. He was older, in his fifties, and instead of giving his religion as either Christian or Muslim, his file showed that he was classified as an animist. The traditional religions are officially recognized in Nigeria, and in fact many of those who call themselves Christians or Muslims still pay due regard to their tribal gods and ancestral spirits.\n“I was tasked to accompany the social worker who was assigned to interview him for his appeal hearing. This was necessary because both the asylum seekers and the deportees are held in detainment facilities, and, like prisoners everywhere, they sometimes get unruly. It’s mostly those who have already been sentenced to deportation, since they have little to lose if they behave badly, but sometimes the asylum seekers forget themselves and get out of hand as well.\n“The contrast between the facilities and the inhabitants is stark. It is literally black and white. Most of the facilities are very new, all squares and fluorescent lighting, with undecorated walls painted white and the ceilings and floors covered with white tile. You cannot imagine a more lifeless and sterile environment. The Nigerians, on the other hand, are very dark-skinned and full of life. When they are happy, they sing and smile, and some of them play a sort of rhythmic music with their hands on the walls to which the others dance. Of course, some of them, particularly the less intelligent, are demoralized by their incarceration. In such cases, their behavior at times borders on the bestial. They glare and they snarl, they beg and they plead, at times they offer their bodies for pleasure, other times they spit at anyone who walks past their cells.\n“This man was not one of the ones who act like animals. He had a dignity to him, and his file showed he had been a man of some substance in Lagos. His brother, now deceased, was a senior official in the Ministry of Finance, but he was closely tied to the progressive opposition party, which accounted for his emigration from the country after the corrupt election of 2007 that was essentially stolen by the party in power today.\n“He spoke English; better English than I do. When the social worker interviewed him, he explained in a very lucid and coherent manner that to return to Nigeria meant death, not only for him, but for everyone around him. The reason he gave was that he had been cursed by an Igbo shaman in the employ of the new finance minister, the same man who was responsible for his brother’s death. He told us he was a shaman himself, but his ancestral spirits had been defeated by the shaman’s spirits during the conflict that surrounded the election in 2007.”\nMichèle and I laughed. Bertrand snorted. “How did the immigration judge view that?”\n“The social worker tried several times to explain to him that his appeal would be rejected, as ancestral spirits are not listed among the potential justifications for asylum accepted by the foreign office, but the Nigerian was absolutely insistent. He said he would not lie and he was absolutely convinced that his return would prove fatal, because the Igbo spirits would not permit it. As I said, he was a serious, dignified man, and if his claim hadn’t been so clearly impossible, one might have almost found it to be persuasive.\n“I don’t know if the social worker actually cited the spirits or how things went at the hearing, all I know is that the appeal was unsuccessful, which of course was hardly surprising. The whole incident was very strange, but at the time I thought nothing more of it until two months later, when my entire unit was summoned in the middle of the night to help the Securitas guards deal with a riot that had broken out at that very facility. We were sent in wearing full riot gear, although we were only armed with mace and batons. We left our shields in the bus they used to bring us there, since they would only get in the way.”\n“You must have been very frightened,” interjected Aurélie, Francois’s partner of the last five years.\n“No, for the most part we were annoyed at being dragged from the comfort of our beds. A few of the more aggressive lads, they were bragging about how they were going to break heads and so forth, you know the type. But mostly we just wanted to go in, get the job done, and hopefully return in time to get a few hours of sleep before the sun came up. I’d been on duty since the morning at the federal court in Bern, so my main feeling was one of exhaustion.\n“Once we entered, we quickly realized it wasn’t a riot. All the lights were out, but the facility technicians said there was no loss of power, which was confusing. Our helmets have flashlights, so we switched them on and entered. There was screaming, but they were screams of terror, not the wordless roaring you hear when a crowd is out of control, and they were coming from somewhere deep inside the building. The asylum seekers were still in their cells, but most of the deportees were gathered in the cafeteria and out of their heads with fear. They weren’t rioting; they’d broken out of their cells because they were all scared to death of something. They greeted us with hugs and tears, as if we were their saviors. Right about then, the screams stopped. I think the sudden silence, more than anything else, started to make us feel nervous.\n“Our captain talked one of them, a big man with a shaved head, into leading us towards the deportee cells from where the screams had been coming. Most of the cells were empty, but then we came upon a cell with a closed door. The captain had the keys, so he unlocked it and discovered two dead Nigerians inside. Their eyes were open, but they were dead and there wasn’t a mark on them. The deportee who was acting as our guide was shaking a little, but he said he was a Jesus man and ‘the shadow that kill’ couldn’t touch him. We passed two more locked cells and found a pair of dead Nigerians inside both of them, and again, the dead men were unmarked.\n“Now remember, it was pitch black down there, except for our helmet lights, which aren’t as powerful as they should be. I thought I heard something, so I took my baton out, shook it out to its full length, and went to investigate. I looked in a cell on the other side of the hall, and first things I saw were two eyes; big, round, white eyes, almost like when your automobile catches a fox’s eyes along the side of the road. Then I saw the rest of it…\n“I must have shouted because there were eight or nine lights shining into the cell almost right away.”\n“The old man, the shaman—,” breathed Francois.\n“Precisely,” nodded the Swiss. “He was crouched over the body of his cellmate, eating his heart!   It was him we had heard screaming earlier; the cellmate, because the shaman had painted all sorts of evil-looking symbols on the walls of their cell in his blood, before finally taking his heart and killing him. He must have been doing it for an hour or more, because the floor was completely covered in blood. When they counted later, there were more than one hundred separate symbols on the walls.”\n“What did the symbols mean?”\n“The psychologists asked him that later. We didn’t ask questions then, you see, we just unlocked the cell, threw open the door, maced him and put him in shackles. There wasn’t anything we could do for the cellmate, of course. But the symbols; that’s the intriguing thing. He told the psychologists they were to summon the spirits of the Igbo ancestors and offer them the lives of the men in the cells around him as an attempt to appease them. He said the six men who died in the other cells meant that his offering had been accepted, but it was all to no avail since we had interrupted him before he could finish the ritual. His cellmate was Igbo, so that’s why he had to eat his heart; to sort of make himself Igbo, in a way, so the spirits would see him as one of theirs and leave him alone when he returned to Lagos.”\n“That sounds rather heartless of the man,” Bertrand commented wryly.\n“Bertrand!” Michèle protested. “But didn’t you say you had to unlock his cell when you found him?”\n“It was definitely locked. So were the other cells. But the other men were definitely dead as well and the times of their deaths were consistent with the time that the lights went out and the riot started.”\n“Interesting,” mused Bertrand. “Of course, these other Nigerians were uneducated, superstitious, and more or less animists for the most part. Therefore, it is safe to assume they were highly susceptible to suggestion. You said that even the Christian man was terrified. So, if they knew he was a shaman and became aware of what he intended, it’s entirely possible that they were quite literally frightened to death!”\n“But that doesn’t explain the lights,” I pointed out.\n“That might have merely been an unfortunate coincidence.”\n“The lights came on a few minutes after we maced the shaman,” the Swiss explained. “But that’s not the end of my story. Three months after the riot, my friend Walther and I were assigned to the squad that accompanies the deportation flight to Lagos. When we reviewed the deportee list, I recognized one of the names as belonging to the man I’d last seen devouring his companion’s heart. I will not lie; at that moment I felt such a fear as I have never known before. I heard no voice, but suddenly I understood the message, as clearly as you hear me speak to you now, that I should not, under any circumstances, board that flight. The ancestral spirits had been strong enough to kill six healthy young men a continent away—and the ritual to appease them was a failure.\n“I made some excuse to my captain, told him I was unwell or something, I don’t recall. To my shame, I did not do more than make a half-hearted attempt to convince Walther to avoid the flight as well. I arranged to have lunch with him, but when I mentioned my fears, he laughed at me for being an irrational, superstitious fool and I was too embarrassed to argue the point with him. I bitterly regretted that a week later, when I received a telephone call from my captain. He told me that the Swiss flight from Zurich to Lagos had gone down not long after entering Nigerian airspace. There were no survivors.”\n“Oh my God,” breathed Michèle.\n“How awful for you,” said my wife.\nThe Swiss only smiled ruefully and lit a cigarette. He inhaled thoughtfully, and tapped out the small amount of ash on the tip. “Rather more awful for Walther and the others, I should think.”\n“What caused the crash?” I asked. “I can’t imagine the aviation authorities attributed it to angry ancestral spirits.”\n“After the black box was analyzed, the experts concluded that the co-pilot had fallen asleep and the pilot had a heart attack. But to my mind, that sounds like an attempt to explain away the inexplicable. There was no mechanical failure; no signs of distress from the cockpit. Unfortunately the plane burned, so conjecture was all that was left to them, in the absence of anything conclusive from the black box.”\nHe looked at Bertrand. “So, have you an explanation for me, other than an unfortunate string of unlikely coincidences?”\nBertrand, to his credit, wasn’t inclined to bluster. “I fear you have anticipated me,\nmonsieur\n. Of course, I am hardly an expert on aviation.”\nWe were all quick to protest the idea that Bertrand might be anything less than expert on everything. It was an old joke among us. Amidst the laughter, the Swiss extinguished his cigarette and rose from his chair.\n“Ladies, gentlemen, I bid you\nune bonne soirée\nand a pleasant remainder to your vacation. And I hope my little tale has not disturbed you.”\nBertrand and I hastened to assure him that it was impossible, as we had enjoyed it immensely. Were we not all français, hailing from that most rational of nations? We bade him farewell, and the last we saw of him was his broad back, as he returned to the bar inside.\nBut later that evening, as my wife slept by my side, there was a soft knock on my door. It was Bertrand, and he was holding his iPad. “Come outside and look at this,” he whispered.\nI followed him out to the patio where we had been drinking earlier that evening. We could hear the sound of the sea below us, but where there had been a broad expanse of clear blue water only a few hours before, there was now nothing but a vast black emptiness, devoid of reflections from the shore or even the pinpricks of starlight that animated the night sky above. The glow of the tablet screen was so bright against the darkness that it was almost painful to my eyes. And what had been unthinkable under the warm glow of the Italian sun suddenly seemed all too possible, when standing above the inky abyss of the Mediterranean at midnight.\n“I looked it up. A flight from Zurich to Lagos that was carrying twenty deportees, eight police, and the two pilots went down about eighteen months ago.”\n“So that much was true, anyhow.”\nWe stared out at the black depths of the sea. It was a quiet evening and the Moon was obscured by clouds that had crept in under the cover of darkness. The waves lapped at the rocky shoreline hundreds of meters below us, indifferent, mindless, uncaring, exactly as they had one thousand, two thousand, three thousand years ago.\n“This doesn’t prove anything about the existence of ghosts, much less God,” Bertrand suddenly declared.\n“Of course not,” I said. “But still….”\n“But still,” he agreed.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-11T18:00:00+00:00"
}