{
  "url": "https://voxday.net/2012/04/16/derbyshire/",
  "scraped_at": "2025-12-14T04:52:13.108717",
  "title": "Interview with John Derbyshire",
  "date_display": "April 16, 2012",
  "date_iso": "2012-04-16T04:01:00+00:00",
  "date_from_url": "2012-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed the “summarily executed” ex-National Review writer about his controversial magazine article on April 10th, 2012:</i></p><p><b>Somehow you managed to turn yourself into a bigger media discussion point than the guy who went and shot five people out in Tulsa.  That seems a little ironic in light of concerns regarding racism in America.</b></p><p>I think it was two guys who did the shooting, two guys were arrested.</p><p><b>That’s right.  But it just seems odd that some advice to your children on dealing with race in America somehow trumps actually going out and shooting people.  I find it remarkable that the media considers the John Derbyshire story to be more significant and indicative of racial problems in America than a pair of folks going around shooting and killing black people.</b></p><p>I think you may be exaggerating there, Vox.  I read a prominent newspaper every morning and the Tulsa shootings have been in that newspaper and I have not.</p><p><b>I’ve seen stories about you in the Guardian and other UK newspapers.</b></p><p>Oh, I got a notice in the Russian press too.  A Russian friend sent me something all in Russian.  It was quite well done.  So yeah, I’m a worldwide sensation.  Fifteen minutes of fame or what?</p><p><b>After all this time and all you’ve written, is it surprising that this article should be the one to which everyone pays attention?</b></p><p>It is a bit surprising, yes.  I’m a bit surprised.  I didn’t think there was anything that much out of the ordinary in it.  I’ve written similar things before and the tone wasn’t anything sensational.  It’s an odd thing.  People pick these things up and they buzz around for a few days… that’s the news business.</p><p><b>I was impressed with Mark Steyn’s defense of your article, or rather, your employment by National Review.  Was it disappointing to see the opinions of Ramesh Ponnuru, Jonah Goldberg, and some of the others who took the opposite position?</b></p><p>You know, Vox, I have to confess I try not to read negative stuff about myself.  You can call that cowardice if you like.  The way I look at it is why spoil my digestion?  But I’ve been going by friends who have pointed me to various things, a friend sent me an email saying Goldberg’s really slagged off on you.  Okay, fine, so I’m not going to read Goldberg.  But friends did email me and said Mark Steyn’s put up a very good and thoughtful piece and you really should go and look at it.  So I did read Mark’s piece and yes, I thought it was very judicious, very well done.  And that nice little quip about if stuff published on Taki’s Magazine is so outrageous, why is Taki still on the National Review masthead.  So yeah, I really did like Mark’s piece.  The other pieces, I don’t know, as I said, I try not to read negative stuff about myself.  Why upset yourself?</p><p><b>For the most part, there’s been a tremendous amount of support for you across the right blogosphere, whereas there hasn’t been much defense of Rich Lowry’s position except by the other writers at National Review.  I would estimate that eighty to eighty-five percent of the comments have been running in your favor.  I thought that was really striking, because I’m not sure that would have been the case ten years ago.</b></p><p>Do you mean the comments on the National Review blog?</p><p><b>I mean the comments on pretty much every blog where it’s been discussed, with the exception of the left-wing blogs where the competition is to see who can feign the most outrage.</b></p><p>I am in quite high spirits because I’ve had tremendous email support.  I’ve had hundreds of emails and I’m going to have to do some collective thank you for them somewhere because I’ve totally given up trying to deal with them.  I’d answer a dozen and forty more would come up in the meantime.  It’s been almost a tsunami.  I’m taking my life in my hands here, I know, but almost none of them have been negative even though my email address is right there on my web page.  I think by the time I got through the first few dozen, there were two negative ones.  And they weren’t vituperative, they were sarcastic and sneering, but they weren’t horrible.  Everything else was really positive and supportive.  That’s just tremendous, I’m really heartened by it.  I am going to read them all.  I can’t possibly answer them all, but I am going to read them all.  People have been great.</p><p><b>I get the definite impression that something has changed.  You talk about how 50 years ago, you would have had some different opinions more in line with the Standard Model view of race.  And certainly 20 years ago, the reflexive anti-racist position was the normal one in educated society.  But now things have changed and people are much less terrified of having the race card waved at them.  Have you noticed that yourself?</b></p><p>There are a number of things in play there.  One, which I’ve written about more than once, I think, in the United States, is just despair.  I am of a certain age, and I was around 50 years ago.  I was reading the newspapers and following world events and I remember the civil rights movement.  I was in England, but we followed it.  I remember it, I remember what we felt about it, and what people were writing about it.  It was full of hope.  The idea in everyone’s mind was that if we strike down these unjust laws and we outlaw all this discrimination, then we’ll be whole.  Then America will be made whole.  After an intermediate period of a few years, who knows, maybe 20 years, with a hand up from things like affirmative action, black America will just merge into the general population and the whole thing will just go away.  That’s what everybody believed.  Everybody thought that.  And it didn’t happen.</p><p>Here we are, we’re 50 years later, and we’ve still got these tremendous disparities in crime rates, educational attainment, and so on.  And I think, although they’re still mouthing the platitudes, Americans in their hearts feel a kind of cold despair about it.  They feel that Thomas Jefferson was probably right and we can’t live together in harmony.  I think that’s why you see this slow ethnic disaggregation.  We have a very segregated school system now.  There are schools within 10 miles of where I’m sitting that are 98 percent minority.  In residential housing too, it’s the same thing.  So I think there is a cold, dark despair lurking in America’s collective heart about the whole thing.  That’s one factor.  Another factor is the Internet, especially YouTube.  Now, you can log on any morning to the Drudge Report and see videos of crowds of black Americans misbehaving.  Maybe there should be some videos of white Americans misbehaving, but there just aren’t that many.  People are seeing these things and it’s fortifying that despair.</p><p>I’m a bit scared of it, it’s making us kind of cold.  But we’re still mouthing the platitudes.  It’s something happening under the surface and it hasn’t really come to the surface yet except perhaps in reaction to events like this.  But I do think that in our innermost hearts we’re in a state of despair.</p><p><b>One of the things I’ve noticed, living in Europe, is that Europeans really don’t get the American racial obsession.  It’s pretty clear that approved racial etiquette in the United States is not normal and one wonders how long it can last.</b></p><p>That’s always been the case to some degree.  Back in the 1930s, Agatha Christie wrote a book called “10 Little N-words”.  Do you know that book?</p><p><b>I do.</b></p><p>That wasn’t the title of the book of course.  I’m trying to observe the proprieties.  It was published like that in Britain, but her American publisher wouldn’t publish it under that title.  The American publication was “And Then There Were None”.</p><p>That was before World War II, in the 1940s.  But it was published under the original name in England until the 1960s, well into the 1960s.  So we’ve had this difference in sensibilities between polite, well-educated, upper middle class Americans and Europeans for a long time.  We’ve always had that.  But contra that, it seems to me, based on reading the newspapers, that the British are even more prissy than the Americans about these things.  We’re constantly hearing about somebody getting prosecuted for yelling a racist word at a soccer player or something like that.</p><p><b>I exchanged some email with Jonah Goldberg about this and the thing that really appeared to bother him, and the thing that appears to have bothered your other critics the most, was the idea that one should not stop and offer assistance to a black individual in apparent distress.  Obviously, you’re not a Christian, so barring any sort of Good Samaritan Christian duty, why do you think there’s been such a negative response to that particular piece of advice.</b></p><p>I must say, I think they have a point.  If I was to write it over again, that would be just about the one thing I would change.  I actually wanted to add some qualifiers to that point, just to tell people to be more wary in that situation, but you know, I’m a writer and I was over my allotted word count.  I would rewrite that if I could.  But again, I’m giving advice to kids and kids don’t have much judgment.  I do think you need more judgment in a situation like that and I put a link to where it happened.  You get a regular trickle of stories about people who have tried to help in those situations and come to grief, where they’ve been turned on or its been some kind of con.</p><p><b>I noticed you used the words “apparent distress” in your article.  I thought it was fairly obvious you were indicating that not all distress is necessarily real and sometimes it’s a trap.</b></p><p>Yeah, and if you’re giving advice to kids, they don’t have the judgment to know what’s a trap and what isn’t.  I don’t think it’s that bad advice even as it stands.  But it’s the one thing I would have elaborated on if I’d had more words to use.</p><p><b>One thing I think people neglect to consider about the Good Samaritan is that he wouldn’t have been in any position to help the man if he didn’t have an animal to put the guy on, money to pay his medical bills and leave him in the inn for a couple of days.</b></p><p>(Laughs)  Come on now, Vox.  You’re lawyering it.  I’ve made my semi-apology, let’s leave it at that.</p><p><b>Fair enough, fair enough.  So Mark Steyn referred to what he called your “summary execution” by Lowry.  Was it really that summary?  Were you given any opportunity to walk yourself back or was it just a case of you’ve stuck your head in it, so off with your head?  Lowry seemed to view the article as some sort of resignation, was that your intention?</b></p><p>Not at all.  I thought it was just a routine piece.</p><p><b>The other theory that was making the rounds was that your obvious guilt could be mitigated by the fact that you’d been affected by your cancer treatments.  Is there any veracity to that?</b></p><p>Nope, I don’t believe that at all.  I’m on a monthly chemotherapy cycle and at the beginning of the cycle, where they pump the poison into you, you really are out of it for a few days.  But then, a couple of weeks later, you’re back pretty much to normal.  And that piece was written at the end of the cycle, so, no, I don’t believe it’s got anything to do with it.</p><p><b>National Review has a long and rather Stalinist history of purging its writers, including Joe Sobran, Samuel Francis, Ann Coulter, and now you.  Is this part of National Review’s culture or is there something else going on there?</b></p><p>On National Review’s behalf, let me just correct you on Coulter.  She wasn’t a National Review employee, they just syndicated her column and they stopped syndicating it.  I think that was all that happened there.  I’m sorry to sound defensive on National Review’s behalf, but it is something they have to do, to some degree.  I actually spoke to Bill Buckley about this a couple of times.  As a committed conservative, it hurts to say this, but there are a lot of crazy people on the political right and if you’re going to have any kind of presentation in the media marketplace at all, you do have to keep fending them off.  Unfortunately, it’s a matter of judgment about which ones you fend off and which ones you let into the tent.  It’s awfully hard to get right, and I know, Bill Buckley had said to me, that he didn’t think he’d always gotten it exactly right.  It’s an approximate art.  You sometimes boot out the wrong person and sometimes keep in the wrong person.  Bill called it a policing exercise and it does have to be done.  If you’re going to be a, oh dear, respectable publication, and get your ideas out there in the marketplace, you do have to draw a line against the craziest of the crazies.  It’s not an easy line to draw.  It’s not an easy judgment to make.  Sometimes you get it wrong.  I think Bill got it wrong with Sam Francis.</p><p><b>You sound remarkably comfortable having been found to be on the wrong side of the line.</b></p><p>Well, I say again, it’s a hard thing to get right.  Did Rich Lowry get it right in my case?  You be the judge.</p><p><b>Who will be the next to be purged at National Review?  Most of the betting money is going towards Mark Steyn or Victor Davis Hanson.</b></p><p>What, no Mark Krikorian?  No, VDH and Mark Steyn will have positions at National Review as long as they want them.  VDH will self-purge before it becomes necessary to excommunicate him.</p></div>",
  "content_text": "Vox Day interviewed the “summarily executed” ex-National Review writer about his controversial magazine article on April 10th, 2012:\nSomehow you managed to turn yourself into a bigger media discussion point than the guy who went and shot five people out in Tulsa.  That seems a little ironic in light of concerns regarding racism in America.\nI think it was two guys who did the shooting, two guys were arrested.\nThat’s right.  But it just seems odd that some advice to your children on dealing with race in America somehow trumps actually going out and shooting people.  I find it remarkable that the media considers the John Derbyshire story to be more significant and indicative of racial problems in America than a pair of folks going around shooting and killing black people.\nI think you may be exaggerating there, Vox.  I read a prominent newspaper every morning and the Tulsa shootings have been in that newspaper and I have not.\nI’ve seen stories about you in the Guardian and other UK newspapers.\nOh, I got a notice in the Russian press too.  A Russian friend sent me something all in Russian.  It was quite well done.  So yeah, I’m a worldwide sensation.  Fifteen minutes of fame or what?\nAfter all this time and all you’ve written, is it surprising that this article should be the one to which everyone pays attention?\nIt is a bit surprising, yes.  I’m a bit surprised.  I didn’t think there was anything that much out of the ordinary in it.  I’ve written similar things before and the tone wasn’t anything sensational.  It’s an odd thing.  People pick these things up and they buzz around for a few days… that’s the news business.\nI was impressed with Mark Steyn’s defense of your article, or rather, your employment by National Review.  Was it disappointing to see the opinions of Ramesh Ponnuru, Jonah Goldberg, and some of the others who took the opposite position?\nYou know, Vox, I have to confess I try not to read negative stuff about myself.  You can call that cowardice if you like.  The way I look at it is why spoil my digestion?  But I’ve been going by friends who have pointed me to various things, a friend sent me an email saying Goldberg’s really slagged off on you.  Okay, fine, so I’m not going to read Goldberg.  But friends did email me and said Mark Steyn’s put up a very good and thoughtful piece and you really should go and look at it.  So I did read Mark’s piece and yes, I thought it was very judicious, very well done.  And that nice little quip about if stuff published on Taki’s Magazine is so outrageous, why is Taki still on the National Review masthead.  So yeah, I really did like Mark’s piece.  The other pieces, I don’t know, as I said, I try not to read negative stuff about myself.  Why upset yourself?\nFor the most part, there’s been a tremendous amount of support for you across the right blogosphere, whereas there hasn’t been much defense of Rich Lowry’s position except by the other writers at National Review.  I would estimate that eighty to eighty-five percent of the comments have been running in your favor.  I thought that was really striking, because I’m not sure that would have been the case ten years ago.\nDo you mean the comments on the National Review blog?\nI mean the comments on pretty much every blog where it’s been discussed, with the exception of the left-wing blogs where the competition is to see who can feign the most outrage.\nI am in quite high spirits because I’ve had tremendous email support.  I’ve had hundreds of emails and I’m going to have to do some collective thank you for them somewhere because I’ve totally given up trying to deal with them.  I’d answer a dozen and forty more would come up in the meantime.  It’s been almost a tsunami.  I’m taking my life in my hands here, I know, but almost none of them have been negative even though my email address is right there on my web page.  I think by the time I got through the first few dozen, there were two negative ones.  And they weren’t vituperative, they were sarcastic and sneering, but they weren’t horrible.  Everything else was really positive and supportive.  That’s just tremendous, I’m really heartened by it.  I am going to read them all.  I can’t possibly answer them all, but I am going to read them all.  People have been great.\nI get the definite impression that something has changed.  You talk about how 50 years ago, you would have had some different opinions more in line with the Standard Model view of race.  And certainly 20 years ago, the reflexive anti-racist position was the normal one in educated society.  But now things have changed and people are much less terrified of having the race card waved at them.  Have you noticed that yourself?\nThere are a number of things in play there.  One, which I’ve written about more than once, I think, in the United States, is just despair.  I am of a certain age, and I was around 50 years ago.  I was reading the newspapers and following world events and I remember the civil rights movement.  I was in England, but we followed it.  I remember it, I remember what we felt about it, and what people were writing about it.  It was full of hope.  The idea in everyone’s mind was that if we strike down these unjust laws and we outlaw all this discrimination, then we’ll be whole.  Then America will be made whole.  After an intermediate period of a few years, who knows, maybe 20 years, with a hand up from things like affirmative action, black America will just merge into the general population and the whole thing will just go away.  That’s what everybody believed.  Everybody thought that.  And it didn’t happen.\nHere we are, we’re 50 years later, and we’ve still got these tremendous disparities in crime rates, educational attainment, and so on.  And I think, although they’re still mouthing the platitudes, Americans in their hearts feel a kind of cold despair about it.  They feel that Thomas Jefferson was probably right and we can’t live together in harmony.  I think that’s why you see this slow ethnic disaggregation.  We have a very segregated school system now.  There are schools within 10 miles of where I’m sitting that are 98 percent minority.  In residential housing too, it’s the same thing.  So I think there is a cold, dark despair lurking in America’s collective heart about the whole thing.  That’s one factor.  Another factor is the Internet, especially YouTube.  Now, you can log on any morning to the Drudge Report and see videos of crowds of black Americans misbehaving.  Maybe there should be some videos of white Americans misbehaving, but there just aren’t that many.  People are seeing these things and it’s fortifying that despair.\nI’m a bit scared of it, it’s making us kind of cold.  But we’re still mouthing the platitudes.  It’s something happening under the surface and it hasn’t really come to the surface yet except perhaps in reaction to events like this.  But I do think that in our innermost hearts we’re in a state of despair.\nOne of the things I’ve noticed, living in Europe, is that Europeans really don’t get the American racial obsession.  It’s pretty clear that approved racial etiquette in the United States is not normal and one wonders how long it can last.\nThat’s always been the case to some degree.  Back in the 1930s, Agatha Christie wrote a book called “10 Little N-words”.  Do you know that book?\nI do.\nThat wasn’t the title of the book of course.  I’m trying to observe the proprieties.  It was published like that in Britain, but her American publisher wouldn’t publish it under that title.  The American publication was “And Then There Were None”.\nThat was before World War II, in the 1940s.  But it was published under the original name in England until the 1960s, well into the 1960s.  So we’ve had this difference in sensibilities between polite, well-educated, upper middle class Americans and Europeans for a long time.  We’ve always had that.  But contra that, it seems to me, based on reading the newspapers, that the British are even more prissy than the Americans about these things.  We’re constantly hearing about somebody getting prosecuted for yelling a racist word at a soccer player or something like that.\nI exchanged some email with Jonah Goldberg about this and the thing that really appeared to bother him, and the thing that appears to have bothered your other critics the most, was the idea that one should not stop and offer assistance to a black individual in apparent distress.  Obviously, you’re not a Christian, so barring any sort of Good Samaritan Christian duty, why do you think there’s been such a negative response to that particular piece of advice.\nI must say, I think they have a point.  If I was to write it over again, that would be just about the one thing I would change.  I actually wanted to add some qualifiers to that point, just to tell people to be more wary in that situation, but you know, I’m a writer and I was over my allotted word count.  I would rewrite that if I could.  But again, I’m giving advice to kids and kids don’t have much judgment.  I do think you need more judgment in a situation like that and I put a link to where it happened.  You get a regular trickle of stories about people who have tried to help in those situations and come to grief, where they’ve been turned on or its been some kind of con.\nI noticed you used the words “apparent distress” in your article.  I thought it was fairly obvious you were indicating that not all distress is necessarily real and sometimes it’s a trap.\nYeah, and if you’re giving advice to kids, they don’t have the judgment to know what’s a trap and what isn’t.  I don’t think it’s that bad advice even as it stands.  But it’s the one thing I would have elaborated on if I’d had more words to use.\nOne thing I think people neglect to consider about the Good Samaritan is that he wouldn’t have been in any position to help the man if he didn’t have an animal to put the guy on, money to pay his medical bills and leave him in the inn for a couple of days.\n(Laughs)  Come on now, Vox.  You’re lawyering it.  I’ve made my semi-apology, let’s leave it at that.\nFair enough, fair enough.  So Mark Steyn referred to what he called your “summary execution” by Lowry.  Was it really that summary?  Were you given any opportunity to walk yourself back or was it just a case of you’ve stuck your head in it, so off with your head?  Lowry seemed to view the article as some sort of resignation, was that your intention?\nNot at all.  I thought it was just a routine piece.\nThe other theory that was making the rounds was that your obvious guilt could be mitigated by the fact that you’d been affected by your cancer treatments.  Is there any veracity to that?\nNope, I don’t believe that at all.  I’m on a monthly chemotherapy cycle and at the beginning of the cycle, where they pump the poison into you, you really are out of it for a few days.  But then, a couple of weeks later, you’re back pretty much to normal.  And that piece was written at the end of the cycle, so, no, I don’t believe it’s got anything to do with it.\nNational Review has a long and rather Stalinist history of purging its writers, including Joe Sobran, Samuel Francis, Ann Coulter, and now you.  Is this part of National Review’s culture or is there something else going on there?\nOn National Review’s behalf, let me just correct you on Coulter.  She wasn’t a National Review employee, they just syndicated her column and they stopped syndicating it.  I think that was all that happened there.  I’m sorry to sound defensive on National Review’s behalf, but it is something they have to do, to some degree.  I actually spoke to Bill Buckley about this a couple of times.  As a committed conservative, it hurts to say this, but there are a lot of crazy people on the political right and if you’re going to have any kind of presentation in the media marketplace at all, you do have to keep fending them off.  Unfortunately, it’s a matter of judgment about which ones you fend off and which ones you let into the tent.  It’s awfully hard to get right, and I know, Bill Buckley had said to me, that he didn’t think he’d always gotten it exactly right.  It’s an approximate art.  You sometimes boot out the wrong person and sometimes keep in the wrong person.  Bill called it a policing exercise and it does have to be done.  If you’re going to be a, oh dear, respectable publication, and get your ideas out there in the marketplace, you do have to draw a line against the craziest of the crazies.  It’s not an easy line to draw.  It’s not an easy judgment to make.  Sometimes you get it wrong.  I think Bill got it wrong with Sam Francis.\nYou sound remarkably comfortable having been found to be on the wrong side of the line.\nWell, I say again, it’s a hard thing to get right.  Did Rich Lowry get it right in my case?  You be the judge.\nWho will be the next to be purged at National Review?  Most of the betting money is going towards Mark Steyn or Victor Davis Hanson.\nWhat, no Mark Krikorian?  No, VDH and Mark Steyn will have positions at National Review as long as they want them.  VDH will self-purge before it becomes necessary to excommunicate him.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-16T03:01:00+00:00"
}