{
  "url": "https://voxday.net/2012/04/26/dissecting-sceptics-i/",
  "scraped_at": "2025-12-14T04:52:57.171957",
  "title": "Dissecting the sceptics I",
  "date_display": "April 26, 2012",
  "date_iso": "2012-04-26T08:57:00+00:00",
  "date_from_url": "2012-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been asked in the past to explain how go about breaking down and critically analyzing an argument and how I am able to so readily spot the flaws it contains.  Since Delavagus has <s>demonstrated that he is no more able to discuss and defend his views of Pyrrhonism than Sextus Empiricus, albeit without Sextus’s excuse of having been dead for 1,802 years</s>found the time to respond to my two questions, his two posts on ancient scepticism will serve as an ideal specimen for this example.  I’m not going to do it all at once, however.  This will be an ongoing series over the next few weeks in order to keep the argument digestible since most of you have no reason to be familiar with the ancient source material.  But I can assure you that it’s really not very difficult stuff so long as you look past the fluff of the vocabulary.</p><p>The first question I always ask myself is if the argument is primarily factual, logical, or rhetorical in nature.  The second question I ask myself is if the author is likely to have any idea what he’s talking about or not.  And the third question is if I regard the author as being trustworthy or not, or rather, if I believe him to be fundamentally intellectually honest or not.  These three questions determine how carefully I read through an argument and whether I presume the author is more likely to make a simple mistake or whether any apparent mistakes are actually intentional attempts to sneak something past the insufficiently careful reader in order to make a flawed argument look convincing.</p><p>The fourth question is what is the author trying to prove?  This question often can’t be answered initially, but I keep it in the back of my mind for future reference.  Once I identify the specific point that the author is trying to prove, I can track back from it to see if a) his logic is correct, and b) if that logic is soundly supported.  It’s important to keep in mind that the actual point that the author is trying to prove is not necessarily the one that he appears to be trying to prove in the title or introduction.</p><p>Now, in his post <a href=\"http://rsbakker.wordpress.com/2012/03/02/to-know-our-unknowing/\">To Know Our Unknowing</a>, Delavagus describes himself thusly: <i>“My name’s Roger Eichorn.  I’m a friend of Scott’s, an aspiring fantasy novelist, and a Ph.D. student in philosophy at the University of Chicago.  My primary area of specialization is ancient skepticism, particularly the Pyrrhonism of Sextus Empiricus.”</i></p><p>So what does this tell us?  He’s educated, he’s inexperienced, he’s at least moderately intelligent, he’s a wannabee, he’s a larval academic, and like most would-be novelists, he’s probably got at least a bit of a superiority complex.  Moreover, he chooses to frequent a place that we know to be run by a confirmed intellectual snake.  We also know, given the subject matter, that there is a textual authority to which his arguments can be compared and held accountable.  So, the answers to the three questions are: factual, yes, and no.  It’s a factual argument written by someone who probably knows what he’s talking about and is potentially at least a little intellectually dishonest.  And since he’s an academic of sorts, we know to look for the word games, in particular the definitional bait-and-switch of which they are so very fond.  At this point, I wouldn’t go so far as to say that I smell a rat, only that I believe there is a high probability that a rat or two will soon present itself.  So, I read the post paying particular attention to any definitional ambiguities or unwarranted leaps of logic.</p><blockquote><p> In this post, I’d like to discuss one of Scott’s favorite themes—human stupidity—in relation to Pyrrhonism.  Scott focuses, and for good reason, on the growing scientific (that is, empirical) evidence to the effect that humans are stupid, stupid creatures.  Much of this work is cutting-edge stuff, largely because of recent technological advances that have (as Scott likes to say) broken open the ‘black box’ of the human brain.  Even so, there’s a sense in which the findings Scott brings to our attention are merely the latest chapter in a long story, a story that goes all the way back to the ancients.</p><p>Sextus Empicirus himself based many of his arguments on empirical evidence.  Though, of course, his ‘evidence’ was not the sort of thing that would pass muster in a modern scientific context, I believe there’s every reason to think that, were he alive today, Sextus would be at least as fascinated by the growing body of evidence concerning human cognitive shortcomings as Scott is—and moreover, there’s every reason to think that he would have made potent use of this evidence in his skeptical dialectic.</p><p>However, Sextus did not think that we require empirical evidence in order to arrive at the conclusion that we’re all idiots.  That conclusion, he thought, can be arrived at purely a priori, that is, while lounging in our armchairs and merely thinking through our knowing.  Let’s see how this works.</p><p>The question is this: What, if anything, do we know?  Knowledge is generally taken to be justified true belief.*  (This is a twentieth-century formulation, but the thought goes back at least to Plato.)  On the one hand, there are beliefs—all sorts of beliefs, many of them batshit crazy.  On the other hand, there is the way things actually are (truth).  How do we assure ourselves that a belief reflects how things actually are?  We do so, the thought goes, by justifying that belief.</p><p><i>* = Those with a philosophical background might at this point protest, “But what of Gettier cases?”  I’m going to ignore Gettier here, partly to keep things simple, but also because I think Gettier’s problematization of the standard conception of knowledge fails, that its failure has been demonstrated numerous times, and that epistemologists should just move on already.</i></p></blockquote><p>Now, far be it from me to argue with the assertion that humans are stupid, stupid creatures.  MPAI, after all.  That being said, do you spot the first error?  We’ve barely gotten started and already we find a questionable word game being played with “evidence”, as well as irrelevant musings on what would fascinate Sextus and an unjustified belief claim concerning how Sextus would have made use of modern scientific evidence.  The latter, we will eventually see, is particularly ironic, but at this point it’s neither here nor there.  Perhaps, like <a href=\"http://www.thedaily.com/page/2012/04/23/042312-news-smartest-man-1-6/\">the gentleman with the 190+ IQ</a>, Sextus would instead spend his days looking at pictures of unclad women, repeatedly taking IQ tests, and writing jokes.  We don’t know, and more to the point, we don’t care.  But what this very usefully tells us is that Delavagus is not a rigorous thinker and he is liable to going off on irrelevant tangents and making groundless assertions concerning things he can’t possibly know.</p><p>Of course, the second error is not only readily observable, but is the very sort of error towards which we anticipated he would be inclined.  He practically highlights it for us, as he writes <i>“Knowledge is generally taken to be justified true belief.”</i> Weasel words such as “generally”, “basically”, and “pretty much” are always red flags, particularly when they precede something as important as the definition of an argument’s foundation or central subject.  So is “justified true belief” really what knowledge is?  Let’s turn to the dictionary.</p><p><b>Knowledge</b><br> Origin: 1250–1300; Middle English <i>knouleche</i></br></p><p>1. acquaintance with facts, truths, or principles, as from study or investigation; general erudition: <i>knowledge of many things.</i><br> 2. familiarity or conversance, as with a particular subject or branch of learning: <i>A knowledge of accounting was necessary for the job.</i><br> 3. acquaintance or familiarity gained by sight, experience, or report: <i>a knowledge of human nature.</i><br> 4. the fact or state of knowing;  the perception of fact or truth; clear and certain mental apprehension.<br> 5. awareness, as of a fact or circumstance: <i>He had knowledge of her good fortune.</i><br> 6. something that is or may be known;  information: <i>He sought knowledge of her activities.</i><br> 7. the body of truths or facts accumulated in the course of time.<br> 8. the sum of what is known: <i>Knowledge of the true situation is limited.</i><br> 9. sexual intercourse.</br></br></br></br></br></br></br></br></p><p>As should be clear, Delavagus’s definition of knowledge isn’t a valid one in common usage, but instead represents <a href=\"http://en.wikipedia.org/wiki/Justified_true_belief\">a different concept altogether</a>.  His statement is provably incorrect, as knowledge is quite clearly NOT “generally taken to be justified true belief”.  I tend to doubt Sextus Empiricus is considered to have logically proven that Man cannot have sex, even if, as per Tucker Max, the average philosophy student at the University of Chicago has about as much experience of sexual intercourse as he does with riding unicorns.  But the important thing is that Pyrrhonism, or more properly, Delavagus’s argument in defense of Pyrrhonism, has no more connection to the other eight definitions of “knowledge” than it does to sex.  This tenth definition would be fine, of course, (perhaps it could be termed “knowledge in the philosophical sense”), so long as Delavagus subsequently avoids attempting to switch from “justified true belief” to any of the nine definitions provided by the dictionary.  He hasn’t done so yet, but due to his attempt to pass off his own definition as a general one, we now know to be on guard for the likely switch to come.</p><p>As for his dismissal of Gettier, who showed that there are instances of justified true belief that are not knowledge and therefore it is not correct to attempt equating knowledge with justified true belief, Delavagus’s handwaving and appeal to the authority of his own opinion only underlines his previously identified lack of intellectual precision.  But since he doesn’t attempt to deal with it, we have no need to do so either other than to point out that he readily admits to ignoring this known objection to a key foundation of his argument.</p><p> <b>Subsequent sections</b><br> <a href=\"http://www.milobookclub.com/2012/04/27/dissecting-sceptics-ii/\">Dissecting the skeptics II</a><br> <a href=\"http://www.milobookclub.com/2012/04/28/dissecting-skeptics-iii/\">Dissecting the skeptics III</a><br> <a href=\"http://www.milobookclub.com/2012/04/29/dissecting-skeptics-iv/\">Dissecting the skeptics IV</a><br> <a href=\"http://www.milobookclub.com/2012/04/30/dissecting-skeptics-v/\">Dissecting the skeptics V</a><br> <a href=\"http://www.milobookclub.com/2012/05/02/dissecting-skeptics-vi/\">Dissecting the skeptics VI</a><br> <a href=\"http://www.milobookclub.com/2012/05/07/dissecting-skeptics-vii/\">Dissecting the skeptics VII</a><br> <a href=\"http://www.milobookclub.com/2012/05/08/dissecting-skeptics-viii/\">Dissecting the skeptics VIII</a></br></br></br></br></br></br></br></p><p> <b>Related</b><br> <a href=\"http://www.milobookclub.com/2012/05/03/mailvox-exposing-false-skeptic/\">Exposing the False Skeptic</a><br> <a href=\"http://www.milobookclub.com/2012/05/04/skeptic-confesses/\">The “Skeptic” Confesses</a></br></br></p></div>",
  "content_text": "I’ve been asked in the past to explain how go about breaking down and critically analyzing an argument and how I am able to so readily spot the flaws it contains.  Since Delavagus has\ndemonstrated that he is no more able to discuss and defend his views of Pyrrhonism than Sextus Empiricus, albeit without Sextus’s excuse of having been dead for 1,802 years\nfound the time to respond to my two questions, his two posts on ancient scepticism will serve as an ideal specimen for this example.  I’m not going to do it all at once, however.  This will be an ongoing series over the next few weeks in order to keep the argument digestible since most of you have no reason to be familiar with the ancient source material.  But I can assure you that it’s really not very difficult stuff so long as you look past the fluff of the vocabulary.\nThe first question I always ask myself is if the argument is primarily factual, logical, or rhetorical in nature.  The second question I ask myself is if the author is likely to have any idea what he’s talking about or not.  And the third question is if I regard the author as being trustworthy or not, or rather, if I believe him to be fundamentally intellectually honest or not.  These three questions determine how carefully I read through an argument and whether I presume the author is more likely to make a simple mistake or whether any apparent mistakes are actually intentional attempts to sneak something past the insufficiently careful reader in order to make a flawed argument look convincing.\nThe fourth question is what is the author trying to prove?  This question often can’t be answered initially, but I keep it in the back of my mind for future reference.  Once I identify the specific point that the author is trying to prove, I can track back from it to see if a) his logic is correct, and b) if that logic is soundly supported.  It’s important to keep in mind that the actual point that the author is trying to prove is not necessarily the one that he appears to be trying to prove in the title or introduction.\nNow, in his post\nTo Know Our Unknowing\n, Delavagus describes himself thusly:\n“My name’s Roger Eichorn.  I’m a friend of Scott’s, an aspiring fantasy novelist, and a Ph.D. student in philosophy at the University of Chicago.  My primary area of specialization is ancient skepticism, particularly the Pyrrhonism of Sextus Empiricus.”\nSo what does this tell us?  He’s educated, he’s inexperienced, he’s at least moderately intelligent, he’s a wannabee, he’s a larval academic, and like most would-be novelists, he’s probably got at least a bit of a superiority complex.  Moreover, he chooses to frequent a place that we know to be run by a confirmed intellectual snake.  We also know, given the subject matter, that there is a textual authority to which his arguments can be compared and held accountable.  So, the answers to the three questions are: factual, yes, and no.  It’s a factual argument written by someone who probably knows what he’s talking about and is potentially at least a little intellectually dishonest.  And since he’s an academic of sorts, we know to look for the word games, in particular the definitional bait-and-switch of which they are so very fond.  At this point, I wouldn’t go so far as to say that I smell a rat, only that I believe there is a high probability that a rat or two will soon present itself.  So, I read the post paying particular attention to any definitional ambiguities or unwarranted leaps of logic.\nIn this post, I’d like to discuss one of Scott’s favorite themes—human stupidity—in relation to Pyrrhonism.  Scott focuses, and for good reason, on the growing scientific (that is, empirical) evidence to the effect that humans are stupid, stupid creatures.  Much of this work is cutting-edge stuff, largely because of recent technological advances that have (as Scott likes to say) broken open the ‘black box’ of the human brain.  Even so, there’s a sense in which the findings Scott brings to our attention are merely the latest chapter in a long story, a story that goes all the way back to the ancients.\nSextus Empicirus himself based many of his arguments on empirical evidence.  Though, of course, his ‘evidence’ was not the sort of thing that would pass muster in a modern scientific context, I believe there’s every reason to think that, were he alive today, Sextus would be at least as fascinated by the growing body of evidence concerning human cognitive shortcomings as Scott is—and moreover, there’s every reason to think that he would have made potent use of this evidence in his skeptical dialectic.\nHowever, Sextus did not think that we require empirical evidence in order to arrive at the conclusion that we’re all idiots.  That conclusion, he thought, can be arrived at purely a priori, that is, while lounging in our armchairs and merely thinking through our knowing.  Let’s see how this works.\nThe question is this: What, if anything, do we know?  Knowledge is generally taken to be justified true belief.*  (This is a twentieth-century formulation, but the thought goes back at least to Plato.)  On the one hand, there are beliefs—all sorts of beliefs, many of them batshit crazy.  On the other hand, there is the way things actually are (truth).  How do we assure ourselves that a belief reflects how things actually are?  We do so, the thought goes, by justifying that belief.\n* = Those with a philosophical background might at this point protest, “But what of Gettier cases?”  I’m going to ignore Gettier here, partly to keep things simple, but also because I think Gettier’s problematization of the standard conception of knowledge fails, that its failure has been demonstrated numerous times, and that epistemologists should just move on already.\nNow, far be it from me to argue with the assertion that humans are stupid, stupid creatures.  MPAI, after all.  That being said, do you spot the first error?  We’ve barely gotten started and already we find a questionable word game being played with “evidence”, as well as irrelevant musings on what would fascinate Sextus and an unjustified belief claim concerning how Sextus would have made use of modern scientific evidence.  The latter, we will eventually see, is particularly ironic, but at this point it’s neither here nor there.  Perhaps, like\nthe gentleman with the 190+ IQ\n, Sextus would instead spend his days looking at pictures of unclad women, repeatedly taking IQ tests, and writing jokes.  We don’t know, and more to the point, we don’t care.  But what this very usefully tells us is that Delavagus is not a rigorous thinker and he is liable to going off on irrelevant tangents and making groundless assertions concerning things he can’t possibly know.\nOf course, the second error is not only readily observable, but is the very sort of error towards which we anticipated he would be inclined.  He practically highlights it for us, as he writes\n“Knowledge is generally taken to be justified true belief.”\nWeasel words such as “generally”, “basically”, and “pretty much” are always red flags, particularly when they precede something as important as the definition of an argument’s foundation or central subject.  So is “justified true belief” really what knowledge is?  Let’s turn to the dictionary.\nKnowledge\nOrigin: 1250–1300; Middle English\nknouleche\n1. acquaintance with facts, truths, or principles, as from study or investigation; general erudition:\nknowledge of many things.\n2. familiarity or conversance, as with a particular subject or branch of learning:\nA knowledge of accounting was necessary for the job.\n3. acquaintance or familiarity gained by sight, experience, or report:\na knowledge of human nature.\n4. the fact or state of knowing;  the perception of fact or truth; clear and certain mental apprehension.\n5. awareness, as of a fact or circumstance:\nHe had knowledge of her good fortune.\n6. something that is or may be known;  information:\nHe sought knowledge of her activities.\n7. the body of truths or facts accumulated in the course of time.\n8. the sum of what is known:\nKnowledge of the true situation is limited.\n9. sexual intercourse.\nAs should be clear, Delavagus’s definition of knowledge isn’t a valid one in common usage, but instead represents\na different concept altogether\n.  His statement is provably incorrect, as knowledge is quite clearly NOT “generally taken to be justified true belief”.  I tend to doubt Sextus Empiricus is considered to have logically proven that Man cannot have sex, even if, as per Tucker Max, the average philosophy student at the University of Chicago has about as much experience of sexual intercourse as he does with riding unicorns.  But the important thing is that Pyrrhonism, or more properly, Delavagus’s argument in defense of Pyrrhonism, has no more connection to the other eight definitions of “knowledge” than it does to sex.  This tenth definition would be fine, of course, (perhaps it could be termed “knowledge in the philosophical sense”), so long as Delavagus subsequently avoids attempting to switch from “justified true belief” to any of the nine definitions provided by the dictionary.  He hasn’t done so yet, but due to his attempt to pass off his own definition as a general one, we now know to be on guard for the likely switch to come.\nAs for his dismissal of Gettier, who showed that there are instances of justified true belief that are not knowledge and therefore it is not correct to attempt equating knowledge with justified true belief, Delavagus’s handwaving and appeal to the authority of his own opinion only underlines his previously identified lack of intellectual precision.  But since he doesn’t attempt to deal with it, we have no need to do so either other than to point out that he readily admits to ignoring this known objection to a key foundation of his argument.\nSubsequent sections\nDissecting the skeptics II\nDissecting the skeptics III\nDissecting the skeptics IV\nDissecting the skeptics V\nDissecting the skeptics VI\nDissecting the skeptics VII\nDissecting the skeptics VIII\nRelated\nExposing the False Skeptic\nThe “Skeptic” Confesses",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-26T07:57:00+00:00"
}