{
  "url": "https://voxday.net/2012/04/28/dissecting-skeptics-iii/",
  "scraped_at": "2025-12-14T04:53:09.995711",
  "title": "Dissecting the skeptics III",
  "date_display": "April 28, 2012",
  "date_iso": "2012-04-28T15:25:00+00:00",
  "date_from_url": "2012-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rather than admitting his demonstrated errors or attempting to defend them, our intrepid champion of ancient skepticism has once again vowed to run away rather than engage his critics.  Regardless, I shall continue with my critical analysis of his attempt to answer the question “what, if anything, do we know?” by examining the third section of <a href=\"http://rsbakker.wordpress.com/2012/03/02/to-know-our-unknowing/\">To Know Our Unknowing</a> with or without the benefit of his illuminating commentary.  So far, we’ve identified five errors in his argument.  Will there be more?  Let’s read carefully and see.</p><blockquote><p> The constraints on justification outlined in (2)–called the Agrippan Trilemma–come down simply to this: merely assuming that something is true is not a rational reason to maintain that it’s true; therefore, any putative justifier must itself be justified, from which it follows that an infinite regress of justifications (where x is justified by y, which is justified by z, on and on forever) fails, as do circular justifications (where x is justified by y, which is itself justified by x).</p><p>There’s a sense in which the Agrippan Trilemma sums up the problematic of the entire history of epistemology.  Foundationalist theories attempt to end the regress by appealing to some privileged class of self-justifying justifiers.  Coherence theories, on the other hand, attempt to make a virtue of circularity by claiming, roughly, that we are justified in holding a set of beliefs if those beliefs evince the requisite degree of internal coherence.</p><p>Despite centuries–millenia!–of ingenious epistemological tinkering by generations of staggeringly intelligent people, it is hard to see, on the face of it, how any theory can escape the Agrippan Trilemma without giving up on rational justification altogether.  The very idea of a self-justifying justifier is, if not incoherent, at least deeply suspicious.  Such ‘foundations’ to our knowledge are often said to be ‘self-evident.’  But as the Devil’s Dictionary points out, ‘self-evident’ seems to mean that which is evident to oneself–and no one else.  (Making the same point with far more plausibility, and much less humor: ‘self-evident’ seems to mean nothing more than what a particular cultural tradition has taught its members to accept without reasons.)</p><p>As for coherence theories, it may be the case that the greater the coherence of a set of beliefs, the more reason we have, ceteris paribus, to think those beliefs true.  But the game of truth is not horseshoes or hand-grenades.  Given that knowledge means justified true belief, then by claiming knowledge of x, we’re claiming that x is true, not that x is more or less likely to be true by virtue of belonging to a more or less coherent set of beliefs.  There might be all sorts of interesting uses for coherence theories, but they are not theories of truth.</p><p>Finally, some epistemologists endorse ‘externalism,’ according to which (roughly) knowledge does not require that the knowing subject know that she knows.  Here’s one way of putting it: as long as a belief was acquired by means of a reliable mechanism (a mechanism that is known to ‘track the truth’), then the belief is justified regardless of the ‘internal’ state of the subject.  Externalists will want to argue that I (and other pesky skeptics) are demanding too much, namely, not just that we know x, but that we know that we know x.</p><p>Think about it for a minute, though.  What does ‘externalism’ come down to?  Just this: “It might very well be the case that many of our beliefs are justified even if we have no way of knowing that they are.”  For consider: unless the externalist, or someone, is able to adopt the third-person perspective—the perspective from which it is possible to determine that Beatrice has arrived at belief x by means of a reliable, truth-tracking mechanism, and thus that she knows x (even though she does not know that she knows x)—then externalism amounts to saying, “It might be the case that we know all sorts of stuff.”  Fine.  I accept that, Sextus accepts that—all ancient skeptics do (at least in the externalist’s sense of having a true belief that is in fact justified in some way that escapes us).  But without specifying what we know and how we know it (what justifies it), then externalism simply does not answer the question.</p><p>On the other hand, if externalists think that they (or someone) can adopt the justification-identifying third-person perspective, can identify (e.g.) reliable truth-tracking mechanisms, then their account of justification would have to be an account of the justification of those mechanisms—that is, an account of how it’s known that those mechanisms are truth-tracking.  Externalism, then, if it is to contribute anything to the conversation, must collapse into internalism.</p><p>It is not enough to ‘know’ something in the externalist’s sense.  Unless we’re in possession of a justification for a belief we hold, then we do not know that we know it, in which case we have no warrant for crowning it Knowledge.</p></blockquote><p>There is no need to dispute Delavagus’s summary of the Agrippan Trilemma, especially since in the current argument, it has no bearing on any form of putatative justification except those that purport to be rational.  And even in the current argument, bringing it up would do little more than rehash the already dismissed problem of the criterion.  Delavagus could, of course, simply wave his hand a third time and declare, for the sake of argument, that we shall agree that assuming something is true is a rational reason to believe it is true, but this time he elects not to do so and accepts the limitations that he previously ignored.</p><p>Nor do I see any reason to take exception to his assertions about self-evidence and coherence theories, even though I note in passing that he doesn’t actually provide any reason to invalidate the former beyond citing Ambrose Bierce and his opinion that self-evidence seems to reflect cultural traditions.  I tend to agree with his statements concerning the latter; they are not relevant here.  However, when he attacks externalism, it is apparent that we have to look more closely at what he’s saying and apply his definition of “knowledge” in order to be perfectly clear about it.  When we refer to his definition of knowledge, the externalist claim concerning the skeptic’s demand is not just that we possess justified true belief concerning x, but that we possess justified true belief concerning our justified true belief concerning x.  Which of course, represents yet another return to the problem of the infinite regress.  We need not trouble ourselves with all the tedious detail to see that externalism, as Delavagus describes it, amounts to a claim that a true belief can be justified without the subject being aware if his justification is valid or not.</p><p>And it is here that the problem arises.  In his attempt to show externalism must collapse into internalism, Delavagus engages in a very shady attempt to move the goalposts, a move that is so blatantly shady that we must declare it to be his sixth error.  Remember, the original question which Delavagus intended to answer was this: <i>“What, if anything, do we know?”</i> So, if an individual possesses knowledge, defined as justified true belief, then reason dictates he possesses it regardless of whether he happens to be aware of the validity of the justification for his true belief or not.  What do we know?  Those true beliefs that are justified, <i>whether we know they are justified or not</i>.  All that matters is that the belief is true and the justification is valid.  So, Delavagus is quite clearly wrong and externalism answers the very question that he asked because there is no need for the putative knower to justify his justification in order for him to legitimately possess the justified true belief.  Therefore, whether we know that we know or not, we can and do know, even according to the philosophical definition of knowledge.  The infinite regress is avoided.</p><p>His goalpost-moving leads Delavagus to commits his seventh error in his erroneous final statement.  Whether we are in possession of the justification for the true belief or not, whether we even know the belief is true or not, we very much have a warrant for crowning our possession of justified true belief as knowledge for two reasons.  First, because Delavagus did not define knowledge as “self-aware justified true belief”, and second, because he did not pose the question “how can we know that we know?”, but rather “what, if anything, do we know?”  And the correct answer to that question, according to his chosen definition, is beliefs that are both true and justified, regardless of whether we know they are true or how they are justified.</p><p> <b>Next section</b><br> <a href=\"http://www.milobookclub.com/2012/04/29/dissecting-skeptics-iv/\">Dissecting the skeptics IV</a></br></p><p><b>Previous sections</b><br> <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">Dissecting the skeptics I</a><br> <a href=\"http://www.milobookclub.com/2012/04/27/dissecting-sceptics-ii/\">Dissecting the skeptics II</a></br></br></p></div>",
  "content_text": "Rather than admitting his demonstrated errors or attempting to defend them, our intrepid champion of ancient skepticism has once again vowed to run away rather than engage his critics.  Regardless, I shall continue with my critical analysis of his attempt to answer the question “what, if anything, do we know?” by examining the third section of\nTo Know Our Unknowing\nwith or without the benefit of his illuminating commentary.  So far, we’ve identified five errors in his argument.  Will there be more?  Let’s read carefully and see.\nThe constraints on justification outlined in (2)–called the Agrippan Trilemma–come down simply to this: merely assuming that something is true is not a rational reason to maintain that it’s true; therefore, any putative justifier must itself be justified, from which it follows that an infinite regress of justifications (where x is justified by y, which is justified by z, on and on forever) fails, as do circular justifications (where x is justified by y, which is itself justified by x).\nThere’s a sense in which the Agrippan Trilemma sums up the problematic of the entire history of epistemology.  Foundationalist theories attempt to end the regress by appealing to some privileged class of self-justifying justifiers.  Coherence theories, on the other hand, attempt to make a virtue of circularity by claiming, roughly, that we are justified in holding a set of beliefs if those beliefs evince the requisite degree of internal coherence.\nDespite centuries–millenia!–of ingenious epistemological tinkering by generations of staggeringly intelligent people, it is hard to see, on the face of it, how any theory can escape the Agrippan Trilemma without giving up on rational justification altogether.  The very idea of a self-justifying justifier is, if not incoherent, at least deeply suspicious.  Such ‘foundations’ to our knowledge are often said to be ‘self-evident.’  But as the Devil’s Dictionary points out, ‘self-evident’ seems to mean that which is evident to oneself–and no one else.  (Making the same point with far more plausibility, and much less humor: ‘self-evident’ seems to mean nothing more than what a particular cultural tradition has taught its members to accept without reasons.)\nAs for coherence theories, it may be the case that the greater the coherence of a set of beliefs, the more reason we have, ceteris paribus, to think those beliefs true.  But the game of truth is not horseshoes or hand-grenades.  Given that knowledge means justified true belief, then by claiming knowledge of x, we’re claiming that x is true, not that x is more or less likely to be true by virtue of belonging to a more or less coherent set of beliefs.  There might be all sorts of interesting uses for coherence theories, but they are not theories of truth.\nFinally, some epistemologists endorse ‘externalism,’ according to which (roughly) knowledge does not require that the knowing subject know that she knows.  Here’s one way of putting it: as long as a belief was acquired by means of a reliable mechanism (a mechanism that is known to ‘track the truth’), then the belief is justified regardless of the ‘internal’ state of the subject.  Externalists will want to argue that I (and other pesky skeptics) are demanding too much, namely, not just that we know x, but that we know that we know x.\nThink about it for a minute, though.  What does ‘externalism’ come down to?  Just this: “It might very well be the case that many of our beliefs are justified even if we have no way of knowing that they are.”  For consider: unless the externalist, or someone, is able to adopt the third-person perspective—the perspective from which it is possible to determine that Beatrice has arrived at belief x by means of a reliable, truth-tracking mechanism, and thus that she knows x (even though she does not know that she knows x)—then externalism amounts to saying, “It might be the case that we know all sorts of stuff.”  Fine.  I accept that, Sextus accepts that—all ancient skeptics do (at least in the externalist’s sense of having a true belief that is in fact justified in some way that escapes us).  But without specifying what we know and how we know it (what justifies it), then externalism simply does not answer the question.\nOn the other hand, if externalists think that they (or someone) can adopt the justification-identifying third-person perspective, can identify (e.g.) reliable truth-tracking mechanisms, then their account of justification would have to be an account of the justification of those mechanisms—that is, an account of how it’s known that those mechanisms are truth-tracking.  Externalism, then, if it is to contribute anything to the conversation, must collapse into internalism.\nIt is not enough to ‘know’ something in the externalist’s sense.  Unless we’re in possession of a justification for a belief we hold, then we do not know that we know it, in which case we have no warrant for crowning it Knowledge.\nThere is no need to dispute Delavagus’s summary of the Agrippan Trilemma, especially since in the current argument, it has no bearing on any form of putatative justification except those that purport to be rational.  And even in the current argument, bringing it up would do little more than rehash the already dismissed problem of the criterion.  Delavagus could, of course, simply wave his hand a third time and declare, for the sake of argument, that we shall agree that assuming something is true is a rational reason to believe it is true, but this time he elects not to do so and accepts the limitations that he previously ignored.\nNor do I see any reason to take exception to his assertions about self-evidence and coherence theories, even though I note in passing that he doesn’t actually provide any reason to invalidate the former beyond citing Ambrose Bierce and his opinion that self-evidence seems to reflect cultural traditions.  I tend to agree with his statements concerning the latter; they are not relevant here.  However, when he attacks externalism, it is apparent that we have to look more closely at what he’s saying and apply his definition of “knowledge” in order to be perfectly clear about it.  When we refer to his definition of knowledge, the externalist claim concerning the skeptic’s demand is not just that we possess justified true belief concerning x, but that we possess justified true belief concerning our justified true belief concerning x.  Which of course, represents yet another return to the problem of the infinite regress.  We need not trouble ourselves with all the tedious detail to see that externalism, as Delavagus describes it, amounts to a claim that a true belief can be justified without the subject being aware if his justification is valid or not.\nAnd it is here that the problem arises.  In his attempt to show externalism must collapse into internalism, Delavagus engages in a very shady attempt to move the goalposts, a move that is so blatantly shady that we must declare it to be his sixth error.  Remember, the original question which Delavagus intended to answer was this:\n“What, if anything, do we know?”\nSo, if an individual possesses knowledge, defined as justified true belief, then reason dictates he possesses it regardless of whether he happens to be aware of the validity of the justification for his true belief or not.  What do we know?  Those true beliefs that are justified,\nwhether we know they are justified or not\n.  All that matters is that the belief is true and the justification is valid.  So, Delavagus is quite clearly wrong and externalism answers the very question that he asked because there is no need for the putative knower to justify his justification in order for him to legitimately possess the justified true belief.  Therefore, whether we know that we know or not, we can and do know, even according to the philosophical definition of knowledge.  The infinite regress is avoided.\nHis goalpost-moving leads Delavagus to commits his seventh error in his erroneous final statement.  Whether we are in possession of the justification for the true belief or not, whether we even know the belief is true or not, we very much have a warrant for crowning our possession of justified true belief as knowledge for two reasons.  First, because Delavagus did not define knowledge as “self-aware justified true belief”, and second, because he did not pose the question “how can we know that we know?”, but rather “what, if anything, do we know?”  And the correct answer to that question, according to his chosen definition, is beliefs that are both true and justified, regardless of whether we know they are true or how they are justified.\nNext section\nDissecting the skeptics IV\nPrevious sections\nDissecting the skeptics I\nDissecting the skeptics II",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-28T14:25:00+00:00"
}