{
  "url": "https://voxday.net/2012/04/29/dissecting-skeptics-iv/",
  "scraped_at": "2025-12-14T04:53:13.663215",
  "title": "Dissecting the skeptics IV",
  "date_display": "April 29, 2012",
  "date_iso": "2012-04-29T12:44:00+00:00",
  "date_from_url": "2012-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we enter the home stretch and approach the grand conclusion of <a href=\"http://rsbakker.wordpress.com/2012/03/02/to-know-our-unknowing/\">To Know Our Unknowing</a>, we’ve now identified seven errors and demonstrated that Delavagus’s answer to the question he originally posed is incorrect.  And yet, we have not seen a single example of the definitional bait-and-switch that we anticipated from the start.  Could it be that Delavagus, however flawed his arguments, is nevertheless more intellectually honest than we originally suspected?  Is it possible for him to salvage the conclusions towards which he has been building in such an observably flawed manner?</p><blockquote><p> Where does this leave us?  It seems to leave us with the conclusion that, as far as we know, we know nothing.</p><p>But that can’t be right, for if we know that we do not know whether we know anything, then we know something.</p><p>We’ve run aground on peritropē: self-refutation.  I’ll continue the story in a later post…</p><p>What I’ve tried to show here is just that, even sitting in our armchairs, reflecting on our epistemic predicament, it’s possible to illuminate for ourselves the cognitive knots in which our thinking entangles itself—to know our unknowing.</p><p>We’re all idiots.  The more we accept this—the more we become good at not knowing—the more learned we will be.</p></blockquote><p>Building on the false foundation of his fatal seventh error, Delavagus gets off to a questionable start, but since it is essentially the same error, I won’t count it as a separate one.  It doesn’t seem “to leave us with the conclusion that, as far as we know, we know nothing”, but rather, to confirm our original opinion that Delavagus should have respected the problem of the criterion and abandoned his definition of knowledge in favor of one of the other nine available options.  Still, to his credit, he rightly identifies what I, and many others, view as the intrinsic incoherence and self-refuting nature of skepticism.  The fifty-cent word for this is <i>peritropē</i>, which is very important if you are going to demonstrate that you have been taught to regurgitate this information by a professor rather than figuring it out for yourself.  Of course, he proceeds to claim that skepticism isn’t <i>really</i> self-refuting in the next post that we’re critiquing, but let’s not get ahead of ourselves.</p><p>His intentions notwithstanding, what Delavagus actually ended up showing us was the cognitive knots in which his own thinking is entangled, rather than a general epistemic predicament that necessarily affects everyone.  To paraphrase Tonto speaking to the Lone Ranger when surrounded by hostile Indians, “who is this ‘our’, white boy?”  And the titular phrase which sounds so very philosophical is shown to be nonsense by the very argument he has produced, as his belief in our “unknowing” is clearly neither true nor justified.</p><p>It’s not until the final line of his argument that he finally presents us with the long-anticipated bait-and-switch and confirms our suspicions of his intellectual dishonesty.  After severely narrowing his definition of knowledge to a specialized philosophical one, repeatedly ignoring objections that he himself admits are at least potentially valid, and relying upon a) spurious non-arguments against self-evident justifications and b) erroneous arguments against external justifications, Delavagus promptly attempts to switch back, without any warning or justification, to make his argument broad and universally applicable by claiming “we’re all idiots”.</p><p>But how can we all be idiots when virtually no one outside of the world of the professional philosopher accepts or utilizes his flawed philosophical definition of knowledge and the definition of idiot – “an utterly foolish or senseless person” – <i>has absolutely nothing to do with ANY definition of knowledge</i>?  A lack of knowledge is not synonymous with a lack of sense, after all.  We have no choice but to conclude that despite his native intelligence and advanced education, Delavagus is both intellectually incompetent and intellectually dishonest.  Not only has he failed to make his case, he hasn’t even seriously attempted to make it!  In failing to correctly answer the initial question he posed and in failing to even attempt to make a case for his ultimate conclusion, the modern skeptic only manages to demonstrate his own foolishness.  What purports to be a reformulation of ancient skepticism turns out to be little more than a projection of the modern skeptic’s own lack of sense onto all of humanity.</p><p>It’s appropriate that he concludes with an absurd, but Socratic-sounding statement on how the less we know, the more learned we become.  After all, as I showed in <a href=\"http://www.milobookclub.com/2007/02/14/non-dilemma-of-euthyphro/\">my critique of the so-called Euthyphro Dilemma</a>, Socrates was no slouch as an intellectual snake himself.</p><p>I will close my critique of Delavagus’s first post with a selection from a quote that he himself provided.</p><p><i>“Blameworthy ignorance thus comes with a lack of self-knowledge of a peculiar kind. To think that you are wiser than you are is similar to enjoying the idea that you are more beautiful or richer – or a better driver, or more genuinely kind – than you are. These images of ourselves mislead us into overly confident claims to knowledge and expertise. I shall refer to this kind f phenomenon as Transferred Ignorance: blameworthy ignorance involves a transition from an inflated self-image to an inflated view of one’s ability to assess matters other than oneself. Even worse, when we, thus encouraged, put forward what we claim to know, we often formulate ideas that figure in our thoughts because we picked them up from others. While we indulge in our overly optimistic self-image, we forget that we do not even comprehend what we say.”</i><br> – Katja Vogt</br></p><p>Setting aside the legitimacy of my critique or the validity of Delavagus’s argument, I think it should be readily apparent that the thoughts I have expressed here were not picked up from anyone else, but are entirely original even if they happen to be identical to those expressed by others before, whereas Delavagus’s lack of precision and error-plagued arguments tend to indicate that the thoughts he has expressed in his post were, for the most part, picked up from the professors under whom he is still studying.  I therefore leave it up to those who have followed this critical analysis to determine towards whom a charge of blameworthy ignorance and an inability to comprehend what we say can be more aptly applied.</p><p> <b>Next section</b><br> Dissecting the skeptics V</br></p><p><b>Previous sections</b><br> <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">Dissecting the skeptics I</a><br> <a href=\"http://www.milobookclub.com/2012/04/27/dissecting-sceptics-ii/\">Dissecting the skeptics II</a><br> <a href=\"http://www.milobookclub.com/2012/04/28/dissecting-skeptics-iii/\">Dissecting the skeptics III</a></br></br></br></p></div>",
  "content_text": "As we enter the home stretch and approach the grand conclusion of\nTo Know Our Unknowing\n, we’ve now identified seven errors and demonstrated that Delavagus’s answer to the question he originally posed is incorrect.  And yet, we have not seen a single example of the definitional bait-and-switch that we anticipated from the start.  Could it be that Delavagus, however flawed his arguments, is nevertheless more intellectually honest than we originally suspected?  Is it possible for him to salvage the conclusions towards which he has been building in such an observably flawed manner?\nWhere does this leave us?  It seems to leave us with the conclusion that, as far as we know, we know nothing.\nBut that can’t be right, for if we know that we do not know whether we know anything, then we know something.\nWe’ve run aground on peritropē: self-refutation.  I’ll continue the story in a later post…\nWhat I’ve tried to show here is just that, even sitting in our armchairs, reflecting on our epistemic predicament, it’s possible to illuminate for ourselves the cognitive knots in which our thinking entangles itself—to know our unknowing.\nWe’re all idiots.  The more we accept this—the more we become good at not knowing—the more learned we will be.\nBuilding on the false foundation of his fatal seventh error, Delavagus gets off to a questionable start, but since it is essentially the same error, I won’t count it as a separate one.  It doesn’t seem “to leave us with the conclusion that, as far as we know, we know nothing”, but rather, to confirm our original opinion that Delavagus should have respected the problem of the criterion and abandoned his definition of knowledge in favor of one of the other nine available options.  Still, to his credit, he rightly identifies what I, and many others, view as the intrinsic incoherence and self-refuting nature of skepticism.  The fifty-cent word for this is\nperitropē\n, which is very important if you are going to demonstrate that you have been taught to regurgitate this information by a professor rather than figuring it out for yourself.  Of course, he proceeds to claim that skepticism isn’t\nreally\nself-refuting in the next post that we’re critiquing, but let’s not get ahead of ourselves.\nHis intentions notwithstanding, what Delavagus actually ended up showing us was the cognitive knots in which his own thinking is entangled, rather than a general epistemic predicament that necessarily affects everyone.  To paraphrase Tonto speaking to the Lone Ranger when surrounded by hostile Indians, “who is this ‘our’, white boy?”  And the titular phrase which sounds so very philosophical is shown to be nonsense by the very argument he has produced, as his belief in our “unknowing” is clearly neither true nor justified.\nIt’s not until the final line of his argument that he finally presents us with the long-anticipated bait-and-switch and confirms our suspicions of his intellectual dishonesty.  After severely narrowing his definition of knowledge to a specialized philosophical one, repeatedly ignoring objections that he himself admits are at least potentially valid, and relying upon a) spurious non-arguments against self-evident justifications and b) erroneous arguments against external justifications, Delavagus promptly attempts to switch back, without any warning or justification, to make his argument broad and universally applicable by claiming “we’re all idiots”.\nBut how can we all be idiots when virtually no one outside of the world of the professional philosopher accepts or utilizes his flawed philosophical definition of knowledge and the definition of idiot – “an utterly foolish or senseless person” –\nhas absolutely nothing to do with ANY definition of knowledge\n?  A lack of knowledge is not synonymous with a lack of sense, after all.  We have no choice but to conclude that despite his native intelligence and advanced education, Delavagus is both intellectually incompetent and intellectually dishonest.  Not only has he failed to make his case, he hasn’t even seriously attempted to make it!  In failing to correctly answer the initial question he posed and in failing to even attempt to make a case for his ultimate conclusion, the modern skeptic only manages to demonstrate his own foolishness.  What purports to be a reformulation of ancient skepticism turns out to be little more than a projection of the modern skeptic’s own lack of sense onto all of humanity.\nIt’s appropriate that he concludes with an absurd, but Socratic-sounding statement on how the less we know, the more learned we become.  After all, as I showed in\nmy critique of the so-called Euthyphro Dilemma\n, Socrates was no slouch as an intellectual snake himself.\nI will close my critique of Delavagus’s first post with a selection from a quote that he himself provided.\n“Blameworthy ignorance thus comes with a lack of self-knowledge of a peculiar kind. To think that you are wiser than you are is similar to enjoying the idea that you are more beautiful or richer – or a better driver, or more genuinely kind – than you are. These images of ourselves mislead us into overly confident claims to knowledge and expertise. I shall refer to this kind f phenomenon as Transferred Ignorance: blameworthy ignorance involves a transition from an inflated self-image to an inflated view of one’s ability to assess matters other than oneself. Even worse, when we, thus encouraged, put forward what we claim to know, we often formulate ideas that figure in our thoughts because we picked them up from others. While we indulge in our overly optimistic self-image, we forget that we do not even comprehend what we say.”\n– Katja Vogt\nSetting aside the legitimacy of my critique or the validity of Delavagus’s argument, I think it should be readily apparent that the thoughts I have expressed here were not picked up from anyone else, but are entirely original even if they happen to be identical to those expressed by others before, whereas Delavagus’s lack of precision and error-plagued arguments tend to indicate that the thoughts he has expressed in his post were, for the most part, picked up from the professors under whom he is still studying.  I therefore leave it up to those who have followed this critical analysis to determine towards whom a charge of blameworthy ignorance and an inability to comprehend what we say can be more aptly applied.\nNext section\nDissecting the skeptics V\nPrevious sections\nDissecting the skeptics I\nDissecting the skeptics II\nDissecting the skeptics III",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-29T11:44:00+00:00"
}