{
  "url": "https://voxday.net/2012/04/30/dissecting-skeptics-v/",
  "scraped_at": "2025-12-14T04:53:21.019247",
  "title": "Dissecting the skeptics V",
  "date_display": "April 30, 2012",
  "date_iso": "2012-04-30T17:30:00+00:00",
  "date_from_url": "2012-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Having completed my critique of <a href=\"http://rsbakker.wordpress.com/2012/03/02/to-know-our-unknowing/\">To Know Our Unknowing</a>, I’ll now proceed to examining the second of Delavagus’s two posts on Pyrrhonism, entitled <a href=\"http://rsbakker.wordpress.com/2012/03/16/to-unknow-our-knowing/\">To Unknow Our Knowing</a>:</p><blockquote><p> My previous post ended with the self-defeating conclusion that, as far as we know, we don’t know that we know anything (with the correlate that, insofar as we’re constrained by rational norms, we’re constrained to abjure knowledge-claims).  This conclusion was reached a priori: by attempting to think our thought, reflect on our reflection, know our knowing.</p><p>For as long as there have been skeptical arguments of this sort, there have been two stock counter-arguments: the peritropē, or self-refutation, argument; and the apraxia, or impracticability, argument.  Sextus Empiricus, the only ancient Pyrrhonian whose texts (or some of them, anyway) have come down to us, was perfectly aware of these objections; he argued that they are only effective against an incomplete or distorted understanding of Pyrrhonism.  The short version is that Sextus concedes self-refutation, but denies that it constitutes a counter-argument against Pyrrhonism (indeed, the self-refutatory character of skeptical arguments is central to his use of them), but he outright rejects impracticability arguments.  Pyrrhonism is not (or at least is not merely) a philosophy; it is an agōgē, a way of life.  Sextus characterizes the Pyrrhonian agōgē in terms of living adoxastōs, meaning without opinions or beliefs.  In this post, I want to suggest a way of understanding what it means to live adoxastōs.</p><p>As I said, Sextus embraces the self-refutatory character of his arguments.  He likens them to purgative drugs, which drain themselves away along with the humors they were administered to treat, or to a ladder one kicks away after having climbed up over it (an image appropriated, though probably at second- or third-hand, by both Nietzsche and Wittgenstein).  Those who charge Pyrrhonism with self-refutation think that it falls into a dilemma: either the skeptic accepts her own arguments, which (given their self-refutatory character) is logically impossible, or the skeptic doesn’t accept her own arguments, in which case she must also reject (or at least not endorse) their conclusions.  But the self-refutation charge overlooks two crucial features of the Pyrrhonian strategy: first, that charging the skeptic with self-refutation amounts to charging philosophico-rational thought as such with self-refutation; and second, that the target of Pyrrhonian arguments at their most general is not any particular content of philosophico-rational thought, but rather the very framework of such thought.</p></blockquote><p>As I showed in <a href=\"http://voxday.blogspot.com/2012/04/dissecting-sceptics-iv.html\">Dissecting the skeptics IV</a>, Delavagus’s conclusion to his first post is not self-defeating, but rather invalid, because his suddenly universal claim about the human lack of knowledge is totally dependent upon a peculiar philosophical definition of knowledge and is undermined by no less than eight specific errors in his reasoning.  In his second post, Delavagus doesn’t waste any time before resorting to what we have observed is his customary handwaving.  Apparently he expects us to simply accept Sextus’s outright rejection of the apraxia argument on the basis of his ancient authority, which of course we can no more do than we can expect Delavagus to accept the historical existence of the Olympian gods on the ancient authority of Homer.  So, is Sextus’s outright rejection of the impracticability argument justified?</p><p>Well, yes, as it turns out, but only because Sextus makes it very clear that the Pyrrhonian agōgē does not actually entail living by skeptical principles.  In Chapter IX, The Criterion of Scepticism, he writes:</p><p><i>“It is evident that we pay careful attention to phenomena from what we say about the criterion of the Sceptical School. The word criterion is used in two ways. First, it is understood as a proof of existence or non-existence, in regard to which we shall speak in the opposing argument. Secondly, when it refers to action, meaning the criterion to which we give heed in life, in doing some things and refraining from doing others, and it is about this that we shall now speak. We say, consequently, that the criterion of the Sceptical School is the phenomenon, and in calling it so, we mean the idea of it. It cannot be doubted, as it is based upon susceptibility and involuntary feeling. Hence no one doubts, perhaps, that an object appears so and so, but one questions if it is as it appears. Therefore, as we cannot be entirely inactive as regards the observances of daily life, we live by giving heed to phenomena, and in an unprejudiced way. But this observance of what pertains to the daily life, appears to be of four different kinds. Sometimes it is directed by the guidance of nature, sometimes by the necessity of the feelings, sometimes by the tradition of laws and of customs, and sometimes by the teaching of the arts. It is directed by the guidance of nature, for by nature we are capable of sensation and thought; by the necessity of the feelings, for hunger leads us to food, and thirst to drink; by the traditions of laws and customs, for according to them we consider piety a good in daily life, and impiety an evil; by the teaching of the arts, for we are not inactive in the arts we undertake. We say all these things, however, without expressing a decided opinion.”</i></p><p>In other words, the Pyrrhonian is eminently practical, because he lives his daily life by giving heed to nature, his feelings, the tradition of laws and customs, and by the teaching of the arts, without any concern for his suspension of judgment or inability to express a decided opinion.  The philosophy cannot be impractical because the skeptic maintains a firewall of sorts between his reason and his daily life.  This means, of course, that the oft-seen attempts of the modern skeptics to utilize skepticism as a weapon in order to influence these phenomena is a breach of the firewall and therefore intrinsically non-Pyrrhonian.  But regardless, we can conclude that Sextus does successfully address the apraxia even if it calls into question the behavior of many of those who claim, incorrectly it would appear, to be Pyrrhonians.</p><p>As for the defense against the peritropē charge, <a href=\"http://www.milobookclub.com/2012/04/24/mailvox-sextus-say-relax/\">I previously explained its flaws</a> in response to an earlier request from Delavagus. Sextus’s argument against peritrope fails on three counts. First, Sextus erroneously conflates the subset of his particular philosophy with the set of all philosophico-rational thought; because we can observe there is philosophico-rational thought that is not Pyrrhonian skepticism, all refutation of the latter cannot automatically be taken as any refutation of the former. Second, even if Sextus were correct and charging the skeptic with self-refutation actually did amount to charging philosophico-rational thought as such with self-refutation, that doesn’t change the fact that if the charge is substantiated and all philosophico-rational thought is, in fact, self-refuting, then the charge of peritrope against Scepticism must also be correct! If the set is refuted, then the subset is refuted as well.  So, it’s not a valid defense against the charge.  Third, Delavagus doesn’t realize that the intended target of Pyrrhonian skepticism is irrelevant with regards to its self-refuting nature; it doesn’t matter what Sextus is intending to target when it can be shown that the same arguments can be used just as effectively against his own clearly stated aims.</p><p>In that earlier exchange, Delavagus attempted to respond to the first point by claiming that Pyrrhonism is not a philosophy and therefore not a subset of all philosophico-rational thought.  He wrote: <i>“Pyrrhonism is a metaphilosophy, not a philosophy: it is philosophizing about philosophy itself, about rational thought as such. On my view, it contains no first-order philosophical claims whatsoever. In other words, it is NOT a member of the ‘set’ ‘Philosophies’; it is a critique of the set-as-such.”</i></p><p>But this is another inept attempt at a bait-and switch, because even if we accept his contention that Pyrrhonism is not a philosophy, it still specifically purports to be rational thought, as shown by Delavagus’s heavy reliance upon the Agrippan Trilemma, and therefore remains a subset of the set of all philosophico-rational thought.  Moreover, Delavagus’s view that Pyrrhonism is not a philosophy is provably wrong, as in Chapter I, The Principal Differences between Philosophers, Sextus writes:</p><p><i>“It is probable that those who seek after anything whatever, will either find it as they continue the search, will deny that it can be found and confess it to be out of reach, or will go on seeking it. Some have said, accordingly, in regard to the things sought in philosophy, that they have found the truth, while others have declared it impossible to find, and still others continue to seek it. Those who think that they have found it are those who are especially called Dogmatics, as for example, the Schools of Aristotle and Epicurus, the Stoics and some others. Those who have declared it impossible to find are Clitomachus, Carneades, with their respective followers, and other Academicians. Those who still seek it are the Sceptics. It appears therefore, reasonable to conclude that the three principal kinds of philosophy are the Dogmatic, the Academic, and the Sceptic. Others may suitably treat of the other Schools, but as for the Sceptical School, we shall now give an outline of it, remarking in advance that in respect to nothing that will be said do we speak positively, that it must be absolutely so, but we shall state each thing historically as it now appears to us.”</i></p><p>So, Delavagus is clearly wrong, both in claiming that Pyrrhonism is not part of the set of all philosophico-rational thought <i>and</i> in claiming that it is not a philosophy.  Indeed, Sextus not only declares skepticism to be a philosophy, but one of “the three principal kinds of philosophy”.  (I suspect he’s also wrong to say it “contains no first-order philosophical claims whatsoever”, but we will examine that assertion in a future post.)  And therefore, Delavagus’s attempted defense of my attack on Sextus’s argument against peritrope clearly fails, as does the argument against peritrope.</p><p>Finally, with regards to Delavagus’s claim that Pyrrhonism is more than a philosophy, but is an an agōgē, a way of life, as well, I note that it is a very strange way of life that makes explicit claims to have nothing to do with the way the philosopher actually lives his daily life, but it is nevertheless true.  Still, it should be kept in mind that it is entirely possible for something to fail as a philosophy, but not as a way of life, or vice-versa.  In any event, when the aims of Pyrrhonism are taken into account, it becomes readily apparent that the agōgē is nothing more than a form of anti-intellectual, morally neutral stoicism.</p><p>Sextus writes in Chapter XII: <i>“We confess that sometimes [the Sceptic] is cold and thirsty, and that he suffers in such ways. But in these things even the ignorant are beset in two ways, from the feelings themselves, and not less also from the fact that they think these conditions are bad by nature. The Sceptic, however, escapes more easily, as he rejects the opinion that anything is in itself bad by nature. Therefore we say that the aim of the Sceptic is imperturbability in matters of opinion, and moderation of feeling in those things that are inevitable.”</i></p><p>It is here that I cannot help but note the irony of Delavagus’s claim to be a modern Pyrrhonist while at the same time confessing to be both depressed and infuriated by my “unbounded arrogance”.  He clearly possesses neither imperturbability nor moderation of feeling, regardless of whether one concludes my arrogance is merely an opinion or an inevitable force of nature.  Skeptic, doubt thyself!  As for the matter of living without opinions or beliefs, we shall save that for the next post.</p><p> <b>Next section</b><br> <a href=\"http://www.milobookclub.com/2012/05/02/dissecting-skeptics-vi/\">Dissecting the skeptics VI</a></br></p><p><b>Previous sections</b><br> <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">Dissecting the skeptics I</a><br> <a href=\"http://www.milobookclub.com/2012/04/27/dissecting-sceptics-ii/\">Dissecting the skeptics II</a><br> <a href=\"http://www.milobookclub.com/2012/04/28/dissecting-skeptics-iii/\">Dissecting the skeptics III</a><br> <a href=\"http://www.milobookclub.com/2012/04/29/dissecting-skeptics-iv/\">Dissecting the skeptics IV</a></br></br></br></br></p></div>",
  "content_text": "Having completed my critique of\nTo Know Our Unknowing\n, I’ll now proceed to examining the second of Delavagus’s two posts on Pyrrhonism, entitled\nTo Unknow Our Knowing\n:\nMy previous post ended with the self-defeating conclusion that, as far as we know, we don’t know that we know anything (with the correlate that, insofar as we’re constrained by rational norms, we’re constrained to abjure knowledge-claims).  This conclusion was reached a priori: by attempting to think our thought, reflect on our reflection, know our knowing.\nFor as long as there have been skeptical arguments of this sort, there have been two stock counter-arguments: the peritropē, or self-refutation, argument; and the apraxia, or impracticability, argument.  Sextus Empiricus, the only ancient Pyrrhonian whose texts (or some of them, anyway) have come down to us, was perfectly aware of these objections; he argued that they are only effective against an incomplete or distorted understanding of Pyrrhonism.  The short version is that Sextus concedes self-refutation, but denies that it constitutes a counter-argument against Pyrrhonism (indeed, the self-refutatory character of skeptical arguments is central to his use of them), but he outright rejects impracticability arguments.  Pyrrhonism is not (or at least is not merely) a philosophy; it is an agōgē, a way of life.  Sextus characterizes the Pyrrhonian agōgē in terms of living adoxastōs, meaning without opinions or beliefs.  In this post, I want to suggest a way of understanding what it means to live adoxastōs.\nAs I said, Sextus embraces the self-refutatory character of his arguments.  He likens them to purgative drugs, which drain themselves away along with the humors they were administered to treat, or to a ladder one kicks away after having climbed up over it (an image appropriated, though probably at second- or third-hand, by both Nietzsche and Wittgenstein).  Those who charge Pyrrhonism with self-refutation think that it falls into a dilemma: either the skeptic accepts her own arguments, which (given their self-refutatory character) is logically impossible, or the skeptic doesn’t accept her own arguments, in which case she must also reject (or at least not endorse) their conclusions.  But the self-refutation charge overlooks two crucial features of the Pyrrhonian strategy: first, that charging the skeptic with self-refutation amounts to charging philosophico-rational thought as such with self-refutation; and second, that the target of Pyrrhonian arguments at their most general is not any particular content of philosophico-rational thought, but rather the very framework of such thought.\nAs I showed in\nDissecting the skeptics IV\n, Delavagus’s conclusion to his first post is not self-defeating, but rather invalid, because his suddenly universal claim about the human lack of knowledge is totally dependent upon a peculiar philosophical definition of knowledge and is undermined by no less than eight specific errors in his reasoning.  In his second post, Delavagus doesn’t waste any time before resorting to what we have observed is his customary handwaving.  Apparently he expects us to simply accept Sextus’s outright rejection of the apraxia argument on the basis of his ancient authority, which of course we can no more do than we can expect Delavagus to accept the historical existence of the Olympian gods on the ancient authority of Homer.  So, is Sextus’s outright rejection of the impracticability argument justified?\nWell, yes, as it turns out, but only because Sextus makes it very clear that the Pyrrhonian agōgē does not actually entail living by skeptical principles.  In Chapter IX, The Criterion of Scepticism, he writes:\n“It is evident that we pay careful attention to phenomena from what we say about the criterion of the Sceptical School. The word criterion is used in two ways. First, it is understood as a proof of existence or non-existence, in regard to which we shall speak in the opposing argument. Secondly, when it refers to action, meaning the criterion to which we give heed in life, in doing some things and refraining from doing others, and it is about this that we shall now speak. We say, consequently, that the criterion of the Sceptical School is the phenomenon, and in calling it so, we mean the idea of it. It cannot be doubted, as it is based upon susceptibility and involuntary feeling. Hence no one doubts, perhaps, that an object appears so and so, but one questions if it is as it appears. Therefore, as we cannot be entirely inactive as regards the observances of daily life, we live by giving heed to phenomena, and in an unprejudiced way. But this observance of what pertains to the daily life, appears to be of four different kinds. Sometimes it is directed by the guidance of nature, sometimes by the necessity of the feelings, sometimes by the tradition of laws and of customs, and sometimes by the teaching of the arts. It is directed by the guidance of nature, for by nature we are capable of sensation and thought; by the necessity of the feelings, for hunger leads us to food, and thirst to drink; by the traditions of laws and customs, for according to them we consider piety a good in daily life, and impiety an evil; by the teaching of the arts, for we are not inactive in the arts we undertake. We say all these things, however, without expressing a decided opinion.”\nIn other words, the Pyrrhonian is eminently practical, because he lives his daily life by giving heed to nature, his feelings, the tradition of laws and customs, and by the teaching of the arts, without any concern for his suspension of judgment or inability to express a decided opinion.  The philosophy cannot be impractical because the skeptic maintains a firewall of sorts between his reason and his daily life.  This means, of course, that the oft-seen attempts of the modern skeptics to utilize skepticism as a weapon in order to influence these phenomena is a breach of the firewall and therefore intrinsically non-Pyrrhonian.  But regardless, we can conclude that Sextus does successfully address the apraxia even if it calls into question the behavior of many of those who claim, incorrectly it would appear, to be Pyrrhonians.\nAs for the defense against the peritropē charge,\nI previously explained its flaws\nin response to an earlier request from Delavagus. Sextus’s argument against peritrope fails on three counts. First, Sextus erroneously conflates the subset of his particular philosophy with the set of all philosophico-rational thought; because we can observe there is philosophico-rational thought that is not Pyrrhonian skepticism, all refutation of the latter cannot automatically be taken as any refutation of the former. Second, even if Sextus were correct and charging the skeptic with self-refutation actually did amount to charging philosophico-rational thought as such with self-refutation, that doesn’t change the fact that if the charge is substantiated and all philosophico-rational thought is, in fact, self-refuting, then the charge of peritrope against Scepticism must also be correct! If the set is refuted, then the subset is refuted as well.  So, it’s not a valid defense against the charge.  Third, Delavagus doesn’t realize that the intended target of Pyrrhonian skepticism is irrelevant with regards to its self-refuting nature; it doesn’t matter what Sextus is intending to target when it can be shown that the same arguments can be used just as effectively against his own clearly stated aims.\nIn that earlier exchange, Delavagus attempted to respond to the first point by claiming that Pyrrhonism is not a philosophy and therefore not a subset of all philosophico-rational thought.  He wrote:\n“Pyrrhonism is a metaphilosophy, not a philosophy: it is philosophizing about philosophy itself, about rational thought as such. On my view, it contains no first-order philosophical claims whatsoever. In other words, it is NOT a member of the ‘set’ ‘Philosophies’; it is a critique of the set-as-such.”\nBut this is another inept attempt at a bait-and switch, because even if we accept his contention that Pyrrhonism is not a philosophy, it still specifically purports to be rational thought, as shown by Delavagus’s heavy reliance upon the Agrippan Trilemma, and therefore remains a subset of the set of all philosophico-rational thought.  Moreover, Delavagus’s view that Pyrrhonism is not a philosophy is provably wrong, as in Chapter I, The Principal Differences between Philosophers, Sextus writes:\n“It is probable that those who seek after anything whatever, will either find it as they continue the search, will deny that it can be found and confess it to be out of reach, or will go on seeking it. Some have said, accordingly, in regard to the things sought in philosophy, that they have found the truth, while others have declared it impossible to find, and still others continue to seek it. Those who think that they have found it are those who are especially called Dogmatics, as for example, the Schools of Aristotle and Epicurus, the Stoics and some others. Those who have declared it impossible to find are Clitomachus, Carneades, with their respective followers, and other Academicians. Those who still seek it are the Sceptics. It appears therefore, reasonable to conclude that the three principal kinds of philosophy are the Dogmatic, the Academic, and the Sceptic. Others may suitably treat of the other Schools, but as for the Sceptical School, we shall now give an outline of it, remarking in advance that in respect to nothing that will be said do we speak positively, that it must be absolutely so, but we shall state each thing historically as it now appears to us.”\nSo, Delavagus is clearly wrong, both in claiming that Pyrrhonism is not part of the set of all philosophico-rational thought\nand\nin claiming that it is not a philosophy.  Indeed, Sextus not only declares skepticism to be a philosophy, but one of “the three principal kinds of philosophy”.  (I suspect he’s also wrong to say it “contains no first-order philosophical claims whatsoever”, but we will examine that assertion in a future post.)  And therefore, Delavagus’s attempted defense of my attack on Sextus’s argument against peritrope clearly fails, as does the argument against peritrope.\nFinally, with regards to Delavagus’s claim that Pyrrhonism is more than a philosophy, but is an an agōgē, a way of life, as well, I note that it is a very strange way of life that makes explicit claims to have nothing to do with the way the philosopher actually lives his daily life, but it is nevertheless true.  Still, it should be kept in mind that it is entirely possible for something to fail as a philosophy, but not as a way of life, or vice-versa.  In any event, when the aims of Pyrrhonism are taken into account, it becomes readily apparent that the agōgē is nothing more than a form of anti-intellectual, morally neutral stoicism.\nSextus writes in Chapter XII:\n“We confess that sometimes [the Sceptic] is cold and thirsty, and that he suffers in such ways. But in these things even the ignorant are beset in two ways, from the feelings themselves, and not less also from the fact that they think these conditions are bad by nature. The Sceptic, however, escapes more easily, as he rejects the opinion that anything is in itself bad by nature. Therefore we say that the aim of the Sceptic is imperturbability in matters of opinion, and moderation of feeling in those things that are inevitable.”\nIt is here that I cannot help but note the irony of Delavagus’s claim to be a modern Pyrrhonist while at the same time confessing to be both depressed and infuriated by my “unbounded arrogance”.  He clearly possesses neither imperturbability nor moderation of feeling, regardless of whether one concludes my arrogance is merely an opinion or an inevitable force of nature.  Skeptic, doubt thyself!  As for the matter of living without opinions or beliefs, we shall save that for the next post.\nNext section\nDissecting the skeptics VI\nPrevious sections\nDissecting the skeptics I\nDissecting the skeptics II\nDissecting the skeptics III\nDissecting the skeptics IV",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-30T16:30:00+00:00"
}