{
  "url": "https://voxday.net/2012/04/27/dissecting-sceptics-ii/",
  "scraped_at": "2025-12-14T04:53:04.487688",
  "title": "Dissecting the sceptics II",
  "date_display": "April 27, 2012",
  "date_iso": "2012-04-27T13:43:00+00:00",
  "date_from_url": "2012-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the first post on <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">Dissecting the sceptics</a>, I noted that we had to be wary of a possible bait-and-switch regarding Delavagus’s use of a uniquely philosophical definition of ‘knowledge’ rather than any of the eight definitions more commonly used today.  There is nothing wrong with the definition of knowledge as “justified true belief”, nor do we have any reason object to its use here, but especially in light of the author’s academic background, we need to always keep that specific definition in mind because it necessarily limits the scope of the argument.  The next section of <a href=\"http://rsbakker.wordpress.com/2012/03/02/to-know-our-unknowing/\">To Know Our Unknowing</a> is as follows:</p><blockquote><p> So far, so good.  But any step we take from here is going to lead us into trouble, for the question immediately arises: What does and does not count as a genuine justification?  Right away, we find ourselves in the grip of what’s called the problem of the criterion, which can be summed up this way: without an already-established criterion of truth/justification, we have no way to establish the truth/justification of a putative criterion of truth/justification.  Immediately, in other words, we’ve fallen into the difficulty of needing to justify that which makes justification possible.  It is no easy task—putting it mildly—to see our way around this epistemic impasse.</p><p>But even if we bracket out the problem of the criterion, our difficulties are hardly over.  For the sake of argument, let’s all agree to construe justification in purely rationalistic terms.  Let us, in other words, agree to seek justification solely on the basis of the autonomous exercise of our capacity to reason.  (Let us, that is, become philosophers.)  Straight off, then, we can dismiss any putative justification that relies on appeals to authority (appeals that cannot be independently underwritten by reason alone, that is).  Appeals to authority (such as God, sacred texts, or your friendly neighborhood guru) can play a role in justification, but they cannot be its ground.  We can also dismiss things like divine revelation.  (Again, divine revelation can play a role in justification, but only if the truth of the revelation has been independently justified.)</p><p>In short, let’s all agree to be ‘rational.’  Now, there must exist constraints on what counts as rational; otherwise, the concept would be empty, indistinguishable from irrationality.  Ancient skeptics suggested the following as non-tendentious rational constraints:</p><p>(1)  If a person claims to know something, then that person opens herself up to the standing possibility of being asked how she knows, i.e., to being asked for the justification of her belief.</p><p>(2)  Successful justifications cannot involve:</p><p>Brute assumption<br> Infinite regress<br> Vicious circularity</br></br></p><p>(3)  If a claim to knowledge cannot be justified, then the claimant is rationally constrained to withdraw it (at least qua knowledge-claim).</p></blockquote><p>Delavagus continues reasonably here by bringing up the obvious question of what counts as justification in order to justify the true belief.  This is important, of course, because sans any justification, even a true belief is insufficient to qualify as knowledge by his definition of it.  The epistemic impasse is quickly reached, as the need for justification and the concomitant need for justification of the justification, quickly forces this definition of knowledge into an infinite regress.  Delavagus even goes so far as admitting he has “no way to establish the truth/justification of a putative criterion of truth/justification.”</p><p>But here is where he commits his fourth error.  Instead of giving up the philosophical definition of knowledge as intrinsically worthless due to what he has admitted is the impossibility of providing any established justifications for true beliefs, Delavagus simply waves his hand again and attempts to leap over the bottomless pit of the epistemic abyss by asking the reader to agree to pretend the problem of the criterion does not exist. He also asks us to ignore all potential justifications that are not based on the autonomous exercise of our ability to reason.  While only the former is an actual error, the decision to simply ignore all of the other forms of potential justification is something that we also have to be careful to keep in mind.  After all, it would be every bit as logically valid and epistemically sound here were we to agree instead to construe justification in purely revelatory terms while dismissing any putative justifications that are not based on sacred texts or divine visitations.  There is nothing wrong with this self-imposed limitation, but it must be remembered that it is artificial and the author has provided no grounds whatsoever in restricting all potential justification to the rational.</p><p>He goes on to correctly point out that it is necessary to distinguish between the rational justification and the irrational justification, then provides three constraints to help distinguish between the two.  The first point is unobjectionable, if a little confusingly worded.  If a person claims to possess justified true belief, that person opens himself up to the possibility of being asked about the justification of that belief, just as he opens himself up to questions concerning the truth of his belief or even if his belief is genuine.  And while I wouldn’t go so far as to call the second point an error because it is true that successful rational justifications can’t include brute assumption, infinite regress, or vicious circularity, Delavagus is more than a bit careless when he states that successful justifications cannot include them since he’s not attempting to define <i>successful</i> justifications, he’s attempting to define <i>rational</i> justifications.  This carelessness helps lead him into his fifth error, in (3), wherein he states that “If a claim to knowledge cannot be justified, then the claimant is rationally constrained to withdraw it”.</p><p>But how is that so?  There are three problems here.  First, the if/then statement is relevant, given the subject matter, but unwarranted.  The ancients may well have suggested it as a rational constraint, but their opinion has no bearing on whether it is legitimately applicable or not.  As it stands, (3) is nothing more than an appeal to authority of the sort that Delavagus has already ruled out of bounds.  Second, it is a circular statement, as how can a constraint intended to mark the limits between the rational and the irrational be itself dependent upon a rational constrainment?  Third, since Delavagus has permitted himself to simply “bracket out the problem of the criterion”, he has no ability to assert that anyone with a claim to knowledge that cannot be justified cannot do exactly the same in refusing to withdraw that claim.  The statement isn’t necessarily untrue, but it is both questionable and unjustified.</p><p>What we’re seeing here is that Delavagus has continued to narrow the scope of his argument while continuing to ignore the valid objections he readily admits.  What initially began in very broad terms, referring to humans being “stupid, stupid creatures” and telling us that “we’re all idiots” has now severely constricted the definition of knowledge, artificially thrown out every form of putative justification that is not based on reason, is using a dubious metric to distinguish between the rational and irrational, and is attempting to establish that which we were told cannot be established.  None of this is sufficient to declare Delavagus’s defense of Pyrrhonism invalid yet, but it does tend to indicate that one will have to examine his eventual conclusions very carefully to see if they are, in fact, successfully and rationally justified, or if they even follow logically from his arguments.</p><p><a href=\"http://www.milobookclub.com/2012/04/28/dissecting-skeptics-iii/\">Dissecting the skeptics III</a></p></div>",
  "content_text": "In the first post on\nDissecting the sceptics\n, I noted that we had to be wary of a possible bait-and-switch regarding Delavagus’s use of a uniquely philosophical definition of ‘knowledge’ rather than any of the eight definitions more commonly used today.  There is nothing wrong with the definition of knowledge as “justified true belief”, nor do we have any reason object to its use here, but especially in light of the author’s academic background, we need to always keep that specific definition in mind because it necessarily limits the scope of the argument.  The next section of\nTo Know Our Unknowing\nis as follows:\nSo far, so good.  But any step we take from here is going to lead us into trouble, for the question immediately arises: What does and does not count as a genuine justification?  Right away, we find ourselves in the grip of what’s called the problem of the criterion, which can be summed up this way: without an already-established criterion of truth/justification, we have no way to establish the truth/justification of a putative criterion of truth/justification.  Immediately, in other words, we’ve fallen into the difficulty of needing to justify that which makes justification possible.  It is no easy task—putting it mildly—to see our way around this epistemic impasse.\nBut even if we bracket out the problem of the criterion, our difficulties are hardly over.  For the sake of argument, let’s all agree to construe justification in purely rationalistic terms.  Let us, in other words, agree to seek justification solely on the basis of the autonomous exercise of our capacity to reason.  (Let us, that is, become philosophers.)  Straight off, then, we can dismiss any putative justification that relies on appeals to authority (appeals that cannot be independently underwritten by reason alone, that is).  Appeals to authority (such as God, sacred texts, or your friendly neighborhood guru) can play a role in justification, but they cannot be its ground.  We can also dismiss things like divine revelation.  (Again, divine revelation can play a role in justification, but only if the truth of the revelation has been independently justified.)\nIn short, let’s all agree to be ‘rational.’  Now, there must exist constraints on what counts as rational; otherwise, the concept would be empty, indistinguishable from irrationality.  Ancient skeptics suggested the following as non-tendentious rational constraints:\n(1)  If a person claims to know something, then that person opens herself up to the standing possibility of being asked how she knows, i.e., to being asked for the justification of her belief.\n(2)  Successful justifications cannot involve:\nBrute assumption\nInfinite regress\nVicious circularity\n(3)  If a claim to knowledge cannot be justified, then the claimant is rationally constrained to withdraw it (at least qua knowledge-claim).\nDelavagus continues reasonably here by bringing up the obvious question of what counts as justification in order to justify the true belief.  This is important, of course, because sans any justification, even a true belief is insufficient to qualify as knowledge by his definition of it.  The epistemic impasse is quickly reached, as the need for justification and the concomitant need for justification of the justification, quickly forces this definition of knowledge into an infinite regress.  Delavagus even goes so far as admitting he has “no way to establish the truth/justification of a putative criterion of truth/justification.”\nBut here is where he commits his fourth error.  Instead of giving up the philosophical definition of knowledge as intrinsically worthless due to what he has admitted is the impossibility of providing any established justifications for true beliefs, Delavagus simply waves his hand again and attempts to leap over the bottomless pit of the epistemic abyss by asking the reader to agree to pretend the problem of the criterion does not exist. He also asks us to ignore all potential justifications that are not based on the autonomous exercise of our ability to reason.  While only the former is an actual error, the decision to simply ignore all of the other forms of potential justification is something that we also have to be careful to keep in mind.  After all, it would be every bit as logically valid and epistemically sound here were we to agree instead to construe justification in purely revelatory terms while dismissing any putative justifications that are not based on sacred texts or divine visitations.  There is nothing wrong with this self-imposed limitation, but it must be remembered that it is artificial and the author has provided no grounds whatsoever in restricting all potential justification to the rational.\nHe goes on to correctly point out that it is necessary to distinguish between the rational justification and the irrational justification, then provides three constraints to help distinguish between the two.  The first point is unobjectionable, if a little confusingly worded.  If a person claims to possess justified true belief, that person opens himself up to the possibility of being asked about the justification of that belief, just as he opens himself up to questions concerning the truth of his belief or even if his belief is genuine.  And while I wouldn’t go so far as to call the second point an error because it is true that successful rational justifications can’t include brute assumption, infinite regress, or vicious circularity, Delavagus is more than a bit careless when he states that successful justifications cannot include them since he’s not attempting to define\nsuccessful\njustifications, he’s attempting to define\nrational\njustifications.  This carelessness helps lead him into his fifth error, in (3), wherein he states that “If a claim to knowledge cannot be justified, then the claimant is rationally constrained to withdraw it”.\nBut how is that so?  There are three problems here.  First, the if/then statement is relevant, given the subject matter, but unwarranted.  The ancients may well have suggested it as a rational constraint, but their opinion has no bearing on whether it is legitimately applicable or not.  As it stands, (3) is nothing more than an appeal to authority of the sort that Delavagus has already ruled out of bounds.  Second, it is a circular statement, as how can a constraint intended to mark the limits between the rational and the irrational be itself dependent upon a rational constrainment?  Third, since Delavagus has permitted himself to simply “bracket out the problem of the criterion”, he has no ability to assert that anyone with a claim to knowledge that cannot be justified cannot do exactly the same in refusing to withdraw that claim.  The statement isn’t necessarily untrue, but it is both questionable and unjustified.\nWhat we’re seeing here is that Delavagus has continued to narrow the scope of his argument while continuing to ignore the valid objections he readily admits.  What initially began in very broad terms, referring to humans being “stupid, stupid creatures” and telling us that “we’re all idiots” has now severely constricted the definition of knowledge, artificially thrown out every form of putative justification that is not based on reason, is using a dubious metric to distinguish between the rational and irrational, and is attempting to establish that which we were told cannot be established.  None of this is sufficient to declare Delavagus’s defense of Pyrrhonism invalid yet, but it does tend to indicate that one will have to examine his eventual conclusions very carefully to see if they are, in fact, successfully and rationally justified, or if they even follow logically from his arguments.\nDissecting the skeptics III",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-27T12:43:00+00:00"
}