{
  "url": "https://voxday.net/2012/04/18/exits-close/",
  "scraped_at": "2025-12-14T04:52:25.884984",
  "title": "The exits close",
  "date_display": "April 18, 2012",
  "date_iso": "2012-04-18T15:35:00+00:00",
  "date_from_url": "2012-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A lot of people failed to understand the point of my controversial column “Against a Fence”, having been distracted by the deportation discussion.  Even fewer understood my reasoning behind it; many critics found it hard to wrap their minds around an anti-immigration, anti-border wall perspective.  But it has always been a tautological truth that a wall designed to keep people out is just as useful for keeping people in. <a href=\"http://news.investors.com/article/608156/201204171850/irs-taking-away-your-passport-obviously-unconstitutional.htm?src=IBDDAE\">The proposed law to strip passports</a> in order to better hold Americans hostage to the IRS would appear to be an indication that the time in which one easily leave the United States is rapidly coming to an end.</p><blockquote><p>The Republican House of Representatives may soon follow the Democratic Senate and give the IRS the power to confiscate your passport on mere suspicion of owing taxes. There’s no place like home, comrade.</p><p>‘America, Love It Or Leave It” might be an obsolete slogan if the “bipartisan transportation bill” that just passed the Senate is approved by the House and becomes law. Contained within the suspiciously titled “Moving Ahead for Progress in the 21st Century Act,” or “MAP 21,” is a provision that gives the Internal Revenue Service the power to keep U.S. citizens from leaving the country if it finds that they owe $50,000 or more in unpaid taxes — no court ruling necessary.</p><p>It is hard to imagine any law more reminiscent of the Soviet Union that America toppled, or its Eastern Bloc slave satellites.</p></blockquote><p>In a free and well-governed society, exile is a punishment.  In an unfree and misgoverned one, exile is impermissible.  There is no stronger indication that America is no longer free than the fact that its leadership is seriously contemplating the idea of attempting to imprison its citizens within its borders.</p><p>And of course, one tends to doubt that Warren Buffett will lose his passport despite Berkshire Hathaway owing massive back taxes, or that any of the 98,000 federal employees who owe a combined $1 billion in back taxes will be deprived of their ability to travel outside the country.  And while the writer is correct to say that “if House Republicans pass this assault on our Constitution, their credibility will be in tatters”, this presumes that the House Republicans still possess any credibility after permitting the continued growth of big government by raising the debt ceiling last year.</p><p>For all that the Congressional actions are egregiously unconstitutional and directly opposed to the foundational principles of America, one shouldn’t be surprised by any of this.  This behavior is completely typical of financially desperate states that can no longer afford the costs of empire.  The collapse of the Soviet Union was only the most recent example; there are many to be found throughout history.  “Valentinian III, who remarked in 444 AD that new taxes on landowners and merchants would be catastrophic, still imposed an additional 4% sales tax… and further decreed that all transactions be conducted in the presence of a tax collector.”  But however harsh the crackdown, however totalitarian the government, strict tax enforcement never works because its objectives are inevitably based upon a static revenue model that fails to account for Man’s unwillingness to work and to obey the law when the state claims an excessive share on the fruits of his labor.</p><p>Enjoy the decline… preferably from a distance.</p></div>",
  "content_text": "A lot of people failed to understand the point of my controversial column “Against a Fence”, having been distracted by the deportation discussion.  Even fewer understood my reasoning behind it; many critics found it hard to wrap their minds around an anti-immigration, anti-border wall perspective.  But it has always been a tautological truth that a wall designed to keep people out is just as useful for keeping people in.\nThe proposed law to strip passports\nin order to better hold Americans hostage to the IRS would appear to be an indication that the time in which one easily leave the United States is rapidly coming to an end.\nThe Republican House of Representatives may soon follow the Democratic Senate and give the IRS the power to confiscate your passport on mere suspicion of owing taxes. There’s no place like home, comrade.\n‘America, Love It Or Leave It” might be an obsolete slogan if the “bipartisan transportation bill” that just passed the Senate is approved by the House and becomes law. Contained within the suspiciously titled “Moving Ahead for Progress in the 21st Century Act,” or “MAP 21,” is a provision that gives the Internal Revenue Service the power to keep U.S. citizens from leaving the country if it finds that they owe $50,000 or more in unpaid taxes — no court ruling necessary.\nIt is hard to imagine any law more reminiscent of the Soviet Union that America toppled, or its Eastern Bloc slave satellites.\nIn a free and well-governed society, exile is a punishment.  In an unfree and misgoverned one, exile is impermissible.  There is no stronger indication that America is no longer free than the fact that its leadership is seriously contemplating the idea of attempting to imprison its citizens within its borders.\nAnd of course, one tends to doubt that Warren Buffett will lose his passport despite Berkshire Hathaway owing massive back taxes, or that any of the 98,000 federal employees who owe a combined $1 billion in back taxes will be deprived of their ability to travel outside the country.  And while the writer is correct to say that “if House Republicans pass this assault on our Constitution, their credibility will be in tatters”, this presumes that the House Republicans still possess any credibility after permitting the continued growth of big government by raising the debt ceiling last year.\nFor all that the Congressional actions are egregiously unconstitutional and directly opposed to the foundational principles of America, one shouldn’t be surprised by any of this.  This behavior is completely typical of financially desperate states that can no longer afford the costs of empire.  The collapse of the Soviet Union was only the most recent example; there are many to be found throughout history.  “Valentinian III, who remarked in 444 AD that new taxes on landowners and merchants would be catastrophic, still imposed an additional 4% sales tax… and further decreed that all transactions be conducted in the presence of a tax collector.”  But however harsh the crackdown, however totalitarian the government, strict tax enforcement never works because its objectives are inevitably based upon a static revenue model that fails to account for Man’s unwillingness to work and to obey the law when the state claims an excessive share on the fruits of his labor.\nEnjoy the decline… preferably from a distance.",
  "tags": [
    "decline and fall",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-18T14:35:00+00:00"
}