{
  "url": "https://voxday.net/2012/04/12/global-medieva/",
  "scraped_at": "2025-12-14T04:52:00.256458",
  "title": "The global medieval",
  "date_display": "April 12, 2012",
  "date_iso": "2012-04-12T09:55:00+00:00",
  "date_from_url": "2012-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While it is generally a category error to talk about the medieval period outside of Europe, it is perfectly appropriate to discuss <a href=\"http://www.dailymail.co.uk/sciencetech/article-2120512/Global-warming-Earth-heated-medieval-times-human-CO2-emissions.html\">the warming that took place during medieval times</a> and has bedeviled the climate change propagandists.  Unsurprisingly, the latest evidence indicates that the AGW/CC scammers are incorrect – again – and the warming period was not limited to Europe:</p><blockquote><p>Current theories of the causes and impact of global warming have been thrown into question by a new study which shows that during medieval times areas as far apart as Europe and Antarctica both warmed up.  It then cooled down naturally and there was even a ‘mini ice age’.</p><p>A team of scientists led by geochemist Zunli Lu from Syracuse University in New York state, has found that the ‘Medieval Warm Period’ approximately 500 to 1,000 years ago wasn’t just confined to Europe.  In fact, it extended all the way down to Antarctica.</p><p>At present the Intergovernmental Panel on Climate Change (IPCC) argues that the Medieval Warm Period was confined to Europe.</p></blockquote><p>It shouldn’t be at all surprising that the climate scientists have been shown to be wrong again.  Remember, experiment-backed science <a href=\"http://www.milobookclub.com/2012/04/09/intrinsic-unreliability-of-science/\">is only about 11% reliable</a> <i>according to the scientific method itself</i>, so you can safely expect that whenever scientists make a new public announcement, they’re going to be wrong around 90 percent of the time.</p><p>The rule of thumb is that if you can’t make a physical object or machine based on the scientific principles involved, the scientists are wrong.  One can reasonably trust engineers, engineering, and technology, one cannot reasonably place any confidence in scientists, science, or the current scientific consensus.</p></div>",
  "content_text": "While it is generally a category error to talk about the medieval period outside of Europe, it is perfectly appropriate to discuss\nthe warming that took place during medieval times\nand has bedeviled the climate change propagandists.  Unsurprisingly, the latest evidence indicates that the AGW/CC scammers are incorrect – again – and the warming period was not limited to Europe:\nCurrent theories of the causes and impact of global warming have been thrown into question by a new study which shows that during medieval times areas as far apart as Europe and Antarctica both warmed up.  It then cooled down naturally and there was even a ‘mini ice age’.\nA team of scientists led by geochemist Zunli Lu from Syracuse University in New York state, has found that the ‘Medieval Warm Period’ approximately 500 to 1,000 years ago wasn’t just confined to Europe.  In fact, it extended all the way down to Antarctica.\nAt present the Intergovernmental Panel on Climate Change (IPCC) argues that the Medieval Warm Period was confined to Europe.\nIt shouldn’t be at all surprising that the climate scientists have been shown to be wrong again.  Remember, experiment-backed science\nis only about 11% reliable\naccording to the scientific method itself\n, so you can safely expect that whenever scientists make a new public announcement, they’re going to be wrong around 90 percent of the time.\nThe rule of thumb is that if you can’t make a physical object or machine based on the scientific principles involved, the scientists are wrong.  One can reasonably trust engineers, engineering, and technology, one cannot reasonably place any confidence in scientists, science, or the current scientific consensus.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-12T08:55:00+00:00"
}