{
  "url": "https://voxday.net/2012/04/08/he-is-not-here/",
  "scraped_at": "2025-12-14T04:51:39.756143",
  "title": "“He is not here”",
  "date_display": "April 8, 2012",
  "date_iso": "2012-04-08T08:24:00+00:00",
  "date_from_url": "2012-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>On the first day of the week, very early in the morning, the women took the spices they had prepared and went to the tomb. They found the stone rolled away from the tomb, but when they entered, they did not find the body of the Lord Jesus. While they were wondering about this, suddenly two men in clothes that gleamed like lightning stood beside them. In their fright the women bowed down with their faces to the ground, but the men said to them, “Why do you look for the living among the dead? He is not here; he has risen! Remember how he told you, while he was still with you in Galilee: ‘The Son of Man must be delivered over to the hands of sinners, be crucified and on the third day be raised again.’ ” Then they remembered his words.</i></p><p>When they came back from the tomb, they told all these things to the Eleven and to all the others. It was Mary Magdalene, Joanna, Mary the mother of James, and the others with them who told this to the apostles. But they did not believe the women, because their words seemed to them like nonsense. Peter, however, got up and ran to the tomb. Bending over, he saw the strips of linen lying by themselves, and he went away, wondering to himself what had happened. <br> – Luke 24:1-12</br></p></div>",
  "content_text": "On the first day of the week, very early in the morning, the women took the spices they had prepared and went to the tomb. They found the stone rolled away from the tomb, but when they entered, they did not find the body of the Lord Jesus. While they were wondering about this, suddenly two men in clothes that gleamed like lightning stood beside them. In their fright the women bowed down with their faces to the ground, but the men said to them, “Why do you look for the living among the dead? He is not here; he has risen! Remember how he told you, while he was still with you in Galilee: ‘The Son of Man must be delivered over to the hands of sinners, be crucified and on the third day be raised again.’ ” Then they remembered his words.\nWhen they came back from the tomb, they told all these things to the Eleven and to all the others. It was Mary Magdalene, Joanna, Mary the mother of James, and the others with them who told this to the apostles. But they did not believe the women, because their words seemed to them like nonsense. Peter, however, got up and ran to the tomb. Bending over, he saw the strips of linen lying by themselves, and he went away, wondering to himself what had happened.\n– Luke 24:1-12",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-08T07:24:00+00:00"
}