{
  "url": "https://voxday.net/2012/04/24/mailvox-sextus-say-relax/",
  "scraped_at": "2025-12-14T04:52:49.814061",
  "title": "Mailvox: Sextus say relax",
  "date_display": "April 24, 2012",
  "date_iso": "2012-04-24T12:30:00+00:00",
  "date_from_url": "2012-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not being a reader of this blog, Delavagus would have had no reason to know I’d read Sextus Empiricus last October, which is why I’m somewhat more familiar with Pyrrhonian scepticism than he probably assumed.  Anyhow, the two questions he presented weren’t difficult to answer, although I leave it to the reader to decide how effectively I answered them.</p><blockquote><p> I’m particularly interested if, after reading [his two posts on ancient skepticism], you still want to charge skepticism with incoherence. If so, (a) what do you think the incoherence consists in? and (b) in what way does Sextus’s argument against peritrope fail?</p></blockquote><p>First, let me point out that I’ve told Delavagus I am quite willing to respond in detail to those two posts on ancient skepticism if he’s willing to allow me to post large chunks of them – properly credited to him, of course – here on the blog so that everyone easily can follow along.  But it’s not necessary to go into that level of detail to answer these two questions, although I have to point out that my charge of incoherence was not directed at Sextus Empiricus, the Pyrrhonian school of scepticism, or even skepticism in general, but rather at the professed uncertainty of R. Scott Bakker.</p><p>That being said, yes, I do still want to charge skepticism, specifically Pyrrhonian scepticism, with incoherence.  In answer to (a), I think the incoherence consists of the inherent contradiction between its arguments and its aims.  In Chapter XII <i>What Is the Aim of Scepticism</i>, Empiricus writes: <i>“It follows naturally to treat of the aim of the Sceptical School.  An aim is that for which as an end all things are done or thought, itself depending on nothing, or in other words, it is the ultimatum of things to be desired.  We say, then, that he aim of the Sceptic is “tranquility of soul” in those things which pertain to the opinion and moderation in the things that life imposes.”</i></p><p>This creates two problems.  It should be readily apparent that we can observe here that the Sceptic is claiming knowledge of things that, by virtue of his own philosophical system, he cannot possibly know.  If he cannot know that the soul exists, he cannot reasonably aim for its tranquility.  If he cannot know what tranquility is, he cannot aim for helping his soul reach that state.  If he has no quantifiable metric for the things that life imposes, he cannot know what is excess, what is insufficient, and still less what is that desired moderation.  Pyrrhonian scepticism is incoherent as both a philosophy and as a way of life because it is little more than a philosophically offensive weapon that can be trained just as effectively on its own stated purposes as on anything else.</p><p>Moreover, it can be shown to empirically fail as well, at least to the extent that it actually exists today.  One of the arguments presented by the Uncertainty crowd is that the unquestioning nature of belief certainty is dangerous because it permits people to act freely without remorse or guilty conscience.  But what is the most extreme belief certainty if not “‘tranquility of soul’ in those things which pertain to the opinion”?  The member of the SS-Totenkopfverbände who was morally certain of the rightness of the Final Solution and liquidated the enemies of the National Socialist regime during the day without losing any sleep over it at night is, by Sextus Empiricus’s own chosen measure, a more perfect Sceptic than the philosophy student who tosses and turns throughout the night wrestling with the troubling question of his own existence.  Moreover, in discussing various beliefs with the Uncertainty crowd at Three Pound Brain, (who are not necessarily proper Pyrrhonian School Sceptics by any means), it is readily observable that they possess no tranquility of soul, as they are, by their own admission, deeply bothered by the mere existence of beliefs with which they strongly disagree.</p><p>Concerning (b), Sextus’s argument against peritrope fails on three counts.  First, he erroneously conflates the subset (his particular philosophy) with the set (all philosophico-rational thought); because there is philosophico-rational thought that is not Pyrrhonian scepticism, all refutation of the latter cannot automatically be taken as any refutation of the former.  Second, even if Sextus were correct and charging the skeptic with self-refutation did amount to charging philosophico-rational thought as such with self-refutation, that doesn’t change the fact that since Pyrrhonian scepticism is a subset of philosophico-rational thought, if the charge is substantiated and all philosophico-rational thought is, in fact, self-refuting, then the charge of peritrope against Scepticism must also be correct!  It’s not a valid defense.  Third, Sextus doesn’t realize that the intended target of Pyrrhonian arguments is irrelevant with regards to its self-refuting nature; it doesn’t matter what he is intending to target when it can be shown that his arguments necessarily also target his own stated aims.</p><p>And in conclusion, I note that it is not only the core aims that are susceptible to a valid charge of peritrope, but each of the Ten Tropes that are used to justify Pyrrhonian “suspension of judgment” as well.</p></div>",
  "content_text": "Not being a reader of this blog, Delavagus would have had no reason to know I’d read Sextus Empiricus last October, which is why I’m somewhat more familiar with Pyrrhonian scepticism than he probably assumed.  Anyhow, the two questions he presented weren’t difficult to answer, although I leave it to the reader to decide how effectively I answered them.\nI’m particularly interested if, after reading [his two posts on ancient skepticism], you still want to charge skepticism with incoherence. If so, (a) what do you think the incoherence consists in? and (b) in what way does Sextus’s argument against peritrope fail?\nFirst, let me point out that I’ve told Delavagus I am quite willing to respond in detail to those two posts on ancient skepticism if he’s willing to allow me to post large chunks of them – properly credited to him, of course – here on the blog so that everyone easily can follow along.  But it’s not necessary to go into that level of detail to answer these two questions, although I have to point out that my charge of incoherence was not directed at Sextus Empiricus, the Pyrrhonian school of scepticism, or even skepticism in general, but rather at the professed uncertainty of R. Scott Bakker.\nThat being said, yes, I do still want to charge skepticism, specifically Pyrrhonian scepticism, with incoherence.  In answer to (a), I think the incoherence consists of the inherent contradiction between its arguments and its aims.  In Chapter XII\nWhat Is the Aim of Scepticism\n, Empiricus writes:\n“It follows naturally to treat of the aim of the Sceptical School.  An aim is that for which as an end all things are done or thought, itself depending on nothing, or in other words, it is the ultimatum of things to be desired.  We say, then, that he aim of the Sceptic is “tranquility of soul” in those things which pertain to the opinion and moderation in the things that life imposes.”\nThis creates two problems.  It should be readily apparent that we can observe here that the Sceptic is claiming knowledge of things that, by virtue of his own philosophical system, he cannot possibly know.  If he cannot know that the soul exists, he cannot reasonably aim for its tranquility.  If he cannot know what tranquility is, he cannot aim for helping his soul reach that state.  If he has no quantifiable metric for the things that life imposes, he cannot know what is excess, what is insufficient, and still less what is that desired moderation.  Pyrrhonian scepticism is incoherent as both a philosophy and as a way of life because it is little more than a philosophically offensive weapon that can be trained just as effectively on its own stated purposes as on anything else.\nMoreover, it can be shown to empirically fail as well, at least to the extent that it actually exists today.  One of the arguments presented by the Uncertainty crowd is that the unquestioning nature of belief certainty is dangerous because it permits people to act freely without remorse or guilty conscience.  But what is the most extreme belief certainty if not “‘tranquility of soul’ in those things which pertain to the opinion”?  The member of the SS-Totenkopfverbände who was morally certain of the rightness of the Final Solution and liquidated the enemies of the National Socialist regime during the day without losing any sleep over it at night is, by Sextus Empiricus’s own chosen measure, a more perfect Sceptic than the philosophy student who tosses and turns throughout the night wrestling with the troubling question of his own existence.  Moreover, in discussing various beliefs with the Uncertainty crowd at Three Pound Brain, (who are not necessarily proper Pyrrhonian School Sceptics by any means), it is readily observable that they possess no tranquility of soul, as they are, by their own admission, deeply bothered by the mere existence of beliefs with which they strongly disagree.\nConcerning (b), Sextus’s argument against peritrope fails on three counts.  First, he erroneously conflates the subset (his particular philosophy) with the set (all philosophico-rational thought); because there is philosophico-rational thought that is not Pyrrhonian scepticism, all refutation of the latter cannot automatically be taken as any refutation of the former.  Second, even if Sextus were correct and charging the skeptic with self-refutation did amount to charging philosophico-rational thought as such with self-refutation, that doesn’t change the fact that since Pyrrhonian scepticism is a subset of philosophico-rational thought, if the charge is substantiated and all philosophico-rational thought is, in fact, self-refuting, then the charge of peritrope against Scepticism must also be correct!  It’s not a valid defense.  Third, Sextus doesn’t realize that the intended target of Pyrrhonian arguments is irrelevant with regards to its self-refuting nature; it doesn’t matter what he is intending to target when it can be shown that his arguments necessarily also target his own stated aims.\nAnd in conclusion, I note that it is not only the core aims that are susceptible to a valid charge of peritrope, but each of the Ten Tropes that are used to justify Pyrrhonian “suspension of judgment” as well.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-24T11:30:00+00:00"
}