{
  "url": "https://voxday.net/2012/04/20/mailvox-writing-advice/",
  "scraped_at": "2025-12-14T04:52:31.332095",
  "title": "Mailvox: writing advice",
  "date_display": "April 20, 2012",
  "date_iso": "2012-04-20T10:13:00+00:00",
  "date_from_url": "2012-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AD has a few questions about the business:</p><blockquote><p> I am a fan of your writing, both fiction and non-fiction, and own three of your books.  I have thought about writing both fiction and non-fiction on topics that I think have not been written on or I am just ignorant of such books existing, and I want to write these books.  I still think that my writing skills have a long ways to go before I can turn out a book that I would feel happy about (and just to clarify, I am not looking to earn a living via writing, there are just some books I must write).  Let me just list my brief questions in a list:</p><p>1.  Are sample chapters worth sending to publishers?</p><p>2.  What are some pitfalls people should avoid (both non-fiction and fiction)?</p><p>3.  If you could mention one or two resources that will help someone write either non-fiction or fiction work, what would the resource(s) be?</p><p>4.  What do you think of self-publishing or using a publisher for your work?</p><p>5.  If one uses a publisher, how would one make the book available for free or a very low price?</p><p>6.  What have you found to be the best three ways to advertise your book?</p></blockquote><p>First, I’m pleased to see that AD has the common sense to pursue writing as a past time and isn’t thinking that it’s a practical way to make a living these days.  In answer to his questions:</p><p>1.  Yes.  The usual submission consists of three sample chapters.  Even if you send a complete manuscript, there is almost no chance anyone is going to read the whole thing anyhow.  Nor is it necessary.  When I was doing the slush pile reading for a SF/F publisher six or seven years ago, I usually had a sound basis for rejecting a submission within the first three pages.  Those who can’t write, quite clearly can’t write.  And most people can’t write.</p><p>2.  The biggest pitfall I’ve had to deal with is the feeling that one’s work has to be tremendously brilliant or original in order to be good or successful.  No one actually gives a damn about such things except other writers and the writer himself.  The Tolkiens and Ecos are the rare exceptions.  I agonized over attempting to fit the story of <i>Summa Elvetica</i> to the philosophical structure, couldn’t manage to do it, and was subsequently bemused to find that absolutely no one noticed, much less cared, about what was arguably the most structurally original fantasy novel in years… and the only reviewer who even commented on the philosophical argument actually mistook it for a real one from Thomas Aquinas.  The main focus should simply be on writing a good story with interesting characters, everything else is window dressing.</p><p>3.  Obtain a book or two that is directly relevant to your general subject and will give your book solid depth of detail.  TIA would have been much less effective without <i>An Encyclopedia of Wars</i>.  In the novel I’m currently writing, I’m making heavy use of various letters and speeches by Cicero and other Romans.</p><p>4.  Electronic self-publishing is now without question the way to go.  In fact, I’d originally intended to self-publish <i>Arts of Dark and Light</i>, and it was only because I was contractually obligated to offer it to Marcher Lord due to its connection to <i>Summa Elvetica</i> that I ended up, to my surprise, publishing it through them.</p><p>5.  Negotiate it in the contract.  That’s why my ebooks are much less expensive than most.  I made it clear to all three of my publishers that I wanted the price to be 1.99 and not the full price or 9.99 that most publishers at the time were charging.  When the EW ebooks are released, hopefully next month, they’ll most likely be priced at 1.99 as well.</p><p>6.  I am not the correct person to answer this question, as I think I have done a very poor job of advertising them.  Pretty much all I do is write a reasonably popular blog and showcase a cover or two on the sidebar.  Judging by the results, this isn’t ineffective, but also is not the best way to go about advertising one’s books.</p></div>",
  "content_text": "AD has a few questions about the business:\nI am a fan of your writing, both fiction and non-fiction, and own three of your books.  I have thought about writing both fiction and non-fiction on topics that I think have not been written on or I am just ignorant of such books existing, and I want to write these books.  I still think that my writing skills have a long ways to go before I can turn out a book that I would feel happy about (and just to clarify, I am not looking to earn a living via writing, there are just some books I must write).  Let me just list my brief questions in a list:\n1.  Are sample chapters worth sending to publishers?\n2.  What are some pitfalls people should avoid (both non-fiction and fiction)?\n3.  If you could mention one or two resources that will help someone write either non-fiction or fiction work, what would the resource(s) be?\n4.  What do you think of self-publishing or using a publisher for your work?\n5.  If one uses a publisher, how would one make the book available for free or a very low price?\n6.  What have you found to be the best three ways to advertise your book?\nFirst, I’m pleased to see that AD has the common sense to pursue writing as a past time and isn’t thinking that it’s a practical way to make a living these days.  In answer to his questions:\n1.  Yes.  The usual submission consists of three sample chapters.  Even if you send a complete manuscript, there is almost no chance anyone is going to read the whole thing anyhow.  Nor is it necessary.  When I was doing the slush pile reading for a SF/F publisher six or seven years ago, I usually had a sound basis for rejecting a submission within the first three pages.  Those who can’t write, quite clearly can’t write.  And most people can’t write.\n2.  The biggest pitfall I’ve had to deal with is the feeling that one’s work has to be tremendously brilliant or original in order to be good or successful.  No one actually gives a damn about such things except other writers and the writer himself.  The Tolkiens and Ecos are the rare exceptions.  I agonized over attempting to fit the story of\nSumma Elvetica\nto the philosophical structure, couldn’t manage to do it, and was subsequently bemused to find that absolutely no one noticed, much less cared, about what was arguably the most structurally original fantasy novel in years… and the only reviewer who even commented on the philosophical argument actually mistook it for a real one from Thomas Aquinas.  The main focus should simply be on writing a good story with interesting characters, everything else is window dressing.\n3.  Obtain a book or two that is directly relevant to your general subject and will give your book solid depth of detail.  TIA would have been much less effective without\nAn Encyclopedia of Wars\n.  In the novel I’m currently writing, I’m making heavy use of various letters and speeches by Cicero and other Romans.\n4.  Electronic self-publishing is now without question the way to go.  In fact, I’d originally intended to self-publish\nArts of Dark and Light\n, and it was only because I was contractually obligated to offer it to Marcher Lord due to its connection to\nSumma Elvetica\nthat I ended up, to my surprise, publishing it through them.\n5.  Negotiate it in the contract.  That’s why my ebooks are much less expensive than most.  I made it clear to all three of my publishers that I wanted the price to be 1.99 and not the full price or 9.99 that most publishers at the time were charging.  When the EW ebooks are released, hopefully next month, they’ll most likely be priced at 1.99 as well.\n6.  I am not the correct person to answer this question, as I think I have done a very poor job of advertising them.  Pretty much all I do is write a reasonably popular blog and showcase a cover or two on the sidebar.  Judging by the results, this isn’t ineffective, but also is not the best way to go about advertising one’s books.",
  "tags": [
    "mailvox",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-20T09:13:00+00:00"
}