{
  "url": "https://voxday.net/2012/04/23/no-patience-for-debate/",
  "scraped_at": "2025-12-14T04:52:46.164135",
  "title": "No patience for debate?",
  "date_display": "April 23, 2012",
  "date_iso": "2012-04-23T21:31:00+00:00",
  "date_from_url": "2012-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh from being caught out, Wängsty makes what would appear to be <a href=\"http://rsbakker.wordpress.com/2012/04/23/so-this-one-time-at-hate-camp/\">a wildly unfounded accusation</a>:</p><blockquote><p> One of the things that has always puzzled me about this fracas is the way the Hate Camp is so bent on perceptions of my ‘emotional distress,’ the idea that they are ‘getting to me,’ or causing me real emotional anguish. And I realized, these are people who want to hurt people they deem ‘immoral.’ They want, quite simply, someone to punish – or a ‘punching bag,’ as ACM has it.  Now this is more than a little troubling. But it does explain why they have no patience for nuance or debate. It’s hard to hurt people when their guilt is aired as an open question. If they’re innocent, then you being so bent on hurting them says some pretty nasty things about you.</p></blockquote><p>To which I responded: <i>Is that so? You couldn’t find any of the extensive debates on my blog? Very well, to prove you wrong, I’m pleased to challenge you to a written debate on the causal relationship between certainty, as you have defined it, and war. I suggest three rounds of no more than 2,500 words per person each, and since you have made the claim, I suggest that you go first.</i></p><p>Do you accept?</p><p>PS – I readily acknowledge that I still owe Dominic the next round on the existence of gods.  And I have worked on it, but I’m not satisfied with it yet.  Knowing him, I expect he won’t object, seeing as that it will take only a fraction of the effort to take apart Bakker’s claim than it does to effectively respond to Dominic’s arguments.</p></div>",
  "content_text": "Fresh from being caught out, Wängsty makes what would appear to be\na wildly unfounded accusation\n:\nOne of the things that has always puzzled me about this fracas is the way the Hate Camp is so bent on perceptions of my ‘emotional distress,’ the idea that they are ‘getting to me,’ or causing me real emotional anguish. And I realized, these are people who want to hurt people they deem ‘immoral.’ They want, quite simply, someone to punish – or a ‘punching bag,’ as ACM has it.  Now this is more than a little troubling. But it does explain why they have no patience for nuance or debate. It’s hard to hurt people when their guilt is aired as an open question. If they’re innocent, then you being so bent on hurting them says some pretty nasty things about you.\nTo which I responded:\nIs that so? You couldn’t find any of the extensive debates on my blog? Very well, to prove you wrong, I’m pleased to challenge you to a written debate on the causal relationship between certainty, as you have defined it, and war. I suggest three rounds of no more than 2,500 words per person each, and since you have made the claim, I suggest that you go first.\nDo you accept?\nPS – I readily acknowledge that I still owe Dominic the next round on the existence of gods.  And I have worked on it, but I’m not satisfied with it yet.  Knowing him, I expect he won’t object, seeing as that it will take only a fraction of the effort to take apart Bakker’s claim than it does to effectively respond to Dominic’s arguments.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2012-04-23T20:31:00+00:00"
}