{
  "url": "https://voxday.net/2012/04/29/primacy-of-history/",
  "scraped_at": "2025-12-14T04:53:15.514051",
  "title": "The primacy of history",
  "date_display": "April 29, 2012",
  "date_iso": "2012-04-29T16:43:00+00:00",
  "date_from_url": "2012-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel Abraham attacks the idea of <a href=\"http://aidanmoher.com/blog/2012/04/articles/concerning-historical-authenticity-in-fantasy-or-truth-forgives-you-nothing-by-daniel-abraham/\">historical authenticity in fantasy</a>:</p><blockquote><p> The idea that the race, gender, or sexual roles of a given work of secondary world, quasi-medieval fantasy were dictated by history doesn’t work on any level. First, history has an almost unimaginably rich set of examples to pull from. Second, there are a wide variety of secondary world faux-medieval fantasies that don’t reach for historical accuracy and which would be served poorly by the attempt. And third, even in the works where the standard is applied, it’s only applied to specific, cherry-picked facets of the fantasy culture and the real world.</p></blockquote><p>This is a fascinating assertion.  We need <i>less</i> authenticity in fantasy?  Let’s begin by looking at Abraham’s three initial assertions.  First, history does not have “an almost unimaginably rich set of examples to pull from”.  In fact, those of us who study history either professionally or on an armchair basis tend to be impressed by the way in which the historical patterns tend to repeat themselves.  For example, the economic notions of the Mongol ruler Gaikhatu Khan, whose issuance of paper currency in 1294 promised reduced poverty, lower prices, and income equality, eerily prefigured both the General Theory of John Maynard Keynes as well as most of the Federal Reserve statements since 2008.  Granted, neither Bernanke nor Geithner met with the unfortunate fate of the Khan’s chief financial officer, but as they say, history rhymes rather than repeats.</p><p>Read the rest <a href=\"http://www.blackgate.com/2012/04/29/the-primacy-of-history/\">at the Black Gate</a>.</p></div>",
  "content_text": "Daniel Abraham attacks the idea of\nhistorical authenticity in fantasy\n:\nThe idea that the race, gender, or sexual roles of a given work of secondary world, quasi-medieval fantasy were dictated by history doesn’t work on any level. First, history has an almost unimaginably rich set of examples to pull from. Second, there are a wide variety of secondary world faux-medieval fantasies that don’t reach for historical accuracy and which would be served poorly by the attempt. And third, even in the works where the standard is applied, it’s only applied to specific, cherry-picked facets of the fantasy culture and the real world.\nThis is a fascinating assertion.  We need\nless\nauthenticity in fantasy?  Let’s begin by looking at Abraham’s three initial assertions.  First, history does not have “an almost unimaginably rich set of examples to pull from”.  In fact, those of us who study history either professionally or on an armchair basis tend to be impressed by the way in which the historical patterns tend to repeat themselves.  For example, the economic notions of the Mongol ruler Gaikhatu Khan, whose issuance of paper currency in 1294 promised reduced poverty, lower prices, and income equality, eerily prefigured both the General Theory of John Maynard Keynes as well as most of the Federal Reserve statements since 2008.  Granted, neither Bernanke nor Geithner met with the unfortunate fate of the Khan’s chief financial officer, but as they say, history rhymes rather than repeats.\nRead the rest\nat the Black Gate\n.",
  "tags": [
    "Black Gate",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-29T15:43:00+00:00"
}