{
  "url": "https://voxday.net/2012/04/07/profiles-in-intellectual-courage/",
  "scraped_at": "2025-12-14T04:51:36.102802",
  "title": "Profiles in intellectual courage",
  "date_display": "April 7, 2012",
  "date_iso": "2012-04-07T13:20:00+00:00",
  "date_from_url": "2012-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The NRO crew provides some striking profiles in intellectual courage:</p><p>“Does @NRO want to be associated with someone who publishes racist trash like this?  I know I don’t”<br> – Ramesh Ponnuru</br></p><p>“For the record, I find my colleague John Derbyshire’s piece fundamentally indefensible and offensive. I wish he hadn’t written it.”<br> – Jonah Goldberg</br></p><p>“Needless to say, <a href=\"http://www.nationalreview.com/corner/295506/derbs-screed-rich-lowry\">no one at National Review</a> shares Derb’s appalling view of what parents supposedly should tell their kids about blacks in this instantly notorious piece here.”<br> – Rich Lowry</br></p><p>“<a href=\"http://www.forbes.com/sites/joshbarro/2012/04/06/why-national-review-must-fire-john-derbyshire/\">Why National Review must fire John Derbyshire</a>“<br> – Josh Barro</br></p><p>Apparently these various National Review writers want Americans to remain trapped in the same clueless, post-racial, Orwellian delusion they have inhabited for the last fifty years.  And yet, <a href=\"http://takimag.com/article/the_talk_nonblack_version_john_derbyshire#axzz1rJPlABLB\">John Derbyshire’s article</a> that has inspired such rabid ritual denunciation is little more than a calm and perfectly reasonable collection of observable realities of race in America:</p><blockquote><p>(6) As you go through life, however, you will experience an ever larger number of encounters with black Americans. Assuming your encounters are random—for example, not restricted only to black convicted murderers or to black investment bankers—the Law of Large Numbers will inevitably kick in. You will observe that the means—the averages—of many traits are very different for black and white Americans, as has been confirmed by methodical inquiries in the human sciences.</p><p>(11) The mean intelligence of blacks is much lower than for whites. The least intelligent ten percent of whites have IQs below 81; forty percent of blacks have IQs that low. Only one black in six is more intelligent than the average white; five whites out of six are more intelligent than the average black. These differences show in every test of general cognitive ability that anyone, of any race or nationality, has yet been able to devise. They are reflected in countless everyday situations.</p></blockquote><p>This isn’t the first time I’ve been pleased that I write for WND and not NRO.  Now, in the past, I have been urged by some to abandon what they errantly consider to be my “support for segregation”.  What they fail to understand is that I don’t support segregation per se.  I don’t actually have a position on it, any more than I have a position on gravity or oxygen.  There is nothing to support, there is only an observation to be made: Humanity is intrinsically and naturally self-segregating.  It is <i>desegregation</i> that is unnatural, that requires the imposition of force to maintain for even brief periods, and which is both inherently unstable and antithetical to the collective will of every people on the planet.</p><p>My own perspective should be perfectly clear, but I shall elucidate it anyhow.  Due to past desegregation imposed by force of one kind or another, be it private action or government policy, rapid large scale segregation is going to take place because the vast majority of people on every possible side find it to be desirable.  That future segregation is going to be either voluntary or involuntary, and will be either violent or non-violent.  Therefore, government policies should, to the greatest extent possible, be strongly biased towards voluntary, non-violent, and gradual segregation in order to reduce the risk of rapidly destabilizing multi-ethnic and multi-racial societies.</p><p>Multiculturalism is dead.  Desegregation is dead.  MLK’s dream is dead, and more importantly, it was never more than wishful thinking anyhow.  Racial equality is the same failed myth as every other aspect of human equality, none of which have ever been shown to exist in any tangible form.  And all that dropping weak-kneed to one’s fainting couch or clinging to the oft-disproven canards of the racial equalitarians will achieve is to increase the level of violence and amount of involuntary cooperation that will eventually be required to recreate the historic balances that were originally brought about by the natural processes of group behavior.  The American black/white situation is only one, and one of the smaller and less problematic, of the resegregations that should probably be anticipated in the medium term.</p><p>Ponnuru, Goldberg, Lowry, and Barro have humiliated themselves with their craven responses.  John Derbyshire is not merely right, but it is not even remotely reasonable to pretend that he is incorrect in any significant detail.  The truth is what it is, and it will usually come out in the end no matter how desperately the children try to cling to their fairy tales.  Pointing and shrieking “RACISS” is the modern equivalent of crying “WITCH” at the height of the Salem witch trials… and is not going to change the probable course of future events in the least.</p></div>",
  "content_text": "The NRO crew provides some striking profiles in intellectual courage:\n“Does @NRO want to be associated with someone who publishes racist trash like this?  I know I don’t”\n– Ramesh Ponnuru\n“For the record, I find my colleague John Derbyshire’s piece fundamentally indefensible and offensive. I wish he hadn’t written it.”\n– Jonah Goldberg\n“Needless to say,\nno one at National Review\nshares Derb’s appalling view of what parents supposedly should tell their kids about blacks in this instantly notorious piece here.”\n– Rich Lowry\n“\nWhy National Review must fire John Derbyshire\n“\n– Josh Barro\nApparently these various National Review writers want Americans to remain trapped in the same clueless, post-racial, Orwellian delusion they have inhabited for the last fifty years.  And yet,\nJohn Derbyshire’s article\nthat has inspired such rabid ritual denunciation is little more than a calm and perfectly reasonable collection of observable realities of race in America:\n(6) As you go through life, however, you will experience an ever larger number of encounters with black Americans. Assuming your encounters are random—for example, not restricted only to black convicted murderers or to black investment bankers—the Law of Large Numbers will inevitably kick in. You will observe that the means—the averages—of many traits are very different for black and white Americans, as has been confirmed by methodical inquiries in the human sciences.\n(11) The mean intelligence of blacks is much lower than for whites. The least intelligent ten percent of whites have IQs below 81; forty percent of blacks have IQs that low. Only one black in six is more intelligent than the average white; five whites out of six are more intelligent than the average black. These differences show in every test of general cognitive ability that anyone, of any race or nationality, has yet been able to devise. They are reflected in countless everyday situations.\nThis isn’t the first time I’ve been pleased that I write for WND and not NRO.  Now, in the past, I have been urged by some to abandon what they errantly consider to be my “support for segregation”.  What they fail to understand is that I don’t support segregation per se.  I don’t actually have a position on it, any more than I have a position on gravity or oxygen.  There is nothing to support, there is only an observation to be made: Humanity is intrinsically and naturally self-segregating.  It is\ndesegregation\nthat is unnatural, that requires the imposition of force to maintain for even brief periods, and which is both inherently unstable and antithetical to the collective will of every people on the planet.\nMy own perspective should be perfectly clear, but I shall elucidate it anyhow.  Due to past desegregation imposed by force of one kind or another, be it private action or government policy, rapid large scale segregation is going to take place because the vast majority of people on every possible side find it to be desirable.  That future segregation is going to be either voluntary or involuntary, and will be either violent or non-violent.  Therefore, government policies should, to the greatest extent possible, be strongly biased towards voluntary, non-violent, and gradual segregation in order to reduce the risk of rapidly destabilizing multi-ethnic and multi-racial societies.\nMulticulturalism is dead.  Desegregation is dead.  MLK’s dream is dead, and more importantly, it was never more than wishful thinking anyhow.  Racial equality is the same failed myth as every other aspect of human equality, none of which have ever been shown to exist in any tangible form.  And all that dropping weak-kneed to one’s fainting couch or clinging to the oft-disproven canards of the racial equalitarians will achieve is to increase the level of violence and amount of involuntary cooperation that will eventually be required to recreate the historic balances that were originally brought about by the natural processes of group behavior.  The American black/white situation is only one, and one of the smaller and less problematic, of the resegregations that should probably be anticipated in the medium term.\nPonnuru, Goldberg, Lowry, and Barro have humiliated themselves with their craven responses.  John Derbyshire is not merely right, but it is not even remotely reasonable to pretend that he is incorrect in any significant detail.  The truth is what it is, and it will usually come out in the end no matter how desperately the children try to cling to their fairy tales.  Pointing and shrieking “RACISS” is the modern equivalent of crying “WITCH” at the height of the Salem witch trials… and is not going to change the probable course of future events in the least.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-07T12:20:00+00:00"
}