{
  "url": "https://voxday.net/2012/04/09/purge-too-far/",
  "scraped_at": "2025-12-14T04:51:45.626575",
  "title": "A purge too far",
  "date_display": "April 9, 2012",
  "date_iso": "2012-04-09T13:00:00+00:00",
  "date_from_url": "2012-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a little-known fact, but I was once selected as the heir apparent to William F. Buckley by his syndicate, Universal Press Syndicate.  As he was getting quite old and obviously approaching the end of his run, they’d looked over all the columnists of my generation and decided that I was the one whose intelligence and writing style was most similar to that of Buckley.</p><p>The syndication went nowhere; the Dallas Morning News was the only paper to pick up my UPS column – which was the same as my WND column – and we learned that the newspaper editors a) believed that my sentence structure was too complex and my vocabulary was too expansive for the eighth-grade reading level they were targeting, and b) didn’t want another right-wing columnist when they already had Ann Coulter.  The outcome might have been very different if UPS sold its columns in package deals the way some of the other syndicates do, but they reasonably believed every column should stand on its own.  So, after 18 months, Universal gave up and my second spell as a nationally syndicated columnist came to an end.  But it always gave me a small sense of accomplishment, because I’d long been a reader of William F. Buckley’s magazine.</p><p>I used to read <i>National Review</i> in the library at college.  I liked <i>Commentary </i>as well, but <i>National Review</i> always had a compelling sense of ideological style to it that made it seem both relevant to the times as well as moderately intellectual.  I fell out of the habit of reading it after college, but then discovered NRO and The Corner not long after it was introduced online and began reading that on a daily basis.  I thought about looking into becoming an NR contributor from time to time, but there was never really any reason to do so since WND’s traffic was already blowing away NRO’s and it would have been a step down in terms of readership even if it was a step up in terms of prestige.</p><p>I let my subscription to NR Digital go more out of a general sense that things were ideologically falling apart there than in response to any specific event.  I disliked the growing My Party Left or Right theme there, was mystified by the total lack of competence concerning economics, and found the purge of Joe Sobran to be reprehensible.  But I still read The Corner every day even though I seldom bothered with the articles on the main page.  Readers here will recall that “NRO’S CORNER” was one of the featured Day Trip links for most of the last seven years.  But then I read this post by Rich Lowry yesterday:</p><blockquote><p>Anyone who has read Derb in our pages knows he’s a deeply literate, funny, and incisive writer. I direct anyone who doubts his talents to his delightful first novel, “Seeing Calvin Coolidge in a Dream,” or any one of his “Straggler” columns in the books section of NR. Derb is also maddening, outrageous, cranky, and provocative. His latest provocation, in a webzine, lurches from the politically incorrect to the nasty and indefensible. We never would have published it, but the main reason that people noticed it is that it is by a National Review writer. Derb is effectively using our name to get more oxygen for views with which we’d never associate ourselves otherwise. So there has to be a parting of the ways. Derb has long danced around the line on these issues, but this column is so outlandish it constitutes a kind of letter of resignation. It’s a free country, and Derb can write whatever he wants, wherever he wants. Just not in the pages of NR or NRO, or as someone associated with NR any longer.</p></blockquote><p>Now, I know Derb, I’ve read his articles, I’ve read his books, I’ve interviewed him, and I’ve exchanged email with him.  He is a good, decent, and intelligent man.  And since <i>National Review</i> does not wish to associate with him any longer, I do not wish to support it in any way, shape, or form.  So, I have removed the link from this blog and will not be reading either <i>National Review</i> or The Corner anymore.  I would encourage those who number themselves in the Dread Ilk to similarly remove their bookmarks and ignore what has become an entirely superflous organ of the squishy Republican center.</p><p>I’m not doing this solely out of loyalty to Derb.  If <i>National Review</i> was still publishing anything of genuine significance or interest, I would have to continue reading it simply for the information.  But <i>National Review</i> no longer publishes anything that is remotely controversial, new, or interesting; Derb was last of that breed still remaining there.  After all, one hardly requires National Review to be exposed to the following dogma:</p><p>1.  Israel must be supported at all costs because it is the only democracy in the Middle East.  Followed by an article about the Egyptian/Palestinian/Iraqi/Iranian/Syrian elections….<br> 2.  Any amount of immigration from anywhere is good for America as long as it is legal.<br> 3.  We love [insert race or other interest group here] more than liberals do.<br> 4.  Hispanics will turn conservative Real Soon Now.<br> 5.  [Insert most liberal candidate running] is actually the real conservative and should be the Republican candidate.<br> 6.  Winning elections is more important than purity of principle.  Or any principle, for that matter.<br> 7.  [Republican] may be bad, but [Democrat] is worse.<br> 8.  I am a huge [Yankees/Red Sox] fan even though I don’t follow baseball and am from [city nowhere near NYC or Boston].<br> 9.  Support for the troops by finding further occupation for them in as-yet uninvaded Middle Eastern countries.  Faster please!</br></br></br></br></br></br></br></br></p><p>Actually, after thinking about what I’ve read at NRO over the last few years, I find myself wondering why I was still bothering to read it at all.  The inertia of habit, I suppose.  Anyhow, I emailed both Derb and Jonah Goldberg yesterday. Derb appreciated the support although he noted that the retroactive admission that Enoch Powell had been right all along didn’t do Mr. Powell much good.  Jonah and I had a civil exchange in which we simply had to agree to disagree, for while he considered the article to have been offensive and indefensible, I think it is very easily defended indeed.  But, as I told Derb, the eventual conclusion is obvious:  “As was the case with Enoch Powell, it will one day be common knowledge that John Derbyshire was right.”</p><p>I think it is very telling already that at most of the sites where Derbyshire has found support, the comments are running heavily in his favor, whereas at most of the places that condemn him, public comments are not even being permitted.  My conclusion is that the race card had a lot more power and the equalitarian dogma was much more convincing when most white knowledge of the behavior of the African underclass was theoretical; desegregation, immigration, and smartphone videos means that the equalitarian propaganda is being rapidly trumped by actual experience and observation.</p><p>And finally, Derb’s focus on race realism is based solidly on the same reasoning that is shared by numerous observers of societal decline across the political spectrum.  The rationale for his actions is probably best explained here, in a section <a href=\"http://johnderbyshire.com/Opinions/HumanSciences/racistelites.html\">taken from his 2012 speech at CPAC</a>.</p><blockquote><p>This is from Chapter 21 of The Bell Curve[1], in which Herrnstein and Murray are discussing possible consequences of cognitive stratification. Perhaps the most startling of the possibilities they suggest is that, quote, “Racism will emerge in a new and more virulent form.” Here is the passage that follows.</p><p><i>The tension between what the white elite is supposed to think and what it is actually thinking about race will reach something close to breaking point. This pessimistic prognosis must be contemplated: When the break comes, the result, as so often happens when cognitive dissonance is resolved, will be an overreaction in the other direction. Instead of the candor and realism about race that is so urgently needed, the nation will be faced with racial divisiveness and hostility that is as great as, or greater, than America experienced before the civil rights movement. We realize how outlandish it seems to predict that educated and influential Americans, who have been so puritanical about racial conversation, will openly revert to racism. We would not go so far as to say it is probable. It is, however, more than just possible. If it were to happen, all the scenarios for the custodial state would be more unpleasant — more vicious — than anyone can now imagine.</i></p><p>I should explain that by the phrase “the custodial state,” Herrnstein and Murray mean a sort of Indian-reservation policy in which the elites “fence off” the low-IQ underclass.</p><p>That our elites might turn racist does indeed sound outlandish. The reigning doctrine on race throughout the Western world today is the Standard Social Science Model, which I’ll just trim down to “Standard Model” in what follows. According to this doctrine, all observed group differences are the result of social forces. The Standard Model says that there is a conceivable, discoverable, attainable configuration of social forces in which all group differences would vanish; and that we ought to strive to shift our own society towards that configuration. Among our political and cultural elites, the Standard Model is universally accepted.</p><p>Looking to the future, there are three possibilities. One of them, Possibility One, is that our elites will continue to adhere to the Standard Model. The other two are implied in the extract I just quoted from Herrnstein and Murray: Possibility Two: We may attain “the candor and realism about race that is so urgently needed.” Possibility Three: Our elites will revert to “open racism.”</p></blockquote><p>I expect Possibility Three.  So does Derb.  And the hostile reactions of people towards Derb’s futile attempts to push Possibility Two only underlines the assurance of that expectation.  The European elites are already beginning to change direction; once that takes place, the American elites will be quick to follow.</p></div>",
  "content_text": "It’s a little-known fact, but I was once selected as the heir apparent to William F. Buckley by his syndicate, Universal Press Syndicate.  As he was getting quite old and obviously approaching the end of his run, they’d looked over all the columnists of my generation and decided that I was the one whose intelligence and writing style was most similar to that of Buckley.\nThe syndication went nowhere; the Dallas Morning News was the only paper to pick up my UPS column – which was the same as my WND column – and we learned that the newspaper editors a) believed that my sentence structure was too complex and my vocabulary was too expansive for the eighth-grade reading level they were targeting, and b) didn’t want another right-wing columnist when they already had Ann Coulter.  The outcome might have been very different if UPS sold its columns in package deals the way some of the other syndicates do, but they reasonably believed every column should stand on its own.  So, after 18 months, Universal gave up and my second spell as a nationally syndicated columnist came to an end.  But it always gave me a small sense of accomplishment, because I’d long been a reader of William F. Buckley’s magazine.\nI used to read\nNational Review\nin the library at college.  I liked\nCommentary\nas well, but\nNational Review\nalways had a compelling sense of ideological style to it that made it seem both relevant to the times as well as moderately intellectual.  I fell out of the habit of reading it after college, but then discovered NRO and The Corner not long after it was introduced online and began reading that on a daily basis.  I thought about looking into becoming an NR contributor from time to time, but there was never really any reason to do so since WND’s traffic was already blowing away NRO’s and it would have been a step down in terms of readership even if it was a step up in terms of prestige.\nI let my subscription to NR Digital go more out of a general sense that things were ideologically falling apart there than in response to any specific event.  I disliked the growing My Party Left or Right theme there, was mystified by the total lack of competence concerning economics, and found the purge of Joe Sobran to be reprehensible.  But I still read The Corner every day even though I seldom bothered with the articles on the main page.  Readers here will recall that “NRO’S CORNER” was one of the featured Day Trip links for most of the last seven years.  But then I read this post by Rich Lowry yesterday:\nAnyone who has read Derb in our pages knows he’s a deeply literate, funny, and incisive writer. I direct anyone who doubts his talents to his delightful first novel, “Seeing Calvin Coolidge in a Dream,” or any one of his “Straggler” columns in the books section of NR. Derb is also maddening, outrageous, cranky, and provocative. His latest provocation, in a webzine, lurches from the politically incorrect to the nasty and indefensible. We never would have published it, but the main reason that people noticed it is that it is by a National Review writer. Derb is effectively using our name to get more oxygen for views with which we’d never associate ourselves otherwise. So there has to be a parting of the ways. Derb has long danced around the line on these issues, but this column is so outlandish it constitutes a kind of letter of resignation. It’s a free country, and Derb can write whatever he wants, wherever he wants. Just not in the pages of NR or NRO, or as someone associated with NR any longer.\nNow, I know Derb, I’ve read his articles, I’ve read his books, I’ve interviewed him, and I’ve exchanged email with him.  He is a good, decent, and intelligent man.  And since\nNational Review\ndoes not wish to associate with him any longer, I do not wish to support it in any way, shape, or form.  So, I have removed the link from this blog and will not be reading either\nNational Review\nor The Corner anymore.  I would encourage those who number themselves in the Dread Ilk to similarly remove their bookmarks and ignore what has become an entirely superflous organ of the squishy Republican center.\nI’m not doing this solely out of loyalty to Derb.  If\nNational Review\nwas still publishing anything of genuine significance or interest, I would have to continue reading it simply for the information.  But\nNational Review\nno longer publishes anything that is remotely controversial, new, or interesting; Derb was last of that breed still remaining there.  After all, one hardly requires National Review to be exposed to the following dogma:\n1.  Israel must be supported at all costs because it is the only democracy in the Middle East.  Followed by an article about the Egyptian/Palestinian/Iraqi/Iranian/Syrian elections….\n2.  Any amount of immigration from anywhere is good for America as long as it is legal.\n3.  We love [insert race or other interest group here] more than liberals do.\n4.  Hispanics will turn conservative Real Soon Now.\n5.  [Insert most liberal candidate running] is actually the real conservative and should be the Republican candidate.\n6.  Winning elections is more important than purity of principle.  Or any principle, for that matter.\n7.  [Republican] may be bad, but [Democrat] is worse.\n8.  I am a huge [Yankees/Red Sox] fan even though I don’t follow baseball and am from [city nowhere near NYC or Boston].\n9.  Support for the troops by finding further occupation for them in as-yet uninvaded Middle Eastern countries.  Faster please!\nActually, after thinking about what I’ve read at NRO over the last few years, I find myself wondering why I was still bothering to read it at all.  The inertia of habit, I suppose.  Anyhow, I emailed both Derb and Jonah Goldberg yesterday. Derb appreciated the support although he noted that the retroactive admission that Enoch Powell had been right all along didn’t do Mr. Powell much good.  Jonah and I had a civil exchange in which we simply had to agree to disagree, for while he considered the article to have been offensive and indefensible, I think it is very easily defended indeed.  But, as I told Derb, the eventual conclusion is obvious:  “As was the case with Enoch Powell, it will one day be common knowledge that John Derbyshire was right.”\nI think it is very telling already that at most of the sites where Derbyshire has found support, the comments are running heavily in his favor, whereas at most of the places that condemn him, public comments are not even being permitted.  My conclusion is that the race card had a lot more power and the equalitarian dogma was much more convincing when most white knowledge of the behavior of the African underclass was theoretical; desegregation, immigration, and smartphone videos means that the equalitarian propaganda is being rapidly trumped by actual experience and observation.\nAnd finally, Derb’s focus on race realism is based solidly on the same reasoning that is shared by numerous observers of societal decline across the political spectrum.  The rationale for his actions is probably best explained here, in a section\ntaken from his 2012 speech at CPAC\n.\nThis is from Chapter 21 of The Bell Curve[1], in which Herrnstein and Murray are discussing possible consequences of cognitive stratification. Perhaps the most startling of the possibilities they suggest is that, quote, “Racism will emerge in a new and more virulent form.” Here is the passage that follows.\nThe tension between what the white elite is supposed to think and what it is actually thinking about race will reach something close to breaking point. This pessimistic prognosis must be contemplated: When the break comes, the result, as so often happens when cognitive dissonance is resolved, will be an overreaction in the other direction. Instead of the candor and realism about race that is so urgently needed, the nation will be faced with racial divisiveness and hostility that is as great as, or greater, than America experienced before the civil rights movement. We realize how outlandish it seems to predict that educated and influential Americans, who have been so puritanical about racial conversation, will openly revert to racism. We would not go so far as to say it is probable. It is, however, more than just possible. If it were to happen, all the scenarios for the custodial state would be more unpleasant — more vicious — than anyone can now imagine.\nI should explain that by the phrase “the custodial state,” Herrnstein and Murray mean a sort of Indian-reservation policy in which the elites “fence off” the low-IQ underclass.\nThat our elites might turn racist does indeed sound outlandish. The reigning doctrine on race throughout the Western world today is the Standard Social Science Model, which I’ll just trim down to “Standard Model” in what follows. According to this doctrine, all observed group differences are the result of social forces. The Standard Model says that there is a conceivable, discoverable, attainable configuration of social forces in which all group differences would vanish; and that we ought to strive to shift our own society towards that configuration. Among our political and cultural elites, the Standard Model is universally accepted.\nLooking to the future, there are three possibilities. One of them, Possibility One, is that our elites will continue to adhere to the Standard Model. The other two are implied in the extract I just quoted from Herrnstein and Murray: Possibility Two: We may attain “the candor and realism about race that is so urgently needed.” Possibility Three: Our elites will revert to “open racism.”\nI expect Possibility Three.  So does Derb.  And the hostile reactions of people towards Derb’s futile attempts to push Possibility Two only underlines the assurance of that expectation.  The European elites are already beginning to change direction; once that takes place, the American elites will be quick to follow.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-09T12:00:00+00:00"
}