{
  "url": "https://voxday.net/2012/04/27/sitting-in-glass-house-hurling-stones/",
  "scraped_at": "2025-12-14T04:53:06.313991",
  "title": "Sitting in a glass house, hurling stones",
  "date_display": "April 27, 2012",
  "date_iso": "2012-04-27T18:50:00+00:00",
  "date_from_url": "2012-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think a society in which a statistically significant percentage of the female porn revolves around necrophilia has a lot of leeway to criticize <a href=\"http://www.dailymail.co.uk/news/article-2135434/Egypts-plans-farewell-intercourse-law-husbands-sex-DEAD-wives-branded-complete-nonsense.html\">the purported “farewell law”</a>:</p><blockquote><p> Alleged proposals to allow Egyptian husbands to legally have sex with their dead wives for up to six hours after their death have been branded a ‘complete nonsense’. The controversial new ‘farewell intercourse’ law was claimed, in Arab media, to be part of a raft of measures being introduced by the Islamist-dominated parliament.  They reported it would also see the minimum age of marriage lowered to 14 and the ridding of women’s rights of getting education and employment.</p></blockquote><p>I was always a bit skeptical about the reality of this supposed law anyhow.  Six hours?  Any mortician can tell you that <a href=\"http://sexylosers.com/065.html\">dead bodies are perfectly useful</a> for at least 48 postmortem.  The link is perfectly SFW, but I wouldn’t recommend clicking on any of the other comics.  As a wise woman once said, 95 percent of all the world’s weirdness comes from Japan.  True science fact.</p></div>",
  "content_text": "I don’t think a society in which a statistically significant percentage of the female porn revolves around necrophilia has a lot of leeway to criticize\nthe purported “farewell law”\n:\nAlleged proposals to allow Egyptian husbands to legally have sex with their dead wives for up to six hours after their death have been branded a ‘complete nonsense’. The controversial new ‘farewell intercourse’ law was claimed, in Arab media, to be part of a raft of measures being introduced by the Islamist-dominated parliament.  They reported it would also see the minimum age of marriage lowered to 14 and the ridding of women’s rights of getting education and employment.\nI was always a bit skeptical about the reality of this supposed law anyhow.  Six hours?  Any mortician can tell you that\ndead bodies are perfectly useful\nfor at least 48 postmortem.  The link is perfectly SFW, but I wouldn’t recommend clicking on any of the other comics.  As a wise woman once said, 95 percent of all the world’s weirdness comes from Japan.  True science fact.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2012-04-27T17:50:00+00:00"
}