{
  "url": "https://voxday.net/2012/04/16/still-smarting/",
  "scraped_at": "2025-12-14T04:52:16.754894",
  "title": "Still smarting",
  "date_display": "April 16, 2012",
  "date_iso": "2012-04-16T18:26:00+00:00",
  "date_from_url": "2012-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wängsty’s posterior is apparently still stinging from the spanking I gave him <a href=\"http://rsbakker.wordpress.com/2012/04/12/over-easy-versus-hard-embroiled/\">more than eight months ago</a>:</p><blockquote><p>The fact is, someone has to call these people out, same with Vox, challenge them. As powerful as moral indignation is, it has a short shelf life, if you doggedly engage, engage, engage…  People need to be ‘radical’ about reason and moderation…</p></blockquote><p>To which I responded: <i>Come now, Wängsty, you did nothing of the sort. After admitting you couldn’t make heads or tails of a fairly simple analogy and whining about my “refusal” to answer rhetorical questions that I directly addressed, you ran away rather than even attempt to defend your own perspective. I answered your questions, but I don’t recall you ever getting around to answering mine. I’ve been challenged by Keynesians, atheists, biologists, feminists, Calvinists, and Trinitarians and engaged in substantive debates with all of them. You’re a talented writer, to be sure, but as a thinker and an intellectual disputant, you’re not even a contestant at this point.</i></p><p>If you want to debate anything from the aesthetics of fantasy fiction to your philosophic uncertainty principle, I’m always game. But your philosophic posturing is seriously weak dishwater; there is no intrinsic virtue in uncertainty.</p><p>In case one has forgotten, here is a link to my last post concerning <a href=\"http://www.milobookclub.com/2011/08/19/dude-let-it-go-already/\">The Prince of Wängst</a>.  The idea that he still thinks I am given to moral outrage simply underlines how stubbornly clueless he remains.</p></div>",
  "content_text": "Wängsty’s posterior is apparently still stinging from the spanking I gave him\nmore than eight months ago\n:\nThe fact is, someone has to call these people out, same with Vox, challenge them. As powerful as moral indignation is, it has a short shelf life, if you doggedly engage, engage, engage…  People need to be ‘radical’ about reason and moderation…\nTo which I responded:\nCome now, Wängsty, you did nothing of the sort. After admitting you couldn’t make heads or tails of a fairly simple analogy and whining about my “refusal” to answer rhetorical questions that I directly addressed, you ran away rather than even attempt to defend your own perspective. I answered your questions, but I don’t recall you ever getting around to answering mine. I’ve been challenged by Keynesians, atheists, biologists, feminists, Calvinists, and Trinitarians and engaged in substantive debates with all of them. You’re a talented writer, to be sure, but as a thinker and an intellectual disputant, you’re not even a contestant at this point.\nIf you want to debate anything from the aesthetics of fantasy fiction to your philosophic uncertainty principle, I’m always game. But your philosophic posturing is seriously weak dishwater; there is no intrinsic virtue in uncertainty.\nIn case one has forgotten, here is a link to my last post concerning\nThe Prince of Wängst\n.  The idea that he still thinks I am given to moral outrage simply underlines how stubbornly clueless he remains.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-16T17:26:00+00:00"
}