{
  "url": "https://voxday.net/2012/04/17/that-touching-faith-in-science/",
  "scraped_at": "2025-12-14T04:52:20.399851",
  "title": "That touching faith in science",
  "date_display": "April 17, 2012",
  "date_iso": "2012-04-17T14:18:00+00:00",
  "date_from_url": "2012-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought it was interesting to see that one of Wängsty’s commenters, Cornucopia, still erroneously clings to a blind faith in the “self-correcting” nature of science:</p><blockquote><p>In the operational sense, does it really matter whether science is intrinsically or extrinsically self-correcting?  The study you alluded to previously was done by confirming the results of scientists by scientific means. It’s not as if somebody sat down with a Ouija board and confirmed or refuted scientific findings or had them fed to them by revelation. If you happen to be basing your claim that science is not intrinsically self-correcting on something as superficial as who happens to be funding the effort to confirm it, I think you’ll just engaged in a cheap slander against the process of science.</p></blockquote><p>He missed the point. Science isn’t self-correcting by any sense that doesn’t apply equally well to any number of other non-scientific fields. Peer review is nothing more than editing. Experimental replication, in the very rare instances it is actually performed and is successful, is nothing more than auditing. There is no substantial difference between one scientist re-running another scientist’s experiment and one accountant re-calculating another accountant’s books. In other words, science isn’t self-correcting in any meaningful sense even in its ideal form.</p><p>And, of course, as was demonstrated in the paper I cited, most “science” is not performed according to the ideal form, and even when it is, it often turns out to be unreliable.  Even the best, “gold standard” science has been reported to be 89 percent unreliable, as a matter of fact.  It must also be pointed out that if scientific error is identified by non-scientists who aren’t engaged in science, then the correction cannot be considered extrinsic self-correction because it is not <i>self</i>-correcting in any sense.</p><p>One might as reasonably claim that crime is self-correcting because the police sometimes arrest criminals.</p><p>And while I find it strange to have to point this out, my argument about the unreliability of science is absolutely not based upon an appeal to a genetic fallacy of who happens to be funding the science, although it is worth noting that the intrinsic unreliability of modern science does create the opportunity for a significant amount of undetected corruption.</p></div>",
  "content_text": "I thought it was interesting to see that one of Wängsty’s commenters, Cornucopia, still erroneously clings to a blind faith in the “self-correcting” nature of science:\nIn the operational sense, does it really matter whether science is intrinsically or extrinsically self-correcting?  The study you alluded to previously was done by confirming the results of scientists by scientific means. It’s not as if somebody sat down with a Ouija board and confirmed or refuted scientific findings or had them fed to them by revelation. If you happen to be basing your claim that science is not intrinsically self-correcting on something as superficial as who happens to be funding the effort to confirm it, I think you’ll just engaged in a cheap slander against the process of science.\nHe missed the point. Science isn’t self-correcting by any sense that doesn’t apply equally well to any number of other non-scientific fields. Peer review is nothing more than editing. Experimental replication, in the very rare instances it is actually performed and is successful, is nothing more than auditing. There is no substantial difference between one scientist re-running another scientist’s experiment and one accountant re-calculating another accountant’s books. In other words, science isn’t self-correcting in any meaningful sense even in its ideal form.\nAnd, of course, as was demonstrated in the paper I cited, most “science” is not performed according to the ideal form, and even when it is, it often turns out to be unreliable.  Even the best, “gold standard” science has been reported to be 89 percent unreliable, as a matter of fact.  It must also be pointed out that if scientific error is identified by non-scientists who aren’t engaged in science, then the correction cannot be considered extrinsic self-correction because it is not\nself\n-correcting in any sense.\nOne might as reasonably claim that crime is self-correcting because the police sometimes arrest criminals.\nAnd while I find it strange to have to point this out, my argument about the unreliability of science is absolutely not based upon an appeal to a genetic fallacy of who happens to be funding the science, although it is worth noting that the intrinsic unreliability of modern science does create the opportunity for a significant amount of undetected corruption.",
  "tags": [
    "mailvox",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-17T13:18:00+00:00"
}