{
  "url": "https://voxday.net/2012/04/21/wangsty-discredits-himself/",
  "scraped_at": "2025-12-14T04:52:36.966240",
  "title": "Wängsty discredits himself",
  "date_display": "April 21, 2012",
  "date_iso": "2012-04-21T14:40:00+00:00",
  "date_from_url": "2012-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which R. Scott Bakker conclusively demonstrates that he isn’t merely hypocritical, ignorant, morally blind, and philosophically inept, he also happens to be <a href=\"http://rsbakker.wordpress.com/2012/04/12/over-easy-versus-hard-embroiled/#comment-7801\">a confirmed liar</a>:<br/></p><blockquote><p> By way of disclosure, I have to say that I’m most interested in the way you’ve changed your answers to these questions since the last time. We actually speculated about how you might change your rhetorical tactics. You seem to have moved from a bald (and quite embarrassing, I think you realized in retrospect) assertion of exceptionalism (IQ, social regard – I think you even managed to work your wife’s fertility in there!) to one that has more cognitive qualifications (which is something I predicted – my conceptual model must have been bang on that day!).</p></blockquote><p>To which I replied: <i>“As I recall, the previous questions were different, Scott. Why on Earth would you expect me to provide the same answers to different questions? I’ll suppose I’ll have to look up your previous questions and compare them. And before I do, let me point out that this will have some seriously negative implications for your credibility and intellectual honesty if those two sets of questions are not identical.”</i></p><p>I’ve been engaging with Bakker long enough now to know that he is a slippery intellectual snake, and while I’m not perfectly consistent over time, I don’t customarily change my answers to the same question without either admitting or realizing I have done so.  So, his claim that I had changed my rhetorical tactics immediately triggered my BS radar.  I went back and looked at every single question both he and his readers asked me, and thanks to his description, I had no trouble identifying the one to which he was referring, which I answered in the post entitled <a href=\"http://www.milobookclub.com/2011/08/19/dude-let-it-go-already/\">The Wangst that Comes After</a>.</p><p><i><b>Wängsty: “What makes him think he’s won the Magical Belief and Identity Lottery?”</b></i></p><p><i>Oh, I don’t know. Out of nearly 7 billion people, I’m fortunate to be in the top 1% in the planet with regards to health, wealth, looks, brains, athleticism, and nationality. My wife is slender, beautiful, lovable, loyal, fertile, and funny. I meet good people who seem to enjoy my company everywhere I go. That all seems pretty lucky to me, considering that my entire contribution to the situation was choosing my parents well. I am grateful and I thank God every day for the ticket He has dealt me. If I’m not a birth lottery winner, then who is? The kid in the Congo who just got his hands chopped off and is getting raped for the fourth time today? To paraphrase the immortal parental wisdom of PJ O’Rourke, anyone in my position had damn well better get down on their knees and pray that life does not become fair.</i></p><p>First, let me say that I’m not embarrassed by my answer to that question in the slightest.  I wouldn’t change a word of it if I were asked it again.  But I wasn’t.  And to prove that, let’s take a look at the questions that I subsequently answered.  Here is the complete list of questions Bakker asked of me in the latest go-round.  Do you see anything about the Magical Belief and Identity Lottery?</p><p><i>1.  Granting two things, that the technologies that science made possible have transformed our world in the past three centuries, and that science, as another human institution, nevertheless suffers many flaws, you’re saying your non-scientific account of science demonstrates that science is not to be trusted… what? At all? More than non-scientific accounts? No differently than non-scientific accounts?  [Bakker doesn’t understand that technology drives science more than science drives technology.  And it was not a “non-scientific account” that demonstrated peer-reviewed, published science papers from top science labs are about 11 percent reproducible. -VD]</i></p><p>2.  Lastly, I will ask you – this one time – to refrain from verbally abusing any one on this site but myself. Are we clear on that?  [Sure, we’re clear that you asked. – VD]</p><p>3.  Are you ever puzzled by the way it always seems to be the other guy that’s wrong? For us outsiders, we can only assume, absent any relevant information, that you are at best ‘in the right’ a fraction of the time (just like everyone else), but that you are duped into thinking you are pretty much right all the time (just like everyone else). What makes you special? My personal instinct – one that I think many others share – is to be skeptical of an individual the degree to which they impress themselves. Why should I make any exception in your case?</p><p>So Bakker is trying to claim that a question about the uniqueness of my identity and beliefs is exactly the same as a question about the unusual success of my public track record and thereby score some cheap rhetorical points by claiming that two very different answers to two different questions  were actually two different answers to the same question.  He then goes on to make the risible claim that this somehow supports his conceptual model and that he had predicted my behavior.  But his claims aren’t simply false, they are shamelessly dishonest.  While I knew from the start that Bakker was somewhat of a charlatan and prone to intellectually carelessness as well, until now, I only suspected that he would be willing to knowingly lie in support of his utopian ideology.  And the sheer stupidity of lying about such an easily checked statement tends to support one of my other suspicions, which is that Wängsty is more educated than intelligent.</p><p>Nor can Bakker claim that “what makes you special” is synonymous with his Lottery question, because it was asked in the context of why I believe I am right more than others are, as one can easily see in my answers to him.</p><p><i><b>Wängsty: Are you ever puzzled by the way it always seems to be the other guy that’s wrong?</b></i></p><p>That’s hilarious. When I make my annual economic predictions at the start of the year, I always score my predictions from the previous year. Sometimes they’re very good, such as the time I was only off on the change in the median existing home price by $300 when the chief economist for NAR was off by more than $40,000. Sometimes they’re not, such as when I didn’t anticipate the BLS playing games with the employment-population ratio in order to keep the unemployment rate down. But it’s not enough to be stupid, you have to be completely ignorant to think that anyone who meddles in economics could possibly think he’s right all the time. I only wish I was. Unlike academia, there are significant financial penalties for being wrong in the markets. But in general, your question is rather like asking if Bill Belichick if he’s ever puzzled that the other team always seems to lose. He’s a good football coach. I’m a good recognizer of patterns.  I’ve been writing op/ed columns for 11 years. My track record is all out in the open and it speaks for itself. I don’t always get it right – I still can’t believe Hillary Clinton didn’t win the nomination – but in that same election, I was the only commentator in a field of 100 to correctly predict that Sarah Palin would be McCain’s vice-presidential choice. And this time around, I correctly anticipated Romney would be the Republican nominee; time will tell if my outlandish prediction that Obama will not be the Democratic candidate in November is correct as well. And note that I made that prediction about 18 months ago; my track record is not a result of playing it safe and obvious.</p><p><i><b>What makes you special? My personal instinct – one that I think many others share – is to be skeptical of an individual the degree to which they impress themselves. Why should I make any exception in your case?</b></i></p><p>Because I’m really that good. Look, a lot of people ignored me back in 2002 when I urged them to stay out of the housing bubble and buy gold instead. After housing crashed and gold went from $275 to $1750, a lot of those people subsequently decided that they at least ought to pay attention. Strangely enough, no one is laughing at my prediction of massive worldwide economic contraction anymore.  What makes me special? I am not sure. There are certainly others smarter than I am, and more successful than I am. But what I’m very good at is forcing myself to only look at what is there, rather than what I want to be there. In retrospect, most of my errors have been caused by failing to sufficiently adhere to that principle, and that’s how I often pinpoint my interlocutors’ weaknesses: look at what they desperately want to believe is true and you’ll probably find a logical or factual error there. But what many of my readers find amusing about your accusations of certainty is that I have quite openly changed my mind about a number of significant ideological issues. Can you honestly say the same?</p><p>It may be illuminating to keep this in mind as I proceed to pin down the snake and vivisect his Moral Uncertainty Principle, armed with little more than a superintelligence and a peculiar definition of “certainty”.  Those who find this whole thing amusing will no doubt be interested to know that Mr. Moral Uncertainty appears to have a fairly serious obsession that the alien rape monsters of <i>The Prince of Nothing</i> were not enough to sate, as it appears rape is a major theme <a href=\"http://requireshate.wordpress.com/2012/04/17/r-scott-bakker-neuropath-of-misogyny/\">of his science fiction work as well</a>.</p></div>",
  "content_text": "In which R. Scott Bakker conclusively demonstrates that he isn’t merely hypocritical, ignorant, morally blind, and philosophically inept, he also happens to be\na confirmed liar\n:\nBy way of disclosure, I have to say that I’m most interested in the way you’ve changed your answers to these questions since the last time. We actually speculated about how you might change your rhetorical tactics. You seem to have moved from a bald (and quite embarrassing, I think you realized in retrospect) assertion of exceptionalism (IQ, social regard – I think you even managed to work your wife’s fertility in there!) to one that has more cognitive qualifications (which is something I predicted – my conceptual model must have been bang on that day!).\nTo which I replied:\n“As I recall, the previous questions were different, Scott. Why on Earth would you expect me to provide the same answers to different questions? I’ll suppose I’ll have to look up your previous questions and compare them. And before I do, let me point out that this will have some seriously negative implications for your credibility and intellectual honesty if those two sets of questions are not identical.”\nI’ve been engaging with Bakker long enough now to know that he is a slippery intellectual snake, and while I’m not perfectly consistent over time, I don’t customarily change my answers to the same question without either admitting or realizing I have done so.  So, his claim that I had changed my rhetorical tactics immediately triggered my BS radar.  I went back and looked at every single question both he and his readers asked me, and thanks to his description, I had no trouble identifying the one to which he was referring, which I answered in the post entitled\nThe Wangst that Comes After\n.\nWängsty: “What makes him think he’s won the Magical Belief and Identity Lottery?”\nOh, I don’t know. Out of nearly 7 billion people, I’m fortunate to be in the top 1% in the planet with regards to health, wealth, looks, brains, athleticism, and nationality. My wife is slender, beautiful, lovable, loyal, fertile, and funny. I meet good people who seem to enjoy my company everywhere I go. That all seems pretty lucky to me, considering that my entire contribution to the situation was choosing my parents well. I am grateful and I thank God every day for the ticket He has dealt me. If I’m not a birth lottery winner, then who is? The kid in the Congo who just got his hands chopped off and is getting raped for the fourth time today? To paraphrase the immortal parental wisdom of PJ O’Rourke, anyone in my position had damn well better get down on their knees and pray that life does not become fair.\nFirst, let me say that I’m not embarrassed by my answer to that question in the slightest.  I wouldn’t change a word of it if I were asked it again.  But I wasn’t.  And to prove that, let’s take a look at the questions that I subsequently answered.  Here is the complete list of questions Bakker asked of me in the latest go-round.  Do you see anything about the Magical Belief and Identity Lottery?\n1.  Granting two things, that the technologies that science made possible have transformed our world in the past three centuries, and that science, as another human institution, nevertheless suffers many flaws, you’re saying your non-scientific account of science demonstrates that science is not to be trusted… what? At all? More than non-scientific accounts? No differently than non-scientific accounts?  [Bakker doesn’t understand that technology drives science more than science drives technology.  And it was not a “non-scientific account” that demonstrated peer-reviewed, published science papers from top science labs are about 11 percent reproducible. -VD]\n2.  Lastly, I will ask you – this one time – to refrain from verbally abusing any one on this site but myself. Are we clear on that?  [Sure, we’re clear that you asked. – VD]\n3.  Are you ever puzzled by the way it always seems to be the other guy that’s wrong? For us outsiders, we can only assume, absent any relevant information, that you are at best ‘in the right’ a fraction of the time (just like everyone else), but that you are duped into thinking you are pretty much right all the time (just like everyone else). What makes you special? My personal instinct – one that I think many others share – is to be skeptical of an individual the degree to which they impress themselves. Why should I make any exception in your case?\nSo Bakker is trying to claim that a question about the uniqueness of my identity and beliefs is exactly the same as a question about the unusual success of my public track record and thereby score some cheap rhetorical points by claiming that two very different answers to two different questions  were actually two different answers to the same question.  He then goes on to make the risible claim that this somehow supports his conceptual model and that he had predicted my behavior.  But his claims aren’t simply false, they are shamelessly dishonest.  While I knew from the start that Bakker was somewhat of a charlatan and prone to intellectually carelessness as well, until now, I only suspected that he would be willing to knowingly lie in support of his utopian ideology.  And the sheer stupidity of lying about such an easily checked statement tends to support one of my other suspicions, which is that Wängsty is more educated than intelligent.\nNor can Bakker claim that “what makes you special” is synonymous with his Lottery question, because it was asked in the context of why I believe I am right more than others are, as one can easily see in my answers to him.\nWängsty: Are you ever puzzled by the way it always seems to be the other guy that’s wrong?\nThat’s hilarious. When I make my annual economic predictions at the start of the year, I always score my predictions from the previous year. Sometimes they’re very good, such as the time I was only off on the change in the median existing home price by $300 when the chief economist for NAR was off by more than $40,000. Sometimes they’re not, such as when I didn’t anticipate the BLS playing games with the employment-population ratio in order to keep the unemployment rate down. But it’s not enough to be stupid, you have to be completely ignorant to think that anyone who meddles in economics could possibly think he’s right all the time. I only wish I was. Unlike academia, there are significant financial penalties for being wrong in the markets. But in general, your question is rather like asking if Bill Belichick if he’s ever puzzled that the other team always seems to lose. He’s a good football coach. I’m a good recognizer of patterns.  I’ve been writing op/ed columns for 11 years. My track record is all out in the open and it speaks for itself. I don’t always get it right – I still can’t believe Hillary Clinton didn’t win the nomination – but in that same election, I was the only commentator in a field of 100 to correctly predict that Sarah Palin would be McCain’s vice-presidential choice. And this time around, I correctly anticipated Romney would be the Republican nominee; time will tell if my outlandish prediction that Obama will not be the Democratic candidate in November is correct as well. And note that I made that prediction about 18 months ago; my track record is not a result of playing it safe and obvious.\nWhat makes you special? My personal instinct – one that I think many others share – is to be skeptical of an individual the degree to which they impress themselves. Why should I make any exception in your case?\nBecause I’m really that good. Look, a lot of people ignored me back in 2002 when I urged them to stay out of the housing bubble and buy gold instead. After housing crashed and gold went from $275 to $1750, a lot of those people subsequently decided that they at least ought to pay attention. Strangely enough, no one is laughing at my prediction of massive worldwide economic contraction anymore.  What makes me special? I am not sure. There are certainly others smarter than I am, and more successful than I am. But what I’m very good at is forcing myself to only look at what is there, rather than what I want to be there. In retrospect, most of my errors have been caused by failing to sufficiently adhere to that principle, and that’s how I often pinpoint my interlocutors’ weaknesses: look at what they desperately want to believe is true and you’ll probably find a logical or factual error there. But what many of my readers find amusing about your accusations of certainty is that I have quite openly changed my mind about a number of significant ideological issues. Can you honestly say the same?\nIt may be illuminating to keep this in mind as I proceed to pin down the snake and vivisect his Moral Uncertainty Principle, armed with little more than a superintelligence and a peculiar definition of “certainty”.  Those who find this whole thing amusing will no doubt be interested to know that Mr. Moral Uncertainty appears to have a fairly serious obsession that the alien rape monsters of\nThe Prince of Nothing\nwere not enough to sate, as it appears rape is a major theme\nof his science fiction work as well\n.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-04-21T13:40:00+00:00"
}