{
  "url": "https://voxday.net/2012/12/01/47-years-late-and-55-trillion-shor/",
  "scraped_at": "2025-12-14T05:09:15.141146",
  "title": "47 years late and 55 trillion short",
  "date_display": "December 1, 2012",
  "date_iso": "2012-12-01T21:09:00+00:00",
  "date_from_url": "2012-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Auster points out that conservatives never manage to conserve anything, <a href=\"http://www.amnation.com/vfr/archives/023930.html\">not even the nation</a> they supposedly love so dearly:</p><blockquote class=\"tr_bq\"><p> As long as there was a chance to <i>stop</i> the immigration and the resulting dispossession of Anglo-European America, the <a href=\"http://www.amnation.com/vfr/archives/002946.html\">topic was forbidden</a>.<br> But now that it’s happened, and there’s a sense that nothing can be<br> done about it, and therefore the identification of the fact that mass<br> nonwhite immigration is leading  to the radical cultural and political<br> transformation of America does not logically require a call for <i>restricting</i><br> that immigration, it’s become safe for Mark Steyn and all the other<br> despicable conservative cowards to come out from the shadows and say<br> bold-sounding things like, “Demographics is Destiny.” In the minds of<br> Steyn and the others, they are not issuing a <i>warning</i> against that transformation, as such a warning would make them racists; they are announcing the <i>victory</i><br> of that transformation, combined with impotent little grumblings about<br> some of its negative effects. After all, what—other than impotent<br> grumbling—is conservatism about? </br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Of course, just because it’s too late to do anything about it easily or peacefully doesn’t mean it’s actually too late for anything to be done about it.  And that is the real tragedy.</p></div>",
  "content_text": "Larry Auster points out that conservatives never manage to conserve anything,\nnot even the nation\nthey supposedly love so dearly:\nAs long as there was a chance to\nstop\nthe immigration and the resulting dispossession of Anglo-European America, the\ntopic was forbidden\n.\nBut now that it’s happened, and there’s a sense that nothing can be\ndone about it, and therefore the identification of the fact that mass\nnonwhite immigration is leading  to the radical cultural and political\ntransformation of America does not logically require a call for\nrestricting\nthat immigration, it’s become safe for Mark Steyn and all the other\ndespicable conservative cowards to come out from the shadows and say\nbold-sounding things like, “Demographics is Destiny.” In the minds of\nSteyn and the others, they are not issuing a\nwarning\nagainst that transformation, as such a warning would make them racists; they are announcing the\nvictory\nof that transformation, combined with impotent little grumblings about\nsome of its negative effects. After all, what—other than impotent\ngrumbling—is conservatism about?\nOf course, just because it’s too late to do anything about it easily or peacefully doesn’t mean it’s actually too late for anything to be done about it.  And that is the real tragedy.",
  "tags": [
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-01T21:09:00+00:00"
}