{
  "url": "https://voxday.net/2012/12/30/a-candidacy-is-announced/",
  "scraped_at": "2025-12-14T22:16:21.611385",
  "title": "A candidacy is announced",
  "date_display": "December 30, 2012",
  "date_iso": "2012-12-30T09:58:00+00:00",
  "date_from_url": "2012-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday, I sent a notice to the SFWA’s head of the election committee, announcing that I am running for the office of president of the organization.  It is highly unlikely that I will win, of course, but I would like to be able to say that I at least attempted to do my part to salvage an organization that is speeding rapidly into irrelevance.</p><p>One reason I am running is to restore the independence of what appears to have become a captive house award that Tor Books authors give themselves on an annual basis.  This may not be the case, but the statistical evidence suggests that there has been considerable corruption in the awards process in the past and that the 2010 rules changes have actually made the problem worse.</p><p>The other reason can be seen in these two quotes by its current president, the Tor Books author John Scalzi.  He condemned himself <a href=\"http://www.sfwa.org/join-us/sfwa-membership-requirements/#novel\">in the very words</a> with which he criticized his predecessor, Michael Capobianco back in 2007.</p><p><i>“Simply put, the professional organization of speculative fiction should<br> not be headed by people who believe their job is to hold back the<br> future. I believe strongly that Michael Capobianco sees it as his role<br> to hold back the future and to maintain the status quo in publishing and<br> in speculative fiction. That battle has already been lost; the<br> publishing world has already irrevocably changed from when Mr.<br> Capobianco last published. It’s time that SFWA moves forward with<br> leadership who understands this….  </br></br></br></br></br></br></br></i><br> <i><br/></i><br> <i>[T]he answer to whether I support membership in SFWA for people who are<br> not published writers is no.* That’s not going to change. I don’t think<br> it’s useful and I don’t think it’s needed. SFWA should certainly make<br> itself useful in helping aspiring SFWAns make the transition into<br> published status, and to a good extent, it does that now. But at the end<br> of the day it’s an organization for professional writers, and needs to<br> be composed of professional writers.” </br></br></br></br></br></br></i></br></br></p><p>Scalzi is a dinosaur.  He fails to understand that “professionally published” has been rendered a meaningless term by technological development and that science fiction writing now goes well beyond the simple medium of printed books.  The most influential science fiction writers don’t even write books, they write games.  Scalzi should know this, considering that he very recently got involved working for a company in the industry in which I have been active for 22 years.  And under the current qualification requirements, some bestselling SF/F novelists, whose work outsells most SFWA members, <a href=\"http://www.sfwa.org/join-us/sfwa-membership-requirements/#novel\">cannot qualify</a>.</p><p>Scalzi is also a fascist ideologue who actively attempts to shut down all debate he personally finds distressing at every opportunity.  Consider the way in which <a href=\"http://whatever.scalzi.com/2012/12/29/most-trafficked-whatever-posts-of-2012/\">he proudly declared</a> that in 2012, he managed to avoid permitting anyone to present facts or arguments that might have disturbed the tender sensitivities of the rabbity readers at Whatever.<br> <i><br/></i><br> <i>This year I also managed to arouse the ire of a whole stack of racist, sexist, homophobic dipshits with the above posts as well as several others. If I did nothing else with my year, this would have made it delightful to me. They also gave the Mallet of Loving Correction plenty of use when they would drop by the site and learn to their surprise that the sort of smug trollery that passes for thought in the land of epistemic closure doesn’t get past the door here. This is not a delight to me — trolls are always irritating — but whacking them so that the conversational level here remains high has its own grim level of satisfaction.</i><br> <i><br/></i><br> There is something deeply amusing about a man who claims that people pointing and laughing at him in contempt somehow translates to “ire”.  But it is deeply problematic for an organization to have someone who actively prides himself on the overt and intentional silencing of dissent – and is either delusional or dishonest enough to project his own closed-minded perspective on his critics – as its head.<br> <i><br/></i><br> As proof that it is John Scalzi who dwells in the land of epistemic closure and not those who disagree with him, I note the subsequent comment from one of his readers: <i>“Thanks again for making this a safe place to visit and comment.”  </i>Whatever is a safe place for the Rabbit People to visit and comment precisely because Scalzi practices the very epistemic closure that he feigns to decry. The quoted statement is virtually a textbook illustration of psychological projection.  He sees ire on the part of those who feel none because he is angry with them.  He sees closed minds and smugness in others because he is smug and his mind is closed to competing ideas.  He can’t conceive of honest dissent because he is himself dishonest and inclined towards conformity.</br></br></br></br></br></br></p><p>Now, it should be made clear that John Scalzi is not the problem with the SFWA, he is merely one of the symptoms of the ideological disease that has been gradually killing science fiction and fantasy in the print world for the last thirty years.  Thanks to technology, SF/F will survive, but not in its traditional form if its self-appointed gatekeepers continue to stress mediocrity and ideological conformity over the dangerous new visions that once characterized it.<i></i><br> <i><br/></i><br> It is unlikely that I will win the election; even if I win it is unlikely that I can do anything to salvage the situation.  The myopic Neo-Luddism and anti-intellectual ideology in the organization appears to be both deep and wide.  But I will present my platform to the membership on February 1st so that at least no one will be able to say that things could not have been different if the organization, and the literary genre, continues its downward spiral.</br></br></p></div>",
  "content_text": "Yesterday, I sent a notice to the SFWA’s head of the election committee, announcing that I am running for the office of president of the organization.  It is highly unlikely that I will win, of course, but I would like to be able to say that I at least attempted to do my part to salvage an organization that is speeding rapidly into irrelevance.\nOne reason I am running is to restore the independence of what appears to have become a captive house award that Tor Books authors give themselves on an annual basis.  This may not be the case, but the statistical evidence suggests that there has been considerable corruption in the awards process in the past and that the 2010 rules changes have actually made the problem worse.\nThe other reason can be seen in these two quotes by its current president, the Tor Books author John Scalzi.  He condemned himself\nin the very words\nwith which he criticized his predecessor, Michael Capobianco back in 2007.\n“Simply put, the professional organization of speculative fiction should\nnot be headed by people who believe their job is to hold back the\nfuture. I believe strongly that Michael Capobianco sees it as his role\nto hold back the future and to maintain the status quo in publishing and\nin speculative fiction. That battle has already been lost; the\npublishing world has already irrevocably changed from when Mr.\nCapobianco last published. It’s time that SFWA moves forward with\nleadership who understands this….\n[T]he answer to whether I support membership in SFWA for people who are\nnot published writers is no.* That’s not going to change. I don’t think\nit’s useful and I don’t think it’s needed. SFWA should certainly make\nitself useful in helping aspiring SFWAns make the transition into\npublished status, and to a good extent, it does that now. But at the end\nof the day it’s an organization for professional writers, and needs to\nbe composed of professional writers.”\nScalzi is a dinosaur.  He fails to understand that “professionally published” has been rendered a meaningless term by technological development and that science fiction writing now goes well beyond the simple medium of printed books.  The most influential science fiction writers don’t even write books, they write games.  Scalzi should know this, considering that he very recently got involved working for a company in the industry in which I have been active for 22 years.  And under the current qualification requirements, some bestselling SF/F novelists, whose work outsells most SFWA members,\ncannot qualify\n.\nScalzi is also a fascist ideologue who actively attempts to shut down all debate he personally finds distressing at every opportunity.  Consider the way in which\nhe proudly declared\nthat in 2012, he managed to avoid permitting anyone to present facts or arguments that might have disturbed the tender sensitivities of the rabbity readers at Whatever.\nThis year I also managed to arouse the ire of a whole stack of racist, sexist, homophobic dipshits with the above posts as well as several others. If I did nothing else with my year, this would have made it delightful to me. They also gave the Mallet of Loving Correction plenty of use when they would drop by the site and learn to their surprise that the sort of smug trollery that passes for thought in the land of epistemic closure doesn’t get past the door here. This is not a delight to me — trolls are always irritating — but whacking them so that the conversational level here remains high has its own grim level of satisfaction.\nThere is something deeply amusing about a man who claims that people pointing and laughing at him in contempt somehow translates to “ire”.  But it is deeply problematic for an organization to have someone who actively prides himself on the overt and intentional silencing of dissent – and is either delusional or dishonest enough to project his own closed-minded perspective on his critics – as its head.\nAs proof that it is John Scalzi who dwells in the land of epistemic closure and not those who disagree with him, I note the subsequent comment from one of his readers:\n“Thanks again for making this a safe place to visit and comment.”\nWhatever is a safe place for the Rabbit People to visit and comment precisely because Scalzi practices the very epistemic closure that he feigns to decry. The quoted statement is virtually a textbook illustration of psychological projection.  He sees ire on the part of those who feel none because he is angry with them.  He sees closed minds and smugness in others because he is smug and his mind is closed to competing ideas.  He can’t conceive of honest dissent because he is himself dishonest and inclined towards conformity.\nNow, it should be made clear that John Scalzi is not the problem with the SFWA, he is merely one of the symptoms of the ideological disease that has been gradually killing science fiction and fantasy in the print world for the last thirty years.  Thanks to technology, SF/F will survive, but not in its traditional form if its self-appointed gatekeepers continue to stress mediocrity and ideological conformity over the dangerous new visions that once characterized it.\nIt is unlikely that I will win the election; even if I win it is unlikely that I can do anything to salvage the situation.  The myopic Neo-Luddism and anti-intellectual ideology in the organization appears to be both deep and wide.  But I will present my platform to the membership on February 1st so that at least no one will be able to say that things could not have been different if the organization, and the literary genre, continues its downward spiral.",
  "tags": [
    "trainwreck",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-30T09:58:00+00:00"
}