{
  "url": "https://voxday.net/2012/12/15/a-goodreads-review/",
  "scraped_at": "2025-12-14T22:15:15.285879",
  "title": "A GoodReads review",
  "date_display": "December 15, 2012",
  "date_iso": "2012-12-15T14:00:00+00:00",
  "date_from_url": "2012-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>D.M. Dutcher <a href=\"http://www.goodreads.com/review/show/472740709\">reviews A THRONE OF BONES</a>:</p><blockquote class=\"tr_bq\"><p> It’s hard to sum it up since so much goes on in the book. At <strike>800</strike>854 pages,<br> it’s long, and the first MLP hardcover release. The length doesn’t feel<br> too tedious though, with only the start of the book dragging a bit. Once<br> it gets past discussing the upcoming goblin fight, it gets much better,<br> as each new character has their own story and part to play.</br></br></br></br></p><p>The<br> world is very interesting too. It’s sort of a fusion of Rome and<br> medieval Europe-imagine Rome with its legionnaires and patricians with a<br> church like in Thomist times and Vikings mingling with supernatural<br> creatures like elves and werewolves. The main focus is on Rome though,<br> and it adds a lot to the book by setting it apart from the generic<br> fantasy land it could be. It’s not just the gladiators and phalanxes,<br> but he gets the ethos of each nation and group right. You get inside<br> their heads, and it’s well done indeed.</br></br></br></br></br></br></br></br></p><p>I also found that it<br> fixed something that I didn’t like about Game of Thrones. One of the<br> issues I had with the first book in that series was that the<br> supernatural and fantasy aspects felt tacked in, as opposed to purely<br> human drama. Vox though always makes the fantasy part noticeable if not<br> prevalent. This isn’t just “let’s make it fantasy because we really want<br> to tell a historical fiction story and ignore the parts we don’t like,”<br> but magic and fantasy have as much a part to play as the intricate<br> machinations between nobles. If anything, you wish there was a bit more<br> focus on it. The elves in particular….</br></br></br></br></br></br></br></br></br></p><p>All in all, it’s a good, epic fantasy novel. It was better than I<br> expected. If you like more traditional Christian fantasy fare that is<br> clean and more aggressively spiritual (if not evangelistic) you may not<br> like this. But people who like well-written fantasy and Christians who<br> are okay with more realism and edginess to their books will probably<br> enjoy it quite a bit.  </br></br></br></br></br></p></blockquote><p>I’m pleased to see that readers are understanding that THE ARTS OF DARK AND LIGHT series is not traditional Christian fantasy fare.  It was never intended to be, any more than it was intended to be a mindless attempt to do to GRR Martin what Terry Brooks did to JRR Tolkien in his Shannara series.  I’m still amused by the charge that I am simultaneously mimicking Edward Gibbon and R. Scott Bakker(1); while it would still be wrong, one would do significantly better to assert the book is the bastard love-child of J.B. Bury and Joe Abercrombie.  If critics want to claim that I am a derivative writer in the vein of the retrophobes, that is certainly their prerogative, but I would expect they might at least have the perspicacity to get the genuine influences right.</p><p>The reviewer is correct.  The ethos of the book is definitely more concerned with the martial values than the Christian ones.  This is the natural result of half the perspective characters either being military officers or what could reasonably be described as military intelligence.  When I write my characters, I always attempt to focus on their current concerns rather using them as a vessel for some larger point.  This is why the Marcus Valerius who is actively engaged with theological matters as part of a Church embassy led by a pair of noted ecclesiastic intellectuals is simply not going to be anywhere nearly as concerned with such elevated matters while commanding a cavalry wing in the middle of a battle involving some 30,000 combatants.</p><p> <i>(1) In all seriousness, Bakker would probably be the last of the epic fantasy writers that I would attempt to mimic. Well, no, that would definitely be Jordan.  Then Erikson, simply because I don’t even know how I would go about trying to imitate him. But I can’t mimic the best thing about Bakker, his florid, but absorbing style, and I can’t imagine wanting to imitate any of his plots or his characters.  His worldbuilding is competent and reasonably substantial, but it doesn’t take a form in which I have any interest whatsoever, nor does it have anything in common with mine.  Moreover, a simple look at the publication date of Summa Elvetica should make it obvious that Selenoth(2) is a world I created long before I’d ever heard of R. Scott Bakker.</i><br> <i><br/></i><br> <i>(2) I will send a free hardcover to the first person who correctly guesses what computer game served as the original inspiration for the name of Selenoth.  This offer will stand for one week.</i></br></br></p></div>",
  "content_text": "D.M. Dutcher\nreviews A THRONE OF BONES\n:\nIt’s hard to sum it up since so much goes on in the book. At\n800\n854 pages,\nit’s long, and the first MLP hardcover release. The length doesn’t feel\ntoo tedious though, with only the start of the book dragging a bit. Once\nit gets past discussing the upcoming goblin fight, it gets much better,\nas each new character has their own story and part to play.\nThe\nworld is very interesting too. It’s sort of a fusion of Rome and\nmedieval Europe-imagine Rome with its legionnaires and patricians with a\nchurch like in Thomist times and Vikings mingling with supernatural\ncreatures like elves and werewolves. The main focus is on Rome though,\nand it adds a lot to the book by setting it apart from the generic\nfantasy land it could be. It’s not just the gladiators and phalanxes,\nbut he gets the ethos of each nation and group right. You get inside\ntheir heads, and it’s well done indeed.\nI also found that it\nfixed something that I didn’t like about Game of Thrones. One of the\nissues I had with the first book in that series was that the\nsupernatural and fantasy aspects felt tacked in, as opposed to purely\nhuman drama. Vox though always makes the fantasy part noticeable if not\nprevalent. This isn’t just “let’s make it fantasy because we really want\nto tell a historical fiction story and ignore the parts we don’t like,”\nbut magic and fantasy have as much a part to play as the intricate\nmachinations between nobles. If anything, you wish there was a bit more\nfocus on it. The elves in particular….\nAll in all, it’s a good, epic fantasy novel. It was better than I\nexpected. If you like more traditional Christian fantasy fare that is\nclean and more aggressively spiritual (if not evangelistic) you may not\nlike this. But people who like well-written fantasy and Christians who\nare okay with more realism and edginess to their books will probably\nenjoy it quite a bit.\nI’m pleased to see that readers are understanding that THE ARTS OF DARK AND LIGHT series is not traditional Christian fantasy fare.  It was never intended to be, any more than it was intended to be a mindless attempt to do to GRR Martin what Terry Brooks did to JRR Tolkien in his Shannara series.  I’m still amused by the charge that I am simultaneously mimicking Edward Gibbon and R. Scott Bakker(1); while it would still be wrong, one would do significantly better to assert the book is the bastard love-child of J.B. Bury and Joe Abercrombie.  If critics want to claim that I am a derivative writer in the vein of the retrophobes, that is certainly their prerogative, but I would expect they might at least have the perspicacity to get the genuine influences right.\nThe reviewer is correct.  The ethos of the book is definitely more concerned with the martial values than the Christian ones.  This is the natural result of half the perspective characters either being military officers or what could reasonably be described as military intelligence.  When I write my characters, I always attempt to focus on their current concerns rather using them as a vessel for some larger point.  This is why the Marcus Valerius who is actively engaged with theological matters as part of a Church embassy led by a pair of noted ecclesiastic intellectuals is simply not going to be anywhere nearly as concerned with such elevated matters while commanding a cavalry wing in the middle of a battle involving some 30,000 combatants.\n(1) In all seriousness, Bakker would probably be the last of the epic fantasy writers that I would attempt to mimic. Well, no, that would definitely be Jordan.  Then Erikson, simply because I don’t even know how I would go about trying to imitate him. But I can’t mimic the best thing about Bakker, his florid, but absorbing style, and I can’t imagine wanting to imitate any of his plots or his characters.  His worldbuilding is competent and reasonably substantial, but it doesn’t take a form in which I have any interest whatsoever, nor does it have anything in common with mine.  Moreover, a simple look at the publication date of Summa Elvetica should make it obvious that Selenoth(2) is a world I created long before I’d ever heard of R. Scott Bakker.\n(2) I will send a free hardcover to the first person who correctly guesses what computer game served as the original inspiration for the name of Selenoth.  This offer will stand for one week.",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-15T14:00:00+00:00"
}