{
  "url": "https://voxday.net/2012/12/05/a-throne-of-bones-is-ou/",
  "scraped_at": "2025-12-14T05:09:29.746269",
  "title": "A THRONE OF BONES is out",
  "date_display": "December 5, 2012",
  "date_iso": "2012-12-05T09:07:00+00:00",
  "date_from_url": "2012-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://4.bp.blogspot.com/-D5vUaBg7fFY/UHvVxc4PQNI/AAAAAAAAAVc/VprGTfLGmWY/s1600/ATOB_480.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/12/ATOB_480.png\" width=\"213\"/></a></div><div style=\"margin-bottom: 0in;\"> <i>In Selenoth, the race of Man is on the ascendant. The ancient<br> dragons sleep. The ghastly Witchkings are no more; their evil<br> power destroyed by the courage of Men and the fearsome magic of<br> the Elves. The Dwarves have retreated to the kingdoms of the<br> Underdeep, the trolls hide in their mountains, and even the savage<br> orc tribes have learned to dread the iron discipline of Amorr’s<br> mighty legions. But after four hundred years of mutual suspicion,<br> the rivalry between two of the Houses Martial that rule the<br> Amorran Senate threatens to turn violent, and unrest sparks<br> rebellion throughout the imperial provinces. In the north, the<br> barbarian reavers who have long plagued the coasts of the White<br> Sea beg for the royal protection of the King of Savondir, as they<br> flee a vicious race of wolf-demons. In the east, the war drums<br> echo throughout the mountains as orcs and goblins gather in great<br> numbers, summoned by their bestial gods.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> <i>And when the Most Holy and<br> Sanctified Father is found dead in his bed, leaving the Ivory<br> Throne of the Apostles unclaimed, the temptation to seize the<br> Sacred College and wield Holy Mother Church as a weapon is more<br> than some fallen souls can resist.</br></br></br></br></i></div><p> I am very pleased to be able to say that <i><b>A Throne of Bones</b></i> is now available for $4.99 for <a href=\"http://www.amazon.com/Throne-Bones-Arts-Light-ebook/dp/B00AHK8LGI/ref=sr_1_1?s=digital-text&amp;ie=UTF8&amp;qid=1354668010&amp;sr=1-1\">Amazon Kindle</a> and $4.99 for <a href=\"http://www.barnesandnoble.com/w/a-throne-of-bones-vox-day/1113883349\">Barnes and Noble Nook</a>, as well as $34.99 in <a href=\"http://www.marcherlordpress.com/bookstore/hinterlands-imprint/throne-of-bones/\">hardcover </a>from Marcher Lord Hinterlands.  It is 852 pages in hardcover and it is not at all necessary to have read either <b><i>Summa Elvetica</i></b> or <i><b>A Magic Broken</b></i> first.  Both SE and AMB are little more than an extended chapter in the story of a perspective character from <i><b>A Throne of Bones</b></i>.</p><p>The Responsible Puppet was the first individual other than the editor to read it, and he kindly took the time <a href=\"http://jamsco.wordpress.com/2012/12/03/book-review-a-throne-of-bones/\">to review it on his blog </a>in time for this announcement.</p><blockquote class=\"tr_bq\"><p> When I reviewed `Summa Elvetica’, Vox Day’s last fiction book, I wrote,<br> `My feeling here is that this book could be a “The Hobbit”-like prelude<br> to a much more significant fictional writing.’ This, I’m pleased to say,<br> is what the author has done. `Throne’ is placed in the same universe as<br> that book and only a few years (months?) later.  And what is this<br> universe? Just like with Summa, imagine Rome in the fifth century,<br> complete with a Christian heritage. Now add in magic. And elves. And<br> dwarves and goblins and some kind of new immortal creature.</br></br></br></br></br></br></br></p><p>But the geography is completely different. The Empire is Amorr. In it,<br> there are two very strong family houses that are growing more and more<br> at odds with each other. In one of these houses, two brothers are in<br> conflict – for good reason…</br></br></br></p><p>It<br> is, in turn, humorous, shocking and exciting. There are beautiful<br> moments, there is clever dialogue, there is deep mystery. It took some<br> level of genius to write it. </br></br></br></p></blockquote><p>And because every epic fantasy needs a map, this one arguably more than most, I was fortunate to be able to once again call upon the artistic talents of JartStar.  This is the map of Selenoth and Imperial Amorr that appears in the book.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/-sIAMumK-TuE/UL8Nq818YDI/AAAAAAAAAV8/F1CEwnxpDi0/s1600/Map+ATOB+FINAL.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"298\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/12/Map-ATOB-FINAL.jpg\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2012/12/Map-ATOB-FINAL.jpg\" decoding=\"async\" height=\"298\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%20298%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p>For those who have followed this process from the start and are interested in the minutiae, today marks<br> 499 days since the two conversations with Spacebunny’s cousin and the<br> Original Cyberpunk about <i><b>A Dance With Dragons</b></i> that inspired the writing of the book.  <b><i>A Throne of Bones</i></b> contains<br> 297,862 words, 15,875 of them unique.  This compares favorably with<br> George Martin (295,929 and 13,717, respectively), Joe Abercrombie<br> (191,393 and 11,260), and Louis L’Amour (94,297 and 7,598), but pales before<br> the greatest author of my generation, Neal Stephenson (409,365 and<br> 29,239).  And thanks again to those who preordered, as we exceeded our goals by nearly forty percent.  The hardcovers go to press tomorrow and should arrive well in time for Christmas.</br></br></br></br></br></br></br></p><p>UPDATE:  It is nice to see some appreciation for Kirk’s superlative work from <a href=\"http://pjmedia.com/instapundit/159031/\">Instapundit</a>: “VOX DAY’S NEW NOVEL, <i>A Throne of Bones</i>, is now out at Amazon.  Very nice cover.” By all means, judge the book by it….</p><p>UPDATE 2: Dr. Helen mentions the release <a href=\"http://pjmedia.com/drhelen/2012/12/05/new-book-by-vox-day-now-out/\">on her site</a> too.</p><p>UPDATE 3: I’ve posted an announcement <a href=\"http://www.blackgate.com/2012/12/05/a-throne-of-bones/\">at Black Gate</a> too, with a brief summary of the connection between the book and some of my past posts there.</p></div>",
  "content_text": "In Selenoth, the race of Man is on the ascendant. The ancient\ndragons sleep. The ghastly Witchkings are no more; their evil\npower destroyed by the courage of Men and the fearsome magic of\nthe Elves. The Dwarves have retreated to the kingdoms of the\nUnderdeep, the trolls hide in their mountains, and even the savage\norc tribes have learned to dread the iron discipline of Amorr’s\nmighty legions. But after four hundred years of mutual suspicion,\nthe rivalry between two of the Houses Martial that rule the\nAmorran Senate threatens to turn violent, and unrest sparks\nrebellion throughout the imperial provinces. In the north, the\nbarbarian reavers who have long plagued the coasts of the White\nSea beg for the royal protection of the King of Savondir, as they\nflee a vicious race of wolf-demons. In the east, the war drums\necho throughout the mountains as orcs and goblins gather in great\nnumbers, summoned by their bestial gods.\nAnd when the Most Holy and\nSanctified Father is found dead in his bed, leaving the Ivory\nThrone of the Apostles unclaimed, the temptation to seize the\nSacred College and wield Holy Mother Church as a weapon is more\nthan some fallen souls can resist.\nI am very pleased to be able to say that\nA Throne of Bones\nis now available for $4.99 for\nAmazon Kindle\nand $4.99 for\nBarnes and Noble Nook\n, as well as $34.99 in\nhardcover\nfrom Marcher Lord Hinterlands.  It is 852 pages in hardcover and it is not at all necessary to have read either\nSumma Elvetica\nor\nA Magic Broken\nfirst.  Both SE and AMB are little more than an extended chapter in the story of a perspective character from\nA Throne of Bones\n.\nThe Responsible Puppet was the first individual other than the editor to read it, and he kindly took the time\nto review it on his blog\nin time for this announcement.\nWhen I reviewed `Summa Elvetica’, Vox Day’s last fiction book, I wrote,\n`My feeling here is that this book could be a “The Hobbit”-like prelude\nto a much more significant fictional writing.’ This, I’m pleased to say,\nis what the author has done. `Throne’ is placed in the same universe as\nthat book and only a few years (months?) later.  And what is this\nuniverse? Just like with Summa, imagine Rome in the fifth century,\ncomplete with a Christian heritage. Now add in magic. And elves. And\ndwarves and goblins and some kind of new immortal creature.\nBut the geography is completely different. The Empire is Amorr. In it,\nthere are two very strong family houses that are growing more and more\nat odds with each other. In one of these houses, two brothers are in\nconflict – for good reason…\nIt\nis, in turn, humorous, shocking and exciting. There are beautiful\nmoments, there is clever dialogue, there is deep mystery. It took some\nlevel of genius to write it.\nAnd because every epic fantasy needs a map, this one arguably more than most, I was fortunate to be able to once again call upon the artistic talents of JartStar.  This is the map of Selenoth and Imperial Amorr that appears in the book.\nFor those who have followed this process from the start and are interested in the minutiae, today marks\n499 days since the two conversations with Spacebunny’s cousin and the\nOriginal Cyberpunk about\nA Dance With Dragons\nthat inspired the writing of the book.\nA Throne of Bones\ncontains\n297,862 words, 15,875 of them unique.  This compares favorably with\nGeorge Martin (295,929 and 13,717, respectively), Joe Abercrombie\n(191,393 and 11,260), and Louis L’Amour (94,297 and 7,598), but pales before\nthe greatest author of my generation, Neal Stephenson (409,365 and\n29,239).  And thanks again to those who preordered, as we exceeded our goals by nearly forty percent.  The hardcovers go to press tomorrow and should arrive well in time for Christmas.\nUPDATE:  It is nice to see some appreciation for Kirk’s superlative work from\nInstapundit\n: “VOX DAY’S NEW NOVEL,\nA Throne of Bones\n, is now out at Amazon.  Very nice cover.” By all means, judge the book by it….\nUPDATE 2: Dr. Helen mentions the release\non her site\ntoo.\nUPDATE 3: I’ve posted an announcement\nat Black Gate\ntoo, with a brief summary of the connection between the book and some of my past posts there.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-05T09:07:00+00:00"
}