{
  "url": "https://voxday.net/2012/12/27/amazon-sfwa-and-authorial-corruption/",
  "scraped_at": "2025-12-14T22:16:09.425672",
  "title": "Amazon, the SFWA and authorial corruption",
  "date_display": "December 27, 2012",
  "date_iso": "2012-12-27T11:53:00+00:00",
  "date_from_url": "2012-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amazon is entirely correct <a href=\"http://www.telegraph.co.uk/culture/books/booknews/9738552/Author-backlash-over-Amazons-new-online-review-crackdown.html\">to limit author reviews</a> on its site:</p><blockquote class=\"tr_bq\"><p> Scores of authors in Britain and across the Atlantic have recently reported<br> that their reviews have either mysteriously disappeared or were never<br> published. Amazon has now admitted that it has introduced a ban on authors leaving<br> reviews about other people’s books in the same genre because they may pose a<br> “conflict of interest” and cannot be impartial about their rivals.</br></br></br></br></p><p>This means that thriller writers are prevented from commenting on works by<br> other authors who write similar books. Critics suggest this system is flawed because many authors are impartial and<br> are experts on novels. </br></br></p></blockquote><div class=\"thirdPar\"> Now, I can quite reasonably argue that I am one of the most impartial author-reviewers to have written a book review in the last 20 years.  My integrity as a reviewer is literally unquestioned; I was the only active game developer permitted to write computer game reviews in <i>Computer Gaming World</i>, and I was allowed to do so under two different editors because they knew I would never sacrifice my credibility as a reviewer for any reason.  Many readers know that I have quite favorably reviewed books by individuals whose politics I consider loathsome, whose opinions I consider idiotic, and whose characters I consider to be contemptible.  To my eyes, a book stands alone; its provenance is irrelevant.<p>Unlike the vast majority of book reviewers in the SF/F industry, I simply do not permit my subjective opinions to color my objective reviews.  It’s not that I don’t have any opinions, I simply refuse to take them into account when reviewing a book, a game, or a movie.</p><p>And yet, I not only don’t write reviews on Amazon, I fully support Amazon’s decision to bar authors from reviewing books and assigning them stars there.  Why?  Because for the last ten years, I have been privy to the corruption that is absolutely rife within the organization of the SFWA, the Science Fiction and Fantasy Writers Organization, as well as to the ideological corruption of the SF/F industry on the part of the publishers, the reviewers, and even the bloggers.</p><p>Read the rest <a href=\"http://www.blackgate.com/2012/12/27/sff-corruption-part-i/\">at The Black Gate</a>.</p><p>UPDATE: An SFWA insider confirms my observations: <i>“[Vox] is correct when it comes to the inbred logrolling. As SFWA Bulletin editor from 1999-2002 I can attest to this first hand. A small clique and their “in” friends control quite a bit of what goes on in SFWA (at least it did back then and I have no reason to doubt that things have changed).”</i></p><p>UPDATE 2: I would be remiss if I left off this reviewer’s hilarious description of the Nebula award-winning <i>Quantum Rose: </i>“Kamoj Quanta Argali is the 18 yr old governor of a planet of former<br> slaves. When a newcomer on the world Havyrl arrives to recover from an<br> ordeal which left him half mad, he spies Kamoj taking a bath in a river<br> and falls for her. Impulsively Havryl offers to marry her which causes<br> strife and conflict throughout the region, as Kamoj’s spurned fiancee<br> vows revenge.”</br></br></br></br></br></p><p>Ye cats!  The punchline?  That’s from a reader who actually thought the book was all right and gave it three stars!  It  also appears Asaro is from the Isaac Asimov school of nomenclature.</p></div></div>",
  "content_text": "Amazon is entirely correct\nto limit author reviews\non its site:\nScores of authors in Britain and across the Atlantic have recently reported\nthat their reviews have either mysteriously disappeared or were never\npublished. Amazon has now admitted that it has introduced a ban on authors leaving\nreviews about other people’s books in the same genre because they may pose a\n“conflict of interest” and cannot be impartial about their rivals.\nThis means that thriller writers are prevented from commenting on works by\nother authors who write similar books. Critics suggest this system is flawed because many authors are impartial and\nare experts on novels.\nNow, I can quite reasonably argue that I am one of the most impartial author-reviewers to have written a book review in the last 20 years.  My integrity as a reviewer is literally unquestioned; I was the only active game developer permitted to write computer game reviews in\nComputer Gaming World\n, and I was allowed to do so under two different editors because they knew I would never sacrifice my credibility as a reviewer for any reason.  Many readers know that I have quite favorably reviewed books by individuals whose politics I consider loathsome, whose opinions I consider idiotic, and whose characters I consider to be contemptible.  To my eyes, a book stands alone; its provenance is irrelevant.\nUnlike the vast majority of book reviewers in the SF/F industry, I simply do not permit my subjective opinions to color my objective reviews.  It’s not that I don’t have any opinions, I simply refuse to take them into account when reviewing a book, a game, or a movie.\nAnd yet, I not only don’t write reviews on Amazon, I fully support Amazon’s decision to bar authors from reviewing books and assigning them stars there.  Why?  Because for the last ten years, I have been privy to the corruption that is absolutely rife within the organization of the SFWA, the Science Fiction and Fantasy Writers Organization, as well as to the ideological corruption of the SF/F industry on the part of the publishers, the reviewers, and even the bloggers.\nRead the rest\nat The Black Gate\n.\nUPDATE: An SFWA insider confirms my observations:\n“[Vox] is correct when it comes to the inbred logrolling. As SFWA Bulletin editor from 1999-2002 I can attest to this first hand. A small clique and their “in” friends control quite a bit of what goes on in SFWA (at least it did back then and I have no reason to doubt that things have changed).”\nUPDATE 2: I would be remiss if I left off this reviewer’s hilarious description of the Nebula award-winning\nQuantum Rose:\n“Kamoj Quanta Argali is the 18 yr old governor of a planet of former\nslaves. When a newcomer on the world Havyrl arrives to recover from an\nordeal which left him half mad, he spies Kamoj taking a bath in a river\nand falls for her. Impulsively Havryl offers to marry her which causes\nstrife and conflict throughout the region, as Kamoj’s spurned fiancee\nvows revenge.”\nYe cats!  The punchline?  That’s from a reader who actually thought the book was all right and gave it three stars!  It  also appears Asaro is from the Isaac Asimov school of nomenclature.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-27T11:53:00+00:00"
}