{
  "url": "https://voxday.net/2012/12/04/another-conservative-purge/",
  "scraped_at": "2025-12-14T05:09:27.883959",
  "title": "Another conservative purge",
  "date_display": "December 4, 2012",
  "date_iso": "2012-12-04T17:21:00+00:00",
  "date_from_url": "2012-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How many times can Republicans <a href=\"http://dyn.politico.com/printstory.cfm?uuid=FA7075E4-D5B1-4D7B-B85C-9603A2FBE5D9\">purge those to their right</a> from their ranks and still be meaningfully considered to represent the American political right?</p><blockquote class=\"tr_bq\"><p> Boehner, Majority<br> Leader Eric Cantor (R-Va.) and Majority Whip Kevin McCarthy (R-Calif.)<br> have worked assiduously to keep conservative groups on the outside in<br> line as they try to strike a massive deal to keep taxes low on all<br> Americans and avoid spending cuts to the Pentagon and other domestic<br> programs. The traditional right — The Wall Street Journal editorial page,<br> National Review, Fox News and business-friendly analysts on CNBC — have<br> been lockstep in line with Boehner, the result of careful outreach by<br> leadership staff. But now, top House leaders suddenly find themselves under fire from entities with enormous sway in GOP politics.</br></br></br></br></br></br></br></br></p></blockquote><p>The fact that the WSJ, NR, and Fox are pro-business doesn’t mean they are traditional right.  Not anymore.  Mussolini and Hitler were pro-business too.  The irony is that the right was told that they had to dutifully line up behind Mitt Romney because he was, as a moderate, more electable than the anti-bank, anti-war, Ron Paul.  Then, when Romney went down in flames just like McCain, Bush, Dole, Ford and every other elite-selected moderate before, what passes for Republican “leadership” in the House is trying to keep moving left.</p><p>If you are a conservative who is still a Republican, I have a very simple question to ask you: why?  It is becoming increasingly obvious that both conservatives and America would have been better off if the John Birch Society purged William F. Buckley rather than the other way around.</p></div>",
  "content_text": "How many times can Republicans\npurge those to their right\nfrom their ranks and still be meaningfully considered to represent the American political right?\nBoehner, Majority\nLeader Eric Cantor (R-Va.) and Majority Whip Kevin McCarthy (R-Calif.)\nhave worked assiduously to keep conservative groups on the outside in\nline as they try to strike a massive deal to keep taxes low on all\nAmericans and avoid spending cuts to the Pentagon and other domestic\nprograms. The traditional right — The Wall Street Journal editorial page,\nNational Review, Fox News and business-friendly analysts on CNBC — have\nbeen lockstep in line with Boehner, the result of careful outreach by\nleadership staff. But now, top House leaders suddenly find themselves under fire from entities with enormous sway in GOP politics.\nThe fact that the WSJ, NR, and Fox are pro-business doesn’t mean they are traditional right.  Not anymore.  Mussolini and Hitler were pro-business too.  The irony is that the right was told that they had to dutifully line up behind Mitt Romney because he was, as a moderate, more electable than the anti-bank, anti-war, Ron Paul.  Then, when Romney went down in flames just like McCain, Bush, Dole, Ford and every other elite-selected moderate before, what passes for Republican “leadership” in the House is trying to keep moving left.\nIf you are a conservative who is still a Republican, I have a very simple question to ask you: why?  It is becoming increasingly obvious that both conservatives and America would have been better off if the John Birch Society purged William F. Buckley rather than the other way around.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-04T17:21:00+00:00"
}