{
  "url": "https://voxday.net/2012/12/18/blame-deinstitutionalization-not-guns/",
  "scraped_at": "2025-12-14T22:15:34.951181",
  "title": "Blame deinstitutionalization, not guns",
  "date_display": "December 18, 2012",
  "date_iso": "2012-12-18T22:51:00+00:00",
  "date_from_url": "2012-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Guns don’t kill people, <a href=\"http://www.foxnews.com/us/2012/12/18/fear-being-committed-may-have-caused-connecticut-madman-to-snap/\">crazy people who don’t want to get locked up</a> kill people:</p><blockquote class=\"tr_bq\"><p> The gunman who slaughtered 20 children and six adults at a<br> Connecticut elementary school may have snapped because his mother was<br> planning to commit him to a psychiatric facility, according to a<br> lifelong resident of the area who was familiar with the killer’s family<br> and several of the victims’ families.</br></br></br></br></p><p>Adam Lanza, 20, targeted Sandy Hook Elementary School in Newtown<br> after killing his mother early Friday because he believed she loved the<br> school “more than she loved him,” said Joshua Flashman, 25, who grew up<br> not far from where the shooting took place. Flashman, a U.S. Marine, is<br> the son of a pastor at an area church where many of the victims’<br> families worship.</br></br></br></br></br></p><p>“From what I’ve been told, Adam was aware of her petitioning the<br> court for conservatorship and (her) plans to have him committed,”<br> Flashman told FoxNews.com. “Adam was apparently very upset about this.<br> He thought she just wanted to send him away. From what I understand, he<br> was really, really angry. I think this could have been it, what set him<br> off.”</br></br></br></br></br></p></blockquote><p>Sometimes, it really is just the crazy.  And if you let the confirmed crazies run around free until they kill someone, you’re assured that eventually some of them are going to do it.</p></div>",
  "content_text": "Guns don’t kill people,\ncrazy people who don’t want to get locked up\nkill people:\nThe gunman who slaughtered 20 children and six adults at a\nConnecticut elementary school may have snapped because his mother was\nplanning to commit him to a psychiatric facility, according to a\nlifelong resident of the area who was familiar with the killer’s family\nand several of the victims’ families.\nAdam Lanza, 20, targeted Sandy Hook Elementary School in Newtown\nafter killing his mother early Friday because he believed she loved the\nschool “more than she loved him,” said Joshua Flashman, 25, who grew up\nnot far from where the shooting took place. Flashman, a U.S. Marine, is\nthe son of a pastor at an area church where many of the victims’\nfamilies worship.\n“From what I’ve been told, Adam was aware of her petitioning the\ncourt for conservatorship and (her) plans to have him committed,”\nFlashman told FoxNews.com. “Adam was apparently very upset about this.\nHe thought she just wanted to send him away. From what I understand, he\nwas really, really angry. I think this could have been it, what set him\noff.”\nSometimes, it really is just the crazy.  And if you let the confirmed crazies run around free until they kill someone, you’re assured that eventually some of them are going to do it.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-18T22:51:00+00:00"
}