{
  "url": "https://voxday.net/2012/12/01/divine-perfection/",
  "scraped_at": "2025-12-14T05:09:10.021238",
  "title": "Divine perfection",
  "date_display": "December 1, 2012",
  "date_iso": "2012-12-01T00:37:00+00:00",
  "date_from_url": "2012-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://opinionator.blogs.nytimes.com/2012/11/25/an-imperfect-god/\">the lack of Biblical evidence</a> for it:</p><blockquote class=\"tr_bq\"><p> Is God perfect? You often hear philosophers describe “theism” as the<br> belief in a perfect being — a being whose attributes are said to include<br> being all-powerful, all-knowing, immutable, perfectly good, perfectly<br> simple, and necessarily existent (among others). And today, something<br> like this view is common among lay people as well.</br></br></br></br></p><p>There<br> are two famous problems with this view of God. The first is that it<br> appears to be impossible to make it coherent. For example, it seems<br> unlikely that God can be both perfectly powerful and perfectly good if<br> the world is filled (as it obviously is) with instances of terrible<br> injustice. Similarly, it’s hard to see how God can wield his infinite<br> power to instigate alteration and change in all things if he is flat-out<br> immutable. And there are more such contradictions where these came<br> from.</br></br></br></br></br></br></br></br></p><p>The second problem is that<br> while this “theist” view of God is supposed to be a description of the<br> God of the Bible, it’s hard to find any evidence that the prophets and<br> scholars who wrote the Hebrew Bible (or “Old Testament”) thought of God<br> in this way at all. The God of Hebrew Scripture is not depicted as<br> immutable, but repeatedly changes his mind about things (for example, he<br> regrets having made man). He is not all-knowing, since he’s repeatedly<br> surprised by things (like the Israelites abandoning him for a statue of a<br> cow). He is not perfectly powerful either, in that he famously cannot<br> control Israel and get its people to do what he wants. And so on.</br></br></br></br></br></br></br></br></br></p></blockquote><p>As those of you who have read TIA know, I do not subscribe to the concept of God as a “perfect” being, or even think that it is meaningful to describe Him as “good”, but rather, a tautology.  And given our intrinsically limited perspective, I think it is stupid to claim we have any means of distinguishing between omniscience and superhuman tantiscience or voliscience. But it is fascinating to see that the Aprevistan view appears to finally have penetrated mainstream thinking.</p></div>",
  "content_text": "And\nthe lack of Biblical evidence\nfor it:\nIs God perfect? You often hear philosophers describe “theism” as the\nbelief in a perfect being — a being whose attributes are said to include\nbeing all-powerful, all-knowing, immutable, perfectly good, perfectly\nsimple, and necessarily existent (among others). And today, something\nlike this view is common among lay people as well.\nThere\nare two famous problems with this view of God. The first is that it\nappears to be impossible to make it coherent. For example, it seems\nunlikely that God can be both perfectly powerful and perfectly good if\nthe world is filled (as it obviously is) with instances of terrible\ninjustice. Similarly, it’s hard to see how God can wield his infinite\npower to instigate alteration and change in all things if he is flat-out\nimmutable. And there are more such contradictions where these came\nfrom.\nThe second problem is that\nwhile this “theist” view of God is supposed to be a description of the\nGod of the Bible, it’s hard to find any evidence that the prophets and\nscholars who wrote the Hebrew Bible (or “Old Testament”) thought of God\nin this way at all. The God of Hebrew Scripture is not depicted as\nimmutable, but repeatedly changes his mind about things (for example, he\nregrets having made man). He is not all-knowing, since he’s repeatedly\nsurprised by things (like the Israelites abandoning him for a statue of a\ncow). He is not perfectly powerful either, in that he famously cannot\ncontrol Israel and get its people to do what he wants. And so on.\nAs those of you who have read TIA know, I do not subscribe to the concept of God as a “perfect” being, or even think that it is meaningful to describe Him as “good”, but rather, a tautology.  And given our intrinsically limited perspective, I think it is stupid to claim we have any means of distinguishing between omniscience and superhuman tantiscience or voliscience. But it is fascinating to see that the Aprevistan view appears to finally have penetrated mainstream thinking.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-01T00:37:00+00:00"
}