{
  "url": "https://voxday.net/2012/12/09/dr-helen-calls-out-compassionate/",
  "scraped_at": "2025-12-14T22:14:44.438843",
  "title": "Dr. Helen calls out the compassionate",
  "date_display": "December 9, 2012",
  "date_iso": "2012-12-09T13:30:00+00:00",
  "date_from_url": "2012-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unlike the good doctor, I don’t believe in human equality, either between the sexes or in any other context.  I believe science, history, and casual observation are in accord on the matter. Nevertheless, I have to concur with <a href=\"http://pjmedia.com/drhelen/2012/12/08/oh-those-compassionate-women-2/\">her cogent observation</a> on the extraordinary distaste for criticism demonstrated by some women:</p><blockquote class=\"tr_bq\"><p> I don’t agree with Venker’s whole “theme” about women’s femininity, I<br> believe in equality between the sexes. However, the response to Venker<br> just illustrates that women can’t stand being called out in any way. If<br> men on my blog even complain mildly about something women do, they are<br> called misogynists, sexists and liars. This just goes to show that most<br> women can dish it out but can’t take it. Ladies, this double standard is<br> appalling and sexist.</br></br></br></br></br></br></p></blockquote><p>Dr. Helen adroitly twists the knife with her ironic reference to the myth of superior female compassion in the title to her post.  It is, indeed, a strange form of compassion that wishes death on anyone who dares to view a woman’s actions and ideas in anything but the rosiest light.</p></div>",
  "content_text": "Unlike the good doctor, I don’t believe in human equality, either between the sexes or in any other context.  I believe science, history, and casual observation are in accord on the matter. Nevertheless, I have to concur with\nher cogent observation\non the extraordinary distaste for criticism demonstrated by some women:\nI don’t agree with Venker’s whole “theme” about women’s femininity, I\nbelieve in equality between the sexes. However, the response to Venker\njust illustrates that women can’t stand being called out in any way. If\nmen on my blog even complain mildly about something women do, they are\ncalled misogynists, sexists and liars. This just goes to show that most\nwomen can dish it out but can’t take it. Ladies, this double standard is\nappalling and sexist.\nDr. Helen adroitly twists the knife with her ironic reference to the myth of superior female compassion in the title to her post.  It is, indeed, a strange form of compassion that wishes death on anyone who dares to view a woman’s actions and ideas in anything but the rosiest light.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-09T13:30:00+00:00"
}