{
  "url": "https://voxday.net/2012/12/10/embrace-cruelty/",
  "scraped_at": "2025-12-14T22:14:49.648642",
  "title": "Embrace the cruelty",
  "date_display": "December 10, 2012",
  "date_iso": "2012-12-10T14:22:00+00:00",
  "date_from_url": "2012-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t it remarkable how this excellent <a href=\"http://alastairadversaria.wordpress.com/2012/08/07/of-triggering-and-the-triggered-part-4/\">essay on heterotopic discourse versus sensitivity-based discourse</a> sounds very much like a description of two blogs for which I serve as a bête noire?</p><blockquote class=\"tr_bq\"><p> Lacking a high tolerance for difference and disagreement,<br> sensitivity-driven discourses will typically manifest a herding effect.<br> Dissenting voices can be scapegoated or excluded and opponents will be<br> sharply attacked. Unable to sustain true conversation, stale monologues<br> will take its place. Constantly pressed towards conformity,<br> indoctrination can take the place of open intellectual inquiry.<br> Fracturing into hostile dogmatic cliques takes the place of vigorous and<br> illuminating dialogue between contrasting perspectives. Lacking the<br> capacity for open dialogue, such groups will exert their influence on<br> wider society primarily by means of political agitation.  The fear of conflict and the inability to deal with disagreement lies<br> at the heart of sensitivity-driven discourses.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>As bad as Pharyngula can be in its mindless groupthink regard, PZ’s focus on science tends to somewhat reduce its author’s ability to be sensitive to the feelings of others.  It doesn’t matter how many times a reader bravely confesses to having been abused by a mongoose at the age of 4, PZ isn’t going to tolerate her nonsense if she sets herself against the tenets of the current scientific consensus, whatever it happens to be at the moment.</p><p>Even Amanda of Pandagon has more intellectual integrity, at least in this regard, than John Scalzi. His Whatever is a veritable warren of the Rabbit People, who compete for status by being more sensitive than each other.  No matter how convincingly John cringes and attempts to make himself accommodating to the ample concerns of his readership, he can never succeed because the sensitivity horizon is an ever-receding one.  I go into that aspect of the essay <a href=\"http://alphagameplan.blogspot.ch/\">in more detail on Alpha Game</a>.</p><p>But here, I want to focus on the vital importance of never giving the Rabbit People any entrance or respect on their terms.</p><blockquote class=\"tr_bq\"><p> When these two forms of discourse collide they are frequently unable<br> to understand each other and tend to bring out the worst in each other.<br> The first form of discourse seems lacking in rationality and ideological<br> challenge to the second; the second can appear cruel and devoid of<br> sensitivity to the first. To those accustomed to the second mode of<br> discourse, the cries of protest at supposedly offensive statements may<br> appear to be little more than a dirty and underhand ploy intentionally<br> adopted to derail the discussion by those whose ideological position<br> can’t sustain critical challenge. However, these protests are probably<br> less a ploy than the normal functioning of the particular mode of<br> discourse characteristic of that community, often the only mode of<br> discourse that those involved are proficient in.</br></br></br></br></br></br></br></br></br></br></br></p><p>To those accustomed to the first mode of discourse, the scathing<br> satire and sharp criticism of the second appears to be a vicious and<br> personal attack, driven by a hateful animus, when those who adopt such<br> modes of discourse are typically neither personally hurt nor aiming to<br> cause such hurt. Rather, as this second form of discourse demands<br> personal detachment from issues under discussion, ridicule does not aim<br> to cause hurt, but to up the ante of the debate, exposing the weakness<br> of the response to challenge, pushing opponents to come back with more<br> substantial arguments or betray their lack of convincing support for<br> their position. Within the first form of discourse, if you take offence,<br> you can close down the discourse in your favour; in the second form of<br> discourse, if all you can do is to take offence, you have conceded the<br> argument to your opponent, as offence is not meaningful currency within<br> such discourse….</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The power of offence and outrage was very much on display in that which<br> followed. Those who protested that they have been offended were able to<br> close down Jared Wilson’s voice and get him to apologize, something that<br> was regarded as a victory for those prepared to attack ‘misogyny’.<br> While I believe that Jared was right to apologize, the empowering of<br> offence-takers is far from a salutary development in Christian<br> discourse.</br></br></br></br></br></br></p></blockquote><p>So close, and yet so far.  The author is completely wrong about how heterotopicals should engage with the Rabbit People.  There is simply nothing there to understand in the first mode of discourse, the sensitivity-based mode.  It is a binary mode of thought where there is only submission or rejection.  Jared Wilson should never, ever, have apologized; he had done nothing for which TO apologize and by apologizing, he surrendered in the eyes of the Rabbit People.  All of his arguments were rendered vain and instantly dismissed in his interlocutors’ eyes by that single act of submission.</p><p>Never surrender to emotional manipulation.  Never back down in the face of nonexistent arguments and appeals to sensitivity and feelings.  Embrace the cruelty. Meet each demand for submission by amping up the ridicule, jacking up the humiliation, and increasing the pressure of intellectual precision.  Drive the Rabbit People out mercilessly whenever they show themselves; rest assured they are actively seeking to do the same to everyone who doesn’t submit to their never-ending demands.  Force them to expose their total inability to accept contradiction and criticism to everyone. Pull their triggers with all the angst-filled remorse of an ice-cold hitman.</p><p>I understand the intrinsically dictatorial nature of the Rabbit People.  As I noted at AG, that is precisely why I give sensitivity-driven discourse no respect whatsoever. I don’t<br> care if you were<br> raped every day of the year and twice on Mondays by the family cat,<br> after which your father killed you with a knife and danced on your<br> grave. Your<br> personal victimization grants you neither moral authority nor<br> intellectual credibility, much less any form of veto on what others are<br> permitted<br> to think, say, or feel.  Vox Popoli will always be a bastion of heterotopic discourse; it would not be unreasonable to think of it and Alpha Game as the<br> Wild Hunt for Rabbit People.</br></br></br></br></br></br></br></br></br></p><p> Call me Herne.</p><p>UPDATE: John Scalzi helpfully underlines my point for me:   <i>“The irony of a dude griping that my blog caters to sycophants, on a<br> blog which caters to sycophants, never loses its clueless<br> deliciousness.”</br></br></i></p><p>Who is griping?  Scalzi is only doing what Rabbit People always do.  Notice the reference to a nameless “dude”.  On a nameless blog.  And note the accusation that this nameless place caters to sycophants, when the majority of the Dread Ilk of Vox Popoli, let alone the more casual readers, a) don’t belong to the same political party or ideology that I do, and b) don’t belong to the same religious denomination that I do, and c) cheerfully argue with me vociferously over everything from inflation/deflation to the limits on God’s knowledge.  If you guys are sycophants, you must be the worst sycophants in the world!</p><p>It is remarkable but not surprising that Scalzi is such a complete rabbit that he can’t even imagine a blog of this size not being sycophantic in the manner that his observably is.  For example, you will seldom see me, or anyone else, congratulating me on my “courage” for posting something.  Meanwhile, Scalzi’s posts are always an interesting race between John and his readers over who can pat him on the back more vigorously.</p><p>I will bet that on any post of over 100 comments at Whatever, one can find at least 10 comments that are amusingly sycophantic.  And I’ll bet one cannot do the same here.</p></div>",
  "content_text": "Isn’t it remarkable how this excellent\nessay on heterotopic discourse versus sensitivity-based discourse\nsounds very much like a description of two blogs for which I serve as a bête noire?\nLacking a high tolerance for difference and disagreement,\nsensitivity-driven discourses will typically manifest a herding effect.\nDissenting voices can be scapegoated or excluded and opponents will be\nsharply attacked. Unable to sustain true conversation, stale monologues\nwill take its place. Constantly pressed towards conformity,\nindoctrination can take the place of open intellectual inquiry.\nFracturing into hostile dogmatic cliques takes the place of vigorous and\nilluminating dialogue between contrasting perspectives. Lacking the\ncapacity for open dialogue, such groups will exert their influence on\nwider society primarily by means of political agitation.  The fear of conflict and the inability to deal with disagreement lies\nat the heart of sensitivity-driven discourses.\nAs bad as Pharyngula can be in its mindless groupthink regard, PZ’s focus on science tends to somewhat reduce its author’s ability to be sensitive to the feelings of others.  It doesn’t matter how many times a reader bravely confesses to having been abused by a mongoose at the age of 4, PZ isn’t going to tolerate her nonsense if she sets herself against the tenets of the current scientific consensus, whatever it happens to be at the moment.\nEven Amanda of Pandagon has more intellectual integrity, at least in this regard, than John Scalzi. His Whatever is a veritable warren of the Rabbit People, who compete for status by being more sensitive than each other.  No matter how convincingly John cringes and attempts to make himself accommodating to the ample concerns of his readership, he can never succeed because the sensitivity horizon is an ever-receding one.  I go into that aspect of the essay\nin more detail on Alpha Game\n.\nBut here, I want to focus on the vital importance of never giving the Rabbit People any entrance or respect on their terms.\nWhen these two forms of discourse collide they are frequently unable\nto understand each other and tend to bring out the worst in each other.\nThe first form of discourse seems lacking in rationality and ideological\nchallenge to the second; the second can appear cruel and devoid of\nsensitivity to the first. To those accustomed to the second mode of\ndiscourse, the cries of protest at supposedly offensive statements may\nappear to be little more than a dirty and underhand ploy intentionally\nadopted to derail the discussion by those whose ideological position\ncan’t sustain critical challenge. However, these protests are probably\nless a ploy than the normal functioning of the particular mode of\ndiscourse characteristic of that community, often the only mode of\ndiscourse that those involved are proficient in.\nTo those accustomed to the first mode of discourse, the scathing\nsatire and sharp criticism of the second appears to be a vicious and\npersonal attack, driven by a hateful animus, when those who adopt such\nmodes of discourse are typically neither personally hurt nor aiming to\ncause such hurt. Rather, as this second form of discourse demands\npersonal detachment from issues under discussion, ridicule does not aim\nto cause hurt, but to up the ante of the debate, exposing the weakness\nof the response to challenge, pushing opponents to come back with more\nsubstantial arguments or betray their lack of convincing support for\ntheir position. Within the first form of discourse, if you take offence,\nyou can close down the discourse in your favour; in the second form of\ndiscourse, if all you can do is to take offence, you have conceded the\nargument to your opponent, as offence is not meaningful currency within\nsuch discourse….\nThe power of offence and outrage was very much on display in that which\nfollowed. Those who protested that they have been offended were able to\nclose down Jared Wilson’s voice and get him to apologize, something that\nwas regarded as a victory for those prepared to attack ‘misogyny’.\nWhile I believe that Jared was right to apologize, the empowering of\noffence-takers is far from a salutary development in Christian\ndiscourse.\nSo close, and yet so far.  The author is completely wrong about how heterotopicals should engage with the Rabbit People.  There is simply nothing there to understand in the first mode of discourse, the sensitivity-based mode.  It is a binary mode of thought where there is only submission or rejection.  Jared Wilson should never, ever, have apologized; he had done nothing for which TO apologize and by apologizing, he surrendered in the eyes of the Rabbit People.  All of his arguments were rendered vain and instantly dismissed in his interlocutors’ eyes by that single act of submission.\nNever surrender to emotional manipulation.  Never back down in the face of nonexistent arguments and appeals to sensitivity and feelings.  Embrace the cruelty. Meet each demand for submission by amping up the ridicule, jacking up the humiliation, and increasing the pressure of intellectual precision.  Drive the Rabbit People out mercilessly whenever they show themselves; rest assured they are actively seeking to do the same to everyone who doesn’t submit to their never-ending demands.  Force them to expose their total inability to accept contradiction and criticism to everyone. Pull their triggers with all the angst-filled remorse of an ice-cold hitman.\nI understand the intrinsically dictatorial nature of the Rabbit People.  As I noted at AG, that is precisely why I give sensitivity-driven discourse no respect whatsoever. I don’t\ncare if you were\nraped every day of the year and twice on Mondays by the family cat,\nafter which your father killed you with a knife and danced on your\ngrave. Your\npersonal victimization grants you neither moral authority nor\nintellectual credibility, much less any form of veto on what others are\npermitted\nto think, say, or feel.  Vox Popoli will always be a bastion of heterotopic discourse; it would not be unreasonable to think of it and Alpha Game as the\nWild Hunt for Rabbit People.\nCall me Herne.\nUPDATE: John Scalzi helpfully underlines my point for me:\n“The irony of a dude griping that my blog caters to sycophants, on a\nblog which caters to sycophants, never loses its clueless\ndeliciousness.”\nWho is griping?  Scalzi is only doing what Rabbit People always do.  Notice the reference to a nameless “dude”.  On a nameless blog.  And note the accusation that this nameless place caters to sycophants, when the majority of the Dread Ilk of Vox Popoli, let alone the more casual readers, a) don’t belong to the same political party or ideology that I do, and b) don’t belong to the same religious denomination that I do, and c) cheerfully argue with me vociferously over everything from inflation/deflation to the limits on God’s knowledge.  If you guys are sycophants, you must be the worst sycophants in the world!\nIt is remarkable but not surprising that Scalzi is such a complete rabbit that he can’t even imagine a blog of this size not being sycophantic in the manner that his observably is.  For example, you will seldom see me, or anyone else, congratulating me on my “courage” for posting something.  Meanwhile, Scalzi’s posts are always an interesting race between John and his readers over who can pat him on the back more vigorously.\nI will bet that on any post of over 100 comments at Whatever, one can find at least 10 comments that are amusingly sycophantic.  And I’ll bet one cannot do the same here.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-10T14:22:00+00:00"
}