{
  "url": "https://voxday.net/2012/12/07/errata-etc/",
  "scraped_at": "2025-12-14T05:09:40.751243",
  "title": "Errata etc",
  "date_display": "December 7, 2012",
  "date_iso": "2012-12-07T01:09:00+00:00",
  "date_from_url": "2012-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Team OCD compiled a list of some 225 errata in the ebook, most of which were simple typos, for the final proof of the hardcover which went off to the printers yesterday.  That is actually pretty good in a book this size; the three EW books that were published by Pocket turned out to have over 300 combined in about the same number of words when we prepared the texts for the ebooks.  The upshot is that while I appreciate being sent the occasional typo or error spotted, it’s probably not necessary in this case as we almost surely have it identified based on those that have been sent to me thus far.</p><p>I really have to thank everyone who ordered the ebook yesterday; we assumed there would be lower first-day sales due to the preorders and the higher price of <b><i>A Throne of Bones</i></b> compared to <b><i>A Magic Broken</i></b>.  And yet, the combined total of the preorders and the Amazon orders was higher than the Amazon orders for AMB; it was nearly half again as many as I’d anticipated.</p><p>Anyhow, I hope you’re enjoying the book and encourage you to post reviews on Amazon when you finish it.  I’d also encourage you to tell others, particularly Martin fans, about it, since it’s not going to be appearing in any bookstores.  If you are enjoying it, then you’ll probably be pleased to hear that Kirk and I were discussing the cover for Book Two today; I can’t guarantee anything, but there is a chance it will be even more striking than the one for Book One.  Speaking of which, I’ve seen the final dust jacket and can confirm that the rest of the it lives up to the cover.  I think those who have gone the hardcover route won’t be disappointed; for all its size, it’s shaping up to be a very attractive book. </p><p>MJS has posted the second review; here is <a href=\"http://www.amazon.com/review/R1BKMKNVE2TNXP/ref=cm_cr_dp_title/189-4199373-2868567?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;channel=detail-glance&amp;nodeID=133140011&amp;store=digital-text\">an excerpt from it</a>:</p><p><i>The novel is more meat and substance than polish and style, though even<br> the political intrigue was well-written enough that it kept my<br> attention, which is often not the case. Vox does an excellent job of<br> piquing your interest and then taking developments in way you don’t<br> expect. He’s also not shy about killing characters, yet does so in a way<br> that again compares favorably to Mr. Martin’s nihilistic bloodbath.<br> This is not a book for children; there is graphic violence and<br> unflinching presentation of evil. Yet neither is glorified, and though<br> the world is realistically portrayed with few truly good men, there is<br> no moral ambivalence here either. </br></br></br></br></br></br></br></br></br></i></p><p>One thing that might amuse some of you is that it wasn’t until reading that review that I suddenly realized I no longer need to write a sequel to<b><i> Summa Elvetica</i></b> anymore.  I had become so accustomed to thinking of <i>Arts of Dark and Light </i>as its own creature that I actually forgot the new series can reasonably be considered the oft-requested continuation of the story begun in the shorter novel.</p></div>",
  "content_text": "Team OCD compiled a list of some 225 errata in the ebook, most of which were simple typos, for the final proof of the hardcover which went off to the printers yesterday.  That is actually pretty good in a book this size; the three EW books that were published by Pocket turned out to have over 300 combined in about the same number of words when we prepared the texts for the ebooks.  The upshot is that while I appreciate being sent the occasional typo or error spotted, it’s probably not necessary in this case as we almost surely have it identified based on those that have been sent to me thus far.\nI really have to thank everyone who ordered the ebook yesterday; we assumed there would be lower first-day sales due to the preorders and the higher price of\nA Throne of Bones\ncompared to\nA Magic Broken\n.  And yet, the combined total of the preorders and the Amazon orders was higher than the Amazon orders for AMB; it was nearly half again as many as I’d anticipated.\nAnyhow, I hope you’re enjoying the book and encourage you to post reviews on Amazon when you finish it.  I’d also encourage you to tell others, particularly Martin fans, about it, since it’s not going to be appearing in any bookstores.  If you are enjoying it, then you’ll probably be pleased to hear that Kirk and I were discussing the cover for Book Two today; I can’t guarantee anything, but there is a chance it will be even more striking than the one for Book One.  Speaking of which, I’ve seen the final dust jacket and can confirm that the rest of the it lives up to the cover.  I think those who have gone the hardcover route won’t be disappointed; for all its size, it’s shaping up to be a very attractive book.\nMJS has posted the second review; here is\nan excerpt from it\n:\nThe novel is more meat and substance than polish and style, though even\nthe political intrigue was well-written enough that it kept my\nattention, which is often not the case. Vox does an excellent job of\npiquing your interest and then taking developments in way you don’t\nexpect. He’s also not shy about killing characters, yet does so in a way\nthat again compares favorably to Mr. Martin’s nihilistic bloodbath.\nThis is not a book for children; there is graphic violence and\nunflinching presentation of evil. Yet neither is glorified, and though\nthe world is realistically portrayed with few truly good men, there is\nno moral ambivalence here either.\nOne thing that might amuse some of you is that it wasn’t until reading that review that I suddenly realized I no longer need to write a sequel to\nSumma Elvetica\nanymore.  I had become so accustomed to thinking of\nArts of Dark and Light\nas its own creature that I actually forgot the new series can reasonably be considered the oft-requested continuation of the story begun in the shorter novel.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-07T01:09:00+00:00"
}