{
  "url": "https://voxday.net/2012/12/29/free-will-and-fiction/",
  "scraped_at": "2025-12-14T22:16:16.466556",
  "title": "Free will and fiction",
  "date_display": "December 29, 2012",
  "date_iso": "2012-12-29T10:49:00+00:00",
  "date_from_url": "2012-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Duran lists the <a href=\"http://mikeduran.com/2012/12/the-top-5-cliches-used-by-christian-writers/#comment-107760\">top five cliches</a> of the Christian writer:</p><blockquote class=\"tr_bq\"><p> Having frequented Christian writing circles for some time now, I’ve<br> heard all the spiritualized slogans we believers like to regurgitate. Here’s my Top 5 clichés that Christian writers use.</br></p><div style=\"padding-left: 30px;\"> 5.) <strong>“God’s called me to write.”</strong> — <em>Funny<br> how God never “calls” Christians to be sales assistants, lay reviewers,<br> work in circulation, be an advertising manager, or write obituaries for<br> the local newspaper. You’d think that writing novels was the top of the<br> Christian publishing holiness hierarchy.</br></br></br></br></em></div><div style=\"padding-left: 30px;\"> 4.)<strong> “It just wasn’t God’s will that I… (fill in the blank).”</strong> –<em><br> “God’s will” is a favorite “out” for Christian writers. Most often, the<br> saying is followed by things like “find an agent,” “sell a lot of<br> books,” “finish the manuscript,” or “advertize aggressively.” Poor God. I<br> wish He’d get His act together so your career can finally flourish.</br></br></br></br></em></div></blockquote><p>I find the public profession of “God’s call” to be about as credible, in most circumstances, as the way in which people who recall their past lives always seem to have been some Egyptian princess or European queen; no one ever used to be a peasant girl who died of malnutrition and smallpox at the age of twelve.  It’s remarkable how often God is said to call people to do what they quite clearly want to do of their own accord.</p><p>As for God’s will, in this, as in so many things, we see the idea of divine omniderigence tends to remove both agency and accountability from the individual. </p><p>Writing fiction is, in its own small way, an act of creation.  The author is the god of his own little world, which may be why the idea of writing fiction is so much more appealing to many would-be novelists than the actual act of writing it.  And yet, even the human author, who has complete and total control over his characters, often finds his control constricted by the desire to make them behave in a self-consistent manner.</p><p>In like manner, perhaps an all-powerful God might find Himself constrained, not by any external limits on His power, but rather by His desire for artistic consistency and aesthetic integrity.</p></div>",
  "content_text": "Mike Duran lists the\ntop five cliches\nof the Christian writer:\nHaving frequented Christian writing circles for some time now, I’ve\nheard all the spiritualized slogans we believers like to regurgitate. Here’s my Top 5 clichés that Christian writers use.\n5.)\n“God’s called me to write.”\n—\nFunny\nhow God never “calls” Christians to be sales assistants, lay reviewers,\nwork in circulation, be an advertising manager, or write obituaries for\nthe local newspaper. You’d think that writing novels was the top of the\nChristian publishing holiness hierarchy.\n4.)\n“It just wasn’t God’s will that I… (fill in the blank).”\n–\n“God’s will” is a favorite “out” for Christian writers. Most often, the\nsaying is followed by things like “find an agent,” “sell a lot of\nbooks,” “finish the manuscript,” or “advertize aggressively.” Poor God. I\nwish He’d get His act together so your career can finally flourish.\nI find the public profession of “God’s call” to be about as credible, in most circumstances, as the way in which people who recall their past lives always seem to have been some Egyptian princess or European queen; no one ever used to be a peasant girl who died of malnutrition and smallpox at the age of twelve.  It’s remarkable how often God is said to call people to do what they quite clearly want to do of their own accord.\nAs for God’s will, in this, as in so many things, we see the idea of divine omniderigence tends to remove both agency and accountability from the individual.\nWriting fiction is, in its own small way, an act of creation.  The author is the god of his own little world, which may be why the idea of writing fiction is so much more appealing to many would-be novelists than the actual act of writing it.  And yet, even the human author, who has complete and total control over his characters, often finds his control constricted by the desire to make them behave in a self-consistent manner.\nIn like manner, perhaps an all-powerful God might find Himself constrained, not by any external limits on His power, but rather by His desire for artistic consistency and aesthetic integrity.",
  "tags": [
    "Christianity",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-29T10:49:00+00:00"
}