{
  "url": "https://voxday.net/2012/12/14/homeschool-or-die-part-562/",
  "scraped_at": "2025-12-14T22:15:11.922786",
  "title": "Homeschool or die, part 562",
  "date_display": "December 14, 2012",
  "date_iso": "2012-12-14T17:53:00+00:00",
  "date_from_url": "2012-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I imagine <a href=\"http://connecticut.cbslocal.com/2012/12/14/school-shooting-leaves-multiple-injured/\">the latest school shooting</a> will launch the Obama administration’s push for more useless gun control.  And yet, if they genuinely wanted to reduce the likelihood of the mass murder of schoolchildren, they would ban mass schooling.</p><blockquote class=\"tr_bq\"><p> CBS News is reporting that 27 people are dead, including <strike>14</strike>20 students,<br> after a shooting at the Sandy Hook Elementary School in Newtown. The<br> gunman is among the dead.</br></br></p></blockquote><p>Say what you will about homeschooling, but if your child is taught at home, he’s not going to be shot there by some disgruntled school employee, student, or parent.  And the idea that gun control laws will make any difference whatsoever with regards to this sort of thing is risible, given that it is already illegal to carry guns onto school property, to say nothing of shooting people there.</p><p>And this may be worth keeping in mind when the inevitable push for gun control begins: “The worst mass school murder in American history took place on May<br> 18,1927 in Bath Township, Mich., when a former school board member set<br> off three bombs that killed 45 people.”</br></br></p></div>",
  "content_text": "I imagine\nthe latest school shooting\nwill launch the Obama administration’s push for more useless gun control.  And yet, if they genuinely wanted to reduce the likelihood of the mass murder of schoolchildren, they would ban mass schooling.\nCBS News is reporting that 27 people are dead, including\n14\n20 students,\nafter a shooting at the Sandy Hook Elementary School in Newtown. The\ngunman is among the dead.\nSay what you will about homeschooling, but if your child is taught at home, he’s not going to be shot there by some disgruntled school employee, student, or parent.  And the idea that gun control laws will make any difference whatsoever with regards to this sort of thing is risible, given that it is already illegal to carry guns onto school property, to say nothing of shooting people there.\nAnd this may be worth keeping in mind when the inevitable push for gun control begins: “The worst mass school murder in American history took place on May\n18,1927 in Bath Township, Mich., when a former school board member set\noff three bombs that killed 45 people.”",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-14T17:53:00+00:00"
}