{
  "url": "https://voxday.net/2012/12/06/id-call-that-two-for-one/",
  "scraped_at": "2025-12-14T05:09:37.040759",
  "title": "I’d call that a two-for-one",
  "date_display": "December 6, 2012",
  "date_iso": "2012-12-06T14:00:00+00:00",
  "date_from_url": "2012-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>By voting for independence, Scotland <a href=\"http://www.telegraph.co.uk/news/uknews/scotland/9726289/Scotland-would-have-to-apply-to-EU-and-lose-UKs-opt-out-after-separation.html\">will automatically leave the EU</a>:</p><blockquote class=\"tr_bq\"><p> Scotland ‘would have to apply to EU and lose UK’s opt-out after separation’ Scotland would have to apply to the EU and lose the UK’s opt-out from the euro if voters back separation in the forthcoming referendum, the European Commission is claimed to have confirmed. In what would be a significant blow to Alex Salmond, the commission is said to<br> have drafted a letter to a Lords committee rejecting his claim that Scotland<br> would automatically inherit the UK’s membership.</br></br></p></blockquote><p>Of course, the European Commission is lying, as it usually does.  I guarantee you that if Scotland voted to leave the UK, the EU will claim after the fact that it is still an EU member.  These guys know they didn’t get on the fascist gravy train by forcing fewer people pay their economic protection money.</p><p>The only reason they are discouraging the Scottish vote for independence from the UK is because without the Scots, the English and Welsh Euroskeptics will have a majority.</p><p>Speaking of Scotland, you can get an interesting perspective on secession and Scottish history from <a href=\"http://www.youtube.com/watch?v=P_TSgwjtRRI\">my interview with Thom Hartmann</a> yesterday.  I’ll be posting a transcript sent in by SL soon.</p></div>",
  "content_text": "By voting for independence, Scotland\nwill automatically leave the EU\n:\nScotland ‘would have to apply to EU and lose UK’s opt-out after separation’ Scotland would have to apply to the EU and lose the UK’s opt-out from the euro if voters back separation in the forthcoming referendum, the European Commission is claimed to have confirmed. In what would be a significant blow to Alex Salmond, the commission is said to\nhave drafted a letter to a Lords committee rejecting his claim that Scotland\nwould automatically inherit the UK’s membership.\nOf course, the European Commission is lying, as it usually does.  I guarantee you that if Scotland voted to leave the UK, the EU will claim after the fact that it is still an EU member.  These guys know they didn’t get on the fascist gravy train by forcing fewer people pay their economic protection money.\nThe only reason they are discouraging the Scottish vote for independence from the UK is because without the Scots, the English and Welsh Euroskeptics will have a majority.\nSpeaking of Scotland, you can get an interesting perspective on secession and Scottish history from\nmy interview with Thom Hartmann\nyesterday.  I’ll be posting a transcript sent in by SL soon.",
  "tags": [
    "EU",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-06T14:00:00+00:00"
}