{
  "url": "https://voxday.net/2012/12/15/mailvox-free-will-and-romans-124/",
  "scraped_at": "2025-12-14T22:15:17.119287",
  "title": "Mailvox: Free will and Romans 1:24",
  "date_display": "December 15, 2012",
  "date_iso": "2012-12-15T18:00:00+00:00",
  "date_from_url": "2012-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JJ asks about an approach to omniderigence that is new to me:</p><blockquote class=\"tr_bq\"><p> I’m a long time VP reader and a believer in both God and free will<br> who has encountered the latter part of Romans 1 as an argument against<br> free will. My opponent claims that either God prevented jews before from<br> committing the various sins listed, or caused them by making them sin<br> as a punishment, when the Bible says that He gave them over to sin.</br></br></br></br></p><p>My take on the question is as follows: Paul does not explicitly state<br> that God was preventing the jews’ free will either before or after. By<br> abandoning them to their sin it simply means God gave up hope on them<br> and the sins listed after weren’t his causing nor will, and God didn’t<br> prevent them from committing the various sins listed at any time. This<br> raises the question if the listed sins were even happening only after<br> God abandoned them or did they go hand in hand with idolatry and<br> suchlike?</br></br></br></br></br></br></br></p><p>Am I twisting the Scripture to suit my wish to see free will when<br> there is none? What is your view of the latter part of Romans 1?</br></p><p>P.S. Please pardon my english if it’s clumsy, it’s not my native tongue.</p></blockquote><p> The obvious thing is to look first at the entire section, beginning with Romans 1:18 and titled “God’s Wrath Against Sinful Humanity”.  Romans 1:18-25 states:</p><p><i>“The wrath of God is being revealed from heaven against all the godlessness and wickedness of people, who suppress the truth by their wickedness, since what may be known about God is plain to them, because God has made it plain to them.  </i></p><p><i>For<br> since the creation of the world God’s invisible qualities—his eternal<br> power and divine nature—have been clearly seen, being understood from<br> what has been made, so that people are without excuse. For<br> although they knew God, they neither glorified him as God nor gave<br> thanks to him, but their thinking became futile and their foolish hearts<br> were darkened.  </br></br></br></br></br></br></i></p><p><i>Although they claimed to be wise, they became fools and exchanged the glory of the immortal God for images made to look like a mortal human being and birds and animals and reptiles. Therefore God gave them over in the sinful desires of their hearts to sexual impurity for the degrading of their bodies with one another.  They exchanged the truth about God for a lie, and worshiped and served created things rather than the Creator—who is forever praised. Amen.”</i></p><p>There are a number of interesting points raised by this passage.  First, God doesn’t treat everyone equally.  He deals with them in response to their actions.  Second, our thoughts are not always futile nor are our hearts always dark.  Third, our sinful desires are from our hearts, which are somehow distinct from God.  And fourth, this passage is indicative of the existence of free will, not evidence of its absence.</p><p>When one “gives X over to someone else”, one is not dictating their actions, one is withdrawing one’s own influence over X and permitting other influences to take precedence.  If Man had no free will, God would have nothing else to give him over to; He would simply be giving Man over to Himself.  But that would be to make God the author of the very sinful desires and wickedness that inspires His wrath. which would indicate a schizophrenic Supreme Being.</p><p>JJ’s opponent’s argument is easily dismantled because it depends upon the idea that the Jews were not committing the sins referred to in this passage prior to the giving over.  I don’t believe that to be the case, given the numerous references to sexual immorality in the Old Testament.  But the argument is also erroneous on the basis of the passage itself, as I suspect even some of those belonging to Team Calvin will agree.</p></div>",
  "content_text": "JJ asks about an approach to omniderigence that is new to me:\nI’m a long time VP reader and a believer in both God and free will\nwho has encountered the latter part of Romans 1 as an argument against\nfree will. My opponent claims that either God prevented jews before from\ncommitting the various sins listed, or caused them by making them sin\nas a punishment, when the Bible says that He gave them over to sin.\nMy take on the question is as follows: Paul does not explicitly state\nthat God was preventing the jews’ free will either before or after. By\nabandoning them to their sin it simply means God gave up hope on them\nand the sins listed after weren’t his causing nor will, and God didn’t\nprevent them from committing the various sins listed at any time. This\nraises the question if the listed sins were even happening only after\nGod abandoned them or did they go hand in hand with idolatry and\nsuchlike?\nAm I twisting the Scripture to suit my wish to see free will when\nthere is none? What is your view of the latter part of Romans 1?\nP.S. Please pardon my english if it’s clumsy, it’s not my native tongue.\nThe obvious thing is to look first at the entire section, beginning with Romans 1:18 and titled “God’s Wrath Against Sinful Humanity”.  Romans 1:18-25 states:\n“The wrath of God is being revealed from heaven against all the godlessness and wickedness of people, who suppress the truth by their wickedness, since what may be known about God is plain to them, because God has made it plain to them.\nFor\nsince the creation of the world God’s invisible qualities—his eternal\npower and divine nature—have been clearly seen, being understood from\nwhat has been made, so that people are without excuse. For\nalthough they knew God, they neither glorified him as God nor gave\nthanks to him, but their thinking became futile and their foolish hearts\nwere darkened.\nAlthough they claimed to be wise, they became fools and exchanged the glory of the immortal God for images made to look like a mortal human being and birds and animals and reptiles. Therefore God gave them over in the sinful desires of their hearts to sexual impurity for the degrading of their bodies with one another.  They exchanged the truth about God for a lie, and worshiped and served created things rather than the Creator—who is forever praised. Amen.”\nThere are a number of interesting points raised by this passage.  First, God doesn’t treat everyone equally.  He deals with them in response to their actions.  Second, our thoughts are not always futile nor are our hearts always dark.  Third, our sinful desires are from our hearts, which are somehow distinct from God.  And fourth, this passage is indicative of the existence of free will, not evidence of its absence.\nWhen one “gives X over to someone else”, one is not dictating their actions, one is withdrawing one’s own influence over X and permitting other influences to take precedence.  If Man had no free will, God would have nothing else to give him over to; He would simply be giving Man over to Himself.  But that would be to make God the author of the very sinful desires and wickedness that inspires His wrath. which would indicate a schizophrenic Supreme Being.\nJJ’s opponent’s argument is easily dismantled because it depends upon the idea that the Jews were not committing the sins referred to in this passage prior to the giving over.  I don’t believe that to be the case, given the numerous references to sexual immorality in the Old Testament.  But the argument is also erroneous on the basis of the passage itself, as I suspect even some of those belonging to Team Calvin will agree.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-15T18:00:00+00:00"
}