{
  "url": "https://voxday.net/2012/12/16/mailvox-utility-of-rhetoric/",
  "scraped_at": "2025-12-14T22:15:18.955109",
  "title": "Mailvox: the utility of rhetoric",
  "date_display": "December 16, 2012",
  "date_iso": "2012-12-16T12:22:00+00:00",
  "date_from_url": "2012-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NorthernHamlet objects to the rhetoric inherent in the post <a href=\"http://www.milobookclub.com/2012/12/14/homeschool-or-die-part-562/\">Homeschool or Die</a>.  He writes, in response to my explanation:</p><blockquote class=\"tr_bq\"><p> <b>“Trying to talk about big pictures or summoning statistics is about<br> as relevant as reciting the Iliad. [Rhetoric] is not petty politics or point<br> scoring, it is the only possible form of dialogue.”</br></br></b></p><p>We both can run through this line of thinking easily.</p><p>Your<br> public audience, at least some of it, knows you could have it both ways<br> in a blog post, the rhetorical argument, the statistical reality,<br> and the meta-argument. You yourself admit that the situation has already<br> been politicized; suggesting that you are purposefully furthering that<br> politicization process for argumentative gain, and nothing more. You can<br> claim all day that the only audience you care about is your own (a<br> claim easily disputed) or however you choose to put it, but from an<br> outside perspective, the post comes off as extremely petty.</br></br></br></br></br></br></br></br></p><p>I’m<br> sure more of your public audience than you realize would appreciate both<br> the amusing rhetoric you are known for and which I’m sure sells books<br> and gains site traffic in addition to the insightful observations you<br> are equally known for peppered in to the post as opposed to the<br> comments; leaving room for even better conversation in the thread.</br></br></br></br></br></p></blockquote><p>How the rhetoric in the relevant post comes off to conventionally-thinking conservatives who happen agree with me on the issue of the primacy of gun rights is totally irrelevant, not only to me, but to the argument.  I mean, I harbor very little concern for what most people think anyhow, as per MPAI, but the group whose opinion least concerns me is the most rhetorically impotent and argumentatively challenged group in American political discourse today.</p><p>It tends to remind me of those who used to insist that Ann Coulter would be more “effective” if she was only nicer and less strident.  Never mind that no one would have heard of her or that she didn’t really have a whole lot to say other than ruthlessly pointing out the hypocrisy and malicious intent of the American Left.</p><p>First, note that the post was linked to by Instapundit.  Why?  Because Instapundit recognizes an effective rhetorical argument when he sees one even though <a href=\"http://www.usatoday.com/story/opinion/2012/12/14/connecticut-school-shooting-gun-control/1770345/\">his primary public response was dialectic</a>.  Does anyone think that his perfectly rational, perfectly correct argument about the false sense of security provided by gun-free zones will have any effect whatsoever on the minds of women who are posturing about how hard they are crying and how they are “hugging them close today”?</p><p>Of course not.  The dialectic cannot reach the rhetorically-minded.  Yes, it is logical nonsense to say “if you do not homeschool your children, they will die”, just as it is nonsense to say “because one crazy individual shot 27 people, we must forcibly seize 300 million privately owned firearms that prevent government tyranny.”  And yet, these logically nonsensical rhetorical arguments that shamelessly play upon the emotions of individuals are the only ones that the majority – the majority –  of the electorate find credible and convincing.  And so they must be made.</p><p>Is this rhetorical assertion a genuine surprise to NorthernHamlet or anyone else: “Standing up to the gun lobby is the best way to honour the innocent victims.”  If so, it shouldn’t be.  This is hardly our first shooting-inspired gun control rodeo.  In the past, the pro-control crowd reaped a rhetorical harvest in the early days while the pro-freedom crowd remained silent out of fear of politicizing the tragedy or limited itself to weakly protesting in a dialectical manner.  Those days are done.  We know the drill.</p><p>As I’ve already explained, any argument that focuses on the rhetorical aspect of “homeschool or die” can be easily turned against the rhetorical arguments made by the other side.  That is the power of the meta-argument that utilizes both rhetorical and dialectical arguments; the other side can either lose on rhetorical grounds, or, after attacking the rhetoric and stripping itself of its own rhetorical arguments, lose on the more substantial dialectic grounds.</p><p>There is nothing petty about it; to claim that it is petty is to fundamentally miss the point that the argument being won and lost on petty grounds because it is mostly being fought on ground that primarily consists of petty little minds.</p></div>",
  "content_text": "NorthernHamlet objects to the rhetoric inherent in the post\nHomeschool or Die\n.  He writes, in response to my explanation:\n“Trying to talk about big pictures or summoning statistics is about\nas relevant as reciting the Iliad. [Rhetoric] is not petty politics or point\nscoring, it is the only possible form of dialogue.”\nWe both can run through this line of thinking easily.\nYour\npublic audience, at least some of it, knows you could have it both ways\nin a blog post, the rhetorical argument, the statistical reality,\nand the meta-argument. You yourself admit that the situation has already\nbeen politicized; suggesting that you are purposefully furthering that\npoliticization process for argumentative gain, and nothing more. You can\nclaim all day that the only audience you care about is your own (a\nclaim easily disputed) or however you choose to put it, but from an\noutside perspective, the post comes off as extremely petty.\nI’m\nsure more of your public audience than you realize would appreciate both\nthe amusing rhetoric you are known for and which I’m sure sells books\nand gains site traffic in addition to the insightful observations you\nare equally known for peppered in to the post as opposed to the\ncomments; leaving room for even better conversation in the thread.\nHow the rhetoric in the relevant post comes off to conventionally-thinking conservatives who happen agree with me on the issue of the primacy of gun rights is totally irrelevant, not only to me, but to the argument.  I mean, I harbor very little concern for what most people think anyhow, as per MPAI, but the group whose opinion least concerns me is the most rhetorically impotent and argumentatively challenged group in American political discourse today.\nIt tends to remind me of those who used to insist that Ann Coulter would be more “effective” if she was only nicer and less strident.  Never mind that no one would have heard of her or that she didn’t really have a whole lot to say other than ruthlessly pointing out the hypocrisy and malicious intent of the American Left.\nFirst, note that the post was linked to by Instapundit.  Why?  Because Instapundit recognizes an effective rhetorical argument when he sees one even though\nhis primary public response was dialectic\n.  Does anyone think that his perfectly rational, perfectly correct argument about the false sense of security provided by gun-free zones will have any effect whatsoever on the minds of women who are posturing about how hard they are crying and how they are “hugging them close today”?\nOf course not.  The dialectic cannot reach the rhetorically-minded.  Yes, it is logical nonsense to say “if you do not homeschool your children, they will die”, just as it is nonsense to say “because one crazy individual shot 27 people, we must forcibly seize 300 million privately owned firearms that prevent government tyranny.”  And yet, these logically nonsensical rhetorical arguments that shamelessly play upon the emotions of individuals are the only ones that the majority – the majority –  of the electorate find credible and convincing.  And so they must be made.\nIs this rhetorical assertion a genuine surprise to NorthernHamlet or anyone else: “Standing up to the gun lobby is the best way to honour the innocent victims.”  If so, it shouldn’t be.  This is hardly our first shooting-inspired gun control rodeo.  In the past, the pro-control crowd reaped a rhetorical harvest in the early days while the pro-freedom crowd remained silent out of fear of politicizing the tragedy or limited itself to weakly protesting in a dialectical manner.  Those days are done.  We know the drill.\nAs I’ve already explained, any argument that focuses on the rhetorical aspect of “homeschool or die” can be easily turned against the rhetorical arguments made by the other side.  That is the power of the meta-argument that utilizes both rhetorical and dialectical arguments; the other side can either lose on rhetorical grounds, or, after attacking the rhetoric and stripping itself of its own rhetorical arguments, lose on the more substantial dialectic grounds.\nThere is nothing petty about it; to claim that it is petty is to fundamentally miss the point that the argument being won and lost on petty grounds because it is mostly being fought on ground that primarily consists of petty little minds.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-16T12:22:00+00:00"
}