{
  "url": "https://voxday.net/2012/12/02/manning-vs-brady/",
  "scraped_at": "2025-12-14T05:09:16.967831",
  "title": "Manning vs Brady",
  "date_display": "December 2, 2012",
  "date_iso": "2012-12-02T12:22:00+00:00",
  "date_from_url": "2012-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Sports Guy <a href=\"http://www.grantland.com/story/_/id/8694627/the-year-living-cautiously\">considers the question</a> posed by a reader:</p><blockquote class=\"tr_bq\"><p> “Two months from now, it’s very possible Tom Brady will have 3 NFL<br> MVPs, 6 Super Bowl appearances and 4 rings. Wouldn’t that clinch him as<br> the greatest QB of all time? It’s just as possible that two months from<br> now, Peyton Manning will have 5 NFL MVPs, 3 Super Bowl appearances, 2<br> rings (and may have even just beaten his brother in the long-awaited<br> Manning Bowl). That would pretty much lock Peyton up as the greatest QB<br> of all time, wouldn’t it? Has there ever been another season where the<br> Greatest of All Time title was up for grabs like this? For any position?<br> In any sport?”</br></br></br></br></br></br></br></br></p><p>For one thing, it’s neat that we’re even here after what Manning went through these past 18 months. When I wrote about the <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmonsnfl2010/week18picks&amp;sportCat=nfl\" rel=\"noopener\" target=\"new\">Manning-Brady rivalry in January of 2011</a>,<br> right before the playoffs, their unofficial championship belt was<br> seemingly hinging on the events of that month … and within a year,<br> suddenly it seemed like Brady had a chance to grab the belt without any<br> resistance from Manning. Now it’s an argument again. I’d disagree with<br> Eric on one point: We’re not even close to resolving it. Quarterbacks<br> are like NBA players — we don’t have any idea how long their careers<br> will last anymore (especially now that all these rules are in place to<br> protect their safety). Could Brady play until he’s … 42? Forty-three?<br> Who knows? Could Kobe Bryant score 40,000 points? Who knows? I’m<br> prepared for anything this decade.</br></br></br></br></br></br></br></br></br></br></p><p>Anyway, I don’t think Brady or Manning can clinch anything yet other<br> than the “Who did the best job of antagonizing his loyal fans by wearing<br> hats of hated baseball teams and appearing in commercials that would<br> have earned real scorn had it been anyone else?” (Brady clinched this<br> years ago) and “Whose forehead can turn the reddest when he wears his<br> helmet too long?” battle (Manning clinched this during this first game).</br></br></br></br></br></p></blockquote><p>As much as it pains me to say it, (because I loathed his team at the time), I don’t think either Brady or Manning is the greatest quarterback of all time.  I don’t think it is even close. I think the title clearly belongs to Joe Montana, who would have easily picked up a fifth Super Bowl ring in 1994 had Steve Young not been awarded the starting job by virtue of being more mobile and five years younger.  I’ve watched the game for more than 35 years now, and Montana is still the quarterback that I feared most as a Vikings fan.</p><p>Sure, having Jerry Rice helped, but what made Montana great was the way he always delivered the ball where Jerry Rice could continue running at full speed when he caught the ball.  Watching Christian Ponder repeatedly deliver balls where Percy Harvin can’t keep running in stride should be enough to convince anyone that Montana aided Rice more than Rice aided Montana.  (And yes, as a matter of fact, it is painful to watch Drew Brees and RG3 tear up the league while Ponder rolls out, can’t see anything if his first read is covered, and dumps the ball off to his outlet receiver for the 17th time in a row.  Thank you for asking.)</p><p>Concerning who is the better quarterback, it depends upon whether you are focused on the athlete as an individual performer or an athlete as a member of the team.  Peyton Manning is the superior individual performer, probably has a higher football IQ and modestly better physical talents, but Tom Brady is the better team leader and superior team player.  Between the two of them, if I was to choose one of the two quarterbacks in his prime around whom to build a team, it would be Brady.</p></div>",
  "content_text": "The Sports Guy\nconsiders the question\nposed by a reader:\n“Two months from now, it’s very possible Tom Brady will have 3 NFL\nMVPs, 6 Super Bowl appearances and 4 rings. Wouldn’t that clinch him as\nthe greatest QB of all time? It’s just as possible that two months from\nnow, Peyton Manning will have 5 NFL MVPs, 3 Super Bowl appearances, 2\nrings (and may have even just beaten his brother in the long-awaited\nManning Bowl). That would pretty much lock Peyton up as the greatest QB\nof all time, wouldn’t it? Has there ever been another season where the\nGreatest of All Time title was up for grabs like this? For any position?\nIn any sport?”\nFor one thing, it’s neat that we’re even here after what Manning went through these past 18 months. When I wrote about the\nManning-Brady rivalry in January of 2011\n,\nright before the playoffs, their unofficial championship belt was\nseemingly hinging on the events of that month … and within a year,\nsuddenly it seemed like Brady had a chance to grab the belt without any\nresistance from Manning. Now it’s an argument again. I’d disagree with\nEric on one point: We’re not even close to resolving it. Quarterbacks\nare like NBA players — we don’t have any idea how long their careers\nwill last anymore (especially now that all these rules are in place to\nprotect their safety). Could Brady play until he’s … 42? Forty-three?\nWho knows? Could Kobe Bryant score 40,000 points? Who knows? I’m\nprepared for anything this decade.\nAnyway, I don’t think Brady or Manning can clinch anything yet other\nthan the “Who did the best job of antagonizing his loyal fans by wearing\nhats of hated baseball teams and appearing in commercials that would\nhave earned real scorn had it been anyone else?” (Brady clinched this\nyears ago) and “Whose forehead can turn the reddest when he wears his\nhelmet too long?” battle (Manning clinched this during this first game).\nAs much as it pains me to say it, (because I loathed his team at the time), I don’t think either Brady or Manning is the greatest quarterback of all time.  I don’t think it is even close. I think the title clearly belongs to Joe Montana, who would have easily picked up a fifth Super Bowl ring in 1994 had Steve Young not been awarded the starting job by virtue of being more mobile and five years younger.  I’ve watched the game for more than 35 years now, and Montana is still the quarterback that I feared most as a Vikings fan.\nSure, having Jerry Rice helped, but what made Montana great was the way he always delivered the ball where Jerry Rice could continue running at full speed when he caught the ball.  Watching Christian Ponder repeatedly deliver balls where Percy Harvin can’t keep running in stride should be enough to convince anyone that Montana aided Rice more than Rice aided Montana.  (And yes, as a matter of fact, it is painful to watch Drew Brees and RG3 tear up the league while Ponder rolls out, can’t see anything if his first read is covered, and dumps the ball off to his outlet receiver for the 17th time in a row.  Thank you for asking.)\nConcerning who is the better quarterback, it depends upon whether you are focused on the athlete as an individual performer or an athlete as a member of the team.  Peyton Manning is the superior individual performer, probably has a higher football IQ and modestly better physical talents, but Tom Brady is the better team leader and superior team player.  Between the two of them, if I was to choose one of the two quarterbacks in his prime around whom to build a team, it would be Brady.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-02T12:22:00+00:00"
}