{
  "url": "https://voxday.net/2012/12/29/nebulagate-2012-winner-responds/",
  "scraped_at": "2025-12-14T22:16:19.771800",
  "title": "NebulaGate: the 2012 winner responds",
  "date_display": "December 29, 2012",
  "date_iso": "2012-12-29T16:48:00+00:00",
  "date_from_url": "2012-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jo Walton, winner of the 2012 Best Novel Award for <a href=\"http://www.amazon.com/Among-Others-Jo-Walton/dp/0765331721/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1356799144&amp;sr=1-1&amp;keywords=Among+Others\">Among Others</a>, writes <a href=\"http://www.blackgate.com/2012/12/27/sff-corruption-part-i/\">at Black Gate</a>: <i>“I am not a member of SFWA and never have been.  I think that disposes of your accusations of my logrolling for a Nebula.”</i></p><p>I responded<i> </i>thusly: <b>“I never made any such accusation. Furthermore, your non-membership in SFWA says absolutely nothing about the possibility of others logrolling on your behalf, especially given that the nomination process was a closed one. The fact that your book was published by Tor Books is enough to make<br> its Nebula Award suspicious on its face, given that the SFWA President<br> and Vice-President are both closely associated with Tor.</br></br></b><br> <b><br/></b><br> <b>Dating back to its first Nebula nomination in 1986, Tor Books has<br> accounted for 24.4% of all Nebula Best Novel nominations.  No other<br> publisher has even half that many.</br></br></b><br> <b><br/></b><br> <b>Now, it is certainly possible that Tor is simply an excellent<br> publisher.  However, given the unusually heavy involvement of its<br> authors in the awards process, their representation in the<br> organization’s offices and the confirmed logrolling in the recent past,<br> logic suggests that Tor has been gaming the awards system for a<br> long time.  In 1990, for example, 5 of 6 Nebula-nominated novels were published<br> by Tor.  Only 2 of 5 Hugo-nominated novels and 1 of 5 World Fantasy<br> Award-nominated novels were.”</br></br></br></br></br></br></br></b></br></br></br></br></p><p>I have not yet read <i>Among Others</i>, so I cannot say that its victory over China Mieville’s <i>Embassytown </i>was unjustified.  I will read it, review it, and opine on the matter in January.  I don’t have to read it to know that it merited beating out George Martin’s <i>A Dance with Dragons</i>, and is not Ms Walton’s fault that her affiliation with Tor Books renders her award suspicious in a way that it would not have been if it had been published by another, less-decorated publisher.  That being said, the reviews of her book indicate that readers who read the book after hearing of its award-winning status tended to find it to be less than expected, a pattern that has been observed with past Best Novel-winners whose awards are known to be questionable.</p></div>",
  "content_text": "Jo Walton, winner of the 2012 Best Novel Award for\nAmong Others\n, writes\nat Black Gate\n:\n“I am not a member of SFWA and never have been.  I think that disposes of your accusations of my logrolling for a Nebula.”\nI responded\nthusly:\n“I never made any such accusation. Furthermore, your non-membership in SFWA says absolutely nothing about the possibility of others logrolling on your behalf, especially given that the nomination process was a closed one. The fact that your book was published by Tor Books is enough to make\nits Nebula Award suspicious on its face, given that the SFWA President\nand Vice-President are both closely associated with Tor.\nDating back to its first Nebula nomination in 1986, Tor Books has\naccounted for 24.4% of all Nebula Best Novel nominations.  No other\npublisher has even half that many.\nNow, it is certainly possible that Tor is simply an excellent\npublisher.  However, given the unusually heavy involvement of its\nauthors in the awards process, their representation in the\norganization’s offices and the confirmed logrolling in the recent past,\nlogic suggests that Tor has been gaming the awards system for a\nlong time.  In 1990, for example, 5 of 6 Nebula-nominated novels were published\nby Tor.  Only 2 of 5 Hugo-nominated novels and 1 of 5 World Fantasy\nAward-nominated novels were.”\nI have not yet read\nAmong Others\n, so I cannot say that its victory over China Mieville’s\nEmbassytown\nwas unjustified.  I will read it, review it, and opine on the matter in January.  I don’t have to read it to know that it merited beating out George Martin’s\nA Dance with Dragons\n, and is not Ms Walton’s fault that her affiliation with Tor Books renders her award suspicious in a way that it would not have been if it had been published by another, less-decorated publisher.  That being said, the reviews of her book indicate that readers who read the book after hearing of its award-winning status tended to find it to be less than expected, a pattern that has been observed with past Best Novel-winners whose awards are known to be questionable.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-29T16:48:00+00:00"
}