{
  "url": "https://voxday.net/2012/12/20/preach-it-brother-kar/",
  "scraped_at": "2025-12-14T22:15:42.321098",
  "title": "Preach it, brother Karl",
  "date_display": "December 20, 2012",
  "date_iso": "2012-12-20T14:00:00+00:00",
  "date_from_url": "2012-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl thunders from the metaphorical pulpit about <a href=\"http://market-ticker.org/akcs-www?post=215107\">the shameless hypocrisy</a> of the anti-gun elite:</p><blockquote class=\"tr_bq\"><p> If you believe that you have a right to life because your creator<br> endowed you with that right, and that this right is unalienable and thus<br> cannot be taken from you (although it can certainly be disrespected!)<br> then it follows that you have not only the right <b><i>but the responsibility</i></b> to defend your life.  That is, you have the right <b><i>and the responsibility</i></b> to deter to the best of your ability any other person who would take your life from you.</br></br></br></p><p>You may choose to delegate this responsibility to others, as Mayor Bloomberg and President Obama have, <b>but your right to life is not inferior to theirs.</b> <br> It is equal.  President Obama has no more right to live than you do. <br> You are his equal from the standpoint of what your creator, and his<br> creator, endowed both of you with. So we have established that you<br> have the right to live, as does the President.  And if the President<br> has the right to defend his life with deadly force, <b><i>and indeed the responsibility to do so</i></b>, then, should it be necessary, so do you.</br></br></br></br></br></p><p><b>This<br> debate should end right there.  Up until all of these people in<br> political office disband their police forces, their Secret Service<br> details, throw down their own arms, armored cars, body armor and other<br> defensive means of interdicting assault they have <i>nothing</i> — not even a moral argument — behind them in their demand that you disarm and become an intentional victim — <i>no matter who you are.</i></br></br></br></br></b></p></blockquote><p><b><i></i></b>That is true.  That is truth.  As I said in my column last week, if you do not stand up for the right of the American to keep and bear arms, you are not an American.  You are not an adult.  If it weren’t for the genetics involved, you cannot even be considered <i>Homo sapiens sapiens</i>, because you are admittedly and consciously rejecting your God-given and unalienable rights as a human being.</p></div>",
  "content_text": "Karl thunders from the metaphorical pulpit about\nthe shameless hypocrisy\nof the anti-gun elite:\nIf you believe that you have a right to life because your creator\nendowed you with that right, and that this right is unalienable and thus\ncannot be taken from you (although it can certainly be disrespected!)\nthen it follows that you have not only the right\nbut the responsibility\nto defend your life.  That is, you have the right\nand the responsibility\nto deter to the best of your ability any other person who would take your life from you.\nYou may choose to delegate this responsibility to others, as Mayor Bloomberg and President Obama have,\nbut your right to life is not inferior to theirs.\nIt is equal.  President Obama has no more right to live than you do.\nYou are his equal from the standpoint of what your creator, and his\ncreator, endowed both of you with. So we have established that you\nhave the right to live, as does the President.  And if the President\nhas the right to defend his life with deadly force,\nand indeed the responsibility to do so\n, then, should it be necessary, so do you.\nThis\ndebate should end right there.  Up until all of these people in\npolitical office disband their police forces, their Secret Service\ndetails, throw down their own arms, armored cars, body armor and other\ndefensive means of interdicting assault they have\nnothing\n— not even a moral argument — behind them in their demand that you disarm and become an intentional victim —\nno matter who you are.\nThat is true.  That is truth.  As I said in my column last week, if you do not stand up for the right of the American to keep and bear arms, you are not an American.  You are not an adult.  If it weren’t for the genetics involved, you cannot even be considered\nHomo sapiens sapiens\n, because you are admittedly and consciously rejecting your God-given and unalienable rights as a human being.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-20T14:00:00+00:00"
}