{
  "url": "https://voxday.net/2012/12/13/retrophobia-in-sff/",
  "scraped_at": "2025-12-14T22:15:08.253034",
  "title": "Retrophobia in SF/F",
  "date_display": "December 13, 2012",
  "date_iso": "2012-12-13T22:56:00+00:00",
  "date_from_url": "2012-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I respond to a John C. Wright essay on what he terms retrophobia and how it has crippled the third generation of fantasy writers:</p><blockquote class=\"tr_bq\"><p> This theory of literary retrophobia explains why so many mediocre<br> writers like Terry Brooks, JK Rowling, and John Scalzi, and even<br> genuinely entertaining writers such as Charles Stross, exhibit such a<br> powerful inclination for rewriting the works of earlier, more original<br> writers, not only mimicking their styles, but downright strip-mining<br> their works for ideas, settings, and even basic plots.</br></br></br></br></br></p><p>For example, I enjoyed <i>The Sword of Shannara</i> when I was in high<br> school, for example.  Yes, it was a mediocre imitation of Tolkien, but<br> it had its moments and it was a preferable alternative to re-reading <i>The Silmarillion</i> for the third time.  But after struggling through <i>The Elfstones of Shannara</i><br> and only making it about a chapter into the third book in the series, I<br> gave it up.  I tried again about twenty years later and didn’t even<br> make it that far.</br></br></br></br></br></p><p>The reason, I belatedly realized, was that without the benefit of<br> working from Tolkien’s template, Brooks simply didn’t know how to write a<br> fantasy tale capable of holding the reader’s interest.  He’s not a bad<br> writer; his Demon books weren’t bad.  But he simply didn’t have any of<br> the deep roots in history or myth that the great genre writers of the<br> past did, and the shallowness crippled the quality of his storytelling.</br></br></br></br></br></p></blockquote><p>Read the rest <a href=\"http://alphagameplan.blogspot.ch/2012/12/the-incompetence-of-third-wave-fantasy.html\">at Alpha Game</a>.  It’s not related to intersexual relations, but that’s where this got started, so that’s why I posted it there.</p></div>",
  "content_text": "In which I respond to a John C. Wright essay on what he terms retrophobia and how it has crippled the third generation of fantasy writers:\nThis theory of literary retrophobia explains why so many mediocre\nwriters like Terry Brooks, JK Rowling, and John Scalzi, and even\ngenuinely entertaining writers such as Charles Stross, exhibit such a\npowerful inclination for rewriting the works of earlier, more original\nwriters, not only mimicking their styles, but downright strip-mining\ntheir works for ideas, settings, and even basic plots.\nFor example, I enjoyed\nThe Sword of Shannara\nwhen I was in high\nschool, for example.  Yes, it was a mediocre imitation of Tolkien, but\nit had its moments and it was a preferable alternative to re-reading\nThe Silmarillion\nfor the third time.  But after struggling through\nThe Elfstones of Shannara\nand only making it about a chapter into the third book in the series, I\ngave it up.  I tried again about twenty years later and didn’t even\nmake it that far.\nThe reason, I belatedly realized, was that without the benefit of\nworking from Tolkien’s template, Brooks simply didn’t know how to write a\nfantasy tale capable of holding the reader’s interest.  He’s not a bad\nwriter; his Demon books weren’t bad.  But he simply didn’t have any of\nthe deep roots in history or myth that the great genre writers of the\npast did, and the shallowness crippled the quality of his storytelling.\nRead the rest\nat Alpha Game\n.  It’s not related to intersexual relations, but that’s where this got started, so that’s why I posted it there.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-13T22:56:00+00:00"
}