{
  "url": "https://voxday.net/2012/12/12/secession-fever-spreads/",
  "scraped_at": "2025-12-14T22:14:58.471527",
  "title": "Secession fever spreads",
  "date_display": "December 12, 2012",
  "date_iso": "2012-12-12T14:31:00+00:00",
  "date_from_url": "2012-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or, in this case, merely <a href=\"http://blogs.the-american-interest.com/wrm/2012/12/08/spain-reignites-catalan-secession-drive/\">intensifies</a>:</p><blockquote class=\"tr_bq\"><p> Catalonia’s push for independence from Spain received some unexpected<br> help this week: the Spanish minister of education proposed an attack on<br> the system of Catalan-only instruction in core courses in the school<br> curriculum. The <i>FT</i> <a href=\"http://www.ft.com/intl/cms/s/0/116346aa-3f9f-11e2-b2ce-00144feabdc0.html#axzz2E9jJxifU\">reports</a>:</br></br></br></p><blockquote><p> <i>Under the current “immersion” programme used in<br> Catalonia, all core subjects are taught in Catalan. Primary<br> schoolchildren study Spanish for three hours a week, similar to the time<br> dedicated to a foreign language, such as English. Under Mr Wert’s plans, any region that cannot satisfy the wish of<br> parents who want their children taught core subjects in Spanish, would<br> have to meet the costs of that child being educated privately.</br></br></br></br></br></i></p></blockquote><p>The Education Minister’s proposition to “establish parity” between<br> Spanish and Catalan has predictably sparked a backlash and inspired<br> secessionist sentiment:</br></br></p></blockquote><p>When one considers how many empires have fallen apart since the end of World War II, and that the Union of the current United States was imposed by force, it should not come as any surprise that support for secession will continue to grow throughout America as the economy worsens and the divisions between American culture and the immigrant cultures widen.</p><p>This is particularly true given that the union between Spain and Catalonia is older than the United States union, and unlike the younger unionn, was not imposed through violence.</p></div>",
  "content_text": "Or, in this case, merely\nintensifies\n:\nCatalonia’s push for independence from Spain received some unexpected\nhelp this week: the Spanish minister of education proposed an attack on\nthe system of Catalan-only instruction in core courses in the school\ncurriculum. The\nFT\nreports\n:\nUnder the current “immersion” programme used in\nCatalonia, all core subjects are taught in Catalan. Primary\nschoolchildren study Spanish for three hours a week, similar to the time\ndedicated to a foreign language, such as English. Under Mr Wert’s plans, any region that cannot satisfy the wish of\nparents who want their children taught core subjects in Spanish, would\nhave to meet the costs of that child being educated privately.\nThe Education Minister’s proposition to “establish parity” between\nSpanish and Catalan has predictably sparked a backlash and inspired\nsecessionist sentiment:\nWhen one considers how many empires have fallen apart since the end of World War II, and that the Union of the current United States was imposed by force, it should not come as any surprise that support for secession will continue to grow throughout America as the economy worsens and the divisions between American culture and the immigrant cultures widen.\nThis is particularly true given that the union between Spain and Catalonia is older than the United States union, and unlike the younger unionn, was not imposed through violence.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-12T14:31:00+00:00"
}