{
  "url": "https://voxday.net/2012/12/30/sfwa-coverup-is-piled-deeper/",
  "scraped_at": "2025-12-14T22:16:25.296180",
  "title": "An SFWA coverup?",
  "date_display": "December 30, 2012",
  "date_iso": "2012-12-30T18:01:00+00:00",
  "date_from_url": "2012-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Former SFWA president Michael Capobianco denies that the Nebula Award rules were changed in 2010 due to a perception of corruption.  He writes <a href=\"http://www.blackgate.com/2012/12/27/sff-corruption-part-i/\">on Black Gate</a>:</p><p><b>“The Nebula rules change was instituted not because of the<br> perception of corruption, but to change it from an award with multi-year<br> rolling eligibility to an annual award coinciding with calendar year.”</br></br></b></p><p>Is that so?  Then why are the nominations no longer an open process and hidden from public scrutiny?  Why are nominations now capped at five per member when previously Active members were allowed unlimited recommendations?  And, if we are to take Mr. Capobianco’s explanation seriously, how on Earth were those two changes required <i>in<br> order to make the award coincide with the calendar year?</br></i></p><p>Since Mr. Capobianco claims that there is no issue of perceived corruption, I will send a request to the current President to post the full record of all the nominations for the 2012 Nebula Award for Best Novel on the SFWA web site on a page that is open to the public.</p></div>",
  "content_text": "Former SFWA president Michael Capobianco denies that the Nebula Award rules were changed in 2010 due to a perception of corruption.  He writes\non Black Gate\n:\n“The Nebula rules change was instituted not because of the\nperception of corruption, but to change it from an award with multi-year\nrolling eligibility to an annual award coinciding with calendar year.”\nIs that so?  Then why are the nominations no longer an open process and hidden from public scrutiny?  Why are nominations now capped at five per member when previously Active members were allowed unlimited recommendations?  And, if we are to take Mr. Capobianco’s explanation seriously, how on Earth were those two changes required\nin\norder to make the award coincide with the calendar year?\nSince Mr. Capobianco claims that there is no issue of perceived corruption, I will send a request to the current President to post the full record of all the nominations for the 2012 Nebula Award for Best Novel on the SFWA web site on a page that is open to the public.",
  "tags": [
    "trainwreck",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-30T18:01:00+00:00"
}