{
  "url": "https://voxday.net/2012/12/11/stay-on-targe/",
  "scraped_at": "2025-12-14T22:14:56.631751",
  "title": "Stay on target",
  "date_display": "December 11, 2012",
  "date_iso": "2012-12-11T17:06:00+00:00",
  "date_from_url": "2012-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been trying to keep this rant by a perceptive reviewer of <a href=\"http://www.amazon.com/review/R2MY9DZ9TESJY8/ref=cm_cr_pr_viewpnt#R2MY9DZ9TESJY8\"><i>A Storm of Swords</i></a> in mind as I begin writing Book Two in ARTS OF DARK AND LIGHT:</p><blockquote class=\"tr_bq\"><p> My third and final gripe remains roughly the same as it was with the first two books and is, in a nutshell, this: too damned long. Forget the page count; Martin’s writing is good enough to read for ten thousand pages, I mean that he’s taking too long to get to the point. This third installment of the series ends in a quick succession of highpoints. It’s meant to build interest and steam going into the fourth, which it does (frustratingly so, given the time between releases). But most of the third book, like most of the second and the first before it, are build up. Three thousand pages of build up are simply not welcome, and certainly not in the face of a projected three thousand to come. There was even a point, somewhere near page 600 of this book, where I started to question my investment. After all, do I have any assurance that the next book, or the book after, will offer any satisfaction? How long will I have to wait, exactly, for any sort of a sense of closure on anything? How good is Martin’s heart? His cholesterol count? Blood sugar? I suppose, on the bright side, that this series helps a person develop their patience and endurance. But, I’ll tell you, couple this with my doubts of Martin’s having a master plan, and you have a potential nightmare in the making. Is it still possible that he does have a direction in mind, and that book six will end up with all of the strings neatly tied in a satisfactory bow? Yes-that’s still possible. But the hope dwindles with every passing page.</p><p>In the end, I will continue. Onwards to book four, I say, and quick about it. Frankly, I may have invested too much to turn back, now, no matter what happens. But I’m punishing Martin with one star less on this novel than I’d awarded the previous two. The book has the same quality as the others in the series, and the last fifty pages or so are rather exhilarating (and the scene with Sansa building the castle in the snow is just awesome-the kind of thing Martin must have had planned for a long time), but the slight problems become large over time, sort of like Malcolm’s explanation of fractals and chaos theory in Jurassic Park, or something. Unabated, these problems will choke him all the way down to a single star by series end. I only pray it doesn’t come to that.</p></blockquote><p> The guy’s subsequent review of <a href=\"http://www.amazon.com/review/R21NVG05CFTIBT/ref=cm_aya_cmt?ie=UTF8&amp;ASIN=055358202X#wasThisHelpful\">A Feast for Crows</a> makes for reading that is more than a little amusing, as everything he feared and worse came to pass. It made me curious enough to see if he’d bothered to read <i>A Dance with Dragons</i>; apparently he hasn’t because despite reviewing everything from a Rob Zombie movie to Charles Dickens novels, he didn’t review that.  But I thought it was remarkable that he anticipated the problems Martin subsequently exhibited as far back as the second book.  In his review of <i>A Clash of Kings</i>, he presciently wrote:</p><blockquote class=\"tr_bq\"><p> [E]ven after two gargantuan novels, it is hard to see where the series is going. It’s hard to know, not what will be the final climax, but what even could be the final climax. As a for instance, somewhere near the beginning of Star Wars, we understand that eventually it will come down to a confrontation between Skywalker and Vader. In Rocky, we know that the crux will be Rocky’s confrontation with Creed. In Thelma and Louise, we know that the final climax will be a resolution of their flight-either they’ll find a way to get back into society, or they won’t in a profound way (incarceration, death, disappearing into another country). In A Clash of Kings, there are so many major characters and so many major events all awaiting a resolution, that I can’t even precisely piece out what forms the core conflict requiring resolution. Or what event short of global annihilation could bring about such a resolution. Is there a main protagonist or antagonist? Perhaps the Houses of Stark and Lannister provide those. Or, perhaps not (what of Daenerys, for instance, or the oncoming Winter)?</p></blockquote><p>The problems he perceived so early are readily grasped by comparing the number of perspectives in the various novels.  The count grew from 9 different perspectives in the first book to a combined 25 in the last two, which you may recall were originally supposed to be a single book.  What of Daenerys indeed… what of Tyrion!</p><p>Anyhow, these are excellent object lessons to keep in mind as I’m starting to roll on the second book.  I’m determined that Book Two will be better than its predecessor.  It’s not too hard to see how things can spin out of control in books of this size, especially if you don’t have a tight grasp on who should be a perspective character and who should not be.  I’ve already written scenes with one secondary character who has been newly promoted to the perspective level; I have to be careful to not to get too carried away with that.</p><p>I originally intended to go with two fewer characters than Martin, because the geographic separations meant that I’d probably need to go into more detail and devote more words to each since I didn’t have the benefit of the overlapping physical proximity that Martin did in <i>A Game of Thrones</i>.  However, after writing <i>A Magic Broken</i>, it became apparent that the dwarf required his own storyline.</p><p>A few items of business.  First, I noticed that one of the Amazon reviews mentioned the 225 errata.  Those, and a fair number more, have all been fixed now and the cleaned-up version is already up on Amazon and BN.  Marcher Lord will be sending out the new files to all of those who bought from them next week, both preorders and ebooks.  I’m told that Amazon sends out an email confirmation when you buy an ebook from them, so if you were one of the early buyers and have the original version with the errata, please send me a copy of that email confirmation and I will send you the new .mobi file.</p><p>It’s easy to tell which version you have.  If the title page on Location 2 of 13826 features a skull, that’s the original one with the errata.  If it looks like a carved Roman wall and there is an appendix at the end of the book, that is the new one.</p><p>And if anyone knows how to get in contact with Don Athos, the Amazon reviewer, let me know.  I definitely want to send him an ebook for review.</p></div>",
  "content_text": "I’ve been trying to keep this rant by a perceptive reviewer of\nA Storm of Swords\nin mind as I begin writing Book Two in ARTS OF DARK AND LIGHT:\nMy third and final gripe remains roughly the same as it was with the first two books and is, in a nutshell, this: too damned long. Forget the page count; Martin’s writing is good enough to read for ten thousand pages, I mean that he’s taking too long to get to the point. This third installment of the series ends in a quick succession of highpoints. It’s meant to build interest and steam going into the fourth, which it does (frustratingly so, given the time between releases). But most of the third book, like most of the second and the first before it, are build up. Three thousand pages of build up are simply not welcome, and certainly not in the face of a projected three thousand to come. There was even a point, somewhere near page 600 of this book, where I started to question my investment. After all, do I have any assurance that the next book, or the book after, will offer any satisfaction? How long will I have to wait, exactly, for any sort of a sense of closure on anything? How good is Martin’s heart? His cholesterol count? Blood sugar? I suppose, on the bright side, that this series helps a person develop their patience and endurance. But, I’ll tell you, couple this with my doubts of Martin’s having a master plan, and you have a potential nightmare in the making. Is it still possible that he does have a direction in mind, and that book six will end up with all of the strings neatly tied in a satisfactory bow? Yes-that’s still possible. But the hope dwindles with every passing page.\nIn the end, I will continue. Onwards to book four, I say, and quick about it. Frankly, I may have invested too much to turn back, now, no matter what happens. But I’m punishing Martin with one star less on this novel than I’d awarded the previous two. The book has the same quality as the others in the series, and the last fifty pages or so are rather exhilarating (and the scene with Sansa building the castle in the snow is just awesome-the kind of thing Martin must have had planned for a long time), but the slight problems become large over time, sort of like Malcolm’s explanation of fractals and chaos theory in Jurassic Park, or something. Unabated, these problems will choke him all the way down to a single star by series end. I only pray it doesn’t come to that.\nThe guy’s subsequent review of\nA Feast for Crows\nmakes for reading that is more than a little amusing, as everything he feared and worse came to pass. It made me curious enough to see if he’d bothered to read\nA Dance with Dragons\n; apparently he hasn’t because despite reviewing everything from a Rob Zombie movie to Charles Dickens novels, he didn’t review that.  But I thought it was remarkable that he anticipated the problems Martin subsequently exhibited as far back as the second book.  In his review of\nA Clash of Kings\n, he presciently wrote:\n[E]ven after two gargantuan novels, it is hard to see where the series is going. It’s hard to know, not what will be the final climax, but what even could be the final climax. As a for instance, somewhere near the beginning of Star Wars, we understand that eventually it will come down to a confrontation between Skywalker and Vader. In Rocky, we know that the crux will be Rocky’s confrontation with Creed. In Thelma and Louise, we know that the final climax will be a resolution of their flight-either they’ll find a way to get back into society, or they won’t in a profound way (incarceration, death, disappearing into another country). In A Clash of Kings, there are so many major characters and so many major events all awaiting a resolution, that I can’t even precisely piece out what forms the core conflict requiring resolution. Or what event short of global annihilation could bring about such a resolution. Is there a main protagonist or antagonist? Perhaps the Houses of Stark and Lannister provide those. Or, perhaps not (what of Daenerys, for instance, or the oncoming Winter)?\nThe problems he perceived so early are readily grasped by comparing the number of perspectives in the various novels.  The count grew from 9 different perspectives in the first book to a combined 25 in the last two, which you may recall were originally supposed to be a single book.  What of Daenerys indeed… what of Tyrion!\nAnyhow, these are excellent object lessons to keep in mind as I’m starting to roll on the second book.  I’m determined that Book Two will be better than its predecessor.  It’s not too hard to see how things can spin out of control in books of this size, especially if you don’t have a tight grasp on who should be a perspective character and who should not be.  I’ve already written scenes with one secondary character who has been newly promoted to the perspective level; I have to be careful to not to get too carried away with that.\nI originally intended to go with two fewer characters than Martin, because the geographic separations meant that I’d probably need to go into more detail and devote more words to each since I didn’t have the benefit of the overlapping physical proximity that Martin did in\nA Game of Thrones\n.  However, after writing\nA Magic Broken\n, it became apparent that the dwarf required his own storyline.\nA few items of business.  First, I noticed that one of the Amazon reviews mentioned the 225 errata.  Those, and a fair number more, have all been fixed now and the cleaned-up version is already up on Amazon and BN.  Marcher Lord will be sending out the new files to all of those who bought from them next week, both preorders and ebooks.  I’m told that Amazon sends out an email confirmation when you buy an ebook from them, so if you were one of the early buyers and have the original version with the errata, please send me a copy of that email confirmation and I will send you the new .mobi file.\nIt’s easy to tell which version you have.  If the title page on Location 2 of 13826 features a skull, that’s the original one with the errata.  If it looks like a carved Roman wall and there is an appendix at the end of the book, that is the new one.\nAnd if anyone knows how to get in contact with Don Athos, the Amazon reviewer, let me know.  I definitely want to send him an ebook for review.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-11T17:06:00+00:00"
}