{
  "url": "https://voxday.net/2012/12/30/technoapocalypticals-rejoice/",
  "scraped_at": "2025-12-14T22:16:23.422797",
  "title": "Technopocalypticals rejoice!",
  "date_display": "December 30, 2012",
  "date_iso": "2012-12-30T15:49:00+00:00",
  "date_from_url": "2012-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sweet Vernor Vinge, alert the media!  Thomas Friedman has gone singular! Someone finally figured out that the famous New York Times columnist IS AN ARTIFICIAL INTELLIGENCE!  And now we can <a href=\"http://thomasfriedmanopedgenerator.com/New+Rules+61ae32\">tap directly into it</a>:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> An interesting thought occurred to me<br> today—what if academics sat down with ordinary people like you and me<br> and ironed out some real solutions to our health insurance crisis?</br></br></div><div itemprop=\"articleBody\"> With the election season over, maybe<br> you’ve forgotten about health insurance, but I certainly haven’t. It<br> would be easy to forget that the problem even exists, when our headlines<br> are constantly splashed with the violence in Brazil, the authoritarian<br> crackdown in Cape Verde and the still-unstable democratic transition in<br> Saudi Arabia. But the health insurance problem is growing, and<br> politicians are more divided than ever. Republicans seem to think that<br> health insurance can just be ignored. Democratic politicians like Dianne<br> Feinstein, on the other hand, seem to think that shrill rhetoric will<br> substitute for a compromise.</br></br></br></br></br></br></br></br></br></div><div itemprop=\"articleBody\"> But the Democratic party of Dianne<br> Feinstein is not the Democratic party of Bill Clinton. Clinton wouldn’t<br> refuse to budge, he’d compromise because he’d understand that the fate<br> of the country, and his own political career, depended on a lasting<br> solution to the problem of health insurance.</br></br></br></br></div></blockquote><p> I may have ended my WND column too soon.  All I had to do was log into THOMAS once a week and let it all do the work.  Step two: profit!</p></div>",
  "content_text": "Sweet Vernor Vinge, alert the media!  Thomas Friedman has gone singular! Someone finally figured out that the famous New York Times columnist IS AN ARTIFICIAL INTELLIGENCE!  And now we can\ntap directly into it\n:\nAn interesting thought occurred to me\ntoday—what if academics sat down with ordinary people like you and me\nand ironed out some real solutions to our health insurance crisis?\nWith the election season over, maybe\nyou’ve forgotten about health insurance, but I certainly haven’t. It\nwould be easy to forget that the problem even exists, when our headlines\nare constantly splashed with the violence in Brazil, the authoritarian\ncrackdown in Cape Verde and the still-unstable democratic transition in\nSaudi Arabia. But the health insurance problem is growing, and\npoliticians are more divided than ever. Republicans seem to think that\nhealth insurance can just be ignored. Democratic politicians like Dianne\nFeinstein, on the other hand, seem to think that shrill rhetoric will\nsubstitute for a compromise.\nBut the Democratic party of Dianne\nFeinstein is not the Democratic party of Bill Clinton. Clinton wouldn’t\nrefuse to budge, he’d compromise because he’d understand that the fate\nof the country, and his own political career, depended on a lasting\nsolution to the problem of health insurance.\nI may have ended my WND column too soon.  All I had to do was log into THOMAS once a week and let it all do the work.  Step two: profit!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2012-12-30T15:49:00+00:00"
}