{
  "url": "https://voxday.net/2012/12/22/thats-bold-move-obsidian/",
  "scraped_at": "2025-12-14T22:15:47.249629",
  "title": "That’s a bold move, Obsidian",
  "date_display": "December 22, 2012",
  "date_iso": "2012-12-22T10:06:00+00:00",
  "date_from_url": "2012-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Let’s see how it works out for him.  <a href=\"http://obsidianraw.bravejournal.com/entry/113177\">Obsidian takes exception</a> to the way I am The Man keeping the Black man down by utilizing the blatantly raciss tactic of citing international crime and gun ownership statistics in response to the media stampede for more gun control:</p><blockquote class=\"tr_bq\"><p> The reason why 26 WHITE Women and children died last week; the reason why dozens of largely WHITE people died earlier this year at a movie theatre in Colorado; and the reason why upwards of 100 WHITE teenagers met a bloodsoaked end in Olso, was all due to having too many guntoting Darkies in White Lands.</p><p>Now, before anyone out there starts sending my hatemail, no one is more aware of gun violence on the streets of urban America more than me. Thus far, no one – not me, not anyone else in the media, not President Obama himself – has ever denied that urban gun violence isn’t a problem, and a huge one at that.</p><p>But isn’t it just a weebit fascinating that the Alt-Right, when they can get up the gumption to address the clearly depraved monsters in their midst (read: White Males With Problems), just happen to do it in a manner that would be identified, rightly, as deeply intellectually dishonest and highly disengenuous in any other context? Of the more than 60 mass shootings over the past three decades, some 44 of them have been committed by White Males – and when you have ads like these marketed to said White Males (name me all the gangbangers who use Bushmasters as their go-to weapon of choice? I’ll wait…), well, it all just makes one go, Hmm…</p></blockquote><p>That’s an amusing attempt at rhetorical bluster, but I would be remiss if I did not inform Obsidian that demonstrating a complete failure of reading comprehension is not the ideal way to convince those one suspects of a belief in white superiority that they are incorrect.</p><p>But since he clearly did not understand what I was writing about in my recent posts, I will clarify the matter for him.  The reason people died in Connecticut and Colorado in the two mass shootings had absolutely nothing to do with gun-toting Darkies, much less their quantity or location.  Given the Oslo shooter’s confessed rationale, the situation there was caused by the presence of too many Darkies (for various definitions of “Darky”) in Norway, but had nothing to do with their toting of guns.  However, I was not addressing any of these specific situations, (especially not the Norwegian one, as I have no interest in or knowledge of Norwegian gun control laws), I was addressing one of the primary arguments for gun control that has been repeatedly made in the wake of the Connecticut shootings, namely, the idea that the moderate US firearms homicide rate is caused by the very high number of guns per capita in the United States.</p><p>There is nothing “deeply intellectually dishonest and highly disengenuous” about pointing out that the difference between the low firearms homicide rate of Canada and the Western European nations and the moderate firearms homicide rate in the USA is not related to the number of guns per capita in the population, but rather is a consequence of the racial makeup of the population.  In fact, it is absolutely necessary to point this out, because reviewing the differences between the various countries with low rates, moderate rates, and high rates clearly demonstrates that the proposed solution to the higher US firearms homicide rate <a href=\"http://www.milobookclub.com/2012/12/21/why-us-gun-deaths-are-hig/\">will not, and cannot, be solved by European-style gun control</a>.</p><p>Moreover, Obsidian fails to realize that mass shooting statistics he cites make perfect sense.  Why would it make him go hmmmm to realize that 73 percent of the mass shootings of the past 30 years were committed by members of a race that made up a similar percentage of the population over that time.  Is statistically proportional representation truly a deep mystery to him?</p><p>There are real problems to discuss with regards to why young white men commit acts of mass murder.  But they are completely unrelated to the arguments that the pro-gun control forces have presented, and to which I have responded.</p><p>Bringing nothing but rhetoric to a dialectical discourse is rather like<br> bringing a knife to a gun fight, then defiantly slitting your own<br> throat.  But that is what Obsidian is purposefully doing here, as he admits that he has no interest in actual debate.  He is simply trying to shut it down and prevent these straightforward and undeniable facts from being considered.</br></br></p><blockquote class=\"tr_bq\"><p> Here’s that intrepid White Man Blogger, Vox Day, advising his fellow WND readers on how to respond to calls of reason with regard to getting Bushmasters out of the hands of depraved White Guys:</p><p><i>“Don’t give them an inch. Cut them no slack. Punch back twice as hard. When they bring the knife of emotional blackmail to the argument, draw your .50 caliber Desert Eagle of facts, logic and history and blow them away without mercy.”</i></p><p>And they wonder why the Manosphere is regarded as a bunch of f*cking loons?</p><p>Really?</p><p>A number of my readers, online and off, have asked me: Obsidian, why do you waste so much time and energy on people who clearly have a disengenuous agenda? This is a very good question, and here’s my response:</p><p>Because history has shown us, again and again – that Evil – or in this case, downright Foolishness – can only exist, when Good Men, do nothing. By chin-checking these fools in the public square, I am letting them know that their days of just being able to say ridiculous crap with impunity are over. They sh*t all over our cherished freedoms in the name of “keepin’ it real” – yea, like Chris Rock said, keepin’ it real DUMB. These knuckleheads aren’t the next George Washingtons or Patrick Henrys; shoot, they can barely get laid and make a life for themselves, let alone be the standard bearers of freedom or liberty. They are not fit to participate in reasoned and intellectually honest discussion of the issues of the day, and should be roundly shouted down until they sitdown and STFU.</p></blockquote><p>The idea that a man who claims my agenda is “disengenuous” and lacks the most basic reading comprehension skills can declare, with a straight face, that I am “not fit to participate in reasoned and intellectually honest discussion” is incredibly amusing.  The fact that his ancestors were once forced to ride at the back of the bus is no excuse for Obsidian to voluntarily ride on a metaphorical short one.</p><p>Obsidian isn’t chin-checking anyone in the public square except himself.  This is like watching a pudgy little kid walk up to Lebron James and threaten to dunk on him; it would be pathetic if it weren’t so damned funny.  He can whine and bluster and cry raciss all he likes, but no amount of the conventional African-American histrionics will alter the international statistics or the clear and undeniable conclusions that logic necessarily draws from them.</p></div>",
  "content_text": "Let’s see how it works out for him.\nObsidian takes exception\nto the way I am The Man keeping the Black man down by utilizing the blatantly raciss tactic of citing international crime and gun ownership statistics in response to the media stampede for more gun control:\nThe reason why 26 WHITE Women and children died last week; the reason why dozens of largely WHITE people died earlier this year at a movie theatre in Colorado; and the reason why upwards of 100 WHITE teenagers met a bloodsoaked end in Olso, was all due to having too many guntoting Darkies in White Lands.\nNow, before anyone out there starts sending my hatemail, no one is more aware of gun violence on the streets of urban America more than me. Thus far, no one – not me, not anyone else in the media, not President Obama himself – has ever denied that urban gun violence isn’t a problem, and a huge one at that.\nBut isn’t it just a weebit fascinating that the Alt-Right, when they can get up the gumption to address the clearly depraved monsters in their midst (read: White Males With Problems), just happen to do it in a manner that would be identified, rightly, as deeply intellectually dishonest and highly disengenuous in any other context? Of the more than 60 mass shootings over the past three decades, some 44 of them have been committed by White Males – and when you have ads like these marketed to said White Males (name me all the gangbangers who use Bushmasters as their go-to weapon of choice? I’ll wait…), well, it all just makes one go, Hmm…\nThat’s an amusing attempt at rhetorical bluster, but I would be remiss if I did not inform Obsidian that demonstrating a complete failure of reading comprehension is not the ideal way to convince those one suspects of a belief in white superiority that they are incorrect.\nBut since he clearly did not understand what I was writing about in my recent posts, I will clarify the matter for him.  The reason people died in Connecticut and Colorado in the two mass shootings had absolutely nothing to do with gun-toting Darkies, much less their quantity or location.  Given the Oslo shooter’s confessed rationale, the situation there was caused by the presence of too many Darkies (for various definitions of “Darky”) in Norway, but had nothing to do with their toting of guns.  However, I was not addressing any of these specific situations, (especially not the Norwegian one, as I have no interest in or knowledge of Norwegian gun control laws), I was addressing one of the primary arguments for gun control that has been repeatedly made in the wake of the Connecticut shootings, namely, the idea that the moderate US firearms homicide rate is caused by the very high number of guns per capita in the United States.\nThere is nothing “deeply intellectually dishonest and highly disengenuous” about pointing out that the difference between the low firearms homicide rate of Canada and the Western European nations and the moderate firearms homicide rate in the USA is not related to the number of guns per capita in the population, but rather is a consequence of the racial makeup of the population.  In fact, it is absolutely necessary to point this out, because reviewing the differences between the various countries with low rates, moderate rates, and high rates clearly demonstrates that the proposed solution to the higher US firearms homicide rate\nwill not, and cannot, be solved by European-style gun control\n.\nMoreover, Obsidian fails to realize that mass shooting statistics he cites make perfect sense.  Why would it make him go hmmmm to realize that 73 percent of the mass shootings of the past 30 years were committed by members of a race that made up a similar percentage of the population over that time.  Is statistically proportional representation truly a deep mystery to him?\nThere are real problems to discuss with regards to why young white men commit acts of mass murder.  But they are completely unrelated to the arguments that the pro-gun control forces have presented, and to which I have responded.\nBringing nothing but rhetoric to a dialectical discourse is rather like\nbringing a knife to a gun fight, then defiantly slitting your own\nthroat.  But that is what Obsidian is purposefully doing here, as he admits that he has no interest in actual debate.  He is simply trying to shut it down and prevent these straightforward and undeniable facts from being considered.\nHere’s that intrepid White Man Blogger, Vox Day, advising his fellow WND readers on how to respond to calls of reason with regard to getting Bushmasters out of the hands of depraved White Guys:\n“Don’t give them an inch. Cut them no slack. Punch back twice as hard. When they bring the knife of emotional blackmail to the argument, draw your .50 caliber Desert Eagle of facts, logic and history and blow them away without mercy.”\nAnd they wonder why the Manosphere is regarded as a bunch of f*cking loons?\nReally?\nA number of my readers, online and off, have asked me: Obsidian, why do you waste so much time and energy on people who clearly have a disengenuous agenda? This is a very good question, and here’s my response:\nBecause history has shown us, again and again – that Evil – or in this case, downright Foolishness – can only exist, when Good Men, do nothing. By chin-checking these fools in the public square, I am letting them know that their days of just being able to say ridiculous crap with impunity are over. They sh*t all over our cherished freedoms in the name of “keepin’ it real” – yea, like Chris Rock said, keepin’ it real DUMB. These knuckleheads aren’t the next George Washingtons or Patrick Henrys; shoot, they can barely get laid and make a life for themselves, let alone be the standard bearers of freedom or liberty. They are not fit to participate in reasoned and intellectually honest discussion of the issues of the day, and should be roundly shouted down until they sitdown and STFU.\nThe idea that a man who claims my agenda is “disengenuous” and lacks the most basic reading comprehension skills can declare, with a straight face, that I am “not fit to participate in reasoned and intellectually honest discussion” is incredibly amusing.  The fact that his ancestors were once forced to ride at the back of the bus is no excuse for Obsidian to voluntarily ride on a metaphorical short one.\nObsidian isn’t chin-checking anyone in the public square except himself.  This is like watching a pudgy little kid walk up to Lebron James and threaten to dunk on him; it would be pathetic if it weren’t so damned funny.  He can whine and bluster and cry raciss all he likes, but no amount of the conventional African-American histrionics will alter the international statistics or the clear and undeniable conclusions that logic necessarily draws from them.",
  "tags": [
    "trainwreck",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-22T10:06:00+00:00"
}