{
  "url": "https://voxday.net/2012/12/31/the-final-wnd-column/",
  "scraped_at": "2025-12-14T22:16:28.962983",
  "title": "The final WND column",
  "date_display": "December 31, 2012",
  "date_iso": "2012-12-31T08:49:00+00:00",
  "date_from_url": "2012-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/2012/12/11-years-of-failure/\"><b>11 Years of Failure</b></a></p><p>On Sept. 14, 2001, WND published my first political column, “<a href=\"http://www.wnd.com/2001/09/10850/\">Yield no more freedom</a>.”<br> I wrote it in response to the Sept. 11 attacks in an attempt to warn<br> Americans of the assault on their rights and liberties by the U.S.<br> government that I believed would soon follow. Unfortunately, despite<br> being correct, my warnings largely fell on deaf ears, as conservatives<br> and liberals united in an attack on American freedom that culminated in<br> the Patriot Act, drone killings and secret assassination lists.</br></br></br></br></br></br></p><p>Over the last 11 years, my predictions have been both eerily<br> prescient and ludicrously inaccurate. While I did correctly foresee the<br> financial crisis, the global economic depression and the collapse of the<br> housing market, my ability to anticipate election results was reliably<br> poor. Unfortunately, the one area where my expectations seldom went<br> unfulfilled was the way in which the federal government continued to<br> expand its intervention into the U.S. economy and the lives of America’s<br> citizens almost unchecked by resistance on the part of the people or<br> their elected representatives.</br></br></br></br></br></br></br></br></p></div>",
  "content_text": "11 Years of Failure\nOn Sept. 14, 2001, WND published my first political column, “\nYield no more freedom\n.”\nI wrote it in response to the Sept. 11 attacks in an attempt to warn\nAmericans of the assault on their rights and liberties by the U.S.\ngovernment that I believed would soon follow. Unfortunately, despite\nbeing correct, my warnings largely fell on deaf ears, as conservatives\nand liberals united in an attack on American freedom that culminated in\nthe Patriot Act, drone killings and secret assassination lists.\nOver the last 11 years, my predictions have been both eerily\nprescient and ludicrously inaccurate. While I did correctly foresee the\nfinancial crisis, the global economic depression and the collapse of the\nhousing market, my ability to anticipate election results was reliably\npoor. Unfortunately, the one area where my expectations seldom went\nunfulfilled was the way in which the federal government continued to\nexpand its intervention into the U.S. economy and the lives of America’s\ncitizens almost unchecked by resistance on the part of the people or\ntheir elected representatives.",
  "tags": [
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-31T08:49:00+00:00"
}