{
  "url": "https://voxday.net/2012/12/07/the-need-for-sexism-in-literature/",
  "scraped_at": "2025-12-14T05:09:42.630686",
  "title": "The need for “sexism” in literature",
  "date_display": "December 7, 2012",
  "date_iso": "2012-12-07T11:59:00+00:00",
  "date_from_url": "2012-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I address a common complaint concerning female roles in fantasy literature <a href=\"http://alphagameplan.blogspot.ch/2012/12/its-not-historical-if-its-not-sexist.html\">at Alpha Game</a>:</p><blockquote class=\"tr_bq\"><p> The problem with what Wohl advocates is that by putting modern views<br> on sexual roles and intersexual relations into the minds, mouths, and<br> worse, structures of an imaginary historical society, it destroys the<br> very structural foundations that make the society historical and the dramatic storylines credible – in some cases, even <i>possible</i>.  It’s problem similar to the one faced by secular writers,<br> who wish to simultaneously eliminate religion from their fictional medieval societies,<br> and yet retain the dramatic conflict created by the divine right of<br> kings.  However, it is more severe because the sexual aspect touches upon the<br> most concrete basis of every society: its ability to sustain itself<br> through the propagation of its members.</br></br></br></br></br></br></br></br></p><p>The “sexism” of<br> which Wohl and many of his commenters complain isn’t cultural, it is<br> simply the logical consequences of biological and martial imperatives.</br></br></p></blockquote></div>",
  "content_text": "In which I address a common complaint concerning female roles in fantasy literature\nat Alpha Game\n:\nThe problem with what Wohl advocates is that by putting modern views\non sexual roles and intersexual relations into the minds, mouths, and\nworse, structures of an imaginary historical society, it destroys the\nvery structural foundations that make the society historical and the dramatic storylines credible – in some cases, even\npossible\n.  It’s problem similar to the one faced by secular writers,\nwho wish to simultaneously eliminate religion from their fictional medieval societies,\nand yet retain the dramatic conflict created by the divine right of\nkings.  However, it is more severe because the sexual aspect touches upon the\nmost concrete basis of every society: its ability to sustain itself\nthrough the propagation of its members.\nThe “sexism” of\nwhich Wohl and many of his commenters complain isn’t cultural, it is\nsimply the logical consequences of biological and martial imperatives.",
  "tags": [
    "Alpha Game",
    "society",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-07T11:59:00+00:00"
}