{
  "url": "https://voxday.net/2012/12/14/the-modern-wormtongues-of-sff/",
  "scraped_at": "2025-12-14T22:15:10.095977",
  "title": "The modern Wormtongues of SF/F",
  "date_display": "December 14, 2012",
  "date_iso": "2012-12-14T11:42:00+00:00",
  "date_from_url": "2012-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As one of the readers at Alpha Game suggested, the discussion of retrophobia in the SF/F genre and its observable consequences is better suited for Vox Popoli even though it began at AG due to the intersexual-relations aspect of the matter.  So, I’m going to move it over here, where the majority of the audience interested in the topic is normally found.</p><p>As one Amazon reviewer of <i><b>A Throne of Bones</b></i> noted, “modern fantasy is a rather ugly place”.  That’s is true, but it’s not the real problem, being merely a logical consequence of the underlying problem of modern fantasy being an incoherent place.  In the first post on the subject, <a href=\"http://alphagameplan.blogspot.ch/2012/12/its-not-historical-if-its-not-sexist.html\">“Sexism” is a literary necessity</a>, I observed how the structural acceptance of sexual inequality and other aspects of historical societies deemed “evil”, (technically inaccurate, but used in the absence of a better word), by the sensibilities presently infesting the literary genre are not only required for historical verisimilitude, but for literary drama as well.</p><p>I used the example of a single change to a single character in <i>A Song of Ice and Fire</i> would have totally eviscerate the entire series and eliminated the greater part of its plot.  Consider the consequences of changing Cersei Lannister from an oppressed woman used as a dynastic piece by her father to a strong and independent warrior woman of the sort that is presently ubiquitous in third generation fantasy, science fiction, and paranormal fiction.</p><ol><li>Cersei doesn’t marry Robert Baratheon.  She’s strong and independent like her twin, not a royal brood mare!</li><li>House Lannister’s ambitions are reduced from establishing a royal line to finding a wife for Tyrion.</li><li>Her children are not bastards.  Robert’s heirs have black hair.</li><li>Jon Arryn isn’t murdered to keep a nonexistent secret.  Ned Stark isn’t named to replace him.</li><li>Robert doesn’t have an accident coordinated by the Lannisters, who don’t dominate the court and will not benefit from his fall.</li><li>Robert’s heirs being legitimate, Stannis and Renly Baratheon remain loyal.</li><li>The Starks never come south and never revolt against King’s Landing.  Theon Greyjoy goes home to the Ironborn and never returns to Winterfell.  Jon Snow still goes to the Wall, but Arya remains home and learns to become a lady, not an assassin, whether she wants to or not.</li></ol><p>So, what was a war of five kings that spans five continents abruptly becomes a minor debate over whether Robert Baratheon’s black-haired son and heir marries Sansa Stark, a princess of Dorne, or Danerys Targaryen.  This doesn’t remove all of the drama from the book; King Robert could spurn Danerys and thus preserve the Baratheon-Targaryen rivalry and the threat of the Others still lurks north of the Wall.  It’s even possible that the novel which now focuses on the warrior woman Cersei, her lesbian lover, Brienne of Tarth, and their brave journey north of the Wall to discover the secret of the Others might not be entirely dreadful.  One could even argue that it would have a shot at being more interesting than <i>A Dance with Dragons</i>.</p><p>But would it be better or more interesting than the complex intrigue and drama filling the first three books?  I very much doubt it.</p><p>Now let’s turn it around and throw it out to the readers.  Can you think of a modern fantasy novel in which a single change to a single character would have had the potential to improve the story to a similar degree that the change to Cersei Lannister would alter A Song of Fire and Ice?  Alternatively, what popular SF/F works have been hamstrung by the author’s servile adherence to revisionist modern sensibilities?</p><p>What we have seen over the last thirty or forty years in the SF/F genre is metaphorically quite similar to what Tolkien portrayed at the end of <i>The Lord of the Rings</i> in the scouring of the Shire.  The modern Wormtongues have done their best to ruin the once beautiful land of fantasy they invaded, by rejecting the past which they hate and failing to grasp the purpose and significance of societal traditions they do not understand.  These Wormtongues are reduced to cobbling together incoherent and derivative works because their very values work against them, cutting them off from the larger part of the sources of historical conflict and drama, reducing them to coloring with crayons where their predecessors were painting with a full palette that ranged the full width and depth of the human experience.</p></div>",
  "content_text": "As one of the readers at Alpha Game suggested, the discussion of retrophobia in the SF/F genre and its observable consequences is better suited for Vox Popoli even though it began at AG due to the intersexual-relations aspect of the matter.  So, I’m going to move it over here, where the majority of the audience interested in the topic is normally found.\nAs one Amazon reviewer of\nA Throne of Bones\nnoted, “modern fantasy is a rather ugly place”.  That’s is true, but it’s not the real problem, being merely a logical consequence of the underlying problem of modern fantasy being an incoherent place.  In the first post on the subject,\n“Sexism” is a literary necessity\n, I observed how the structural acceptance of sexual inequality and other aspects of historical societies deemed “evil”, (technically inaccurate, but used in the absence of a better word), by the sensibilities presently infesting the literary genre are not only required for historical verisimilitude, but for literary drama as well.\nI used the example of a single change to a single character in\nA Song of Ice and Fire\nwould have totally eviscerate the entire series and eliminated the greater part of its plot.  Consider the consequences of changing Cersei Lannister from an oppressed woman used as a dynastic piece by her father to a strong and independent warrior woman of the sort that is presently ubiquitous in third generation fantasy, science fiction, and paranormal fiction.\nCersei doesn’t marry Robert Baratheon.  She’s strong and independent like her twin, not a royal brood mare!\nHouse Lannister’s ambitions are reduced from establishing a royal line to finding a wife for Tyrion.\nHer children are not bastards.  Robert’s heirs have black hair.\nJon Arryn isn’t murdered to keep a nonexistent secret.  Ned Stark isn’t named to replace him.\nRobert doesn’t have an accident coordinated by the Lannisters, who don’t dominate the court and will not benefit from his fall.\nRobert’s heirs being legitimate, Stannis and Renly Baratheon remain loyal.\nThe Starks never come south and never revolt against King’s Landing.  Theon Greyjoy goes home to the Ironborn and never returns to Winterfell.  Jon Snow still goes to the Wall, but Arya remains home and learns to become a lady, not an assassin, whether she wants to or not.\nSo, what was a war of five kings that spans five continents abruptly becomes a minor debate over whether Robert Baratheon’s black-haired son and heir marries Sansa Stark, a princess of Dorne, or Danerys Targaryen.  This doesn’t remove all of the drama from the book; King Robert could spurn Danerys and thus preserve the Baratheon-Targaryen rivalry and the threat of the Others still lurks north of the Wall.  It’s even possible that the novel which now focuses on the warrior woman Cersei, her lesbian lover, Brienne of Tarth, and their brave journey north of the Wall to discover the secret of the Others might not be entirely dreadful.  One could even argue that it would have a shot at being more interesting than\nA Dance with Dragons\n.\nBut would it be better or more interesting than the complex intrigue and drama filling the first three books?  I very much doubt it.\nNow let’s turn it around and throw it out to the readers.  Can you think of a modern fantasy novel in which a single change to a single character would have had the potential to improve the story to a similar degree that the change to Cersei Lannister would alter A Song of Fire and Ice?  Alternatively, what popular SF/F works have been hamstrung by the author’s servile adherence to revisionist modern sensibilities?\nWhat we have seen over the last thirty or forty years in the SF/F genre is metaphorically quite similar to what Tolkien portrayed at the end of\nThe Lord of the Rings\nin the scouring of the Shire.  The modern Wormtongues have done their best to ruin the once beautiful land of fantasy they invaded, by rejecting the past which they hate and failing to grasp the purpose and significance of societal traditions they do not understand.  These Wormtongues are reduced to cobbling together incoherent and derivative works because their very values work against them, cutting them off from the larger part of the sources of historical conflict and drama, reducing them to coloring with crayons where their predecessors were painting with a full palette that ranged the full width and depth of the human experience.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-14T11:42:00+00:00"
}