{
  "url": "https://voxday.net/2012/12/28/the-pig-she-flies/",
  "scraped_at": "2025-12-14T22:16:14.586827",
  "title": "The pig, she flies!",
  "date_display": "December 28, 2012",
  "date_iso": "2012-12-28T14:00:00+00:00",
  "date_from_url": "2012-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which <a href=\"http://freethoughtblogs.com/dispatches/2012/12/27/it-appears-ive-started-an-atheist-cult/#comment-206731\">I actually agree with Ed Brayton</a> for once:</p><div class=\"comment-entry\"><blockquote class=\"tr_bq\"><p> I tend to bristle at the idea of judging a blog by its<br> comment section. As Jamie Kilstein said a few months ago, the comment<br> section at PZ’s blog is the 7th circle of hell. The one here is often<br> scarcely better. Even I cringe at what is clearly — yes — tribalism that<br> goes on in the comments section. It’s just the nature of the beast and<br> it’s happened to me on both ends. A quick story:</br></br></br></br></br></p><p>A few years ago I criticized Richard Dawkins for signing a petition<br> that would make it illegal for parents to teach their kids about<br> religion. The comment section was descended upon by hundreds of his<br> acolytes, saving me up one side and down the other. I was<br> misinterpreting the petition, they said, and how dare I criticize<br> someone who had done so much for atheism when I was just a lowly<br> blogger, and so forth. After a while Dawkins himself showed up and said I<br> was right, that he hadn’t read the petition closely enough, that he did<br> not favor such a law and he’d asked them to remove his name from the<br> petition. Even after that, many of his followers continued to excoriate<br> me.</br></br></br></br></br></br></br></br></br></br></p><p>I’ve had the same thing happen here on the other side, where someone<br> has shown up in the comments and criticized something I wrote. They were<br> hammered like mad by many of my readers and I had to jump in and say,<br> “Wait a minute, he’s actually got a point.” That makes me even more<br> uncomfortable than being on the receiving end of it. We are all prone to<br> tribalism and to shallow thinking, including those who regard ourselves<br> as skeptics who are above that sort of thing.</br></br></br></br></br></br></p></blockquote><p>I’m not keen on judging a blog by its comment section either, except in that one can judge the character and self-confidence of the blogger by how he manages his comment section.  Here at VP, for example, there is actual debate among people who disagree with each other and with me.  In the posts this week alone, there are numerous regulars disagreeing with me about the limits of the Constitution’s ability to guarantee God-given rights as well as a vigorous debate on the permissibility of gun control between commenters.</p><p>PZ, as far as I have seen, is actually quite good about permitting critics to comment freely at Pharyngula, the problem there is not that he cannot bear dissension, but rather that his commenters are such a clueless collection of mid-witted ideologues that most critics stop uselessly banging their head against the wall of idiocy there before long.  I actually respect him much more than many other bloggers in that particular regard.</p><p>But Brayton is entirely correct to point out that the self-styled skeptics are every bit as tribal and superficial as those they make a habit of denigrating.  This is a point I have been making for literally years, and it is good to see that some of the more vocal members of the skeptic community are willing to openly acknowledge it.</p></div></div>",
  "content_text": "In which\nI actually agree with Ed Brayton\nfor once:\nI tend to bristle at the idea of judging a blog by its\ncomment section. As Jamie Kilstein said a few months ago, the comment\nsection at PZ’s blog is the 7th circle of hell. The one here is often\nscarcely better. Even I cringe at what is clearly — yes — tribalism that\ngoes on in the comments section. It’s just the nature of the beast and\nit’s happened to me on both ends. A quick story:\nA few years ago I criticized Richard Dawkins for signing a petition\nthat would make it illegal for parents to teach their kids about\nreligion. The comment section was descended upon by hundreds of his\nacolytes, saving me up one side and down the other. I was\nmisinterpreting the petition, they said, and how dare I criticize\nsomeone who had done so much for atheism when I was just a lowly\nblogger, and so forth. After a while Dawkins himself showed up and said I\nwas right, that he hadn’t read the petition closely enough, that he did\nnot favor such a law and he’d asked them to remove his name from the\npetition. Even after that, many of his followers continued to excoriate\nme.\nI’ve had the same thing happen here on the other side, where someone\nhas shown up in the comments and criticized something I wrote. They were\nhammered like mad by many of my readers and I had to jump in and say,\n“Wait a minute, he’s actually got a point.” That makes me even more\nuncomfortable than being on the receiving end of it. We are all prone to\ntribalism and to shallow thinking, including those who regard ourselves\nas skeptics who are above that sort of thing.\nI’m not keen on judging a blog by its comment section either, except in that one can judge the character and self-confidence of the blogger by how he manages his comment section.  Here at VP, for example, there is actual debate among people who disagree with each other and with me.  In the posts this week alone, there are numerous regulars disagreeing with me about the limits of the Constitution’s ability to guarantee God-given rights as well as a vigorous debate on the permissibility of gun control between commenters.\nPZ, as far as I have seen, is actually quite good about permitting critics to comment freely at Pharyngula, the problem there is not that he cannot bear dissension, but rather that his commenters are such a clueless collection of mid-witted ideologues that most critics stop uselessly banging their head against the wall of idiocy there before long.  I actually respect him much more than many other bloggers in that particular regard.\nBut Brayton is entirely correct to point out that the self-styled skeptics are every bit as tribal and superficial as those they make a habit of denigrating.  This is a point I have been making for literally years, and it is good to see that some of the more vocal members of the skeptic community are willing to openly acknowledge it.",
  "tags": [
    "atheism",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-28T14:00:00+00:00"
}