{
  "url": "https://voxday.net/2012/12/06/thom-hartmann-interview/",
  "scraped_at": "2025-12-14T05:09:38.903437",
  "title": "Thom Hartmann interview",
  "date_display": "December 6, 2012",
  "date_iso": "2012-12-06T17:33:00+00:00",
  "date_from_url": "2012-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>THOM HARTMANN: Vox<br> Day, which is Latin for “the voice of God.” VoxDay.blogspot.com, his<br> website; Christian libertarian; author of several books, including <i><b>A<br> Throne Of Bones</br></b></i>, just out today. The blog is “Vox Popoli”, which would be the voice of the people. So, Voice of God, welcome.</br></br></p><div class=\"MsoNormal\"> VOX DAY: Thanks, Tom.</div><div class=\"MsoNormal\"> TH: Great to have you with us. You are a self-professed secessionist. Explain this to me.</div><div class=\"MsoNormal\"> VD: The way that I would begin it is that I would say that I favor<br> self-determination for all peoples, whether they’re American, whether<br> they’re Scottish, whether they’re Catalonian…</br></br></div><div class=\"MsoNormal\"> TH: You know, any person, including yourself, can hop on a plane and<br> go to any other country, and if you can get them to take you, you’re<br> there.</br></br></div><div class=\"MsoNormal\"> VD: I am. I’ve lived in Europe for 13, 14 years now</div><div class=\"MsoNormal\"> TH: Ok. So, you know . . . what’s the problem?</div><div class=\"MsoNormal\"> VD: I don’t have any problem, it’s simply an intellectual<br> thing. It’s simply understanding that, throughout the course of human<br> history, it is entirely normal for groups of people to come together for<br> a period of time, and then break apart after a while.  You<br> know, this is a pattern of history that has existed for as<br> long as man has written these things down. In fact, in that new novel<br> that you mentioned, it’s based on the Roman social war of 91BC, which<br> was, essentially, a secessionist movement, even though they ended up<br> joining the empire after all.</br></br></br></br></br></br></br></br></div><div class=\"MsoNormal\"> TH:<br> So you’re suggesting … let’s translate this into simple English. Are<br> you suggesting that the citizens of any particular state, on a majority<br> vote, should be able to simply withdraw themselves from the union as<br> states did in 1860?</br></br></br></br></div><div class=\"MsoNormal\"> VD: Of course. We’re seeing it happen right now in Scotland. We think it’s unthinkable because America is such a short-lived….</div><div class=\"MsoNormal\"> TH:<br> But Scotland has historically been a separate country. And, they have<br> profoundly different . . . I spent a fair amount of time in Scotland.<br> And it’s a very different culture from British culture. And they have<br> fought wars over the years. I mean, you know, what’s his name, the crazy<br> actor, Mel Gibson, made a movie out of one of them.  I<br> mean, they fought wars with the British. England, historically, was a<br> separate country, just because they happened to be on the same island.<br> And you could argue that the only reason Scotland was part of the United<br> Kingdom was because they were conquered, and now they’re “unconquering” themselves.  That’s very different from states voluntarily joining a union like we have here in the United States.</br></br></br></br></br></br></br></br></br></div><div class=\"MsoNormal\"> VD:<br> But they weren’t conquered. They came together as part of the voluntary<br> Acts of Union from 1707. Their voluntarily, democratically-supported<br> union has lasted more than twice as long as the history of the United<br> States [Union].<i>(1)</i>  And so, we’re seeing this all over the world.  We’re<br> seeing Catalonia, which has been part of Castilian Spain for even<br> longer than Scotland’s been part of the United Kingdom, voting, again democratically, left and right joining together, to vote the secessionists into power.…</br></br></br></br></br></br></div><div class=\"MsoNormal\"> TH:<br> Right. But, again, don’t you think that that’s because they’re sick and<br> tired of Spain being part of the EU, and thus having lost their<br> national sovereignty, and so they’re going to claim their own national<br> sovereignty and withdraw themselves from the EU?</br></br></br></br></div><div class=\"MsoNormal\"> VD:<br> That might be the case with the Catalonians. That’s not the case with<br> the Scottish. The Scottish actually want to get out of the United<br> Kingdom, and then join  the EU in their own right which….</br></br></br></div><div class=\"MsoNormal\"> TH: Which seems crazy to me.</div><div class=\"MsoNormal\"> VD:<br> It’s totally crazy to me, too. But that’s the whole point about<br> self-determination. What is it to us as Americans or whatever we might<br> be …</br></br></br></div><div class=\"MsoNormal\"> TH:<br> So do you think Lincoln should have just said when the South seceded,<br> even before… A number of the states seceded after he was elected but<br> before he was installed into office, because back then the elections<br> were in November and you were sworn into office in March. And during<br> that time, you had a bunch of states that said, “Ok, that’s it, we’re<br> out of here”… that he should have just said, “Goodbye”?</br></br></br></br></br></br></div><div class=\"MsoNormal\"> VD:<br> Oh, absolutely. In fact, the interesting thing is that before Lincoln,<br> about, maybe, 30 years before that, the secessionist states were the New<br> England states. They were the ones who were talking about seceding. I<br> don’t recall what the deal was, why they were interested. But it was<br> never really questioned that a state had the right to voluntarily leave<br> the union because, otherwise, if they didn’t have the right to<br> voluntarily leave, then it was just another militarily imposed empire.</br></br></br></br></br></br></br></div><div class=\"MsoNormal\"> TH: But that right is not laid out in the constitution.</div><div class=\"MsoNormal\"> VD: I’m sorry?</div><div class=\"MsoNormal\"> TH: That right is not laid out in the constitution.</div><div class=\"MsoNormal\"> VD:<br> Well, no, because the constitution has to do with the rights of the<br> federal government. It doesn’t have anything to do with the rights of<br> the states. If you’re writing a document limiting the federal<br> government….</br></br></br></br></div><div class=\"MsoNormal\"> TH: Well, actually, it does. It gives the federal government, for example, the right to regulate commerce between the states.</div><div class=\"MsoNormal\"> VD: Sure.</div><div class=\"MsoNormal\"> TH:<br> It says how states shall apportion their electors. It says how states<br> shall determine the number of representatives they’re sending to<br> Washington, DC. There are a lot of rules for the states in the<br> constitution.</br></br></br></br></div><div class=\"MsoNormal\"> VD: And those are all things that have to do with the operation of the<br/> federal government. It doesn’t have anything to do with the operation of<br/> the sovereign and several states.  Obviously, when you join a group, you agree to abide by the rules of that group.</div><div class=\"MsoNormal\"> TH:<br/> So if Texas secedes, and becomes the independent nation of Texas, what<br/> happens to those Americans in Texas who consider themselves Americans<br/> who don’t want secession?</div><div class=\"MsoNormal\"> VD:<br/> Well, presumably in a democratic country, in a free and democratic<br/> country, those people would either have to decide if they wanted to stay<br/> and accept it, the same way that the people in America at the time of<br/> the revolutionary war …  You know,<br/> many them either moved to Canada, or moved back to England, or in some<br/> cases they just decided to stay and become Americans. It would be up to<br/> them, and presumably the Texans would be focused enough on freedom that<br/> they would let those people do whatever it was they wanted.</div><div class=\"MsoNormal\"> TH: What is it about the United States that …  first of all, what state do you live in?</div><div class=\"MsoNormal\"> VD: I don’t. Like I said, I’ve lived in Italy for 13 years.</div><div class=\"MsoNormal\"> TH: So you live in Italy right now?</div><div class=\"MsoNormal\"> VD: Yeah. I used to live in Minnesota.</div><div class=\"MsoNormal\"> TH:<br/> In Minnesota. So… you really don’t have a dog in this fight. Doesn’t<br/> that diminish your credibility somewhat in making these kind of<br/> statements? I mean, this isn’t going to affect you.</div><div class=\"MsoNormal\"> VD:<br/> Well, no, of course it’s going to affect me in the sense that I have friends and family there. I mean, I wouldn’t say that…<br/> Would you say about somebody who lived in the states who has family back<br/> in Scotland that they have no … Of course there’s an interest. But my<br/> primary interest in this, as in practically everything, is primarily<br/> intellectual.  Am I going to shed<br/> any massive tears if Catalonia breaks away from Spain? No. Am I going to<br/> be terribly upset if Texas decides to be independent? No. If you<br/> support self-determination for one group of people in the world, you<br/> should support it for everyone. And why shouldn’t Americans have the<br/> same right of self-determination that we support for the people in<br/> Libya, for the people in Egypt, for the people…</div><div class=\"MsoNormal\"> TH:<br/> But most of the states who are talking about secession are states that,<br/> for every dollar that they send to Washington, DC, they get back $1.10,<br/> $1.20, $1.30. Texas gets more federal money in than they send out. So<br/> when they secede, first of all, all the military bases in the state<br/> would close. And that’s not even included in that equation that I just<br/> shared with you. Secondly, everybody loses their Social Security,<br/> Medicare, Medicaid, all those other things.  How is that state going to exist?</div><div class=\"MsoNormal\"> VD: First of all, Texas is not going to have any trouble existing,<br/> because Texas is, would be one of the, I believe, twenty largest<br/> economies in the world, thirty largest economies in the world. I mean,<br/> if …</div><div class=\"MsoNormal\"> TH: Not without federal infrastructure.</div><div class=\"MsoNormal\"> VD:<br/> Obviously it might not be quite as easy for them. But whether it is or<br/> not, that’s their right to say. It’s not for you or me to decide. If<br/> Delaware, for example … let’s take the most absurd example … Delaware<br/> would be like, … Lichtenstein or something. Now, you wouldn’t think that they would have any business going independent.<br/> But if they want to go independent and live in grass huts and that sort<br/> of thing, what is that to you or me? That’s what freedom is all about,<br/> is allowing people freedom to make stupid choices.</div><div class=\"MsoNormal\"> TH:<br/> Well, you make a very compelling and libertarian argument…. Hm.<br/> Interesting. I wonder if this is going to be THE thing for the<br/> Republican Party.<p><i>(1)  Just to be clear, I can do the math.  I was referring to the post-1865 Union that was forcibly imposed, not the voluntary one that lasted from 1776 to 1861.</i></p></div></div>",
  "content_text": "THOM HARTMANN: Vox\nDay, which is Latin for “the voice of God.” VoxDay.blogspot.com, his\nwebsite; Christian libertarian; author of several books, including\nA\nThrone Of Bones\n, just out today. The blog is “Vox Popoli”, which would be the voice of the people. So, Voice of God, welcome.\nVOX DAY: Thanks, Tom.\nTH: Great to have you with us. You are a self-professed secessionist. Explain this to me.\nVD: The way that I would begin it is that I would say that I favor\nself-determination for all peoples, whether they’re American, whether\nthey’re Scottish, whether they’re Catalonian…\nTH: You know, any person, including yourself, can hop on a plane and\ngo to any other country, and if you can get them to take you, you’re\nthere.\nVD: I am. I’ve lived in Europe for 13, 14 years now\nTH: Ok. So, you know . . . what’s the problem?\nVD: I don’t have any problem, it’s simply an intellectual\nthing. It’s simply understanding that, throughout the course of human\nhistory, it is entirely normal for groups of people to come together for\na period of time, and then break apart after a while.  You\nknow, this is a pattern of history that has existed for as\nlong as man has written these things down. In fact, in that new novel\nthat you mentioned, it’s based on the Roman social war of 91BC, which\nwas, essentially, a secessionist movement, even though they ended up\njoining the empire after all.\nTH:\nSo you’re suggesting … let’s translate this into simple English. Are\nyou suggesting that the citizens of any particular state, on a majority\nvote, should be able to simply withdraw themselves from the union as\nstates did in 1860?\nVD: Of course. We’re seeing it happen right now in Scotland. We think it’s unthinkable because America is such a short-lived….\nTH:\nBut Scotland has historically been a separate country. And, they have\nprofoundly different . . . I spent a fair amount of time in Scotland.\nAnd it’s a very different culture from British culture. And they have\nfought wars over the years. I mean, you know, what’s his name, the crazy\nactor, Mel Gibson, made a movie out of one of them.  I\nmean, they fought wars with the British. England, historically, was a\nseparate country, just because they happened to be on the same island.\nAnd you could argue that the only reason Scotland was part of the United\nKingdom was because they were conquered, and now they’re “unconquering” themselves.  That’s very different from states voluntarily joining a union like we have here in the United States.\nVD:\nBut they weren’t conquered. They came together as part of the voluntary\nActs of Union from 1707. Their voluntarily, democratically-supported\nunion has lasted more than twice as long as the history of the United\nStates [Union].\n(1)\nAnd so, we’re seeing this all over the world.  We’re\nseeing Catalonia, which has been part of Castilian Spain for even\nlonger than Scotland’s been part of the United Kingdom, voting, again democratically, left and right joining together, to vote the secessionists into power.…\nTH:\nRight. But, again, don’t you think that that’s because they’re sick and\ntired of Spain being part of the EU, and thus having lost their\nnational sovereignty, and so they’re going to claim their own national\nsovereignty and withdraw themselves from the EU?\nVD:\nThat might be the case with the Catalonians. That’s not the case with\nthe Scottish. The Scottish actually want to get out of the United\nKingdom, and then join  the EU in their own right which….\nTH: Which seems crazy to me.\nVD:\nIt’s totally crazy to me, too. But that’s the whole point about\nself-determination. What is it to us as Americans or whatever we might\nbe …\nTH:\nSo do you think Lincoln should have just said when the South seceded,\neven before… A number of the states seceded after he was elected but\nbefore he was installed into office, because back then the elections\nwere in November and you were sworn into office in March. And during\nthat time, you had a bunch of states that said, “Ok, that’s it, we’re\nout of here”… that he should have just said, “Goodbye”?\nVD:\nOh, absolutely. In fact, the interesting thing is that before Lincoln,\nabout, maybe, 30 years before that, the secessionist states were the New\nEngland states. They were the ones who were talking about seceding. I\ndon’t recall what the deal was, why they were interested. But it was\nnever really questioned that a state had the right to voluntarily leave\nthe union because, otherwise, if they didn’t have the right to\nvoluntarily leave, then it was just another militarily imposed empire.\nTH: But that right is not laid out in the constitution.\nVD: I’m sorry?\nTH: That right is not laid out in the constitution.\nVD:\nWell, no, because the constitution has to do with the rights of the\nfederal government. It doesn’t have anything to do with the rights of\nthe states. If you’re writing a document limiting the federal\ngovernment….\nTH: Well, actually, it does. It gives the federal government, for example, the right to regulate commerce between the states.\nVD: Sure.\nTH:\nIt says how states shall apportion their electors. It says how states\nshall determine the number of representatives they’re sending to\nWashington, DC. There are a lot of rules for the states in the\nconstitution.\nVD: And those are all things that have to do with the operation of the\nfederal government. It doesn’t have anything to do with the operation of\nthe sovereign and several states.  Obviously, when you join a group, you agree to abide by the rules of that group.\nTH:\nSo if Texas secedes, and becomes the independent nation of Texas, what\nhappens to those Americans in Texas who consider themselves Americans\nwho don’t want secession?\nVD:\nWell, presumably in a democratic country, in a free and democratic\ncountry, those people would either have to decide if they wanted to stay\nand accept it, the same way that the people in America at the time of\nthe revolutionary war …  You know,\nmany them either moved to Canada, or moved back to England, or in some\ncases they just decided to stay and become Americans. It would be up to\nthem, and presumably the Texans would be focused enough on freedom that\nthey would let those people do whatever it was they wanted.\nTH: What is it about the United States that …  first of all, what state do you live in?\nVD: I don’t. Like I said, I’ve lived in Italy for 13 years.\nTH: So you live in Italy right now?\nVD: Yeah. I used to live in Minnesota.\nTH:\nIn Minnesota. So… you really don’t have a dog in this fight. Doesn’t\nthat diminish your credibility somewhat in making these kind of\nstatements? I mean, this isn’t going to affect you.\nVD:\nWell, no, of course it’s going to affect me in the sense that I have friends and family there. I mean, I wouldn’t say that…\nWould you say about somebody who lived in the states who has family back\nin Scotland that they have no … Of course there’s an interest. But my\nprimary interest in this, as in practically everything, is primarily\nintellectual.  Am I going to shed\nany massive tears if Catalonia breaks away from Spain? No. Am I going to\nbe terribly upset if Texas decides to be independent? No. If you\nsupport self-determination for one group of people in the world, you\nshould support it for everyone. And why shouldn’t Americans have the\nsame right of self-determination that we support for the people in\nLibya, for the people in Egypt, for the people…\nTH:\nBut most of the states who are talking about secession are states that,\nfor every dollar that they send to Washington, DC, they get back $1.10,\n$1.20, $1.30. Texas gets more federal money in than they send out. So\nwhen they secede, first of all, all the military bases in the state\nwould close. And that’s not even included in that equation that I just\nshared with you. Secondly, everybody loses their Social Security,\nMedicare, Medicaid, all those other things.  How is that state going to exist?\nVD: First of all, Texas is not going to have any trouble existing,\nbecause Texas is, would be one of the, I believe, twenty largest\neconomies in the world, thirty largest economies in the world. I mean,\nif …\nTH: Not without federal infrastructure.\nVD:\nObviously it might not be quite as easy for them. But whether it is or\nnot, that’s their right to say. It’s not for you or me to decide. If\nDelaware, for example … let’s take the most absurd example … Delaware\nwould be like, … Lichtenstein or something. Now, you wouldn’t think that they would have any business going independent.\nBut if they want to go independent and live in grass huts and that sort\nof thing, what is that to you or me? That’s what freedom is all about,\nis allowing people freedom to make stupid choices.\nTH:\nWell, you make a very compelling and libertarian argument…. Hm.\nInteresting. I wonder if this is going to be THE thing for the\nRepublican Party.\n(1)  Just to be clear, I can do the math.  I was referring to the post-1865 Union that was forcibly imposed, not the voluntary one that lasted from 1776 to 1861.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-06T17:33:00+00:00"
}