{
  "url": "https://voxday.net/2012/12/03/wnd-column/",
  "scraped_at": "2025-12-14T05:09:22.401119",
  "title": "WND column",
  "date_display": "December 3, 2012",
  "date_iso": "2012-12-03T10:18:00+00:00",
  "date_from_url": "2012-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/2012/12/an-american-independence-party/\"><b>An American Independence Party</b></a></p><p>In Spain, the two pro-Catalan independence parties now control a<br> majority of the regional parliament. While the Esquerra Republicana de<br> Catalunya is on the political left and the Convergència i Unió is on the<br> center-right, the one thing they can agree on is that Catalonia should<br> be independent.</br></br></br></br></p><p>In Great Britain, the Scottish National Party has all but eliminated<br> the Conservative Party north of the border and seats nearly twice as<br> many members as the Labour Party in the Scottish Parliament. As for the<br> United Kingdom herself, the United Kingdom Independence Party, derided<br> by British Prime Minister David Cameron as a collection of “loonies,<br> fruitcakes and closet racists,” just handed the Tories their<br> Eton-educated heads in three by-elections that serve as a likely<br> harbinger of political upheaval to come; UKIP has already effectively<br> replaced the Liberal Democrats as the United Kingdom’s fourth most<br> influential political party after the Conservatives, Labour, and the<br> Scottish National Party.</br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "An American Independence Party\nIn Spain, the two pro-Catalan independence parties now control a\nmajority of the regional parliament. While the Esquerra Republicana de\nCatalunya is on the political left and the Convergència i Unió is on the\ncenter-right, the one thing they can agree on is that Catalonia should\nbe independent.\nIn Great Britain, the Scottish National Party has all but eliminated\nthe Conservative Party north of the border and seats nearly twice as\nmany members as the Labour Party in the Scottish Parliament. As for the\nUnited Kingdom herself, the United Kingdom Independence Party, derided\nby British Prime Minister David Cameron as a collection of “loonies,\nfruitcakes and closet racists,” just handed the Tories their\nEton-educated heads in three by-elections that serve as a likely\nharbinger of political upheaval to come; UKIP has already effectively\nreplaced the Liberal Democrats as the United Kingdom’s fourth most\ninfluential political party after the Conservatives, Labour, and the\nScottish National Party.",
  "tags": [
    "decline and fall",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-03T10:18:00+00:00"
}