{
  "url": "https://voxday.net/2012/12/10/wnd-column_10/",
  "scraped_at": "2025-12-14T22:14:47.788740",
  "title": "WND column",
  "date_display": "December 10, 2012",
  "date_iso": "2012-12-10T10:15:00+00:00",
  "date_from_url": "2012-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt some of you are getting a little bored with the book announcements, but since WND was happy to let me use the column to let its readers know about it, that’s the subject of today’s column.  But it is more than just an announcement, it is also a reminder that simply running away from the poisoned, intellectually-stunted kultursmog is not a viable long-term strategy for Christians and conservatives.  The old ways will reassert themselves in the end, they always do, but in the meantime, it is the responsibility of those who keep to them to continue pointing the way out to those enmeshed in the mire.</p><p><b><i><a href=\"http://www.wnd.com/2012/12/a-throne-of-bones/\">A THRONE OF BONES </a></i></b></p><p><i>Christians and conservatives are world-class complainers about the<br> current entertainment culture. Their complaints are entirely justified as<br> there is a tremendous amount about which they can quite reasonably<br> complain. Television is filled with perverse and immoral characters, the<br> only reason representatives of some of the nation’s largest demographic<br> groups appear on screens large and small is to be mocked, and the<br> traditional virtues are openly despised and denigrated in the name of<br> public entertainment….</br></br></br></br></br></br></br></i></p></div>",
  "content_text": "No doubt some of you are getting a little bored with the book announcements, but since WND was happy to let me use the column to let its readers know about it, that’s the subject of today’s column.  But it is more than just an announcement, it is also a reminder that simply running away from the poisoned, intellectually-stunted kultursmog is not a viable long-term strategy for Christians and conservatives.  The old ways will reassert themselves in the end, they always do, but in the meantime, it is the responsibility of those who keep to them to continue pointing the way out to those enmeshed in the mire.\nA THRONE OF BONES\nChristians and conservatives are world-class complainers about the\ncurrent entertainment culture. Their complaints are entirely justified as\nthere is a tremendous amount about which they can quite reasonably\ncomplain. Television is filled with perverse and immoral characters, the\nonly reason representatives of some of the nation’s largest demographic\ngroups appear on screens large and small is to be mocked, and the\ntraditional virtues are openly despised and denigrated in the name of\npublic entertainment….",
  "tags": [
    "decline and fall",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-12-10T10:15:00+00:00"
}