{
  "url": "https://voxday.net/2023/03/22/clown-world-law/",
  "scraped_at": "2026-01-08T13:51:46.366245",
  "title": "Clown World Law",
  "date_display": "March 22, 2023",
  "date_iso": "2023-03-22T06:35:00+00:00",
  "date_from_url": "2023-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The economic tide is rapidly going out and it is exposing the utterly false foundations of the Enlightenment-based societies in the process. Switzerland was once known throughout the world for its serious dedication to law, order, and direct democracy. Now, only a few months after throwing away centuries of historic neutrality on behalf of the losing side of the NATO-Russian War, even the Saudis are openly mocking the government’s false pretensions to “law” and “democracy” in the aftermath of <a href=\"https://www.swissinfo.ch/eng/how-the-swiss--trinity--forced-ubs-to-save-credit-suisse/48378088\">the government shenanigans</a> forcing the UBS-Credit Suisse merger.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On Wednesday, the so-called “trinity” of the Swiss National Bank, regulator Finma and minister of finance summoned Credit Suisse chair Axel Lehmann, who was in Saudi Arabia for a conference, and chief executive Ulrich Körner for a call.</p><p>In the same meeting where they authorised the CHF50 billion backstop, they also delivered another message: “You will merge with UBS and announce Sunday evening before Asia opens. This is not optional,” a person briefed on the conversation recalls…</p><p>“You make fun of dictatorships and then you can change the law over the weekend. What’s the difference between Saudi Arabia and Switzerland now? It’s really bad,” says one person close to one of the three major shareholders.</p></blockquote><p>The international business community is not impressed.</p><p><em>“Switzerland’s standing as a financial center is shattered. The country will now be viewed as a financial banana republic. The Credit Suisse debacle will have serious ramifications for other Swiss financial institutions. A countrywide reputation with prudent financial management, sound regulatory oversight and, frankly, for being somewhat dour and boring regarding investments, has been wiped away.”</em></p><p>— Opimas CEO Octavio Marenzi</p><p>The worst thing is that it was totally unnecessary too. But the two big banks wanted to go play in the shark-infested waters of the US financial markets, and unsurprisingly, they were eaten alive. And yet, the government is still kowtowing before US and EU demands out of fear of being left out. But left out of what, terminal financial cancer?</p><p>It’s not as if any of the European governments are any better. Many are considerably worse. France is openly disregarding the fury of its people over pension changes. The UK and Italy are actively replacing their native populations and criminalizing all dissent.</p><p>Everything you were ever taught about “liberal democracy” was a complete and utter lie. Literally everything. Don’t forget that the next time any government mouthpiece tries to tell you about anything.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0fd7962f-c2c1-4af7-b272-213a84af3165\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The economic tide is rapidly going out and it is exposing the utterly false foundations of the Enlightenment-based societies in the process. Switzerland was once known throughout the world for its serious dedication to law, order, and direct democracy. Now, only a few months after throwing away centuries of historic neutrality on behalf of the losing side of the NATO-Russian War, even the Saudis are openly mocking the government’s false pretensions to “law” and “democracy” in the aftermath of\nthe government shenanigans\nforcing the UBS-Credit Suisse merger.\nOn Wednesday, the so-called “trinity” of the Swiss National Bank, regulator Finma and minister of finance summoned Credit Suisse chair Axel Lehmann, who was in Saudi Arabia for a conference, and chief executive Ulrich Körner for a call.\nIn the same meeting where they authorised the CHF50 billion backstop, they also delivered another message: “You will merge with UBS and announce Sunday evening before Asia opens. This is not optional,” a person briefed on the conversation recalls…\n“You make fun of dictatorships and then you can change the law over the weekend. What’s the difference between Saudi Arabia and Switzerland now? It’s really bad,” says one person close to one of the three major shareholders.\nThe international business community is not impressed.\n“Switzerland’s standing as a financial center is shattered. The country will now be viewed as a financial banana republic. The Credit Suisse debacle will have serious ramifications for other Swiss financial institutions. A countrywide reputation with prudent financial management, sound regulatory oversight and, frankly, for being somewhat dour and boring regarding investments, has been wiped away.”\n— Opimas CEO Octavio Marenzi\nThe worst thing is that it was totally unnecessary too. But the two big banks wanted to go play in the shark-infested waters of the US financial markets, and unsurprisingly, they were eaten alive. And yet, the government is still kowtowing before US and EU demands out of fear of being left out. But left out of what, terminal financial cancer?\nIt’s not as if any of the European governments are any better. Many are considerably worse. France is openly disregarding the fury of its people over pension changes. The UK and Italy are actively replacing their native populations and criminalizing all dissent.\nEverything you were ever taught about “liberal democracy” was a complete and utter lie. Literally everything. Don’t forget that the next time any government mouthpiece tries to tell you about anything.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "Clown World",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-23T07:14:40+00:00"
}