{
  "url": "https://voxday.net/2023/03/19/do-your-part/",
  "scraped_at": "2026-01-08T13:51:27.420108",
  "title": "Do Your Part",
  "date_display": "March 19, 2023",
  "date_iso": "2023-03-19T16:34:19+00:00",
  "date_from_url": "2023-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Everyone can’t afford the Library, which is why we’re working on getting paperback and free ebook editions going. But if we all attempt to preserve human knowledge, just maybe some of it will be saved somehow. Here is how to quickly and easily obtain a current backup of Project Gutenberg. If you want to help preserve the store of human knowledge, you can back up the entirety of the Project Gutenberg collection <a href=\"https://download.kiwix.org/zim/gutenberg/\">here</a>. You don’t need to download all the .zim files, just the most recent one in the language you want.</p><ul class=\"wp-block-list\"><li>March 2023 English <a href=\"https://download.kiwix.org/zim/gutenberg/gutenberg_en_all_2023-03.zim\">download</a> (69 GB)</li></ul><p>You’ll need <a href=\"https://www.kiwix.org/en/downloads/\">to download Kiwix</a> to read the file, which will provide you with the ability to export any epub or text file from it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c618e529-600e-4afe-bf72-f9a1cbdde658\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Everyone can’t afford the Library, which is why we’re working on getting paperback and free ebook editions going. But if we all attempt to preserve human knowledge, just maybe some of it will be saved somehow. Here is how to quickly and easily obtain a current backup of Project Gutenberg. If you want to help preserve the store of human knowledge, you can back up the entirety of the Project Gutenberg collection\nhere\n. You don’t need to download all the .zim files, just the most recent one in the language you want.\nMarch 2023 English\ndownload\n(69 GB)\nYou’ll need\nto download Kiwix\nto read the file, which will provide you with the ability to export any epub or text file from it.\nDISCUSS ON SG",
  "tags": [
    "books",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-19T16:34:21+00:00"
}