{
  "url": "https://voxday.net/2023/03/16/history-is-a-cycle/",
  "scraped_at": "2026-01-08T13:51:08.262877",
  "title": "History is a Cycle",
  "date_display": "March 16, 2023",
  "date_iso": "2023-03-16T09:55:13+00:00",
  "date_from_url": "2023-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alex Macris goes considerably deeper than my post on anacyclosis, as <a href=\"https://treeofwoe.substack.com/p/the-wisdom-of-naram-sim\">he contemplates the wisdom of Naram-Sim</a> to assist an inquiry into whether the facts support the idea that history is cyclical or if it is, as we are assured by Whigs and Marxists and technophiles and transhumanists alike, inevitably progressive.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Whig historiography is wrong because it falsely presupposes the inevitability of progress. If Whig historiography sees progress as a hockey stick, its arch-rival, cyclical historiography, sees progress as a sine wave. Cyclical historiography is nowadays in vogue among the dissident right, and there are a number of different cyclic theories of history.</p><p>Polybius, building on Aristotle, offered a theory of anacyclosis in which governments decay from their proper to corrupt forms and are then replaced by the next type of government in its proper form, only for that also to decay (the traditional cycle being monarchy to tyranny to aristocracy to oligarchy to democracy to mob rule). However, anacyclosis doesn’t explain what happened to Akkad.</p><p>Ibn Khaldun, the 14th century Muslim jurist, developed a theory that does, based on the concept of asabiyat (social solidarity). Professors Murat Onder and Fatih Ulasan of Ankara Yildirim Beyazit University explain:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>History, to Ibn Khaldun, is a cyclical process in which sovereign powers come to existence, get stronger, lose their strengths and are conquered by other sovereign powers over time.</p><p>More precisely, every community is uncivilized at the beginning and tries to acquire the power around its own territory. The power depends on the stronger asabiyya than other communities’ asabiyyat. Asabiyya is very powerful because people from the same asabiyya tend to protect each other at all cost and due to their wild natures, they are strong and competent fighters. Asabiyya and wild nature which trigger the success in fighting and prevent communities from embracing the comfortable life’s disadvantages walk arm in arm. If one of them decelerates, the other one acts in the same way. These features which do not degenerate are enough to invade communities which have the less asabiyyat and civilized communities which are tired of fighting and lose their wild natures.</p><p>However, over time the less civilized communities which defeat others are always inclined to imitate the more civilized societies. Due to that, the wild communities lose their nature, get used to luxury and lastly are replaced by less civilized societies having stronger asabiyyat. And this cycle is infinite…</p><p>Ibn Khaldun argues that the cycle takes about 120 years.</p></blockquote><p>Ibn Khaldun was not the only scholar to recognize this cycle. Sima Qian of China articulated the theory of the dynastic cycle. According to Qian, a dynasty begins when a charismatic and valorous leader earns the Mandate of Heaven, seizes power, and brings prosperity, and ends when through corruption and greed, the emperor loses the Mandate of Heaven and is replaced. Sima Qian’s theory lacks the causal explanation of asabiyyat; instead the cycles are caused by heavenly responses to earthly misdemeanors. It also assumes more longeval dynasties, about 200 – 300 years.</p><p>Arnold Toynbee, in his book <em>A Study of History</em>, offers a theory of civilizational cycles based on the concept of a creative minority. According to Toynbee, a creative minority rises to certain societal challenges and brings prosperity, achieves dominance, reduces the rest of the population to proletariat, and then begins to degenerate. Toynbee rejects the idea that urban life itself reduces asabiyyat, and therefore rejects the idea that a less-civilized power will grow stronger and topple the weakening hegemon. Instead, he sees the decline of a civilization as primarily internal.</p><p>The famed Oswald Spengler, in <em>Decline of the West</em>, argued that a civilization is a living organism that passes through stages of life or seasons — e.g. childhood, adolescence, adulthood, senescence or spring, summer, autumn and winter — over the course of a thousand years, with each stage lasting about 250 years. Spengler associates each civilization with a “soul” and its decline is fundamentally a spiritual one.</p><p>A more recent cyclical theory of history is Strauss-Howe generational theory. According to Strauss and Howe, historical events occur in 80-year cycles, each marked by four turnings of a generation (20 years). Strauss-Howe theory has given rise to the oft-discussed concept of the Fourth Turning. Strauss-Howe theory is based on the idea that each generation of human beings predictably differs from the prior generation based on the conditions of its upbringing. Put bluntly, a new crisis occurs when the generation that remembered the last crisis dies off and a new generation that has known only good times take the wheel of the ship of state.</p><p>The concept is often summarized using the famous quote by author G. Michael Hopf in his book <em>Those Who Remain</em>:</p><p><em>“Hard times create strong men. Strong men create good times.<br/>Good times create weak men. Weak men create hard times.”</em></p><p>Because it offers a causal mechanism based on civilizational changes, Strauss-Howe theory is close kin to Ibn Khaldun’s theory. It also has the virtue of fitting the data of my own country, the United States, relatively well.</p></blockquote><p>It’s an excellent piece. I highly recommend reading the whole thing.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1f668c66-ea89-48c1-adb0-5e4beae0e8ec\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Alex Macris goes considerably deeper than my post on anacyclosis, as\nhe contemplates the wisdom of Naram-Sim\nto assist an inquiry into whether the facts support the idea that history is cyclical or if it is, as we are assured by Whigs and Marxists and technophiles and transhumanists alike, inevitably progressive.\nWhig historiography is wrong because it falsely presupposes the inevitability of progress. If Whig historiography sees progress as a hockey stick, its arch-rival, cyclical historiography, sees progress as a sine wave. Cyclical historiography is nowadays in vogue among the dissident right, and there are a number of different cyclic theories of history.\nPolybius, building on Aristotle, offered a theory of anacyclosis in which governments decay from their proper to corrupt forms and are then replaced by the next type of government in its proper form, only for that also to decay (the traditional cycle being monarchy to tyranny to aristocracy to oligarchy to democracy to mob rule). However, anacyclosis doesn’t explain what happened to Akkad.\nIbn Khaldun, the 14th century Muslim jurist, developed a theory that does, based on the concept of asabiyat (social solidarity). Professors Murat Onder and Fatih Ulasan of Ankara Yildirim Beyazit University explain:\nHistory, to Ibn Khaldun, is a cyclical process in which sovereign powers come to existence, get stronger, lose their strengths and are conquered by other sovereign powers over time.\nMore precisely, every community is uncivilized at the beginning and tries to acquire the power around its own territory. The power depends on the stronger asabiyya than other communities’ asabiyyat. Asabiyya is very powerful because people from the same asabiyya tend to protect each other at all cost and due to their wild natures, they are strong and competent fighters. Asabiyya and wild nature which trigger the success in fighting and prevent communities from embracing the comfortable life’s disadvantages walk arm in arm. If one of them decelerates, the other one acts in the same way. These features which do not degenerate are enough to invade communities which have the less asabiyyat and civilized communities which are tired of fighting and lose their wild natures.\nHowever, over time the less civilized communities which defeat others are always inclined to imitate the more civilized societies. Due to that, the wild communities lose their nature, get used to luxury and lastly are replaced by less civilized societies having stronger asabiyyat. And this cycle is infinite…\nIbn Khaldun argues that the cycle takes about 120 years.\nIbn Khaldun was not the only scholar to recognize this cycle. Sima Qian of China articulated the theory of the dynastic cycle. According to Qian, a dynasty begins when a charismatic and valorous leader earns the Mandate of Heaven, seizes power, and brings prosperity, and ends when through corruption and greed, the emperor loses the Mandate of Heaven and is replaced. Sima Qian’s theory lacks the causal explanation of asabiyyat; instead the cycles are caused by heavenly responses to earthly misdemeanors. It also assumes more longeval dynasties, about 200 – 300 years.\nArnold Toynbee, in his book\nA Study of History\n, offers a theory of civilizational cycles based on the concept of a creative minority. According to Toynbee, a creative minority rises to certain societal challenges and brings prosperity, achieves dominance, reduces the rest of the population to proletariat, and then begins to degenerate. Toynbee rejects the idea that urban life itself reduces asabiyyat, and therefore rejects the idea that a less-civilized power will grow stronger and topple the weakening hegemon. Instead, he sees the decline of a civilization as primarily internal.\nThe famed Oswald Spengler, in\nDecline of the West\n, argued that a civilization is a living organism that passes through stages of life or seasons — e.g. childhood, adolescence, adulthood, senescence or spring, summer, autumn and winter — over the course of a thousand years, with each stage lasting about 250 years. Spengler associates each civilization with a “soul” and its decline is fundamentally a spiritual one.\nA more recent cyclical theory of history is Strauss-Howe generational theory. According to Strauss and Howe, historical events occur in 80-year cycles, each marked by four turnings of a generation (20 years). Strauss-Howe theory has given rise to the oft-discussed concept of the Fourth Turning. Strauss-Howe theory is based on the idea that each generation of human beings predictably differs from the prior generation based on the conditions of its upbringing. Put bluntly, a new crisis occurs when the generation that remembered the last crisis dies off and a new generation that has known only good times take the wheel of the ship of state.\nThe concept is often summarized using the famous quote by author G. Michael Hopf in his book\nThose Who Remain\n:\n“Hard times create strong men. Strong men create good times.\nGood times create weak men. Weak men create hard times.”\nBecause it offers a causal mechanism based on civilizational changes, Strauss-Howe theory is close kin to Ibn Khaldun’s theory. It also has the virtue of fitting the data of my own country, the United States, relatively well.\nIt’s an excellent piece. I highly recommend reading the whole thing.\nDISCUSS ON SG",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-16T09:55:15+00:00"
}