{
  "url": "https://voxday.net/2023/03/08/political-deep-fakes/",
  "scraped_at": "2026-01-08T13:50:08.326220",
  "title": "Political Deep Fakes",
  "date_display": "March 8, 2023",
  "date_iso": "2023-03-08T11:22:40+00:00",
  "date_from_url": "2023-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was entirely obvious that the Patriot Front was a fake organization from the start, despite the protests of gullibles and glowies alike on Gab about how brave the protestors had been to go out and get themselves arrested. But what’s interesting is that in addition to astroturfing the fake “right-wing” extremist protests at Charlottesville, January 6th, and the Patriot Front, there is a growing body of evidence that the FBI is also responsible for producing the George Floyd protests as well as at least some of the Antifa demonstrations, as <a href=\"https://threadreaderapp.com/thread/1594848454626668544.html\">the same people keep appearing</a> at various events across the political spectrum.</p><p>How anyone fell for any of these obvious acts of government theater is beyond me, but once more, we see that literally <em>everything </em>about Clown World is fake and gay. None of it is real, from the events to the media that reports on them and the commentators who comment on the media reports. The thing is, the entire system is going to collapse of its own weight and internal inconsistencies, not because people go out and demonstrate in the streets. All this sort of nonsense will accomplish is to completely destroy all societal trust and ensure that everything collapses, which, of course, may be the true objective of those giving these actors their orders.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-57370\" decoding=\"async\" fetchpriority=\"high\" height=\"506\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/03/image-6.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/03/image-6.png 512w, https://voxday.net/wp-content/uploads/2023/03/image-6-300x296.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/90a7cba8-0f70-4994-b3f4-7c45cd506fd7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It was entirely obvious that the Patriot Front was a fake organization from the start, despite the protests of gullibles and glowies alike on Gab about how brave the protestors had been to go out and get themselves arrested. But what’s interesting is that in addition to astroturfing the fake “right-wing” extremist protests at Charlottesville, January 6th, and the Patriot Front, there is a growing body of evidence that the FBI is also responsible for producing the George Floyd protests as well as at least some of the Antifa demonstrations, as\nthe same people keep appearing\nat various events across the political spectrum.\nHow anyone fell for any of these obvious acts of government theater is beyond me, but once more, we see that literally\neverything\nabout Clown World is fake and gay. None of it is real, from the events to the media that reports on them and the commentators who comment on the media reports. The thing is, the entire system is going to collapse of its own weight and internal inconsistencies, not because people go out and demonstrate in the streets. All this sort of nonsense will accomplish is to completely destroy all societal trust and ensure that everything collapses, which, of course, may be the true objective of those giving these actors their orders.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-08T11:57:39+00:00"
}