{
  "url": "https://voxday.net/2023/03/07/repent-boomer/",
  "scraped_at": "2026-01-08T13:49:59.095980",
  "title": "Repent, Boomer",
  "date_display": "March 7, 2023",
  "date_iso": "2023-03-07T10:34:23+00:00",
  "date_from_url": "2023-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The unrepentant wickedness of Boomers is reliably seen in their characteristic responses to criticism of their generation. Their standard defense is to blame others while claiming they did nothing wrong, which should sound familiar to anyone who has ever read the Bible.</p><p>And their incoherence is obvious when they simultaneously a) claim that it’s wrong to collectively criticize a generation while b) collectively criticizing multiple generations as clueless, inept, lazy, easily-triggered snowflakes lacking grit.</p><p>Finally, it is Satan who attempts to unite. Jesus Christ came to divide. Their defensive appeals to unity are literally satanic.</p><p>Repent, Boomer.</p><p><em>A Boomer responded on Gab <a href=\"https://gab.com/voxday/posts/109979355617978436\">to the mere sight of the cover image</a> from last night’s Darkstream, entitled The Unrepentant Evil of the Boomers.</em></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Boomer: </strong>Stop playing the jews game by blaming the boomers. That’s what they want. They want us to fight each other so that you don’t see the real culprit, the jews. The only sin of the boomers was to believe the jewish lie.</p><p><strong>Ixthys: </strong>So; pride; lust; greed; gluttony and envy; that’s quite a deviational achievement for an unrepentent generation; if we don’t recognise their achievement we’ll fall for the same tricks!</p><p><strong>Boomer: </strong>As I said, Our only sin was to believe the jewish lie. Blaming the boomers will only divide us and serve their agenda.</p><p><strong>Vox: </strong>The video is literally about you. You are unrepentant and you refuse to take responsibility for your actions. Because if you think that was your only sin, then you remain steeped in the wickedness of your generation.</p><p><strong>Boomer: </strong>Are you a jew? Silly question, you will lie if you’re a member of the tribe.</p></blockquote><p>It’s an interesting defense that not only admits to, <em>but literally demonstrates</em>, the very charges being laid against the accused. But it is not an effective one.</p><p>Repent, Boomer.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8ab2a1ec-ba53-404a-86cd-48d39e717932\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The unrepentant wickedness of Boomers is reliably seen in their characteristic responses to criticism of their generation. Their standard defense is to blame others while claiming they did nothing wrong, which should sound familiar to anyone who has ever read the Bible.\nAnd their incoherence is obvious when they simultaneously a) claim that it’s wrong to collectively criticize a generation while b) collectively criticizing multiple generations as clueless, inept, lazy, easily-triggered snowflakes lacking grit.\nFinally, it is Satan who attempts to unite. Jesus Christ came to divide. Their defensive appeals to unity are literally satanic.\nRepent, Boomer.\nA Boomer responded on Gab\nto the mere sight of the cover image\nfrom last night’s Darkstream, entitled The Unrepentant Evil of the Boomers.\nBoomer:\nStop playing the jews game by blaming the boomers. That’s what they want. They want us to fight each other so that you don’t see the real culprit, the jews. The only sin of the boomers was to believe the jewish lie.\nIxthys:\nSo; pride; lust; greed; gluttony and envy; that’s quite a deviational achievement for an unrepentent generation; if we don’t recognise their achievement we’ll fall for the same tricks!\nBoomer:\nAs I said, Our only sin was to believe the jewish lie. Blaming the boomers will only divide us and serve their agenda.\nVox:\nThe video is literally about you. You are unrepentant and you refuse to take responsibility for your actions. Because if you think that was your only sin, then you remain steeped in the wickedness of your generation.\nBoomer:\nAre you a jew? Silly question, you will lie if you’re a member of the tribe.\nIt’s an interesting defense that not only admits to,\nbut literally demonstrates\n, the very charges being laid against the accused. But it is not an effective one.\nRepent, Boomer.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-07T10:34:25+00:00"
}