{
  "url": "https://voxday.net/2023/03/17/secular-blindness-and-post-ideology/",
  "scraped_at": "2026-01-08T13:51:13.743361",
  "title": "Secular Blindness and Post-Ideology",
  "date_display": "March 17, 2023",
  "date_iso": "2023-03-17T11:21:26+00:00",
  "date_from_url": "2023-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This post by Z-Man usefully illustrates why he, and all the other secular commentators of the Right, <a href=\"https://thezman.com/wordpress/?p=29475\">are now past their use dates</a>. Because they are totally blind to the moral and religious elements of the observable globalism vs nationalism conflict, which is far less the philosophical Aristotle vs Plato than Satanic imperialism aka The Empire of Lies vs truth, anything they say is only going to be tangentially relevant to the present situation at best, and usually by sheer accident.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The old language is either inadequate or loaded with moral connotations. Calling the Biden people fascist is not entirely wrong, but not entirely accurate either. That and the word fascist comes with so much baggage that its descriptive value is completely lost.</p><p>The same can be said for words like communist and authoritarian. Even the term managerialism has been abused to the point where it often just means “bad” rather than a specific sort of organizational outlook. One of the weird parts about being trapped in the 20th century, as is the case with the West, is we are left to use moral language that no longer works in this century.</p><p>The term “Biological Leninism” is a good example. While the NRx people have accurately described some aspects of the current system, this is mostly an accident of trying to jam the current system into old models. The term itself is just a way to anathematize the current ideology by associating it with an ideology of the last century which is universally reviled.</p><p>What needs doing is a fresh look at the 20th century from an objective, historical perspective that avoids the old moral language.</p></blockquote><p>To the contrary, we don’t need a fresh, objective, historical secular perspective. That’s the very outdated sort of thinking that has placed humanity in its current peril. We need to return to the old moral language, and specifically, the historical Christian perspective upon which Western civilization was built and by which humanity advanced intellectually, morally, and technologically to heights it had never seen before.</p><p>All ideology is deception. Whether it is an ideology of the Right, such as free trade, free speech, libertarianism, Objectivism, or conservatism, or an ideology of the Left, such as socialism, communism, feminism, anti-racialism, or social justice, it is a deception and a distraction from the true and ancient conflict.</p><p>Satan is real. He rules this fallen world. And he is determined to root out every last vestige of the truth, because the truth inevitably leads to the Truth, which is Jesus Christ. That’s why the satanic imperialists lie about everything from economics to race, from science to sex, and from math to phonics. It is the essence of the truth they fear, not the specific fact in question.</p><p>We are living in a post-ideological time in a manner that exceeds mere identity politics, because every single identifiable ideology is poisoned with falsehoods in its core axioms. None of them are built on the truth, indeed, they are literally designed to deflect their adherents from the truth. And all of them observably lead to the exact same evil destination, as we are seeing take place in real time with “capitalism”, “democracy”, and “free market economies”.</p><p>Here is<a href=\"https://younggospelminister.blogspot.com/2023/03/the-jezebel-spirit.html?m=1\"> a specific example</a> of how a secular perspective literally prevents the analyst from recognizing an observable and reliable historical pattern.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Throughout history whenever a society has accepted women leadership (matriarchy), or worshipped a female Deity, this has been followed by the acceptance of homosexuality and transgenderism. Without fail. It is a remarkable convergence, especially considering that this is observed in cultures that had nothing to do with each other and could not have influenced each other, because they were separated by centuries and continents. What people, including Mark, commonly call the Jezebel spirit is really the goddess Astarte, Ashtoreth, Ishtar, Aphrodite, Artemis, etc. In other words an active demon or demons that shows up in a consistent pattern throughout history, in every continent, in unconnected cultures, but always with the same tricks.</p></blockquote><p>How can the secularist account for the repetitive historical consequences of demonic activity? He simply can’t. He can’t even take the historical facts into consideration. His intellectual framework specifically excludes the causal factor, and therefore he is forced to resort to obvious and increasingly ridiculous falsehoods in an inept attempt to explain away the observable truth.</p><p><em><a href=\"https://social.infogalactic.com/micropost/91bbcef4-28d7-43a7-8b10-2244180daac4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This post by Z-Man usefully illustrates why he, and all the other secular commentators of the Right,\nare now past their use dates\n. Because they are totally blind to the moral and religious elements of the observable globalism vs nationalism conflict, which is far less the philosophical Aristotle vs Plato than Satanic imperialism aka The Empire of Lies vs truth, anything they say is only going to be tangentially relevant to the present situation at best, and usually by sheer accident.\nThe old language is either inadequate or loaded with moral connotations. Calling the Biden people fascist is not entirely wrong, but not entirely accurate either. That and the word fascist comes with so much baggage that its descriptive value is completely lost.\nThe same can be said for words like communist and authoritarian. Even the term managerialism has been abused to the point where it often just means “bad” rather than a specific sort of organizational outlook. One of the weird parts about being trapped in the 20th century, as is the case with the West, is we are left to use moral language that no longer works in this century.\nThe term “Biological Leninism” is a good example. While the NRx people have accurately described some aspects of the current system, this is mostly an accident of trying to jam the current system into old models. The term itself is just a way to anathematize the current ideology by associating it with an ideology of the last century which is universally reviled.\nWhat needs doing is a fresh look at the 20th century from an objective, historical perspective that avoids the old moral language.\nTo the contrary, we don’t need a fresh, objective, historical secular perspective. That’s the very outdated sort of thinking that has placed humanity in its current peril. We need to return to the old moral language, and specifically, the historical Christian perspective upon which Western civilization was built and by which humanity advanced intellectually, morally, and technologically to heights it had never seen before.\nAll ideology is deception. Whether it is an ideology of the Right, such as free trade, free speech, libertarianism, Objectivism, or conservatism, or an ideology of the Left, such as socialism, communism, feminism, anti-racialism, or social justice, it is a deception and a distraction from the true and ancient conflict.\nSatan is real. He rules this fallen world. And he is determined to root out every last vestige of the truth, because the truth inevitably leads to the Truth, which is Jesus Christ. That’s why the satanic imperialists lie about everything from economics to race, from science to sex, and from math to phonics. It is the essence of the truth they fear, not the specific fact in question.\nWe are living in a post-ideological time in a manner that exceeds mere identity politics, because every single identifiable ideology is poisoned with falsehoods in its core axioms. None of them are built on the truth, indeed, they are literally designed to deflect their adherents from the truth. And all of them observably lead to the exact same evil destination, as we are seeing take place in real time with “capitalism”, “democracy”, and “free market economies”.\nHere is\na specific example\nof how a secular perspective literally prevents the analyst from recognizing an observable and reliable historical pattern.\nThroughout history whenever a society has accepted women leadership (matriarchy), or worshipped a female Deity, this has been followed by the acceptance of homosexuality and transgenderism. Without fail. It is a remarkable convergence, especially considering that this is observed in cultures that had nothing to do with each other and could not have influenced each other, because they were separated by centuries and continents. What people, including Mark, commonly call the Jezebel spirit is really the goddess Astarte, Ashtoreth, Ishtar, Aphrodite, Artemis, etc. In other words an active demon or demons that shows up in a consistent pattern throughout history, in every continent, in unconnected cultures, but always with the same tricks.\nHow can the secularist account for the repetitive historical consequences of demonic activity? He simply can’t. He can’t even take the historical facts into consideration. His intellectual framework specifically excludes the causal factor, and therefore he is forced to resort to obvious and increasingly ridiculous falsehoods in an inept attempt to explain away the observable truth.\nDISCUSS ON SG",
  "tags": [
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-17T12:39:05+00:00"
}