{
  "url": "https://voxday.net/2023/03/03/the-faith-of-the-150-holy-fathers/",
  "scraped_at": "2026-01-08T13:49:28.508684",
  "title": "The Faith of the 150 Holy Fathers",
  "date_display": "March 3, 2023",
  "date_iso": "2023-03-03T10:46:05+00:00",
  "date_from_url": "2023-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That is the correct and original name for what many Christians today erroneously call “the Nicene Creed”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At Nicaea there were present some 318 bishops, at Constantinople some 150, so the two creeds were distinguished as the Creed of the 318 holy Fathers and the Faith of the 150 holy Fathers respectively. They were so much alike that great temptation was offered to copyists to assimilate their texts. Indeed, as we shall see, the process of corruption had already begun. In course of time the revised Jerusalem Creed, often called <em>Constantinopolitanum</em>, came to be regarded as an improved recension of the Nicene Creed, and inherited all the prestige which attached to the work of the first General Council. From one point of view this development may be justified because the kernel of the teaching of the Nicene Council on the Divinity of our Lord Jesus Christ was enshrined in it, leaving outside the husk of the negative warnings, the anathemas.</p></blockquote><p>The interesting question is this: by whom was the great temptation offered? And why does the modern Church not stand by the original Nicene Creed rather than by the corrupted one that relies upon the prestige of the original council despite having been produced 56 years later?</p><p><em><a href=\"https://social.infogalactic.com/micropost/c680970b-369d-44f7-a251-9bbe3603c045\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "That is the correct and original name for what many Christians today erroneously call “the Nicene Creed”.\nAt Nicaea there were present some 318 bishops, at Constantinople some 150, so the two creeds were distinguished as the Creed of the 318 holy Fathers and the Faith of the 150 holy Fathers respectively. They were so much alike that great temptation was offered to copyists to assimilate their texts. Indeed, as we shall see, the process of corruption had already begun. In course of time the revised Jerusalem Creed, often called\nConstantinopolitanum\n, came to be regarded as an improved recension of the Nicene Creed, and inherited all the prestige which attached to the work of the first General Council. From one point of view this development may be justified because the kernel of the teaching of the Nicene Council on the Divinity of our Lord Jesus Christ was enshrined in it, leaving outside the husk of the negative warnings, the anathemas.\nThe interesting question is this: by whom was the great temptation offered? And why does the modern Church not stand by the original Nicene Creed rather than by the corrupted one that relies upon the prestige of the original council despite having been produced 56 years later?\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "history",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-03T10:46:07+00:00"
}