{
  "url": "https://voxday.net/2023/03/06/they-loved-mammon-more/",
  "scraped_at": "2026-01-08T13:49:53.884213",
  "title": "They Loved Mammon More",
  "date_display": "March 6, 2023",
  "date_iso": "2023-03-06T11:52:15+00:00",
  "date_from_url": "2023-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Gab reader reacts to <a href=\"https://gab.com/voxday/posts/109972851092203386\">my response to a Boomer</a> smugly asserting how glad he is that his childhood and youth were better than those of subsequent generations.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Why did boomers not value their children or grandchildren? My parents (and his) had no time for me or for my children. Or we had to pack up the babies and drive to them. They didn’t seem to remember how hard it was to travel with small children. I was left alone as a child to raise myself in front of a TV while my parents worked. Asking around and I’ve found my peers had similar experiences.</p><p>Those same parents scoffed at my husband and me for keeping me at home and living on less so I could raise our kids. My husband and I planted the seeds of trees whose shade we’ll never know. There’s a distinct lack of humility with many boomers I’ve encountered. The Bible has lots to say on the subject of pride. My parents sit on their pile of wealth and wonder why they’re lonely. The greatest generation will be the one that glorifies God and encourages others to repent. Music, clothes, cars are fun but fleeting. Folly. People matter. Pour your life out for your family, your church, your community and you will find life more abundantly.</p></blockquote><p>Another child of the Boomers expresses his own inability to comprehend the way in which most Boomers simply don’t give a damn about the well-being of their children and grandchildren.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I know the feeling. Its hard for me to grasp sometimes. All I want to do is build a legacy for my children. Real wealth as an inheritance for them. All my father wants to do is accumulate money with me having no part in it. He actively avoided bringing me into his business to the point where I had to join the military to improve the station of my family. Its something I will never understand.</p></blockquote><p>I’ve seen this repeatedly in the Boomers of my acquaintance. Unlike my grandparents, with whom I was close enough that I would drive down from college to spend my holiday weekends with them, they’d rather live around others their own age and occupy themselves with meaningless social activities than spend time with their grandkids. As owners and executives, they cling to control even when they literally never come into the office instead of handing over responsibility to their eventual successors. And if they find themselves in a position where they have to choose between a sum of money and a relationship with someone, they will choose the former <em>every single time</em>.</p><p>Why is this? I genuinely don’t know. But in contrast, I see my Generation X peers already preparing succession plans even though they’re only in their 50s, pushing their children to accept as much responsibility as they can reasonably handle, and in general, preparing for a future in which they will play no part. Because we understand that legacy matters far more than dying with the most toys.</p><p><em><a href=\"https://social.infogalactic.com/micropost/673b413e-65fe-4637-8356-00c3af8e83ce\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A Gab reader reacts to\nmy response to a Boomer\nsmugly asserting how glad he is that his childhood and youth were better than those of subsequent generations.\nWhy did boomers not value their children or grandchildren? My parents (and his) had no time for me or for my children. Or we had to pack up the babies and drive to them. They didn’t seem to remember how hard it was to travel with small children. I was left alone as a child to raise myself in front of a TV while my parents worked. Asking around and I’ve found my peers had similar experiences.\nThose same parents scoffed at my husband and me for keeping me at home and living on less so I could raise our kids. My husband and I planted the seeds of trees whose shade we’ll never know. There’s a distinct lack of humility with many boomers I’ve encountered. The Bible has lots to say on the subject of pride. My parents sit on their pile of wealth and wonder why they’re lonely. The greatest generation will be the one that glorifies God and encourages others to repent. Music, clothes, cars are fun but fleeting. Folly. People matter. Pour your life out for your family, your church, your community and you will find life more abundantly.\nAnother child of the Boomers expresses his own inability to comprehend the way in which most Boomers simply don’t give a damn about the well-being of their children and grandchildren.\nI know the feeling. Its hard for me to grasp sometimes. All I want to do is build a legacy for my children. Real wealth as an inheritance for them. All my father wants to do is accumulate money with me having no part in it. He actively avoided bringing me into his business to the point where I had to join the military to improve the station of my family. Its something I will never understand.\nI’ve seen this repeatedly in the Boomers of my acquaintance. Unlike my grandparents, with whom I was close enough that I would drive down from college to spend my holiday weekends with them, they’d rather live around others their own age and occupy themselves with meaningless social activities than spend time with their grandkids. As owners and executives, they cling to control even when they literally never come into the office instead of handing over responsibility to their eventual successors. And if they find themselves in a position where they have to choose between a sum of money and a relationship with someone, they will choose the former\nevery single time\n.\nWhy is this? I genuinely don’t know. But in contrast, I see my Generation X peers already preparing succession plans even though they’re only in their 50s, pushing their children to accept as much responsibility as they can reasonably handle, and in general, preparing for a future in which they will play no part. Because we understand that legacy matters far more than dying with the most toys.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-06T11:52:18+00:00"
}