{
  "url": "https://voxday.net/2023/03/20/vaccine-denial/",
  "scraped_at": "2026-01-08T13:51:31.135778",
  "title": "Vaccine Denial",
  "date_display": "March 20, 2023",
  "date_iso": "2023-03-20T10:54:06+00:00",
  "date_from_url": "2023-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I said it was probably going to take at least three, and more likely five people dropping dead around them for the vaccinated to recognize that it is the Covid-19 “vaccine” that is killing them. It turns out that I was optimistic. People <a href=\"https://www.todayonline.com/singapore/adulting-101-untimely-deaths-friends-existential-crisis-2131826\">have turned out to be even more retarded</a>, and even more in denial, than I had hitherto believed possible.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>SINGAPORE — In the last two years, five people I knew died from sudden cardiac arrest. They were young and seemingly healthy people whose untimely demise came as a shock to their family and friends.</p><p>They ranged in age from about 25 to 35.</p><p>The grief hit me pretty hard, as I felt a lot of guilt and regret about my relationship with some of them. It got me to thinking — are more young people dying from sudden cardiac arrest? And should I be worried?</p><p>Cardiologists from the National University Heart Centre Singapore told me that the risk of sudden deaths in young people remains exceedingly low. While uncommon, there are underlying conditions among young adults that can lead to sudden deaths, such as hypertrophic cardiomypathy (abnormal thickening of heart muscles) or arrhythmias (abnormal heart rhythm of genetic causes), another cardiologist said.</p></blockquote><p><em>It’s the vaxx, you literal retards.</em> This really isn’t that hard? How do people this blind manage to successfully cross the street without getting run over? Maybe they’ll finally make the connection when ten of their vaccinated acquaintances die of Suddenly.</p><p>Then again, maybe not.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2ff2b1ee-81c0-4fde-b503-a4e22e999418\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I said it was probably going to take at least three, and more likely five people dropping dead around them for the vaccinated to recognize that it is the Covid-19 “vaccine” that is killing them. It turns out that I was optimistic. People\nhave turned out to be even more retarded\n, and even more in denial, than I had hitherto believed possible.\nSINGAPORE — In the last two years, five people I knew died from sudden cardiac arrest. They were young and seemingly healthy people whose untimely demise came as a shock to their family and friends.\nThey ranged in age from about 25 to 35.\nThe grief hit me pretty hard, as I felt a lot of guilt and regret about my relationship with some of them. It got me to thinking — are more young people dying from sudden cardiac arrest? And should I be worried?\nCardiologists from the National University Heart Centre Singapore told me that the risk of sudden deaths in young people remains exceedingly low. While uncommon, there are underlying conditions among young adults that can lead to sudden deaths, such as hypertrophic cardiomypathy (abnormal thickening of heart muscles) or arrhythmias (abnormal heart rhythm of genetic causes), another cardiologist said.\nIt’s the vaxx, you literal retards.\nThis really isn’t that hard? How do people this blind manage to successfully cross the street without getting run over? Maybe they’ll finally make the connection when ten of their vaccinated acquaintances die of Suddenly.\nThen again, maybe not.\nDISCUSS ON SG",
  "tags": [
    "health care",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-03-20T10:54:07+00:00"
}