{
  "url": "https://voxday.net/2013/02/13/a-new-blog-and-some-book-reviews/",
  "scraped_at": "2025-12-14T22:20:35.201513",
  "title": "A new blog and some book reviews",
  "date_display": "February 13, 2013",
  "date_iso": "2013-02-13T18:00:00+00:00",
  "date_from_url": "2013-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zero Sum inaugurates his new blog with <a href=\"http://ciphrasummam.blogspot.ch/2013/02/book-review-throne-of-bones.html\">a review of A THRONE OF BONES</a>:</p><blockquote class=\"tr_bq\"><p> This book is monumental. The sheer size of the hardback version is simply staggering. On the cover, there is an intricate array of bronzed scrollwork surrounding a skull. Its quality, finish, and attention to detail are readily apparent. It sits on my bookshelf and carries a commanding presence that is only rivaled by Webster in mass, and very few in quality. Each chapter has a header using the skull and some artwork, it’s a nice touch.</p><p>But you don’t buy the book for its cover, so onto the details. The book uses multiple points of view throughout the book highlighting and interlocking web of storylines…. The book to me was initially very complex, between the characters, terrain, alliances, politics and military strategy.</p></blockquote><p>I should probably mention that the second print run of the hardcover does not feature the skull from the cover as a chapter heading, but replaces it with new artwork by the cover artist featuring a pair of wyverns with their tails intertwined.  The dustjacket is also now gloss rather than matte, and the errata from the first run has been corrected.</p><p><a href=\"http://didactsreach.blogspot.com/2013/01/book-review-throne-of-bones-by-vox-day.html\">Didact’s Reach reviewed the novel</a> and actually found it superior to Martin’s series.  I wouldn’t go that far myself, but it’s certainly encouraging to know that it at least merits the comparison.</p><blockquote class=\"tr_bq\"><p> I’ve read every one of the books in A Song of Ice and Fire, and this beats the pants off all of them. Even A Storm of Swords. Seriously. It’s that good.</p><p>This book works because it doesn’t pretend to be more than it is- an epic historical fantasy novel. The utterly depressing and frankly pointless moral nihilism of ASOIAF is nowhere to be found; in its place is a powerful and uplifting vision of faith and republican virtue, challenged as it is on every side by civil war, dark magic, and loss of faith. The frankly ludicrous “realistic” sex scenes in ASOIAF are thankfully nowhere to be found here; in fact, the sex is kept largely out of sight, which I think is a good thing, as it reduces the number of distractions significantly. It doesn’t try to do anything other than tell a truly epic story. And if you’re an avid reader of historical fiction and non-fiction, of the Ross Leckie/Robert Harris variety, then you’re in for a real treat.</p><p>ATOB is set in the same intriguing fictional world of Selenoth as SE, a world that fuses the best traditions of the ancient Roman Republic with many of the ideas of the Christian Church as embodied by the Holy Roman Empire. The world is both strange and familiar, and as a literary device, I have to say, this is damned effective. I’ve read my share of Roman history too, so I really appreciated the little details that Vox put into the book. For instance, the scene in which Valerius Corvus observes the “coronation” (if that is the correct word) of the new Holy Father is exactly what I would expect from the martial and spiritual traditions of a Roman Republic, where god-kings were cast aside in favour of Republican rule, combined with the clear separation of Church and State that is a founding principle of Christian theology. The battle scenes are particularly effective displays of Vox’s thorough command of military history; he switches almost effortlessly between individual perspectives of the horror of battle to large-scale tactical views of the conflicts, without losing coherence or purpose.</p></blockquote><p>This thread at r/Fantasy is more than a little amusing.  <a href=\"http://www.reddit.com/r/Fantasy/comments/16nn80/im_really_enjoying_a_throne_of_bones_best_not_to/\"> I’m really enjoying “A Throne of Bones.” Best not to read about the author first.</a> It’s a delight to see the always-open minds of the fantasy-reading rabbits at work. I particularly enjoyed this remark: “I just googled the guy and I already hate him.” But I quite appreciate reluctant praise from those who dislike or even despise me, as it is arguably the most meaningful.</p><p><a href=\"http://grandallusions.wordpress.com/2013/01/18/book-review-throne-bones/\">Allusions of Grandeur</a> also reviewed the book, but you may want to think twice about reading the review as it does contain a spoiler or two despite the reviewer’s apparent desire to avoid them.</p><blockquote class=\"tr_bq\"><p> A Throne of Bones is a long, remarkably dense work of fiction.  That it is well-written and compelling helps to hide this fact, especially when you read this in the Kindle format, for once you start reading, it is very difficult to stop.  As such, the sheer entertainment value coupled with Vox’s need to constantly propel the plot forward at a rather fast clip (much like what you would expect from the TV show 24), makes this book seem shorter than it is.</p><p>I will not attempt to summarize the plot, as a) I don’t want to reveal spoilers and b) doing so would almost be a novel unto itself.  Nonetheless, the plot of this book revolves primarily around war, and most of the subplots revolve around this as well.</p><p>What makes this book both an entertaining and fascinating read is that Vox draws on his rather tremendous depth of knowledge and literary theory to create a world that is quite imaginative and “realistic,” which is in turn populated with characters that are interesting, sympathetic, and multi-dimensional…. a good portion of the plot conflicts are moral conflicts, which make the<br> conflicts meaningful.  The characters are not random actors that exist<br> simply as plot devices.  Rather, they are characters with their own<br> beliefs, motivations and moral codes.  Whether you agree with any given<br> character’s motivations or not, you cannot deny that any given<br> character’s motivations are what make the story so compelling.  In fact,<br> the constant moral conflict found with Marcus Valerius is what makes<br> him such a compelling character.  Watching him struggle with him<br> adjusting his theological studies to the real world of war causes you to<br> sympathize with him.</br></br></br></br></br></br></br></br></br></p></blockquote></div>",
  "content_text": "Zero Sum inaugurates his new blog with\na review of A THRONE OF BONES\n:\nThis book is monumental. The sheer size of the hardback version is simply staggering. On the cover, there is an intricate array of bronzed scrollwork surrounding a skull. Its quality, finish, and attention to detail are readily apparent. It sits on my bookshelf and carries a commanding presence that is only rivaled by Webster in mass, and very few in quality. Each chapter has a header using the skull and some artwork, it’s a nice touch.\nBut you don’t buy the book for its cover, so onto the details. The book uses multiple points of view throughout the book highlighting and interlocking web of storylines…. The book to me was initially very complex, between the characters, terrain, alliances, politics and military strategy.\nI should probably mention that the second print run of the hardcover does not feature the skull from the cover as a chapter heading, but replaces it with new artwork by the cover artist featuring a pair of wyverns with their tails intertwined.  The dustjacket is also now gloss rather than matte, and the errata from the first run has been corrected.\nDidact’s Reach reviewed the novel\nand actually found it superior to Martin’s series.  I wouldn’t go that far myself, but it’s certainly encouraging to know that it at least merits the comparison.\nI’ve read every one of the books in A Song of Ice and Fire, and this beats the pants off all of them. Even A Storm of Swords. Seriously. It’s that good.\nThis book works because it doesn’t pretend to be more than it is- an epic historical fantasy novel. The utterly depressing and frankly pointless moral nihilism of ASOIAF is nowhere to be found; in its place is a powerful and uplifting vision of faith and republican virtue, challenged as it is on every side by civil war, dark magic, and loss of faith. The frankly ludicrous “realistic” sex scenes in ASOIAF are thankfully nowhere to be found here; in fact, the sex is kept largely out of sight, which I think is a good thing, as it reduces the number of distractions significantly. It doesn’t try to do anything other than tell a truly epic story. And if you’re an avid reader of historical fiction and non-fiction, of the Ross Leckie/Robert Harris variety, then you’re in for a real treat.\nATOB is set in the same intriguing fictional world of Selenoth as SE, a world that fuses the best traditions of the ancient Roman Republic with many of the ideas of the Christian Church as embodied by the Holy Roman Empire. The world is both strange and familiar, and as a literary device, I have to say, this is damned effective. I’ve read my share of Roman history too, so I really appreciated the little details that Vox put into the book. For instance, the scene in which Valerius Corvus observes the “coronation” (if that is the correct word) of the new Holy Father is exactly what I would expect from the martial and spiritual traditions of a Roman Republic, where god-kings were cast aside in favour of Republican rule, combined with the clear separation of Church and State that is a founding principle of Christian theology. The battle scenes are particularly effective displays of Vox’s thorough command of military history; he switches almost effortlessly between individual perspectives of the horror of battle to large-scale tactical views of the conflicts, without losing coherence or purpose.\nThis thread at r/Fantasy is more than a little amusing.\nI’m really enjoying “A Throne of Bones.” Best not to read about the author first.\nIt’s a delight to see the always-open minds of the fantasy-reading rabbits at work. I particularly enjoyed this remark: “I just googled the guy and I already hate him.” But I quite appreciate reluctant praise from those who dislike or even despise me, as it is arguably the most meaningful.\nAllusions of Grandeur\nalso reviewed the book, but you may want to think twice about reading the review as it does contain a spoiler or two despite the reviewer’s apparent desire to avoid them.\nA Throne of Bones is a long, remarkably dense work of fiction.  That it is well-written and compelling helps to hide this fact, especially when you read this in the Kindle format, for once you start reading, it is very difficult to stop.  As such, the sheer entertainment value coupled with Vox’s need to constantly propel the plot forward at a rather fast clip (much like what you would expect from the TV show 24), makes this book seem shorter than it is.\nI will not attempt to summarize the plot, as a) I don’t want to reveal spoilers and b) doing so would almost be a novel unto itself.  Nonetheless, the plot of this book revolves primarily around war, and most of the subplots revolve around this as well.\nWhat makes this book both an entertaining and fascinating read is that Vox draws on his rather tremendous depth of knowledge and literary theory to create a world that is quite imaginative and “realistic,” which is in turn populated with characters that are interesting, sympathetic, and multi-dimensional…. a good portion of the plot conflicts are moral conflicts, which make the\nconflicts meaningful.  The characters are not random actors that exist\nsimply as plot devices.  Rather, they are characters with their own\nbeliefs, motivations and moral codes.  Whether you agree with any given\ncharacter’s motivations or not, you cannot deny that any given\ncharacter’s motivations are what make the story so compelling.  In fact,\nthe constant moral conflict found with Marcus Valerius is what makes\nhim such a compelling character.  Watching him struggle with him\nadjusting his theological studies to the real world of war causes you to\nsympathize with him.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-13T18:00:00+00:00"
}