{
  "url": "https://voxday.net/2013/02/11/a-portrait-in-epistemic-closure/",
  "scraped_at": "2025-12-14T22:20:23.054110",
  "title": "A portrait in epistemic closure",
  "date_display": "February 11, 2013",
  "date_iso": "2013-02-11T22:11:00+00:00",
  "date_from_url": "2013-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found the Fowl Atheist’s <a href=\"http://freethoughtblogs.com/pharyngula/2013/02/10/i-am-asked-a-question-about-commenting/\">response to his sole dissenter</a> to be more than a little amusing.  He genuinely doesn’t see the irony in it.</p><blockquote class=\"tr_bq\"><p> <i>PZ I ask you – given the footfall of Pharyngula; the contentious<br> nature of the subjects in question; the substantial number of people who<br> disagree with your position; the way in which you are regarded as a<br> lead figure in many of these things; given all of this, is it really<br> credible for you claim you don’t mind reasonable dissent when you<br> appear, for all the world, to not have a single regular dissenter who<br> has not been banned?</br></br></br></br></br></br></i></p><p><i><br> </br></i><i><br> You may think I am a troll but please don’t mix up trolls with idiots.<br> If you had a good couple of dozen REGULAR dissenting posters on these<br> issues your arguments would look more convincing. In my couple of months<br> before being banned I never encountered a single one. Not one. Nada.<br> Zilch.</br></br></br></br></br></i></p><p>Why don’t I tolerate dissent, from a dissenter who posted here for<br> over 4 months, making 168 comments. I have to say, this is a remarkably<br> stupid question….  But all right, I’ll just assume that he’s not very bright and explain<br> the obvious. There are a number of reasons why you aren’t ever going to<br> see mobs of angry dissenters here.</br></br></br></br></p><p>This is a <b>self-selected community</b>. Look at the header on the<br> blog: liberals, atheists, science-minded people will congregate here.<br> It’s a successful center for that kind of person, and that means that<br> people with different views — well, those that have a speck of<br> self-awareness — will know that they are going to be a tiny minority in a<br> swarm of opinionated, outspoken, ferocious liberals. Venturing here<br> will be daunting. The mirror of community is that there will also be<br> self-selected avoidance….</br></br></br></br></br></br></br></p><p>One last remark: sometimes there is no such thing as reasonable dissent on certain issues. Sometimes <b>trolls are idiots</b>.<br> NoelPlum99 lasted as long as he did because he didn’t come right out<br> and shout some intolerable stupidity; I will, for instance, ban racists<br> on sight, because their arguments are not in any way scientifically or<br> ethically defensible, and in fact are simply odious and evil. NoelPlum99<br> was smugly privileged and dense, but there was some faint hope that he<br> might actually wake up and recognize his own blinkered view, a hope that<br> faded fairly rapidly.</br></br></br></br></br></br></br></p><p>But otherwise, there are views that I find insufferably stupid, that<br> only idiots would hold, and I’m happy to make this environment as<br> hostile as possible to them. There are no rational grounds, no context<br> for reasonable dissent, for being anti-feminist, for instance, or<br> denying that our culture is deeply patriarchal and sexist. I can see<br> reasonable argument about how we ought to deal with this fact of life,<br> but denial (or worse, the kind of inane argument so many make that “why,<br> calling someone a ‘cunt’ is not a reflection of <i>de facto</i><br> sexism!”) is going to be fired upon with all ferocity and anyone holding<br> such a view is going to find interacting here intolerable and<br> infuriating, leading to them lashing out and trying to turn the whole<br> blog into a brawl over some really idiotic issues.</br></br></br></br></br></br></br></br></br></br></br></p><p>And then they get banhammered.</p><p>Because really, how do you express “reasonable dissent” from the view<br> that women are people, and that our society institutionalizes<br> discrimination of all sorts?</br></br></p></blockquote><p>Wow, 168 comments in four months from one dissenter!  I think Tad and Asher, just to name two dissenters here, have it in them to beat that on a single post if they were given even the slightest encouragement.  What I find amusing here is that PZ drives a second nail in the coffin of dh’s case concerning how the Left won’t have any problem with realizing that there is an increasing amount of scientific evidence supporting what it considers “racism”.  The fact that PZ is a professional biologist in denial of both genetics and the logic of natural selection only makes the situation all the funnier.</p><p>I’ll draw your attention to these two statements:</p><ol><li>“[T]here is no such thing as reasonable dissent on certain issues.”   </li><li>“There are no rational grounds, no context<br> for reasonable dissent, for being anti-feminist….”</br></li></ol><p>This is why PZ twice ran away from the challenge of a debate with me.  It’s not because he’s too busy.  It’s not because I’m a crackpot.  It’s not because he has a reputation worth protecting.  It is, at least in part, because his ideology is his religion and he can’t bear to have his faith questioned, much less risk seeing it demolished in public.  He has no dissenters because he lacks the confidence in his ability to defend his arguments against them.</p><p>But there is no reason to debate him any longer.  We can safely leave him to preach to his angry and anti-intellectual choir, secure in the knowledge that his moment has passed and he no longer even merits the attention of trolls.</p><p>As always, I welcome any dissenting opinions.  Make your case… if you can.  Unless you’re Tad, in which case you’ll have to make your case in five comments or less.  Being open to dissent does not mean that either monologues or monomania are welcome, however, and I advise that if someone demonstrates that you are wrong, you should have the good sense and the good grace to admit it.  Here’s a little secret: <i>the state of being incorrect does not hinge upon one’s willingness to own up to it.</i></p></div>",
  "content_text": "I found the Fowl Atheist’s\nresponse to his sole dissenter\nto be more than a little amusing.  He genuinely doesn’t see the irony in it.\nPZ I ask you – given the footfall of Pharyngula; the contentious\nnature of the subjects in question; the substantial number of people who\ndisagree with your position; the way in which you are regarded as a\nlead figure in many of these things; given all of this, is it really\ncredible for you claim you don’t mind reasonable dissent when you\nappear, for all the world, to not have a single regular dissenter who\nhas not been banned?\nYou may think I am a troll but please don’t mix up trolls with idiots.\nIf you had a good couple of dozen REGULAR dissenting posters on these\nissues your arguments would look more convincing. In my couple of months\nbefore being banned I never encountered a single one. Not one. Nada.\nZilch.\nWhy don’t I tolerate dissent, from a dissenter who posted here for\nover 4 months, making 168 comments. I have to say, this is a remarkably\nstupid question….  But all right, I’ll just assume that he’s not very bright and explain\nthe obvious. There are a number of reasons why you aren’t ever going to\nsee mobs of angry dissenters here.\nThis is a\nself-selected community\n. Look at the header on the\nblog: liberals, atheists, science-minded people will congregate here.\nIt’s a successful center for that kind of person, and that means that\npeople with different views — well, those that have a speck of\nself-awareness — will know that they are going to be a tiny minority in a\nswarm of opinionated, outspoken, ferocious liberals. Venturing here\nwill be daunting. The mirror of community is that there will also be\nself-selected avoidance….\nOne last remark: sometimes there is no such thing as reasonable dissent on certain issues. Sometimes\ntrolls are idiots\n.\nNoelPlum99 lasted as long as he did because he didn’t come right out\nand shout some intolerable stupidity; I will, for instance, ban racists\non sight, because their arguments are not in any way scientifically or\nethically defensible, and in fact are simply odious and evil. NoelPlum99\nwas smugly privileged and dense, but there was some faint hope that he\nmight actually wake up and recognize his own blinkered view, a hope that\nfaded fairly rapidly.\nBut otherwise, there are views that I find insufferably stupid, that\nonly idiots would hold, and I’m happy to make this environment as\nhostile as possible to them. There are no rational grounds, no context\nfor reasonable dissent, for being anti-feminist, for instance, or\ndenying that our culture is deeply patriarchal and sexist. I can see\nreasonable argument about how we ought to deal with this fact of life,\nbut denial (or worse, the kind of inane argument so many make that “why,\ncalling someone a ‘cunt’ is not a reflection of\nde facto\nsexism!”) is going to be fired upon with all ferocity and anyone holding\nsuch a view is going to find interacting here intolerable and\ninfuriating, leading to them lashing out and trying to turn the whole\nblog into a brawl over some really idiotic issues.\nAnd then they get banhammered.\nBecause really, how do you express “reasonable dissent” from the view\nthat women are people, and that our society institutionalizes\ndiscrimination of all sorts?\nWow, 168 comments in four months from one dissenter!  I think Tad and Asher, just to name two dissenters here, have it in them to beat that on a single post if they were given even the slightest encouragement.  What I find amusing here is that PZ drives a second nail in the coffin of dh’s case concerning how the Left won’t have any problem with realizing that there is an increasing amount of scientific evidence supporting what it considers “racism”.  The fact that PZ is a professional biologist in denial of both genetics and the logic of natural selection only makes the situation all the funnier.\nI’ll draw your attention to these two statements:\n“[T]here is no such thing as reasonable dissent on certain issues.”\n“There are no rational grounds, no context\nfor reasonable dissent, for being anti-feminist….”\nThis is why PZ twice ran away from the challenge of a debate with me.  It’s not because he’s too busy.  It’s not because I’m a crackpot.  It’s not because he has a reputation worth protecting.  It is, at least in part, because his ideology is his religion and he can’t bear to have his faith questioned, much less risk seeing it demolished in public.  He has no dissenters because he lacks the confidence in his ability to defend his arguments against them.\nBut there is no reason to debate him any longer.  We can safely leave him to preach to his angry and anti-intellectual choir, secure in the knowledge that his moment has passed and he no longer even merits the attention of trolls.\nAs always, I welcome any dissenting opinions.  Make your case… if you can.  Unless you’re Tad, in which case you’ll have to make your case in five comments or less.  Being open to dissent does not mean that either monologues or monomania are welcome, however, and I advise that if someone demonstrates that you are wrong, you should have the good sense and the good grace to admit it.  Here’s a little secret:\nthe state of being incorrect does not hinge upon one’s willingness to own up to it.",
  "tags": [
    "PZ"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-11T22:11:00+00:00"
}