{
  "url": "https://voxday.net/2013/02/06/a-turkish-arabian-war/",
  "scraped_at": "2025-12-14T22:19:51.296225",
  "title": "A Turkish Arabian war",
  "date_display": "February 6, 2013",
  "date_iso": "2013-02-06T20:08:00+00:00",
  "date_from_url": "2013-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lt. Col. Joel Rayburn sees <a href=\"http://www.hoover.org/publications/defining-ideas/article/139881\">a more widespread war on its way</a> in the Middle East:</p><blockquote class=\"tr_bq\"><p> We can envision, then, a sectarian war raging across the whole of the<br> Fertile Crescent, drawing in all the former territories of Turkish<br> Arabia. The prospect will be a frightening one for the region’s major<br> powers. Both Turkey and Saudi Arabia could one day find chaos rather<br> than functioning states on their permeable borders. If Al Qaeda/Nusrah<br> can establish a base in Jordan, Saudi Arabia will find itself threatened<br> by Al Qaeda franchises on both north and south that will be<br> well-positioned to resume the pursuit of Al Qaeda’s core goal of<br> toppling the Saudi monarchy and “liberating” the holy cities of Mecca<br> and Medina.</br></br></br></br></br></br></br></br></br></p><p>The Saudis showed great resiliency in defeating a serious Al Qaeda<br> insurrection in 2004-2008, but that was a strictly internal threat that<br> lacked a real foreign base. Simultaneous Al Qaeda bases in Jordan and<br> Yemen would pose a more serious, if not an existential, threat to Saudi<br> rule. If watching the fall or near-fall of half a dozen regimes in the<br> Arab Spring has taught us anything, it should be that the Arab states<br> that appeared serenely stable to outsiders for the past half century<br> were more brittle than we have understood. The implosion of Turkish<br> Arabia would test those regimes to the limit, and we cannot assume that<br> the rulers of Jordan, Saudi Arabia, and Kuwait would be any better<br> equipped to defeat the potential challenge than Muammar Qaddhafi and<br> Bashar al-Assad were.</br></br></br></br></br></br></br></br></br></br></br></p><p>The rulers of Turkey, Saudi Arabia, Iraq, and Iran are surely not<br> blind to this nightmare scenario. As the situation in Turkish Arabia<br> continues to unravel, those regional powers will be compelled to become<br> ever deeper involved in an attempt to keep the tide of war from breaking<br> on their own lands. This conflict could very well touch us all, perhaps<br> becoming an engine of jihad that spews forth attackers bent on bombing<br> western embassies and cities or disrupting Persian Gulf oil markets long<br> before the fire burns out.</br></br></br></br></br></br></br></p><p>And what of Turkish Arabia in the long run? One eminent scholar of<br> the Middle East assures me that the borders drawn by the British and<br> French were artificial, yes, but now have staying power. The people of<br> the region are too used to the lines to erase them, even if they don’t<br> love them. I don’t doubt him, and I am sure that whatever else happens,<br> there will continue to be a Syria, a Lebanon, a Jordan, and an Iraq. But<br> those countries are about to pass through a crucible, a painful test in<br> which their peoples will be sorted by sect; driven from traditional<br> homelands; starved, taxed, or pressed into service by warlords;<br> terrorized by militant Islamists; forced to witness their ancient<br> heritage destroyed by bombs; and live without the rule of law. It will<br> be terrible to watch, and we will not be left unsullied in our watching.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p> If it weren’t for the oil of the Middle East, this would be a solution, not a problem.  As it stands, I can’t help but wonder if the potentates of the EU are praying for just such a distraction, as it would allow them the freedom to aggressively address their own Muslim problem.  The principle of Distract, Divide, and Conquer would indicate that once the war got started, there would be no coherent force supporting the Muslims of Europe, who for all their press make up less than 5 percent of the European population.</p><p>I tend to doubt that the atheists in Brussels, Paris, and Berlin are any fonder of Muslims than they are of Christians and the ideological and demographic forces of Islam are already much more troubling to the godless potentates in the various capitals than the weak and toothless version of Christianity that is perhaps best exemplified by the ex-Archbishop of Canterbury.  The grandees may be afraid of conflict with the Ummah now, but that fear will likely vanish should war erupt throughout the House of Submission.</p><p>And Israel would certainly be delighted to see the Islamic world tearing itself apart; one tends to imagine it will do what it can to light whatever fuses might be on hand to help set its enemies at each others’ throats.</p></div>",
  "content_text": "Lt. Col. Joel Rayburn sees\na more widespread war on its way\nin the Middle East:\nWe can envision, then, a sectarian war raging across the whole of the\nFertile Crescent, drawing in all the former territories of Turkish\nArabia. The prospect will be a frightening one for the region’s major\npowers. Both Turkey and Saudi Arabia could one day find chaos rather\nthan functioning states on their permeable borders. If Al Qaeda/Nusrah\ncan establish a base in Jordan, Saudi Arabia will find itself threatened\nby Al Qaeda franchises on both north and south that will be\nwell-positioned to resume the pursuit of Al Qaeda’s core goal of\ntoppling the Saudi monarchy and “liberating” the holy cities of Mecca\nand Medina.\nThe Saudis showed great resiliency in defeating a serious Al Qaeda\ninsurrection in 2004-2008, but that was a strictly internal threat that\nlacked a real foreign base. Simultaneous Al Qaeda bases in Jordan and\nYemen would pose a more serious, if not an existential, threat to Saudi\nrule. If watching the fall or near-fall of half a dozen regimes in the\nArab Spring has taught us anything, it should be that the Arab states\nthat appeared serenely stable to outsiders for the past half century\nwere more brittle than we have understood. The implosion of Turkish\nArabia would test those regimes to the limit, and we cannot assume that\nthe rulers of Jordan, Saudi Arabia, and Kuwait would be any better\nequipped to defeat the potential challenge than Muammar Qaddhafi and\nBashar al-Assad were.\nThe rulers of Turkey, Saudi Arabia, Iraq, and Iran are surely not\nblind to this nightmare scenario. As the situation in Turkish Arabia\ncontinues to unravel, those regional powers will be compelled to become\never deeper involved in an attempt to keep the tide of war from breaking\non their own lands. This conflict could very well touch us all, perhaps\nbecoming an engine of jihad that spews forth attackers bent on bombing\nwestern embassies and cities or disrupting Persian Gulf oil markets long\nbefore the fire burns out.\nAnd what of Turkish Arabia in the long run? One eminent scholar of\nthe Middle East assures me that the borders drawn by the British and\nFrench were artificial, yes, but now have staying power. The people of\nthe region are too used to the lines to erase them, even if they don’t\nlove them. I don’t doubt him, and I am sure that whatever else happens,\nthere will continue to be a Syria, a Lebanon, a Jordan, and an Iraq. But\nthose countries are about to pass through a crucible, a painful test in\nwhich their peoples will be sorted by sect; driven from traditional\nhomelands; starved, taxed, or pressed into service by warlords;\nterrorized by militant Islamists; forced to witness their ancient\nheritage destroyed by bombs; and live without the rule of law. It will\nbe terrible to watch, and we will not be left unsullied in our watching.\nIf it weren’t for the oil of the Middle East, this would be a solution, not a problem.  As it stands, I can’t help but wonder if the potentates of the EU are praying for just such a distraction, as it would allow them the freedom to aggressively address their own Muslim problem.  The principle of Distract, Divide, and Conquer would indicate that once the war got started, there would be no coherent force supporting the Muslims of Europe, who for all their press make up less than 5 percent of the European population.\nI tend to doubt that the atheists in Brussels, Paris, and Berlin are any fonder of Muslims than they are of Christians and the ideological and demographic forces of Islam are already much more troubling to the godless potentates in the various capitals than the weak and toothless version of Christianity that is perhaps best exemplified by the ex-Archbishop of Canterbury.  The grandees may be afraid of conflict with the Ummah now, but that fear will likely vanish should war erupt throughout the House of Submission.\nAnd Israel would certainly be delighted to see the Islamic world tearing itself apart; one tends to imagine it will do what it can to light whatever fuses might be on hand to help set its enemies at each others’ throats.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-06T20:08:00+00:00"
}