{
  "url": "https://voxday.net/2013/02/08/and-what-do-you-do-with-witches/",
  "scraped_at": "2025-12-14T22:20:01.947058",
  "title": "And what do you do with witches?",
  "date_display": "February 8, 2013",
  "date_iso": "2013-02-08T14:00:00+00:00",
  "date_from_url": "2013-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“The thesis of <i>The World Until Yesterday</i> is that we in<br> industrialized societies have much to learn from people who make (or<br> recently made) their living by hunting-and-gathering or small-scale<br> farming.” <br> – National Public Radio on Jared Diamond’s latest ode to the primitive life in Papua New Guinea</br></br></br></br></p><p>“A young mother was tossed screaming on to a pyre of tyres and burned alive after being accused of killing a neighbour’s six-year-old son with sorcery.  Kepari Leniata, 20, ‘confessed’ after she was dragged from her hut, stripped naked and tortured with white-hot iron rods.  She was then dragged to a local rubbish dump, doused in petrol and, with hands and feet bound, thrown on a fire of burning tyres. As the mother-of-two screamed in agony, more petrol-soaked tyres were thrown on top of her….  The tragedy unfolded after Miss Leniata’s young neighbour fell sick on Tuesday morning. He complained of pains in the stomach and chest and was taken to Mt Hagen hospital where he died a few hours later. Relatives of the boy were suspicious that witchcraft was involved in the death and learned that two women had gone into hiding in the jungle.  After they were tracked down, the pair admitted they practised sorcery but had nothing to do with the boy’s death. Miss Leniata, they said, was the person responsible.”<br> – <a href=\"http://www.dailymail.co.uk/news/article-2274821/Mother-20-accused-witch-killing-boy-6-sorcery-tortured-burned-alive-pile-tyres.html\">Mail Online </a></br></p><p>Clearly we have a lot to learn from such a simple and noble way of life. I don’t know about you, but I find it more than a little amusing that the poster boy for modern pop science is advocating a Rousseauean idealization of a state of nature that happens to include the great historical secular bugaboo, witch-burnings.  As I have repeatedly pointed out, far from being progressive, secular post-Christianity is more regressive than 7th century Islam.  It’s ultimately a return to the mores of precivilized paganism.</p></div>",
  "content_text": "“The thesis of\nThe World Until Yesterday\nis that we in\nindustrialized societies have much to learn from people who make (or\nrecently made) their living by hunting-and-gathering or small-scale\nfarming.”\n– National Public Radio on Jared Diamond’s latest ode to the primitive life in Papua New Guinea\n“A young mother was tossed screaming on to a pyre of tyres and burned alive after being accused of killing a neighbour’s six-year-old son with sorcery.  Kepari Leniata, 20, ‘confessed’ after she was dragged from her hut, stripped naked and tortured with white-hot iron rods.  She was then dragged to a local rubbish dump, doused in petrol and, with hands and feet bound, thrown on a fire of burning tyres. As the mother-of-two screamed in agony, more petrol-soaked tyres were thrown on top of her….  The tragedy unfolded after Miss Leniata’s young neighbour fell sick on Tuesday morning. He complained of pains in the stomach and chest and was taken to Mt Hagen hospital where he died a few hours later. Relatives of the boy were suspicious that witchcraft was involved in the death and learned that two women had gone into hiding in the jungle.  After they were tracked down, the pair admitted they practised sorcery but had nothing to do with the boy’s death. Miss Leniata, they said, was the person responsible.”\n–\nMail Online\nClearly we have a lot to learn from such a simple and noble way of life. I don’t know about you, but I find it more than a little amusing that the poster boy for modern pop science is advocating a Rousseauean idealization of a state of nature that happens to include the great historical secular bugaboo, witch-burnings.  As I have repeatedly pointed out, far from being progressive, secular post-Christianity is more regressive than 7th century Islam.  It’s ultimately a return to the mores of precivilized paganism.",
  "tags": [
    "books",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-08T14:00:00+00:00"
}