{
  "url": "https://voxday.net/2013/02/12/another-feminist-myth-exploded/",
  "scraped_at": "2025-12-14T22:20:25.991272",
  "title": "Another feminist myth exploded",
  "date_display": "February 12, 2013",
  "date_iso": "2013-02-12T14:13:00+00:00",
  "date_from_url": "2013-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The notion that equal access to higher education was going to cause a flowering of female intellectual achievement was always false, because <a href=\"http://pjmedia.com/drhelen/2013/02/12/the-ratio-of-male-to-female-under-graduates-in-the-united-states-was-about-at-parity-from-1900-to-1930/\">it observably didn’t happen the first time around</a>.</p><blockquote class=\"tr_bq\"><p> Although the fact is not widely known, the ratio of male-to-female<br> undergraduates in the United States was about at parity from 1900 to<br> 1930. Male enrollments began to increase relative to female enrollments<br> in the 1930s and later as GIs returned from World War II. A highpoint of<br> gender imbalance in college attendance was reached in 1947 when<br> undergraduate men outnumbered women 2.3 to 1. But starting then and<br> continuing until the present in an almost unbroken trend, female college<br> enrollments have increased relative to male enrollments. </br></br></br></br></br></br></br></p></blockquote><p>In other words, elite women were attending university in equal numbers to elite men, but more middle-class and working-class men going to college threw the balance out of whack.  Middle-class women followed suit, and the consequent collapse in national demographics caused the replacement of 60 million aborted natives with 60 million alien immigrants.</p><p>Brilliant.  Just brilliant.  Short of poisoning the water supply or dropping a large quantity of nuclear weapons on the major cities, it would be hard to concoct a more efficient means of crippling a nation.</p></div>",
  "content_text": "The notion that equal access to higher education was going to cause a flowering of female intellectual achievement was always false, because\nit observably didn’t happen the first time around\n.\nAlthough the fact is not widely known, the ratio of male-to-female\nundergraduates in the United States was about at parity from 1900 to\n1930. Male enrollments began to increase relative to female enrollments\nin the 1930s and later as GIs returned from World War II. A highpoint of\ngender imbalance in college attendance was reached in 1947 when\nundergraduate men outnumbered women 2.3 to 1. But starting then and\ncontinuing until the present in an almost unbroken trend, female college\nenrollments have increased relative to male enrollments.\nIn other words, elite women were attending university in equal numbers to elite men, but more middle-class and working-class men going to college threw the balance out of whack.  Middle-class women followed suit, and the consequent collapse in national demographics caused the replacement of 60 million aborted natives with 60 million alien immigrants.\nBrilliant.  Just brilliant.  Short of poisoning the water supply or dropping a large quantity of nuclear weapons on the major cities, it would be hard to concoct a more efficient means of crippling a nation.",
  "tags": [
    "decline and fall",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-12T14:13:00+00:00"
}