{
  "url": "https://voxday.net/2013/02/06/banning-drones/",
  "scraped_at": "2025-12-14T22:19:43.901416",
  "title": "Banning drones",
  "date_display": "February 6, 2013",
  "date_iso": "2013-02-06T00:24:00+00:00",
  "date_from_url": "2013-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s <a href=\"http://www.usnews.com/news/articles/2013/02/05/city-in-virginia-becomes-first-to-pass-anti-drone-legislation-\">a positive and encouraging first step</a>.  But every city and township in America must follow suit just in case Washington fails to come to its senses:</p><blockquote class=\"tr_bq\"><p> Charlottesville, Va., has become the first city in the United States to formally pass an anti-drone resolution. The resolution, passed Monday, “calls on the United States Congress<br> and the General Assembly of the Commonwealth of Virginia to adopt<br> legislation prohibiting information obtained from the domestic use of<br> drones from being introduced into a Federal or State court,” and<br> “pledges to abstain from similar uses with city-owned, leased, or<br> borrowed drones.”</br></br></br></br></br></p></blockquote><p>I imagine that liberal and conservative Americans can find common ground in not wanting death-dealing, missile-equipped remote-controlled drones flying over their heads.  After all, it could be the likes of (George Bush/Barack Obama) with his evil (Republican/Democrat) on the trigger.</p><p>I don’t recall the right to fly drones everywhere being a power granted to the Federal government anywhere in the Constitution.  Not even in the emanations and penumbras.</p></div>",
  "content_text": "It’s\na positive and encouraging first step\n.  But every city and township in America must follow suit just in case Washington fails to come to its senses:\nCharlottesville, Va., has become the first city in the United States to formally pass an anti-drone resolution. The resolution, passed Monday, “calls on the United States Congress\nand the General Assembly of the Commonwealth of Virginia to adopt\nlegislation prohibiting information obtained from the domestic use of\ndrones from being introduced into a Federal or State court,” and\n“pledges to abstain from similar uses with city-owned, leased, or\nborrowed drones.”\nI imagine that liberal and conservative Americans can find common ground in not wanting death-dealing, missile-equipped remote-controlled drones flying over their heads.  After all, it could be the likes of (George Bush/Barack Obama) with his evil (Republican/Democrat) on the trigger.\nI don’t recall the right to fly drones everywhere being a power granted to the Federal government anywhere in the Constitution.  Not even in the emanations and penumbras.",
  "tags": [
    "law",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-06T00:24:00+00:00"
}