{
  "url": "https://voxday.net/2013/02/07/blue-on-blue/",
  "scraped_at": "2025-12-14T22:19:56.771713",
  "title": "Blue on blue",
  "date_display": "February 7, 2013",
  "date_iso": "2013-02-07T16:00:00+00:00",
  "date_from_url": "2013-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is educational to see that when <a href=\"http://latimesblogs.latimes.com/lanow/2013/02/ex-cop-alleged-goes-on-rampage-shooting-3-officers-killing-one.html\">a former policeman strikes out violently at the police</a>, he does what the police all too often do, which is target their families.  This is a dangerous development I have been expecting ever since the militarization of the USA has increasingly led to family members and dogs being killed by police as a result of the dynamic entry tactics now being used on a regular basis:</p><blockquote class=\"tr_bq\"><p> In the online postings, Dorner specifically named the father of<br> Monica Quan, the Cal State Fullerton assistant basketball coach who was<br> found dead Sunday, along with her fiance, Keith Lawrence. Her father, Randy Quan, a retired LAPD captain, was involved in the review process that ultimately led to Dorner’s dismissal.</br></br></p><p>A former U.S. Navy reservist, Dorner was fired in 2009 for allegedly making false statements about his training officer….  Dorner complained that Quan and others did not fairly represent him at the review hearing.</p><p>“Your lack of ethics and conspiring to wrong a just individual are<br> over. Suppressing the truth will lead to deadly consequences for you<br> and your family. There will be an element of surprise where you work,<br> live, eat, and sleep,” he wrote, referring to Quan and several others.</br></br></br></p></blockquote><p>Based on what we know about the police departments, the way they treat whistleblowers, and the way they resolutely cover up the violent and criminal acts of the “one or two bad apples” that somehow never seem to be weeded out from any department, it would not surprise me to learn that many, if not most, of t<a href=\"http://ktla.com/2013/02/07/read-christopher-dorners-so-called-manifesto/#axzz2KEEoPO80\">he allegations of LAPD misbehavior</a> contained in Dorner’s manifesto are true.</p><p>I’m sure it will shock everyone to learn that the brave police who put their lives at risk every day are now inexplicably on edge and shooting at anything that moves.  One local resident emails to tell how the media is not reporting the entire story:</p><blockquote class=\"tr_bq\"><p> I wanted to get this information to you directly because the media will<br> squelch the parts of the narrative they don’t want aired.  You know by<br> now that a manhunt is underway for an EX COP that murdered two kids in<br> Irvine while they sat in their parked car close to the UC Irvine campus.<br>  This guy is ex-military and was fired from the force for issuing false<br> statements …which is all the media is revealing at this time.  He is<br> now embarking on retribution against those that got him fired and other<br> cops. He shot two cops in a squad car that was following him and killed<br> one of them.</br></br></br></br></br></br></br></br></p><p>Most of this is really unremarkable but the part I wanted<br> you to know about was that they have shot up two trucks matching the<br> description of the killers truck in the city of Torrence.  The first<br> truck had two older Asian ladies in it that were delivering<br> newspapers,,,and they must have had it coming because they did not<br> comply fast enough to satisfy the jittery cops. If that wasn’t bad<br> enough… they shot up a second truck just down the street.  They told<br> the owner to turn his truck around but again, it wasn’t fast enough for<br> the cops because they shot his truck up too! </br></br></br></br></br></br></br></br></p></blockquote><p>It seems the police behave rather differently when they know that the other side is as willing to shoot as they are.  This looks to be an interesting experiment in what we were discussing here a few weeks ago, namely, how effective the force wielded by the government against a single armed man truly is.</p></div>",
  "content_text": "It is educational to see that when\na former policeman strikes out violently at the police\n, he does what the police all too often do, which is target their families.  This is a dangerous development I have been expecting ever since the militarization of the USA has increasingly led to family members and dogs being killed by police as a result of the dynamic entry tactics now being used on a regular basis:\nIn the online postings, Dorner specifically named the father of\nMonica Quan, the Cal State Fullerton assistant basketball coach who was\nfound dead Sunday, along with her fiance, Keith Lawrence. Her father, Randy Quan, a retired LAPD captain, was involved in the review process that ultimately led to Dorner’s dismissal.\nA former U.S. Navy reservist, Dorner was fired in 2009 for allegedly making false statements about his training officer….  Dorner complained that Quan and others did not fairly represent him at the review hearing.\n“Your lack of ethics and conspiring to wrong a just individual are\nover. Suppressing the truth will lead to deadly consequences for you\nand your family. There will be an element of surprise where you work,\nlive, eat, and sleep,” he wrote, referring to Quan and several others.\nBased on what we know about the police departments, the way they treat whistleblowers, and the way they resolutely cover up the violent and criminal acts of the “one or two bad apples” that somehow never seem to be weeded out from any department, it would not surprise me to learn that many, if not most, of t\nhe allegations of LAPD misbehavior\ncontained in Dorner’s manifesto are true.\nI’m sure it will shock everyone to learn that the brave police who put their lives at risk every day are now inexplicably on edge and shooting at anything that moves.  One local resident emails to tell how the media is not reporting the entire story:\nI wanted to get this information to you directly because the media will\nsquelch the parts of the narrative they don’t want aired.  You know by\nnow that a manhunt is underway for an EX COP that murdered two kids in\nIrvine while they sat in their parked car close to the UC Irvine campus.\nThis guy is ex-military and was fired from the force for issuing false\nstatements …which is all the media is revealing at this time.  He is\nnow embarking on retribution against those that got him fired and other\ncops. He shot two cops in a squad car that was following him and killed\none of them.\nMost of this is really unremarkable but the part I wanted\nyou to know about was that they have shot up two trucks matching the\ndescription of the killers truck in the city of Torrence.  The first\ntruck had two older Asian ladies in it that were delivering\nnewspapers,,,and they must have had it coming because they did not\ncomply fast enough to satisfy the jittery cops. If that wasn’t bad\nenough… they shot up a second truck just down the street.  They told\nthe owner to turn his truck around but again, it wasn’t fast enough for\nthe cops because they shot his truck up too!\nIt seems the police behave rather differently when they know that the other side is as willing to shoot as they are.  This looks to be an interesting experiment in what we were discussing here a few weeks ago, namely, how effective the force wielded by the government against a single armed man truly is.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-07T16:00:00+00:00"
}