{
  "url": "https://voxday.net/2013/02/02/come-see-violence-inherent-in-syste-2/",
  "scraped_at": "2025-12-14T22:19:24.721373",
  "title": "Come see the violence inherent in the system",
  "date_display": "February 2, 2013",
  "date_iso": "2013-02-02T17:30:00+00:00",
  "date_from_url": "2013-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Help, help, I’m being threatened!  And by the SFWA South-Central Regional Director, no less.  At 3:30 AM, I was returning from a late night out with Silvio and the boys when I noticed literally <i>hundreds </i>of entries coming from a site belonging to leading science fiction author and international cross-dressing star <a href=\"http://jimhines.livejournal.com/668807.html\">Jim Hines</a>.  Naturally, being the secure and self-confident image of modern masculinity, I immediately hastened to scour his site for every reference to me.</p><p>Imagine the horror and fear that struck me when I read the following:</p><blockquote class=\"tr_bq\"><p> <a href=\"http://jimhines.livejournal.com/668807.html?thread=19751047#t19751047\">lee_martindale wrote</a>:<br> Feb. 1st, 2013 04:19 pm (UTC)<br> Ah, yes. Mr. Beale. When I decided to run for re-election as SFWA South-Central Regional Director, someone asked me what I would do if  Mr. Beale won the Presidential election. I replied, “Ask my friends to start a bail fund.”</br></br></p></blockquote><p>Naturally, I was panic-stricken by the violent implications of the Regional Director’s threat.  After I got off the phone with the local police, Homeland Security, the FBI, and Interpol, and managed to compose myself following an intense round of aromatherapy, some yoga exercises, and about a gallon of green tea, I posted the following in the Questions for Candidates section of the SFWA Forum:</p><p>Two questions for Lee Martindale:  It was brought to my attention that<br> yesterday, you wrote the following on SFWA member Jim Hines’s web site: <i>“When<br> I decided to run for re-election as SFWA South-Central Regional<br> Director, someone asked me what I would do if Mr. Beale won the<br> Presidential election. I replied, “Ask my friends to start a bail<br> fund.””</br></br></br></br></i></br></p><p>1.  What did you mean by indicating that you would need a bail fund in the event of my election as SFWA President?<b>(1)</b><br> 2.  Do you believe that threatening criminal activity and violence is appropriate for an officer of the SFWA Board?</br></p><p>I note that this is the second implication of violence an SFWA member<br> has directed towards me since I declared my candidacy.  Two open<br> questions for everyone else:</br></br></p><p>1.  Are these implied threats of criminality and/or violence acceptable behavior on the part of SFWA members, and in the case of Ms Martindale, current Board members?<br> 2.  Should Ms Martindale resign her position and terminate her candidacy due to her implied threats of criminal activity?</br></p><p>I find it hard to see how I, or any other elected SFWA official, could be<br> expected to work in a productive manner with Ms Martindale in the<br> knowledge that she may resort to criminal activity and physical violence<br> over a mere difference of opinion.</br></br></br></p><p> <b>(1) Ms Martindale explained that she was, in fact, implying violence,<br> although she claimed that she only meant violence of the self-defensive<br> variety.</br></br></b><i><br/></i></p><p><i>This post is dedicated to the memory of Bane.</i></p></div>",
  "content_text": "Help, help, I’m being threatened!  And by the SFWA South-Central Regional Director, no less.  At 3:30 AM, I was returning from a late night out with Silvio and the boys when I noticed literally\nhundreds\nof entries coming from a site belonging to leading science fiction author and international cross-dressing star\nJim Hines\n.  Naturally, being the secure and self-confident image of modern masculinity, I immediately hastened to scour his site for every reference to me.\nImagine the horror and fear that struck me when I read the following:\nlee_martindale wrote\n:\nFeb. 1st, 2013 04:19 pm (UTC)\nAh, yes. Mr. Beale. When I decided to run for re-election as SFWA South-Central Regional Director, someone asked me what I would do if  Mr. Beale won the Presidential election. I replied, “Ask my friends to start a bail fund.”\nNaturally, I was panic-stricken by the violent implications of the Regional Director’s threat.  After I got off the phone with the local police, Homeland Security, the FBI, and Interpol, and managed to compose myself following an intense round of aromatherapy, some yoga exercises, and about a gallon of green tea, I posted the following in the Questions for Candidates section of the SFWA Forum:\nTwo questions for Lee Martindale:  It was brought to my attention that\nyesterday, you wrote the following on SFWA member Jim Hines’s web site:\n“When\nI decided to run for re-election as SFWA South-Central Regional\nDirector, someone asked me what I would do if Mr. Beale won the\nPresidential election. I replied, “Ask my friends to start a bail\nfund.””\n1.  What did you mean by indicating that you would need a bail fund in the event of my election as SFWA President?\n(1)\n2.  Do you believe that threatening criminal activity and violence is appropriate for an officer of the SFWA Board?\nI note that this is the second implication of violence an SFWA member\nhas directed towards me since I declared my candidacy.  Two open\nquestions for everyone else:\n1.  Are these implied threats of criminality and/or violence acceptable behavior on the part of SFWA members, and in the case of Ms Martindale, current Board members?\n2.  Should Ms Martindale resign her position and terminate her candidacy due to her implied threats of criminal activity?\nI find it hard to see how I, or any other elected SFWA official, could be\nexpected to work in a productive manner with Ms Martindale in the\nknowledge that she may resort to criminal activity and physical violence\nover a mere difference of opinion.\n(1) Ms Martindale explained that she was, in fact, implying violence,\nalthough she claimed that she only meant violence of the self-defensive\nvariety.\nThis post is dedicated to the memory of Bane.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-02T17:30:00+00:00"
}