{
  "url": "https://voxday.net/2013/02/24/how-long-can-this-go-on/",
  "scraped_at": "2025-12-14T22:21:25.771536",
  "title": "How long can this go on?",
  "date_display": "February 24, 2013",
  "date_iso": "2013-02-24T14:30:00+00:00",
  "date_from_url": "2013-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>According to Zero Hedge, <a href=\"http://www.zerohedge.com/news/2013-02-23/when-fed-has-print-money-just-print-money\">somewhere between 10 months and four years</a>:</p><blockquote class=\"tr_bq\"><p> As we <a href=\"http://www.zerohedge.com/news/2013-02-19/feds-d-rate-45-dec-31-2013-and-dropping-fast\">showed last week</a>,<br> the rate at which NIM goes negative and the above feedback loops begins<br> would be at approximately 4.5% on December 31, 2013. The “breakeven”<br> rate unleashing the inflationary cycle would then decline by about 1%<br> each year assuming the Fed’s balance sheet continues rising at a pace of<br> $1 trillion per year.</br></br></br></br></br></p><p>So the good news for all those who have been wondering just how much<br> longer the Fed can continue doing more of the same while providing a<br> free lunch for all is that we now know there is a temporal bound: the<br> longer the Fed does nothing to change the status quo, the lower its<br> “rate buffer.”</br></br></br></br></p><p>Of course, there is a resolution: the Fed simply begins to sell its<br> assets, and in doing so, destroys the reserves created when said assets<br> were onboarded on the Fed’s balance sheet. But there lies the rub:<br> because the second the Fed enters open deleveraging mode, everyone will<br> sell everything they can to lock in the profits generated from the past<br> 4+ years of Fed balance sheet expansion. Furthermore, at that moment,<br> the market will begin pricing in the unwind of some or all of the $15<br> trillion in central bank liquidity which is the only reason the S&amp;P<br> is where it is today. The result would be a market crash so epic it<br> would make the market response to Lehman and AIG’s failure seem like a<br> walk in the park by comparison.</br></br></br></br></br></br></br></br></br></br></p><p>Which is where you come in <em>dear retail investor</em>, and the<br> whole myth of the “Great Rotation.” Because unless there is someone who<br> will start providing a bid into which the banks can offload their<br> securities in exchange for cold hard cash, <a href=\"http://www.zerohedge.com/news/2013-02-23/rehab-still-nowhere-sight-fed-floats-first-step-trial-balloon\">as was explained earlier</a>,<br> the entire stock market ramp of the past 4 years will have been for<br> nothing. It is also why day in and day out the media bombards everyone,<br> as it has in the beginning of every year for the past three, that the<br> time to enter the market is now, and there has never been a better time<br> (ignoring that the market is <a href=\"http://www.zerohedge.com/news/2013-02-09/2013-earnings-are-now-forecast-be-less-then-2009-earnings-were-projected-be-2007\">now more expensive on a forward multiple basis </a>than it was at the last market peak in 2007). </br></br></br></br></br></br></br></br></p></blockquote><p>What concerns me is that the Federal Reserve and its figureheads appear to have given up on the repeated “green shoots” announcements and shifted into half-hearted “it’s not our fault” mode.  This makes me suspect that the implosion date will be closer to 10 months than four years.  I don’t think it will be hyperinflationary, as will soon be discussed in detail, in part due to the nature of the financial system, but also because it should be perfectly clear that the Federal Reserve is not going to sacrifice itself and the interests of its owners for the economy or for the federal government.</p></div>",
  "content_text": "According to Zero Hedge,\nsomewhere between 10 months and four years\n:\nAs we\nshowed last week\n,\nthe rate at which NIM goes negative and the above feedback loops begins\nwould be at approximately 4.5% on December 31, 2013. The “breakeven”\nrate unleashing the inflationary cycle would then decline by about 1%\neach year assuming the Fed’s balance sheet continues rising at a pace of\n$1 trillion per year.\nSo the good news for all those who have been wondering just how much\nlonger the Fed can continue doing more of the same while providing a\nfree lunch for all is that we now know there is a temporal bound: the\nlonger the Fed does nothing to change the status quo, the lower its\n“rate buffer.”\nOf course, there is a resolution: the Fed simply begins to sell its\nassets, and in doing so, destroys the reserves created when said assets\nwere onboarded on the Fed’s balance sheet. But there lies the rub:\nbecause the second the Fed enters open deleveraging mode, everyone will\nsell everything they can to lock in the profits generated from the past\n4+ years of Fed balance sheet expansion. Furthermore, at that moment,\nthe market will begin pricing in the unwind of some or all of the $15\ntrillion in central bank liquidity which is the only reason the S&P\nis where it is today. The result would be a market crash so epic it\nwould make the market response to Lehman and AIG’s failure seem like a\nwalk in the park by comparison.\nWhich is where you come in\ndear retail investor\n, and the\nwhole myth of the “Great Rotation.” Because unless there is someone who\nwill start providing a bid into which the banks can offload their\nsecurities in exchange for cold hard cash,\nas was explained earlier\n,\nthe entire stock market ramp of the past 4 years will have been for\nnothing. It is also why day in and day out the media bombards everyone,\nas it has in the beginning of every year for the past three, that the\ntime to enter the market is now, and there has never been a better time\n(ignoring that the market is\nnow more expensive on a forward multiple basis\nthan it was at the last market peak in 2007).\nWhat concerns me is that the Federal Reserve and its figureheads appear to have given up on the repeated “green shoots” announcements and shifted into half-hearted “it’s not our fault” mode.  This makes me suspect that the implosion date will be closer to 10 months than four years.  I don’t think it will be hyperinflationary, as will soon be discussed in detail, in part due to the nature of the financial system, but also because it should be perfectly clear that the Federal Reserve is not going to sacrifice itself and the interests of its owners for the economy or for the federal government.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-24T14:30:00+00:00"
}