{
  "url": "https://voxday.net/2013/02/07/ireland-bolts-stable-doors/",
  "scraped_at": "2025-12-14T22:19:53.111641",
  "title": "Ireland bolts the stable doors",
  "date_display": "February 7, 2013",
  "date_iso": "2013-02-07T09:07:00+00:00",
  "date_from_url": "2013-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Long after the horses <a href=\"http://www.telegraph.co.uk/finance/newsbysector/banksandfinance/9854290/Ireland-votes-to-liquidate-Anglo-Irish-Bank.html\">escaped with all the money</a>:</p><blockquote class=\"tr_bq\"><p> Ireland’s government rushed through emergency legislation early on Thursday to liquidate the failed Anglo Irish Bank as it tries to secure a deal with the European Central Bank to ease the country’s debt burden….</p><p>President Michael D. Higgins will sign the bill into law later on Thursday. He<br> cut short a state trip to Rome to ensure he could consider it. Anglo Irish and its casino-style lending were at the heart of Ireland’s<br> financial crisis. The bank’s near collapse in 2008 pressured the government<br> into guaranteeing the entire financial sector, sucking it into a downward<br> spiral and in late 2010, a €67.5bn EU-IMF bailout.</br></br></br></br></p><p>Three of the bank’s former executives, including its former CEO, will go on<br> trial next year on fraud charges. Under Dublin’s plan, the €28bn in promissory notes will be replaced with<br> long-term government bonds, meaning that Ireland<br> can make more gradual repayments, a source familiar with the discussions<br> told Reuters. </br></br></br></br></p></blockquote><p>So, instead of simply letting the bank go into liquidation in 2008, the Irish government saddled the Irish people with nearly $100 billion in debt, and now the bank is going to go into liquidation anyhow.</p><p>In contrast, thanks primarily to the courage of the Icelandic prime minister, Iceland let its casino banks go bankrupt and resisted the global pressure to saddle the Icelandic people with the bankers’ debts.  Iceland has now put the debt bubble behind it and is growing again; the Irish can’t even make the upcoming payments on a debt that extends for another 10 years.</p><p>This is why the bankrupt US banks should have been allowed to fail back in 2008.  Bank bailouts are seldom a solution, they are almost always a simple matter of delaying the day of financial reckoning long enough for the parties responsible to successfully abscond with the gains they have collected from gambling with other people’s money.</p></div>",
  "content_text": "Long after the horses\nescaped with all the money\n:\nIreland’s government rushed through emergency legislation early on Thursday to liquidate the failed Anglo Irish Bank as it tries to secure a deal with the European Central Bank to ease the country’s debt burden….\nPresident Michael D. Higgins will sign the bill into law later on Thursday. He\ncut short a state trip to Rome to ensure he could consider it. Anglo Irish and its casino-style lending were at the heart of Ireland’s\nfinancial crisis. The bank’s near collapse in 2008 pressured the government\ninto guaranteeing the entire financial sector, sucking it into a downward\nspiral and in late 2010, a €67.5bn EU-IMF bailout.\nThree of the bank’s former executives, including its former CEO, will go on\ntrial next year on fraud charges. Under Dublin’s plan, the €28bn in promissory notes will be replaced with\nlong-term government bonds, meaning that Ireland\ncan make more gradual repayments, a source familiar with the discussions\ntold Reuters.\nSo, instead of simply letting the bank go into liquidation in 2008, the Irish government saddled the Irish people with nearly $100 billion in debt, and now the bank is going to go into liquidation anyhow.\nIn contrast, thanks primarily to the courage of the Icelandic prime minister, Iceland let its casino banks go bankrupt and resisted the global pressure to saddle the Icelandic people with the bankers’ debts.  Iceland has now put the debt bubble behind it and is growing again; the Irish can’t even make the upcoming payments on a debt that extends for another 10 years.\nThis is why the bankrupt US banks should have been allowed to fail back in 2008.  Bank bailouts are seldom a solution, they are almost always a simple matter of delaying the day of financial reckoning long enough for the parties responsible to successfully abscond with the gains they have collected from gambling with other people’s money.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-07T09:07:00+00:00"
}