{
  "url": "https://voxday.net/2013/02/16/live-by-consumer-die-by-consumer/",
  "scraped_at": "2025-12-14T22:20:46.715148",
  "title": "Live by the consumer, die by the consumer",
  "date_display": "February 16, 2013",
  "date_iso": "2013-02-16T10:11:00+00:00",
  "date_from_url": "2013-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is <a href=\"http://market-ticker.org/akcs-www?post=217556\">not looking good</a> for Q1-2013:</p><blockquote class=\"tr_bq\"><p> Wal-Mart Stores Inc. had the worst sales start to a month<br> in seven years as payroll-tax increases hit shoppers already battling a<br> slow economy, according to internal e-mails obtained by Bloomberg News.</br></br></p><p>“In<br> case you haven’t seen a sales report these days, February MTD sales are<br> a total disaster,” Jerry Murray, Wal- Mart’s vice president of finance<br> and logistics, said in a Feb. 12 e-mail to other executives, referring<br> to month-to-date sales. “The worst start to a month I have seen in my ~7<br> years with the company.”</br></br></br></br></br></p><p>“Have you ever had one of those weeks where your best- prepared plans<br> weren’t good enough to accomplish everything you set out to do?” Geiger<br> asked in a Feb. 1 e-mail to executives. “Well, we just had one of those<br> weeks here at Walmart U.S. Where are all the customers? And where’s<br> their money?”</br></br></br></br></p></blockquote><p>It sounds as if an awful lot of people just got the harsh wakeup of the Christmas-related credit bills combined with their tax and insurance hikes.  The “substitution” effect can only work so long before the consumer can’t even afford Wal-Mart.  The problem with kicking the credit can instead of addressing the problem is that the can keeps getting bigger every time it is kicked down the road.</p><p>Iceland has already shown the way out.  Default.  The fact that the politicians and bankers so vigorously prefer attempting to inflate their way out demonstrates that they don’t give a damn about the economy or the people, and that inflation in a sufficiently orderly manner is not always possible.</p><p>Sure, the government could borrow and spend $100 trillion tomorrow.  But the effect of that would be even worse than default.  So the Federal Reserve finds itself in between the Scylla of hyperinflation and the Charybdis of default, without an Odysseus at the helm.</p><p><i>“There is no means of avoiding the final collapse of a boom brought<br> about by credit expansion. The alternative is only whether the crisis<br> should come sooner as a result of a voluntary abandonment of further<br> credit expansion, or later as a final and total catastrophe of the<br> currency system involved.” </br></br></br></br></i><br> – Ludwig von Mises</br></p></div>",
  "content_text": "It is\nnot looking good\nfor Q1-2013:\nWal-Mart Stores Inc. had the worst sales start to a month\nin seven years as payroll-tax increases hit shoppers already battling a\nslow economy, according to internal e-mails obtained by Bloomberg News.\n“In\ncase you haven’t seen a sales report these days, February MTD sales are\na total disaster,” Jerry Murray, Wal- Mart’s vice president of finance\nand logistics, said in a Feb. 12 e-mail to other executives, referring\nto month-to-date sales. “The worst start to a month I have seen in my ~7\nyears with the company.”\n“Have you ever had one of those weeks where your best- prepared plans\nweren’t good enough to accomplish everything you set out to do?” Geiger\nasked in a Feb. 1 e-mail to executives. “Well, we just had one of those\nweeks here at Walmart U.S. Where are all the customers? And where’s\ntheir money?”\nIt sounds as if an awful lot of people just got the harsh wakeup of the Christmas-related credit bills combined with their tax and insurance hikes.  The “substitution” effect can only work so long before the consumer can’t even afford Wal-Mart.  The problem with kicking the credit can instead of addressing the problem is that the can keeps getting bigger every time it is kicked down the road.\nIceland has already shown the way out.  Default.  The fact that the politicians and bankers so vigorously prefer attempting to inflate their way out demonstrates that they don’t give a damn about the economy or the people, and that inflation in a sufficiently orderly manner is not always possible.\nSure, the government could borrow and spend $100 trillion tomorrow.  But the effect of that would be even worse than default.  So the Federal Reserve finds itself in between the Scylla of hyperinflation and the Charybdis of default, without an Odysseus at the helm.\n“There is no means of avoiding the final collapse of a boom brought\nabout by credit expansion. The alternative is only whether the crisis\nshould come sooner as a result of a voluntary abandonment of further\ncredit expansion, or later as a final and total catastrophe of the\ncurrency system involved.”\n– Ludwig von Mises",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-16T10:11:00+00:00"
}