{
  "url": "https://voxday.net/2013/02/11/live-by-science/",
  "scraped_at": "2025-12-14T22:20:17.744309",
  "title": "Mailvox: live by the science",
  "date_display": "February 11, 2013",
  "date_iso": "2013-02-11T10:49:00+00:00",
  "date_from_url": "2013-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Die by the science.  Yesterday, dh took mild exception to the following statement: “Consider the poor leftist who believes avidly that a) racism is evil and<br> b) evolution is true.  What is he to do when confronted by someone who<br> points out, on the basis of genetic science, that humans are not even<br> all equally <i>homo sapiens sapiens</i>?  If he is to cling to his<br> beliefs, he must either accept a continual state of cognitive dissonance<br> or bury his head in the intellectual sand.”</br></br></br></br></br></p><p>Dh asserted:  “Much like you don’t care about McRapey, those of us on the left aren’t<br> bothered by this.  It is not great intellectual leap to acknowledge<br> racial advantages and disadvantages.  We all recognize them everyday.<br> This can be done without ill will or animosity.  Where we separate is in the “what to do about it” department.”</br></br></br></p><p>This is no doubt true of dh and other rational leftists, but it is easy to demonstrate that it does not describe the greater part of the Left, especially in light of Justin Smith’s <a href=\"http://opinionator.blogs.nytimes.com/2013/02/10/why-has-race-survived/?hp\">editorial on philosophy and race</a> in the New York Times:</p><blockquote class=\"tr_bq\"><p> The question for us today is why we have chosen to stick with<br> categories inherited from the 18th century, the century of the so-called<br> Enlightenment, which witnessed the development of the slave trade into<br> the very foundation of the global economy, and at the same time saw<br> racial classifications congeal into pseudo-biological kinds,<br> piggy-backing on the divisions folk science had always made across the<br> natural world of plants and animals. Why, that is, have we chosen to go<br> with Hume and Kant, rather than with the pre-racial conception of<br> humanity espoused by Kraus, or the anti-racial picture that Herder<br> offered in opposition to his contemporaries?</br></br></br></br></br></br></br></br></br></p><p>Many who are fully<br> prepared to acknowledge that there are no significant natural<br> differences between races nonetheless argue that there are certain<br> respects in which it is worth retaining the concept of race: for<br> instance in talking about issues like social inequality or access to<br> health care. There is, they argue, a certain pragmatic utility in<br> retaining it, even if they acknowledge that racial categories result<br> from social and historical legacies, rather than being dictated by<br> nature. In this respect “race” has turned out to be a very different<br> sort of social construction than, say, “witch” or “lunatic.”</br></br></br></br></br></br></br></br></br></p><p>While<br> generally there is a presumption that to catch out some entity or<br> category as socially constructed is at the same time to condemn it, many<br> thinkers are prepared to simultaneously acknowledge both the<br> non-naturalness of race as well as a certain pragmatic utility in<br> retaining it.</br></br></br></br></br></p><p>Since the mid-20th century no mainstream scientist<br> has considered race a biologically significant category; no scientist<br> believes any longer that “negroid,”  “caucasoid” and so on represent<br> real natural kinds or categories. For several decades it has been well<br> established that there is as much genetic variation between two members<br> of any supposed race, as between two members of supposedly distinct<br> races. This is not to say that there are no real differences, some of<br> which are externally observable, between different human populations. It<br> is only to say, as Lawrence Hirschfeld wrote in his 1996 book, “Race in<br> the Making: Cognition, Culture, and the Child’s Construction of Human<br> Kinds,” that “races as socially defined do not (even loosely) capture<br> interesting clusters of these differences.”</br></br></br></br></br></br></br></br></br></br></br></p><p>Yet the category of<br> race continues to be deployed in a vast number of contexts, and<br> certainly not just by racists, but by ardent anti-racists as well, and<br> by everyone in between. The history of race, then, is not like the<br> history of, say, witches: a group that is shown not to exist and that<br> accordingly proceeds to go away.  Why is this?</br></br></br></br></br></p></blockquote><p>This reveals several significant problems for dh’s position, (thereby wrecking the simile, I should note), beginning with the idea that the Left will not be bothered by the scientific support for the hypothesis that all humans are not only not equal, they are not even equally human.  Dh simply hasn’t recognized either the basis for the Left’s denial of race nor the probable consequences of a solid concept of science-based sub-species replacing the crude and superficial concept of color-based race.  He doesn’t recognize how significant the change from judging a man by the color of his skin to judging a protohuman or posthuman by the content of his genetic code is likely to be.</p><p>From Wikipedia: <i>“Steven Pinker has stated that it is “a conventional wisdom among left-leaning academics that genes imply genocide”.” </i></p><p>The primary problem is that the anti-racial argument is almost entirely based on science that is outdated.  While the genetic categories don’t necessarily fall in line with the traditional racial ones; the major dividing line presently appears to be African (pure homo sapiens sapiens) vs non-African (partly homo sapiens sapiens, partly homo neanderthalensis, partly other subspecies).  It can no longer be pretended that the observed behavioral differences and capabilities must solely “result<br> from social and historical legacies”.  Such differences may result from them, but then again, they may not.  The fact that Nature is unlikely to reign entirely supreme does not mean that Nurture has not conclusively lost its pretense to sole kingship.</br></p><p>And while the racial prejudices of Hume and Kant may not be supported by the current state of science, the pre-racial and anti-racial conceptions they opposed are now known to contravene the current state of genetic science as well, and to the extent those conceptions have been utilized as the foundations for equalitarian ideology, that ideology is confirmed to be false as well.  This doesn’t justify either historical or hypothetical future racism, of course, but the replacement of racial pseudo-biology with genuine genetic science does destroy all science-based anti-racism of the sort to which Smith is appealing in his article.</p><p>Dh is correct to say that advantages and disadvantages of the various human subspecies need not require ill will or animosity to be acknowledged, but he is wrong to assume that the Left can manage it, given their emotional attachment to anti-racism as well as their ongoing state of denial concerning the science.  Since the equality to which they have been appealing for literal centuries is now confirmed to have no basis in science, this is going to leave them with no resort but to appeal to the very metaphysical grounds they have long affected to despise.  Being materialists, for the most part, to what can they possibly appeal, the possession of a soul?  Being fellow creatures made in the Imago Dei?</p><p>What is more likely, especially given the demographic, economic and technological realities, is a return to a left-wing eugenics much more virulent than its predecessor.  This may seem inconceivable to all bien-pensant leftists who make a religion out of equality, but the reality is that it is no less absurd or unlikely than the Left’s transformation from early 20th century racist eugenics to early 21st century equalitarianism and multiculturalism.</p><p>In answer to Smith’s question, the concept of race has survived because it has a basis in fact, being an observable shorthand for the more complicated, and less immediately obvious genetic categories that almost surely consist of more, and more definitely material, divisions than the traditional ones based on skin color.  What will we do about it?  What should we do about it?  The discussion is inevitable, but is not presently permissible within the bounds of public discourse due to the aforementioned head-burying response of the equalitarian Left.</p><p>The ironic fact is that the concept of “progress” is intrinsically absurd for the materialist; there can be no foreordained or inevitable arrangement of atoms across the universe when there is nothing to arrange them.  This is why the anti-racist genie of the left will readily return to the bottle just as rapidly, and just as thoughtlessly, as it emerged in the first place.  It doesn’t necessarily have to be so, but the reluctance of the Left to come to grips with philosophical implications of the relevant science doesn’t tend to lend one much confidence in this regard.</p></div>",
  "content_text": "Die by the science.  Yesterday, dh took mild exception to the following statement: “Consider the poor leftist who believes avidly that a) racism is evil and\nb) evolution is true.  What is he to do when confronted by someone who\npoints out, on the basis of genetic science, that humans are not even\nall equally\nhomo sapiens sapiens\n?  If he is to cling to his\nbeliefs, he must either accept a continual state of cognitive dissonance\nor bury his head in the intellectual sand.”\nDh asserted:  “Much like you don’t care about McRapey, those of us on the left aren’t\nbothered by this.  It is not great intellectual leap to acknowledge\nracial advantages and disadvantages.  We all recognize them everyday.\nThis can be done without ill will or animosity.  Where we separate is in the “what to do about it” department.”\nThis is no doubt true of dh and other rational leftists, but it is easy to demonstrate that it does not describe the greater part of the Left, especially in light of Justin Smith’s\neditorial on philosophy and race\nin the New York Times:\nThe question for us today is why we have chosen to stick with\ncategories inherited from the 18th century, the century of the so-called\nEnlightenment, which witnessed the development of the slave trade into\nthe very foundation of the global economy, and at the same time saw\nracial classifications congeal into pseudo-biological kinds,\npiggy-backing on the divisions folk science had always made across the\nnatural world of plants and animals. Why, that is, have we chosen to go\nwith Hume and Kant, rather than with the pre-racial conception of\nhumanity espoused by Kraus, or the anti-racial picture that Herder\noffered in opposition to his contemporaries?\nMany who are fully\nprepared to acknowledge that there are no significant natural\ndifferences between races nonetheless argue that there are certain\nrespects in which it is worth retaining the concept of race: for\ninstance in talking about issues like social inequality or access to\nhealth care. There is, they argue, a certain pragmatic utility in\nretaining it, even if they acknowledge that racial categories result\nfrom social and historical legacies, rather than being dictated by\nnature. In this respect “race” has turned out to be a very different\nsort of social construction than, say, “witch” or “lunatic.”\nWhile\ngenerally there is a presumption that to catch out some entity or\ncategory as socially constructed is at the same time to condemn it, many\nthinkers are prepared to simultaneously acknowledge both the\nnon-naturalness of race as well as a certain pragmatic utility in\nretaining it.\nSince the mid-20th century no mainstream scientist\nhas considered race a biologically significant category; no scientist\nbelieves any longer that “negroid,”  “caucasoid” and so on represent\nreal natural kinds or categories. For several decades it has been well\nestablished that there is as much genetic variation between two members\nof any supposed race, as between two members of supposedly distinct\nraces. This is not to say that there are no real differences, some of\nwhich are externally observable, between different human populations. It\nis only to say, as Lawrence Hirschfeld wrote in his 1996 book, “Race in\nthe Making: Cognition, Culture, and the Child’s Construction of Human\nKinds,” that “races as socially defined do not (even loosely) capture\ninteresting clusters of these differences.”\nYet the category of\nrace continues to be deployed in a vast number of contexts, and\ncertainly not just by racists, but by ardent anti-racists as well, and\nby everyone in between. The history of race, then, is not like the\nhistory of, say, witches: a group that is shown not to exist and that\naccordingly proceeds to go away.  Why is this?\nThis reveals several significant problems for dh’s position, (thereby wrecking the simile, I should note), beginning with the idea that the Left will not be bothered by the scientific support for the hypothesis that all humans are not only not equal, they are not even equally human.  Dh simply hasn’t recognized either the basis for the Left’s denial of race nor the probable consequences of a solid concept of science-based sub-species replacing the crude and superficial concept of color-based race.  He doesn’t recognize how significant the change from judging a man by the color of his skin to judging a protohuman or posthuman by the content of his genetic code is likely to be.\nFrom Wikipedia:\n“Steven Pinker has stated that it is “a conventional wisdom among left-leaning academics that genes imply genocide”.”\nThe primary problem is that the anti-racial argument is almost entirely based on science that is outdated.  While the genetic categories don’t necessarily fall in line with the traditional racial ones; the major dividing line presently appears to be African (pure homo sapiens sapiens) vs non-African (partly homo sapiens sapiens, partly homo neanderthalensis, partly other subspecies).  It can no longer be pretended that the observed behavioral differences and capabilities must solely “result\nfrom social and historical legacies”.  Such differences may result from them, but then again, they may not.  The fact that Nature is unlikely to reign entirely supreme does not mean that Nurture has not conclusively lost its pretense to sole kingship.\nAnd while the racial prejudices of Hume and Kant may not be supported by the current state of science, the pre-racial and anti-racial conceptions they opposed are now known to contravene the current state of genetic science as well, and to the extent those conceptions have been utilized as the foundations for equalitarian ideology, that ideology is confirmed to be false as well.  This doesn’t justify either historical or hypothetical future racism, of course, but the replacement of racial pseudo-biology with genuine genetic science does destroy all science-based anti-racism of the sort to which Smith is appealing in his article.\nDh is correct to say that advantages and disadvantages of the various human subspecies need not require ill will or animosity to be acknowledged, but he is wrong to assume that the Left can manage it, given their emotional attachment to anti-racism as well as their ongoing state of denial concerning the science.  Since the equality to which they have been appealing for literal centuries is now confirmed to have no basis in science, this is going to leave them with no resort but to appeal to the very metaphysical grounds they have long affected to despise.  Being materialists, for the most part, to what can they possibly appeal, the possession of a soul?  Being fellow creatures made in the Imago Dei?\nWhat is more likely, especially given the demographic, economic and technological realities, is a return to a left-wing eugenics much more virulent than its predecessor.  This may seem inconceivable to all bien-pensant leftists who make a religion out of equality, but the reality is that it is no less absurd or unlikely than the Left’s transformation from early 20th century racist eugenics to early 21st century equalitarianism and multiculturalism.\nIn answer to Smith’s question, the concept of race has survived because it has a basis in fact, being an observable shorthand for the more complicated, and less immediately obvious genetic categories that almost surely consist of more, and more definitely material, divisions than the traditional ones based on skin color.  What will we do about it?  What should we do about it?  The discussion is inevitable, but is not presently permissible within the bounds of public discourse due to the aforementioned head-burying response of the equalitarian Left.\nThe ironic fact is that the concept of “progress” is intrinsically absurd for the materialist; there can be no foreordained or inevitable arrangement of atoms across the universe when there is nothing to arrange them.  This is why the anti-racist genie of the left will readily return to the bottle just as rapidly, and just as thoughtlessly, as it emerged in the first place.  It doesn’t necessarily have to be so, but the reluctance of the Left to come to grips with philosophical implications of the relevant science doesn’t tend to lend one much confidence in this regard.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-11T10:49:00+00:00"
}