{
  "url": "https://voxday.net/2013/02/04/mailvox-errors-of-equalitarians/",
  "scraped_at": "2025-12-14T22:19:31.767285",
  "title": "Mailvox: errors of the equalitarians",
  "date_display": "February 4, 2013",
  "date_iso": "2013-02-04T10:42:00+00:00",
  "date_from_url": "2013-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Boris rejects my proposed liberty metric:</p><blockquote class=\"tr_bq\"><p> <i>“So my question to Mr. Trimnell is if he accepts the number of laws and regulations in effect as a reasonable metric for measuring human liberty in this regard?”</i></p><p>This is a terrible metric. The content of the law is far more important wrt liberty than the actual number of laws. It can hardly be argued that American society is less free today than in 1919.  In any case, a more complex society will always have more laws, so your metric is not well thought out at all.</p></blockquote><p>Boris’s objection is nonsensical on its face.  How can he reasonably compare the content of a single law to the total number of laws?  Alternatively, if by “the content of the law” he means “the cumulative content of all the laws”, how can he possibly ignore the fact that since all laws contain restrictions on human behavior, the larger the number of laws, the larger the number of restrictions on human behavior that they collectively contain?</p><p>It is true that the cumulative content of restrictions imposed by all the laws is a better metric than the mere number of them, but the latter is much easier to calculate, harder to dispute, and is demonstrably a reasonable and effective metric even if not the ideal one.</p><p>Furthermore, it can very easily be argued, indeed, it can very easily be <i>proved</i>, that American society is considerably less free today than in 1919.  I invite Boris to either attempt to prove that American society is <strike>considerably more</strike> as free today than in 1919 or retract his assertion.</p><p>Finally, what is “a complex society”?  Wikipedia defines it as: “the extent of a division of labour in which members of society are more or less permanently specialized in particular activities and depend on others for goods and services, within a system regulated by custom and laws.”  Since a complex society features a regulated system by definition, it should be clear that the complex society’s inevitable tendency to have more laws not only fails to disprove the metric, but instead underlines its effectiveness.</p><p>I also asked The Great Martini about his preference for democracy or limited democracy:</p><blockquote class=\"tr_bq\"><p> <i>“Question for you: what better expresses the will of the people, direct<br> democracy or representative-limited democracy? And which do you favor?”</br></i></p><p>Direct<br> democracy would be preferable if a practical system could be devised to<br> implement it.  There’s the question of whether it would even be<br> feasible to run a government by constantly consulting all the people<br> every time a decision had to be made.  If everyone were versed in<br> everything and if everyone would actually agree to a process of constant<br> polling it would no doubt be a very effective expression of the will of<br> the people.  The internet has made that more feasible, but still I<br> think impractical.</br></br></br></br></br></br></br></br></p></blockquote><p>What does feasibility have to do with the more perfect expression of the will of the people?  Is direct democracy via the Internet truly LESS feasible or a less perfect expression than the system of limited representative democracy when it took weeks for information to travel from Washington DC to the various Congressional districts across the nation?  Is it even less perfect than the present system that involves gerrymandered representatives voting on giant bills consisting of thousands of pages that they have not even read?</p><p>The point I am making here is that even the most die-hard equalitarian favors strict limits on democracy.  They might appeal to feasibility, practicality, voter ignorance, or any number of other factors, but at the end of the day, every single one I have ever encountered favors concrete limits for the electorate.  Therefore, this is a purely practical debate and the metaphysical arguments upon which the pro-suffrage equalitarian rhetoric is based are irrelevant and inapplicable.</p></div>",
  "content_text": "Boris rejects my proposed liberty metric:\n“So my question to Mr. Trimnell is if he accepts the number of laws and regulations in effect as a reasonable metric for measuring human liberty in this regard?”\nThis is a terrible metric. The content of the law is far more important wrt liberty than the actual number of laws. It can hardly be argued that American society is less free today than in 1919.  In any case, a more complex society will always have more laws, so your metric is not well thought out at all.\nBoris’s objection is nonsensical on its face.  How can he reasonably compare the content of a single law to the total number of laws?  Alternatively, if by “the content of the law” he means “the cumulative content of all the laws”, how can he possibly ignore the fact that since all laws contain restrictions on human behavior, the larger the number of laws, the larger the number of restrictions on human behavior that they collectively contain?\nIt is true that the cumulative content of restrictions imposed by all the laws is a better metric than the mere number of them, but the latter is much easier to calculate, harder to dispute, and is demonstrably a reasonable and effective metric even if not the ideal one.\nFurthermore, it can very easily be argued, indeed, it can very easily be\nproved\n, that American society is considerably less free today than in 1919.  I invite Boris to either attempt to prove that American society is\nconsiderably more\nas free today than in 1919 or retract his assertion.\nFinally, what is “a complex society”?  Wikipedia defines it as: “the extent of a division of labour in which members of society are more or less permanently specialized in particular activities and depend on others for goods and services, within a system regulated by custom and laws.”  Since a complex society features a regulated system by definition, it should be clear that the complex society’s inevitable tendency to have more laws not only fails to disprove the metric, but instead underlines its effectiveness.\nI also asked The Great Martini about his preference for democracy or limited democracy:\n“Question for you: what better expresses the will of the people, direct\ndemocracy or representative-limited democracy? And which do you favor?”\nDirect\ndemocracy would be preferable if a practical system could be devised to\nimplement it.  There’s the question of whether it would even be\nfeasible to run a government by constantly consulting all the people\nevery time a decision had to be made.  If everyone were versed in\neverything and if everyone would actually agree to a process of constant\npolling it would no doubt be a very effective expression of the will of\nthe people.  The internet has made that more feasible, but still I\nthink impractical.\nWhat does feasibility have to do with the more perfect expression of the will of the people?  Is direct democracy via the Internet truly LESS feasible or a less perfect expression than the system of limited representative democracy when it took weeks for information to travel from Washington DC to the various Congressional districts across the nation?  Is it even less perfect than the present system that involves gerrymandered representatives voting on giant bills consisting of thousands of pages that they have not even read?\nThe point I am making here is that even the most die-hard equalitarian favors strict limits on democracy.  They might appeal to feasibility, practicality, voter ignorance, or any number of other factors, but at the end of the day, every single one I have ever encountered favors concrete limits for the electorate.  Therefore, this is a purely practical debate and the metaphysical arguments upon which the pro-suffrage equalitarian rhetoric is based are irrelevant and inapplicable.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-04T10:42:00+00:00"
}