{
  "url": "https://voxday.net/2013/02/20/mailvox-value-is-not-objective/",
  "scraped_at": "2025-12-14T22:21:06.210202",
  "title": "Mailvox: value is not objective",
  "date_display": "February 20, 2013",
  "date_iso": "2013-02-20T16:18:00+00:00",
  "date_from_url": "2013-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Asher claims to know something of economics despite making a massive and fundamental error that requires complete ignorance of subjective value theory:</p><blockquote class=\"tr_bq\"><p> My undergrad was economics and my grad work was in philosophy focusing on theory of mind and the social sciences, prompted by investigating whether or not economics is a positive body of knowledge. Yeah, I know just a little bit about the topic.</p></blockquote><p>A little bit is not enough to intelligently discuss these matters.  Other than the Mises Institute, there is not a single undergraduate economics program of which I am aware that is not based on the neoclassical assumption of objective value.  Unfortunately, the state of economic education is now such that one can possess considerable economic academic credentials while still knowing nothing of some of the most fundamental basics.  Subjective value is a proto-Austrian concept that is not taught in either Econ 101 or 301; most economics PhDs, to say nothing of undergrads, are completely unfamiliar with the scholastics and the pre-Smithian economists and genuinely believe that economics is a 200-year old discipline that began with Adam Smith.</p><p>This is where Asher demonstrated that he simply does not know what “subjective value” is:</p><blockquote class=\"tr_bq\"><p>  This is where the subjective theory of value leads. If everything of value has to be reflected in a market price then to not pay anyone for something of value is ‘unjust’.</p></blockquote><p>Subjective value does not lead there; it cannot lead there because it neither requires anything, (much less everything), of value to be reflected in a price nor assigns any significance beyond the immediate exchange to the exchange value.  As it happens, I’ve been reading Volume II of Rothbard’s excellent <i>Austrian Perspective on the History of Economic Thought</i>, which I recommend to everyone, but especially Asher, and happened to read the following at the gym today:</p><blockquote class=\"tr_bq\"><p> In contrast to the Smith-Ricardo mainstream of Smithians who set forth the labour theory (or at very best, the cost-of-production theory) of value, J.B. Say firmly re-established the scholastic-continental-French utility analysis. It is utility and utility alone that gives rise to exchange value, and Say settled the value paradox to his own satisfaction by disposing of ‘use-value’ altogether as not being relevant to the world of exchange. Not only that: Say adopted a subjective value theory, since he believed that value rests on acts of valuation by the consumers. In addition to being subjective, these degrees of valuation are relative, since the value of one good or service is always being compared against another. These values, or utilities, depend on all manner of wants, desires and knowledge on the part of individuals: ‘upon the moral and physical nature of man, the climate he lives in, and on the manner and legislation of his country. He has wants of the body, wants of the mind, and of the soul; wants for himself, others for his family, others still as a member of society’.  Political economy, Say sagely pointed out, must take these values and preferences of people as givens, ‘as one of the data of its reasonings; leaving to the moralist and the practical man, the several duties of enlightening and of guiding their fellow-creatures, as well in this, as in other particulars of human conduct’.</p><p>At some points, Say went up to the edge of discovering the marginal utility concept, without ever quite doing so. Thus he saw that relative valuations of goods depends on ‘degrees of estimation in the mind of the valuer’. But since he did not discover the marginal concept, he could not fully solve the value paradox. In fact, he did far less well at solving it than his continental predecessors. And so Say simply dismissed use-value and the value paradox altogether, and decided to concentrate on exchange-value….</p><p>But whereas Say simply discarded use-value, Ricardo made the value paradox and the unfortunate split between use- and exchange-value the key to his value theory. For Ricardo, iron was worth less than gold because the labour cost of digging and producing gold was greater than the labour cost of producing iron. Ricardo admitted that utility ‘is certainly the foundation of value’, but this was apparently of only remote interest, since the ‘degree of utility’ can never be the measure by which to estimate its value. All too true, but Ricardo failed to see the absurdity of looking for such a measure in the first place. His second absurdity, as we shall see further below, was in thinking that labour cost provided such a ‘true’ and invariable measure of value. As Say wrote in his annotations on the French translation of Ricardo’s Principles, ‘an invariable measure of value is a pure chimera’.</p><p>Smith, and still more Ricardo, were pushed into their labour cost theory by concentrating on the long-run ‘natural’ price of products. Say’s analysis was aided greatly by his realistic concentration on the explanation of real market price.</p><p>– Murry Rothbard,<i> An Austrian Perspective on the History of Economic Thought</i>, 1.5 Utility, productivity and distribution</p></blockquote><p>Not only does Asher not understand what subjective value is, he then compounds his error by leaping to an erroneous conclusion on the basis of his false understanding.  Subjective value severs any possible connection between price and justice; it specifically denies even the possibility that there is necessarily any connection between the exchange value of a particular object to two parties at one point in time and the value of that same object to those two parties at a different point in time, much less any significance to any one else of either of those two different exchange values.</p><p>Nor is subjective value theory new.  Rothbard traces it back to Democritus, a contemporary of Socrates, of whom he writes: <i>“Democritus contributed two important strands of thought to the development of economics. First, he was the founder of subjective value theory. Moral values, ethics, were absolute, Democritus taught, but economic values were necessarily subjective. ‘The same thing’, Democritus writes, may be ‘good and true for all men, but the pleasant differs from one and another’.”</i></p><p>Rothbard also noted that Saint Augustine grasped the essence of subjective value: <i>“Augustine’s economic views were scattered throughout The City of God and his other highly influential writings. But he definitely, and presumably independently of Aristotle, arrived at the view that people’s payments for goods, the valuation they placed on them, was determined by their own needs rather than by any more objective criterion or by their rank in the order of nature. This was at least the basis of the later Austrian theory of subjective value.”</i></p><p>There is, there can be, no such thing as a “just price” under subjective value theory because the value placed upon an object by an individual, which is used to establish the price, is both unique and dynamic.  This is in direct contradiction to the objective value concept that has dominated economics ever since Adam Smith revived the ancient value paradox by confusing exchange value with use value.</p></div>",
  "content_text": "Asher claims to know something of economics despite making a massive and fundamental error that requires complete ignorance of subjective value theory:\nMy undergrad was economics and my grad work was in philosophy focusing on theory of mind and the social sciences, prompted by investigating whether or not economics is a positive body of knowledge. Yeah, I know just a little bit about the topic.\nA little bit is not enough to intelligently discuss these matters.  Other than the Mises Institute, there is not a single undergraduate economics program of which I am aware that is not based on the neoclassical assumption of objective value.  Unfortunately, the state of economic education is now such that one can possess considerable economic academic credentials while still knowing nothing of some of the most fundamental basics.  Subjective value is a proto-Austrian concept that is not taught in either Econ 101 or 301; most economics PhDs, to say nothing of undergrads, are completely unfamiliar with the scholastics and the pre-Smithian economists and genuinely believe that economics is a 200-year old discipline that began with Adam Smith.\nThis is where Asher demonstrated that he simply does not know what “subjective value” is:\nThis is where the subjective theory of value leads. If everything of value has to be reflected in a market price then to not pay anyone for something of value is ‘unjust’.\nSubjective value does not lead there; it cannot lead there because it neither requires anything, (much less everything), of value to be reflected in a price nor assigns any significance beyond the immediate exchange to the exchange value.  As it happens, I’ve been reading Volume II of Rothbard’s excellent\nAustrian Perspective on the History of Economic Thought\n, which I recommend to everyone, but especially Asher, and happened to read the following at the gym today:\nIn contrast to the Smith-Ricardo mainstream of Smithians who set forth the labour theory (or at very best, the cost-of-production theory) of value, J.B. Say firmly re-established the scholastic-continental-French utility analysis. It is utility and utility alone that gives rise to exchange value, and Say settled the value paradox to his own satisfaction by disposing of ‘use-value’ altogether as not being relevant to the world of exchange. Not only that: Say adopted a subjective value theory, since he believed that value rests on acts of valuation by the consumers. In addition to being subjective, these degrees of valuation are relative, since the value of one good or service is always being compared against another. These values, or utilities, depend on all manner of wants, desires and knowledge on the part of individuals: ‘upon the moral and physical nature of man, the climate he lives in, and on the manner and legislation of his country. He has wants of the body, wants of the mind, and of the soul; wants for himself, others for his family, others still as a member of society’.  Political economy, Say sagely pointed out, must take these values and preferences of people as givens, ‘as one of the data of its reasonings; leaving to the moralist and the practical man, the several duties of enlightening and of guiding their fellow-creatures, as well in this, as in other particulars of human conduct’.\nAt some points, Say went up to the edge of discovering the marginal utility concept, without ever quite doing so. Thus he saw that relative valuations of goods depends on ‘degrees of estimation in the mind of the valuer’. But since he did not discover the marginal concept, he could not fully solve the value paradox. In fact, he did far less well at solving it than his continental predecessors. And so Say simply dismissed use-value and the value paradox altogether, and decided to concentrate on exchange-value….\nBut whereas Say simply discarded use-value, Ricardo made the value paradox and the unfortunate split between use- and exchange-value the key to his value theory. For Ricardo, iron was worth less than gold because the labour cost of digging and producing gold was greater than the labour cost of producing iron. Ricardo admitted that utility ‘is certainly the foundation of value’, but this was apparently of only remote interest, since the ‘degree of utility’ can never be the measure by which to estimate its value. All too true, but Ricardo failed to see the absurdity of looking for such a measure in the first place. His second absurdity, as we shall see further below, was in thinking that labour cost provided such a ‘true’ and invariable measure of value. As Say wrote in his annotations on the French translation of Ricardo’s Principles, ‘an invariable measure of value is a pure chimera’.\nSmith, and still more Ricardo, were pushed into their labour cost theory by concentrating on the long-run ‘natural’ price of products. Say’s analysis was aided greatly by his realistic concentration on the explanation of real market price.\n– Murry Rothbard,\nAn Austrian Perspective on the History of Economic Thought\n, 1.5 Utility, productivity and distribution\nNot only does Asher not understand what subjective value is, he then compounds his error by leaping to an erroneous conclusion on the basis of his false understanding.  Subjective value severs any possible connection between price and justice; it specifically denies even the possibility that there is necessarily any connection between the exchange value of a particular object to two parties at one point in time and the value of that same object to those two parties at a different point in time, much less any significance to any one else of either of those two different exchange values.\nNor is subjective value theory new.  Rothbard traces it back to Democritus, a contemporary of Socrates, of whom he writes:\n“Democritus contributed two important strands of thought to the development of economics. First, he was the founder of subjective value theory. Moral values, ethics, were absolute, Democritus taught, but economic values were necessarily subjective. ‘The same thing’, Democritus writes, may be ‘good and true for all men, but the pleasant differs from one and another’.”\nRothbard also noted that Saint Augustine grasped the essence of subjective value:\n“Augustine’s economic views were scattered throughout The City of God and his other highly influential writings. But he definitely, and presumably independently of Aristotle, arrived at the view that people’s payments for goods, the valuation they placed on them, was determined by their own needs rather than by any more objective criterion or by their rank in the order of nature. This was at least the basis of the later Austrian theory of subjective value.”\nThere is, there can be, no such thing as a “just price” under subjective value theory because the value placed upon an object by an individual, which is used to establish the price, is both unique and dynamic.  This is in direct contradiction to the objective value concept that has dominated economics ever since Adam Smith revived the ancient value paradox by confusing exchange value with use value.",
  "tags": [
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-20T16:18:00+00:00"
}