{
  "url": "https://voxday.net/2013/02/04/mailvox-erroneous-summary/",
  "scraped_at": "2025-12-14T22:19:35.103789",
  "title": "Mailvox: an erroneous summary",
  "date_display": "February 4, 2013",
  "date_iso": "2013-02-04T18:00:00+00:00",
  "date_from_url": "2013-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ed <a href=\"http://onewordtrimnell.blogspot.com/2013/02/universal-suffrage-fairness-and.html\">responds to my previous post</a> on sexual inequality.  Unfortunately, he tries to leap past the specific issues raised and summarizes them incorrectly:</p><blockquote class=\"tr_bq\"><p> Your<br> arguments, gentlemen, all boil down to one essential realization: When<br> you open up the gates of universal suffrage, the results become more<br> unpredictable and difficult to manage.</br></br></br></p></blockquote><p>This is<br> totally incorrect.  When the gates of universal suffrage are opened, the<br> results become entirely predictable and deleterious.  This is both<br> logically obvious and empirically demonstrable, since the consequences we are<br> currently experiencing were correctly anticipated by a wide variety of<br> men and women who opposed suffrage.</br></br></br></br></br></p><blockquote class=\"tr_bq\"><p> [H]ere<br> is a point I believe you overlook: We live in the twenty-first century.<br> Women are taxpayers, voters, and fully integrated into our educational,<br> corporate, and political institutions. A significant number of men<br> (myself included) believe that they have the right to equal<br> opportunities in our society. Even if it is possible to prove that women<br> are marginally less (or more, a la Tom Peters) capable than men, an<br> inexorable fact remains: Female participation in our society is firmly<br> established; and barring some cataclysmic counterrevolution, it is here<br> to stay.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Considering that I’m on record as expecting<br> the collapse of the USA in the 2033 timeframe, I don’t think I<br> can be reasonably said to have overlooked the point.  I understand that female<br> participation in our society is firmly established; that is precisely<br> why I expect our society to collapse and shatter.  This will not be the first<br> time this has happened, and human nature being what it is, I tend to<br> doubt that it will be the last.</br></br></br></br></br></br></p><p>Roissy’s observations on this score are reliably astute: <i>“We are the front lines of a grand sociological experiment the fruits of which are just now beginning to ripen. There is no way to know the exact contours it will trace, because nothing of this precise nature on this gargantuan scale has befallen an entire civilization of our size, until now. But if past performance of similar civilizational devolutions is indicative of future returns, there is little cause for optimism. The omens are everywhere.”</i></p><blockquote class=\"tr_bq\"><p>  One,<br> even if it is possible to demonstrate that a particular group (men,<br> women, whites, blacks, Asians, etc.) is marginally more<br> intelligent/aggressive/etc. as compared to its counterpart(s), such<br> differences are statistically marginal, at best. Within my personal<br> circle of acquaintances, there are plenty of Asians who are poor at<br> math, and at least a dozen African-American engineers. The marginal<br> characteristics of a particular group (if they are provable and<br> demonstrable at all) do not enable you to make accurate predictions<br> about an individual member of that group.</br></br></br></br></br></br></br></br></br></p><p>Secondly, we<br> live in a pluralistic society. Fairness demands that we accept the equal<br> rights of all individuals (as opposed to the group rights advocated by<br> the extreme right and the politically correct left); and practicality<br> demands that we (I am speaking for conservatives here) construct a<br> message of small government and individual liberty that is free of<br> religious, ethnic, and gender biases.</br></br></br></br></br></br></p><p>In practice, arguments about race and/or and sex-based innate abilities do little more than offend people.</p></blockquote><p>First, the inability to make accurate predictions about an individual member of that group are irrelevant since we’re not discussing the hypothetical disenfranchisement of individual voters, but rather the disenfranchisement of an entire class of voters.  And the marginal characteristics of a particular group most certainly allow one to make accurate predictions about their future collective behavior.</p><p>Second, fairness is irrelevant.  This is the expected retreat to metaphysics I anticipated and it is not applicable to the practical argument in which we are presently engaged.  Nor does practicality demand a message free of biases, indeed, the entire written history of Man demonstrates precisely the opposite.  Nor could it, given that my argument is a practical and empirical one.</p><p>Third, it is no concern of mine if people are offended or not.  The truth often offends people.  It is no surprise to me that women dislike the historical fact that their collective involvement in governance has historically led to the rapid loss of national sovereignty, to economic contraction, and other consequences generally deemed undesirable.  But history is as it is.  The facts are as they are.  Simply wishing things were otherwise is neither realistic nor a rational approach to the issue.</p><p>No one who is capable of grasping the concept that permitting children to choose their meals is not <i>always and necessarily</i> in their long-term best interest should have trouble understanding that permitting an increased influence in governance to any particular group is not always and necessarily in the best interest of that group or anyone else.  Nor is it necessary for a society to collapse entirely before the positive or negative effects of a specific group’s increased involvement in government to be ascertained.</p></div>",
  "content_text": "Ed\nresponds to my previous post\non sexual inequality.  Unfortunately, he tries to leap past the specific issues raised and summarizes them incorrectly:\nYour\narguments, gentlemen, all boil down to one essential realization: When\nyou open up the gates of universal suffrage, the results become more\nunpredictable and difficult to manage.\nThis is\ntotally incorrect.  When the gates of universal suffrage are opened, the\nresults become entirely predictable and deleterious.  This is both\nlogically obvious and empirically demonstrable, since the consequences we are\ncurrently experiencing were correctly anticipated by a wide variety of\nmen and women who opposed suffrage.\n[H]ere\nis a point I believe you overlook: We live in the twenty-first century.\nWomen are taxpayers, voters, and fully integrated into our educational,\ncorporate, and political institutions. A significant number of men\n(myself included) believe that they have the right to equal\nopportunities in our society. Even if it is possible to prove that women\nare marginally less (or more, a la Tom Peters) capable than men, an\ninexorable fact remains: Female participation in our society is firmly\nestablished; and barring some cataclysmic counterrevolution, it is here\nto stay.\nConsidering that I’m on record as expecting\nthe collapse of the USA in the 2033 timeframe, I don’t think I\ncan be reasonably said to have overlooked the point.  I understand that female\nparticipation in our society is firmly established; that is precisely\nwhy I expect our society to collapse and shatter.  This will not be the first\ntime this has happened, and human nature being what it is, I tend to\ndoubt that it will be the last.\nRoissy’s observations on this score are reliably astute:\n“We are the front lines of a grand sociological experiment the fruits of which are just now beginning to ripen. There is no way to know the exact contours it will trace, because nothing of this precise nature on this gargantuan scale has befallen an entire civilization of our size, until now. But if past performance of similar civilizational devolutions is indicative of future returns, there is little cause for optimism. The omens are everywhere.”\nOne,\neven if it is possible to demonstrate that a particular group (men,\nwomen, whites, blacks, Asians, etc.) is marginally more\nintelligent/aggressive/etc. as compared to its counterpart(s), such\ndifferences are statistically marginal, at best. Within my personal\ncircle of acquaintances, there are plenty of Asians who are poor at\nmath, and at least a dozen African-American engineers. The marginal\ncharacteristics of a particular group (if they are provable and\ndemonstrable at all) do not enable you to make accurate predictions\nabout an individual member of that group.\nSecondly, we\nlive in a pluralistic society. Fairness demands that we accept the equal\nrights of all individuals (as opposed to the group rights advocated by\nthe extreme right and the politically correct left); and practicality\ndemands that we (I am speaking for conservatives here) construct a\nmessage of small government and individual liberty that is free of\nreligious, ethnic, and gender biases.\nIn practice, arguments about race and/or and sex-based innate abilities do little more than offend people.\nFirst, the inability to make accurate predictions about an individual member of that group are irrelevant since we’re not discussing the hypothetical disenfranchisement of individual voters, but rather the disenfranchisement of an entire class of voters.  And the marginal characteristics of a particular group most certainly allow one to make accurate predictions about their future collective behavior.\nSecond, fairness is irrelevant.  This is the expected retreat to metaphysics I anticipated and it is not applicable to the practical argument in which we are presently engaged.  Nor does practicality demand a message free of biases, indeed, the entire written history of Man demonstrates precisely the opposite.  Nor could it, given that my argument is a practical and empirical one.\nThird, it is no concern of mine if people are offended or not.  The truth often offends people.  It is no surprise to me that women dislike the historical fact that their collective involvement in governance has historically led to the rapid loss of national sovereignty, to economic contraction, and other consequences generally deemed undesirable.  But history is as it is.  The facts are as they are.  Simply wishing things were otherwise is neither realistic nor a rational approach to the issue.\nNo one who is capable of grasping the concept that permitting children to choose their meals is not\nalways and necessarily\nin their long-term best interest should have trouble understanding that permitting an increased influence in governance to any particular group is not always and necessarily in the best interest of that group or anyone else.  Nor is it necessary for a society to collapse entirely before the positive or negative effects of a specific group’s increased involvement in government to be ascertained.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-04T18:00:00+00:00"
}