{
  "url": "https://voxday.net/2013/02/12/mailvox-leftist-responds/",
  "scraped_at": "2025-12-14T22:20:24.520430",
  "title": "Mailvox: a leftist responds",
  "date_display": "February 12, 2013",
  "date_iso": "2013-02-12T08:17:00+00:00",
  "date_from_url": "2013-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DH couldn’t quite keep his response to <a href=\"http://www.milobookclub.com/2013/02/11/live-by-science/\">Live by the Science</a> within the Blogger comment character limits, so he emailed it to me.  It’s almost alarmingly reasonable and helps explain some of the appeal of the Left, particularly to the young, that is so inexplicable to we libertarian extremists.</p><blockquote class=\"tr_bq\"><p> Thank you for bringing this topic up.  It’s not a very often discussed topic within leftist circles for many reasons.  Within my close circle of elite, liberal friends we do get together to drink artisianally crafted authentic middle-ages mead we often discuss this topic, but only in hushed tones.  Between puffs on our organically grown, locally sourced, hand stretched tobacco, we speak quietly of the science itself, and the implications.</p><p>First, my initial point, if it was not clear, is that there exists legal equality before the law.  Sadly, at this point American law and history, this has been reduced to “Congress has the ability to regulate all people equally, but may or may not do so”.  I believe this is the basis for your comments regarding the “legal fiction” of equality.   My view on this is that this state has come about as a result of two forces:  1) a few holdouts of the anti-feminist line of thinking, who have managed to pass or hold onto, pre-feminist laws and customs; and 2) feminist and other activists who have decided to “work the refs” to obtain a favorable outcome, in contradiction to their claims about wanting only to be equal.  The point remains is that the leftist ideal is “equality before the law”, not “equality of outcomes”.  </p><p>This is a difficult topic to discuss in liberal circles because of racial hucksters.  With no exceptions the racial hucksters are all leftists and liberals.   It is often uncomfortable to own the sludge of your ideological party, but nonetheless, these buffoons are mine to own.  It is beyond question that you cannot discuss any of these matters with this cohort, under any preconditions.   I generally find solace in the fact that we share the revulsion towards the types who hiss “raciss” at every turn.</p><p>My objection was founded on the basis that leftists and liberals like myself recognize that most stereotypes are correct.</p><p>For example, I am a bleeding heart liberal.  If an unfortunate looking soul solicits me, I will do almost anything they ask.  My wife often remarks that I must have a glow that only grifters can see.  At the gas station, when I have parked my electric-only golf-cart sized car to run in and get some chai or tofu, I am often approached by someone with a hard luck story asking if they can have a dollar or two for gas so they can get home to their babies, or back to work, or whatever.  More often than not I fill their tank.  When the local church – not mine, I am not religious – had storm damage and needed donations for a new roof I split my emergency fund and donated timbers I had obtained for a DIY project. </p><p>The same is true not only of this stereotype, but of most of them.  I won’t restate them, but you can imagine what they are.  Because they are rooted in observation and obtained over the ages they are more often accurate.  When I learned that the genetics of racial attributes are fairly well established I was not surprised.  As with many things, conventional wisdom tends to be accurate.  However, despite this, we on the left seek to carve race and race relations out of the realm of the biological sciences, and instead, keep them in the realm of social pseudo-science.  Frankly, we do not trust the masses with the information, nor even our own elite.  It is rope enough to hang oneself, or in this case, one’s neighbors.  But why deny our natural selves, and our natural desires?  We seek a compassionate compromise – that is based outside of science and history.  We seek a balance between our biological instincts that tell us to divide by race and attributes, and the rational knowledge that there is an at least equal value to be had people with attributes that are unlike our own.  We do not yield the ground that there is a clearly and universally superior sub-species group [although, logic dictates that one could develop, over long timescales].  This compromise is the “content of one’s character” test.  And really, except for a small number of hardcore bigots, that’s how I see most people, liberal, conservative or otherwise, operate their relations. </p><p>This test and the collective result of individuals’ decisions to live by it are the reason why today a small slice of minorities have the opportunity to access the more affluent, more socially rewarding, and more culturally powerful anglo-American tradition.  As Derbyshire pointed out, there is a high-demand for minorities who are exemplars of their respective race.   At the top end of the societal power scale, people of all races mix well.  Within my circle of latte-sipping effette liberal friends, RGIII would fit in just fine, and he would be warmly welcomed.  That is because there is a very small difference between a successful black, and his white counterpart.  They both live in the same areas, kids both go to the same schools, etc.  The main difference is the statistical improbabilities involved.  For the white businessman, it is somewhat more likely that he ended up where he did.  For the black businessman, it was quite a bit more unlikely that he ended up where did.   Two racially divergent alpha’s share a lot more in common than one white alpha and what black delta.  At the bottom end of society – the low-class whites, the low-class blacks, the low-class hispanics – well, we never really expected them to mix well to begin with.  Our long-term preference would be for them to reduce numbers through birth control and abortions.   And again, this is where the “content of one’s character” test comes back into play.  I wouldn’t want my children significantly interacting with people in this cohort, because more often than not, their character matches their lot.  When that stereotype fails, I am happy to make exceptions. </p><p>Many leftists and liberals will often say things like “racism is evil”, without realizing they are being irrational.  In many cases the MPAI-variety leftist will really mean they think racism is evil, but for those of who think about it more deeply, what we really mean are “the manifestations of racism are unpleasant” – those things are violent segregation, and racial hucksterisms, and the damage to human dignity that is done by systematic racism (i.e. ‘No blacks allowed’).  This was what I meant by the “what to do about it” department.   I recognize racism as an inherent element of the human condition, and as such, the desire itself is not “evil” to the extent that evil exists in the world.   This is also my point regarding malice and ill-will.  I would never fault a person for moving out of a declining neighborhood, being overrun with low-class minorities.   This is because it’s not built on ill-will or malice, it’s based on a desire to preserve what one’s already got.   It gets much more sticky when you ask, well why not prevent the minorities from moving into the place where you relocate?  That way, you won’t have to repeat the activity years down the road.  This is difficult because it prevents the “content of one’s character” test – which is the basis for equality of opportunity and thus the basis for the rational leftist preference for race relations.</p><p>The civil rights era is precipitated on violations of what many view as the God-given right of free association.  You have lost the legal basis, in many cases, to decide with whom you shall associate, do business with, and conduct your lives with.   Even though racial tensions were largely localized, the liberals of the 1960’s and 1970’s were successful in working the refs to get the Federal government to trade a good chunk of freedom of association on the altar of equality of opportunity.  This may have short-term benefits, but many leftists recognize that the intellectual  and legal footing for this is very weak.</p><p>Many of the most upsetting facets of liberalism in America are centered around the victimization of the majority, in the name of equality of opportunity.  This often comes at the expense of equality before the law, which is troubling.  These are things like quotas, affirmative action, and preferences built upon normalizing access to outcomes deemed favorable by favored minorities.  I have often argued that enforcing these mandates puts the entire concept of “equality before the law” in jeopardy, and it seems that with the growing documentation and understanding of the biological aspects of race, this is becoming more likely.   The  rational leftist has no choice but to acknowledge that these preferences must be dispatched.  As the understanding of sub-species race expand, so too will the demands of the minorities, until the point where equality of opportunity is worthless (a point which we may well have already passed).  The leftist solution is to refocus policies and society around equality of opportunity and to do so while preserving  and enhancing equality before the law.   In this way, we can balance the natural desire to separate unto ourselves with the compassionate compromise of the “content of one’s character” test.  Civilized people will be welcome to organize themselves according to their preference and to maximize productivity and commerce, and the low-classes will remain largely as they are today – defactor segregated.  Over the longer timescales, intermixing will average out the various attributes and produce generations of citizens with more average abilities, with fewer deviations from that average.</p><p>It is unfortunate that all cannot engage openly and honestly in this debate, and for that reason, I recognize the inherent weakness of the leftist liberal position.  VD is exactly right when he claims that honest and forthright discussion on this topic is not currently permissible, and that the blame for that lies largely on the side of the left.  MPAI is true, but especially so for many on “my side”.</p></blockquote><p>What an eloquent elegy for his own side.  The fact is that discourse is rendered impossible when, as soon as one speaks one’s mind, the interlocutor points, shrieks, and rules not only the thought, but the speaker as well, out of bounds.  This is the intrinsic problem with the Latin proverb <i>qui tacet consentire videtur</i> and the idea that silence indicates consent; it creates an incentive for forcing silence and thereby creating the public impression of consent.  After all, if no one is speaking out against the iron-fisted rule of Stalin, everyone must be consenting to it, correct?</p><p>And the problem of the “content of one’s character” test is even more obvious.  One’s character by what moral standard?  The Left’s position sounds noble enough, at least as described by DH, but when practiced by those who reject the traditional Western moral standard, it becomes inescapably incoherent.</p></div>",
  "content_text": "DH couldn’t quite keep his response to\nLive by the Science\nwithin the Blogger comment character limits, so he emailed it to me.  It’s almost alarmingly reasonable and helps explain some of the appeal of the Left, particularly to the young, that is so inexplicable to we libertarian extremists.\nThank you for bringing this topic up.  It’s not a very often discussed topic within leftist circles for many reasons.  Within my close circle of elite, liberal friends we do get together to drink artisianally crafted authentic middle-ages mead we often discuss this topic, but only in hushed tones.  Between puffs on our organically grown, locally sourced, hand stretched tobacco, we speak quietly of the science itself, and the implications.\nFirst, my initial point, if it was not clear, is that there exists legal equality before the law.  Sadly, at this point American law and history, this has been reduced to “Congress has the ability to regulate all people equally, but may or may not do so”.  I believe this is the basis for your comments regarding the “legal fiction” of equality.   My view on this is that this state has come about as a result of two forces:  1) a few holdouts of the anti-feminist line of thinking, who have managed to pass or hold onto, pre-feminist laws and customs; and 2) feminist and other activists who have decided to “work the refs” to obtain a favorable outcome, in contradiction to their claims about wanting only to be equal.  The point remains is that the leftist ideal is “equality before the law”, not “equality of outcomes”.\nThis is a difficult topic to discuss in liberal circles because of racial hucksters.  With no exceptions the racial hucksters are all leftists and liberals.   It is often uncomfortable to own the sludge of your ideological party, but nonetheless, these buffoons are mine to own.  It is beyond question that you cannot discuss any of these matters with this cohort, under any preconditions.   I generally find solace in the fact that we share the revulsion towards the types who hiss “raciss” at every turn.\nMy objection was founded on the basis that leftists and liberals like myself recognize that most stereotypes are correct.\nFor example, I am a bleeding heart liberal.  If an unfortunate looking soul solicits me, I will do almost anything they ask.  My wife often remarks that I must have a glow that only grifters can see.  At the gas station, when I have parked my electric-only golf-cart sized car to run in and get some chai or tofu, I am often approached by someone with a hard luck story asking if they can have a dollar or two for gas so they can get home to their babies, or back to work, or whatever.  More often than not I fill their tank.  When the local church – not mine, I am not religious – had storm damage and needed donations for a new roof I split my emergency fund and donated timbers I had obtained for a DIY project.\nThe same is true not only of this stereotype, but of most of them.  I won’t restate them, but you can imagine what they are.  Because they are rooted in observation and obtained over the ages they are more often accurate.  When I learned that the genetics of racial attributes are fairly well established I was not surprised.  As with many things, conventional wisdom tends to be accurate.  However, despite this, we on the left seek to carve race and race relations out of the realm of the biological sciences, and instead, keep them in the realm of social pseudo-science.  Frankly, we do not trust the masses with the information, nor even our own elite.  It is rope enough to hang oneself, or in this case, one’s neighbors.  But why deny our natural selves, and our natural desires?  We seek a compassionate compromise – that is based outside of science and history.  We seek a balance between our biological instincts that tell us to divide by race and attributes, and the rational knowledge that there is an at least equal value to be had people with attributes that are unlike our own.  We do not yield the ground that there is a clearly and universally superior sub-species group [although, logic dictates that one could develop, over long timescales].  This compromise is the “content of one’s character” test.  And really, except for a small number of hardcore bigots, that’s how I see most people, liberal, conservative or otherwise, operate their relations.\nThis test and the collective result of individuals’ decisions to live by it are the reason why today a small slice of minorities have the opportunity to access the more affluent, more socially rewarding, and more culturally powerful anglo-American tradition.  As Derbyshire pointed out, there is a high-demand for minorities who are exemplars of their respective race.   At the top end of the societal power scale, people of all races mix well.  Within my circle of latte-sipping effette liberal friends, RGIII would fit in just fine, and he would be warmly welcomed.  That is because there is a very small difference between a successful black, and his white counterpart.  They both live in the same areas, kids both go to the same schools, etc.  The main difference is the statistical improbabilities involved.  For the white businessman, it is somewhat more likely that he ended up where he did.  For the black businessman, it was quite a bit more unlikely that he ended up where did.   Two racially divergent alpha’s share a lot more in common than one white alpha and what black delta.  At the bottom end of society – the low-class whites, the low-class blacks, the low-class hispanics – well, we never really expected them to mix well to begin with.  Our long-term preference would be for them to reduce numbers through birth control and abortions.   And again, this is where the “content of one’s character” test comes back into play.  I wouldn’t want my children significantly interacting with people in this cohort, because more often than not, their character matches their lot.  When that stereotype fails, I am happy to make exceptions.\nMany leftists and liberals will often say things like “racism is evil”, without realizing they are being irrational.  In many cases the MPAI-variety leftist will really mean they think racism is evil, but for those of who think about it more deeply, what we really mean are “the manifestations of racism are unpleasant” – those things are violent segregation, and racial hucksterisms, and the damage to human dignity that is done by systematic racism (i.e. ‘No blacks allowed’).  This was what I meant by the “what to do about it” department.   I recognize racism as an inherent element of the human condition, and as such, the desire itself is not “evil” to the extent that evil exists in the world.   This is also my point regarding malice and ill-will.  I would never fault a person for moving out of a declining neighborhood, being overrun with low-class minorities.   This is because it’s not built on ill-will or malice, it’s based on a desire to preserve what one’s already got.   It gets much more sticky when you ask, well why not prevent the minorities from moving into the place where you relocate?  That way, you won’t have to repeat the activity years down the road.  This is difficult because it prevents the “content of one’s character” test – which is the basis for equality of opportunity and thus the basis for the rational leftist preference for race relations.\nThe civil rights era is precipitated on violations of what many view as the God-given right of free association.  You have lost the legal basis, in many cases, to decide with whom you shall associate, do business with, and conduct your lives with.   Even though racial tensions were largely localized, the liberals of the 1960’s and 1970’s were successful in working the refs to get the Federal government to trade a good chunk of freedom of association on the altar of equality of opportunity.  This may have short-term benefits, but many leftists recognize that the intellectual  and legal footing for this is very weak.\nMany of the most upsetting facets of liberalism in America are centered around the victimization of the majority, in the name of equality of opportunity.  This often comes at the expense of equality before the law, which is troubling.  These are things like quotas, affirmative action, and preferences built upon normalizing access to outcomes deemed favorable by favored minorities.  I have often argued that enforcing these mandates puts the entire concept of “equality before the law” in jeopardy, and it seems that with the growing documentation and understanding of the biological aspects of race, this is becoming more likely.   The  rational leftist has no choice but to acknowledge that these preferences must be dispatched.  As the understanding of sub-species race expand, so too will the demands of the minorities, until the point where equality of opportunity is worthless (a point which we may well have already passed).  The leftist solution is to refocus policies and society around equality of opportunity and to do so while preserving  and enhancing equality before the law.   In this way, we can balance the natural desire to separate unto ourselves with the compassionate compromise of the “content of one’s character” test.  Civilized people will be welcome to organize themselves according to their preference and to maximize productivity and commerce, and the low-classes will remain largely as they are today – defactor segregated.  Over the longer timescales, intermixing will average out the various attributes and produce generations of citizens with more average abilities, with fewer deviations from that average.\nIt is unfortunate that all cannot engage openly and honestly in this debate, and for that reason, I recognize the inherent weakness of the leftist liberal position.  VD is exactly right when he claims that honest and forthright discussion on this topic is not currently permissible, and that the blame for that lies largely on the side of the left.  MPAI is true, but especially so for many on “my side”.\nWhat an eloquent elegy for his own side.  The fact is that discourse is rendered impossible when, as soon as one speaks one’s mind, the interlocutor points, shrieks, and rules not only the thought, but the speaker as well, out of bounds.  This is the intrinsic problem with the Latin proverb\nqui tacet consentire videtur\nand the idea that silence indicates consent; it creates an incentive for forcing silence and thereby creating the public impression of consent.  After all, if no one is speaking out against the iron-fisted rule of Stalin, everyone must be consenting to it, correct?\nAnd the problem of the “content of one’s character” test is even more obvious.  One’s character by what moral standard?  The Left’s position sounds noble enough, at least as described by DH, but when practiced by those who reject the traditional Western moral standard, it becomes inescapably incoherent.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-12T08:17:00+00:00"
}