{
  "url": "https://voxday.net/2013/02/18/music-from-responsible-puppe/",
  "scraped_at": "2025-12-14T22:20:55.584104",
  "title": "Music from the Responsible Puppet",
  "date_display": "February 18, 2013",
  "date_iso": "2013-02-18T14:00:00+00:00",
  "date_from_url": "2013-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Responsible Puppet writes:</p><blockquote class=\"tr_bq\"><p> Several years ago I wanted to teach my kids the weekly bible verse from<br> our church’s five year bible memory program so I started making up<br> songs. One of the pastor heard about it and asked us to sing at the<br> yearly bible verse kick off. After that, people started asking us to<br> record.</br></br></br></br></p><p>We started off slow and rough and we have<br> now produced five CDs. <a href=\"http://fighterversesongs.com/2013/02/16/introducing-the-sermon-on-the-mount-song-cd/\">The most recent CD</a> is the entire Sermon On The<br> Mount (every word, every verse), using several musical styles and the<br> gifts of nearly fifty musicians and multiple song-writers. It’s good,<br> main stream, not highly-produced family-friendly music. It includes the<br> Beatitudes, the Lord’s Prayer and many other favorite passages.</br></br></br></br></br></p></blockquote><p>Just to be clear, this is the RP’s deal, not mine.</p></div>",
  "content_text": "The Responsible Puppet writes:\nSeveral years ago I wanted to teach my kids the weekly bible verse from\nour church’s five year bible memory program so I started making up\nsongs. One of the pastor heard about it and asked us to sing at the\nyearly bible verse kick off. After that, people started asking us to\nrecord.\nWe started off slow and rough and we have\nnow produced five CDs.\nThe most recent CD\nis the entire Sermon On The\nMount (every word, every verse), using several musical styles and the\ngifts of nearly fifty musicians and multiple song-writers. It’s good,\nmain stream, not highly-produced family-friendly music. It includes the\nBeatitudes, the Lord’s Prayer and many other favorite passages.\nJust to be clear, this is the RP’s deal, not mine.",
  "tags": [
    "Christianity",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-18T14:00:00+00:00"
}