{
  "url": "https://voxday.net/2013/02/22/on-radio-3/",
  "scraped_at": "2025-12-14T22:21:15.395172",
  "title": "On the radio",
  "date_display": "February 22, 2013",
  "date_iso": "2013-02-22T08:43:00+00:00",
  "date_from_url": "2013-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was on Brian Greenberg’s Philadelphia radio show last night, where we talked all about McRapey, and how terribly persecuted I am, and how bravely and ingeniously I’ve handled being persecuted, and how my books aren’t derivative ripoffs AT ALL.  It was a very courageous performance by me and I feel much better about myself now that my feelings have been affirmed by a sympathetic media figure.</p><p>You’re going to want to hear it, because I also gave some important hints about my <i>totally all-original</i> next book!  That’s right, you can squee now!  Here’s a hint: my <i>inspiration </i>rhymes with <i>Why Zack Does Improv</i> and it’s a “reboot” of a certain science fiction classic, only instead of predicting the collapse of the Galactic Empire, Mary Spelltown proves <i>mathematically </i>that by switching over to a matriarchal system of rule by lesbian Empresses of color, the Empire will become <i>even more</i> vibrant and fabulous and fair, thanks to the invisible guidance of a secret <i>dance club</i> of mutant, mind-reading, mixed-race homosexuals that is founded by the brilliant, (and woman!) <i>hard </i>scientist.</p><p>And here is the best part.  <i>They communicate by farting!</i>  That’s right.  You may as well pencil in my 2014 Nebula Award for Best Tor Novel right now!</p></div>",
  "content_text": "I was on Brian Greenberg’s Philadelphia radio show last night, where we talked all about McRapey, and how terribly persecuted I am, and how bravely and ingeniously I’ve handled being persecuted, and how my books aren’t derivative ripoffs AT ALL.  It was a very courageous performance by me and I feel much better about myself now that my feelings have been affirmed by a sympathetic media figure.\nYou’re going to want to hear it, because I also gave some important hints about my\ntotally all-original\nnext book!  That’s right, you can squee now!  Here’s a hint: my\ninspiration\nrhymes with\nWhy Zack Does Improv\nand it’s a “reboot” of a certain science fiction classic, only instead of predicting the collapse of the Galactic Empire, Mary Spelltown proves\nmathematically\nthat by switching over to a matriarchal system of rule by lesbian Empresses of color, the Empire will become\neven more\nvibrant and fabulous and fair, thanks to the invisible guidance of a secret\ndance club\nof mutant, mind-reading, mixed-race homosexuals that is founded by the brilliant, (and woman!)\nhard\nscientist.\nAnd here is the best part.\nThey communicate by farting!\nThat’s right.  You may as well pencil in my 2014 Nebula Award for Best Tor Novel right now!",
  "tags": [
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-22T08:43:00+00:00"
}