{
  "url": "https://voxday.net/2013/02/21/reeducation-for-insufficiently-vibran/",
  "scraped_at": "2025-12-14T22:21:13.559438",
  "title": "Reeducation for the insufficiently vibrant",
  "date_display": "February 21, 2013",
  "date_iso": "2013-02-21T18:00:00+00:00",
  "date_from_url": "2013-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roissy notes that the government’s multicultural reeducation camps for insufficiently vibrant Americans <a href=\"http://heartiste.wordpress.com/2013/02/21/the-reeducation-camps-of-multicultural-america/\">are well underway</a>:</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/8sAqX9QYCYI?feature=player_embedded\" width=\"640\"></iframe></p><p>He writes: <i>“Like Communist reeducation camps, the captive (yes, captive, or they<br> lose their jobs) listeners in the audience are being humiliated by this<br> piece of shit into participating in de facto forced<br> confessionals of their imaginary sins, and indoctrination of their<br> “privilege” and “oppression”. You can hear their humiliating subjugation<br> in the way they nervously laugh at slander directed against them. This<br> is the laughter of the bullied beta male trying to go along to get<br> along, so as to avoid any beatings on the playground later.”</br></br></br></br></br></br></br></i></p></div>",
  "content_text": "Roissy notes that the government’s multicultural reeducation camps for insufficiently vibrant Americans\nare well underway\n:\nHe writes:\n“Like Communist reeducation camps, the captive (yes, captive, or they\nlose their jobs) listeners in the audience are being humiliated by this\npiece of shit into participating in de facto forced\nconfessionals of their imaginary sins, and indoctrination of their\n“privilege” and “oppression”. You can hear their humiliating subjugation\nin the way they nervously laugh at slander directed against them. This\nis the laughter of the bullied beta male trying to go along to get\nalong, so as to avoid any beatings on the playground later.”",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-21T18:00:00+00:00"
}