{
  "url": "https://voxday.net/2013/02/25/sff-corruption-part-ii/",
  "scraped_at": "2025-12-14T22:21:29.444523",
  "title": "SF/F Corruption: Part II",
  "date_display": "February 25, 2013",
  "date_iso": "2013-02-25T11:15:00+00:00",
  "date_from_url": "2013-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I had intended to continue on the SFWA theme <a href=\"http://www.blackgate.com/2012/12/27/sff-corruption-part-i/\">with which I began</a> the Corruption in Science Fiction series, but a pair of articles <a href=\"http://www.leapfrogging.com/2013/02/18/debunking-the-bestseller-book-sales-spike/\">concerning the legitimacy of the bestseller lists</a> caught my attention after being featured on Slashdot over the weekend:</p><blockquote class=\"tr_bq\"><p> The other day, I received an unexpected phone call from Jeff Trachtenberg, a reporter at The Wall Street Journal. He said he wanted to talk about my bestselling book, <i>Leapfrogging</i>. At first, I was thrilled. Any first-time author would jump at the chance to speak with such a high-profile publication. But it turned out Trachtenberg didn’t want to discuss what was in my book. He was interested in how it had made it onto his paper’s bestseller list. As he accurately noted, <i>Leapfrogging</i> had, well, leapt onto the Journal’s list at #3 the first week it debuted, and then promptly disappeared the following Friday.</p><p>Suddenly, I wasn’t so thrilled anymore. I was just about to sit down to dinner with my family and now I was being put on the spot to discuss my role in perhaps one of the most controversial practices in the book publishing industry. I was tempted to make an excuse and plead the 5th. But I wound up talking to Trachtenberg several times over the next few days….</p><p>Trachtenberg asked me about my experience with a company called <a href=\"http://www.resultsource.com/\" rel=\"noopener\" target=\"_blank\" title=\"ResultSource Bestseller Campaign Marketing\">ResultSource</a>,<br> the firm I had hired to help me hit the bestseller list from day one.<br> Trachtenberg said he had contacted all of the major New York publishers,<br> but no one would speak to him about the firm or the role of so-called<br> “bestseller campaigns” in helping authors reach the coveted status. No<br> comment. Dead silence.</br></br></br></br></br></p><p>I can’t say I was eager to be the first person to go on the record<br> about the topic. But then I realized something – Trachtenberg’s<br> surprising phone call was an opportunity to live up to what I urge my<br> readers to do in my book <i>Leapfrogging</i>.  I’ve seen the phenomenon of corporate silence repeatedly in my<br> career. There’s a big, smelly, ten thousand pound elephant in the<br> conference room. Everybody knows it’s there, but no one’s willing to<br> take the risk and point it out. As Trachtenberg was discovering,<br> bestseller campaigns are the unacknowledged pachyderm of the book<br> business.</br></br></br></br></br></br></br></br></p><p>There’s good reason why most industry insiders would prefer that the<br> wider book-buying public didn’t learn about these campaigns. Put<br> bluntly, they allow people with enough money, contacts, and know-how to<br> buy their way onto bestseller lists. And they benefit all the key<br> players of the book world. Publishers profit on them. Authors gain<br> credibility from bestseller status, which can launch consulting or<br> speaking careers and give a big boost to keynote presentation fees. And<br> the marketing firms that run the campaigns don’t do so bad either.</br></br></br></br></br></br></br></p></blockquote><p>This sort of thing is hardly a new practice; the Scientologists kept L. Ron Hubbard’s books on the bestseller lists for years this way.  Nor is it a surprise to know that there is some hinky business going on behind the scenes at the New York Times; there usually is, and the NYT has gone to great lengths to keep hidden the method it uses to determine its bestsellers.  But it is a little surprising to see that all of the major New York publishers appear to be involved in this practice, at least to the extent that they are unwilling to openly deny that they utilize such tactics in order to market their books.</p><p>Now, upon reading this, my thoughts immediately went to a particular publisher of science fiction and fantasy, which just happens to be a publisher that appears to place an inordinate energy of effort into winning awards.  It also loves bestseller lists; here is Tor congratulating itself on its many bestseller listings in <a href=\"http://www.tor.com/blogs/2010/12/congratulations-to-tor-forge-books-on-20-bestsellers-in-2010\">2010</a> and <a href=\"http://www.tor.com/blogs/2011/12/congratulations-to-torforge-books-on-30-bestsellers-in-2011\">2011</a>.</p><p>Tor was particularly pleased by its 2011 showing, in which its “30 New York Times bestselling books this year” annihilated their “2010 release list of 20 bestsellers”.  Interestingly enough, however, the Publishers Weekly <a href=\"http://www.publishersweekly.com/pw/by-topic/new-titles/adult-announcements/article/51181-lower-unit-sales-fewer-titles.html\">list of the 115 bestselling fiction novels for 2011</a> shows precisely one Tor book on its list: <i>The Omen Machine</i>. Terry Goodkind. Tor (108,809).</p><p>After reading this, it also occurred to me that despite McRapey’s tale of the starship ensigns who were expendable hitting #15 on the New York Times bestseller list, <i>Redshirts </i>not only didn’t show up in PW’s list of science fiction bestsellers for last year, it’s only #6 on Tor’s own list of its top sellers, behind the immortal<i> Imager’s Battalion</i> by L. E. Modesitt, presently ranked 19,446 on Amazon a month after its release.  And despite being “a New York Times bestseller”, according to Publisher’s Weekly, <i>Redshirts </i>didn’t even make the top ten in the science fiction category in 2012, coming in behind at least three other Tor novels and a novel published in 1965.</p><p><a href=\"http://www.publishersweekly.com/pw/by-topic/industry-news/bookselling/article/55458-big-names-dominated-bestsellers-in-2012.html\">Science Fiction</a></p><p>1. Ender’s Game by Orson Scott Card. Tor. 100,387<br> 2. Ready Player One by Ernest Cline. Broadway. 50,593<br> 3. Star Wars: Darth Plagueis by James Luceno. Lucas Books. 31,543<br> 4. The Ultimate Hitchhiker’s Guide to the Galaxy by Douglas Adams. Del Rey. 27,220<br> 5. Star Wars: Apocalypse by Troy Denning. Lucas Books. 26,140<br> 6. Dune by Frank Herbert. Ace. 25,532<br> 7. A Rising Thunder by David Weber. Baen Books. 25,348<br> 8. HALO: The Thursday War by Karen Traviss. Tor. 24,936<br> 9. HALO: Glasslands by Karen Traviss. Tor. 24,932<br> 10. The Hitchhiker’s Guide to the Galaxy by Douglas Adams. Ballantine. 24,120</br></br></br></br></br></br></br></br></br></p><p>That doesn’t denigrate McRapey’s achievement in selling so many copies of a derivative and mediocre novel, but merely points to the varying degrees of what is claimed to be a “bestseller”.  (One can, indeed, one should have contempt for McRapey as an SF author, but he is without question the finest self-marketer and stunt writer in SF/F today, even if he hasn’t reached the mainstream heights of AJ Jacobs.)  On a tangential note, it’s a fascinating snapshot of the sickly state of science fiction to see how many of its current and confirmed bestsellers are either works derived from games and movies or original works first published between 30 and 50 years ago.  Regardless, the fact is that most of Tor’s “New York Times bestsellers” observably fit what we are informed is the profile of the fake bestseller.  They appear on the list for a single week, only to vanish the following week, never to make another appearance there again.</p><p>Here is another observable anomaly.  According to John Scalzi himself, <a href=\"http://whatever.scalzi.com/2013/01/16/the-state-of-a-genre-title-2013/\"><i>Redshirts </i>sold 26,604 copies</a> in 2012.  That’s very good by today’s standards, especially for a hardcover, but it falls considerably short of the 100,047 copies of Neal Stephenson’s <i>Reamde</i> sold, which novel PW reports as being the 115th-bestselling book of 2011.  And yet, <i>Reamde </i>spent only one more week in the top portion of the NYT bestseller list than <i>Redshirts</i>, (ranking 4 and 12 vs 15) despite selling nearly four times more copies.  Is the latter ranking credible, especially in light of what we now know about major publishers gaming the bestseller lists?  And how did Tor/Forge manage to produce “30 New York Times bestselling books” when only one was listed among the top-selling 115 books published that year?</p><p>Keep in mind that <i>The War in Heaven</i> sold 35,000 copies and I never thought that it was anything remotely close to a bestseller.  (It probably could have sold more, thanks to the brilliant Rowena cover, but that was the print run, which sold out.  I’m still convinced that what killed that series was Pocket’s foolish decision to do their own imitation <i>Left Behind</i> cover for <i>Shadow </i>rather than leaving it up to Rowena and me.  I still have the sketch somewhere; it was going to be an awesome painting of Mariel and Melusine in combat.) </p><p>None of this conclusively proves that Tor Books is engaging in the questionable marketing tactics mentioned in the Wall Street Journal article, but it certainly raises some serious questions about the legitimacy of its claimed “bestsellers”, just as there are serious questions about the literary legitimacy of its infrequently reviewed, modestly-selling Nebula-nominated novels, such as, for example, its two 2012 nominees: <i>Ironskin </i>(64 reviews, 3.5 rating, #35,470 in Books) and <i>Glamour in Glass</i> (18 reviews, 4.3 rating, #409,451 in Books).</p><p>Because, after all, nothing says “science fiction” like tedious derivatives of <i>Jane Eyre</i> and Jane Austen.</p></div>",
  "content_text": "I had intended to continue on the SFWA theme\nwith which I began\nthe Corruption in Science Fiction series, but a pair of articles\nconcerning the legitimacy of the bestseller lists\ncaught my attention after being featured on Slashdot over the weekend:\nThe other day, I received an unexpected phone call from Jeff Trachtenberg, a reporter at The Wall Street Journal. He said he wanted to talk about my bestselling book,\nLeapfrogging\n. At first, I was thrilled. Any first-time author would jump at the chance to speak with such a high-profile publication. But it turned out Trachtenberg didn’t want to discuss what was in my book. He was interested in how it had made it onto his paper’s bestseller list. As he accurately noted,\nLeapfrogging\nhad, well, leapt onto the Journal’s list at #3 the first week it debuted, and then promptly disappeared the following Friday.\nSuddenly, I wasn’t so thrilled anymore. I was just about to sit down to dinner with my family and now I was being put on the spot to discuss my role in perhaps one of the most controversial practices in the book publishing industry. I was tempted to make an excuse and plead the 5th. But I wound up talking to Trachtenberg several times over the next few days….\nTrachtenberg asked me about my experience with a company called\nResultSource\n,\nthe firm I had hired to help me hit the bestseller list from day one.\nTrachtenberg said he had contacted all of the major New York publishers,\nbut no one would speak to him about the firm or the role of so-called\n“bestseller campaigns” in helping authors reach the coveted status. No\ncomment. Dead silence.\nI can’t say I was eager to be the first person to go on the record\nabout the topic. But then I realized something – Trachtenberg’s\nsurprising phone call was an opportunity to live up to what I urge my\nreaders to do in my book\nLeapfrogging\n.  I’ve seen the phenomenon of corporate silence repeatedly in my\ncareer. There’s a big, smelly, ten thousand pound elephant in the\nconference room. Everybody knows it’s there, but no one’s willing to\ntake the risk and point it out. As Trachtenberg was discovering,\nbestseller campaigns are the unacknowledged pachyderm of the book\nbusiness.\nThere’s good reason why most industry insiders would prefer that the\nwider book-buying public didn’t learn about these campaigns. Put\nbluntly, they allow people with enough money, contacts, and know-how to\nbuy their way onto bestseller lists. And they benefit all the key\nplayers of the book world. Publishers profit on them. Authors gain\ncredibility from bestseller status, which can launch consulting or\nspeaking careers and give a big boost to keynote presentation fees. And\nthe marketing firms that run the campaigns don’t do so bad either.\nThis sort of thing is hardly a new practice; the Scientologists kept L. Ron Hubbard’s books on the bestseller lists for years this way.  Nor is it a surprise to know that there is some hinky business going on behind the scenes at the New York Times; there usually is, and the NYT has gone to great lengths to keep hidden the method it uses to determine its bestsellers.  But it is a little surprising to see that all of the major New York publishers appear to be involved in this practice, at least to the extent that they are unwilling to openly deny that they utilize such tactics in order to market their books.\nNow, upon reading this, my thoughts immediately went to a particular publisher of science fiction and fantasy, which just happens to be a publisher that appears to place an inordinate energy of effort into winning awards.  It also loves bestseller lists; here is Tor congratulating itself on its many bestseller listings in\n2010\nand\n2011\n.\nTor was particularly pleased by its 2011 showing, in which its “30 New York Times bestselling books this year” annihilated their “2010 release list of 20 bestsellers”.  Interestingly enough, however, the Publishers Weekly\nlist of the 115 bestselling fiction novels for 2011\nshows precisely one Tor book on its list:\nThe Omen Machine\n. Terry Goodkind. Tor (108,809).\nAfter reading this, it also occurred to me that despite McRapey’s tale of the starship ensigns who were expendable hitting #15 on the New York Times bestseller list,\nRedshirts\nnot only didn’t show up in PW’s list of science fiction bestsellers for last year, it’s only #6 on Tor’s own list of its top sellers, behind the immortal\nImager’s Battalion\nby L. E. Modesitt, presently ranked 19,446 on Amazon a month after its release.  And despite being “a New York Times bestseller”, according to Publisher’s Weekly,\nRedshirts\ndidn’t even make the top ten in the science fiction category in 2012, coming in behind at least three other Tor novels and a novel published in 1965.\nScience Fiction\n1. Ender’s Game by Orson Scott Card. Tor. 100,387\n2. Ready Player One by Ernest Cline. Broadway. 50,593\n3. Star Wars: Darth Plagueis by James Luceno. Lucas Books. 31,543\n4. The Ultimate Hitchhiker’s Guide to the Galaxy by Douglas Adams. Del Rey. 27,220\n5. Star Wars: Apocalypse by Troy Denning. Lucas Books. 26,140\n6. Dune by Frank Herbert. Ace. 25,532\n7. A Rising Thunder by David Weber. Baen Books. 25,348\n8. HALO: The Thursday War by Karen Traviss. Tor. 24,936\n9. HALO: Glasslands by Karen Traviss. Tor. 24,932\n10. The Hitchhiker’s Guide to the Galaxy by Douglas Adams. Ballantine. 24,120\nThat doesn’t denigrate McRapey’s achievement in selling so many copies of a derivative and mediocre novel, but merely points to the varying degrees of what is claimed to be a “bestseller”.  (One can, indeed, one should have contempt for McRapey as an SF author, but he is without question the finest self-marketer and stunt writer in SF/F today, even if he hasn’t reached the mainstream heights of AJ Jacobs.)  On a tangential note, it’s a fascinating snapshot of the sickly state of science fiction to see how many of its current and confirmed bestsellers are either works derived from games and movies or original works first published between 30 and 50 years ago.  Regardless, the fact is that most of Tor’s “New York Times bestsellers” observably fit what we are informed is the profile of the fake bestseller.  They appear on the list for a single week, only to vanish the following week, never to make another appearance there again.\nHere is another observable anomaly.  According to John Scalzi himself,\nRedshirts\nsold 26,604 copies\nin 2012.  That’s very good by today’s standards, especially for a hardcover, but it falls considerably short of the 100,047 copies of Neal Stephenson’s\nReamde\nsold, which novel PW reports as being the 115th-bestselling book of 2011.  And yet,\nReamde\nspent only one more week in the top portion of the NYT bestseller list than\nRedshirts\n, (ranking 4 and 12 vs 15) despite selling nearly four times more copies.  Is the latter ranking credible, especially in light of what we now know about major publishers gaming the bestseller lists?  And how did Tor/Forge manage to produce “30 New York Times bestselling books” when only one was listed among the top-selling 115 books published that year?\nKeep in mind that\nThe War in Heaven\nsold 35,000 copies and I never thought that it was anything remotely close to a bestseller.  (It probably could have sold more, thanks to the brilliant Rowena cover, but that was the print run, which sold out.  I’m still convinced that what killed that series was Pocket’s foolish decision to do their own imitation\nLeft Behind\ncover for\nShadow\nrather than leaving it up to Rowena and me.  I still have the sketch somewhere; it was going to be an awesome painting of Mariel and Melusine in combat.)\nNone of this conclusively proves that Tor Books is engaging in the questionable marketing tactics mentioned in the Wall Street Journal article, but it certainly raises some serious questions about the legitimacy of its claimed “bestsellers”, just as there are serious questions about the literary legitimacy of its infrequently reviewed, modestly-selling Nebula-nominated novels, such as, for example, its two 2012 nominees:\nIronskin\n(64 reviews, 3.5 rating, #35,470 in Books) and\nGlamour in Glass\n(18 reviews, 4.3 rating, #409,451 in Books).\nBecause, after all, nothing says “science fiction” like tedious derivatives of\nJane Eyre\nand Jane Austen.",
  "tags": [
    "books",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-25T11:15:00+00:00"
}