{
  "url": "https://voxday.net/2013/02/24/shes-doomed/",
  "scraped_at": "2025-12-14T22:21:23.912571",
  "title": "She’s doomed",
  "date_display": "February 24, 2013",
  "date_iso": "2013-02-24T10:56:00+00:00",
  "date_from_url": "2013-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Between all the media hype and the Nationwide at Daytona crash, it appears that Danica Patrick is a prime example of <a href=\"http://sportsillustrated.cnn.com/racing/news/20130223/danica-patrick-daytona-advance/\">Hultgreen-Curie syndrome just waiting to happen</a>:</p><blockquote class=\"tr_bq\"><p> It was guaranteed that Patrick’s arrival this year as the first female<br> to compete fulltime in NASCAR’s premier division would generate a<br> tremendous amount of attention. She already had developed a loyal fan<br> following based on her accomplishments in the Indianapolis 500 (two<br> top-five finishes) as well as her appearances in numerous television<br> commercials for primary sponsor GoDaddy.  Then she went out and won the<br> pole position for Sunday’s running of the Daytona 500, and the hype<br> machine shifted into overdrive.</br></br></br></br></br></br></br></p><p>Suddenly this has become more than just another auto race. It is a<br> full-blown event, coated with larger social implications. Patrick isn’t<br> being compared just to Janet Guthrie, the driver who motored past gender<br> barriers in the 1970s by qualifying for both the Daytona 500 and the<br> Indianapolis 500. She is evoking memories of Billie Jean King, who won<br> the famous “Battle of the Sexes” tennis match with Bobby Riggs in 1973,<br> striking a highly publicized blow for female equality.<br> <br> Patrick has become a symbol of success for little girls, a high-speed, high-profile example of all that is possible in life.</br></br></br></br></br></br></br></br></p></blockquote><p>Patrick seems nice enough and I don’t wish her a fiery death on the track or anything like that.  But I can’t say that I’ll be shocked if something goes very, very wrong at the Daytona 500.  And it should be kept in mind that as a leading symbol of equalitarianism, Danica Patrick has become a totem for the evil that is infesting Western civilization and eating away at its foundations.</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/wVW65Tyji_s?feature=player_embedded\" width=\"640\"></iframe></p></div>",
  "content_text": "Between all the media hype and the Nationwide at Daytona crash, it appears that Danica Patrick is a prime example of\nHultgreen-Curie syndrome just waiting to happen\n:\nIt was guaranteed that Patrick’s arrival this year as the first female\nto compete fulltime in NASCAR’s premier division would generate a\ntremendous amount of attention. She already had developed a loyal fan\nfollowing based on her accomplishments in the Indianapolis 500 (two\ntop-five finishes) as well as her appearances in numerous television\ncommercials for primary sponsor GoDaddy.  Then she went out and won the\npole position for Sunday’s running of the Daytona 500, and the hype\nmachine shifted into overdrive.\nSuddenly this has become more than just another auto race. It is a\nfull-blown event, coated with larger social implications. Patrick isn’t\nbeing compared just to Janet Guthrie, the driver who motored past gender\nbarriers in the 1970s by qualifying for both the Daytona 500 and the\nIndianapolis 500. She is evoking memories of Billie Jean King, who won\nthe famous “Battle of the Sexes” tennis match with Bobby Riggs in 1973,\nstriking a highly publicized blow for female equality.\nPatrick has become a symbol of success for little girls, a high-speed, high-profile example of all that is possible in life.\nPatrick seems nice enough and I don’t wish her a fiery death on the track or anything like that.  But I can’t say that I’ll be shocked if something goes very, very wrong at the Daytona 500.  And it should be kept in mind that as a leading symbol of equalitarianism, Danica Patrick has become a totem for the evil that is infesting Western civilization and eating away at its foundations.",
  "tags": [
    "sports",
    "unicorn sightings"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-24T10:56:00+00:00"
}