{
  "url": "https://voxday.net/2013/02/07/suggestion-is-not-science_7/",
  "scraped_at": "2025-12-14T22:19:54.931544",
  "title": "Suggestion is not science",
  "date_display": "February 7, 2013",
  "date_iso": "2013-02-07T14:00:00+00:00",
  "date_from_url": "2013-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer helps expose <a href=\"http://isteve.blogspot.com/2013/02/social-psychology-priming-art-wears-off.html\">the pseudoscience of social psychology</a>:</p><blockquote class=\"tr_bq\"><p> Okay, but I’ve never seen <i>this</i> explanation offered: successful<br> priming studies stop replicating after awhile because they basically<br> aren’t science. At least not in the sense of having discovered something<br> that will work forever.</br></br></br></p><p>Instead, to the extent that they ever did really work, they are exercises in marketing. Or, to be generous, art.</p><p>And, art wears off.</p><p>The power of a work of art to prime emotions and actions changes over<br> time. Perhaps, initially, the audience isn’t ready for it, then it<br> begins to impact a few sensitive fellow artists, and they begin to<br> create other works in its manner and talk it up, and then it become<br> widely popular. Over time, though, boredom sets in and people look for<br> new priming stimuli.</br></br></br></br></br></p><p>For a lucky few old art works (e.g., the great Impressionist paintings),<br> vast networks exist to market them by helping audiences get back into<br> the proper mindset to appreciate the old art (E.g., “Monet was a rebel,<br> up against The Establishment! So, putting this pretty picture of flowers<br> up on your wall shows everybody that <i>you</i> are an edgy outsider, too!”).</br></br></br></br></p><p>So, let’s assume for a moment that Bargh’s success in the early 1990s at<br> getting college students to walk slow wasn’t just fraud or data mining<br> for a random effect among many effects. He really was priming early<br> 1990s college students into walking slow for a few seconds.</br></br></br></p><p>Is that so amazing?</p></blockquote><p>I<br> find it informative that the grand self-appointed defenders of Science<br> Reason are always focused on the nonexistent enemy of Religion while<br> showing absolutely no interest in real land of Woo, which is academic<br> pseudoscience.  As a general rule, it is safe to assume that if<br> midwitted charlatans such as Malcolm Gladwell or Jared Diamond are<br> basing conclusions upon it, the scientific aspects, to the extent that<br> they exist at all, will be more than a little shaky.</br></br></br></br></br></br></br></p><p>I<br> would go so far as to point out that the MAJORITY of what passes for<br> science today is, in fact, nothing of the sort.  It’s not experimental.<br> It’s not replicable.  Despite the credentials attached to it, it has<br> nothing more to do with science than the proverbial PhD defecating in<br> the woods.  Science is not simply “what scientists do”.</br></br></br></br></br></p></div>",
  "content_text": "Steve Sailer helps expose\nthe pseudoscience of social psychology\n:\nOkay, but I’ve never seen\nthis\nexplanation offered: successful\npriming studies stop replicating after awhile because they basically\naren’t science. At least not in the sense of having discovered something\nthat will work forever.\nInstead, to the extent that they ever did really work, they are exercises in marketing. Or, to be generous, art.\nAnd, art wears off.\nThe power of a work of art to prime emotions and actions changes over\ntime. Perhaps, initially, the audience isn’t ready for it, then it\nbegins to impact a few sensitive fellow artists, and they begin to\ncreate other works in its manner and talk it up, and then it become\nwidely popular. Over time, though, boredom sets in and people look for\nnew priming stimuli.\nFor a lucky few old art works (e.g., the great Impressionist paintings),\nvast networks exist to market them by helping audiences get back into\nthe proper mindset to appreciate the old art (E.g., “Monet was a rebel,\nup against The Establishment! So, putting this pretty picture of flowers\nup on your wall shows everybody that\nyou\nare an edgy outsider, too!”).\nSo, let’s assume for a moment that Bargh’s success in the early 1990s at\ngetting college students to walk slow wasn’t just fraud or data mining\nfor a random effect among many effects. He really was priming early\n1990s college students into walking slow for a few seconds.\nIs that so amazing?\nI\nfind it informative that the grand self-appointed defenders of Science\nReason are always focused on the nonexistent enemy of Religion while\nshowing absolutely no interest in real land of Woo, which is academic\npseudoscience.  As a general rule, it is safe to assume that if\nmidwitted charlatans such as Malcolm Gladwell or Jared Diamond are\nbasing conclusions upon it, the scientific aspects, to the extent that\nthey exist at all, will be more than a little shaky.\nI\nwould go so far as to point out that the MAJORITY of what passes for\nscience today is, in fact, nothing of the sort.  It’s not experimental.\nIt’s not replicable.  Despite the credentials attached to it, it has\nnothing more to do with science than the proverbial PhD defecating in\nthe woods.  Science is not simply “what scientists do”.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-07T14:00:00+00:00"
}