{
  "url": "https://voxday.net/2013/02/22/the-european-dream-is-dying/",
  "scraped_at": "2025-12-14T22:21:16.861907",
  "title": "Umberto Eco on the death of the dream of Europe",
  "date_display": "February 22, 2013",
  "date_iso": "2013-02-22T10:10:00+00:00",
  "date_from_url": "2013-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I like and admire Umberto Eco for many reasons, but I firmly believe that the great humanist is absolutely on the wrong side of history with regards to the great post-WWII neo-fascist enterprise of the European Union.  And so, it is very satisfying indeed to read of the increasing despair of the bien-pensant intellectuals, and to hear the cri-de-coeur of an elite that is increasingly conscious of its failure concerning an endeavor where, for one brief shining moment around the turn of the millenium, it believed it had succeeded.</p><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> <a href=\"http://espresso.repubblica.it/dettaglio/un-asterix-europeo/2199881/18\"><b>A European Asterix</b></a></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> These are hard times for those who<br> believe in the European Union: from Cameron, who calls his compatriots<br> to decide if they still want it (or if they never had the will), from<br> Berlusconi who one day declares himself a Europeist but the next,<br> if he doesn’t make a visceral connection to the old Fascists, says<br> returning to the lira would be better, to the Lega Nord and its<br> hyperprovincialism.  In summary, one can say that – at a distance<br> of more than fifty years – the bones of the founding fathers of<br> Europe United are turning in their graves.</br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Nevertheless everyone should know that<br> in the course of the Second World War 41 million Europeans died, (I<br> say only Europeans, not including the Americans and the Asians), massacred one after the other, and afterwards, saving the tragic<br> Balkan episode, Europe has known 68 years of peace.  If one<br> recounts to the young, (who maybe would appreciate it more if they spent a year working in another country on the continent with the Erasmus program, and perhaps at the end of this experience would find a twin spirit with those who speak another language than their own), that the French might today defend the Maginot<br> line to resist the Germans, that the Italians would want to expand<br> their borders to incorporate Greece, that Belgium could be invaded, that English<br> airplanes could bombard Milan, these youth would believe we were<br> inventing a science fiction novel.  It is only the adults who<br> understand that instead of crossing borders without passports, their<br> fathers and their grandfathers vacationed with rifles in hand.</br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> But is it really true that the idea of<br> Europe is unsuccessful in attracting the Europeans?  Bernard-Henri<br> Lévy recently released a passionate manifesto in defense of a<br> European identity.  “Europe or Chaos” begins with a disturbing<br> threat.  “Europe is not in crisis, it is dying.  Not Europe as in<br> the territory, naturally.  But Europe, the Idea.  The Europe that is<br> a dream and a project.”  The manifesto was signed by António Lobo<br> Antunes, Vassilis Alexakis, Juan Luis Cebrián, Fernando Savater,<br> Peter Schneider, Hans Christoph Buch, Julia Kristeva, Claudio Magris,<br> Gÿorgy Konrád and Salman Rushdie (who is not European but has found<br> in Europe his primary refuge from the start of his persecution.  I<br> also signed it with some other co-signers, a few days ago, when I was<br> at the Théâtre du Rond-Point in Paris for a little debate.  One of<br> the themes that quickly emerged, one that I found amply consequential, is<br> that there exists a consciousness of a European identity.  It<br> occurred to me to cite the pages of <i>Remembrance of Things Past</i> by<br> Proust when, in Paris during the time of the bombardment by the<br> German Zeppelins, the intellectuals continue to speak and to write of<br> Goethe or of Schiller as an integrated part of their culture.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> But this sense of a European<br> identity, certainly very strong among the elite<br> intellectuals, is it also among the common people?  It occurred to me<br> to reflect on the fact that even today, in every European country, they<br> celebrate (in school and in their public festivals), real heroes, who<br> are all men who have valorously slain other Europeans, from the part of<br> that Arminius who exterminated the legions of Varo, to Joan of Arc,<br> the Cid, (because the Muslims against whom he fought were of the<br> European centuries), to various Italian and Hungarian heroes of the<br> Risogimento, who fell against the Austrian enemy.  Is there no European hero of whom we can speak?  Did none ever exist?  What about Byron and Santorre di Santarosa, who advanced and fought for the cause of Greek liberty,<br> to say nothing of the not-insignificant numbers of little Schindlers,<br> who saved the lives of thousands of Jews without concern for what<br> nation they belonged to.  What about the non-martial heroes, such as De<br> Gasperi, Monnet, Schuman, Adenuauer, Spinelli?  And could not<br> searching into the recesses of history expose others, of whom we could speak<br> to the children, (and to the adults)?  Is it truly possible that we cannot<br> find a European Asterix of whom we can speak about the Europe of<br> tomorrow?</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div></blockquote><div style=\"margin-bottom: 0in;\"> The fall of the fraud-imposed European Union will be difficult and painful for many, just as the collapse of its force-imposed American counterpart will cause considerable chaos and suffering.  But in both cases, the pain will be a relatively small price to pay, because the alternative is the material imposition of Orwell’s metaphorical boot-on-the-human-face forever. </div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> The answer to his question is no.  There can never be a European Asterix.  Asterix is a hero to millions of Europeans because he represents the independent human spirit resisting the force of Empire.  And as such, the new Asterixes of the future will be those who courageously resisted the bureaucratic stormtroopers of the failing Union, not those who marched in their ranks.  The EU is in the imperial tradition of Augustus, Napoleon, and Hitler, and as such, it can never command the loyalty of an Asterix.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> The intellectual elite always loves Empire.  They are its parasites, its remoras.  And how they hate that it is so often those men who stand against them and their will to rule that are loved and lionized by generation after generation of the common people.</div></div>",
  "content_text": "I like and admire Umberto Eco for many reasons, but I firmly believe that the great humanist is absolutely on the wrong side of history with regards to the great post-WWII neo-fascist enterprise of the European Union.  And so, it is very satisfying indeed to read of the increasing despair of the bien-pensant intellectuals, and to hear the cri-de-coeur of an elite that is increasingly conscious of its failure concerning an endeavor where, for one brief shining moment around the turn of the millenium, it believed it had succeeded.\nA European Asterix\nThese are hard times for those who\nbelieve in the European Union: from Cameron, who calls his compatriots\nto decide if they still want it (or if they never had the will), from\nBerlusconi who one day declares himself a Europeist but the next,\nif he doesn’t make a visceral connection to the old Fascists, says\nreturning to the lira would be better, to the Lega Nord and its\nhyperprovincialism.  In summary, one can say that – at a distance\nof more than fifty years – the bones of the founding fathers of\nEurope United are turning in their graves.\nNevertheless everyone should know that\nin the course of the Second World War 41 million Europeans died, (I\nsay only Europeans, not including the Americans and the Asians), massacred one after the other, and afterwards, saving the tragic\nBalkan episode, Europe has known 68 years of peace.  If one\nrecounts to the young, (who maybe would appreciate it more if they spent a year working in another country on the continent with the Erasmus program, and perhaps at the end of this experience would find a twin spirit with those who speak another language than their own), that the French might today defend the Maginot\nline to resist the Germans, that the Italians would want to expand\ntheir borders to incorporate Greece, that Belgium could be invaded, that English\nairplanes could bombard Milan, these youth would believe we were\ninventing a science fiction novel.  It is only the adults who\nunderstand that instead of crossing borders without passports, their\nfathers and their grandfathers vacationed with rifles in hand.\nBut is it really true that the idea of\nEurope is unsuccessful in attracting the Europeans?  Bernard-Henri\nLévy recently released a passionate manifesto in defense of a\nEuropean identity.  “Europe or Chaos” begins with a disturbing\nthreat.  “Europe is not in crisis, it is dying.  Not Europe as in\nthe territory, naturally.  But Europe, the Idea.  The Europe that is\na dream and a project.”  The manifesto was signed by António Lobo\nAntunes, Vassilis Alexakis, Juan Luis Cebrián, Fernando Savater,\nPeter Schneider, Hans Christoph Buch, Julia Kristeva, Claudio Magris,\nGÿorgy Konrád and Salman Rushdie (who is not European but has found\nin Europe his primary refuge from the start of his persecution.  I\nalso signed it with some other co-signers, a few days ago, when I was\nat the Théâtre du Rond-Point in Paris for a little debate.  One of\nthe themes that quickly emerged, one that I found amply consequential, is\nthat there exists a consciousness of a European identity.  It\noccurred to me to cite the pages of\nRemembrance of Things Past\nby\nProust when, in Paris during the time of the bombardment by the\nGerman Zeppelins, the intellectuals continue to speak and to write of\nGoethe or of Schiller as an integrated part of their culture.\nBut this sense of a European\nidentity, certainly very strong among the elite\nintellectuals, is it also among the common people?  It occurred to me\nto reflect on the fact that even today, in every European country, they\ncelebrate (in school and in their public festivals), real heroes, who\nare all men who have valorously slain other Europeans, from the part of\nthat Arminius who exterminated the legions of Varo, to Joan of Arc,\nthe Cid, (because the Muslims against whom he fought were of the\nEuropean centuries), to various Italian and Hungarian heroes of the\nRisogimento, who fell against the Austrian enemy.  Is there no European hero of whom we can speak?  Did none ever exist?  What about Byron and Santorre di Santarosa, who advanced and fought for the cause of Greek liberty,\nto say nothing of the not-insignificant numbers of little Schindlers,\nwho saved the lives of thousands of Jews without concern for what\nnation they belonged to.  What about the non-martial heroes, such as De\nGasperi, Monnet, Schuman, Adenuauer, Spinelli?  And could not\nsearching into the recesses of history expose others, of whom we could speak\nto the children, (and to the adults)?  Is it truly possible that we cannot\nfind a European Asterix of whom we can speak about the Europe of\ntomorrow?\nThe fall of the fraud-imposed European Union will be difficult and painful for many, just as the collapse of its force-imposed American counterpart will cause considerable chaos and suffering.  But in both cases, the pain will be a relatively small price to pay, because the alternative is the material imposition of Orwell’s metaphorical boot-on-the-human-face forever.\nThe answer to his question is no.  There can never be a European Asterix.  Asterix is a hero to millions of Europeans because he represents the independent human spirit resisting the force of Empire.  And as such, the new Asterixes of the future will be those who courageously resisted the bureaucratic stormtroopers of the failing Union, not those who marched in their ranks.  The EU is in the imperial tradition of Augustus, Napoleon, and Hitler, and as such, it can never command the loyalty of an Asterix.\nThe intellectual elite always loves Empire.  They are its parasites, its remoras.  And how they hate that it is so often those men who stand against them and their will to rule that are loved and lionized by generation after generation of the common people.",
  "tags": [
    "Eco",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-22T10:10:00+00:00"
}