{
  "url": "https://voxday.net/2013/02/19/the-intellectual-costs-of-calvinis/",
  "scraped_at": "2025-12-14T22:20:58.936451",
  "title": "The intellectual costs of Calvinism",
  "date_display": "February 19, 2013",
  "date_iso": "2013-02-19T09:43:00+00:00",
  "date_from_url": "2013-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is really rather remarkable how many historical and intellectual crimes can be quite reasonably be traced back to Calvinist thought and be considered the natural consequences of Calvinism:</p><blockquote class=\"tr_bq\"><p> It was, indeed, Adam Smith who was almost solely responsible for the injection into economics of the labour theory of value. And hence it was Smith who may plausibly be held responsible for the emergence and the momentous consequences of Marxism….</p><p>Paul Douglas properly and with rare insight noted that Marx was, in this matter, simply a Smithian-Ricardian trying to work out the theory of his masters:</p><p><i>“Marx has been berated by two generations of orthodox economists for his value theory. The most charitable of the critics have called him a fool and the most severe have called him a knave for what they deem to be transparent contradictions of his theory. Curiously enough these very critics generally commend Ricardo and Adam Smith very highly. Yet the sober facts are that Marx saw more clearly than any English economist the differences between the labor-cost and the labor-command theories and tried more earnestly than anyone else to solve the contradictions which the adoption of a labor-cost theory inevitably entailed. He failed, of course: but with him Ricardo and Smith failed as well… The failure was a failure not of one man but of a philosophy of value, and the roots of the ultimate contradiction made manifest, in the third volume of Das Kapital, lie imbedded in the first volume of the Wealth of Nations.”</i></p><p>Adam Smith also gave hostage to the later emergence of socialism by his repeatedly stated view that rent and profit are deductions from the produce of labour. In the primitive world, he opined, ‘the whole produce of labour belongs to the labourer’. But as soon as ‘stock’ (capital) is accumulated, some will employ industrious people in order to make a profit by the sale of the materials. Smith indicates that the capitalist (the ‘undertaker’) reaps profits in return for the risk, and for interest on the investment for maintaining the workers until the product is sold – so that the capitalist earns profit for important functions. He adds, however, that ‘In this state of things the whole produce of labour does not always belong to the labourer. He must in most cases share it with the owner of the stock who employs him’. By using such phrases, and by not making clear why labourers might be happy to pay capitalists for their services, Smith left the door open for later socialists who would call for restructuring institutions so as to enable workers to capture their ‘whole product’. This hostage to socialism was aggravated by the fact that Smith, unlike the later Austrian School, did not demonstrate logically and step by step how industrious and thrifty people accumulate capital out of savings. He was content simply to begin with the alleged reality of a minority of wealthy capitalists in society, a reality which later socialists were of course not ready to endorse…..</p><p>Modern writers have tried to salvage the unsalvageable labour theory of value of Adam Smith by asserting that, in a sense he did not really mean what he was saying but was instead seeking to find an invariable standard by which he could measure value and wealth over time. But, to the extent that this search was true, Smith simply added another fallacy on top of all the others. For since value is subjective to each individual, there is no invariant measure or yardstick of value, and any attempts to discover them can at best distort the enterprise of economic theory and send it off chasing an impossible chimera. At worst, the entire structure of economic theory is permeated with fallacy and error…. There is a more fundamental and convincing reason for Adam Smith’s throwing over centuries of sound economic analysis, his abandonment of utility and scarcity, and his turn to the erroneous and pernicious labour theory of value. This is the same reason that Smith dwelled on the fallacious doctrine of productive versus unproductive labour. It is the explanation stressed by Emil Kauder, and partially by Paul Douglas: Adam Smith’s dour Calvinism.</p><p>It is Calvinism that scorns man’s consumption and pleasure, and stresses the importance of labour virtually for its own sake. It is the dour Calvinist who made the extravagant statement that diamonds had ‘scarce any value in use’. And perhaps it is also the dour Calvinist who scorned, in the words of Robertson and Taylor, real-world ‘market values which depended on monetary whims and fashions on the market’, and turned his attention instead to the long-run price where such fripperies played no part, and the grim eternal verities of labour toil seemingly played the decisive economic role. Surely this is a far more realistic view of Adam Smith than the Quixotic romantic in quest of the impossible dream of an invariable measure of value. And while Smith’s most famous follower, David Ricardo, was not a Calvinist, his leading immediate disciple, Dugald Stewart, was a Scottish Presbyterian, and the leading Ricardians – John R. McCulloch and James Mill – were both Scottish and educated in Dugald Stewart’s University of Edinburgh. The Calvinist connection continued to dominate British – and hence classical – economics.<br> – Murray Rothbard, <i>An Austrian Perspective on the History of Economic Thought</i>, 16.5: “The Theory of Value”</br></p></blockquote><p>While one cannot conclusively ascertain the truth or falsehood of Calvinist theology except through its various departures from scripture, I do find it more than a little informative that the mental gymnastics and contorted interpretations that we have witnessed on numerous occasions here in the past can also be observed in the approach of various notable Calvinists to non-theological matters such as economics.</p><p>I am not entirely convinced that Smith’s Calvinism is entirely to blame; I don’t see that a contradiction between the search for an invariable measure of value and a dour Calvinistic tendency to exalt Man’s toil is either necessary or intrinsic.  After all, even after witnessing centuries of futility in attempting to not only define objective value, but make substantive policy decisions on the basis of objective price, leading economists still insist on ignoring the basic concept of subjective value and its inevitable consequences.</p><p>Nevertheless, when contemplating the vagaries of Calvinism, one cannot ignore the “fruits” test to which all Christian theologies merit comparison.  After all, if it is reasonable to view my libertarianism as a natural intellectual consequence of my aprevistan free will theology, then surely it is every bit as reasonable to suppose that fatalism, irresponsibility, socialism are at least a possible consequence of a omniderigent Calvinistic theology.</p><p>One of the fascinating things about Rothbard’s magnum opus is the way in which the atheist Rothbard came to see the importance of the religious perspective, both overt and implicit, in the formulation of economic theory, past and present.  Indeed, it would not be exaggerating matters to regard economics to be less a science or a philosophy than a series of competing theologies masked by a thin pseudo-scientific layer of statistics and mathematical equations.</p></div>",
  "content_text": "It is really rather remarkable how many historical and intellectual crimes can be quite reasonably be traced back to Calvinist thought and be considered the natural consequences of Calvinism:\nIt was, indeed, Adam Smith who was almost solely responsible for the injection into economics of the labour theory of value. And hence it was Smith who may plausibly be held responsible for the emergence and the momentous consequences of Marxism….\nPaul Douglas properly and with rare insight noted that Marx was, in this matter, simply a Smithian-Ricardian trying to work out the theory of his masters:\n“Marx has been berated by two generations of orthodox economists for his value theory. The most charitable of the critics have called him a fool and the most severe have called him a knave for what they deem to be transparent contradictions of his theory. Curiously enough these very critics generally commend Ricardo and Adam Smith very highly. Yet the sober facts are that Marx saw more clearly than any English economist the differences between the labor-cost and the labor-command theories and tried more earnestly than anyone else to solve the contradictions which the adoption of a labor-cost theory inevitably entailed. He failed, of course: but with him Ricardo and Smith failed as well… The failure was a failure not of one man but of a philosophy of value, and the roots of the ultimate contradiction made manifest, in the third volume of Das Kapital, lie imbedded in the first volume of the Wealth of Nations.”\nAdam Smith also gave hostage to the later emergence of socialism by his repeatedly stated view that rent and profit are deductions from the produce of labour. In the primitive world, he opined, ‘the whole produce of labour belongs to the labourer’. But as soon as ‘stock’ (capital) is accumulated, some will employ industrious people in order to make a profit by the sale of the materials. Smith indicates that the capitalist (the ‘undertaker’) reaps profits in return for the risk, and for interest on the investment for maintaining the workers until the product is sold – so that the capitalist earns profit for important functions. He adds, however, that ‘In this state of things the whole produce of labour does not always belong to the labourer. He must in most cases share it with the owner of the stock who employs him’. By using such phrases, and by not making clear why labourers might be happy to pay capitalists for their services, Smith left the door open for later socialists who would call for restructuring institutions so as to enable workers to capture their ‘whole product’. This hostage to socialism was aggravated by the fact that Smith, unlike the later Austrian School, did not demonstrate logically and step by step how industrious and thrifty people accumulate capital out of savings. He was content simply to begin with the alleged reality of a minority of wealthy capitalists in society, a reality which later socialists were of course not ready to endorse…..\nModern writers have tried to salvage the unsalvageable labour theory of value of Adam Smith by asserting that, in a sense he did not really mean what he was saying but was instead seeking to find an invariable standard by which he could measure value and wealth over time. But, to the extent that this search was true, Smith simply added another fallacy on top of all the others. For since value is subjective to each individual, there is no invariant measure or yardstick of value, and any attempts to discover them can at best distort the enterprise of economic theory and send it off chasing an impossible chimera. At worst, the entire structure of economic theory is permeated with fallacy and error…. There is a more fundamental and convincing reason for Adam Smith’s throwing over centuries of sound economic analysis, his abandonment of utility and scarcity, and his turn to the erroneous and pernicious labour theory of value. This is the same reason that Smith dwelled on the fallacious doctrine of productive versus unproductive labour. It is the explanation stressed by Emil Kauder, and partially by Paul Douglas: Adam Smith’s dour Calvinism.\nIt is Calvinism that scorns man’s consumption and pleasure, and stresses the importance of labour virtually for its own sake. It is the dour Calvinist who made the extravagant statement that diamonds had ‘scarce any value in use’. And perhaps it is also the dour Calvinist who scorned, in the words of Robertson and Taylor, real-world ‘market values which depended on monetary whims and fashions on the market’, and turned his attention instead to the long-run price where such fripperies played no part, and the grim eternal verities of labour toil seemingly played the decisive economic role. Surely this is a far more realistic view of Adam Smith than the Quixotic romantic in quest of the impossible dream of an invariable measure of value. And while Smith’s most famous follower, David Ricardo, was not a Calvinist, his leading immediate disciple, Dugald Stewart, was a Scottish Presbyterian, and the leading Ricardians – John R. McCulloch and James Mill – were both Scottish and educated in Dugald Stewart’s University of Edinburgh. The Calvinist connection continued to dominate British – and hence classical – economics.\n– Murray Rothbard,\nAn Austrian Perspective on the History of Economic Thought\n, 16.5: “The Theory of Value”\nWhile one cannot conclusively ascertain the truth or falsehood of Calvinist theology except through its various departures from scripture, I do find it more than a little informative that the mental gymnastics and contorted interpretations that we have witnessed on numerous occasions here in the past can also be observed in the approach of various notable Calvinists to non-theological matters such as economics.\nI am not entirely convinced that Smith’s Calvinism is entirely to blame; I don’t see that a contradiction between the search for an invariable measure of value and a dour Calvinistic tendency to exalt Man’s toil is either necessary or intrinsic.  After all, even after witnessing centuries of futility in attempting to not only define objective value, but make substantive policy decisions on the basis of objective price, leading economists still insist on ignoring the basic concept of subjective value and its inevitable consequences.\nNevertheless, when contemplating the vagaries of Calvinism, one cannot ignore the “fruits” test to which all Christian theologies merit comparison.  After all, if it is reasonable to view my libertarianism as a natural intellectual consequence of my aprevistan free will theology, then surely it is every bit as reasonable to suppose that fatalism, irresponsibility, socialism are at least a possible consequence of a omniderigent Calvinistic theology.\nOne of the fascinating things about Rothbard’s magnum opus is the way in which the atheist Rothbard came to see the importance of the religious perspective, both overt and implicit, in the formulation of economic theory, past and present.  Indeed, it would not be exaggerating matters to regard economics to be less a science or a philosophy than a series of competing theologies masked by a thin pseudo-scientific layer of statistics and mathematical equations.",
  "tags": [
    "Christianity",
    "economics",
    "omniderigence"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-19T09:43:00+00:00"
}