{
  "url": "https://voxday.net/2013/02/11/the-pope-resigns/",
  "scraped_at": "2025-12-14T22:20:19.341219",
  "title": "The Pope resigns",
  "date_display": "February 11, 2013",
  "date_iso": "2013-02-11T12:13:00+00:00",
  "date_from_url": "2013-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.dailymail.co.uk/news/article-2276884/Pope-Benedict-shock-resignation-Pontiff-85-600-years-stand-longer-strength-carry-on.html\"><i>Sic transit </i></a><i><a href=\"http://www.dailymail.co.uk/news/article-2276884/Pope-Benedict-shock-resignation-Pontiff-85-600-years-stand-longer-strength-carry-on.html\">gloria olivæ</a>:</i></p><blockquote class=\"tr_bq\"><p> Dear Brothers,</p><p>I have convoked you to this Consistory, not only for the three canonizations, but also to communicate to you a decision of great importance for the life of the Church.</p><p>After having repeatedly examined my conscience before God, I have come to the certainty that my strengths, due to an advanced age, are no longer suited to an adequate exercise of the Petrine ministry.</p><p>I am well aware that this ministry, due to its essential spiritual nature, must be carried out not only with words and deeds, but no less with prayer and suffering.</p><p>However, in today’s world, subject to so many rapid changes and shaken by questions of deep relevance for the life of faith, in order to govern the bark of Saint Peter and proclaim the Gospel, both strength of mind and body are necessary, strength which in the last few months, has deteriorated in me to the extent that I have had to recognize my incapacity to adequately fulfill the ministry entrusted to me.</p><p>For this reason, and well aware of the seriousness of this act, with full freedom I declare that I renounce the ministry of Bishop of Rome, Successor of Saint Peter, entrusted to me by the Cardinals on 19 April 2005, in such a way, that as from 28 February 2013, at 20:00 hours, the See of Rome, the See of Saint Peter, will be vacant and a Conclave to elect the new Supreme Pontiff will have to be convoked by those whose competence it is.</p><p>Dear Brothers, I thank you most sincerely for all the love and work with which you have supported me in my ministry and I ask pardon for all my defects.</p><p>And now, let us entrust the Holy Church to the care of Our Supreme Pastor, Our Lord Jesus Christ, and implore his holy Mother Mary, so that she may assist the Cardinal Fathers with her maternal solicitude, in electing a new Supreme Pontiff.</p><p>With regard to myself, I wish to also devotedly serve the Holy Church of God in the future through a life dedicated to prayer.</p></blockquote><p>Fascinating.  Gentlemen, you may start your conspiracy theories.  Wherefore art thou, St. Malachy?</p><p><i>In persecutione extrema S.R.E. sedebit Petrus Romanus, qui pascet oves<br> in multis tribulationibus: quibus transactis civitas septicollis<br> diruetur, &amp; Judex tremêdus judicabit populum suum.  Finis.</br></br></i></p><p>La prossima domanda: <a href=\"http://www.osv.com/tabid/7621/itemid/9643/Determining-the-top-candidates-for-papacy.aspx\">chi e’ papabile</a>?</p><p>“Three<br> names are most prominent: Cardinal Angelo Scola, the archbishop of<br> Milan; Cardinal Marc Ouellet, prefect of the Congregation for Bishops;<br> and Cardinal Angelo Bagnasco, archbishop of Genoa.</br></br></br></p><p>Cardinal<br> Scola, 70, is highly esteemed by the pontiff, who moved him from the<br> Patriarchate of Venice to Milan, one of the largest and most important<br> sees in Europe. He is a brilliant, if at times recondite, theologian, a<br> major supporter of the New Evangelization and a leader in<br> Catholic-Islamic dialogue. His election could be hampered by internal<br> divisions among the Italian cardinals.</br></br></br></br></br></br></p><p>Cardinal Ouellet, 68, is a<br> Sulpician and served as archbishop of Quebec from 2002 to 2010 before<br> taking over as head of the powerful Vatican office that oversees the<br> appointment of the world’s bishops. Critics point to the lamentable<br> state of the Church in Quebec during his tenure and wonder if he would<br> be able to reinvigorate the faith in the West.</br></br></br></br></br></p><p>Cardinal<br> Bagnasco, 69, is very well known among the Italian and European<br> Cardinals and has a reputation for intellectual heft. He is also<br> president of the influential Italian Bishops’ Conference.”</br></br></br></p></div>",
  "content_text": "Sic transit\ngloria olivæ\n:\nDear Brothers,\nI have convoked you to this Consistory, not only for the three canonizations, but also to communicate to you a decision of great importance for the life of the Church.\nAfter having repeatedly examined my conscience before God, I have come to the certainty that my strengths, due to an advanced age, are no longer suited to an adequate exercise of the Petrine ministry.\nI am well aware that this ministry, due to its essential spiritual nature, must be carried out not only with words and deeds, but no less with prayer and suffering.\nHowever, in today’s world, subject to so many rapid changes and shaken by questions of deep relevance for the life of faith, in order to govern the bark of Saint Peter and proclaim the Gospel, both strength of mind and body are necessary, strength which in the last few months, has deteriorated in me to the extent that I have had to recognize my incapacity to adequately fulfill the ministry entrusted to me.\nFor this reason, and well aware of the seriousness of this act, with full freedom I declare that I renounce the ministry of Bishop of Rome, Successor of Saint Peter, entrusted to me by the Cardinals on 19 April 2005, in such a way, that as from 28 February 2013, at 20:00 hours, the See of Rome, the See of Saint Peter, will be vacant and a Conclave to elect the new Supreme Pontiff will have to be convoked by those whose competence it is.\nDear Brothers, I thank you most sincerely for all the love and work with which you have supported me in my ministry and I ask pardon for all my defects.\nAnd now, let us entrust the Holy Church to the care of Our Supreme Pastor, Our Lord Jesus Christ, and implore his holy Mother Mary, so that she may assist the Cardinal Fathers with her maternal solicitude, in electing a new Supreme Pontiff.\nWith regard to myself, I wish to also devotedly serve the Holy Church of God in the future through a life dedicated to prayer.\nFascinating.  Gentlemen, you may start your conspiracy theories.  Wherefore art thou, St. Malachy?\nIn persecutione extrema S.R.E. sedebit Petrus Romanus, qui pascet oves\nin multis tribulationibus: quibus transactis civitas septicollis\ndiruetur, & Judex tremêdus judicabit populum suum.  Finis.\nLa prossima domanda:\nchi e’ papabile\n?\n“Three\nnames are most prominent: Cardinal Angelo Scola, the archbishop of\nMilan; Cardinal Marc Ouellet, prefect of the Congregation for Bishops;\nand Cardinal Angelo Bagnasco, archbishop of Genoa.\nCardinal\nScola, 70, is highly esteemed by the pontiff, who moved him from the\nPatriarchate of Venice to Milan, one of the largest and most important\nsees in Europe. He is a brilliant, if at times recondite, theologian, a\nmajor supporter of the New Evangelization and a leader in\nCatholic-Islamic dialogue. His election could be hampered by internal\ndivisions among the Italian cardinals.\nCardinal Ouellet, 68, is a\nSulpician and served as archbishop of Quebec from 2002 to 2010 before\ntaking over as head of the powerful Vatican office that oversees the\nappointment of the world’s bishops. Critics point to the lamentable\nstate of the Church in Quebec during his tenure and wonder if he would\nbe able to reinvigorate the faith in the West.\nCardinal\nBagnasco, 69, is very well known among the Italian and European\nCardinals and has a reputation for intellectual heft. He is also\npresident of the influential Italian Bishops’ Conference.”",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-11T12:13:00+00:00"
}