{
  "url": "https://voxday.net/2013/02/15/turgot-and-myth-of-progress/",
  "scraped_at": "2025-12-14T22:20:41.231217",
  "title": "Turgot and the myth of progress",
  "date_display": "February 15, 2013",
  "date_iso": "2013-02-15T09:24:00+00:00",
  "date_from_url": "2013-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I had already read a considerable amount of Milton Friedman, declared my Economics major, and had two years of university classes under my belt when I first read Joseph Schumpeter’s <i>History of Economic Analysis</i>.  That book, more than any other, changed my perspective on not only economics, but how I regarded the world.  It was the first time in my life that I ever felt overwhelmed concerning a subject in which I was genuinely interested and believed I had a reasonable grasp of the issues concerned.</p><p>I understood, and shared, Schumpeter’s contempt for Ricardo and Keynes.  I was hardly surprised by his respect for Mises.  But I was shocked, in a way that I am very seldom shocked, by what almost appeared to be disdain for Adam Smith, the man I had always considered, and been taught to consider, the grand pinnacle of <i>homo economicus</i>.  And in Smith’s stead, Schumpeter praised, indeed, almost seemed to revere, a French nobody named Turgot, a man of whom I had literally never heard, not in any book, paper, or class lecture.</p><p>With Richard Cantillon, <a href=\"http://en.wikipedia.org/wiki/Anne-Robert-Jacques_Turgot,_Baron_de_Laune\">Anne-Robert-Jacques Turgot, Baron de Laune</a>, should arguably be considered one of the finest and most brilliant economic thinkers in human history.  It borders on criminal that he is, even today, dismissed as a mere physiocrat and royal minister, it is an injustice that his name is not mentioned as one of the Great Economists while lesser minds such as Ricardo, Smith, and Keynes are celebrated and provide the theoretical source of present economic policies.</p><p>Turgot was not infallible.  Of him, <a href=\"http://www.quebecoislibre.org/06/060730-3.htm\">it is written</a>: “Turgot believed in<br> progress and in the perfectibility of man. The human mind, including<br> the exercise of reason and volition, has the potential for<br> progression. He predicted the future of reason and the inevitable<br> advancement of the human mind.”</br></br></br></br></p><p>And yet, Turgot’s own example, and the way in which knowledge of the law of diminishing returns was lost for over a century,  ironically demonstrates his misplaced faith in progress and human perfectibility.</p><blockquote class=\"tr_bq\"><p> One of Turgot’s most remarkable contributions to economics, the significance of which was lost until the twentieth century, was his brilliant and almost off-hand development of the law of diminishing returns, or, as it might be described, the law of variable proportions. This gem arose out of a contest which he had inspired to be held by the Royal Agricultural Society of Limoges, for prize-winning essays on indirect taxation. Unhappiness with the winning physiocratic essay by Guérineau de Saint-Péravy led him to develop his own views in ‘Observations on a Paper by Saint-Péravy’ (1767). Here Turgot went to the heart of the physiocratic error, in the Tableau, of assuming a fixed proportion of the various expenditures of different classes of people. But, Turgot pointed out, these proportions are variable, as are the proportions of physical factors in production. There are no constant proportions of factors in agriculture, for example, since the proportions vary according to the knowledge of the farmers, the value of the soil, the techniques used in production, and the nature of the soil and the climatic conditions.</p><p>Developing this theme further, Turgot declared that ‘even if applied to the same field it [the product] is not proportional [to advances to the factors], and it can never be assumed that double the advances will yield double the product’. Not only are the proportions of factors to product variable, but also after a point, ‘all further expenditures would be useless, and that such increases could even become detrimental. In this case, the advances would be increased without increasing the product. There is therefore a maximum point of production which it is impossible to pass…’. Furthermore, after the maximum point is passed, it is ‘more than likely that as the advances are increased gradually past this point up to the point where they return nothing, each increase would be less and less productive’. On the other hand, if the farmer reduces the factors from the point of maximum production, the same changes in proportion would be found.</p><p>In short, Turgot had worked out, in fully developed form, an analysis of the law of diminishing returns which would not be surpassed, or possibly equalled, until the twentieth century.  (According to Schumpeter, not until a journal article by Edgeworth in 1911!)</p></blockquote><p>The Mises Institute has <a href=\"http://mises.org/document/6298/The-Turgot-Collection-Writings-Speeches-and-Letters-of-Anne-Robert-Jacques-Turgot-Baron-de-Laune\">a collection of the works of Turgot</a>, which at 525 pages, are barely more than half the length of my most recent novel.  To return to the earlier topic of the fear of failure, it is deeply humbling to read the man’s writings and realized that even now, more than 230 years after his death, this is an individual who has been widely ignored and dismissed as <i>a failure</i>, when there may not have been 500 men of his intellectual accomplishment in the entire history of the species.  If that is failure, who needs success?</p></div>",
  "content_text": "I had already read a considerable amount of Milton Friedman, declared my Economics major, and had two years of university classes under my belt when I first read Joseph Schumpeter’s\nHistory of Economic Analysis\n.  That book, more than any other, changed my perspective on not only economics, but how I regarded the world.  It was the first time in my life that I ever felt overwhelmed concerning a subject in which I was genuinely interested and believed I had a reasonable grasp of the issues concerned.\nI understood, and shared, Schumpeter’s contempt for Ricardo and Keynes.  I was hardly surprised by his respect for Mises.  But I was shocked, in a way that I am very seldom shocked, by what almost appeared to be disdain for Adam Smith, the man I had always considered, and been taught to consider, the grand pinnacle of\nhomo economicus\n.  And in Smith’s stead, Schumpeter praised, indeed, almost seemed to revere, a French nobody named Turgot, a man of whom I had literally never heard, not in any book, paper, or class lecture.\nWith Richard Cantillon,\nAnne-Robert-Jacques Turgot, Baron de Laune\n, should arguably be considered one of the finest and most brilliant economic thinkers in human history.  It borders on criminal that he is, even today, dismissed as a mere physiocrat and royal minister, it is an injustice that his name is not mentioned as one of the Great Economists while lesser minds such as Ricardo, Smith, and Keynes are celebrated and provide the theoretical source of present economic policies.\nTurgot was not infallible.  Of him,\nit is written\n: “Turgot believed in\nprogress and in the perfectibility of man. The human mind, including\nthe exercise of reason and volition, has the potential for\nprogression. He predicted the future of reason and the inevitable\nadvancement of the human mind.”\nAnd yet, Turgot’s own example, and the way in which knowledge of the law of diminishing returns was lost for over a century,  ironically demonstrates his misplaced faith in progress and human perfectibility.\nOne of Turgot’s most remarkable contributions to economics, the significance of which was lost until the twentieth century, was his brilliant and almost off-hand development of the law of diminishing returns, or, as it might be described, the law of variable proportions. This gem arose out of a contest which he had inspired to be held by the Royal Agricultural Society of Limoges, for prize-winning essays on indirect taxation. Unhappiness with the winning physiocratic essay by Guérineau de Saint-Péravy led him to develop his own views in ‘Observations on a Paper by Saint-Péravy’ (1767). Here Turgot went to the heart of the physiocratic error, in the Tableau, of assuming a fixed proportion of the various expenditures of different classes of people. But, Turgot pointed out, these proportions are variable, as are the proportions of physical factors in production. There are no constant proportions of factors in agriculture, for example, since the proportions vary according to the knowledge of the farmers, the value of the soil, the techniques used in production, and the nature of the soil and the climatic conditions.\nDeveloping this theme further, Turgot declared that ‘even if applied to the same field it [the product] is not proportional [to advances to the factors], and it can never be assumed that double the advances will yield double the product’. Not only are the proportions of factors to product variable, but also after a point, ‘all further expenditures would be useless, and that such increases could even become detrimental. In this case, the advances would be increased without increasing the product. There is therefore a maximum point of production which it is impossible to pass…’. Furthermore, after the maximum point is passed, it is ‘more than likely that as the advances are increased gradually past this point up to the point where they return nothing, each increase would be less and less productive’. On the other hand, if the farmer reduces the factors from the point of maximum production, the same changes in proportion would be found.\nIn short, Turgot had worked out, in fully developed form, an analysis of the law of diminishing returns which would not be surpassed, or possibly equalled, until the twentieth century.  (According to Schumpeter, not until a journal article by Edgeworth in 1911!)\nThe Mises Institute has\na collection of the works of Turgot\n, which at 525 pages, are barely more than half the length of my most recent novel.  To return to the earlier topic of the fear of failure, it is deeply humbling to read the man’s writings and realized that even now, more than 230 years after his death, this is an individual who has been widely ignored and dismissed as\na failure\n, when there may not have been 500 men of his intellectual accomplishment in the entire history of the species.  If that is failure, who needs success?",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-15T09:24:00+00:00"
}