{
  "url": "https://voxday.net/2013/02/10/uneasy-lies-head/",
  "scraped_at": "2025-12-14T22:20:15.918968",
  "title": "Uneasy lies the head",
  "date_display": "February 10, 2013",
  "date_iso": "2013-02-10T18:30:00+00:00",
  "date_from_url": "2013-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The President appears to be <a href=\"http://blurbrain.com/marines-marching-in-inauguration-parade-had-disabled-rifles/\">afraid of his Praetorian Parade Guard</a>:</p><blockquote class=\"tr_bq\"><p>  Take a close look at the M-14 rifles the Marines where carrying at<br> Obama’s second inauguration. The bolts have been removed from the rifles<br> rendering them unable to fire a round.</br></br></p><p>Apparently Obama’s Secret Service doesn’t trust the USMC. Simply<br> searching each guy to make sure he didn’t have a live round hidden on<br> him wasn’t enough, they had to make sure the guns were inoperable. Remember all those times George Bush (miss him yet?) traveled to Iraq<br> to meet the troops? Troops who had working rifles slung on their<br> shoulders, with loaded magazines in pouches on their belt.  I can’t recall ever seeing the troops with weapons in hand when Obama<br> paid them a visit and after seeing this, if anyone can find such a<br> photo, I’d have to bet that the bolt carriers had been removed prior to<br> Obama’s arrival.</br></br></br></br></br></br></br></p><p>It’s painfully obvious how much contempt Obama has toward the<br> military and the feeling is mutual…and the Secret Service knows it too.</br></p></blockquote><p>From a purely symbolic perspective, this strikes me as a very last days of Rome motif.  What sort of Commander-in-Chief doesn’t trust the men he is commanding?  And why doesn’t he trust them?</p></div>",
  "content_text": "The President appears to be\nafraid of his Praetorian Parade Guard\n:\nTake a close look at the M-14 rifles the Marines where carrying at\nObama’s second inauguration. The bolts have been removed from the rifles\nrendering them unable to fire a round.\nApparently Obama’s Secret Service doesn’t trust the USMC. Simply\nsearching each guy to make sure he didn’t have a live round hidden on\nhim wasn’t enough, they had to make sure the guns were inoperable. Remember all those times George Bush (miss him yet?) traveled to Iraq\nto meet the troops? Troops who had working rifles slung on their\nshoulders, with loaded magazines in pouches on their belt.  I can’t recall ever seeing the troops with weapons in hand when Obama\npaid them a visit and after seeing this, if anyone can find such a\nphoto, I’d have to bet that the bolt carriers had been removed prior to\nObama’s arrival.\nIt’s painfully obvious how much contempt Obama has toward the\nmilitary and the feeling is mutual…and the Secret Service knows it too.\nFrom a purely symbolic perspective, this strikes me as a very last days of Rome motif.  What sort of Commander-in-Chief doesn’t trust the men he is commanding?  And why doesn’t he trust them?",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-02-10T18:30:00+00:00"
}