{
  "url": "https://voxday.net/2025/08/06/backing-the-bindery/",
  "scraped_at": "2026-01-08T20:27:45.160761",
  "title": "Backing the Bindery",
  "date_display": "August 6, 2025",
  "date_iso": "2025-08-06T15:05:15+00:00",
  "date_from_url": "2025-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that <em>THE ILIAD</em> and <em>THE ODYSSEY</em> are ready to go to print, we’re giving everyone two weeks to become <a href=\"https://castalialibrary.substack.com/p/retro-back-the-bindery\">a retro-backer of the bindery</a> before we place the order for the interiors. For more details and interior images of the two books, including the title pages, <a href=\"https://castalialibrary.substack.com/p/retro-back-the-bindery\">please visit the Castalia Library substack</a>. We’re also looking into the possibility of making them signed and numbered editions, if that’s of interest. Although Homer is obviously unavailable, we could arrange for them to be signed by either a) the bookbinder or b) me, depending upon which would make these very special editions even more desirable.</p><p><em><a href=\"https://socialgalactic.com/micropost/90ebd24b-5c40-44c5-9071-ca1cdaebb327\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now that\nTHE ILIAD\nand\nTHE ODYSSEY\nare ready to go to print, we’re giving everyone two weeks to become\na retro-backer of the bindery\nbefore we place the order for the interiors. For more details and interior images of the two books, including the title pages,\nplease visit the Castalia Library substack\n. We’re also looking into the possibility of making them signed and numbered editions, if that’s of interest. Although Homer is obviously unavailable, we could arrange for them to be signed by either a) the bookbinder or b) me, depending upon which would make these very special editions even more desirable.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-06T15:05:18+00:00"
}