{
  "url": "https://voxday.net/2025/08/29/boundless-goes-under/",
  "scraped_at": "2026-01-08T20:30:01.754740",
  "title": "Boundless Goes Under",
  "date_display": "August 29, 2025",
  "date_iso": "2025-08-29T13:57:04+00:00",
  "date_from_url": "2025-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In June, Fandom Pulse reported on <a href=\"https://fandompulse.substack.com/p/comic-book-industry-troll-alex-de\">the collapse of Unbound Publishing</a>. We even discussed this a little on last night’s Arkhaven Nights, as the left-wing comic book book industry activist who was mentioned in the piece has transformed herself into an anti-AI activist.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Unbound Publishing is the latest of a string of publishers to go bankrupt and not pay their authors, and now author and left-wing comic book industry activist Alex De Campi put the publisher on blast for not paying her royalties.</p><p>The publishing industry has been in a lot of turmoil over the last several years, and it seems like a lot have run into financial troubles that keep compounding because of dated business practices in today’s marketplace.</p><p>Unbound Publishing is one of those, a UK crowdfunding publisher who tried to get in on the Kickstarter craze to act as an alternative to regular publishing, getting itself into hot water with nearly 9 million pounds in debt and 2.4 million owed to creditors as of its collapse.</p><p>Boundless Publishing is a new imprint taking up the mantle and trying to resurrect what Unbound had in its contracts, purchasing the company for a mere 50,000 pounds.</p></blockquote></blockquote><p>That was the shot. Here is the chaser. This morning, I was checking out Printweek in search of potential used machinery for the bindery, and I was surprised to be informed that <a href=\"https://www.printweek.com/content/news/boundless-shuttered\">Boundless didn’t even last three months</a> from that Fandom Pulse piece.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Reprised publisher Boundless has ceased trading after less than six months in business.</p><p>Boundless Publishing Group acquired the assets of crowd-funded publisher United Authors Publishing, which traded as Unbound, in March. Unsecured creditors of Unbound were owed £2.4m and included more than 200 authors and agents, and nearly 8,000 website customers. Boundless CEO Archna Sharma had hoped to repay the historic royalties owed by Unbound, but payments were delayed until the newco could become “cash stable”.</p><p>These plans have ended in tatters. Boundless ceased trading with immediate effect on 1 August, ahead of the business being placed into voluntary liquidation.</p></blockquote><p>If you ever wonder why Castalia is so conservative compared to everyone else, and why we take so few chances and are reliably late on many things, this is precisely why. We’ve been around for 11 years and we plan on being around for centuries. Everything will get done, everyone will get paid what they’re owed, and everyone will get their books. But probably not on a timetable that everyone would prefer. We’ve seen enough new publishers come and go to confirm that doing things slowly, properly, and in a low-risk manner that guarantees long-term survival is always paramount.</p><p>The long-awaited Printapocalypse that was expected to take place after the rise of ebooks does appear to be upon us. A lot of companies that barely survived the Covid economy courtesy of government grants and bank loans are now going under; three of the top six stories in <em>Printweek</em> concern printers or publishers going out of business.</p><p>But we expected this and we prepared for this. And, despite all the setbacks and delays, we’re in a stronger position than ever before. By the end of the decade, we’ll almost certainly be bigger than Baen Books or Tor Books were at their respective peaks. But neither growth nor market share are the priority, survival in a difficult economy, followed very closely by quality, is.</p><p><em><a href=\"https://socialgalactic.com/micropost/0d0164cc-e2d7-44d3-92a6-1a930ac8701f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In June, Fandom Pulse reported on\nthe collapse of Unbound Publishing\n. We even discussed this a little on last night’s Arkhaven Nights, as the left-wing comic book book industry activist who was mentioned in the piece has transformed herself into an anti-AI activist.\nUnbound Publishing is the latest of a string of publishers to go bankrupt and not pay their authors, and now author and left-wing comic book industry activist Alex De Campi put the publisher on blast for not paying her royalties.\nThe publishing industry has been in a lot of turmoil over the last several years, and it seems like a lot have run into financial troubles that keep compounding because of dated business practices in today’s marketplace.\nUnbound Publishing is one of those, a UK crowdfunding publisher who tried to get in on the Kickstarter craze to act as an alternative to regular publishing, getting itself into hot water with nearly 9 million pounds in debt and 2.4 million owed to creditors as of its collapse.\nBoundless Publishing is a new imprint taking up the mantle and trying to resurrect what Unbound had in its contracts, purchasing the company for a mere 50,000 pounds.\nThat was the shot. Here is the chaser. This morning, I was checking out Printweek in search of potential used machinery for the bindery, and I was surprised to be informed that\nBoundless didn’t even last three months\nfrom that Fandom Pulse piece.\nReprised publisher Boundless has ceased trading after less than six months in business.\nBoundless Publishing Group acquired the assets of crowd-funded publisher United Authors Publishing, which traded as Unbound, in March. Unsecured creditors of Unbound were owed £2.4m and included more than 200 authors and agents, and nearly 8,000 website customers. Boundless CEO Archna Sharma had hoped to repay the historic royalties owed by Unbound, but payments were delayed until the newco could become “cash stable”.\nThese plans have ended in tatters. Boundless ceased trading with immediate effect on 1 August, ahead of the business being placed into voluntary liquidation.\nIf you ever wonder why Castalia is so conservative compared to everyone else, and why we take so few chances and are reliably late on many things, this is precisely why. We’ve been around for 11 years and we plan on being around for centuries. Everything will get done, everyone will get paid what they’re owed, and everyone will get their books. But probably not on a timetable that everyone would prefer. We’ve seen enough new publishers come and go to confirm that doing things slowly, properly, and in a low-risk manner that guarantees long-term survival is always paramount.\nThe long-awaited Printapocalypse that was expected to take place after the rise of ebooks does appear to be upon us. A lot of companies that barely survived the Covid economy courtesy of government grants and bank loans are now going under; three of the top six stories in\nPrintweek\nconcern printers or publishers going out of business.\nBut we expected this and we prepared for this. And, despite all the setbacks and delays, we’re in a stronger position than ever before. By the end of the decade, we’ll almost certainly be bigger than Baen Books or Tor Books were at their respective peaks. But neither growth nor market share are the priority, survival in a difficult economy, followed very closely by quality, is.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2025-08-29T13:57:06+00:00"
}