{
  "url": "https://voxday.net/2025/08/28/churchianity/",
  "scraped_at": "2026-01-08T20:29:48.991395",
  "title": "Churchianity",
  "date_display": "August 28, 2025",
  "date_iso": "2025-08-28T09:58:22+00:00",
  "date_from_url": "2025-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jon Del Arroz’s new book, <em>Churchianity: How Modern American Churches Corrupted Generations of Christians</em>, <a href=\"https://www.amazon.com/dp/B0FMYH3V1J\">is out today</a>. The Foreword was written by a certain dark lord of your acquaintance. It’s a pretty long one, as these things go, so I’ve broken it into two parts, the second of which will run tomorrow.</p><h3 class=\"wp-block-heading\">Churchianity: The Great Apostasy</h3><p>The modern Church in the West stands at a crossroads, though many of its congregants appear blissfully unaware that they have already chosen a wide and easy path to Hell. What passes for Christianity in the twenty-first century would be unrecognizable to the Church Fathers, incomprehensible to the medieval scholastics, and abhorrent to the Reformers. We are witnessing nothing less than the attempted replacement of Christianity with its heretical doppelganger: Churchianity.</p><p>Churchianity is the systematic subordination of Christian doctrine to the prevailing ideology of social justice. It is the elevation of worldly concerns above spiritual ones, the replacement of timeless Biblical authority with the dynamic mainstream Narrative, and the transformation of the Church from a beacon of eternal truth into an echo chamber for Earthly politics. Most damning of all, it represents the complete inversion of Christianity’s fundamental premise: instead of being in the world but not of it, Churchianity insists on being entirely of the world while maintaining an increasingly unconvincing veneer of theological legitimacy.</p><p>Churchianity is not just another in the long line of traditional doctrinal disputes. This is apostasy wearing a clerical collar, heresy draped in liturgical vestments, and blasphemy proclaimed from ten thousand pulpits every Sunday morning. The tragedy is not that wolves have entered the sheepfold—Jesus Christ himself warned us they would come. The tragedy is that the sheep now bleat in self-righteous pride as they are led astray by those who seek to destroy them.</p><p>At its core, Churchianity represents a fundamental misunderstanding of the nature of both God and man. Whereas Christianity proclaims the fallen nature of humanity and the absolute necessity of divine redemption, Churchianity preaches the perfectibility of man through political correctness. Whereas Christianity promises the Kingdom of Heaven, Churchianity prioritizes earthly justice. And whereas Christianity demands repentance from sin, Churchianity demands repentance for a whole host of invented man-made sins, including failure to adequately genuflect before whatever victim class currently sits atop the intersectional hierarchy.</p><p>The mechanism of this theological perversion is breathtakingly simple: take any Biblical command, strip it of its soteriological context, and reinterpret it through the lens of contemporary social justice politics. “Love thy neighbor” ceases to be about individual charity and becomes a mandate for open borders and mass immigration. “Care for the poor” transforms from personal almsgiving into advocacy for higher taxes, foreign wars, and welfare states. “Welcome the stranger” transforms from basic hospitality into a divine command to facilitate the demographic replacement of the nation.</p><p>This hermeneutical vandalism not only does violence to individual verses, but to the entire Biblical narrative. The God who destroyed Sodom and Gomorrah, who commanded the Israelites to maintain their distinctiveness among the nations, who confused the languages at Babel to create the nations—this God is reimagined as a cosmic social worker whose primary concern is ensuring equal outcomes across all demographic categories. The savior who said “My kingdom is not of this world” is recast as a proto-hippie community organizer whose death was not intended to atone for personal sins, but for 17th-century colonization.</p><p>No Christian Church has shown itself to be completely immune to this subversive contagion. The Roman Catholic Church, which for centuries stood as a bulwark against heresy, now finds itself led by clerics who are more concerned about climate change than for the salvation of men’s souls. The current occupant of Peter’s throne speaks more passionately about carbon emissions than abortion, more forcefully about income inequality than sexual morality, and far more frequently about migrants than martyrs. The Church that once launched the Crusades to defend Christendom now declares it a moral imperative to welcome to the West those who would see every cross destroyed and every cathedral burned to the ground.</p><p>The Anglican Communion, already weakened by its centuries of compromise with secular authority, has completed its transformation into the Conservative Party at prayer—if the Conservative Party were still conservative and one could find a Tory who was not Hindu, Muslim, or Jewish. Canterbury’s pronouncements are all-but-indistinguishable from <em>Guardian</em> editorials, complete with the requisite hand-wringing about colonialism, slavery, and the urgent need to make monetary reparations for crimes committed by people long dead to people who were never wronged.</p><p>The mainline Protestant denominations have fared even worse. The Lutherans who once thundered “Here I stand” now whimper “Here I kneel”—before every fashionable cause and politically correct crusade. The Methodists, Presbyterians, and Episcopalians compete to see who can more thoroughly repudiate their theological heritage in favor of sexual perversion, rainbow flags and moral relativism. These churches have hemorrhaged members in recent decades, not because Christianity is dying, but because Churchianity offers nothing that cannot be found in a political party or a gay disco.</p><p>Even the evangelical churches, which initially resisted this insidious corruption, have begun to succumb. Megachurch pastors discover that sermon series on “social justice” fill more seats than expositions of Romans. Youth pastors find that endorsing movements like Black Lives Matter provides them with more social cachet than leading Bible studies. Entire denominations that once prioritized evangelism now prioritize “racial reconciliation,” which in practice means white self-flagellation and endless apologies for nonexistent sins neither committed nor inherited.</p><p><em>CHURCHIANITY by Jon Del Arroz is now available in ebook and paperback <a href=\"https://www.amazon.com/dp/B0FMYH3V1J\">from Amazon</a> from Rislandia Press.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/3a22fb89-edec-4c0d-ba1a-bea3937537d7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Jon Del Arroz’s new book,\nChurchianity: How Modern American Churches Corrupted Generations of Christians\n,\nis out today\n. The Foreword was written by a certain dark lord of your acquaintance. It’s a pretty long one, as these things go, so I’ve broken it into two parts, the second of which will run tomorrow.\nChurchianity: The Great Apostasy\nThe modern Church in the West stands at a crossroads, though many of its congregants appear blissfully unaware that they have already chosen a wide and easy path to Hell. What passes for Christianity in the twenty-first century would be unrecognizable to the Church Fathers, incomprehensible to the medieval scholastics, and abhorrent to the Reformers. We are witnessing nothing less than the attempted replacement of Christianity with its heretical doppelganger: Churchianity.\nChurchianity is the systematic subordination of Christian doctrine to the prevailing ideology of social justice. It is the elevation of worldly concerns above spiritual ones, the replacement of timeless Biblical authority with the dynamic mainstream Narrative, and the transformation of the Church from a beacon of eternal truth into an echo chamber for Earthly politics. Most damning of all, it represents the complete inversion of Christianity’s fundamental premise: instead of being in the world but not of it, Churchianity insists on being entirely of the world while maintaining an increasingly unconvincing veneer of theological legitimacy.\nChurchianity is not just another in the long line of traditional doctrinal disputes. This is apostasy wearing a clerical collar, heresy draped in liturgical vestments, and blasphemy proclaimed from ten thousand pulpits every Sunday morning. The tragedy is not that wolves have entered the sheepfold—Jesus Christ himself warned us they would come. The tragedy is that the sheep now bleat in self-righteous pride as they are led astray by those who seek to destroy them.\nAt its core, Churchianity represents a fundamental misunderstanding of the nature of both God and man. Whereas Christianity proclaims the fallen nature of humanity and the absolute necessity of divine redemption, Churchianity preaches the perfectibility of man through political correctness. Whereas Christianity promises the Kingdom of Heaven, Churchianity prioritizes earthly justice. And whereas Christianity demands repentance from sin, Churchianity demands repentance for a whole host of invented man-made sins, including failure to adequately genuflect before whatever victim class currently sits atop the intersectional hierarchy.\nThe mechanism of this theological perversion is breathtakingly simple: take any Biblical command, strip it of its soteriological context, and reinterpret it through the lens of contemporary social justice politics. “Love thy neighbor” ceases to be about individual charity and becomes a mandate for open borders and mass immigration. “Care for the poor” transforms from personal almsgiving into advocacy for higher taxes, foreign wars, and welfare states. “Welcome the stranger” transforms from basic hospitality into a divine command to facilitate the demographic replacement of the nation.\nThis hermeneutical vandalism not only does violence to individual verses, but to the entire Biblical narrative. The God who destroyed Sodom and Gomorrah, who commanded the Israelites to maintain their distinctiveness among the nations, who confused the languages at Babel to create the nations—this God is reimagined as a cosmic social worker whose primary concern is ensuring equal outcomes across all demographic categories. The savior who said “My kingdom is not of this world” is recast as a proto-hippie community organizer whose death was not intended to atone for personal sins, but for 17th-century colonization.\nNo Christian Church has shown itself to be completely immune to this subversive contagion. The Roman Catholic Church, which for centuries stood as a bulwark against heresy, now finds itself led by clerics who are more concerned about climate change than for the salvation of men’s souls. The current occupant of Peter’s throne speaks more passionately about carbon emissions than abortion, more forcefully about income inequality than sexual morality, and far more frequently about migrants than martyrs. The Church that once launched the Crusades to defend Christendom now declares it a moral imperative to welcome to the West those who would see every cross destroyed and every cathedral burned to the ground.\nThe Anglican Communion, already weakened by its centuries of compromise with secular authority, has completed its transformation into the Conservative Party at prayer—if the Conservative Party were still conservative and one could find a Tory who was not Hindu, Muslim, or Jewish. Canterbury’s pronouncements are all-but-indistinguishable from\nGuardian\neditorials, complete with the requisite hand-wringing about colonialism, slavery, and the urgent need to make monetary reparations for crimes committed by people long dead to people who were never wronged.\nThe mainline Protestant denominations have fared even worse. The Lutherans who once thundered “Here I stand” now whimper “Here I kneel”—before every fashionable cause and politically correct crusade. The Methodists, Presbyterians, and Episcopalians compete to see who can more thoroughly repudiate their theological heritage in favor of sexual perversion, rainbow flags and moral relativism. These churches have hemorrhaged members in recent decades, not because Christianity is dying, but because Churchianity offers nothing that cannot be found in a political party or a gay disco.\nEven the evangelical churches, which initially resisted this insidious corruption, have begun to succumb. Megachurch pastors discover that sermon series on “social justice” fill more seats than expositions of Romans. Youth pastors find that endorsing movements like Black Lives Matter provides them with more social cachet than leading Bible studies. Entire denominations that once prioritized evangelism now prioritize “racial reconciliation,” which in practice means white self-flagellation and endless apologies for nonexistent sins neither committed nor inherited.\nCHURCHIANITY by Jon Del Arroz is now available in ebook and paperback\nfrom Amazon\nfrom Rislandia Press.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Christianity",
    "Churchianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-28T09:58:25+00:00"
}