{
  "url": "https://voxday.net/2025/08/04/inevitable-iconoclasm/",
  "scraped_at": "2026-01-08T20:27:28.667903",
  "title": "Inevitable Iconoclasm",
  "date_display": "August 4, 2025",
  "date_iso": "2025-08-04T17:46:45+00:00",
  "date_from_url": "2025-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m very much looking forward to seeing <a href=\"https://substack.com/app-link/post?publication_id=1235974&amp;post_id=169957535&amp;utm_source=post-email-title&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3a0ajt&amp;token=eyJ1c2VyX2lkIjoxOTgyMDgzNjEsInBvc3RfaWQiOjE2OTk1NzUzNSwiaWF0IjoxNzU0MzIwODQ4LCJleHAiOjE3NTY5MTI4NDgsImlzcyI6InB1Yi0xMjM1OTc0Iiwic3ViIjoicG9zdC1yZWFjdGlvbiJ9.LXx9rEwjOcCA4o4303dESW1bj6Tf8hVzyhWufTxdTEU\">what arch-iconoclast Dennis McCarthy is going to do</a> to the official story of Charles Darwin and the Neo-Darwinian dogma once he discovers MITTENS and realizes that it is far more likely that the real author of Shakespeare’s plays was the recently deceased Queen Elizabeth II than Neo-Darwinian theories of evolution and its various epicycles can even begin to account for 10 percent of the human genetic variance.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>You need to experience certain ideas, events, images, technologies, etc., before you can use them, whether in whole or in part, to recreate new ideas.</p><p>This insight also offers a new response to the “watchmaker argument” most famously stated by the Christian philosopher, William Paley. As Paley asked, repeating a well-known rationale for intelligent design, if you were to happen across a watch in a forest, would not the complexity and purpose of the time-piece imply the existence of a designer? If so, then would not a human being, which is far more complicated than the watch, suggest a designer as well?</p><p>Dawkins may be the scientist who has provided the most comprehensive response to Paley’s challenge in The Blind Watchmaker (1986), the title of which is based on this famous argument. Dawkins showed that natural selection can indeed give the appearance of design by continuously fomenting the proliferation of beneficial adaptations.</p><p>Still, it may be instructive to point out that, while many people today try to use Paley’s arguments against evolution, the simple fact is that watches—just like iguanas and finches—had to evolve from much simpler systems with occasional incremental advances occurring over time.</p><p>Humans could not have constructed 19th-century clocks before the invention of cogs, gears, and levers—let alone before the practice of metallurgy, the use of numerical symbols, or the concept of time itself, etc. Instead, over many generations, simple timepieces had to accumulate small variations in the mental wombs of humans. Some of these variations were more helpful than others and led to their reproduction and proliferation.</p><p>Yes, the watch had to have a direct maker (the watchmaker)—just like the watchmaker, himself, also had to have a direct maker (his parents.) But the watchmaker did not invent the timepiece out of nothing and could not have been personally responsible for all its complexity. The basic plan of the watch passed though prior generations of clockmakers, continuously evolving along the way. Likewise, the configuration of the human watchmaker was also passed along through the DNA of all his ancestors, continuously evolving along the way. Neither the extraordinary complexity of the watch nor that of the watchmaker was created all in one miraculous burst—and certainly not by an immaterial and supernatural force.</p></blockquote><p>As it happens, Paley’s arguments are correct, not because they are a rebuttal or a logical disproof of the various Neo-Darwinian epicycles, but simply because they led him to reject the obvious impossibility of evolution through natural selection.</p><p>The obvious and mathematical fact is that “the configuration of the human watchmaker” was definitely NOT “passed along through the DNA of all his ancestors, continuously evolving along the way” for the obvious reason that it could not have.</p><p>Mathematicians, physicists, and artificial intelligences have all checked and repeatedly confirmed the absolute impossibility of a sufficient number of mutational fixations occurring in the maximum nine million years available for the process.</p><p>And the reason the innumerate biologists keep insisting upon the impossible is that not one of them, from Charles Darwin to Richard Dawkins, <em>has ever bothered to do the very simple math of human demographics and reproduction</em> that is required for the evolutionary fairy tale to hold up in the aftermath of the sequencing of the human genome. Mendel was a blow, but MITTENS is a stake in the chest, a decapitation, and iron nails hammering the coffin shut.</p><p>I don’t blame McCarthy or anyone else for failing to notice this, because virtually no one but an economist is sufficiently accustomed to think in terms of millions, billions, and trillions to spot the obvious mathematical absurdity required to account for 15-20 million base pairs repeatedly fixating across the entire human population over the period of time involved.</p><p>Anyhow, I think it will be tremendously interesting if McArthy ever turns his formidable powers of skeptical investigation onto Mr. Darwin, his theory, and its many revisions. He doesn’t need to bother with Mr. Dawkins, of course, as the up-to-date evolutionists have already retreated to the very randomness that Dawkins sought to disprove with his inept little attempt at writing code.</p><p><em><a href=\"https://socialgalactic.com/micropost/be1dc9bc-3132-4bef-b75a-1df33c9eff21\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m very much looking forward to seeing\nwhat arch-iconoclast Dennis McCarthy is going to do\nto the official story of Charles Darwin and the Neo-Darwinian dogma once he discovers MITTENS and realizes that it is far more likely that the real author of Shakespeare’s plays was the recently deceased Queen Elizabeth II than Neo-Darwinian theories of evolution and its various epicycles can even begin to account for 10 percent of the human genetic variance.\nYou need to experience certain ideas, events, images, technologies, etc., before you can use them, whether in whole or in part, to recreate new ideas.\nThis insight also offers a new response to the “watchmaker argument” most famously stated by the Christian philosopher, William Paley. As Paley asked, repeating a well-known rationale for intelligent design, if you were to happen across a watch in a forest, would not the complexity and purpose of the time-piece imply the existence of a designer? If so, then would not a human being, which is far more complicated than the watch, suggest a designer as well?\nDawkins may be the scientist who has provided the most comprehensive response to Paley’s challenge in The Blind Watchmaker (1986), the title of which is based on this famous argument. Dawkins showed that natural selection can indeed give the appearance of design by continuously fomenting the proliferation of beneficial adaptations.\nStill, it may be instructive to point out that, while many people today try to use Paley’s arguments against evolution, the simple fact is that watches—just like iguanas and finches—had to evolve from much simpler systems with occasional incremental advances occurring over time.\nHumans could not have constructed 19th-century clocks before the invention of cogs, gears, and levers—let alone before the practice of metallurgy, the use of numerical symbols, or the concept of time itself, etc. Instead, over many generations, simple timepieces had to accumulate small variations in the mental wombs of humans. Some of these variations were more helpful than others and led to their reproduction and proliferation.\nYes, the watch had to have a direct maker (the watchmaker)—just like the watchmaker, himself, also had to have a direct maker (his parents.) But the watchmaker did not invent the timepiece out of nothing and could not have been personally responsible for all its complexity. The basic plan of the watch passed though prior generations of clockmakers, continuously evolving along the way. Likewise, the configuration of the human watchmaker was also passed along through the DNA of all his ancestors, continuously evolving along the way. Neither the extraordinary complexity of the watch nor that of the watchmaker was created all in one miraculous burst—and certainly not by an immaterial and supernatural force.\nAs it happens, Paley’s arguments are correct, not because they are a rebuttal or a logical disproof of the various Neo-Darwinian epicycles, but simply because they led him to reject the obvious impossibility of evolution through natural selection.\nThe obvious and mathematical fact is that “the configuration of the human watchmaker” was definitely NOT “passed along through the DNA of all his ancestors, continuously evolving along the way” for the obvious reason that it could not have.\nMathematicians, physicists, and artificial intelligences have all checked and repeatedly confirmed the absolute impossibility of a sufficient number of mutational fixations occurring in the maximum nine million years available for the process.\nAnd the reason the innumerate biologists keep insisting upon the impossible is that not one of them, from Charles Darwin to Richard Dawkins,\nhas ever bothered to do the very simple math of human demographics and reproduction\nthat is required for the evolutionary fairy tale to hold up in the aftermath of the sequencing of the human genome. Mendel was a blow, but MITTENS is a stake in the chest, a decapitation, and iron nails hammering the coffin shut.\nI don’t blame McCarthy or anyone else for failing to notice this, because virtually no one but an economist is sufficiently accustomed to think in terms of millions, billions, and trillions to spot the obvious mathematical absurdity required to account for 15-20 million base pairs repeatedly fixating across the entire human population over the period of time involved.\nAnyhow, I think it will be tremendously interesting if McArthy ever turns his formidable powers of skeptical investigation onto Mr. Darwin, his theory, and its many revisions. He doesn’t need to bother with Mr. Dawkins, of course, as the up-to-date evolutionists have already retreated to the very randomness that Dawkins sought to disprove with his inept little attempt at writing code.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "MITTENS"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-04T17:46:47+00:00"
}