{
  "url": "https://voxday.net/2025/08/15/little-nicky-runned-away-again/",
  "scraped_at": "2026-01-08T20:28:34.863120",
  "title": "Little Nicky Runned Away… Again",
  "date_display": "August 15, 2025",
  "date_iso": "2025-08-15T18:19:19+00:00",
  "date_from_url": "2025-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Little Nicky Fuentes is a pathetic joke. He ran away from a debate with me back in 2019. I haven’t paid any attention to him since, and that was obviously the right call since all he’s accomplished since then is to <a href=\"https://x.com/RealCandaceO/status/1955473194162258267\">run away from more debates</a> to which he’d previously agreed.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Okay time to end the victim grift. I confirmed Charlie Kirk was game to debate @NickJFuentes. Went to confirm the debate with Nick and was told it was a no. His reason? Because I’m a bitch.</p><p>I am embarrassed that grown adult men truly fell for this middle school drama act.</p><p>Nick is a pathological liar who created the mythology of the “most cancelled man alive”. If you are a straight man who fell for this act, you are officially gay now.</p><p>Not another word from you little frog boys, ever again.</p></blockquote><p>What a contemptible fraud. This guy used to prance around talking about war on Conservatism Inc. Now he’s running away from <em>Charlie freaking Kirk</em>! The only reason most of Little Nicky’s followers aren’t embarrassed enough to abandon him is because they don’t actually exist. They’re just bots his puppet-masters purchased for him. The rest, presumably, are too retarded to grasp what a cowardly little bitch they’re backing.</p><p>“You don’t get it, Boomer!” they cry. “He’s just joking!”</p><p>No, he is the joke. Definitely fake, and almost certainly gay.</p><p><em><a href=\"https://socialgalactic.com/micropost/fd9da40e-f71e-4627-b184-00f5643a34c3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Little Nicky Fuentes is a pathetic joke. He ran away from a debate with me back in 2019. I haven’t paid any attention to him since, and that was obviously the right call since all he’s accomplished since then is to\nrun away from more debates\nto which he’d previously agreed.\nOkay time to end the victim grift. I confirmed Charlie Kirk was game to debate @NickJFuentes. Went to confirm the debate with Nick and was told it was a no. His reason? Because I’m a bitch.\nI am embarrassed that grown adult men truly fell for this middle school drama act.\nNick is a pathological liar who created the mythology of the “most cancelled man alive”. If you are a straight man who fell for this act, you are officially gay now.\nNot another word from you little frog boys, ever again.\nWhat a contemptible fraud. This guy used to prance around talking about war on Conservatism Inc. Now he’s running away from\nCharlie freaking Kirk\n! The only reason most of Little Nicky’s followers aren’t embarrassed enough to abandon him is because they don’t actually exist. They’re just bots his puppet-masters purchased for him. The rest, presumably, are too retarded to grasp what a cowardly little bitch they’re backing.\n“You don’t get it, Boomer!” they cry. “He’s just joking!”\nNo, he is the joke. Definitely fake, and almost certainly gay.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2025-08-15T18:40:23+00:00"
}