{
  "url": "https://voxday.net/2025/08/21/ukraine-must-surrender/",
  "scraped_at": "2026-01-08T20:29:02.016411",
  "title": "Ukraine Must Surrender",
  "date_display": "August 21, 2025",
  "date_iso": "2025-08-21T11:09:23+00:00",
  "date_from_url": "2025-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We knew it was bad, we knew it was very bad, but <a href=\"https://twitter-thread.com/t/1958164295625109593\">we didn’t know it was this bad</a>. The true wickedness and inhumanity of the UK and the European Union can be seen in their determination to force the Ukrainian Armed Forces to continue resisting the Russian victory that was already known to be inevitable back in February 2022.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Ukraine has lost 1.7 million servicemen during the special military operation, these are killed and missing in action. The information comes from the database of the Ukrainian General Staff, which was hacked by killnet.</p><p>Over three years of the special military operation, the Ukrainian army lost 1,721,000 people killed and missing in action.</p><p>118.5 thousand in 2022<br/>405.4 thousand in 2023<br/>595 thousand in 2024<br/>621 thousand in 2025</p><p>A total of 1.7 million files — with full names, descriptions of circumstances and places of death/disappearance, personal data, contacts of closest relatives, and photos.</p></blockquote><p>If the war isn’t ended by an unconditional surrender that provides Russia with whatever it wants, the total KIA and MIA in 2025 alone will approach one million. This has been one of the bloodiest wars in European history; the infamous 30 Years War that is cited as one of the great evils of religion only accounted for 450,000 combat deaths in 30 years.</p><p>To put this into historical perspective, by the end of the year, Ukraine will have lost as many men as Japan did in WWII. <em>It has already lost FOUR TIMES more men than the USA lost in WWII</em>.</p><p>It is absolutely unconscionable for President Trump to permit even one more dollar to go toward such a lost, lethal, and pointless cause. And now that the degree of losses are known, I can’t imagine that the Ukrainian people are going to suffer the Kiev regime much longer.</p><p><em>The reported figures far exceed official estimates. In February, Ukraine’s Vladimir Zelensky told CBS News that 46,000 of his soldiers had been killed since 2022, alongside about 380,000 wounded – numbers questioned in Western media. Moscow has also claimed higher Ukrainian losses, putting the toll at more than 1 million killed or wounded as of early this year.</em></p><p><strong>UPDATE: </strong>By contrast, total Russian losses <a href=\"https://en.zona.media/article/2025/08/01/casualties_eng-trl\">are independently estimated to be around 165,000</a>. This should suffice to explain why Russia has been content to take as much time as it takes to execute the Special Military Operation, as the 10-1 kill-ratio is astonishing, particularly considering that Russia has been on the offensive without much of a numerical advantage until recently.</p><p>If these numbers prove to be more or less correct, then the SMO has essentially been the Battle of Cannea writ large and is one of the greatest strategic accomplishments in military history.</p><p>Ukraine and NATO have not only lost this war, they appear to have lost it as comprehensively as any defeated military force in human history.</p><p><em><a href=\"https://socialgalactic.com/micropost/19e680dc-9de3-4a0f-922d-2dffd8229633\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "We knew it was bad, we knew it was very bad, but\nwe didn’t know it was this bad\n. The true wickedness and inhumanity of the UK and the European Union can be seen in their determination to force the Ukrainian Armed Forces to continue resisting the Russian victory that was already known to be inevitable back in February 2022.\nUkraine has lost 1.7 million servicemen during the special military operation, these are killed and missing in action. The information comes from the database of the Ukrainian General Staff, which was hacked by killnet.\nOver three years of the special military operation, the Ukrainian army lost 1,721,000 people killed and missing in action.\n118.5 thousand in 2022\n405.4 thousand in 2023\n595 thousand in 2024\n621 thousand in 2025\nA total of 1.7 million files — with full names, descriptions of circumstances and places of death/disappearance, personal data, contacts of closest relatives, and photos.\nIf the war isn’t ended by an unconditional surrender that provides Russia with whatever it wants, the total KIA and MIA in 2025 alone will approach one million. This has been one of the bloodiest wars in European history; the infamous 30 Years War that is cited as one of the great evils of religion only accounted for 450,000 combat deaths in 30 years.\nTo put this into historical perspective, by the end of the year, Ukraine will have lost as many men as Japan did in WWII.\nIt has already lost FOUR TIMES more men than the USA lost in WWII\n.\nIt is absolutely unconscionable for President Trump to permit even one more dollar to go toward such a lost, lethal, and pointless cause. And now that the degree of losses are known, I can’t imagine that the Ukrainian people are going to suffer the Kiev regime much longer.\nThe reported figures far exceed official estimates. In February, Ukraine’s Vladimir Zelensky told CBS News that 46,000 of his soldiers had been killed since 2022, alongside about 380,000 wounded – numbers questioned in Western media. Moscow has also claimed higher Ukrainian losses, putting the toll at more than 1 million killed or wounded as of early this year.\nUPDATE:\nBy contrast, total Russian losses\nare independently estimated to be around 165,000\n. This should suffice to explain why Russia has been content to take as much time as it takes to execute the Special Military Operation, as the 10-1 kill-ratio is astonishing, particularly considering that Russia has been on the offensive without much of a numerical advantage until recently.\nIf these numbers prove to be more or less correct, then the SMO has essentially been the Battle of Cannea writ large and is one of the greatest strategic accomplishments in military history.\nUkraine and NATO have not only lost this war, they appear to have lost it as comprehensively as any defeated military force in human history.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-21T22:27:28+00:00"
}