{
  "url": "https://voxday.net/2025/08/05/wwiii-is-already-underway/",
  "scraped_at": "2026-01-08T20:27:39.648314",
  "title": "WWIII is Already Underway",
  "date_display": "August 5, 2025",
  "date_iso": "2025-08-05T22:00:54+00:00",
  "date_from_url": "2025-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.unz.com/runz/marked-for-death-by-a-reckless-america/\">If Ron Unz is correct</a> and Vladimir Putin and Xi Xinping have already reduced their international travel due to concerns about assassination by Clown World, I think it’s safe to conclude that peace is not even a remote possibility in the near future:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Hudson Institute is a leading DC think-tank, quite influential in mainstream political circles, and a report with five co-authors that runs 128 pages must surely carry considerable weight in establishment circles. So when it suggests that the Chinese government is fragile and might soon collapse, those policy makers hostile to China are likely to take such views quite seriously.</p><p>Suppose that a leading Chinese think-tank with close ties to the PRC government published a weighty report predicting that America might soon collapse, then went on to argue that Chinese military forces would need to be deployed in our own country to seize our key military and technological assets and also establish a new government organized along Chinese lines. I doubt that most American political leaders or ordinary citizens would view such Chinese proposals with total equanimity, and indeed the blogger quoted a shocked Western pro-China business executive who succinctly summarized some of the striking elements in that Hudson Institute research study:</p><p><em>…which provides detailed operational plans for inducing Chinese regime collapse through systematic information operations, financial warfare, and covert influence campaigns, followed by detailed protocols for U.S. post-collapse management including military occupation, territorial reorganization, and the installation of a political and cultural system vassalized to the U.S.</em></p><p>Rand and Hudson are two of our leading mainstream think-tanks and the <em>New Yorker</em> is one of our most prestigious media outlets. Taken together those major articles and reports could easily convince the ignorant and suggestible ideologues in our government that the Chinese military was weak and the Chinese government fragile and ripe for collapse.</p><p>If delusional beliefs regarding the fragility of the Iranian and Russian governments had already led to American assassination attempts against their top leadership, similar reasoning might easily result in targeting those of China as well, especially President Xi Jinping, widely regarded as the strongest Chinese leader in decades. And given all of the recent American assassination projects, the Chinese government might certainly have itself reached such conclusions.</p><p>China and Russia are the two leading members of the BRICS movement, which held its 17th summit last month in Brazil. The media noted that neither Russian President Putin nor Chinese President Xi attended in person, with the latter missing his first BRICS summit since he came to power 13 years ago.</p><p>Xi’s surprising absence caused some discussion in the media. I initially paid little attention to this issue, but then some commenter suggested an obvious explanation: Both Xi and Putin were concerned about the possible risk of American assassination.</p><p>Brazil is located within the Western Hemisphere, a region under full American military domination. Given the extremely reckless and unpredictable behavior of the American government, with President Trump having publicly threatened to assassinate Iran’s top leader just a couple of weeks earlier, both China and Russia may have believed that some risks should best be avoided.</p><p>Over the years, Xi and Putin had both met on numerous occasions with Iranian President Raisi, with whom they had developed an excellent working relationship, and surely his 2024 death in a mysterious helicopter crash while returning from a foreign trip would have concentrated their minds.</p></blockquote><p>It’s been very difficult for Americans to understand that the rest of the world doesn’t aspire to become like them. And while Americans also like to think of the USA as the big dog on the world stage, I don’t think many of them grasp that many countries around the world, including some very powerful ones, are beginning to conclude that the big dog is now rabid.</p><p>And what is the point of talking to a rabid dog? What can one possibly hope to accomplish?</p><p><em><a href=\"https://socialgalactic.com/micropost/113f1758-3581-4b4c-b4c8-017325e4656b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If Ron Unz is correct\nand Vladimir Putin and Xi Xinping have already reduced their international travel due to concerns about assassination by Clown World, I think it’s safe to conclude that peace is not even a remote possibility in the near future:\nThe Hudson Institute is a leading DC think-tank, quite influential in mainstream political circles, and a report with five co-authors that runs 128 pages must surely carry considerable weight in establishment circles. So when it suggests that the Chinese government is fragile and might soon collapse, those policy makers hostile to China are likely to take such views quite seriously.\nSuppose that a leading Chinese think-tank with close ties to the PRC government published a weighty report predicting that America might soon collapse, then went on to argue that Chinese military forces would need to be deployed in our own country to seize our key military and technological assets and also establish a new government organized along Chinese lines. I doubt that most American political leaders or ordinary citizens would view such Chinese proposals with total equanimity, and indeed the blogger quoted a shocked Western pro-China business executive who succinctly summarized some of the striking elements in that Hudson Institute research study:\n…which provides detailed operational plans for inducing Chinese regime collapse through systematic information operations, financial warfare, and covert influence campaigns, followed by detailed protocols for U.S. post-collapse management including military occupation, territorial reorganization, and the installation of a political and cultural system vassalized to the U.S.\nRand and Hudson are two of our leading mainstream think-tanks and the\nNew Yorker\nis one of our most prestigious media outlets. Taken together those major articles and reports could easily convince the ignorant and suggestible ideologues in our government that the Chinese military was weak and the Chinese government fragile and ripe for collapse.\nIf delusional beliefs regarding the fragility of the Iranian and Russian governments had already led to American assassination attempts against their top leadership, similar reasoning might easily result in targeting those of China as well, especially President Xi Jinping, widely regarded as the strongest Chinese leader in decades. And given all of the recent American assassination projects, the Chinese government might certainly have itself reached such conclusions.\nChina and Russia are the two leading members of the BRICS movement, which held its 17th summit last month in Brazil. The media noted that neither Russian President Putin nor Chinese President Xi attended in person, with the latter missing his first BRICS summit since he came to power 13 years ago.\nXi’s surprising absence caused some discussion in the media. I initially paid little attention to this issue, but then some commenter suggested an obvious explanation: Both Xi and Putin were concerned about the possible risk of American assassination.\nBrazil is located within the Western Hemisphere, a region under full American military domination. Given the extremely reckless and unpredictable behavior of the American government, with President Trump having publicly threatened to assassinate Iran’s top leader just a couple of weeks earlier, both China and Russia may have believed that some risks should best be avoided.\nOver the years, Xi and Putin had both met on numerous occasions with Iranian President Raisi, with whom they had developed an excellent working relationship, and surely his 2024 death in a mysterious helicopter crash while returning from a foreign trip would have concentrated their minds.\nIt’s been very difficult for Americans to understand that the rest of the world doesn’t aspire to become like them. And while Americans also like to think of the USA as the big dog on the world stage, I don’t think many of them grasp that many countries around the world, including some very powerful ones, are beginning to conclude that the big dog is now rabid.\nAnd what is the point of talking to a rabid dog? What can one possibly hope to accomplish?\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-05T22:02:13+00:00"
}