{
  "url": "https://voxday.net/2025/08/13/yes-it-can-get-worse/",
  "scraped_at": "2026-01-08T20:28:23.769178",
  "title": "Definitely Fake, Possibly Worse",
  "date_display": "August 13, 2025",
  "date_iso": "2025-08-13T11:41:55+00:00",
  "date_from_url": "2025-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Big Bear <a href=\"https://x.com/OwenBenjamin/status/1955162173044560276\">has a theory</a> about Nick Fuentes:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A full breakdown of who Nick Fuentes is, who’s backing him and why. This is very detailed with clips of him describing all of my claims. The dude openly promotes pedophelia and honey pots his listeners. Over and over again.</p><p>I don’t think he’s a fed. It’s way way worse.</p></blockquote><p>Now, I don’t pay enough attention to Nick Fuentes to have much of an opinion on him other than the fact that I know, beyond any shadow of a doubt, that he is a coward, he is a liar, and he is a manufactured entity who is propped up by inorganic means. Who manufactured him and who props him up, I do not know, because I realized he was irrelevant and intellectually unserious <a href=\"https://voxday.net/2019/12/20/little-nicky-debate-challenge-take-three-2/\">back in 2019</a> and therefore saw no reason to start paying attention to anything he said or did. A search of this blog will confirm that there are very, very few references to him to be found here, aside from a mention of his 2020 banning by YouTube and <a href=\"https://voxday.net/2023/07/25/obvious-manufacture-is-obvious/\">a 2023 reference</a> to the obvious similarities between Fuentes and the failed attempt to make Jon Zherka a thing.</p><p><em>You may recall the list of signs that an individual is controlled opposition and his “popularity” is being manufactured for him by the mainstream media, as in the cases of Ben Shapiro, Jordan Peterson, Nick Fuentes, and Andrew Tate, just to name a few.</em></p><p>I will point out that one mistake commonly made by midwits is to assume that because A is attacking B, A cannot be in the employ of B. This assumption is fundamentally false, because everyone, on every side, is well-aware of the utility of being able to control the opposition. Hence the joke about never asking a “white nationalist” about the racial heritage of his significant other; it is safe to assume that most Internet Nazis are actually funded by AIPAC contributors in order to play the role of the over-the-top bad guys in order to provide the impetus for AIPAC’s endless campaign against anti-semitism.</p><p>This is Clown World, after all, where everything is literally fake and reliably gay.</p><p>But Owen’s instincts should not be ignored. Once he saw through the charade that is Jordan Peterson and understood the mechanism by which these frauds are manufactured and elevated, his natural ability to sniff out BS became applicable to the intellectual and ideological gatekeepers. I don’t know if he is correct about Fuentes being the puppet of an even darker group than the one to whom the Petersons and Shapiros are beholden, but if he is, we’ll eventually learn the truth.</p><p>One thing that separates both Big Bear and I from all the midwits who keep falling for these charlatans is that unlike them, we don’t listen for confirmation. It means nothing to either of us to hear that someone appears to agree with anything we say or with what we believe. What we listen for, what we pay attention to, are the anomalies. Because it’s always in the anomalies that the truth can ultimately be perceived.</p><p>Words are just words, and they mean less than nothing in the mouths of inversive liars to whom deceit is a virtue and fraud is a moral imperative. The only words that really matter are the Words of God, which informs us that we are to judge both men and their words by the fruit that they bear.</p><p>We are told that Nick Fuentes has 710k followers on X, which utterly dwarfs the 800 subscribers that Big Bear and I presently share on UATV. So I wonder, what fruit has been born of this massive following and the resources it implies?</p><p>I note that Nick Fuentes claimed to be “the most cancelled man” back in 2022, five years after I was banned from Twitter. I’m still banned. My wife is still banned. Fuentes has 709,900 followers there… And finally, the reason that I know he is a manufactured fraud is because manufactured frauds always run away from debate with me because they are not allowed to “platform” me.</p><p>Which, you will note, <a href=\"https://voxday.net/2019/12/12/a-letter-to-nick-fuentes/\">Nick Fuentes did, repeatedly, back in 2019</a>. The problem is that I have always been, and will always be, far more relevant than the fraudulent little freak is, whether Owen is correct about him or not. It is an undeniable fact that more people around the world utilize the very words and ideas that I create than even know who he is. So if you’re a Nick Fuentes fan, remember that when challenged in the very manner he invited, he behaved exactly like Jordan Peterson and Ben Shapiro.</p><p><em>“I don’t want to debate him because it’s too boring, dude, it’s too boring. Everybody would think that would be exciting, but, I can tell you for a fact that there would be no entertainment value in debating somebody as boring and as slow as Vox Day. So the guy’s boring, and he’s irrelevant, you know, who’s watching the Darkstream? If he can pull more than 2000 viewers concurrent watching the Darkstream, maybe I’d consider him worth my time, but, I mean the guy’s a has-been, you could say he never was. You know, this is somebody who’s been floating around on the scene like writing books? And, what does he have to show for it? Infogalactic? A gay comic book? You know, all these like just stupid projects that don’t go anywhere.”</em></p><p>And in the event you’re dumb enough to believe that your binary thinking model is capable of addressing  issues that intrinsically involve some elements of deception, please be advised that you should keep your irrelevant opinions to yourself.</p><p><em><a href=\"https://socialgalactic.com/micropost/336a750e-43ad-4ee0-9c7f-683abb2daadd\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Big Bear\nhas a theory\nabout Nick Fuentes:\nA full breakdown of who Nick Fuentes is, who’s backing him and why. This is very detailed with clips of him describing all of my claims. The dude openly promotes pedophelia and honey pots his listeners. Over and over again.\nI don’t think he’s a fed. It’s way way worse.\nNow, I don’t pay enough attention to Nick Fuentes to have much of an opinion on him other than the fact that I know, beyond any shadow of a doubt, that he is a coward, he is a liar, and he is a manufactured entity who is propped up by inorganic means. Who manufactured him and who props him up, I do not know, because I realized he was irrelevant and intellectually unserious\nback in 2019\nand therefore saw no reason to start paying attention to anything he said or did. A search of this blog will confirm that there are very, very few references to him to be found here, aside from a mention of his 2020 banning by YouTube and\na 2023 reference\nto the obvious similarities between Fuentes and the failed attempt to make Jon Zherka a thing.\nYou may recall the list of signs that an individual is controlled opposition and his “popularity” is being manufactured for him by the mainstream media, as in the cases of Ben Shapiro, Jordan Peterson, Nick Fuentes, and Andrew Tate, just to name a few.\nI will point out that one mistake commonly made by midwits is to assume that because A is attacking B, A cannot be in the employ of B. This assumption is fundamentally false, because everyone, on every side, is well-aware of the utility of being able to control the opposition. Hence the joke about never asking a “white nationalist” about the racial heritage of his significant other; it is safe to assume that most Internet Nazis are actually funded by AIPAC contributors in order to play the role of the over-the-top bad guys in order to provide the impetus for AIPAC’s endless campaign against anti-semitism.\nThis is Clown World, after all, where everything is literally fake and reliably gay.\nBut Owen’s instincts should not be ignored. Once he saw through the charade that is Jordan Peterson and understood the mechanism by which these frauds are manufactured and elevated, his natural ability to sniff out BS became applicable to the intellectual and ideological gatekeepers. I don’t know if he is correct about Fuentes being the puppet of an even darker group than the one to whom the Petersons and Shapiros are beholden, but if he is, we’ll eventually learn the truth.\nOne thing that separates both Big Bear and I from all the midwits who keep falling for these charlatans is that unlike them, we don’t listen for confirmation. It means nothing to either of us to hear that someone appears to agree with anything we say or with what we believe. What we listen for, what we pay attention to, are the anomalies. Because it’s always in the anomalies that the truth can ultimately be perceived.\nWords are just words, and they mean less than nothing in the mouths of inversive liars to whom deceit is a virtue and fraud is a moral imperative. The only words that really matter are the Words of God, which informs us that we are to judge both men and their words by the fruit that they bear.\nWe are told that Nick Fuentes has 710k followers on X, which utterly dwarfs the 800 subscribers that Big Bear and I presently share on UATV. So I wonder, what fruit has been born of this massive following and the resources it implies?\nI note that Nick Fuentes claimed to be “the most cancelled man” back in 2022, five years after I was banned from Twitter. I’m still banned. My wife is still banned. Fuentes has 709,900 followers there… And finally, the reason that I know he is a manufactured fraud is because manufactured frauds always run away from debate with me because they are not allowed to “platform” me.\nWhich, you will note,\nNick Fuentes did, repeatedly, back in 2019\n. The problem is that I have always been, and will always be, far more relevant than the fraudulent little freak is, whether Owen is correct about him or not. It is an undeniable fact that more people around the world utilize the very words and ideas that I create than even know who he is. So if you’re a Nick Fuentes fan, remember that when challenged in the very manner he invited, he behaved exactly like Jordan Peterson and Ben Shapiro.\n“I don’t want to debate him because it’s too boring, dude, it’s too boring. Everybody would think that would be exciting, but, I can tell you for a fact that there would be no entertainment value in debating somebody as boring and as slow as Vox Day. So the guy’s boring, and he’s irrelevant, you know, who’s watching the Darkstream? If he can pull more than 2000 viewers concurrent watching the Darkstream, maybe I’d consider him worth my time, but, I mean the guy’s a has-been, you could say he never was. You know, this is somebody who’s been floating around on the scene like writing books? And, what does he have to show for it? Infogalactic? A gay comic book? You know, all these like just stupid projects that don’t go anywhere.”\nAnd in the event you’re dumb enough to believe that your binary thinking model is capable of addressing  issues that intrinsically involve some elements of deception, please be advised that you should keep your irrelevant opinions to yourself.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "media",
    "ONS"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-08-13T12:58:16+00:00"
}