{
  "url": "https://voxday.net/2004/08/07/beside-poin/",
  "scraped_at": "2025-12-19T20:39:49.393281",
  "title": "Beside the point",
  "date_display": "August 7, 2004",
  "date_iso": "2004-08-07T11:44:00+00:00",
  "date_from_url": "2004-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michelle Malkin thinks she can simultaneously play and referee:<br/></p><blockquote><p> <br>Taken in totality, rather than in selective slivers, <a href=\"http://michellemalkin.com/archives/000360.htm\">my defense of Roosevelt’s homeland security measures</a> remains unrefuted.</br></p><p>Next, please.<br/></p></blockquote><p>Malkin skips over the point that her entire thesis is utterly absurd!  The totality of all the minor dangers Malkin cites doesn’t come close to that posed by the British Army in the War of 1812 – when British troops actually invaded the American homeland, burned the White House, etc. and yet the Commander-in-Chief did not then feel the need to completely shred the Constitution as did FDR with his executive order to intern and relocate American citizens of Japanese descent.</p><p>There was never any serious danger to the West Coast.  Even if a factory or two was sabotaged, even if a military base or two was spied upon, even if a submarine lobbed a few shells at Los Angeles, it was not going to have any effect on the war effort whatsoever, as US industrial capacity absolutely dwarfed that of Germany and Japan combined.  Since Malkin apparently knows nothing about military history, she rests her case on posterior-covering reports which consist of little more than what-ifs and just-maybes.  Not having read the book, I don’t know if she’s actually foolish enough to claim that the West Coast was under the threat of invasion, but from the sound of her defense, I don’t think she was quite that detached from the history of this space-time continuum.</p><p>As for the protective aspects of the interment, if Malkin’s book causes her to become insufficiently popular with enough people, shall we lock her up against her will?  For her own protection of course.</p><p>With Michelle’s support for the Patriot Act and now this boot-licking justification of State muscle-flexing, it seems she is as naive as she is lovely.  Would-be dictators always promise protection from incipient danger, if only they can set themselves above the law.  That hoary old trick was ancient when Marius was pulling it on the Conscript Fathers.</p><p>UPDATE: Here’s some information on <a href=\"http://www1.xlibris.com/bookstore/book_excerpt.asp?bookid=11491\">the man that Ms Malkin is defending</a>.  It’s particularly interesting to hear that he bragged he had “committed enough illegal acts to be impeached and jailed for 999 years” even before he was seizing the nation’s gold and forcing American citizens out of their homes.<br/></p></div>",
  "content_text": "Michelle Malkin thinks she can simultaneously play and referee:\nTaken in totality, rather than in selective slivers,\nmy defense of Roosevelt’s homeland security measures\nremains unrefuted.\nNext, please.\nMalkin skips over the point that her entire thesis is utterly absurd!  The totality of all the minor dangers Malkin cites doesn’t come close to that posed by the British Army in the War of 1812 – when British troops actually invaded the American homeland, burned the White House, etc. and yet the Commander-in-Chief did not then feel the need to completely shred the Constitution as did FDR with his executive order to intern and relocate American citizens of Japanese descent.\nThere was never any serious danger to the West Coast.  Even if a factory or two was sabotaged, even if a military base or two was spied upon, even if a submarine lobbed a few shells at Los Angeles, it was not going to have any effect on the war effort whatsoever, as US industrial capacity absolutely dwarfed that of Germany and Japan combined.  Since Malkin apparently knows nothing about military history, she rests her case on posterior-covering reports which consist of little more than what-ifs and just-maybes.  Not having read the book, I don’t know if she’s actually foolish enough to claim that the West Coast was under the threat of invasion, but from the sound of her defense, I don’t think she was quite that detached from the history of this space-time continuum.\nAs for the protective aspects of the interment, if Malkin’s book causes her to become insufficiently popular with enough people, shall we lock her up against her will?  For her own protection of course.\nWith Michelle’s support for the Patriot Act and now this boot-licking justification of State muscle-flexing, it seems she is as naive as she is lovely.  Would-be dictators always promise protection from incipient danger, if only they can set themselves above the law.  That hoary old trick was ancient when Marius was pulling it on the Conscript Fathers.\nUPDATE: Here’s some information on\nthe man that Ms Malkin is defending\n.  It’s particularly interesting to hear that he bragged he had “committed enough illegal acts to be impeached and jailed for 999 years” even before he was seizing the nation’s gold and forcing American citizens out of their homes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-07T10:44:00+00:00"
}