{
  "url": "https://voxday.net/2004/08/20/deranged-and-derailed/",
  "scraped_at": "2025-12-19T20:41:58.533181",
  "title": "Deranged and derailed",
  "date_display": "August 20, 2004",
  "date_iso": "2004-08-20T19:07:00+00:00",
  "date_from_url": "2004-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Drudge:<br/></p><blockquote><p> <br>KERRY CAMPAIGN CALLS FOR BOOK BAN.  The Kerry campaign calls on a publisher to ‘withdraw book’ written by group of veterans, claiming veterans are lying about Kerry’s service in Vietnam and operating as a front organization for Bush. Kerry campaign has told Salon.com that the publisher of UNFIT FOR COMMAND is ‘retailing a hoax’… ‘No publisher should want to be selling books with proven falsehoods in them,’ Kerry campaign spokesman Chad Clanton tells the online mag.<br/></br></p></blockquote><p>So much for the fantasy genre.  And Star Trek is right out!  But at least we know Kerry’s position on the First Amendment.  I’m struck by the thought that my title for next week’s column was bloody prescient.</p><p>I’m honestly beginning to think that Kerry won’t even make it to November.  Seriously, if Kerry had any sort of case at all, he’d go on one of the big shows, invite four or five of his fellow vets and throw down.  That would put an immediate end to the story and probably hand him the election, as he would walk away looking like Duke Nukem, kicking ass and chewing gum, except he’s all out of gum.  But he won’t do that because he can’t.  He can’t because he, more than anyone else, knows that he’s full of <em>merde</em><br/></p></div>",
  "content_text": "From Drudge:\nKERRY CAMPAIGN CALLS FOR BOOK BAN.  The Kerry campaign calls on a publisher to ‘withdraw book’ written by group of veterans, claiming veterans are lying about Kerry’s service in Vietnam and operating as a front organization for Bush. Kerry campaign has told Salon.com that the publisher of UNFIT FOR COMMAND is ‘retailing a hoax’… ‘No publisher should want to be selling books with proven falsehoods in them,’ Kerry campaign spokesman Chad Clanton tells the online mag.\nSo much for the fantasy genre.  And Star Trek is right out!  But at least we know Kerry’s position on the First Amendment.  I’m struck by the thought that my title for next week’s column was bloody prescient.\nI’m honestly beginning to think that Kerry won’t even make it to November.  Seriously, if Kerry had any sort of case at all, he’d go on one of the big shows, invite four or five of his fellow vets and throw down.  That would put an immediate end to the story and probably hand him the election, as he would walk away looking like Duke Nukem, kicking ass and chewing gum, except he’s all out of gum.  But he won’t do that because he can’t.  He can’t because he, more than anyone else, knows that he’s full of\nmerde",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-20T18:07:00+00:00"
}