{
  "url": "https://voxday.net/2004/08/16/elliott-waves-and-prechter-interview/",
  "scraped_at": "2025-12-19T20:41:10.767536",
  "title": "Elliott Waves and the Prechter interview",
  "date_display": "August 16, 2004",
  "date_iso": "2004-08-16T06:17:00+00:00",
  "date_from_url": "2004-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Elliott Wave theory states that financial markets move in identifiable patterns, driven by waves of cumulative human emotion.  It is utilized in both market analysis and socionomics, a new analytical concept conceived by Bob Prechter, which suggests that a) if the patterns are identifiable and somewhat predictable, and b) if the markets can be used as a measure for the mass social mood, that the markets can be used to broadly predict the probabilities of general future events.</p><p>The correlation of skirt length and stock market performance is well-known.  Women’s skirts tend to be short when the market is doing well, and long when it is doing poorly.  But there is also a large degree of historical correlation between bear markets and war and a host of other social ills, even disease; whereas explanative causality tends to say that the market fell because bad thing X happened, socionomics turns this causality on its head and states that because the social mood is deteriorating, the market fell and bad thing X happened.  In other words, there is no causal link between X and the market, they are occurring in tandem.  This latter assertion is largely supported by historical research, as even the movement of oil prices and interest rates can’t be demonstrated to affect the markets in a reliable manner.</p><p>As for the Elliott Waves themselves, the theory states that mass human emotion, and therefore trends,  move in five-wave motions, with odd-numbered waves moving with the trend and even-numbered waves running countertrend.  Countertrend movements tend to have three-wave patterns, usually noted as A-B-C, where A and C are trend and B countertrend.</p><p>These waves are thought to operate at all levels.  The Primary waves span years, while the minute waves span only hours.  To put this in more familiar terms, the market movement that is now known as the dot com bubble of 2000 is identified as a bullish Primary Wave 5, while the bear market decline from 2000 to Oct 2002 is identified as a trend shift into Primary Wave 1.  The Iraqi war rally from March 2003 to early 2004 is seen as Primary Wave 2.  Prechter and the theorists at Elliott Wave International now assert that we are in the first leg of Primary Wave 3, which will take the markets down for the next year or two.</p><p>Q: The Nasdaq-100 fell 83 percent in the Primary Wave 1 bear.  It has dropped 19.5 percent since the end of the Wave 2 bull in January.  How far do you expect the Wave 3 bear to extend downward?</p><p>A: <em>Sometimes first waves can be extended.  That may be the case here.  Wave 3 will never be the shortest, so you’re certainly talking somewhere in the 60 percent range minimum, assuming a mild third wave.  Otherwise, 80 percent is possible.</em></p><p>Q:  The Dow has held up pretty well compared to the SPX and the NDX.  Do you expect that to continue?</p><p>A: <em>No, definitely not.  The blue chips usually give way last in a bear market.  A classic example is the first half of the 1970s.  The overall decline started in 1966 but the blue chips held up and even made a new high in January 1973.  Then, in two short years, they dropped 45%.  The Dow Industrials will eventually catch up to the S&amp;P 500, but not the Nasdaq.  The Nasdaq is in a class by itself.</em></p><p>Q:  What are the implications for the housing market?  It seems to have shaken off Wave 1 rather nicely.</p><p>A: <em>Yes, and that’s also typical.  Pete Kendall studied the coincidence of real estate and stock market tops going back 200 years and found that there tended to be a lag, typically about two years between the two peaks.  This lag has now been four years, which fits our thesis that the top is of larger degree than anything we’ve seen in the past 200 years.  What we’re seeing is how people give up on one [investment class] and say the other will save us.</em></p><p>Q: I understand your currency analyst did rather well in a competition recently.</p><p>A: <em>Yes, Peter Rehmer.  He won a currency competition.  Reuters, I think it was.  You can read more about it at <a href=\"http://www.elliottwave.com/subscribers/currencies/\">Elliott Wave International</a>.</em></p><p>Q:  Some people believe that diversifying into foreign markets will protect them.  Do you think that’s a viable strategy?</p><p>A: <em>No.  It’s a very bad idea.  One of the things I discussed in “Conquer the Crash” is what a burden foreign diverification can be when it’s time to get out of your positions.  All equity markets will suffer, but North America and Europe will get hit most severely.</em></p><p>Q:  What do you think of bear funds such as RYVNX and BEARX?  They did pretty well from 2000 to 2002.  Would you expect them to do well in 2005 and 2006?</p><p>A: <em>Definitely.  I think for the average investor, those are excellent ways to make money in the bear market.  You avoid the time decay of options as well as the open-ended risk of being short an individual stock.</em></p><p>Q:   Mainstream commentators often mention the election cycle as a means of assuring that the markets will go up.  That hasn’t played out too well this year, do you expect a significant move upwards into November?</p><p>A: <em>Quite the opposite.  I’m looking for a down into the election, probably a downward acceleration into the election.</em></p><p>Q:  Is it possible that the market tanking will actually support the dollar, as foreigners want to get out of equities but will be reluctant to change out their currency holdings?</p><p>A: <em>I’m not sure I agree with the logic of that, but I certainly think it’s probable that as the markets go down, the dollar will strengthen.  I think we are about to enter a deflation of historic magnitude which equates to a contraction in the overall supply of dollar-denominated credit.  What do you do when you have to pay off your credit cards or can’t make your mortgage?  Right, you sell whatever investments you’ve got.  As people have to pay off their debts, they’ll be selling everything.</em></p><p>Q: What’s to keep the Fed from just inflating?  They don’t need to print it anymore, they can just stick a billion dollars in everyone’s bank account?</p><p>A: <em>Whose bank account?  Yours?  Mine?  And what do bond holders do the second they catch wind of that?  Right, they sell.  That would destroy the credit markets faster than anything.  The Fed can’t print faster than people can sell.</em></p><p>Q:  What are some of the more unexpected socionomics trends that you expect to reveal themselves as Wave 3 plays out?</p><p>A: <em>A lot of them have already begun.  We told people several years ago that there would be religious conflicts and foreign attacks on US soil in At the Crest of the Tidal Wave.  That’s old news now, but it wasn’t then.  As for things that haven’t happened yet, two things I expect to see are secession movements and labor strikes. </em></p><p>Q:  FDR seized the nation’s private gold in 1933.  Do you expect similar behavior from the federal government by the time Wave 5 of (3) hits bottom?</p><p>A: <em>Let me answer that in a more general way.  Do you remember how you felt on Sep. 11, 2001?  That was a level of fear that you felt on a first wave.  Third waves and fifth waves bring about higher levels of fear.  We will feel less secure in 3 and 5 than we did in 1.</em></p><p>Q:  How are you attempting to improve the art/science of assigning wavecounts and making socionomic predictions?</p><p>A: <em>The biggest step towards increasing our accuracy is the work I did for “Beautiful Pictures”.  Anectodally, we’ve always seen more Fibonacci relationships than you would expect by chance, both by time and price.  But I decided to give it a much deeper investigation, and the most interesting thing about it is that Fibonacci relationships appear in places that require some work to discern.  Most people try to take the easy road and apply them to retracements, but that only tends to work within corrections.  Still, there are other places that they do work unexpectedly well.  Even in “The Elliott Wave Principle”, chapter 4, we steered people in the right direction, but here I think I’ve demonstrated it.</em><br/></p></div>",
  "content_text": "Elliott Wave theory states that financial markets move in identifiable patterns, driven by waves of cumulative human emotion.  It is utilized in both market analysis and socionomics, a new analytical concept conceived by Bob Prechter, which suggests that a) if the patterns are identifiable and somewhat predictable, and b) if the markets can be used as a measure for the mass social mood, that the markets can be used to broadly predict the probabilities of general future events.\nThe correlation of skirt length and stock market performance is well-known.  Women’s skirts tend to be short when the market is doing well, and long when it is doing poorly.  But there is also a large degree of historical correlation between bear markets and war and a host of other social ills, even disease; whereas explanative causality tends to say that the market fell because bad thing X happened, socionomics turns this causality on its head and states that because the social mood is deteriorating, the market fell and bad thing X happened.  In other words, there is no causal link between X and the market, they are occurring in tandem.  This latter assertion is largely supported by historical research, as even the movement of oil prices and interest rates can’t be demonstrated to affect the markets in a reliable manner.\nAs for the Elliott Waves themselves, the theory states that mass human emotion, and therefore trends,  move in five-wave motions, with odd-numbered waves moving with the trend and even-numbered waves running countertrend.  Countertrend movements tend to have three-wave patterns, usually noted as A-B-C, where A and C are trend and B countertrend.\nThese waves are thought to operate at all levels.  The Primary waves span years, while the minute waves span only hours.  To put this in more familiar terms, the market movement that is now known as the dot com bubble of 2000 is identified as a bullish Primary Wave 5, while the bear market decline from 2000 to Oct 2002 is identified as a trend shift into Primary Wave 1.  The Iraqi war rally from March 2003 to early 2004 is seen as Primary Wave 2.  Prechter and the theorists at Elliott Wave International now assert that we are in the first leg of Primary Wave 3, which will take the markets down for the next year or two.\nQ: The Nasdaq-100 fell 83 percent in the Primary Wave 1 bear.  It has dropped 19.5 percent since the end of the Wave 2 bull in January.  How far do you expect the Wave 3 bear to extend downward?\nA:\nSometimes first waves can be extended.  That may be the case here.  Wave 3 will never be the shortest, so you’re certainly talking somewhere in the 60 percent range minimum, assuming a mild third wave.  Otherwise, 80 percent is possible.\nQ:  The Dow has held up pretty well compared to the SPX and the NDX.  Do you expect that to continue?\nA:\nNo, definitely not.  The blue chips usually give way last in a bear market.  A classic example is the first half of the 1970s.  The overall decline started in 1966 but the blue chips held up and even made a new high in January 1973.  Then, in two short years, they dropped 45%.  The Dow Industrials will eventually catch up to the S&P 500, but not the Nasdaq.  The Nasdaq is in a class by itself.\nQ:  What are the implications for the housing market?  It seems to have shaken off Wave 1 rather nicely.\nA:\nYes, and that’s also typical.  Pete Kendall studied the coincidence of real estate and stock market tops going back 200 years and found that there tended to be a lag, typically about two years between the two peaks.  This lag has now been four years, which fits our thesis that the top is of larger degree than anything we’ve seen in the past 200 years.  What we’re seeing is how people give up on one [investment class] and say the other will save us.\nQ: I understand your currency analyst did rather well in a competition recently.\nA:\nYes, Peter Rehmer.  He won a currency competition.  Reuters, I think it was.  You can read more about it at\nElliott Wave International\n.\nQ:  Some people believe that diversifying into foreign markets will protect them.  Do you think that’s a viable strategy?\nA:\nNo.  It’s a very bad idea.  One of the things I discussed in “Conquer the Crash” is what a burden foreign diverification can be when it’s time to get out of your positions.  All equity markets will suffer, but North America and Europe will get hit most severely.\nQ:  What do you think of bear funds such as RYVNX and BEARX?  They did pretty well from 2000 to 2002.  Would you expect them to do well in 2005 and 2006?\nA:\nDefinitely.  I think for the average investor, those are excellent ways to make money in the bear market.  You avoid the time decay of options as well as the open-ended risk of being short an individual stock.\nQ:   Mainstream commentators often mention the election cycle as a means of assuring that the markets will go up.  That hasn’t played out too well this year, do you expect a significant move upwards into November?\nA:\nQuite the opposite.  I’m looking for a down into the election, probably a downward acceleration into the election.\nQ:  Is it possible that the market tanking will actually support the dollar, as foreigners want to get out of equities but will be reluctant to change out their currency holdings?\nA:\nI’m not sure I agree with the logic of that, but I certainly think it’s probable that as the markets go down, the dollar will strengthen.  I think we are about to enter a deflation of historic magnitude which equates to a contraction in the overall supply of dollar-denominated credit.  What do you do when you have to pay off your credit cards or can’t make your mortgage?  Right, you sell whatever investments you’ve got.  As people have to pay off their debts, they’ll be selling everything.\nQ: What’s to keep the Fed from just inflating?  They don’t need to print it anymore, they can just stick a billion dollars in everyone’s bank account?\nA:\nWhose bank account?  Yours?  Mine?  And what do bond holders do the second they catch wind of that?  Right, they sell.  That would destroy the credit markets faster than anything.  The Fed can’t print faster than people can sell.\nQ:  What are some of the more unexpected socionomics trends that you expect to reveal themselves as Wave 3 plays out?\nA:\nA lot of them have already begun.  We told people several years ago that there would be religious conflicts and foreign attacks on US soil in At the Crest of the Tidal Wave.  That’s old news now, but it wasn’t then.  As for things that haven’t happened yet, two things I expect to see are secession movements and labor strikes.\nQ:  FDR seized the nation’s private gold in 1933.  Do you expect similar behavior from the federal government by the time Wave 5 of (3) hits bottom?\nA:\nLet me answer that in a more general way.  Do you remember how you felt on Sep. 11, 2001?  That was a level of fear that you felt on a first wave.  Third waves and fifth waves bring about higher levels of fear.  We will feel less secure in 3 and 5 than we did in 1.\nQ:  How are you attempting to improve the art/science of assigning wavecounts and making socionomic predictions?\nA:\nThe biggest step towards increasing our accuracy is the work I did for “Beautiful Pictures”.  Anectodally, we’ve always seen more Fibonacci relationships than you would expect by chance, both by time and price.  But I decided to give it a much deeper investigation, and the most interesting thing about it is that Fibonacci relationships appear in places that require some work to discern.  Most people try to take the easy road and apply them to retracements, but that only tends to work within corrections.  Still, there are other places that they do work unexpectedly well.  Even in “The Elliott Wave Principle”, chapter 4, we steered people in the right direction, but here I think I’ve demonstrated it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-16T05:17:00+00:00"
}