{
  "url": "https://voxday.net/2004/08/31/george-will-refuses-to-put-on-skir/",
  "scraped_at": "2025-12-19T20:43:13.860888",
  "title": "George Will refuses to put on a skirt",
  "date_display": "August 31, 2004",
  "date_iso": "2004-08-31T07:08:00+00:00",
  "date_from_url": "2004-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>From the New Deal through the civil rights revolution, liberalism strove to use expanding government to drive the alteration of society. Conservatism’s mission was largely restoration — rolling back big government. Neither persuasion is now plausible.</br></p><p>Kerry insists he is not a “redistribution Democrat.” But of course he is. And Bush is a redistribution Republican. There is no “natural” distribution of social wealth. Distribution is influenced by many social arrangements, from property laws to tax laws to educational arrangements, all of them political choices. Both parties have redistributionist agendas….</p><p>Very few voters care about questions of political process. That is why the political class feels free to act with scandalous impunity, as in this Bush-Kerry collaboration to silence what the political class persistently calls “outside groups.” A question: Outside of what?<br/></p></blockquote><p>It’s nice to see that Mr. Will <a href=\"http://www.townhall.com/columnists/georgewill/gw20040831.shtml\">isn’t interested in waving pom-poms</a>, even in the midst of the Republican convention.  He is, as is his custom, genteel but clear in referring to the socialism of both factions as “redistributionist”.  George Will, more than any other political writer, has been an influence on my interest in editorial commentary and it is good to see that he perceives the same bi-factional ruling party that I do.<br/></p></div>",
  "content_text": "From the New Deal through the civil rights revolution, liberalism strove to use expanding government to drive the alteration of society. Conservatism’s mission was largely restoration — rolling back big government. Neither persuasion is now plausible.\nKerry insists he is not a “redistribution Democrat.” But of course he is. And Bush is a redistribution Republican. There is no “natural” distribution of social wealth. Distribution is influenced by many social arrangements, from property laws to tax laws to educational arrangements, all of them political choices. Both parties have redistributionist agendas….\nVery few voters care about questions of political process. That is why the political class feels free to act with scandalous impunity, as in this Bush-Kerry collaboration to silence what the political class persistently calls “outside groups.” A question: Outside of what?\nIt’s nice to see that Mr. Will\nisn’t interested in waving pom-poms\n, even in the midst of the Republican convention.  He is, as is his custom, genteel but clear in referring to the socialism of both factions as “redistributionist”.  George Will, more than any other political writer, has been an influence on my interest in editorial commentary and it is good to see that he perceives the same bi-factional ruling party that I do.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-31T06:08:00+00:00"
}