{
  "url": "https://voxday.net/2004/08/15/gutting-kerry-campaign/",
  "scraped_at": "2025-12-19T20:41:08.832870",
  "title": "Gutting the Kerry campaign",
  "date_display": "August 15, 2004",
  "date_iso": "2004-08-15T22:48:00+00:00",
  "date_from_url": "2004-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit notes that the media wall defending Jean-Francois’ bizarre alternate history from public view is cracking:<br/></p><blockquote><p> <br>Kerry himself bestowed immense credibility on his “Band of Brothers” when he used a picture of some of them in his campaign ad titled “Lifetime.” Essentially, Kerry made Vietnam, and these men, the centerpiece of his campaign. Of course, that was when he thought they’d support his candidacy. No matter that he’d never bothered to ask their permission to use them to promote his political career.</br></p><p>Now, however, the Kerry campaign is on a search-and-destroy mission to attack the credibility of these same men — calling them liars, all 60 of them, and saying they didn’t serve in the military with him. Really? Then why’d Kerry use their pictures in his ad campaign?</p><p>These are the same men who Kerry hailed as his “Band of Brothers,” who he implied knew him well and could vouch for him as a wonderful soldier and man.  These men, who Kerry inferred that we, the American people, could trust to tell us that he would make a great president, are suddenly liars. And why? Because they aren’t saying what Kerry wants them to say. Because they aren’t puppets. <a href=\"http://www.examiner.com/article/index.cfm/i/081304op_antrim\">Because they’re insisting on speaking the truth, a concept with which Kerry obviously isn’t familiar.</a></p><p>Could this attack on their credibility be related to the fact that they’ve announced that he’s unfit to serve as president? Looks to me like he wrote the wrong names down in the reference column of his resume.<br/></p></blockquote><p>I don’t think it will be necessary for the neocon Busheviks (love that word, EN) to cancel the election.  I’m beginning to suspect that Kerry will be forced to step aside, as 25 years worth of well-documented and self-serving lies are going to finish him.  Bill Clinton has the charm to get away with lying.  Jesse Jackson has the complete lack of shame to get away with lying.  An arrogant and eminently unlikeable jerk like Kerry not only doesn’t have what it takes to get away with lying, but is going to have people tearing into him like starved wolves piling on a hamstrung moose – and that’s just the Democrats!<br/></p></div>",
  "content_text": "Instapundit notes that the media wall defending Jean-Francois’ bizarre alternate history from public view is cracking:\nKerry himself bestowed immense credibility on his “Band of Brothers” when he used a picture of some of them in his campaign ad titled “Lifetime.” Essentially, Kerry made Vietnam, and these men, the centerpiece of his campaign. Of course, that was when he thought they’d support his candidacy. No matter that he’d never bothered to ask their permission to use them to promote his political career.\nNow, however, the Kerry campaign is on a search-and-destroy mission to attack the credibility of these same men — calling them liars, all 60 of them, and saying they didn’t serve in the military with him. Really? Then why’d Kerry use their pictures in his ad campaign?\nThese are the same men who Kerry hailed as his “Band of Brothers,” who he implied knew him well and could vouch for him as a wonderful soldier and man.  These men, who Kerry inferred that we, the American people, could trust to tell us that he would make a great president, are suddenly liars. And why? Because they aren’t saying what Kerry wants them to say. Because they aren’t puppets.\nBecause they’re insisting on speaking the truth, a concept with which Kerry obviously isn’t familiar.\nCould this attack on their credibility be related to the fact that they’ve announced that he’s unfit to serve as president? Looks to me like he wrote the wrong names down in the reference column of his resume.\nI don’t think it will be necessary for the neocon Busheviks (love that word, EN) to cancel the election.  I’m beginning to suspect that Kerry will be forced to step aside, as 25 years worth of well-documented and self-serving lies are going to finish him.  Bill Clinton has the charm to get away with lying.  Jesse Jackson has the complete lack of shame to get away with lying.  An arrogant and eminently unlikeable jerk like Kerry not only doesn’t have what it takes to get away with lying, but is going to have people tearing into him like starved wolves piling on a hamstrung moose – and that’s just the Democrats!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-15T21:48:00+00:00"
}