{
  "url": "https://voxday.net/2004/08/20/in-defense-of-me-so-michelle-2/",
  "scraped_at": "2025-12-19T20:41:56.733549",
  "title": "In defense of Me So Michelle",
  "date_display": "August 20, 2004",
  "date_iso": "2004-08-20T18:41:00+00:00",
  "date_from_url": "2004-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ll cheerfully slash Ms Malkin to shreds all day long on her newfound love for the G, not to mention her defense of FDR, but she definitely didn’t deserve <a href=\"http://michellemalkin.com/archives/000418.htm\">the rude mistreatment she received</a> at the hands of Chris Matthews.<br/></p><blockquote><p> <br>This foaming jerk Matthews, who called me irresponsible and kicked me off the show admitted that a) he himself had not read the damned book, b) he was not interested in asking Kerry about the specific doubts raised by vets about his wounds, and c) he had not and would not question Kerry about these specific allegations.</br></p><p>“Are you saying he shot himself on purpose?” Matthews hammered. I repeated myself again clearly that I was referring to the allegations about self-inflicted wounds in the book. When I tried to explain that the vets who were with Kerry had cast a lot of doubt on whether enemy fire occurred during the first two incidents, Matthews cut me off again. “Why did you say that?” he badgered. Because, I said, I was talking about what was in the book, which he had admitted he hadn’t read.</p><p>“Don’t you wonder?” I asked.</p><p>“No, I don’t,” he bellowed. “It’s never occurred to me.”</p><p>With that, I was kicked off the second segment.</p><p>As the show broke for commercials, Matthews scrambled for his producers to see if what he said was true. And I’m irresponsible? One staffer ran to the office where I had left my copy of the book, and handed it to Matthews, who–for the first time, apparently–started flipping through it. I asked for my book back and politely said thank you. After I left, he trashed me again on the air and his scurrilous charges were repeated by his MSNBC colleague Keith Olbermann, who called me an “idiot.”<br/></p></blockquote><p>Of course, had Michelle simply pointed out that it was John Kerry who stated that he had wounded himself in his much-abused tushy in <em>Tour of Duty</em>, she could have easily trounced Matthews.  Got to be quicker on your feet, Ms Malkin.</p><p>In unrelated news, in light of our recent discussion on what makes a media whore, <a href=\"http://michellemalkin.com/archives/000419.htm\">this post of hers</a> did make me laugh.<br/></p></div>",
  "content_text": "I’ll cheerfully slash Ms Malkin to shreds all day long on her newfound love for the G, not to mention her defense of FDR, but she definitely didn’t deserve\nthe rude mistreatment she received\nat the hands of Chris Matthews.\nThis foaming jerk Matthews, who called me irresponsible and kicked me off the show admitted that a) he himself had not read the damned book, b) he was not interested in asking Kerry about the specific doubts raised by vets about his wounds, and c) he had not and would not question Kerry about these specific allegations.\n“Are you saying he shot himself on purpose?” Matthews hammered. I repeated myself again clearly that I was referring to the allegations about self-inflicted wounds in the book. When I tried to explain that the vets who were with Kerry had cast a lot of doubt on whether enemy fire occurred during the first two incidents, Matthews cut me off again. “Why did you say that?” he badgered. Because, I said, I was talking about what was in the book, which he had admitted he hadn’t read.\n“Don’t you wonder?” I asked.\n“No, I don’t,” he bellowed. “It’s never occurred to me.”\nWith that, I was kicked off the second segment.\nAs the show broke for commercials, Matthews scrambled for his producers to see if what he said was true. And I’m irresponsible? One staffer ran to the office where I had left my copy of the book, and handed it to Matthews, who–for the first time, apparently–started flipping through it. I asked for my book back and politely said thank you. After I left, he trashed me again on the air and his scurrilous charges were repeated by his MSNBC colleague Keith Olbermann, who called me an “idiot.”\nOf course, had Michelle simply pointed out that it was John Kerry who stated that he had wounded himself in his much-abused tushy in\nTour of Duty\n, she could have easily trounced Matthews.  Got to be quicker on your feet, Ms Malkin.\nIn unrelated news, in light of our recent discussion on what makes a media whore,\nthis post of hers\ndid make me laugh.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-20T17:41:00+00:00"
}