{
  "url": "https://voxday.net/2004/08/01/mailvox-see-spot-read/",
  "scraped_at": "2025-12-19T20:38:54.178637",
  "title": "Mailvox: see Spot read",
  "date_display": "August 1, 2004",
  "date_iso": "2004-08-01T09:40:00+00:00",
  "date_from_url": "2004-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Spot is underwhelmed with WND’s science correspondent:<br/></p><blockquote><p> <br>Also, it usually takes 9-12 months for papers to be published in specialized journals, and new ideas are always subjected to rigorous peer review processes. WND’s assertion that this demonstrates hostility on the part of dogmatic scientists is just silly.<br/></br></p></blockquote><p>I am not qualified to address Spot’s points with regards to the possible ramifications of the theory of a non-constant speed of light, so I shall leave that to the more scientifically interested.  I have no reason to doubt that he’s correct, except for what appears to be his poor reading comprehension.  First, Chris Bennett makes the assertion, not WND, and if WND has a “science correspondent” it would be Dr. Kelly Hollowell, who is a scientist, PhD and weekend columnist.  Chris Bennett would appear to be an engineer at a technology firm in California, he is not a WND correspondent, columnist or even regular contributor as far as I am aware.</p><p>Second, Bennett clearly states that the peer review treatment of these particular scientists was both unusual and hostile.  He writes: “<em>Setterfield, Dr. Tifft, Dr. Paul Davis, Dr. John Barrow and others have been subjected to peer review which borders on ridicule.</em>”  Here, the phrase “which borders on ridicule” modifies the preceding noun “peer review”.  It is not so much the assertion which is silly, but Spot’s attempt to dismiss it.</p><p>WND is by no means perfect. <a href=\"http://darkwindow.blogspot.com\">Dark Window</a>, among others, rightly flogs it for its tendency to link to National Enquiresque “interest” stories such as the cringe-inducing Iranian frog-birth story.  But then, it’s hard to argue with results that have a) produced nationally syndicated columnists and national radio shows, b) a monthly readership that blows away better-known names like Slate and Salon, and c) allows almost complete editorial freedom.  Can you imagine the Atlanta Journal Constitution letting its headline columnists translate the Fascist manifesto or waste precious column space on Tolstoy and weird trend theories?  WND is dedicated to freedom of all kinds, and intellectual freedom not only permits but downright requires the possibility, even the likelihood, of occasionally making a complete ass of yourself.<br/></p></div>",
  "content_text": "Spot is underwhelmed with WND’s science correspondent:\nAlso, it usually takes 9-12 months for papers to be published in specialized journals, and new ideas are always subjected to rigorous peer review processes. WND’s assertion that this demonstrates hostility on the part of dogmatic scientists is just silly.\nI am not qualified to address Spot’s points with regards to the possible ramifications of the theory of a non-constant speed of light, so I shall leave that to the more scientifically interested.  I have no reason to doubt that he’s correct, except for what appears to be his poor reading comprehension.  First, Chris Bennett makes the assertion, not WND, and if WND has a “science correspondent” it would be Dr. Kelly Hollowell, who is a scientist, PhD and weekend columnist.  Chris Bennett would appear to be an engineer at a technology firm in California, he is not a WND correspondent, columnist or even regular contributor as far as I am aware.\nSecond, Bennett clearly states that the peer review treatment of these particular scientists was both unusual and hostile.  He writes: “\nSetterfield, Dr. Tifft, Dr. Paul Davis, Dr. John Barrow and others have been subjected to peer review which borders on ridicule.\n”  Here, the phrase “which borders on ridicule” modifies the preceding noun “peer review”.  It is not so much the assertion which is silly, but Spot’s attempt to dismiss it.\nWND is by no means perfect.\nDark Window\n, among others, rightly flogs it for its tendency to link to National Enquiresque “interest” stories such as the cringe-inducing Iranian frog-birth story.  But then, it’s hard to argue with results that have a) produced nationally syndicated columnists and national radio shows, b) a monthly readership that blows away better-known names like Slate and Salon, and c) allows almost complete editorial freedom.  Can you imagine the Atlanta Journal Constitution letting its headline columnists translate the Fascist manifesto or waste precious column space on Tolstoy and weird trend theories?  WND is dedicated to freedom of all kinds, and intellectual freedom not only permits but downright requires the possibility, even the likelihood, of occasionally making a complete ass of yourself.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-01T08:40:00+00:00"
}