{
  "url": "https://voxday.net/2004/08/17/mailvox-ourobos/",
  "scraped_at": "2025-12-19T20:41:23.579765",
  "title": "Mailvox: ourobos",
  "date_display": "August 17, 2004",
  "date_iso": "2004-08-17T21:20:00+00:00",
  "date_from_url": "2004-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ihatedaShrub practices what passes for liberal logic:<br/></p><blockquote><p> <br>if the 240+ Vietnam vets are so ardent in their opposition of Kerry why did they wait until a scant 3 1/2 months before a presidential election to release their greivances….   A couple of these vets have been very dogged and very public in their three decade long pursuit of Kerry.<br/></br></p></blockquote><p>So, the Swift vets are damned if they opposed John Kerry from the start, and also damned if they didn’t?  That’s an interesting defense.  Also a completely circular and implausible one.  When would have been the appropriate moment for them to publicly oppose Kerry, exactly 15 years ago?</p><p>Applying Occam’s Razor would suggest that they all saw him as a fraud from the start, but most of them didn’t bother worrying about it.  That’s the normal human reaction to someone with whom you had a brief and unpleasant contact once they are no longer a factor in your life.  But once the  previously indifferent veterans realized that their former companion might become the Commander-in-Chief of the Armed Forces and their president, they decided it was necessary to get involved.</p><p>Also, Kerry’s defenders are <a href=\"http://www.captainsquartersblog.com/mt/archives/002264.php\">significantly less credible</a> than his attackers, as Captain Ed demonstrates in a manner most devastating.  As for Rassmann, I’m curious to know if anyone is paying for his appearances with John Kerry.  Is he being paid for his story and staunch support?  His story is critical, as simply pulling someone from the water isn’t all that heroic if you’re not under fire.  Heck, by that standard, the Perfect Aryan Male and the Terminator would seem to have a Bronze Star due them for pulling me out when I had a bad wipeout and injured myself waterskiing a few summers back.<br/></p></div>",
  "content_text": "ihatedaShrub practices what passes for liberal logic:\nif the 240+ Vietnam vets are so ardent in their opposition of Kerry why did they wait until a scant 3 1/2 months before a presidential election to release their greivances….   A couple of these vets have been very dogged and very public in their three decade long pursuit of Kerry.\nSo, the Swift vets are damned if they opposed John Kerry from the start, and also damned if they didn’t?  That’s an interesting defense.  Also a completely circular and implausible one.  When would have been the appropriate moment for them to publicly oppose Kerry, exactly 15 years ago?\nApplying Occam’s Razor would suggest that they all saw him as a fraud from the start, but most of them didn’t bother worrying about it.  That’s the normal human reaction to someone with whom you had a brief and unpleasant contact once they are no longer a factor in your life.  But once the  previously indifferent veterans realized that their former companion might become the Commander-in-Chief of the Armed Forces and their president, they decided it was necessary to get involved.\nAlso, Kerry’s defenders are\nsignificantly less credible\nthan his attackers, as Captain Ed demonstrates in a manner most devastating.  As for Rassmann, I’m curious to know if anyone is paying for his appearances with John Kerry.  Is he being paid for his story and staunch support?  His story is critical, as simply pulling someone from the water isn’t all that heroic if you’re not under fire.  Heck, by that standard, the Perfect Aryan Male and the Terminator would seem to have a Bronze Star due them for pulling me out when I had a bad wipeout and injured myself waterskiing a few summers back.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-17T20:20:00+00:00"
}