{
  "url": "https://voxday.net/2004/08/06/mailvox-selling-safety/",
  "scraped_at": "2025-12-19T20:39:32.745285",
  "title": "Mailvox: selling safety",
  "date_display": "August 6, 2004",
  "date_iso": "2004-08-06T06:34:00+00:00",
  "date_from_url": "2004-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ZT questions the timing:<br/></p><blockquote><p> <br>My biggest problem with the Interment issue is the US military is guided, or a better word would be hampered, but US public opinion. Fear of Japan hitting American soil was the root cause of the Japanese internment. It doesn’t matter what the General or Admiral’s knew. The Political powers that be caved to the fears of the populace. The population had no idea of what the Japanese military was capable of even if the US military did….</br></p><p>Feb 19, 1942 the Order 9066 was given creating the internment camps. March 1942 the Japanese had conquered many place in the Pacific leaving only the Philippines fighting for its life. It isn’t until Midway, which was after the start of the Interment camps, that the US force begin to have a hope of stopping the Japanese advance. So my question to VD is which point in time did the US military know the Japanese fleets abilities and when did they think they could stop them? Was it before Feb 19, 1942 or after?<br/></p></blockquote><p>Let’s look at the facts.  To invade a much smaller country, the USA and Britain required 5,000 ships and 4,000 landing craft to cross 21 miles of sea in the D-Day landings.  The Japanese never possessed a tenth that many ships and they had almost the entire Pacific Ocean to cross.  Nor did they have the industry to even think about building such a fleet.  Their top naval priority after Midway was to replace the carriers they lost, but throughout the course of the war they managed to produce only 10.  In the same period, the US produced 150.</p><p>But let’s pretend that a general with no clue about supply lines and whatnot seriously believed that the Japanese were going to roll the dice and throw their entire Navy into a wildly risky invasion of California.  While the internment order went out before the Battle of Midway ended on June 7, 1942, at which point the Japanese lost their offensive ability.  The internments and relocations had barely begun in May, even so, the last internment camp was not closed until August 1948, although all Japanese were cleared [to return to the West Coast] sometime in 1945.</p><p>An <a href=\"http://encyclopedia.thefreedictionary.com/Japanese%20internment\">encyclopedia entry</a> – with which I don’t always agree, as they use a statement of the Secretary of War to offer support of the policy even though he opposed it – states “Japanese Americans in Hawaii were not subject to the internment policy, despite the fact that they were closer to essential military facilities than most of the Japanese Americans in the western states. The main reason for this was the territory was already virtually under martial law. Also, given that about a third of the population of Hawaii was Japanese American, it is likely that wholesale detention of Japanese Americans in Hawaii would have crippled the local economy.”</p><p>So, the military situation was so dire that the local economy of Hawaii took precedence?  That’s interesting.  Even more damning is the fact that unlike the English and French coastlines, the American coast was never prepared to resist an invasion, because the military strategists knew one would never come.  A raid, a submarine lobbing a few shells, sure, but an invasion?  Never.</p><p>The politicians didn’t give in to popular fears.  Instead, as has always been the case, the government simply used the fear of the public to throw off its restrictions.  It worked in 1942, and judging by the attitudes of those supporting past violations as well as current abominations such as the Patriot Act – as if the name itself isn’t a giveaway – it will work equally well in the future.<br/></p></div>",
  "content_text": "ZT questions the timing:\nMy biggest problem with the Interment issue is the US military is guided, or a better word would be hampered, but US public opinion. Fear of Japan hitting American soil was the root cause of the Japanese internment. It doesn’t matter what the General or Admiral’s knew. The Political powers that be caved to the fears of the populace. The population had no idea of what the Japanese military was capable of even if the US military did….\nFeb 19, 1942 the Order 9066 was given creating the internment camps. March 1942 the Japanese had conquered many place in the Pacific leaving only the Philippines fighting for its life. It isn’t until Midway, which was after the start of the Interment camps, that the US force begin to have a hope of stopping the Japanese advance. So my question to VD is which point in time did the US military know the Japanese fleets abilities and when did they think they could stop them? Was it before Feb 19, 1942 or after?\nLet’s look at the facts.  To invade a much smaller country, the USA and Britain required 5,000 ships and 4,000 landing craft to cross 21 miles of sea in the D-Day landings.  The Japanese never possessed a tenth that many ships and they had almost the entire Pacific Ocean to cross.  Nor did they have the industry to even think about building such a fleet.  Their top naval priority after Midway was to replace the carriers they lost, but throughout the course of the war they managed to produce only 10.  In the same period, the US produced 150.\nBut let’s pretend that a general with no clue about supply lines and whatnot seriously believed that the Japanese were going to roll the dice and throw their entire Navy into a wildly risky invasion of California.  While the internment order went out before the Battle of Midway ended on June 7, 1942, at which point the Japanese lost their offensive ability.  The internments and relocations had barely begun in May, even so, the last internment camp was not closed until August 1948, although all Japanese were cleared [to return to the West Coast] sometime in 1945.\nAn\nencyclopedia entry\n– with which I don’t always agree, as they use a statement of the Secretary of War to offer support of the policy even though he opposed it – states “Japanese Americans in Hawaii were not subject to the internment policy, despite the fact that they were closer to essential military facilities than most of the Japanese Americans in the western states. The main reason for this was the territory was already virtually under martial law. Also, given that about a third of the population of Hawaii was Japanese American, it is likely that wholesale detention of Japanese Americans in Hawaii would have crippled the local economy.”\nSo, the military situation was so dire that the local economy of Hawaii took precedence?  That’s interesting.  Even more damning is the fact that unlike the English and French coastlines, the American coast was never prepared to resist an invasion, because the military strategists knew one would never come.  A raid, a submarine lobbing a few shells, sure, but an invasion?  Never.\nThe politicians didn’t give in to popular fears.  Instead, as has always been the case, the government simply used the fear of the public to throw off its restrictions.  It worked in 1942, and judging by the attitudes of those supporting past violations as well as current abominations such as the Patriot Act – as if the name itself isn’t a giveaway – it will work equally well in the future.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-06T05:34:00+00:00"
}