{
  "url": "https://voxday.net/2004/08/04/mailvox-skool-daze/",
  "scraped_at": "2025-12-19T20:39:19.872612",
  "title": "Mailvox: Skool daze",
  "date_display": "August 4, 2004",
  "date_iso": "2004-08-04T21:19:00+00:00",
  "date_from_url": "2004-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The White Buffalo bellows:<br/></p><blockquote><p> <br>Do you have any stats on how private vs public schooled perform?<br/></br></p></blockquote><p>The only thing that I’ve ever seen is a comprehensive study based on the standardized achievement tests.  It was mostly billed <a href=\"http://www.hslda.org/docs/study/ray1997/04.asp\">as a homeschool report</a>, since it was the first study to look at a large number of homeschoolers but it also had the results of the public school kids as well as the privately school students taking the IOWA as well.  Unfortunately, the private school data appears to have been left out of this particular citation.</p><p>However, I remember reading this study, which I first saw mentioned in the Washington Post a few years back, and I recall clearly that the conclusion was that the homeschooled kids were reaching in nine years the level that private school kids reached in eleven and public school kids reached in twelve.  If one were to consider the tests to be reasonable approximations of academic achievement, (and they are almost certainly more credible than the inflated grades now being handed out at most schools and colleges around the country), then private school would appear to add approximately a year’s worth of schooling over public school.</p><p>There must be other studies out there, but that’s the only one that springs immediately to mind.<br/></p></div>",
  "content_text": "The White Buffalo bellows:\nDo you have any stats on how private vs public schooled perform?\nThe only thing that I’ve ever seen is a comprehensive study based on the standardized achievement tests.  It was mostly billed\nas a homeschool report\n, since it was the first study to look at a large number of homeschoolers but it also had the results of the public school kids as well as the privately school students taking the IOWA as well.  Unfortunately, the private school data appears to have been left out of this particular citation.\nHowever, I remember reading this study, which I first saw mentioned in the Washington Post a few years back, and I recall clearly that the conclusion was that the homeschooled kids were reaching in nine years the level that private school kids reached in eleven and public school kids reached in twelve.  If one were to consider the tests to be reasonable approximations of academic achievement, (and they are almost certainly more credible than the inflated grades now being handed out at most schools and colleges around the country), then private school would appear to add approximately a year’s worth of schooling over public school.\nThere must be other studies out there, but that’s the only one that springs immediately to mind.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-04T20:19:00+00:00"
}