{
  "url": "https://voxday.net/2004/08/05/michelle-goes-monica-for-fdr/",
  "scraped_at": "2025-12-19T20:39:25.370467",
  "title": "Michelle goes Monica for FDR",
  "date_display": "August 5, 2004",
  "date_iso": "2004-08-05T11:29:00+00:00",
  "date_from_url": "2004-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I skipped reading Powerline for a few days and was a few sentences into <a href=\"http://www.powerlineblog.com/archives/007376.php\">this post</a> when I realized that far from being an indictment, Michelle Malkin was apparently defending FDR’s internment of Japanese-Americans during WWII in her new book.  Scrolling down to the <a href=\"http://www.powerlineblog.com/archives/007361.php\">previous Powerline post</a> revealed that the title: <em>In Defense of Internment</em> is not a sarcastic appellation in the Erasmian mode, but a straightforward justification of American concentration camps.</p><p>Needless to say, I haven’t read the book yet, but once I get my hands on one I will review it here.  I very much doubt I’ll find her case convincing, as no amount of clear and present danger justifies the complete abrogation of the U.S. Constitution, much less the farcical possibility of a serious Japanese threat to the U.S. mainland.  As one Powerline reader wrote in to comment:<br/></p><blockquote><p> <br>“It amazes me that self-professed conservatives still insist on carrying water for the greatest American icon of the left, FDR, on the issue of WWII internments. The internments were morally wrong, practically unnecessary, and unconstitutional. As far as its unconstitutionality, I know that Justice Scalia ranks the [Korematsu] decision as one of the worst in American jurisprudence (I take Scalia over Malkin). As for its necessity, J. Edgar Hoover reported to FDR that the FBI had found no evidence for even a single act of espionage or sabotage amongst Japanese-Americans and Japanese nationals. It was immoral because it deprived tens of thousands of people (including tens of thousands of American citizens) of their unalienable right to liberty (as well as effectively depriving them of most of their property) without anything close to due process. FDR’s attorney general was against it, as was the rest of his cabinet (the closest one of them came to concurring was Sec. Of War Stimson who believed that Japanese nationals, but not American citizens, should be interned).</br></p><p>Nor is there a direct correlation between mass internments and the use of profiling in law enforcement/homeland security. The one deals only with a temporary administrative inconvenience versus the violation of fundamental rights. I’m for the use of profiling, but I don’t see how Malkin’s quixotic effort to justify the historical side issue of WWII internments will do much if anything to further that cause.<br/></p></blockquote><p>“Self-professed” being the key word.  I’d previously thought that Malkin was nothing more than another cute Republican media whore, but apparently she’s something worse, a strong government “conservative” in the Bush mode.  Conservatives really need to be a little bit more aware of who is climbing into their beds and who they embrace as their intellectual champions.  What’s next, the conservative case for Stalin’s socialism in one country?  Or perhaps for a sequel, Malkin can champion FDR’s seizure of the nation’s gold and his attempt to pack the Supreme Court.</p><p>I have no problem whatsoever with private companies being allowed to profile and discriminate to their hearts’ content.  I have no problem with the states closing the national borders to immigrants.  I do, however, have a massive problem with those who defend the federal government’s right to put American citizens in concentration camps.  To paraphrase the words of a true conservative, PJ O’Rourke, advocating the expansion of central state power isn’t just treason to conservativism, it is treason to the human race.<br/></p></div>",
  "content_text": "I skipped reading Powerline for a few days and was a few sentences into\nthis post\nwhen I realized that far from being an indictment, Michelle Malkin was apparently defending FDR’s internment of Japanese-Americans during WWII in her new book.  Scrolling down to the\nprevious Powerline post\nrevealed that the title:\nIn Defense of Internment\nis not a sarcastic appellation in the Erasmian mode, but a straightforward justification of American concentration camps.\nNeedless to say, I haven’t read the book yet, but once I get my hands on one I will review it here.  I very much doubt I’ll find her case convincing, as no amount of clear and present danger justifies the complete abrogation of the U.S. Constitution, much less the farcical possibility of a serious Japanese threat to the U.S. mainland.  As one Powerline reader wrote in to comment:\n“It amazes me that self-professed conservatives still insist on carrying water for the greatest American icon of the left, FDR, on the issue of WWII internments. The internments were morally wrong, practically unnecessary, and unconstitutional. As far as its unconstitutionality, I know that Justice Scalia ranks the [Korematsu] decision as one of the worst in American jurisprudence (I take Scalia over Malkin). As for its necessity, J. Edgar Hoover reported to FDR that the FBI had found no evidence for even a single act of espionage or sabotage amongst Japanese-Americans and Japanese nationals. It was immoral because it deprived tens of thousands of people (including tens of thousands of American citizens) of their unalienable right to liberty (as well as effectively depriving them of most of their property) without anything close to due process. FDR’s attorney general was against it, as was the rest of his cabinet (the closest one of them came to concurring was Sec. Of War Stimson who believed that Japanese nationals, but not American citizens, should be interned).\nNor is there a direct correlation between mass internments and the use of profiling in law enforcement/homeland security. The one deals only with a temporary administrative inconvenience versus the violation of fundamental rights. I’m for the use of profiling, but I don’t see how Malkin’s quixotic effort to justify the historical side issue of WWII internments will do much if anything to further that cause.\n“Self-professed” being the key word.  I’d previously thought that Malkin was nothing more than another cute Republican media whore, but apparently she’s something worse, a strong government “conservative” in the Bush mode.  Conservatives really need to be a little bit more aware of who is climbing into their beds and who they embrace as their intellectual champions.  What’s next, the conservative case for Stalin’s socialism in one country?  Or perhaps for a sequel, Malkin can champion FDR’s seizure of the nation’s gold and his attempt to pack the Supreme Court.\nI have no problem whatsoever with private companies being allowed to profile and discriminate to their hearts’ content.  I have no problem with the states closing the national borders to immigrants.  I do, however, have a massive problem with those who defend the federal government’s right to put American citizens in concentration camps.  To paraphrase the words of a true conservative, PJ O’Rourke, advocating the expansion of central state power isn’t just treason to conservativism, it is treason to the human race.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-05T10:29:00+00:00"
}