{
  "url": "https://voxday.net/2004/08/09/one-stock-id-consider/",
  "scraped_at": "2025-12-19T20:40:02.273787",
  "title": "One stock I’d consider",
  "date_display": "August 9, 2004",
  "date_iso": "2004-08-09T10:11:00+00:00",
  "date_from_url": "2004-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, not at this down wave, no way.  But I do admire Google for their willingness to take on the Wamphyri of Wall Street and their monopoly on access to the markets.<br/></p><blockquote><p> <br><a href=\"http://moneycentral.msn.com/content/P89192.asp\">Why Wall Street wants Google to fail</a>….  If Google’s offering works for the company — that is, if it raises money at a good price and at a low commission to boot — then this IPO would legitimize an alternative to the traditional IPO that will diminish the power of Wall Street investment banks. Other companies, companies with lower profiles than Google, will have a new alternative for raising money. Wall Street doesn’t even like to think about that possibility.</br></p><p>If, on the other hand, Google’s IPO fails — if not enough investors bid, or if the price is too low, or if the IPO sinks, leaving hordes of angry individual investors and the company with egg on its face — then the auction model will go back on the shelf and Wall Street investment banking will go back to business as usual.</p><p>That’s why I don’t think you can trust anything Wall Street says about the Google IPO: The investment banking establishment has too much at stake and too many institutional conflicts of interest to make them credible on this offering.<br/></p></blockquote><p>It’s the wrong time, an incredibly bad time for this.  Google would have had a very successful launch if they’d done it nine months ago, now, it’s probably too late.  But if it fails, it won’t be because the concept was faulty, only the timing.  It’s a pity, but then, the return of the roaring bear will do more to put Wall Street back in its place than a newfangled IPO possibly could.</p><p>Don’t ever make the mistake of confusing Wall Street with capitalism.  Wall Street is designed specifically to limit capitalism as per government regulations; it contradicts the activities of a genuinely free market.<br/></p></div>",
  "content_text": "Okay, not at this down wave, no way.  But I do admire Google for their willingness to take on the Wamphyri of Wall Street and their monopoly on access to the markets.\nWhy Wall Street wants Google to fail\n….  If Google’s offering works for the company — that is, if it raises money at a good price and at a low commission to boot — then this IPO would legitimize an alternative to the traditional IPO that will diminish the power of Wall Street investment banks. Other companies, companies with lower profiles than Google, will have a new alternative for raising money. Wall Street doesn’t even like to think about that possibility.\nIf, on the other hand, Google’s IPO fails — if not enough investors bid, or if the price is too low, or if the IPO sinks, leaving hordes of angry individual investors and the company with egg on its face — then the auction model will go back on the shelf and Wall Street investment banking will go back to business as usual.\nThat’s why I don’t think you can trust anything Wall Street says about the Google IPO: The investment banking establishment has too much at stake and too many institutional conflicts of interest to make them credible on this offering.\nIt’s the wrong time, an incredibly bad time for this.  Google would have had a very successful launch if they’d done it nine months ago, now, it’s probably too late.  But if it fails, it won’t be because the concept was faulty, only the timing.  It’s a pity, but then, the return of the roaring bear will do more to put Wall Street back in its place than a newfangled IPO possibly could.\nDon’t ever make the mistake of confusing Wall Street with capitalism.  Wall Street is designed specifically to limit capitalism as per government regulations; it contradicts the activities of a genuinely free market.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-09T09:11:00+00:00"
}