{
  "url": "https://voxday.net/2004/08/01/out-of-luc/",
  "scraped_at": "2025-12-19T20:38:59.662033",
  "title": "Out of LUC",
  "date_display": "August 1, 2004",
  "date_iso": "2004-08-01T22:29:00+00:00",
  "date_from_url": "2004-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This, again, brought to you by the Coalition of the Willing and the Law of Unintended Consequences:<br/></p><blockquote><p> <br>BAGHDAD, Aug. 1 — Car bombs <a href=\"http://www.washingtonpost.com/wp-dyn/articles/A31840-2004Aug1.html\">exploded outside at least five Christian churches</a> in two Iraqi cities during Sunday evening services in coordinated attacks that sent terrified and bleeding worshipers fleeing into the streets as stained-glass windows shattered and flames engulfed the buildings. More than a dozen people were killed and scores injured in the assaults, the first mass violence against minority Christians who have long coexisted peacefully with Iraqi Muslims.<br/></br></p></blockquote><p>See, there’s a small problem when you bring freedom to people who want to kill lots of other people.  As every great philosopher of liberty has pointed out, freedom and liberty require a certain something – Tocqueville called it goodness – in order to prevent them from being abused to harm others.  Freedom is self-limiting in this regard, as those who wish to run amok will soon find themselves clamped down upon in one way or another.</p><p>The notion that democracy is possible, much less desirable, in Arabic Islamic culture was always ridiculous.  Sure, a barely recognizable form of it works, at the point of a whole lot of guns, in Turkey, but the very protest proves the point.  After eighteen months, this nation-building is looking more viable by the day.  Of course, the administration’s cheerleaders will no doubt point out that these latest bombings only shows how desperate the terrorists have become, although I have to say it is getting is harder and harder to distinguish between the many examples of their supposed desperation.</p></div>",
  "content_text": "This, again, brought to you by the Coalition of the Willing and the Law of Unintended Consequences:\nBAGHDAD, Aug. 1 — Car bombs\nexploded outside at least five Christian churches\nin two Iraqi cities during Sunday evening services in coordinated attacks that sent terrified and bleeding worshipers fleeing into the streets as stained-glass windows shattered and flames engulfed the buildings. More than a dozen people were killed and scores injured in the assaults, the first mass violence against minority Christians who have long coexisted peacefully with Iraqi Muslims.\nSee, there’s a small problem when you bring freedom to people who want to kill lots of other people.  As every great philosopher of liberty has pointed out, freedom and liberty require a certain something – Tocqueville called it goodness – in order to prevent them from being abused to harm others.  Freedom is self-limiting in this regard, as those who wish to run amok will soon find themselves clamped down upon in one way or another.\nThe notion that democracy is possible, much less desirable, in Arabic Islamic culture was always ridiculous.  Sure, a barely recognizable form of it works, at the point of a whole lot of guns, in Turkey, but the very protest proves the point.  After eighteen months, this nation-building is looking more viable by the day.  Of course, the administration’s cheerleaders will no doubt point out that these latest bombings only shows how desperate the terrorists have become, although I have to say it is getting is harder and harder to distinguish between the many examples of their supposed desperation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-01T21:29:00+00:00"
}