{
  "url": "https://voxday.net/2004/08/02/pro-democracy-terrorists/",
  "scraped_at": "2025-12-19T20:39:01.485238",
  "title": "Pro-democracy terrorists",
  "date_display": "August 2, 2004",
  "date_iso": "2004-08-02T07:21:00+00:00",
  "date_from_url": "2004-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rainer gets it backwards:<br/></p><blockquote><p> <br>I agree with you on this, [the mistake of nation building] and I think that it is going to be very difficult to establish a democracy here. However, I don’t think that it is a matter to be thrown away. Just because some terrorists don’t want it doesn’t mean that nobody should get it.<br/></br></p></blockquote><p>The problem isn’t that the terrorists and their allies don’t want democracy, it’s the US administration and their appointed puppet Allawi that don’t want democracy.  A free and open vote in Iraq would likely elect the more radical Islamic elements which are currently allied with the foreign al Qaeda fighters.  In fact, Debka is reporting that the US administration is now in secret negotiations to bring the Ba’ath back into government, along with the Sunni leaders, in order to split them from the foreign jihadists:<br/></p><blockquote><p> <br>Since the first week of July, <a href=\"http://www.debka.com/article.php?aid=884\">the Bush administration has been immersed in a secret, high-wire diplomatic exercise</a> aimed at bringing down the level of Iraqi insurgent attacks on US troops, or perhaps halting the violence altogether, by coming to terms with the enemy. DEBKA-Net-Weekly’s intelligence sources report exclusively that the initiative is being carried forward by a prominent non-Iraq Arab figure as intermediary on behalf of the highest White House echelons. His identity is top secret for reasons of security. (Our editors have his name but promised to preserve his anonymity in return for this exclusive).</br></p><p>All that can be said at this time is that the intermediary is not based in Iraq; he goes over for delicate negotiating sessions in the Bush administration’s name with Baath guerrilla leaders, militia commanders and heads of the great Sunni Muslim tribes and clans. At all times, he is in direct communication with the White House.</p><p>The only three Americans in Iraq privy to this negotiating track are Robert Blackwill, the president’s senior adviser on Iraq, US ambassador John Negroponte who is not personally involved, and the commander of American forces in Iraq, General David Casey, who is in charge of security arrangements and any changes on the ground arising from progress in the talks.  The only two Iraqis kept informed are prime minister Iyad Allawi and deputy prime minister for security Salih Barham.</p><p>DEBKAfile adds: the negotiating track began with a preliminary condition: Baath and Sunni leaders must undertake to disengage from al Qaeda and other foreign Arab fighters.<br/></p></blockquote><p>Still think that we’re on the side of freedom and democracy in Iraq?  I don’t think so.  I’m not sure precisely what model George Bush and company are hoping to construct but they’re not even pretending to create a constitutional representative democracy, much less a true government by, of and for the people over there.<br/></p></div>",
  "content_text": "Rainer gets it backwards:\nI agree with you on this, [the mistake of nation building] and I think that it is going to be very difficult to establish a democracy here. However, I don’t think that it is a matter to be thrown away. Just because some terrorists don’t want it doesn’t mean that nobody should get it.\nThe problem isn’t that the terrorists and their allies don’t want democracy, it’s the US administration and their appointed puppet Allawi that don’t want democracy.  A free and open vote in Iraq would likely elect the more radical Islamic elements which are currently allied with the foreign al Qaeda fighters.  In fact, Debka is reporting that the US administration is now in secret negotiations to bring the Ba’ath back into government, along with the Sunni leaders, in order to split them from the foreign jihadists:\nSince the first week of July,\nthe Bush administration has been immersed in a secret, high-wire diplomatic exercise\naimed at bringing down the level of Iraqi insurgent attacks on US troops, or perhaps halting the violence altogether, by coming to terms with the enemy. DEBKA-Net-Weekly’s intelligence sources report exclusively that the initiative is being carried forward by a prominent non-Iraq Arab figure as intermediary on behalf of the highest White House echelons. His identity is top secret for reasons of security. (Our editors have his name but promised to preserve his anonymity in return for this exclusive).\nAll that can be said at this time is that the intermediary is not based in Iraq; he goes over for delicate negotiating sessions in the Bush administration’s name with Baath guerrilla leaders, militia commanders and heads of the great Sunni Muslim tribes and clans. At all times, he is in direct communication with the White House.\nThe only three Americans in Iraq privy to this negotiating track are Robert Blackwill, the president’s senior adviser on Iraq, US ambassador John Negroponte who is not personally involved, and the commander of American forces in Iraq, General David Casey, who is in charge of security arrangements and any changes on the ground arising from progress in the talks.  The only two Iraqis kept informed are prime minister Iyad Allawi and deputy prime minister for security Salih Barham.\nDEBKAfile adds: the negotiating track began with a preliminary condition: Baath and Sunni leaders must undertake to disengage from al Qaeda and other foreign Arab fighters.\nStill think that we’re on the side of freedom and democracy in Iraq?  I don’t think so.  I’m not sure precisely what model George Bush and company are hoping to construct but they’re not even pretending to create a constitutional representative democracy, much less a true government by, of and for the people over there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-02T06:21:00+00:00"
}