{
  "url": "https://voxday.net/2004/08/31/sean-hannity-says-arf/",
  "scraped_at": "2025-12-19T20:43:15.720858",
  "title": "Sean Hannity says “arf”",
  "date_display": "August 31, 2004",
  "date_iso": "2004-08-31T07:11:00+00:00",
  "date_from_url": "2004-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gregg writes in:<br/></p><blockquote><p> <br>I am a student of human nature, and after seeing your article get top billing two weeks in a row on WND I thought I would catch Hannity today (I knew they read it).  He had Newt on as a guest, and they were both talking about how they disagree with the president on the 527 ban.  I started laughing my ass off; it was just as you said it would be:</br></p><p>“Oh, how glad I am that Rush et al agree with me on the unconstitutionality of the ban, now let’s see if they still support the treasonous candidate.”</p><p>They did, Vox, after admitting as much. I have read Catholic prophets, bud, but you are an intellectual prophet.<br/></p></blockquote><p>I don’t know about the prophet bit, it was simply the only logical conclusion.  I don’t think Sean Hannity would disavow the GOP if it announced it was banning the Lutheran, Methodist and Baptist churches and providing free prostitutes to all high-school students.  Because, after all, the Democrats would be worse, since they’d be offering <em>gay</em> prostitutes and banning the <em>Catholic</em> church.  And that’s why the Irish water poodle gets a chapter….<br/></p></div>",
  "content_text": "Gregg writes in:\nI am a student of human nature, and after seeing your article get top billing two weeks in a row on WND I thought I would catch Hannity today (I knew they read it).  He had Newt on as a guest, and they were both talking about how they disagree with the president on the 527 ban.  I started laughing my ass off; it was just as you said it would be:\n“Oh, how glad I am that Rush et al agree with me on the unconstitutionality of the ban, now let’s see if they still support the treasonous candidate.”\nThey did, Vox, after admitting as much. I have read Catholic prophets, bud, but you are an intellectual prophet.\nI don’t know about the prophet bit, it was simply the only logical conclusion.  I don’t think Sean Hannity would disavow the GOP if it announced it was banning the Lutheran, Methodist and Baptist churches and providing free prostitutes to all high-school students.  Because, after all, the Democrats would be worse, since they’d be offering\ngay\nprostitutes and banning the\nCatholic\nchurch.  And that’s why the Irish water poodle gets a chapter….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-31T06:11:00+00:00"
}