{
  "url": "https://voxday.net/2004/08/30/sec-of-defense-on-undeclared-war/",
  "scraped_at": "2025-12-19T20:43:10.228194",
  "title": "Sec. of Defense on the undeclared war",
  "date_display": "August 30, 2004",
  "date_iso": "2004-08-30T08:50:00+00:00",
  "date_from_url": "2004-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Secretary of State Donald Rumsfeld quoted in a US Department of Defense transcript of an interview conducted on June 30, 2004.<br/></p><blockquote><p> <br>SEC. RUMSFELD:  Oh, I do.  I think basically what we have is we’ve had over our history since World War II basically an idea that we were either in war or we were in peace and that we were in peacetime constraints.  And of course, <b>since we don’t have a declaration of war</b> and we’re not in World War III, all of those peacetime constraints and procedures and auditors and contract rules and competitive bidding, all of that pertains.  And the effect of it is that you end up in a war on terror, like we’re in, losing lives and yet you are still required to adhere to the rules of peacetime, because we don’t have gradations of between war and peace and therefore we need to find a way to live in this 21st century where threats can come at you from the shadows and from ungoverned areas in ways that are not predictable, as they were, for example, during World War II or during the Cold War, for that matter.<br/></br></p></blockquote><p>The matter is not up for debate. <a href=\"http://www.dod.mil/transcripts/2004/tr20040630-secdef0949.html\">It is settled</a>.  You cannot argue about Congressional authorizations being virtual declarations and whatnot when the Secretary of Defense himself announces that “we don’t have a declaration of war”.</p><p>Regardless of what you think of their merits, both the Iraqi War and the War on Terror are extra-Constitutional.<br/></p></div>",
  "content_text": "Secretary of State Donald Rumsfeld quoted in a US Department of Defense transcript of an interview conducted on June 30, 2004.\nSEC. RUMSFELD:  Oh, I do.  I think basically what we have is we’ve had over our history since World War II basically an idea that we were either in war or we were in peace and that we were in peacetime constraints.  And of course,\nsince we don’t have a declaration of war\nand we’re not in World War III, all of those peacetime constraints and procedures and auditors and contract rules and competitive bidding, all of that pertains.  And the effect of it is that you end up in a war on terror, like we’re in, losing lives and yet you are still required to adhere to the rules of peacetime, because we don’t have gradations of between war and peace and therefore we need to find a way to live in this 21st century where threats can come at you from the shadows and from ungoverned areas in ways that are not predictable, as they were, for example, during World War II or during the Cold War, for that matter.\nThe matter is not up for debate.\nIt is settled\n.  You cannot argue about Congressional authorizations being virtual declarations and whatnot when the Secretary of Defense himself announces that “we don’t have a declaration of war”.\nRegardless of what you think of their merits, both the Iraqi War and the War on Terror are extra-Constitutional.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-30T07:50:00+00:00"
}