{
  "url": "https://voxday.net/2004/08/09/speedy-sellou/",
  "scraped_at": "2025-12-19T20:39:58.595375",
  "title": "The speedy sellout",
  "date_display": "August 9, 2004",
  "date_iso": "2004-08-09T07:57:00+00:00",
  "date_from_url": "2004-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michelle Malkin advocates Newspeak:<br/></p><blockquote><p> <br>As for the term “concentration camps,” it is very misleading. It is true that many politicians and public officials, including President Roosevelt himself, used this term to describe the relocation centers. But it wasn’t until the liberation of the Nazi death camps beginning in 1945 that the phrase took on the popular meaning that it retains today–that is, places of barbaric cruelty and torture on the order of what the Jews and others suffered under Hitler. To compare American’s internment and relocation centers to the Third Reich’s extermination camps is to recklessly distort history and to trivialize the experience of Holocaust victims. Even the Commission acknowledged that, “the phrase ‘concentration camps’ summons up images and ideas which are inaccurate and unfair.”<br/></br></p></blockquote><p>Please, the term not only isn’t misleading at all, it is entirely accurate!  No one has ever claimed that the US WWII-era concentration camps – camps designed to concentrate a group of individuals ill-favored by the federal government – were labor and death camps such as Auschwitz.  But since Ms Malkin wants to convince us that these concentration camps were good, right and proper, it doesn’t serve her purpose to call these camps by their linguistically precise and historically accurate name.  It’s fitting that she should be so indifferent as to history, considering her inability to learn from it.</p><blockquote><p> <br>Historically, civil rights have often yielded to security in times of crisis. During the Civil War, Abraham Lincoln suspended habeas corpus, which enabled him to detain thousands of rebels and subversives without access to judges. In defying a Supreme Court order to restore habeas corpus, Lincoln refused to let “the government itself go to pieces” for the sake of a single law.<br/></br></p></blockquote><p>Order out of chaos.  There’s a new one.  Malkin is tearing down her own case here by appealing to the example of Lincoln.  Malkin may still be under the illusion that she values freedom, but she is simply attempting to rationalize the female instinct of <em> Sicherheit uber alles</em>.  This is why the Fascist Party made the women’s right to vote a priority in its manifesto.  Scare a woman enough, and she’ll enthusiastically embrace disarming the populace, martial law and death camps.</p><p>It’s always interesting to see a media whore transform into a big government whore.  The camera lovers just can’t seem to keep themselves from “growing”, as they call it in Washington.  Rush Limbaugh’s done it, but it took him years to devolve from a conservative into a Republican.  I don’t know if anyone keeps track of these things, but Ms Malkin may now hold the speed record.<br/></p></div>",
  "content_text": "Michelle Malkin advocates Newspeak:\nAs for the term “concentration camps,” it is very misleading. It is true that many politicians and public officials, including President Roosevelt himself, used this term to describe the relocation centers. But it wasn’t until the liberation of the Nazi death camps beginning in 1945 that the phrase took on the popular meaning that it retains today–that is, places of barbaric cruelty and torture on the order of what the Jews and others suffered under Hitler. To compare American’s internment and relocation centers to the Third Reich’s extermination camps is to recklessly distort history and to trivialize the experience of Holocaust victims. Even the Commission acknowledged that, “the phrase ‘concentration camps’ summons up images and ideas which are inaccurate and unfair.”\nPlease, the term not only isn’t misleading at all, it is entirely accurate!  No one has ever claimed that the US WWII-era concentration camps – camps designed to concentrate a group of individuals ill-favored by the federal government – were labor and death camps such as Auschwitz.  But since Ms Malkin wants to convince us that these concentration camps were good, right and proper, it doesn’t serve her purpose to call these camps by their linguistically precise and historically accurate name.  It’s fitting that she should be so indifferent as to history, considering her inability to learn from it.\nHistorically, civil rights have often yielded to security in times of crisis. During the Civil War, Abraham Lincoln suspended habeas corpus, which enabled him to detain thousands of rebels and subversives without access to judges. In defying a Supreme Court order to restore habeas corpus, Lincoln refused to let “the government itself go to pieces” for the sake of a single law.\nOrder out of chaos.  There’s a new one.  Malkin is tearing down her own case here by appealing to the example of Lincoln.  Malkin may still be under the illusion that she values freedom, but she is simply attempting to rationalize the female instinct of\nSicherheit uber alles\n.  This is why the Fascist Party made the women’s right to vote a priority in its manifesto.  Scare a woman enough, and she’ll enthusiastically embrace disarming the populace, martial law and death camps.\nIt’s always interesting to see a media whore transform into a big government whore.  The camera lovers just can’t seem to keep themselves from “growing”, as they call it in Washington.  Rush Limbaugh’s done it, but it took him years to devolve from a conservative into a Republican.  I don’t know if anyone keeps track of these things, but Ms Malkin may now hold the speed record.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-09T06:57:00+00:00"
}