{
  "url": "https://voxday.net/2004/08/01/sweet-home-alabama/",
  "scraped_at": "2025-12-19T20:38:55.992827",
  "title": "Sweet home Alabama",
  "date_display": "August 1, 2004",
  "date_iso": "2004-08-01T13:32:00+00:00",
  "date_from_url": "2004-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t it interesting that no matter what wrongdoing or incompetence is exposed, government employees never experience the consequences of their actions.  In Alabama, an IT employee responsible for confirming and documenting the misuse of government computers <a href=\"http://www.aldotwaste.com/\">was fired after he installed spywar</a>e on his supervisor’s computer which demonstrated that the supervisor spent 70 percent of his time playing solitaire and another 20 percent surfing the stock market.</p><p>(Actually, this supervisor sounds pretty harmless.  If all government employees would confine themselves to similar activities, we’d be in good shape.)</p><p>The IT guy installed the spyware only after first submitting several complaints about the supervisor’s activity.  Of course, government being government, the supervisor received a reprimand while the IT guy was terminated.  After all, they can hardly keep people around who insist on letting the taxpayers know on what their tax dollars are being spent, can they?</p><p>If you don’t mind a bit of a tangent, I’m reminded of Carroll Quigley’s prediction that technology will eventually even out the playing field between individual and state.  There is hope, always.  In twenty, fifty or one hundred years, when a single individual will be able to hold the mightiest national government hostage with a pocket nuclear device or nanotech weapon, even the most die-hard central statists may be forced to admit that a voluntary system of government is the only viable option.  Perhaps that will be the silver lining in the dark cloud of fifth-generation warfare.</p><p>For who will want to seize the reins of power if that is equivalent to painting a big red glowing target on your forehead.  Or, as is more likely to be the case, on your DNA.<br/></p></div>",
  "content_text": "Isn’t it interesting that no matter what wrongdoing or incompetence is exposed, government employees never experience the consequences of their actions.  In Alabama, an IT employee responsible for confirming and documenting the misuse of government computers\nwas fired after he installed spywar\ne on his supervisor’s computer which demonstrated that the supervisor spent 70 percent of his time playing solitaire and another 20 percent surfing the stock market.\n(Actually, this supervisor sounds pretty harmless.  If all government employees would confine themselves to similar activities, we’d be in good shape.)\nThe IT guy installed the spyware only after first submitting several complaints about the supervisor’s activity.  Of course, government being government, the supervisor received a reprimand while the IT guy was terminated.  After all, they can hardly keep people around who insist on letting the taxpayers know on what their tax dollars are being spent, can they?\nIf you don’t mind a bit of a tangent, I’m reminded of Carroll Quigley’s prediction that technology will eventually even out the playing field between individual and state.  There is hope, always.  In twenty, fifty or one hundred years, when a single individual will be able to hold the mightiest national government hostage with a pocket nuclear device or nanotech weapon, even the most die-hard central statists may be forced to admit that a voluntary system of government is the only viable option.  Perhaps that will be the silver lining in the dark cloud of fifth-generation warfare.\nFor who will want to seize the reins of power if that is equivalent to painting a big red glowing target on your forehead.  Or, as is more likely to be the case, on your DNA.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-01T12:32:00+00:00"
}