{
  "url": "https://voxday.net/2004/08/22/thoughtless-defense/",
  "scraped_at": "2025-12-19T20:42:07.764065",
  "title": "Thoughtless defense",
  "date_display": "August 22, 2004",
  "date_iso": "2004-08-22T07:37:00+00:00",
  "date_from_url": "2004-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hindrocket writes on Powerline:<br/></p><blockquote><p> <br>On our show this afternoon, Michelle referred admiringly to Deacon’s post. My sense is that she generally agrees <a href=\"http://www.powerlineblog.com/archives/007558.php\">with Deacon’s conclusion</a>, as do I. I would only add that it is easy for us to see, with hindsight, that there wasn’t much danger of a Japanese invasion of the West Coast. This wasn’t obvious in the aftermath of Pearl Harbor. And while there is no doubt that the vast majority of Japanese Americans were loyal, there is equally no doubt that some were not. It is impossible to know what injury to our war effort may have been prevented by the relocation. Having said that, I don’t think the evidence of danger was sufficient to justify the measures taken. But that is a judgment call on which reasonable minds can differ.<br/></br></p></blockquote><p>With all due respect to Hindrocket and Deacon, that’s a massive, stinking load of elephant dung worthy of a knowledge-free moral relativist at university.  It is not only obvious now, it was obvious at the time that there was ZERO danger of a Japanese invasion of the West Coast.  The facts and the actions of the US military at the time entirel support this.  Would Hindrocket also say that it was “a judgment call” to say that reasonable minds could differ on the possibility of a German invasion of the East Coast?</p><p>The Germans had 2,000 fewer ocean miles to cross.  The Kriegsmarine was of similar size to the Japanese Navy. (It may have lacked aircraft carriers, but its 1,170 U-boats alone could have landed more troops than Japan’s entire 176-ship Imperial navy)  And yet the notion is entirely absurd!  How much more ludicrous is the idea of a 5,500 mile trans-Pacific invasion?</p><p>The Germans couldn’t cross 21 miles of the English Channel with air equivalence.  The Allies required air supremacy and 4,600 ships to invade Normandy, on a French coastline that is not, as one of the Northern Alliance gang weirdly asserted last week, smaller than the American West Coast.  (France’s Atlantic coastline alone is 1875 miles compared to the 1359 miles of the American West Coast, and if we’re dealing in unlikely hypotheticals here, the Germans would also have had to worry about guarding against an invasion from the Mediterranean or the North Sea as well.  The entire French coastline is 3437 miles in all, 2.5 times larger than the American West Coast.)  An invasion isn’t a simple matter of landing troops, it’s also about arranging for supply, support and reinforcement, none of which was even remotely possible for Japan.</p><p>To highlight the absurdity of the pro-internment case, Germany was not only <a href=\"http://www.usmm.org/shipsunkdamaged.html\">far more active on the East Coast</a> – 27 merchant ships were sunk on the West Coast, compared to 397 on the East Coast Atlantic, Gulf, and Caribbean – but furthermore, as Japan was wholly dependent on raw materials imported by sea, any invasion would have been nothing but a large-scale suicide mission, with no possibility of reinforcement or supply, that would have instantly doomed the island empire.</p><p>One cannot be an expert on everything.  But any defense of internment based on the notion of genuine military danger to the United States of America requires a combination of logical failure and near-complete ignorance of military history and strategic realities.</p><p>In fact, if we were to accept this very poor reasoning, then Malkin and her ilk would be more than justified in calling for throwing out the Constitution and locking up every American of Arab descent or Islamic creed, as the danger from them and their nations of origin, however slight, is far more serious than that posed by the Nisei and Imperial Japan.  The fact that she denies any intent to make such a case only shows that she is either a) full of it, b) clueless, or c) disingenuous.</p><p>In any case, color me seriously unimpressed.  I’m a Powerline fan and I think they’re doing fantastic work on the ongoing rout that is the Kerry campaign v. Swift Vet clash, but I suspect they’ll look back on this apology for Ms Malkin’s absurd case with more than a little embarassment.<br/></p></div>",
  "content_text": "Hindrocket writes on Powerline:\nOn our show this afternoon, Michelle referred admiringly to Deacon’s post. My sense is that she generally agrees\nwith Deacon’s conclusion\n, as do I. I would only add that it is easy for us to see, with hindsight, that there wasn’t much danger of a Japanese invasion of the West Coast. This wasn’t obvious in the aftermath of Pearl Harbor. And while there is no doubt that the vast majority of Japanese Americans were loyal, there is equally no doubt that some were not. It is impossible to know what injury to our war effort may have been prevented by the relocation. Having said that, I don’t think the evidence of danger was sufficient to justify the measures taken. But that is a judgment call on which reasonable minds can differ.\nWith all due respect to Hindrocket and Deacon, that’s a massive, stinking load of elephant dung worthy of a knowledge-free moral relativist at university.  It is not only obvious now, it was obvious at the time that there was ZERO danger of a Japanese invasion of the West Coast.  The facts and the actions of the US military at the time entirel support this.  Would Hindrocket also say that it was “a judgment call” to say that reasonable minds could differ on the possibility of a German invasion of the East Coast?\nThe Germans had 2,000 fewer ocean miles to cross.  The Kriegsmarine was of similar size to the Japanese Navy. (It may have lacked aircraft carriers, but its 1,170 U-boats alone could have landed more troops than Japan’s entire 176-ship Imperial navy)  And yet the notion is entirely absurd!  How much more ludicrous is the idea of a 5,500 mile trans-Pacific invasion?\nThe Germans couldn’t cross 21 miles of the English Channel with air equivalence.  The Allies required air supremacy and 4,600 ships to invade Normandy, on a French coastline that is not, as one of the Northern Alliance gang weirdly asserted last week, smaller than the American West Coast.  (France’s Atlantic coastline alone is 1875 miles compared to the 1359 miles of the American West Coast, and if we’re dealing in unlikely hypotheticals here, the Germans would also have had to worry about guarding against an invasion from the Mediterranean or the North Sea as well.  The entire French coastline is 3437 miles in all, 2.5 times larger than the American West Coast.)  An invasion isn’t a simple matter of landing troops, it’s also about arranging for supply, support and reinforcement, none of which was even remotely possible for Japan.\nTo highlight the absurdity of the pro-internment case, Germany was not only\nfar more active on the East Coast\n– 27 merchant ships were sunk on the West Coast, compared to 397 on the East Coast Atlantic, Gulf, and Caribbean – but furthermore, as Japan was wholly dependent on raw materials imported by sea, any invasion would have been nothing but a large-scale suicide mission, with no possibility of reinforcement or supply, that would have instantly doomed the island empire.\nOne cannot be an expert on everything.  But any defense of internment based on the notion of genuine military danger to the United States of America requires a combination of logical failure and near-complete ignorance of military history and strategic realities.\nIn fact, if we were to accept this very poor reasoning, then Malkin and her ilk would be more than justified in calling for throwing out the Constitution and locking up every American of Arab descent or Islamic creed, as the danger from them and their nations of origin, however slight, is far more serious than that posed by the Nisei and Imperial Japan.  The fact that she denies any intent to make such a case only shows that she is either a) full of it, b) clueless, or c) disingenuous.\nIn any case, color me seriously unimpressed.  I’m a Powerline fan and I think they’re doing fantastic work on the ongoing rout that is the Kerry campaign v. Swift Vet clash, but I suspect they’ll look back on this apology for Ms Malkin’s absurd case with more than a little embarassment.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-22T06:37:00+00:00"
}