{
  "url": "https://voxday.net/2004/08/20/una-domanda-per-chi-sa-latina/",
  "scraped_at": "2025-12-19T20:41:51.249619",
  "title": "Una domanda, per chi sa latina",
  "date_display": "August 20, 2004",
  "date_iso": "2004-08-20T10:36:00+00:00",
  "date_from_url": "2004-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m looking for a good Latin term for “media whore”.  How does <em>Adlatus Prostostarus</em> strike you?  Got any better suggestions?  I spoke to the publisher, by the way, and they agreed that “Media Whores” was much more marketable than “History’s Lies”, although they say that their publicist would probably, and I quote, “have kittens.”</p><p>I pointed out that I’m the perfect man to write this book, since I have absolutely no desire to go on TV promoting it and I could not care less if Eric Alterman or Brave Sir William don’t want to be my best friend and invite me over for slumber parties.  So, we’ll see.  I’m already having a good time writing the first chapter, though.<br/></p><blockquote><p> <br>This second generation brought to the forefront men with chiseled jaws and names like porn stars, and bleached blondes with journalism-free backgrounds consisting of acting school diplomas and tasteful nude photographs.  This model quickly became de riguer for the local news format, which is now such a matter of rote that one cannot easily distinguish between the ABC affiliate’s newscast in Minneapolis and the CBS affiliate’s newscast in Albequrque.<br/></br></p></blockquote><p>Who was it that first hired Deborah Norville, by the way?  Anyone remember?  Was it CNN or CBS?  I’m also wondering when the media whore phenomenon really kicked off… sure, Barbara Walters was a precursor, but I’m thinking it really exploded with Clinton’s Lewinsky scandal, since you had all kinds of people going off and having to fill the void of an almost complete lack of information.<br/></p></div>",
  "content_text": "I’m looking for a good Latin term for “media whore”.  How does\nAdlatus Prostostarus\nstrike you?  Got any better suggestions?  I spoke to the publisher, by the way, and they agreed that “Media Whores” was much more marketable than “History’s Lies”, although they say that their publicist would probably, and I quote, “have kittens.”\nI pointed out that I’m the perfect man to write this book, since I have absolutely no desire to go on TV promoting it and I could not care less if Eric Alterman or Brave Sir William don’t want to be my best friend and invite me over for slumber parties.  So, we’ll see.  I’m already having a good time writing the first chapter, though.\nThis second generation brought to the forefront men with chiseled jaws and names like porn stars, and bleached blondes with journalism-free backgrounds consisting of acting school diplomas and tasteful nude photographs.  This model quickly became de riguer for the local news format, which is now such a matter of rote that one cannot easily distinguish between the ABC affiliate’s newscast in Minneapolis and the CBS affiliate’s newscast in Albequrque.\nWho was it that first hired Deborah Norville, by the way?  Anyone remember?  Was it CNN or CBS?  I’m also wondering when the media whore phenomenon really kicked off… sure, Barbara Walters was a precursor, but I’m thinking it really exploded with Clinton’s Lewinsky scandal, since you had all kinds of people going off and having to fill the void of an almost complete lack of information.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-20T09:36:00+00:00"
}