{
  "url": "https://voxday.net/2004/08/10/ursine-utterances/",
  "scraped_at": "2025-12-19T20:40:16.904779",
  "title": "Ursine utterances",
  "date_display": "August 10, 2004",
  "date_iso": "2004-08-10T13:05:00+00:00",
  "date_from_url": "2004-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Truth Laid Bear isn’t afraid to predict the future:<br/></p><blockquote><p> <br>I’m going to go on record and predict that the Swift Boat Veterans kerfuffle won’t just be a major negative for Kerry: <a href=\"http://www.truthlaidbear.com/archives/2004/08/08/kerrys_swift_demise.php#001331\">it will be a campaign-killer</a>. One thing that those of us who spend far too much time hyperanalyzing politics and world events tend to forget is that for the general public, stories like this are absorbed only as vague and general impressions.</br></p><p>Up until now, Kerry has gotten a pass on his Vietnam time: the general impression has been “He talks about it too much, but he was some kind of war hero back in Vietnam”. Now, there’s an alternate perspective: “Not only does he talk about it too much, but he’s actually a liar.” From the 10,000 foot view of the average voter, the Swifties don’t have to prove their case in a court of law for Kerry to take damage: they just have to throw a bit of doubt onto the lily-white image he’s portrayed thus far. In that, they’ve already succeeded.</p><p>But it’s not that bad: it’s actually much worse. The biggest problem for Kerry is that the Swifties’ attacks confirm what we really want to believe about him anyway. He’s been so damned annoying about his Vietnam record that we secretly want to think the worst of him, and now the Swifties have provided a rational basis for that gut-level irritation that Kerry inspires when he blathers on about his war record.<br/></p></blockquote><p>That’s my instinct too, but then, I’ve thought that Kerry was toast ever since the Massachusetts Supreme Court made homogamy an issue.  The inimitable strategerist Bush failed to take advantage of that, but he doesn’t need to do anything about this huge hole in the prow of the Kerry campaign.  Hitting a mine indeed.<br/></p></div>",
  "content_text": "The Truth Laid Bear isn’t afraid to predict the future:\nI’m going to go on record and predict that the Swift Boat Veterans kerfuffle won’t just be a major negative for Kerry:\nit will be a campaign-killer\n. One thing that those of us who spend far too much time hyperanalyzing politics and world events tend to forget is that for the general public, stories like this are absorbed only as vague and general impressions.\nUp until now, Kerry has gotten a pass on his Vietnam time: the general impression has been “He talks about it too much, but he was some kind of war hero back in Vietnam”. Now, there’s an alternate perspective: “Not only does he talk about it too much, but he’s actually a liar.” From the 10,000 foot view of the average voter, the Swifties don’t have to prove their case in a court of law for Kerry to take damage: they just have to throw a bit of doubt onto the lily-white image he’s portrayed thus far. In that, they’ve already succeeded.\nBut it’s not that bad: it’s actually much worse. The biggest problem for Kerry is that the Swifties’ attacks confirm what we really want to believe about him anyway. He’s been so damned annoying about his Vietnam record that we secretly want to think the worst of him, and now the Swifties have provided a rational basis for that gut-level irritation that Kerry inspires when he blathers on about his war record.\nThat’s my instinct too, but then, I’ve thought that Kerry was toast ever since the Massachusetts Supreme Court made homogamy an issue.  The inimitable strategerist Bush failed to take advantage of that, but he doesn’t need to do anything about this huge hole in the prow of the Kerry campaign.  Hitting a mine indeed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-10T12:05:00+00:00"
}