{
  "url": "https://voxday.net/2004/08/11/where-angels-fear-to-tread/",
  "scraped_at": "2025-12-19T20:40:29.744522",
  "title": "Where angels fear to tread",
  "date_display": "August 11, 2004",
  "date_iso": "2004-08-11T10:18:00+00:00",
  "date_from_url": "2004-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have nothing against Rebecca Hagelin, who is almost certainly a very nice woman, except for the fact that she titles her column “Heartbeat”, which with its cloying suggestion of just how much she cares about life, the universe and everything makes me want to set her hair on fire.  But the notion <a href=\"http://www.townhall.com/columnists/rebeccahagelin/rh20040811.shtml\">that this woman</a> should be discussing “what constitutes cool”, in any context, is as fundamentally wrong as your average liberal journalist even mentioning the word “economics”.</p><p>I am, beyond any shadow of a doubt, one of ten coolest nationally syndicated columnists at this particular juncture in the space-time continuum.*  This isn’t saying much – just look at the Creators lineup; ye cats! – and I take no pride in this, it is simply the inevitable result of my encyclopedic knowledge of Public Enemy, post-cyberpunk fiction and techno-industrial music.  And, of course, I ride the tank, which counts for something in shadowy, but significant circles.  But the concept of cool morphs so quickly that I would not even think to pontificate on the matter, as the notion of paying any attention whatsoever to what is current among the latest angst-laden posings of over-fed, hormone-enslaved adolescents appalls me.</p><p>Look to Rebecca, then, all you who would be cool!  Thus spake Vox.</p><p>*<em>I haven’t actually considered a top ten list of cool columnists.  Maybe we should do that.  I’ll have to give the matter some thought.  Goldberg’s got to be on the list, he’s got class clown all wrapped up.  Coulter too, just because she’ll bring the smokes.  Derbyshire?  Definitely.</em><br/></p></div>",
  "content_text": "I have nothing against Rebecca Hagelin, who is almost certainly a very nice woman, except for the fact that she titles her column “Heartbeat”, which with its cloying suggestion of just how much she cares about life, the universe and everything makes me want to set her hair on fire.  But the notion\nthat this woman\nshould be discussing “what constitutes cool”, in any context, is as fundamentally wrong as your average liberal journalist even mentioning the word “economics”.\nI am, beyond any shadow of a doubt, one of ten coolest nationally syndicated columnists at this particular juncture in the space-time continuum.*  This isn’t saying much – just look at the Creators lineup; ye cats! – and I take no pride in this, it is simply the inevitable result of my encyclopedic knowledge of Public Enemy, post-cyberpunk fiction and techno-industrial music.  And, of course, I ride the tank, which counts for something in shadowy, but significant circles.  But the concept of cool morphs so quickly that I would not even think to pontificate on the matter, as the notion of paying any attention whatsoever to what is current among the latest angst-laden posings of over-fed, hormone-enslaved adolescents appalls me.\nLook to Rebecca, then, all you who would be cool!  Thus spake Vox.\n*\nI haven’t actually considered a top ten list of cool columnists.  Maybe we should do that.  I’ll have to give the matter some thought.  Goldberg’s got to be on the list, he’s got class clown all wrapped up.  Coulter too, just because she’ll bring the smokes.  Derbyshire?  Definitely.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-11T09:18:00+00:00"
}