{
  "url": "https://voxday.net/2004/08/07/youre-going-to-get-what-you-deserve/",
  "scraped_at": "2025-12-19T20:39:45.761178",
  "title": "You’re going to get what you deserve",
  "date_display": "August 7, 2004",
  "date_iso": "2004-08-07T08:18:00+00:00",
  "date_from_url": "2004-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>MEXICO CITY – The US drugs czar has admitted that Washington’s anti-narcotics policy in Latin America has so far failed.</br></p><p>Mr John Walters, who heads the US Office of National Drug Control Policy, acknowledged that billions of dollars of investment over many years have failed to dent the flow of Latin American cocaine onto US streets, but he predicted progress would be seen soon.<br/></p></blockquote><p>It’s not working, so of course, efforts will be redoubled.  After almost 25 years of the War on Drugs, with nothing to show for it except hundreds of thousands of innocent people in jail and numerous American liberties destroyed, you’d think pro-drug war conservatives would consider pulling their heads out of their posteriors and wake up to how they’ve been helping destroy America.</p><p>“But what if we legalized drugs,” they gasp in horror.  “Surely the country will collapse in a maelstrom of crack whores and coke fiends!”  Well, Mr. Historical Ignoramus, seeing as how society and individual rights were in better shape back when the government was less powerful, rope was made of hemp and cocaine was legal, I don’t think we have a whole lot to fear, not from drugs, anyhow.</p><p>Using the power of the central state to control human behavior is always a mistake.  As with the Patriot Act, the War on Drugs was designed as a weapon to be used against the American people.  Don’t believe me?  Fine, email me your telephone number and I’ll phone in an anonymous tip about the meth lab in your garage.  Then you can discover firsthand just how well your Constitutional rights protect you.</p><p>Are you noticing a pattern here?  We must throw out the Constitution because the Japanese are going to invade across 5500 miles of ocean!  We must throw out the Constitution because Billy might smoke pot!  We must throw out the Constitution because someone might send money to their bank in the Caymans!  We must throw out the Constitution because someone is killing someone else in Iraq!  We must throw out the Constitution because someone blew up two buildings in New York!  We must throw out the Constitution because we need to promote economic growth!</p><p>Americans deserve precisely what they’re getting, which is to say a nation sans Constitution and individual rights.  Ben Franklin warned us from the start, but no, we knew better!  Things are different now, in this, the modern age.  Sure, there may have been conspiracies in Rome, Byzantium, China, Greece, France, Spain, Germany, Russia and every other state power in the history of the world, but you’d have to be a crazy wearer of tinfoil hats if you think anyone would conspire after power in America!  Why would anyone want to control the richest, most militarily powerful nation the world has ever known?</p><p>So, vote for Bush or vote for Kerry if you like, it makes no difference.  Truly, it doesn’t.  The die is cast and it has been for some time, probably since 1971 and Bretton Woods.  I’m voting Libertarian because I believe there is value in acts of defiance, and because it is better to grasp at the slimmest of slim chances than to lend my hand and my consent to the devastation.</p><p>Politicians like to say they’re bullish on America.  But odds are high that it’s those who short it that will reap the profits.  In forty years, when the United States abandons its sovereignty to become a state of the American Union, (as the Free Trade Area of the Americas will likely be known as it <a href=\"http://en.wikipedia.org/wiki/History_of_the_European_Union\">follows the model</a> of the European Economic Community), you will not be able to say that you weren’t warned.<br/></p></div>",
  "content_text": "MEXICO CITY – The US drugs czar has admitted that Washington’s anti-narcotics policy in Latin America has so far failed.\nMr John Walters, who heads the US Office of National Drug Control Policy, acknowledged that billions of dollars of investment over many years have failed to dent the flow of Latin American cocaine onto US streets, but he predicted progress would be seen soon.\nIt’s not working, so of course, efforts will be redoubled.  After almost 25 years of the War on Drugs, with nothing to show for it except hundreds of thousands of innocent people in jail and numerous American liberties destroyed, you’d think pro-drug war conservatives would consider pulling their heads out of their posteriors and wake up to how they’ve been helping destroy America.\n“But what if we legalized drugs,” they gasp in horror.  “Surely the country will collapse in a maelstrom of crack whores and coke fiends!”  Well, Mr. Historical Ignoramus, seeing as how society and individual rights were in better shape back when the government was less powerful, rope was made of hemp and cocaine was legal, I don’t think we have a whole lot to fear, not from drugs, anyhow.\nUsing the power of the central state to control human behavior is always a mistake.  As with the Patriot Act, the War on Drugs was designed as a weapon to be used against the American people.  Don’t believe me?  Fine, email me your telephone number and I’ll phone in an anonymous tip about the meth lab in your garage.  Then you can discover firsthand just how well your Constitutional rights protect you.\nAre you noticing a pattern here?  We must throw out the Constitution because the Japanese are going to invade across 5500 miles of ocean!  We must throw out the Constitution because Billy might smoke pot!  We must throw out the Constitution because someone might send money to their bank in the Caymans!  We must throw out the Constitution because someone is killing someone else in Iraq!  We must throw out the Constitution because someone blew up two buildings in New York!  We must throw out the Constitution because we need to promote economic growth!\nAmericans deserve precisely what they’re getting, which is to say a nation sans Constitution and individual rights.  Ben Franklin warned us from the start, but no, we knew better!  Things are different now, in this, the modern age.  Sure, there may have been conspiracies in Rome, Byzantium, China, Greece, France, Spain, Germany, Russia and every other state power in the history of the world, but you’d have to be a crazy wearer of tinfoil hats if you think anyone would conspire after power in America!  Why would anyone want to control the richest, most militarily powerful nation the world has ever known?\nSo, vote for Bush or vote for Kerry if you like, it makes no difference.  Truly, it doesn’t.  The die is cast and it has been for some time, probably since 1971 and Bretton Woods.  I’m voting Libertarian because I believe there is value in acts of defiance, and because it is better to grasp at the slimmest of slim chances than to lend my hand and my consent to the devastation.\nPoliticians like to say they’re bullish on America.  But odds are high that it’s those who short it that will reap the profits.  In forty years, when the United States abandons its sovereignty to become a state of the American Union, (as the Free Trade Area of the Americas will likely be known as it\nfollows the model\nof the European Economic Community), you will not be able to say that you weren’t warned.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-08-07T07:18:00+00:00"
}