{
  "url": "https://voxday.net/2016/02/03/a-dialogue-with-sanders-voter/",
  "scraped_at": "2025-12-17T17:44:28.562542",
  "title": "A dialogue with a Sanders voter",
  "date_display": "February 3, 2016",
  "date_iso": "2016-02-03T16:30:00+00:00",
  "date_from_url": "2016-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I can never decide whether it is more amusing or depressing that these are the sort of people who consider themselves to be better educated and more intelligent. Regardless, it is certainly ironic:</p><blockquote class=\"tr_bq\"><p> uraniumUmbra @bigbadelite<br> Not all are refugees. But the amount that are far outweigh those that aren’t.</br></p><p>Supreme Dark Lord @voxday<br> You have it completely backwards. The vast majority are not refugees.</br></p><p>uraniumUmbra @bigbadelite<br> Proof?</br></p><p>Supreme Dark Lord @voxday<br> You made a false and baseless claim. Now you want proof? You’re a moron.</br></p><p>uraniumUmbra @bigbadelite<br> You made a baseless claim then say I’m the one at fault.</br></p><p>Supreme Dark Lord @voxday<br> You made a totally false claim with zero support. You are wrong.</br></p><p>uraniumUmbra @bigbadelite<br> Well where the fuck is your proof? I’m open to being proven wrong</br></p><p>Supreme Dark Lord @voxday<br> You are wrong, you moron. You’ll get as much “proof” as you cited.</br></p><p>uraniumUmbra @bigbadelite<br> You offered no support either. I guess we are both wrong.</br></p><p>Supreme Dark Lord ‏@voxday<br> See, that’s why you are a moron. One of us HAS to be right. You’re not.</br></p><p>uraniumUmbra @bigbadelite<br> Then prove I’m not. This is why you’re a hypocrite.</br></p><p>uraniumUmbra @bigbadelite<br> If lack of a cited source makes me wrong then same standard to you.</br></p><p>Supreme Dark Lord @voxday<br> It’s not the lack of a cited source that makes your claim wrong. Idiot.</br></p><p>uraniumUmbra @bigbadelite<br> Most are running from ISIS. And until Vox here proves me wrong I stand by my claim.</br></p><p>Space Bunnyopoulos @Spacebunnyday<br> Standing by your baseless and demonstrably wrong claim just makes you an idiot.</br></p></blockquote><p>What I find fascinating about this exchange is the way in which UrineShadow or whatever his name is observably does not understand the concept of objective reality. And basic logic, specifically, the law of non-contradiction, is also beyond him.</p><p>He doesn’t understand that due to the<i> principium tertii exclusi</i>, one of us has to be correct. Either most of the migrants are refugees or most of them are not refugees. The ability or inability of either of us to prove the case is totally irrelevant with regards to who is correct; the facts are what they are because the nature of the refugees is not dictated by our perception, definition, or knowledge of them.<br> <i><br/></i><br> But that<i> </i>is not the only problem. Note his accusation of hypocrisy, when in fact he is the only hypocrite here, demanding proof despite providing none in his original assertion. This is further proof of the Third Law of SJW: SJWs always project.</br></br></p><p>Contra the dictum of Saint Hitch, who was a witty man, but no logician, that which is asserted without proof cannot reasonably be dismissed without proof. For it is not proof, or evidence, or sources that matter, but truth, which is to say, a subjective opinion that is in line with observable objective reality.</p><p>The ability, or the willingness, to <i>demonstrate </i>this harmony is irrelevant with regards to the simple fact of its existence.</p></div>",
  "content_text": "I can never decide whether it is more amusing or depressing that these are the sort of people who consider themselves to be better educated and more intelligent. Regardless, it is certainly ironic:\nuraniumUmbra @bigbadelite\nNot all are refugees. But the amount that are far outweigh those that aren’t.\nSupreme Dark Lord @voxday\nYou have it completely backwards. The vast majority are not refugees.\nuraniumUmbra @bigbadelite\nProof?\nSupreme Dark Lord @voxday\nYou made a false and baseless claim. Now you want proof? You’re a moron.\nuraniumUmbra @bigbadelite\nYou made a baseless claim then say I’m the one at fault.\nSupreme Dark Lord @voxday\nYou made a totally false claim with zero support. You are wrong.\nuraniumUmbra @bigbadelite\nWell where the fuck is your proof? I’m open to being proven wrong\nSupreme Dark Lord @voxday\nYou are wrong, you moron. You’ll get as much “proof” as you cited.\nuraniumUmbra @bigbadelite\nYou offered no support either. I guess we are both wrong.\nSupreme Dark Lord ‏@voxday\nSee, that’s why you are a moron. One of us HAS to be right. You’re not.\nuraniumUmbra @bigbadelite\nThen prove I’m not. This is why you’re a hypocrite.\nuraniumUmbra @bigbadelite\nIf lack of a cited source makes me wrong then same standard to you.\nSupreme Dark Lord @voxday\nIt’s not the lack of a cited source that makes your claim wrong. Idiot.\nuraniumUmbra @bigbadelite\nMost are running from ISIS. And until Vox here proves me wrong I stand by my claim.\nSpace Bunnyopoulos @Spacebunnyday\nStanding by your baseless and demonstrably wrong claim just makes you an idiot.\nWhat I find fascinating about this exchange is the way in which UrineShadow or whatever his name is observably does not understand the concept of objective reality. And basic logic, specifically, the law of non-contradiction, is also beyond him.\nHe doesn’t understand that due to the\nprincipium tertii exclusi\n, one of us has to be correct. Either most of the migrants are refugees or most of them are not refugees. The ability or inability of either of us to prove the case is totally irrelevant with regards to who is correct; the facts are what they are because the nature of the refugees is not dictated by our perception, definition, or knowledge of them.\nBut that\nis not the only problem. Note his accusation of hypocrisy, when in fact he is the only hypocrite here, demanding proof despite providing none in his original assertion. This is further proof of the Third Law of SJW: SJWs always project.\nContra the dictum of Saint Hitch, who was a witty man, but no logician, that which is asserted without proof cannot reasonably be dismissed without proof. For it is not proof, or evidence, or sources that matter, but truth, which is to say, a subjective opinion that is in line with observable objective reality.\nThe ability, or the willingness, to\ndemonstrate\nthis harmony is irrelevant with regards to the simple fact of its existence.",
  "tags": [
    "debate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-03T16:30:00+00:00"
}