{
  "url": "https://voxday.net/2016/02/22/a-lesson-in-combined-arms/",
  "scraped_at": "2025-12-17T17:46:55.718634",
  "title": "A lesson in combined arms",
  "date_display": "February 22, 2016",
  "date_iso": "2016-02-22T13:00:00+00:00",
  "date_from_url": "2016-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ender and I haven’t been able to get back to <i>Fifth Frontier War</i> lately, but we did find the time to break out a short <i>Advanced Squad Leader: Starter Ki</i>t scenario, <i>S23: Monty’s Gamble</i>. Ender is just learning how to use vehicles, and in this scenario, he learned a rather painful lesson concerning why tank commanders always insist on having an infantry screen when engaging enemy infantry.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://3.bp.blogspot.com/-C7KwiLKgLBk/VsruofICU1I/AAAAAAAABxg/IDq7aGkubBM/s1600/ASL_S23.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"468\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/02/ASL_S23.jpg\" width=\"640\"/></a></div><p> The scenario is set in 1944 Holland, with a German Kampfgruppe counterattacking the British 1st Airbourne Division after the seizure of the city of Arnhem as part of Operation Market Garden. The British were attempting to hold out long enough to permit 30 Corps to reach Arnhem and reinforce them, while the Germans were hoping to cut them off from the Rhine and capture the entire division.</p><p>Interestingly enough, this scenario played out rather similarly to the historical event, where the Staffordshire regiment managed to hold off the Germans long enough to let the greater part of the 1st Airbourne to extricate itself and retreat. The Germans are attacking from the east and their objective is to exit a sufficient number of victory points (two tanks and two infantry units are enough) off the west side of the map. The British units are all set up hidden, and I’d chosen to present a false forward defense in the north while putting all of my anti-tank defenses in the middle and south. I figured that if a tank went the north route, I’d have time to turn my rear anti-tank gun and take a shot at its weak side armor before it exited.</p><p>However, Ender took me off-guard by deciding to race his first tank straight past the town using the north road. There was nothing I could do about that, so he had 7 of the 17 VP required right there. I thought that might have been a scouting move, but then he tried to run his second tank through the middle; I held my fire with the first anti-tank gun and blew it up with the second one when it came adjacent.</p><p>That made him a little more cautious, but not enough. The last tank was already following the previous one on the middle road and it managed to avoid being brewed up by the first gun, but when it turned up the road to avoid the second one, it took a PIAT up the tailpipe. Then, to make matters considerably worse for the Germans, thinking the northern route was clear, Ender moved an entire platoon, led by his best leader, adjacent to my single squad in forward defense. The paratroopers popped up, killed the leader, and broke the entire platoon.</p><p>That essentially ended the game on the first turn; although it is theoretically possible for his second platoon to fight its way past my guns and other infantry units, they can’t do that and go north to relieve the pressure my one squad will keep on the broken platoon to prevent them from rallying at the same time. We’ll play one more turn, just in case, but I’ll be very surprised if the second platoon even manages to cross the road, let alone the map.</p><p>Ender was more rueful than chagrined; now that he understands the concept of an infantry screen, I very much doubt he’ll ever make that particular mistake again. And now that I’ve taken full advantage of that specific gap in his knowledge, I can let him watch the <i>Band of Brothers</i> episode where the British tank commander makes the spectacularly unwise decision to ignore the advice given by the American infantry screening his tanks.</p></div>",
  "content_text": "Ender and I haven’t been able to get back to\nFifth Frontier War\nlately, but we did find the time to break out a short\nAdvanced Squad Leader: Starter Ki\nt scenario,\nS23: Monty’s Gamble\n. Ender is just learning how to use vehicles, and in this scenario, he learned a rather painful lesson concerning why tank commanders always insist on having an infantry screen when engaging enemy infantry.\nThe scenario is set in 1944 Holland, with a German Kampfgruppe counterattacking the British 1st Airbourne Division after the seizure of the city of Arnhem as part of Operation Market Garden. The British were attempting to hold out long enough to permit 30 Corps to reach Arnhem and reinforce them, while the Germans were hoping to cut them off from the Rhine and capture the entire division.\nInterestingly enough, this scenario played out rather similarly to the historical event, where the Staffordshire regiment managed to hold off the Germans long enough to let the greater part of the 1st Airbourne to extricate itself and retreat. The Germans are attacking from the east and their objective is to exit a sufficient number of victory points (two tanks and two infantry units are enough) off the west side of the map. The British units are all set up hidden, and I’d chosen to present a false forward defense in the north while putting all of my anti-tank defenses in the middle and south. I figured that if a tank went the north route, I’d have time to turn my rear anti-tank gun and take a shot at its weak side armor before it exited.\nHowever, Ender took me off-guard by deciding to race his first tank straight past the town using the north road. There was nothing I could do about that, so he had 7 of the 17 VP required right there. I thought that might have been a scouting move, but then he tried to run his second tank through the middle; I held my fire with the first anti-tank gun and blew it up with the second one when it came adjacent.\nThat made him a little more cautious, but not enough. The last tank was already following the previous one on the middle road and it managed to avoid being brewed up by the first gun, but when it turned up the road to avoid the second one, it took a PIAT up the tailpipe. Then, to make matters considerably worse for the Germans, thinking the northern route was clear, Ender moved an entire platoon, led by his best leader, adjacent to my single squad in forward defense. The paratroopers popped up, killed the leader, and broke the entire platoon.\nThat essentially ended the game on the first turn; although it is theoretically possible for his second platoon to fight its way past my guns and other infantry units, they can’t do that and go north to relieve the pressure my one squad will keep on the broken platoon to prevent them from rallying at the same time. We’ll play one more turn, just in case, but I’ll be very surprised if the second platoon even manages to cross the road, let alone the map.\nEnder was more rueful than chagrined; now that he understands the concept of an infantry screen, I very much doubt he’ll ever make that particular mistake again. And now that I’ve taken full advantage of that specific gap in his knowledge, I can let him watch the\nBand of Brothers\nepisode where the British tank commander makes the spectacularly unwise decision to ignore the advice given by the American infantry screening his tanks.",
  "tags": [
    "games",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-22T13:00:00+00:00"
}