{
  "url": "https://voxday.net/2016/02/05/an-sjw-has-poin/",
  "scraped_at": "2025-12-17T17:44:45.027028",
  "title": "An SJW has a point",
  "date_display": "February 5, 2016",
  "date_iso": "2016-02-05T18:38:00+00:00",
  "date_from_url": "2016-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s time to fork OSS. Not just one project, the entire community needs to be forked so we can let the SJWs see if they can develop software by doing nothing but policing one another’s behavior. After all, we’re told that this is the most important part of software development.</p><p>Storm Henry ‏@hnrysmth<br> I see the Gamergate people getting more involved in this CoC debate and I see the dev community members welcoming &amp; signal boosting them</br></p><p>Storm Henry ‏@hnrysmth<br> I want to make it super clear how messed up this is. When that circus comes to town bad things happen.</br></p><p>Storm Henry ‏@hnrysmth<br> I also see developers, especially in the PHP<br> community, who are just openly Gamergaters on their main accounts under<br> their real names</br></br></br></p><p>Storm Henry ‏@hnrysmth<br> Defo wanna see consequences for the guys<br> bringing GG into the OSS community. Wanna see some Lanyrd speaker<br> profiles abruptly stop at 2015.</br></br></br></p><p>Storm Henry ‏@hnrysmt<br> an easy thing you can personally do to help if you’re a developer is unfollow/block the guys who you know are buddying up with gamergate etc</br></p><p>Storm Henry ‏@hnrysmt <br> precedent needs to be set: you can have full access to the OSS<br> community, or you can chill with the organised harassment community. not<br> both</br></br></br></p><p>Supreme Dark Lord ‏@voxday<br> You’re absolutely right. It’s time to fork the entire OSS community.</br></p></div>",
  "content_text": "It’s time to fork OSS. Not just one project, the entire community needs to be forked so we can let the SJWs see if they can develop software by doing nothing but policing one another’s behavior. After all, we’re told that this is the most important part of software development.\nStorm Henry ‏@hnrysmth\nI see the Gamergate people getting more involved in this CoC debate and I see the dev community members welcoming & signal boosting them\nStorm Henry ‏@hnrysmth\nI want to make it super clear how messed up this is. When that circus comes to town bad things happen.\nStorm Henry ‏@hnrysmth\nI also see developers, especially in the PHP\ncommunity, who are just openly Gamergaters on their main accounts under\ntheir real names\nStorm Henry ‏@hnrysmth\nDefo wanna see consequences for the guys\nbringing GG into the OSS community. Wanna see some Lanyrd speaker\nprofiles abruptly stop at 2015.\nStorm Henry ‏@hnrysmt\nan easy thing you can personally do to help if you’re a developer is unfollow/block the guys who you know are buddying up with gamergate etc\nStorm Henry ‏@hnrysmt\nprecedent needs to be set: you can have full access to the OSS\ncommunity, or you can chill with the organised harassment community. not\nboth\nSupreme Dark Lord ‏@voxday\nYou’re absolutely right. It’s time to fork the entire OSS community.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-05T18:38:00+00:00"
}