{
  "url": "https://voxday.net/2016/02/21/burning-down-house/",
  "scraped_at": "2025-12-17T17:46:52.046439",
  "title": "Burning down the house",
  "date_display": "February 21, 2016",
  "date_iso": "2016-02-21T22:00:00+00:00",
  "date_from_url": "2016-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If the German authorities don’t stop aiding and abetting the invasion, I suspect they’re going to start finding themselves locked in the buildings before they are <a href=\"http://www.mirror.co.uk/news/world-news/crowd-cheers-germany-migrant-hostel-7413632\">set on fire</a>:</p><blockquote class=\"tr_bq\"><p> A crowd is reported to have cheered as a building designated to house migrants in Germany was burnt out in a suspected arson.</p><p>The blaze in the town of Bautzen early this morning caused serious damage to the former hotel which was being converted.</p><p>Cops claim onlookers tried to prevent firefighters from tackling the blaze.</p><p>Officers said members of the crowd took “unashamed delight” in watching the fire.</p><p>Two drunken men were arrested after they refused to leave the scene, the BBC reports.</p><p>The converted hotel was supposed to house 300 migrants…. In a further sign of anti-migrant sentiment, police in the Brandenburg<br> region are investigating the distribution of leaflets urging “absolute<br> resistance” against “foreigner invasion”.</br></br></p></blockquote><p>If the government won’t resist foreign invasion, then the people have no choice but to do it themselves. The arsonists aren’t the criminals, the quisling authorities are.</p><p>Nationalists who burn down migrant hostels are no more guilty of committing any crime than a combat engineer who blows up a bridge or a vehicle with a suspected IED.</p></div>",
  "content_text": "If the German authorities don’t stop aiding and abetting the invasion, I suspect they’re going to start finding themselves locked in the buildings before they are\nset on fire\n:\nA crowd is reported to have cheered as a building designated to house migrants in Germany was burnt out in a suspected arson.\nThe blaze in the town of Bautzen early this morning caused serious damage to the former hotel which was being converted.\nCops claim onlookers tried to prevent firefighters from tackling the blaze.\nOfficers said members of the crowd took “unashamed delight” in watching the fire.\nTwo drunken men were arrested after they refused to leave the scene, the BBC reports.\nThe converted hotel was supposed to house 300 migrants…. In a further sign of anti-migrant sentiment, police in the Brandenburg\nregion are investigating the distribution of leaflets urging “absolute\nresistance” against “foreigner invasion”.\nIf the government won’t resist foreign invasion, then the people have no choice but to do it themselves. The arsonists aren’t the criminals, the quisling authorities are.\nNationalists who burn down migrant hostels are no more guilty of committing any crime than a combat engineer who blows up a bridge or a vehicle with a suspected IED.",
  "tags": [
    "EU",
    "immigration",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-21T22:00:00+00:00"
}