{
  "url": "https://voxday.net/2016/02/04/confessions-of-sociopa/",
  "scraped_at": "2025-12-17T17:44:37.329578",
  "title": "Confessions of a sociopath",
  "date_display": "February 4, 2016",
  "date_iso": "2016-02-04T20:20:00+00:00",
  "date_from_url": "2016-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Either John Scalzi gets a little forgetful when he’s virtue-signaling or he is even more openly sociopathic than his stone cold “give no fucks” mentality would indicate:</p><blockquote class=\"tr_bq\"><p> John Scalzi Verified account ‏@scalzi <a href=\"https://twitter.com/scalzi/status/695312986714546176\">4 February 2016</a><br> Related, writing something that shows you’re a horrible person and then proclaiming “it’s satire!” neither makes it satire or excuses you.</br></p></blockquote><p>Apparently this is neither satire nor excusable:</p><blockquote class=\"tr_bq\"><p> “I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.” – John Scalzi, <a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">25 October 2012</a> </p></blockquote><p>So, which is it, Johnny? Are you a rapist? Or is it satire?</p></div>",
  "content_text": "Either John Scalzi gets a little forgetful when he’s virtue-signaling or he is even more openly sociopathic than his stone cold “give no fucks” mentality would indicate:\nJohn Scalzi Verified account ‏@scalzi\n4 February 2016\nRelated, writing something that shows you’re a horrible person and then proclaiming “it’s satire!” neither makes it satire or excuses you.\nApparently this is neither satire nor excusable:\n“I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.” – John Scalzi,\n25 October 2012\nSo, which is it, Johnny? Are you a rapist? Or is it satire?",
  "tags": [
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-04T20:20:00+00:00"
}