{
  "url": "https://voxday.net/2016/02/23/donald-trump-democratic-socialis/",
  "scraped_at": "2025-12-17T17:47:02.189214",
  "title": "Donald Trump: democratic socialist",
  "date_display": "February 23, 2016",
  "date_iso": "2016-02-23T09:15:00+00:00",
  "date_from_url": "2016-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I said before, Sarah’s take on these things <a href=\"http://accordingtohoyt.com/2016/02/21/the-carol-of-the-bells-a-blast-from-the-past-2202014/\">is always amusing</a>:</p><blockquote class=\"tr_bq\"><p> The<br> blogger has never understood the difference between European right and<br> American right.  Not stupid but strangely culturally blind — and<br> COMPLETELY misunderstood it. I mean, amazingly, bizarrely misunderstood.</br></br></br></p></blockquote><p>What I find funny about this is that Sarah goes on and on and on about how no one can<br> possibly understand Europe, or European politics, except her (because<br> poor village in Portugal), when the easily confirmed fact of the matter<br> is that she doesn’t even understand <i>what America is</i>. And her logic is amusingly specious: she understands the danger that Donald Trump poses to America better than everyone else <i>because Portugal</i>.</br></br></br></p><p>Do you see what I mean about immigrants? They don’t even understand how their basic perspective is intrinsically foreign. They are fish wondering what this water of which you speak might be.</p><p>Now, she is right about one thing. I will not be Portuguese or Italian or German no matter how long I live in Europe. Here, you can move from a neighboring village that is a 10-minute walk away and you will always be <i>stranieri </i>to the locals. But what Sarah fails to understand is that she is no more American than I am Portuguese. She is a US resident, perhaps even a US citizen, but she is not an American. America is not an idea. America is not a concept. America is not a proposition nation. One cannot, contra her past assertions, become a genuine American just because one happens to believe one thinks a certain way.</p><p>Now, an immigrant may have a recognizably American spirit, just as it is possible for an American expat to have an Italian spirit, a Swiss spirit, a French spirit, or a Portuguese spirit, and even to have it recognized by the natives as such. But that does not make one any more an American than it makes one Italian, Swiss, French, or Portuguese.</p><p>The notion that America is nothing more than an idea is a modern one, <a href=\"http://www.barrypopik.com/index.php/new_york_city/entry/america_is_the_first_nation_in_history_founded_on_an_idea\">a 20th century invention</a>, and a fiction which immigration advocates hell-bent on replacing Americans with immigrants like Sarah herself, advocates such as George W. Bush and Barack Obama, have repeatedly attempted to sell to the public. Had she read <i>Cuckservative</i>, she would know this. Even the famous “melting pot” to which many so often appeal is a romantic 19th century invention of a Russian Jew who lived in Britain. It has nothing to do with America, Americans, or American history.</p><p>And<br> the fact is that I know the difference between the European right and<br> the American right much, much better than she does. I even happen to be acquainted with some of the various players on both sides of the<br> Atlantic.</br></br></br></p><p>As for Donald Trump being a Democrat and a<br> socialist, well, I can testify that he was not only at the Republican National Convention in New Orleans in 1988, but he sat right behind me in George H.W. Bush’s personal suite the night Bush<br> accepted the Republican nomination. He even apologized to me for nearly putting his shoe on my shoulder when he crossed his legs.</br></br></p><p>I doubt Sarah realizes how few of the<br> major players on either side of the aisle actually care in the slightest about their party’s platforms or official ideologies; they are in the political game for power and money. Trump<br> is no more a socialist than the self-styled “Houston Mafia” that surrounded Bush the Elder were; he doesn’t have any more ideological bones in his body than did<br> Bush ’41 or Bush ’43. Sarah talks about Trump’s connections to the Clintons, but what she doesn’t grasp is that the entire corporate-political elite is connected. Bill Clinton is closer to the Bush family than he is to Trump; in fact, it’s entirely possible that Trump’s connection to both Clintons is through the Bush family.</br></br></br></p><p>Is Trump going to govern like Obama? Or like the Bushes? Perhaps in many ways, but unlike the other Republican candidates, that is unlikely in regards to the only issue that matters at the moment: immigration. Trump is the only one talking about a wall, talking about stopping Muslim immigration, and even talking about deportations. And that, I strongly suspect, is the real fear of Trump opponents like Sarah. It’s not that they think he will govern like Obama on immigration and the American national interest, but they fear that he won’t.</p><p>That is why Trump is the only candidate who is worth supporting in 2016, despite being a member of the corporate-political elite, because he is an unpredictable rogue member of it and the only one that might – MIGHT – make a positive difference in the near future in the American national interest. Of course, he also may well not, but we already know beyond any shadow of a doubt that none of the other candidates are worth a damn.</p><p>He isn’t an ideal candidate, he probably isn’t even a good candidate, and he certainly isn’t a trustworthy candidate, but nevertheless, at this point, he is the only possible candidate.</p></div>",
  "content_text": "As I said before, Sarah’s take on these things\nis always amusing\n:\nThe\nblogger has never understood the difference between European right and\nAmerican right.  Not stupid but strangely culturally blind — and\nCOMPLETELY misunderstood it. I mean, amazingly, bizarrely misunderstood.\nWhat I find funny about this is that Sarah goes on and on and on about how no one can\npossibly understand Europe, or European politics, except her (because\npoor village in Portugal), when the easily confirmed fact of the matter\nis that she doesn’t even understand\nwhat America is\n. And her logic is amusingly specious: she understands the danger that Donald Trump poses to America better than everyone else\nbecause Portugal\n.\nDo you see what I mean about immigrants? They don’t even understand how their basic perspective is intrinsically foreign. They are fish wondering what this water of which you speak might be.\nNow, she is right about one thing. I will not be Portuguese or Italian or German no matter how long I live in Europe. Here, you can move from a neighboring village that is a 10-minute walk away and you will always be\nstranieri\nto the locals. But what Sarah fails to understand is that she is no more American than I am Portuguese. She is a US resident, perhaps even a US citizen, but she is not an American. America is not an idea. America is not a concept. America is not a proposition nation. One cannot, contra her past assertions, become a genuine American just because one happens to believe one thinks a certain way.\nNow, an immigrant may have a recognizably American spirit, just as it is possible for an American expat to have an Italian spirit, a Swiss spirit, a French spirit, or a Portuguese spirit, and even to have it recognized by the natives as such. But that does not make one any more an American than it makes one Italian, Swiss, French, or Portuguese.\nThe notion that America is nothing more than an idea is a modern one,\na 20th century invention\n, and a fiction which immigration advocates hell-bent on replacing Americans with immigrants like Sarah herself, advocates such as George W. Bush and Barack Obama, have repeatedly attempted to sell to the public. Had she read\nCuckservative\n, she would know this. Even the famous “melting pot” to which many so often appeal is a romantic 19th century invention of a Russian Jew who lived in Britain. It has nothing to do with America, Americans, or American history.\nAnd\nthe fact is that I know the difference between the European right and\nthe American right much, much better than she does. I even happen to be acquainted with some of the various players on both sides of the\nAtlantic.\nAs for Donald Trump being a Democrat and a\nsocialist, well, I can testify that he was not only at the Republican National Convention in New Orleans in 1988, but he sat right behind me in George H.W. Bush’s personal suite the night Bush\naccepted the Republican nomination. He even apologized to me for nearly putting his shoe on my shoulder when he crossed his legs.\nI doubt Sarah realizes how few of the\nmajor players on either side of the aisle actually care in the slightest about their party’s platforms or official ideologies; they are in the political game for power and money. Trump\nis no more a socialist than the self-styled “Houston Mafia” that surrounded Bush the Elder were; he doesn’t have any more ideological bones in his body than did\nBush ’41 or Bush ’43. Sarah talks about Trump’s connections to the Clintons, but what she doesn’t grasp is that the entire corporate-political elite is connected. Bill Clinton is closer to the Bush family than he is to Trump; in fact, it’s entirely possible that Trump’s connection to both Clintons is through the Bush family.\nIs Trump going to govern like Obama? Or like the Bushes? Perhaps in many ways, but unlike the other Republican candidates, that is unlikely in regards to the only issue that matters at the moment: immigration. Trump is the only one talking about a wall, talking about stopping Muslim immigration, and even talking about deportations. And that, I strongly suspect, is the real fear of Trump opponents like Sarah. It’s not that they think he will govern like Obama on immigration and the American national interest, but they fear that he won’t.\nThat is why Trump is the only candidate who is worth supporting in 2016, despite being a member of the corporate-political elite, because he is an unpredictable rogue member of it and the only one that might – MIGHT – make a positive difference in the near future in the American national interest. Of course, he also may well not, but we already know beyond any shadow of a doubt that none of the other candidates are worth a damn.\nHe isn’t an ideal candidate, he probably isn’t even a good candidate, and he certainly isn’t a trustworthy candidate, but nevertheless, at this point, he is the only possible candidate.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-23T09:15:00+00:00"
}