{
  "url": "https://voxday.net/2016/02/23/hillarys-stalking-horse/",
  "scraped_at": "2025-12-17T17:47:07.308483",
  "title": "Hillary’s stalking horse?",
  "date_display": "February 23, 2016",
  "date_iso": "2016-02-23T23:04:00+00:00",
  "date_from_url": "2016-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If so, Donald Trump is doing <a href=\"http://www.salon.com/2016/02/23/donald_trump_declares_that_should_he_win_he_will_prosecute_hillary_clinton_because_she_seems_guilty/\">a very, very poor job</a> of it:</p><blockquote class=\"tr_bq\"><p> The Fox News-sponsored controversy over Hillary Clinton’s use of a<br> private email server will become another anti-Clinton national tragedy<br> if Donald Trump wins, the Republican front-runner told Fox News’ Sean<br> Hannity at a town hall Monday night.</br></br></br></p><p>Hannity<br> asked if Trump would order his attorney general to investigate Clinton<br> if he wins the White House in November, and Trump said he would “have no<br> choice,” because “in fairness, you have to look into that — she seems<br> guilty.”</br></br></br></br></p><p>He momentarily tried to walk his comment back, saying,<br> “but you know what, I wouldn’t even say that,” before saying what he<br> just said he wouldn’t say again. “But certainly, it has to be looked<br> at,” he said. Trump later added that “she’s being protected, but if I<br> win, certainly it’s something we’re going to look at.”</br></br></br></br></p></blockquote><p>Wheels within wheels, my friends. Wheels within wheels.This post also serves as an open thread to discuss <a href=\"http://edition.cnn.com/2016/02/23/politics/nevada-republican-caucus-results/index.html\">the Nevada Republican caucus</a> and its results.</p><blockquote class=\"tr_bq\"><p> In a state where only 33,000 of the state’s 400,000 GOP voters turned out to caucus in 2012—a mere 7%—the campaigns of Ted Cruz, Marco Rubio and one-time candidate Jeb Bush got organized early, snapping up talented operatives and key endorsements, while beginning caucus trainings last fall in the hopes that a strong organization could overcome Trump’s momentum.</p><p>But Trump appears to have steamrolled through all of that, dominating not just Nevada’s unreliable polls, but capturing the excitement and buzz in the race with his visits here. In interviews with dozens of Republican voters across the state over the last week, many said without hesitation that they were standing firmly with Trump and had given little thought to the other Republican candidates.</p></blockquote><p>It’s going to be interesting to hear the convoluted explanations of how winning three states in a row is the <i>certain death knell</i> of the Trump campaign.</p></div>",
  "content_text": "If so, Donald Trump is doing\na very, very poor job\nof it:\nThe Fox News-sponsored controversy over Hillary Clinton’s use of a\nprivate email server will become another anti-Clinton national tragedy\nif Donald Trump wins, the Republican front-runner told Fox News’ Sean\nHannity at a town hall Monday night.\nHannity\nasked if Trump would order his attorney general to investigate Clinton\nif he wins the White House in November, and Trump said he would “have no\nchoice,” because “in fairness, you have to look into that — she seems\nguilty.”\nHe momentarily tried to walk his comment back, saying,\n“but you know what, I wouldn’t even say that,” before saying what he\njust said he wouldn’t say again. “But certainly, it has to be looked\nat,” he said. Trump later added that “she’s being protected, but if I\nwin, certainly it’s something we’re going to look at.”\nWheels within wheels, my friends. Wheels within wheels.This post also serves as an open thread to discuss\nthe Nevada Republican caucus\nand its results.\nIn a state where only 33,000 of the state’s 400,000 GOP voters turned out to caucus in 2012—a mere 7%—the campaigns of Ted Cruz, Marco Rubio and one-time candidate Jeb Bush got organized early, snapping up talented operatives and key endorsements, while beginning caucus trainings last fall in the hopes that a strong organization could overcome Trump’s momentum.\nBut Trump appears to have steamrolled through all of that, dominating not just Nevada’s unreliable polls, but capturing the excitement and buzz in the race with his visits here. In interviews with dozens of Republican voters across the state over the last week, many said without hesitation that they were standing firmly with Trump and had given little thought to the other Republican candidates.\nIt’s going to be interesting to hear the convoluted explanations of how winning three states in a row is the\ncertain death knell\nof the Trump campaign.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-23T23:04:00+00:00"
}