{
  "url": "https://voxday.net/2016/02/13/literally-who-admits-defea/",
  "scraped_at": "2025-12-17T17:45:40.725234",
  "title": "Literally Who admits defeat",
  "date_display": "February 13, 2016",
  "date_iso": "2016-02-13T09:27:00+00:00",
  "date_from_url": "2016-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Ralph Retort <a href=\"http://theralphretort.com/zoe-quinn-is-a-fraud-and-so-is-the-media-that-enabled-her-2012016/\">takes a victory lap</a> as the first fraud of anti-GamerGate finally gives up:</p><blockquote class=\"tr_bq\"><p> In case you missed it, Zoe Quinn dropped the harassment charges against Eron Gjoni yesterday. It almost brings the long legal saga to an end for Mr. Gjoni, although my understanding is the appeal that was filed against Ms. Quinn’s gag order (Fall 2014 report) will continue. That’s good, because it’s important that we set precedent against this sort of thing happening again. There’s another problem that unfortunately won’t be settled by the courts, though, and that’s the trashy and unethical mainstream media. Honestly, I don’t mind the trashy part. It’s the lies that make my blood boil. I roll around in the dirt here fairly frequently, but I always tell you the truth as I know it at the time. That’s something that will never change. Our opponents on the other side can’t claim that with a straight face.</p><p>The mainstream media and the SJW blogosphere have no interest in the truth. They simply want to spin dishonest narratives and get paid for it…. She asked for the charges to be brought and she asked for them to be<br> dropped. It’s called “loss by forfeit,” you fucking idiots. The first<br> thing I thought after reading The Mary Sue post was: “<em>How stupid do you have to be to write something like that?</em>” Then, the second thing that ran through my mind was: <em>They aren’t stupid, that was just the best spin they could come up with.</em> Whatever the case may be, it’s asinine. Zoe lost, Eron won, and GamerGate gets the last laugh.</br></br></p><p>Still, we can’t fool ourselves completely. Ms. Quinn receives<br> thousands of dollars a month for doing absolutely nothing. She doesn’t<br> even pretend to make games anymore and has instead switched over to the<br> “online abuse” racket.</br></br></br></p></blockquote><p>As usual, the truth will out. Sometimes it just takes a while. And that’s why persistence is all that is required for ultimate victory, because SJWs Always Lie.</p></div>",
  "content_text": "The Ralph Retort\ntakes a victory lap\nas the first fraud of anti-GamerGate finally gives up:\nIn case you missed it, Zoe Quinn dropped the harassment charges against Eron Gjoni yesterday. It almost brings the long legal saga to an end for Mr. Gjoni, although my understanding is the appeal that was filed against Ms. Quinn’s gag order (Fall 2014 report) will continue. That’s good, because it’s important that we set precedent against this sort of thing happening again. There’s another problem that unfortunately won’t be settled by the courts, though, and that’s the trashy and unethical mainstream media. Honestly, I don’t mind the trashy part. It’s the lies that make my blood boil. I roll around in the dirt here fairly frequently, but I always tell you the truth as I know it at the time. That’s something that will never change. Our opponents on the other side can’t claim that with a straight face.\nThe mainstream media and the SJW blogosphere have no interest in the truth. They simply want to spin dishonest narratives and get paid for it…. She asked for the charges to be brought and she asked for them to be\ndropped. It’s called “loss by forfeit,” you fucking idiots. The first\nthing I thought after reading The Mary Sue post was: “\nHow stupid do you have to be to write something like that?\n” Then, the second thing that ran through my mind was:\nThey aren’t stupid, that was just the best spin they could come up with.\nWhatever the case may be, it’s asinine. Zoe lost, Eron won, and GamerGate gets the last laugh.\nStill, we can’t fool ourselves completely. Ms. Quinn receives\nthousands of dollars a month for doing absolutely nothing. She doesn’t\neven pretend to make games anymore and has instead switched over to the\n“online abuse” racket.\nAs usual, the truth will out. Sometimes it just takes a while. And that’s why persistence is all that is required for ultimate victory, because SJWs Always Lie.",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-13T09:27:00+00:00"
}