{
  "url": "https://voxday.net/2016/02/21/mailvox-why-turn-your-back-on/",
  "scraped_at": "2025-12-17T17:46:46.574090",
  "title": "Mailvox: why turn your back on conservatives",
  "date_display": "February 21, 2016",
  "date_iso": "2016-02-21T09:45:00+00:00",
  "date_from_url": "2016-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Doc Rampage doesn’t understand why I’m not courting conservatives in building a new social media alternative:</p><blockquote class=\"tr_bq\"><p> The words in parenthesis are not inherent characteristics of the group, but are prominent in the current environment.</p><p>    Left: envy, greed, (hatred)<br>     Conservatives: justice, propriety, (resentment)<br>     libertarians: pride, rationality<br>     Alt-right: clannishness, loyalty, (spite)</br></br></br></p><p>The Left is always talking egalitarian, but a Leftist never passes up a chance to get ahead of his fellows and they are always trying to create hierarchies with themselves on top. This is because they only want egalitarianism due to envy–they don’t want anyone to have an advantage they don’t have.</p><p>Everyone hates conservatives for being unreliable political partners. The reason is that their primary loyalty is not to a group but to abstract principles like justice, and they will follow their idea of justice even at the group’s expense, or even at their own expense.</p><p>Libertarians are drawn to their beliefs in large part because they think that starting on a completely level playing field, they would come out near the top. Many of them are right–they tend to be intelligent and well-educated. But their pride in their own ability makes them unable to sympathize with the fact that most people need social support of various kinds.</p><p>As to the alt-right, it is clannishness and spite that drives someone on the alt-right to capriciously insult conservatives in a message where they might instead be finding common ground and help in a common cause, driving them away instead of inviting them to help.</p></blockquote><p>It’s interesting to see how Doc Rampage’s observations are so perspicacious while his conclusions about the alt-right are so wrong. It’s not spite that causes me to turn my back on conservatives, but rather, the very conservative unreliability he points out that is why I have no interest in finding common ground with them. They are worse than useless; it would be a tremendous mistake to rely upon them <i>because they are unreliable</i>.</p><p>Moreover, as Red Eagle and I showed in <i>Cuckservative</i>, conservatives don’t actually have any principles. They think they do, but what they really have is an attitude; one can hardly call it a philosophy. That’s why conservatives are forever going on about who is “electable” or which candidate is “serious”; those are not the words of abstract thinkers who reject pragmatism in the name of principle.</p><p>Even their oft-proclaimed self-definitions are unreliable.</p><p>If there are conservatives who want to help because what I’m doing will better serve their abstract principles than the alternatives, that’s great, but I’m not going to depend upon their support because I don’t trust them one little bit. I will place my trust in those who have repeatedly shown they have my back, in those who will not bug out the first time they get called names by SJWs or decide they don’t completely approve of my every word or action.</p><p>What are the VFM? What are the Dread Ilk? Are they conservative? Are they libertarian? Are they alt-right? I neither know nor care. What I know is that they will be there when called. They will show up when needed. They are implacably opposed to my ideological enemies. And that’s all I need to know.</p><p>Conservapedia is a good demonstration of what a social media project that relies upon conservatives looks like.</p></div>",
  "content_text": "Doc Rampage doesn’t understand why I’m not courting conservatives in building a new social media alternative:\nThe words in parenthesis are not inherent characteristics of the group, but are prominent in the current environment.\nLeft: envy, greed, (hatred)\nConservatives: justice, propriety, (resentment)\nlibertarians: pride, rationality\nAlt-right: clannishness, loyalty, (spite)\nThe Left is always talking egalitarian, but a Leftist never passes up a chance to get ahead of his fellows and they are always trying to create hierarchies with themselves on top. This is because they only want egalitarianism due to envy–they don’t want anyone to have an advantage they don’t have.\nEveryone hates conservatives for being unreliable political partners. The reason is that their primary loyalty is not to a group but to abstract principles like justice, and they will follow their idea of justice even at the group’s expense, or even at their own expense.\nLibertarians are drawn to their beliefs in large part because they think that starting on a completely level playing field, they would come out near the top. Many of them are right–they tend to be intelligent and well-educated. But their pride in their own ability makes them unable to sympathize with the fact that most people need social support of various kinds.\nAs to the alt-right, it is clannishness and spite that drives someone on the alt-right to capriciously insult conservatives in a message where they might instead be finding common ground and help in a common cause, driving them away instead of inviting them to help.\nIt’s interesting to see how Doc Rampage’s observations are so perspicacious while his conclusions about the alt-right are so wrong. It’s not spite that causes me to turn my back on conservatives, but rather, the very conservative unreliability he points out that is why I have no interest in finding common ground with them. They are worse than useless; it would be a tremendous mistake to rely upon them\nbecause they are unreliable\n.\nMoreover, as Red Eagle and I showed in\nCuckservative\n, conservatives don’t actually have any principles. They think they do, but what they really have is an attitude; one can hardly call it a philosophy. That’s why conservatives are forever going on about who is “electable” or which candidate is “serious”; those are not the words of abstract thinkers who reject pragmatism in the name of principle.\nEven their oft-proclaimed self-definitions are unreliable.\nIf there are conservatives who want to help because what I’m doing will better serve their abstract principles than the alternatives, that’s great, but I’m not going to depend upon their support because I don’t trust them one little bit. I will place my trust in those who have repeatedly shown they have my back, in those who will not bug out the first time they get called names by SJWs or decide they don’t completely approve of my every word or action.\nWhat are the VFM? What are the Dread Ilk? Are they conservative? Are they libertarian? Are they alt-right? I neither know nor care. What I know is that they will be there when called. They will show up when needed. They are implacably opposed to my ideological enemies. And that’s all I need to know.\nConservapedia is a good demonstration of what a social media project that relies upon conservatives looks like.",
  "tags": [
    "politics",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-21T09:45:00+00:00"
}