{
  "url": "https://voxday.net/2016/02/04/mailvox-sjw-attacks/",
  "scraped_at": "2025-12-17T17:44:33.697559",
  "title": "Mailvox: SJW attacks",
  "date_display": "February 4, 2016",
  "date_iso": "2016-02-04T15:00:00+00:00",
  "date_from_url": "2016-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://archive.is/PMjh4\">This sort of thing</a> is precisely why I have been advising everyone to a) get the hell of Facebook, b) utilize anonymous callsigns when commenting, c) create alternative social media accounts, and d) practice sound operational security. The cultural war on social media only going to get worse as the SJWs, and perhaps even the cuckservatives, get more and more frantic about the growing popularity of the Alt-Right, the Mil-Right, and the nationalist Left:</p><blockquote class=\"tr_bq\"><p> I have a business page on Facebook, which I have used for collecting reviews and event promotion. This morning the following post was present on it. I went through the group of this particular SJW attacker, and he posted a picture of himself to gloat. He mentions you, Roosh, and Milo by name and is apparently trying to attack all of their Twitter followers.</p><p>If the other VFM could find out who this guy is and put pressure back on him, it may dissuade his efforts. I can’t imagine I’m the only one this guy has gone after.</p></blockquote><p>Needless to say, active and vigorous reprisals are in order. Get on it, VFM. See if you can beat the current record of 57 minutes to ID him.</p><p>SJWs always forget that the social media sword cuts both ways. One formerly mouthy gentleman stopped yapping the moment I sent him a link to the harassment reporting page of his organization, observed that he was very clearly in violation of several of the employee guidelines, and mentioned that if his attacks continued, I would be sending the archived links to his employer. He’s been very well-behaved since.</p><p>First, archive everything related to the attack at archive.today. Second, go through the links for all identifying information. Third, contact me and send me what you have; I will send it out to the VFM. Fourth, shut the hell up about slander, libel, suing, and the courts. You’re not going to do it in the USA because you won’t win, so stop posturing.  Fifth, learn the cyberstalking statutes in your state. Sixth, aim for antifragility.</p><p>Start nothing, finish everything.</p></div>",
  "content_text": "This sort of thing\nis precisely why I have been advising everyone to a) get the hell of Facebook, b) utilize anonymous callsigns when commenting, c) create alternative social media accounts, and d) practice sound operational security. The cultural war on social media only going to get worse as the SJWs, and perhaps even the cuckservatives, get more and more frantic about the growing popularity of the Alt-Right, the Mil-Right, and the nationalist Left:\nI have a business page on Facebook, which I have used for collecting reviews and event promotion. This morning the following post was present on it. I went through the group of this particular SJW attacker, and he posted a picture of himself to gloat. He mentions you, Roosh, and Milo by name and is apparently trying to attack all of their Twitter followers.\nIf the other VFM could find out who this guy is and put pressure back on him, it may dissuade his efforts. I can’t imagine I’m the only one this guy has gone after.\nNeedless to say, active and vigorous reprisals are in order. Get on it, VFM. See if you can beat the current record of 57 minutes to ID him.\nSJWs always forget that the social media sword cuts both ways. One formerly mouthy gentleman stopped yapping the moment I sent him a link to the harassment reporting page of his organization, observed that he was very clearly in violation of several of the employee guidelines, and mentioned that if his attacks continued, I would be sending the archived links to his employer. He’s been very well-behaved since.\nFirst, archive everything related to the attack at archive.today. Second, go through the links for all identifying information. Third, contact me and send me what you have; I will send it out to the VFM. Fourth, shut the hell up about slander, libel, suing, and the courts. You’re not going to do it in the USA because you won’t win, so stop posturing.  Fifth, learn the cyberstalking statutes in your state. Sixth, aim for antifragility.\nStart nothing, finish everything.",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-04T15:00:00+00:00"
}