{
  "url": "https://voxday.net/2016/02/18/matz-slaps-down-typhoid-coraline/",
  "scraped_at": "2025-12-17T17:46:24.616711",
  "title": "Matz slaps down Typhoid Coraline",
  "date_display": "February 18, 2016",
  "date_iso": "2016-02-18T23:29:00+00:00",
  "date_from_url": "2016-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The successful <a href=\"https://www.ruby-lang.org/en/conduct/\">defense of Ruby</a> against SJW infiltrators demonstrates the importance of having a strong project leader rather than a committee, or worse, a democracy, running an open source software project:</p><blockquote class=\"tr_bq\"><p> The Ruby Community Conduct Guideline</p><p>We have picked the following conduct guideline based on an early draft of the PostgreSQL CoC, for Ruby developers community for safe, productive collaboration. Each Ruby related community (conference etc.) may pick their own Code of Conduct.</p><p>This document provides community guidelines for a safe, respectful, productive, and collaborative place for any person who is willing to contribute to the Ruby community. It applies to all “collaborative space”, which is defined as community communications channels (such as mailing lists, submitted patches, commit comments, etc.).</p><ul><li>Participants will be tolerant of opposing views.</li><li>Participants must ensure that their language and actions are free of personal attacks and disparaging personal remarks.</li><li>When interpreting the words and actions of others, participants should always assume good intentions.</li><li>Behaviour which can be reasonably considered harassment will not be tolerated.</li></ul></blockquote><p>It’s worth noting that this not only defeats the primary, secondary, and tertiary purposes of the Code of Conduct that Typhoid Coraline was attempting to install in order to unseat Matz, but it can obviously be used effectively against SJW entryists.</p><p>No wonder Typhoid is so upset. It’s a superficial victory of absolutely no utility for him.</p><p>Coraline Ada Ehmke ‏@CoralineAda<br> This is very disappointing. No one to report abuse to. No recourse for victims of harassment. Poor showing, Ruby.</br></p><p>Coraline Ada Ehmke ‏@CoralineAda<br> Sad that Ruby still doesn’t have a code of conduct. I don’t know what to call that thing.</br></p><p>Coraline Ada Ehmke ‏@CoralineAda<br> Unfortunately I fear that it will take a nasty incident for Matz to change his mind<br> about a code of conduct. I feel bad about this.</br></br></p></div>",
  "content_text": "The successful\ndefense of Ruby\nagainst SJW infiltrators demonstrates the importance of having a strong project leader rather than a committee, or worse, a democracy, running an open source software project:\nThe Ruby Community Conduct Guideline\nWe have picked the following conduct guideline based on an early draft of the PostgreSQL CoC, for Ruby developers community for safe, productive collaboration. Each Ruby related community (conference etc.) may pick their own Code of Conduct.\nThis document provides community guidelines for a safe, respectful, productive, and collaborative place for any person who is willing to contribute to the Ruby community. It applies to all “collaborative space”, which is defined as community communications channels (such as mailing lists, submitted patches, commit comments, etc.).\nParticipants will be tolerant of opposing views.\nParticipants must ensure that their language and actions are free of personal attacks and disparaging personal remarks.\nWhen interpreting the words and actions of others, participants should always assume good intentions.\nBehaviour which can be reasonably considered harassment will not be tolerated.\nIt’s worth noting that this not only defeats the primary, secondary, and tertiary purposes of the Code of Conduct that Typhoid Coraline was attempting to install in order to unseat Matz, but it can obviously be used effectively against SJW entryists.\nNo wonder Typhoid is so upset. It’s a superficial victory of absolutely no utility for him.\nCoraline Ada Ehmke ‏@CoralineAda\nThis is very disappointing. No one to report abuse to. No recourse for victims of harassment. Poor showing, Ruby.\nCoraline Ada Ehmke ‏@CoralineAda\nSad that Ruby still doesn’t have a code of conduct. I don’t know what to call that thing.\nCoraline Ada Ehmke ‏@CoralineAda\nUnfortunately I fear that it will take a nasty incident for Matz to change his mind\nabout a code of conduct. I feel bad about this.",
  "tags": [
    "CoC",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-18T23:29:00+00:00"
}