{
  "url": "https://voxday.net/2016/02/27/moderate-loyalty/",
  "scraped_at": "2025-12-17T17:47:37.167871",
  "title": "Moderate loyalty",
  "date_display": "February 27, 2016",
  "date_iso": "2016-02-27T13:30:00+00:00",
  "date_from_url": "2016-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember when it was the mostest importantest election ever and it was vital that disappointed conservatives and libertarians rally around the Republican nominee? Yeah, well, it seemed those who appealed to party loyalty to get the disaffected right to vote for Bush, Dole, Bush, McCain, and Romney are suddenly <a href=\"http://www.politico.com/story/2016/02/doors-gop-consulting-independent-219859\">singing a very different tune</a> now that it is becoming apparent that Donald Trump is going to be the nominee:</p><blockquote class=\"tr_bq\"><p> Conservative donors have engaged a major GOP consulting firm in Florida to research the feasibility of mounting a late, independent run for president amid growing fears that Donald Trump could win the Republican nomination.</p><p>A memo prepared for the group zeroes in on ballot access as a looming obstacle for any independent candidate, along with actually identifying a viable, widely known contender and coalescing financial support for that person. The two states with the earliest deadlines for independent candidates, Texas and North Carolina, also have some of the highest hurdles for independents to get on the ballot, according to the research.</p><p>“All this research has to happen before March 16, when inevitably Trump is the nominee, so that we have a plan in place,” a source familiar with the discussions said. March 16 is the day after the GOP primary in Florida, a winner-take-all contest that Marco Rubio supporters have identified as a must-win to stop Trump’s early momentum.</p></blockquote><p>I wish I could say that I’m even a little bit surprised. But I’m not. It is rather funny, though, that the rules the moderates installed to permit a Romney clone to keep out the Ronulans are going to seal Trump’s victory sooner rather than later.</p><p>Never trust a moderate. Never permit a moderate in a position of leadership. And the moment he snipes at you, treat him exactly like you would treat an enemy taking a shot at you.</p></div>",
  "content_text": "Remember when it was the mostest importantest election ever and it was vital that disappointed conservatives and libertarians rally around the Republican nominee? Yeah, well, it seemed those who appealed to party loyalty to get the disaffected right to vote for Bush, Dole, Bush, McCain, and Romney are suddenly\nsinging a very different tune\nnow that it is becoming apparent that Donald Trump is going to be the nominee:\nConservative donors have engaged a major GOP consulting firm in Florida to research the feasibility of mounting a late, independent run for president amid growing fears that Donald Trump could win the Republican nomination.\nA memo prepared for the group zeroes in on ballot access as a looming obstacle for any independent candidate, along with actually identifying a viable, widely known contender and coalescing financial support for that person. The two states with the earliest deadlines for independent candidates, Texas and North Carolina, also have some of the highest hurdles for independents to get on the ballot, according to the research.\n“All this research has to happen before March 16, when inevitably Trump is the nominee, so that we have a plan in place,” a source familiar with the discussions said. March 16 is the day after the GOP primary in Florida, a winner-take-all contest that Marco Rubio supporters have identified as a must-win to stop Trump’s early momentum.\nI wish I could say that I’m even a little bit surprised. But I’m not. It is rather funny, though, that the rules the moderates installed to permit a Romney clone to keep out the Ronulans are going to seal Trump’s victory sooner rather than later.\nNever trust a moderate. Never permit a moderate in a position of leadership. And the moment he snipes at you, treat him exactly like you would treat an enemy taking a shot at you.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-27T13:30:00+00:00"
}