{
  "url": "https://voxday.net/2016/02/04/musings-on-immigration-iv/",
  "scraped_at": "2025-12-17T17:44:35.513656",
  "title": "Musings on Immigration IV",
  "date_display": "February 4, 2016",
  "date_iso": "2016-02-04T18:30:00+00:00",
  "date_from_url": "2016-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is the final section of the four-part guest post.</i></p><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> <b>Conclusion</b></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> If there is one thing that can be said in faint praise of Barrack<br> Obama, it is his unerring capability to escape the consequences of<br> gaffes that would have destroyed a lesser politician.  Most recently,<br> his comparison of Syrian refugees to the pilgrims on the <i>Mayflower<br> </br></i>provoked derision and disbelief in equal measure.  By welcoming<br> the Europeans to their shores and helping them to survive the first<br> hellish winter, the Native Americans signed their own death warrants.<br> There was no mass resistance to the immigration/invasion until it<br> was far too late.</br></br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Seriously, if you happened to be a Native American with access to a<br> time machine, what advice would you give the Indians?  Help the<br> settlers or kill every last one of the white devils?</br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> And that is the problem facing Europe now.</div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> The lesson we have failed to learn, time and time again, is that<br> introducing large numbers of people who THINK differently from us to<br> our nations is asking for trouble.  These people are not blank<br> slates.  Young men raised in a society where  women are regarded as<br> chattel, as little more than property, are unlikely to adjust well to<br> Western society.  Nor do they understand the concept of the ‘iron<br> fist in the velvet glove,’ coming as they do from a society which<br> functions on the concept of ‘iron fist in the iron glove.’  Such<br> people regard such concepts as a sign of weakness, a sign that they<br> can (and should) go further.  Arab society, in many ways, is based on<br> bullying.  One is either the bully or the bullied.</br></br></br></br></br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Getting through to these people requires – demands – stern measures.<br> Gentle rebukes are meaningless because they don’t use gentle<br> rebukes themselves.  Forbearance and tolerance is nothing more than a<br> sign of weakness.</br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> There is an old saying that insists that fish have no word for water,<br> because they swim in it.  That is certainly true of European Culture.<br> It is all around Europeans such as myself, yet it goes unnoticed<br> because we are too used to it.  But because we are unaware of our<br> culture, we fail to comprehend that others might have a different<br> culture – or that defending our culture means not submitting to their<br> culture.  Tolerance of what one may do in private, among consenting<br> adults, is one thing; tolerating the intolerable is quite another.</br></br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> For all its flaws, and it has many, I LIKE Western Civilization.<br> Life is good here.  We do not oppress women in any systematic manner.<br> Homosexuals can be homosexual without anyone giving a damn; they are<br> certainly not hunted down and thrown off tall buildings.  People can<br> change their religion without being brutally murdered.  There is a<br> great deal of freedom of choice, from everything like movies to<br> online porn!  None of this is true of Arab counties.  Women are<br> slaves, homosexuals are thrown off buildings, converts are killed …</br></br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> The West has forgotten that it needs to draw lines.  There is a<br> strong difference between anything done by consenting adults in<br> private and anything forced on an individual who does not<br> consent.  The West has lost its ability to see that these lines<br> exist, instead making excuses for people who are ‘different.’<br> Pre-1945 Europe was a harsh and intolerant place in a great many<br> ways, but post-Cold War Europe is far too permissive.  And, in not<br> standing up for its values, it has displayed a weakness that merely<br> attracts bullies.  It has become far too permissive for its own good.</br></br></br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Above all, perhaps, the West has forgotten that the world is a cold<br> and brutal place.  The years of peace enjoyed by Western Europe, held<br> in place by the nuclear deterrent and the American security<br> guarantee, was not a natural condition.  If one happens to truly<br> desire peace, then prepare for war.</br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> There are many arguments put forward by people who don’t see the<br> situation the way I do.</br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> One chain of thought suggests that Germany needs younger immigrants;<br> the German population is growing older and the replacement babies are<br> not there.  This argument hangs on the assumption that Mohammad will<br> be willing to work his ass off to keep Fritz in the retirement home,<br> a very dangerous assumption.  Why should he?  And even if Mohammad is<br> willing to work, can he?  The vast majority of migrants have very<br> little in the way of useful skills.</br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Seriously, if Germany had wanted migrants, it would have been better<br> to pick and chose from people who could actually work.</br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Another suggests that the birth-rate among migrants is falling too,<br> that the nightmare of being overwhelmed by hordes of barbarians is<br> never going to materialise.  I do not have any data, but I suspect<br> this isn’t particularly accurate.  Arabs take pride in large<br> families.  It will take at least two generations of assimilation, assuming that it happens at all, before birth-rates start to fall<br> significantly.  That will be more than long enough to tip the<br> demographic balance squarely in their favor.</br></br></br></br></br></br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Indeed, given what tends to happen if there are large numbers of<br> migrants, I would be very surprised if the birth-rates fell at all.</br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> A third argument suggests that we – Europe – have a duty, in line<br> with international law, to take refugees.</br></div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> I am not an expert on international law, but it is, quite simply, unenforceable.  No one can do more<br/> than wag their fingers at Merkel if she decided to refuse sanctuary<br/> to any further migrants, then start deporting the ones already in<br/> Germany.  International agreements were designed to prevent another<br/> Holocaust, the destruction of a largely-inoffensive minority, not<br/> force states to commit suicide by accepting large numbers of people<br/> from a very offensive culture.  There are times when keeping one’s<br/> agreements is a good thing – a reputation for breaking them makes it<br/> harder to make agreements in future – but this is not one of them.<br/> If Merkel is unwilling or unable to recognise this, the next<br/> government certainly will.</div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> It is perhaps the greatest irony of the whole affair that agreements<br/> made in the recognition that we – the West – failed to prevent a<br/> genocide on a truly staggering scale may lead directly to another<br/> genocide.</div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> I am not sanguine about the future.  Europe is facing a major crisis<br/> at precisely the moment when it is psychologically, and perhaps<br/> physically, unfit to handle it.  Governments are increasingly under<br/> siege by their own populations, who are demanding change, and facing<br/> the threat of the EU coming apart once and for all.  Fringe parties<br/> that may want a more final solution to the migrant crisis ate gaining<br/> in power as people lose faith in the elites.  The rule of law is<br/> crumbling.  Violence is rising on the streets as people strive to<br/> defend themselves against the migrant threat.  Britain leaving the EU<br/> in 2016 might merely be the first nail in its coffin.</div><div class=\"western\" lang=\"en-GB\" style=\"line-height: 115%; margin-bottom: 0.14in;\"> Winter is coming.</div></div>",
  "content_text": "This is the final section of the four-part guest post.\nConclusion\nIf there is one thing that can be said in faint praise of Barrack\nObama, it is his unerring capability to escape the consequences of\ngaffes that would have destroyed a lesser politician.  Most recently,\nhis comparison of Syrian refugees to the pilgrims on the\nMayflower\nprovoked derision and disbelief in equal measure.  By welcoming\nthe Europeans to their shores and helping them to survive the first\nhellish winter, the Native Americans signed their own death warrants.\nThere was no mass resistance to the immigration/invasion until it\nwas far too late.\nSeriously, if you happened to be a Native American with access to a\ntime machine, what advice would you give the Indians?  Help the\nsettlers or kill every last one of the white devils?\nAnd that is the problem facing Europe now.\nThe lesson we have failed to learn, time and time again, is that\nintroducing large numbers of people who THINK differently from us to\nour nations is asking for trouble.  These people are not blank\nslates.  Young men raised in a society where  women are regarded as\nchattel, as little more than property, are unlikely to adjust well to\nWestern society.  Nor do they understand the concept of the ‘iron\nfist in the velvet glove,’ coming as they do from a society which\nfunctions on the concept of ‘iron fist in the iron glove.’  Such\npeople regard such concepts as a sign of weakness, a sign that they\ncan (and should) go further.  Arab society, in many ways, is based on\nbullying.  One is either the bully or the bullied.\nGetting through to these people requires – demands – stern measures.\nGentle rebukes are meaningless because they don’t use gentle\nrebukes themselves.  Forbearance and tolerance is nothing more than a\nsign of weakness.\nThere is an old saying that insists that fish have no word for water,\nbecause they swim in it.  That is certainly true of European Culture.\nIt is all around Europeans such as myself, yet it goes unnoticed\nbecause we are too used to it.  But because we are unaware of our\nculture, we fail to comprehend that others might have a different\nculture – or that defending our culture means not submitting to their\nculture.  Tolerance of what one may do in private, among consenting\nadults, is one thing; tolerating the intolerable is quite another.\nFor all its flaws, and it has many, I LIKE Western Civilization.\nLife is good here.  We do not oppress women in any systematic manner.\nHomosexuals can be homosexual without anyone giving a damn; they are\ncertainly not hunted down and thrown off tall buildings.  People can\nchange their religion without being brutally murdered.  There is a\ngreat deal of freedom of choice, from everything like movies to\nonline porn!  None of this is true of Arab counties.  Women are\nslaves, homosexuals are thrown off buildings, converts are killed …\nThe West has forgotten that it needs to draw lines.  There is a\nstrong difference between anything done by consenting adults in\nprivate and anything forced on an individual who does not\nconsent.  The West has lost its ability to see that these lines\nexist, instead making excuses for people who are ‘different.’\nPre-1945 Europe was a harsh and intolerant place in a great many\nways, but post-Cold War Europe is far too permissive.  And, in not\nstanding up for its values, it has displayed a weakness that merely\nattracts bullies.  It has become far too permissive for its own good.\nAbove all, perhaps, the West has forgotten that the world is a cold\nand brutal place.  The years of peace enjoyed by Western Europe, held\nin place by the nuclear deterrent and the American security\nguarantee, was not a natural condition.  If one happens to truly\ndesire peace, then prepare for war.\nThere are many arguments put forward by people who don’t see the\nsituation the way I do.\nOne chain of thought suggests that Germany needs younger immigrants;\nthe German population is growing older and the replacement babies are\nnot there.  This argument hangs on the assumption that Mohammad will\nbe willing to work his ass off to keep Fritz in the retirement home,\na very dangerous assumption.  Why should he?  And even if Mohammad is\nwilling to work, can he?  The vast majority of migrants have very\nlittle in the way of useful skills.\nSeriously, if Germany had wanted migrants, it would have been better\nto pick and chose from people who could actually work.\nAnother suggests that the birth-rate among migrants is falling too,\nthat the nightmare of being overwhelmed by hordes of barbarians is\nnever going to materialise.  I do not have any data, but I suspect\nthis isn’t particularly accurate.  Arabs take pride in large\nfamilies.  It will take at least two generations of assimilation, assuming that it happens at all, before birth-rates start to fall\nsignificantly.  That will be more than long enough to tip the\ndemographic balance squarely in their favor.\nIndeed, given what tends to happen if there are large numbers of\nmigrants, I would be very surprised if the birth-rates fell at all.\nA third argument suggests that we – Europe – have a duty, in line\nwith international law, to take refugees.\nI am not an expert on international law, but it is, quite simply, unenforceable.  No one can do more\nthan wag their fingers at Merkel if she decided to refuse sanctuary\nto any further migrants, then start deporting the ones already in\nGermany.  International agreements were designed to prevent another\nHolocaust, the destruction of a largely-inoffensive minority, not\nforce states to commit suicide by accepting large numbers of people\nfrom a very offensive culture.  There are times when keeping one’s\nagreements is a good thing – a reputation for breaking them makes it\nharder to make agreements in future – but this is not one of them.\nIf Merkel is unwilling or unable to recognise this, the next\ngovernment certainly will.\nIt is perhaps the greatest irony of the whole affair that agreements\nmade in the recognition that we – the West – failed to prevent a\ngenocide on a truly staggering scale may lead directly to another\ngenocide.\nI am not sanguine about the future.  Europe is facing a major crisis\nat precisely the moment when it is psychologically, and perhaps\nphysically, unfit to handle it.  Governments are increasingly under\nsiege by their own populations, who are demanding change, and facing\nthe threat of the EU coming apart once and for all.  Fringe parties\nthat may want a more final solution to the migrant crisis ate gaining\nin power as people lose faith in the elites.  The rule of law is\ncrumbling.  Violence is rising on the streets as people strive to\ndefend themselves against the migrant threat.  Britain leaving the EU\nin 2016 might merely be the first nail in its coffin.\nWinter is coming.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-04T18:30:00+00:00"
}