{
  "url": "https://voxday.net/2016/02/26/neoreaction-and-failure-of-democracy/",
  "scraped_at": "2025-12-17T17:47:27.199760",
  "title": "Neoreaction and the failure of democracy",
  "date_display": "February 26, 2016",
  "date_iso": "2016-02-26T09:40:00+00:00",
  "date_from_url": "2016-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A very good, very intelligent article called <a href=\"http://status451.com/2016/02/25/what-is-neoreaction/\">“What is Neoreaction”</a> by Clark, formerly of Popehat.com, at his new group blog Status 451:</p><blockquote class=\"tr_bq\"><p> <i>Why democracy doesn’t work</i></p><p>In what ways does democracy fail?</p><p>First, as noted above, many people vote as an expressive act. The typical Obama voter knew nothing of his policies, but wanted to be “part” of “something”. There are all sorts of cultural and emotional connotations associated with Team Pepsi, and people want to affiliate themselves with those signals. Team Coke is no better: many Republican voters are in favor of a culture of God, Flag, and Apple Pie, and cast a vote for the GOP as an expressive act, without knowing or caring the actual positions of the candidates they vote for.</p><p>Second, we are rationally ignorant: even if every voter chose to vote based on policy, not emotions, our individual contribution to the outcome of an election is insanely close to zero, and — at some level — we all know this. Thus, almost none of us bothers to educate ourselves about the candidates and their positions. This is, individually, a smart choice.</p><p>Third, democracy has the principal-agent problem: we voters send politicians to Washington DC for — well, for whatever purposes we have. We hope that, once there, they will do our bidding…and we expect to motivate them to do that bidding by using the threat of our future votes and future campaign donations. But a lot is hidden in that “voters hope to motivate them”. Because voters don’t have time or inclination to monitor politicians, and because they tend to vote for expressive purposes rather than policy purposes (think of all the anti-war Democrats who support Obama and his various undeclared overseas wars), politicians need only do just enough to appear to serve the voters, while actually pursuing their own policies.</p><p><noscript><img border=\"0\" decoding=\"async\" src=\"https://status451dotcom.files.wordpress.com/2016/02/hyperbole.png?w=640\" style=\"float: left; margin: 10px; width: 250px;\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://status451dotcom.files.wordpress.com/2016/02/hyperbole.png?w=640\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float: left; margin: 10px; width: 250px;\"><br> Fourth, we humans are <b>hyperbolic discounters</b>. Given the<br> promise of one marshmallow now over two in five minutes, we choose the<br> one now. Is it any surprise that we, en masse, repeatedly vote for the<br> politicians who promise us bread and circuses today, and a bill that<br> won’t come due for … a while?<br> Fifth, democracy has the <b>public choice</b> problem. There are many<br> issues which affect each of us very little — ten cents per person in<br> extra taxes for program X, or three dollars per person more in the price<br> of a commodity because of trade barrier Y, or a slight bit of extra<br> hassle in doing thing Z. These hassles, collectively, destroy a lot of<br> value in our lives, but individually, harm us very little. However,<br> these small barnacles did not randomly accrete on the body politic —<br> each is placed there by the dedicated lobbying of some group that<br> benefits <i>quite a lot</i> from the tax, regulation, or trade barrier.<br> Ethanol in our gasoline harms all of us a little, but helps a small<br> influential group quite a lot. The outrageous salaries of some tenured<br> public school teachers harms all of us a little, but helps a small<br> influential group quite a lot. As long as one small group benefits from a<br> regulation, they will be motivated to secure an outsized influence on<br> politicians. And they will succeed.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></img></p></blockquote><p>However, I would note it should be kept in mind that what the author means by “democracy” here is “representative democracy” and not genuine direct democracy of the sort practiced in Greece, US state referendums, and European national referendums of the sort in which Great Britain is presently engaged. But regardless, a very good article.</p><p>My opinion, as I have previously expressed, is that the problems of “mob rule” of which the Founders so famously warned have proven to be considerably fewer and less problematic than the problems of establishing a political elite that uses the illusion of democratic approval as a protective shield. Now that technology makes it viable for larger polities, direct democracy is a moral imperative in any society with a government that is justified by the will of the people.</p></div>",
  "content_text": "A very good, very intelligent article called\n“What is Neoreaction”\nby Clark, formerly of Popehat.com, at his new group blog Status 451:\nWhy democracy doesn’t work\nIn what ways does democracy fail?\nFirst, as noted above, many people vote as an expressive act. The typical Obama voter knew nothing of his policies, but wanted to be “part” of “something”. There are all sorts of cultural and emotional connotations associated with Team Pepsi, and people want to affiliate themselves with those signals. Team Coke is no better: many Republican voters are in favor of a culture of God, Flag, and Apple Pie, and cast a vote for the GOP as an expressive act, without knowing or caring the actual positions of the candidates they vote for.\nSecond, we are rationally ignorant: even if every voter chose to vote based on policy, not emotions, our individual contribution to the outcome of an election is insanely close to zero, and — at some level — we all know this. Thus, almost none of us bothers to educate ourselves about the candidates and their positions. This is, individually, a smart choice.\nThird, democracy has the principal-agent problem: we voters send politicians to Washington DC for — well, for whatever purposes we have. We hope that, once there, they will do our bidding…and we expect to motivate them to do that bidding by using the threat of our future votes and future campaign donations. But a lot is hidden in that “voters hope to motivate them”. Because voters don’t have time or inclination to monitor politicians, and because they tend to vote for expressive purposes rather than policy purposes (think of all the anti-war Democrats who support Obama and his various undeclared overseas wars), politicians need only do just enough to appear to serve the voters, while actually pursuing their own policies.\nFourth, we humans are\nhyperbolic discounters\n. Given the\npromise of one marshmallow now over two in five minutes, we choose the\none now. Is it any surprise that we, en masse, repeatedly vote for the\npoliticians who promise us bread and circuses today, and a bill that\nwon’t come due for … a while?\nFifth, democracy has the\npublic choice\nproblem. There are many\nissues which affect each of us very little — ten cents per person in\nextra taxes for program X, or three dollars per person more in the price\nof a commodity because of trade barrier Y, or a slight bit of extra\nhassle in doing thing Z. These hassles, collectively, destroy a lot of\nvalue in our lives, but individually, harm us very little. However,\nthese small barnacles did not randomly accrete on the body politic —\neach is placed there by the dedicated lobbying of some group that\nbenefits\nquite a lot\nfrom the tax, regulation, or trade barrier.\nEthanol in our gasoline harms all of us a little, but helps a small\ninfluential group quite a lot. The outrageous salaries of some tenured\npublic school teachers harms all of us a little, but helps a small\ninfluential group quite a lot. As long as one small group benefits from a\nregulation, they will be motivated to secure an outsized influence on\npoliticians. And they will succeed.\nHowever, I would note it should be kept in mind that what the author means by “democracy” here is “representative democracy” and not genuine direct democracy of the sort practiced in Greece, US state referendums, and European national referendums of the sort in which Great Britain is presently engaged. But regardless, a very good article.\nMy opinion, as I have previously expressed, is that the problems of “mob rule” of which the Founders so famously warned have proven to be considerably fewer and less problematic than the problems of establishing a political elite that uses the illusion of democratic approval as a protective shield. Now that technology makes it viable for larger polities, direct democracy is a moral imperative in any society with a government that is justified by the will of the people.",
  "tags": [
    "philosophy",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-26T09:40:00+00:00"
}