{
  "url": "https://voxday.net/2016/02/10/new-hampshire/",
  "scraped_at": "2025-12-17T17:45:17.446813",
  "title": "New Hampshire: Trump, Sanders win",
  "date_display": "February 10, 2016",
  "date_iso": "2016-02-10T00:34:00+00:00",
  "date_from_url": "2016-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is your open thread to discuss <a href=\"http://www.decisiondeskhq.com/\">the New Hampshire results</a>. If Hillary was anyone but Hillary, the media would be pronouncing her dead. I suppose we’ll have to wait for Super Tuesday before they can make the definitive case.</p><p>UPDATE: Bernie Sanders wins!</p><blockquote class=\"tr_bq\"><p> Senator Bernie Sanders beat Hillary Clinton among nearly every demographic group in the Democratic New Hampshire primary, according to exit polls.</p><p>He carried majorities of both men and women. He won among those with and without college degrees. He won among gun owners and non-gun owners. He beat Mrs. Clinton among previous primary voters and those participating for the first time. And he ran ahead among both moderates and liberals.</p></blockquote><p>Donald Trump also did better than expected.</p><ul><li>Donald Trump 35.1%</li><li>John Kasich 15.9%</li><li>Ted Cruz 11.7%</li><li>Jeb Bush 11.1%</li><li>Marco Rubio 10.7%</li><li>Chris Christie 7.5%</li><li>Carly Fiorina 4.1%</li><li>Ben Carson 2.3 </li></ul><p>Interesting to see that Carson is apparently willing to throw his support to Trump. As I mentioned previously, Carson could help Trump seal the deal. I expect that will not have escaped Trump’s attention and that <i>The Art of the Deal</i> author will be in touch with him sooner rather than later. He won’t offer him VP, though, but a Cabinet seat.</p></div>",
  "content_text": "This is your open thread to discuss\nthe New Hampshire results\n. If Hillary was anyone but Hillary, the media would be pronouncing her dead. I suppose we’ll have to wait for Super Tuesday before they can make the definitive case.\nUPDATE: Bernie Sanders wins!\nSenator Bernie Sanders beat Hillary Clinton among nearly every demographic group in the Democratic New Hampshire primary, according to exit polls.\nHe carried majorities of both men and women. He won among those with and without college degrees. He won among gun owners and non-gun owners. He beat Mrs. Clinton among previous primary voters and those participating for the first time. And he ran ahead among both moderates and liberals.\nDonald Trump also did better than expected.\nDonald Trump 35.1%\nJohn Kasich 15.9%\nTed Cruz 11.7%\nJeb Bush 11.1%\nMarco Rubio 10.7%\nChris Christie 7.5%\nCarly Fiorina 4.1%\nBen Carson 2.3\nInteresting to see that Carson is apparently willing to throw his support to Trump. As I mentioned previously, Carson could help Trump seal the deal. I expect that will not have escaped Trump’s attention and that\nThe Art of the Deal\nauthor will be in touch with him sooner rather than later. He won’t offer him VP, though, but a Cabinet seat.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-10T00:34:00+00:00"
}