{
  "url": "https://voxday.net/2016/02/25/no-thats-not-i/",
  "scraped_at": "2025-12-17T17:47:22.038030",
  "title": "No, that’s not it",
  "date_display": "February 25, 2016",
  "date_iso": "2016-02-25T17:30:00+00:00",
  "date_from_url": "2016-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amazing how many so-called pundits and analysts are casting about, looking everywhere except at the real reason, in their attempts to explain <a href=\"http://thefederalist.com/2016/02/25/bernie-supporters-hatred-of-work-is-why-trump-supporters-are-so-mad/\">why Trump supporters are angry</a>:</p><blockquote class=\"tr_bq\"><p> Bernie Supporters’ Hatred Of Work Is Why Trump Supporters Are So Mad.</p><p>The cultural disconnect about the value of work explains why there’s an open revolt in both parties and the future seems so uncertain…. Indeed, it is precisely this cultural disconnect about the value<br> of work that explains why there’s an open revolt in both parties and<br> the future seems so uncertain.</br></br></p><div> If any one issue defines this election, it’s economic stagnation.<br> Many Trump supporters in the GOP feel left behind by the<br> twenty-first-century economy. They’re angry about it, because our<br> “follow your bliss” culture doesn’t begin to appreciate coal miners or<br> people who work in brake disc factories, even as it obsessively<br> venerates empty celebrity and people like social media executives and<br> hedge fund managers who are filthy rich in spite of the fact their<br> contributions to society aren’t very tangible.<p>Combine that with the<br> self-loathing these guys feel from, say, being laid off and having to<br> fake a fibromyagia diagnosis so they can collect disability and feed<br> their families, and you have tremendous resentment.</br></br></br></p><p>Trump was not only canny enough to speak to this, but he still<br> remains arguably the only candidate to forthrightly talk about issues<br> such as immigration that are feeding this anxiety, even if he speaks<br> about them with great ignorance. It’s regrettable in many ways, but it’s<br> also not a mystery why 30 percent of Republicans are lining up to<br> support a lunatic who has (allegedly) made a lot of money and wields<br> considerable influence despite now being despised by our cultural<br> betters.</br></br></br></br></br></br></br></p></br></br></br></br></br></br></br></div></blockquote><p>What a prodigiously stupid headline. And what a transparently futile attempt to redirect that anger to the conventional Bad Democrat Good Republican channel. As usual, conservatives have it completely backwards. Americans are struggling economically, in part due to the economic policies that have caused their real wages to peak in 1973. But that merely exacerbates the anger that they feel at their country being subject to the largest invasion in human history, an invasion of 60 million that is nearly 16 times larger than Hitler’s invasion of the Soviet Union.</p><p>They want their country back. They want to see America be great again, not prostrate before the boots and burqahs of foreign invaders.</p><p>That is why they are angry.</p></div>",
  "content_text": "It’s amazing how many so-called pundits and analysts are casting about, looking everywhere except at the real reason, in their attempts to explain\nwhy Trump supporters are angry\n:\nBernie Supporters’ Hatred Of Work Is Why Trump Supporters Are So Mad.\nThe cultural disconnect about the value of work explains why there’s an open revolt in both parties and the future seems so uncertain…. Indeed, it is precisely this cultural disconnect about the value\nof work that explains why there’s an open revolt in both parties and\nthe future seems so uncertain.\nIf any one issue defines this election, it’s economic stagnation.\nMany Trump supporters in the GOP feel left behind by the\ntwenty-first-century economy. They’re angry about it, because our\n“follow your bliss” culture doesn’t begin to appreciate coal miners or\npeople who work in brake disc factories, even as it obsessively\nvenerates empty celebrity and people like social media executives and\nhedge fund managers who are filthy rich in spite of the fact their\ncontributions to society aren’t very tangible.\nCombine that with the\nself-loathing these guys feel from, say, being laid off and having to\nfake a fibromyagia diagnosis so they can collect disability and feed\ntheir families, and you have tremendous resentment.\nTrump was not only canny enough to speak to this, but he still\nremains arguably the only candidate to forthrightly talk about issues\nsuch as immigration that are feeding this anxiety, even if he speaks\nabout them with great ignorance. It’s regrettable in many ways, but it’s\nalso not a mystery why 30 percent of Republicans are lining up to\nsupport a lunatic who has (allegedly) made a lot of money and wields\nconsiderable influence despite now being despised by our cultural\nbetters.\nWhat a prodigiously stupid headline. And what a transparently futile attempt to redirect that anger to the conventional Bad Democrat Good Republican channel. As usual, conservatives have it completely backwards. Americans are struggling economically, in part due to the economic policies that have caused their real wages to peak in 1973. But that merely exacerbates the anger that they feel at their country being subject to the largest invasion in human history, an invasion of 60 million that is nearly 16 times larger than Hitler’s invasion of the Soviet Union.\nThey want their country back. They want to see America be great again, not prostrate before the boots and burqahs of foreign invaders.\nThat is why they are angry.",
  "tags": [
    "immigration",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-25T17:30:00+00:00"
}