{
  "url": "https://voxday.net/2016/02/28/no-you-really-weren/",
  "scraped_at": "2025-12-17T17:47:47.075918",
  "title": "American or Ameriboo?",
  "date_display": "February 28, 2016",
  "date_iso": "2016-02-28T13:30:00+00:00",
  "date_from_url": "2016-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sarah Hoyt insists that <a href=\"http://accordingtohoyt.com/2016/02/28/i-was-born-american-a-blast-from-the-past-7-4-2014/\">she was “born American”</a> in Portugal, to Portuguese parents:</p><blockquote class=\"tr_bq\"><p> I was born American. Yes, I was born in another country of foreign parents who would no more become American than fly unassisted, (and who desire it less than they wish to have have their heads shaved by a warthog) but I figure that was an accident of circumstance.  What really matters is that I was an American in my heart.  I just had to get here and become one in truth. (And that, by itself, is an American attitude.)</p><p>This week while talking to a friend about his foreign SO, I found myself explaining that other people, in other countries, have a hierarchy in their heads all the time — who is powerful, who isn’t, what attitude is proper.  You can find it (if you know where to look) even when reading British novels.</p><p>We’re not like that.  Whether we were born elsewhere or here, Americans — those of us who are proud of the name —  are rebels, revolutionaries, something new under the sun: a people who believe people should be equal in their right to life, the right to liberty, the right to pursue their happiness undisturbed by either inimical neighbors or oppressive “betters.”</p></blockquote><p>It’s a bit ironic, in that the ideas she is using to justify her “born American” claim were initially put forth by four not-exactly-American individuals, one a French tourist, one a French immigrant, one a Russian Jew living in Britain, and one a Jew of Portuguese descent born in New York City.</p><p>Not a single one of whom belonged to the American posterity for whom the blessings of liberty were intended, according to the Preamble to the Constitution.</p><p>It’s telling, is it not, how all of these foreigners and immigrants just happened to produce a new definition of American that included them, a definition that was not held by the Founding Fathers. Nor is it a coincidence that this self-serving definition was subsequently used to justify the largest invasion to have ever taken place in human history, an invasion that has severely weakened the once-mighty American nation.</p><p>My fellow Native American, John Red Eagle, and I addressed this very point in our book <i>Cuckservative</i>:</p><p><b><i>America is not a propositional nation, it is a distinct nation of people with their own customs, traditions, DNA, and culture, and it is a nation that has the right to defend its own existence. </i></b></p><p>The Founding Fathers were clear on the issue:</p><p><i>All persons born in the British American Colonies are, by the laws of God and nature and by the common law of England, exclusive of all charters from the Crown, well entitled, and by acts of the British Parliament are declared to be entitled, to all the natural, essential, inherent, and inseparable rights, liberties, and privileges of subjects born in Great Britain or within the realm.</i><br>  – Samuel Adams</br></p><p><i>“Although as to other foreigners it is thought better to discourage their settling together in large masses, wherein, as in our German settlements, they preserve for a long time their own languages, habits, and principles of government, and that they should distribute themselves sparsely among the natives for quicker amalgamation, yet English emigrants are without this inconvenience.”</i><br>  – Thomas Jefferson<i> </i></br></p><p><i>The opinion advanced is undoubtedly correct, that foreigners will generally be apt to bring with them attachments to the persons they have left behind; to the country of their nativity, and to its particular customs and manners. They will also entertain opinions on government congenial with those under which they have lived; or, if they should be led hither from a preference to ours, how extremely unlikely is it that they will bring with them that temperate love of liberty, so essential to real republicanism? </i><br> – Alexander Hamilton<i></i><br> <i><br/></i><br> <i>Why should the Palatine Boors be suffered to swarm into our settlements, and by herding together establish their languages and manners to the exclusion of ours? Why should Pennsylvania, founded by the English, become a colony of Aliens, who will shortly be so numerous as to Germanize us instead of our Anglifying them, and will never adopt our language or customs, any more than they can acquire our complexion?</i><br> – Ben Franklin</br></br></br></br></p><p>One cannot no more become an American by virtue of one’s thoughts or feelings about revolution or equality than one can become Australian, Canadian, or any other nation of English descent. That’s why, unlike Irish-Americans, Swedish-Americans, and Italian-Americans, there are no hybrid “English-Americans”. Like it or not, the fact is that they are the American nation and the posterity of the Constitution.</p><p>The Japanese have a word for a foreigner who is so enamored of Japanese concepts and culture that they come to identify with it. We had a few in my class in Tokyo; they would wear their yukatas and religiously perform tea ceremonies every day. Sarah could be reasonably described as an American weebo.</p><p>The fact that America is a nation weakened and watered-down by mass immigration and over a century of intermingling with other nations does not change the fact of its historical existence. Many of its predecessor nations are now gone, lost forever to history, but that does not mean that they never existed in the first place.</p><p>The ironic thing about all this is that Sarah has repeatedly insisted that I “don’t get Europe” despite having lived in a European country for nearly two decades and most of my adult life. And perhaps she is right. Every European country I have visited has customs that occasionally strike me as certifiably insane. But what is also true is that she doesn’t know what America is, she is no more properly “American” than a Spanish-speaking Peruvian who has lived his entire life in Iquitos, and she certainly wasn’t born American in <i>any </i>sense of the term.</p><p>She is, without question, what might be called USian. But it is increasingly apparent that there is a large and growing gap between the USian transnationalists and the American nationalists, a gap that history strongly suggests will lead to either secession or civil war.</p><p>Moreover, in order to claim that she is American while simultaneously denying that I am Italian, she must deny that America is – or increasingly, was – a distinct nation of people with their own customs, traditions, DNA, and culture. And is that something that anyone who loves the American nation and is truly part of it would do?</p><p>Marco Rubio and Rupert Murdoch claim to be Americans too. But <a href=\"http://www.nytimes.com/2016/02/28/us/politics/marco-rubio-pushed-for-immigration-reform-with-conservative-media.html?_r=1\">their actions observably belie their claims</a>. What Sarah is pushing is a bizzare form of replacement theology, where right-thinking New Americans are grafted on to replace those pesky Old Americans whose blood and traditions and Constitution are no longer deemed necessary to the replacement nation.</p><p>Sarah writes: <i>“We are a radical experiment, a nation not of blood and genes, but a nation of heart, of mind, of belief.”</i></p><p>Perhaps. But that is not America. That is the alien collective which is in the process of devouring the genuine American nation, staking claim to its property, and assuming its identity.</p><p>UPDATE: It is hilarious to see the commenters over there posturing, assuring Sarah she as American as they are, and asking “do you even history” while producing howlers like this:</p><blockquote class=\"tr_bq\"><p> The big difference you are missing – whether deliberately or not – is<br> that the United States is not one of those nations formed by forcing<br> other countries together into a whole.</br></br></p></blockquote><p>In addition to eliminating hundreds of Indian nations (which is handwaved aside because Cherokee), there is the very slight matter of THE AMERICAN CIVIL WAR which ended the voluntary union of sovereign countries and established the modern USian empire.</p><p>Like every other multi-ethnic empire in history, the USA is held together by force and nothing more than force. And it won’t hold together much longer, in part because there are now more Ameriboos than Americans residing in it.</p><p>UPDATE 2: See, they’re all about freedom of speech because they are totally real Americans. A white knight nobly riding to Sarah’s rescue – as if she can’t defend herself – tweeted both of us this:</p><blockquote class=\"tr_bq\"><p> Vox Day is a fucking fascist… I will punch the guy in his nazi face if I ever find him!</p></blockquote><p>It’s funny to think how many people have said something like that. Yet for some reason, in person everyone tends to back down. I wonder if 29 years of weightlifting might have anything to do with that?</p></div>",
  "content_text": "Sarah Hoyt insists that\nshe was “born American”\nin Portugal, to Portuguese parents:\nI was born American. Yes, I was born in another country of foreign parents who would no more become American than fly unassisted, (and who desire it less than they wish to have have their heads shaved by a warthog) but I figure that was an accident of circumstance.  What really matters is that I was an American in my heart.  I just had to get here and become one in truth. (And that, by itself, is an American attitude.)\nThis week while talking to a friend about his foreign SO, I found myself explaining that other people, in other countries, have a hierarchy in their heads all the time — who is powerful, who isn’t, what attitude is proper.  You can find it (if you know where to look) even when reading British novels.\nWe’re not like that.  Whether we were born elsewhere or here, Americans — those of us who are proud of the name —  are rebels, revolutionaries, something new under the sun: a people who believe people should be equal in their right to life, the right to liberty, the right to pursue their happiness undisturbed by either inimical neighbors or oppressive “betters.”\nIt’s a bit ironic, in that the ideas she is using to justify her “born American” claim were initially put forth by four not-exactly-American individuals, one a French tourist, one a French immigrant, one a Russian Jew living in Britain, and one a Jew of Portuguese descent born in New York City.\nNot a single one of whom belonged to the American posterity for whom the blessings of liberty were intended, according to the Preamble to the Constitution.\nIt’s telling, is it not, how all of these foreigners and immigrants just happened to produce a new definition of American that included them, a definition that was not held by the Founding Fathers. Nor is it a coincidence that this self-serving definition was subsequently used to justify the largest invasion to have ever taken place in human history, an invasion that has severely weakened the once-mighty American nation.\nMy fellow Native American, John Red Eagle, and I addressed this very point in our book\nCuckservative\n:\nAmerica is not a propositional nation, it is a distinct nation of people with their own customs, traditions, DNA, and culture, and it is a nation that has the right to defend its own existence.\nThe Founding Fathers were clear on the issue:\nAll persons born in the British American Colonies are, by the laws of God and nature and by the common law of England, exclusive of all charters from the Crown, well entitled, and by acts of the British Parliament are declared to be entitled, to all the natural, essential, inherent, and inseparable rights, liberties, and privileges of subjects born in Great Britain or within the realm.\n– Samuel Adams\n“Although as to other foreigners it is thought better to discourage their settling together in large masses, wherein, as in our German settlements, they preserve for a long time their own languages, habits, and principles of government, and that they should distribute themselves sparsely among the natives for quicker amalgamation, yet English emigrants are without this inconvenience.”\n– Thomas Jefferson\nThe opinion advanced is undoubtedly correct, that foreigners will generally be apt to bring with them attachments to the persons they have left behind; to the country of their nativity, and to its particular customs and manners. They will also entertain opinions on government congenial with those under which they have lived; or, if they should be led hither from a preference to ours, how extremely unlikely is it that they will bring with them that temperate love of liberty, so essential to real republicanism?\n– Alexander Hamilton\nWhy should the Palatine Boors be suffered to swarm into our settlements, and by herding together establish their languages and manners to the exclusion of ours? Why should Pennsylvania, founded by the English, become a colony of Aliens, who will shortly be so numerous as to Germanize us instead of our Anglifying them, and will never adopt our language or customs, any more than they can acquire our complexion?\n– Ben Franklin\nOne cannot no more become an American by virtue of one’s thoughts or feelings about revolution or equality than one can become Australian, Canadian, or any other nation of English descent. That’s why, unlike Irish-Americans, Swedish-Americans, and Italian-Americans, there are no hybrid “English-Americans”. Like it or not, the fact is that they are the American nation and the posterity of the Constitution.\nThe Japanese have a word for a foreigner who is so enamored of Japanese concepts and culture that they come to identify with it. We had a few in my class in Tokyo; they would wear their yukatas and religiously perform tea ceremonies every day. Sarah could be reasonably described as an American weebo.\nThe fact that America is a nation weakened and watered-down by mass immigration and over a century of intermingling with other nations does not change the fact of its historical existence. Many of its predecessor nations are now gone, lost forever to history, but that does not mean that they never existed in the first place.\nThe ironic thing about all this is that Sarah has repeatedly insisted that I “don’t get Europe” despite having lived in a European country for nearly two decades and most of my adult life. And perhaps she is right. Every European country I have visited has customs that occasionally strike me as certifiably insane. But what is also true is that she doesn’t know what America is, she is no more properly “American” than a Spanish-speaking Peruvian who has lived his entire life in Iquitos, and she certainly wasn’t born American in\nany\nsense of the term.\nShe is, without question, what might be called USian. But it is increasingly apparent that there is a large and growing gap between the USian transnationalists and the American nationalists, a gap that history strongly suggests will lead to either secession or civil war.\nMoreover, in order to claim that she is American while simultaneously denying that I am Italian, she must deny that America is – or increasingly, was – a distinct nation of people with their own customs, traditions, DNA, and culture. And is that something that anyone who loves the American nation and is truly part of it would do?\nMarco Rubio and Rupert Murdoch claim to be Americans too. But\ntheir actions observably belie their claims\n. What Sarah is pushing is a bizzare form of replacement theology, where right-thinking New Americans are grafted on to replace those pesky Old Americans whose blood and traditions and Constitution are no longer deemed necessary to the replacement nation.\nSarah writes:\n“We are a radical experiment, a nation not of blood and genes, but a nation of heart, of mind, of belief.”\nPerhaps. But that is not America. That is the alien collective which is in the process of devouring the genuine American nation, staking claim to its property, and assuming its identity.\nUPDATE: It is hilarious to see the commenters over there posturing, assuring Sarah she as American as they are, and asking “do you even history” while producing howlers like this:\nThe big difference you are missing – whether deliberately or not – is\nthat the United States is not one of those nations formed by forcing\nother countries together into a whole.\nIn addition to eliminating hundreds of Indian nations (which is handwaved aside because Cherokee), there is the very slight matter of THE AMERICAN CIVIL WAR which ended the voluntary union of sovereign countries and established the modern USian empire.\nLike every other multi-ethnic empire in history, the USA is held together by force and nothing more than force. And it won’t hold together much longer, in part because there are now more Ameriboos than Americans residing in it.\nUPDATE 2: See, they’re all about freedom of speech because they are totally real Americans. A white knight nobly riding to Sarah’s rescue – as if she can’t defend herself – tweeted both of us this:\nVox Day is a fucking fascist… I will punch the guy in his nazi face if I ever find him!\nIt’s funny to think how many people have said something like that. Yet for some reason, in person everyone tends to back down. I wonder if 29 years of weightlifting might have anything to do with that?",
  "tags": [
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-28T13:30:00+00:00"
}