{
  "url": "https://voxday.net/2016/02/18/on-editing/",
  "scraped_at": "2025-12-17T17:46:18.729324",
  "title": "On editing",
  "date_display": "February 18, 2016",
  "date_iso": "2016-02-18T13:03:00+00:00",
  "date_from_url": "2016-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SF-SJWs at File 770 are appalled at the fact that Tor Books and Castalia House author John C. Wright is willing to go on the record and state that,<br> in his opinion, <a href=\"http://www.scifiwright.com/2016/02/rabid-puppy-reading-list/\">I am a better editor</a> than the late, Hugo Award-winning editor<br> David Hartwell:</br></br></p><blockquote class=\"tr_bq\"><p> <b>These are the recommendations of my editor,<br> Theodore Beale, aka Vox Day, the most hated man in Science Fiction, but<br> certainly the best editor I have had the pleasure to work with.</br></br></b><br> – John C. Wright<br> <i><br>Charming. Take this and go home, David Hartwell, as we would say in Italy.</br></i><br> – Anna Feruglio Dal Dan on February 17, 2016 at 3:51 am</br></br></br></p><p><i>JCW is a writer convinced that his every work is a glittering jewel of<br> exquisite literary craftsmanship. VD is an editor who doesn’t meddle<br> with his writers’ texts. (For an example of this, see “Shakedown Cruise”<br> in Riding the Red Horse, where Campbell nominee Rolf Nelson makes<br> *ahem* many interesting and innovative aesthetic choices when it comes<br> to things like verb tenses and punctuation, and VD lets them all stand.)</br></br></br></br></br></i></p><p>That<br> sort of writer is bound to get on well with that sort of editor. Bit<br> rough on the readers, of course, but, pffft, what do they know?<br> – Steve Wright on February 17, 2016</br></br></br></p><p><i>I suspect that what he was good at was being edited by David Hartwell.</i><br> – Peter J on February 17, 2016</br></p><p><i>JCW,<br> while styling himself as a coldly-rational intellectual, reveals that<br> he’s actually a fool whose opinions are driven entirely by ignorance,<br> arrogance, and emotion. Every thing he’s written over the last year has<br> made it very apparent just how much his career is owed to the efforts of<br> the editors at Tor who transformed his usual drivel into something<br> coherent.</br></br></br></br></br></br></i><br> – Aaron on February 17, 2016</br></p></blockquote><p>It is hard to decide whether I am more flattered by the estimable Mr. Wright’s high regard or amused by the level of ignorance demonstrated by the usual suspects. The former, I am finally forced to conclude, as I have come to expect the latter from the low-IQ denizens of an otherwise very good site.</p><p>You see, I have perspective that they do not. Unlike them, I have seen Mr. Wright’s unedited prose. I know exactly what it looks like. And as it happens, it looks very much like the prose that appears in Mr. Wright’s novels that are published by Tor Books. John is an excellent writer; he is one of the greatest SF/F writers alive. But he writes very, very quickly and he is prone to what one might describe as an exuberant approach to writing. Last year, Castalia House offered him a contract for a 60k-word book. I am now reading the manuscript, which clocks in at nearly 200k words.</p><p>Even those authors who don’t like Mr. Wright or his style might well contemplate suicide if they truly understood how speedily and effortlessly the man writes… and writes well. When I say he is a great writer, I do not do so lightly, nor do I do so because I am fortunate enough to publish some of his works. I say it out of pure envy and awe.</p><p>Now, I am not privy to the details of the editing process at Tor Books. I have not discussed it with Mr. Wright or anyone else. But it would not have surprised me in the slightest to learn that it frequently consists of sending the manuscript directly to the proofreaders, correcting any infelicities of grammar and typos, then publishing the book without any real editorial activity at all. And I wouldn’t be surprised to learn that David Hartwell had not even read all of the books that he “edited” either.</p><p>As Castalia House authors know, I either edit a book or I decline to edit it. If I edit it, I decide whether I will apply a scalpel or a machete to the text. In the case of certain authors, I ask them if they would prefer a scalpel or a machete, and honor their preference even if I think it is mistaken. In one recent case, I removed one-third of the manuscript’s word count. In another case, I had the author cut out more than 20,000 words. I suspect that I have excised more words from a single novella by John C. Wright than Mr. Hartwell did from Mr. Wright’s entire oeuvre. So, not only do I “meddle in my writers’ texts”, I do so much more heavily than the average editor does.</p><p>The mistake that these File 770 commenters are making is thinking that one can reasonably judge the quality of an editor’s work by the final product. You cannot. You can only judge it by comparing the submitted draft of the manuscript to the final product. For example, my<br> book <i>The World in Shadow</i> is a MUCH better book than <i>The War in<br> Heaven</br></i>. It is better in every way. But the editor at Pocket Books did a brilliant job on <i>The War<br> in Heaven,</br></i> because the first draft was a disaster and she made me<br> rewrite the entire book twice, with lots of hands-on advice and examples.</br></br></p><p>But she did nothing on <i>The World in Shadow</i>, she did <i>literally nothing</i>. Her entire<br> editing process consisted of telling me that the book was good to go as submitted. The published book is nearly word-for-word identical to my submitted manuscript, so much so that we were later able to create the ebook from the unedited submission.</br></p><p>It is true, for example, that Rolf Nelson takes a uniquely creative approach to verb tenses and punctuation, but it is very, very far from the truth to claim that I let them all stand. Why do we publish him, then? Because Rolf is an excellent storyteller, and if you are more interested in grammar than story and characterization, then you are not part of Castalia House’s target market. Literary style is only one of the four major aspects of writing; one of the reasons that Castalia House exists is because the mainstream publishing houses have become overly obsessed with style and ideology at the expense of story, characters, and ideas.</p><p>And I will go so far as to say this: I am a much better editor than whoever is supposed to be editing George RR Martin’s books. Had I been the editor, <i>A Dance with Dragons</i> would have been 700 pages shorter and it would have been considerably more enjoyable.</p><p>UPDATE: It appears my surmise about the extent to which Mr. Wright’s books were edited at Tor Books <a href=\"http://file770.com/?p=27583&amp;cpage=4#comment-401091\">was correct</a>, as per L. Jagi Lamplighter Wright</p><blockquote class=\"tr_bq\"><p> Just in case anyone wondered: John has tremendous respect for Mr. Hartwell, whom he admired, appreciated working with, and liked as a person. But Mr. Hartwell almost never made any changes to John’s manuscripts.</p></blockquote></div>",
  "content_text": "The SF-SJWs at File 770 are appalled at the fact that Tor Books and Castalia House author John C. Wright is willing to go on the record and state that,\nin his opinion,\nI am a better editor\nthan the late, Hugo Award-winning editor\nDavid Hartwell:\nThese are the recommendations of my editor,\nTheodore Beale, aka Vox Day, the most hated man in Science Fiction, but\ncertainly the best editor I have had the pleasure to work with.\n– John C. Wright\nCharming. Take this and go home, David Hartwell, as we would say in Italy.\n– Anna Feruglio Dal Dan on February 17, 2016 at 3:51 am\nJCW is a writer convinced that his every work is a glittering jewel of\nexquisite literary craftsmanship. VD is an editor who doesn’t meddle\nwith his writers’ texts. (For an example of this, see “Shakedown Cruise”\nin Riding the Red Horse, where Campbell nominee Rolf Nelson makes\n*ahem* many interesting and innovative aesthetic choices when it comes\nto things like verb tenses and punctuation, and VD lets them all stand.)\nThat\nsort of writer is bound to get on well with that sort of editor. Bit\nrough on the readers, of course, but, pffft, what do they know?\n– Steve Wright on February 17, 2016\nI suspect that what he was good at was being edited by David Hartwell.\n– Peter J on February 17, 2016\nJCW,\nwhile styling himself as a coldly-rational intellectual, reveals that\nhe’s actually a fool whose opinions are driven entirely by ignorance,\narrogance, and emotion. Every thing he’s written over the last year has\nmade it very apparent just how much his career is owed to the efforts of\nthe editors at Tor who transformed his usual drivel into something\ncoherent.\n– Aaron on February 17, 2016\nIt is hard to decide whether I am more flattered by the estimable Mr. Wright’s high regard or amused by the level of ignorance demonstrated by the usual suspects. The former, I am finally forced to conclude, as I have come to expect the latter from the low-IQ denizens of an otherwise very good site.\nYou see, I have perspective that they do not. Unlike them, I have seen Mr. Wright’s unedited prose. I know exactly what it looks like. And as it happens, it looks very much like the prose that appears in Mr. Wright’s novels that are published by Tor Books. John is an excellent writer; he is one of the greatest SF/F writers alive. But he writes very, very quickly and he is prone to what one might describe as an exuberant approach to writing. Last year, Castalia House offered him a contract for a 60k-word book. I am now reading the manuscript, which clocks in at nearly 200k words.\nEven those authors who don’t like Mr. Wright or his style might well contemplate suicide if they truly understood how speedily and effortlessly the man writes… and writes well. When I say he is a great writer, I do not do so lightly, nor do I do so because I am fortunate enough to publish some of his works. I say it out of pure envy and awe.\nNow, I am not privy to the details of the editing process at Tor Books. I have not discussed it with Mr. Wright or anyone else. But it would not have surprised me in the slightest to learn that it frequently consists of sending the manuscript directly to the proofreaders, correcting any infelicities of grammar and typos, then publishing the book without any real editorial activity at all. And I wouldn’t be surprised to learn that David Hartwell had not even read all of the books that he “edited” either.\nAs Castalia House authors know, I either edit a book or I decline to edit it. If I edit it, I decide whether I will apply a scalpel or a machete to the text. In the case of certain authors, I ask them if they would prefer a scalpel or a machete, and honor their preference even if I think it is mistaken. In one recent case, I removed one-third of the manuscript’s word count. In another case, I had the author cut out more than 20,000 words. I suspect that I have excised more words from a single novella by John C. Wright than Mr. Hartwell did from Mr. Wright’s entire oeuvre. So, not only do I “meddle in my writers’ texts”, I do so much more heavily than the average editor does.\nThe mistake that these File 770 commenters are making is thinking that one can reasonably judge the quality of an editor’s work by the final product. You cannot. You can only judge it by comparing the submitted draft of the manuscript to the final product. For example, my\nbook\nThe World in Shadow\nis a MUCH better book than\nThe War in\nHeaven\n. It is better in every way. But the editor at Pocket Books did a brilliant job on\nThe War\nin Heaven,\nbecause the first draft was a disaster and she made me\nrewrite the entire book twice, with lots of hands-on advice and examples.\nBut she did nothing on\nThe World in Shadow\n, she did\nliterally nothing\n. Her entire\nediting process consisted of telling me that the book was good to go as submitted. The published book is nearly word-for-word identical to my submitted manuscript, so much so that we were later able to create the ebook from the unedited submission.\nIt is true, for example, that Rolf Nelson takes a uniquely creative approach to verb tenses and punctuation, but it is very, very far from the truth to claim that I let them all stand. Why do we publish him, then? Because Rolf is an excellent storyteller, and if you are more interested in grammar than story and characterization, then you are not part of Castalia House’s target market. Literary style is only one of the four major aspects of writing; one of the reasons that Castalia House exists is because the mainstream publishing houses have become overly obsessed with style and ideology at the expense of story, characters, and ideas.\nAnd I will go so far as to say this: I am a much better editor than whoever is supposed to be editing George RR Martin’s books. Had I been the editor,\nA Dance with Dragons\nwould have been 700 pages shorter and it would have been considerably more enjoyable.\nUPDATE: It appears my surmise about the extent to which Mr. Wright’s books were edited at Tor Books\nwas correct\n, as per L. Jagi Lamplighter Wright\nJust in case anyone wondered: John has tremendous respect for Mr. Hartwell, whom he admired, appreciated working with, and liked as a person. But Mr. Hartwell almost never made any changes to John’s manuscripts.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-18T13:03:00+00:00"
}