{
  "url": "https://voxday.net/2016/02/05/rabid-puppies-2016-best-fanzine/",
  "scraped_at": "2025-12-17T17:44:41.327456",
  "title": "Rabid Puppies 2016: Best Fanzine",
  "date_display": "February 5, 2016",
  "date_iso": "2016-02-05T13:00:00+00:00",
  "date_from_url": "2016-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This appears to be one of those increasingly misnamed and outdated categories, but based on the previous nominees, it has apparently become the functional equivalent of “best SF-related site”. Using that as a guideline while keeping the eligibility rules in mind, here are the preliminary recommendations for Best Fanzine:</p><ul><li><a href=\"https://www.blackgate.com/\">Black Gate</a></li><li><a href=\"http://www.castaliahouse.com/posts/\">Castalia House blog</a></li><li><a href=\"http://file770.com/\">File 770</a></li><li><a href=\"http://madgeniusclub.com/\">Mad Genius Club </a></li><li><a href=\"http://www.tangentonline.com/\">Tangent Online</a></li></ul><p><i>Black Gate</i> succumbed to the genetic fallacy in turning down last year’s nomination; regardless of whether John O’Neill will do the same or not again this year, it remained the best SF-related site in 2015. That being said, the <i>Castalia House blog</i>, now under the leadership of the Hugo-nominated Jeffro Johnson, is rapidly gaining on it with the addition of excellent Castalians from the SF/F wargaming, computer gaming, and RPG worlds.</p><p><i>File 770</i>, for all that it has been said to be a “wretched hive of scum and villainy” and features some of the least intelligent commenters on the Internet, does an excellent job of chronicling events in the SF/F world across the ideological spectrum. Mike Glyer’s fan-flagship site continues to be a must-read for anyone even remotely interested in science fiction.<br> <i><br/></i><br> <i>Tangent Online</i>, as one of the very few places that reviews short fiction, is one of the few sites helping keep SF short fiction alive. <i>Mad Genius Club</i> can be hit or miss, but contains everything from writing advice and industry analysis to Hugo history, short stories, and meandering streams-of-consciousness. You never know what you’re going to get from the 12 unsettled prodigies who make up the madhouse, but it’s interesting and even educational more often than not.</br></br></p><p>And like these five fanzines or not, ideologically approve of their contributors or not, they are the sites that were most influential in driving the discussion in the SF world in 2015.</p><p> <b>Other 2016 Hugo categories</b></p><ul><li><a href=\"http://www.milobookclub.com/2016/02/04/rabid-puppies-2016-best-fancas/\">Best Fancast</a></li><li><a href=\"http://www.milobookclub.com/2016/02/03/rabid-puppies-2016-best-fan-writer/\">Best Fan Writer </a></li><li><a href=\"http://www.milobookclub.com/2016/02/02/rabid-puppies-2016-best-fan-artis/\">Best Fan Artist</a></li><li><a href=\"http://www.milobookclub.com/2016/02/01/rabid-puppies-2016-best-new-writer/\">Best New Writer</a></li></ul></div>",
  "content_text": "This appears to be one of those increasingly misnamed and outdated categories, but based on the previous nominees, it has apparently become the functional equivalent of “best SF-related site”. Using that as a guideline while keeping the eligibility rules in mind, here are the preliminary recommendations for Best Fanzine:\nBlack Gate\nCastalia House blog\nFile 770\nMad Genius Club\nTangent Online\nBlack Gate\nsuccumbed to the genetic fallacy in turning down last year’s nomination; regardless of whether John O’Neill will do the same or not again this year, it remained the best SF-related site in 2015. That being said, the\nCastalia House blog\n, now under the leadership of the Hugo-nominated Jeffro Johnson, is rapidly gaining on it with the addition of excellent Castalians from the SF/F wargaming, computer gaming, and RPG worlds.\nFile 770\n, for all that it has been said to be a “wretched hive of scum and villainy” and features some of the least intelligent commenters on the Internet, does an excellent job of chronicling events in the SF/F world across the ideological spectrum. Mike Glyer’s fan-flagship site continues to be a must-read for anyone even remotely interested in science fiction.\nTangent Online\n, as one of the very few places that reviews short fiction, is one of the few sites helping keep SF short fiction alive.\nMad Genius Club\ncan be hit or miss, but contains everything from writing advice and industry analysis to Hugo history, short stories, and meandering streams-of-consciousness. You never know what you’re going to get from the 12 unsettled prodigies who make up the madhouse, but it’s interesting and even educational more often than not.\nAnd like these five fanzines or not, ideologically approve of their contributors or not, they are the sites that were most influential in driving the discussion in the SF world in 2015.\nOther 2016 Hugo categories\nBest Fancast\nBest Fan Writer\nBest Fan Artist\nBest New Writer",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-02-05T13:00:00+00:00"
}