{
  "url": "https://voxday.net/2016/02/26/racial-identity-is-dispositive/",
  "scraped_at": "2025-12-17T17:47:33.443298",
  "title": "Racial identity is dispositive",
  "date_display": "February 26, 2016",
  "date_iso": "2016-02-26T20:30:00+00:00",
  "date_from_url": "2016-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I said, I always find Sarah Hoyt’s take on things both interesting and amusing. In this case, it’s because she completely fails to see how utterly predictable her response is, or how she is unwittingly providing observable support to the very argument she intellectually rejects:</p><blockquote class=\"tr_bq\"><p> <i>One thesis I have seen a lot in recent months at The Blog Which Is A Misspelled Religious Latin Term is, to boil it down to its harshest formulation, “Shoot the Moderates”, because essentially the community there has given up on the idea that anything less than the extremism therein advocated will work, and that any attempt to restrain, control or suspend that extremism — for the sake of preserving future strategic alliances, for example — amounts to shooting your soldiers in the back when they look like they might be winning. From a certain point of view, I understand this reaction, but to me it is essentially saying, “We are sliding backwards so fast that we may as well disconnect the brakes,” without worrying about what will happen if you do successfully reverse the slide only to rocket back up the slope and go over the peak too fast. Reasonable men can argue in good faith over the difference in judgment required, but it strikes me as the stance of an unreasonable man to insist that even to ask to have the argument is sufficient grounds for rejecting it.</i></p><p>    accordingtohoyt | Reply   </p><p>THIS. and that’s why I said “they’re killing the republic I love and it feels like they’re killing me.” And when we respond we get told we’re insulting THEM. Oh, for heaven’s sake people, we’re just trying to understand why otherwise rational people would respond so irrationally. We would like you to leave us our republic. We’d like to keep it. And it’s not like I haven’t been fighting the progs all along. It’s not like I haven’t been in the trenches. What more could I do? Defend and imaginary “white race?” Screw that. any philosophy that enshrines your pasty white middle aged guy over Dr. Sowell is sick. I will not shut up. I will not submit.</p></blockquote><p>The white race is not imaginary. America as an Anglo-Saxon nation is not imaginary. What is imaginary is the “proposition nation” version of America that she, the Portuguese immigrant, erroneously believes America to be. Red Eagle and I cover this in moderate detail in <i>Cuckservative: How “Conservatives” Destroyed America</i>.</p><p>We’re not killing “the republic that she loves”. It never existed in the first place. Nations are not places, governments, or ideas. Nations are people. Nations are, as the Founding Fathers wrote, posterity.</p><p>Sarah may want to consider herself their posterity, but she is not and they would not regard her as such either. Her position requires denying both history and reality, and her postnationalism is as deluded as any progressives. And it’s hardly a surprise that the immigrant declares immigration, the very issue that is propelling Trump to the White House, isn’t a problem.</p><p>“Look, immigration is not even a real thing anymore.”</p><p>So the largest invasion in human history isn’t “a real thing anymore”? Sarah, with all due affection and respect, it’s not our opinion that is not reflective of reality. And Trump will not be Obama’s third term. I don’t know what he will be, but he won’t be that.</p><p>That being said, I do rather like the sound of “Shoot the Moderates”. They’re certainly not good for much else besides target practice. But here is the very important point so many people fail to understand: we’re not the extremists. We’re the only viable alternative to the extremists.</p><p>Finally, Sarah, when you “respond” by telling people they are “confused” and “crazy” and “monsters” and “buffoons” and irrational and insane, you <i>are </i>insulting them.</p></div>",
  "content_text": "As I said, I always find Sarah Hoyt’s take on things both interesting and amusing. In this case, it’s because she completely fails to see how utterly predictable her response is, or how she is unwittingly providing observable support to the very argument she intellectually rejects:\nOne thesis I have seen a lot in recent months at The Blog Which Is A Misspelled Religious Latin Term is, to boil it down to its harshest formulation, “Shoot the Moderates”, because essentially the community there has given up on the idea that anything less than the extremism therein advocated will work, and that any attempt to restrain, control or suspend that extremism — for the sake of preserving future strategic alliances, for example — amounts to shooting your soldiers in the back when they look like they might be winning. From a certain point of view, I understand this reaction, but to me it is essentially saying, “We are sliding backwards so fast that we may as well disconnect the brakes,” without worrying about what will happen if you do successfully reverse the slide only to rocket back up the slope and go over the peak too fast. Reasonable men can argue in good faith over the difference in judgment required, but it strikes me as the stance of an unreasonable man to insist that even to ask to have the argument is sufficient grounds for rejecting it.\naccordingtohoyt | Reply\nTHIS. and that’s why I said “they’re killing the republic I love and it feels like they’re killing me.” And when we respond we get told we’re insulting THEM. Oh, for heaven’s sake people, we’re just trying to understand why otherwise rational people would respond so irrationally. We would like you to leave us our republic. We’d like to keep it. And it’s not like I haven’t been fighting the progs all along. It’s not like I haven’t been in the trenches. What more could I do? Defend and imaginary “white race?” Screw that. any philosophy that enshrines your pasty white middle aged guy over Dr. Sowell is sick. I will not shut up. I will not submit.\nThe white race is not imaginary. America as an Anglo-Saxon nation is not imaginary. What is imaginary is the “proposition nation” version of America that she, the Portuguese immigrant, erroneously believes America to be. Red Eagle and I cover this in moderate detail in\nCuckservative: How “Conservatives” Destroyed America\n.\nWe’re not killing “the republic that she loves”. It never existed in the first place. Nations are not places, governments, or ideas. Nations are people. Nations are, as the Founding Fathers wrote, posterity.\nSarah may want to consider herself their posterity, but she is not and they would not regard her as such either. Her position requires denying both history and reality, and her postnationalism is as deluded as any progressives. And it’s hardly a surprise that the immigrant declares immigration, the very issue that is propelling Trump to the White House, isn’t a problem.\n“Look, immigration is not even a real thing anymore.”\nSo the largest invasion in human history isn’t “a real thing anymore”? Sarah, with all due affection and respect, it’s not our opinion that is not reflective of reality. And Trump will not be Obama’s third term. I don’t know what he will be, but he won’t be that.\nThat being said, I do rather like the sound of “Shoot the Moderates”. They’re certainly not good for much else besides target practice. But here is the very important point so many people fail to understand: we’re not the extremists. We’re the only viable alternative to the extremists.\nFinally, Sarah, when you “respond” by telling people they are “confused” and “crazy” and “monsters” and “buffoons” and irrational and insane, you\nare\ninsulting them.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-26T20:30:00+00:00"
}