{
  "url": "https://voxday.net/2016/02/28/rubio-and-fox-news-sold-out-america/",
  "scraped_at": "2025-12-17T17:47:45.210824",
  "title": "Rubio and Fox News sold out America",
  "date_display": "February 28, 2016",
  "date_iso": "2016-02-28T09:29:00+00:00",
  "date_from_url": "2016-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t get much more politically damning than <a href=\"http://www.nytimes.com/2016/02/28/us/politics/marco-rubio-pushed-for-immigration-reform-with-conservative-media.html?_r=1\">this unexpected news of a media sellout</a>. And it’s more than just the usual anti-Republican hit piece from the New York Times, because it leaves Rush Limbaugh, of all people, in a position to confirm it:</p><blockquote class=\"tr_bq\"><p> A few weeks after Senator Marco Rubio joined a bipartisan push for an immigration overhaul in 2013, he arrived alongside Senator Chuck Schumer at the executive dining room of News Corporation’s Manhattan headquarters for dinner.</p><p>Their mission was to persuade Rupert Murdoch, the owner of the media empire, and Roger Ailes, the chairman and chief executive of its Fox News division, to keep the network’s on-air personalities from savaging the legislation and give it a fighting chance at survival.</p><p>Mr. Murdoch, an advocate of immigration reform, and Mr. Ailes, his top lieutenant and the most powerful man in conservative television, agreed at the Jan. 17, 2013, meeting to give the senators some breathing room.</p><p>But the media executives, highly attuned to the intensifying anger in the Republican grass roots, warned that the senators also needed to make their case to Rush Limbaugh, the king of conservative talk radio, who held enormous sway with the party’s largely anti-immigrant base.</p></blockquote><p>Looks like Donald Trump’s instincts served him well when he refused to genuflect before the cuckservatives at Fox. And Rush doesn’t appear to be inclined to give either Fox or Rubio any cover.</p><p><i>“Mr.<br> Limbaugh shed light on his interactions with the senators when he told a<br> caller frustrated with his criticism of Mr. Rubio that the immigration<br> position the senator had advocated “comes right out of the Gang of Eight<br> bill.” Mr. Limbaugh added, “I’ve had it explained to me by no less than Senator Schumer.”</br></br></br></br></i></p><p>I assumed Rubio was done after Trump beats him in his home state of Florida, but after this revelation, I think he’s done now. Even establishment Republicans will be appalled by his successful attempt to corrupt Fox News and turn it against conservatives, to say nothing of their joint attempt to turn Rush Limbaugh.</p><p>I like Fox and its pretty blondes better than the ABCNNBCBS cabal to which it is the alternative, but I’ve never trusted it and I haven’t watched it in over a decade. People at Fox helped kill my <i>Media Whores </i>book at Thomas Nelson because it criticized Bill O’Reilly and Michelle Malkin, so I’m well aware that they’re on the Republican Left, but this anti-American, anti-conservative collusion with pro-immigration Republicans and Democrats is stunning.</p></div>",
  "content_text": "It doesn’t get much more politically damning than\nthis unexpected news of a media sellout\n. And it’s more than just the usual anti-Republican hit piece from the New York Times, because it leaves Rush Limbaugh, of all people, in a position to confirm it:\nA few weeks after Senator Marco Rubio joined a bipartisan push for an immigration overhaul in 2013, he arrived alongside Senator Chuck Schumer at the executive dining room of News Corporation’s Manhattan headquarters for dinner.\nTheir mission was to persuade Rupert Murdoch, the owner of the media empire, and Roger Ailes, the chairman and chief executive of its Fox News division, to keep the network’s on-air personalities from savaging the legislation and give it a fighting chance at survival.\nMr. Murdoch, an advocate of immigration reform, and Mr. Ailes, his top lieutenant and the most powerful man in conservative television, agreed at the Jan. 17, 2013, meeting to give the senators some breathing room.\nBut the media executives, highly attuned to the intensifying anger in the Republican grass roots, warned that the senators also needed to make their case to Rush Limbaugh, the king of conservative talk radio, who held enormous sway with the party’s largely anti-immigrant base.\nLooks like Donald Trump’s instincts served him well when he refused to genuflect before the cuckservatives at Fox. And Rush doesn’t appear to be inclined to give either Fox or Rubio any cover.\n“Mr.\nLimbaugh shed light on his interactions with the senators when he told a\ncaller frustrated with his criticism of Mr. Rubio that the immigration\nposition the senator had advocated “comes right out of the Gang of Eight\nbill.” Mr. Limbaugh added, “I’ve had it explained to me by no less than Senator Schumer.”\nI assumed Rubio was done after Trump beats him in his home state of Florida, but after this revelation, I think he’s done now. Even establishment Republicans will be appalled by his successful attempt to corrupt Fox News and turn it against conservatives, to say nothing of their joint attempt to turn Rush Limbaugh.\nI like Fox and its pretty blondes better than the ABCNNBCBS cabal to which it is the alternative, but I’ve never trusted it and I haven’t watched it in over a decade. People at Fox helped kill my\nMedia Whores\nbook at Thomas Nelson because it criticized Bill O’Reilly and Michelle Malkin, so I’m well aware that they’re on the Republican Left, but this anti-American, anti-conservative collusion with pro-immigration Republicans and Democrats is stunning.",
  "tags": [
    "corpocracy",
    "immigration",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-28T09:29:00+00:00"
}