{
  "url": "https://voxday.net/2016/02/03/sjw-attempts-to-block-weir-nomination/",
  "scraped_at": "2025-12-17T17:44:22.685185",
  "title": "SJW attempts to block Weir nomination",
  "date_display": "February 3, 2016",
  "date_iso": "2016-02-03T01:56:00+00:00",
  "date_from_url": "2016-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://file770.com/?p=27347&amp;cpage=2#comment-395246\">File 770</a>:</p><blockquote class=\"tr_bq\"><p> steve davidson on February 2, 2016 at 7:48 am said:<br> I asked Weir to publicly repudiate the slate inclusion. He has responded that he does not get involved with politics.</br></p></blockquote><p>(laughs) They are a predictable lot, are they not? Especially when I’ve made it perfectly clear that there is no “slate” per se, there is simply a list of the sort of personal recommendations that many other individuals who read science fiction and fantasy are making. And since we are reliably informed that very few individuals read this blog, it seems strange that so many SJWs get so worked up over what I have read, and what I recommend.</p><p>It is hardly my fault that I have such exquisite taste that is so broadly echoed by hundreds of fellow science fiction and fantasy readers.</p><p>As for why I did not recommend Mr. Weir as Best New Writer last year, it was for a very simple and straightforward reason: I had not read his novel. Unlike so many of the SJWs, I do not recommend novels I have not read, writers whose books I have not read, or artists whose work I have not seen.  Those who have not brought their works to my attention have only themselves, and their publishers, to blame if I remain unfamiliar with them. I am but a mere superintelligence; I am not omniscient.</p><p>It is perhaps worth noting, again, that I do not care in the least what a writer or an artist happens to think about being recommended; <i>die Gedanken sind frei. </i>People can recuse themselves, publicly repudiate, or virtue-signal, or perform interpretive dance to express the depth of their feelings about Rabid Puppies. It makes no difference to me.</p><p>That being said, it appears Marc Miller is not eligible for Best New Writer despite having published his debut novel in 2015. I shall have to revisit that category at a later date.</p></div>",
  "content_text": "From\nFile 770\n:\nsteve davidson on February 2, 2016 at 7:48 am said:\nI asked Weir to publicly repudiate the slate inclusion. He has responded that he does not get involved with politics.\n(laughs) They are a predictable lot, are they not? Especially when I’ve made it perfectly clear that there is no “slate” per se, there is simply a list of the sort of personal recommendations that many other individuals who read science fiction and fantasy are making. And since we are reliably informed that very few individuals read this blog, it seems strange that so many SJWs get so worked up over what I have read, and what I recommend.\nIt is hardly my fault that I have such exquisite taste that is so broadly echoed by hundreds of fellow science fiction and fantasy readers.\nAs for why I did not recommend Mr. Weir as Best New Writer last year, it was for a very simple and straightforward reason: I had not read his novel. Unlike so many of the SJWs, I do not recommend novels I have not read, writers whose books I have not read, or artists whose work I have not seen.  Those who have not brought their works to my attention have only themselves, and their publishers, to blame if I remain unfamiliar with them. I am but a mere superintelligence; I am not omniscient.\nIt is perhaps worth noting, again, that I do not care in the least what a writer or an artist happens to think about being recommended;\ndie Gedanken sind frei.\nPeople can recuse themselves, publicly repudiate, or virtue-signal, or perform interpretive dance to express the depth of their feelings about Rabid Puppies. It makes no difference to me.\nThat being said, it appears Marc Miller is not eligible for Best New Writer despite having published his debut novel in 2015. I shall have to revisit that category at a later date.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-03T01:56:00+00:00"
}