{
  "url": "https://voxday.net/2016/02/29/thank-you-for-coming/",
  "scraped_at": "2025-12-17T17:48:00.963184",
  "title": "Thank you for coming",
  "date_display": "February 29, 2016",
  "date_iso": "2016-02-29T20:00:00+00:00",
  "date_from_url": "2016-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Cernovich says that one ought to thank ten different people every day. So, I thought I’d get a few months out of the way all at once and thank each and every one of you for taking the time to visit here, read here, and comment here this month.</p><p>The reason is that I was rather pleased to observe that the blogs passed the two-million-monthly pageview mark today; Google reported 2,041,464 for February 2016. It’s more than a little surprising to finally crack two million on a short month, but apparently this Leap Year was propitious. I always enjoy surpassing the traffic levels McRapey used to lie to the media about having. Truth is so much more satisfying than fiction and one big advantage of simply telling the truth and not exaggerating is never having to worry about being caught out or keeping your various stories straight.</p><p>Strangely, despite having more than four times his site traffic, neither the <i>New York Times</i> nor the science fiction media ever describes me as “popular”, or calls this blog “influential”. I wonder why that might be?</p><p>In unrelated news, this was a pleasant surprise. I was at the gym, reading <i>Do We Need God To Be Good</i>, by anthropologist C.R. Hallpike, between sets, when I came across this passage.</p><p><i>It is surely rather naive, then, to think that religion is uniquely prone to generate mass slaughter and violent persecution, rather than being just one among a number of such factors that also include politics, race, social class, language, and nationality. It was these, not religion, which produced the wars of the last century, the most violent in history, and the belief that if we removed religion we could remove the main cause of human conflict is clearly incorrect. Indeed, many wars in history have had nothing to do with group hatreds at all, but have simply been the result of kingly ambition and the desire for territory, power, and plunder. Religion has actually been calculated to have been the primary cause of only about 7 per cent of the wars in recorded history, half of which involved Islam (Day 2008:105).</i></p><p>The main thing is for the ideas to circulate, of course, but it’s still nice to see that Dr. Hallpike got the citation correct. I’m about one-third of the way in and it’s a pretty good book, complete with a ruthless beatdown of evolutionary psychology from an anthropological perspective that borders on the epic. One might almost characterize it as Post-New Atheist, as the author takes a firmly secular approach while recognizing that science and religion may not always be in harmony, but are also very far from enemies, let alone opposites.</p></div>",
  "content_text": "Mike Cernovich says that one ought to thank ten different people every day. So, I thought I’d get a few months out of the way all at once and thank each and every one of you for taking the time to visit here, read here, and comment here this month.\nThe reason is that I was rather pleased to observe that the blogs passed the two-million-monthly pageview mark today; Google reported 2,041,464 for February 2016. It’s more than a little surprising to finally crack two million on a short month, but apparently this Leap Year was propitious. I always enjoy surpassing the traffic levels McRapey used to lie to the media about having. Truth is so much more satisfying than fiction and one big advantage of simply telling the truth and not exaggerating is never having to worry about being caught out or keeping your various stories straight.\nStrangely, despite having more than four times his site traffic, neither the\nNew York Times\nnor the science fiction media ever describes me as “popular”, or calls this blog “influential”. I wonder why that might be?\nIn unrelated news, this was a pleasant surprise. I was at the gym, reading\nDo We Need God To Be Good\n, by anthropologist C.R. Hallpike, between sets, when I came across this passage.\nIt is surely rather naive, then, to think that religion is uniquely prone to generate mass slaughter and violent persecution, rather than being just one among a number of such factors that also include politics, race, social class, language, and nationality. It was these, not religion, which produced the wars of the last century, the most violent in history, and the belief that if we removed religion we could remove the main cause of human conflict is clearly incorrect. Indeed, many wars in history have had nothing to do with group hatreds at all, but have simply been the result of kingly ambition and the desire for territory, power, and plunder. Religion has actually been calculated to have been the primary cause of only about 7 per cent of the wars in recorded history, half of which involved Islam (Day 2008:105).\nThe main thing is for the ideas to circulate, of course, but it’s still nice to see that Dr. Hallpike got the citation correct. I’m about one-third of the way in and it’s a pretty good book, complete with a ruthless beatdown of evolutionary psychology from an anthropological perspective that borders on the epic. One might almost characterize it as Post-New Atheist, as the author takes a firmly secular approach while recognizing that science and religion may not always be in harmony, but are also very far from enemies, let alone opposites.",
  "tags": [
    "McRapey",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-29T20:00:00+00:00"
}