{
  "url": "https://voxday.net/2016/02/25/the-stench-of-gamma/",
  "scraped_at": "2025-12-17T17:47:20.209574",
  "title": "The stench of gamma",
  "date_display": "February 25, 2016",
  "date_iso": "2016-02-25T16:00:00+00:00",
  "date_from_url": "2016-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Man, once you whiff it, you will never forget that bizarre scent of passive-aggression, insecurity, dishonesty, and truculence. One of Matt Walsh’s fans decided to jump in and white knight for Matt, and he appears to have obtained a copy of the McRapey playbook, right down to his very vocabulary:</p><blockquote class=\"tr_bq\"><p> Supreme Dark Lord @voxday<br>@mattwalshblog You sneer at Trump’s supporters. Trump tells them he loves them and wants them to be great. That is why you lose.</br></p><p>Paul Foeller @pfoeller<br>I’m not sneering at all. I’m echoing the sentiment that Trump supporters are all surface – and you’re proving it.</br></p><p>Supreme Dark Lord @voxday<br>You claim to be better than Trump’s supporters, but you’re not sneering?</br></p><p>Paul Foeller @pfoeller<br>I’m more policy-focused, yes. Do you disagree?</br></p><p>Supreme Dark Lord @voxday<br>I know nothing about you. The point is that you have publicly claimed to be better than all Trump supporters.</br></p><p>Paul Foeller @pfoeller<br>I don’t think I’m better. I think my views make more sense. There is a massive difference between the two.</br></p><p>Supreme Dark Lord @voxday<br>You said Trump’s supporters are all more superficial than you are. So, is being superficial a virtue or a vice?</br></p><p>Paul Foeller @pfoeller<br>Again, I’ve not done so. In fact, I’ve explicitly stated exactly the opposite. Do try to keep up?</br></p></blockquote><p>Read the rest <a href=\"http://alphagameplan.blogspot.com/2016/02/portraits-in-gamma.html\">at Alpha Game</a>. Keeping in mind that this is how he describes himself on Twitter: <i>“My wife’s only flaw is her taste in men.”</i></p><p>After all, there are few things that women find more attractive than a self-deprecating man with much to self-deprecate.<i> </i></p></div>",
  "content_text": "Man, once you whiff it, you will never forget that bizarre scent of passive-aggression, insecurity, dishonesty, and truculence. One of Matt Walsh’s fans decided to jump in and white knight for Matt, and he appears to have obtained a copy of the McRapey playbook, right down to his very vocabulary:\nSupreme Dark Lord @voxday\n@mattwalshblog You sneer at Trump’s supporters. Trump tells them he loves them and wants them to be great. That is why you lose.\nPaul Foeller @pfoeller\nI’m not sneering at all. I’m echoing the sentiment that Trump supporters are all surface – and you’re proving it.\nSupreme Dark Lord @voxday\nYou claim to be better than Trump’s supporters, but you’re not sneering?\nPaul Foeller @pfoeller\nI’m more policy-focused, yes. Do you disagree?\nSupreme Dark Lord @voxday\nI know nothing about you. The point is that you have publicly claimed to be better than all Trump supporters.\nPaul Foeller @pfoeller\nI don’t think I’m better. I think my views make more sense. There is a massive difference between the two.\nSupreme Dark Lord @voxday\nYou said Trump’s supporters are all more superficial than you are. So, is being superficial a virtue or a vice?\nPaul Foeller @pfoeller\nAgain, I’ve not done so. In fact, I’ve explicitly stated exactly the opposite. Do try to keep up?\nRead the rest\nat Alpha Game\n. Keeping in mind that this is how he describes himself on Twitter:\n“My wife’s only flaw is her taste in men.”\nAfter all, there are few things that women find more attractive than a self-deprecating man with much to self-deprecate.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-25T16:00:00+00:00"
}