{
  "url": "https://voxday.net/2016/02/27/the-donald-trump-of-science-fiction/",
  "scraped_at": "2025-12-17T17:47:35.291035",
  "title": "“The Donald Trump of Science Fiction”",
  "date_display": "February 27, 2016",
  "date_iso": "2016-02-27T10:17:00+00:00",
  "date_from_url": "2016-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Prophetic words <a href=\"http://maryrobinettekowal.com/journal/theordore-beale-donald-trump-science-fiction/\">from the Puppinette</a>:</p><blockquote class=\"tr_bq\"><p> Last year, during the lead up to the Hugos, I wrote a post about how this was more important than just a rocketship…. At the time, the idea that Donald Trump would be a serious front-runner for the Republican party was the fodder for jokes. It would never happen. But… if anyone was paying attention to what was happening in SFF, it should have been clear that the Rabid Puppies represented the same xenophobic, white supremacist drive that is giving Trump power.</p><p>Let me tell you, I’m terrified of the elections this year.</p><p>We’ve been writing dystopian novels as warnings for years. The Hunger Games? Reality Television as politics… not so far fetched right now, is it?</p><p>So let me be clear. The fight that is going on in SFF for inclusion is not small. It is not petty. It is a reflection of a much bigger problem, and if we, as a community, don’t start paying attention and trying to change the larger culture then we know how this will end.</p></blockquote><p>Mary Kowall is a low-energy liar and a blatant cheater who bought over 40 Hugo votes last year. But “the Donald Trump of Science Fiction”? Flattering! Great honor!</p><p>(I have to admit, I thought <a href=\"https://twitter.com/MaryRobinette/status/703307966200434688\">her tweet on the subject</a> was exactly eight percent funnier since it was about one “Theordore”.)</p><p>In any event, she’s right to be terrified of the elections. And she should be terrified of rather more than that. Little does she know what is on the horizon. Little does she know what is coming.</p><p>Her <a href=\"https://twitter.com/MaryRobinette/status/703310984417517569\">rather chagrined tweet</a> in response to the reaction to her comparison was even more amusing.</p><blockquote class=\"tr_bq\"><p> Mary Robinette Kowal @MaryRobinette<br> I suspected this would be the case. </br></p></blockquote><p>See, she totally meant to do that. They still don’t seem to grasp that <i>anything </i>they say about the Supreme Dark Lord can and will be used against <i>them</i>. And not only by me and the Vile Faceless Minions. Like the Republican establishment, the self-righteous SJWs of what presently passes for science fiction have <i>absolutely no idea</i> how deeply and broadly hated they are.</p><p>Look at the novels on the right sidebar of her site. Does that look like science fiction to you? Does it even look like fantasy? No, it’s fucking romance and that’s exactly how her Pink SF publisher is trying to sell it. To even call it Pink SF is a bit of a stretch.</p><p>And like the Republican establishment, the SJWs of Pink SF simply do not understand why so many people are <i>absolutely delighted</i> to be able to support the man those SJWs fear and hate, whether they agree with him on many things or not. I’m now seeing traffic levels the PSF-SJWs used to fantasize and <a href=\"http://www.milobookclub.com/2015/04/30/defensive-muc/\">lie about having</a>, and a fair amount of that is directly due to them.</p></div>",
  "content_text": "Prophetic words\nfrom the Puppinette\n:\nLast year, during the lead up to the Hugos, I wrote a post about how this was more important than just a rocketship…. At the time, the idea that Donald Trump would be a serious front-runner for the Republican party was the fodder for jokes. It would never happen. But… if anyone was paying attention to what was happening in SFF, it should have been clear that the Rabid Puppies represented the same xenophobic, white supremacist drive that is giving Trump power.\nLet me tell you, I’m terrified of the elections this year.\nWe’ve been writing dystopian novels as warnings for years. The Hunger Games? Reality Television as politics… not so far fetched right now, is it?\nSo let me be clear. The fight that is going on in SFF for inclusion is not small. It is not petty. It is a reflection of a much bigger problem, and if we, as a community, don’t start paying attention and trying to change the larger culture then we know how this will end.\nMary Kowall is a low-energy liar and a blatant cheater who bought over 40 Hugo votes last year. But “the Donald Trump of Science Fiction”? Flattering! Great honor!\n(I have to admit, I thought\nher tweet on the subject\nwas exactly eight percent funnier since it was about one “Theordore”.)\nIn any event, she’s right to be terrified of the elections. And she should be terrified of rather more than that. Little does she know what is on the horizon. Little does she know what is coming.\nHer\nrather chagrined tweet\nin response to the reaction to her comparison was even more amusing.\nMary Robinette Kowal @MaryRobinette\nI suspected this would be the case.\nSee, she totally meant to do that. They still don’t seem to grasp that\nanything\nthey say about the Supreme Dark Lord can and will be used against\nthem\n. And not only by me and the Vile Faceless Minions. Like the Republican establishment, the self-righteous SJWs of what presently passes for science fiction have\nabsolutely no idea\nhow deeply and broadly hated they are.\nLook at the novels on the right sidebar of her site. Does that look like science fiction to you? Does it even look like fantasy? No, it’s fucking romance and that’s exactly how her Pink SF publisher is trying to sell it. To even call it Pink SF is a bit of a stretch.\nAnd like the Republican establishment, the SJWs of Pink SF simply do not understand why so many people are\nabsolutely delighted\nto be able to support the man those SJWs fear and hate, whether they agree with him on many things or not. I’m now seeing traffic levels the PSF-SJWs used to fantasize and\nlie about having\n, and a fair amount of that is directly due to them.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-27T10:17:00+00:00"
}