{
  "url": "https://voxday.net/2016/02/29/the-mask-comes-off-2/",
  "scraped_at": "2025-12-17T17:47:54.382438",
  "title": "The mask comes off",
  "date_display": "February 29, 2016",
  "date_iso": "2016-02-29T07:00:00+00:00",
  "date_from_url": "2016-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Revealing <a href=\"http://accordingtohoyt.com/2016/02/28/i-was-born-american-a-blast-from-the-past-7-4-2014/\">the alien philosophy it concealed</a>. It only took a few hours for the Transamerican School of National Identity to declare that disenfranchisement of actual Americans in favor of Ameriboos was desirable.</p><blockquote class=\"tr_bq\"><p> <b>accordingtohoyt</b><br> This is VD’s bullshit. I can see it taking several generations to being fully civilized because part of it is a genetic selection thing, but in THAT case we’re all about somewhere close, myself included. Several generations to be fully American? Oh, take a powder. You need to be an idiot to believe that.</br></p><p><b>Amanda</b><br> I will take Sarah and all those like her who want to come to this country, who do so legally and who take all appropriate steps to become a citizen any day of the week over someone who looks down on them because they were not born here. Right now, Sarah looks much more “American” than you.</br></p><p><b>thewriterinblack  </b> <br> <i>“The immigrant becomes a citizen. The immigrant lays claim to now being American. Only by law, Sarah.”</i></br></p><p>This statement demonstrates that Sarah is more American than you are. Because she believes in what makes America, America. And you don’t.<br> <b><br/></b><br> <b>Stephen W. Houghton</b><br> My paternal ancestors have been here since before the war of independence. I say Americans are those who take the oath and stand with us. Traitors, those what ever their blood who do not…. Go and lick your Donald’s hand, may your chains lay lightly upon you, and may our posterity forget that you were our countryman.</br></br></br></p><p><b>Randy Wilde</b><br> Meh. She’s more American than many people born in the U.S. She actually believes in the ideals on which the country was founded.</br></p><p><b>Paul (Drak Bibliophile) Howard </b><br> Nope and by my standards, you’re not a Real American and Sarah is.</br></p><p><b>Nicki  </b> <br> You’re a fucking moron, and you don’t DESERVE the citizenship of this great nation.</br></p><p><b>jccarlton</b><br> Here’s the thing, Vox, YOU don’t get a say in who’s an American, not anymore. You’ve given that up for a villa in Italy. I imagine that you enjoy it, that means that you no longer have to deal with America’s problems. All your problem are the problems of Europe and you are welcome to them. As for REAL Americans, I would rather have some of the people I’ve had the pleasure of knowing over the years than somebody who is as childish and cowardly as you, Vox. You ran from America’s problems and then had the unmitigated GALL to say that Sarah isn’t good enough to be an American.</br></p></blockquote><p>My, these transamericans are certainly entitled, aren’t they? Not only can they tell Americans what Real Americans are and are not, but they are going to kick out everyone who doesn’t think like they do, no matter whose posterity they happen might be! Nations aren’t genetically-related peoples, after all, but mere collections of similarly-minded groupthinkers.</p><p>Notice that I never said anything about Sarah being good enough to be an American. I never said anything about being American being something good, or even <i>desirable</i>. What I stated is a simple fact, one no more controversial than Sarah being female. She is Portuguese. She is not American. Becoming a U.S. citizen is paperwork; the mere fact that one has to <i>become </i>a U.S. citizen is sufficient to indicate that one is not an American. As it happens, I even know a few Americans who are not U.S. citizens.</p><p>Amongst all the emoting, hissy-fitting, posturing, and outrage, only one commenter, Ironbear, was sufficiently perspicacious to note how “the proposition nation” is not only ahistorical fiction, but in practice, <i>must </i>be intrinsically opposed to the genuine Rights of Englishmen on which the original Anglo-American nation was founded.</p><blockquote class=\"tr_bq\"><p> Is there a way to maintain and defend a nation of ideas without disenfranchising those who demonstrably don’t share those ideas, even though they be born here?</p><p>Saying that “We were able to sustain a nation of ideas as long as America remained a melting pot,” is true, but not useful in that context. The America that was is dead dead, and toxic ideas introduced, propagated, and made colour of law and custom by our supposed fellows murdered it – using the power of the vote, among other weapons.</p><p>I find Mrs. Hoyt’s concept of a prospective nation formed of ideas, ideals, and based upon shared experiences and principles to be aesthetically pleasing. I also see it as being extremely vulnerable, and demonstrably difficult to defend – unless one is willing to go all the way to the walls in eradicating ideas that are toxic to it, which our relatively recent ancestors didn’t. (I strongly suspect that they didn’t truly see the danger and the toxicity of Marxism until it was too late, or even really recognize what was killing us even then.)</p><p>The extremes required to protect those ideas from those who would destroy them with toxic ones are unpalatable as well, and not the least bit aesthetically or otherwise pleasing to me. I find that to be depressing, and without hope of a resolution that is not borne of fire and blood.</p></blockquote><p>He is correct to be dubious. Their “proposition nation” is not even theoretically possible without the sort of thought police that their self-definitive ideals must reject. Defining a nation as a proposition is as intrinsically absurd and self-negating as feminism or communism or open-borders libertarianism. These transamerican idealists consider themselves to be intelligent and well-educated, and yet they have observably failed to even <i>begin </i>to think through the <i>necessary</i> consequences of the very values they erroneously claim makes one American.</p><p>And that, my dear Sarah, is one thing that you really should learn from me: ruthlessly thinking through the logical consequences of your foundational assumptions. As it stands, her core position is fundamentally illogical. On the other hand, at least she does seem to have changed her mind about my finally understanding Europe.</p><blockquote class=\"tr_bq\"><p> He’s become European through and through. He doesn’t wish the US well (doesn’t take much reading to see him gloating at potential destruction of the US. And all I have to do to attract his attention and unhinge him is say the US will survive, even though I don’t direct it at him.)</p><p>Under those circumstances for any American to follow his lead on things like presidential nominations is insane.</p><p>I don’t wish VD any harm — in fact, he’s pretty much irrelevant to me, in any way our paths intersect — and his ideas might yet win out in Europe. For America they’re a poison pill and as bad as Obama’s.</p></blockquote><p>(Spreads hands and smiles.) Unhinged? Quite the contrary. Sarah and her commenters have beautifully demonstrated exactly what I intended from the start. Their naive USian ideals are fundamentally and functionally antithetical to the historical American ideals they ape so clumsily.</p><p>Depending upon how one reckons it, we stand on the verge of the fourth America. I count them as follows:</p><p>America 1.0: Constitutional America 1789-1865<br> America 2.0: American Empire 1865-1913<br> America 3.0: Republican US 1913-1941<br> America 3.1: Early Imperial US 1941-1965<br> America 3:2: Latter Imperial US 1965~2033 (est)<br> America 4.0: Post-US~2033</br></br></br></br></br></p><p>Sarah and her defenders are confusing America 2.0 for America 1.0, and are completely unaware that they living in an America 3.2 that is rapidly laying the groundwork for the Post-US. And while I still value the ideals of America 1.0, with a very few exceptions they simply don’t exist in the USA anymore. As for what Sarah calls my “ideas”, they will win out in both the USA and in Europe for the simple reason that they are not my ideas, they are simply my observations of what is <i>already happening</i>.</p><p>It is easy to know that I am much more likely to be correct than they are. Lacking imagination – ironic given how many SF writers are there – they assume the future will be the status quo extended into the future. And it will not be. Whatever it will be, it will most certainly not be that, not after the largest invasion in human history.</p></div>",
  "content_text": "Revealing\nthe alien philosophy it concealed\n. It only took a few hours for the Transamerican School of National Identity to declare that disenfranchisement of actual Americans in favor of Ameriboos was desirable.\naccordingtohoyt\nThis is VD’s bullshit. I can see it taking several generations to being fully civilized because part of it is a genetic selection thing, but in THAT case we’re all about somewhere close, myself included. Several generations to be fully American? Oh, take a powder. You need to be an idiot to believe that.\nAmanda\nI will take Sarah and all those like her who want to come to this country, who do so legally and who take all appropriate steps to become a citizen any day of the week over someone who looks down on them because they were not born here. Right now, Sarah looks much more “American” than you.\nthewriterinblack\n“The immigrant becomes a citizen. The immigrant lays claim to now being American. Only by law, Sarah.”\nThis statement demonstrates that Sarah is more American than you are. Because she believes in what makes America, America. And you don’t.\nStephen W. Houghton\nMy paternal ancestors have been here since before the war of independence. I say Americans are those who take the oath and stand with us. Traitors, those what ever their blood who do not…. Go and lick your Donald’s hand, may your chains lay lightly upon you, and may our posterity forget that you were our countryman.\nRandy Wilde\nMeh. She’s more American than many people born in the U.S. She actually believes in the ideals on which the country was founded.\nPaul (Drak Bibliophile) Howard\nNope and by my standards, you’re not a Real American and Sarah is.\nNicki\nYou’re a fucking moron, and you don’t DESERVE the citizenship of this great nation.\njccarlton\nHere’s the thing, Vox, YOU don’t get a say in who’s an American, not anymore. You’ve given that up for a villa in Italy. I imagine that you enjoy it, that means that you no longer have to deal with America’s problems. All your problem are the problems of Europe and you are welcome to them. As for REAL Americans, I would rather have some of the people I’ve had the pleasure of knowing over the years than somebody who is as childish and cowardly as you, Vox. You ran from America’s problems and then had the unmitigated GALL to say that Sarah isn’t good enough to be an American.\nMy, these transamericans are certainly entitled, aren’t they? Not only can they tell Americans what Real Americans are and are not, but they are going to kick out everyone who doesn’t think like they do, no matter whose posterity they happen might be! Nations aren’t genetically-related peoples, after all, but mere collections of similarly-minded groupthinkers.\nNotice that I never said anything about Sarah being good enough to be an American. I never said anything about being American being something good, or even\ndesirable\n. What I stated is a simple fact, one no more controversial than Sarah being female. She is Portuguese. She is not American. Becoming a U.S. citizen is paperwork; the mere fact that one has to\nbecome\na U.S. citizen is sufficient to indicate that one is not an American. As it happens, I even know a few Americans who are not U.S. citizens.\nAmongst all the emoting, hissy-fitting, posturing, and outrage, only one commenter, Ironbear, was sufficiently perspicacious to note how “the proposition nation” is not only ahistorical fiction, but in practice,\nmust\nbe intrinsically opposed to the genuine Rights of Englishmen on which the original Anglo-American nation was founded.\nIs there a way to maintain and defend a nation of ideas without disenfranchising those who demonstrably don’t share those ideas, even though they be born here?\nSaying that “We were able to sustain a nation of ideas as long as America remained a melting pot,” is true, but not useful in that context. The America that was is dead dead, and toxic ideas introduced, propagated, and made colour of law and custom by our supposed fellows murdered it – using the power of the vote, among other weapons.\nI find Mrs. Hoyt’s concept of a prospective nation formed of ideas, ideals, and based upon shared experiences and principles to be aesthetically pleasing. I also see it as being extremely vulnerable, and demonstrably difficult to defend – unless one is willing to go all the way to the walls in eradicating ideas that are toxic to it, which our relatively recent ancestors didn’t. (I strongly suspect that they didn’t truly see the danger and the toxicity of Marxism until it was too late, or even really recognize what was killing us even then.)\nThe extremes required to protect those ideas from those who would destroy them with toxic ones are unpalatable as well, and not the least bit aesthetically or otherwise pleasing to me. I find that to be depressing, and without hope of a resolution that is not borne of fire and blood.\nHe is correct to be dubious. Their “proposition nation” is not even theoretically possible without the sort of thought police that their self-definitive ideals must reject. Defining a nation as a proposition is as intrinsically absurd and self-negating as feminism or communism or open-borders libertarianism. These transamerican idealists consider themselves to be intelligent and well-educated, and yet they have observably failed to even\nbegin\nto think through the\nnecessary\nconsequences of the very values they erroneously claim makes one American.\nAnd that, my dear Sarah, is one thing that you really should learn from me: ruthlessly thinking through the logical consequences of your foundational assumptions. As it stands, her core position is fundamentally illogical. On the other hand, at least she does seem to have changed her mind about my finally understanding Europe.\nHe’s become European through and through. He doesn’t wish the US well (doesn’t take much reading to see him gloating at potential destruction of the US. And all I have to do to attract his attention and unhinge him is say the US will survive, even though I don’t direct it at him.)\nUnder those circumstances for any American to follow his lead on things like presidential nominations is insane.\nI don’t wish VD any harm — in fact, he’s pretty much irrelevant to me, in any way our paths intersect — and his ideas might yet win out in Europe. For America they’re a poison pill and as bad as Obama’s.\n(Spreads hands and smiles.) Unhinged? Quite the contrary. Sarah and her commenters have beautifully demonstrated exactly what I intended from the start. Their naive USian ideals are fundamentally and functionally antithetical to the historical American ideals they ape so clumsily.\nDepending upon how one reckons it, we stand on the verge of the fourth America. I count them as follows:\nAmerica 1.0: Constitutional America 1789-1865\nAmerica 2.0: American Empire 1865-1913\nAmerica 3.0: Republican US 1913-1941\nAmerica 3.1: Early Imperial US 1941-1965\nAmerica 3:2: Latter Imperial US 1965~2033 (est)\nAmerica 4.0: Post-US~2033\nSarah and her defenders are confusing America 2.0 for America 1.0, and are completely unaware that they living in an America 3.2 that is rapidly laying the groundwork for the Post-US. And while I still value the ideals of America 1.0, with a very few exceptions they simply don’t exist in the USA anymore. As for what Sarah calls my “ideas”, they will win out in both the USA and in Europe for the simple reason that they are not my ideas, they are simply my observations of what is\nalready happening\n.\nIt is easy to know that I am much more likely to be correct than they are. Lacking imagination – ironic given how many SF writers are there – they assume the future will be the status quo extended into the future. And it will not be. Whatever it will be, it will most certainly not be that, not after the largest invasion in human history.",
  "tags": [
    "decline and fall",
    "immigration",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-29T07:00:00+00:00"
}