{
  "url": "https://voxday.net/2016/02/09/the-sf-gatekeepers-strike-again/",
  "scraped_at": "2025-12-17T17:45:15.624743",
  "title": "The SF gatekeepers strike again",
  "date_display": "February 9, 2016",
  "date_iso": "2016-02-09T23:15:00+00:00",
  "date_from_url": "2016-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both Sarah Hoyt and I have previously written about the ideological gatekeepers in publishing, a situation that has persisted for at least 20 years and has continually gotten worse over time. The SJWs in science fiction deny it,of course, and they’ve been able to get away with doing so because most authors are afraid to talk for fear of their careers being destroyed.</p><p>But the ability to publish independently <a href=\"http://www.nickcolebooks.com/2016/02/09/banned-by-the-publisher/\">is eliminating that fear</a>:</p><blockquote class=\"tr_bq\"><p> I launched a book this week and I went Indie with it. Indie means I released it on Amazon via Kindle Direct Publishing. I had to. My Publisher, HarperVoyager, refused to publish it because of some of the ideas I wrote about in it. In other words, they were attempting to effectively ban a book because they felt the ideas and concepts I was writing about were dangerous and more importantly, not in keeping with their philosophical ideals. They felt my ideas weren’t socially acceptable and were “guaranteed to lose fifty percent of my audience” as related back to me by my agent. But more importantly… they were “deeply offended”….</p><p>apparently advancing the thought that a brand new life form might see<br> us, humanity, as dangerous because we terminate our young, apparently…<br> that’s a ThoughtCrime most heinous over at Harper Collins. Even for one<br> tiny little chapter.</br></br></br></p><p>Here’s what happened next. I was not given notes as writers are<br> typically given during the editorial process. I was told by my agent<br> that my editor was upset and “deeply offended” that I had even dared<br> advanced this idea. As though I had no right to have such a thought or<br> even game the idea within a science fiction universe. I was immediately<br> removed from the publication schedule which as far as I know is odd and<br> unprecedented, especially for an author who has had both critical and<br> commercial success. This, being removed from the production schedule,<br> happened before my agent had even communicated the editor’s demand that I<br> immediately change the offending chapter to something more “socially”<br> (read “progressive”) acceptable. That seemed odd. How could they<br> possibly have known that I would or would not change it? It seems<br> reasonable to ask first. And stating that I would lose fifty percent of<br> my readers if I wrote what I wrote, well, they never seem to mind, or<br> worry about losing readers, when other writers publish their<br> progressive-oriented personal agendas on modern morality when they’re on<br> the “right side” of history regarding the anti-religion, gender and<br> sexuality issues.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>They don’t worry about those issues because they’re<br> deemed important, especially when they’re ham-handedly jammed into the<br> framework of the story. They must deem it a public service, especially<br> if there is a corresponding Social Justice outcry. It’s for the “greater<br> good” and the critics are just bigots anyways. Isn’t that what they<br> always say? That anyone else who doesn’t think the way they do is just a<br> bigot and a phobic of some kind. What a boorish way to dismiss a<br> counter-viewpoint. Thinking like that made the concentration camps<br> possible. So, maybe they were so upset by what I’d written they forgot<br> to be professional? They merely demanded that I rewrite that chapter not<br> because it was poorly written, or, not supportive of the arc of the<br> novel. No, they demanded it be struck from the record because they hate<br> the idea I’d advanced. They demanded it be deleted without discussion.<br> They felt it was for… the “greater good.” That is censorship, and a<br> violation of everyone’s right to free speech. They demanded it be so or<br> else… I wouldn’t be published.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>That’s how they threatened a writer with a<br> signed contract.</br></p><p>I refused.<br> I am a writer.<br> No. One. Will Ever. Bully. Me.<br> Ever.</br></br></br></p></blockquote><p>I’ve had four – FOUR – book contracts either paid off or canceled myself because a gatekeeper inside the publishing house disliked the ideological content of a book that the editor had wanted to sign. In fairness, this hasn’t always been an SJW gatekeeper, as <i>Media Whores</i> was killed by a conservative publishing house after they learned that I was not solely targeting the left-wing media whores, but had written a chapter on Bill O’Reilly.</p><p>But in three out of the four cases, it was an SJW playing thought police. Publishing, as an industry, has largely been converged, which is why so much of it is so unreadable these days. They are genuinely less interested in selling books and making money than advancing their social justice cause.</p></div>",
  "content_text": "Both Sarah Hoyt and I have previously written about the ideological gatekeepers in publishing, a situation that has persisted for at least 20 years and has continually gotten worse over time. The SJWs in science fiction deny it,of course, and they’ve been able to get away with doing so because most authors are afraid to talk for fear of their careers being destroyed.\nBut the ability to publish independently\nis eliminating that fear\n:\nI launched a book this week and I went Indie with it. Indie means I released it on Amazon via Kindle Direct Publishing. I had to. My Publisher, HarperVoyager, refused to publish it because of some of the ideas I wrote about in it. In other words, they were attempting to effectively ban a book because they felt the ideas and concepts I was writing about were dangerous and more importantly, not in keeping with their philosophical ideals. They felt my ideas weren’t socially acceptable and were “guaranteed to lose fifty percent of my audience” as related back to me by my agent. But more importantly… they were “deeply offended”….\napparently advancing the thought that a brand new life form might see\nus, humanity, as dangerous because we terminate our young, apparently…\nthat’s a ThoughtCrime most heinous over at Harper Collins. Even for one\ntiny little chapter.\nHere’s what happened next. I was not given notes as writers are\ntypically given during the editorial process. I was told by my agent\nthat my editor was upset and “deeply offended” that I had even dared\nadvanced this idea. As though I had no right to have such a thought or\neven game the idea within a science fiction universe. I was immediately\nremoved from the publication schedule which as far as I know is odd and\nunprecedented, especially for an author who has had both critical and\ncommercial success. This, being removed from the production schedule,\nhappened before my agent had even communicated the editor’s demand that I\nimmediately change the offending chapter to something more “socially”\n(read “progressive”) acceptable. That seemed odd. How could they\npossibly have known that I would or would not change it? It seems\nreasonable to ask first. And stating that I would lose fifty percent of\nmy readers if I wrote what I wrote, well, they never seem to mind, or\nworry about losing readers, when other writers publish their\nprogressive-oriented personal agendas on modern morality when they’re on\nthe “right side” of history regarding the anti-religion, gender and\nsexuality issues.\nThey don’t worry about those issues because they’re\ndeemed important, especially when they’re ham-handedly jammed into the\nframework of the story. They must deem it a public service, especially\nif there is a corresponding Social Justice outcry. It’s for the “greater\ngood” and the critics are just bigots anyways. Isn’t that what they\nalways say? That anyone else who doesn’t think the way they do is just a\nbigot and a phobic of some kind. What a boorish way to dismiss a\ncounter-viewpoint. Thinking like that made the concentration camps\npossible. So, maybe they were so upset by what I’d written they forgot\nto be professional? They merely demanded that I rewrite that chapter not\nbecause it was poorly written, or, not supportive of the arc of the\nnovel. No, they demanded it be struck from the record because they hate\nthe idea I’d advanced. They demanded it be deleted without discussion.\nThey felt it was for… the “greater good.” That is censorship, and a\nviolation of everyone’s right to free speech. They demanded it be so or\nelse… I wouldn’t be published.\nThat’s how they threatened a writer with a\nsigned contract.\nI refused.\nI am a writer.\nNo. One. Will Ever. Bully. Me.\nEver.\nI’ve had four – FOUR – book contracts either paid off or canceled myself because a gatekeeper inside the publishing house disliked the ideological content of a book that the editor had wanted to sign. In fairness, this hasn’t always been an SJW gatekeeper, as\nMedia Whores\nwas killed by a conservative publishing house after they learned that I was not solely targeting the left-wing media whores, but had written a chapter on Bill O’Reilly.\nBut in three out of the four cases, it was an SJW playing thought police. Publishing, as an industry, has largely been converged, which is why so much of it is so unreadable these days. They are genuinely less interested in selling books and making money than advancing their social justice cause.",
  "tags": [
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-09T23:15:00+00:00"
}