{
  "url": "https://voxday.net/2016/02/05/the-global-debt-threa/",
  "scraped_at": "2025-12-17T17:44:39.858095",
  "title": "The global debt threat",
  "date_display": "February 5, 2016",
  "date_iso": "2016-02-05T09:58:00+00:00",
  "date_from_url": "2016-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been warning about the danger of <a href=\"http://www.nytimes.com/2016/02/04/business/dealbook/toxic-loans-in-china-weigh-on-global-growth.html?_r=0\">the massive debt overhanging the global economy</a> since 2002 to absolutely no avail. </p><blockquote class=\"tr_bq\"><p> The problem is the giant, stagnant pool of loans that companies and people around the world are struggling to pay back. Bad debts have been a drag on economic activity ever since the financial crisis of 2008, but in recent months, the threat posed by an overhang of bad loans appears to be rising. China is the biggest source of worry. Some analysts estimate that China’s troubled credit could exceed $5 trillion, a staggering number that is equivalent to half the size of the country’s annual economic output.</p><p>Official figures show that Chinese banks pulled back on their lending in December. If such trends persist, China’s economy, the second-largest in the world behind the United States’, may then slow even more than it has, further harming the many countries that have for years relied on China for their growth.</p><p>But it’s not just China. Wherever governments and central banks<br> unleashed aggressive stimulus policies in recent years, a toxic debt<br> hangover has followed. In the United States, it took many months for<br> mortgage defaults to fall after the most recent housing bust — and<br> energy companies are struggling to pay off the cheap money that they<br> borrowed to pile into the shale boom.</br></br></br></br></br></p><p>In<br> Europe, analysts say bad loans total more than $1 trillion. Many large<br> European banks are still burdened with defaulted loans, complicating<br> policy makers’ efforts to revive the Continent’s economy. Italy, for<br> instance, announced a plan last week to clean out bad loans from its<br> plodding banking industry. Elsewhere,<br> bad loans are on the rise at Brazil’s biggest banks, as the country<br> grapples with the effects of an enormous credit binge.</br></br></br></br></br></br></br></p></blockquote><p>2008 was the first stage, but instead of doing as I recommended,<br> permitting the bad loans to default, and allowing the banks and other<br> credit holders to go bankrupt, Ben Bernanke and the Republicans “saved<br> the economy” by kicking the can down the road just as Alan Greenspan did in 1987.</br></br></br></p><p>Granted, they kicked it further than I would have believed possible in 2009, but nevertheless, we’ve now reached it again, and it is bigger and heavier than it was 7 years ago. And the Fed’s metaphorical foot is broken.</p></div>",
  "content_text": "I’ve been warning about the danger of\nthe massive debt overhanging the global economy\nsince 2002 to absolutely no avail.\nThe problem is the giant, stagnant pool of loans that companies and people around the world are struggling to pay back. Bad debts have been a drag on economic activity ever since the financial crisis of 2008, but in recent months, the threat posed by an overhang of bad loans appears to be rising. China is the biggest source of worry. Some analysts estimate that China’s troubled credit could exceed $5 trillion, a staggering number that is equivalent to half the size of the country’s annual economic output.\nOfficial figures show that Chinese banks pulled back on their lending in December. If such trends persist, China’s economy, the second-largest in the world behind the United States’, may then slow even more than it has, further harming the many countries that have for years relied on China for their growth.\nBut it’s not just China. Wherever governments and central banks\nunleashed aggressive stimulus policies in recent years, a toxic debt\nhangover has followed. In the United States, it took many months for\nmortgage defaults to fall after the most recent housing bust — and\nenergy companies are struggling to pay off the cheap money that they\nborrowed to pile into the shale boom.\nIn\nEurope, analysts say bad loans total more than $1 trillion. Many large\nEuropean banks are still burdened with defaulted loans, complicating\npolicy makers’ efforts to revive the Continent’s economy. Italy, for\ninstance, announced a plan last week to clean out bad loans from its\nplodding banking industry. Elsewhere,\nbad loans are on the rise at Brazil’s biggest banks, as the country\ngrapples with the effects of an enormous credit binge.\n2008 was the first stage, but instead of doing as I recommended,\npermitting the bad loans to default, and allowing the banks and other\ncredit holders to go bankrupt, Ben Bernanke and the Republicans “saved\nthe economy” by kicking the can down the road just as Alan Greenspan did in 1987.\nGranted, they kicked it further than I would have believed possible in 2009, but nevertheless, we’ve now reached it again, and it is bigger and heavier than it was 7 years ago. And the Fed’s metaphorical foot is broken.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-05T09:58:00+00:00"
}