{
  "url": "https://voxday.net/2016/02/03/the-news-converged/",
  "scraped_at": "2025-12-17T17:44:24.166776",
  "title": "The news, converged",
  "date_display": "February 3, 2016",
  "date_iso": "2016-02-03T09:16:00+00:00",
  "date_from_url": "2016-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Oliver Campbell observes that SJWs, especially SJWs in the media, <a href=\"https://twitter.com/oliverbcampbell/status/694801516931084288\">always lie</a>. A staff reporter for <i>The Intercept</i> <a href=\"https://theintercept.com/2016/02/02/a-note-to-readers/\">is busted</a> impersonating his editor and fabricating quotes:</p><blockquote class=\"tr_bq\"><p> The Intercept recently discovered a pattern of deception in the actions of a staff member. The employee, Juan Thompson, was a staff reporter from November 2014 until last month. Thompson fabricated several quotes in his stories and created fake email accounts that he used to impersonate people, one of which was a Gmail account in my name.</p><p>An investigation into Thompson’s reporting turned up three instances in which quotes were attributed to people who said they had not been interviewed. In other instances, quotes were attributed to individuals we could not reach, who could not remember speaking with him, or whose identities could not be confirmed. In his reporting Thompson also used quotes that we cannot verify from unnamed people whom he claimed to have encountered at public events. Thompson went to great lengths to deceive his editors, creating an email account to impersonate a source and lying about his reporting methods.</p><p>We have published corrections and editor’s notes to the affected pieces, and we will publish further corrections if we identify additional problems. We are retracting one story in its entirety. We have decided not to remove the posts but have labeled them “Retracted” or “Corrected,” based on our findings. We have added notes to stories with unconfirmed quotes.</p><p>We apologize to the subjects of the stories; to the people who were falsely quoted; and to you, our readers. We are contacting news outlets that picked up the corrected stories to alert them to the problems.</p></blockquote><p>What does convergence mean in an already SJW-infested media? It means that the news goes from being openly biased to entirely fictional. Remember, SJWism requires not only being delusional about reality, but relentlessly selling those delusions to the rest of the world, no matter how contradictory they are.</p><p>That’s why any SJW in your organization should be Identified, Expelled, and Ignored. IEI. Where the president of the R Foundation failed was in not maintaining the second I; he apparently submitted to internal pressure <a href=\"http://ironholds.org/blog/an-r-update/\">and retracted</a>. Don’t ever give in to the entryists and activists no matter how much they whine, cry, and lobby; you will regret it.</p><p>I somehow doubt the editor of <i>The Intercept</i> will make the same mistake.</p></div>",
  "content_text": "Oliver Campbell observes that SJWs, especially SJWs in the media,\nalways lie\n. A staff reporter for\nThe Intercept\nis busted\nimpersonating his editor and fabricating quotes:\nThe Intercept recently discovered a pattern of deception in the actions of a staff member. The employee, Juan Thompson, was a staff reporter from November 2014 until last month. Thompson fabricated several quotes in his stories and created fake email accounts that he used to impersonate people, one of which was a Gmail account in my name.\nAn investigation into Thompson’s reporting turned up three instances in which quotes were attributed to people who said they had not been interviewed. In other instances, quotes were attributed to individuals we could not reach, who could not remember speaking with him, or whose identities could not be confirmed. In his reporting Thompson also used quotes that we cannot verify from unnamed people whom he claimed to have encountered at public events. Thompson went to great lengths to deceive his editors, creating an email account to impersonate a source and lying about his reporting methods.\nWe have published corrections and editor’s notes to the affected pieces, and we will publish further corrections if we identify additional problems. We are retracting one story in its entirety. We have decided not to remove the posts but have labeled them “Retracted” or “Corrected,” based on our findings. We have added notes to stories with unconfirmed quotes.\nWe apologize to the subjects of the stories; to the people who were falsely quoted; and to you, our readers. We are contacting news outlets that picked up the corrected stories to alert them to the problems.\nWhat does convergence mean in an already SJW-infested media? It means that the news goes from being openly biased to entirely fictional. Remember, SJWism requires not only being delusional about reality, but relentlessly selling those delusions to the rest of the world, no matter how contradictory they are.\nThat’s why any SJW in your organization should be Identified, Expelled, and Ignored. IEI. Where the president of the R Foundation failed was in not maintaining the second I; he apparently submitted to internal pressure\nand retracted\n. Don’t ever give in to the entryists and activists no matter how much they whine, cry, and lobby; you will regret it.\nI somehow doubt the editor of\nThe Intercept\nwill make the same mistake.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-03T09:16:00+00:00"
}