{
  "url": "https://voxday.net/2016/02/04/the-embodiment-of-white-nerd-privilege/",
  "scraped_at": "2025-12-17T17:44:30.381350",
  "title": "“The embodiment of white nerd privilege”",
  "date_display": "February 4, 2016",
  "date_iso": "2016-02-04T08:39:00+00:00",
  "date_from_url": "2016-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wil Wheaton <a href=\"https://www.reddit.com/r/KotakuInAction/comments/4425ie/uh_oh_will_wheaton_goes_against_the_narrative/\">has been called out</a> for going against the SJW Narrative. It was inevitable, of course. After all, we have been reliably informed that as a white man, he is playing on the Easiest Difficulty Level:</p><blockquote class=\"tr_bq\"><p> Like many of you, I’ve been aware of Wil Wheaton’s outspoken position as a Bro-Feminist for quite some time. Occasionally, he’ll retweet or even say something that might seem profound. But I’m also not alone in suspecting that, beneath his “yay, feminism!” facade, lies deep-rooted misogyny. Recently, he proved my suspicions correct when he attempted to brand Clinton supporters a rather disgusting sexist slur that I will not repeat.</p><p>Make no mistake. Wheaton is the embodiment of white male nerd privilege. This “actor” had one role back in the 1980s that people actually remember, and somehow he’s more famous than the trailblazing women who had more prominent roles than him in the same fucking series. He’s parlayed his “I’m just like you!” nerd celebrity status into a recurring role as himself on a hit sitcom. He doesn’t even have to act, he literally just shows up and gets paid just for being him. How much more privileged can a creepy white dude get?</p><p>No wonder he’s loved so much by nerds. He’s the epitome of what all nerds want to be – rewarded by everyone just for being their precious, nerdy selves. He even got a “hit” YouTube series where he gets to hang out and play board games with people who have actual accomplishments. He even drags his wife on the show every now and then, as if to prove to all his little nerdling fans that hot girls really do like him.</p><p>Speaking of which, how creepy is it that his YouTube show seems to be an excuse for him to spend time with women who wouldn’t give him the time of day otherwise?</p><p>Anyway, back to my point. Wheaton has shown his true colours with his recent sexist campaign against Hillary Clinton…. Frankly, the man reminds me of the rapist Jian Ghomeshi. His espousing<br> of progressive values is nothing more than a mask. And we’ve just seen<br> his mask slip, giving a peek at the sexist evil hidden beneath.</br></br></p></blockquote><p>Wait, hold on… okay, never mind. Wil Wheaton apologized. And as we all know, an apology always suffices to make the SJWs go away.</p></div>",
  "content_text": "Wil Wheaton\nhas been called out\nfor going against the SJW Narrative. It was inevitable, of course. After all, we have been reliably informed that as a white man, he is playing on the Easiest Difficulty Level:\nLike many of you, I’ve been aware of Wil Wheaton’s outspoken position as a Bro-Feminist for quite some time. Occasionally, he’ll retweet or even say something that might seem profound. But I’m also not alone in suspecting that, beneath his “yay, feminism!” facade, lies deep-rooted misogyny. Recently, he proved my suspicions correct when he attempted to brand Clinton supporters a rather disgusting sexist slur that I will not repeat.\nMake no mistake. Wheaton is the embodiment of white male nerd privilege. This “actor” had one role back in the 1980s that people actually remember, and somehow he’s more famous than the trailblazing women who had more prominent roles than him in the same fucking series. He’s parlayed his “I’m just like you!” nerd celebrity status into a recurring role as himself on a hit sitcom. He doesn’t even have to act, he literally just shows up and gets paid just for being him. How much more privileged can a creepy white dude get?\nNo wonder he’s loved so much by nerds. He’s the epitome of what all nerds want to be – rewarded by everyone just for being their precious, nerdy selves. He even got a “hit” YouTube series where he gets to hang out and play board games with people who have actual accomplishments. He even drags his wife on the show every now and then, as if to prove to all his little nerdling fans that hot girls really do like him.\nSpeaking of which, how creepy is it that his YouTube show seems to be an excuse for him to spend time with women who wouldn’t give him the time of day otherwise?\nAnyway, back to my point. Wheaton has shown his true colours with his recent sexist campaign against Hillary Clinton…. Frankly, the man reminds me of the rapist Jian Ghomeshi. His espousing\nof progressive values is nothing more than a mask. And we’ve just seen\nhis mask slip, giving a peek at the sexist evil hidden beneath.\nWait, hold on… okay, never mind. Wil Wheaton apologized. And as we all know, an apology always suffices to make the SJWs go away.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-04T08:39:00+00:00"
}