{
  "url": "https://voxday.net/2016/02/14/thunder-of-nor/",
  "scraped_at": "2025-12-17T17:45:51.408414",
  "title": "Thunder of the North",
  "date_display": "February 14, 2016",
  "date_iso": "2016-02-14T17:00:00+00:00",
  "date_from_url": "2016-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As students of military history know, large-scale military exercises are often used to mask the mobilizations that precede an invasion. That is why many observers are more than a little bit nervous about the implications of the joint Saudi-Turkish exercises called <a href=\"http://www.jpost.com/Middle-East/ISIS-Threat/Saudi-Arabia-prepared-for-ground-war-in-Syria-military-spokesman-says-444362\">Thunder in the North</a>, as they believe it to be an invasion of Syria meant to stop the Russian-Syrian alliance from defeating the anti-Assad rebels in Aleppo.</p><blockquote class=\"tr_bq\"><p> Saudi military spokesman Brigadier-General Ahmed al-Asiri said his country is prepared for a land war in Syria, the Saudi-backed Asharq al-Awsat reported on Tuesday.</p><p>Asiri’s statement to the London- based paper comes after his country announced last week its willing to send ground troops as part of the international coalition to fight Islamic State.</p><p>The Senior Saudi defense official said that his country wants to defeat Islamic State.</p><p>He also announced Saudi Arabia would hold a large-scale military exercise called “Thunder of the North” with the participation of 21 Arab and Muslim countries. The exercise would enhance coordination and information sharing between the countries, Asiri said.</p><p>He added, according to the report, that “when participating countries feel that there are coordinated and interdependent efforts, the results of the exercise will be positive.</p></blockquote><p>There is talk of “350,000 troops, 2,540 warplanes,<br> 20,000 tanks and 460 helicopters”, which frankly sounds completely absurd to me in light of the fact that the Saudis have had to rely upon Colombian mercenaries in their largely unsuccessful effort to fight the Yemeni rebels. So, too, is the idea that the Russians would <a href=\"http://themillenniumreport.com/2016/02/limited-nuclear-war-within-18-days-as-saudis-and-friends-mass-350000-troops-20000-tanks-2450-planes-460-helicopters-for-syria-invasion/\">resort to tactical nukes</a> in order to stop them. However, the Saker, who is considerably more credible than a Saudi military spokesman, has indicated that <a href=\"http://www.unz.com/tsaker/week-eighteen-of-the-russian-intervention-in-syria-a-dramatic-escalation-appears-imminent/\">there may indeed be reason for concern</a>, and not just because of the 18,000 troops that Turkish Prime Minister Erdogan has stationed near the border:</br></p><blockquote class=\"tr_bq\"><p> The problem for the USA is that it has no good option to achieve its overriding goal in Syria: to “prevent Russia from winning”. In the delusional minds of the AngloZionist rulers, Russia is just a “regional power” which cannot be allowed to defy the “indispensable nation”. And yet, Russia is doing exactly that both in Syria and in the Ukraine and Obama’s entire Russia policy is in shambles. Can he afford to appear so weak in an election year? Can the US “deep state” let the Empire be humiliated and its weakness exposed?</p><p>The latest news strongly suggests to me that the White House has taken the decision to let Turkey and Saudi Arabia invade Syria. Turkish officials are openly saying that an invasion is imminent and that the goal of such an invasion would be to reverse the Syrian army gains along the boder and near Aleppo. The latest reports are also suggesting that the Turks have begun shelling Aleppo. None of that could be happening without the full support of CENTCOM and the White House.</p><p>The Empire has apparently concluded that Daesh is not strong enough to overthrow Assad, at least not when the Russian AeroSpace forces are supporting him, so it will now unleash the Turks and the Saudis in the hope of changing the outcome of this war or, if that is not possible, to carve up Syria into ‘zones of responsibility” – all under the pretext of fighting Daesh, of course.</p><p>The Russian task force in Syria is about to be very seriously challenged and I don’t see how it could deal with this new threat by itself. I very much hope that I am wrong here, but I have do admit that a *real* Russian intervention in Syria might happen after all, with MiG-31s and all. In fact, in the next few days, we are probably going to witness a dramatic escalation of the conflict in Syria.</p></blockquote><p>Correct me if I’m wrong, but it seems that President Obama has been very, very quiet of late. That, combined with the massive jump in the price of gold recently, seems to indicate that something non-trivial is in the works, although I can’t seem to find any information on when the exercises are scheduled to begin.</p></div>",
  "content_text": "As students of military history know, large-scale military exercises are often used to mask the mobilizations that precede an invasion. That is why many observers are more than a little bit nervous about the implications of the joint Saudi-Turkish exercises called\nThunder in the North\n, as they believe it to be an invasion of Syria meant to stop the Russian-Syrian alliance from defeating the anti-Assad rebels in Aleppo.\nSaudi military spokesman Brigadier-General Ahmed al-Asiri said his country is prepared for a land war in Syria, the Saudi-backed Asharq al-Awsat reported on Tuesday.\nAsiri’s statement to the London- based paper comes after his country announced last week its willing to send ground troops as part of the international coalition to fight Islamic State.\nThe Senior Saudi defense official said that his country wants to defeat Islamic State.\nHe also announced Saudi Arabia would hold a large-scale military exercise called “Thunder of the North” with the participation of 21 Arab and Muslim countries. The exercise would enhance coordination and information sharing between the countries, Asiri said.\nHe added, according to the report, that “when participating countries feel that there are coordinated and interdependent efforts, the results of the exercise will be positive.\nThere is talk of “350,000 troops, 2,540 warplanes,\n20,000 tanks and 460 helicopters”, which frankly sounds completely absurd to me in light of the fact that the Saudis have had to rely upon Colombian mercenaries in their largely unsuccessful effort to fight the Yemeni rebels. So, too, is the idea that the Russians would\nresort to tactical nukes\nin order to stop them. However, the Saker, who is considerably more credible than a Saudi military spokesman, has indicated that\nthere may indeed be reason for concern\n, and not just because of the 18,000 troops that Turkish Prime Minister Erdogan has stationed near the border:\nThe problem for the USA is that it has no good option to achieve its overriding goal in Syria: to “prevent Russia from winning”. In the delusional minds of the AngloZionist rulers, Russia is just a “regional power” which cannot be allowed to defy the “indispensable nation”. And yet, Russia is doing exactly that both in Syria and in the Ukraine and Obama’s entire Russia policy is in shambles. Can he afford to appear so weak in an election year? Can the US “deep state” let the Empire be humiliated and its weakness exposed?\nThe latest news strongly suggests to me that the White House has taken the decision to let Turkey and Saudi Arabia invade Syria. Turkish officials are openly saying that an invasion is imminent and that the goal of such an invasion would be to reverse the Syrian army gains along the boder and near Aleppo. The latest reports are also suggesting that the Turks have begun shelling Aleppo. None of that could be happening without the full support of CENTCOM and the White House.\nThe Empire has apparently concluded that Daesh is not strong enough to overthrow Assad, at least not when the Russian AeroSpace forces are supporting him, so it will now unleash the Turks and the Saudis in the hope of changing the outcome of this war or, if that is not possible, to carve up Syria into ‘zones of responsibility” – all under the pretext of fighting Daesh, of course.\nThe Russian task force in Syria is about to be very seriously challenged and I don’t see how it could deal with this new threat by itself. I very much hope that I am wrong here, but I have do admit that a *real* Russian intervention in Syria might happen after all, with MiG-31s and all. In fact, in the next few days, we are probably going to witness a dramatic escalation of the conflict in Syria.\nCorrect me if I’m wrong, but it seems that President Obama has been very, very quiet of late. That, combined with the massive jump in the price of gold recently, seems to indicate that something non-trivial is in the works, although I can’t seem to find any information on when the exercises are scheduled to begin.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-14T17:00:00+00:00"
}