{
  "url": "https://voxday.net/2016/02/08/transcript-rooshv-press-conference-6216/",
  "scraped_at": "2025-12-17T17:45:00.900914",
  "title": "Transcript: RooshV press conference 6/2/16",
  "date_display": "February 8, 2016",
  "date_iso": "2016-02-08T10:03:00+00:00",
  "date_from_url": "2016-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><b>This is the complete transcript from <a href=\"https://youtu.be/CD6ajfna7tE\">Roosh’s press conference</a> in Washington DC on Friday night. It is abundantly evident that the only thing Roosh has ever raped is the media’s narrative. Roosh explains his take on the press conference <a href=\"http://www.rooshv.com/my-press-conference-with-the-washington-dc-media\">on his own site</a>.</b></i><br> <i><br/></i><br> Roosh: All right, are you ready? Is that a yes? Oh, we have a new one. Where do you work from?</br></br></p><p>Female Reporter:<i> Um, Martha Stewart?</i></p><p>Roosh: Martha Stewart?</p><p>Female Reporter: <i>Yes.</i></p><p>(Laughter)</p><p>Roosh: Okay, yeah, sure. I don’t know how she got in here. Someone must have told her. All right, so first I’m going to make a statement and then you can ask me anything. Cool?</p><p>All right, so the world has gone insane in the past week. Why? Number one, I had organized meet ups around the world for men to enjoy a social happy hour to meet in private and talk about anything. Work, politics, girls, just to meet. Okay? Number two, a year ago I wrote an article How to Stop Rape. This article, to a 10-year-old, was obvious that I didn’t intend to legalize rape or cause harm against women. But starting on Sunday, a lot of you have lied by saying that I am a pro-rape advocate. He wants women to get hurt! And then the third thing, you said the meet ups are about rapists. They want to gather to learn how to rape. They are going to exchange tips. Some of you have called it a rape rally! What the hell is that? A rape rally? So because of that I’ve been all over the world in terms of the news. Over 100 articles have been written.</p><p>The result is what? I’m currently the most hated man in the world. Governments from all over the world have talked about me. Australia has tried to keep me out. They called up their Navy to keep me out because they thought that I was going to get in through a private yacht. So the Navy got called up. In England, the House of Commons debated me for half an hour to say how I’m a bad man who shouldn’t be allowed entry. Mayors from everywhere, Canada, have said were going to keep him out (like they could anyway they are just a mayor, a mayor can’t keep someone out). The governor of Texas said the same thing. Police from everywhere said that all meetups will be monitored. A private meetup for men is going to be monitored. 1984 is here.</p><p>Worst of all, my family’s address was put on the Internet through the hacking group Anonymous and your colleagues at the Daily Mail confirmed the doxx and say that I my mom’s meatloaf everyday. Dozens of threats have come in. Someone said that they’re going to burn my house down but save my mom. So I’m glad, but you have to understand that your work and the work of your own colleagues have incited a mob based on lies that has put my family in danger. If they get hurt right now, God forbid, it’s because of you. It’s because you didn’t read a damn article, you misinterpreted, and now we have this rage mob to where, as you can see, I had to hide this. I told you don’t tell anyone.</p><p>I must state right now that not a single woman has been hurt by me. I’ve never been accused of rape. I’ve never been charged. No follower of mine has read something by me and then gone to rape because I know if they did hurt a woman it would be all over the news. Not a single woman has been hurt. Yet, there is a real rape mob somewhere and there is media from the country where that mob is. Who wants to volunteer what country has an active rape mob? What happened on New Year’s Eve in Cologne? Does anyone know? Someone? On New Year’s Eve mobs of men assaulted women, they raped them, and what did you guys do? You covered it up. So when a real rape happens that goes against the agenda of your boss, you actually hide it. But then when no rapes happen and I try to do a meetup you lose your shit.</p><p>So I just wanted to come here just to state that not only are you guys not honest in your reporting of me but that no one has been harmed and when real harm takes place you don’t say anything. That is not right and not fair. I pray to God that nothing happens to anyone that is close to me and if it does it’s your fault. That’s my statement.</p><p>All right, is there anything else?</p><p>Reporter: <i>Why do you think people think of you as a rapist?</i></p><p>Roosh: They need a target to get all the rage that the citizens have to put it on someone that doesn’t conflict with the agenda of your bosses and the ruling establishment. Roosh, go after him, it doesn’t matter if he gets hurt but we can’t go against our immigrant agenda. We can’t go against the feminist agenda. So we need to get the masses (the idiots who believe the stuff that you write) and put it on to something else. So you put it on me. I’m just a scapegoat. They are just using me. But, I’m going to harness this. I’m going to harness all this coverage that you guys are giving me and convert it to money and women. That’s what I’m going to do. That’s the job that I have to do. I’m getting emails from a lot of girls right now and I plan (once this drama dies down if I can survive it) I may have to get in touch with them. That’s what you given me. You have made me one of the most famous men in the world. Granted, it was a lie. It was a lie. But hey, this is where we are right now so I’m going to work with what you gave me.</p><p>Female Reporter: <i>Do you acknowledge that any of your writing might be genuinely offensive or upsetting to some people?</i></p><p>Roosh: So what?</p><p>Female Reporter: <i>Do you blame all of their reaction solely on media misinterpretation?</i></p><p>Roosh: I blame them for not reading what I write, for taking the mentality of a 10-year-old kid.</p><p>Female Reporter: <i>Your writing is offensive on its face.</i></p><p>Roosh: So what? So what? I have freedom of speech. Be offended, good, that means my writing got you.</p><p>Female Reporter:<i> So you acknowledge that you did provoke some of this yourself.</i></p><p>Roosh: I acknowledge that as a writer my job is to get attention and I did it. Right? But so what if you are offended. So what if I make fun of you? Is that we’re at right now that we can’t write things that hurt people’s feelings? Good, get offended, feel something, but don’t lie. Don’t lie. And that’s what you guys have done.</p><p>Male Reporter:<i> So do you consider yourself a victim in this scenario?</i></p><p>Roosh: You know what? No. I take full responsibility for everything that I have done but that doesn’t mean that I can’t state what you did wrong. I’m not saying “oh, I wish I could turn back the hands of time. I wish I didn’t write that article.” No, I wrote it. It came from my mind and it’s going to stay. But if you did something wrong then I get to  call you out on it too. Right?</p><p>Female Reporter: <i>So, do you have any regrets about publishing the article?</i></p><p>Roosh: None. None.</p><p><a name=\"more\"></a>Female Reporter<i>: Well, you added this was a thought experiment this week. Do you regret not adding that early on?</i></p><p>Roosh: I regret that people are so stupid that I have to put that in there right now. I never imagined that people would take that in a literal way to lie in order to push their miserable agenda. I never thought that you guys would lie about it. But now, because the masses believe the nonsense that you write, I have to treat everyone like an eight-year-old kid and say this was a thought experiment even though to anyone who is not an idiot should have known that.</p><p>Reporter: <i>So why did you write it originally?</i></p><p>Roosh: Because I am a writer and I write things to make a point. That article was making a point about personal responsibility. That a woman’s safety is not only in the hands of men but it’s in their own hands too. That’s why. I guess that point didn’t get through, so on that account I did fail. I failed to give the point but that doesn’t mean that I did anything wrong. I did not.</p><p>Reporter: <i>So a woman that got raped did something wrong.</i></p><p>Roosh: You know, if a woman got raped that is a sad thing. That is a bad thing. But whose fault is it? Is it the woman fault? No, I’m not saying that. But a woman can do things to reduce the likelihood that she will get hurt. If I get a BMW car right now and I leave the key inside and I park it in a bad area and it gets robbed. Whose fault is that? Is it the thief’s fault? Or is it my fault for being a moron?</p><p>Reporter:<i> It’s the thief’s fault.</i></p><p>Roosh: Okay, but would you advise me to leave the key in there? Of course not! Only an idiot would. So okay, so I’ll go ahead and be an idiot but don’t be mad when her car gets stolen. Just do the right things to keep yourself safe. We can’t even tell people what to do anymore to keep themselves safe? That’s weird.</p><p>Reporter: <i>When you say thought experiment, what was the thought experiment? What specifically?</i></p><p>Roosh: The thought experiment is that if the government wasn’t completely holding the hand of adult women every step of the way and telling them that nothing you can do is wrong, maybe they would do a little bit of a better job not incapacitating themselves with alcohol and drugs and meeting random guys on the Internet that they don’t know and going to his house to watch Netflix.</p><p>Reporter: <i>But is this experiment just one blog post? Is it a website? Is it books?</i></p><p>Reporter 2:<i> Can you just break down the lie? What I mean by that is can you break down the the crux of your article? Because some people here are unfamiliar, at least I am. I’m not from the Daily Mail.</i></p><p>Roosh: Can you read? I mean can you guys go. No, look guys, you want me to break it down. Read it!</p><p>Reporter: <i>I mean how it got twisted by the media.</i></p><p>Roosh: The media said that the article said that this man wants to legalize rape. That was a lie.</p><p>Reporter: <i>Okay, what part of your satirical argument that you’re making can you maybe understand that they took and turned it into that lie?</i></p><p>Roosh: Not honest. They were not honest and they knew it. The people who wrote that and said that the article is true, that that is a “pro-rape” article, they lied. That’s it. They are lying people. Most people in the media are liars.</p><p>Reporter: <i>So you made a suggestion in this article which was what? Because I haven’t read it.</i></p><p>Roosh: Are you listening to what I’m saying, my friend? I’m telling you that I tried to make a point about personal responsibility. That’s what I did. Okay? You missed that point. Everyone here did. Some people got it.</p><p>Reporter:<i> Is this like a multi-year point though? You been trying to do this for like four, five, six years. What about, like, Return of Kings?</i></p><p>Roosh: Okay, is there an article there that you don’t like? That you got offended by?</p><p>Reporter: <i>Well, on the front page as soon as you get there one click away it gives you a list of articles to read on “Rape Culture” Was Manufactured To Wage An Unjust War Against Men.</i></p><p>Roosh: Bingo.</p><p>Reporter: <i>The Equality Movement Is Allowing Women To Tyrannize Men. The Deregulation Of The Sexual Marketplace.</i></p><p>Roosh: Okay, you’re just reading headlines, man. Read the articles.</p><p>Reporter: <i>Is this is part of your thought experiment?</i></p><p>Roosh: No, these articles are making a point. They provide evidence. They provide arguments. You’ve read it and you take from it what you want but don’t then go into your media outlet to lie about it.</p><p>Reporter: <i>Is the satire something else?</i></p><p>Roosh: How to Stop Rape was a satirical article.</p><p>Reporter: <i>Okay.</i></p><p>Roosh: These are not.</p><p>Female Reporter: <i>So, you know the outrage isn’t only about that one article. A lot of people think that you’re writing about women in general being submissive and [bad audio]. It’s also offensive.</i></p><p>Roosh: I don’t care.</p><p>Female Reporter: <i>Is that something that you believe?</i></p><p>Roosh: Do I believe that a woman should submit to a man? Yes. Does that mean that my family’s address should be put online because of that? And the media should stake out their home because of what I write? No. Using these lies to incite these idiots on the Internet? No.</p><p>Reporter: <i>What’s your justification for believing that women should be submissive? That seems to be…</i></p><p>Roosh: I’m not here to argue why I believe what I do. Okay? You have to go online, I’ve been writing for years and years, if you really care about that go do your homework. I’m just here to talk about the events of the past week.</p><p>Reporter:<i> I did read some of the things that you wrote and I’m curious and a lot of people here meeting you for the first time are curious to know where you…</i></p><p>Roosh: I really think that you guys don’t read things. You see, Caitlin will write something and you’re like “Okay, Caitlin’s article it’s getting hits so I’m going to copy and paste hers”. So it’s like a game. You guys are writing the same thing. I’m just try to understand what is happened. As you can see of been under a lot of stress from all this mob that is coming after me because of the things that you wrote that don’t conform to the real world. I don’t get it. And it’s clear to me that you guys haven’t done your research. You’re ready to write that this guy is pro-rape without knowing where that false idea comes from.</p><p>Female Reporter: <i>Roosh, I have a question for you from the Bang books. So I obviously have done my research and there are several instances…</i></p><p>Roosh: I know. She has known about me.</p><p>Female Reporter: <i>…There are several instances in the Bang books where you recount having sex with women who were too drunk or incapacitated to consent. Now people reading that would certainly come away with the impression that you raped those women.</i></p><p>Roosh: I don’t know anyone except for maybe you that thinks that and people who have lost their minds when it comes to consensual sex. People who don’t have any idea what girls are doing outside right now and what they will do in an hour or two once they get drunk and pick the guy that they like and let him do whatever he wants with her. So macho sex writing, to convert that to rape takes such a leap of faith that you have to be a liar to think that’s true.</p><p>Female Reporter: <i>You literally say that they were too incapacitated to consent.</i></p><p>Roosh: Macho sex writing is not a court. It’s not a piece of evidence that you can… Maybe some things I wanted to come across as an aggressive guy. Maybe I did. But just because there doesn’t means that there is a victim out there and she suffered. Have I raped anyone? No.</p><p>Reporter: <i>Is that fiction?</i></p><p>Roosh: No. It’s not. My interpretation of it may be, but she’s just taking quotes out of context anyway.</p><p>Reporter: <i>You made a point that you have an office that overlooks a golf course. You made that clip about speed before is that true?</i></p><p>Roosh: Golf course?</p><p>Reporter: <i>Yeah.</i></p><p>Roosh: I have no idea what you’re talking about. Golf course?</p><p>Reporter: <i>Yes, you have an office that overlooks a golf course.</i></p><p>Roosh: I don’t remember ever saying that, man.</p><p>Reporter: <i>You mentioned the immigrant agenda and the feminist agenda before. I’m trying to get a better idea of what your personal politics are.</i></p><p>Roosh: I would say that it’s anti-globalists which the Daily Beast represents a globalist type of platform.</p><p>Reporter: <i>What do you mean by globalist?</i></p><p>Roosh: Anything that benefits the current top 1000 men in the world in the US and Europe. You have a globalists and you have the nationalists. I would lean more towards a nationalist. Tradition, patriarchy, local solutions instead of globalization.</p><p>Reporter: <i>So does that mean you’re voting for?</i></p><p>Roosh: Donald Trump comes the closest to what I think is true.</p><p>Female Reporter: <i>You express concern about your family after you were doxxed. Does that make you regret threatening to doxx reporters and protesters? Who…</i></p><p>Roosh: I never threatened that. I said I was going to make a list of the names and the social networking accounts. I never said I was going to share their address. That was another lie. Another lie is that I live with my mom. It’s like you guys can’t stop lying. A man can’t visit his mom? I wished I lived with her! But no, that was a lie. See now, I don’t think it’s a good idea to say it but I live somewhere in Europe. So I’m just here for a short time and I happen to be here and the Daily Mail… I have to say though they had a lens that was far away I was like what’s that over there and you see on the Internet it was right there so… There’s people outside my dad’s house now probably.</p><p>Female Reporter: <i>You own that house then right?</i></p><p>Roosh: No, I don’t own the house.</p><p>Female Reporter:<i> It’s registered in your name.</i></p><p>Roosh: Well, I don’t know how.</p><p>Female Reporter: <i>So it’s not your house?</i></p><p>Roosh: It’s not my house. Okay let me stop that and start again. So I don’t want to stay here all night with you guys. I have other things that I have to do so were going to wrap this up at 8 o’clock. Cool?</p><p>Reporter: <i>What else has happened these last couple of days? Did you get dozens of [bad audio]. Has your phone been ringing off the hook? Or your parents’ phone?</i></p><p>Roosh: You know, I think from a security standpoint it’s not smart to share that kind of stuff.</p><p>Reporter: <i>Where do you office out of? Do you find yourself writing on the road?</i></p><p>Roosh: There’s a golf course that is outside of my office… No.</p><p>(Laughter)</p><p>Roosh: I’m mobile, so um. Office out of, I never heard that kind of phrase before (laughs) but Starbucks? You know?</p><p>Reporter: <i>Can you confirm that you did have to upgrade the DDOS protection on the website after the threats?</i></p><p>Roosh: We already had it because my servers were attacked last year. So we already had the systems in place but they were sending 20 million false requests every hour.</p><p>Reporter: <i>Actually 20 million?</i></p><p>Roosh: Yeah, that’s the actual number. This was on Tuesday. Monday and Tuesday. Once the Australian thing hit. Now I must say, when the Australia thing hit that was a lot of fun because those people were obsessed about me and I was telling them that I was to come in by boat. But then the shit kind of got real once it came here, you know? Having fun with them is good but when they announce your address and are advising people to go down that then it’s no longer fun.</p><p>Reporter: <i>Would you say that media misinterpretation is the best thing that ever happened to you?</i></p><p>Roosh: The best and the worst. I mean what’s going to happen now? I’m going to be known, because of you, as a pro-rape advocate for the rest of my life until I die. Oh, that’s the guy that believes that all women should be raped. But at the same time they’re going to say that’s the guy. They’re going to know me. I could take a dump in a box right now and sell it because of you. So that’s what you have done to me. You have made me such a famous guy. I was a guy with the blog, just a guy with a blog, and you have taken me from here to this based on a lie. Now, I’d rather you had not done that but it happened and that is life right? So you’ve got to deal with what actually happens.</p><p>Reporter: <i>Would you consider donating some of that money to a rape crisis center?</i></p><p>Roosh: (laughs) I mean I think that the fact that the entire mainstream is trying to stop rape and assault against women I think they’re doing fine. But if they want to donate money to me to help with the bodyguards that I have to hire right now then they are more than welcome to.</p><p>Reporter: <i>How many bodyguards do you have around you right now?</i></p><p>Roosh: Unfortunately, I can’t share that right now but you can count which guys back there are kind of large, you know?</p><p>Reporter: <i>So what are the plans for the next couple of days?</i></p><p>Roosh: The next couple of days is really, probably, to get out of town since it is a little bit hot right now. It’s not that I really think someone is going to come and stab me but it’s not smart to stay in the city where everyone knows where I am at. So I will probably go up or down the East Coast.</p><p>Reporter: <i>How often do you return for your mom’s meatloaf?</i></p><p>Roosh: I come for the meatloaf once a year for like one month. And hey, you know, I like to stay with her. I wish I could stay more. I was trying to stay for a month but now, because of this, I had to say goodbye to her.</p><p>Reporter: <i>Have you had any trouble traveling internationally yet and you expect it?</i></p><p>Roosh: No. I think England did not go ahead and say that I’m banned. I don’t think Australia will let me in now.</p><p>Reporter: <i>Do you plan on trying to go to Australia?</i></p><p>Roosh: I don’t see why I would go there. Yep.</p><p>Female Reporter: <i>What does your mom think about all this?</i></p><p>Roosh: My mom is angry. My mom is very angry.</p><p>Female Reporter: <i>At you?</i></p><p>Roosh: Not at me. At you guys. She wants me to hit you guys back. Like you don’t understand a Middle Eastern mom, they get angry. I’m having to calm her down because she wants to fight. I’m saying Mom you gotta simmer down now. But no, she said son I support you, do what you gotta do, this is a matter of your speech and as long as you’re not doing anything illegal.</p><p>Reporter: <i>What does she think of your treatment of women?</i></p><p>Roosh: Treatment of women? My mom doesn’t know. My mom doesn’t know how I make love to this girl or that girl. She knows who I am. She knows that whatever I write on the Internet and the monster that you have made me there that I have never hurt a woman. You would think by now, guys, that one girl would come forward and say “Yeah, Roosh did it, he raped me”. One, you would think. Not one has come forward. Not one. Even though I have been known everywhere. So how do you explain that? Not one. It is weird how a lie can get to this point in time. So I’m not sure what the function of the media is because if you’re just going to lie and when the public is really in threat like in Germany was. Women in Germany right now are in threat. You don’t protect them but you come against me, what are you doing?</p><p>Reporter: <i>The media cover that pretty extensively. I can email you a bunch of…</i></p><p>Roosh: After the outrage came. From day one? No.</p><p>Reporter: <i>That is absolutely not true.</i></p><p>Reporter: <i>Back to what Caitlin was saying earlier, do you at least agree that, legally speaking, the technical legal definition that a woman is too drunk to consent to sex and you have sex with her, that is legally defined as rape. Can you at least…</i></p><p>Roosh: How about the man? If the man is drunk, can he consent to rape?</p><p>Reporter: <i>We can talk about that in a moment.</i></p><p>Roosh: No, no. It’s the same thing.</p><p>Reporter: <i>No, no, no, you’re not answering the question.</i></p><p>Roosh: You’re not going to tell me what is right and wrong.</p><p>Reporter: <i>Okay, woman, man, whatever, that is a legal definition of rape. Do you disagree with the legal definition of rape?</i></p><p>Roosh: If a man is drunk and a woman has sex with him is it rape?</p><p>Reporter: <i>Yes.</i></p><p>Female Reporter: <i>It is not the legal definition of rape in many places though.</i></p><p>Reporter:<i> In many places no…</i></p><p>Roosh: You’re trying to redefine the definition of consensual sex so that every man is on the hook for rape. That is what you’re trying to do. So no, I don’t agree with you.</p><p>Reporter: <i>Do you believe Bill Cosby is a rapist?</i></p><p>Roosh: I haven’t seen all of the evidence but I think that it’s weird that 20 years after…</p><p>Reporter: <i>If any of these women came back and said “Oh, Roosh did whatever”, here is somebody with a long history of…</i></p><p>Roosh: The evidence that I have seen is girls wanted to be with him and take drugs with him, and then 20 years after that say that he hurt them.</p><p>Reporter: <i>So you don’t agree that that is a legal definition of rape?</i></p><p>Roosh: I don’t think that they are being honest.</p><p>Reporter: <i>If they were?</i></p><p>Roosh: If they were, look man I’m not a lawyer. See this is where we are right now where the mainstream is so obsessed about rape. We don’t even know what consensual sex is anymore. This is what we have done. So no you’re coming after me for an article where, clearly, I didn’t intend for people to think that I want all rape to be legal. So we’ve lost our minds. From now on about sex, the United States is just gone. We don’t know what sex is anymore. We don’t know what consensual sex is anymore and that’s because of the work that you have done.</p><p>Reporter: <i>How did this become your issue? We all have different issues we care about passionately, how did this become yours?</i></p><p>Roosh: It’s not my issue. I’ve written over 3000 articles and maybe 10 of them were about rape.</p><p>Reporter:<i> [bad audio]</i></p><p>Roosh: Because when I was in college I want to learn how to make love to every attractive girl that I saw. So I needed to learn which skills that I had to do. Is there anyone that I have not called on yet because I’m trying to think of who is kind of quite. Why are you guys here then?</p><p>Reporter: <i>Martha Stewart over there.</i></p><p>(Laughter)</p><p>Female Reporter: <i>Um, are you happy?</i></p><p>(Laughter)</p><p>Roosh: That’s why we didn’t call on her. I mean happiness is what? Am I happy that people have the wrong impression of who I am? No! But am I happy that I’m probably going to cash in on this as long as I can survive the next couple days? Hey, you gave it to me, you gave me a package and now I will run with it. You can’t turn the clock back.</p><p>Reporter: <i>How much have you made off of this in total?</i></p><p>Roosh: You know I have to get my accountant to really tally it. Has sales of books gone up? Yes. Has advertising sales gone up? Yes.</p><p>Reporter: <i>What is your vision for the future for male-female relations?</i></p><p>Roosh: (laughs) Okay, well, what I’ve been trying to show on my website is that equality doesn’t work. I mean it doesn’t. If we have a divorce rate that is 50% or more, it doesn’t work. I think we have to go back to the days where the man leads the household. I think that’s the only way. But are we in the US? I don’t think so. I think there’s a couple of countries left where we can, maybe in Eastern Europe. The Muslim countries… You guys love Islam so I’m thinking that you guys would love… You guys give it a pass. They have a patriarchal system in the household. Do you get on them for that? In an Islamic marriage, there are some Muslim guys here, rape cannot happen during a marriage. Do you write about that? No.</p><p>Reporter: <i>Yes.</i></p><p>Roosh: No you don’t.</p><p>Reporter: <i>Yeah we do. I’ll send you a bunch of links on that.</i></p><p>Roosh: Please do, please do. And I’m going to read them carefully. But you guys give it a pass, you guys give Islam a pass for a patriarchal model that I write about but you come after me. Can we get something over here?</p><p>Female Reporter: <i>She’s just my photographer.</i></p><p>Roosh: (Sighs)</p><p>Female Reporter: <i>I am mostly here just to listen. Everyone else has mostly covered all the questions that I would’ve asked so.</i></p><p>Roosh: Ask anything.</p><p>Female Reporter: <i>Why did you pick this hotel?</i></p><p>Roosh: I used to actually come here on dates. I used to bring dates here. This was back in 2000s. This was a place where I used to bring a date. We would sit on a couch upstairs and I would make my smooth moves on them here. This was 2005, 2006.</p><p>Reporter: <i>Just to clarify something earlier, you were saying that Donald Trump was the closest. Besides the anti-PC stuff, what do you like about his 2016 campaign?</i></p><p>Roosh: He hates you guys too.</p><p>Reporter: <i>Besides that.</i></p><p>Roosh: That’s enough for me. The enemy of my enemy is my friend.<br> Reporter: The media is not a political ideological position.</br></p><p>Roosh: Becoming anti-establishment is. You don’t understand, half you will be out of a job within five years time.</p><p>Reporter: <i>So you like that he is nationalist and anti-establishment.</i></p><p>Roosh: And the reason is you’re not serving the needs of the public. You’re not. The establishment sites are losing views and I’m sure a lot of you have not seen your salaries increase in the way that you wanted. It’s because we don’t believe in the mainstream anymore. In this case, what you did to me is now showing the world what you guys do and how you operate.</p><p>Reporter:<i> I didn’t do anything to you…</i></p><p>Female Reporter: <i>Why did you end up canceling all the meetings? Because a lot of them weren’t going to be protested right?</i></p><p>Roosh: A lot of them were. I would say at least half of them. This news made it to Russia.</p><p>Female Reporter: <i>[bad audio]</i></p><p>Roosh: Who said they’re not? You know, a mistake that I made was saying lets let these masculine, strong men organize, who hate the government, probably, and meet. That was kinda dumb. Because this could be a threat against us. So if we have to go underground, I’ll go underground. We never had a goal where we had to do everything in public.</p><p>Reporter: <i>If you and the people who follow your website closely are so strong, why do it in secret?</i></p><p>Roosh: Are you going to go to a meeting where the cops are on you?</p><p>Reporter: <i>I have before.</i></p><p>Roosh: I don’t like this guy. I mean he’s just being argumentative.</p><p>Female Reporter: <i>Was there supposed to be a public component at all to these meetings?</i></p><p>Roosh: No, it was just the most efficient way to organize people who like me and who like my site. Hey guys, just meet here at this time.</p><p>Female Reporter: <i>They were not planning on doing anything there. They were just going to hang out, right?</i></p><p>Roosh: No, okay, I’m going to tell you. There were going to meet at that point and say where’s the Pet Shop? It’s right here. Okay, hey cool, what your name? Where are you from? There’s a bar over here let’s go for a drink. That was it! That was it and then the worldwide anger came.</p><p>Reporter: <i>But again if they’re strong, masculine, brave, why the subterfuge?</i></p><p>Roosh: Because you have angered a mob that wants to disrupt their meeting because you have gotten governments against them by lying about their intention. Now the world thinks that they’re going to meet to rape people. So why are they going to meet now? Do you think it’s smart to go and meet now? After that? You would go to a meeting where everyone is targeting you as a potential person who is going to rape. That’s what you would do? Of course not! You don’t seem like the type that would stand up to someone who is coming against you. I mean, do you lift? You don’t lift.</p><p>Reporter: <i>No, I don’t.</i></p><p>Roosh: I do lift but I lost some weight. I’m just saying, like, this guy is saying go into the fire. Who is going to do that? That’s absurd! This is where all these absurd ideas come from, from you guys. It doesn’t make any sense! It doesn’t make any sense. (sighs) So we got five more minutes.</p><p>Reporter: <i>Do you feel that leaving town or having bodyguards takes away from your masculinity?</i></p><p>Roosh: No! If your life is in danger, no. If you want to stand up and fight and get into a confrontation, that’s fine, but right now the heat is on my mom and dad so me leaving is going to take the heat away. So I am considering them in the actions that I do. Last summer I had two speeches in Montréal and Toronto and the same anger came. What did I do? I stood there. Why? Because my family was not in danger. They didn’t post their address. For the record, I held the speeches even though the mayors came out against me but now it’s not worth a public happy hour to go against the police, governors, mayors, and all that stuff and put the safety and privacy of the men who follow me… I can’t toss them into that. I can toss myself into that. I can hire a bodyguard. I can go out right now and drink (which I will) but I’m not going to put them in danger. That would be like just looking out for me instead of the men who trust the things that I do.</p><p>Female Reporter: <i>How many men would you say those are?</i></p><p>Roosh: It’s hard to say, but based on the site traffic that I get for Return of Kings, I get one million uniques each month. Out of the hard-core people who really follow me it could be as high as 200,000.</p><p>Female Reporter: <i>And how many of them were you expecting to go to these meetups around the world?</i></p><p>Roosh: There’s no way to know because it was just show up. Okay, so we got time for one more.</p><p>Reporter: <i>How many women have you been with?</i></p><p>Roosh: (sighs) A lot. I have been with a lot, but that’s not relevant to the current matter at hand. But thank you. Thank you all for coming. I expect more lies in your articles that are going to come up but I just wanted to do this to show what the truth is. Okay? So have a good night.</p></div>",
  "content_text": "This is the complete transcript from\nRoosh’s press conference\nin Washington DC on Friday night. It is abundantly evident that the only thing Roosh has ever raped is the media’s narrative. Roosh explains his take on the press conference\non his own site\n.\nRoosh: All right, are you ready? Is that a yes? Oh, we have a new one. Where do you work from?\nFemale Reporter:\nUm, Martha Stewart?\nRoosh: Martha Stewart?\nFemale Reporter:\nYes.\n(Laughter)\nRoosh: Okay, yeah, sure. I don’t know how she got in here. Someone must have told her. All right, so first I’m going to make a statement and then you can ask me anything. Cool?\nAll right, so the world has gone insane in the past week. Why? Number one, I had organized meet ups around the world for men to enjoy a social happy hour to meet in private and talk about anything. Work, politics, girls, just to meet. Okay? Number two, a year ago I wrote an article How to Stop Rape. This article, to a 10-year-old, was obvious that I didn’t intend to legalize rape or cause harm against women. But starting on Sunday, a lot of you have lied by saying that I am a pro-rape advocate. He wants women to get hurt! And then the third thing, you said the meet ups are about rapists. They want to gather to learn how to rape. They are going to exchange tips. Some of you have called it a rape rally! What the hell is that? A rape rally? So because of that I’ve been all over the world in terms of the news. Over 100 articles have been written.\nThe result is what? I’m currently the most hated man in the world. Governments from all over the world have talked about me. Australia has tried to keep me out. They called up their Navy to keep me out because they thought that I was going to get in through a private yacht. So the Navy got called up. In England, the House of Commons debated me for half an hour to say how I’m a bad man who shouldn’t be allowed entry. Mayors from everywhere, Canada, have said were going to keep him out (like they could anyway they are just a mayor, a mayor can’t keep someone out). The governor of Texas said the same thing. Police from everywhere said that all meetups will be monitored. A private meetup for men is going to be monitored. 1984 is here.\nWorst of all, my family’s address was put on the Internet through the hacking group Anonymous and your colleagues at the Daily Mail confirmed the doxx and say that I my mom’s meatloaf everyday. Dozens of threats have come in. Someone said that they’re going to burn my house down but save my mom. So I’m glad, but you have to understand that your work and the work of your own colleagues have incited a mob based on lies that has put my family in danger. If they get hurt right now, God forbid, it’s because of you. It’s because you didn’t read a damn article, you misinterpreted, and now we have this rage mob to where, as you can see, I had to hide this. I told you don’t tell anyone.\nI must state right now that not a single woman has been hurt by me. I’ve never been accused of rape. I’ve never been charged. No follower of mine has read something by me and then gone to rape because I know if they did hurt a woman it would be all over the news. Not a single woman has been hurt. Yet, there is a real rape mob somewhere and there is media from the country where that mob is. Who wants to volunteer what country has an active rape mob? What happened on New Year’s Eve in Cologne? Does anyone know? Someone? On New Year’s Eve mobs of men assaulted women, they raped them, and what did you guys do? You covered it up. So when a real rape happens that goes against the agenda of your boss, you actually hide it. But then when no rapes happen and I try to do a meetup you lose your shit.\nSo I just wanted to come here just to state that not only are you guys not honest in your reporting of me but that no one has been harmed and when real harm takes place you don’t say anything. That is not right and not fair. I pray to God that nothing happens to anyone that is close to me and if it does it’s your fault. That’s my statement.\nAll right, is there anything else?\nReporter:\nWhy do you think people think of you as a rapist?\nRoosh: They need a target to get all the rage that the citizens have to put it on someone that doesn’t conflict with the agenda of your bosses and the ruling establishment. Roosh, go after him, it doesn’t matter if he gets hurt but we can’t go against our immigrant agenda. We can’t go against the feminist agenda. So we need to get the masses (the idiots who believe the stuff that you write) and put it on to something else. So you put it on me. I’m just a scapegoat. They are just using me. But, I’m going to harness this. I’m going to harness all this coverage that you guys are giving me and convert it to money and women. That’s what I’m going to do. That’s the job that I have to do. I’m getting emails from a lot of girls right now and I plan (once this drama dies down if I can survive it) I may have to get in touch with them. That’s what you given me. You have made me one of the most famous men in the world. Granted, it was a lie. It was a lie. But hey, this is where we are right now so I’m going to work with what you gave me.\nFemale Reporter:\nDo you acknowledge that any of your writing might be genuinely offensive or upsetting to some people?\nRoosh: So what?\nFemale Reporter:\nDo you blame all of their reaction solely on media misinterpretation?\nRoosh: I blame them for not reading what I write, for taking the mentality of a 10-year-old kid.\nFemale Reporter:\nYour writing is offensive on its face.\nRoosh: So what? So what? I have freedom of speech. Be offended, good, that means my writing got you.\nFemale Reporter:\nSo you acknowledge that you did provoke some of this yourself.\nRoosh: I acknowledge that as a writer my job is to get attention and I did it. Right? But so what if you are offended. So what if I make fun of you? Is that we’re at right now that we can’t write things that hurt people’s feelings? Good, get offended, feel something, but don’t lie. Don’t lie. And that’s what you guys have done.\nMale Reporter:\nSo do you consider yourself a victim in this scenario?\nRoosh: You know what? No. I take full responsibility for everything that I have done but that doesn’t mean that I can’t state what you did wrong. I’m not saying “oh, I wish I could turn back the hands of time. I wish I didn’t write that article.” No, I wrote it. It came from my mind and it’s going to stay. But if you did something wrong then I get to  call you out on it too. Right?\nFemale Reporter:\nSo, do you have any regrets about publishing the article?\nRoosh: None. None.\nFemale Reporter\n: Well, you added this was a thought experiment this week. Do you regret not adding that early on?\nRoosh: I regret that people are so stupid that I have to put that in there right now. I never imagined that people would take that in a literal way to lie in order to push their miserable agenda. I never thought that you guys would lie about it. But now, because the masses believe the nonsense that you write, I have to treat everyone like an eight-year-old kid and say this was a thought experiment even though to anyone who is not an idiot should have known that.\nReporter:\nSo why did you write it originally?\nRoosh: Because I am a writer and I write things to make a point. That article was making a point about personal responsibility. That a woman’s safety is not only in the hands of men but it’s in their own hands too. That’s why. I guess that point didn’t get through, so on that account I did fail. I failed to give the point but that doesn’t mean that I did anything wrong. I did not.\nReporter:\nSo a woman that got raped did something wrong.\nRoosh: You know, if a woman got raped that is a sad thing. That is a bad thing. But whose fault is it? Is it the woman fault? No, I’m not saying that. But a woman can do things to reduce the likelihood that she will get hurt. If I get a BMW car right now and I leave the key inside and I park it in a bad area and it gets robbed. Whose fault is that? Is it the thief’s fault? Or is it my fault for being a moron?\nReporter:\nIt’s the thief’s fault.\nRoosh: Okay, but would you advise me to leave the key in there? Of course not! Only an idiot would. So okay, so I’ll go ahead and be an idiot but don’t be mad when her car gets stolen. Just do the right things to keep yourself safe. We can’t even tell people what to do anymore to keep themselves safe? That’s weird.\nReporter:\nWhen you say thought experiment, what was the thought experiment? What specifically?\nRoosh: The thought experiment is that if the government wasn’t completely holding the hand of adult women every step of the way and telling them that nothing you can do is wrong, maybe they would do a little bit of a better job not incapacitating themselves with alcohol and drugs and meeting random guys on the Internet that they don’t know and going to his house to watch Netflix.\nReporter:\nBut is this experiment just one blog post? Is it a website? Is it books?\nReporter 2:\nCan you just break down the lie? What I mean by that is can you break down the the crux of your article? Because some people here are unfamiliar, at least I am. I’m not from the Daily Mail.\nRoosh: Can you read? I mean can you guys go. No, look guys, you want me to break it down. Read it!\nReporter:\nI mean how it got twisted by the media.\nRoosh: The media said that the article said that this man wants to legalize rape. That was a lie.\nReporter:\nOkay, what part of your satirical argument that you’re making can you maybe understand that they took and turned it into that lie?\nRoosh: Not honest. They were not honest and they knew it. The people who wrote that and said that the article is true, that that is a “pro-rape” article, they lied. That’s it. They are lying people. Most people in the media are liars.\nReporter:\nSo you made a suggestion in this article which was what? Because I haven’t read it.\nRoosh: Are you listening to what I’m saying, my friend? I’m telling you that I tried to make a point about personal responsibility. That’s what I did. Okay? You missed that point. Everyone here did. Some people got it.\nReporter:\nIs this like a multi-year point though? You been trying to do this for like four, five, six years. What about, like, Return of Kings?\nRoosh: Okay, is there an article there that you don’t like? That you got offended by?\nReporter:\nWell, on the front page as soon as you get there one click away it gives you a list of articles to read on “Rape Culture” Was Manufactured To Wage An Unjust War Against Men.\nRoosh: Bingo.\nReporter:\nThe Equality Movement Is Allowing Women To Tyrannize Men. The Deregulation Of The Sexual Marketplace.\nRoosh: Okay, you’re just reading headlines, man. Read the articles.\nReporter:\nIs this is part of your thought experiment?\nRoosh: No, these articles are making a point. They provide evidence. They provide arguments. You’ve read it and you take from it what you want but don’t then go into your media outlet to lie about it.\nReporter:\nIs the satire something else?\nRoosh: How to Stop Rape was a satirical article.\nReporter:\nOkay.\nRoosh: These are not.\nFemale Reporter:\nSo, you know the outrage isn’t only about that one article. A lot of people think that you’re writing about women in general being submissive and [bad audio]. It’s also offensive.\nRoosh: I don’t care.\nFemale Reporter:\nIs that something that you believe?\nRoosh: Do I believe that a woman should submit to a man? Yes. Does that mean that my family’s address should be put online because of that? And the media should stake out their home because of what I write? No. Using these lies to incite these idiots on the Internet? No.\nReporter:\nWhat’s your justification for believing that women should be submissive? That seems to be…\nRoosh: I’m not here to argue why I believe what I do. Okay? You have to go online, I’ve been writing for years and years, if you really care about that go do your homework. I’m just here to talk about the events of the past week.\nReporter:\nI did read some of the things that you wrote and I’m curious and a lot of people here meeting you for the first time are curious to know where you…\nRoosh: I really think that you guys don’t read things. You see, Caitlin will write something and you’re like “Okay, Caitlin’s article it’s getting hits so I’m going to copy and paste hers”. So it’s like a game. You guys are writing the same thing. I’m just try to understand what is happened. As you can see of been under a lot of stress from all this mob that is coming after me because of the things that you wrote that don’t conform to the real world. I don’t get it. And it’s clear to me that you guys haven’t done your research. You’re ready to write that this guy is pro-rape without knowing where that false idea comes from.\nFemale Reporter:\nRoosh, I have a question for you from the Bang books. So I obviously have done my research and there are several instances…\nRoosh: I know. She has known about me.\nFemale Reporter:\n…There are several instances in the Bang books where you recount having sex with women who were too drunk or incapacitated to consent. Now people reading that would certainly come away with the impression that you raped those women.\nRoosh: I don’t know anyone except for maybe you that thinks that and people who have lost their minds when it comes to consensual sex. People who don’t have any idea what girls are doing outside right now and what they will do in an hour or two once they get drunk and pick the guy that they like and let him do whatever he wants with her. So macho sex writing, to convert that to rape takes such a leap of faith that you have to be a liar to think that’s true.\nFemale Reporter:\nYou literally say that they were too incapacitated to consent.\nRoosh: Macho sex writing is not a court. It’s not a piece of evidence that you can… Maybe some things I wanted to come across as an aggressive guy. Maybe I did. But just because there doesn’t means that there is a victim out there and she suffered. Have I raped anyone? No.\nReporter:\nIs that fiction?\nRoosh: No. It’s not. My interpretation of it may be, but she’s just taking quotes out of context anyway.\nReporter:\nYou made a point that you have an office that overlooks a golf course. You made that clip about speed before is that true?\nRoosh: Golf course?\nReporter:\nYeah.\nRoosh: I have no idea what you’re talking about. Golf course?\nReporter:\nYes, you have an office that overlooks a golf course.\nRoosh: I don’t remember ever saying that, man.\nReporter:\nYou mentioned the immigrant agenda and the feminist agenda before. I’m trying to get a better idea of what your personal politics are.\nRoosh: I would say that it’s anti-globalists which the Daily Beast represents a globalist type of platform.\nReporter:\nWhat do you mean by globalist?\nRoosh: Anything that benefits the current top 1000 men in the world in the US and Europe. You have a globalists and you have the nationalists. I would lean more towards a nationalist. Tradition, patriarchy, local solutions instead of globalization.\nReporter:\nSo does that mean you’re voting for?\nRoosh: Donald Trump comes the closest to what I think is true.\nFemale Reporter:\nYou express concern about your family after you were doxxed. Does that make you regret threatening to doxx reporters and protesters? Who…\nRoosh: I never threatened that. I said I was going to make a list of the names and the social networking accounts. I never said I was going to share their address. That was another lie. Another lie is that I live with my mom. It’s like you guys can’t stop lying. A man can’t visit his mom? I wished I lived with her! But no, that was a lie. See now, I don’t think it’s a good idea to say it but I live somewhere in Europe. So I’m just here for a short time and I happen to be here and the Daily Mail… I have to say though they had a lens that was far away I was like what’s that over there and you see on the Internet it was right there so… There’s people outside my dad’s house now probably.\nFemale Reporter:\nYou own that house then right?\nRoosh: No, I don’t own the house.\nFemale Reporter:\nIt’s registered in your name.\nRoosh: Well, I don’t know how.\nFemale Reporter:\nSo it’s not your house?\nRoosh: It’s not my house. Okay let me stop that and start again. So I don’t want to stay here all night with you guys. I have other things that I have to do so were going to wrap this up at 8 o’clock. Cool?\nReporter:\nWhat else has happened these last couple of days? Did you get dozens of [bad audio]. Has your phone been ringing off the hook? Or your parents’ phone?\nRoosh: You know, I think from a security standpoint it’s not smart to share that kind of stuff.\nReporter:\nWhere do you office out of? Do you find yourself writing on the road?\nRoosh: There’s a golf course that is outside of my office… No.\n(Laughter)\nRoosh: I’m mobile, so um. Office out of, I never heard that kind of phrase before (laughs) but Starbucks? You know?\nReporter:\nCan you confirm that you did have to upgrade the DDOS protection on the website after the threats?\nRoosh: We already had it because my servers were attacked last year. So we already had the systems in place but they were sending 20 million false requests every hour.\nReporter:\nActually 20 million?\nRoosh: Yeah, that’s the actual number. This was on Tuesday. Monday and Tuesday. Once the Australian thing hit. Now I must say, when the Australia thing hit that was a lot of fun because those people were obsessed about me and I was telling them that I was to come in by boat. But then the shit kind of got real once it came here, you know? Having fun with them is good but when they announce your address and are advising people to go down that then it’s no longer fun.\nReporter:\nWould you say that media misinterpretation is the best thing that ever happened to you?\nRoosh: The best and the worst. I mean what’s going to happen now? I’m going to be known, because of you, as a pro-rape advocate for the rest of my life until I die. Oh, that’s the guy that believes that all women should be raped. But at the same time they’re going to say that’s the guy. They’re going to know me. I could take a dump in a box right now and sell it because of you. So that’s what you have done to me. You have made me such a famous guy. I was a guy with the blog, just a guy with a blog, and you have taken me from here to this based on a lie. Now, I’d rather you had not done that but it happened and that is life right? So you’ve got to deal with what actually happens.\nReporter:\nWould you consider donating some of that money to a rape crisis center?\nRoosh: (laughs) I mean I think that the fact that the entire mainstream is trying to stop rape and assault against women I think they’re doing fine. But if they want to donate money to me to help with the bodyguards that I have to hire right now then they are more than welcome to.\nReporter:\nHow many bodyguards do you have around you right now?\nRoosh: Unfortunately, I can’t share that right now but you can count which guys back there are kind of large, you know?\nReporter:\nSo what are the plans for the next couple of days?\nRoosh: The next couple of days is really, probably, to get out of town since it is a little bit hot right now. It’s not that I really think someone is going to come and stab me but it’s not smart to stay in the city where everyone knows where I am at. So I will probably go up or down the East Coast.\nReporter:\nHow often do you return for your mom’s meatloaf?\nRoosh: I come for the meatloaf once a year for like one month. And hey, you know, I like to stay with her. I wish I could stay more. I was trying to stay for a month but now, because of this, I had to say goodbye to her.\nReporter:\nHave you had any trouble traveling internationally yet and you expect it?\nRoosh: No. I think England did not go ahead and say that I’m banned. I don’t think Australia will let me in now.\nReporter:\nDo you plan on trying to go to Australia?\nRoosh: I don’t see why I would go there. Yep.\nFemale Reporter:\nWhat does your mom think about all this?\nRoosh: My mom is angry. My mom is very angry.\nFemale Reporter:\nAt you?\nRoosh: Not at me. At you guys. She wants me to hit you guys back. Like you don’t understand a Middle Eastern mom, they get angry. I’m having to calm her down because she wants to fight. I’m saying Mom you gotta simmer down now. But no, she said son I support you, do what you gotta do, this is a matter of your speech and as long as you’re not doing anything illegal.\nReporter:\nWhat does she think of your treatment of women?\nRoosh: Treatment of women? My mom doesn’t know. My mom doesn’t know how I make love to this girl or that girl. She knows who I am. She knows that whatever I write on the Internet and the monster that you have made me there that I have never hurt a woman. You would think by now, guys, that one girl would come forward and say “Yeah, Roosh did it, he raped me”. One, you would think. Not one has come forward. Not one. Even though I have been known everywhere. So how do you explain that? Not one. It is weird how a lie can get to this point in time. So I’m not sure what the function of the media is because if you’re just going to lie and when the public is really in threat like in Germany was. Women in Germany right now are in threat. You don’t protect them but you come against me, what are you doing?\nReporter:\nThe media cover that pretty extensively. I can email you a bunch of…\nRoosh: After the outrage came. From day one? No.\nReporter:\nThat is absolutely not true.\nReporter:\nBack to what Caitlin was saying earlier, do you at least agree that, legally speaking, the technical legal definition that a woman is too drunk to consent to sex and you have sex with her, that is legally defined as rape. Can you at least…\nRoosh: How about the man? If the man is drunk, can he consent to rape?\nReporter:\nWe can talk about that in a moment.\nRoosh: No, no. It’s the same thing.\nReporter:\nNo, no, no, you’re not answering the question.\nRoosh: You’re not going to tell me what is right and wrong.\nReporter:\nOkay, woman, man, whatever, that is a legal definition of rape. Do you disagree with the legal definition of rape?\nRoosh: If a man is drunk and a woman has sex with him is it rape?\nReporter:\nYes.\nFemale Reporter:\nIt is not the legal definition of rape in many places though.\nReporter:\nIn many places no…\nRoosh: You’re trying to redefine the definition of consensual sex so that every man is on the hook for rape. That is what you’re trying to do. So no, I don’t agree with you.\nReporter:\nDo you believe Bill Cosby is a rapist?\nRoosh: I haven’t seen all of the evidence but I think that it’s weird that 20 years after…\nReporter:\nIf any of these women came back and said “Oh, Roosh did whatever”, here is somebody with a long history of…\nRoosh: The evidence that I have seen is girls wanted to be with him and take drugs with him, and then 20 years after that say that he hurt them.\nReporter:\nSo you don’t agree that that is a legal definition of rape?\nRoosh: I don’t think that they are being honest.\nReporter:\nIf they were?\nRoosh: If they were, look man I’m not a lawyer. See this is where we are right now where the mainstream is so obsessed about rape. We don’t even know what consensual sex is anymore. This is what we have done. So no you’re coming after me for an article where, clearly, I didn’t intend for people to think that I want all rape to be legal. So we’ve lost our minds. From now on about sex, the United States is just gone. We don’t know what sex is anymore. We don’t know what consensual sex is anymore and that’s because of the work that you have done.\nReporter:\nHow did this become your issue? We all have different issues we care about passionately, how did this become yours?\nRoosh: It’s not my issue. I’ve written over 3000 articles and maybe 10 of them were about rape.\nReporter:\n[bad audio]\nRoosh: Because when I was in college I want to learn how to make love to every attractive girl that I saw. So I needed to learn which skills that I had to do. Is there anyone that I have not called on yet because I’m trying to think of who is kind of quite. Why are you guys here then?\nReporter:\nMartha Stewart over there.\n(Laughter)\nFemale Reporter:\nUm, are you happy?\n(Laughter)\nRoosh: That’s why we didn’t call on her. I mean happiness is what? Am I happy that people have the wrong impression of who I am? No! But am I happy that I’m probably going to cash in on this as long as I can survive the next couple days? Hey, you gave it to me, you gave me a package and now I will run with it. You can’t turn the clock back.\nReporter:\nHow much have you made off of this in total?\nRoosh: You know I have to get my accountant to really tally it. Has sales of books gone up? Yes. Has advertising sales gone up? Yes.\nReporter:\nWhat is your vision for the future for male-female relations?\nRoosh: (laughs) Okay, well, what I’ve been trying to show on my website is that equality doesn’t work. I mean it doesn’t. If we have a divorce rate that is 50% or more, it doesn’t work. I think we have to go back to the days where the man leads the household. I think that’s the only way. But are we in the US? I don’t think so. I think there’s a couple of countries left where we can, maybe in Eastern Europe. The Muslim countries… You guys love Islam so I’m thinking that you guys would love… You guys give it a pass. They have a patriarchal system in the household. Do you get on them for that? In an Islamic marriage, there are some Muslim guys here, rape cannot happen during a marriage. Do you write about that? No.\nReporter:\nYes.\nRoosh: No you don’t.\nReporter:\nYeah we do. I’ll send you a bunch of links on that.\nRoosh: Please do, please do. And I’m going to read them carefully. But you guys give it a pass, you guys give Islam a pass for a patriarchal model that I write about but you come after me. Can we get something over here?\nFemale Reporter:\nShe’s just my photographer.\nRoosh: (Sighs)\nFemale Reporter:\nI am mostly here just to listen. Everyone else has mostly covered all the questions that I would’ve asked so.\nRoosh: Ask anything.\nFemale Reporter:\nWhy did you pick this hotel?\nRoosh: I used to actually come here on dates. I used to bring dates here. This was back in 2000s. This was a place where I used to bring a date. We would sit on a couch upstairs and I would make my smooth moves on them here. This was 2005, 2006.\nReporter:\nJust to clarify something earlier, you were saying that Donald Trump was the closest. Besides the anti-PC stuff, what do you like about his 2016 campaign?\nRoosh: He hates you guys too.\nReporter:\nBesides that.\nRoosh: That’s enough for me. The enemy of my enemy is my friend.\nReporter: The media is not a political ideological position.\nRoosh: Becoming anti-establishment is. You don’t understand, half you will be out of a job within five years time.\nReporter:\nSo you like that he is nationalist and anti-establishment.\nRoosh: And the reason is you’re not serving the needs of the public. You’re not. The establishment sites are losing views and I’m sure a lot of you have not seen your salaries increase in the way that you wanted. It’s because we don’t believe in the mainstream anymore. In this case, what you did to me is now showing the world what you guys do and how you operate.\nReporter:\nI didn’t do anything to you…\nFemale Reporter:\nWhy did you end up canceling all the meetings? Because a lot of them weren’t going to be protested right?\nRoosh: A lot of them were. I would say at least half of them. This news made it to Russia.\nFemale Reporter:\n[bad audio]\nRoosh: Who said they’re not? You know, a mistake that I made was saying lets let these masculine, strong men organize, who hate the government, probably, and meet. That was kinda dumb. Because this could be a threat against us. So if we have to go underground, I’ll go underground. We never had a goal where we had to do everything in public.\nReporter:\nIf you and the people who follow your website closely are so strong, why do it in secret?\nRoosh: Are you going to go to a meeting where the cops are on you?\nReporter:\nI have before.\nRoosh: I don’t like this guy. I mean he’s just being argumentative.\nFemale Reporter:\nWas there supposed to be a public component at all to these meetings?\nRoosh: No, it was just the most efficient way to organize people who like me and who like my site. Hey guys, just meet here at this time.\nFemale Reporter:\nThey were not planning on doing anything there. They were just going to hang out, right?\nRoosh: No, okay, I’m going to tell you. There were going to meet at that point and say where’s the Pet Shop? It’s right here. Okay, hey cool, what your name? Where are you from? There’s a bar over here let’s go for a drink. That was it! That was it and then the worldwide anger came.\nReporter:\nBut again if they’re strong, masculine, brave, why the subterfuge?\nRoosh: Because you have angered a mob that wants to disrupt their meeting because you have gotten governments against them by lying about their intention. Now the world thinks that they’re going to meet to rape people. So why are they going to meet now? Do you think it’s smart to go and meet now? After that? You would go to a meeting where everyone is targeting you as a potential person who is going to rape. That’s what you would do? Of course not! You don’t seem like the type that would stand up to someone who is coming against you. I mean, do you lift? You don’t lift.\nReporter:\nNo, I don’t.\nRoosh: I do lift but I lost some weight. I’m just saying, like, this guy is saying go into the fire. Who is going to do that? That’s absurd! This is where all these absurd ideas come from, from you guys. It doesn’t make any sense! It doesn’t make any sense. (sighs) So we got five more minutes.\nReporter:\nDo you feel that leaving town or having bodyguards takes away from your masculinity?\nRoosh: No! If your life is in danger, no. If you want to stand up and fight and get into a confrontation, that’s fine, but right now the heat is on my mom and dad so me leaving is going to take the heat away. So I am considering them in the actions that I do. Last summer I had two speeches in Montréal and Toronto and the same anger came. What did I do? I stood there. Why? Because my family was not in danger. They didn’t post their address. For the record, I held the speeches even though the mayors came out against me but now it’s not worth a public happy hour to go against the police, governors, mayors, and all that stuff and put the safety and privacy of the men who follow me… I can’t toss them into that. I can toss myself into that. I can hire a bodyguard. I can go out right now and drink (which I will) but I’m not going to put them in danger. That would be like just looking out for me instead of the men who trust the things that I do.\nFemale Reporter:\nHow many men would you say those are?\nRoosh: It’s hard to say, but based on the site traffic that I get for Return of Kings, I get one million uniques each month. Out of the hard-core people who really follow me it could be as high as 200,000.\nFemale Reporter:\nAnd how many of them were you expecting to go to these meetups around the world?\nRoosh: There’s no way to know because it was just show up. Okay, so we got time for one more.\nReporter:\nHow many women have you been with?\nRoosh: (sighs) A lot. I have been with a lot, but that’s not relevant to the current matter at hand. But thank you. Thank you all for coming. I expect more lies in your articles that are going to come up but I just wanted to do this to show what the truth is. Okay? So have a good night.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-08T10:03:00+00:00"
}