{
  "url": "https://voxday.net/2016/02/25/why-trump-is-winning/",
  "scraped_at": "2025-12-17T17:47:15.436960",
  "title": "Why Trump will win",
  "date_display": "February 25, 2016",
  "date_iso": "2016-02-25T02:19:00+00:00",
  "date_from_url": "2016-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really quite simple, as this commenter at Althouse explained it:</p><blockquote class=\"tr_bq\"><p> Hillary says “Vote for me because I’m a woman.”<br> Bernie says “Vote for me and I’ll give you some of his.”<br> Ted Cruz says “Vote for me and I’ll kick over all those rice bowls in Washington”.<br> Donald Trump says “Vote for me and the emergency room at your local hospital won’t look like a bus station in rural Mexico”</br></br></br></p><p>Might not be fair but I think I know who is going to win that argument.</p></blockquote><p>To this we can add: Marco Rubio says “Vote for me because I am electable as determined by the Republican establishment.”</p><p>People want relief from pain. And the pain from losing their country to 60 million invaders is much greater than the constant Washington shenanigans that few understand anyhow. </p></div>",
  "content_text": "It’s really quite simple, as this commenter at Althouse explained it:\nHillary says “Vote for me because I’m a woman.”\nBernie says “Vote for me and I’ll give you some of his.”\nTed Cruz says “Vote for me and I’ll kick over all those rice bowls in Washington”.\nDonald Trump says “Vote for me and the emergency room at your local hospital won’t look like a bus station in rural Mexico”\nMight not be fair but I think I know who is going to win that argument.\nTo this we can add: Marco Rubio says “Vote for me because I am electable as determined by the Republican establishment.”\nPeople want relief from pain. And the pain from losing their country to 60 million invaders is much greater than the constant Washington shenanigans that few understand anyhow.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-25T02:19:00+00:00"
}