{
  "url": "https://voxday.net/2016/02/26/yeah-its-not-latin/",
  "scraped_at": "2025-12-17T17:47:31.632046",
  "title": "Yeah, it’s not Latin at all",
  "date_display": "February 26, 2016",
  "date_iso": "2016-02-26T18:26:00+00:00",
  "date_from_url": "2016-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always amusing how the midwits at File 770 are locked into the position that everything I do must, by definition, be stupid, evil, and wrong. A couple of them are <i>still </i>striking poses about the title of <i>Opera Vita Aeterna</i>:</p><blockquote class=\"tr_bq\"><p> No, that’s not how medieval Latin worked. It still had grammar!</p><p>That title is crap Latin whether it is supposed to be Classical or Medieval Latin.</p><p>You can’t just write out strings of straight dictionary words of Latin and hope they mean what you want them to.</p><p>The change from Classical Latin to Medieval Latin was a little more like taking this:</p><p>    To be, or not to be–that is the question:</p><p>And making this:</p><p>    It’s a question of being or not being.</p><p>That Beale title is more the equivalent of</p><p>    Is! Is! Negate! Is! Yonder! Query!</p></blockquote><p>Actually, it’s not Latin at all. I don’t speak Latin. I speak Italian. And it’s not actually proper Italian either, which would be <i>Un’opera della vita eterna</i>, but in the hallowed tradition of my fallen intellectual hero, Umberto Eco, I abbreviated it, then added an extra A to give it a Latinate flavor. I not only didn’t “just write out strings of straight dictionary words”, I didn’t use a dictionary at all.</p><p>Now, if the File 770ers were genuinely familiar with my writing, or were doing anything more than posturing and virtue-signaling, they would have criticized my bad Latin in<i> Summa Elvetica</i>, where I did actually write in what is actually supposed to be Latin.</p><p><i>Praeterea, homo in Die Sexto creatus sunt. In ordine naturae qui in narratione Creationis descriptus, perfectius praestat. Ergo homo est perfectior quam aelvi. Tum, perfectissima res animae estseparatio ab corpore, quod in illa re similior Dei angelorumque, et purior, quod separatur ab ulla aliena substantia. Quandoquidem non aeque perfecti atque homines, aelvi ulterius quam homines ab perfectissima re animae. Ergo aelvi habent animae naturaliter sibi unita.</i></p><p>I would, of course, welcome any grammatical corrections they might suggest and will be happy to add them to the novel should they be able to provide any.</p><p>You can always tell a midwit, because he’s always in a hurry to show everyone how smart he isn’t.</p></div>",
  "content_text": "It’s always amusing how the midwits at File 770 are locked into the position that everything I do must, by definition, be stupid, evil, and wrong. A couple of them are\nstill\nstriking poses about the title of\nOpera Vita Aeterna\n:\nNo, that’s not how medieval Latin worked. It still had grammar!\nThat title is crap Latin whether it is supposed to be Classical or Medieval Latin.\nYou can’t just write out strings of straight dictionary words of Latin and hope they mean what you want them to.\nThe change from Classical Latin to Medieval Latin was a little more like taking this:\nTo be, or not to be–that is the question:\nAnd making this:\nIt’s a question of being or not being.\nThat Beale title is more the equivalent of\nIs! Is! Negate! Is! Yonder! Query!\nActually, it’s not Latin at all. I don’t speak Latin. I speak Italian. And it’s not actually proper Italian either, which would be\nUn’opera della vita eterna\n, but in the hallowed tradition of my fallen intellectual hero, Umberto Eco, I abbreviated it, then added an extra A to give it a Latinate flavor. I not only didn’t “just write out strings of straight dictionary words”, I didn’t use a dictionary at all.\nNow, if the File 770ers were genuinely familiar with my writing, or were doing anything more than posturing and virtue-signaling, they would have criticized my bad Latin in\nSumma Elvetica\n, where I did actually write in what is actually supposed to be Latin.\nPraeterea, homo in Die Sexto creatus sunt. In ordine naturae qui in narratione Creationis descriptus, perfectius praestat. Ergo homo est perfectior quam aelvi. Tum, perfectissima res animae estseparatio ab corpore, quod in illa re similior Dei angelorumque, et purior, quod separatur ab ulla aliena substantia. Quandoquidem non aeque perfecti atque homines, aelvi ulterius quam homines ab perfectissima re animae. Ergo aelvi habent animae naturaliter sibi unita.\nI would, of course, welcome any grammatical corrections they might suggest and will be happy to add them to the novel should they be able to provide any.\nYou can always tell a midwit, because he’s always in a hurry to show everyone how smart he isn’t.",
  "tags": [
    "SJW",
    "trainwreck",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-02-26T18:26:00+00:00"
}