{
  "url": "https://voxday.net/2007/09/17/american-stasi-3/",
  "scraped_at": "2026-01-08T21:54:10.308888",
  "title": "American Stasi",
  "date_display": "September 17, 2007",
  "date_iso": "2007-09-17T10:50:00+00:00",
  "date_from_url": "2007-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d be tempted to break a few windows, or maybe just a windshield, if I knew <a href=\"http://www.twincities.com/allheadlines/ci_6912998?source=email&amp;nclick_check=1\">my neighbor was a volunteer spy</a>:</p><blockquote><p>After clocking drivers in her hometown for almost a year, Hudson, Wis., resident Jodi Colbeth has learned a lot about speeders. Women tend to have more of a lead foot than men. Teenage boys driving tricked-out Honda Civics are probably going too fast. Ditto for pizza delivery guys.</p><p>Colbeth is one of about eight volunteers in the Traffic Tamers program who regularly check out a radar gun from the Hudson Police Department to help tag speeders. About once a month, Colbeth and another volunteer pick a “hot spot” in the city and clock everyone who drives by during a shift about two hours long.</p></blockquote><p>I must be getting old.  I remember when people used to point out how awful the Soviet Union and East Germany were because of all the spies among the citizenry.  And what a surprise that it should be middle-aged female government bureaucrats that are volunteering for this.</p><p>Now Americans are being actively encouraged to spy for terrorists, tax evaders, in-state residents and speeders, among others.  Why not go whole hog and set up citizens groups to spy for secret homosexuals, adulterers, global warming deniers and illicit doughnut eaters?  Ah, that’s right, doughnuts are still legal… at least they are until <a href=\"http://news.yahoo.com/s/ap/20070917/ap_on_el_pr/clinton_health_care;_ylt=Ap79AAi7EvsMRwgrY71BSe.yFz4D\">health care gets nationalized</a>.</p></div>",
  "content_text": "I’d be tempted to break a few windows, or maybe just a windshield, if I knew\nmy neighbor was a volunteer spy\n:\nAfter clocking drivers in her hometown for almost a year, Hudson, Wis., resident Jodi Colbeth has learned a lot about speeders. Women tend to have more of a lead foot than men. Teenage boys driving tricked-out Honda Civics are probably going too fast. Ditto for pizza delivery guys.\nColbeth is one of about eight volunteers in the Traffic Tamers program who regularly check out a radar gun from the Hudson Police Department to help tag speeders. About once a month, Colbeth and another volunteer pick a “hot spot” in the city and clock everyone who drives by during a shift about two hours long.\nI must be getting old.  I remember when people used to point out how awful the Soviet Union and East Germany were because of all the spies among the citizenry.  And what a surprise that it should be middle-aged female government bureaucrats that are volunteering for this.\nNow Americans are being actively encouraged to spy for terrorists, tax evaders, in-state residents and speeders, among others.  Why not go whole hog and set up citizens groups to spy for secret homosexuals, adulterers, global warming deniers and illicit doughnut eaters?  Ah, that’s right, doughnuts are still legal… at least they are until\nhealth care gets nationalized\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-17T09:50:00+00:00"
}