{
  "url": "https://voxday.net/2007/09/20/attention-atlanta/",
  "scraped_at": "2026-01-08T21:54:33.595683",
  "title": "Attention Atlanta",
  "date_display": "September 20, 2007",
  "date_iso": "2007-09-20T10:50:00+00:00",
  "date_from_url": "2007-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Few gamers know that the legendary Dr. Johnny Wilson, a leading figure at Computer Gaming world from 1982 to 1999 who served as its editor-in-chief for seven years during its heyday, also happens to be theologian.  In addition to teaching courses on game design and the history of games, he has accepted the responsibility for helping revive a near-defunct church in Atlanta.  As of our conversation this week, the church consists of 11 parishioners.</p><p>So, if you live near Atlanta, I’d encourage you to consider supporting Dr. Wilson by attending a service or two at Northwest Baptist Church, located at 1150 Niles Avenue NW in Atlanta.  If you have any questions for him or about what he is intending to do there, he can <a href=\"drjohnny@numail.org\">be reached here</a>.</p><p>Just to give you an idea of the way in which Johnny approaches his teachings from the Bible, here’s a sample from his sermon on Joshua and Jericho, which is based on his own translation from the Hebrew:</p><blockquote><p><b>God’s Plan for Spiritual Victory</b> <br>(Joshua 5:13-6:27)<br>Dr. Johnny Wilson</br></br></p><p>I’ve had the privilege of teaching game design courses in both Taiwan and here in Atlanta. Games by definition have two things in common—the risk of losing and the all important victory conditions: how to win. Just this week, a student asked me what needed to be in a game’s documentation and, upon glancing at his notes, I noticed that there were no “Victory Conditions.” When I pointed this out to him, he asked why they needed to be in the rules. I countered with the question, “Why would you want to play if there was no way to win?” The point finally came home to him.</p><p>In Joshua 5:13 and the account that follows, we find out what is required to win victories in our lives. To be sure, we can all pretty well answer, “Trust totally in God.” Of course, that is easier said than done. Let’s see if we can figure out what it takes.</p><p>First of all, I notice that Joshua wasn’t just hanging around his base camp in Gilgal, the HQ that we spoke of last week. Verse 13 says in the Hebrew that he was “in Jericho.” Of course, the scripture has already told us that the Israelites were in the region of Jericho and up against Jericho, so we can understand it as being in the proximity of Jericho. I believe he is there in order to do some final spying, scouting, reconnoitering before the battle.</p><p>And I think it’s important for us to understand this—even though God had already promised victory and even though God would later explain how things were to be done in a very unusual manner, Joshua was doing everything he could do to prepare himself for the battle. You know, I lose patience with those ministers who say, “I didn’t want to go to college or seminary because I was afraid the education would get in the way of having God speak to me. I want my sermons inspired by the Lord.” I also lose patience with believers who say, “I don’t want to make any plans for worship. Let’s just get together and not hinder the Holy Spirit.” Think also of how many churches would rather float along than make any long-range plans. They must not want to “bias” the Holy Spirit!</p><p>But how can we expect God to come to us with definitive marching orders if we aren’t prepared to execute them. Naturally, some of you will object that I am reading more into Joshua’s presence beside the city or in the environs of the city than the text gives us. To you, I offer the additional military evidence to be found in Joshua 6:1. There it tells us that the city was sealed tightly so that no one could enter or exit the city BECAUSE of Israel. See! They were already besieging Jericho by encircling it with a human blockade.</p><p>As a result, I believe these verses encourage us to: a) Know our enemies – find out as much as we can about the techniques used by Satan and his minions to oppose God’s Holy Spirit and to oppose us as we minister through that Holy Spirit. We need to be aware of accusation, gossip, half-truths, depression, discouragement, false expectations, and the like. We need to be prepared to face the fact that church leaders and members of the fellowship will fail, but recognize that their failures does not mean God failed. And if God is at work in their lives, God will still win in His time.</p><p>So, Joshua was apparently scouting out Jericho even up to the last minute, according to our text, and God’s people weren’t allowing their enemies to even get away with incidental movement. So, as Joshua prepared and Israel contained the enemy in a siege, God revealed Himself to Joshua.</p><p>“Wait a minute!” some of you protest. “Verse 13 says that there was a man with a sword in his hand. It doesn’t even say that the man looked any bigger than any other man or more fierce than any other warrior. How did GOD reveal Himself to Joshua?”</p><p>Read on. As verse 13 continues, Joshua demands to know whether the intruder is for Israel or for their enemies. At first, it rather reminds us of a modern leader telling the world that they are either “for us or against us.” But if we read verse 14, we see that there actually is a different answer. God doesn’t work in “Yes” or “No” binary code. God isn’t FOR Israel or AGAINST Israel. God isn’t FOR us or AGAINST us. Rather, God wants to know if we are FOR or AGAINST HIM! And there’s a big difference!</p><p>Verse 14 in the Hebrew literally reads: “No! BECAUSE I, I have come now (as) the prince of the host of  Yahweh.” That’s an unusual title. It’s only used one other time in the Old Testament—in Daniel’s vision in Daniel 8:11. In that vision, the beast with horns goes after the “prince of the great host.” It’s clear from the Daniel vision that if you oppose the prince of the great host (we would say commander of the great army), you oppose God Himself. It isn’t clear whether the “prince” or “chief” was the righteous high priest who would intercede in prayer for God’s intervention, the archangel Michael as he struggled with the minions of Satan as in Revelation, or some manifestation of God’s own person prior to the Incarnation. But it is clear that God’s holy person was present in the activity of the commander of the great heavenly army and it is clear that anyone who opposed him, opposed God and God’s purposes.</p><p>We don’t know for sure how God accommodated Himself to deliver this message to Joshua, but we know it was unnerving to Joshua. When three men that we later find out are manifestations of God come to Abraham’s tent and later, to Sodom, they brought warnings of destruction. When Jacob wrestled with the man, he said he saw the face of God and he was crippled for the rest of his life. When the LORD encountered Moses in Exodus 4, threatening to kill Moses before the great leader could accomplish anything ordered earlier, Zipporah (Moses’ wife) was so afraid that she quickly circumcised their son and threw the foreskin at Moses’ feet, proclaiming him a “bridegroom of blood.” When Pharaoh encountered the destroying angel, it was God’s own judgment of the Pharaoh and the firstborn of all who didn’t have the blood on the doorpost. When Balaam finally saw the angel of the Lord standing in the midst of the road with a sword in his hand, he realized he had only been saved by the miraculous speech of a talking donkey. When Manoah and his wife saw the angel of the Lord ascend into the fire of his sacrifice, he was afraid God was going to kill him. There was no sweet cartoon cherubim when God’s angels appeared. There was no happy “touched by an angel” type of story.</p><p>Facing an angel meant to be confronted with as much of the holy presence of God as a human could stand. It was frightening, dangerous, and unsettling. Yet, we should have some concept of this when we come to God in worship—yet, we don’t.</p><p>What is clear is that Joshua doesn’t hesitate to declare HIS allegiance. He immediately falls o<br> n his face and worships. Now, whether Joshua was expecting the man to deliver Joshua’s own praise, petitions, and gratitude to God as a messenger or whether Joshua recognized God’s Presence in the man himself, we don’t know. All we know is that when he was confronted by the divine revelation that HE was to be FOR God instead of God being FOR Israel, he worshipped by humbling himself at the feet of God’s messenger.</br></p><p>It’s so easy for us to depend upon human ideas, plans, and technology. We feel confident in using ideas, plans, and techniques that are familiar and allow us to remain in control. In fact, I think Joshua would have felt perfectly confident if God had allowed him to construct battering rams, siege ladders, and assault teams to go right after the walls of Jericho. Of course, a lot of unnecessary Hebrew blood would have been spilled if he had. And if he had, I’m not sure Israel would have recognized that God gave the miraculous victory.</p></blockquote><p>Unlike many ear-tickling preachers, Dr. Wilson understands that the Christian worldview encompasses the darkness of a fallen world and the majesty of an Almighty God as well as the Gospel of divine love; it is far more than the mealy-mouthed application of the Golden Rule to which too many adherents and detractors alike attempt to reduce it.</p><p>I don’t know if Northwest Baptist’s decline is irreversible, or if it will one day be seen as another powerful example of the way in which God can use a single man to transform a community.  (Or, if you prefer to put it in magical material reductionist terms, how an individual can prove to be an efficient transmission point for a particularly virulent meme.)  But I have twice seen a small gathering of Christians transformed into a powerful assembly of thousands in less than five years; if this is God’s Will for Dr. Wilson and the believers at Northwest Baptist, it will surely happen again.  I seem to recall that God has used eleven men to a certain amount of historical effect in the past.</p></div>",
  "content_text": "Few gamers know that the legendary Dr. Johnny Wilson, a leading figure at Computer Gaming world from 1982 to 1999 who served as its editor-in-chief for seven years during its heyday, also happens to be theologian.  In addition to teaching courses on game design and the history of games, he has accepted the responsibility for helping revive a near-defunct church in Atlanta.  As of our conversation this week, the church consists of 11 parishioners.\nSo, if you live near Atlanta, I’d encourage you to consider supporting Dr. Wilson by attending a service or two at Northwest Baptist Church, located at 1150 Niles Avenue NW in Atlanta.  If you have any questions for him or about what he is intending to do there, he can\nbe reached here\n.\nJust to give you an idea of the way in which Johnny approaches his teachings from the Bible, here’s a sample from his sermon on Joshua and Jericho, which is based on his own translation from the Hebrew:\nGod’s Plan for Spiritual Victory\n(Joshua 5:13-6:27)\nDr. Johnny Wilson\nI’ve had the privilege of teaching game design courses in both Taiwan and here in Atlanta. Games by definition have two things in common—the risk of losing and the all important victory conditions: how to win. Just this week, a student asked me what needed to be in a game’s documentation and, upon glancing at his notes, I noticed that there were no “Victory Conditions.” When I pointed this out to him, he asked why they needed to be in the rules. I countered with the question, “Why would you want to play if there was no way to win?” The point finally came home to him.\nIn Joshua 5:13 and the account that follows, we find out what is required to win victories in our lives. To be sure, we can all pretty well answer, “Trust totally in God.” Of course, that is easier said than done. Let’s see if we can figure out what it takes.\nFirst of all, I notice that Joshua wasn’t just hanging around his base camp in Gilgal, the HQ that we spoke of last week. Verse 13 says in the Hebrew that he was “in Jericho.” Of course, the scripture has already told us that the Israelites were in the region of Jericho and up against Jericho, so we can understand it as being in the proximity of Jericho. I believe he is there in order to do some final spying, scouting, reconnoitering before the battle.\nAnd I think it’s important for us to understand this—even though God had already promised victory and even though God would later explain how things were to be done in a very unusual manner, Joshua was doing everything he could do to prepare himself for the battle. You know, I lose patience with those ministers who say, “I didn’t want to go to college or seminary because I was afraid the education would get in the way of having God speak to me. I want my sermons inspired by the Lord.” I also lose patience with believers who say, “I don’t want to make any plans for worship. Let’s just get together and not hinder the Holy Spirit.” Think also of how many churches would rather float along than make any long-range plans. They must not want to “bias” the Holy Spirit!\nBut how can we expect God to come to us with definitive marching orders if we aren’t prepared to execute them. Naturally, some of you will object that I am reading more into Joshua’s presence beside the city or in the environs of the city than the text gives us. To you, I offer the additional military evidence to be found in Joshua 6:1. There it tells us that the city was sealed tightly so that no one could enter or exit the city BECAUSE of Israel. See! They were already besieging Jericho by encircling it with a human blockade.\nAs a result, I believe these verses encourage us to: a) Know our enemies – find out as much as we can about the techniques used by Satan and his minions to oppose God’s Holy Spirit and to oppose us as we minister through that Holy Spirit. We need to be aware of accusation, gossip, half-truths, depression, discouragement, false expectations, and the like. We need to be prepared to face the fact that church leaders and members of the fellowship will fail, but recognize that their failures does not mean God failed. And if God is at work in their lives, God will still win in His time.\nSo, Joshua was apparently scouting out Jericho even up to the last minute, according to our text, and God’s people weren’t allowing their enemies to even get away with incidental movement. So, as Joshua prepared and Israel contained the enemy in a siege, God revealed Himself to Joshua.\n“Wait a minute!” some of you protest. “Verse 13 says that there was a man with a sword in his hand. It doesn’t even say that the man looked any bigger than any other man or more fierce than any other warrior. How did GOD reveal Himself to Joshua?”\nRead on. As verse 13 continues, Joshua demands to know whether the intruder is for Israel or for their enemies. At first, it rather reminds us of a modern leader telling the world that they are either “for us or against us.” But if we read verse 14, we see that there actually is a different answer. God doesn’t work in “Yes” or “No” binary code. God isn’t FOR Israel or AGAINST Israel. God isn’t FOR us or AGAINST us. Rather, God wants to know if we are FOR or AGAINST HIM! And there’s a big difference!\nVerse 14 in the Hebrew literally reads: “No! BECAUSE I, I have come now (as) the prince of the host of  Yahweh.” That’s an unusual title. It’s only used one other time in the Old Testament—in Daniel’s vision in Daniel 8:11. In that vision, the beast with horns goes after the “prince of the great host.” It’s clear from the Daniel vision that if you oppose the prince of the great host (we would say commander of the great army), you oppose God Himself. It isn’t clear whether the “prince” or “chief” was the righteous high priest who would intercede in prayer for God’s intervention, the archangel Michael as he struggled with the minions of Satan as in Revelation, or some manifestation of God’s own person prior to the Incarnation. But it is clear that God’s holy person was present in the activity of the commander of the great heavenly army and it is clear that anyone who opposed him, opposed God and God’s purposes.\nWe don’t know for sure how God accommodated Himself to deliver this message to Joshua, but we know it was unnerving to Joshua. When three men that we later find out are manifestations of God come to Abraham’s tent and later, to Sodom, they brought warnings of destruction. When Jacob wrestled with the man, he said he saw the face of God and he was crippled for the rest of his life. When the LORD encountered Moses in Exodus 4, threatening to kill Moses before the great leader could accomplish anything ordered earlier, Zipporah (Moses’ wife) was so afraid that she quickly circumcised their son and threw the foreskin at Moses’ feet, proclaiming him a “bridegroom of blood.” When Pharaoh encountered the destroying angel, it was God’s own judgment of the Pharaoh and the firstborn of all who didn’t have the blood on the doorpost. When Balaam finally saw the angel of the Lord standing in the midst of the road with a sword in his hand, he realized he had only been saved by the miraculous speech of a talking donkey. When Manoah and his wife saw the angel of the Lord ascend into the fire of his sacrifice, he was afraid God was going to kill him. There was no sweet cartoon cherubim when God’s angels appeared. There was no happy “touched by an angel” type of story.\nFacing an angel meant to be confronted with as much of the holy presence of God as a human could stand. It was frightening, dangerous, and unsettling. Yet, we should have some concept of this when we come to God in worship—yet, we don’t.\nWhat is clear is that Joshua doesn’t hesitate to declare HIS allegiance. He immediately falls o\nn his face and worships. Now, whether Joshua was expecting the man to deliver Joshua’s own praise, petitions, and gratitude to God as a messenger or whether Joshua recognized God’s Presence in the man himself, we don’t know. All we know is that when he was confronted by the divine revelation that HE was to be FOR God instead of God being FOR Israel, he worshipped by humbling himself at the feet of God’s messenger.\nIt’s so easy for us to depend upon human ideas, plans, and technology. We feel confident in using ideas, plans, and techniques that are familiar and allow us to remain in control. In fact, I think Joshua would have felt perfectly confident if God had allowed him to construct battering rams, siege ladders, and assault teams to go right after the walls of Jericho. Of course, a lot of unnecessary Hebrew blood would have been spilled if he had. And if he had, I’m not sure Israel would have recognized that God gave the miraculous victory.\nUnlike many ear-tickling preachers, Dr. Wilson understands that the Christian worldview encompasses the darkness of a fallen world and the majesty of an Almighty God as well as the Gospel of divine love; it is far more than the mealy-mouthed application of the Golden Rule to which too many adherents and detractors alike attempt to reduce it.\nI don’t know if Northwest Baptist’s decline is irreversible, or if it will one day be seen as another powerful example of the way in which God can use a single man to transform a community.  (Or, if you prefer to put it in magical material reductionist terms, how an individual can prove to be an efficient transmission point for a particularly virulent meme.)  But I have twice seen a small gathering of Christians transformed into a powerful assembly of thousands in less than five years; if this is God’s Will for Dr. Wilson and the believers at Northwest Baptist, it will surely happen again.  I seem to recall that God has used eleven men to a certain amount of historical effect in the past.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-20T09:50:00+00:00"
}