{
  "url": "https://voxday.net/2007/09/18/debate-continues/",
  "scraped_at": "2026-01-08T21:54:19.504880",
  "title": "The debate continues",
  "date_display": "September 18, 2007",
  "date_iso": "2007-09-18T11:41:00+00:00",
  "date_from_url": "2007-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I must apologize to Scott for the lengthy delay, as it took me longer to get caught up on my reading than I’d expected.  He correctly noted that the NFL season started, what he may not realize is that the third game ends at six in the morning my time and it takes a little while for me to adjust to my NFL seasonal schedule; those Monday and Thursday night games just don’t help at all.  In any event, I appreciate his patience.</p><p>In <a href=\"http://monkeytrials.blogspot.com/2007/09/vox-dei-bate-11-lets-talk-about-science.html\">his last post on the subject</a>, Scott correctly pointed out that I had misinterpreted the difference between what Lejeune was saying and what Miller was concluding.  He then, however skeptically, noted a distinction I have been attempting to make for some time now, with admittedly limited success.</p><blockquote><p>Vox admits that he is “in no way opposed to its (TENS) continued refinement and application in the field of biology,” and wants people to know he’s never been opposed to it. Well, Vox, let me say that you’ve got a funny way of showing it. I’ll give you the benefit of the doubt, though, since I’m pretty sure that most of your snide remarks are really at the expense of Dawkins and other committed evolutionists, rather than the actual science.</p></blockquote><p>In light of the recent study published in JAMA indicating that only one of 432 published research claims concerning gender and genes could be replicated, I don’t think my skepticism about the current state of science can reasonably be described as either unfounded or unreasonable.  I find it very curious that scientists appear to be so hostile to scrutiny, especially in light of the way in which their method supposedly guarantees reliability.  It tends to suggest that they have something to hide, namely, that they are not in fact making use of proper falsifiable and replicable methodologies.  Moreover, I believe Scott’s tacit admission that much of what Dawkins and other committed evolutionists are doing is not actual science is entirely correct, as is his guess regarding the primary focus of my disdain.  Evolutionary theory is harmless in itself, but when it is abused and treated as unscientific dogma used to justify everything from Marxism and Lebensraum to rational materialism and anti-theism it becomes downright dangerous.</p><p>Of course, the fact that a theory is the only game in town at the moment does not mean that it is, in fact, accurate.  Ptolemy’s geocentric theory was the only game in town for centuries, until Copernicus suggested otherwise.</p><blockquote><p>Vox continues to argue that what he calls ‘backtesting’ casts doubts on the reliability of TENS, with respect to my posts on the chimpanzee chromosome…  Vox, you are just playing word games here rather than addressing the science on its own merits. Back in 1973, LeJeune and other researchers proposed a radical hypothesis (telomeric fusion) to explain the banding patterns they saw. Subsequent analysis of the DNA sequence could’ve provided evidence against this interpretation. The banding patterns which seemed to suggest the fusion of two separate chromosomes could’ve been artifacts of other types of chromosomal change. The sequences, when examined, could’ve failed to line up with homologous sequences in the two chimpanzee chromosomes. The presence of pericentromeric regions within chromosome #2, the signature of an ancestral chromosome’s inactivated centromere, could’ve failed to appear upon closer investigation.</p></blockquote><p>I was not playing word games, my previous statement about Miller’s conclusion was a combination of accurate reading comprehension with chromosomal ignorance.  Now that I’ve read up on telomeric fusion and read through LeJeune’s abstract as well as a few related studies, I think Scott and Ken Miller’s assertion of the fused chromosome hypothesis does qualify as a valid testable prediction which was subsequently confirmed to be a successful one.  However, I also note that if scientists wish to be understood by anyone but other scientists, they have simply got to stop saying the equivalent of “I predicted the results would be A, the results were X, so therefore my prediction was correct”, ESPECIALLY when trying to explain things to those who can’t possibly be expected to know the jargon.  Now Scott knew X=A, but I certainly didn’t; the fact that few of the science fetishists at Pharyngula knew anything about the state of the chromosome fusion hypothesis only underlines the terrible transmission of the current state of science from the professionals to even those amateurs most interested in it, let alone to skeptics like me who assume at least 95 percent of scientists, like 95 percent of the rest of the human race, are operating primarily on self-serving economic principles.</p><p>Now that I understand X=A in this case, I freely acknowledge that Lejeune’s prediction turned out to be correct; the DNA evidence suggests a telomeric fusing event that explains the variant number of primate chromosomes in a way which is consistent with TENS.  It was an impressive intellectual feat, if a logically necessary one.  But this does not prove the existence of a common ancestor, for which there is still no evidence, it merely means that the proposed origin of human chromosome two is currently supported by the existing evidence and that a common ancestor cannot be ruled out due to the variant number of chromosomes.  But to prove the possibility is not proving the scientific fact.</p><p>In reading about this successful prediction, I learned that there have been a number of similar predictions, for example, there are hypotheses related to the origins of human chromosomes one, five and seven that are not yet considered to be conclusive.  And when one looks more closely at the evidence, one realizes that far from proving TENS, the Lejeune evidence merely allowed it to dodge a bullet; the fact that no evolutionist appears to have admitted for more than thirty years that barring the successful demonstration of Lejeune’s hypothesis, TENS was highly unlikely to be a valid description of the origin of the human species tends to raise some questions about whether they are more devoted to science or TENS dogma.  In any event, I should very much like to know approximiately how many similar genomic predictions based on TENS have been made since 1973; while one out of four isn’t bad, one out of ten thousand would be downright unimpressive, especially since we were recently informed that the genomic evidence is now in variance with the paleontological evidence by a factor of around 85 percent.</p><blockquote><p>I’d forgotten entirely about the example of the naked mole rat. I think I’ll dust that one off and post about it if anyone whines I’ve only one example.</p></blockquote><p>The second prediction Scott cites, in his comments, is one that is considered to be “one of the most remarkable in modern biology”, that of the naked mole rat.  However, it is not at all supportive of his case.  I would argue that it actually tends to support my skeptical position.  I happen to be familiar with the story from <em>The Selfish Gene</em>, and I must point out that in Alexander’s series of lectures, no falsifiable prediction was made, TENS was largely irrelevant to it, TENS as Scott defines it was not involved in any way, and the entire situation described was wholly unscientific except in that scientists were involved.  We are assured, of course, that Alexander had no idea that a mammal fitting his 12-point hypothesis existed, but since the naked mole rat’s existence was already known to zoologists, we cannot simply take his word for it that he did not know all an animal that scientists had been studying for more than a decade.</p><p>If anecdotal personal testimony is rejected when provided in defense of theology, it cannot possibly be accepted in defense of biology.  And Alexander’s 12-points border on the silly; one need not know anything about TENS to predict that a theoretically unknown bird or mamma<br> l would be a rodent living underground – people tend to notice large predators and flying creatures, after all – and reading his 12-points, it appears that he simply described the closest thing to a termite that wasn’t an insect; the JSTOR paper on it is even titled “The Naked Mole Rat: A Mammalian Termite?”.  Moreover, his “prediction” was specifically anti-genetic, while some scientists who work with Alexander, such as Paul Sherman, who researchs mole rats at Cornell, even claim that eusociality occurs in other birds and mammals, such as lions.  And while lions are admittedly mammals living in Africa, they don’t fit the other 10 points of Alexander’s model terribly well.</br></p><p>Consider the flawed comparison made at the National Center for Science Education:</p><p><em>Occasionally, however, more striking predictions are made. In 1845 John Couch Adams and Urbain Jean Joseph Leverrier both predicted the presence of an unseen planet which affects the orbit of Uranus. It was not until the following year that Neptune was discovered as they had predicted.  Richard D Alexander has made a similarly striking prediction based on first principles of the evolution of social behavior.  Although common in social insects, eusociality—the social system with a queen and sterile workers—was unknown in any other taxa.  Under the appropriate set of conditions, Alexander predicted, evolution ought to produce a eusocial vertebrate, even though eusociality in the naked mole-rat (or any other vertebrate) was unknown at the time.</em></p><p>So, the astrophycists noticed an anomaly, came up with a hypothesis and predicted something that was found.  The evolutionist drew a picture, claimed it was based solely on his TENS-stimulated imagination, then was delighted when he was told it looked just like a photograph of an existing animal.  (Reminds me of the only drawing prize I ever won, but that’s a story for another time.)  This is not the equivalent of Adams’s and Leverrier’s prediction, it is not science by any measure.  Can you imagine how secular scientists would tear into a similar “proof” of anything supernatural?</p><p>And finally, the more Sherman has studied the rats, <a href=\"http://findarticles.com/p/articles/mi_m1511/is_v7/ai_4154372\">the less eusocial they appear to be</a>: <em>At the beginning, investigators thought mole rat colonies might be just like those of termites, which are sometimes described as superorganisms, with individuals serving as the body parts….  “I tend now to believe the mole rat colony isn’t a superorganism,” says Sherman. “There’s conflict of interest; there are individuals still striving for their own reproduction at the expense of others under the surface of this amazing apparent cooperation.”</em></p><p>If these 30-year old predictions are the best and most remarkable that modern biology has to offer in defense of TENS, then the theory is in worse shape than I had previously believed.  I’m sure there must be other successful predictions, however many of the ones I’ve surveyed, such as the behavior of river guppies, was so nebulous as to be obviously meaningless even prior to Dr. Ioannidis   conclusion that “Claimed Research Findings May Often Be Simply Accurate Measures of the Prevailing Bias”.</p><p>This doesn’t mean that TENS is useless, even if it is the artificial selection of which Edward Blyth wrote before Wallace or Darwin that is far more likely to be the primary method of advancing scientific knowledge in the future.  What I think Scott fails to consider is that the history of science suggests that a pretty good model which has some large blanks that require filling in is less likely to hold up in its essentials than it is to be replaced by another very different and more precise model.  I see TENS being somewhat similar to the theory of the celestial spheres, which actually did a very good job of explaining why the planetary orbits look like they do.  But as eventually became clear to those observing the skies, things simply didn’t ultimately work according to that model.  While I shall refrain from engaging in the superficially damning quote-mining that Scott half-expected, I will note that the exceptions he mentions are often the sort of clues that can provide a path towards a future, more accurate model.</p><p>Finally, in light of accusations made by some readers that I am avoiding anything, it is necessary to mention that a number of my questions asked earlier in the debate have not yet been addressed, and more importantly, that at least some of those questions are being asked by biologists today.   They are neither stupid nor irrelevant, although in some cases I doubt that a reasonable answer is possible given the information we currently possess.  For example, my question about the average rate of evolution was scorned by some evolutionists, and yet there are numerous examples of scientists <a href=\"http://links.jstor.org/sici?sici=0027-8424(197512)72%3A12%3C5061%3ASSOMPA%3E2.0.CO%3B2-W\">attempting to estimate</a> precisely that.  How is a skeptic supposed to talk reasonably about the science when its defenders refuse to talk about any part of it that they do not feel favors a defense of their current dogma?  And there’s no question that it is the dogma, not the science, that they are all too often defending; witness how quickly scientists and science-fetishists leap to <a href=\"http://scienceblogs.com/pharyngula/2007/09/racialist_refutations.php#comments\">abandon TENS</a> when they are forced to choose between their evolutionary dogma and their ideological dogma, and how those who are so quick to attack ID advocates are silent when people are hounded from their jobs on the basis of good science that is not politically correct.</p></div>",
  "content_text": "I must apologize to Scott for the lengthy delay, as it took me longer to get caught up on my reading than I’d expected.  He correctly noted that the NFL season started, what he may not realize is that the third game ends at six in the morning my time and it takes a little while for me to adjust to my NFL seasonal schedule; those Monday and Thursday night games just don’t help at all.  In any event, I appreciate his patience.\nIn\nhis last post on the subject\n, Scott correctly pointed out that I had misinterpreted the difference between what Lejeune was saying and what Miller was concluding.  He then, however skeptically, noted a distinction I have been attempting to make for some time now, with admittedly limited success.\nVox admits that he is “in no way opposed to its (TENS) continued refinement and application in the field of biology,” and wants people to know he’s never been opposed to it. Well, Vox, let me say that you’ve got a funny way of showing it. I’ll give you the benefit of the doubt, though, since I’m pretty sure that most of your snide remarks are really at the expense of Dawkins and other committed evolutionists, rather than the actual science.\nIn light of the recent study published in JAMA indicating that only one of 432 published research claims concerning gender and genes could be replicated, I don’t think my skepticism about the current state of science can reasonably be described as either unfounded or unreasonable.  I find it very curious that scientists appear to be so hostile to scrutiny, especially in light of the way in which their method supposedly guarantees reliability.  It tends to suggest that they have something to hide, namely, that they are not in fact making use of proper falsifiable and replicable methodologies.  Moreover, I believe Scott’s tacit admission that much of what Dawkins and other committed evolutionists are doing is not actual science is entirely correct, as is his guess regarding the primary focus of my disdain.  Evolutionary theory is harmless in itself, but when it is abused and treated as unscientific dogma used to justify everything from Marxism and Lebensraum to rational materialism and anti-theism it becomes downright dangerous.\nOf course, the fact that a theory is the only game in town at the moment does not mean that it is, in fact, accurate.  Ptolemy’s geocentric theory was the only game in town for centuries, until Copernicus suggested otherwise.\nVox continues to argue that what he calls ‘backtesting’ casts doubts on the reliability of TENS, with respect to my posts on the chimpanzee chromosome…  Vox, you are just playing word games here rather than addressing the science on its own merits. Back in 1973, LeJeune and other researchers proposed a radical hypothesis (telomeric fusion) to explain the banding patterns they saw. Subsequent analysis of the DNA sequence could’ve provided evidence against this interpretation. The banding patterns which seemed to suggest the fusion of two separate chromosomes could’ve been artifacts of other types of chromosomal change. The sequences, when examined, could’ve failed to line up with homologous sequences in the two chimpanzee chromosomes. The presence of pericentromeric regions within chromosome #2, the signature of an ancestral chromosome’s inactivated centromere, could’ve failed to appear upon closer investigation.\nI was not playing word games, my previous statement about Miller’s conclusion was a combination of accurate reading comprehension with chromosomal ignorance.  Now that I’ve read up on telomeric fusion and read through LeJeune’s abstract as well as a few related studies, I think Scott and Ken Miller’s assertion of the fused chromosome hypothesis does qualify as a valid testable prediction which was subsequently confirmed to be a successful one.  However, I also note that if scientists wish to be understood by anyone but other scientists, they have simply got to stop saying the equivalent of “I predicted the results would be A, the results were X, so therefore my prediction was correct”, ESPECIALLY when trying to explain things to those who can’t possibly be expected to know the jargon.  Now Scott knew X=A, but I certainly didn’t; the fact that few of the science fetishists at Pharyngula knew anything about the state of the chromosome fusion hypothesis only underlines the terrible transmission of the current state of science from the professionals to even those amateurs most interested in it, let alone to skeptics like me who assume at least 95 percent of scientists, like 95 percent of the rest of the human race, are operating primarily on self-serving economic principles.\nNow that I understand X=A in this case, I freely acknowledge that Lejeune’s prediction turned out to be correct; the DNA evidence suggests a telomeric fusing event that explains the variant number of primate chromosomes in a way which is consistent with TENS.  It was an impressive intellectual feat, if a logically necessary one.  But this does not prove the existence of a common ancestor, for which there is still no evidence, it merely means that the proposed origin of human chromosome two is currently supported by the existing evidence and that a common ancestor cannot be ruled out due to the variant number of chromosomes.  But to prove the possibility is not proving the scientific fact.\nIn reading about this successful prediction, I learned that there have been a number of similar predictions, for example, there are hypotheses related to the origins of human chromosomes one, five and seven that are not yet considered to be conclusive.  And when one looks more closely at the evidence, one realizes that far from proving TENS, the Lejeune evidence merely allowed it to dodge a bullet; the fact that no evolutionist appears to have admitted for more than thirty years that barring the successful demonstration of Lejeune’s hypothesis, TENS was highly unlikely to be a valid description of the origin of the human species tends to raise some questions about whether they are more devoted to science or TENS dogma.  In any event, I should very much like to know approximiately how many similar genomic predictions based on TENS have been made since 1973; while one out of four isn’t bad, one out of ten thousand would be downright unimpressive, especially since we were recently informed that the genomic evidence is now in variance with the paleontological evidence by a factor of around 85 percent.\nI’d forgotten entirely about the example of the naked mole rat. I think I’ll dust that one off and post about it if anyone whines I’ve only one example.\nThe second prediction Scott cites, in his comments, is one that is considered to be “one of the most remarkable in modern biology”, that of the naked mole rat.  However, it is not at all supportive of his case.  I would argue that it actually tends to support my skeptical position.  I happen to be familiar with the story from\nThe Selfish Gene\n, and I must point out that in Alexander’s series of lectures, no falsifiable prediction was made, TENS was largely irrelevant to it, TENS as Scott defines it was not involved in any way, and the entire situation described was wholly unscientific except in that scientists were involved.  We are assured, of course, that Alexander had no idea that a mammal fitting his 12-point hypothesis existed, but since the naked mole rat’s existence was already known to zoologists, we cannot simply take his word for it that he did not know all an animal that scientists had been studying for more than a decade.\nIf anecdotal personal testimony is rejected when provided in defense of theology, it cannot possibly be accepted in defense of biology.  And Alexander’s 12-points border on the silly; one need not know anything about TENS to predict that a theoretically unknown bird or mamma\nl would be a rodent living underground – people tend to notice large predators and flying creatures, after all – and reading his 12-points, it appears that he simply described the closest thing to a termite that wasn’t an insect; the JSTOR paper on it is even titled “The Naked Mole Rat: A Mammalian Termite?”.  Moreover, his “prediction” was specifically anti-genetic, while some scientists who work with Alexander, such as Paul Sherman, who researchs mole rats at Cornell, even claim that eusociality occurs in other birds and mammals, such as lions.  And while lions are admittedly mammals living in Africa, they don’t fit the other 10 points of Alexander’s model terribly well.\nConsider the flawed comparison made at the National Center for Science Education:\nOccasionally, however, more striking predictions are made. In 1845 John Couch Adams and Urbain Jean Joseph Leverrier both predicted the presence of an unseen planet which affects the orbit of Uranus. It was not until the following year that Neptune was discovered as they had predicted.  Richard D Alexander has made a similarly striking prediction based on first principles of the evolution of social behavior.  Although common in social insects, eusociality—the social system with a queen and sterile workers—was unknown in any other taxa.  Under the appropriate set of conditions, Alexander predicted, evolution ought to produce a eusocial vertebrate, even though eusociality in the naked mole-rat (or any other vertebrate) was unknown at the time.\nSo, the astrophycists noticed an anomaly, came up with a hypothesis and predicted something that was found.  The evolutionist drew a picture, claimed it was based solely on his TENS-stimulated imagination, then was delighted when he was told it looked just like a photograph of an existing animal.  (Reminds me of the only drawing prize I ever won, but that’s a story for another time.)  This is not the equivalent of Adams’s and Leverrier’s prediction, it is not science by any measure.  Can you imagine how secular scientists would tear into a similar “proof” of anything supernatural?\nAnd finally, the more Sherman has studied the rats,\nthe less eusocial they appear to be\n:\nAt the beginning, investigators thought mole rat colonies might be just like those of termites, which are sometimes described as superorganisms, with individuals serving as the body parts….  “I tend now to believe the mole rat colony isn’t a superorganism,” says Sherman. “There’s conflict of interest; there are individuals still striving for their own reproduction at the expense of others under the surface of this amazing apparent cooperation.”\nIf these 30-year old predictions are the best and most remarkable that modern biology has to offer in defense of TENS, then the theory is in worse shape than I had previously believed.  I’m sure there must be other successful predictions, however many of the ones I’ve surveyed, such as the behavior of river guppies, was so nebulous as to be obviously meaningless even prior to Dr. Ioannidis   conclusion that “Claimed Research Findings May Often Be Simply Accurate Measures of the Prevailing Bias”.\nThis doesn’t mean that TENS is useless, even if it is the artificial selection of which Edward Blyth wrote before Wallace or Darwin that is far more likely to be the primary method of advancing scientific knowledge in the future.  What I think Scott fails to consider is that the history of science suggests that a pretty good model which has some large blanks that require filling in is less likely to hold up in its essentials than it is to be replaced by another very different and more precise model.  I see TENS being somewhat similar to the theory of the celestial spheres, which actually did a very good job of explaining why the planetary orbits look like they do.  But as eventually became clear to those observing the skies, things simply didn’t ultimately work according to that model.  While I shall refrain from engaging in the superficially damning quote-mining that Scott half-expected, I will note that the exceptions he mentions are often the sort of clues that can provide a path towards a future, more accurate model.\nFinally, in light of accusations made by some readers that I am avoiding anything, it is necessary to mention that a number of my questions asked earlier in the debate have not yet been addressed, and more importantly, that at least some of those questions are being asked by biologists today.   They are neither stupid nor irrelevant, although in some cases I doubt that a reasonable answer is possible given the information we currently possess.  For example, my question about the average rate of evolution was scorned by some evolutionists, and yet there are numerous examples of scientists\nattempting to estimate\nprecisely that.  How is a skeptic supposed to talk reasonably about the science when its defenders refuse to talk about any part of it that they do not feel favors a defense of their current dogma?  And there’s no question that it is the dogma, not the science, that they are all too often defending; witness how quickly scientists and science-fetishists leap to\nabandon TENS\nwhen they are forced to choose between their evolutionary dogma and their ideological dogma, and how those who are so quick to attack ID advocates are silent when people are hounded from their jobs on the basis of good science that is not politically correct.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-18T10:41:00+00:00"
}