{
  "url": "https://voxday.net/2007/09/09/fukuyamas-flea/",
  "scraped_at": "2026-01-08T21:53:35.556627",
  "title": "Fukuyama’s “flea”",
  "date_display": "September 9, 2007",
  "date_iso": "2007-09-09T16:10:00+00:00",
  "date_from_url": "2007-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins is such an incorrigible ass.  He complains that critical books that have either covers or titles which are similar to the books they are criticizing are somehow committing “plagiarism”.  This is absurd, since it is impossible to copyright either book titles or cover layouts, one could publish a book entitled <em>The God Delusion</em> and it would still not be plagiarism so long as one did not copy the actual text from Dawkins’s book.  And so again we witness Dawkins demonstrate his total incompetence outside of his particular field of <s>science propaganda</s>evolutionary biology.</p><p>The thing I find amusing about the whole flea thing isn’t that Dawkins and company could be described as God’s fleas, but rather that <em>The End of Faith</em> is clearly a take-off on Fukuyama’s post-Marxian 1989 essay <em>The End of History</em>.  It’s not even the first such take-off, as John Horgan published <em>The End of Science</em> in 1998.</p><p>I didn’t consider calling TIA <em>The End of Atheism</em> for a second, because such books are not meant to be taken in a literal manner.  In his essay, which was expanded into a book in 1992, Fukuyama was not referring to history per se, but rather the end of a Marxist ideological concept, specifically, the idea of inevitable progress towards a Communist workers’ paradise.  In like manner, <em>The End of Science</em> doesn’t refer to a literal end of science, but rather addresses the possibility that there are no big fundamental concepts left for science to discover.  That’s why it’s so funny that Harris blithely titled his book in a manner that suggests a failure to understand the books whose titles he is “plagiarizing”, given that he is advocating a literal end to faith in <em>The End of Faith</em>.</p></div>",
  "content_text": "Richard Dawkins is such an incorrigible ass.  He complains that critical books that have either covers or titles which are similar to the books they are criticizing are somehow committing “plagiarism”.  This is absurd, since it is impossible to copyright either book titles or cover layouts, one could publish a book entitled\nThe God Delusion\nand it would still not be plagiarism so long as one did not copy the actual text from Dawkins’s book.  And so again we witness Dawkins demonstrate his total incompetence outside of his particular field of\nscience propaganda\nevolutionary biology.\nThe thing I find amusing about the whole flea thing isn’t that Dawkins and company could be described as God’s fleas, but rather that\nThe End of Faith\nis clearly a take-off on Fukuyama’s post-Marxian 1989 essay\nThe End of History\n.  It’s not even the first such take-off, as John Horgan published\nThe End of Science\nin 1998.\nI didn’t consider calling TIA\nThe End of Atheism\nfor a second, because such books are not meant to be taken in a literal manner.  In his essay, which was expanded into a book in 1992, Fukuyama was not referring to history per se, but rather the end of a Marxist ideological concept, specifically, the idea of inevitable progress towards a Communist workers’ paradise.  In like manner,\nThe End of Science\ndoesn’t refer to a literal end of science, but rather addresses the possibility that there are no big fundamental concepts left for science to discover.  That’s why it’s so funny that Harris blithely titled his book in a manner that suggests a failure to understand the books whose titles he is “plagiarizing”, given that he is advocating a literal end to faith in\nThe End of Faith\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-09T15:10:00+00:00"
}