{
  "url": "https://voxday.net/2007/09/08/he-hasnt-seen-half-of-i/",
  "scraped_at": "2026-01-08T21:53:32.265602",
  "title": "He hasn’t seen the half of it",
  "date_display": "September 8, 2007",
  "date_iso": "2007-09-08T23:08:00+00:00",
  "date_from_url": "2007-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins notices that <a href=\"http://richarddawkins.net/article,1617,The-Fleas-Are-Multiplying,RichardDawkinsnet\">the so-called fleas are multiplying</a>.  This is true and will continue, but what Dawkins doesn’t realize is that they are also evolving; the assumptions expressed in the comment thread notwithstanding, there is likely very little in common between Alistair McGrath’s arguments and mine.  I rather doubt his publisher ever had a conversation with him that began with “You really can’t start a chapter title with the word ‘Bitches’.”</p><blockquote><p>I’ve made some ‘orbit’ images of the fleas to highlight some of the name and cover plagiarism.</p></blockquote><p>I argued against the cover parody myself, (how typical that a whiner like Dawkins would call it “plagiarism”), but publishers will be publishers, and I have to admit, while my idea of a cartoon of fish-squirrels gang-sodomizing a shrieking Dr. Dawkins was hilarious, I suppose it might have been considered a bit vulgar for what is supposed to be an intellectual rebuttal.  (Needless to say, my arguments are probably just a little less theologically inclined than everyone else’s.)  I say that a bitch-slapping isn’t any less of a bitch-slapping because you’re wearing white gloves, but obviously the publisher disagrees.</p><p>Of course, I anticipated Dawkins’s flea theme in TIA.  The guy isn’t stupid, but he’s far from brilliant and is almost boringly predictable; most of his arguments were made previously by Meslier and Russell except, of course, for that burning logical train wreck he insists on calling the Ultimate 747.  Unfortunately, my publisher also insisted on repressing some of my poetical inspirations, which is why <a href=\"http://www.milobookclub.com/2007/08/10/that-was-easy-ca/\">A Dog Named Flea</a> does not appear in the book.</p><p>But fans of scientific poetry will be glad to know that at least one poem inspired by the Archbishop of Oxford did make it into the final text, albeit in slightly edited form.</p><p>UPDATE – I will be very surprised if this guy means what he says:</p><blockquote><p>I’m still wating for a ‘flea’ to tackle any one of Dawkins’ clear and straightforward arguments head on – I mean with real intellectual honesty and logical rigour. It just never happens.</p></blockquote><p>In the one chapter dedicated to dissecting Dawkins – which is almost as easy as demonstrating the multiple factual and logical errors made by Sam Harris with tedious regularity – I go step-by-step through what Dawkins himself describes as the central argument of <em>The God Delusion</em>.  What’s amusing isn’t so much the four factual and logical errors he makes in the first five steps, although they are pretty bad, but rather, the fact that what ends up passing for the conclusion of this “irrefutable” argument is, by his own admission, in no way based on the steps leading up to it.</p><p>To describe Dawkins’s arguments as clear and straightforward – or even coherent – is proof of one’s own intellectual incompetence.  Dawkins is dependent upon his critics arguing theology, because any highly intelligent individual with a working knowledge of logic and history can demolish his arguments without breaking a sweat.</p><p>Not only have I done so in TIA, but I am certain that every other non-theologically focused Dawkins critic will as well because the great atheist icon’s factual and logical errors are so glaringly apparent.</p></div>",
  "content_text": "Richard Dawkins notices that\nthe so-called fleas are multiplying\n.  This is true and will continue, but what Dawkins doesn’t realize is that they are also evolving; the assumptions expressed in the comment thread notwithstanding, there is likely very little in common between Alistair McGrath’s arguments and mine.  I rather doubt his publisher ever had a conversation with him that began with “You really can’t start a chapter title with the word ‘Bitches’.”\nI’ve made some ‘orbit’ images of the fleas to highlight some of the name and cover plagiarism.\nI argued against the cover parody myself, (how typical that a whiner like Dawkins would call it “plagiarism”), but publishers will be publishers, and I have to admit, while my idea of a cartoon of fish-squirrels gang-sodomizing a shrieking Dr. Dawkins was hilarious, I suppose it might have been considered a bit vulgar for what is supposed to be an intellectual rebuttal.  (Needless to say, my arguments are probably just a little less theologically inclined than everyone else’s.)  I say that a bitch-slapping isn’t any less of a bitch-slapping because you’re wearing white gloves, but obviously the publisher disagrees.\nOf course, I anticipated Dawkins’s flea theme in TIA.  The guy isn’t stupid, but he’s far from brilliant and is almost boringly predictable; most of his arguments were made previously by Meslier and Russell except, of course, for that burning logical train wreck he insists on calling the Ultimate 747.  Unfortunately, my publisher also insisted on repressing some of my poetical inspirations, which is why\nA Dog Named Flea\ndoes not appear in the book.\nBut fans of scientific poetry will be glad to know that at least one poem inspired by the Archbishop of Oxford did make it into the final text, albeit in slightly edited form.\nUPDATE – I will be very surprised if this guy means what he says:\nI’m still wating for a ‘flea’ to tackle any one of Dawkins’ clear and straightforward arguments head on – I mean with real intellectual honesty and logical rigour. It just never happens.\nIn the one chapter dedicated to dissecting Dawkins – which is almost as easy as demonstrating the multiple factual and logical errors made by Sam Harris with tedious regularity – I go step-by-step through what Dawkins himself describes as the central argument of\nThe God Delusion\n.  What’s amusing isn’t so much the four factual and logical errors he makes in the first five steps, although they are pretty bad, but rather, the fact that what ends up passing for the conclusion of this “irrefutable” argument is, by his own admission, in no way based on the steps leading up to it.\nTo describe Dawkins’s arguments as clear and straightforward – or even coherent – is proof of one’s own intellectual incompetence.  Dawkins is dependent upon his critics arguing theology, because any highly intelligent individual with a working knowledge of logic and history can demolish his arguments without breaking a sweat.\nNot only have I done so in TIA, but I am certain that every other non-theologically focused Dawkins critic will as well because the great atheist icon’s factual and logical errors are so glaringly apparent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-08T22:08:00+00:00"
}