{
  "url": "https://voxday.net/2007/09/24/heres-your-chance/",
  "scraped_at": "2026-01-08T21:55:02.156724",
  "title": "Here’s your chance",
  "date_display": "September 24, 2007",
  "date_iso": "2007-09-24T11:05:00+00:00",
  "date_from_url": "2007-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To explain to Scott why his response to <a href=\"http://monkeytrials.blogspot.com/2007/09/vox-dei-bate-11-lets-talk-about-science.html\">my last post</a> was inadequate regarding the points it addressed, if you felt that way.  I recommend precise articulation, preferably with examples:</p><blockquote><p>In <a href=\"http://monkeytrials.blogspot.com/2007/09/vox-dei-bate-13-justifying-intuition.html\">my previous post</a>, I waxed at length about why I felt that Vox’s impression of how the scientific community actually operates missed the boat. A lot of his sympathetic readership felt my post missed the boat, and felt it was largely bloviated excuse-making. To those folk, I would say this: if you think the distinctions I raised in that post are irrelevant, I invite you to explain why you feel that way here.</p></blockquote><p>Have at it, if you are so inclined.  I note that Scott has a potential defense which I don’t think he has yet realized, but more on that later.  In any event, in light of Scott’s recent confession that he is a Barry Bonds admirer, I encourage you to treat him with all the kindness and gentle understanding due the clinically insane.</p></div>",
  "content_text": "To explain to Scott why his response to\nmy last post\nwas inadequate regarding the points it addressed, if you felt that way.  I recommend precise articulation, preferably with examples:\nIn\nmy previous post\n, I waxed at length about why I felt that Vox’s impression of how the scientific community actually operates missed the boat. A lot of his sympathetic readership felt my post missed the boat, and felt it was largely bloviated excuse-making. To those folk, I would say this: if you think the distinctions I raised in that post are irrelevant, I invite you to explain why you feel that way here.\nHave at it, if you are so inclined.  I note that Scott has a potential defense which I don’t think he has yet realized, but more on that later.  In any event, in light of Scott’s recent confession that he is a Barry Bonds admirer, I encourage you to treat him with all the kindness and gentle understanding due the clinically insane.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-24T10:05:00+00:00"
}