{
  "url": "https://voxday.net/2007/09/08/how-i-loathe-hollywood/",
  "scraped_at": "2026-01-08T21:53:28.879586",
  "title": "How I loathe Hollywood",
  "date_display": "September 8, 2007",
  "date_iso": "2007-09-08T16:42:00+00:00",
  "date_from_url": "2007-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Dark is Rising</em> apparently is not famous enough to be spared the full Hollywood treatment:</p><blockquote><p>A joke among the journalists covering The Dark Is Rising set visit in Bucharest over the last couple of days was that the movie has only changed three things from the Newberry-winning novel on which it’s based: they’ve changed the lead kid’s nationality from English to American, they’ve changed the lead kid’s age from 11 to 14, and <a href=\"http://www.chud.com/index.php?type=news&amp;id=10283\">they’ve changed everything</a> that happens in the story.</p></blockquote><p>In case you haven’t figured out why I have turned down every request to option the EW novels for film – and there have been several – this sort of nonsense is why I’m just not interested.  Now, I have been sketching a thriller called <em>Second Revelations</em>, which is the action-packed sort of thing that can’t be ruined because there’s nothing particularly unique there to ruin.</p><p>I’ve always wondered why Satan’s servants would bother to fight for him, unless they believe he can win.  And if they believe that, then they would have to have their own set of prophecies and so forth, as well as their own spin on the events of the New Testament.  Hence, <em>The Revelation of St. Iscariot the Damned</em>.  It starts off with a bang; a Vatican strike force wiping out an Alpine nunnery with only one nun saved by an agent of a secret order of rogue Benedictines.</p></div>",
  "content_text": "The Dark is Rising\napparently is not famous enough to be spared the full Hollywood treatment:\nA joke among the journalists covering The Dark Is Rising set visit in Bucharest over the last couple of days was that the movie has only changed three things from the Newberry-winning novel on which it’s based: they’ve changed the lead kid’s nationality from English to American, they’ve changed the lead kid’s age from 11 to 14, and\nthey’ve changed everything\nthat happens in the story.\nIn case you haven’t figured out why I have turned down every request to option the EW novels for film – and there have been several – this sort of nonsense is why I’m just not interested.  Now, I have been sketching a thriller called\nSecond Revelations\n, which is the action-packed sort of thing that can’t be ruined because there’s nothing particularly unique there to ruin.\nI’ve always wondered why Satan’s servants would bother to fight for him, unless they believe he can win.  And if they believe that, then they would have to have their own set of prophecies and so forth, as well as their own spin on the events of the New Testament.  Hence,\nThe Revelation of St. Iscariot the Damned\n.  It starts off with a bang; a Vatican strike force wiping out an Alpine nunnery with only one nun saved by an agent of a secret order of rogue Benedictines.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-08T15:42:00+00:00"
}