{
  "url": "https://voxday.net/2007/09/02/it-has-begun-vii/",
  "scraped_at": "2026-01-08T21:53:01.742900",
  "title": "It has begun VII",
  "date_display": "September 2, 2007",
  "date_iso": "2007-09-02T08:21:00+00:00",
  "date_from_url": "2007-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we’re starting to wear down here.  Needless to say, I remain utterly unconvinced of the long-term viability of TENS; while I’ve learned a lot about it, I’m more underwhelmed with it than I was when we started.  Still, I’m not disappointed, as Scott and I seem to have reached somewhat of an accord regarding the distinct division between the reasonable scientific application of TENS and its unreasonable non-scientific implications.  Regarding the science component, however, Scott still does not appear to grasp the basic concept that post-facto “predictions” cannot reasonably be described as genuine testable predictions. <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-dei-bate-10-no-back-testing-here.html\">His most recent post</a> underlines this.</p><blockquote><p>To the best of my knowledge, the first suggestion that human chromosome #2 might’ve been produced by the fusion of two chromosomes which exist separately in chimps was made in a paper “Comparaison de la structure fine des chromatides d’Homo sapiens et de Pan troglodytes” by LeJeune, Dutrrilaux, Rethore and Prieur which appeared in 1973. I don’t have the original, but the abstract for that paper can be seen here.*</p></blockquote><p>Now, look at this wording: “the first SUGGESTION that… MIGHT’VE BEEN PRODUCED” is not at all equivalent to the “testable prediction” he cites as proof, which was that “the common ancestor had 48 chromosomes (24 pairs) and humans carry a fused chromosome; or ancestor had 23 pairs and apes carry a split chromosome.”</p><p>Later, when he talks about the “original speculative hypothesis” he explains that it “predicted that telomeric signatures would be identified.”  However, this is still not the “testable prediction” that was claimed after the fact.  It’s entirely possible that the “testable prediction” was made prior to the tests, but we still haven’t seen proof of it.</p><p>Until evolutionists stop collecting data and then making post-facto “predictions” that magically happen to fit the data they just collected, I see no reason to take them seriously or pay their models any attention at all, let alone “believe” in their conclusions.  It’s intellectually shady, in my opinion, and reminds me of financial touts who claim correctly calling 10 past winners while conveniently neglecting to mention the 30 losers they advocated with equal enthusiasm.</p><p>What’s especially amusing is how often their post-facto predictions turn out to be wrong despite having been made after collecting the data.  I mean, even the hopelessly inaccurate Keynesians usually don’t have to correct themselves more than once after the fact.  (If you don’t grasp my margin of error argument, which applies equally to macroeconomics and macroevolution, compare the Federal Reserve’s initial estimate of GDP growth for a quarter, the updated estimate, the reported number, and the subsequent revision sometime.  It’s not unheard of for the margin of error to be more than 100 percent.)</p><p><em>Ten million-year-old fossils discovered in Ethiopia show that humans and apes probably split <a href=\"http://www.breitbart.com/article.php?id=070824121653.65mgd37f&amp;show_article=1\">six or seven million years earlier than widely thought</a>, according to landmark study released Wednesday….   But the new fossils, dubbed “Chororapithecus abyssinicus” by the team of Japanese and Ethiopian paleoanthropologists who found them, place the early ancestors of the modern day gorilla 10 to 10.5 million years in the past, suggesting that the human-ape split occurred before that….  Conventional scientific wisdom, based on genetic “distances” measured by molecular geneticists, had placed the divergence between chimps and humans some five to six million years ago.</em></p><p>Even with a massive time scale and allowing for a variance of 500 to 1,000 millenia, that’s a huge error of around 87.5 percent.  Aside from demonstrating the very crude nature of the “science”, it leads to the obvious question:  If we assume that TENS is a reasonable model for historical detection, and scientists don’t seem to have anything better at this point, which is incorrect, archeological TENS or genetic TENS?  And what accounts for the discrepancies?</p><p>Once scientists have got the historical record straight, perhaps they can begin attempting to actually test genuine predictions instead of attempting to substitute “it doesn’t rule it out” for “predicts.”  In the meantime, it is as absurd for them to waste their time bashing evolutionary skeptics as it is for economists to get their panties in a bunch about Keynesian skeptics.  The frantic hand-waving only creates more doubts than it resolves.  Occam’s Razor strongly suggests that if a conceptual model is unconvincing, it’s simply because the model is insufficiently reliable to generate confidence in it.</p></div>",
  "content_text": "I think we’re starting to wear down here.  Needless to say, I remain utterly unconvinced of the long-term viability of TENS; while I’ve learned a lot about it, I’m more underwhelmed with it than I was when we started.  Still, I’m not disappointed, as Scott and I seem to have reached somewhat of an accord regarding the distinct division between the reasonable scientific application of TENS and its unreasonable non-scientific implications.  Regarding the science component, however, Scott still does not appear to grasp the basic concept that post-facto “predictions” cannot reasonably be described as genuine testable predictions.\nHis most recent post\nunderlines this.\nTo the best of my knowledge, the first suggestion that human chromosome #2 might’ve been produced by the fusion of two chromosomes which exist separately in chimps was made in a paper “Comparaison de la structure fine des chromatides d’Homo sapiens et de Pan troglodytes” by LeJeune, Dutrrilaux, Rethore and Prieur which appeared in 1973. I don’t have the original, but the abstract for that paper can be seen here.*\nNow, look at this wording: “the first SUGGESTION that… MIGHT’VE BEEN PRODUCED” is not at all equivalent to the “testable prediction” he cites as proof, which was that “the common ancestor had 48 chromosomes (24 pairs) and humans carry a fused chromosome; or ancestor had 23 pairs and apes carry a split chromosome.”\nLater, when he talks about the “original speculative hypothesis” he explains that it “predicted that telomeric signatures would be identified.”  However, this is still not the “testable prediction” that was claimed after the fact.  It’s entirely possible that the “testable prediction” was made prior to the tests, but we still haven’t seen proof of it.\nUntil evolutionists stop collecting data and then making post-facto “predictions” that magically happen to fit the data they just collected, I see no reason to take them seriously or pay their models any attention at all, let alone “believe” in their conclusions.  It’s intellectually shady, in my opinion, and reminds me of financial touts who claim correctly calling 10 past winners while conveniently neglecting to mention the 30 losers they advocated with equal enthusiasm.\nWhat’s especially amusing is how often their post-facto predictions turn out to be wrong despite having been made after collecting the data.  I mean, even the hopelessly inaccurate Keynesians usually don’t have to correct themselves more than once after the fact.  (If you don’t grasp my margin of error argument, which applies equally to macroeconomics and macroevolution, compare the Federal Reserve’s initial estimate of GDP growth for a quarter, the updated estimate, the reported number, and the subsequent revision sometime.  It’s not unheard of for the margin of error to be more than 100 percent.)\nTen million-year-old fossils discovered in Ethiopia show that humans and apes probably split\nsix or seven million years earlier than widely thought\n, according to landmark study released Wednesday….   But the new fossils, dubbed “Chororapithecus abyssinicus” by the team of Japanese and Ethiopian paleoanthropologists who found them, place the early ancestors of the modern day gorilla 10 to 10.5 million years in the past, suggesting that the human-ape split occurred before that….  Conventional scientific wisdom, based on genetic “distances” measured by molecular geneticists, had placed the divergence between chimps and humans some five to six million years ago.\nEven with a massive time scale and allowing for a variance of 500 to 1,000 millenia, that’s a huge error of around 87.5 percent.  Aside from demonstrating the very crude nature of the “science”, it leads to the obvious question:  If we assume that TENS is a reasonable model for historical detection, and scientists don’t seem to have anything better at this point, which is incorrect, archeological TENS or genetic TENS?  And what accounts for the discrepancies?\nOnce scientists have got the historical record straight, perhaps they can begin attempting to actually test genuine predictions instead of attempting to substitute “it doesn’t rule it out” for “predicts.”  In the meantime, it is as absurd for them to waste their time bashing evolutionary skeptics as it is for economists to get their panties in a bunch about Keynesian skeptics.  The frantic hand-waving only creates more doubts than it resolves.  Occam’s Razor strongly suggests that if a conceptual model is unconvincing, it’s simply because the model is insufficiently reliable to generate confidence in it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-02T07:21:00+00:00"
}