{
  "url": "https://voxday.net/2007/09/12/left-always-relies-on-force/",
  "scraped_at": "2026-01-08T21:53:52.653930",
  "title": "The left always relies on force",
  "date_display": "September 12, 2007",
  "date_iso": "2007-09-12T15:54:00+00:00",
  "date_from_url": "2007-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And sooner or later, they usually end up deciding that it’s necessary to kill large quantities of people.</p><blockquote><p>Jill reads this article by Daniel Engber that suggests that Americans—who are the most massive per capita polluters on the planet, mind you—cut back on our births to one or none to save the planet. She dismisses the idea on the theory that there lies the path to coercion. I’m going to disagree. First of all, dismissing coercion out of hand in a situation as dire as ours concerns me. Not that one should conclude that coercion is the best bet, but desperate times <a href=\"http://pandagon.blogsome.com/2007/09/12/6035/#comments\">should at least allow for the consideration of desperate measures</a>.</p></blockquote><p>Betrand Russell, Adolf Hitler, Sam Harris, Vladimir Lenin, Hillary Clinton, Saloth Sar, Amynda… what do they all have in common?  A deep-rooted belief in coercion as the fundamental right and responsibility of government.  There is no such thing as a “right-wing” fascist, as I have pointed out for years, the political spectrum properly runs from totalitarian to libertarian.</p><p>Of course, like all leftists, Amynda is only interested in furthering her program, not in the most effective way to achieve the desired results.  Simply sterilizing 50 percent of the female population at birth – preferably the feminists and ugly ones, if that’s not redundant – would work much better than a one-child policy; if the straits are so dire, why isn’t she calling for that?  It’s certainly more practical and efficient than the Chinese Communist measure she’s defending.</p></div>",
  "content_text": "And sooner or later, they usually end up deciding that it’s necessary to kill large quantities of people.\nJill reads this article by Daniel Engber that suggests that Americans—who are the most massive per capita polluters on the planet, mind you—cut back on our births to one or none to save the planet. She dismisses the idea on the theory that there lies the path to coercion. I’m going to disagree. First of all, dismissing coercion out of hand in a situation as dire as ours concerns me. Not that one should conclude that coercion is the best bet, but desperate times\nshould at least allow for the consideration of desperate measures\n.\nBetrand Russell, Adolf Hitler, Sam Harris, Vladimir Lenin, Hillary Clinton, Saloth Sar, Amynda… what do they all have in common?  A deep-rooted belief in coercion as the fundamental right and responsibility of government.  There is no such thing as a “right-wing” fascist, as I have pointed out for years, the political spectrum properly runs from totalitarian to libertarian.\nOf course, like all leftists, Amynda is only interested in furthering her program, not in the most effective way to achieve the desired results.  Simply sterilizing 50 percent of the female population at birth – preferably the feminists and ugly ones, if that’s not redundant – would work much better than a one-child policy; if the straits are so dire, why isn’t she calling for that?  It’s certainly more practical and efficient than the Chinese Communist measure she’s defending.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-12T14:54:00+00:00"
}