{
  "url": "https://voxday.net/2007/09/13/mailvox-asking-about-iraq/",
  "scraped_at": "2026-01-08T21:53:57.387218",
  "title": "Mailvox: asking about Iraq",
  "date_display": "September 13, 2007",
  "date_iso": "2007-09-13T14:57:00+00:00",
  "date_from_url": "2007-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DH wants to know what will happen when we go home:</p><blockquote><p>I read your blog fairly regularly, and appreciate most of the points made there.  I’m asking the following question in good faith, and not as a “gotcha”, because I don’t think this is a “gotcha” question at all, in fact.</p><p>[Background: I like Ron Paul a lot, but there is this issue nagging me]</p><p>From Ron Paul’s website: <em>“We can continue to fund and fight no-win police actions around the globe, or we can refocus on securing America and bring the troops home.”</em></p><p>I read that as if he is elected president, he is likely to start an immediate withdrawal from Iraq, and as far as I could tell,<br>that is the position you advocate as well.  My question is, what aftermath do you expect from such an action, and also how<br>do you plan to deal with that aftermath that you anticipate?</br></br></p></blockquote><p>I expect the aftermath will be a bloody free-for-all as the Sunnis, backed by Saudi Arabia, fight the Iran-backed Shiites for control of the Iraqi oil that isn’t in the hands of the Kurds in the north.  That should keep the jihad busy for at least 3-5 years; our only task will be to prevent the White House and the Congress from granting entry visas to Iraqis who want to escape the warfare and emigrate to the USA.</p><p>Iraqi civil war not only isn’t a problem, it is eminently desirable from a Western point of view.  Stirring up civil wars outside its borders is one of the best ways for an empire to ensure that it is left alone.  There’s no chance the “terrorists” are going to “follow us home” when they’ve got the chance to grab a good chunk of an oil rich country.</p><p>There are no good guys over there, that’s always been the fundamental flaw in the Bush strategery.  In fact, the only significant problem is the possibility of the Kurds and the Turks getting into a shooting war once the Kurds stop pretending that they haven’t already established their own country in what used to be northern Iraq.  But we will likely face that problem anyhow, whether we leave or not, and at least if we leave, that will reduce the likelihood of our troops getting involved in a military conflict against one of our allies.</p><p>We are going to be retreating from the Middle East sooner or later, the only question is if we’re going to do it before we lose thousands of our men, or after.  One does not “support the troops” by putting them in an untenable strategic position that bears an increasing probability of getting a significant percentage of them killed.  If you think the geopolitical ramifications of a retreat now are bad, consider how bad they will be if we cannot successfully extricate them.</p></div>",
  "content_text": "DH wants to know what will happen when we go home:\nI read your blog fairly regularly, and appreciate most of the points made there.  I’m asking the following question in good faith, and not as a “gotcha”, because I don’t think this is a “gotcha” question at all, in fact.\n[Background: I like Ron Paul a lot, but there is this issue nagging me]\nFrom Ron Paul’s website:\n“We can continue to fund and fight no-win police actions around the globe, or we can refocus on securing America and bring the troops home.”\nI read that as if he is elected president, he is likely to start an immediate withdrawal from Iraq, and as far as I could tell,\nthat is the position you advocate as well.  My question is, what aftermath do you expect from such an action, and also how\ndo you plan to deal with that aftermath that you anticipate?\nI expect the aftermath will be a bloody free-for-all as the Sunnis, backed by Saudi Arabia, fight the Iran-backed Shiites for control of the Iraqi oil that isn’t in the hands of the Kurds in the north.  That should keep the jihad busy for at least 3-5 years; our only task will be to prevent the White House and the Congress from granting entry visas to Iraqis who want to escape the warfare and emigrate to the USA.\nIraqi civil war not only isn’t a problem, it is eminently desirable from a Western point of view.  Stirring up civil wars outside its borders is one of the best ways for an empire to ensure that it is left alone.  There’s no chance the “terrorists” are going to “follow us home” when they’ve got the chance to grab a good chunk of an oil rich country.\nThere are no good guys over there, that’s always been the fundamental flaw in the Bush strategery.  In fact, the only significant problem is the possibility of the Kurds and the Turks getting into a shooting war once the Kurds stop pretending that they haven’t already established their own country in what used to be northern Iraq.  But we will likely face that problem anyhow, whether we leave or not, and at least if we leave, that will reduce the likelihood of our troops getting involved in a military conflict against one of our allies.\nWe are going to be retreating from the Middle East sooner or later, the only question is if we’re going to do it before we lose thousands of our men, or after.  One does not “support the troops” by putting them in an untenable strategic position that bears an increasing probability of getting a significant percentage of them killed.  If you think the geopolitical ramifications of a retreat now are bad, consider how bad they will be if we cannot successfully extricate them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-13T13:57:00+00:00"
}