{
  "url": "https://voxday.net/2007/09/26/myth-of-democracy/",
  "scraped_at": "2026-01-08T21:55:10.255541",
  "title": "The myth of democracy",
  "date_display": "September 26, 2007",
  "date_iso": "2007-09-26T09:01:00+00:00",
  "date_from_url": "2007-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even some in the mainstream media are <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/daniel_finkelstein/article2532612.ece\">beginning to figure it out</a>:</p><blockquote><p>Politicians often wonder why people don’t vote. This is the wrong question. The real puzzler is why on earth anybody bothers voting at all. If you multiply the chance of influencing the outcome by the difference that a change of government might make to your life, you might calculate that the benefit to you is not enough to risk, say, that on the way to vote a caravan full of violins falls on your head, having been pushed off a third-floor council house balcony by a drunk dentist.</p></blockquote><p>This is why the low probability that the rare liberty-friendly candidate like Ron Paul will win doesn’t trouble me at all.  I don’t believe there is a soft landing for the USA, in my opinion the experiment is already dead, it simply hasn’t stopped twitching yet.  But supporting Paul does no harm, it’s like giving a stopped heart one last jolt of electricity and every now and then the low probability chance comes through.</p><p>But it’s been clear that the fix was in for years, as President Bush’s consultations with his anointed successor, Hillary Clinton, tend to demonstrate.  Consider the following report, which shows how Fox News is attempting to <a href=\"http://www.usaelectionpolls.com/2008/articles/ron-paul-silenced-by-fox-news.html\">keep Paul’s candidacy out of the media</a>, not to benefit Giuliani and the other Republican candidates who cannot win in 2008, but rather Hillary Clinton, who Rupert Murdoch is supporting.</p><p>My recommendation is to support Ron Paul until he can go no farther, then withdraw from the process.  Inasmuch as your vote matters, it’s worth noting that voting for the lesser evil is still supporting evil evil; in this case, voting for the current Republican party is voting for treason, foreign aggression and the conversion of America into a third world dependent nation.</p></div>",
  "content_text": "Even some in the mainstream media are\nbeginning to figure it out\n:\nPoliticians often wonder why people don’t vote. This is the wrong question. The real puzzler is why on earth anybody bothers voting at all. If you multiply the chance of influencing the outcome by the difference that a change of government might make to your life, you might calculate that the benefit to you is not enough to risk, say, that on the way to vote a caravan full of violins falls on your head, having been pushed off a third-floor council house balcony by a drunk dentist.\nThis is why the low probability that the rare liberty-friendly candidate like Ron Paul will win doesn’t trouble me at all.  I don’t believe there is a soft landing for the USA, in my opinion the experiment is already dead, it simply hasn’t stopped twitching yet.  But supporting Paul does no harm, it’s like giving a stopped heart one last jolt of electricity and every now and then the low probability chance comes through.\nBut it’s been clear that the fix was in for years, as President Bush’s consultations with his anointed successor, Hillary Clinton, tend to demonstrate.  Consider the following report, which shows how Fox News is attempting to\nkeep Paul’s candidacy out of the media\n, not to benefit Giuliani and the other Republican candidates who cannot win in 2008, but rather Hillary Clinton, who Rupert Murdoch is supporting.\nMy recommendation is to support Ron Paul until he can go no farther, then withdraw from the process.  Inasmuch as your vote matters, it’s worth noting that voting for the lesser evil is still supporting evil evil; in this case, voting for the current Republican party is voting for treason, foreign aggression and the conversion of America into a third world dependent nation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-26T08:01:00+00:00"
}