{
  "url": "https://voxday.net/2007/09/21/of-brussels-and-jena/",
  "scraped_at": "2026-01-08T21:54:39.987276",
  "title": "Of Brussels and Jena",
  "date_display": "September 21, 2007",
  "date_iso": "2007-09-21T10:25:00+00:00",
  "date_from_url": "2007-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A <a href=\"http://www.cwnews.com/news/viewstory.cfm?recnum=53465\">tale of two cities</a>:</p><blockquote><p>Police in Brussels, Belgium, arrested about 150 participants in a September 11 rally against Islamic power in Europe. Among those arrested were members Belgium’s Vlaams Belang political party and members of the European Union parliament bearing flyers that read “No Eurabia.” Participants in the rally had come from Denmark, Holland, France, Italy and Belgium.  Brussels’s socialist mayor, Freddy Thielemans, had forbidden the “Stop the Islamization of Europe” rally on the grounds that it would offend the city’s Muslim community.</p></blockquote><p>So much for those Enlightenment ideals of the European Union; it seems protecting certain religious groups trumps free expression and free association.</p><p>Meanwhile, in the United States, Jesse Jackson sees another Selma in Jena, Louisiana; of course, Jesse Jackson sees another Selma every time a white pizza delivery boy takes too long to get to his house.  In case you’re not aware of this massive miscarriage of justice, allow me to provide you with a short summary of <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=57746\">the Jena affair</a> as it has been described by the self-appointed paragons of racial justice:</p><p>1.  White individuals are not to be permitted any freedom of association or expression.  While bottles of urine containing religious icons, burning American flags and wearing suicide bomb-vests are all protected forms of self-expression, dangling empty nooses from trees are not.</p><p>2.  Black individuals cannot be expected to refrain from attacking en masse when provoked by opinions with which they disagree and can never be held responsible for physical attacks on white individuals.</p><p>Obviously, when six young black men beat up a young white man and send him to the hospital, it is an outrage that they should be charged with criminal activity by a black district attorney.  Why, it’s almost as outrageous as the slave trade and little black girls being blown up in church!</p><p>Notice the similarities between Jena and Brussels.  In both cases, blacks and Muslims are assumed by their left-wing defenders to be some form of subhuman species who must be treated like children lest they give in to their natural tendency to act like savages.</p><p>And notice too how Bill Press omits mentioning that the boy he describes as having “superficially wounds” was beaten unconscious and lost his sight in one eye for three weeks.  He also describes the gang-attack as a “brawl”, no doubt following CNN’s lead, which inaccurately reported the attack a fight: <em>“CNN reported that there were “obviously no witnesses to the fight.” In fact, <a href=\"http://isteve.blogspot.com/2007/09/jena.html\">over thirty eyewitnesses</a>, students and teachers, were questioned immediately following the attack, all of who implicated one or more of the black students arrested in the case. In fact, some of the accused black students did not stop stomping Barker until they were pulled away from him by some of the teachers, according to testimony given in the trial of Mychal Bell.”</em></p><p>The citation of tennis shoes as deadly weapons seems ridiculous at first glance, however, if they were being used to kick the kid in the head, it’s a perfectly reasonable charge, as is attempted murder.  The behavior of the white kids in hanging the nooses was obnoxious, but the subsequent behavior of the black kids was even more obnoxious; I mean, if you’re not invited, then you’re not invited, what sort of punk thinks that acquaintance with another guest is synonymous with an invitation and then tries to force his way into a party?  And, it’s worth pointing out, they did not attack either of the two Justins with whom they had problems, they attacked a third kid who happened to be white and have the same first name.</p><p>The kid Bailey, in particular, sounds like a typical convict-to-be.  Even if he somehow avoids jail in this go round, it’s pretty clear that he’ll be behind bars within four years.</p><p>UPDATE – As Nate wisely notes, this situation should be not be hard to understand.  Putting an empty noose over a tree limb = not illegal.  Attacking someone and putting him in the hospital = illegal.  The fact that so many black leaders find it difficult to make this distinction does not speak well of black leadership.</p></div>",
  "content_text": "A\ntale of two cities\n:\nPolice in Brussels, Belgium, arrested about 150 participants in a September 11 rally against Islamic power in Europe. Among those arrested were members Belgium’s Vlaams Belang political party and members of the European Union parliament bearing flyers that read “No Eurabia.” Participants in the rally had come from Denmark, Holland, France, Italy and Belgium.  Brussels’s socialist mayor, Freddy Thielemans, had forbidden the “Stop the Islamization of Europe” rally on the grounds that it would offend the city’s Muslim community.\nSo much for those Enlightenment ideals of the European Union; it seems protecting certain religious groups trumps free expression and free association.\nMeanwhile, in the United States, Jesse Jackson sees another Selma in Jena, Louisiana; of course, Jesse Jackson sees another Selma every time a white pizza delivery boy takes too long to get to his house.  In case you’re not aware of this massive miscarriage of justice, allow me to provide you with a short summary of\nthe Jena affair\nas it has been described by the self-appointed paragons of racial justice:\n1.  White individuals are not to be permitted any freedom of association or expression.  While bottles of urine containing religious icons, burning American flags and wearing suicide bomb-vests are all protected forms of self-expression, dangling empty nooses from trees are not.\n2.  Black individuals cannot be expected to refrain from attacking en masse when provoked by opinions with which they disagree and can never be held responsible for physical attacks on white individuals.\nObviously, when six young black men beat up a young white man and send him to the hospital, it is an outrage that they should be charged with criminal activity by a black district attorney.  Why, it’s almost as outrageous as the slave trade and little black girls being blown up in church!\nNotice the similarities between Jena and Brussels.  In both cases, blacks and Muslims are assumed by their left-wing defenders to be some form of subhuman species who must be treated like children lest they give in to their natural tendency to act like savages.\nAnd notice too how Bill Press omits mentioning that the boy he describes as having “superficially wounds” was beaten unconscious and lost his sight in one eye for three weeks.  He also describes the gang-attack as a “brawl”, no doubt following CNN’s lead, which inaccurately reported the attack a fight:\n“CNN reported that there were “obviously no witnesses to the fight.” In fact,\nover thirty eyewitnesses\n, students and teachers, were questioned immediately following the attack, all of who implicated one or more of the black students arrested in the case. In fact, some of the accused black students did not stop stomping Barker until they were pulled away from him by some of the teachers, according to testimony given in the trial of Mychal Bell.”\nThe citation of tennis shoes as deadly weapons seems ridiculous at first glance, however, if they were being used to kick the kid in the head, it’s a perfectly reasonable charge, as is attempted murder.  The behavior of the white kids in hanging the nooses was obnoxious, but the subsequent behavior of the black kids was even more obnoxious; I mean, if you’re not invited, then you’re not invited, what sort of punk thinks that acquaintance with another guest is synonymous with an invitation and then tries to force his way into a party?  And, it’s worth pointing out, they did not attack either of the two Justins with whom they had problems, they attacked a third kid who happened to be white and have the same first name.\nThe kid Bailey, in particular, sounds like a typical convict-to-be.  Even if he somehow avoids jail in this go round, it’s pretty clear that he’ll be behind bars within four years.\nUPDATE – As Nate wisely notes, this situation should be not be hard to understand.  Putting an empty noose over a tree limb = not illegal.  Attacking someone and putting him in the hospital = illegal.  The fact that so many black leaders find it difficult to make this distinction does not speak well of black leadership.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-21T09:25:00+00:00"
}