{
  "url": "https://voxday.net/2007/09/14/overrated-2/",
  "scraped_at": "2026-01-08T21:54:05.497123",
  "title": "Overrated",
  "date_display": "September 14, 2007",
  "date_iso": "2007-09-14T10:32:00+00:00",
  "date_from_url": "2007-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A scientist blows the whistle on <a href=\"http://online.wsj.com/article/SB118972683557627104.html?mod=hotair.com\">the poor reliability of peer-reviewed scientific research</a>:</p><blockquote><p><b>Most Science Studies Appear to Be Tainted By Sloppy Analysis</b></p><p>These flawed findings, for the most part, stem not from fraud or formal misconduct, but from more mundane misbehavior: miscalculation, poor study design or self-serving data analysis. “There is an increasing concern that in modern research, false findings may be the majority or even the vast majority of published research claims,” Dr. Ioannidis said. “A new claim about a research finding is more likely to be false than true.”</p><p>The hotter the field of research the more likely its published findings should be viewed skeptically, he determined….</p><p>In research published last month in the Journal of the American Medical Association, Dr. Ioannidis and his colleagues analyzed 432 published research claims concerning gender and genes.  Upon closer scrutiny, almost none of them held up. Only one was replicated.</p></blockquote><p>This doesn’t surprise me in the slightest, especially in light of what we’ve learned in the course of the ongoing evolution debate.  (I should be posting my latest response to Scott this weekend.)  Science is far less reliable than scientists would have us believe; this shouldn’t surprise anyone, least of all economists, given the financial incentive for scientific publication.  It would certainly be interesting to see what Dr. Ioannidis would conclude were he to perform a similar study on the published research claims regarding evolution and genes, especially considering his conclusion that “Claimed Research Findings May Often Be Simply <a href=\"http://medicine.plosjournals.org/perlserv/?request=get-document&amp;doi=10.1371/journal.pmed.0020124&amp;ct=1\">Accurate Measures of the Prevailing Bias</a>“.</p><p>In any event, it does offer an explanation of why the scientists are having so much trouble understanding the significance of my “margin of error” point.</p></div>",
  "content_text": "A scientist blows the whistle on\nthe poor reliability of peer-reviewed scientific research\n:\nMost Science Studies Appear to Be Tainted By Sloppy Analysis\nThese flawed findings, for the most part, stem not from fraud or formal misconduct, but from more mundane misbehavior: miscalculation, poor study design or self-serving data analysis. “There is an increasing concern that in modern research, false findings may be the majority or even the vast majority of published research claims,” Dr. Ioannidis said. “A new claim about a research finding is more likely to be false than true.”\nThe hotter the field of research the more likely its published findings should be viewed skeptically, he determined….\nIn research published last month in the Journal of the American Medical Association, Dr. Ioannidis and his colleagues analyzed 432 published research claims concerning gender and genes.  Upon closer scrutiny, almost none of them held up. Only one was replicated.\nThis doesn’t surprise me in the slightest, especially in light of what we’ve learned in the course of the ongoing evolution debate.  (I should be posting my latest response to Scott this weekend.)  Science is far less reliable than scientists would have us believe; this shouldn’t surprise anyone, least of all economists, given the financial incentive for scientific publication.  It would certainly be interesting to see what Dr. Ioannidis would conclude were he to perform a similar study on the published research claims regarding evolution and genes, especially considering his conclusion that “Claimed Research Findings May Often Be Simply\nAccurate Measures of the Prevailing Bias\n“.\nIn any event, it does offer an explanation of why the scientists are having so much trouble understanding the significance of my “margin of error” point.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-14T09:32:00+00:00"
}