{
  "url": "https://voxday.net/2007/09/13/patriot-games/",
  "scraped_at": "2026-01-08T21:53:54.119506",
  "title": "Patriot games",
  "date_display": "September 13, 2007",
  "date_iso": "2007-09-13T12:31:00+00:00",
  "date_from_url": "2007-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“So, how do you feel about those three tainted Super Bowls?” John McConnell asked the Sports Guy.  I laughed, I cried, much better than Cats.  The mere fact that Bill Simmons felt the need to rush to review the old game recaps in order to defend the Patriots’ Super Bowl-winning performances is amusing enough; my theory is that this is karmic retribution for a) Stealing KG, b) Stealing Randy Moss, c) Bill Belichek’s total lack of graciousness, and d) dumping Pat Patriot and their sweet red pants for the Flying Elvis and generic metallic look of today.</p><p>I think the NFL will crack down fairly hard on the Patriots; remember, this is a league that fines players for having the improper amount of white showing on their socks.  A hefty fine, a four-game suspension for Belicheck and the loss of two draft picks, maybe a one and a three, seems about right to me.</p><p>The Sports Guy is right to note that for much of NFL Nation, the Colts and Patriots have become the Yankees and Red Sox, at least for the moment.  People are starting to get sick of them and if it weren’t for Pittsburgh’s Super Bowl win in Rothlisberger’s <s>rookie</s>second year, they’d really be leaping at the chance to tear down the Patriots.  Of course, it’s not Belicheck’s fault that so many coaches and general managers are totally clueless; I still can’t believe that Green Bay, Kansas City, Jacksonville, San Diego, Seattle and Minnesota didn’t go hard after Randy Moss this offseason, even though Seattle and San Diego are the only places that would have made sense from Moss’s perspective.</p><p>The fact that it was totally unnecessary just indicates what a perfect psychopath Belicheck is.  You’ve got a much better team and coaching staff, you’ve reloaded at your weakest point, the other quarterback is hurt… so naturally what choice do you have but to cheat?</p><p>Is it really that big a deal?  No, not really.  Is Roger Goodell going to let it slide?  No way.  And should we enjoy tormenting everyone riding the Patriots bandwagon for the rest of the season?  Oh yeah!</p></div>",
  "content_text": "“So, how do you feel about those three tainted Super Bowls?” John McConnell asked the Sports Guy.  I laughed, I cried, much better than Cats.  The mere fact that Bill Simmons felt the need to rush to review the old game recaps in order to defend the Patriots’ Super Bowl-winning performances is amusing enough; my theory is that this is karmic retribution for a) Stealing KG, b) Stealing Randy Moss, c) Bill Belichek’s total lack of graciousness, and d) dumping Pat Patriot and their sweet red pants for the Flying Elvis and generic metallic look of today.\nI think the NFL will crack down fairly hard on the Patriots; remember, this is a league that fines players for having the improper amount of white showing on their socks.  A hefty fine, a four-game suspension for Belicheck and the loss of two draft picks, maybe a one and a three, seems about right to me.\nThe Sports Guy is right to note that for much of NFL Nation, the Colts and Patriots have become the Yankees and Red Sox, at least for the moment.  People are starting to get sick of them and if it weren’t for Pittsburgh’s Super Bowl win in Rothlisberger’s\nrookie\nsecond year, they’d really be leaping at the chance to tear down the Patriots.  Of course, it’s not Belicheck’s fault that so many coaches and general managers are totally clueless; I still can’t believe that Green Bay, Kansas City, Jacksonville, San Diego, Seattle and Minnesota didn’t go hard after Randy Moss this offseason, even though Seattle and San Diego are the only places that would have made sense from Moss’s perspective.\nThe fact that it was totally unnecessary just indicates what a perfect psychopath Belicheck is.  You’ve got a much better team and coaching staff, you’ve reloaded at your weakest point, the other quarterback is hurt… so naturally what choice do you have but to cheat?\nIs it really that big a deal?  No, not really.  Is Roger Goodell going to let it slide?  No way.  And should we enjoy tormenting everyone riding the Patriots bandwagon for the rest of the season?  Oh yeah!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-13T11:31:00+00:00"
}