{
  "url": "https://voxday.net/2007/09/04/scott-adams-sums-it-up/",
  "scraped_at": "2026-01-08T21:53:17.311533",
  "title": "Scott Adams sums it up",
  "date_display": "September 4, 2007",
  "date_iso": "2007-09-04T18:14:00+00:00",
  "date_from_url": "2007-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’d almost think <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2007/09/fossils-still-b.html#comments\">he’d been following my debate with Scott Hatfield</a>:</p><blockquote><p>I remember learning in school about the neat line of human descent and wondering how we can be so sure about that from the relatively few fossil discoveries. It looked like bullshit to me. And now we have a better idea that it was. Some of the most basic so-called facts of human evolution were wrong, it seems. Tools were used before brains got bigger, we walked upright at the same time we did a lot of tree swinging, etc.</p><p>Proponents of evolution will angrily argue the following points that I will acknowledge first just to piss them off:</p><p>1. Science is dynamic and revises itself. That is its strength. Yay, science!<br>2. Revising details of evolution doesn’t mean evolution didn’t happen.<br>3. There is a mountain of good information for evolution.<br>4. Scott Adams is not a trained scientist. That’s why he doesn’t understand evolution.<br>5. The stuff in that article has been known to scientists for a long time.</br></br></br></br></p><p>That’s all true, I’m sure. It also has nothing to do with my point. My point is that the average non-scientist has been fed a diet of suspicious evidence for evolution for decades. And much of it turns out to be bullshit. It smelled like bullshit and it was.</p></blockquote><p>I’m a little less sanguine about the strength of the scientific position than Mr. Adams, mostly due to the predictive shortcomings that I understand in my own scientific field, but this summary explains both the challenge faced by scientists as well as the reasonable – indeed, inevitable – skepticism about evolution on the part of many intelligent non-scientists.</p><p>Nearly everything I was taught about evolution in both public and private school has not only turned to be, as Scott describes it, complete bullshit, but infuriatingly, is now often denied by evolutionists as having anything to do with evolution.  (That’s not <em>Darwinism</em>, that’s <em>Haeckelism</em>… right, like they made that all-important distinction for us in fifth grade.)  Not that I care what is taught in schools that these days can’t even teach children how to read or do basic math, but it does raise serious questions about viability of the concept favored by so many scientists of teaching more science in school.</p><p>For every Scott Hatfield that is perfectly capable of teaching the actual science and avoiding the bovine ejectus, there’s probably twenty teachers that will guarantee a classroom full of students convinced that science is essentially fraudulent.</p></div>",
  "content_text": "You’d almost think\nhe’d been following my debate with Scott Hatfield\n:\nI remember learning in school about the neat line of human descent and wondering how we can be so sure about that from the relatively few fossil discoveries. It looked like bullshit to me. And now we have a better idea that it was. Some of the most basic so-called facts of human evolution were wrong, it seems. Tools were used before brains got bigger, we walked upright at the same time we did a lot of tree swinging, etc.\nProponents of evolution will angrily argue the following points that I will acknowledge first just to piss them off:\n1. Science is dynamic and revises itself. That is its strength. Yay, science!\n2. Revising details of evolution doesn’t mean evolution didn’t happen.\n3. There is a mountain of good information for evolution.\n4. Scott Adams is not a trained scientist. That’s why he doesn’t understand evolution.\n5. The stuff in that article has been known to scientists for a long time.\nThat’s all true, I’m sure. It also has nothing to do with my point. My point is that the average non-scientist has been fed a diet of suspicious evidence for evolution for decades. And much of it turns out to be bullshit. It smelled like bullshit and it was.\nI’m a little less sanguine about the strength of the scientific position than Mr. Adams, mostly due to the predictive shortcomings that I understand in my own scientific field, but this summary explains both the challenge faced by scientists as well as the reasonable – indeed, inevitable – skepticism about evolution on the part of many intelligent non-scientists.\nNearly everything I was taught about evolution in both public and private school has not only turned to be, as Scott describes it, complete bullshit, but infuriatingly, is now often denied by evolutionists as having anything to do with evolution.  (That’s not\nDarwinism\n, that’s\nHaeckelism\n… right, like they made that all-important distinction for us in fifth grade.)  Not that I care what is taught in schools that these days can’t even teach children how to read or do basic math, but it does raise serious questions about viability of the concept favored by so many scientists of teaching more science in school.\nFor every Scott Hatfield that is perfectly capable of teaching the actual science and avoiding the bovine ejectus, there’s probably twenty teachers that will guarantee a classroom full of students convinced that science is essentially fraudulent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-04T17:14:00+00:00"
}