{
  "url": "https://voxday.net/2007/09/17/time-stops/",
  "scraped_at": "2026-01-08T21:54:12.129966",
  "title": "Time stops",
  "date_display": "September 17, 2007",
  "date_iso": "2007-09-17T10:54:00+00:00",
  "date_from_url": "2007-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>James Oliver Rigney Jr, author of the long-running fantasy series The Wheel of Time and better known to millions of fans by the pen name Robert Jordan, died on 16 Sept 2007 from cardiac amyloidosis. Jordan announced he had been diagnosed with the disease in March 2006 and vowed to beat the odds, but determination and gumption sometimes just aren’t enough in the face of a disease with a median survival time of just over two years. Jordan was in the process of writing the twelfth and final book in the Wheel of Time series, A Memory of Light, but the book was not slated for release until 2009 and is still incomplete.</p></blockquote><p>The authors of <em>A Wrinkle in Time</em> and <em>The Wheel of Time</em> series both died recently, on September 6th and September 16th, respectively.  While I loved Madeleine L’Engle’s work – <em>A Swiftly Tilting Planet</em> is still the model of pure fictional tension for me – and very much disliked Robert Jordan’s imposing collection of doorstops, it seems right to note the respective passings of two very different fantasy authors.</p><p>And while I would be happy to forgo ever reading another word of Jordan’s prose, I do admire his resourcefulness in preparing copious notes and recordings so that his estate could arrange for the twelfth and last book to be finished, in anticipation of his untimely demise.  Such an action isn’t akin to the abusive committing of prequels that has become increasingly common these days, but rather, an indication of a storyteller’s laudable concern for his audience and desire to ensure that the tale is completed.</p><p>Nevertheless, here’s hoping George R.R. Martin isn’t forced to do likewise.</p><p>PS – While we’re on the subject of non-deceased fantasy writers, I should mention that last week I accepted a book contract from a small fantasy press for a novel set in the world in which a few of <a href=\"http://www.eternalwarriors.com/tbshorts.html\">my short stories</a> are set.  I chose this project because the publisher was specifically interested in my ideas about breaking outside of some of the entrenched fantasy tropes in favor of a more historical and philosophical approach.  It’s not the sort of thing one would ever bother to submit to places like Baen or Tor, given that it completely lacks those all-important elements of plasma cannons or vampire sex.  The working title is <em>Sublimus Dei</em>, and the story concerns the struggles of powerful factions within and without a Church that is occupied with deciding whether the non-human inhabitants of the world possess immortal souls or not.</p><p><em>Sublimus Dei</em> will be published in December 2008.</p></div>",
  "content_text": "James Oliver Rigney Jr, author of the long-running fantasy series The Wheel of Time and better known to millions of fans by the pen name Robert Jordan, died on 16 Sept 2007 from cardiac amyloidosis. Jordan announced he had been diagnosed with the disease in March 2006 and vowed to beat the odds, but determination and gumption sometimes just aren’t enough in the face of a disease with a median survival time of just over two years. Jordan was in the process of writing the twelfth and final book in the Wheel of Time series, A Memory of Light, but the book was not slated for release until 2009 and is still incomplete.\nThe authors of\nA Wrinkle in Time\nand\nThe Wheel of Time\nseries both died recently, on September 6th and September 16th, respectively.  While I loved Madeleine L’Engle’s work –\nA Swiftly Tilting Planet\nis still the model of pure fictional tension for me – and very much disliked Robert Jordan’s imposing collection of doorstops, it seems right to note the respective passings of two very different fantasy authors.\nAnd while I would be happy to forgo ever reading another word of Jordan’s prose, I do admire his resourcefulness in preparing copious notes and recordings so that his estate could arrange for the twelfth and last book to be finished, in anticipation of his untimely demise.  Such an action isn’t akin to the abusive committing of prequels that has become increasingly common these days, but rather, an indication of a storyteller’s laudable concern for his audience and desire to ensure that the tale is completed.\nNevertheless, here’s hoping George R.R. Martin isn’t forced to do likewise.\nPS – While we’re on the subject of non-deceased fantasy writers, I should mention that last week I accepted a book contract from a small fantasy press for a novel set in the world in which a few of\nmy short stories\nare set.  I chose this project because the publisher was specifically interested in my ideas about breaking outside of some of the entrenched fantasy tropes in favor of a more historical and philosophical approach.  It’s not the sort of thing one would ever bother to submit to places like Baen or Tor, given that it completely lacks those all-important elements of plasma cannons or vampire sex.  The working title is\nSublimus Dei\n, and the story concerns the struggles of powerful factions within and without a Church that is occupied with deciding whether the non-human inhabitants of the world possess immortal souls or not.\nSublimus Dei\nwill be published in December 2008.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-17T09:54:00+00:00"
}