{
  "url": "https://voxday.net/2007/09/01/two-atheist-morons/",
  "scraped_at": "2026-01-08T21:52:58.441007",
  "title": "Two atheist morons",
  "date_display": "September 1, 2007",
  "date_iso": "2007-09-01T17:56:00+00:00",
  "date_from_url": "2007-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh from citing <a href=\"http://www.milobookclub.com/2007/08/26/savaged-by-angry-lambs/\">Dr. Wilkin’s incomplete “evisceration”</a> of <em>Darwin’s Deadly Legacy</em>, Dr. PZ Myers actually thinks <a href=\"http://timpanogos.wordpress.com/2007/08/31/vox-day-trapped-in-a-quote-mine-cave-in/\">this rambling, ignorant post</a> by Ed Darrell has <a href=\"http://scienceblogs.com/pharyngula/2007/09/the_hollow_man.php\">“completely eviscerated”</a> my explication of the historical link between Darwinism and Marxism.   It’s pretty clear that everyone’s favorite assistant community college professor has no idea what the word “eviscerate” means.  Damn those public schools!</p><p>I’ve already explained that Ed has no clue about what the facts of the matter are, but there’s no point in attempting to explain dialectical materialism, much less its overt links with Darwinism, to someone too stupid to understand the difference between the Wehrmacht and the Waffen SS.  You’ll understand why I don’t waste any more time on this buffoon when you see that he has  linked a photograph of a German pre-WWII belt buckle saying “Gott mit uns” followed by this most amusing statement:</p><blockquote><p>So according to Vox, <a href=\"http://nobeliefs.com/mementoes.htm\">this photograph</a> is impossible</p></blockquote><p>Now, do please look at the words right under the photo.</p><p>“Enlisted Man’s German Army belt buckle”.</p><p>The German Army is the Wehrmacht, it was not the 930,000-strong Nazi army known as the Waffen SS.  The Wehrmacht slogan, “Gott mit uns”, dates back to 1870.  For the benefit of these two historical ignoramuses, I note that 1870 is prior to the foundation of the German National Socialist Workers Party.  The Nazis refused to use the “Gott mit uns” slogan and chose “Mein Ehre Heisst Treu” instead. I even pointed out these facts to <a href=\"http://www.milobookclub.com/2007/08/25/scrub-scrub-lady-macatheis/\">both Ed</a> and <a href=\"http://www.milobookclub.com/2007/08/03/rare-agreemen/\">PZ previously</a>.  Ach du lieber, what a pair of idiots.  How much confidence would you place in the historical knowledge of an individual who argued that the U.S. Army’s motto was Semper Fi, and on this basis, concluded that the 101st Airborne were a Catholic institution?</p><p>As for the rest, once more it is demonstrated how atheists will stubbornly rely on their piss-poor logic instead of copious amounts of undeniable evidence.  The following statement was posted in the comments here by a reader who grew up in the Soviet Union and was educated there.  Ed posted repeated comments after this and yet continues to pretend that this evidence doesn’t exist while erroneously proclaiming that I am lying and other evidence I possess doesn’t exist because I won’t do his research for him.</p><p><em><a href=\"http://www.biografia.ru/cgi-bin/quotes.pl?oaction=show&amp;name=michuriniv\">Above is the link</a> to the text of the book in Russian, called “The Teaching of Michurin and Religion.” (published 1955)  In a nutshell it says, that the theory of Darwin is very progressive,and materialistic, but has some drawbacks, which were corrected by a Soviet Darwinist Michurin, who was the only true Darwinist becase he used the works of Marx, Lenin and Stalin as the basis for his scientific research. Stalin was not against the theory of Darwin, he was against genetics, and the book which was published only 2 years after his death, says that those scienists who belived in genetics, were not really Darwinists, and only Michurin, Lisenko and some others were true “creative Darwinists”. Vox is absolutely correct, Stalin wasn’t against Darwin, the theory of Darwin was very important for the development of historic materialism, which was the basis for marxism-leninism. After Stalin’s death, they just proclaimed that he was wrong about genetics, that it was perfectly compatible with theory of Darwin, and went on teaching it at schools.</em></p><p><a href=\"http://www.biografia.ru/cgi-bin/quotes.pl?oaction=show&amp;name=michuch03\">This chapter of the book</a> is called The role of Darwin’s theory in the struggle of science against religion.</p><p><a href=\"http://biblioteka.org.ua/book.php?id=1120011784&amp; p=35\">The link above</a> is to a part of the document from 1948, when Stalin was yet alive, I think it’s a transcript of the session of the Russian Scientific Academy, which calls Lisenko the scientist who is developing the theory of Darwin and Michurin. Once again, Vox is absolutely right. Stalin was against Mendel and Morgan, but NOT against Darwin. And he considered Lisenko and Michurin the true Darwinists.</p><p>It’s really stupid of PZ and Ed to attempt to maintain their hopeless position.  There are no shortage of Russian and East German textbooks explicitly maintaining the precise link between Darwinism and Marxism that I have explained.  Ed confesses that he doesn’t have much about socialism or the Soviet Union in his library and he’s just frantically scouring the Internet; too bad for him that I read German and TPAM reads Russian.  But I should thank them, really, as it has given me a solid idea for my next book now that <em>The Irrational Atheist</em> is complete.</p><p>UPDATE – Tim Day comments at Pharyngula: <em>Even if it were demonstrably true that all of Stalin’s excesses were directly inspired by Darwin I don’t see that it makes any difference at all to the truth of evolution. To claim it does is such an egregious category error that it seems to me to outrank any of Vox’s historical idiocy.</em></p><p>First, my “historical idiocy” is much more precisely described as “historical accuracy”.  Second, I have never claimed that the way in which Darwin’s theories undeniably inspired and justified Marxism has any significance regarding the truth or falsehood of evolution, for the obvious reason that it doesn’t.</p><p>UPDATE II – Scott Hatfield exhibits some uncharacteristically poor reasoning here: <em>You can’t trust either PZ or Ed Darrell (an unlikely tag team, that) because (Vox implies) they can’t get their facts about who wore what belt buckle when.  Obviously, I think that’s an unworthy argument.</em></p><p>No, Scott, you can’t trust them because they repeat the factual error even after the error has been expressly pointed out to them, so they know that what they are saying is not true.  Nor is this the first time that either of them has done this.</p></div>",
  "content_text": "Fresh from citing\nDr. Wilkin’s incomplete “evisceration”\nof\nDarwin’s Deadly Legacy\n, Dr. PZ Myers actually thinks\nthis rambling, ignorant post\nby Ed Darrell has\n“completely eviscerated”\nmy explication of the historical link between Darwinism and Marxism.   It’s pretty clear that everyone’s favorite assistant community college professor has no idea what the word “eviscerate” means.  Damn those public schools!\nI’ve already explained that Ed has no clue about what the facts of the matter are, but there’s no point in attempting to explain dialectical materialism, much less its overt links with Darwinism, to someone too stupid to understand the difference between the Wehrmacht and the Waffen SS.  You’ll understand why I don’t waste any more time on this buffoon when you see that he has  linked a photograph of a German pre-WWII belt buckle saying “Gott mit uns” followed by this most amusing statement:\nSo according to Vox,\nthis photograph\nis impossible\nNow, do please look at the words right under the photo.\n“Enlisted Man’s German Army belt buckle”.\nThe German Army is the Wehrmacht, it was not the 930,000-strong Nazi army known as the Waffen SS.  The Wehrmacht slogan, “Gott mit uns”, dates back to 1870.  For the benefit of these two historical ignoramuses, I note that 1870 is prior to the foundation of the German National Socialist Workers Party.  The Nazis refused to use the “Gott mit uns” slogan and chose “Mein Ehre Heisst Treu” instead. I even pointed out these facts to\nboth Ed\nand\nPZ previously\n.  Ach du lieber, what a pair of idiots.  How much confidence would you place in the historical knowledge of an individual who argued that the U.S. Army’s motto was Semper Fi, and on this basis, concluded that the 101st Airborne were a Catholic institution?\nAs for the rest, once more it is demonstrated how atheists will stubbornly rely on their piss-poor logic instead of copious amounts of undeniable evidence.  The following statement was posted in the comments here by a reader who grew up in the Soviet Union and was educated there.  Ed posted repeated comments after this and yet continues to pretend that this evidence doesn’t exist while erroneously proclaiming that I am lying and other evidence I possess doesn’t exist because I won’t do his research for him.\nAbove is the link\nto the text of the book in Russian, called “The Teaching of Michurin and Religion.” (published 1955)  In a nutshell it says, that the theory of Darwin is very progressive,and materialistic, but has some drawbacks, which were corrected by a Soviet Darwinist Michurin, who was the only true Darwinist becase he used the works of Marx, Lenin and Stalin as the basis for his scientific research. Stalin was not against the theory of Darwin, he was against genetics, and the book which was published only 2 years after his death, says that those scienists who belived in genetics, were not really Darwinists, and only Michurin, Lisenko and some others were true “creative Darwinists”. Vox is absolutely correct, Stalin wasn’t against Darwin, the theory of Darwin was very important for the development of historic materialism, which was the basis for marxism-leninism. After Stalin’s death, they just proclaimed that he was wrong about genetics, that it was perfectly compatible with theory of Darwin, and went on teaching it at schools.\nThis chapter of the book\nis called The role of Darwin’s theory in the struggle of science against religion.\nThe link above\nis to a part of the document from 1948, when Stalin was yet alive, I think it’s a transcript of the session of the Russian Scientific Academy, which calls Lisenko the scientist who is developing the theory of Darwin and Michurin. Once again, Vox is absolutely right. Stalin was against Mendel and Morgan, but NOT against Darwin. And he considered Lisenko and Michurin the true Darwinists.\nIt’s really stupid of PZ and Ed to attempt to maintain their hopeless position.  There are no shortage of Russian and East German textbooks explicitly maintaining the precise link between Darwinism and Marxism that I have explained.  Ed confesses that he doesn’t have much about socialism or the Soviet Union in his library and he’s just frantically scouring the Internet; too bad for him that I read German and TPAM reads Russian.  But I should thank them, really, as it has given me a solid idea for my next book now that\nThe Irrational Atheist\nis complete.\nUPDATE – Tim Day comments at Pharyngula:\nEven if it were demonstrably true that all of Stalin’s excesses were directly inspired by Darwin I don’t see that it makes any difference at all to the truth of evolution. To claim it does is such an egregious category error that it seems to me to outrank any of Vox’s historical idiocy.\nFirst, my “historical idiocy” is much more precisely described as “historical accuracy”.  Second, I have never claimed that the way in which Darwin’s theories undeniably inspired and justified Marxism has any significance regarding the truth or falsehood of evolution, for the obvious reason that it doesn’t.\nUPDATE II – Scott Hatfield exhibits some uncharacteristically poor reasoning here:\nYou can’t trust either PZ or Ed Darrell (an unlikely tag team, that) because (Vox implies) they can’t get their facts about who wore what belt buckle when.  Obviously, I think that’s an unworthy argument.\nNo, Scott, you can’t trust them because they repeat the factual error even after the error has been expressly pointed out to them, so they know that what they are saying is not true.  Nor is this the first time that either of them has done this.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-09-01T16:56:00+00:00"
}