{
  "url": "https://voxday.net/2017/10/23/a-home-for-alt%e2%98%85hero/",
  "scraped_at": "2025-12-19T10:28:44.819225",
  "title": "A home for Alt★Hero",
  "date_display": "October 23, 2017",
  "date_iso": "2017-10-23T12:00:00+00:00",
  "date_from_url": "2017-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/althero/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"363\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DM0X9tWXUAABXHd.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"363\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DM0X9tWXUAABXHd.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20363%22%3E%3C/svg%3E\"/></a></div><p>Thanks to the enthusiasm of the Alt★Hero backers, we’ve just passed Stretch Goal #9 at 540 percent of the original objective, thereby committing us to providing a site dedicated to the series. This is a very positive sign as we enter the final stretch. There is strong interest in the role-playing game, so I’m confident that we’ll hit #10 without too much trouble. I suspect #11 is likely to prove a little ambitious, which is absolutely fine with me as we already have a considerable amount of work in front of us.</p><p>Fortunately, we have already brought two more experienced lead illustrators onto the team. As you can see, we’re now <a href=\"http://ninjaink.daportfolio.com/\">working with Timothy Lim</a>, and although we <a href=\"https://twitter.com/JinjerZilla/status/920013602362413056\">lost Jinjerzilla as a lead illustrator</a>, since he did not have sufficient time to take on the responsibility of illustrating full volumes, we were fortunate in being able to replace him with a longtime veteran of two major comics publishers who will be announced in the near future.</p><p>If you’re at all interested in role-playing games, I would strongly encourage you to <a href=\"https://freestartr.com/project/althero/\">back the RPG rulebook</a>, as I think there is a very good chance that the system we are designing is not only going to be the best one for superheroes yet created, but will provide mechanics that translate effectively to science fiction, fantasy, and even military role-playing. What we’re doing here is more than creating a comics line, as we are building a strong foundation from which future offensives in the cultural war in comics, SF/F, and gaming can be launched.</p></div>",
  "content_text": "Thanks to the enthusiasm of the Alt★Hero backers, we’ve just passed Stretch Goal #9 at 540 percent of the original objective, thereby committing us to providing a site dedicated to the series. This is a very positive sign as we enter the final stretch. There is strong interest in the role-playing game, so I’m confident that we’ll hit #10 without too much trouble. I suspect #11 is likely to prove a little ambitious, which is absolutely fine with me as we already have a considerable amount of work in front of us.\nFortunately, we have already brought two more experienced lead illustrators onto the team. As you can see, we’re now\nworking with Timothy Lim\n, and although we\nlost Jinjerzilla as a lead illustrator\n, since he did not have sufficient time to take on the responsibility of illustrating full volumes, we were fortunate in being able to replace him with a longtime veteran of two major comics publishers who will be announced in the near future.\nIf you’re at all interested in role-playing games, I would strongly encourage you to\nback the RPG rulebook\n, as I think there is a very good chance that the system we are designing is not only going to be the best one for superheroes yet created, but will provide mechanics that translate effectively to science fiction, fantasy, and even military role-playing. What we’re doing here is more than creating a comics line, as we are building a strong foundation from which future offensives in the cultural war in comics, SF/F, and gaming can be launched.",
  "tags": [
    "Alt-Hero",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-23T11:00:00+00:00"
}