{
  "url": "https://voxday.net/2017/10/24/a-review-of-sjwadd/",
  "scraped_at": "2025-12-19T10:28:52.334939",
  "title": "A review of SJWADD",
  "date_display": "October 24, 2017",
  "date_iso": "2017-10-24T16:43:00+00:00",
  "date_from_url": "2017-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A detailed review of <b><a href=\"http://amzn.to/2xt9dWb\">SJWs Always Double Down</a></b> by an author who prefers to remain anonymous.</i></p><p>One of the most staggering pieces of hypocrisy in the colonial era was known as ‘The White Man’s Burden.’</p><p>On the face of it, the basic concept looked sound.  The colonists would civilise the natives, giving them modern technology, learning and attitudes that would allow them to leave their roots and join the enlightened colonists as equals.  There was nothing wrong with it, as far as anyone living in that era believed.  The hypocrisy, however, was not hard to find.  The majority colonists – consciously or not – never intended to allow their subjects to rise to the highest levels.  They would never be treated as equals, never considered fully civilised.</p><p>On one hand, this provided a justification – an excuse – for exploiting the natives.  It’s all for their own good (anything can be justified for a good cause).  But, far worse, it also provided an excuse for the civilisers to keep finding newer and better reasons to keep moving the goalposts.  The natives will never be declared equal – they will never be free of the colonists – because that would put the civilisers out of work!  This creates what I call a perverse incentive – an incentive to do something that is morally wrong, but works in your favour.</p><p>This is why the billions expended on international charity have produced very limited results.  On one hand, the cause is good; on the other, charities are too concerned with idealism rather than practicalities, the people the charities are trying to help are not allowed much of a say in decision-making, thus depriving the planners of people with local knowledge, and the charity bosses have too great an incentive to keep the money flowing.  The outcome shouldn’t really be surprising.</p><p>The thing you have to bear in mind about modern-day Social Justice Warriors is that they have their own version of ‘The White Man’s Burden.’  And the unintended consequences are pretty much the same.</p><p>One thing I have always considered to be a point in Vox Day’s favour is that he makes you think, even though you – and I – may disagree with him on many points.  Indeed, I have come to prefer his non-fiction to his fiction, if only because it is strikingly thought-provoking and often provocative.  In writing <b><i><a href=\"http://amzn.to/2xt9dWb\">SJWs Always Double Down</a></i></b> – the title comes from the three laws of SJWs – Vox has expanded upon his earlier work, <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i></b> and carried us forward into 2017.</p><p><a name=\"more\"></a>The essential difference between a person who is genuinely concerned and a full-fledged SJW is that the former has essentially limited goals, while the latter’s objectives are nebulous, wide-ranging … and permanent.  The former will identify a problem – and it is often a very real problem – and propose practical solutions, then retire gracefully when victory has been achieved.  The latter will not retire, even when he gets what he says he wants.  He’ll just come up with newer demands, which will be harder to resist because one has already conceded the earlier set of demands.  It is, in short, about power and appearances rather than practicalities.  Somewhere along the way, the idea that one is trying to solve a single very specific problem is lost.</p><p>Let’s assume, for the sake of argument, that there is a public building – a library, perhaps – which is only accessible through a short flight of stairs.  Hardly a problem for an able-bodied person, but an impassable barrier to someone trapped in a wheelchair.  This is obviously a problem that needs to be fixed, right?  It’s a public building.  The disabled have a right to use it too.  Who could possibly say otherwise?</p><p>The genuinely concerned will suggest replacing the stairs with a ramp.  A simple, very practical solution.  And one that, in most cases, will not be too difficult.  The SJW, on the other hand, will insist on writing a set of very vague laws to cover ‘disability discrimination’ and then expand them as much as possible, all under the cover of doing good.  They will never declare victory for the simple reason that declaring victory means giving up their power.  And while it may look good, on the surface, a cynic might note that the side-effects – able-bodied people growing to resent disabled people – will bring forth a poisonous fruit in time.</p><p>A further, more fundamental, difference between the genuinely concerned and the SJW is that the latter believes so deeply in his cause that he finds it impossible to comprehend that someone might have a reasonable reason to disagree.  No, anyone who disagrees must be evil.  This has a great deal in common with a number of religious groups, which assume that anyone who doesn’t think like them is either ignorant or wilfully evil. Instead of questioning his own assumptions, as Vox Day demonstrates, the SJW always doubles down and attacks anyone who dares to question him.  Thus, for example, anyone who points out Hillary Clinton’s massive failings as a candidate for President is a sexist, as far as the SJWs are concerned.  This allows them to comfortably dismiss anything that runs contrary to their narrative.</p><p>In essence, Vox Day argues that a counterattack is now underway.  GamerGate, BREXIT, President Trump, the NFA boycott … they’re all spurred on by opposition to SJWs, however defined.  There is a great deal of truth in this – Trump managed to define himself by his opposition to ‘political correctness’ (a key part of maintaining the SJW narrative) – although I don’t think it goes as far as Vox suggests.  The people who were the losers in the new world order were the ones who voted against it.  That said, the Left can reasonably be said to have overplayed its hand.  The gulf between the real world and the reality presented by the media, for example, cannot be overstated.  This has the ironic effect that any genuine problems with President Trump will not be taken seriously, as the media has cried ‘racist’ one too many times.</p><p>Such a problem is understandable.  A person has only a limited amount of credibility – and, when they babble about something they don’t understand (guns, for example) they only lose that credibility faster.  The NFA protests have little credibility because the worst that can happen is the players getting fired … which, given that most of them are multimillionaires, is unlikely to worry them.  Colin Kaepernick is supposed to be worth around $25 million dollars, more money than the average American (white, black, whatever) is likely to see in a dozen lifetimes. Indeed, they really do nothing more than distract Americans – and everyone else – from more important matters.</p><p>The SJWs do not help their case by demanding complete submission from friends and enemies alike.  They do not leave any room for reasonable disagreement.  This makes it impossible to debate them, let alone question their positions without unleashing a tidal wave of accusations … even if the questioner is a former friend.  The effects of this have been devastating, in everything from comic books to corporate life.  It does not matter, in the end, if the SJWs had a point or not.  Once credibility is lost, it will never be regained.  The tactics they use poison the well.  This is why, in far too many places, we now live in a low-trust society.  Why should anyone trust the media?  Or celebrities?  Or corporations like Facebook and Twitter?  Or random strangers on the internet?</p><p>This is not an academic question.  The last couple of years have seen all sorts of questions raised about the power wielded by Google, Facebook and Twitter – even Wikipedia.  It doesn’t matter, really, what you think of Vox Day.  Anyone, regardless of their political beliefs, should be concerned about how that power can be misused, particularly if there’s a ‘good’ reason for it.  Once you set a precedent – legal harassment of pro-life groups, for example – someone else can use that precedent to justify their own actions.  As a number of wags have observed, the Left spent eight years turning the US federal government into a weapon – and that weapon fell into the hands of Donald Trump!</p><p>Vox Day goes on to describe the effects of ‘SJW Convergence’ in governments, churches and corporations.  In some ways, this is not entirely a new problem.  The larger the organisation, the harder it is to keep focused on what actually matters.  On one hand, the guys at the top lose touch with the ground floor; on the other, it’s hard to believe that the organisation can actually collapse.  I don’t know if Marvel Comics – to use one example – is really on the verge of collapse, but sales have slumped alarmingly over the last few years.  And while the push for ‘diverse’ characters may not be the sole cause of the problem, it has – I think – played a role in the corporation’s decline.</p><p>It’s hard to say how seriously one should take these assertions.  On one hand, the problems are rarely as cut and dried.  Marvel’s constant revamping of the status quo probably paid a role too.  On the other hand, traditional publishing is in decline because the old-fashioned gatekeepers have been unable to adapt to the changes over the last ten years.  There comes a point where an organisation – Borders, for example – simply cannot survive.  But what cannot be denied is that power can easily be abused and perhaps it would be better to prevent any abuse.</p><p>Vox then discusses the ‘typical’ SJW, with extensive reference to his expanded social-sexual hierarchy.  This is, in many ways, the weakest part of the book; on one hand, his portrait of many intensive SJWs is quite accurate, but it doesn’t account for people who are swept into the process because they believe the cause is good or people who want to take advantage of SJW activism for their own ends.  I have, frankly, never placed much credence in the social-sexual hierarchy – people can and do move up and down, either through self-development or a sudden shattering change in their circumstances.</p><p>One point that bears mentioning is the assertion that SJWs simply cannot accept that they might be wrong.  There’s some truth in that.  But, on the other hand, I’ve noticed that being wrong, or admitting to being wrong, comes with a penalty these days.  There is no such thing as a limited surrender.  A person who loses one argument will often find himself accused of being wrong again and again.  This is a serious problem, for obvious reasons.  Why should anyone concede a point when they will be expected to concede everything?  Being able to accept being wrong requires being able to survive being wrong.</p><p>Next, the book assesses the current state of anti-SJW pushback, from the evolution of GamerGate to the decline and fall of the Hugo Awards.  This section is something of a mixed bag.  On one hand, internet sleuths have done a great deal of good by making it impossible to stick to a single narrative and/or for criminals and rioters to hide from justice.  On the other hand, the section on the Hugo Awards is difficult to follow.  While the whole affair does outline just how far the Hugo Awards have fallen – the concentration on pointless diversity as opposed to good writing, the willingness to rewrite or break the rules to drive out the Sad/Rabid Puppies – it also highlights some other absurdities.  Picking a book called – I kid you not – <i>Space Raptor Butt Invasion</i> – looks silly.  It is very easy to argue that Peter F. Hamilton deserves a Hugo, but not Chuck Tingle.  This was something of an own goal.  But, at the same time, the whole affair did illustrate the blatant hypocrisy of the awards.  And, more importantly, just how small the voting population, all sides put together, is, compared to the entirety of fandom.</p><p>At the end, the book discusses ways to build SJW-free organisations.  This is not an easy task, as one must be prepared for a barrage of negative publicity – or worse – whenever you do something or are seen to do something to upset the SJWs.  In some ways, this is the most important part of the book – and not just for the declared reason.  Competition helps keep organisations honest, rather than allowing themselves to forget their core goal.  The NFL can reasonably be said to have forgotten that its purpose is to entertain people, rather than play politics.  Some of the advice is good, some is bad … although it strikes me that insisting that directors have actual experience before they become directors might be the most practical step anyone could take.  There are certainly ways to allow dissent without letting it turn into emotional blackmail and suchlike.</p><p>One question the book does not answer, not directly, is simple.  What’s wrong with social justice?  Why should well-meaning SJWs be opposed at all costs?</p><p>There are essentially three answers to that question.  First, SJWs have no concept of individuality.  A person is defined by their identity (female politician, for example, instead of a politician who happens to be female).  This is made all the more confusing by intersectionality, which suggests that a person who has two separate identities may be oppressed by the interplay of both identities.  Confused, yet?  What this does, in practical terms, is draw lines between people, thus triggering off the ‘Us v. Them’ mentality and, worse, separate people from each other.  By this reasoning, Condoleezza Rice, Will Smith, Barack Obama and Trayvon Martin would all be classed as ‘black,’ rather than as individuals with their own identities.</p><p>What makes this worse is that the people who are taken to represent each identity are often the worst of the bunch.</p><p>Second, SJWs have made us less empathic – not more.</p><p>The concept of social justice is powered by emotional blackmail – sometimes called ‘weaponised empathy.’  You feel sorry for someone and thus give them an inch, which they use to take a mile. No good deed goes unpunished, as the saying goes. However, people resent having their emotions manipulated, even if it is for the greater good.  The natural response to emotional blackmail is to tune it out and, eventually, learn to ignore it.  As Dave Freer put it:<br><i><br/></i><i>“The idea that the cup of sympathy is a finite one, even smaller in hard economic times, is simply beyond [SJW’s] grasp, despite the fact that we see this in practice all the time. Joe calls in to work to say his kid is sick, and he has to take the child to the ER, gets sympathy. People pick up his slack, and the boss cuts him some extra. But even if the kid IS really very sickly, and it’s not just Joe’s excuse for a hangover, it gets used up after a few repetitions. People think Joe is taking unfair advantage, even if he isn’t. They also just get tired of giving. If you’re on the receiving end and all you give back is more demands, more ‘guilting’ your audience into more giving, the faster that’ll happen.”</i></br></p><p>People can become tired of constantly being told that they’re the bad guys, that they have to do everything from watch their speech, thus limiting rational debate, to take someone’s side automatically because they’re a designated victim.  However, there is a more serious point.</p><p>The two reasons I mentioned above intersect in several different ways.  One of the most important is that people can lose sympathy for groups, because they’ve been taught to think of people as belonging to their group first and foremost.  The rising tide of anti-immigration sentiment in both America and Europe owes its existence to a combination of bad behaviour and identity politics.  Ironically, the rise of ‘white nationalism’ in the US is a direct result of identity politics.  If every hyphenated-American can have an identity, why can’t white Americans?</p><p>This poisons the well in quite a few ways.  By pushing for diversity quotas and hires in businesses, SJWs both fuel resentment against the people who benefit from measures like Affirmative Action and directly harms them, because everyone who doesn’t benefit believes that the people who do have an unfair advantage.  This does not do wonders for social harmony.  Indeed, it does the exact opposite.</p><p>We, as a society, have started to slip into ‘Nag Rage.’  We are sick of being lectured by people who consider themselves our betters.  We are sick of being told what to do by people who don’t really know what they’re talking about.  And we are sick of being told that we have to be nice to people who want to hurt us.  This is fuelling a pushback that – perhaps worst of all – will hurt the people the SJWs claim to be trying to help.  Social Justice has a bad reputation because, above all, it simply doesn’t know when to stop.  And people are sick of falsifying their preferences and pretending to like it.</p><p>I could go on about this for quite some time.  But I’m not going to bother.</p><p>There are people who will dismiss this book because it is written by Vox Day.  That is unwise.  A person may be widely disliked – and very few people seem to be neutral about Vox Day – but that doesn’t stop them from having a point.  And while you may disagree with his, this book is still worth a read.</p><p>And, if you’re interested in how society has started to come to the boil, you could do worse than read this book.</p></div>",
  "content_text": "A detailed review of\nSJWs Always Double Down\nby an author who prefers to remain anonymous.\nOne of the most staggering pieces of hypocrisy in the colonial era was known as ‘The White Man’s Burden.’\nOn the face of it, the basic concept looked sound.  The colonists would civilise the natives, giving them modern technology, learning and attitudes that would allow them to leave their roots and join the enlightened colonists as equals.  There was nothing wrong with it, as far as anyone living in that era believed.  The hypocrisy, however, was not hard to find.  The majority colonists – consciously or not – never intended to allow their subjects to rise to the highest levels.  They would never be treated as equals, never considered fully civilised.\nOn one hand, this provided a justification – an excuse – for exploiting the natives.  It’s all for their own good (anything can be justified for a good cause).  But, far worse, it also provided an excuse for the civilisers to keep finding newer and better reasons to keep moving the goalposts.  The natives will never be declared equal – they will never be free of the colonists – because that would put the civilisers out of work!  This creates what I call a perverse incentive – an incentive to do something that is morally wrong, but works in your favour.\nThis is why the billions expended on international charity have produced very limited results.  On one hand, the cause is good; on the other, charities are too concerned with idealism rather than practicalities, the people the charities are trying to help are not allowed much of a say in decision-making, thus depriving the planners of people with local knowledge, and the charity bosses have too great an incentive to keep the money flowing.  The outcome shouldn’t really be surprising.\nThe thing you have to bear in mind about modern-day Social Justice Warriors is that they have their own version of ‘The White Man’s Burden.’  And the unintended consequences are pretty much the same.\nOne thing I have always considered to be a point in Vox Day’s favour is that he makes you think, even though you – and I – may disagree with him on many points.  Indeed, I have come to prefer his non-fiction to his fiction, if only because it is strikingly thought-provoking and often provocative.  In writing\nSJWs Always Double Down\n– the title comes from the three laws of SJWs – Vox has expanded upon his earlier work,\nSJWs Always Lie\nand carried us forward into 2017.\nThe essential difference between a person who is genuinely concerned and a full-fledged SJW is that the former has essentially limited goals, while the latter’s objectives are nebulous, wide-ranging … and permanent.  The former will identify a problem – and it is often a very real problem – and propose practical solutions, then retire gracefully when victory has been achieved.  The latter will not retire, even when he gets what he says he wants.  He’ll just come up with newer demands, which will be harder to resist because one has already conceded the earlier set of demands.  It is, in short, about power and appearances rather than practicalities.  Somewhere along the way, the idea that one is trying to solve a single very specific problem is lost.\nLet’s assume, for the sake of argument, that there is a public building – a library, perhaps – which is only accessible through a short flight of stairs.  Hardly a problem for an able-bodied person, but an impassable barrier to someone trapped in a wheelchair.  This is obviously a problem that needs to be fixed, right?  It’s a public building.  The disabled have a right to use it too.  Who could possibly say otherwise?\nThe genuinely concerned will suggest replacing the stairs with a ramp.  A simple, very practical solution.  And one that, in most cases, will not be too difficult.  The SJW, on the other hand, will insist on writing a set of very vague laws to cover ‘disability discrimination’ and then expand them as much as possible, all under the cover of doing good.  They will never declare victory for the simple reason that declaring victory means giving up their power.  And while it may look good, on the surface, a cynic might note that the side-effects – able-bodied people growing to resent disabled people – will bring forth a poisonous fruit in time.\nA further, more fundamental, difference between the genuinely concerned and the SJW is that the latter believes so deeply in his cause that he finds it impossible to comprehend that someone might have a reasonable reason to disagree.  No, anyone who disagrees must be evil.  This has a great deal in common with a number of religious groups, which assume that anyone who doesn’t think like them is either ignorant or wilfully evil. Instead of questioning his own assumptions, as Vox Day demonstrates, the SJW always doubles down and attacks anyone who dares to question him.  Thus, for example, anyone who points out Hillary Clinton’s massive failings as a candidate for President is a sexist, as far as the SJWs are concerned.  This allows them to comfortably dismiss anything that runs contrary to their narrative.\nIn essence, Vox Day argues that a counterattack is now underway.  GamerGate, BREXIT, President Trump, the NFA boycott … they’re all spurred on by opposition to SJWs, however defined.  There is a great deal of truth in this – Trump managed to define himself by his opposition to ‘political correctness’ (a key part of maintaining the SJW narrative) – although I don’t think it goes as far as Vox suggests.  The people who were the losers in the new world order were the ones who voted against it.  That said, the Left can reasonably be said to have overplayed its hand.  The gulf between the real world and the reality presented by the media, for example, cannot be overstated.  This has the ironic effect that any genuine problems with President Trump will not be taken seriously, as the media has cried ‘racist’ one too many times.\nSuch a problem is understandable.  A person has only a limited amount of credibility – and, when they babble about something they don’t understand (guns, for example) they only lose that credibility faster.  The NFA protests have little credibility because the worst that can happen is the players getting fired … which, given that most of them are multimillionaires, is unlikely to worry them.  Colin Kaepernick is supposed to be worth around $25 million dollars, more money than the average American (white, black, whatever) is likely to see in a dozen lifetimes. Indeed, they really do nothing more than distract Americans – and everyone else – from more important matters.\nThe SJWs do not help their case by demanding complete submission from friends and enemies alike.  They do not leave any room for reasonable disagreement.  This makes it impossible to debate them, let alone question their positions without unleashing a tidal wave of accusations … even if the questioner is a former friend.  The effects of this have been devastating, in everything from comic books to corporate life.  It does not matter, in the end, if the SJWs had a point or not.  Once credibility is lost, it will never be regained.  The tactics they use poison the well.  This is why, in far too many places, we now live in a low-trust society.  Why should anyone trust the media?  Or celebrities?  Or corporations like Facebook and Twitter?  Or random strangers on the internet?\nThis is not an academic question.  The last couple of years have seen all sorts of questions raised about the power wielded by Google, Facebook and Twitter – even Wikipedia.  It doesn’t matter, really, what you think of Vox Day.  Anyone, regardless of their political beliefs, should be concerned about how that power can be misused, particularly if there’s a ‘good’ reason for it.  Once you set a precedent – legal harassment of pro-life groups, for example – someone else can use that precedent to justify their own actions.  As a number of wags have observed, the Left spent eight years turning the US federal government into a weapon – and that weapon fell into the hands of Donald Trump!\nVox Day goes on to describe the effects of ‘SJW Convergence’ in governments, churches and corporations.  In some ways, this is not entirely a new problem.  The larger the organisation, the harder it is to keep focused on what actually matters.  On one hand, the guys at the top lose touch with the ground floor; on the other, it’s hard to believe that the organisation can actually collapse.  I don’t know if Marvel Comics – to use one example – is really on the verge of collapse, but sales have slumped alarmingly over the last few years.  And while the push for ‘diverse’ characters may not be the sole cause of the problem, it has – I think – played a role in the corporation’s decline.\nIt’s hard to say how seriously one should take these assertions.  On one hand, the problems are rarely as cut and dried.  Marvel’s constant revamping of the status quo probably paid a role too.  On the other hand, traditional publishing is in decline because the old-fashioned gatekeepers have been unable to adapt to the changes over the last ten years.  There comes a point where an organisation – Borders, for example – simply cannot survive.  But what cannot be denied is that power can easily be abused and perhaps it would be better to prevent any abuse.\nVox then discusses the ‘typical’ SJW, with extensive reference to his expanded social-sexual hierarchy.  This is, in many ways, the weakest part of the book; on one hand, his portrait of many intensive SJWs is quite accurate, but it doesn’t account for people who are swept into the process because they believe the cause is good or people who want to take advantage of SJW activism for their own ends.  I have, frankly, never placed much credence in the social-sexual hierarchy – people can and do move up and down, either through self-development or a sudden shattering change in their circumstances.\nOne point that bears mentioning is the assertion that SJWs simply cannot accept that they might be wrong.  There’s some truth in that.  But, on the other hand, I’ve noticed that being wrong, or admitting to being wrong, comes with a penalty these days.  There is no such thing as a limited surrender.  A person who loses one argument will often find himself accused of being wrong again and again.  This is a serious problem, for obvious reasons.  Why should anyone concede a point when they will be expected to concede everything?  Being able to accept being wrong requires being able to survive being wrong.\nNext, the book assesses the current state of anti-SJW pushback, from the evolution of GamerGate to the decline and fall of the Hugo Awards.  This section is something of a mixed bag.  On one hand, internet sleuths have done a great deal of good by making it impossible to stick to a single narrative and/or for criminals and rioters to hide from justice.  On the other hand, the section on the Hugo Awards is difficult to follow.  While the whole affair does outline just how far the Hugo Awards have fallen – the concentration on pointless diversity as opposed to good writing, the willingness to rewrite or break the rules to drive out the Sad/Rabid Puppies – it also highlights some other absurdities.  Picking a book called – I kid you not –\nSpace Raptor Butt Invasion\n– looks silly.  It is very easy to argue that Peter F. Hamilton deserves a Hugo, but not Chuck Tingle.  This was something of an own goal.  But, at the same time, the whole affair did illustrate the blatant hypocrisy of the awards.  And, more importantly, just how small the voting population, all sides put together, is, compared to the entirety of fandom.\nAt the end, the book discusses ways to build SJW-free organisations.  This is not an easy task, as one must be prepared for a barrage of negative publicity – or worse – whenever you do something or are seen to do something to upset the SJWs.  In some ways, this is the most important part of the book – and not just for the declared reason.  Competition helps keep organisations honest, rather than allowing themselves to forget their core goal.  The NFL can reasonably be said to have forgotten that its purpose is to entertain people, rather than play politics.  Some of the advice is good, some is bad … although it strikes me that insisting that directors have actual experience before they become directors might be the most practical step anyone could take.  There are certainly ways to allow dissent without letting it turn into emotional blackmail and suchlike.\nOne question the book does not answer, not directly, is simple.  What’s wrong with social justice?  Why should well-meaning SJWs be opposed at all costs?\nThere are essentially three answers to that question.  First, SJWs have no concept of individuality.  A person is defined by their identity (female politician, for example, instead of a politician who happens to be female).  This is made all the more confusing by intersectionality, which suggests that a person who has two separate identities may be oppressed by the interplay of both identities.  Confused, yet?  What this does, in practical terms, is draw lines between people, thus triggering off the ‘Us v. Them’ mentality and, worse, separate people from each other.  By this reasoning, Condoleezza Rice, Will Smith, Barack Obama and Trayvon Martin would all be classed as ‘black,’ rather than as individuals with their own identities.\nWhat makes this worse is that the people who are taken to represent each identity are often the worst of the bunch.\nSecond, SJWs have made us less empathic – not more.\nThe concept of social justice is powered by emotional blackmail – sometimes called ‘weaponised empathy.’  You feel sorry for someone and thus give them an inch, which they use to take a mile. No good deed goes unpunished, as the saying goes. However, people resent having their emotions manipulated, even if it is for the greater good.  The natural response to emotional blackmail is to tune it out and, eventually, learn to ignore it.  As Dave Freer put it:\n“The idea that the cup of sympathy is a finite one, even smaller in hard economic times, is simply beyond [SJW’s] grasp, despite the fact that we see this in practice all the time. Joe calls in to work to say his kid is sick, and he has to take the child to the ER, gets sympathy. People pick up his slack, and the boss cuts him some extra. But even if the kid IS really very sickly, and it’s not just Joe’s excuse for a hangover, it gets used up after a few repetitions. People think Joe is taking unfair advantage, even if he isn’t. They also just get tired of giving. If you’re on the receiving end and all you give back is more demands, more ‘guilting’ your audience into more giving, the faster that’ll happen.”\nPeople can become tired of constantly being told that they’re the bad guys, that they have to do everything from watch their speech, thus limiting rational debate, to take someone’s side automatically because they’re a designated victim.  However, there is a more serious point.\nThe two reasons I mentioned above intersect in several different ways.  One of the most important is that people can lose sympathy for groups, because they’ve been taught to think of people as belonging to their group first and foremost.  The rising tide of anti-immigration sentiment in both America and Europe owes its existence to a combination of bad behaviour and identity politics.  Ironically, the rise of ‘white nationalism’ in the US is a direct result of identity politics.  If every hyphenated-American can have an identity, why can’t white Americans?\nThis poisons the well in quite a few ways.  By pushing for diversity quotas and hires in businesses, SJWs both fuel resentment against the people who benefit from measures like Affirmative Action and directly harms them, because everyone who doesn’t benefit believes that the people who do have an unfair advantage.  This does not do wonders for social harmony.  Indeed, it does the exact opposite.\nWe, as a society, have started to slip into ‘Nag Rage.’  We are sick of being lectured by people who consider themselves our betters.  We are sick of being told what to do by people who don’t really know what they’re talking about.  And we are sick of being told that we have to be nice to people who want to hurt us.  This is fuelling a pushback that – perhaps worst of all – will hurt the people the SJWs claim to be trying to help.  Social Justice has a bad reputation because, above all, it simply doesn’t know when to stop.  And people are sick of falsifying their preferences and pretending to like it.\nI could go on about this for quite some time.  But I’m not going to bother.\nThere are people who will dismiss this book because it is written by Vox Day.  That is unwise.  A person may be widely disliked – and very few people seem to be neutral about Vox Day – but that doesn’t stop them from having a point.  And while you may disagree with his, this book is still worth a read.\nAnd, if you’re interested in how society has started to come to the boil, you could do worse than read this book.",
  "tags": [
    "BookReview",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-24T15:43:00+00:00"
}