{
  "url": "https://voxday.net/2017/10/09/actors-ran-interference-for-weinstein/",
  "scraped_at": "2025-12-19T10:26:57.321524",
  "title": "Actors ran interference for Weinstein",
  "date_display": "October 9, 2017",
  "date_iso": "2017-10-09T12:00:00+00:00",
  "date_from_url": "2017-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The sudden downfall of Harvey Weinstein <a href=\"http://www.informationliberation.com/?id=57475\">is merely the very tip of the Hollywood iceberg</a>. And it’s a really big iceberg of moral sewage and corruption:</p><blockquote><p>In 2004, I was still a fairly new reporter at The New York Times when I got the green light to look into oft-repeated allegations of sexual misconduct by Weinstein. It was believed that many occurred in Europe during festivals and other business trips there.</p><p>I traveled to Rome and tracked down the man who held the plum position of running Miramax Italy. According to multiple accounts, he had no film experience and his real job was to take care of Weinstein’s women needs, among other things.</p><p>As head of Miramax Italy in 2003 and 2004, Fabrizio Lombardo was paid $400,000 for less than a year of employment. He was on the payroll of Miramax and thus the Walt Disney Company, which had bought the indie studio in 1993.</p><p>I had people on the record telling me Lombardo knew nothing about film, and others citing evenings he organized with Russian escorts.</p><p>At the time, he denied that he was on the payroll to help Weinstein with favors. From the story: “Reached in Italy, Mr. Lombardo declined to comment on the circumstances of his leaving Miramax or Ricucci, saying they were legal matters being handled by lawyers. ‘I am very proud of what we achieved at Miramax here in Italy,’ he said of his work for the film company. ‘It cannot be that they hired me because I’m a friend.’”</p><p>I also tracked down a woman in London who had been paid off after an unwanted sexual encounter with Weinstein. She was terrified to speak because of her non-disclosure agreement, but at least we had evidence of a pay-off.</p><p>The story I reported never ran.</p><p>After intense pressure from Weinstein, which included having Matt Damon and Russell Crowe call me directly to vouch for Lombardo and unknown discussions well above my head at the Times, the story was gutted.</p></blockquote><p>Russell Crowe is hardly a surprise, but suddenly Matt Damon doesn’t look like such a good guy, does he? Read the whole thing, there are more details <a href=\"http://www.informationliberation.com/?id=57475\">at the link</a>. There should be no slacking off on the attention given to this issue, as it is a promising opportunity in the cultural war, especially given the way in which Hollywood is used as Satan’s pulpit.</p></div>",
  "content_text": "The sudden downfall of Harvey Weinstein\nis merely the very tip of the Hollywood iceberg\n. And it’s a really big iceberg of moral sewage and corruption:\nIn 2004, I was still a fairly new reporter at The New York Times when I got the green light to look into oft-repeated allegations of sexual misconduct by Weinstein. It was believed that many occurred in Europe during festivals and other business trips there.\nI traveled to Rome and tracked down the man who held the plum position of running Miramax Italy. According to multiple accounts, he had no film experience and his real job was to take care of Weinstein’s women needs, among other things.\nAs head of Miramax Italy in 2003 and 2004, Fabrizio Lombardo was paid $400,000 for less than a year of employment. He was on the payroll of Miramax and thus the Walt Disney Company, which had bought the indie studio in 1993.\nI had people on the record telling me Lombardo knew nothing about film, and others citing evenings he organized with Russian escorts.\nAt the time, he denied that he was on the payroll to help Weinstein with favors. From the story: “Reached in Italy, Mr. Lombardo declined to comment on the circumstances of his leaving Miramax or Ricucci, saying they were legal matters being handled by lawyers. ‘I am very proud of what we achieved at Miramax here in Italy,’ he said of his work for the film company. ‘It cannot be that they hired me because I’m a friend.’”\nI also tracked down a woman in London who had been paid off after an unwanted sexual encounter with Weinstein. She was terrified to speak because of her non-disclosure agreement, but at least we had evidence of a pay-off.\nThe story I reported never ran.\nAfter intense pressure from Weinstein, which included having Matt Damon and Russell Crowe call me directly to vouch for Lombardo and unknown discussions well above my head at the Times, the story was gutted.\nRussell Crowe is hardly a surprise, but suddenly Matt Damon doesn’t look like such a good guy, does he? Read the whole thing, there are more details\nat the link\n. There should be no slacking off on the attention given to this issue, as it is a promising opportunity in the cultural war, especially given the way in which Hollywood is used as Satan’s pulpit.",
  "tags": [
    "film",
    "freakshow",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-09T11:00:00+00:00"
}