{
  "url": "https://voxday.net/2017/10/30/alt%e2%98%85hero-press-release/",
  "scraped_at": "2025-12-19T10:29:39.280276",
  "title": "Alt★Hero press release",
  "date_display": "October 30, 2017",
  "date_iso": "2017-10-30T12:08:00+00:00",
  "date_from_url": "2017-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This was sent out to over 200 journalists. I very much doubt any of them will actually do anything with it, but it might inspire an angry tweet or two like the last one did.</p><blockquote><p><b>Alt★Hero Celebrates Record Crowdfunding</b></p><p>After reaching its initial funding goal in only four hours, a new right-wing comics series, Alt★Hero, concluded its historic crowdfunding campaign by reaching the $245,000 mark. 2,190 backers signed on to help the alternative superhero series wage cultural war on the social justice-converged comic duopoly of Marvel and DC Comics.</p><p>Alt★Hero is being written by prolific Marvel and DC Comics veteran writer Chuck Dixon and six-time Hugo Award Finalist Vox Day. It will be published by Castalia House, Finland’s leading independent publisher.</p><p>The series is the creation of game designer Day, who is best known for being a member of GamerGate and publishing the political philosophy bestsellers <i>SJWs Always Lie</i> and <i>SJWs Always Double Down</i>. Alt★Hero features unconventional villains such as Captain Europa of the Global Justice Initiative and controversial heroes such as Michael Martel, a vigilante who drops off criminal undocumented immigrants at the local Immigration and Customs Enforcement office, and Rebel, an Southern girl whose superhero outfit incorporates the Confederate battle flag.</p><p>The breakout star of the campaign, however, has been Dynamique, a chain-smoking French model whose indifference to current events is only surpassed by her pragmatism.</p><p>“This is only the beginning,” said Alt★Hero creator Vox Day, who is writing six volumes of the series as well as co-designing the role-playing game. “Fans and retailers alike despise how Marvel and DC are trashing characters they have cherished for generations. That is why it’s not going to be too long before you’re going to start seeing Alt★Hero games, and eventually, movies.”</p><p>“I have an entire year’s worth of continuity funded to build a cast of characters in a brand new universe. Very inspiring, Very exciting,” said industry legend Chuck Dixon, the longtime <i>Batman </i>writer and co-creator of Bane, who is writing the first six volumes of the Alt★Hero series <i>Avalon </i>as well as a standalone novel entitled <i>Avalon: Vendetta</i>. “The city of Avalon is already a very real place in my mind. I think readers are going to enjoy visiting.”</p><p>“Astonishing demand,” added journalist Mike Cernovich on Twitter in response to the news that Alt★Hero had shattered the previous record for a new comic being crowdfunded.</p><p>In reaching 978 percent of its original $25,000 goal, the Alt★Hero crowdfunding campaign was the most successful in history for a new comics launch, and is the 22nd most-funded of the 10,553 historic comics-related crowdfunding campaigns.</p></blockquote><p>Thanks again to all of you who made this possible. It really is just the beginning of a cultural revolution.</p><p>UPDATE: Who said there was no media coverage? <i>The Springfield Daily</i> has the honor of being the first mainstream media organization <a href=\"https://springfielddaily.com/entertainment/alt{7a570d310fd04ee61246b4469264ca1004967a98be813fe63aaa5d2057987204}E2{7a570d310fd04ee61246b4469264ca1004967a98be813fe63aaa5d2057987204}98{7a570d310fd04ee61246b4469264ca1004967a98be813fe63aaa5d2057987204}85hero-celebrates-record-crowdfunding/\">to cover Alt★Hero</a>.</p></div>",
  "content_text": "This was sent out to over 200 journalists. I very much doubt any of them will actually do anything with it, but it might inspire an angry tweet or two like the last one did.\nAlt★Hero Celebrates Record Crowdfunding\nAfter reaching its initial funding goal in only four hours, a new right-wing comics series, Alt★Hero, concluded its historic crowdfunding campaign by reaching the $245,000 mark. 2,190 backers signed on to help the alternative superhero series wage cultural war on the social justice-converged comic duopoly of Marvel and DC Comics.\nAlt★Hero is being written by prolific Marvel and DC Comics veteran writer Chuck Dixon and six-time Hugo Award Finalist Vox Day. It will be published by Castalia House, Finland’s leading independent publisher.\nThe series is the creation of game designer Day, who is best known for being a member of GamerGate and publishing the political philosophy bestsellers\nSJWs Always Lie\nand\nSJWs Always Double Down\n. Alt★Hero features unconventional villains such as Captain Europa of the Global Justice Initiative and controversial heroes such as Michael Martel, a vigilante who drops off criminal undocumented immigrants at the local Immigration and Customs Enforcement office, and Rebel, an Southern girl whose superhero outfit incorporates the Confederate battle flag.\nThe breakout star of the campaign, however, has been Dynamique, a chain-smoking French model whose indifference to current events is only surpassed by her pragmatism.\n“This is only the beginning,” said Alt★Hero creator Vox Day, who is writing six volumes of the series as well as co-designing the role-playing game. “Fans and retailers alike despise how Marvel and DC are trashing characters they have cherished for generations. That is why it’s not going to be too long before you’re going to start seeing Alt★Hero games, and eventually, movies.”\n“I have an entire year’s worth of continuity funded to build a cast of characters in a brand new universe. Very inspiring, Very exciting,” said industry legend Chuck Dixon, the longtime\nBatman\nwriter and co-creator of Bane, who is writing the first six volumes of the Alt★Hero series\nAvalon\nas well as a standalone novel entitled\nAvalon: Vendetta\n. “The city of Avalon is already a very real place in my mind. I think readers are going to enjoy visiting.”\n“Astonishing demand,” added journalist Mike Cernovich on Twitter in response to the news that Alt★Hero had shattered the previous record for a new comic being crowdfunded.\nIn reaching 978 percent of its original $25,000 goal, the Alt★Hero crowdfunding campaign was the most successful in history for a new comics launch, and is the 22nd most-funded of the 10,553 historic comics-related crowdfunding campaigns.\nThanks again to all of you who made this possible. It really is just the beginning of a cultural revolution.\nUPDATE: Who said there was no media coverage?\nThe Springfield Daily\nhas the honor of being the first mainstream media organization\nto cover Alt★Hero\n.",
  "tags": [
    "Alt-Hero",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-30T12:08:00+00:00"
}