{
  "url": "https://voxday.net/2017/10/27/alt%e2%98%85hero-vendetta/",
  "scraped_at": "2025-12-19T10:29:16.610601",
  "title": "Alt★Hero: Vendetta",
  "date_display": "October 27, 2017",
  "date_iso": "2017-10-27T14:43:00+00:00",
  "date_from_url": "2017-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I used to work at a Conservatism Inc. institution with a $60 million/year budget, the ~$170k @Voxday Alt★Hero project will be more impactful than the past ten years of the aforementioned institution’s activities combined.</i><br>– Nick at Instapundit</br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/althero/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"642\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DNJBW1PWkAEAW2N.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"642\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DNJBW1PWkAEAW2N.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20642%22%3E%3C/svg%3E\"/></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><p>The image above is fan art contributed by a freelance pro who is supporting the project. If you’d like to see more of the real story, we’ve added another draft page at <a href=\"https://freestartr.com/project/althero/\">the Alt★Hero campaign</a>, which has reached its penultimate day. And for those who may happen to be under the mistaken impression that I am laying it on a bit too heavily, please note that the threats being uttered by Captain Europa there are <i>a direct quote</i> of the Metropolitan Police in London via their twitter account.</p><p>The big news promised earlier is this: <b>Chuck Dixon has agreed to write an Alt★Hero novel! </b>Entitled <i>Vendetta</i>, the novel will be set in the city of Avalon and published by Castalia House in ebook, paperback, and audiobook formats. We’ve added two rewards so you can buy it today in either ebook or paperback format (as part of the trilogy of novels that have been announced) by backing the campaign. Vendetta is a new character he has created who appears in <i>Avalon </i>volume I and will be the protagonist of his first novel.</p><p>Also, due to more than a dozen requests for them, we have added two conditional Rewards. Chuck Dixon and Castalia House will commit to producing volumes IV, V, and VI of the Alt★Hero series <i>Avalon </i>if the campaign reaches the $185k mark, and we will provide the digital editions of those three volumes to all the appropriate backer levels. $23k in two days is a little ambitious, but the general consensus seems to be that it is reachable if people have the option of backing the 4th omnibus print editions.</p><p><b>$5.00</b><b><br> </br></b><b>Novel Ebook #3</b><br>This is to receive a copy of Alt★Hero novel #3, <i>Vendetta</i>, by Chuck Dixon, in DRM-free EPUB and MOBI formats.</br></p><p><b>$49.00</b><b><br> </br></b><b>Paperback Trilogy</b><br>This is to receive three paperbacks consisting of Alt★Hero novels #1 and 2 by Jon Del Arroz and Vox Day and Alt★Hero novel #3, <i>Vendetta</i>, by Chuck Dixon. The paperbacks will be 5.5 x 8.5 and 200+ pages each. Worldwide shipping is included.</br></p><p><b>$30.00</b><br><b>Add-On: Paperback #4</b><br>This is to receive the paperback omnibus that includes volumes IV, V, and VI of the Alt★Hero series <i>Avalon</i>,  written by Chuck Dixon. You will also receive the digital editions of  the first nine volumes if you are not already receiving them. Worldwide  shipping is included. NOTE: This Reward is conditional. If the campaign  does not reach $185,000, this Reward will not be delivered and backers  will not be charged for it.</br></br></p><p><b>$65.00</b><br><b>Add-On: Hardcover #4</b><br>This is to receive the hardcover omnibus that includes volumes IV, V, and VI of the Alt★Hero series <i>Avalon</i>,  written by Chuck Dixon. You will also receive the digital editions of  the first nine volumes if you are not already receiving them. This will  be a collector’s item with a cover that will only be made  available to backers; it will not be the cover that goes into  distribution. Worldwide shipping is included. NOTE: This Reward is  conditional. If the campaign does not reach $185,000, this Reward will  not be delivered and backers will not be charged for it.</br></br></p><p>By the way, one important aspect of supporting the #4 options is that this will create the material for SIX additional small comics, bringing the total we’ll be releasing to 24. That’s the equivalent of a full year of two comics series, which should help us considerably in kicking down the door of the retail channel.</p><p>UPDATE: Only <strike>$19k</strike> $<strike>14k</strike> 7k to go with 24 hours left.</p></div>",
  "content_text": "I used to work at a Conservatism Inc. institution with a $60 million/year budget, the ~$170k @Voxday Alt★Hero project will be more impactful than the past ten years of the aforementioned institution’s activities combined.\n– Nick at Instapundit\nThe image above is fan art contributed by a freelance pro who is supporting the project. If you’d like to see more of the real story, we’ve added another draft page at\nthe Alt★Hero campaign\n, which has reached its penultimate day. And for those who may happen to be under the mistaken impression that I am laying it on a bit too heavily, please note that the threats being uttered by Captain Europa there are\na direct quote\nof the Metropolitan Police in London via their twitter account.\nThe big news promised earlier is this:\nChuck Dixon has agreed to write an Alt★Hero novel!\nEntitled\nVendetta\n, the novel will be set in the city of Avalon and published by Castalia House in ebook, paperback, and audiobook formats. We’ve added two rewards so you can buy it today in either ebook or paperback format (as part of the trilogy of novels that have been announced) by backing the campaign. Vendetta is a new character he has created who appears in\nAvalon\nvolume I and will be the protagonist of his first novel.\nAlso, due to more than a dozen requests for them, we have added two conditional Rewards. Chuck Dixon and Castalia House will commit to producing volumes IV, V, and VI of the Alt★Hero series\nAvalon\nif the campaign reaches the $185k mark, and we will provide the digital editions of those three volumes to all the appropriate backer levels. $23k in two days is a little ambitious, but the general consensus seems to be that it is reachable if people have the option of backing the 4th omnibus print editions.\n$5.00\nNovel Ebook #3\nThis is to receive a copy of Alt★Hero novel #3,\nVendetta\n, by Chuck Dixon, in DRM-free EPUB and MOBI formats.\n$49.00\nPaperback Trilogy\nThis is to receive three paperbacks consisting of Alt★Hero novels #1 and 2 by Jon Del Arroz and Vox Day and Alt★Hero novel #3,\nVendetta\n, by Chuck Dixon. The paperbacks will be 5.5 x 8.5 and 200+ pages each. Worldwide shipping is included.\n$30.00\nAdd-On: Paperback #4\nThis is to receive the paperback omnibus that includes volumes IV, V, and VI of the Alt★Hero series\nAvalon\n,  written by Chuck Dixon. You will also receive the digital editions of  the first nine volumes if you are not already receiving them. Worldwide  shipping is included. NOTE: This Reward is conditional. If the campaign  does not reach $185,000, this Reward will not be delivered and backers  will not be charged for it.\n$65.00\nAdd-On: Hardcover #4\nThis is to receive the hardcover omnibus that includes volumes IV, V, and VI of the Alt★Hero series\nAvalon\n,  written by Chuck Dixon. You will also receive the digital editions of  the first nine volumes if you are not already receiving them. This will  be a collector’s item with a cover that will only be made  available to backers; it will not be the cover that goes into  distribution. Worldwide shipping is included. NOTE: This Reward is  conditional. If the campaign does not reach $185,000, this Reward will  not be delivered and backers will not be charged for it.\nBy the way, one important aspect of supporting the #4 options is that this will create the material for SIX additional small comics, bringing the total we’ll be releasing to 24. That’s the equivalent of a full year of two comics series, which should help us considerably in kicking down the door of the retail channel.\nUPDATE: Only\n$19k\n$\n14k\n7k to go with 24 hours left.",
  "tags": [
    "Alt-Hero",
    "MemeWars"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-27T13:43:00+00:00"
}