{
  "url": "https://voxday.net/2017/10/05/buzzfeed-and-the-stolen-emails/",
  "scraped_at": "2025-12-19T10:26:30.991600",
  "title": "Buzzfeed and the stolen emails",
  "date_display": "October 5, 2017",
  "date_iso": "2017-10-05T22:09:00+00:00",
  "date_from_url": "2017-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Buzzfeed apparently got their hands on <a href=\"https://www.buzzfeed.com/josephbernstein/heres-how-breitbart-and-milo-smuggled-white-nationalism?utm_term=.ibyzMyaBW#.fnGkjlewL\">some stolen emails of Milo’</a>s, a few of which were his exchanges with me. As far as I’m concerned, that’s the most noteworthy aspect of today’s “expose” on Milo.</p><blockquote><p>A year and a half ago, Milo Yiannopoulos set himself a difficult task: to define the alt-right. It was five months before Hillary Clinton named the alt-right in a campaign speech, 10 months before the alt-right’s great hope became president, and 17 months before Charlottesville clinched the alt-right as a stalking horse for violent white nationalism. The movement had just begun its explosive emergence into the country’s politics and culture.</p><p>At the time, Yiannopoulos, who would later describe himself as a “fellow traveler” of the alt-right, was the tech editor of Breitbart. In summer 2015, after spending a year gathering momentum through GamerGate — the opening salvo of the new culture wars — he convinced Breitbart upper management to give him his own section. And for four months, he helped Bannon wage what the Breitbart boss called in emails to staff “#war.” It was a war, fought story by story, against the perceived forces of liberal activism on every conceivable battleground in American life.</p><p>Yiannopoulos was a useful soldier whose very public identity as a gay man (one who has now married a black man) helped defend him, his anti-political correctness crusade, and his employer from charges of bigotry.</p><p>But now Yiannopoulos had a more complicated fight on his hands. The left — and worse, some on the right — had started to condemn the new conservative energy as reactionary and racist. Yiannopoulos had to take back “alt-right,” to redefine for Breitbart’s audience a poorly understood, leaderless movement, parts of which had already started to resist the term itself….</p><p>Over the next three days, Yiannopoulos passed the article back to Yarvin and the white nationalist Saucier, the latter of whom gave line-by-line annotations. He also sent it to Vox Day, a writer who was expelled from the board of the Science Fiction and Fantasy Writers of America for calling a black writer an “ignorant savage,” and to Alex Marlow, the editor of Breitbart.</p><p>“Solid, fair, and fairly comprehensive,” Vox Day responded, with a few suggestions.</p><p>“Most of it is great but I don’t want to rush a major long form piece like this,” Marlow wrote back. “A few people will need to weigh in since it deals heavily with race.”</p></blockquote><p>Lawsy me! Tell me if you can see why I find the reference to me to be absolutely hilarious. Also, in case you haven’t been around here since 2013, the quote attributed to me is both incomplete and incorrect. I actually called SFWA’s affirmative action pet NK Jemisin, the columnist for the <i>The New York Times Book Review</i> and one of only three two-straight winners of the Hugo Award for Best Novel in science fiction history, “an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine.”</p><p>Just to be clear.</p></div>",
  "content_text": "Buzzfeed apparently got their hands on\nsome stolen emails of Milo’\ns, a few of which were his exchanges with me. As far as I’m concerned, that’s the most noteworthy aspect of today’s “expose” on Milo.\nA year and a half ago, Milo Yiannopoulos set himself a difficult task: to define the alt-right. It was five months before Hillary Clinton named the alt-right in a campaign speech, 10 months before the alt-right’s great hope became president, and 17 months before Charlottesville clinched the alt-right as a stalking horse for violent white nationalism. The movement had just begun its explosive emergence into the country’s politics and culture.\nAt the time, Yiannopoulos, who would later describe himself as a “fellow traveler” of the alt-right, was the tech editor of Breitbart. In summer 2015, after spending a year gathering momentum through GamerGate — the opening salvo of the new culture wars — he convinced Breitbart upper management to give him his own section. And for four months, he helped Bannon wage what the Breitbart boss called in emails to staff “#war.” It was a war, fought story by story, against the perceived forces of liberal activism on every conceivable battleground in American life.\nYiannopoulos was a useful soldier whose very public identity as a gay man (one who has now married a black man) helped defend him, his anti-political correctness crusade, and his employer from charges of bigotry.\nBut now Yiannopoulos had a more complicated fight on his hands. The left — and worse, some on the right — had started to condemn the new conservative energy as reactionary and racist. Yiannopoulos had to take back “alt-right,” to redefine for Breitbart’s audience a poorly understood, leaderless movement, parts of which had already started to resist the term itself….\nOver the next three days, Yiannopoulos passed the article back to Yarvin and the white nationalist Saucier, the latter of whom gave line-by-line annotations. He also sent it to Vox Day, a writer who was expelled from the board of the Science Fiction and Fantasy Writers of America for calling a black writer an “ignorant savage,” and to Alex Marlow, the editor of Breitbart.\n“Solid, fair, and fairly comprehensive,” Vox Day responded, with a few suggestions.\n“Most of it is great but I don’t want to rush a major long form piece like this,” Marlow wrote back. “A few people will need to weigh in since it deals heavily with race.”\nLawsy me! Tell me if you can see why I find the reference to me to be absolutely hilarious. Also, in case you haven’t been around here since 2013, the quote attributed to me is both incomplete and incorrect. I actually called SFWA’s affirmative action pet NK Jemisin, the columnist for the\nThe New York Times Book Review\nand one of only three two-straight winners of the Hugo Award for Best Novel in science fiction history, “an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine.”\nJust to be clear.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-05T21:09:00+00:00"
}