{
  "url": "https://voxday.net/2017/10/03/deception-at-mandalay-bay/",
  "scraped_at": "2025-12-19T10:26:10.494322",
  "title": "Deception at Mandalay Bay?",
  "date_display": "October 3, 2017",
  "date_iso": "2017-10-03T00:44:00+00:00",
  "date_from_url": "2017-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I saw the live reports on European TV. As a result of those early live reports, I remain very, very dubious that a single shooter, shooting from 300 yards away, caused 586 casualties, 59 of them fatal, in that amount of time. Even allowing for the elevation and the large size of the crowd, it strikes me as highly improbable (unless many of the injuries are related to trampling rather than shooting, that is plausible). At any rate, this independent journalist <a href=\"http://82.221.129.208/.zy2.html\">is not buying the Official Story</a>:</p><blockquote><p>SHOOTER COULD NOT HAVE BEEN AT MANDALAY BAY</p><p>The gunfire is too loud over the concert, it was happening at the concert . Windows are easy to kick out later.</p><p>HERE IS THE KEY VIDEO THAT DESTROYS THE LIE. This is just a file on this site, which you can right click and save. This video is evidence, there is no way the official story holds up against this. The gunfire was simply too loud and too local in reference to the concert for the official story to hold.</p><p>THE MOST IMPORTANT THINGS –<br>1. If it was originating 1500 feet away at Mandalay Bay, it was not close enough to totally blast over the concert loud enough to cause the performers, who wear monitor equipment to block all sound, to stop playing. The concert was LOUD when the shooting happened. You simply can’t outdo a concert from that far away, no one would have heard it over the music, especially the performers, who have equipment that is designed to block the sound of the concert and let them hear only the sound of their instruments, as they are played in reference to the other instruments. The failure of this system is what did Mariah Carey in on New Years, when you are playing that “big” you have to be directly piped to the mixing board with all other sources of sound blocked. This would have prevented the performers from hearing anything. Why did they stop? ANSWER: Gunshots from above them on the same stage would have been loud enough. What happens on stage in the video is a supreme bust of the official lie.</br></p><p>POINT TWO: Audio recording equipment (even on a camcorder) automatically sets the level of the audio to optimal. The concert was LOUD, it is obvious because the crowd cannot be heard when the music is playing. Then gunfire clearly is louder than the concert, even though according to the official story it originated 1500 feet away. The automatic level control in the audio recorder proves the gunfire was simply too loud in relation to the music to have come from Mandalay Bay, it had to have originated above the speakers. That is the only way the automatic level control circuit would not have had the recording level choked back so far that the gunfire would not be heard. The recording should not have had the sound of gunfire so prominent, IF it even managed to record the sound of the gun at all. Obviously after the music cut the recorder would pick up the gunfire from that distance because it would automatically turn the record volume up.</p><p>POINT THREE:</p><p>Watch the video. The stage crew cuts everything to black, and then takes the stage lighting, points it directly out at the crowd, and turns it back on to illuminate the crowd. The shooting does not resume until this process is complete. This was a deliberate act that no one would have thought of off the cuff unless it was planned ahead of time. Without a doubt, someone on the stage crew was involved in this shooting. Interesting it is that the concert was called the “Route 91 harvest” and took place on route 91!</p><p>Here is what I think happened. The shooters were actually situated above the stage. The windows on Mandalay Bay were kicked out for the story line. I have a video that shows it all unfold. I do not think the singer knew what was going on. I believe it was people planted in the crew that did this.</p></blockquote><p>Anyhow, my position is the same as it always is. I don’t know what actually happened. But over the years, I have learned that the truth is seldom all that closely related to the Official Story. The way in which the crowd was illuminated from the stage AFTER the shooting began is particularly troubling. What sort of idiot would ever do that? And who was responsible for it?</p></div>",
  "content_text": "I saw the live reports on European TV. As a result of those early live reports, I remain very, very dubious that a single shooter, shooting from 300 yards away, caused 586 casualties, 59 of them fatal, in that amount of time. Even allowing for the elevation and the large size of the crowd, it strikes me as highly improbable (unless many of the injuries are related to trampling rather than shooting, that is plausible). At any rate, this independent journalist\nis not buying the Official Story\n:\nSHOOTER COULD NOT HAVE BEEN AT MANDALAY BAY\nThe gunfire is too loud over the concert, it was happening at the concert . Windows are easy to kick out later.\nHERE IS THE KEY VIDEO THAT DESTROYS THE LIE. This is just a file on this site, which you can right click and save. This video is evidence, there is no way the official story holds up against this. The gunfire was simply too loud and too local in reference to the concert for the official story to hold.\nTHE MOST IMPORTANT THINGS –\n1. If it was originating 1500 feet away at Mandalay Bay, it was not close enough to totally blast over the concert loud enough to cause the performers, who wear monitor equipment to block all sound, to stop playing. The concert was LOUD when the shooting happened. You simply can’t outdo a concert from that far away, no one would have heard it over the music, especially the performers, who have equipment that is designed to block the sound of the concert and let them hear only the sound of their instruments, as they are played in reference to the other instruments. The failure of this system is what did Mariah Carey in on New Years, when you are playing that “big” you have to be directly piped to the mixing board with all other sources of sound blocked. This would have prevented the performers from hearing anything. Why did they stop? ANSWER: Gunshots from above them on the same stage would have been loud enough. What happens on stage in the video is a supreme bust of the official lie.\nPOINT TWO: Audio recording equipment (even on a camcorder) automatically sets the level of the audio to optimal. The concert was LOUD, it is obvious because the crowd cannot be heard when the music is playing. Then gunfire clearly is louder than the concert, even though according to the official story it originated 1500 feet away. The automatic level control in the audio recorder proves the gunfire was simply too loud in relation to the music to have come from Mandalay Bay, it had to have originated above the speakers. That is the only way the automatic level control circuit would not have had the recording level choked back so far that the gunfire would not be heard. The recording should not have had the sound of gunfire so prominent, IF it even managed to record the sound of the gun at all. Obviously after the music cut the recorder would pick up the gunfire from that distance because it would automatically turn the record volume up.\nPOINT THREE:\nWatch the video. The stage crew cuts everything to black, and then takes the stage lighting, points it directly out at the crowd, and turns it back on to illuminate the crowd. The shooting does not resume until this process is complete. This was a deliberate act that no one would have thought of off the cuff unless it was planned ahead of time. Without a doubt, someone on the stage crew was involved in this shooting. Interesting it is that the concert was called the “Route 91 harvest” and took place on route 91!\nHere is what I think happened. The shooters were actually situated above the stage. The windows on Mandalay Bay were kicked out for the story line. I have a video that shows it all unfold. I do not think the singer knew what was going on. I believe it was people planted in the crew that did this.\nAnyhow, my position is the same as it always is. I don’t know what actually happened. But over the years, I have learned that the truth is seldom all that closely related to the Official Story. The way in which the crowd was illuminated from the stage AFTER the shooting began is particularly troubling. What sort of idiot would ever do that? And who was responsible for it?",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-02T23:44:00+00:00"
}