{
  "url": "https://voxday.net/2017/10/18/dicky-spencers-dance-party/",
  "scraped_at": "2025-12-19T10:28:00.059825",
  "title": "Dicky Spencer’s Dance Party",
  "date_display": "October 18, 2017",
  "date_iso": "2017-10-18T09:29:00+00:00",
  "date_from_url": "2017-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Fake Right are complete phonies <a href=\"https://www.channel4.com/news/neo-nazi-national-front-organiser-quits-movement-comes-out-as-gay-kevin-wilshaw-jewish-heritage\">and they always have been</a>:</p><blockquote><p>After a lifetime of involvement with the far-right Kevin Wilshaw announces on Channel 4 News that he is leaving the movement – at the same time publicly coming out as gay. The well known National Front organiser in the 1980s was still active in white supremacist groups earlier this year – including speaking at events. But tonight on Channel 4 News he explains for the very first time why he is publicly disavowing the movement – sharing his secrets, explaining how he was both a Neo-Nazi and of Jewish heritage.</p><p>“You have other members leading National Front who are overtly gay…. “I want to do some damage as well, not to ordinary people but the people who are propagating this kind of rubbish – want to hurt them, show what it’s like for those who are living a lie and be on the receiving end of this type of propaganda, I want to hurt them.”</p></blockquote><p>We should have known this, on the principle that a) SJWs always project and b) SJWs always seek to infiltrate.</p><p>I remember being surprised when I interviewed Richard Spencer and discovered him to be to the Left of the entire Brainstorm community and surprisingly vague about anything that was policy related. This was the great extremist, the outlaw intellectual? My initial assumption was that he simply had poor judgment and hadn’t really formulated his political philosophy, especially when he went from one public relations debacle to the next without ever managing to accomplish anything substantial or do anything useful.</p><p>But it wasn’t until I discovered that Spencer had opposed Brexit and supported the European Union that I began to conclude that he, and at least a portion of what I called the Alt White, were not even of the ideological Right at all. I soon got confirmation from Greg Johnson, Andrew Anglin, and their fellow travellers, as they tried to simultaneously – and dishonestly – argue that a) they were the most extreme right of the right-wing, b) any criticism of them was “punching right”, and c) the terms of left and right were outdated and meaningless.</p><p>I don’t know about you, but anyone who has read SJWADD will recognize that form of rhetorical sophistry. It is ambiguity.</p><p><i>Arguments such as the following depend upon ambiguity. <b>‘Those learn who know: for it is those who know their letters who learn the letters dictated to them’.</b> For to ‘learn’ is ambiguous; it signifies both ‘to understand’ by the use of knowledge, and also ‘to acquire knowledge’. </i></p><p>And when I had the opportunity to see how Spencer had treated his authors, how he had not paid them or even reported book sales to them for literal years, how he had gone dark rather than respond to repeated telephone calls and emails, I understood that his character was very, very different than he sought to portray it to be.</p><p>Once I saw that the Fake Right was not only sophistical and dishonest, but was using its rhetoric in the interest of  pushing its knowing and intentional falsehoods, it became obvious why they were constantly accusing me and other married men of various non-Jewish backgrounds, of being gay and being Jewish. It was, of course, because they were projecting.</p><p>There is nothing right about the Fake Right in <i>any </i>sense of the term. They are not of the ideological Right. They are not straight; notice how few of them have wives, girlfriends, or children. And it is increasingly questionable how many of them are even white despite their clownish proclamations about white supremacy. They are no more genuine than the swastikas that so often appear on synagogue walls, the nooses that regularly appear on college campuses, and the date rapes that so often occur to outspoken feminists.</p><p>Don’t be fooled. There is no truth in them. The Fake Right is <a href=\"http://www.thepinkswastika.com/\">The Pink Swastika</a> 2: Iron Menorah.</p></div>",
  "content_text": "The Fake Right are complete phonies\nand they always have been\n:\nAfter a lifetime of involvement with the far-right Kevin Wilshaw announces on Channel 4 News that he is leaving the movement – at the same time publicly coming out as gay. The well known National Front organiser in the 1980s was still active in white supremacist groups earlier this year – including speaking at events. But tonight on Channel 4 News he explains for the very first time why he is publicly disavowing the movement – sharing his secrets, explaining how he was both a Neo-Nazi and of Jewish heritage.\n“You have other members leading National Front who are overtly gay…. “I want to do some damage as well, not to ordinary people but the people who are propagating this kind of rubbish – want to hurt them, show what it’s like for those who are living a lie and be on the receiving end of this type of propaganda, I want to hurt them.”\nWe should have known this, on the principle that a) SJWs always project and b) SJWs always seek to infiltrate.\nI remember being surprised when I interviewed Richard Spencer and discovered him to be to the Left of the entire Brainstorm community and surprisingly vague about anything that was policy related. This was the great extremist, the outlaw intellectual? My initial assumption was that he simply had poor judgment and hadn’t really formulated his political philosophy, especially when he went from one public relations debacle to the next without ever managing to accomplish anything substantial or do anything useful.\nBut it wasn’t until I discovered that Spencer had opposed Brexit and supported the European Union that I began to conclude that he, and at least a portion of what I called the Alt White, were not even of the ideological Right at all. I soon got confirmation from Greg Johnson, Andrew Anglin, and their fellow travellers, as they tried to simultaneously – and dishonestly – argue that a) they were the most extreme right of the right-wing, b) any criticism of them was “punching right”, and c) the terms of left and right were outdated and meaningless.\nI don’t know about you, but anyone who has read SJWADD will recognize that form of rhetorical sophistry. It is ambiguity.\nArguments such as the following depend upon ambiguity.\n‘Those learn who know: for it is those who know their letters who learn the letters dictated to them’.\nFor to ‘learn’ is ambiguous; it signifies both ‘to understand’ by the use of knowledge, and also ‘to acquire knowledge’.\nAnd when I had the opportunity to see how Spencer had treated his authors, how he had not paid them or even reported book sales to them for literal years, how he had gone dark rather than respond to repeated telephone calls and emails, I understood that his character was very, very different than he sought to portray it to be.\nOnce I saw that the Fake Right was not only sophistical and dishonest, but was using its rhetoric in the interest of  pushing its knowing and intentional falsehoods, it became obvious why they were constantly accusing me and other married men of various non-Jewish backgrounds, of being gay and being Jewish. It was, of course, because they were projecting.\nThere is nothing right about the Fake Right in\nany\nsense of the term. They are not of the ideological Right. They are not straight; notice how few of them have wives, girlfriends, or children. And it is increasingly questionable how many of them are even white despite their clownish proclamations about white supremacy. They are no more genuine than the swastikas that so often appear on synagogue walls, the nooses that regularly appear on college campuses, and the date rapes that so often occur to outspoken feminists.\nDon’t be fooled. There is no truth in them. The Fake Right is\nThe Pink Swastika\n2: Iron Menorah.",
  "tags": [
    "#AltRetard",
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-18T08:29:00+00:00"
}