{
  "url": "https://voxday.net/2017/10/13/if-youre-worried-about-story/",
  "scraped_at": "2025-12-19T10:27:26.053653",
  "title": "If you’re worried about story",
  "date_display": "October 13, 2017",
  "date_iso": "2017-10-13T09:36:00+00:00",
  "date_from_url": "2017-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the concerns that keeps being raised about Alt★Hero by people who are observably unfamiliar with the fact that I am a novelist is that the comic is going to be nothing more than anti-SJW preaching and attempts to trigger SJWs. But this is nothing more than confusing the advertisement with the product.</p><p>But consider the following review for one of my more recent novels, <i><b><a href=\"https://www.amazon.com/Skulls-Arts-Dark-Light-Book-ebook/dp/B01N2T8DHK\">A Sea of Skulls</a></b></i>:</p><blockquote><p><b>Better then GOT</b></p><p>I read a lot of fiction. Vox’s writing skill is superb. He takes no shortcuts with weaving his tale. Explores many different approaches in his books. In throne of bones he spans the life of one character in one chapter. In another he tries his hand a describing a battle from many many different soldiers views as they fight and die. In sea of skulls he pulls back a bit on experimentation and instead explores each major race in his universe from their perspective. Each perspective is unique and masterfully done.</p></blockquote><p>Now, you may well be dubious about the possibility that my <i>Arts of Dark and Light</i> series is genuinely better than <i>A Song of Ice and Fire,</i> especially if you haven’t read <i>A Dance with Dragons</i>. After all, HBO hasn’t even made a television series about it yet. But if you look at the reviews of both books over time, you’ll see how the initial comparisons to Martin begin to fade away and are replaced by comparisons – admittedly, unfavorable – to Tolkien.</p><p>This is not indicative of a writer who is unable to tell a story, create memorable characters, or is prone to sacrificing either in the interest of delivering dogmatic, heavy-handed lectures. I don’t believe in either cheap heroism or cheap villainry, as both are the product of mediocre writers with insufficient imagination. While I would consider Captain Europa to be a villain and the Global Justice Initiative to be evil, he most certainly does not.</p><p>Nor do I believe that my favored side must always win. After all, the ultimate heroism is self-sacrificial, and I am not even remotely hesistant to kill off even my favorite characters if the story’s logic demands it. (The fact that this also helps solve the fatal perspective-character-inflation problem is merely a fortunate side-effect.) Nor do I ever indulge in the storytelling fraud that is so often present in Martin, Marvel, and DC stories; there are few literary devices for which I have more contempt than “bringing back” an obviously dead character. It’s not only lame and fake drama, it is unnecessary for the sufficiently skilled writer.</p><p>Here’s the thing: EVERYTHING triggers SJWs. It’s not as if we have to go even remotely out of our way to set them off. We can focus 100 percent on telling excellent stories and we probably won’t even need to go back and add anything in order to have them REEEEEEing at frequencies higher than have ever been recorded at the Metropolitian opera. Not that I won’t insert the occasional shiv and twist, out of nothing more than the pure joy of it, but we simply don’t have to. In these forsaken days of the Forgettable Squirrel She-Thing, just having pretty women with attractive bodies is more than enough.</p><p>So, if you are genuinely concerned about the storytelling aspects of the new series, you can either read my novels or you can simply wait to see what sort of stories we deliver in Alt★Hero. As for me, all I can say is that I am enjoying the challenge of raising my storytelling game in order to keep pace with the legendary Chuck Dixon.</p><p>And that, I suspect, is the real concern of the comics SJWs. They’re not at all concerned about our prospective failure. They’re concerned about our prospective <i>success</i>.</p></div>",
  "content_text": "One of the concerns that keeps being raised about Alt★Hero by people who are observably unfamiliar with the fact that I am a novelist is that the comic is going to be nothing more than anti-SJW preaching and attempts to trigger SJWs. But this is nothing more than confusing the advertisement with the product.\nBut consider the following review for one of my more recent novels,\nA Sea of Skulls\n:\nBetter then GOT\nI read a lot of fiction. Vox’s writing skill is superb. He takes no shortcuts with weaving his tale. Explores many different approaches in his books. In throne of bones he spans the life of one character in one chapter. In another he tries his hand a describing a battle from many many different soldiers views as they fight and die. In sea of skulls he pulls back a bit on experimentation and instead explores each major race in his universe from their perspective. Each perspective is unique and masterfully done.\nNow, you may well be dubious about the possibility that my\nArts of Dark and Light\nseries is genuinely better than\nA Song of Ice and Fire,\nespecially if you haven’t read\nA Dance with Dragons\n. After all, HBO hasn’t even made a television series about it yet. But if you look at the reviews of both books over time, you’ll see how the initial comparisons to Martin begin to fade away and are replaced by comparisons – admittedly, unfavorable – to Tolkien.\nThis is not indicative of a writer who is unable to tell a story, create memorable characters, or is prone to sacrificing either in the interest of delivering dogmatic, heavy-handed lectures. I don’t believe in either cheap heroism or cheap villainry, as both are the product of mediocre writers with insufficient imagination. While I would consider Captain Europa to be a villain and the Global Justice Initiative to be evil, he most certainly does not.\nNor do I believe that my favored side must always win. After all, the ultimate heroism is self-sacrificial, and I am not even remotely hesistant to kill off even my favorite characters if the story’s logic demands it. (The fact that this also helps solve the fatal perspective-character-inflation problem is merely a fortunate side-effect.) Nor do I ever indulge in the storytelling fraud that is so often present in Martin, Marvel, and DC stories; there are few literary devices for which I have more contempt than “bringing back” an obviously dead character. It’s not only lame and fake drama, it is unnecessary for the sufficiently skilled writer.\nHere’s the thing: EVERYTHING triggers SJWs. It’s not as if we have to go even remotely out of our way to set them off. We can focus 100 percent on telling excellent stories and we probably won’t even need to go back and add anything in order to have them REEEEEEing at frequencies higher than have ever been recorded at the Metropolitian opera. Not that I won’t insert the occasional shiv and twist, out of nothing more than the pure joy of it, but we simply don’t have to. In these forsaken days of the Forgettable Squirrel She-Thing, just having pretty women with attractive bodies is more than enough.\nSo, if you are genuinely concerned about the storytelling aspects of the new series, you can either read my novels or you can simply wait to see what sort of stories we deliver in Alt★Hero. As for me, all I can say is that I am enjoying the challenge of raising my storytelling game in order to keep pace with the legendary Chuck Dixon.\nAnd that, I suspect, is the real concern of the comics SJWs. They’re not at all concerned about our prospective failure. They’re concerned about our prospective\nsuccess\n.",
  "tags": [
    "Alt-Hero",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-13T08:36:00+00:00"
}