{
  "url": "https://voxday.net/2017/10/08/mailvox-america-and-not-america/",
  "scraped_at": "2025-12-19T10:26:51.421670",
  "title": "Mailvox: America and Not-America",
  "date_display": "October 8, 2017",
  "date_iso": "2017-10-08T17:00:00+00:00",
  "date_from_url": "2017-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A people have the right to define themselves, whether they are in Texas or Catalonia:</p><blockquote><p>I am in Dallas for a long weekend with my parents, and we went to the State Fair of Texas. Featured event: Grambling State vs. Prairie View AMU (both HBCUs) at the Cotton Bowl. We decided to go for the marching bands.</p><p>A bit to my surprise, everyone I could see in the stands stood for the national anthem. (The teams were not on the field at the time.) More to my surprise, there is a black national anthem. And they all joined in singing it, fists raised, where they hadn’t sung the national anthem.</p><p>Takeaway? They consider themselves blacks first, and Americans second.</p></blockquote><p>They consider themselves to be a distinct people, a distinct <i>nation</i>, as is their right. It’s going to be fascinating to see how those who have always considered Confederate secessionists to have been racists and traitors try to get their heads around the growing movement towards black nationalism, particularly because black nationalists have no more use for white liberals than they do for white conservatives or the white Alt-Right.</p><p>We American Indians have our segregated and sovereign reservations. Why shouldn’t American whites and American blacks exercise the same Freedom of Association that is their unalienable right?</p><p>Partition of the United States is coming, whether you believe it or not, and it will most likely begin within the next two decades. I hope it will be accomplished peacefully, and with a reasonable amount of justice and good will on every side, but I am skeptical that this will be possible, in part because the vast majority of people are still hopelessly delusional about the very nature of the multinational empire in which they reside.</p></div>",
  "content_text": "A people have the right to define themselves, whether they are in Texas or Catalonia:\nI am in Dallas for a long weekend with my parents, and we went to the State Fair of Texas. Featured event: Grambling State vs. Prairie View AMU (both HBCUs) at the Cotton Bowl. We decided to go for the marching bands.\nA bit to my surprise, everyone I could see in the stands stood for the national anthem. (The teams were not on the field at the time.) More to my surprise, there is a black national anthem. And they all joined in singing it, fists raised, where they hadn’t sung the national anthem.\nTakeaway? They consider themselves blacks first, and Americans second.\nThey consider themselves to be a distinct people, a distinct\nnation\n, as is their right. It’s going to be fascinating to see how those who have always considered Confederate secessionists to have been racists and traitors try to get their heads around the growing movement towards black nationalism, particularly because black nationalists have no more use for white liberals than they do for white conservatives or the white Alt-Right.\nWe American Indians have our segregated and sovereign reservations. Why shouldn’t American whites and American blacks exercise the same Freedom of Association that is their unalienable right?\nPartition of the United States is coming, whether you believe it or not, and it will most likely begin within the next two decades. I hope it will be accomplished peacefully, and with a reasonable amount of justice and good will on every side, but I am skeptical that this will be possible, in part because the vast majority of people are still hopelessly delusional about the very nature of the multinational empire in which they reside.",
  "tags": [
    "nationalism",
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-08T16:00:00+00:00"
}