{
  "url": "https://voxday.net/2017/10/17/of-possible-interest/",
  "scraped_at": "2025-12-19T10:27:58.584207",
  "title": "Of possible interest",
  "date_display": "October 17, 2017",
  "date_iso": "2017-10-17T23:45:00+00:00",
  "date_from_url": "2017-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DMYHp0IX0AEToDL.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"360\" data-original-width=\"725\" decoding=\"async\" fetchpriority=\"high\" height=\"198\" src=\"https://pbs.twimg.com/media/DMYHp0IX0AEToDL.jpg\" width=\"400\"/></a></div><p>What’s extremely exciting, at least to me, is that someone I very much respect recently informed me that he has picked up both books and intends to read them. I don’t know what he’ll make of them, but I do hope he’ll at least find some of the information in them to be useful.</p><p>From the reviews of <b><i><a href=\"https://www.amazon.com/SJWs-Always-Double-Down-Anticipating-ebook/dp/B075BGGKLG\">SJWs Always Double Down</a></i></b>:</p><ul><li>An improvement over the groundbreaking first. Where the examples in <i>SJW’s Always Lie</i> were a little inside-baseball, these are literally ripped from today’s headlines. Anyone who does not live in a cave who reads this book will instantly recognize the goings on. I have several people in organizations I’ll be buying this book for instantly.</li><li>A worthy follow up to the first volume. After reading <i>SJWs Always Lie</i> I started noticing the patterns from the book in the news. I would not have noticed them without reading the book. Forewarned is forearmed. I recommend this book to individuals who may be attacked by SJWs and for executives who may be apolitical but who do not want to see their businesses ruined.</li><li>The insight into the SJW psychological breakdown is probably the most important part, something <i>SJWs Always Lie</i> did not cover. Once you know your enemy, you can better predict them.</li></ul></div>",
  "content_text": "What’s extremely exciting, at least to me, is that someone I very much respect recently informed me that he has picked up both books and intends to read them. I don’t know what he’ll make of them, but I do hope he’ll at least find some of the information in them to be useful.\nFrom the reviews of\nSJWs Always Double Down\n:\nAn improvement over the groundbreaking first. Where the examples in\nSJW’s Always Lie\nwere a little inside-baseball, these are literally ripped from today’s headlines. Anyone who does not live in a cave who reads this book will instantly recognize the goings on. I have several people in organizations I’ll be buying this book for instantly.\nA worthy follow up to the first volume. After reading\nSJWs Always Lie\nI started noticing the patterns from the book in the news. I would not have noticed them without reading the book. Forewarned is forearmed. I recommend this book to individuals who may be attacked by SJWs and for executives who may be apolitical but who do not want to see their businesses ruined.\nThe insight into the SJW psychological breakdown is probably the most important part, something\nSJWs Always Lie\ndid not cover. Once you know your enemy, you can better predict them.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-17T22:45:00+00:00"
}