{
  "url": "https://voxday.net/2017/10/07/the-last-conservative-redoubt/",
  "scraped_at": "2025-12-19T10:26:43.893994",
  "title": "The last conservative redoubt",
  "date_display": "October 7, 2017",
  "date_iso": "2017-10-07T14:00:00+00:00",
  "date_from_url": "2017-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is one of the main reasons I have an amount of intellectual contempt for conservatives: they always, always, ALWAYS retreat to deceit, despite their professed devotion to virtue and morality, whenever the subject is race. Every single time. And usually, the first person they attempt to deceive is themselves. Consider the following debate between commenters at John C. Wright’s blog. I’m not linking to it because John has nothing to do with this and it was merely a tangent from a different discussion, it merely happens to be where I caught a conservative blatantly lying – again – about my clearly expressed opinions.</p><blockquote><p>Overgrown Hobbit<br>Vox Day has stated that homogeneous nation states are good, and forced conglomeration of disparate groups to serve lawless powerful governments are bad. The larger the state, the more likely the tyranny, the smaller, the more likely the people have of self-determination. Even if what they want for themselves is a short fast path to self-destruction. What is the wisest end for the Spaniards? I don’t know. But on this Vox Day’s foundational errors, that race trumps culture and intelligence determines virtue, do not appear to be in play.</br></p><p>Bellomy<br>Does Vox Day think intelligence determines virtue? Ability to sustain a functioning culture, yes. Ability to understand the consequences of decisions, yes. But virtue? I am not so sure about that.</br></p><p>Overgrown Hobbit<br>What makes a people capable of sustaining a functioning culture? Back to you, sir.</br></p><p>Zaklog the Deplorable<br>I would say that a people’s average IQ is a significant factor there. Not the only one, but significant. Another important factor would be a high degree of societal trust, which is much easier to attain in homogenous societies.</br></p><p>Bellomy<br>But I’ve never seen him say intelligence=virtue. Intelligence=more elaborate rationalizing.</br></p><p>Scholar-at-Arms<br>Considering some of the criticisms he’s made on the limitations of intelligence on a personal level, I think you are right.</br></p><p>Zaklog the Deplorable<br>Yes, it is never a good sign for someone’s argument to me that they appear incapable of accurately representing their opponent’s beliefs, and on the subjects of race &amp; IQ, most people who disagree with Vox Day appear to badly misrepresent what he says.</br></p></blockquote><p>They reliably do, because they have to do so in order to avoid admitting the fatal weaknesses of their own positions. First, Overgrown Hobbit is demonstrably lying. I have not only never said, suggested, or implied that intelligence determines virtue, or even that it is a virtue, I have specifically stated the precise opposite.<br><i><br/></i><i>“The fact that intelligence is not a virtue does not make it therefore fictional.”</i><br>– Vox Day, 14 September 2006</br></br></p><p>And in order to avoid giving her any wiggle room whatsoever, I will address her particular formulation. You can quote me on this: <b>intelligence does not determine virtue</b>. There are virtuous retards. There are profoundly evil geniuses. These things are entirely obvious to anyone who has paid even a modicum of attention to human history and human behavior. That “foundational error” simply does not exist.</p><p>Second, there are many things required to sustain a culture, and those things vary depending upon the nature of the culture. Virtue was not required to sustain the empire of the Aztecs, the conquering hordes of the Mongols, or the predatory roaming of the Arab tribes. But intelligence beyond a certain level is absolutely required to sustain a functioning culture that contains interior plumbing and electricity, among other desirable things.</p><p>Third, race does trump culture. It does not always do so on an individual basis, but it is more reliable than the Law of Supply and Demand on the macro level. This particular conservative failure is based on their stubborn determination  to rely on micro-level examples to determine the truth or falsehood of macro-societal concepts. Their opinions are not merely wrong, they are irrelevant, based as they are on inapplicable metrics, and from the scientific perspective, they are nonsensical.</p><p>Fourth, as Zaklog notes, and as I have previously observed, the argument for the Alt-Right is only strengthened by comparison with the feeble and dishonest nature of the arguments being made against it. The more they refuse to understand our case, or correctly characterize it, the more appeal it will hold for those who consider it honestly.</p><p>Fifth, note the tortuous way that Overgrown Hobbit reaches a conclusion that allows her to make a provably false statement. And finally, note that no matter how conservatives squawk, preen, posture, pose, and virtue-signal, they are still absolutely and utterly wrong about both race and immigration. Conservatism conserves nothing because it simply refuses to accept some of the less pleasant truths about the world.</p><p>Formerly “the most Republican county in America,” Orange County, California voted Democrat in 2016, after decades of immigration.</p></div>",
  "content_text": "This is one of the main reasons I have an amount of intellectual contempt for conservatives: they always, always, ALWAYS retreat to deceit, despite their professed devotion to virtue and morality, whenever the subject is race. Every single time. And usually, the first person they attempt to deceive is themselves. Consider the following debate between commenters at John C. Wright’s blog. I’m not linking to it because John has nothing to do with this and it was merely a tangent from a different discussion, it merely happens to be where I caught a conservative blatantly lying – again – about my clearly expressed opinions.\nOvergrown Hobbit\nVox Day has stated that homogeneous nation states are good, and forced conglomeration of disparate groups to serve lawless powerful governments are bad. The larger the state, the more likely the tyranny, the smaller, the more likely the people have of self-determination. Even if what they want for themselves is a short fast path to self-destruction. What is the wisest end for the Spaniards? I don’t know. But on this Vox Day’s foundational errors, that race trumps culture and intelligence determines virtue, do not appear to be in play.\nBellomy\nDoes Vox Day think intelligence determines virtue? Ability to sustain a functioning culture, yes. Ability to understand the consequences of decisions, yes. But virtue? I am not so sure about that.\nOvergrown Hobbit\nWhat makes a people capable of sustaining a functioning culture? Back to you, sir.\nZaklog the Deplorable\nI would say that a people’s average IQ is a significant factor there. Not the only one, but significant. Another important factor would be a high degree of societal trust, which is much easier to attain in homogenous societies.\nBellomy\nBut I’ve never seen him say intelligence=virtue. Intelligence=more elaborate rationalizing.\nScholar-at-Arms\nConsidering some of the criticisms he’s made on the limitations of intelligence on a personal level, I think you are right.\nZaklog the Deplorable\nYes, it is never a good sign for someone’s argument to me that they appear incapable of accurately representing their opponent’s beliefs, and on the subjects of race & IQ, most people who disagree with Vox Day appear to badly misrepresent what he says.\nThey reliably do, because they have to do so in order to avoid admitting the fatal weaknesses of their own positions. First, Overgrown Hobbit is demonstrably lying. I have not only never said, suggested, or implied that intelligence determines virtue, or even that it is a virtue, I have specifically stated the precise opposite.\n“The fact that intelligence is not a virtue does not make it therefore fictional.”\n– Vox Day, 14 September 2006\nAnd in order to avoid giving her any wiggle room whatsoever, I will address her particular formulation. You can quote me on this:\nintelligence does not determine virtue\n. There are virtuous retards. There are profoundly evil geniuses. These things are entirely obvious to anyone who has paid even a modicum of attention to human history and human behavior. That “foundational error” simply does not exist.\nSecond, there are many things required to sustain a culture, and those things vary depending upon the nature of the culture. Virtue was not required to sustain the empire of the Aztecs, the conquering hordes of the Mongols, or the predatory roaming of the Arab tribes. But intelligence beyond a certain level is absolutely required to sustain a functioning culture that contains interior plumbing and electricity, among other desirable things.\nThird, race does trump culture. It does not always do so on an individual basis, but it is more reliable than the Law of Supply and Demand on the macro level. This particular conservative failure is based on their stubborn determination  to rely on micro-level examples to determine the truth or falsehood of macro-societal concepts. Their opinions are not merely wrong, they are irrelevant, based as they are on inapplicable metrics, and from the scientific perspective, they are nonsensical.\nFourth, as Zaklog notes, and as I have previously observed, the argument for the Alt-Right is only strengthened by comparison with the feeble and dishonest nature of the arguments being made against it. The more they refuse to understand our case, or correctly characterize it, the more appeal it will hold for those who consider it honestly.\nFifth, note the tortuous way that Overgrown Hobbit reaches a conclusion that allows her to make a provably false statement. And finally, note that no matter how conservatives squawk, preen, posture, pose, and virtue-signal, they are still absolutely and utterly wrong about both race and immigration. Conservatism conserves nothing because it simply refuses to accept some of the less pleasant truths about the world.\nFormerly “the most Republican county in America,” Orange County, California voted Democrat in 2016, after decades of immigration.",
  "tags": [
    "cuckservative",
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-07T13:00:00+00:00"
}