{
  "url": "https://voxday.net/2017/10/10/the-one-percent/",
  "scraped_at": "2025-12-19T10:27:09.657495",
  "title": "The one percent",
  "date_display": "October 10, 2017",
  "date_iso": "2017-10-10T20:52:00+00:00",
  "date_from_url": "2017-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/althero/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"363\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DLzfDIwWkAE0IrT.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"363\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DLzfDIwWkAE0IrT.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20363%22%3E%3C/svg%3E\"/></a></div><p>We have released a new image of <a href=\"https://freestartr.com/wp-content/uploads/2017/09/AH_017.png\">Rebel washing her Mustang</a> to celebrate hitting a landmark milestone; less than one percent of all kickstarted campaigns ever reach this level. Tomorrow, we’ll be adding some new rewards and stretch goals, as well as modifying an existing one for the better. In the meantime, we’ll be working on finding models to play the roles of Rebel and Dynamique for the cosplay photo shoot they’ll be doing with our newest character, <i>Ryu no Seishin</i>, or Spirit of the Dragon, who we will be introducing soon.</p><p>Thanks very much to all 1,107 of you who made this happen. We wouldn’t have done this if we didn’t think it would be successful, but we never anticipated <i>this </i>strength of support. And if you haven’t <a href=\"https://freestartr.com/project/althero/\">joined the campaign</a> yet, perhaps it’s time to consider doing so.</p><p>For the VFM: I’m going to put out a press release tomorrow, so if you have the time to dig up the emails of reporters or bloggers who have covered comics in general, Marvel, or DC in the past, please email them to me tonight.</p></div>",
  "content_text": "We have released a new image of\nRebel washing her Mustang\nto celebrate hitting a landmark milestone; less than one percent of all kickstarted campaigns ever reach this level. Tomorrow, we’ll be adding some new rewards and stretch goals, as well as modifying an existing one for the better. In the meantime, we’ll be working on finding models to play the roles of Rebel and Dynamique for the cosplay photo shoot they’ll be doing with our newest character,\nRyu no Seishin\n, or Spirit of the Dragon, who we will be introducing soon.\nThanks very much to all 1,107 of you who made this happen. We wouldn’t have done this if we didn’t think it would be successful, but we never anticipated\nthis\nstrength of support. And if you haven’t\njoined the campaign\nyet, perhaps it’s time to consider doing so.\nFor the VFM: I’m going to put out a press release tomorrow, so if you have the time to dig up the emails of reporters or bloggers who have covered comics in general, Marvel, or DC in the past, please email them to me tonight.",
  "tags": [
    "Alt-Hero"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-10T19:52:00+00:00"
}