{
  "url": "https://voxday.net/2017/10/04/the-art-sucks/",
  "scraped_at": "2025-12-19T10:26:24.897179",
  "title": "“The art sucks”",
  "date_display": "October 4, 2017",
  "date_iso": "2017-10-04T14:00:00+00:00",
  "date_from_url": "2017-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Along with “no one will support this” and “HAHAHAHAHA LMFAO”, “the art sucks” has been one of the constant refrains of comic SJWs since they first became aware of Alt★Hero a few days before the Freestartr launch. We had, of course, announced the project months before, but they simply hadn’t paid it any heed until the first image of Rebel triggered them into a swarm.</p><p>Now, what those of you who have not paid attention to the SJW convergence in comics may not realize is that the art bar is considerably lower than you probably imagine it to be. For example, on the left is Kamala Khan, Ms Marvel, a teenage Muslim who is tragically afflicted with elephantiasis, but nevertheless, persists despite her handicap. On the right is Janelle Jeanneret, also known as Dynamique of the Global Justice Initiative, who I will remind is <u>not</u> supposed to be smoking while wearing her superhero outfit.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DLSgdxdWsAAmNIx.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"465\" data-original-width=\"570\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DLSgdxdWsAAmNIx.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"465\" data-original-width=\"570\" data-src=\"https://pbs.twimg.com/media/DLSgdxdWsAAmNIx.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20570%20465%22%3E%3C/svg%3E\"/></a></div><p>However, I do not subscribe to the genetic fallacy. The fact that malicious people of evil intent are seeking to discredit and disqualify the project does not necessarily mean that all of their criticism is invalid. Although I vastly prefer the Alt★Hero artwork by Cliff Cosmic, and would be quite happy to proceed with the project on that basis, Castalia House has always taken an iterative approach to quality. This is occasionally a little disturbing to some of our readers, who would prefer that we try to get everything flawless at the start, but the reality is that we’re still learning what we’re doing. And since the art is not the very best in the industry, that means it can be improved.</p><p>On a related note, if you think Alt★Hero looks amateurish, have a look at the formatting of some of our early ebooks, or our first casebound hardcover. The latter was particularly bad; we used a paperback template and the back cover text wound up actually touching one side of the back cover. The choice of font was a mistake too, and the interior paragraph spacing was excessive. But we have worked steadily at improving the quality of our products, and now our print editions are generally superior to those offered by our mainstream competitors.</p><p>We are taking the same iterative approach to Alt★Hero, which is why I’m very pleased to announce that Marvel and DC Comics veteran colorist Matteo Mystic has joined the team. He sent over the following bio:</p><p><i>In the process of working with the best artists in the comic book business for well over a decade, Matteo Mystic learned the dark arts of the great colorists and earned the privilege of working on top Marvel and DC titles such as Spider-Man, X-Men, and Superman. But after experiencing a crisis of faith, he fled the industry to a monastery high in the Italian Alps. He now spends his days illuminating Bibles and his evenings utilizing his skills in alternative heroics.</i></p><p>Mr. Mystic will be coloring four of the first six volumes. You can see his first work on Alt★Hero <a href=\"https://freestartr.com/project/althero/\">at the Freestartr campaign</a>, at the end of Dynamique’s six-page introduction. I await with eagerness to hear the inevitable praise of those whose helpful advice we have taken to heart.</p></div>",
  "content_text": "Along with “no one will support this” and “HAHAHAHAHA LMFAO”, “the art sucks” has been one of the constant refrains of comic SJWs since they first became aware of Alt★Hero a few days before the Freestartr launch. We had, of course, announced the project months before, but they simply hadn’t paid it any heed until the first image of Rebel triggered them into a swarm.\nNow, what those of you who have not paid attention to the SJW convergence in comics may not realize is that the art bar is considerably lower than you probably imagine it to be. For example, on the left is Kamala Khan, Ms Marvel, a teenage Muslim who is tragically afflicted with elephantiasis, but nevertheless, persists despite her handicap. On the right is Janelle Jeanneret, also known as Dynamique of the Global Justice Initiative, who I will remind is\nnot\nsupposed to be smoking while wearing her superhero outfit.\nHowever, I do not subscribe to the genetic fallacy. The fact that malicious people of evil intent are seeking to discredit and disqualify the project does not necessarily mean that all of their criticism is invalid. Although I vastly prefer the Alt★Hero artwork by Cliff Cosmic, and would be quite happy to proceed with the project on that basis, Castalia House has always taken an iterative approach to quality. This is occasionally a little disturbing to some of our readers, who would prefer that we try to get everything flawless at the start, but the reality is that we’re still learning what we’re doing. And since the art is not the very best in the industry, that means it can be improved.\nOn a related note, if you think Alt★Hero looks amateurish, have a look at the formatting of some of our early ebooks, or our first casebound hardcover. The latter was particularly bad; we used a paperback template and the back cover text wound up actually touching one side of the back cover. The choice of font was a mistake too, and the interior paragraph spacing was excessive. But we have worked steadily at improving the quality of our products, and now our print editions are generally superior to those offered by our mainstream competitors.\nWe are taking the same iterative approach to Alt★Hero, which is why I’m very pleased to announce that Marvel and DC Comics veteran colorist Matteo Mystic has joined the team. He sent over the following bio:\nIn the process of working with the best artists in the comic book business for well over a decade, Matteo Mystic learned the dark arts of the great colorists and earned the privilege of working on top Marvel and DC titles such as Spider-Man, X-Men, and Superman. But after experiencing a crisis of faith, he fled the industry to a monastery high in the Italian Alps. He now spends his days illuminating Bibles and his evenings utilizing his skills in alternative heroics.\nMr. Mystic will be coloring four of the first six volumes. You can see his first work on Alt★Hero\nat the Freestartr campaign\n, at the end of Dynamique’s six-page introduction. I await with eagerness to hear the inevitable praise of those whose helpful advice we have taken to heart.",
  "tags": [
    "Alt-Hero"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-04T13:00:00+00:00"
}