{
  "url": "https://voxday.net/2017/10/11/the-boy-scouts-converged/",
  "scraped_at": "2025-12-19T10:27:17.172190",
  "title": "The Boy Scouts, converged",
  "date_display": "October 11, 2017",
  "date_iso": "2017-10-11T21:00:00+00:00",
  "date_from_url": "2017-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://edition.cnn.com/2017/10/11/us/boy-scouts-will-allow-girls-to-join/index.html\">This result was baked in the cake</a> ever since the Boy Scouts started allowing gays. This is what social justice convergence looks like; once social justice enters, it replaces the core purpose of the organization:</p><blockquote><p>The Boy Scouts of America’s board of directors has unanimously agreed to welcome girls into the Cub Scout program and to forge a path for older girls to pursue and earn the highest rank of Eagle Scout, the organization said Wednesday.</p><p>“The historic decision comes after years of receiving requests from families and girls,” Boy Scouts of America said in a statement. “[T]he organization evaluated the results of numerous research efforts, gaining input from current members and leaders, as well as parents and girls who’ve never been involved in Scouting — to understand how to offer families an important additional choice in meeting the character development needs of all their children.”</p><p>BSA said the move is also aimed at helping busy families consolidate programs for their children. “Families today are busier and more diverse than ever. Most are dual-earners and there are more single-parent households than ever before, making convenient programs that serve the whole family more appealing,” the BSA statement said.</p><p>Boy Scouts of America has about 2.3 million youth members between the ages of 7 and 21 and about 960,000 volunteers in the United States and its territories.</p></blockquote><p>What a pity I didn’t write <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i></b> and <b><i><a href=\"http://amzn.to/2xt9dWb\">SJWs Always Double Dow</a></i></b>n back when I was a Boy Scout in the Order of the Arrow. Of course, it’s only a matter of time before they ban the latter in order to avoid offending American Indians.</p><p>You can be absolutely certain that after the initial rush of girls to join the Boy Scouts, the number of youth members and volunteers will begin to drop even more precipitously than it has already; membership is down 63 percent since it peaked in 1972. And in case you’re wondering, the time to start an alternative organization on the guidelines of the original Boy Scouts is about five years ago. You want to have the infrastructure in place and get it up and running <i>before </i>the mass outflow starts.</p><p>From SJWs Always Double Down: <i>As Martin van Creveld, the Israeli military historian has noted, the more women enter any professional field, the more men leave it. And as the men depart, so to do the prestige and the economic rewards provided by the field. This creates a vicious cycle that both expels existing men from the field while repelling new men from entering it.</i></p><p>This is also true of academic institutions, social organizations and entertainment as well. It won’t be too terribly long before, the Boy Scouts of America will be shocked and dismayed to discover that they can’t get boys to join it anymore.</p><blockquote><p>The decision to allow girls to achieve the rank of Eagle Scout is significant for several reasons.</p><p>The rank of Eagle Scout is a prestigious and widely recognized achievement, one that can have long-term benefits in academic, professional and even military spheres. Attorney General Jeff Sessions, Neil Armstrong and Former US Secretary of Defense Robert Gates are just a few notable men who have attained the rank of Eagle Scout.</p><p>While there is a rough equivalent in the Girl Scouts — the Gold Award — the honor is not nearly as well-known as the Eagle Scout distinction.</p></blockquote><p>And we can now anticipate that the prestige and the long-term benefits of achieving the rank of Eagle Scout will rapidly disappear along with the boys. This is what ALWAYS happens when you fail to police your organization in order to keep the SJWs out.</p></div>",
  "content_text": "This result was baked in the cake\never since the Boy Scouts started allowing gays. This is what social justice convergence looks like; once social justice enters, it replaces the core purpose of the organization:\nThe Boy Scouts of America’s board of directors has unanimously agreed to welcome girls into the Cub Scout program and to forge a path for older girls to pursue and earn the highest rank of Eagle Scout, the organization said Wednesday.\n“The historic decision comes after years of receiving requests from families and girls,” Boy Scouts of America said in a statement. “[T]he organization evaluated the results of numerous research efforts, gaining input from current members and leaders, as well as parents and girls who’ve never been involved in Scouting — to understand how to offer families an important additional choice in meeting the character development needs of all their children.”\nBSA said the move is also aimed at helping busy families consolidate programs for their children. “Families today are busier and more diverse than ever. Most are dual-earners and there are more single-parent households than ever before, making convenient programs that serve the whole family more appealing,” the BSA statement said.\nBoy Scouts of America has about 2.3 million youth members between the ages of 7 and 21 and about 960,000 volunteers in the United States and its territories.\nWhat a pity I didn’t write\nSJWs Always Lie\nand\nSJWs Always Double Dow\nn back when I was a Boy Scout in the Order of the Arrow. Of course, it’s only a matter of time before they ban the latter in order to avoid offending American Indians.\nYou can be absolutely certain that after the initial rush of girls to join the Boy Scouts, the number of youth members and volunteers will begin to drop even more precipitously than it has already; membership is down 63 percent since it peaked in 1972. And in case you’re wondering, the time to start an alternative organization on the guidelines of the original Boy Scouts is about five years ago. You want to have the infrastructure in place and get it up and running\nbefore\nthe mass outflow starts.\nFrom SJWs Always Double Down:\nAs Martin van Creveld, the Israeli military historian has noted, the more women enter any professional field, the more men leave it. And as the men depart, so to do the prestige and the economic rewards provided by the field. This creates a vicious cycle that both expels existing men from the field while repelling new men from entering it.\nThis is also true of academic institutions, social organizations and entertainment as well. It won’t be too terribly long before, the Boy Scouts of America will be shocked and dismayed to discover that they can’t get boys to join it anymore.\nThe decision to allow girls to achieve the rank of Eagle Scout is significant for several reasons.\nThe rank of Eagle Scout is a prestigious and widely recognized achievement, one that can have long-term benefits in academic, professional and even military spheres. Attorney General Jeff Sessions, Neil Armstrong and Former US Secretary of Defense Robert Gates are just a few notable men who have attained the rank of Eagle Scout.\nWhile there is a rough equivalent in the Girl Scouts — the Gold Award — the honor is not nearly as well-known as the Eagle Scout distinction.\nAnd we can now anticipate that the prestige and the long-term benefits of achieving the rank of Eagle Scout will rapidly disappear along with the boys. This is what ALWAYS happens when you fail to police your organization in order to keep the SJWs out.",
  "tags": [
    "declineandfall",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-11T20:00:00+00:00"
}