{
  "url": "https://voxday.net/2017/10/18/they-never-learn-2/",
  "scraped_at": "2025-12-19T10:28:05.333113",
  "title": "They never learn",
  "date_display": "October 18, 2017",
  "date_iso": "2017-10-18T19:34:00+00:00",
  "date_from_url": "2017-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Supreme Dark Lord‏ @voxday<br>It’s only a matter of time before the rest of the #FakeRight AKA Dicky Spencer’s Dance Party is outed as gay Jews.</br></p><p>Eli Mosley‏ @ThatEliMosley<br>Don’t be jealous because @RichardBSpencer owns the rights to a book you want to publish you greedy book merchant. Stick to vyda and comics.</br></p><p>Supreme Dark Lord‏ @voxday<br>We are helping an author whose own publisher won’t even RESPOND TO HIS EMAILS.  As we have done for other authors with other publishers.</br></p><p>Supreme Dark Lord‏ @voxday<br>Richard Spencer has not responded to repeated requests for arbitration specified by the contract by the author. You know this, Eli.</br></p><p>Ember Wolf  ?‏ @EmberWolfTMNM<br>Have you and Concernovich been drinking from the same glass in the past day? There’s something in that water.</br></p><p>Eli Mosley‏ @ThatEliMosley<br>If you’re asking if they collude because they are saddened by their shrinking relevance compared to us, then yea. Same shit.</br></p><p>Supreme Dark Lord‏ @voxday<br>And that was after TWO FREAKING YEARS of no royalty statements or payments. Totally irresponsible and incompetent.</br></p><p>Eli Mosley‏ @ThatEliMosley<br>So you’re admitting that you’re attacking him purely because of business reasons and not because you actually believe your own BS? Got it.</br></p><p>Supreme Dark Lord‏ @voxday<br>No, the way he runs his business merely confirms his lack of integrity, which I had suspected on the basis of his political actions.</br></p><p>Supreme Dark Lord‏ @voxday<br>You told me yourself that he is a complete fuck-up when it comes to details and organizational matters. Weren’t you supposed to fix that?</br></p><p>Keep in mind that the book in question came out in 2013 and currently stands at  #684,934 in Books and #651,423 in Kindle. These Fake Right clowns literally do not understand the concept of acting on principle or helping people simply because it is the right thing to do.</p><p>Which tends to lead one to suspect that when they accuse everyone else of being shills and merchants, they are projecting on that score too. What I can’t understand is what benefit they can possibly derive from clinging to the rights to the author’s book when they’re barely selling any copies anyhow.</p><p>And how is Richard Spencer going to accomplish anything at all when he can’t even successfully run a tiny publishing house that is a fraction of the size of Castalia House? It’s absolutely no surprise to me that his little marches and demonstrations have turned out to be debacles in light of what I’ve learned about his organizational capabilities.</p></div>",
  "content_text": "Supreme Dark Lord‏ @voxday\nIt’s only a matter of time before the rest of the #FakeRight AKA Dicky Spencer’s Dance Party is outed as gay Jews.\nEli Mosley‏ @ThatEliMosley\nDon’t be jealous because @RichardBSpencer owns the rights to a book you want to publish you greedy book merchant. Stick to vyda and comics.\nSupreme Dark Lord‏ @voxday\nWe are helping an author whose own publisher won’t even RESPOND TO HIS EMAILS.  As we have done for other authors with other publishers.\nSupreme Dark Lord‏ @voxday\nRichard Spencer has not responded to repeated requests for arbitration specified by the contract by the author. You know this, Eli.\nEmber Wolf  ?‏ @EmberWolfTMNM\nHave you and Concernovich been drinking from the same glass in the past day? There’s something in that water.\nEli Mosley‏ @ThatEliMosley\nIf you’re asking if they collude because they are saddened by their shrinking relevance compared to us, then yea. Same shit.\nSupreme Dark Lord‏ @voxday\nAnd that was after TWO FREAKING YEARS of no royalty statements or payments. Totally irresponsible and incompetent.\nEli Mosley‏ @ThatEliMosley\nSo you’re admitting that you’re attacking him purely because of business reasons and not because you actually believe your own BS? Got it.\nSupreme Dark Lord‏ @voxday\nNo, the way he runs his business merely confirms his lack of integrity, which I had suspected on the basis of his political actions.\nSupreme Dark Lord‏ @voxday\nYou told me yourself that he is a complete fuck-up when it comes to details and organizational matters. Weren’t you supposed to fix that?\nKeep in mind that the book in question came out in 2013 and currently stands at  #684,934 in Books and #651,423 in Kindle. These Fake Right clowns literally do not understand the concept of acting on principle or helping people simply because it is the right thing to do.\nWhich tends to lead one to suspect that when they accuse everyone else of being shills and merchants, they are projecting on that score too. What I can’t understand is what benefit they can possibly derive from clinging to the rights to the author’s book when they’re barely selling any copies anyhow.\nAnd how is Richard Spencer going to accomplish anything at all when he can’t even successfully run a tiny publishing house that is a fraction of the size of Castalia House? It’s absolutely no surprise to me that his little marches and demonstrations have turned out to be debacles in light of what I’ve learned about his organizational capabilities.",
  "tags": [
    "books",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-18T18:34:00+00:00"
}