{
  "url": "https://voxday.net/2017/10/17/we-win-again/",
  "scraped_at": "2025-12-19T10:27:55.648682",
  "title": "We win again!",
  "date_display": "October 17, 2017",
  "date_iso": "2017-10-17T16:07:00+00:00",
  "date_from_url": "2017-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Overheard:</p><p>VD: Did we win?<br>Vineyard shop employee #1: Win what?<br>VD: Did we buy the most bottles today?<br>VSE #1: What?<br>VD: Did we buy the most bottles of anyone who took the tour today?<br>VSE #1: Um… actually, yes.<br>VD &amp; SB: (high-five)<br>E: So, what do we win?<br>VSE #1: What?<br>E: Don’t we get a prize?<br>VSE #2: Hold on. (goes and retrieves a bottle, puts it in a gift bag.) Here you go!<br>Everyone: Hurray! (poses for a picture with both employees.)</br></br></br></br></br></br></br></br></br></br></br></p><p>All right, so there may have been an amount of wine-tasting involved. A considerable amount, as it happens. Actually, the best part was the five-star lunch at the restaurant owned by the vineyard, where we were the only diners today. Jose, our waiter, put on a truly professional show, complete with <i>a freaking easel and cardboard posters</i>, as well as an unforgettable explanation of how all of the animals who went into the meal were lovingly raised on the premises before being slaughtered. It was more than a meal, it was an education.</p><p>Jose: And the core of this next dish is the little lamb from our farm here, whom I raised myself and permitted to sleep in my own bed every night, until this very morning, when I strangled him in the most loving and humane manner you can imagine. We should all be so fortunate as to perish in a manner as quick and painless as little Pepe. (sniffs, brushes away a tear) He is served in a sauce of butternuts and rancid red wine, with potatoes, leeks, and chunks of jamon.</p><p>SB: So how did you kill the cuttlefish in the last dish?</p><p>Jose: What?</p><p>E: Who cuddles fish?</p><p>To quote F, you know it’s going to be a great meal when a) there is literally no one else in the restaurant, and b) there are three wine glasses per setting on the table. As it turned out, they ended up bringing a fourth glass per person, thereby raising the level from epic to legendary. Four people, three bottles. And that was <i>before </i>the wine-tasting started.</p><p>Needless to say, they got straight 5s on the customer satisfaction ratings. Except for F’s, who simply scrawled BEST TOUR EVER across his form.</p><p>Say what you will about Spacebunny and me, but we <i>always </i>win the wine tour. And if you’re a Foundation-level Voxiversity backer, you can rest assured, your European experience is going to be epic. We’ve spent 20 years researching this sort of thing.</p></div>",
  "content_text": "Overheard:\nVD: Did we win?\nVineyard shop employee #1: Win what?\nVD: Did we buy the most bottles today?\nVSE #1: What?\nVD: Did we buy the most bottles of anyone who took the tour today?\nVSE #1: Um… actually, yes.\nVD & SB: (high-five)\nE: So, what do we win?\nVSE #1: What?\nE: Don’t we get a prize?\nVSE #2: Hold on. (goes and retrieves a bottle, puts it in a gift bag.) Here you go!\nEveryone: Hurray! (poses for a picture with both employees.)\nAll right, so there may have been an amount of wine-tasting involved. A considerable amount, as it happens. Actually, the best part was the five-star lunch at the restaurant owned by the vineyard, where we were the only diners today. Jose, our waiter, put on a truly professional show, complete with\na freaking easel and cardboard posters\n, as well as an unforgettable explanation of how all of the animals who went into the meal were lovingly raised on the premises before being slaughtered. It was more than a meal, it was an education.\nJose: And the core of this next dish is the little lamb from our farm here, whom I raised myself and permitted to sleep in my own bed every night, until this very morning, when I strangled him in the most loving and humane manner you can imagine. We should all be so fortunate as to perish in a manner as quick and painless as little Pepe. (sniffs, brushes away a tear) He is served in a sauce of butternuts and rancid red wine, with potatoes, leeks, and chunks of jamon.\nSB: So how did you kill the cuttlefish in the last dish?\nJose: What?\nE: Who cuddles fish?\nTo quote F, you know it’s going to be a great meal when a) there is literally no one else in the restaurant, and b) there are three wine glasses per setting on the table. As it turned out, they ended up bringing a fourth glass per person, thereby raising the level from epic to legendary. Four people, three bottles. And that was\nbefore\nthe wine-tasting started.\nNeedless to say, they got straight 5s on the customer satisfaction ratings. Except for F’s, who simply scrawled BEST TOUR EVER across his form.\nSay what you will about Spacebunny and me, but we\nalways\nwin the wine tour. And if you’re a Foundation-level Voxiversity backer, you can rest assured, your European experience is going to be epic. We’ve spent 20 years researching this sort of thing.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-17T15:07:00+00:00"
}