{
  "url": "https://voxday.net/2017/10/31/yes-we-noticed-actually/",
  "scraped_at": "2025-12-19T10:29:46.636968",
  "title": "Yes, we noticed, actually",
  "date_display": "October 31, 2017",
  "date_iso": "2017-10-31T12:00:00+00:00",
  "date_from_url": "2017-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DNdUp4iWAAA4xnL.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"381\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"190\" src=\"https://pbs.twimg.com/media/DNdUp4iWAAA4xnL.jpg\" width=\"400\"/></a></div><p>And yet, the Littlest Chickenhawk is very intent on making sure that Arabs don’t outnumber Jews in Israel. Color not only matters, <i>it matters more</i> than ideology does. <i>It matters more</i> than religion does. The civic nationalists, the cucks, and the conservatives can preen and posture nonsensically about a) how they don’t see color, b) how color doesn’t matter, and c) how they would LOVE to vote for a black conservative all they like, but identity politics are here and they will be replaced by identity war sooner rather than later.</p><p>There is a reason that Poland is still Polish while America is no longer American. Equality is a demonic lie. Diversity is societal destruction. Everything the civic nationalists and multiculturalists and globalists taught you was false.</p><p>It’s easy to see who is lying and who is not. All you have to do is pay attention to their arguments and see whose positions are both internally consistent and consistent with reality. God created the nations. It is Satan and his servitors that are seeking to destroy them and recreate Babel.</p></div>",
  "content_text": "And yet, the Littlest Chickenhawk is very intent on making sure that Arabs don’t outnumber Jews in Israel. Color not only matters,\nit matters more\nthan ideology does.\nIt matters more\nthan religion does. The civic nationalists, the cucks, and the conservatives can preen and posture nonsensically about a) how they don’t see color, b) how color doesn’t matter, and c) how they would LOVE to vote for a black conservative all they like, but identity politics are here and they will be replaced by identity war sooner rather than later.\nThere is a reason that Poland is still Polish while America is no longer American. Equality is a demonic lie. Diversity is societal destruction. Everything the civic nationalists and multiculturalists and globalists taught you was false.\nIt’s easy to see who is lying and who is not. All you have to do is pay attention to their arguments and see whose positions are both internally consistent and consistent with reality. God created the nations. It is Satan and his servitors that are seeking to destroy them and recreate Babel.",
  "tags": [
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-10-31T12:00:00+00:00"
}