{
  "url": "https://voxday.net/2022/12/08/avalon-poll/",
  "scraped_at": "2026-01-08T13:40:28.878473",
  "title": "Avalon Poll",
  "date_display": "December 8, 2022",
  "date_iso": "2022-12-08T17:13:00+00:00",
  "date_from_url": "2022-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We have finished with CHUCK DIXON’S AVALON Issues 1-12. We’re now in the process of printing the two omnibuses, 1-6 and 7-12. However, it was suggested that having one big omnibus that collects Issues 1-12 would be preferable since we managed to complete the whole thing before getting the first half out.</p><p>I inquired of The Legend and he said he would prefer “one big doorstopper of a book.”</p><p>However, this is something that needs to be left up to the backers. It makes virtually no difference to us, as very few backers only backed the first omnibus and we’ll just send them the whole thing. So, if you are an Avalon backer, please let us know if you prefer two separate omnibuses or one big one.</p><p><strong>UPDATE:</strong> It belatedly occurs to me that if we do one big omnibus, we MIGHT be able to eventually do some leather editions – not Smyth-sewn, unfortunately – but by using the paperback covers as the endpapers. Apparently this is the technique Easton has used to do their Marvel leatherbound editions and it’s the approach we will likely take with Midnight’s War.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2ff4b721-b4cd-4a29-ba19-66b47174654b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We have finished with CHUCK DIXON’S AVALON Issues 1-12. We’re now in the process of printing the two omnibuses, 1-6 and 7-12. However, it was suggested that having one big omnibus that collects Issues 1-12 would be preferable since we managed to complete the whole thing before getting the first half out.\nI inquired of The Legend and he said he would prefer “one big doorstopper of a book.”\nHowever, this is something that needs to be left up to the backers. It makes virtually no difference to us, as very few backers only backed the first omnibus and we’ll just send them the whole thing. So, if you are an Avalon backer, please let us know if you prefer two separate omnibuses or one big one.\nUPDATE:\nIt belatedly occurs to me that if we do one big omnibus, we MIGHT be able to eventually do some leather editions – not Smyth-sewn, unfortunately – but by using the paperback covers as the endpapers. Apparently this is the technique Easton has used to do their Marvel leatherbound editions and it’s the approach we will likely take with Midnight’s War.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-08T17:18:36+00:00"
}