{
  "url": "https://voxday.net/2022/12/11/drawing-lines-in-the-sand/",
  "scraped_at": "2026-01-08T13:40:44.736559",
  "title": "Drawing Lines in the Sand",
  "date_display": "December 11, 2022",
  "date_iso": "2022-12-11T11:10:12+00:00",
  "date_from_url": "2022-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Xi makes it abundantly clear that <a href=\"https://www.aa.com.tr/en/asia-pacific/injustice-suffered-by-palestinians-cannot-continue-xi-jinping/2760147#\">China stands with Palestine</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Chinese President Xi Jinping expressed dissatisfaction Friday with the injustices suffered by Palestinians and affirmed China’s support for an independent Palestinian state. “It is not possible to continue the historical injustice suffered by the Palestinians,” the Chinese president said at the opening of the Riyadh-Gulf-Chinese Summit for Cooperation and Development in Saudi Arabia.</p><p>Xi emphasized the necessity for granting Palestine “full membership in the United Nations” and said Beijing “supports the two-state solution and the establishment of a Palestinian state on the 1967 borders, with East Jerusalem as its capital.”</p><p>He said he considered the Chinese-Arab summit a “defining event in the history of Chinese-Arab relations.”</p><p>Relations between the two “are based on mutual interest in peace and harmony,” he said. “The Chinese and Arab sides should strengthen solidarity and cooperation and build a community for a closer future,” he said as he welcomed Arab participation in the global security initiative.</p></blockquote><p>If Israel is the USA’s “greatest ally’, then it stands to reason that China, which has been engaged in unrestricted warfare against the United States for two decades, would eventually find common cause with that greatest ally’s greatest enemy.</p><p>It also explains why Soros and the other architects of Clown World fear Xi even more than they do Putin.</p><p>The intriguing question is when the Israelis will abandon the USA and the imperialist neocons in an attempt to appease the Chinese. Because that is probably the right strategic move in the long term; the Israelis are obviously aware that the Diaspora won’t hesitate to sell them out if necessary. And it’s not going to be possible to be the financial masters of <a href=\"https://www.rt.com/business/568041-china-xi-dollar-oil-yuan/\">both sides of The Great Bifurcation</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Beijing will work to make energy purchases in yuan instead of US dollar signalling another step towards shifting further away from the greenback, China’s President Xi Jinping told Gulf Arab leaders as cited by Reuters.</p><p>China’s leader highlighted the necessity of the move while speaking at a Chinese-Arab summit that was hosted by Saudi Arabia earlier this week. Xi had held separate talks with the heads of the Persian Gulf states at the summit that reportedly brought together 30 leaders from across the region.</p><p>The world’s biggest crude importer, China in November ramped up purchases of oil by 12% year-on-year, marking the 10-month high despite the severe pandemic-related restrictions.</p></blockquote><p>As the world’s biggest buyer, China now has the ability to dictate how it pays for oil. And it has already begun paying for Arab goods in its own currency, <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202212/t20221209_10988054.htm\">as evidenced by this interview</a> with a spokeswoman for the Chinese Foreign Ministry:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>The Paper: </strong>We noted that the first RMB cross-border payment transaction between Saudi Arabia and China’s Yiwu city, known as “the world’s supermarket”, was completed ahead of the first China-Arab States Summit. Do you have any comment?</p><p><strong>Mao Ning: </strong>I also noted this good news. The cross-border RMB payment has played an important role in boosting trade between China and Arab states. This is also a telling snapshot of trade and investment facilitation between both sides. Over the past decade, China-Arab states economic and trade cooperation has scaled new heights. China is Arab states’ biggest trading partner. In 2021, China’s FDI stock in Arab states hit $23 billion, a 2.6 times increase over 10 years. The trade volume topped $330.3 billion, 1.5 times more than 10 years ago. In the first three quarters of 2022, China-Arab states trade reached $319.295 billion, up 35.28 percent year on year and close to the total of the whole year of 2021.</p></blockquote><p>This is precisely what the US invaded Iraq and Libya to prevent. But it’s not going to invade Saudi Arabia and it can’t invade China. It is safe to expect that other countries, particularly Russia and Venezuala, will follow suit in short order.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7d919ed0-e1ce-42b8-a9d7-637ebfd929a4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Xi makes it abundantly clear that\nChina stands with Palestine\n.\nChinese President Xi Jinping expressed dissatisfaction Friday with the injustices suffered by Palestinians and affirmed China’s support for an independent Palestinian state. “It is not possible to continue the historical injustice suffered by the Palestinians,” the Chinese president said at the opening of the Riyadh-Gulf-Chinese Summit for Cooperation and Development in Saudi Arabia.\nXi emphasized the necessity for granting Palestine “full membership in the United Nations” and said Beijing “supports the two-state solution and the establishment of a Palestinian state on the 1967 borders, with East Jerusalem as its capital.”\nHe said he considered the Chinese-Arab summit a “defining event in the history of Chinese-Arab relations.”\nRelations between the two “are based on mutual interest in peace and harmony,” he said. “The Chinese and Arab sides should strengthen solidarity and cooperation and build a community for a closer future,” he said as he welcomed Arab participation in the global security initiative.\nIf Israel is the USA’s “greatest ally’, then it stands to reason that China, which has been engaged in unrestricted warfare against the United States for two decades, would eventually find common cause with that greatest ally’s greatest enemy.\nIt also explains why Soros and the other architects of Clown World fear Xi even more than they do Putin.\nThe intriguing question is when the Israelis will abandon the USA and the imperialist neocons in an attempt to appease the Chinese. Because that is probably the right strategic move in the long term; the Israelis are obviously aware that the Diaspora won’t hesitate to sell them out if necessary. And it’s not going to be possible to be the financial masters of\nboth sides of The Great Bifurcation\n.\nBeijing will work to make energy purchases in yuan instead of US dollar signalling another step towards shifting further away from the greenback, China’s President Xi Jinping told Gulf Arab leaders as cited by Reuters.\nChina’s leader highlighted the necessity of the move while speaking at a Chinese-Arab summit that was hosted by Saudi Arabia earlier this week. Xi had held separate talks with the heads of the Persian Gulf states at the summit that reportedly brought together 30 leaders from across the region.\nThe world’s biggest crude importer, China in November ramped up purchases of oil by 12% year-on-year, marking the 10-month high despite the severe pandemic-related restrictions.\nAs the world’s biggest buyer, China now has the ability to dictate how it pays for oil. And it has already begun paying for Arab goods in its own currency,\nas evidenced by this interview\nwith a spokeswoman for the Chinese Foreign Ministry:\nThe Paper:\nWe noted that the first RMB cross-border payment transaction between Saudi Arabia and China’s Yiwu city, known as “the world’s supermarket”, was completed ahead of the first China-Arab States Summit. Do you have any comment?\nMao Ning:\nI also noted this good news. The cross-border RMB payment has played an important role in boosting trade between China and Arab states. This is also a telling snapshot of trade and investment facilitation between both sides. Over the past decade, China-Arab states economic and trade cooperation has scaled new heights. China is Arab states’ biggest trading partner. In 2021, China’s FDI stock in Arab states hit $23 billion, a 2.6 times increase over 10 years. The trade volume topped $330.3 billion, 1.5 times more than 10 years ago. In the first three quarters of 2022, China-Arab states trade reached $319.295 billion, up 35.28 percent year on year and close to the total of the whole year of 2021.\nThis is precisely what the US invaded Iraq and Libya to prevent. But it’s not going to invade Saudi Arabia and it can’t invade China. It is safe to expect that other countries, particularly Russia and Venezuala, will follow suit in short order.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-11T11:20:05+00:00"
}