{
  "url": "https://voxday.net/2022/12/05/freedom-or-foreigners/",
  "scraped_at": "2026-01-08T13:40:06.769403",
  "title": "Freedom or Foreigners",
  "date_display": "December 5, 2022",
  "date_iso": "2022-12-05T11:40:44+00:00",
  "date_from_url": "2022-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget the Danegeld. Once you permit the Dane to become a citizen, <a href=\"https://younggospelminister.blogspot.com/2022/12/liberty-or-immigration.html\">you will never get rid of the Dane</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Machiavelli observes in <em>Discourses </em>that Sparta was able to obtain and then maintain its liberty for centuries, eight centuries in fact, without any serious disturbances. This is a remarkable achievement, and something that modern nations like the United States and Australia are already displaying that they cannot sustain, because, especially in regards to the United States, no one can say that they have maintained their liberty for centuries without disturbance. Most astute observers would note that the US Republic ended in all but name when the Northern States conquered the Confederate states in the late 1800’s. And Australia reverted to a prison colony because of fears about a virus. Whereas Sparta was able to maintain its liberty for eight hundred years, without a similar disturbance.</p><p>How were they able to maintain this liberty for such an extended period? Well he explains, in large part, it was because they heavily restricted immigration:</p><p><em>“Sparta, as I have said, being governed by a king and a limited senate, could maintain itself also for a long time, because there were but few inhabitants, and strangers were not permitted to come in; besides, the laws of Lycurgus had obtained such influence that their observance prevented even the slightest pretext for trouble. It was also the easier for the citizens to live in union, as Lycurgus had established equality in fortunes and inequality in conditions; for an equal poverty prevailed there, and the people were the less ambitious, as the offices of the government were given but to a few citizens, the people being excluded from them; and the nobles in the exercise of their functions did not treat the people sufficiently ill to excite in them the desire of exercising them themselves. This last advantage was due to the kings of Sparta; for being placed in this government, as it were, between two orders, and living in the midst of the nobility, they had not better means of maintaining their authority than to protect the people against all injustice; when these neither feared nor desired authority, and consequently there was no motive for any difference between them and the noble, nor any cause for disturbances between them and the nobles, nor any cause for disturbances’ and this they could live for a long time united. Two principle causes, however, cemented this union: first, the inhabitants of Sparta, were few in number, and therefore could be governed by a few; and the other was, that, by not permitting strangers to establish themselves in the republic, they had neither opportunity of becoming corrupt, nor of increasing their population to such a degree that the burden of government became difficult to the few who were charged with it.”</em></p><p>By maintaining their original population, their historical laws, and by not allowing strangers or foreigners (which includes other Greeks in this context) a foothold they were able to maintain a stable Spartan society for centuries. Spartans ruled Spartans, and because they had commonly agreed laws and customs, this rule was not resented.</p><p>Indeed, Machiavelli notes the Spartan kings ensured their position, by defending their people: “This last advantage was due to the kings of Sparta; for being placed in this government, as it were, between two orders, and living in the midst of the nobility, they had not better means of maintaining their authority than to protect the people against all injustice…” Despite popular assumptions to the contrary, there is a common trend in history of kings being the champions of their people. The Spartan kings are another example of that.</p><p>Machiavelli notes that the modern (in his day in the 15th century) state of Venice achieved the same kind of stability by granting all of its citizens who were there at its founding the right to participate in government, and by denying this right to foreigners coming in. This protected it from foreign interference which could twist the government to foreign purposes and against the will of the Venetians, at least in this era.</p><p>This is an incredibly wise rule, and is consistent with the biblical proscription on allowing foreigners to rule over your nation (Deut. 17:15). It is also consistent with the Biblical laws that forbid recent immigrants from having full rights of citizenship and immigrants from certain places from ever having them (Deut 23:3-8). The Spartans, Venetians, Machiavelli and the Bible all recognised how allowing foreign leadership in your nation undermines its liberty and identity, and made laws to forbid it.</p></blockquote><p>Not only will you not get rid of the Dane, but the Dane will fundamentally alter your society, amend it in order to make it more to his liking, and as Machiavelli observed, eventually rule over you. Which is why, as the great Israeli historian Martin van Creveld has pointed out, immigration is war and war is immigration.</p><p>Although, as William the Conqueror demonstrated, it is possible <a href=\"https://infogalactic.com/info/Harrying_of_the_North\">to extinguish the Dane</a> through extraordinary means.</p><p><em><a href=\"https://social.infogalactic.com/micropost/60fe4cbf-d13a-46a7-bc1c-499aec411def\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Forget the Danegeld. Once you permit the Dane to become a citizen,\nyou will never get rid of the Dane\n.\nMachiavelli observes in\nDiscourses\nthat Sparta was able to obtain and then maintain its liberty for centuries, eight centuries in fact, without any serious disturbances. This is a remarkable achievement, and something that modern nations like the United States and Australia are already displaying that they cannot sustain, because, especially in regards to the United States, no one can say that they have maintained their liberty for centuries without disturbance. Most astute observers would note that the US Republic ended in all but name when the Northern States conquered the Confederate states in the late 1800’s. And Australia reverted to a prison colony because of fears about a virus. Whereas Sparta was able to maintain its liberty for eight hundred years, without a similar disturbance.\nHow were they able to maintain this liberty for such an extended period? Well he explains, in large part, it was because they heavily restricted immigration:\n“Sparta, as I have said, being governed by a king and a limited senate, could maintain itself also for a long time, because there were but few inhabitants, and strangers were not permitted to come in; besides, the laws of Lycurgus had obtained such influence that their observance prevented even the slightest pretext for trouble. It was also the easier for the citizens to live in union, as Lycurgus had established equality in fortunes and inequality in conditions; for an equal poverty prevailed there, and the people were the less ambitious, as the offices of the government were given but to a few citizens, the people being excluded from them; and the nobles in the exercise of their functions did not treat the people sufficiently ill to excite in them the desire of exercising them themselves. This last advantage was due to the kings of Sparta; for being placed in this government, as it were, between two orders, and living in the midst of the nobility, they had not better means of maintaining their authority than to protect the people against all injustice; when these neither feared nor desired authority, and consequently there was no motive for any difference between them and the noble, nor any cause for disturbances between them and the nobles, nor any cause for disturbances’ and this they could live for a long time united. Two principle causes, however, cemented this union: first, the inhabitants of Sparta, were few in number, and therefore could be governed by a few; and the other was, that, by not permitting strangers to establish themselves in the republic, they had neither opportunity of becoming corrupt, nor of increasing their population to such a degree that the burden of government became difficult to the few who were charged with it.”\nBy maintaining their original population, their historical laws, and by not allowing strangers or foreigners (which includes other Greeks in this context) a foothold they were able to maintain a stable Spartan society for centuries. Spartans ruled Spartans, and because they had commonly agreed laws and customs, this rule was not resented.\nIndeed, Machiavelli notes the Spartan kings ensured their position, by defending their people: “This last advantage was due to the kings of Sparta; for being placed in this government, as it were, between two orders, and living in the midst of the nobility, they had not better means of maintaining their authority than to protect the people against all injustice…” Despite popular assumptions to the contrary, there is a common trend in history of kings being the champions of their people. The Spartan kings are another example of that.\nMachiavelli notes that the modern (in his day in the 15th century) state of Venice achieved the same kind of stability by granting all of its citizens who were there at its founding the right to participate in government, and by denying this right to foreigners coming in. This protected it from foreign interference which could twist the government to foreign purposes and against the will of the Venetians, at least in this era.\nThis is an incredibly wise rule, and is consistent with the biblical proscription on allowing foreigners to rule over your nation (Deut. 17:15). It is also consistent with the Biblical laws that forbid recent immigrants from having full rights of citizenship and immigrants from certain places from ever having them (Deut 23:3-8). The Spartans, Venetians, Machiavelli and the Bible all recognised how allowing foreign leadership in your nation undermines its liberty and identity, and made laws to forbid it.\nNot only will you not get rid of the Dane, but the Dane will fundamentally alter your society, amend it in order to make it more to his liking, and as Machiavelli observed, eventually rule over you. Which is why, as the great Israeli historian Martin van Creveld has pointed out, immigration is war and war is immigration.\nAlthough, as William the Conqueror demonstrated, it is possible\nto extinguish the Dane\nthrough extraordinary means.\nDISCUSS ON SG",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-05T12:42:17+00:00"
}