{
  "url": "https://voxday.net/2022/12/21/free-speech-is-anti-christ/",
  "scraped_at": "2026-01-08T13:41:53.729081",
  "title": "Free Speech is Anti-Christ",
  "date_display": "December 21, 2022",
  "date_iso": "2022-12-21T12:52:05+00:00",
  "date_from_url": "2022-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56330\" decoding=\"async\" fetchpriority=\"high\" height=\"720\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/12/image-33.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/12/image-33.png 512w, https://voxday.net/wp-content/uploads/2022/12/image-33-213x300.png 213w\" width=\"512\"/></figure></div><p>Free speech is a satanic concept that was developed by anti-christian atheists to attack Christian civilization during the Enlightenment. It is neither a Christian nor a conservative value. You don’t need to take my word for it, though. Read <em>A HISTORY OF THE FREEDOM OF THOUGHT</em> by historian JB Bury, who was a strong proponent of free speech.</p><p>That is one of two books I would recommend to read if you would like to understand how we went from Christian civilization to Clown World. The other one is <em>AN AUSTRIAN PERSPECTIVE ON THE HISTORY OF ECONOMIC ANALYSIS</em> by Murray Rothbard. Whereas Bury describes the historical degradation of the anti-blasphemy laws, Rothbard describes the successful centuries-long assault on the anti-usury laws.</p><p><em>“The entire idea of free speech is a farce. It is a lie. <a href=\"https://forge-and-anvil.com/2017/11/19/free-speech-neither-real-nor-your-right/\">It is not real</a>.”</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/998b6717-e269-4472-aec4-78f7bbe72f72\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Free speech is a satanic concept that was developed by anti-christian atheists to attack Christian civilization during the Enlightenment. It is neither a Christian nor a conservative value. You don’t need to take my word for it, though. Read\nA HISTORY OF THE FREEDOM OF THOUGHT\nby historian JB Bury, who was a strong proponent of free speech.\nThat is one of two books I would recommend to read if you would like to understand how we went from Christian civilization to Clown World. The other one is\nAN AUSTRIAN PERSPECTIVE ON THE HISTORY OF ECONOMIC ANALYSIS\nby Murray Rothbard. Whereas Bury describes the historical degradation of the anti-blasphemy laws, Rothbard describes the successful centuries-long assault on the anti-usury laws.\n“The entire idea of free speech is a farce. It is a lie.\nIt is not real\n.”\nDISCUSS ON SG",
  "tags": [
    "books",
    "Christianity",
    "Clown World",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-21T15:51:43+00:00"
}