{
  "url": "https://voxday.net/2022/12/19/gab-powers-up-the-user/",
  "scraped_at": "2026-01-08T13:41:40.824615",
  "title": "Gammacaust on Gab",
  "date_display": "December 19, 2022",
  "date_iso": "2022-12-19T13:54:12+00:00",
  "date_from_url": "2022-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remove Reply and Remove Reply and Block are two killer features that will help Gab continue to grow. @a and his team are absolutely killing it. Only retards and losers with zero reach are opposed to these new features, because it limits their ability to spam threads and their attempts to hijack the posts of others. The vast majority of users will greatly appreciate the ability to ignore the retards.</p><p>Gab has, with one fell swoop, successfully targeted its biggest weakness, which was the ability for the ill-intentioned to target and harass users on their own posts. This was extremely detrimental to Gab’s most important users, namely, those with large followings, because they are the ones who possess microphones worth hijacking.</p><p>Of course, the very retards and losers who are most affected by the fact that most users would very much like to pretend they don’t exist <a href=\"https://gab.com/voxday/posts/109540554139740639\">are now screaming “censorship”</a>, which is literally retarded. Gab isn’t censoring anyone. This is not censorship, this is freedom, because forcing people to listen to those they don’t want to listen to is the exact opposite of freedom.</p><p>But it should surprise no one that the Gammas on Gab are viewing these new features as a Gammacaust. Now they are only guaranteed the ability to talk about others <em>on their own posts</em>, which means that everyone else has the ability to exclude them and go back to completely ignoring them. And there is no greater fear for the Gamma than being excluded by his social superiors. They’re apoplectic about losing their self-perceived ability to correct, condemn, and criticize people who have no interest in anything they have to say.</p><p><strong>UPDATE: </strong>In response to the wailing and gnashing of teeth, I added the following:</p><p>Dear Self-Appointed Gab Police,</p><p>It is amusing to see how you pretend every response is an intelligent and substantive critique that merits serious contemplation on the part of the original poster. This is not even close to being the norm.</p><p>The fact is that overwhelming number of “critical” responses are posted by a) retards, b) gammas, c) fedposters, d) paid hasbara accounts, and e) bots. Most of those responses are, at best, a complete waste of time and an insult to human intelligence.</p><p>For Gab to give its users the ability to ignore the constant stream of retardery and fake comments is not censorship, it is freedom and user-empowerment. It’s not taking any power away from you, to the contrary, it is giving you and everyone else the freedom to choose how to engage with others on the platform.</p><p>If you wish to respond politely and substantively to this post, please do so, whether you agree with me or not. And if you wish to respond in a retarded and vulgar manner, you can certainly do that too.</p><p>I just don’t have to put up with that nonsense anymore, thanks to the wisdom of the Gab team.</p><p>Regards,<br/>Vox</p><p><strong>UPDATE: </strong><a href=\"https://gab.com/a/posts/109541284977482743\">Torba weighs in</a> with the only two cents that matter. The key being the “hands off” objective. What he’s doing is the exact opposite of censorship.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Gab’s goal has always been to be as hands off as possible with user content. Instead we want to give you the community the tools to create and shape your own experience. Freedom of association is just as important as freedom of speech.</p><p>We have a new feature today that gives you the user more control over your own content and your own experience on Gab. Users now have the ability to moderate comments under their own posts. When you post original content on your profile you are the moderator of the conversation happening under that content because it’s your content on your profile.</p><p>The comments are not removed completely from the site, they will still be in the “comments” section of someone’s profile who left the comment–but they will no longer be in the comment section under your content when you remove them.</p><p>Users also cannot moderate “quote post” replies to their content because those are new pieces of content on someone else’s page. This is a healthy balance that allows for dissent to still be discovered in quote posts and for spam to be removed from the comment section.</p><p>No one in entitled to an audience on someone else’s content. If you want to “dunk” on people’s posts with your own take you can always do so with a quote post to your own audience.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/6c364425-9e6e-49bb-b064-742414c85c11\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Remove Reply and Remove Reply and Block are two killer features that will help Gab continue to grow. @a and his team are absolutely killing it. Only retards and losers with zero reach are opposed to these new features, because it limits their ability to spam threads and their attempts to hijack the posts of others. The vast majority of users will greatly appreciate the ability to ignore the retards.\nGab has, with one fell swoop, successfully targeted its biggest weakness, which was the ability for the ill-intentioned to target and harass users on their own posts. This was extremely detrimental to Gab’s most important users, namely, those with large followings, because they are the ones who possess microphones worth hijacking.\nOf course, the very retards and losers who are most affected by the fact that most users would very much like to pretend they don’t exist\nare now screaming “censorship”\n, which is literally retarded. Gab isn’t censoring anyone. This is not censorship, this is freedom, because forcing people to listen to those they don’t want to listen to is the exact opposite of freedom.\nBut it should surprise no one that the Gammas on Gab are viewing these new features as a Gammacaust. Now they are only guaranteed the ability to talk about others\non their own posts\n, which means that everyone else has the ability to exclude them and go back to completely ignoring them. And there is no greater fear for the Gamma than being excluded by his social superiors. They’re apoplectic about losing their self-perceived ability to correct, condemn, and criticize people who have no interest in anything they have to say.\nUPDATE:\nIn response to the wailing and gnashing of teeth, I added the following:\nDear Self-Appointed Gab Police,\nIt is amusing to see how you pretend every response is an intelligent and substantive critique that merits serious contemplation on the part of the original poster. This is not even close to being the norm.\nThe fact is that overwhelming number of “critical” responses are posted by a) retards, b) gammas, c) fedposters, d) paid hasbara accounts, and e) bots. Most of those responses are, at best, a complete waste of time and an insult to human intelligence.\nFor Gab to give its users the ability to ignore the constant stream of retardery and fake comments is not censorship, it is freedom and user-empowerment. It’s not taking any power away from you, to the contrary, it is giving you and everyone else the freedom to choose how to engage with others on the platform.\nIf you wish to respond politely and substantively to this post, please do so, whether you agree with me or not. And if you wish to respond in a retarded and vulgar manner, you can certainly do that too.\nI just don’t have to put up with that nonsense anymore, thanks to the wisdom of the Gab team.\nRegards,\nVox\nUPDATE:\nTorba weighs in\nwith the only two cents that matter. The key being the “hands off” objective. What he’s doing is the exact opposite of censorship.\nGab’s goal has always been to be as hands off as possible with user content. Instead we want to give you the community the tools to create and shape your own experience. Freedom of association is just as important as freedom of speech.\nWe have a new feature today that gives you the user more control over your own content and your own experience on Gab. Users now have the ability to moderate comments under their own posts. When you post original content on your profile you are the moderator of the conversation happening under that content because it’s your content on your profile.\nThe comments are not removed completely from the site, they will still be in the “comments” section of someone’s profile who left the comment–but they will no longer be in the comment section under your content when you remove them.\nUsers also cannot moderate “quote post” replies to their content because those are new pieces of content on someone else’s page. This is a healthy balance that allows for dissent to still be discovered in quote posts and for spam to be removed from the comment section.\nNo one in entitled to an audience on someone else’s content. If you want to “dunk” on people’s posts with your own take you can always do so with a quote post to your own audience.\nDISCUSS ON SG",
  "tags": [
    "media",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-19T20:57:41+00:00"
}