{
  "url": "https://voxday.net/2022/12/12/joel-osteen-preaches-satanic-magick/",
  "scraped_at": "2026-01-08T13:40:52.124849",
  "title": "Joel Osteen Preaches Satanic Magick",
  "date_display": "December 12, 2022",
  "date_iso": "2022-12-12T19:49:07+00:00",
  "date_from_url": "2022-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And not the Gospel of Jesus Christ. This is eminently clear on the basis of <a href=\"https://www.youtube.com/watch?v=jDuDN2FtrIo\">John McArthur’s very public rebuke</a> of the man.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A few weeks ago there was an event here at Dodger Stadium with Joel Osteen. 35 000 people at Dodger Stadium, something like that. He is now the largest “church” –  i’m using the word loosely – in America, down in Houston. You need to understand that he is a pagan religionist, in every sense he’s a quasi-pantheist. Jesus is a footnote that satisfies his critics and deceives his followers.</p><p>The idea of his whole thing is that men have the power in themselves to change their lives. In his definitive book, Your Best Life Now, he says – and that ought to be a dead giveaway since the only way this could be your best life is if you’re going to Hell – he says that anyone can create by faith<br/>and words the dreams he desires. Health, wealth, happiness, success, the list is always the same…</p><p>He says God has already done everything He’s going to do, the ball is in your court. You have to take that part of God which exists in you and create your own reality. Now what is the source of this, where<br/>does this come from? Answer: Satan. This is satanic, this is satanic, this is not just off-center, this is satanic.</p></blockquote><p>I have never, ever, seen anything good or positive come out of the so-called Prosperity Gospel. And those who are familiar with the teachings of Aleister Crowley, or even the bafflegarble of Jordan Peterson, will immediately recognize what Joel Osteen is preaching, which is the alteration of objective reality by the application of one’s subjective will.</p><p>That is the wicked inverse of the Christian’s prayer, “Thy will be done.”</p><p>The Bible repeatedly warns of false prophets. It should not surprise anyone that it is the falsest of the false prophets who are showered in fame and what passes for worldly success.</p><p><em><a href=\"https://social.infogalactic.com/micropost/98d90cf8-e06e-4c35-9976-d3f9e67a41a2\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "And not the Gospel of Jesus Christ. This is eminently clear on the basis of\nJohn McArthur’s very public rebuke\nof the man.\nA few weeks ago there was an event here at Dodger Stadium with Joel Osteen. 35 000 people at Dodger Stadium, something like that. He is now the largest “church” –  i’m using the word loosely – in America, down in Houston. You need to understand that he is a pagan religionist, in every sense he’s a quasi-pantheist. Jesus is a footnote that satisfies his critics and deceives his followers.\nThe idea of his whole thing is that men have the power in themselves to change their lives. In his definitive book, Your Best Life Now, he says – and that ought to be a dead giveaway since the only way this could be your best life is if you’re going to Hell – he says that anyone can create by faith\nand words the dreams he desires. Health, wealth, happiness, success, the list is always the same…\nHe says God has already done everything He’s going to do, the ball is in your court. You have to take that part of God which exists in you and create your own reality. Now what is the source of this, where\ndoes this come from? Answer: Satan. This is satanic, this is satanic, this is not just off-center, this is satanic.\nI have never, ever, seen anything good or positive come out of the so-called Prosperity Gospel. And those who are familiar with the teachings of Aleister Crowley, or even the bafflegarble of Jordan Peterson, will immediately recognize what Joel Osteen is preaching, which is the alteration of objective reality by the application of one’s subjective will.\nThat is the wicked inverse of the Christian’s prayer, “Thy will be done.”\nThe Bible repeatedly warns of false prophets. It should not surprise anyone that it is the falsest of the false prophets who are showered in fame and what passes for worldly success.\nDISCUSS ON SG",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-12T19:49:10+00:00"
}