{
  "url": "https://voxday.net/2022/12/12/midnights-war-update-6/",
  "scraped_at": "2026-01-08T13:40:53.962351",
  "title": "Midnight’s War Update 6",
  "date_display": "December 12, 2022",
  "date_iso": "2022-12-12T10:38:48+00:00",
  "date_from_url": "2022-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong>Days Left: </strong>12</p><p><strong>% of Goal: </strong>179.5 percent</p><p><strong>% of Stretch Goal:</strong> 89.7 percent</p><p><strong>Backers:</strong> 308</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56177\" decoding=\"async\" fetchpriority=\"high\" height=\"352\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/12/image-17.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/12/image-17.png 512w, https://voxday.net/wp-content/uploads/2022/12/image-17-300x206.png 300w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>Dante enlists esoteric assistance</em></figcaption></img></figure></div><p>Things have slowed down considerably, but the first stretch goal is still in sight for <a href=\"https://www.kickstarter.com/projects/arkhaven/midnights-war\">the MIDNIGHT’S WAR campaign</a>. Allow me to provide taste of what that goal will be if hit, which is a short novel in the mode of Razorfist’s two Night Vale novels and Chuck Dixon’s two public domain Conan novels, called OUT OF THE SHADOWS.</p><p>Please also note that the <em>MIDNIGHT’S WAR Issues 1-6 omnibus (hardcover)</em> reward has added Canada as a destination, as requested, presumably by Canadians.</p><p><strong><em>OUT OF THE SHADOWS</em></strong></p><p><em>Chapter One: The Dance of the Unicorn</em></p><p>Elliott Grahame surveyed the spreadsheet with great satisfaction. The top line was increasing, the bottom line was more than healthy despite the recent operational expenditures, and the twelve-month trend was precisely in line with the shape of a ramp that the investment bankers were expecting. He didn’t turn around at the sound of his clear glass door being opened behind him, but pointed at the screen instead.<br/>“And that, my friend, is what a billion-dollar company looks like!”<br/>“You think we’re ready to push the IPO?”<br/>“We’ve got to strike while the iron is hot!” He turned around and grinned at his CFO and executive vice-president, Immanual Boschwitz. “You know as well as I do that the stars aren’t going to align forever, Immy.”</p> <span id=\"more-56167\"></span><p>“I know better than you do how many accounting gymnastics we had to go through to give you that perfect little ramp,” Immy said dourly. But he was smiling as he took off his glasses and polished them with his blue-striped power tie. “As much as it pains me to say it, you’re right. We’ve already had a few quiet inquiries from Goldman, North Bay Advisors has called twice requesting to pitch, and I’m pretty sure that Sausalito Partners are acting as a stalking horse for Blackrock.”<br/>“Blackrock? We’re going to be rich, Immy! Obscenely rich! Just like I promised.”<br/>“You’ll be obscenely rich, Elliott. My shares are just about enough to make me respectably wealthy.”<br/>Elliott laughed. “A Ferrari and a beach house wouldn’t suit your style anyhow.”<br/>“No, but Deborah wouldn’t object to an oceanview apartment in Miami Beach.”<br/>“So maybe we’ll make that part of your going-public bonus.”<br/>“As your financial advisor, I have to tell you to be careful what you promise your employees,” Immy admonished him and punctuated his words with a wagging finger. “As man with a 25th-year anniversary approaching, I happily accept.”<br/>“Aren’t you the one who taught me that if it’s not in the contract, it never happened!”<br/>“And so the student becomes the master.” Immy slapped him on the shoulder. “Enjoy the moment, Elliott, while it lasts. If I’ve learned one thing from the old lions at the country club, it’s that success is never quite as much fun as it looks from the outside.”<br/>Elliott nodded pensively as his friend and fellow executive exited his office and closed the glass door quietly behind him. So Blackrock was interested, were they? That meant that a one-billion valuation might actually be, as hard as it was to imagine, a conservative estimate!<br/>He picked up a pen from his desk and ran his finger lovingly over the corporate logo it sported, a stylized red HT. HemaTech had been little more than a niggling idea in his head for more than a decade, an irritatingly repetitive notion that there must have been something significant underlying the massive edifice of the Theranos fraud, something so substantive that even in an inoperative form, it had commanded the attention of world-class scientists, bankers, generals, and politicians alike.<br/>Kissinger, Mattis, Nunn, Perry, and Shultz! And as if those big names weren’t illustrious enough, the CEO of Wells Fargo, a U.S. Senator, a CDC director, and an actual member of the Bechtel family who ran one of the biggest construction conglomerates in the world!<br/>The Theranos technology that had been seen as so visionary that it brought in more than 700 million in investment, resulting in a ten-billion-dollar valuation and making a very short-term billionaire out of its fraudster founder before generating a single dollar in profit, was entirely forgotten now. And the Theranos name was no longer anything more than a sober warning for the investment community to avoid getting too excited about pie-in-the-sky promises, and more importantly, to refrain from putting the cart ahead of the horse.<br/>But from the moment the fraud was revealed by a reporter for The Wall Street Journal, long before the criminal trial of the responsible parties began, Elliott had rejected the public line that all of those savvy old veterans of wars corporate and real somehow managed to fall for a marginally pretty face combined with an ersatiz-Steve Jobs black turtleneck act. Nor was he convinced that the fact that only two of the board members possessed medical degrees had allowed Elizabeth Holmes to pull the wool over their aging and rheumy eyes.<br/>He also didn’t believe it had been mere greed that motivated twelve men with an average age of eighty to join Holmes’s board of directors. How much more money could an old man who owned part of a $20 billion corporation possibly want, or need? And what could twelve very wealthy and powerful old men, several of whom had a copious amount of innocent blood on their hands, possibly care about making medical tests more efficient and less expensive for the masses? What on Earth could they all have hoped to get out of Theranos?<br/>It was the answer to that last question that provided Elliott with his own vision, the vision that was now going to make him an absurd amount of money before he turned forty.<br/>For, as he surmised, there was one thing, and only one thing, that could possibly have interested Theranos’s elderly board of directors, and that was the prospect of somehow restoring their youth to them.<br/>Youth! The one thing that no amount of money can buy. Time! The ephemeral treasure that steadily vanishes with each grain of sand falling down the Reaper’s ruthless hourglass! Life! The one priceless thing that each of those twelve old men were rapidly running out of.<br/>That had to be the answer. It simply had to be! And yet, when he scoured the news and the business media for even the smallest hint of what Elizabeth Holmes had promised her directors, he couldn’t find anything beyond what the whole world now knew was obvious nonsense.<br/>He was almost beginning to believe the narrative and accept that Holmes was just another corporate scam artist in the mode of Bernie Madoff or Kenneth Lay, when he came across some fascinating comments on an employment review site written by a scientist who claimed to have worked for Theranos in the early days.<br/>it didn’t work out, sadly, but that was no fault of the dev team. i worked with some of the best and brightest engineers i’ve ever known and we accomplished things that no one will ever know and i will always be proud of. we could have all lived for centuries but management shut us all down and i will never understand why.<br/>Elliott had underlined two sections of the last sentence. What the unknown scientist meant by lived for centuries was pretty clear and confirmed that he was right to be suspicious of the official story. But what had he meant by management shut us all down? And who was “management” if it wasn’t Holmes or Balwani?<br/>The more he dug into the matter, the more he learned, the more he began to conclude that Holmes and Balwani were neither fraudsters nor truly in charge of anything, they were simply cut-outs used to cover for the people who had actually been calling the shots at Theranos. And while he never unraveled the mystery of who those people were, or why they had shut the high-flying medical technology startup down, in the course of his efforts, he conceived with what was turning out to be a billion-dollar technology concept.<br/>HemaTech, now entering its sixth year of existence, had been founded with an objective of profiting from extending the basic human lifespan. The concept, like most genuinely revolutionary ideas, turned out to be fairly obvious in hindsight, and it had already been tested successfully in rats, rabbits, and, strangely enough, crocodiles. The applied process involved building a massive genetic database across a population, and, after identifying the various RNA encodings that increased the viable lifespan of individual cells, simulating them and injecting modified RNA therapies into the subjects.<br/>The initial results were very promising, as one of the first rats to be subjected to the treatment was now four years old, which was downright ancient for an animal that normally lived two to three years, and appeared to have barely entered middle age. And while it was far too soon to have any idea of what the mRNA treatments had done for the already-long-lived crocodiles, the reptiles turned out to possess three times more useful RNA encodings than any other animal yet tested.<br/>Elliott was desperate to get his hands on a Galapagos giant turtle or a whale shark, as both species were known to have unusually long life spans, but his inquiries to various zoos and marine biology programs had been rejected, often quite rudely.<br/>But soon, probably within one year, HemaTech would go public and he would be able to afford all of the machines and experts and animals required for the next phase, the phase that would prove beyond any shadow of a doubt that the company was on the right track for human life extension. And while he doubted it would be possible to turn the clock back more than a decade or two, he was confident to the point of near-certainty that HemaTech’s biotechnology would be able to slow down the aging process enough to double the lifespan of children who were being born today.<br/>His mobile suddenly began playing a Bach oratorio, <em>Entfliehet, verschwindet, entweichet, ihr Sorgen</em>, better known as the Shepherd’s Cantata. He glanced at the number and frowned. He didn’t recognize it, and he subscribed to a service that was supposed to prevent spam calls to his number. But then he remembered that Blackrock might be sniffing around and decided he had better answer it.<br/>“Hello,” he said, doing his best to not sound irritated.<br/>“Good evening, Mr. Grahame,” a mellifluous male voice answered him. “I am instructed to inform you that you will have a visitor on Thursday night. An important visitor. Please arrange to be in your office at 10 PM.”<br/>“A visitor?”<br/>“Yes, Mr. Grahame. I assume you are familiar with the concept?”<br/>“Of course I’m familiar with—look, who is this?”<br/>“I’m merely the messenger, Mr. Grahame. Be in your office at 10 PM on Thursday night. I can assure you that you will find it very profitable.”<br/>Elliott smiled. Now he understood what was happening. Blackrock, or whomever was behind the caller, knew they needed to play it quiet and low-key. Showing any open interest in HemaTech would increase the risk of the IPO being vultured from them.<br/>“Understood. Say, you don’t happen to be calling from a little town by the Bay, would you?”<br/>A click was the only answer. Elliott frowned, momentarily annoyed, and then he burst out laughing.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0168d043-7b91-4c0a-b515-1ca3140e32ea\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Days Left:\n12\n% of Goal:\n179.5 percent\n% of Stretch Goal:\n89.7 percent\nBackers:\n308\nDante enlists esoteric assistance\nThings have slowed down considerably, but the first stretch goal is still in sight for\nthe MIDNIGHT’S WAR campaign\n. Allow me to provide taste of what that goal will be if hit, which is a short novel in the mode of Razorfist’s two Night Vale novels and Chuck Dixon’s two public domain Conan novels, called OUT OF THE SHADOWS.\nPlease also note that the\nMIDNIGHT’S WAR Issues 1-6 omnibus (hardcover)\nreward has added Canada as a destination, as requested, presumably by Canadians.\nOUT OF THE SHADOWS\nChapter One: The Dance of the Unicorn\nElliott Grahame surveyed the spreadsheet with great satisfaction. The top line was increasing, the bottom line was more than healthy despite the recent operational expenditures, and the twelve-month trend was precisely in line with the shape of a ramp that the investment bankers were expecting. He didn’t turn around at the sound of his clear glass door being opened behind him, but pointed at the screen instead.\n“And that, my friend, is what a billion-dollar company looks like!”\n“You think we’re ready to push the IPO?”\n“We’ve got to strike while the iron is hot!” He turned around and grinned at his CFO and executive vice-president, Immanual Boschwitz. “You know as well as I do that the stars aren’t going to align forever, Immy.”\n“I know better than you do how many accounting gymnastics we had to go through to give you that perfect little ramp,” Immy said dourly. But he was smiling as he took off his glasses and polished them with his blue-striped power tie. “As much as it pains me to say it, you’re right. We’ve already had a few quiet inquiries from Goldman, North Bay Advisors has called twice requesting to pitch, and I’m pretty sure that Sausalito Partners are acting as a stalking horse for Blackrock.”\n“Blackrock? We’re going to be rich, Immy! Obscenely rich! Just like I promised.”\n“You’ll be obscenely rich, Elliott. My shares are just about enough to make me respectably wealthy.”\nElliott laughed. “A Ferrari and a beach house wouldn’t suit your style anyhow.”\n“No, but Deborah wouldn’t object to an oceanview apartment in Miami Beach.”\n“So maybe we’ll make that part of your going-public bonus.”\n“As your financial advisor, I have to tell you to be careful what you promise your employees,” Immy admonished him and punctuated his words with a wagging finger. “As man with a 25th-year anniversary approaching, I happily accept.”\n“Aren’t you the one who taught me that if it’s not in the contract, it never happened!”\n“And so the student becomes the master.” Immy slapped him on the shoulder. “Enjoy the moment, Elliott, while it lasts. If I’ve learned one thing from the old lions at the country club, it’s that success is never quite as much fun as it looks from the outside.”\nElliott nodded pensively as his friend and fellow executive exited his office and closed the glass door quietly behind him. So Blackrock was interested, were they? That meant that a one-billion valuation might actually be, as hard as it was to imagine, a conservative estimate!\nHe picked up a pen from his desk and ran his finger lovingly over the corporate logo it sported, a stylized red HT. HemaTech had been little more than a niggling idea in his head for more than a decade, an irritatingly repetitive notion that there must have been something significant underlying the massive edifice of the Theranos fraud, something so substantive that even in an inoperative form, it had commanded the attention of world-class scientists, bankers, generals, and politicians alike.\nKissinger, Mattis, Nunn, Perry, and Shultz! And as if those big names weren’t illustrious enough, the CEO of Wells Fargo, a U.S. Senator, a CDC director, and an actual member of the Bechtel family who ran one of the biggest construction conglomerates in the world!\nThe Theranos technology that had been seen as so visionary that it brought in more than 700 million in investment, resulting in a ten-billion-dollar valuation and making a very short-term billionaire out of its fraudster founder before generating a single dollar in profit, was entirely forgotten now. And the Theranos name was no longer anything more than a sober warning for the investment community to avoid getting too excited about pie-in-the-sky promises, and more importantly, to refrain from putting the cart ahead of the horse.\nBut from the moment the fraud was revealed by a reporter for The Wall Street Journal, long before the criminal trial of the responsible parties began, Elliott had rejected the public line that all of those savvy old veterans of wars corporate and real somehow managed to fall for a marginally pretty face combined with an ersatiz-Steve Jobs black turtleneck act. Nor was he convinced that the fact that only two of the board members possessed medical degrees had allowed Elizabeth Holmes to pull the wool over their aging and rheumy eyes.\nHe also didn’t believe it had been mere greed that motivated twelve men with an average age of eighty to join Holmes’s board of directors. How much more money could an old man who owned part of a $20 billion corporation possibly want, or need? And what could twelve very wealthy and powerful old men, several of whom had a copious amount of innocent blood on their hands, possibly care about making medical tests more efficient and less expensive for the masses? What on Earth could they all have hoped to get out of Theranos?\nIt was the answer to that last question that provided Elliott with his own vision, the vision that was now going to make him an absurd amount of money before he turned forty.\nFor, as he surmised, there was one thing, and only one thing, that could possibly have interested Theranos’s elderly board of directors, and that was the prospect of somehow restoring their youth to them.\nYouth! The one thing that no amount of money can buy. Time! The ephemeral treasure that steadily vanishes with each grain of sand falling down the Reaper’s ruthless hourglass! Life! The one priceless thing that each of those twelve old men were rapidly running out of.\nThat had to be the answer. It simply had to be! And yet, when he scoured the news and the business media for even the smallest hint of what Elizabeth Holmes had promised her directors, he couldn’t find anything beyond what the whole world now knew was obvious nonsense.\nHe was almost beginning to believe the narrative and accept that Holmes was just another corporate scam artist in the mode of Bernie Madoff or Kenneth Lay, when he came across some fascinating comments on an employment review site written by a scientist who claimed to have worked for Theranos in the early days.\nit didn’t work out, sadly, but that was no fault of the dev team. i worked with some of the best and brightest engineers i’ve ever known and we accomplished things that no one will ever know and i will always be proud of. we could have all lived for centuries but management shut us all down and i will never understand why.\nElliott had underlined two sections of the last sentence. What the unknown scientist meant by lived for centuries was pretty clear and confirmed that he was right to be suspicious of the official story. But what had he meant by management shut us all down? And who was “management” if it wasn’t Holmes or Balwani?\nThe more he dug into the matter, the more he learned, the more he began to conclude that Holmes and Balwani were neither fraudsters nor truly in charge of anything, they were simply cut-outs used to cover for the people who had actually been calling the shots at Theranos. And while he never unraveled the mystery of who those people were, or why they had shut the high-flying medical technology startup down, in the course of his efforts, he conceived with what was turning out to be a billion-dollar technology concept.\nHemaTech, now entering its sixth year of existence, had been founded with an objective of profiting from extending the basic human lifespan. The concept, like most genuinely revolutionary ideas, turned out to be fairly obvious in hindsight, and it had already been tested successfully in rats, rabbits, and, strangely enough, crocodiles. The applied process involved building a massive genetic database across a population, and, after identifying the various RNA encodings that increased the viable lifespan of individual cells, simulating them and injecting modified RNA therapies into the subjects.\nThe initial results were very promising, as one of the first rats to be subjected to the treatment was now four years old, which was downright ancient for an animal that normally lived two to three years, and appeared to have barely entered middle age. And while it was far too soon to have any idea of what the mRNA treatments had done for the already-long-lived crocodiles, the reptiles turned out to possess three times more useful RNA encodings than any other animal yet tested.\nElliott was desperate to get his hands on a Galapagos giant turtle or a whale shark, as both species were known to have unusually long life spans, but his inquiries to various zoos and marine biology programs had been rejected, often quite rudely.\nBut soon, probably within one year, HemaTech would go public and he would be able to afford all of the machines and experts and animals required for the next phase, the phase that would prove beyond any shadow of a doubt that the company was on the right track for human life extension. And while he doubted it would be possible to turn the clock back more than a decade or two, he was confident to the point of near-certainty that HemaTech’s biotechnology would be able to slow down the aging process enough to double the lifespan of children who were being born today.\nHis mobile suddenly began playing a Bach oratorio,\nEntfliehet, verschwindet, entweichet, ihr Sorgen\n, better known as the Shepherd’s Cantata. He glanced at the number and frowned. He didn’t recognize it, and he subscribed to a service that was supposed to prevent spam calls to his number. But then he remembered that Blackrock might be sniffing around and decided he had better answer it.\n“Hello,” he said, doing his best to not sound irritated.\n“Good evening, Mr. Grahame,” a mellifluous male voice answered him. “I am instructed to inform you that you will have a visitor on Thursday night. An important visitor. Please arrange to be in your office at 10 PM.”\n“A visitor?”\n“Yes, Mr. Grahame. I assume you are familiar with the concept?”\n“Of course I’m familiar with—look, who is this?”\n“I’m merely the messenger, Mr. Grahame. Be in your office at 10 PM on Thursday night. I can assure you that you will find it very profitable.”\nElliott smiled. Now he understood what was happening. Blackrock, or whomever was behind the caller, knew they needed to play it quiet and low-key. Showing any open interest in HemaTech would increase the risk of the IPO being vultured from them.\n“Understood. Say, you don’t happen to be calling from a little town by the Bay, would you?”\nA click was the only answer. Elliott frowned, momentarily annoyed, and then he burst out laughing.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-12T20:21:31+00:00"
}