{
  "url": "https://voxday.net/2022/12/30/polish-regulars-in-ukraine/",
  "scraped_at": "2026-01-08T13:42:48.260013",
  "title": "Polish Regulars in Ukraine",
  "date_display": "December 30, 2022",
  "date_iso": "2022-12-30T11:41:37+00:00",
  "date_from_url": "2022-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This news of <a href=\"https://warnews247.gr/meizon-zitima-stin-rosiki-tileorasi-i-polonia-yparchoun-mono-polonoi-stratiotes-sta-metopa-tis-oukranias-einai-taktikos-stratos/\">large numbers of Polish regulars</a> replacing Ukrainians and foreign mercenaries on the front is as-yet unconfirmed, but it won’t be very surprising if it is confirmed soon. It will, however, be a significant step toward transforming what had been a simple border dispute into a regional conflict.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There are no more Ukrainians on the front. There are only Polish there, Polish regular soldiers. And my war correspondents know that. What does this mean? This means that we are already at war with a NATO country. Directly. There are now fifteen thousand Polish regular soldiers there. What if there are hundreds of thousands; won’t we attack Poland; If they push us from there? The situation is evolving before our eyes. We are now at war with the Polish Regular Army and we already know that.</p></blockquote><p>The war was always between Russia and NATO, but if the reports of Polish regulars on the front are true, that will mean that NATO plans to fight on even after the Ukrainian army has been rendered <em>hors de combat</em>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e27227ed-0197-480d-afd8-16b3974cc5d8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This news of\nlarge numbers of Polish regulars\nreplacing Ukrainians and foreign mercenaries on the front is as-yet unconfirmed, but it won’t be very surprising if it is confirmed soon. It will, however, be a significant step toward transforming what had been a simple border dispute into a regional conflict.\nThere are no more Ukrainians on the front. There are only Polish there, Polish regular soldiers. And my war correspondents know that. What does this mean? This means that we are already at war with a NATO country. Directly. There are now fifteen thousand Polish regular soldiers there. What if there are hundreds of thousands; won’t we attack Poland; If they push us from there? The situation is evolving before our eyes. We are now at war with the Polish Regular Army and we already know that.\nThe war was always between Russia and NATO, but if the reports of Polish regulars on the front are true, that will mean that NATO plans to fight on even after the Ukrainian army has been rendered\nhors de combat\n.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-30T11:41:40+00:00"
}