{
  "url": "https://voxday.net/2022/12/27/private-companies/",
  "scraped_at": "2026-01-08T13:42:32.834379",
  "title": "“Private” Companies",
  "date_display": "December 27, 2022",
  "date_iso": "2022-12-27T23:34:50+00:00",
  "date_from_url": "2022-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The self-appointed defenders of capitalism very much want you to ignore the fact that every single corporation <em>is a government creation</em>. And as such, not only should they not enjoy the Constitutional protections of the rights possessed by individuals who are posterity of the Founders, they should be subject to the same limits that are imposed on the government.</p><p>The necessity of this reinterpretation of what is, and what is not, private, <a href=\"https://www.rt.com/news/569016-musk-social-media-censorship/\">is demonstrated by the latest Twitter documents</a> released by Elon Musk.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>All social media platforms work with the US government to censor content, Twitter CEO Elon Musk claimed on Tuesday. Documents released by Musk following his purchase of Twitter showed that the platform colluded with the FBI, CIA, Pentagon and other government agencies to suppress information on elections, Ukraine, and Covid-19.</p><p>“<em>Every</em> social media company is engaged in heavy censorship, with significant involvement of and, at times, explicit direction of the government,” Musk tweeted, adding that “Google frequently makes links disappear, for example.”</p><p>Musk was referring to internal Twitter communications published by journalist Matt Taibbi with his approval, which suggested that the platform’s senior executives held regular meetings with members of the FBI and CIA, during which the agencies gave them lists of “hundreds of problem accounts” to suspend in the run-up to the 2020 election.</p><p>In addition to Twitter, the government was in contact “with virtually every major tech firm,” Taibbi claimed. “These included Facebook, Microsoft, Verizon, Reddit, even Pinterest.” CIA agents “nearly always” sat in on meetings of these firms with the FBI’s Foreign Influence Task Force, Taibbi claimed, explaining that although this task force was convened to fight alleged election interference by foreign states, it made “mountains of domestic moderation requests.”</p></blockquote><p>This is a massive series of constitutional and criminal violations. If, as we expect, it goes entirely unpunished, it will serve as further confirmation of the complete illegitimacy of the current U.S. regime.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c4d7a4fd-9ce7-421c-8193-34a4b75bda68\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The self-appointed defenders of capitalism very much want you to ignore the fact that every single corporation\nis a government creation\n. And as such, not only should they not enjoy the Constitutional protections of the rights possessed by individuals who are posterity of the Founders, they should be subject to the same limits that are imposed on the government.\nThe necessity of this reinterpretation of what is, and what is not, private,\nis demonstrated by the latest Twitter documents\nreleased by Elon Musk.\nAll social media platforms work with the US government to censor content, Twitter CEO Elon Musk claimed on Tuesday. Documents released by Musk following his purchase of Twitter showed that the platform colluded with the FBI, CIA, Pentagon and other government agencies to suppress information on elections, Ukraine, and Covid-19.\n“\nEvery\nsocial media company is engaged in heavy censorship, with significant involvement of and, at times, explicit direction of the government,” Musk tweeted, adding that “Google frequently makes links disappear, for example.”\nMusk was referring to internal Twitter communications published by journalist Matt Taibbi with his approval, which suggested that the platform’s senior executives held regular meetings with members of the FBI and CIA, during which the agencies gave them lists of “hundreds of problem accounts” to suspend in the run-up to the 2020 election.\nIn addition to Twitter, the government was in contact “with virtually every major tech firm,” Taibbi claimed. “These included Facebook, Microsoft, Verizon, Reddit, even Pinterest.” CIA agents “nearly always” sat in on meetings of these firms with the FBI’s Foreign Influence Task Force, Taibbi claimed, explaining that although this task force was convened to fight alleged election interference by foreign states, it made “mountains of domestic moderation requests.”\nThis is a massive series of constitutional and criminal violations. If, as we expect, it goes entirely unpunished, it will serve as further confirmation of the complete illegitimacy of the current U.S. regime.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "law",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-27T23:34:52+00:00"
}