{
  "url": "https://voxday.net/2022/12/01/that-which-did-not-kill-them/",
  "scraped_at": "2026-01-08T13:39:40.059401",
  "title": "That Which Did Not Kill Them",
  "date_display": "December 1, 2022",
  "date_iso": "2022-12-01T12:06:52+00:00",
  "date_from_url": "2022-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Col Douglas Macgregor observes the way in which the neoclowns’ foolish Ukraine puppetry has <a href=\"https://www.theamericanconservative.com/washingtons-carthaginian-peace-collides-with-reality/\">accomplished the opposite of their primary goal</a>, which was to weaken Russia and render it incapable of resistance to Clown World:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The opening phase of the SMO was a limited operation with a narrow purpose and restricted goals. The critical point is that Moscow never intended to do more than persuade Kiev and Washington that Moscow would fight to prevent Ukraine from joining NATO, as well as the further mistreatment of Russians in Ukraine. The SMO was, however, based on invalid assumptions and was terminated. As it turned out, the limited nature of the SMO achieved the opposite of the outcome that Moscow desired, conveying the impression of weakness, rather than strength.</p><p>After concluding that the underpinning assumptions regarding Washington’s readiness to negotiate and compromise were invalid, Putin directed the STAVKA to develop new operational plans with new goals: first, to crush the Ukrainian enemy; second, to remove any doubt in Washington and European capitols that Russia will establish victory on its own terms; and, third, to create a new territorial status quo commensurate with Russia’s national security needs.</p><p>Once the new plan was submitted and approved, President Putin agreed to an economy of force operation to defend Russian territorial gains with minimal forces until the required resources, capabilities, and manpower were assembled for decisive operations. Putin also appointed a new theater commander, General Sergei Surovikin, a senior officer who understands the mission and possesses the mindset to deliver success.</p><p>The coming offensive phase of the conflict will provide a glimpse of the new Russian force that is emerging and its future capabilities. At this writing, 540,000 Russian combat forces are assembled in Southern Ukraine, Western Russia, and Belarus. The numbers continue to grow, but the numbers already include 1,000 rocket artillery systems, thousands of tactical ballistic missiles, cruise missiles, and drones, plus 5,000 armored fighting vehicles, including at least 1,500 tanks, hundreds of manned fixed-wing attack aircraft, helicopters, and bombers. This new force has little in common with the Russian army that intervened 9 months ago on February 24, 2022.</p><p>It is now possible to project that the new Russian armed forces that will evolve from the crucible of war in Ukraine will be designed to execute strategically decisive operations. The resulting Russian force will likely take its inspiration from the force design and operational framework recommended in Colonel General Makhmut Gareev’s work, <em>If War Comes Tomorrow? The Contours of Future Armed Conflict</em>. The new military establishment will consist of much larger forces-in-being that can conduct decisive operations on relatively short notice with minimal reinforcement and preparation.</p><p>Put differently, by the time the conflict ends, it appears Washington will have prompted the Russian State to build up its military power, the very opposite of the fatal weakening that Washington intended when it embarked on its course of military confrontation with Moscow.</p> <cite><em>Washington’s Carthaginian Peace Collides With Reality</em>, Col Douglas Macgregor, 29 November 2022</cite></blockquote><p>With more than three times the number of troops that were utilized in the initial Special Military Operation already mobilized, it is apparent that Russia feels it is ready to finish off the NATO forces that have been opposing it for at least the last six months in the coming winter offensive. And this is a reminder to never again pay any attention to all of the military analysts and experts who told you that Russia had utilized all of its forces, was running out of ammunition in a matter of weeks, and that Ukraine was winning the war.</p><p>Think about how few people told you what was actually happening. The less attention you pay to the mainstream news – and I literally NEVER watch CNN, Fox News, Sky, or the BBC – the more accurate your perceptions and observations are likely to be. Because you simply can’t expect to account for either the quantity or the extent of their lies and misrepresentations, as evidenced when an authority <a href=\"https://sonar21.com/has-ukraines-army-been-reduced-by-almost-50/\">inadvertently reveals the truth</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I do not believe that von der Leyen misspoke nor did she fabricate the number… If the 100,000 dead number is true, then that means Ukraine’s total casualties — i.e., killed and wounded — is approximately 400,000. In other words, Ukraine has suffered almost 40% casualties since the start of the fighting. During the 20th Century, this type of modern warfare normally saw 3 wounded soldiers for every man killed. Using that ratio we get the 400,000 number for total casualties. When the war kicked off in February, Ukraine’s total manpower for ground forces was 1,125,000.</p> <cite><em>HAS UKRAINE’S ARMY BEEN REDUCED BY ALMOST 50%?</em> 30 November 2022</cite></blockquote><p>And remember, in addition to quad-decimating the Ukrainian military and forcing NATO to replace it with its own forces disguised as mercenaries, Russia hasn’t even begun to call on its allies. Imagine if North Korea and China began supplying the Russian military with manpower. The result would make the historical Mongol hordes look like a small raiding party.</p><p><em><a href=\"https://social.infogalactic.com/micropost/813626e9-7504-4d0a-a328-94d551876f70\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Col Douglas Macgregor observes the way in which the neoclowns’ foolish Ukraine puppetry has\naccomplished the opposite of their primary goal\n, which was to weaken Russia and render it incapable of resistance to Clown World:\nThe opening phase of the SMO was a limited operation with a narrow purpose and restricted goals. The critical point is that Moscow never intended to do more than persuade Kiev and Washington that Moscow would fight to prevent Ukraine from joining NATO, as well as the further mistreatment of Russians in Ukraine. The SMO was, however, based on invalid assumptions and was terminated. As it turned out, the limited nature of the SMO achieved the opposite of the outcome that Moscow desired, conveying the impression of weakness, rather than strength.\nAfter concluding that the underpinning assumptions regarding Washington’s readiness to negotiate and compromise were invalid, Putin directed the STAVKA to develop new operational plans with new goals: first, to crush the Ukrainian enemy; second, to remove any doubt in Washington and European capitols that Russia will establish victory on its own terms; and, third, to create a new territorial status quo commensurate with Russia’s national security needs.\nOnce the new plan was submitted and approved, President Putin agreed to an economy of force operation to defend Russian territorial gains with minimal forces until the required resources, capabilities, and manpower were assembled for decisive operations. Putin also appointed a new theater commander, General Sergei Surovikin, a senior officer who understands the mission and possesses the mindset to deliver success.\nThe coming offensive phase of the conflict will provide a glimpse of the new Russian force that is emerging and its future capabilities. At this writing, 540,000 Russian combat forces are assembled in Southern Ukraine, Western Russia, and Belarus. The numbers continue to grow, but the numbers already include 1,000 rocket artillery systems, thousands of tactical ballistic missiles, cruise missiles, and drones, plus 5,000 armored fighting vehicles, including at least 1,500 tanks, hundreds of manned fixed-wing attack aircraft, helicopters, and bombers. This new force has little in common with the Russian army that intervened 9 months ago on February 24, 2022.\nIt is now possible to project that the new Russian armed forces that will evolve from the crucible of war in Ukraine will be designed to execute strategically decisive operations. The resulting Russian force will likely take its inspiration from the force design and operational framework recommended in Colonel General Makhmut Gareev’s work,\nIf War Comes Tomorrow? The Contours of Future Armed Conflict\n. The new military establishment will consist of much larger forces-in-being that can conduct decisive operations on relatively short notice with minimal reinforcement and preparation.\nPut differently, by the time the conflict ends, it appears Washington will have prompted the Russian State to build up its military power, the very opposite of the fatal weakening that Washington intended when it embarked on its course of military confrontation with Moscow.\nWashington’s Carthaginian Peace Collides With Reality\n, Col Douglas Macgregor, 29 November 2022\nWith more than three times the number of troops that were utilized in the initial Special Military Operation already mobilized, it is apparent that Russia feels it is ready to finish off the NATO forces that have been opposing it for at least the last six months in the coming winter offensive. And this is a reminder to never again pay any attention to all of the military analysts and experts who told you that Russia had utilized all of its forces, was running out of ammunition in a matter of weeks, and that Ukraine was winning the war.\nThink about how few people told you what was actually happening. The less attention you pay to the mainstream news – and I literally NEVER watch CNN, Fox News, Sky, or the BBC – the more accurate your perceptions and observations are likely to be. Because you simply can’t expect to account for either the quantity or the extent of their lies and misrepresentations, as evidenced when an authority\ninadvertently reveals the truth\n.\nI do not believe that von der Leyen misspoke nor did she fabricate the number… If the 100,000 dead number is true, then that means Ukraine’s total casualties — i.e., killed and wounded — is approximately 400,000. In other words, Ukraine has suffered almost 40% casualties since the start of the fighting. During the 20th Century, this type of modern warfare normally saw 3 wounded soldiers for every man killed. Using that ratio we get the 400,000 number for total casualties. When the war kicked off in February, Ukraine’s total manpower for ground forces was 1,125,000.\nHAS UKRAINE’S ARMY BEEN REDUCED BY ALMOST 50%?\n30 November 2022\nAnd remember, in addition to quad-decimating the Ukrainian military and forcing NATO to replace it with its own forces disguised as mercenaries, Russia hasn’t even begun to call on its allies. Imagine if North Korea and China began supplying the Russian military with manpower. The result would make the historical Mongol hordes look like a small raiding party.\nDISCUSS ON SG",
  "tags": [
    "media",
    "neoclowns",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-01T12:24:20+00:00"
}