{
  "url": "https://voxday.net/2022/12/26/the-manufactured/",
  "scraped_at": "2026-01-08T13:42:25.796922",
  "title": "The Manufactured",
  "date_display": "December 26, 2022",
  "date_iso": "2022-12-26T12:23:20+00:00",
  "date_from_url": "2022-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will surprise absolutely no one here to learn that evidence of Ben Shapiro’s “popularity” and “success” <a href=\"https://nationalfile.com/facebook-gives-ben-shapiro-shadow-boost-to-make-more-users-see-his-content-report/\">being entirely manufactured</a> has surfaced.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Facebook Gives Ben Shapiro ‘Shadow-Boost’ To Make More Users See His Content</strong></p><p>A report seems to confirm that Ben Shapiro was “shadow-boosted” by Facebook’s algorithm, meaning his content enters the feeds of people otherwise unlikely to interact with the personality. <a href=\"https://www.buzzfeednews.com/article/ryanmac/mark-zuckerberg-joel-kaplan-facebook-alex-jones\">The report from Buzzfeed</a>, which mostly erroneously focuses on claims that Facebook is somehow a safe-haven for supporters of Alex Jones and Infowars, revealed that Ben Shapiro had been pushed into the feeds of Facebook users who had not interacted with his content.</p><p>The report details changes made to a Facebook feature called In Feed Recommendations, which would insert posts into the Facebook feeds of people that they didn’t follow, but were similar to content they liked already. Buzzfeed gives the example of someone who followed the page for a specific football team, who may then see content from the NFL put into their feed.</p><p>However, the IFR was not meant to recommend political content, yet users began complaining that they were seeing posts from Ben Shapiro in their news feeds, “even though they had never engaged with that type of content”:</p><p>When the issue was flagged internally, Facebook’s content policy team warned that removing such suggestions for political content could reduce those pages’ engagement and traffic, and possibly inspire complaints from publishers. A News Feed product manager and a policy team member reiterated this argument in an August post to Facebook’s internal message board.</p><p>It is unclear who else may have been subject to the “shadow-boosting” by Facebook, as opposed to being shadow-banned, which many conservatives were subject to on Facebook and other Big Tech platforms, such as Twitter. Shapiro, the editor-in-chief of the Daily Wire, is a long-time critic of President Donald Trump and America First conservatives, and as such, Facebook’s actions may raise eyebrows on the right.</p></blockquote><p>Facebook has been <a href=\"https://nationalfile.com/shapiro-consistently-gets-highest-engagement-on-facebook-following-reports-zuckerberg-shadow-boosts-him/\">doing this for years</a>. Much the same thing has been taking place on YouTube on behalf of Shapiro, Joe Rogan, Sam Harris, and Jordan Peterson, among others, as well. Shapiro is perhaps unique in having been a complete fraud from the very start, when he was being pushed as a child prodigy on WorldNetDaily and through the Creators Syndicate, but it’s clear that he wasn’t the only “conservative” <a href=\"https://www.buzzfeednews.com/article/ryanmac/mark-zuckerberg-joel-kaplan-facebook-alex-jones\">being mysteriously protected and promoted</a> by Facebook.</p><p><em>“In the US it appears that interventions have been almost exclusively on behalf of conservative publishers,” they wrote, attributing this to political pressure or a reluctance to upset sensitive publishers and high-profile users. As BuzzFeed News reported last summer, members of Facebook’s policy team — including Kaplan — intervened on behalf of right-wing figures and publications such as Charlie Kirk, Breitbart, and Prager University, in some cases pushing for the removal of misinformation strikes against their pages or accounts. </em></p><p>Anyhow, the truth is inevitable. The Noticing will continue.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b11e39bb-1c2a-44db-aa91-e9cf1c6851a1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It will surprise absolutely no one here to learn that evidence of Ben Shapiro’s “popularity” and “success”\nbeing entirely manufactured\nhas surfaced.\nFacebook Gives Ben Shapiro ‘Shadow-Boost’ To Make More Users See His Content\nA report seems to confirm that Ben Shapiro was “shadow-boosted” by Facebook’s algorithm, meaning his content enters the feeds of people otherwise unlikely to interact with the personality.\nThe report from Buzzfeed\n, which mostly erroneously focuses on claims that Facebook is somehow a safe-haven for supporters of Alex Jones and Infowars, revealed that Ben Shapiro had been pushed into the feeds of Facebook users who had not interacted with his content.\nThe report details changes made to a Facebook feature called In Feed Recommendations, which would insert posts into the Facebook feeds of people that they didn’t follow, but were similar to content they liked already. Buzzfeed gives the example of someone who followed the page for a specific football team, who may then see content from the NFL put into their feed.\nHowever, the IFR was not meant to recommend political content, yet users began complaining that they were seeing posts from Ben Shapiro in their news feeds, “even though they had never engaged with that type of content”:\nWhen the issue was flagged internally, Facebook’s content policy team warned that removing such suggestions for political content could reduce those pages’ engagement and traffic, and possibly inspire complaints from publishers. A News Feed product manager and a policy team member reiterated this argument in an August post to Facebook’s internal message board.\nIt is unclear who else may have been subject to the “shadow-boosting” by Facebook, as opposed to being shadow-banned, which many conservatives were subject to on Facebook and other Big Tech platforms, such as Twitter. Shapiro, the editor-in-chief of the Daily Wire, is a long-time critic of President Donald Trump and America First conservatives, and as such, Facebook’s actions may raise eyebrows on the right.\nFacebook has been\ndoing this for years\n. Much the same thing has been taking place on YouTube on behalf of Shapiro, Joe Rogan, Sam Harris, and Jordan Peterson, among others, as well. Shapiro is perhaps unique in having been a complete fraud from the very start, when he was being pushed as a child prodigy on WorldNetDaily and through the Creators Syndicate, but it’s clear that he wasn’t the only “conservative”\nbeing mysteriously protected and promoted\nby Facebook.\n“In the US it appears that interventions have been almost exclusively on behalf of conservative publishers,” they wrote, attributing this to political pressure or a reluctance to upset sensitive publishers and high-profile users. As BuzzFeed News reported last summer, members of Facebook’s policy team — including Kaplan — intervened on behalf of right-wing figures and publications such as Charlie Kirk, Breitbart, and Prager University, in some cases pushing for the removal of misinformation strikes against their pages or accounts.\nAnyhow, the truth is inevitable. The Noticing will continue.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "media",
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-26T12:30:08+00:00"
}