{
  "url": "https://voxday.net/2022/12/20/the-chinese-listened/",
  "scraped_at": "2026-01-08T13:41:48.193085",
  "title": "The Chinese Listened",
  "date_display": "December 20, 2022",
  "date_iso": "2022-12-20T13:44:57+00:00",
  "date_from_url": "2022-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was reading an old Jerry Pournelle anthology from the 80’s – the first <em>Imperial Stars</em> book – one that could be characterized as There Will Be Government in Space, when I was struck by a remarkable passage, the significance of which had eluded me in previous readings, from the concluding essay by Dr. Pournelle entitled <em>The Stars at War</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Military establishments, ours among them, have always been inefficient, and better organized for the last war than the next. If we wait for perfection, we may well wait forever.</p><p>Thus three facts stand out:</p><ol class=\"wp-block-list\"><li>The Soviets have an enormous military establishment, and we are not going to match it tank for tank and gun for gun.</li><li>Our present course of buying some of this and some of that, more tanks here and more planes there, isn’t an adequate, or indeed reasonable, response to the threat, and “reform of the Pentagon” and other efforts to “trim the fat and reduce waste” aren’t likely to succeed very quickly, if at all.</li><li>We have to do something and soon.</li></ol><p>This reasoning was the starting point for Lt. General Daniel O. Graham’s strategic analysis. If what we’re doing isn’t going to work, and we have to do something, where can we go? Graham concluded that we needed a bold new approach, a strategic sidestep; that we had to stop competing with the Soviets in areas in which we can’t win, and begin to compete where we have the advantage.</p> <cite><em>The Stars at War</em>, Jerry Pournelle, 1986</cite></blockquote><p>In other words, 13 years before the two Chinese colonels published <em>Unrestricted Warfare</em>, Jerry Pournelle was already writing about a US general’s strategic analysis that essentially laid the foundation for the Chinese defeat of the US military.</p><p>Because this is the essence of the asymetric strategy that underlies the decades-long Chinese implementation of unrestricted warfare: <em>stop competing with the Soviets in areas in which we can’t win, and begin to compete where we have the advantage</em>.</p><p>That’s exactly what the Chinese have been doing since 1999. This is perhaps the most important material difference between China and Clown World. China pays close attention to the best minds of the East and the best minds of the West. Clown World ignores the best of the East and attempts to silence the best of the West.</p><p><em><a href=\"https://social.infogalactic.com/micropost/01ea4dde-7feb-476f-9146-8b53548d2d93\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I was reading an old Jerry Pournelle anthology from the 80’s – the first\nImperial Stars\nbook – one that could be characterized as There Will Be Government in Space, when I was struck by a remarkable passage, the significance of which had eluded me in previous readings, from the concluding essay by Dr. Pournelle entitled\nThe Stars at War\n.\nMilitary establishments, ours among them, have always been inefficient, and better organized for the last war than the next. If we wait for perfection, we may well wait forever.\nThus three facts stand out:\nThe Soviets have an enormous military establishment, and we are not going to match it tank for tank and gun for gun.\nOur present course of buying some of this and some of that, more tanks here and more planes there, isn’t an adequate, or indeed reasonable, response to the threat, and “reform of the Pentagon” and other efforts to “trim the fat and reduce waste” aren’t likely to succeed very quickly, if at all.\nWe have to do something and soon.\nThis reasoning was the starting point for Lt. General Daniel O. Graham’s strategic analysis. If what we’re doing isn’t going to work, and we have to do something, where can we go? Graham concluded that we needed a bold new approach, a strategic sidestep; that we had to stop competing with the Soviets in areas in which we can’t win, and begin to compete where we have the advantage.\nThe Stars at War\n, Jerry Pournelle, 1986\nIn other words, 13 years before the two Chinese colonels published\nUnrestricted Warfare\n, Jerry Pournelle was already writing about a US general’s strategic analysis that essentially laid the foundation for the Chinese defeat of the US military.\nBecause this is the essence of the asymetric strategy that underlies the decades-long Chinese implementation of unrestricted warfare:\nstop competing with the Soviets in areas in which we can’t win, and begin to compete where we have the advantage\n.\nThat’s exactly what the Chinese have been doing since 1999. This is perhaps the most important material difference between China and Clown World. China pays close attention to the best minds of the East and the best minds of the West. Clown World ignores the best of the East and attempts to silence the best of the West.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-20T13:46:15+00:00"
}