{
  "url": "https://voxday.net/2022/12/29/the-vicious-circle/",
  "scraped_at": "2026-01-08T13:42:43.907953",
  "title": "The Vicious Circle",
  "date_display": "December 29, 2022",
  "date_iso": "2022-12-29T16:04:36+00:00",
  "date_from_url": "2022-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Americans are the only party <a href=\"https://thesaker.is/the-most-important-question/\">that can save the USA</a> from Clown World. The Sino-Russian alliance can, and will, resist the US military, but it is not strong enough to liberate the USA the way it can, and will, liberate Asia and Europe:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russia can do many things, but it cannot liberate the USA from the grip of the Neocons. That is something which only US Americans can do.</p><p>And here we hit a vicious circle:</p><p>The US political system is most unlikely to be effectively challenged from within, big money runs everything, including the most advanced propaganda system in history (aka the “free media”) and the population is kept uninformed and brainwashed. And yes, of course, a major defeat in a war against Russia would shake this system so hard that it would be impossible to conceal the magnitude of the disaster (think “Kabul on steroids”). And that is precisely why the Neocons cannot allow that to happen because this defeat would trigger a domino effect which would quickly involve the truth about 9/11 and, after that, all the myths and lies the US society has been based on for decades (JFK anybody?).</p><p>There are, of course, plenty of US Americans who fully understand that. But how many of them are in a real position of power to influence US decision-making and outcomes? The real question is whether there still are enough patriotic forces in the Pentagon, or the letter soup agencies, to send the Neocons back down into the basement they crawled out of after the 9/11 false flag or not?</p><p>Right now it sure looks like all the positions of power in the US are held by Neolibs, Neocons, RINOs and other ugly creatures, yet it is also undeniable that people like, say, Tucker Carlson and Tulsi Gabbard are reaching a lot of people who “get it”. This <em>has</em> to include REAL liberals and REAL conservatives whose loyalty is not to a gang of international thugs but to their own country and their own people.</p><p>I am also pretty sure that there are many US military commanders who listen to what Col. Macgregor has to say.</p><p>Will that be that enough to break through the wall of lies and propaganda?</p></blockquote><p>I’m more optimistic than The Saker, mostly because I think the system will begin the process of its own demise by undermining its own foundations. The imperial collapse will inevitably come, which is why Americans need to be ready to reassert their right to rule in their own country, even if that is no longer the geographic totality of the current political entity.</p><p><em><a href=\"https://social.infogalactic.com/micropost/073cdf31-2c41-4b38-8326-deb07abaeb55\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Americans are the only party\nthat can save the USA\nfrom Clown World. The Sino-Russian alliance can, and will, resist the US military, but it is not strong enough to liberate the USA the way it can, and will, liberate Asia and Europe:\nRussia can do many things, but it cannot liberate the USA from the grip of the Neocons. That is something which only US Americans can do.\nAnd here we hit a vicious circle:\nThe US political system is most unlikely to be effectively challenged from within, big money runs everything, including the most advanced propaganda system in history (aka the “free media”) and the population is kept uninformed and brainwashed. And yes, of course, a major defeat in a war against Russia would shake this system so hard that it would be impossible to conceal the magnitude of the disaster (think “Kabul on steroids”). And that is precisely why the Neocons cannot allow that to happen because this defeat would trigger a domino effect which would quickly involve the truth about 9/11 and, after that, all the myths and lies the US society has been based on for decades (JFK anybody?).\nThere are, of course, plenty of US Americans who fully understand that. But how many of them are in a real position of power to influence US decision-making and outcomes? The real question is whether there still are enough patriotic forces in the Pentagon, or the letter soup agencies, to send the Neocons back down into the basement they crawled out of after the 9/11 false flag or not?\nRight now it sure looks like all the positions of power in the US are held by Neolibs, Neocons, RINOs and other ugly creatures, yet it is also undeniable that people like, say, Tucker Carlson and Tulsi Gabbard are reaching a lot of people who “get it”. This\nhas\nto include REAL liberals and REAL conservatives whose loyalty is not to a gang of international thugs but to their own country and their own people.\nI am also pretty sure that there are many US military commanders who listen to what Col. Macgregor has to say.\nWill that be that enough to break through the wall of lies and propaganda?\nI’m more optimistic than The Saker, mostly because I think the system will begin the process of its own demise by undermining its own foundations. The imperial collapse will inevitably come, which is why Americans need to be ready to reassert their right to rule in their own country, even if that is no longer the geographic totality of the current political entity.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "decline and fall",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-29T16:04:39+00:00"
}