{
  "url": "https://voxday.net/2022/12/17/the-economics-of-clown-world/",
  "scraped_at": "2026-01-08T13:41:26.208112",
  "title": "The Economics of Clown World",
  "date_display": "December 17, 2022",
  "date_iso": "2022-12-17T12:32:38+00:00",
  "date_from_url": "2022-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Hudson <a href=\"https://thesaker.is/michael-hudson-gives-an-interview-to-a-german-magazine/\">explains the basic operation</a> of what passes for Clown World’s economic system in an interview:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>MEGA Radio: </strong>In your new book <em>The Destiny of Civilization: Finance Capitalism, Industrial Capitalism, or Socialism</em> you state that the world economy is now fracturing between two parts, the United States and Europe is the dollarized part. And this Western neoliberal unit is driving Eurasia and most of the Global South into a separate group. You just stated this in an interview from November. Could you explain this for our outlet?</p><p><strong>Michael Hudson:</strong> The split is not only geographic but above all reflects the conflict between Western neoliberalism and the traditional logic of industrial capitalism. The West has deindustrialized its economies by replacing industrial capitalism with finance capitalism, initially in an attempt to keep its wages down by moving abroad to employ foreign labor, and then to try and establish monopoly privileges and captive markets or arms (and now oil) and high-technology essentials, becoming rentier economies.</p><p>A century ago, industrial capitalism was expected to evolve into industrial socialism, with governments providing subsidized basic infrastructure services (such as health care, education, communication, research and development) to minimize their cost of living and doing business. That is how the United States, Germany and other countries built up their industrial power, and it also is how China and other Eurasian countries have done so more recently.</p><p>But the West’s choice to privatize and financialize its basic infrastructure, dismantling the role of government and shifting planning to Wall Street, London and other financial centers, has left it with little to offer other countries – except or the promise not to bomb them or treat them as enemies if they seek to keep their wealth in their own hands instead of transferring it to U.S. investors and corporations.</p><p>The result is that when China and other countries build up their economies in the same way that the United States did from the end of its Civil War to World War II, they are treated as enemies. It is as if U.S. diplomats see that the game is lost, and that their economy has become so debt-ridden, privatized and high-cost that it cannot compete, that it simply hopes to keep making other countries dependent tributaries for as long as it can until the game finally is over.</p><p>If the U.S. succeeds in imposing financial neoliberalism on the world, then other countries will end up with the same problems that the United States is experiencing.</p></blockquote><p>Read the whole thing. It’s really good and it even references <em>Crusader Kings</em>. And Hudson points out that the cruelest thing Russia can do to Europe is not to invade it, but rather, to abandon it to the rapacious rule of the US financial elite.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d3f01827-d8c5-4741-9762-50246b2e05ea\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Michael Hudson\nexplains the basic operation\nof what passes for Clown World’s economic system in an interview:\nMEGA Radio:\nIn your new book\nThe Destiny of Civilization: Finance Capitalism, Industrial Capitalism, or Socialism\nyou state that the world economy is now fracturing between two parts, the United States and Europe is the dollarized part. And this Western neoliberal unit is driving Eurasia and most of the Global South into a separate group. You just stated this in an interview from November. Could you explain this for our outlet?\nMichael Hudson:\nThe split is not only geographic but above all reflects the conflict between Western neoliberalism and the traditional logic of industrial capitalism. The West has deindustrialized its economies by replacing industrial capitalism with finance capitalism, initially in an attempt to keep its wages down by moving abroad to employ foreign labor, and then to try and establish monopoly privileges and captive markets or arms (and now oil) and high-technology essentials, becoming rentier economies.\nA century ago, industrial capitalism was expected to evolve into industrial socialism, with governments providing subsidized basic infrastructure services (such as health care, education, communication, research and development) to minimize their cost of living and doing business. That is how the United States, Germany and other countries built up their industrial power, and it also is how China and other Eurasian countries have done so more recently.\nBut the West’s choice to privatize and financialize its basic infrastructure, dismantling the role of government and shifting planning to Wall Street, London and other financial centers, has left it with little to offer other countries – except or the promise not to bomb them or treat them as enemies if they seek to keep their wealth in their own hands instead of transferring it to U.S. investors and corporations.\nThe result is that when China and other countries build up their economies in the same way that the United States did from the end of its Civil War to World War II, they are treated as enemies. It is as if U.S. diplomats see that the game is lost, and that their economy has become so debt-ridden, privatized and high-cost that it cannot compete, that it simply hopes to keep making other countries dependent tributaries for as long as it can until the game finally is over.\nIf the U.S. succeeds in imposing financial neoliberalism on the world, then other countries will end up with the same problems that the United States is experiencing.\nRead the whole thing. It’s really good and it even references\nCrusader Kings\n. And Hudson points out that the cruelest thing Russia can do to Europe is not to invade it, but rather, to abandon it to the rapacious rule of the US financial elite.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "economics",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-17T12:32:41+00:00"
}