{
  "url": "https://voxday.net/2022/12/28/the-soft-will-die/",
  "scraped_at": "2026-01-08T13:42:38.370937",
  "title": "The Soft Will Die",
  "date_display": "December 28, 2022",
  "date_iso": "2022-12-28T14:45:09+00:00",
  "date_from_url": "2022-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger is frustrated about the way foolish people<a href=\"https://market-ticker.org/akcs-www?post=247716\"> are managing to get themselves killed</a> by winter.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the late 1970s and early 80s I lived in such a part of the country, near a big lake. There was no fuel injection; our cars had carburetors. By then we had advanced to the point that the choke was electric and “set” itself when it was cold with a slight press of the pedal. There was no electric fuel pump; it was driven by the engine. You got in the car, pumped the pedal once or twice so the accelerator pump would squirt the raw gas in the carb bowl into the intake, pressed it slightly one last time and released to make sure the choke was set and turned the key. If you did it right for the conditions and your battery was in decent shape the car would start, often firing on two or three cylinders originally and running extremely rough for the first few seconds until the rest of them lit up. If you got it wrong and flooded it you were screwed as there was insufficient battery power to keep cranking for very long, and if you left a discharged battery out in that cold it was very likely to freeze and split. Thus if the car failed to start you better either be able to get an immediate jump or have the tools to remove said battery and bring it inside so it wouldn’t freeze!</p><p>I didn’t have a garage; that was a luxury and I had no money. I was a young man. I had to park outside. After said car started you cleared the snow off (frequently a foot deep) and then you had to wait until the engine warmed up enough that you had cabin heat. Not for yourself; you had on a winter parka and long underwear under your pants but rather for the defroster because if you didn’t wait the first time you exhaled your breath would freeze on the INSIDE of the windshield and you couldn’t see a damned thing.</p><p>Phones were connected with wires and the closest one required a quarter to be deposited in the slot and was probably 10 or more miles away once you got in said car and started driving. There was a zero chance of you reaching it if you got out in 0F conditions and attempted to hike that; you were dead if you tried that stunt. If you went off the road and into the piled-high snow, often by February 10′ in height on both sides of said road, that had been previously removed from said road by twin-augur snowthrowers on the front of a dump truck filled with sand you’d be lucky if someone realized that hole was made by a car and the car is still in there; there was no way to call for help so your only hope was another vehicle that noticed as if wherever you were going called in your lack of arrival figuring out where you balled it up in those conditions was not going to be easy. You were quite carful to not have that happen because if it did they’d probably find your dead body in April. The mailboxes on said roads were hung on tall cantilevered chain rigs that would swing out of the way when hit because otherwise the first time said snow removal device came by it would destroy the mailbox.</p><p>You never went anywhere without good (ski-style) gloves in the winter months either on your hands or in the car, and you never went anywhere in the winter months without adequate clothing which included a thick knit hat for your head, gloves and emergency supplies in the vehicle, including plenty of blankets or other means of keeping warm (I was a broke young man so a pile of blankets it was; I didn’t have money for a cold-rated sleeping bag/bivvy sack), a source of minor heat (e.g. a candle and means of lighting it), and a small tin or other similar thing plus a set of road flares so IF you were off the road you could lay a trail TO YOU from the road and increase the odds someone driving by would see it, especially at night — assuming you could walk between the points, that is, which was by no means reasonably assured as there were no such things as airbags either so if you crashed odds were high you were BADLY hurt. Why the candle and plenty of matches? The candle wasn’t for heat for you; it was to melt snow in said tin so you could drink it without killing yourself via hypothermia, and the means of keeping warm without energy was so if you had a mechanical breakdown and could not use the engine for heat, or had an extended problem and ran out of gas you didn’t die.</p><p>You can’t change a tire in these sorts of conditions without decent gloves or you will lose fingers to frostbite. Never mind that all the other “sharps” risk associated with any sort of car work is always there so what are you doing driving around with no means of fixing that. Oh, you think its cool that modern cars often don’t even have spares? Yeah, that’s nice — what happens if you get a flat and its -10F outside? This sort of lack of preparedness involving a vehicle that is expected to be operated in all seasons is stupid and both can and will get you killed.</p><p>You want to virtue signal and drive a Tesla or other EV? That’s a nice sports car suitable for decent conditions. It is utterly unsuitable for use in what is called winter because the range is wildly cut by said cold, you use prime moving power for heat in the cabin, you can’t recharge it in cold conditions as the battery pack cannot accept a charge if it is below freezing and thus if you get stuck in one you’re really in trouble — much more so than with a gasoline powered vehicle.</p></blockquote><p>I think he’s referring to <a href=\"https://www.msn.com/en-in/news/world/people-freeze-to-death-inside-cars-as-us-winter-worsens/ar-AA15Hhl7\">the recent deaths reported in New York</a>, about which I am frankly dubious given the lack of specificity. But he’s right, as growing up in Minnesota required the awareness that winter would absolutely kill you if you were stupid or extremely unlucky. There’s nothing that reminds you of your mortality more than speeding across a frozen lake at 60 MPH on a snowmobile in the dark, knowing full well that your chances of seeing an open patch of water or a sizable log frozen into the ice in time to avoid it are slim to none.</p><p>Or spinning out on black ice and doing a 360 on the highway, wondering if you’d cleared enough distance from the semi you’d passed a few moments earlier to let it slow down before it t-boned your rapidly rotating vehicle. Winter is dangerous.</p><p>But there is really no excuse for freezing to death inside a vehicle, because that reflects nothing more than ignorance of winter combined with a fundamental lack of preparation for it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1ed8a842-ca26-4ca7-aeb2-06052b33d78d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger is frustrated about the way foolish people\nare managing to get themselves killed\nby winter.\nIn the late 1970s and early 80s I lived in such a part of the country, near a big lake. There was no fuel injection; our cars had carburetors. By then we had advanced to the point that the choke was electric and “set” itself when it was cold with a slight press of the pedal. There was no electric fuel pump; it was driven by the engine. You got in the car, pumped the pedal once or twice so the accelerator pump would squirt the raw gas in the carb bowl into the intake, pressed it slightly one last time and released to make sure the choke was set and turned the key. If you did it right for the conditions and your battery was in decent shape the car would start, often firing on two or three cylinders originally and running extremely rough for the first few seconds until the rest of them lit up. If you got it wrong and flooded it you were screwed as there was insufficient battery power to keep cranking for very long, and if you left a discharged battery out in that cold it was very likely to freeze and split. Thus if the car failed to start you better either be able to get an immediate jump or have the tools to remove said battery and bring it inside so it wouldn’t freeze!\nI didn’t have a garage; that was a luxury and I had no money. I was a young man. I had to park outside. After said car started you cleared the snow off (frequently a foot deep) and then you had to wait until the engine warmed up enough that you had cabin heat. Not for yourself; you had on a winter parka and long underwear under your pants but rather for the defroster because if you didn’t wait the first time you exhaled your breath would freeze on the INSIDE of the windshield and you couldn’t see a damned thing.\nPhones were connected with wires and the closest one required a quarter to be deposited in the slot and was probably 10 or more miles away once you got in said car and started driving. There was a zero chance of you reaching it if you got out in 0F conditions and attempted to hike that; you were dead if you tried that stunt. If you went off the road and into the piled-high snow, often by February 10′ in height on both sides of said road, that had been previously removed from said road by twin-augur snowthrowers on the front of a dump truck filled with sand you’d be lucky if someone realized that hole was made by a car and the car is still in there; there was no way to call for help so your only hope was another vehicle that noticed as if wherever you were going called in your lack of arrival figuring out where you balled it up in those conditions was not going to be easy. You were quite carful to not have that happen because if it did they’d probably find your dead body in April. The mailboxes on said roads were hung on tall cantilevered chain rigs that would swing out of the way when hit because otherwise the first time said snow removal device came by it would destroy the mailbox.\nYou never went anywhere without good (ski-style) gloves in the winter months either on your hands or in the car, and you never went anywhere in the winter months without adequate clothing which included a thick knit hat for your head, gloves and emergency supplies in the vehicle, including plenty of blankets or other means of keeping warm (I was a broke young man so a pile of blankets it was; I didn’t have money for a cold-rated sleeping bag/bivvy sack), a source of minor heat (e.g. a candle and means of lighting it), and a small tin or other similar thing plus a set of road flares so IF you were off the road you could lay a trail TO YOU from the road and increase the odds someone driving by would see it, especially at night — assuming you could walk between the points, that is, which was by no means reasonably assured as there were no such things as airbags either so if you crashed odds were high you were BADLY hurt. Why the candle and plenty of matches? The candle wasn’t for heat for you; it was to melt snow in said tin so you could drink it without killing yourself via hypothermia, and the means of keeping warm without energy was so if you had a mechanical breakdown and could not use the engine for heat, or had an extended problem and ran out of gas you didn’t die.\nYou can’t change a tire in these sorts of conditions without decent gloves or you will lose fingers to frostbite. Never mind that all the other “sharps” risk associated with any sort of car work is always there so what are you doing driving around with no means of fixing that. Oh, you think its cool that modern cars often don’t even have spares? Yeah, that’s nice — what happens if you get a flat and its -10F outside? This sort of lack of preparedness involving a vehicle that is expected to be operated in all seasons is stupid and both can and will get you killed.\nYou want to virtue signal and drive a Tesla or other EV? That’s a nice sports car suitable for decent conditions. It is utterly unsuitable for use in what is called winter because the range is wildly cut by said cold, you use prime moving power for heat in the cabin, you can’t recharge it in cold conditions as the battery pack cannot accept a charge if it is below freezing and thus if you get stuck in one you’re really in trouble — much more so than with a gasoline powered vehicle.\nI think he’s referring to\nthe recent deaths reported in New York\n, about which I am frankly dubious given the lack of specificity. But he’s right, as growing up in Minnesota required the awareness that winter would absolutely kill you if you were stupid or extremely unlucky. There’s nothing that reminds you of your mortality more than speeding across a frozen lake at 60 MPH on a snowmobile in the dark, knowing full well that your chances of seeing an open patch of water or a sizable log frozen into the ice in time to avoid it are slim to none.\nOr spinning out on black ice and doing a 360 on the highway, wondering if you’d cleared enough distance from the semi you’d passed a few moments earlier to let it slow down before it t-boned your rapidly rotating vehicle. Winter is dangerous.\nBut there is really no excuse for freezing to death inside a vehicle, because that reflects nothing more than ignorance of winter combined with a fundamental lack of preparation for it.\nDISCUSS ON SG",
  "tags": [
    "news",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-28T14:45:40+00:00"
}