{
  "url": "https://voxday.net/2022/12/08/triggering-the-hitlerians/",
  "scraped_at": "2026-01-08T13:40:27.032346",
  "title": "Triggering the Hitlerians",
  "date_display": "December 8, 2022",
  "date_iso": "2022-12-08T14:32:33+00:00",
  "date_from_url": "2022-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For some reason, posting a meme comparing one foreigner who led another nation into ruin by provoking an unnecessary war with Russia triggered the Alt-Retards on Gab. I responded to them with my customary grace and kindness.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Dear Hitler cheerleaders,</p><p>You are collectively retarded. The salient fact about Adolf Hitler is not that he “stood up to the Jews”. The salient fact is that he was a foreign ruler of a people that he led into an utterly disastrous and unnecessary war.</p><p>After his early military success made him overconfident, he went way too far way too soon, and then tried to blame his predictable failures on the German people, who paid a terrible price for his stupid and short-sighted leadership.</p><p>He was as bad for Germany as Zelensky is proving to be for Ukraine.</p><p>If he’d been one-quarter the leader you believe him to be, Germany would still be peacefully dominating the continent.</p><p>Love,<br/>Vox</p></blockquote><p>As you can imagine, this went over well <a href=\"https://gab.com/voxday/posts/109473818577217942\">with the Alt-Retards</a>. It was particularly amusing to hear that I am a) afraid to debate the matter and b) have Jewish handlers when I have already debated both Greg Johnson and Andrew Anglin on the subject and have been featured on one of the ADL’s many public hit lists since 2017.</p><p>But this underlines the reason I no longer debate anyone. Debates are ephemeral exercises for lightweights with short attention spans. They are of no lasting interest to anyone, apparently not even to those who are monomaniacally interested in the subject being debated.</p><p>And those whose minds are not impervious to historical facts may wish to take into account the fact that my perspective is not based on hindsight, but to the contrary, was shared by some of the Wehrmacht’s more illustrious figures at the time. In fact, my comments concerning the similarities of Hitler and Zelensky were largely the result of making the following observations when reading Col. Hans von Luck’s memoir, <em>Panzer Commander</em>.</p><ul class=\"wp-block-list\"><li>At the beginning of June, suddenly and without warning, our division was entrained in Bonn and, after a journey of two or three days, detrained in Insterburg in East Prussia. The battalion was billeted in the surrounding villages. I used the opportunity to visit some friends on an estate nearby, where some years before, gay and light of heart, I had celebrated the wedding of one of my comrades. The old woman, who after the death of her husband, now managed the estate alone, greeted me sadly. “How depressing to see you again in these circumstances. How contented we were then and now we are threatened with a long and difficult encounter with Russia. Do you understand it all? What more does Hitler want? The Lebensraum so often talked of by him and Rosenberg?“ We walked through the clean stables. It was like saying good-bye to the old Germany.</li><li>Our entry into Russia had been delayed by nearly two months, because Hitler had had to help the Italians in Greece and subsequently deal with growing partisan activity in the Balkans. The Russian winter was at the door and the Wehrmacht was not prepared for it, let alone equipped. Hitler and the High Command seemed to have made no provision at all for a delay until winter.</li><li>The General looked at me over his glasses. “Luck, this was to be expected. Hitler has overreached himself. Now we’ve all got to pay for it, especially the poor infantry and the grenadiers. Give your men all the support you can. Many of them will get into a panic and try to save themselves at all costs. Don’t talk of retreat – the disengagement must and will succeed if we all keep our heads. We will lose a lot of materiel, but the main thing is to get the men back. In the hands of God, Luck.” Although catastrophe was looming, I couldn’t grasp it. For the first time since the successful blitzkriegs we were going back on disappointing terms. Snow, frost, icy winds, and an opponent who knew this climate and did not give up, had defeated us. The comparison with Napoleon was inescapable. I could see the pictures in my history books, of how the sad remnants of a proud army turned back and crossed the Beresina.</li><li>I could see the profound disappointment in Rommel’s face. “Through Hitler’s crazy order to hold out, we lost a vital day, which cost us losses that cannot be made good. I can’t hold Cyrenaica, so with the remains of the Afrika Korps, under General Bayerlein, I shall cross southern Cyrenaica, despite the rains and the sandstorms, in order to set up a first line of defense at Mersa el Brega.”</li></ul><p>Some failures are noble. But Hitler’s failures were not. They were, even at the time, regarded as hubristic, crazy, and inexplicable by better and more intelligent individuals.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2c13a8b0-afa3-4a56-82ba-da37cc743173\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For some reason, posting a meme comparing one foreigner who led another nation into ruin by provoking an unnecessary war with Russia triggered the Alt-Retards on Gab. I responded to them with my customary grace and kindness.\nDear Hitler cheerleaders,\nYou are collectively retarded. The salient fact about Adolf Hitler is not that he “stood up to the Jews”. The salient fact is that he was a foreign ruler of a people that he led into an utterly disastrous and unnecessary war.\nAfter his early military success made him overconfident, he went way too far way too soon, and then tried to blame his predictable failures on the German people, who paid a terrible price for his stupid and short-sighted leadership.\nHe was as bad for Germany as Zelensky is proving to be for Ukraine.\nIf he’d been one-quarter the leader you believe him to be, Germany would still be peacefully dominating the continent.\nLove,\nVox\nAs you can imagine, this went over well\nwith the Alt-Retards\n. It was particularly amusing to hear that I am a) afraid to debate the matter and b) have Jewish handlers when I have already debated both Greg Johnson and Andrew Anglin on the subject and have been featured on one of the ADL’s many public hit lists since 2017.\nBut this underlines the reason I no longer debate anyone. Debates are ephemeral exercises for lightweights with short attention spans. They are of no lasting interest to anyone, apparently not even to those who are monomaniacally interested in the subject being debated.\nAnd those whose minds are not impervious to historical facts may wish to take into account the fact that my perspective is not based on hindsight, but to the contrary, was shared by some of the Wehrmacht’s more illustrious figures at the time. In fact, my comments concerning the similarities of Hitler and Zelensky were largely the result of making the following observations when reading Col. Hans von Luck’s memoir,\nPanzer Commander\n.\nAt the beginning of June, suddenly and without warning, our division was entrained in Bonn and, after a journey of two or three days, detrained in Insterburg in East Prussia. The battalion was billeted in the surrounding villages. I used the opportunity to visit some friends on an estate nearby, where some years before, gay and light of heart, I had celebrated the wedding of one of my comrades. The old woman, who after the death of her husband, now managed the estate alone, greeted me sadly. “How depressing to see you again in these circumstances. How contented we were then and now we are threatened with a long and difficult encounter with Russia. Do you understand it all? What more does Hitler want? The Lebensraum so often talked of by him and Rosenberg?“ We walked through the clean stables. It was like saying good-bye to the old Germany.\nOur entry into Russia had been delayed by nearly two months, because Hitler had had to help the Italians in Greece and subsequently deal with growing partisan activity in the Balkans. The Russian winter was at the door and the Wehrmacht was not prepared for it, let alone equipped. Hitler and the High Command seemed to have made no provision at all for a delay until winter.\nThe General looked at me over his glasses. “Luck, this was to be expected. Hitler has overreached himself. Now we’ve all got to pay for it, especially the poor infantry and the grenadiers. Give your men all the support you can. Many of them will get into a panic and try to save themselves at all costs. Don’t talk of retreat – the disengagement must and will succeed if we all keep our heads. We will lose a lot of materiel, but the main thing is to get the men back. In the hands of God, Luck.” Although catastrophe was looming, I couldn’t grasp it. For the first time since the successful blitzkriegs we were going back on disappointing terms. Snow, frost, icy winds, and an opponent who knew this climate and did not give up, had defeated us. The comparison with Napoleon was inescapable. I could see the pictures in my history books, of how the sad remnants of a proud army turned back and crossed the Beresina.\nI could see the profound disappointment in Rommel’s face. “Through Hitler’s crazy order to hold out, we lost a vital day, which cost us losses that cannot be made good. I can’t hold Cyrenaica, so with the remains of the Afrika Korps, under General Bayerlein, I shall cross southern Cyrenaica, despite the rains and the sandstorms, in order to set up a first line of defense at Mersa el Brega.”\nSome failures are noble. But Hitler’s failures were not. They were, even at the time, regarded as hubristic, crazy, and inexplicable by better and more intelligent individuals.\nDISCUSS ON SG",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-08T14:32:36+00:00"
}