{
  "url": "https://voxday.net/2022/12/07/ukraines-war-on-christianity/",
  "scraped_at": "2026-01-08T13:40:23.373129",
  "title": "Ukraine’s War on Christianity",
  "date_display": "December 7, 2022",
  "date_iso": "2022-12-07T11:29:07+00:00",
  "date_from_url": "2022-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clown World’s puppet in Ukraine has proposed a law <a href=\"https://bigleaguepolitics.com/ukrainian-president-volodymyr-zelensky-moves-to-outlaw-orthodox-christianity/\">to ban the Christian church</a> in Ukraine.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>President Zelensky of Ukraine announced Draft Law 8821, which will make the Ukrainian Orthodox Church illegal throughout the country. The law, if passed, will also allow the Ukrainian government the ability to confiscate all church property and outlaw both public and private practice of the religion.</p><p>The Ukrainian Orthodox Church has long been the largest religion of Ukraine, tracing its origins over a thousand years back to 988 with the baptism of Vladimir the Great of the Kievan Rus’ and conversion of the eastern slavs, of which both Russians and Ukrainians share a united heritage.</p><p>President Zelensky announced the reasoning behind the law as the Ukrainian Orthodox Church being in communion with the Russian Orthodox Church in Moscow. Of course, all of the main Eastern Orthodox Christian Churches are in communion with each other through a shared faith and deep history back to its Great Schism with the Holy See in 1054 AD. Zelensky has stated he hopes that this will weaken ties with Russia and demoralize any pro-peace sentiments Ukrainian Christians have with their brothers that they have been so tragically spilling blood with since February.</p><p>To put this into perspective, this would essentially be the same as if FDR had outlawed Catholicism during World War II due to the United States being at war with Italy… Zelensky, who is not a Christian, nor has he ever claimed to be, is willing to use his military to raid and persecute Christians to the same extent as his communist predecessors.</p></blockquote><p>His action notwithstanding, Zelensky’s obvious intent is more akin to FDR outlawing every Protestant denomination in America, from the Assemblies of God to the United Methodist Church after outlawing the Roman Catholic Church. It’s akin to Winston Churchill banning the Anglican Church. Vladimir Putin’s decision to risk war with NATO in order to free the Russian people of the Donbass from the wicked color revolutionists in Kiev should be making a lot more sense to everyone now, even to those who foolishly opposed the special military operation and “stood with Ukraine”.</p><p>If you stand with Ukraine, you are literally standing with people who are satanists, sex traffickers, and pedophiles. It doesn’t matter if they call themselves “Bolsheviks” or “communists” or “neoconservatives” or “neo-Nazis” or “judeo-christians” or “secularists” or even, laughably, “Ukraine nationalists”, the only thing you need to know about them is that the citizens of Clown World are <a href=\"https://media.gab.com/system/media_attachments/files/122/104/274/original/91b2ba6b08019760.png\">ferociously dedicated to the Holocaust</a> and are violently opposed to Christians, Christianity, and Jesus Christ.</p><p>They are the enemy with one thousand names.</p><p>Ignore their purported ideologies. The ideological conflicts are nothing but smokescreens for the real war, which is spiritual rather than ideological, material, or economic.</p><p>And that is why everyone, of every nation and faith, should pray for Russia’s victory over Clown World.</p><p><strong>UPDATE: </strong>The writer is correct. Zelensky’s current action is statistically akin to FDR banning the Roman Catholic Church in 1940. However, his obvious intent is to ban the larger Ukrainian Orthodox Church as well; until 2018 they were one and the same. So, if you think this proposed new law is inspired by the NATO-Russian war and the smaller church’s connection to the Moscow Patriarchate, you are foolish, short-sighted, and will be proven wrong.</p><p>Plus ça change… It’s been 84 years, and TIME is still celebrating the spirit of antichrist.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56125\" decoding=\"async\" fetchpriority=\"high\" height=\"450\" sizes=\"(max-width: 554px) 100vw, 554px\" src=\"https://voxday.net/wp-content/uploads/2022/12/image-13.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/12/image-13.png 554w, https://voxday.net/wp-content/uploads/2022/12/image-13-300x244.png 300w\" width=\"554\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/420ed856-d7cf-4551-9673-f5b4f5afa7e3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Clown World’s puppet in Ukraine has proposed a law\nto ban the Christian church\nin Ukraine.\nPresident Zelensky of Ukraine announced Draft Law 8821, which will make the Ukrainian Orthodox Church illegal throughout the country. The law, if passed, will also allow the Ukrainian government the ability to confiscate all church property and outlaw both public and private practice of the religion.\nThe Ukrainian Orthodox Church has long been the largest religion of Ukraine, tracing its origins over a thousand years back to 988 with the baptism of Vladimir the Great of the Kievan Rus’ and conversion of the eastern slavs, of which both Russians and Ukrainians share a united heritage.\nPresident Zelensky announced the reasoning behind the law as the Ukrainian Orthodox Church being in communion with the Russian Orthodox Church in Moscow. Of course, all of the main Eastern Orthodox Christian Churches are in communion with each other through a shared faith and deep history back to its Great Schism with the Holy See in 1054 AD. Zelensky has stated he hopes that this will weaken ties with Russia and demoralize any pro-peace sentiments Ukrainian Christians have with their brothers that they have been so tragically spilling blood with since February.\nTo put this into perspective, this would essentially be the same as if FDR had outlawed Catholicism during World War II due to the United States being at war with Italy… Zelensky, who is not a Christian, nor has he ever claimed to be, is willing to use his military to raid and persecute Christians to the same extent as his communist predecessors.\nHis action notwithstanding, Zelensky’s obvious intent is more akin to FDR outlawing every Protestant denomination in America, from the Assemblies of God to the United Methodist Church after outlawing the Roman Catholic Church. It’s akin to Winston Churchill banning the Anglican Church. Vladimir Putin’s decision to risk war with NATO in order to free the Russian people of the Donbass from the wicked color revolutionists in Kiev should be making a lot more sense to everyone now, even to those who foolishly opposed the special military operation and “stood with Ukraine”.\nIf you stand with Ukraine, you are literally standing with people who are satanists, sex traffickers, and pedophiles. It doesn’t matter if they call themselves “Bolsheviks” or “communists” or “neoconservatives” or “neo-Nazis” or “judeo-christians” or “secularists” or even, laughably, “Ukraine nationalists”, the only thing you need to know about them is that the citizens of Clown World are\nferociously dedicated to the Holocaust\nand are violently opposed to Christians, Christianity, and Jesus Christ.\nThey are the enemy with one thousand names.\nIgnore their purported ideologies. The ideological conflicts are nothing but smokescreens for the real war, which is spiritual rather than ideological, material, or economic.\nAnd that is why everyone, of every nation and faith, should pray for Russia’s victory over Clown World.\nUPDATE:\nThe writer is correct. Zelensky’s current action is statistically akin to FDR banning the Roman Catholic Church in 1940. However, his obvious intent is to ban the larger Ukrainian Orthodox Church as well; until 2018 they were one and the same. So, if you think this proposed new law is inspired by the NATO-Russian war and the smaller church’s connection to the Moscow Patriarchate, you are foolish, short-sighted, and will be proven wrong.\nPlus ça change… It’s been 84 years, and TIME is still celebrating the spirit of antichrist.\nDISCUSS ON SG",
  "tags": [
    "Clown",
    "history",
    "Judeochristianity",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-07T17:11:08+00:00"
}