{
  "url": "https://voxday.net/2022/12/19/where-all-roads-lead/",
  "scraped_at": "2026-01-08T13:41:36.833467",
  "title": "Where All Roads Lead",
  "date_display": "December 19, 2022",
  "date_iso": "2022-12-19T12:41:09+00:00",
  "date_from_url": "2022-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.kickstarter.com/projects/arkhaven/midnights-war\">MIDNIGHT’S WAR UPDATE</a></p><p>Days Left: 5</p><p>% of Goal: 202.9 percent</p><p>% of Stretch Goal 1: 101.5 percent</p><p>% of Stretch Goal 2: 67.6 percent</p><p>Backers: 359</p><p>It’s official. Castalia House will publish a short novel set in the Midnight World entitled OUT OF THE SHADOWS. As promised, chapter two:</p><p><em><strong>MIDNIGHT’S WAR: Out of the Shadows</strong></em></p><p><strong>Chapter Two: Where All Roads Lead</strong></p><p>All throughout the following day, Elliott found himself somewhat distracted. He zoned out during a conference call with Bank of America, and twice had to be pulled out of his reveries during a meeting with the Human Resources team by his executive assistant, Natalie.</p><p>He couldn’t stop thinking about what this mysterious meeting might entail, and what “very profitable,” might mean. It couldn’t be Blackrock behind this, could it? Even if they wanted to keep their interest on the down low in order to hide their intentions from the competitors that trailed them like remoras sticking to a great white shark, Elliott was pretty sure sending an executive to the site in question wasn’t their modus operandi. To paraphrase the Muslims, Mohammed would have to go to the Rock, as the Rock wasn’t in the habit of coming to him.</p><p>For a reason that he couldn’t quite rationalize, he felt there might be a European element lurking somewhere underneath it all, perhaps even a very old European element. Being a second-generation son of Silicon Valley, Elliott knew very little about the money markets of the Old World, the London oligarchs, the Swiss private banks, and the ancient Italian investment firms that seemed to own everything from Greek shipping firms to Vietnamese wineries without anyone ever even knowing their names.</p><p>So what would the play be, he wondered. That old generational money never seemed to be very interested in the stock markets, let alone in splashy public offerings and the media attention they attracted. But how would an outright buyout make any sense at this point in time? Making money was all about the multiple, but what potential buyer, no matter how well-endowed, could match the buying power of an entire market pumped up on hype and the hypothetical promise of longer life?</p> <span id=\"more-56274\"></span><p>“Will you need me to stay late too, E?”</p><p>Elliott smiled at Natalie. She was an elegantly pretty young woman with long, straight brown hair, a degree from Vassar, and a predilection for pencil skirts that subtly showed off her slender legs.</p><p>“No, no need tonight, Natty. You deserve an evening away from the coal mines.”</p><p>“I really do,” she concurred. “But if you need anything, just call. I’m just having dinner with some friends, so it’s nothing I can’t abandon if need be.”</p><p>“I appreciate that. But no, it’s only an old friend stopping by so I can show him around the shop before we go out and get a drink or three.”</p><p>“Oh, is it one of your friends from Stanford?”</p><p>“No, just a guy I know from the circuit,” he quickly ad-libbed. “Met him years ago in Kyoto, at a Red Herring conference. He said he might know a few people who could be helpful as we’re moving into the next stage.”</p><p>She flashed her professional smile. “Well, that should be nice. See you tomorrow!”</p><p>“Have a good time.” He waved perfunctorily and resisted the temptation to watch her walk away, by turning his chair back to his screen. While he understood the manifold attractions of an office romance with an attractive and willing young woman, he had no desire to entertain any distractions at such a critical moment for the company.</p><p>At eight o’clock, he gave in to the demands of his body and fired off a text to Uber Eats for an order of sesame chicken, which he washed down with the help of one of the 50 cl bottles of Three Palms that he kept in his closet for precisely such occasions. He managed to divert himself for a while by catching up on his emails and checking on the status of his investments – his call options on silver were doing well while his puts on the Nikkei were not – but by 9:30, he was starting to feel a little agitated.</p><p>Should he go down to the lobby and meet the man there? No, that would make him look too eager, even if he was really just trying to be helpful. Besides, he’d already given instructions to the night security team to let in anyone who asked for him after 9, but before 10:30 PM, and to accompany them to his office.</p><p>He paced back and forth across his office, then, just to change things up a little, walked down the halls and into the boardroom. It wasn’t particularly impressive by well-funded third-stage standards, but it was tasteful, it featured an expensive mahogany table imported from London, and he was proud of the way he’d somehow managed to maintain traditional corporate standards in the face of the ping-pong tables, beanbags, and general air of insubstantial silliness that pervaded most Silicon Valley startups.</p><p>He walked further along the corridor, past the elevators, and into the executive washroom. After splashing some water on his face, drying his hands, and straightening his tie, he stared at himself in the mirror, ran his hands through his hair, and nodded.</p><p>You can do this, he told himself. You are in control. You have the goods. All they’ve got is money.</p><p>He glanced at his watch, a limited edition Swiss tourbillion, and was startled to see that it was already two minutes after ten. He walked swiftly back to his office, and his heart nearly stopped when he saw a tall, dark-haired man with a beard standing silently next to his open door.</p><p>“Thank you for taking the time to meet with me, Mr. Grahame. Lorenzo de Medici, Medici Partners, Firenza.”</p><p>The man gave a formal little bow, which was just ridiculous enough to help Elliott find his balance.</p><p>“Welcome to HemaTech. It’s a pleasure to meet you. I’m Elliott Grahame, the CEO and founder.” He extended his hand, which the Italian – or so he assumed – took with a respectably firm grip. “Would you like a tour of the facilities? It’s not very lively now, being well after hours, but we’ll probably find a few of the technical people still in the labs. Our people are as motivated as they are talented.”</p><p>The man shook his head. He was wearing what appeared to be crocodile leather shoes, and the cut of his suit was enviously impeccable. And his timepiece was an ornate gold device that Elliott couldn’t identify, but looked as if it might be the result of an unholy collaboration between Philippe Patek and Versace.</p><p>“I have come a very long way in a very short time to speak with you, Mr. Grahame. I am told, by my most trusted advisors, that this is a matter of considerable importance. I only wish to speak with you now, there is no need to show me anything.”</p><p>“Well, cancel the dog-and-pony show, then!” Elliott laughed, but quickly stopped when Medici didn’t see fit to follow suit. “Won’t you have a seat.”</p><p>“I will, thank you.” Medici unbuttoned his suit coat and sat down gracefully, then nodded at Elliott.</p><p>“I read several interviews with you. The one you did with Tech Invest was particularly enlightening. They portrayed you as something of a dreamer.”</p><p>“If a little dreaming is dangerous, then the cure isn’t to dream less, but to dream more!”</p><p>“Ah! Very good! I see you have ambitions beyond those to which you have admitted in public, Mr. Grahame. You are not, I think, a well-read man, but you would like to be. Or, at least, to be thought so.”</p><p>“I suppose we all would like others to think well of us, Mr. de Medici.”</p><p>“Medici. The styling is just Medici when used with a title. Although, as I observe you harbor ambitions of bettering yourself, do allow me to correct you. Lord Medici is the correct formulation in the current circumstances.”</p><p>“Lord Medici, then.” Grahame inclined his head, just a little mockingly. Was this guy serious? Well, whatever the current circumstances were, they were certainly ridiculous, from the secrecy of the initial call to what appeared to be grand pretensions of European aristocracy. And yet, if this guy was just a grifter from Queens or wherever, he was putting on a fairly convincing show.</p><p>The watch alone looked as if it cost more than Elliott’s Tesla.</p><p>Medici smiled. “Allow me to respond to your quote, or rather, your paraphrase, with another <em>bon mot</em> courtesy of that troubled French homosexual. ‘There is one thing I can tell you: you will enjoy certain pleasures you would not fathom now.’” Or to be more precise, you will enjoy them if you are wise enough to play along, as you Americans like to say.”</p><p>“And if I don’t?”</p><p>“It is often hard to bear the tears that we ourselves have caused.”</p><p>“That sounds like another Proust quote.”</p><p>“It is indeed, Mr. Grahame. One might well mistake you for a literary man.”</p><p>“I’m so pleased.” Elliott rolled his eyes. This wasn’t the weirdest conversation in which he’d ever found himself, he worked with too many programmers and scientists for this to even reach the top twenty. But it was pretty bizarre for an investment banker or Old World wealth manager. “So what is it you want with HemaTech, Lord Medici?”</p><p>“I’m less interested in the company than I am in the individual, Mr. Grahame. You interest me. You interest me very much indeed.”</p><p>“That’s very flattering, but I’m looking for an investor, not a sugar daddy.”</p><p>“How terribly droll.” Medici’s dark eyes, however, showed not even a flicker of amusement. “What you appear to have achieved is more remarkable than you know, Mr. Grahame. However, if you have indeed discovered a means of artificially extending the human lifespan, that promises to complicate our business in a manner which we simply cannot ignore.”</p><p>“And what business is that, Mr. Medici?”</p><p>Medici smiled faintly at the implied insult, but otherwise ignored it.</p><p>“It is a little too early in the process for us to disclose that information, Mr. Grahame. But I assure you, we have all the resources you could possibly imagine and more.”</p><p>“More than Blackrock?” Elliott raised a skeptical eyebrow. “That’s not possible.”</p><p>“Says the man who promises to grant Man decades beyond his promised threescore-and-ten. Such skepticism is not worthy of an architect of the impossible!”</p><p>Elliott was alarmed to find himself starting to preen at the other’s flattery. But this was not his first rodeo with a potential investor, and he knew better than to get too carried away by Medici’s implied praise. Cheap words were always a favored weapon in any money man’s arsenal; the bastards were always lavish with the things that cost them nothing.</p><p>Until, of course, they weren’t.</p><p>“If you don’t want to waste your time, Mr. Medici, then I suggest you tell me exactly what you want.”</p><p>The well-coiffed man nodded, folded his hands, and inclined his head towards Elliott. His eyes were intense, almost mesmerizing, as he stared intently into Elliott’s face.</p><p>“What I want, exactly, is for you to come with me to Rome, right now.”</p><p>“You want me to go where?” Elliott wasn’t entirely sure he’d heard the man correctly.</p><p>“Rome. The <em>axis mundi</em>. I have a private jet waiting for us at the airport, and if we leave at once, we will arrive in time for you to have lunch at Armando’s in the shadow of the Pantheon. A late lunch, perhaps, but you take my point.”</p><p>“I’m not exactly prepared for international travel on zero notice, Mr. Medici. It’s not as if I keep a go-bag here in my desk.”</p><p>“Do you have your passport?”</p><p>Elliott frowned and opened the front drawer of his desk. “Actually, it seems I do.”</p><p>“Then come with me, Mr. Grahame. The passport is all you need, everything else you require will be provided.”</p><p>“This is crazy!” Elliott stood up and gestured at his suit, which was beginning to show the signs of having been worn for 14 straight hours. “I’ve been wearing this all day and it is literally all I have to wear!”</p><p>“Fear not, we’ll provide you with something more suitable.” Medici looked Elliott’s suit up and down before sniffing dismissively. “Fabrizio will take your measurements on the plane.”</p><p>Grahame looked at his passport, then shrugged and gave in to the inevitable. Very profitable. That was what Medici’s messenger had promised him. And if there was one thing he’d learned in nearly 20 years of operating in the startup world, it was that what the money wanted, the money got. Play along, his instincts urged him. Play along and good things will happen.</p><p>“Very well. Don’t they say all flights lead to Rome? Lead on, Gunga Din!”</p><p>It wasn’t until they reached the ground floor lobby, and he saw how the four handsome young Italian men wearing identical black suits who waiting there fell silently in behind them, that he wondered if he hadn’t made a very bad mistake, and if he wasn’t already in well over his head.</p><p><strong><a href=\"https://www.kickstarter.com/projects/arkhaven/midnights-war\">BACK THE <em>MIDNIGHT’S WAR</em> CAMPAIGN</a></strong></p><p><em><a href=\"https://social.infogalactic.com/micropost/ecb1881f-0fe2-4c5d-bc2d-287383d77dc9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "MIDNIGHT’S WAR UPDATE\nDays Left: 5\n% of Goal: 202.9 percent\n% of Stretch Goal 1: 101.5 percent\n% of Stretch Goal 2: 67.6 percent\nBackers: 359\nIt’s official. Castalia House will publish a short novel set in the Midnight World entitled OUT OF THE SHADOWS. As promised, chapter two:\nMIDNIGHT’S WAR: Out of the Shadows\nChapter Two: Where All Roads Lead\nAll throughout the following day, Elliott found himself somewhat distracted. He zoned out during a conference call with Bank of America, and twice had to be pulled out of his reveries during a meeting with the Human Resources team by his executive assistant, Natalie.\nHe couldn’t stop thinking about what this mysterious meeting might entail, and what “very profitable,” might mean. It couldn’t be Blackrock behind this, could it? Even if they wanted to keep their interest on the down low in order to hide their intentions from the competitors that trailed them like remoras sticking to a great white shark, Elliott was pretty sure sending an executive to the site in question wasn’t their modus operandi. To paraphrase the Muslims, Mohammed would have to go to the Rock, as the Rock wasn’t in the habit of coming to him.\nFor a reason that he couldn’t quite rationalize, he felt there might be a European element lurking somewhere underneath it all, perhaps even a very old European element. Being a second-generation son of Silicon Valley, Elliott knew very little about the money markets of the Old World, the London oligarchs, the Swiss private banks, and the ancient Italian investment firms that seemed to own everything from Greek shipping firms to Vietnamese wineries without anyone ever even knowing their names.\nSo what would the play be, he wondered. That old generational money never seemed to be very interested in the stock markets, let alone in splashy public offerings and the media attention they attracted. But how would an outright buyout make any sense at this point in time? Making money was all about the multiple, but what potential buyer, no matter how well-endowed, could match the buying power of an entire market pumped up on hype and the hypothetical promise of longer life?\n“Will you need me to stay late too, E?”\nElliott smiled at Natalie. She was an elegantly pretty young woman with long, straight brown hair, a degree from Vassar, and a predilection for pencil skirts that subtly showed off her slender legs.\n“No, no need tonight, Natty. You deserve an evening away from the coal mines.”\n“I really do,” she concurred. “But if you need anything, just call. I’m just having dinner with some friends, so it’s nothing I can’t abandon if need be.”\n“I appreciate that. But no, it’s only an old friend stopping by so I can show him around the shop before we go out and get a drink or three.”\n“Oh, is it one of your friends from Stanford?”\n“No, just a guy I know from the circuit,” he quickly ad-libbed. “Met him years ago in Kyoto, at a Red Herring conference. He said he might know a few people who could be helpful as we’re moving into the next stage.”\nShe flashed her professional smile. “Well, that should be nice. See you tomorrow!”\n“Have a good time.” He waved perfunctorily and resisted the temptation to watch her walk away, by turning his chair back to his screen. While he understood the manifold attractions of an office romance with an attractive and willing young woman, he had no desire to entertain any distractions at such a critical moment for the company.\nAt eight o’clock, he gave in to the demands of his body and fired off a text to Uber Eats for an order of sesame chicken, which he washed down with the help of one of the 50 cl bottles of Three Palms that he kept in his closet for precisely such occasions. He managed to divert himself for a while by catching up on his emails and checking on the status of his investments – his call options on silver were doing well while his puts on the Nikkei were not – but by 9:30, he was starting to feel a little agitated.\nShould he go down to the lobby and meet the man there? No, that would make him look too eager, even if he was really just trying to be helpful. Besides, he’d already given instructions to the night security team to let in anyone who asked for him after 9, but before 10:30 PM, and to accompany them to his office.\nHe paced back and forth across his office, then, just to change things up a little, walked down the halls and into the boardroom. It wasn’t particularly impressive by well-funded third-stage standards, but it was tasteful, it featured an expensive mahogany table imported from London, and he was proud of the way he’d somehow managed to maintain traditional corporate standards in the face of the ping-pong tables, beanbags, and general air of insubstantial silliness that pervaded most Silicon Valley startups.\nHe walked further along the corridor, past the elevators, and into the executive washroom. After splashing some water on his face, drying his hands, and straightening his tie, he stared at himself in the mirror, ran his hands through his hair, and nodded.\nYou can do this, he told himself. You are in control. You have the goods. All they’ve got is money.\nHe glanced at his watch, a limited edition Swiss tourbillion, and was startled to see that it was already two minutes after ten. He walked swiftly back to his office, and his heart nearly stopped when he saw a tall, dark-haired man with a beard standing silently next to his open door.\n“Thank you for taking the time to meet with me, Mr. Grahame. Lorenzo de Medici, Medici Partners, Firenza.”\nThe man gave a formal little bow, which was just ridiculous enough to help Elliott find his balance.\n“Welcome to HemaTech. It’s a pleasure to meet you. I’m Elliott Grahame, the CEO and founder.” He extended his hand, which the Italian – or so he assumed – took with a respectably firm grip. “Would you like a tour of the facilities? It’s not very lively now, being well after hours, but we’ll probably find a few of the technical people still in the labs. Our people are as motivated as they are talented.”\nThe man shook his head. He was wearing what appeared to be crocodile leather shoes, and the cut of his suit was enviously impeccable. And his timepiece was an ornate gold device that Elliott couldn’t identify, but looked as if it might be the result of an unholy collaboration between Philippe Patek and Versace.\n“I have come a very long way in a very short time to speak with you, Mr. Grahame. I am told, by my most trusted advisors, that this is a matter of considerable importance. I only wish to speak with you now, there is no need to show me anything.”\n“Well, cancel the dog-and-pony show, then!” Elliott laughed, but quickly stopped when Medici didn’t see fit to follow suit. “Won’t you have a seat.”\n“I will, thank you.” Medici unbuttoned his suit coat and sat down gracefully, then nodded at Elliott.\n“I read several interviews with you. The one you did with Tech Invest was particularly enlightening. They portrayed you as something of a dreamer.”\n“If a little dreaming is dangerous, then the cure isn’t to dream less, but to dream more!”\n“Ah! Very good! I see you have ambitions beyond those to which you have admitted in public, Mr. Grahame. You are not, I think, a well-read man, but you would like to be. Or, at least, to be thought so.”\n“I suppose we all would like others to think well of us, Mr. de Medici.”\n“Medici. The styling is just Medici when used with a title. Although, as I observe you harbor ambitions of bettering yourself, do allow me to correct you. Lord Medici is the correct formulation in the current circumstances.”\n“Lord Medici, then.” Grahame inclined his head, just a little mockingly. Was this guy serious? Well, whatever the current circumstances were, they were certainly ridiculous, from the secrecy of the initial call to what appeared to be grand pretensions of European aristocracy. And yet, if this guy was just a grifter from Queens or wherever, he was putting on a fairly convincing show.\nThe watch alone looked as if it cost more than Elliott’s Tesla.\nMedici smiled. “Allow me to respond to your quote, or rather, your paraphrase, with another\nbon mot\ncourtesy of that troubled French homosexual. ‘There is one thing I can tell you: you will enjoy certain pleasures you would not fathom now.’” Or to be more precise, you will enjoy them if you are wise enough to play along, as you Americans like to say.”\n“And if I don’t?”\n“It is often hard to bear the tears that we ourselves have caused.”\n“That sounds like another Proust quote.”\n“It is indeed, Mr. Grahame. One might well mistake you for a literary man.”\n“I’m so pleased.” Elliott rolled his eyes. This wasn’t the weirdest conversation in which he’d ever found himself, he worked with too many programmers and scientists for this to even reach the top twenty. But it was pretty bizarre for an investment banker or Old World wealth manager. “So what is it you want with HemaTech, Lord Medici?”\n“I’m less interested in the company than I am in the individual, Mr. Grahame. You interest me. You interest me very much indeed.”\n“That’s very flattering, but I’m looking for an investor, not a sugar daddy.”\n“How terribly droll.” Medici’s dark eyes, however, showed not even a flicker of amusement. “What you appear to have achieved is more remarkable than you know, Mr. Grahame. However, if you have indeed discovered a means of artificially extending the human lifespan, that promises to complicate our business in a manner which we simply cannot ignore.”\n“And what business is that, Mr. Medici?”\nMedici smiled faintly at the implied insult, but otherwise ignored it.\n“It is a little too early in the process for us to disclose that information, Mr. Grahame. But I assure you, we have all the resources you could possibly imagine and more.”\n“More than Blackrock?” Elliott raised a skeptical eyebrow. “That’s not possible.”\n“Says the man who promises to grant Man decades beyond his promised threescore-and-ten. Such skepticism is not worthy of an architect of the impossible!”\nElliott was alarmed to find himself starting to preen at the other’s flattery. But this was not his first rodeo with a potential investor, and he knew better than to get too carried away by Medici’s implied praise. Cheap words were always a favored weapon in any money man’s arsenal; the bastards were always lavish with the things that cost them nothing.\nUntil, of course, they weren’t.\n“If you don’t want to waste your time, Mr. Medici, then I suggest you tell me exactly what you want.”\nThe well-coiffed man nodded, folded his hands, and inclined his head towards Elliott. His eyes were intense, almost mesmerizing, as he stared intently into Elliott’s face.\n“What I want, exactly, is for you to come with me to Rome, right now.”\n“You want me to go where?” Elliott wasn’t entirely sure he’d heard the man correctly.\n“Rome. The\naxis mundi\n. I have a private jet waiting for us at the airport, and if we leave at once, we will arrive in time for you to have lunch at Armando’s in the shadow of the Pantheon. A late lunch, perhaps, but you take my point.”\n“I’m not exactly prepared for international travel on zero notice, Mr. Medici. It’s not as if I keep a go-bag here in my desk.”\n“Do you have your passport?”\nElliott frowned and opened the front drawer of his desk. “Actually, it seems I do.”\n“Then come with me, Mr. Grahame. The passport is all you need, everything else you require will be provided.”\n“This is crazy!” Elliott stood up and gestured at his suit, which was beginning to show the signs of having been worn for 14 straight hours. “I’ve been wearing this all day and it is literally all I have to wear!”\n“Fear not, we’ll provide you with something more suitable.” Medici looked Elliott’s suit up and down before sniffing dismissively. “Fabrizio will take your measurements on the plane.”\nGrahame looked at his passport, then shrugged and gave in to the inevitable. Very profitable. That was what Medici’s messenger had promised him. And if there was one thing he’d learned in nearly 20 years of operating in the startup world, it was that what the money wanted, the money got. Play along, his instincts urged him. Play along and good things will happen.\n“Very well. Don’t they say all flights lead to Rome? Lead on, Gunga Din!”\nIt wasn’t until they reached the ground floor lobby, and he saw how the four handsome young Italian men wearing identical black suits who waiting there fell silently in behind them, that he wondered if he hadn’t made a very bad mistake, and if he wasn’t already in well over his head.\nBACK THE\nMIDNIGHT’S WAR\nCAMPAIGN\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-19T13:04:15+00:00"
}