{
  "url": "https://voxday.net/2022/12/14/why-russia-will-defeat-clown-world/",
  "scraped_at": "2026-01-08T13:41:02.757635",
  "title": "Why Russia Will Defeat Clown World",
  "date_display": "December 14, 2022",
  "date_iso": "2022-12-14T12:26:04+00:00",
  "date_from_url": "2022-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Much can be usefully learned from this excerpt from a book published in 1989 concerning a brief conversation that took place forty years prior between a German Army officer and a Soviet political officer.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Much to my surprise, the NKVD officer expressed a wish to speak to me alone in the presence of the interpreter.</p><p>“<em>Polkovnik</em>,” he said, “a question: how many convinced Communists do you think there are in this and the other German POW camps?” Was it a catch question? It was hard to answer, and it also seemed to me dangerous to give my own views. So I said, “About ten percent, I should think.”</p><p>“Oh, no; at most six to seven percent,” he replied. “And <em>Polkovnik</em>, how many do you think there are in East Germany?”</p><p>“Since you have been in East Germany now for nearly five years, it might be some eight to ten percent.”</p><p>“At most three to four percent. And what about West Germany?” Surprised by his figures, I suggested, “Less, about two to three percent.” To which he gave an even more astonishing reply, “Nil. You see, we are realists in Moscow. And because we are, we see no chance of being able to convince the German people of communism.” His conclusion, “Neither the Italian nor the French Communists can be numbered among us. They are first and foremost Italians and Frenchmen. Britain is on the other side of the Channel, the Americans are far away. But we do have to reckon with you.”</p><p>And then his words held doubt and fear again, “One day you will want to have an army again, with which you will invade us again. There lies our whole interest in keeping Germany ‘neutral.“ With a neutral Germany danger for us is banished. We can convince Europe of our desire, but also of our intention, never again to allow a war on our territory. That’s how things look, <em>Polkovnik</em>.”</p><p>This was one of the most interesting and instructive conversations I had as a prisoner of war. The view was in keeping with that of ordinary soldiers, Russian convicts, and civilians, who had already said to me previously, “Although it will be hard for us, we shall one day forget what has happened. But you will go back to your country. Then you will build up a new army and march into Russia, destroy our villages and kill or carry off our people.” How can this fear ever be removed from the people or from the “realists” in Moscow? All the noisy reactions to the rebuilding of the Bundeswehr, the federal army, and to the alliance with the American superpower are to be seen against this background.</p> <cite><em>PANZER COMMANDER</em> by Col Hans von Luck</cite></blockquote><p>The Russians trusted, briefly, in the promises made to them in the early days of the post-Soviet era. After seeing their economy raped and their boundaries methodically encroached upon by the very Satanic clowns who previously ruled over them, they will never again give the benefit of any doubt to Clown World’s servants in Germany, the UK, or the USA.</p><p>And they <a href=\"https://www.rt.com/russia/568189-uk-troops-ukraine-operations/\">have very good reason</a> to place absolutely no trust in them.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>British general admits UK deployed troops to Ukraine</strong></p><p>British Royal Marines conducted high-risk operations in Ukraine in April, Lieutenant General Robert Magowan has admitted, according to a report in The Times on Tuesday. Russia has consistently warned that NATO troops have been active in the conflict, but these statements have been dismissed by Western analysts and media.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/bfa2d6af-008c-41c9-bf45-35579c652a41\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Much can be usefully learned from this excerpt from a book published in 1989 concerning a brief conversation that took place forty years prior between a German Army officer and a Soviet political officer.\nMuch to my surprise, the NKVD officer expressed a wish to speak to me alone in the presence of the interpreter.\n“\nPolkovnik\n,” he said, “a question: how many convinced Communists do you think there are in this and the other German POW camps?” Was it a catch question? It was hard to answer, and it also seemed to me dangerous to give my own views. So I said, “About ten percent, I should think.”\n“Oh, no; at most six to seven percent,” he replied. “And\nPolkovnik\n, how many do you think there are in East Germany?”\n“Since you have been in East Germany now for nearly five years, it might be some eight to ten percent.”\n“At most three to four percent. And what about West Germany?” Surprised by his figures, I suggested, “Less, about two to three percent.” To which he gave an even more astonishing reply, “Nil. You see, we are realists in Moscow. And because we are, we see no chance of being able to convince the German people of communism.” His conclusion, “Neither the Italian nor the French Communists can be numbered among us. They are first and foremost Italians and Frenchmen. Britain is on the other side of the Channel, the Americans are far away. But we do have to reckon with you.”\nAnd then his words held doubt and fear again, “One day you will want to have an army again, with which you will invade us again. There lies our whole interest in keeping Germany ‘neutral.“ With a neutral Germany danger for us is banished. We can convince Europe of our desire, but also of our intention, never again to allow a war on our territory. That’s how things look,\nPolkovnik\n.”\nThis was one of the most interesting and instructive conversations I had as a prisoner of war. The view was in keeping with that of ordinary soldiers, Russian convicts, and civilians, who had already said to me previously, “Although it will be hard for us, we shall one day forget what has happened. But you will go back to your country. Then you will build up a new army and march into Russia, destroy our villages and kill or carry off our people.” How can this fear ever be removed from the people or from the “realists” in Moscow? All the noisy reactions to the rebuilding of the Bundeswehr, the federal army, and to the alliance with the American superpower are to be seen against this background.\nPANZER COMMANDER\nby Col Hans von Luck\nThe Russians trusted, briefly, in the promises made to them in the early days of the post-Soviet era. After seeing their economy raped and their boundaries methodically encroached upon by the very Satanic clowns who previously ruled over them, they will never again give the benefit of any doubt to Clown World’s servants in Germany, the UK, or the USA.\nAnd they\nhave very good reason\nto place absolutely no trust in them.\nBritish general admits UK deployed troops to Ukraine\nBritish Royal Marines conducted high-risk operations in Ukraine in April, Lieutenant General Robert Magowan has admitted, according to a report in The Times on Tuesday. Russia has consistently warned that NATO troops have been active in the conflict, but these statements have been dismissed by Western analysts and media.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Clown World",
    "history",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-12-14T12:26:06+00:00"
}