{
  "url": "https://voxday.net/2022/05/04/antifragile/",
  "scraped_at": "2026-01-08T13:18:03.912866",
  "title": "ANTIFRAGILE",
  "date_display": "May 4, 2022",
  "date_iso": "2022-05-04T14:50:03+00:00",
  "date_from_url": "2022-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The 16th book in <a href=\"https://arkhavencomics.com/product/castalia-library-subscription/\">the Castalia Library subscription (May-June)</a> is <em>ANTIFRAGILE</em>, by bestselling author Nassim Nicholas Taleb. It’s arguably Taleb’s most important book, given the challenges presented in this day and age, and I consider it to be an absolutely essential read.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. Yet, in spite of the ubiquity of the phenomenon, there is no word for the exact opposite of fragile. Let us call it antifragile. Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets better.</p><cite>NN Taleb</cite></blockquote><p>If you are a May-June subscriber, you will receive <em>ANTIFRAGILE </em>when it is produced. If you wish to buy a copy but do not have a subscription, you will have to either a) <a href=\"https://arkhavencomics.com/product/castalia-library-subscription/\">subscribe </a>or b) wait until the books are bound and the unsold portion of the print run goes on sale. A limited print run of 900 Library and 100 Libraria editions of <em>ANTIFRAGILE </em>will be bound.</p><p>Also, for the first time, Castalia House is offering an individual deluxe, leather-bound edition as part of the Castalia Library that is <span style=\"text-decoration: underline;\">not</span> included in the Library subscription. This is Taleb’s first bestseller, <em>THE BLACK SWAN</em>, <a href=\"https://arkhavencomics.com/product/black-swan-library-edition/\">which is available at the subscription price</a> for subscribers using the subscription discount code. Please note that the image on the page is merely a placeholder, as we have not yet designed the cover or the spine of the Library edition. A Libraria edition <a href=\"https://arkhavencomics.com/product/black-swan-libraria-edition/\">is also available</a>.</p><p>A limited print run of 900 Library and 100 Libraria editions of <em>THE BLACK SWAN</em> will be bound. Both books will be part of a four-volume deluxe <em>INCERTO </em>collection.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0159a513-9a25-4aeb-ba0d-b5f34267f6b6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The 16th book in\nthe Castalia Library subscription (May-June)\nis\nANTIFRAGILE\n, by bestselling author Nassim Nicholas Taleb. It’s arguably Taleb’s most important book, given the challenges presented in this day and age, and I consider it to be an absolutely essential read.\nSome things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. Yet, in spite of the ubiquity of the phenomenon, there is no word for the exact opposite of fragile. Let us call it antifragile. Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets better.\nNN Taleb\nIf you are a May-June subscriber, you will receive\nANTIFRAGILE\nwhen it is produced. If you wish to buy a copy but do not have a subscription, you will have to either a)\nsubscribe\nor b) wait until the books are bound and the unsold portion of the print run goes on sale. A limited print run of 900 Library and 100 Libraria editions of\nANTIFRAGILE\nwill be bound.\nAlso, for the first time, Castalia House is offering an individual deluxe, leather-bound edition as part of the Castalia Library that is\nnot\nincluded in the Library subscription. This is Taleb’s first bestseller,\nTHE BLACK SWAN\n,\nwhich is available at the subscription price\nfor subscribers using the subscription discount code. Please note that the image on the page is merely a placeholder, as we have not yet designed the cover or the spine of the Library edition. A Libraria edition\nis also available\n.\nA limited print run of 900 Library and 100 Libraria editions of\nTHE BLACK SWAN\nwill be bound. Both books will be part of a four-volume deluxe\nINCERTO\ncollection.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-04T14:56:40+00:00"
}