{
  "url": "https://voxday.net/2022/05/19/beyond-cringe/",
  "scraped_at": "2026-01-08T13:19:32.145365",
  "title": "Beyond Cringe",
  "date_display": "May 19, 2022",
  "date_iso": "2022-05-19T14:51:59+00:00",
  "date_from_url": "2022-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whenever anyone, most probably though not necessarily a Boomer, waxes on about how cool the literary mediocrities known as the Beat Generation were, note that this is what passed for the epitome of cool to their twisted little minds. It’s apparently the most exciting and most dramatic moment of <em>ON THE ROAD </em>by Jack Kerouac, which is to say, Neal Cassady’s big night out on Folsom Street in San Francisco.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>«Come on, Galatea, Marie, let’s go hit the jazz joints and forget it. Dean will be dead someday.<br/>Then what can you say to him?»</p><p>«The sooner he’s dead the better,» said Galatea, and she spoke officially for almost everyone in the room.</p><p>«Very well, then,» I said, «but now he’s alive and I’ll bet you want to know what he does next and that’s because he’s got the secret that we’re all busting to find and it’s splitting his head wide open and if he goes mad don’t worry, it won’t be your fault but the fault of God.» They objected to this; they said I really didn’t know Dean; they said he was the worst scoundrel that ever lived and I’d find out someday to my regret. I was amused to hear them protest so much.</p><p>Roy Johnson rose to the defense of the ladies and said he knew Dean better than anybody, and all Dean was, was just a very interesting and even amusing con-man. I went out to find Dean and we had a brief talk about it. «Ah, man, don’t worry, everything is perfect and fine.» He was rubbing his belly and licking his lips.</p><p>The girls came down and we started out on our big night, once more pushing the car down the street. «Wheeoo! let’s go!» cried Dean, and we jumped in the back seat and clanked to the little Harlem on Folsom Street.</p><p>Out we jumped in the warm, mad night, hearing a wild tenorman bawling horn across the way, going «EE-YAH! EE-YAH! EE-YAH!» and hands clapping to the beat and folks yelling, «Go, go, go!» Dean was already racing across the street with his thumb in the air, yelling, «Blow, man, blow!» A bunch of colored men in Saturday-night suits were whooping it up in front. It was a sawdust saloon with a small bandstand on which the fellows huddled with their hats on, blowing over people’s heads, a crazy place; crazy floppy sponren wandered around sometimes in their bathrobes, bottles clanked in alleys. In back of the joint in a dark corridor beyond the splattered toilets scores of men and women stood against the wall drinking wine-spodiodi and spitting at the stars – wine and whisky.</p><p>The behatted tenorman was blowing at the peak of a wonderfully satisfactory free idea, a rising and falling riff that went from «EE-yah!» to a crazier «EE-de-lee-yah!» and blasted along to the rolling crash of butt-scarred drums hammered by a big brutal Negro with a bullneck who didn’t give a damn about anything but punishing his busted tubs, crash, rattle-ti-boom, crash. Uproars of music and the tenorman had it and everybody knew he had it. Dean was clutching his head in the crowd, and it was a mad crowd. They were all urging that tenorman to hold it and keep it with cries and wild eyes, and he was raising himself from a crouch and going down again with his horn, looping it up in a clear cry above the furor. A six-foot skinny Negro woman was rolling her bones at the man’s hornbell, and he just jabbed it at her, «Ee! ee! ee!»</p><p>Everybody was rocking and roaring. Galatea and Marie with beer in their hands were standing on their chairs, shaking and jumping. Groups of colored guys stumbled in from the street, falling over one another to get there. «Stay with it, man!» roared a man with a foghorn voice, and let out a big groan that must have been heard clear out in Sacramento, ah-haa! «Whoo!» said Dean. He was rubbing his chest, his belly; the sweat splashed from his face. Boom, kick, that drummer was kicking his drums down the cellar and rolling the beat upstairs with his murderous sticks, rattlety-boom! A big fat man was jumping on the platform, making it sag and creak. «Yoo!» The pianist was only pounding the keys with spread-eagled fingers, chords, at intervals when the great tenorman was drawing breath for another blast – Chinese chords, shuddering the piano in every timber, chink, and wire, boing! The tenorman jumped down from the platform and stood in the crowd, blowing around; his hat was over his eyes; somebody pushed it back for him. He just hauled back and stamped his foot and blew down a hoarse, laughing blast, and drew breath, and raised the horn and blew high, wide, and screaming in the air. Dean was directly in front of him with his face lowered to the bell of the horn, clapping his hands, pouring sweat on the man’s keys, and the man noticed and laughed in his horn a long quivering crazy laugh, and everybody else laughed and they rocked and rocked; and finally the tenorman decided to blow his top and crouched down and held a note in high C for a long time as everything else crashed along and the cries increased and I thought the cops would come swarming from the nearest precinct. Dean was in a trance. The tenorman’s eyes were fixed straight on him; he had a madman who not only understood but cared and wanted to understand more and much more than there was, and they began dueling for this; everything came out of the horn, no more phrases, just cries, cries, «Baugh» and down to «Beep!» and up to «EEEEE!» and down to clinkers and over to sideways-echoing horn-sounds. He tried everything, up, down, sideways, upside down, horizontal, thirty degrees, forty degrees, and finally he fell back in somebody’s arms and gave up and everybody pushed around and yelled, «Yes! Yes! He blowed that one!» Dean wiped himself with his handkerchief.</p></blockquote><p>How very incredibly exciting. Note that the intrepid duo followed up this fascinating public performance by abandoning the girls and running off with the black saxophonist, then getting picked up and spending the night in a hotel room with “a tall, thin fag who was on his way home to Kansas.”</p><p>Anyone who praises the work of the Beat Generation is either a) lying or b) hasn’t ever actually read any of it. It doesn’t even rise to the level of mediocre, it’s downright awful in terms of style, story, and characters, and that’s without even getting into the degeneracy and malignant narcissism of the subjects. There is nothing of the Good, the Beautiful, or the True in it. Their works are considerably closer to case studies in mental illness than anything approaching either fiction or biography.</p><p>And let’s not get started on the gay Jewish pedophile who tried to pass off his juvenile odes to mental illness and degeneracy as poetry. The self-styled greatest minds of his generation sure look <a href=\"https://infogalactic.com/w/images/5/53/Allen_Ginsberg_und_Peter_Orlowski_ArM.jpg\">a lot more like Dumb and Dumber</a>, don’t you think? From an artistic perspective, Ginsberg was nothing more than the male Lena Dunham of his day, although we are fortunate that, unlike Dunham, he did not have access to Hollywood budgets or video production equipment in his youth.</p><p>I’m not a big fan of the Generation Z habit of labeling everything “cringe”, but if the concept applies to anything on this planet, it applies to the fake, gay Beats and the Boomers who idolized them.</p><p><strong>UPDATE:</strong> I think this very positive review of Kerouac’s book sums up both its quality and its appeal very well.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One The Road is the best book i have ever read.</p></blockquote><p>Indeed.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1c3a1c44-ff7f-485e-a2bf-aa2c9e345985\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Whenever anyone, most probably though not necessarily a Boomer, waxes on about how cool the literary mediocrities known as the Beat Generation were, note that this is what passed for the epitome of cool to their twisted little minds. It’s apparently the most exciting and most dramatic moment of\nON THE ROAD\nby Jack Kerouac, which is to say, Neal Cassady’s big night out on Folsom Street in San Francisco.\n«Come on, Galatea, Marie, let’s go hit the jazz joints and forget it. Dean will be dead someday.\nThen what can you say to him?»\n«The sooner he’s dead the better,» said Galatea, and she spoke officially for almost everyone in the room.\n«Very well, then,» I said, «but now he’s alive and I’ll bet you want to know what he does next and that’s because he’s got the secret that we’re all busting to find and it’s splitting his head wide open and if he goes mad don’t worry, it won’t be your fault but the fault of God.» They objected to this; they said I really didn’t know Dean; they said he was the worst scoundrel that ever lived and I’d find out someday to my regret. I was amused to hear them protest so much.\nRoy Johnson rose to the defense of the ladies and said he knew Dean better than anybody, and all Dean was, was just a very interesting and even amusing con-man. I went out to find Dean and we had a brief talk about it. «Ah, man, don’t worry, everything is perfect and fine.» He was rubbing his belly and licking his lips.\nThe girls came down and we started out on our big night, once more pushing the car down the street. «Wheeoo! let’s go!» cried Dean, and we jumped in the back seat and clanked to the little Harlem on Folsom Street.\nOut we jumped in the warm, mad night, hearing a wild tenorman bawling horn across the way, going «EE-YAH! EE-YAH! EE-YAH!» and hands clapping to the beat and folks yelling, «Go, go, go!» Dean was already racing across the street with his thumb in the air, yelling, «Blow, man, blow!» A bunch of colored men in Saturday-night suits were whooping it up in front. It was a sawdust saloon with a small bandstand on which the fellows huddled with their hats on, blowing over people’s heads, a crazy place; crazy floppy sponren wandered around sometimes in their bathrobes, bottles clanked in alleys. In back of the joint in a dark corridor beyond the splattered toilets scores of men and women stood against the wall drinking wine-spodiodi and spitting at the stars – wine and whisky.\nThe behatted tenorman was blowing at the peak of a wonderfully satisfactory free idea, a rising and falling riff that went from «EE-yah!» to a crazier «EE-de-lee-yah!» and blasted along to the rolling crash of butt-scarred drums hammered by a big brutal Negro with a bullneck who didn’t give a damn about anything but punishing his busted tubs, crash, rattle-ti-boom, crash. Uproars of music and the tenorman had it and everybody knew he had it. Dean was clutching his head in the crowd, and it was a mad crowd. They were all urging that tenorman to hold it and keep it with cries and wild eyes, and he was raising himself from a crouch and going down again with his horn, looping it up in a clear cry above the furor. A six-foot skinny Negro woman was rolling her bones at the man’s hornbell, and he just jabbed it at her, «Ee! ee! ee!»\nEverybody was rocking and roaring. Galatea and Marie with beer in their hands were standing on their chairs, shaking and jumping. Groups of colored guys stumbled in from the street, falling over one another to get there. «Stay with it, man!» roared a man with a foghorn voice, and let out a big groan that must have been heard clear out in Sacramento, ah-haa! «Whoo!» said Dean. He was rubbing his chest, his belly; the sweat splashed from his face. Boom, kick, that drummer was kicking his drums down the cellar and rolling the beat upstairs with his murderous sticks, rattlety-boom! A big fat man was jumping on the platform, making it sag and creak. «Yoo!» The pianist was only pounding the keys with spread-eagled fingers, chords, at intervals when the great tenorman was drawing breath for another blast – Chinese chords, shuddering the piano in every timber, chink, and wire, boing! The tenorman jumped down from the platform and stood in the crowd, blowing around; his hat was over his eyes; somebody pushed it back for him. He just hauled back and stamped his foot and blew down a hoarse, laughing blast, and drew breath, and raised the horn and blew high, wide, and screaming in the air. Dean was directly in front of him with his face lowered to the bell of the horn, clapping his hands, pouring sweat on the man’s keys, and the man noticed and laughed in his horn a long quivering crazy laugh, and everybody else laughed and they rocked and rocked; and finally the tenorman decided to blow his top and crouched down and held a note in high C for a long time as everything else crashed along and the cries increased and I thought the cops would come swarming from the nearest precinct. Dean was in a trance. The tenorman’s eyes were fixed straight on him; he had a madman who not only understood but cared and wanted to understand more and much more than there was, and they began dueling for this; everything came out of the horn, no more phrases, just cries, cries, «Baugh» and down to «Beep!» and up to «EEEEE!» and down to clinkers and over to sideways-echoing horn-sounds. He tried everything, up, down, sideways, upside down, horizontal, thirty degrees, forty degrees, and finally he fell back in somebody’s arms and gave up and everybody pushed around and yelled, «Yes! Yes! He blowed that one!» Dean wiped himself with his handkerchief.\nHow very incredibly exciting. Note that the intrepid duo followed up this fascinating public performance by abandoning the girls and running off with the black saxophonist, then getting picked up and spending the night in a hotel room with “a tall, thin fag who was on his way home to Kansas.”\nAnyone who praises the work of the Beat Generation is either a) lying or b) hasn’t ever actually read any of it. It doesn’t even rise to the level of mediocre, it’s downright awful in terms of style, story, and characters, and that’s without even getting into the degeneracy and malignant narcissism of the subjects. There is nothing of the Good, the Beautiful, or the True in it. Their works are considerably closer to case studies in mental illness than anything approaching either fiction or biography.\nAnd let’s not get started on the gay Jewish pedophile who tried to pass off his juvenile odes to mental illness and degeneracy as poetry. The self-styled greatest minds of his generation sure look\na lot more like Dumb and Dumber\n, don’t you think? From an artistic perspective, Ginsberg was nothing more than the male Lena Dunham of his day, although we are fortunate that, unlike Dunham, he did not have access to Hollywood budgets or video production equipment in his youth.\nI’m not a big fan of the Generation Z habit of labeling everything “cringe”, but if the concept applies to anything on this planet, it applies to the fake, gay Beats and the Boomers who idolized them.\nUPDATE:\nI think this very positive review of Kerouac’s book sums up both its quality and its appeal very well.\nOne The Road is the best book i have ever read.\nIndeed.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-19T16:30:11+00:00"
}