{
  "url": "https://voxday.net/2022/05/21/deflation-cometh/",
  "scraped_at": "2026-01-08T13:19:43.665622",
  "title": "Deflation Cometh",
  "date_display": "May 21, 2022",
  "date_iso": "2022-05-21T13:02:15+00:00",
  "date_from_url": "2022-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The sudden, rampant inflation that we’re seeing is the result of the neo-liberal rules-based world order’s attempt to preserve its hegemony. It’s not the usual excess money supply caused by low interest rates creating more debt money; if it were, interest rates could simply be raised to keep inflation under control. But with <a href=\"https://www.bbc.com/news/business-61505842\">the first sovereign default of the next wave</a>, which comes from an unexpected source, it’s clear that the deflationary forces are going to rapidly overwhelm the government spending meant to substitute for new loan creation.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Sri Lanka has defaulted on its debt for the first time in its history as the country struggles with its worst financial crisis in more than 70 years.</p><p>A 30-day grace period to come up with $78m (£63m) of unpaid debt interest payments expired on Wednesday.</p><p>The governor of the South Asian nation’s central bank said the country was now in a “pre-emptive default”. Later on Thursday, two of the world’s biggest credit rating agencies also said Sri Lanka had defaulted.</p><p>Defaults happen when governments are unable to meet some or all of their debt payments to creditors. It can damage a country’s reputation with investors, making it harder for it to borrow the money it needs on international markets, which can further harm confidence in its currency and economy.</p><p>Asked on Thursday whether the country was now in default, central bank governor P Nandalal Weerasinghe said: “Our position is very clear, we said that until they come to the restructure [of our debts], we will not be able to pay. So that’s what you call pre-emptive default. There can be technical definitions… from their side they can consider it a default. Our position is very clear, until there is a debt restructure, we cannot repay,” he added.Sri Lanka is seeking to restructure debts of more than $50bn it owes to foreign creditors, to make it more manageable to repay.</p></blockquote><p>When even relatively small economies vanish $50 billion from the money supply at a shot, it should be easy to understand how it will be impossible to salvage the global financial system when the massive corporate institutions start defaulting.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5b77e9ac-fa1b-4256-a2b0-e4cda22b9548\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The sudden, rampant inflation that we’re seeing is the result of the neo-liberal rules-based world order’s attempt to preserve its hegemony. It’s not the usual excess money supply caused by low interest rates creating more debt money; if it were, interest rates could simply be raised to keep inflation under control. But with\nthe first sovereign default of the next wave\n, which comes from an unexpected source, it’s clear that the deflationary forces are going to rapidly overwhelm the government spending meant to substitute for new loan creation.\nSri Lanka has defaulted on its debt for the first time in its history as the country struggles with its worst financial crisis in more than 70 years.\nA 30-day grace period to come up with $78m (£63m) of unpaid debt interest payments expired on Wednesday.\nThe governor of the South Asian nation’s central bank said the country was now in a “pre-emptive default”. Later on Thursday, two of the world’s biggest credit rating agencies also said Sri Lanka had defaulted.\nDefaults happen when governments are unable to meet some or all of their debt payments to creditors. It can damage a country’s reputation with investors, making it harder for it to borrow the money it needs on international markets, which can further harm confidence in its currency and economy.\nAsked on Thursday whether the country was now in default, central bank governor P Nandalal Weerasinghe said: “Our position is very clear, we said that until they come to the restructure [of our debts], we will not be able to pay. So that’s what you call pre-emptive default. There can be technical definitions… from their side they can consider it a default. Our position is very clear, until there is a debt restructure, we cannot repay,” he added.Sri Lanka is seeking to restructure debts of more than $50bn it owes to foreign creditors, to make it more manageable to repay.\nWhen even relatively small economies vanish $50 billion from the money supply at a shot, it should be easy to understand how it will be impossible to salvage the global financial system when the massive corporate institutions start defaulting.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-21T13:02:17+00:00"
}