{
  "url": "https://voxday.net/2022/05/18/interview-with-susan-cooper/",
  "scraped_at": "2026-01-08T13:19:26.665306",
  "title": "Interview with Susan Cooper",
  "date_display": "May 18, 2022",
  "date_iso": "2022-05-18T09:33:44+00:00",
  "date_from_url": "2022-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An illuminating 1999 interview <a href=\"https://d.lib.rochester.edu/camelot/text/interview-with-susan-cooper\">with the author</a> of <em>THE DARK IS RISING</em> series.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>RT: The books comprise a series. Did you find that what you had written in the earlier books committed you to directions that you subsequently regretted, or wished you had more freedom to change?</p><p>SC: No. It was wonderful. It was like writing a symphony, in which each movement is different and yet they all link together. I wish my imagination would give me another shape like that because there are all kinds of satisfactions inside it. Things link together, an early book leads to something in a later book. When I wrote the first book, of course, I didn’t envision a series, but later, when I first had the idea of writing, not just the second book, but the whole sequence, I drew up a plan on a piece of paper. I had little notes written down: I had the four times of the year–focused upon the solstices, Beltane, and such festivals–I had places, and, very roughly, the characters who were in each book. I remember that under <em>The Grey King</em> there was a boy called Bran, but I didn’t know who he was. So that was the only thing that limited me.</p><p>There were things I had to remember from early books that had to be either resolved or referred to in later books. Once in a great while some particularly bright child will write me a letter saying, you never said what happened to . . . . But I didn’t find it restricting. No.</p><p>RT: Are there any particular details you would like to change, looking back in retrospect?</p><p>SC: I would like to have developed the three Drew children more fully in the first book. They develop as the series progresses, but they’re very corny kids’ book characters in <em>Over Sea, Under Stone</em>, it seems to me. I hadn’t gotten to know them.</p><p>RT: As the series progresses, Jane in particular grows more interesting, doesn’t she?</p><p>SC: Yes. Jane is someone I always wanted to write about again. <em>Silver on the Tree</em> suffered from being the last book where I was tying up all the ends. It has too much in it. My head was going off in all directions. Its structure is not terrific. There was even more in it, but I took some out. Of course when you’re dealing with the substance of myth, which is the fight between good and evil, I suppose, you have to provide the ultimate, terrific, enormous climax. It’s almost impossible.</p></blockquote><p>I’m not promising anything, not yet, but I am optimistic that we may eventually be able to release a Castalia Library edition of the series. And if so, the bar will be a fairly high one to clear, as the Easton Press edition is arguably the most beautiful set that Easton has ever produced.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9b984955-998c-4058-93bd-a737118f0af3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An illuminating 1999 interview\nwith the author\nof\nTHE DARK IS RISING\nseries.\nRT: The books comprise a series. Did you find that what you had written in the earlier books committed you to directions that you subsequently regretted, or wished you had more freedom to change?\nSC: No. It was wonderful. It was like writing a symphony, in which each movement is different and yet they all link together. I wish my imagination would give me another shape like that because there are all kinds of satisfactions inside it. Things link together, an early book leads to something in a later book. When I wrote the first book, of course, I didn’t envision a series, but later, when I first had the idea of writing, not just the second book, but the whole sequence, I drew up a plan on a piece of paper. I had little notes written down: I had the four times of the year–focused upon the solstices, Beltane, and such festivals–I had places, and, very roughly, the characters who were in each book. I remember that under\nThe Grey King\nthere was a boy called Bran, but I didn’t know who he was. So that was the only thing that limited me.\nThere were things I had to remember from early books that had to be either resolved or referred to in later books. Once in a great while some particularly bright child will write me a letter saying, you never said what happened to . . . . But I didn’t find it restricting. No.\nRT: Are there any particular details you would like to change, looking back in retrospect?\nSC: I would like to have developed the three Drew children more fully in the first book. They develop as the series progresses, but they’re very corny kids’ book characters in\nOver Sea, Under Stone\n, it seems to me. I hadn’t gotten to know them.\nRT: As the series progresses, Jane in particular grows more interesting, doesn’t she?\nSC: Yes. Jane is someone I always wanted to write about again.\nSilver on the Tree\nsuffered from being the last book where I was tying up all the ends. It has too much in it. My head was going off in all directions. Its structure is not terrific. There was even more in it, but I took some out. Of course when you’re dealing with the substance of myth, which is the fight between good and evil, I suppose, you have to provide the ultimate, terrific, enormous climax. It’s almost impossible.\nI’m not promising anything, not yet, but I am optimistic that we may eventually be able to release a Castalia Library edition of the series. And if so, the bar will be a fairly high one to clear, as the Easton Press edition is arguably the most beautiful set that Easton has ever produced.\nDISCUSS ON SG",
  "tags": [
    "books",
    "interview",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-18T09:33:47+00:00"
}