{
  "url": "https://voxday.net/2022/05/24/national-review-is-literally-gay/",
  "scraped_at": "2026-01-08T13:20:03.938656",
  "title": "National Review is Literally Gay",
  "date_display": "May 24, 2022",
  "date_iso": "2022-05-24T12:38:03+00:00",
  "date_from_url": "2022-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We always knew conservatism was a fraudulent failure of a pseudo-ideological movement. But lo and behold, it turns out that the conservative movement <a href=\"https://www.lifesitenews.com/blogs/national-review-has-unconditionally-surrendered-to-same-sex-marriage/\">is literally fake and gay</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Until a few days ago, few people outside the offices of National Review knew that the revered conservative magazine’s publisher is a homosexual, “married” to a man.</p><p>“The publisher of the most important conservative magazine of the last 60 years, National Review, is gay-married?” wrote The Stream’s Peter Wolfgang, who broke the story. “Garrett Bewkes, the man overseeing the magazine once edited by William F. Buckley, has a husband.”</p><p>“He’s been the publisher for five years. How did this happen? And what does it mean for the conservative movement and the Republican party?” Wolfgang asked.  “I suspect a lot of NR’s long-time readers don’t know this. I wouldn’t have known if a local newspaper hadn’t run an article by Bewkes’ ‘husband’ Bradley.”</p></blockquote><p>Just wait until conservatives learn that their historical opinion leader, William F. Buckley, was gay too, as was conservative icon Malcolm Forbes. This is why one has to be either stupid or ignorant to call oneself a political “conservative” – something you may recall that I have <a href=\"https://social.infogalactic.com/micropost/bbb9532a-4fa7-443d-b795-b678562226a5\">never</a>, <a href=\"https://voxday.net/2013/01/30/i-am-still-not-conservative/\">ever</a>, done – because conservatism is not only not an ideology, it is an intellectual, political, and moral dead end that couldn’t even conserve the difference between a girl and a boy.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bbb9532a-4fa7-443d-b795-b678562226a5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We always knew conservatism was a fraudulent failure of a pseudo-ideological movement. But lo and behold, it turns out that the conservative movement\nis literally fake and gay\n:\nUntil a few days ago, few people outside the offices of National Review knew that the revered conservative magazine’s publisher is a homosexual, “married” to a man.\n“The publisher of the most important conservative magazine of the last 60 years, National Review, is gay-married?” wrote The Stream’s Peter Wolfgang, who broke the story. “Garrett Bewkes, the man overseeing the magazine once edited by William F. Buckley, has a husband.”\n“He’s been the publisher for five years. How did this happen? And what does it mean for the conservative movement and the Republican party?” Wolfgang asked.  “I suspect a lot of NR’s long-time readers don’t know this. I wouldn’t have known if a local newspaper hadn’t run an article by Bewkes’ ‘husband’ Bradley.”\nJust wait until conservatives learn that their historical opinion leader, William F. Buckley, was gay too, as was conservative icon Malcolm Forbes. This is why one has to be either stupid or ignorant to call oneself a political “conservative” – something you may recall that I have\nnever\n,\never\n, done – because conservatism is not only not an ideology, it is an intellectual, political, and moral dead end that couldn’t even conserve the difference between a girl and a boy.\nDISCUSS ON SG",
  "tags": [
    "cuckservative",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-24T19:41:15+00:00"
}