{
  "url": "https://voxday.net/2022/05/10/on-the-correction-of-others/",
  "scraped_at": "2026-01-08T13:18:41.283921",
  "title": "On the Correction of Others",
  "date_display": "May 10, 2022",
  "date_iso": "2022-05-10T11:23:26+00:00",
  "date_from_url": "2022-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Smart Boys,</p><p>Stop correcting people who aren’t requesting criticism, comments, or correction. <em>Literally no one </em>appreciates unsolicited correction, even on the off-chance that it is entirely, 100-percent, correct, which it usually isn’t. As a general rule, if they want editorial, they’ll ask for it. If they haven’t, they didn’t.</p><p>Sometimes people are just wrong, and that’s okay. In fact, <em>that’s to be expected</em>. Remember MPAI and file them away as people to ignore in the future. You’re not the Truth Police.</p><p>If you ever wondered why people don’t like you, this is why.</p><p>It’s really not that hard to allow stupid people to say stupid things, or to permit smart people to say strange and confusing things that you don’t understand, without interference.</p><p><strong>UPDATE: </strong>To precisely no one’s surprise, least of all mine, the Gabtards didn’t hesitate to demonstrate their literal retardery.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>You literally just did what you said you didn’t want other people to do.</p></blockquote><p>Since apparently it is necessary to spell out the obvious, because MPAI, I will note that a general expression of one’s opinion about comportment is not criticism, commentary, or correction concerning any particular individual, and therefore is clearly not part of the set of irritating behaviors I am addressing.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4a97195d-d8f0-4505-9a0d-344ebd864cb8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Dear Smart Boys,\nStop correcting people who aren’t requesting criticism, comments, or correction.\nLiterally no one\nappreciates unsolicited correction, even on the off-chance that it is entirely, 100-percent, correct, which it usually isn’t. As a general rule, if they want editorial, they’ll ask for it. If they haven’t, they didn’t.\nSometimes people are just wrong, and that’s okay. In fact,\nthat’s to be expected\n. Remember MPAI and file them away as people to ignore in the future. You’re not the Truth Police.\nIf you ever wondered why people don’t like you, this is why.\nIt’s really not that hard to allow stupid people to say stupid things, or to permit smart people to say strange and confusing things that you don’t understand, without interference.\nUPDATE:\nTo precisely no one’s surprise, least of all mine, the Gabtards didn’t hesitate to demonstrate their literal retardery.\nYou literally just did what you said you didn’t want other people to do.\nSince apparently it is necessary to spell out the obvious, because MPAI, I will note that a general expression of one’s opinion about comportment is not criticism, commentary, or correction concerning any particular individual, and therefore is clearly not part of the set of irritating behaviors I am addressing.\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-10T13:22:37+00:00"
}