{
  "url": "https://voxday.net/2022/05/08/quelle-surprise-3/",
  "scraped_at": "2026-01-08T13:18:30.839472",
  "title": "Quelle Surprise",
  "date_display": "May 8, 2022",
  "date_iso": "2022-05-08T11:50:21+00:00",
  "date_from_url": "2022-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not exactly shocking to have The New York Times confirm, only 44 years late, that three-time New York City Mayor Ed Koch <a href=\"https://www.nytimes.com/2022/05/07/nyregion/ed-koch-gay-secrets.html?smid=tw-nytimes&amp;smtyp=cur\">was a homosexual</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Edward I. Koch looked like the busiest septuagenarian in New York.</p><p>Glad-handing well-wishers at his favorite restaurants, gesticulating through television interviews long after his three terms as mayor, Mr. Koch could seem as though he was scrambling to fill every hour with bustle. He dragged friends to the movies, pursuing a side career in film criticism. He urged new acquaintances to call him “judge,” a joking reference to his time presiding over “The People’s Court.”</p><p>But as his 70s ticked by, Mr. Koch described to a few friends a feeling he could not shake: a deep loneliness. He wanted to meet someone, he said. Did they know anyone who might be “partner material?” Someone “a little younger than me?” Someone to make up for lost time?</p><p>“I want a boyfriend,” he said to one friend, Charles Kaiser.</p><p>It was an aching admission, shared with only a few, from a politician whose brash ubiquity and relentless New York evangelism helped define the modern mayoralty, even as he strained to conceal an essential fact of his biography: Mr. Koch was gay.</p><cite>The Secrets Ed Koch Carried, <em>The New York Times</em>, 7 May 2022</cite></blockquote><p>So a Jewish politician pretending to be an American was also pretending to be straight? Lawsy, will the totally shocking surprises never cease? Just think, sometime around the year 2052, <em>The New York Times</em> – or rather, the single media amalgamation that has swallowed <em>The New York Times</em> – will report that Barack Obama was a homosexual and “Michelle” Obama’s real name was “Michael”. And we will all pretend to be surprised.</p><p>The so-called conspiracy  theorists aren’t always right, but they are far more often correct than the media that claims to “debunk” them.</p><p>I’m old enough to remember when people would say things like, “Ed Koch can’t possibly be gay, for crying out loud, he dated Miss America!”</p><p><em><a href=\"https://social.infogalactic.com/micropost/31478e4a-90b5-4c2d-aab1-8c47b64a864d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s not exactly shocking to have The New York Times confirm, only 44 years late, that three-time New York City Mayor Ed Koch\nwas a homosexual\n.\nEdward I. Koch looked like the busiest septuagenarian in New York.\nGlad-handing well-wishers at his favorite restaurants, gesticulating through television interviews long after his three terms as mayor, Mr. Koch could seem as though he was scrambling to fill every hour with bustle. He dragged friends to the movies, pursuing a side career in film criticism. He urged new acquaintances to call him “judge,” a joking reference to his time presiding over “The People’s Court.”\nBut as his 70s ticked by, Mr. Koch described to a few friends a feeling he could not shake: a deep loneliness. He wanted to meet someone, he said. Did they know anyone who might be “partner material?” Someone “a little younger than me?” Someone to make up for lost time?\n“I want a boyfriend,” he said to one friend, Charles Kaiser.\nIt was an aching admission, shared with only a few, from a politician whose brash ubiquity and relentless New York evangelism helped define the modern mayoralty, even as he strained to conceal an essential fact of his biography: Mr. Koch was gay.\nThe Secrets Ed Koch Carried,\nThe New York Times\n, 7 May 2022\nSo a Jewish politician pretending to be an American was also pretending to be straight? Lawsy, will the totally shocking surprises never cease? Just think, sometime around the year 2052,\nThe New York Times\n– or rather, the single media amalgamation that has swallowed\nThe New York Times\n– will report that Barack Obama was a homosexual and “Michelle” Obama’s real name was “Michael”. And we will all pretend to be surprised.\nThe so-called conspiracy  theorists aren’t always right, but they are far more often correct than the media that claims to “debunk” them.\nI’m old enough to remember when people would say things like, “Ed Koch can’t possibly be gay, for crying out loud, he dated Miss America!”\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "history",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-08T11:59:48+00:00"
}