{
  "url": "https://voxday.net/2022/05/06/second-editions/",
  "scraped_at": "2026-01-08T13:18:16.060524",
  "title": "Second Editions",
  "date_display": "May 6, 2022",
  "date_iso": "2022-05-06T11:41:43+00:00",
  "date_from_url": "2022-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Castalia Library is presently offering its subscribers first shot at <a href=\"https://arkhavencomics.com/product/black-swan-library-edition/\"><em>THE BLACK SWAN</em> by NN Taleb</a>. We’re also planning to release second editions of the sold-out <em>THE MISSIONARIES</em> and <em>MEDITATIONS</em>, both of which will be very similar to the first editions, although they will be clearly denoted as second editions and will feature different color leathers in order to clearly distinguish the different editions.</p><p>Please drop a note on SG or to my email if you are interested in either second edition, as well as if you are interested in the Library or Libraria versions as we will offer second editions of both. We’re asking the subscribers now because we need to decide the size of the print runs for both second editions. We expect that these print runs will be smaller than the initial print runs, but it’s theoretically possible they will be larger, depending upon the demand.</p><p>Please note that we are not taking any orders for them yet; next month will be the soonest that we will do so.</p><p>While we’re on the subject of sold-out first editions, I should probably mention that <em><a href=\"https://arkhavencomics.com/product/aristotle-rhetoric-library/\">RHETORIC</a></em> is <s>down to the last five copies in stock, for those who are interested in obtaining one before it sells out</s> also sold out. However, we won’t contemplate a second edition of it until we see how <em>ETHICS </em>and <em>POLITICS </em>do.</p><p><em><a href=\"https://social.infogalactic.com/micropost/972efc4f-73da-482b-a9da-fc6a42a61e7c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Castalia Library is presently offering its subscribers first shot at\nTHE BLACK SWAN\nby NN Taleb\n. We’re also planning to release second editions of the sold-out\nTHE MISSIONARIES\nand\nMEDITATIONS\n, both of which will be very similar to the first editions, although they will be clearly denoted as second editions and will feature different color leathers in order to clearly distinguish the different editions.\nPlease drop a note on SG or to my email if you are interested in either second edition, as well as if you are interested in the Library or Libraria versions as we will offer second editions of both. We’re asking the subscribers now because we need to decide the size of the print runs for both second editions. We expect that these print runs will be smaller than the initial print runs, but it’s theoretically possible they will be larger, depending upon the demand.\nPlease note that we are not taking any orders for them yet; next month will be the soonest that we will do so.\nWhile we’re on the subject of sold-out first editions, I should probably mention that\nRHETORIC\nis\ndown to the last five copies in stock, for those who are interested in obtaining one before it sells out\nalso sold out. However, we won’t contemplate a second edition of it until we see how\nETHICS\nand\nPOLITICS\ndo.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-06T12:34:08+00:00"
}