{
  "url": "https://voxday.net/2022/05/29/the-staged-show-in-texas/",
  "scraped_at": "2026-01-08T13:20:17.979782",
  "title": "The Staged Show in Texas",
  "date_display": "May 29, 2022",
  "date_iso": "2022-05-29T11:17:14+00:00",
  "date_from_url": "2022-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AC points out <a href=\"https://www.anonymousconservative.com/blog/news-briefs-05-29-2022/\">some of the obvious questions</a>, contradictions and inconsistencies raised <a href=\"https://canncon.substack.com/p/what-really-happened-in-uvalde?s=r\">by the detailed timeline</a> of what appears to be a federally-staged school shooting in Uvalde, Texas.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>First, the teacher who propped open the door next to the shooter’s crashed truck, a door that was always kept locked, was seen on video doing so one minute before the shooter arrived on scene and crashed his truck. Work out the statistical probability on that. After crashing, the shooter immediately shot at two men who approached his vehicle outside, and the teacher then left the door propped open for 12 minutes, while they went and got a phone and maybe called 911, returned to the door, and then fled into the school afraid, leaving the door open for the shooter to enter. The school, which had both, lockdown drills, and weekly real lockdowns due to border-crime pursuits, then did not lockdown in those 12 minutes, while there was shooting right outside. All classroom doors were left open and unlocked, apparently just waiting for the shooter to walk through them, as 5.56 was going off outside. The shooter finally entered, and was able to walk freely into a classroom, and then lock the door behind him to prevent law-enforcement entry. And then you have all the weird law enforcement activity, which basically contained the shooter in the room with children for an hour, as they were calling 911 and apprising the dispatcher there were live children with the shooter and he was killing them. None of that makes sense, even before you consider that they are now saying the second rifle was a Daniel Defense too. So the unemployed, 18 year old shooter’s kit cost as much as $6300-$8000, per the link, and it was not bought on a credit card.</p></blockquote><p>Now, keep in mind that the only thing of which we can be certain is this: <em>the event did not happen as the official story is reported.</em> Everything asserted by the government-news complex, from the heroes to the villains, from the motivations to the methods, is fake and gay in at least some way.</p><p>But that doesn’t mean that no one was shot and killed. In fact, on the basis of historical observation, it is logical to conclude that the federal agencies responsible for producing these “school shootings” have, over time, gone from initially a) permitting genuine school shootings to take place by refusing to intervene to b) staging false ones using crisis actors to c) staging real ones using wind-up toys and/or patsies to cover for professional shooters. The truth may be considerably darker than most conspiracy theorists wish to imagine.</p><p>Precisely which school shooting happens to fall into which category is irrelevant, and in most cases would be difficult to ascertain, although the way in which the police perimeter was reportedly utilized to actively prevent the parents in Uvalde from interfering with what appears to have been a very reluctant shooter <a href=\"https://dailycaller.com/2022/05/28/cowards-police-officer-reflects-delayed-officer-response-texas-uvalde-school-shooting/\">for over an hour</a> tends to suggest the latter.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The police have since been heavily scrutinized for standing outside of the school while the massacre unfolded. It has since been revealed that Pete Arredondo, the Chief of Police in the Uvalde Consolidated Independent School District, ordered his officers to wait for backup and more equipment before initiating a tactical breach, People reported. The police remained outside of the school for more than an hour.</p></blockquote><p>Whatever genuinely happened there, it is simply another transparent attempt to manufacture rhetorical support for disarming Americans, and that’s all we actually need to know about the matter. Ignore all the sob stories, the pictures, the interviews, and all the other blatant attempts at emotional manipulation, don’t permit yourself to get drawn into pointless discussions of these events, because it’s nothing more than the usual satanic attempt to shut down your intellectual capacities and rule you through the emotions of anger and fear.</p><p>As a general rule, never trust anyone who seeks to inflame or frighten you. It’s a near-certainty that anyone who does so is attempting to make use of you in some way. Neither fury nor fear tend to be in harmony with the Good, the Beautiful, and the True.</p><p><em><a href=\"https://social.infogalactic.com/micropost/babe55be-7368-4ffa-a83e-80c755cb7a58\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "AC points out\nsome of the obvious questions\n, contradictions and inconsistencies raised\nby the detailed timeline\nof what appears to be a federally-staged school shooting in Uvalde, Texas.\nFirst, the teacher who propped open the door next to the shooter’s crashed truck, a door that was always kept locked, was seen on video doing so one minute before the shooter arrived on scene and crashed his truck. Work out the statistical probability on that. After crashing, the shooter immediately shot at two men who approached his vehicle outside, and the teacher then left the door propped open for 12 minutes, while they went and got a phone and maybe called 911, returned to the door, and then fled into the school afraid, leaving the door open for the shooter to enter. The school, which had both, lockdown drills, and weekly real lockdowns due to border-crime pursuits, then did not lockdown in those 12 minutes, while there was shooting right outside. All classroom doors were left open and unlocked, apparently just waiting for the shooter to walk through them, as 5.56 was going off outside. The shooter finally entered, and was able to walk freely into a classroom, and then lock the door behind him to prevent law-enforcement entry. And then you have all the weird law enforcement activity, which basically contained the shooter in the room with children for an hour, as they were calling 911 and apprising the dispatcher there were live children with the shooter and he was killing them. None of that makes sense, even before you consider that they are now saying the second rifle was a Daniel Defense too. So the unemployed, 18 year old shooter’s kit cost as much as $6300-$8000, per the link, and it was not bought on a credit card.\nNow, keep in mind that the only thing of which we can be certain is this:\nthe event did not happen as the official story is reported.\nEverything asserted by the government-news complex, from the heroes to the villains, from the motivations to the methods, is fake and gay in at least some way.\nBut that doesn’t mean that no one was shot and killed. In fact, on the basis of historical observation, it is logical to conclude that the federal agencies responsible for producing these “school shootings” have, over time, gone from initially a) permitting genuine school shootings to take place by refusing to intervene to b) staging false ones using crisis actors to c) staging real ones using wind-up toys and/or patsies to cover for professional shooters. The truth may be considerably darker than most conspiracy theorists wish to imagine.\nPrecisely which school shooting happens to fall into which category is irrelevant, and in most cases would be difficult to ascertain, although the way in which the police perimeter was reportedly utilized to actively prevent the parents in Uvalde from interfering with what appears to have been a very reluctant shooter\nfor over an hour\ntends to suggest the latter.\nThe police have since been heavily scrutinized for standing outside of the school while the massacre unfolded. It has since been revealed that Pete Arredondo, the Chief of Police in the Uvalde Consolidated Independent School District, ordered his officers to wait for backup and more equipment before initiating a tactical breach, People reported. The police remained outside of the school for more than an hour.\nWhatever genuinely happened there, it is simply another transparent attempt to manufacture rhetorical support for disarming Americans, and that’s all we actually need to know about the matter. Ignore all the sob stories, the pictures, the interviews, and all the other blatant attempts at emotional manipulation, don’t permit yourself to get drawn into pointless discussions of these events, because it’s nothing more than the usual satanic attempt to shut down your intellectual capacities and rule you through the emotions of anger and fear.\nAs a general rule, never trust anyone who seeks to inflame or frighten you. It’s a near-certainty that anyone who does so is attempting to make use of you in some way. Neither fury nor fear tend to be in harmony with the Good, the Beautiful, and the True.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "gun control",
    "homeschool or die"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-29T11:25:59+00:00"
}