{
  "url": "https://voxday.net/2022/05/27/the-new-berlin-wall/",
  "scraped_at": "2026-01-08T13:20:16.151062",
  "title": "The New Berlin Wall",
  "date_display": "May 27, 2022",
  "date_iso": "2022-05-27T16:51:32+00:00",
  "date_from_url": "2022-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An interview with Michael Hudson addressing the economic aspects of the unrestricted war between the Imperial USA and the Sino-Russian alliance.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>PS: <em>Let’s say all these European programmes like the REPOWER Programme come into effect, how do you expect the EU standing to be on the stage after that?</em></p><p>MH: Well, the EU standing will be squeezed economically. It was trying to be a powerhouse in the world economy but in the last month the euro has been declining steadily against the dollar and it’s on the way to one dollar per euro. That’s because it’s having to pay much foreign exchange for energy, for food, for weapons. It’s shrinking in terms of other economies.</p><p>PS: <em>Where do you think the EU’s standing will be in relation to powerhouses such as China?</em></p><p>MH: Well, it’s obviously out of the game. Instead of putting its own interests first, it’s really putting the US interests first. It’s acting more like a satellite of the United States thank trying to its own destiny. The whole plan of the EU 20 years ago was to get rich by investing in Russia, investing in China and a mutual exchange. And now it’s decided to stop that. The US has absorbed Europe. The war in Ukraine is a war by the US primarily to pull Europe into the US orbit, prevent European transactions with Russia or China. So Western Europe is being left out, while Russia, China and Eurasia are going with the rest of Asia. Europe is simply going to be left behind. It’s losing its export markets, it’s being squeezed and -as you just mentioned- it’s pushed up the retirement age because it’s spending its budget on replenishing American military arms instead of investing in industry as it had been doing since 1945.</p><p>PS: <em>You did indeed write that Europe has ceased to be an independent state. You’ve almost mentioned that the United States wanted to sever EU trade ties with Russia and China. How exactly did you get to that conclusion and do you think that this alleged US plan is succeeding?</em></p><p>MH: Well, I simply read the speeches of President Biden and his team. They’ve said that China is America’s number one enemy. If you’re going to call a country your number one existential enemy, you’re not going to be increasing your trade and mutual dependency with it. And it’s already insisted that its allies sanction -meaning boycott- Russian sports not only of oil and agriculture but of titanium, helium and all of the other exports that Russia has been making. Europe is been following US directions not to have contact with Russia and without contact with Russia it’s not going to have contact with China because China sees that Europe is going to do to it exactly what it’s been doing to Russia.</p><p>PS: <em>Obviously as a result of this current situation, for many years now, Russia and China have been growing closer diplomatically and economically. How do you see a global shift in power evolving over the next 5, 10 years or so?</em></p><p>MH: The current war is dividing the world into two parts. There’s going to be a US dollar area of the US, Europe and its satellites. And there’ll be a multipolarity; there’ll be a group of Russia, China together and basically they will be making their proposal of a different way of organising the world economic affairs to Africa, Latin America and other Asian countries. And other Asian countries, Latin America and the global south will see that it can get a better deal with Russia and China than it can get with the United States.</p><p>PS: <em>On the flip side of that coin, one could argue that the existing situation, world order, has only been cemented by this war. You see NATO more aligned than ever, you see Europe more aligned than ever. You see Finland and Sweden on the brink, perhaps, of joining NATO. What would your response to this be, Michael?</em></p><p>MH: This integration of Europe into the United States sphere is like the new Berlin Wall. It’s isolated the US from the whole rest of the world. So instead of a victory for the United States it’s self-isolated itself because US strategists have realised that they’re losing the economic war with China, Russia and the whole group of emerging nations. All they can try to do is hold on to Europe as their one source of income to exploit from Europe what it can no longer get from any other country.</p></blockquote><p>The Great Bifurcation between the economy of Clown World and the economy of Sovereign World is becoming increasingly obvious to the more intelligent observers. No wonder the smarter globalists such as Henry Kissinger are urging a Ukrainian surrender in order to try to preserve the failing status quo.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8c62fcb2-6aa8-4510-9767-0c31e65c3e70\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An interview with Michael Hudson addressing the economic aspects of the unrestricted war between the Imperial USA and the Sino-Russian alliance.\nPS:\nLet’s say all these European programmes like the REPOWER Programme come into effect, how do you expect the EU standing to be on the stage after that?\nMH: Well, the EU standing will be squeezed economically. It was trying to be a powerhouse in the world economy but in the last month the euro has been declining steadily against the dollar and it’s on the way to one dollar per euro. That’s because it’s having to pay much foreign exchange for energy, for food, for weapons. It’s shrinking in terms of other economies.\nPS:\nWhere do you think the EU’s standing will be in relation to powerhouses such as China?\nMH: Well, it’s obviously out of the game. Instead of putting its own interests first, it’s really putting the US interests first. It’s acting more like a satellite of the United States thank trying to its own destiny. The whole plan of the EU 20 years ago was to get rich by investing in Russia, investing in China and a mutual exchange. And now it’s decided to stop that. The US has absorbed Europe. The war in Ukraine is a war by the US primarily to pull Europe into the US orbit, prevent European transactions with Russia or China. So Western Europe is being left out, while Russia, China and Eurasia are going with the rest of Asia. Europe is simply going to be left behind. It’s losing its export markets, it’s being squeezed and -as you just mentioned- it’s pushed up the retirement age because it’s spending its budget on replenishing American military arms instead of investing in industry as it had been doing since 1945.\nPS:\nYou did indeed write that Europe has ceased to be an independent state. You’ve almost mentioned that the United States wanted to sever EU trade ties with Russia and China. How exactly did you get to that conclusion and do you think that this alleged US plan is succeeding?\nMH: Well, I simply read the speeches of President Biden and his team. They’ve said that China is America’s number one enemy. If you’re going to call a country your number one existential enemy, you’re not going to be increasing your trade and mutual dependency with it. And it’s already insisted that its allies sanction -meaning boycott- Russian sports not only of oil and agriculture but of titanium, helium and all of the other exports that Russia has been making. Europe is been following US directions not to have contact with Russia and without contact with Russia it’s not going to have contact with China because China sees that Europe is going to do to it exactly what it’s been doing to Russia.\nPS:\nObviously as a result of this current situation, for many years now, Russia and China have been growing closer diplomatically and economically. How do you see a global shift in power evolving over the next 5, 10 years or so?\nMH: The current war is dividing the world into two parts. There’s going to be a US dollar area of the US, Europe and its satellites. And there’ll be a multipolarity; there’ll be a group of Russia, China together and basically they will be making their proposal of a different way of organising the world economic affairs to Africa, Latin America and other Asian countries. And other Asian countries, Latin America and the global south will see that it can get a better deal with Russia and China than it can get with the United States.\nPS:\nOn the flip side of that coin, one could argue that the existing situation, world order, has only been cemented by this war. You see NATO more aligned than ever, you see Europe more aligned than ever. You see Finland and Sweden on the brink, perhaps, of joining NATO. What would your response to this be, Michael?\nMH: This integration of Europe into the United States sphere is like the new Berlin Wall. It’s isolated the US from the whole rest of the world. So instead of a victory for the United States it’s self-isolated itself because US strategists have realised that they’re losing the economic war with China, Russia and the whole group of emerging nations. All they can try to do is hold on to Europe as their one source of income to exploit from Europe what it can no longer get from any other country.\nThe Great Bifurcation between the economy of Clown World and the economy of Sovereign World is becoming increasingly obvious to the more intelligent observers. No wonder the smarter globalists such as Henry Kissinger are urging a Ukrainian surrender in order to try to preserve the failing status quo.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-27T16:51:34+00:00"
}