{
  "url": "https://voxday.net/2022/05/27/unrestricted-war-on-russia/",
  "scraped_at": "2026-01-08T13:20:14.336231",
  "title": "Unrestricted War on Russia",
  "date_display": "May 27, 2022",
  "date_iso": "2022-05-27T10:28:27+00:00",
  "date_from_url": "2022-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears the rulers of the Imperial USA have come to understand the Chinese principles of Unrestricted Warfare, or <a href=\"https://www.rt.com/russia/556181-west-total-war-russian-world/\">as the Russian Foreign Minister calls it</a>, Total War.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The confrontation between Western nations and Russia amounts to “total war,” Russian Foreign Minister Sergey Lavrov said on Friday during a meeting with the heads of Russian regions. Russian society and major political forces support the government’s decision to face this challenge, he added.</p><p>Western nations “are doubling, tripling, and quadrupling their efforts to deter our nation. They use a wide array of tools, from unilateral economic sanctions to totally deceitful propaganda in the global media,” Lavrov said, noting that “low-level Russophobia, which to our deepest regret is promoted by a number of governments, has risen to unprecedented levels.”</p><p>“The West has declared total war against us, against the entire Russian world. Nobody even hides this fact now,” Lavrov stated.</p><p>Lavrov also noted that the crisis has exposed the true nature of the promises given to Russia 30 years ago, after the collapse of the USSR. “We now see the value of all the talk about universal values and the need to turn Europe into a common home from the Atlantic to the Pacific.” No one should have illusions about the attitude of the US and its allies towards Russia, he added.</p></blockquote><p>I’ve repeatedly pointed out that the Russo-Ukrainian conflict is not merely about Ukraine’s designs on Crimea and the Donbass, or Russia’s designs on Ukraine, anymore than Nazi Germany’s conflict with Czechoslovakia was merely about the Sudentenland. The globalist imperials have been preying on Russia since 1991, and attempting to undermine its government since Putin unexpectedly took power in 2000. Putin and his generals clearly recognize that Ukraine is not the core problem, it is merely the most immediate manifestation of the problem.</p><p>Dmitry Trenin, a member of Russia’s Foreign and Defense Policy Council, clearly understands <a href=\"https://www.rt.com/russia/555916-russia-west-hydrid-war/\">the scale and import</a> of the situation:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The challenge Russia is facing has no equivalents in our history. It’s not just that we have neither allies nor even potential partners left in the West. Frequent comparisons with the Cold War of the mid and late 20th century are inaccurate and rather disorienting. In terms of globalization and new technology, the modern form of confrontation is not only of a larger scale than the previous one, it is also much more intense. Ultimately, the main field of the ongoing battle is located inside the country.</p><p>The asymmetry between the opponents is huge, particularly the imbalance between the forces and capabilities available to them. Based on this, the US and its allies have set much more radical goals than the relatively conservative containment and deterrence strategies used toward the Soviet Union. They are in fact striving to exclude Russia from world politics as an independent factor, and to completely destroy the Russian economy.</p><p>The success of this strategy would allow the US-led West to finally resolve the “Russia question” and create favorable prospects for victory in the confrontation with China.</p><p>Such an attitude on the part of the adversary does not imply room for any serious dialogue, since there is practically no prospect of a compromise, primarily between the United States and Russia, based on a balance of interests. The new dynamic of Russian-Western relations involves a dramatic severance of all ties, and increased Western pressure on Russia (the state, society, economy, science and technology, culture, and so on) on all fronts. This is no longer a source of discord between the opponents of the Cold War period, who then became (unequal) partners. It looks more like the drawing of a clearer dividing line between them, with the West refusing to accept even the perfunctory neutrality of individual countries.</p></blockquote><p>China, India, Iran, and most of the unaligned nations now recognize both the evil nature of the corrupted West and its hostile intentions toward them as well, which is why they are also <a href=\"https://noqreport.com/2022/05/20/china-preparing-for-d-day-invasion-of-the-continental-united-states-with-forces-to-land-on-the-beaches-of-california-as-biden-and-newsom-serve-as-chinas-accomplices-sourc/\">preparing for war against it</a>. Note: I do <span style=\"text-decoration: underline;\">not</span> subscribe to what I consider to be the absurdly stupid idea that China is intending to invade the USA; the various numbers listed in the leaked transcript are simply not “too extensive” for an invasion of Taiwan and the disputed Senkaku/Diaoyu  islands.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Leaked audio that appears to have originated from a meeting of China’s <s>top war generals</s> [a regional government authority – VD] reveals elaborate plans for a land invasion in the near future, waged by the People’s Liberation Army and augmented with cyber warfare, orbital space weapons and the activation of CCP civilians currently embedded in corporations and governments around the world.</p><p>China’s <s>war leader</s> [provincial committee member] makes strong reference to the psychological operations that will be waged by their government to control the population as they wage war against the West:</p><p><em>First, we need to strengthen the protection in political field. Look at the recent several regional wars, especially the Russian-Ukrainian conflict war situation. If you look at the big picture, the United States and the West will try everything to slander us, smear us, in an attempt to confuse right and wrong, to shake our will to win a just and decisive battle. We must give full play to public opinion, legal struggle, psychological war and militia teams to strengthen the guidance of public opinion and psychological protection, and cohesion of patriotic support for the positive energy of the military front.</em></p></blockquote><p>The fact that the author of the linked article doesn’t even understand that the meeting is of the Standing Committee of the Provincial Party Committee for Guangdong Province, not the Chinese military leadership, and that he clearly hasn’t fully read or understood the nature of the transcript, which <span style=\"text-decoration: underline;\">clearly</span> shows the regional authorities attempting to determine how to go about handling their various supporting roles when the invasion happens, doesn’t take away from the way in which the transcript – which Chinese experts have told me appears to either be genuine or a very convincing and detailed fake – indicates Chinese preparations for a major military effort that will soon open WWIII’s second front by bringing it into direct conflict with the US government and military.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1851cc83-7e55-4e27-bd59-34251be701ff\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It appears the rulers of the Imperial USA have come to understand the Chinese principles of Unrestricted Warfare, or\nas the Russian Foreign Minister calls it\n, Total War.\nThe confrontation between Western nations and Russia amounts to “total war,” Russian Foreign Minister Sergey Lavrov said on Friday during a meeting with the heads of Russian regions. Russian society and major political forces support the government’s decision to face this challenge, he added.\nWestern nations “are doubling, tripling, and quadrupling their efforts to deter our nation. They use a wide array of tools, from unilateral economic sanctions to totally deceitful propaganda in the global media,” Lavrov said, noting that “low-level Russophobia, which to our deepest regret is promoted by a number of governments, has risen to unprecedented levels.”\n“The West has declared total war against us, against the entire Russian world. Nobody even hides this fact now,” Lavrov stated.\nLavrov also noted that the crisis has exposed the true nature of the promises given to Russia 30 years ago, after the collapse of the USSR. “We now see the value of all the talk about universal values and the need to turn Europe into a common home from the Atlantic to the Pacific.” No one should have illusions about the attitude of the US and its allies towards Russia, he added.\nI’ve repeatedly pointed out that the Russo-Ukrainian conflict is not merely about Ukraine’s designs on Crimea and the Donbass, or Russia’s designs on Ukraine, anymore than Nazi Germany’s conflict with Czechoslovakia was merely about the Sudentenland. The globalist imperials have been preying on Russia since 1991, and attempting to undermine its government since Putin unexpectedly took power in 2000. Putin and his generals clearly recognize that Ukraine is not the core problem, it is merely the most immediate manifestation of the problem.\nDmitry Trenin, a member of Russia’s Foreign and Defense Policy Council, clearly understands\nthe scale and import\nof the situation:\nThe challenge Russia is facing has no equivalents in our history. It’s not just that we have neither allies nor even potential partners left in the West. Frequent comparisons with the Cold War of the mid and late 20th century are inaccurate and rather disorienting. In terms of globalization and new technology, the modern form of confrontation is not only of a larger scale than the previous one, it is also much more intense. Ultimately, the main field of the ongoing battle is located inside the country.\nThe asymmetry between the opponents is huge, particularly the imbalance between the forces and capabilities available to them. Based on this, the US and its allies have set much more radical goals than the relatively conservative containment and deterrence strategies used toward the Soviet Union. They are in fact striving to exclude Russia from world politics as an independent factor, and to completely destroy the Russian economy.\nThe success of this strategy would allow the US-led West to finally resolve the “Russia question” and create favorable prospects for victory in the confrontation with China.\nSuch an attitude on the part of the adversary does not imply room for any serious dialogue, since there is practically no prospect of a compromise, primarily between the United States and Russia, based on a balance of interests. The new dynamic of Russian-Western relations involves a dramatic severance of all ties, and increased Western pressure on Russia (the state, society, economy, science and technology, culture, and so on) on all fronts. This is no longer a source of discord between the opponents of the Cold War period, who then became (unequal) partners. It looks more like the drawing of a clearer dividing line between them, with the West refusing to accept even the perfunctory neutrality of individual countries.\nChina, India, Iran, and most of the unaligned nations now recognize both the evil nature of the corrupted West and its hostile intentions toward them as well, which is why they are also\npreparing for war against it\n. Note: I do\nnot\nsubscribe to what I consider to be the absurdly stupid idea that China is intending to invade the USA; the various numbers listed in the leaked transcript are simply not “too extensive” for an invasion of Taiwan and the disputed Senkaku/Diaoyu  islands.\nLeaked audio that appears to have originated from a meeting of China’s\ntop war generals\n[a regional government authority – VD] reveals elaborate plans for a land invasion in the near future, waged by the People’s Liberation Army and augmented with cyber warfare, orbital space weapons and the activation of CCP civilians currently embedded in corporations and governments around the world.\nChina’s\nwar leader\n[provincial committee member] makes strong reference to the psychological operations that will be waged by their government to control the population as they wage war against the West:\nFirst, we need to strengthen the protection in political field. Look at the recent several regional wars, especially the Russian-Ukrainian conflict war situation. If you look at the big picture, the United States and the West will try everything to slander us, smear us, in an attempt to confuse right and wrong, to shake our will to win a just and decisive battle. We must give full play to public opinion, legal struggle, psychological war and militia teams to strengthen the guidance of public opinion and psychological protection, and cohesion of patriotic support for the positive energy of the military front.\nThe fact that the author of the linked article doesn’t even understand that the meeting is of the Standing Committee of the Provincial Party Committee for Guangdong Province, not the Chinese military leadership, and that he clearly hasn’t fully read or understood the nature of the transcript, which\nclearly\nshows the regional authorities attempting to determine how to go about handling their various supporting roles when the invasion happens, doesn’t take away from the way in which the transcript – which Chinese experts have told me appears to either be genuine or a very convincing and detailed fake – indicates Chinese preparations for a major military effort that will soon open WWIII’s second front by bringing it into direct conflict with the US government and military.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-05-27T11:06:10+00:00"
}