{
  "url": "https://voxday.net/2005/11/05/100-things-i-hate-about-television_05/",
  "scraped_at": "2026-01-08T20:48:57.924475",
  "title": "100 Things I Hate About Television",
  "date_display": "November 5, 2005",
  "date_iso": "2005-11-05T22:56:00+00:00",
  "date_from_url": "2005-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>2.  Exploding gas tanks.</p><p>Unlike the vast majority of Americans, I have actually set a car on fire and blown up a gas tank.  It was when I was being chased by a pair of blonde, bisexual Estonian lady spies a few years back who were angry about having been seduced into blowing their cover during a torrid threesome the night before; the sun was rising and they thought they had me cornered with their Lotus Turbo Esprit when I fired an incindiary round from my laser-sighted Glock .40 that ignited the gas tank and sent up a massive fireball that was seen from Milwaukee.</p><p>Or perhaps I exaggerate somewhat.  Running through my recall subroutines, I am informed that there was only one girl, and while she was blonde, she was perfectly straight and utterly devoid of any Estonian ancestry.  There was no gun, no incindiary round, and the Lotus was actually a 1977 MGB.  There was, however, an exploding gas tank.  It seems what happened was that I missed a curve and drove off the road during one of the Jag club’s road rallies, and I did so at spectacularly bad time because the entire Midwest was going through a terrible drought that summer.</p><p>The non-Estonian non-spy and I thought it was pretty funny until we heard an ominous crackling sound beneath us.  A quick glance underneath the car indicated that an overheated catalytic converter set the field on fire, and there was simply no way to drive the car forward or push it out of the ditch in which we were sitting.  So, there was nothing to do but watch the car and the field burn; the gas tank explosion was disappointingly anticlimactic as there was just a dull <em>poompf</em> followed by a belching cloud of darker smoke rising from the back end of the car.  Frankly, I felt rather cheated.</p><p>It took a lot longer than you’d think, too.  I’d estimate that around seven or eight minutes of fairly comprehensive burning passed before the gas tank exploded.  Ironically, MGB parts were rare enough that the various bits and pieces I managed to salvage from the burned-out hulk allowed me to pay for another MGB with a souped-up engine.</p></div>",
  "content_text": "2.  Exploding gas tanks.\nUnlike the vast majority of Americans, I have actually set a car on fire and blown up a gas tank.  It was when I was being chased by a pair of blonde, bisexual Estonian lady spies a few years back who were angry about having been seduced into blowing their cover during a torrid threesome the night before; the sun was rising and they thought they had me cornered with their Lotus Turbo Esprit when I fired an incindiary round from my laser-sighted Glock .40 that ignited the gas tank and sent up a massive fireball that was seen from Milwaukee.\nOr perhaps I exaggerate somewhat.  Running through my recall subroutines, I am informed that there was only one girl, and while she was blonde, she was perfectly straight and utterly devoid of any Estonian ancestry.  There was no gun, no incindiary round, and the Lotus was actually a 1977 MGB.  There was, however, an exploding gas tank.  It seems what happened was that I missed a curve and drove off the road during one of the Jag club’s road rallies, and I did so at spectacularly bad time because the entire Midwest was going through a terrible drought that summer.\nThe non-Estonian non-spy and I thought it was pretty funny until we heard an ominous crackling sound beneath us.  A quick glance underneath the car indicated that an overheated catalytic converter set the field on fire, and there was simply no way to drive the car forward or push it out of the ditch in which we were sitting.  So, there was nothing to do but watch the car and the field burn; the gas tank explosion was disappointingly anticlimactic as there was just a dull\npoompf\nfollowed by a belching cloud of darker smoke rising from the back end of the car.  Frankly, I felt rather cheated.\nIt took a lot longer than you’d think, too.  I’d estimate that around seven or eight minutes of fairly comprehensive burning passed before the gas tank exploded.  Ironically, MGB parts were rare enough that the various bits and pieces I managed to salvage from the burned-out hulk allowed me to pay for another MGB with a souped-up engine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-05T22:56:00+00:00"
}