{
  "url": "https://voxday.net/2005/11/18/add-excuse/",
  "scraped_at": "2026-01-08T20:50:04.531106",
  "title": "The ADD excuse",
  "date_display": "November 18, 2005",
  "date_iso": "2005-11-18T15:55:00+00:00",
  "date_from_url": "2005-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never bought into <a href=\"http://drhelen.blogspot.com/2005/11/does-absence-of-fathers-cause-adhd.html\">the Attention Deficit Disorder epidemic</a>, and having a certain amount of experience with illegal chemicals, I’ve always found it impossible to believe that passing out speed to kids is a good idea.  If they were having them smoke pot, I’d be more open to the possibility, but I can’t imagine having a boy hork a few lines of coke being particularly helpful with his studies either.</p><p>Anyhow, it seems pretty clear to me that as with fat people, there is a small group with a genuine medical problem requiring treatment and a much larger group that uses the medical problem as an excuse to cover their lack of responsibility.  How do you distinguish between an out-of-control, undisciplined child and one who genuine suffers from ADD, especially with the cursory examinations provided by the school-affiliated personnel who do much of the diagnosing?  I’d like to see one of the television shows run a sting and have perfectly normal kids act hyperactive and see how many medical “experts” diagnose them with ADD.</p><p>ADD may well be real, but so is Discipline Deficit Disorder.  I always found it interesting how these supposedly out-of-control teens never had a problem behaving in the dojo.  They seemed to mysteriously find the ability to behave when the alternative was becoming the receipient of a literal beat-down.  It worked on adults too; even the most hot-tempered men learned that they actually did have the ability to keep their cool.</p><p>Discipline doesn’t always have to be physical, of course.  But it has to be there and be consistent, in whatever form.</p></div>",
  "content_text": "I’ve never bought into\nthe Attention Deficit Disorder epidemic\n, and having a certain amount of experience with illegal chemicals, I’ve always found it impossible to believe that passing out speed to kids is a good idea.  If they were having them smoke pot, I’d be more open to the possibility, but I can’t imagine having a boy hork a few lines of coke being particularly helpful with his studies either.\nAnyhow, it seems pretty clear to me that as with fat people, there is a small group with a genuine medical problem requiring treatment and a much larger group that uses the medical problem as an excuse to cover their lack of responsibility.  How do you distinguish between an out-of-control, undisciplined child and one who genuine suffers from ADD, especially with the cursory examinations provided by the school-affiliated personnel who do much of the diagnosing?  I’d like to see one of the television shows run a sting and have perfectly normal kids act hyperactive and see how many medical “experts” diagnose them with ADD.\nADD may well be real, but so is Discipline Deficit Disorder.  I always found it interesting how these supposedly out-of-control teens never had a problem behaving in the dojo.  They seemed to mysteriously find the ability to behave when the alternative was becoming the receipient of a literal beat-down.  It worked on adults too; even the most hot-tempered men learned that they actually did have the ability to keep their cool.\nDiscipline doesn’t always have to be physical, of course.  But it has to be there and be consistent, in whatever form.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-18T15:55:00+00:00"
}