{
  "url": "https://voxday.net/2005/11/16/as-long-as-youre-killing-your-own/",
  "scraped_at": "2026-01-08T20:49:49.717961",
  "title": "As long as you’re killing your own people",
  "date_display": "November 16, 2005",
  "date_iso": "2005-11-16T11:30:00+00:00",
  "date_from_url": "2005-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Daily Telegraph:</p><blockquote><p>The Brazilian man shot dead by police in the mistaken belief that he was a suicide bomber <a href=\"http://www.telegraph.co.uk/news/main.jhtml;jsessionid=ZJM5WL0J1OCMRQFIQMFCFFWAVCBQYIV0?xml=/news/2005/11/16/nmenez16.xml&amp;sSheet=/news/2005/11/16/ixnewstop.html\">was killed with a type of bullet banned in warfare</a> under international convention, The Daily Telegraph has learned.  The firing of hollow point ammunition into the head of Jean Charles de Menezes, 27, is believed to be the first use of the bullets by British police.</p><p>Their issue was sanctioned after research suggested that they were an effective close-quarters ammunition for use against someone about to trigger a suicide bomb.</p><p>It is believed the decision was influenced by the tactics used by air marshals on passenger jets – where such bullets are designed to splinter in the body and not burst the fuselage. They have been assessed as posing less risk to people around the suicide bomber than conventional bullets but the effect on victims is devastating.</p><p>Like the overall Kratos policy, the decision to make dum dum-style bullets available was taken in secret. However, it is understood that the Home Office became aware three years ago that police were considering their use.</p></blockquote><p>Ironic, isn’t it?  The police state never has a problem using things like poison gas and hollow-points against its own citizens that it would never dare to use in war.  The fact that the UK police did this secretly demonstrates that they are perfectly aware of how appalling their decision was.</p><p>The only thing I don’t understand was how the cretins involved could possibly think it wasn’t going to come out in time.  I suppose they assumed that the discovery would coincide with the heroic killing of a suicide bomber, not the murder of an innocent man, and would therefore be accepted as a necessary evil.</p></div>",
  "content_text": "From the Daily Telegraph:\nThe Brazilian man shot dead by police in the mistaken belief that he was a suicide bomber\nwas killed with a type of bullet banned in warfare\nunder international convention, The Daily Telegraph has learned.  The firing of hollow point ammunition into the head of Jean Charles de Menezes, 27, is believed to be the first use of the bullets by British police.\nTheir issue was sanctioned after research suggested that they were an effective close-quarters ammunition for use against someone about to trigger a suicide bomb.\nIt is believed the decision was influenced by the tactics used by air marshals on passenger jets – where such bullets are designed to splinter in the body and not burst the fuselage. They have been assessed as posing less risk to people around the suicide bomber than conventional bullets but the effect on victims is devastating.\nLike the overall Kratos policy, the decision to make dum dum-style bullets available was taken in secret. However, it is understood that the Home Office became aware three years ago that police were considering their use.\nIronic, isn’t it?  The police state never has a problem using things like poison gas and hollow-points against its own citizens that it would never dare to use in war.  The fact that the UK police did this secretly demonstrates that they are perfectly aware of how appalling their decision was.\nThe only thing I don’t understand was how the cretins involved could possibly think it wasn’t going to come out in time.  I suppose they assumed that the discovery would coincide with the heroic killing of a suicide bomber, not the murder of an innocent man, and would therefore be accepted as a necessary evil.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-16T11:30:00+00:00"
}