{
  "url": "https://voxday.net/2005/11/01/civilized-riposte-to-that-damnable/",
  "scraped_at": "2026-01-08T20:48:38.389205",
  "title": "The civilized riposte to that damnable Deutschman",
  "date_display": "November 1, 2005",
  "date_iso": "2005-11-01T13:41:00+00:00",
  "date_from_url": "2005-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I adore P.G. Wodehouse, unabashedly, with much the same vehemence that Umberto Eco reserves for George Schultz and with the same willingness to commit acts of unspeakable violence upon any half-witted fool so despicable as to disagree.  The <a href=\"http://www.fraterslibertas.com/2005_10_01_archive.html#113074275512346191\">Fraters Libertas</a>, who despite a most convincing disguise to the contrary are truly gentlemen of no small taste and refinement, do us the favor of pointing us to <a href=\"http://www.firstthings.com/ftissues/ft0510/articles/bottum.html\">this interesting article on the great English writer</a>.</p><blockquote><p>And write he did, making so much money—from his books, scripts for Hollywood and Broadway, and articles in magazines such as Vanity Fair—that the American tax authorities and the British Inland Revenue united in one of their first joint projects, a trans-Atlantic cooperative effort to dig as much as possible out of Wodehouse’s international royalties. That may have been what finally drove him abroad in 1934, when he and Ethel settled in France.</p><p>In retrospect, this proved not to be the ideal time for such a move. Five years later, Hitler’s blitzkrieg swept through the area, picking up the British Wodehouse along the way—or, as he explained, “Young men, starting out in life, have often asked me, ‘How can I become an internee?’ Well, there are several methods. My own was to buy a villa in Le Touquet on the coast of France and stay there until the Germans came along. This is probably the best and simplest system. You buy the villa and the Germans do the rest.”</p></blockquote><p>If you can read that last bit and it doesn’t make the edges of your mouth twitch, I have to seriously question your claim on the human rights to life, liberty and the pursuit of happiness.</p></div>",
  "content_text": "I adore P.G. Wodehouse, unabashedly, with much the same vehemence that Umberto Eco reserves for George Schultz and with the same willingness to commit acts of unspeakable violence upon any half-witted fool so despicable as to disagree.  The\nFraters Libertas\n, who despite a most convincing disguise to the contrary are truly gentlemen of no small taste and refinement, do us the favor of pointing us to\nthis interesting article on the great English writer\n.\nAnd write he did, making so much money—from his books, scripts for Hollywood and Broadway, and articles in magazines such as Vanity Fair—that the American tax authorities and the British Inland Revenue united in one of their first joint projects, a trans-Atlantic cooperative effort to dig as much as possible out of Wodehouse’s international royalties. That may have been what finally drove him abroad in 1934, when he and Ethel settled in France.\nIn retrospect, this proved not to be the ideal time for such a move. Five years later, Hitler’s blitzkrieg swept through the area, picking up the British Wodehouse along the way—or, as he explained, “Young men, starting out in life, have often asked me, ‘How can I become an internee?’ Well, there are several methods. My own was to buy a villa in Le Touquet on the coast of France and stay there until the Germans came along. This is probably the best and simplest system. You buy the villa and the Germans do the rest.”\nIf you can read that last bit and it doesn’t make the edges of your mouth twitch, I have to seriously question your claim on the human rights to life, liberty and the pursuit of happiness.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-01T13:41:00+00:00"
}