{
  "url": "https://voxday.net/2005/11/28/cs-lewis-and-problem-of-religion-in/",
  "scraped_at": "2026-01-08T20:51:06.556480",
  "title": "CS Lewis and the problem of religion in science fiction and fantasy",
  "date_display": "November 28, 2005",
  "date_iso": "2005-11-28T08:20:00+00:00",
  "date_from_url": "2005-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This essay was published earlier this month in the anthology <a href=\"http://66.84.52.211/cgi-bin/plugins/MivaEmpresas/miva?plugins/MivaMerchants/merchant.mvc+Screen=PROD&amp;Store_Code=BB&amp;Product_Code=REVNARNIA&amp;Category_Code=NARNIA\">“Revisiting Narnia”</a>, from BenBella Books.</em></p><p>In the center of Oxford, there is a brass sign indicating the proximity of The Eagle and Child, the pub in which the informal group known as the Inklings used to gather on Thursdays.  Three of these Inklings eventually became fantasy writers of some reknown, one of them, J.R.R. Tolkien, stamped an image on the genre which, sixty years and three movies later, is arguably more powerful than ever.</p><p>These three writers, Tolkien, Lewis and Charles Williams, were not only Oxford men – Tolkien and Lewis were dons while Williams was an editor at the university press – but also devout Christians.  Ironically, while Lewis is now considered to be the more recognizably Christian figure thanks to works of Christian apologetics such as Mere Christianity and Miracles, it was Tolkien who played a major role in the atheist Lewis’ conversion to Christianity in 1931.</p><p>The Christian themes in both Lewis’ fantasy and science fiction are undeniable.  Even a child  conversant with both “The Chronicles of Narnia” and the Bible will readily recognize that the lion Aslan, who voluntarily lays down his life in exchange for the life of a criminal condemned to death in “The Lion, The Witch and the Wardrobe”, is a barely disguised metaphor for Jesus Christ.  And this diaphanous veil disappears entirely six books later when the link between Aslan’s country and Heaven is disclosed upon the death of the Pevensey family at a railway station in “The Last Battle”.</p><p>The religious themes are even more overt in Lewis’ “Space Trilogy”.  From the name of the protagonist – Ransom – to the replay of the Edenic temptation in Perelandra, Lewis consciously provides a fictional retelling of vignettes straight from the Bible.  Indeed, the very title of the first volume, “Out of the Silent Planet”, refers directly to Lewis’ concept of God’s divine invasion(1) of nature, which he lays out explicitly in “Mere Christianity”.</p><p>The Christian foundation of the other famous Inkling’s work is less blatant, yet almost as obvious to all but the most willfully blind.  While there have been a few brave souls foolhardy enough to attempt to deny the self-evident,(2) even those with no discernible Christian agenda freely acknowledge the powerful religious elements integral to “The Lord of the Rings”.(3)  For the Secret Fire of which Gandalf is a servant, as Tolkien explained for the benefit of those too unfamiliar of the book of Acts to recognize the symbolism, is nothing less than the Holy Spirit whose flames were first seen at Pentecost, and in case things were not perfectly clear, the author once described his landmark trilogy as “a fundamentally religious and Catholic work.”</p><p>Thus, it is not the fantasy elements – which are actually not very similar in the particulars –  but the Christian themes running through both that tie Lewis’ and Tolkien’s works together in our minds.  Nor are these themes the only relationship.  Tolkien, Lewis and Williams were all influenced to varying degrees by the same literary and spiritual mentor, a Scottish minister and prolific author by the name of George MacDonald.(4)  MacDonald is largely forgotten now, but he was a well-known author of the late nineteenth century; among other things, he corresponded regularly with a certain American writer he had befriended by the name of Samuel Clemens.  In one letter, Clemens even mentioned to MacDonald how his daughter Susy had worn out her copy of MacDonald’s “At the Back of the North Wind” and requested that MacDonald send her a replacement.(5)</p><p>It is interesting to note that while Jules Verne and H.G. Wells are generally considered to be the fathers of science fiction, as far as the literary historians are concerned, modern fantasy is imagined to have leaped like Athena, fully accoutered, into the pulp magazines of the 1920s.  And yet, George MacDonald’s claim to paternity is difficult to dismiss.  His first work of fantasy fiction, the aptly named “Phantastes”, was published in 1858, six years before Jules Verne published “Journey to the Center of the Earth”, seven years before Lewis Carroll published “Alice in Wonderland” and before H.G. Wells, H.P. Lovecraft or Lord Dunsany were born.</p><p>This failure to recognize MacDonald’s influence on the genre(6) appears to stem primarily from the radical secularization of the science fiction and fantasy genres dating from science fiction’s Golden Age.  While the short stories and novels of the Golden Age are fondly recalled by many, and are rightly known for many good things, one must admit that character development was not among them.  This is unfortunate, because the Golden Age preference for plot over personalities and for ideas over individuals(7) played a significant role in the relegation of science fiction to a literary ghetto disdained by The New York Times Review of Books and others too self-consciously erudite to take seriously what is still too-often dismissed as juvenile space opera and futuristic twiddle-twaddle.  While character development in science fiction has improved dramatically of late, it is still only the exceptional work that manages to transcend the genre and break out of the ghetto.(8)</p><p>This disdain for character left a mark on the genre which lasts to this day.  Almost to a man, the writers of the Golden Age were secular humanists, and they felt as strongly about the deleterious effects of religion on collective human development as did Sigmund Freud with regards to the individual.  Their antipathy towards all forms of traditional religion in favor of a dogmatic faith in the scientific method cast science fiction into an artistic ghetto from which it has not yet even begun to escape.</p><p>Fortunately, science and religion need no longer be at war, as developments in modern physics have shown, (especially those relating to the significance of the fundamental constants), which may indicate that the time for hostilities may finally be over.  It is interesting to note that the ‘multiple universes’ concept which has inspired so many short stories in the past decade is a purely hypothetical theory developed without any experimental basis in an attempt to answer the ‘anthropic principle’ which not only has a solid foundation in current scientific method, but threatens to demolish the entire notion of a random, mechanistic universe.  The concept does not, of course, provide the least bit of evidence for the legitimacy of the Prophet’s revelation, the infallability of the Pope, or the likelihood of the Second Coming; what it does demonstrate is that what has been long considered an antagonistic dichotomy between science and religion may not actually exist at all.</p><p>Still, this distaste for all things religious has been a costly one, both in artistic and financial terms.(9)  While sufficient evidence exists to reject the idea that only a true believer is capable of writing accurately about his faith, it is true that presenting a reasonable and believable image of a religious individual presents a greater challenge to one who has no experience of such strange beings and therefore lacks even the most basic information about them.  One would not expect one who knows nothing of math beyond addition and subtraction to write a convincing portrayal of calculus, after all.  And while one may no more believe in aliens than in Jesus Christ, a survey of the current literature suggests that far more thought typically goes into depictions of the former than into those who profess to believe in the latter.</p><p>Compare, the vast difference between the guilt-racked seducer of Hawthorne’s “The Scarlet Letter” and the foam-flecked fundamentalists that haunt mediocre short stories in Asimov’s Science Fiction Magazine like clockwork cartoon bogeymen.  Is it any wo<br> nder that the science fiction and fantasy writer’s pretense to literary status is scoffed at by those familiar with Dostoevsky, Goethe, and Tolstoy?</br></p><p>Lewis himself almost appears to have been on the verge of contemplating a similar question when he wrote to a gentleman by the name of Warfield Firor regarding the limits of Mark Twain as an author.</p><p><em>“I have been regaling myself on Tom Sawyer and Huckleberry Finn. I wonder why that man never wrote anything else on the same level. The scene in which Huck decides to be ‘good’ by betraying Jim, and then finds he can’t and concludes that he is a reprobate, is unparalleled in humour, pathos, and tenderness. And it goes down to the very depth of all moral problems.”</em>(10)</p><p>This passage should suffice to demonstrate that one’s personal belief or disbelief in God, even in morality, is no bar to successfully creating deep and convincing moral characters, given that Twain, a self-proclaimed atheist, succeeded admirably.  Like Twain, C.S. Lewis populated his fictitious land with moral characters, as diverse as the noble, but flawed Caspian, the once-traitorous Edmund, the self-absorbed Eustace and the arrogant Rabadash.  His character studies are necessarily less deep for the most part, given the broader scope of his stories, but the most significant attributes of his characters are almost always their moral qualities.</p><p>As with individuals, cultures, too, require some element of religious faith to be convincing given that the overwhelming majority of historical cultures were centered, at some level, around faith in something, from the Roman founder legends to the Judeo-Christianity of the Western tradition.  In the faithless storyscapes of science fiction, the implacable Fremen of Frank Herbert’s Dune stand out as a chillingly believable vision of a galaxy-spanning Islamic culture while Dan Simmon’s Hyperion Cantos is unique in presenting an unusual, but compelling projection of the Vatican hierarchy into a dark and ominous technological future.</p><p>These varying examples prove that while it is not necessary to kowtow before the icons of any religion, for the sake of the writer’s art, it is imperative to pay enough attention to the details in order to get them right!  Many writers go to great lengths to “get the science right”, but for those who harbor any literary pretensions at all, the same must be done with regards to the beliefs and behaviors of their fictional characters as well as the structure of their organized religions.</p><p>While it’s hardly surprising that a field dominated for decades by self-professed secular humanists should prove hostile to religion – any honest reader will admit that Asimov was far more fascinating for his ideas than his character development or his infamous naming conventions – the fact that this artistic flaw transcends genres demonstrates that the problem is more widespread than one might think, to the great detriment of literature in general.  It is, it seems, more a cultural defect than one easily laid at the feet of individual writers.</p><p>For example, Wendy Shalit criticized the tendency of Jewish writers she calls “outsider-insiders” to make fundamental errors about Orthodox Judaism in the Sunday New York Times Book Review:</p><p><em>Consider, for example, Nathan Englander, a talented writer whose collection of stories, ”For the Relief of Unbearable Urges,” brimmed with revelations of hypocrisy and self-inflicted misery: a fistfight that breaks out in synagogue over who will read from the Torah; a sect whose members fast three days instead of one and drink a dozen glasses of wine at the Passover seders instead of four; a man whose rabbi sends him to a prostitute when his wife won’t sleep with him. Of course, the Orthodox don’t actually brawl over who reads the Torah, no rabbi is allowed to write a dispensation for a man to see a prostitute, and even extremely pious Jews can’t invent their own traditions for fast days or seders.</em>(11)</p><p>These basic errors are as ludicrous to the haredi as lowbrow Star Trek science is to the astrophysicist.  Worse, they are used to paint what are necessarily false characters, based as they are on an erroneous foundation.</p><p>Still, for all that religion in science fiction may be shallow, more often than not it is simply absent.  Fantasy, for all that its early masters were usually Christian, tends to go more horribly awry.  It frequently embraces a form of what on the surface appears to be religion, for what is a fat fantasy trilogy without a token cleric or priest, but nearly always warps the concept into something wholly unrecognizable.  For example, there is not a single traditional religion, including Taoism, which revolves around the concept of a precarious Balance maintained between good and evil, and yet a religious structure built around some form of the Balance cliche is ubiquitous in modern fantasy.  This mythical Balance-centered religion is a nonsensical concept wherein too much Evil is bad and too much Good is bad, a notion which tells the reader more about the writer’s inclination towards political moderation than about morality, the problem of evil, the nature of the divine, or any other question with which nearly every historical religion attempts to address in some way.</p><p>Another oddity is the fantasy genre’s strange treatment of the medieval era.  Most modern fantasy fiction is based in a medieval time period, often with readily identifiable historical societies, and yet the most quintessentially medieval institution, the Catholic Church, is noticeably absent for the most part.  Even more strangely, it is not unusual to recreate a divine right of kings without any reference to a Divine which would presumably be providing that right to rule.</p><p>The list of modern fantasy authors who have committed one of these bizarre literary crimes against historical and religious versimilitude reads like an SFWA honor roll:</p><p>Piers Anthony’s “Incarnations of Immortality”, Terry Brooks’ Shannara series, Glen Cook’s Black Company novels, David Eddings’ Belgariad, Raymond Feist’s Riftwar Saga, Terry Goodkind’s Sword of Truth series, Robert Jordan’s Wheel of Time, Stephen King’s Dark Tower series, Michael Moorcock’s “Chronicles of Corum”, Margaret Weis and Tracy Hickman’s Dragonlance series, and last, but by no means least, Roger Zelazny’s excellent “Chronicles of Amber”.</p><p>Now, it is no crime to envision a world that is free of Christianity, for science fiction is the art of the conceivable while fantasy is the art of the inconceivable.  But one can legitimately question why this fascination with a world without faith, with characters without souls, with what Lewis called men without chests, should so thoroughly pervade modern literature.</p><p>Lewis himself provides the answer, indeed, he predicted the likelihood of just such a result, (though in a more general sense), when he reviewed an English textbook written for schoolboys back in the 1940s.  In “The Abolition of Man”, he could be writing of either today’s authors or their flawed, cardboard characters when he writes:</p><p><em>It is not that they are bad men. They are not men at all. Stepping outside the Tao,(12) they have stepped into the void. Nor are their subjects necessarily unhappy men. They are not men at all: they are artefacts. Man’s final conquest has proved to be the abolition of Man.</em></p><p>In abolishing faith and morality from their characters, the heirs of CS Lewis’ literary tradition have not only failed themselves, but more importantly, they have failed their readers.  For it is not that they are bad observers of the human condition, it is that they are not observers of the human condition at all, chronicling instead an imaginary inhumanity that never existed, does not exist and will never exist.</p><p><em><b>(1)</b> Philip K. Dick, of all people, appears to have been familiar with the concept, as it provides the title for one of his more esoteric novels, “The Divine Invasion”.</em></p><p><b>(2<br> )</br></b> For all that his portrayal of Gandalf was flawlessly informed by the book, the deeper aspects of his character appeared to have escaped Sir Ian McKellen when he said: “Despite being a Catholic, [Tolkien] was not trying to write a Catholic parable….  “The Lord of the Rings” is just part of the mythology that he wrote, and I’m not familiar with the rest of it, but I do know it isn’t very helpful in this story to refer to a deity.  Because there are vague higher powers who send Gandalf back to finish off the job, and there seems to be something that might be mistaken for heaven as the boat sails into the sunset. But it ain’t very specific, is it?” – Sir Ian McKellen, interview with Hollywood Jesus, August 2004.</p><p><b>(3)</b> “But again, to understand Tolkien, one must return to his Christian roots. While at Oxford, he and C.S. Lewis would discuss at great length and critique each other’s writing. They were also both members of a literary group that performed the same kinds of evaluations from the same Christian foundation. So at every step of the way, Tolkien had a Christian perspective guiding his writing. This is abundantly apparent in his finished works and even comes through in the recent movie release of “The Fellowship of the Ring”.” – Lord of the Rings: Christian Myth at Work, Ali Assadullah, IslamOnline</p><p><b>(4)</b> Lewis and Williams openly acknowledged their debt to MacDonald, while Tolkien was rather less enthusiastic.  Tolkien once described MacDonald’s “The Golden Key” as “illwritten, incoherent, and bad, in spite of a few memorable passages”.  Of course, Lewis would be hard-pressed to deny it, as the first paragraphs of “The Princess and the Goblin” will be shockingly familiar to anyone who has ever read “The Lion, the Witch and the Wardrobe”.</p><p><b>(5)</b> “All these things might move and interest one. But how desperately more I have been moved to-night by the thought of a little old copy in the nursery of “At the Back of the North Wind”. Oh, what happy days they were when that little book was read, and how Susy loved it!” – Mark Twain,  letter to William Dean Howells, 1899.</p><p><b>(6)</b> There 125 science fiction and fantasy writers listed on the SF Site’s M page, including four MacDonalds.  Despite his enormous contribution to the genre, George MacDonald is not one of them.</p><p><b>(7)</b> This is not to say that a religious writer such as Lewis lacked ideas, but the essence of religion in general and Christianity in particular requires a focus on individuals in order to demonstrate the transformative power of faith or the lack thereof.  Technology, on the other hand, requires no such focus.  This is why there is, as yet, no Dostoevsky of science fiction, or arguably, modern literature.</p><p><b>(8)</b> And when they do, we have a terrible tendency to disown them.  Neal Stephenson is arguably the finest science fiction author writing today; I happen to be a member of the SFWA’s 2005 Nebula novel jury and there’s actually a discussion as to whether The System of the World qualifies as science fiction or not!  No doubt this is why a sufficiently literary author of fantasy, such as Italo Calvino, is known to the world as a fabulist.</p><p><b>(9)</b> No doubt we science fiction and fantasy authors are far too pure in art to allow petty pecuniary matters to ever enter our minds, but the fact that the Christian publishers of the 50 million-selling “Left Behind” series have gone out of their way to ensure their books are not confused with science fiction and fantasy might give pause to even the most staunchly secular SFWA writer.</p><p><b>(10)</b> William Griffin, “C. S. Lewis: A Dramatic Life” (San Francisco: Harper, 1986), p. 314.</p><p><b>(11)</b> The Sunday New York Times Book Review, January 30, 2005</p><p><b>(12)</b> Lewis uses “the Tao” to refer to the concept more often described as Natural Law.</p></div>",
  "content_text": "This essay was published earlier this month in the anthology\n“Revisiting Narnia”\n, from BenBella Books.\nIn the center of Oxford, there is a brass sign indicating the proximity of The Eagle and Child, the pub in which the informal group known as the Inklings used to gather on Thursdays.  Three of these Inklings eventually became fantasy writers of some reknown, one of them, J.R.R. Tolkien, stamped an image on the genre which, sixty years and three movies later, is arguably more powerful than ever.\nThese three writers, Tolkien, Lewis and Charles Williams, were not only Oxford men – Tolkien and Lewis were dons while Williams was an editor at the university press – but also devout Christians.  Ironically, while Lewis is now considered to be the more recognizably Christian figure thanks to works of Christian apologetics such as Mere Christianity and Miracles, it was Tolkien who played a major role in the atheist Lewis’ conversion to Christianity in 1931.\nThe Christian themes in both Lewis’ fantasy and science fiction are undeniable.  Even a child  conversant with both “The Chronicles of Narnia” and the Bible will readily recognize that the lion Aslan, who voluntarily lays down his life in exchange for the life of a criminal condemned to death in “The Lion, The Witch and the Wardrobe”, is a barely disguised metaphor for Jesus Christ.  And this diaphanous veil disappears entirely six books later when the link between Aslan’s country and Heaven is disclosed upon the death of the Pevensey family at a railway station in “The Last Battle”.\nThe religious themes are even more overt in Lewis’ “Space Trilogy”.  From the name of the protagonist – Ransom – to the replay of the Edenic temptation in Perelandra, Lewis consciously provides a fictional retelling of vignettes straight from the Bible.  Indeed, the very title of the first volume, “Out of the Silent Planet”, refers directly to Lewis’ concept of God’s divine invasion(1) of nature, which he lays out explicitly in “Mere Christianity”.\nThe Christian foundation of the other famous Inkling’s work is less blatant, yet almost as obvious to all but the most willfully blind.  While there have been a few brave souls foolhardy enough to attempt to deny the self-evident,(2) even those with no discernible Christian agenda freely acknowledge the powerful religious elements integral to “The Lord of the Rings”.(3)  For the Secret Fire of which Gandalf is a servant, as Tolkien explained for the benefit of those too unfamiliar of the book of Acts to recognize the symbolism, is nothing less than the Holy Spirit whose flames were first seen at Pentecost, and in case things were not perfectly clear, the author once described his landmark trilogy as “a fundamentally religious and Catholic work.”\nThus, it is not the fantasy elements – which are actually not very similar in the particulars –  but the Christian themes running through both that tie Lewis’ and Tolkien’s works together in our minds.  Nor are these themes the only relationship.  Tolkien, Lewis and Williams were all influenced to varying degrees by the same literary and spiritual mentor, a Scottish minister and prolific author by the name of George MacDonald.(4)  MacDonald is largely forgotten now, but he was a well-known author of the late nineteenth century; among other things, he corresponded regularly with a certain American writer he had befriended by the name of Samuel Clemens.  In one letter, Clemens even mentioned to MacDonald how his daughter Susy had worn out her copy of MacDonald’s “At the Back of the North Wind” and requested that MacDonald send her a replacement.(5)\nIt is interesting to note that while Jules Verne and H.G. Wells are generally considered to be the fathers of science fiction, as far as the literary historians are concerned, modern fantasy is imagined to have leaped like Athena, fully accoutered, into the pulp magazines of the 1920s.  And yet, George MacDonald’s claim to paternity is difficult to dismiss.  His first work of fantasy fiction, the aptly named “Phantastes”, was published in 1858, six years before Jules Verne published “Journey to the Center of the Earth”, seven years before Lewis Carroll published “Alice in Wonderland” and before H.G. Wells, H.P. Lovecraft or Lord Dunsany were born.\nThis failure to recognize MacDonald’s influence on the genre(6) appears to stem primarily from the radical secularization of the science fiction and fantasy genres dating from science fiction’s Golden Age.  While the short stories and novels of the Golden Age are fondly recalled by many, and are rightly known for many good things, one must admit that character development was not among them.  This is unfortunate, because the Golden Age preference for plot over personalities and for ideas over individuals(7) played a significant role in the relegation of science fiction to a literary ghetto disdained by The New York Times Review of Books and others too self-consciously erudite to take seriously what is still too-often dismissed as juvenile space opera and futuristic twiddle-twaddle.  While character development in science fiction has improved dramatically of late, it is still only the exceptional work that manages to transcend the genre and break out of the ghetto.(8)\nThis disdain for character left a mark on the genre which lasts to this day.  Almost to a man, the writers of the Golden Age were secular humanists, and they felt as strongly about the deleterious effects of religion on collective human development as did Sigmund Freud with regards to the individual.  Their antipathy towards all forms of traditional religion in favor of a dogmatic faith in the scientific method cast science fiction into an artistic ghetto from which it has not yet even begun to escape.\nFortunately, science and religion need no longer be at war, as developments in modern physics have shown, (especially those relating to the significance of the fundamental constants), which may indicate that the time for hostilities may finally be over.  It is interesting to note that the ‘multiple universes’ concept which has inspired so many short stories in the past decade is a purely hypothetical theory developed without any experimental basis in an attempt to answer the ‘anthropic principle’ which not only has a solid foundation in current scientific method, but threatens to demolish the entire notion of a random, mechanistic universe.  The concept does not, of course, provide the least bit of evidence for the legitimacy of the Prophet’s revelation, the infallability of the Pope, or the likelihood of the Second Coming; what it does demonstrate is that what has been long considered an antagonistic dichotomy between science and religion may not actually exist at all.\nStill, this distaste for all things religious has been a costly one, both in artistic and financial terms.(9)  While sufficient evidence exists to reject the idea that only a true believer is capable of writing accurately about his faith, it is true that presenting a reasonable and believable image of a religious individual presents a greater challenge to one who has no experience of such strange beings and therefore lacks even the most basic information about them.  One would not expect one who knows nothing of math beyond addition and subtraction to write a convincing portrayal of calculus, after all.  And while one may no more believe in aliens than in Jesus Christ, a survey of the current literature suggests that far more thought typically goes into depictions of the former than into those who profess to believe in the latter.\nCompare, the vast difference between the guilt-racked seducer of Hawthorne’s “The Scarlet Letter” and the foam-flecked fundamentalists that haunt mediocre short stories in Asimov’s Science Fiction Magazine like clockwork cartoon bogeymen.  Is it any wo\nnder that the science fiction and fantasy writer’s pretense to literary status is scoffed at by those familiar with Dostoevsky, Goethe, and Tolstoy?\nLewis himself almost appears to have been on the verge of contemplating a similar question when he wrote to a gentleman by the name of Warfield Firor regarding the limits of Mark Twain as an author.\n“I have been regaling myself on Tom Sawyer and Huckleberry Finn. I wonder why that man never wrote anything else on the same level. The scene in which Huck decides to be ‘good’ by betraying Jim, and then finds he can’t and concludes that he is a reprobate, is unparalleled in humour, pathos, and tenderness. And it goes down to the very depth of all moral problems.”\n(10)\nThis passage should suffice to demonstrate that one’s personal belief or disbelief in God, even in morality, is no bar to successfully creating deep and convincing moral characters, given that Twain, a self-proclaimed atheist, succeeded admirably.  Like Twain, C.S. Lewis populated his fictitious land with moral characters, as diverse as the noble, but flawed Caspian, the once-traitorous Edmund, the self-absorbed Eustace and the arrogant Rabadash.  His character studies are necessarily less deep for the most part, given the broader scope of his stories, but the most significant attributes of his characters are almost always their moral qualities.\nAs with individuals, cultures, too, require some element of religious faith to be convincing given that the overwhelming majority of historical cultures were centered, at some level, around faith in something, from the Roman founder legends to the Judeo-Christianity of the Western tradition.  In the faithless storyscapes of science fiction, the implacable Fremen of Frank Herbert’s Dune stand out as a chillingly believable vision of a galaxy-spanning Islamic culture while Dan Simmon’s Hyperion Cantos is unique in presenting an unusual, but compelling projection of the Vatican hierarchy into a dark and ominous technological future.\nThese varying examples prove that while it is not necessary to kowtow before the icons of any religion, for the sake of the writer’s art, it is imperative to pay enough attention to the details in order to get them right!  Many writers go to great lengths to “get the science right”, but for those who harbor any literary pretensions at all, the same must be done with regards to the beliefs and behaviors of their fictional characters as well as the structure of their organized religions.\nWhile it’s hardly surprising that a field dominated for decades by self-professed secular humanists should prove hostile to religion – any honest reader will admit that Asimov was far more fascinating for his ideas than his character development or his infamous naming conventions – the fact that this artistic flaw transcends genres demonstrates that the problem is more widespread than one might think, to the great detriment of literature in general.  It is, it seems, more a cultural defect than one easily laid at the feet of individual writers.\nFor example, Wendy Shalit criticized the tendency of Jewish writers she calls “outsider-insiders” to make fundamental errors about Orthodox Judaism in the Sunday New York Times Book Review:\nConsider, for example, Nathan Englander, a talented writer whose collection of stories, ”For the Relief of Unbearable Urges,” brimmed with revelations of hypocrisy and self-inflicted misery: a fistfight that breaks out in synagogue over who will read from the Torah; a sect whose members fast three days instead of one and drink a dozen glasses of wine at the Passover seders instead of four; a man whose rabbi sends him to a prostitute when his wife won’t sleep with him. Of course, the Orthodox don’t actually brawl over who reads the Torah, no rabbi is allowed to write a dispensation for a man to see a prostitute, and even extremely pious Jews can’t invent their own traditions for fast days or seders.\n(11)\nThese basic errors are as ludicrous to the haredi as lowbrow Star Trek science is to the astrophysicist.  Worse, they are used to paint what are necessarily false characters, based as they are on an erroneous foundation.\nStill, for all that religion in science fiction may be shallow, more often than not it is simply absent.  Fantasy, for all that its early masters were usually Christian, tends to go more horribly awry.  It frequently embraces a form of what on the surface appears to be religion, for what is a fat fantasy trilogy without a token cleric or priest, but nearly always warps the concept into something wholly unrecognizable.  For example, there is not a single traditional religion, including Taoism, which revolves around the concept of a precarious Balance maintained between good and evil, and yet a religious structure built around some form of the Balance cliche is ubiquitous in modern fantasy.  This mythical Balance-centered religion is a nonsensical concept wherein too much Evil is bad and too much Good is bad, a notion which tells the reader more about the writer’s inclination towards political moderation than about morality, the problem of evil, the nature of the divine, or any other question with which nearly every historical religion attempts to address in some way.\nAnother oddity is the fantasy genre’s strange treatment of the medieval era.  Most modern fantasy fiction is based in a medieval time period, often with readily identifiable historical societies, and yet the most quintessentially medieval institution, the Catholic Church, is noticeably absent for the most part.  Even more strangely, it is not unusual to recreate a divine right of kings without any reference to a Divine which would presumably be providing that right to rule.\nThe list of modern fantasy authors who have committed one of these bizarre literary crimes against historical and religious versimilitude reads like an SFWA honor roll:\nPiers Anthony’s “Incarnations of Immortality”, Terry Brooks’ Shannara series, Glen Cook’s Black Company novels, David Eddings’ Belgariad, Raymond Feist’s Riftwar Saga, Terry Goodkind’s Sword of Truth series, Robert Jordan’s Wheel of Time, Stephen King’s Dark Tower series, Michael Moorcock’s “Chronicles of Corum”, Margaret Weis and Tracy Hickman’s Dragonlance series, and last, but by no means least, Roger Zelazny’s excellent “Chronicles of Amber”.\nNow, it is no crime to envision a world that is free of Christianity, for science fiction is the art of the conceivable while fantasy is the art of the inconceivable.  But one can legitimately question why this fascination with a world without faith, with characters without souls, with what Lewis called men without chests, should so thoroughly pervade modern literature.\nLewis himself provides the answer, indeed, he predicted the likelihood of just such a result, (though in a more general sense), when he reviewed an English textbook written for schoolboys back in the 1940s.  In “The Abolition of Man”, he could be writing of either today’s authors or their flawed, cardboard characters when he writes:\nIt is not that they are bad men. They are not men at all. Stepping outside the Tao,(12) they have stepped into the void. Nor are their subjects necessarily unhappy men. They are not men at all: they are artefacts. Man’s final conquest has proved to be the abolition of Man.\nIn abolishing faith and morality from their characters, the heirs of CS Lewis’ literary tradition have not only failed themselves, but more importantly, they have failed their readers.  For it is not that they are bad observers of the human condition, it is that they are not observers of the human condition at all, chronicling instead an imaginary inhumanity that never existed, does not exist and will never exist.\n(1)\nPhilip K. Dick, of all people, appears to have been familiar with the concept, as it provides the title for one of his more esoteric novels, “The Divine Invasion”.\n(2\n)\nFor all that his portrayal of Gandalf was flawlessly informed by the book, the deeper aspects of his character appeared to have escaped Sir Ian McKellen when he said: “Despite being a Catholic, [Tolkien] was not trying to write a Catholic parable….  “The Lord of the Rings” is just part of the mythology that he wrote, and I’m not familiar with the rest of it, but I do know it isn’t very helpful in this story to refer to a deity.  Because there are vague higher powers who send Gandalf back to finish off the job, and there seems to be something that might be mistaken for heaven as the boat sails into the sunset. But it ain’t very specific, is it?” – Sir Ian McKellen, interview with Hollywood Jesus, August 2004.\n(3)\n“But again, to understand Tolkien, one must return to his Christian roots. While at Oxford, he and C.S. Lewis would discuss at great length and critique each other’s writing. They were also both members of a literary group that performed the same kinds of evaluations from the same Christian foundation. So at every step of the way, Tolkien had a Christian perspective guiding his writing. This is abundantly apparent in his finished works and even comes through in the recent movie release of “The Fellowship of the Ring”.” – Lord of the Rings: Christian Myth at Work, Ali Assadullah, IslamOnline\n(4)\nLewis and Williams openly acknowledged their debt to MacDonald, while Tolkien was rather less enthusiastic.  Tolkien once described MacDonald’s “The Golden Key” as “illwritten, incoherent, and bad, in spite of a few memorable passages”.  Of course, Lewis would be hard-pressed to deny it, as the first paragraphs of “The Princess and the Goblin” will be shockingly familiar to anyone who has ever read “The Lion, the Witch and the Wardrobe”.\n(5)\n“All these things might move and interest one. But how desperately more I have been moved to-night by the thought of a little old copy in the nursery of “At the Back of the North Wind”. Oh, what happy days they were when that little book was read, and how Susy loved it!” – Mark Twain,  letter to William Dean Howells, 1899.\n(6)\nThere 125 science fiction and fantasy writers listed on the SF Site’s M page, including four MacDonalds.  Despite his enormous contribution to the genre, George MacDonald is not one of them.\n(7)\nThis is not to say that a religious writer such as Lewis lacked ideas, but the essence of religion in general and Christianity in particular requires a focus on individuals in order to demonstrate the transformative power of faith or the lack thereof.  Technology, on the other hand, requires no such focus.  This is why there is, as yet, no Dostoevsky of science fiction, or arguably, modern literature.\n(8)\nAnd when they do, we have a terrible tendency to disown them.  Neal Stephenson is arguably the finest science fiction author writing today; I happen to be a member of the SFWA’s 2005 Nebula novel jury and there’s actually a discussion as to whether The System of the World qualifies as science fiction or not!  No doubt this is why a sufficiently literary author of fantasy, such as Italo Calvino, is known to the world as a fabulist.\n(9)\nNo doubt we science fiction and fantasy authors are far too pure in art to allow petty pecuniary matters to ever enter our minds, but the fact that the Christian publishers of the 50 million-selling “Left Behind” series have gone out of their way to ensure their books are not confused with science fiction and fantasy might give pause to even the most staunchly secular SFWA writer.\n(10)\nWilliam Griffin, “C. S. Lewis: A Dramatic Life” (San Francisco: Harper, 1986), p. 314.\n(11)\nThe Sunday New York Times Book Review, January 30, 2005\n(12)\nLewis uses “the Tao” to refer to the concept more often described as Natural Law.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-28T08:20:00+00:00"
}