{
  "url": "https://voxday.net/2005/11/07/dont-worry-about-frenc/",
  "scraped_at": "2026-01-08T20:49:03.994888",
  "title": "Don’t worry about the French",
  "date_display": "November 7, 2005",
  "date_iso": "2005-11-07T10:04:00+00:00",
  "date_from_url": "2005-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From WND:</p><blockquote><p>But Dalil Boubakeur, the head of the French Muslim Council and leader of the largest mosque in Paris, seemed to blame the government for the continuing violence. “What I want from the authorities, from Mr. Nicolas Sarkozy, the prime minister and senior officials, are words of peace,” he said.</p><p>Sarkozy has been widely criticized for his “warlike” language in which he referred to rioters as “scum” and vowed to “clean up” the suburbs. Neighboring Germany, also with a large Muslim immigrant population, mostly of Turkish origin, was watching the horror unfold in France with alarm. Wolfgang Bosbach, the deputy leader of the conservative Christian Democrats in the German parliament, told a Sunday newspaper: “There are differences between the situation in France and here, but we should not be under the illusion that similar events could not happen in Germany.”</p><p>In Italy, Romano Prodi, the opposition leader, called on the government to take urgent action, telling reporters: “We have the worst suburbs in Europe. I don’t think things are so different from Paris. It’s only a question of time.”</p><p>Denmark has also been hit with what is being characterized as its own “Islamic Intifada.” In Arhus, Denmark, young Muslims were heard chanting, “This land belongs to us!”  A masked spokesman for the rioters told Danish reporters that Muslims were tired of being oppressed and harassed and warned the police to stay away.</p></blockquote><p>People like to joke about the French tendency to surrender, but when one considers that this is also the nation which brought forth the Reign of Terror and Napoleon, and has a police force which is <a href=\"http://www.fantompowa.net/Flame/algerians.htm\">quite willing to exterminate Muslim protesters</a>, the inevitable crackdown is only a question of when.  Many are also unaware that France has already fought and lost one war with Islam in the last fifty years; the loss of French Algeria has not been forgotten and many of the current rioters/intifadists are descended from the 100,000 <em>harkis</em>, Algerian Muslims who fought for France and were forced to leave Algeria when De Gaulle granted Algeria the right of self-determination and the Algerians voted for independence.</p><p>I believe this is, in part, why the French are reluctant to smash the ghettos.  Due to their historical ties to Northern Africa, the French are much more comfortable with Islam than are Americans, the British or Germans and there is a genuine feeling of guilt for the 150,000 harkis who did not flee Algeria and subsequently perished, as well as a sense of a debt to the descendants of those who came to France and survived.  That being said, the French are famously ungrateful and will always pursue their own interests in the end.</p><p>At this point in time, the French authorities have not considered the riots to be much more than an upturn in the sort of violent which happens from time to time, on the order of 1961 and 1996.  And they may yet be proven correct, as not a single Frenchman has been slain, compared to 11 policemen killed in 1961 and 12 dead in 1996.  But should it become clear that the present situation is more serious and a more correct analogy is that of the Algerian War of Independence, I have no doubt that the French will shock the world in the extreme violence of its response to the situation.</p><p>I am not French, I do not speak French and I have no loyalty to France.  Therefore, I see little point in expressing a largely ignorant opinion as to what France should do in this situation.  I do think it is tragic, however, that the French government’s determination to cling to its absurd multiculturalism will likely lead to unnecessary bloodshed.  History tends to indicate that there are two ways of dealing with an intractable minority incapable of assimilation.  Boot them out sooner, or kill them later.</p></div>",
  "content_text": "From WND:\nBut Dalil Boubakeur, the head of the French Muslim Council and leader of the largest mosque in Paris, seemed to blame the government for the continuing violence. “What I want from the authorities, from Mr. Nicolas Sarkozy, the prime minister and senior officials, are words of peace,” he said.\nSarkozy has been widely criticized for his “warlike” language in which he referred to rioters as “scum” and vowed to “clean up” the suburbs. Neighboring Germany, also with a large Muslim immigrant population, mostly of Turkish origin, was watching the horror unfold in France with alarm. Wolfgang Bosbach, the deputy leader of the conservative Christian Democrats in the German parliament, told a Sunday newspaper: “There are differences between the situation in France and here, but we should not be under the illusion that similar events could not happen in Germany.”\nIn Italy, Romano Prodi, the opposition leader, called on the government to take urgent action, telling reporters: “We have the worst suburbs in Europe. I don’t think things are so different from Paris. It’s only a question of time.”\nDenmark has also been hit with what is being characterized as its own “Islamic Intifada.” In Arhus, Denmark, young Muslims were heard chanting, “This land belongs to us!”  A masked spokesman for the rioters told Danish reporters that Muslims were tired of being oppressed and harassed and warned the police to stay away.\nPeople like to joke about the French tendency to surrender, but when one considers that this is also the nation which brought forth the Reign of Terror and Napoleon, and has a police force which is\nquite willing to exterminate Muslim protesters\n, the inevitable crackdown is only a question of when.  Many are also unaware that France has already fought and lost one war with Islam in the last fifty years; the loss of French Algeria has not been forgotten and many of the current rioters/intifadists are descended from the 100,000\nharkis\n, Algerian Muslims who fought for France and were forced to leave Algeria when De Gaulle granted Algeria the right of self-determination and the Algerians voted for independence.\nI believe this is, in part, why the French are reluctant to smash the ghettos.  Due to their historical ties to Northern Africa, the French are much more comfortable with Islam than are Americans, the British or Germans and there is a genuine feeling of guilt for the 150,000 harkis who did not flee Algeria and subsequently perished, as well as a sense of a debt to the descendants of those who came to France and survived.  That being said, the French are famously ungrateful and will always pursue their own interests in the end.\nAt this point in time, the French authorities have not considered the riots to be much more than an upturn in the sort of violent which happens from time to time, on the order of 1961 and 1996.  And they may yet be proven correct, as not a single Frenchman has been slain, compared to 11 policemen killed in 1961 and 12 dead in 1996.  But should it become clear that the present situation is more serious and a more correct analogy is that of the Algerian War of Independence, I have no doubt that the French will shock the world in the extreme violence of its response to the situation.\nI am not French, I do not speak French and I have no loyalty to France.  Therefore, I see little point in expressing a largely ignorant opinion as to what France should do in this situation.  I do think it is tragic, however, that the French government’s determination to cling to its absurd multiculturalism will likely lead to unnecessary bloodshed.  History tends to indicate that there are two ways of dealing with an intractable minority incapable of assimilation.  Boot them out sooner, or kill them later.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-07T10:04:00+00:00"
}