{
  "url": "https://voxday.net/2005/11/24/garbage-gobblers-and-trash-that-feeds/",
  "scraped_at": "2026-01-08T20:50:34.635607",
  "title": "Garbage gobblers and the trash that feeds them",
  "date_display": "November 24, 2005",
  "date_iso": "2005-11-24T15:55:00+00:00",
  "date_from_url": "2005-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here we go again.  SingleMind <a href=\"http://www.singlemind.net/?p=293\">brings up the usual theme</a> after first being kind enough to throw the snarling dog a few bones.</p><blockquote><p>Vox challenged Shapiro–who is a 21-year-old law school student at Harvard–to put his money where his mouth is and join the military. In the exchange that ensued, Vox attacked Shapiro with implicit gay-baiting and suggested “methinks the lady doth protest too much.”</p><p>Now, Vox is in a long-standing spat with Michelle Malkin over her book In Defense of Internment, in which Malkin makes a case for modern-day threat profilng in the global war against terrorists (GWOT) by providing a framework for understanding the internment of Japanese Americans who resided on the West Coast in World War II. The spat has descended into a slingfest, which now has Vox calling Malkin a “liar” and referring to her with such derogatory terms as “Me-So Michelle” (which is tantamount to calling her a slut) and “media whore”.</p><p>Vox is a smart man, but this level of personal attack against Malkin–a fellow Christian, by the way–reveals a lack of maturity on his part. Having read Vox’s columns for quite some time, I hate to say this, but I think he’s jealous.</p><p>Ben Shapiro, after all, is only 21, and has written two outstanding books. Malkin is also widely published and has written three fine-selling books.</p><p>On one hand, he’s a first-rate intellect. He is so smart he can run circles around 99% of the population, but this has gotten to his head. When people challenge him, he ridicules their arguments and treats them like crap. That may arouse his loyal fans, but he ends up forgetting the Christian in his Christian libertarian label.</p></blockquote><p>And Vox is published by a far bigger publishing house, has written as many books as Shapiro and Malkin combined and has almost certainly sold more copies as well.  So, obviously, the reason for my biting criticism of these two twits is that I’m jealous.</p><p>Okay, that’s not really fair.  Shapiro is a twit, Malkin is a – oh, Sweet Cthulhu, Bane, you know it’s physically hurting me not to say it – fraud.  Both are third-rate intellects; to say that Shapiro’s books are “outstanding” defies belief.  As I’ve written previously, now that the Littlest Chickenhawk has introduced us to the concepts of college professors being liberal and American men liking porn, we’re eagerly awaiting his next two books, Oxygen (very important!) and Water (wet!).</p><p>The problem with Shapiro and Malkin is that they are, along with a few others, being pushed to the forefront as the next generation of conservative opinion leader.  This is a death trap for conservativism, because both are big government courtesans, the sort I referred to as <em>Scortus medius washingtonia</em> in Media Whores, the unpublished book for which a conservative publishing house initially offered a contract and then paid me not to write.</p><p>I’m not bitter about that – the only thing better than getting paid to write is getting paid not to write – and I’d rather write fiction anyhow.  But don’t believe for one second that it’s a coincidence how every mainstream media figurehead, left and right, will ultimately come down on the side of big government.</p><p>I trash Malkin and Shapiro, not because they are intellectual garbage, but because they are intellectual garbage that far too many otherwise decent individuals inexplicably scarf up as though they were a three-course meal.  If you saw a little kid gobbling used diapers, coffee grinds and banana peels from a trash can on the sidewalk, wouldn’t you try to stop him?  Conservatives don’t need me to warn them about Maureen Dowd, Eric Alterman and Michael Moore, they need to be warned about the nominally right-wing big government lovers who are so busy pointing “look, no clothes!” at the Left that no one notices they are themselves skyclad.</p><p>At least Malkin has an excuse for being a girl and hiding instead of publicly defending her work.  Shapiro tried to offer a pre-emptive defense, got deservedly bitchslapped and wasn’t even man enough to defend himself from an actual accuser despite previously spending two straight weeks addressing imaginary ones.</p><p>Unlike those I criticize so sharply, at least I take the time to address my critics’ arguments, often in depth, before I indulge myself by treating “them like crap”.  And unlike Malkin, I never offer up pop psychological explanations for my critics’ attacks in lieu of a substantive response.  As for Christianity, I seem to recall Jesus Christ wasn’t exactly shy or soft-spoken when he got in the face of hypocrites who made a habit of sucking up to government authority.</p><p>Still, I understand that there are plenty of those, like Singleminded, who consider this sort of thing to be distasteful and would rather I was more moderate in my polemics.  I certainly respect this perspective and I take no offense at his expressing this nor at his recommendation.</p><p>Of course, I still don’t give an airborne rodent’s posterior and I will “cool it” with regards to “right-wing” courtesans and charlatans in the Commentariat about the same time I give up my repetitive and redundant attacks on feminist equalitarians, Marxist socialists, Republican backstabbers, Manchester United and the Green Bay Packers.</p><p>Isn’t it amazing how everyone has a pet theory of why you are attacking a target that somehow avoids them having to address the points raised?  At least, that’s how it appears to a bitter, jealous, self-hating, secretly-gay capitalist running dog who can’t get laid.</p><p>PN responds to my response:</p><blockquote><p>You exploit Malkin’s ethnicity and the fact that men generally find her attractive in an effort to humiliate her and further mock and discredit what she says. This is neither decent nor is it the equal treatment you claim women deserve (I don’t believe that women who want to play on an equal playing field deserve special treatment or respect–in case you forgot). Would you ever take advantage of a man’s looks (whether they be good or bad) or his ethnicity to do what you’re doing to Malkin? I highly doubt it. If you did, you’d sound so utterly stupid. Imagine, people talking about how you tried to refute what Mister-Man said by calling him ugly…or claiming that people only agree with him because he’s so gosh-darned-good-lookin’…! So if you wouldn’t do this to a man, you’re guilty of giving women the special treatment (albeit subpar) you so strongly expressed they don’t deserve.</p><p>So Michelle is a media whore–call her that. Call her exactly that. Don’t call her a name that alludes to a Da Nang hooker trying to solicit business by using the phrase, “Me so horny. Me love you long time.” You and I, along with everyone else who sees you calling her “Me-So,” knows that her media whorishness is not the only thing that this name references. Like I said above, it exploits her ethnicity, the way she looks, and her gender. Would this metaphor, this nickname, still be applicable if she were, say, an ugly, media whore Dutchman? He’d still be named Michelle, of course–we most certainly would not want to deprive you of that oh-so-clever and spicy use of alliteration.</p></blockquote><p>First, if Me So doesn’t want to be mocked for her ethnicity and her gender, she should have known better than to be born a Philippina.  The blame lies entirely with her.  No one exploits Me So’s looks more than Miz Malkin herself; if she looked like Helen Thomas there is not a chance in Hell that she’d have a syndicated column or a book deal, much less appear from time to time on Fox.  Seriously, other than her internment idiocy, she’s neither written nor said virtually anything that ten other faux conservatives haven’t said before.</p><p>That’s fine, I have no problem with those whose careers are entirely based on their physical attractions; I quite like them actually.  But even the dimmest model or stripper understands t<br> his, while Malkin and other TV wanna-bees are desparate to convince us and them that it’s actually their intellects on offer.  Please.  It’s called marketing, get used to it as long as we still live in a quasi-capitalist society.  In a truly meritocratic media, Fred Reed would be the most widely-syndicated columnist; he’s a far better writer than Ann Coulter and far more amusing than Jonah Goldberg, who is probably the best of the new breed.  And yet, he never had a shot.</br></p><p>Everyone has to have a gimmick now.  Me So’s schtick is Ann Coulter II: half the brains and twice the whore (minority included!).  Shapiro’s bit is the same as Kyle Williams, look, ma, the little kid can write in complete sentences!  Kyle lost interest in the trained monkey act; it will be interesting to see if Shapiro eventually does the same or goes right into politics proper.  WND and UPS could never quite figure out what my gimmick was supposed to be – WND went with the male Ann Coulter thing, while UPS was thinking WFB with attitude – but I simply stuck with the arrogant white male motif that has served me so well for lo, these many years.</p><p>There is not, it turns out, a market for that in the mainstream media or in the conservative publishing world. C’est la vie.  Not only was I not surprised, but I’m still shocked that UPS managed to sell the column to the Dallas Morning News, even if it was dropped before it ever ran.</p><p>Would I ever take advantage of a man’s weaknesses?  In a heartbeat.  Actually, there are those who would argue that what I did to Brave Sir William and the Littlest Chickenhawk was worse; the vast bulk of my criticism of Malkin is mind-numblingly substantive.</p><p>Which leaves us with the interesting question of what I would call an ugly, male Dutch media whore.  Well, that’s obvious.  Amstertrannie.</p></div>",
  "content_text": "Here we go again.  SingleMind\nbrings up the usual theme\nafter first being kind enough to throw the snarling dog a few bones.\nVox challenged Shapiro–who is a 21-year-old law school student at Harvard–to put his money where his mouth is and join the military. In the exchange that ensued, Vox attacked Shapiro with implicit gay-baiting and suggested “methinks the lady doth protest too much.”\nNow, Vox is in a long-standing spat with Michelle Malkin over her book In Defense of Internment, in which Malkin makes a case for modern-day threat profilng in the global war against terrorists (GWOT) by providing a framework for understanding the internment of Japanese Americans who resided on the West Coast in World War II. The spat has descended into a slingfest, which now has Vox calling Malkin a “liar” and referring to her with such derogatory terms as “Me-So Michelle” (which is tantamount to calling her a slut) and “media whore”.\nVox is a smart man, but this level of personal attack against Malkin–a fellow Christian, by the way–reveals a lack of maturity on his part. Having read Vox’s columns for quite some time, I hate to say this, but I think he’s jealous.\nBen Shapiro, after all, is only 21, and has written two outstanding books. Malkin is also widely published and has written three fine-selling books.\nOn one hand, he’s a first-rate intellect. He is so smart he can run circles around 99% of the population, but this has gotten to his head. When people challenge him, he ridicules their arguments and treats them like crap. That may arouse his loyal fans, but he ends up forgetting the Christian in his Christian libertarian label.\nAnd Vox is published by a far bigger publishing house, has written as many books as Shapiro and Malkin combined and has almost certainly sold more copies as well.  So, obviously, the reason for my biting criticism of these two twits is that I’m jealous.\nOkay, that’s not really fair.  Shapiro is a twit, Malkin is a – oh, Sweet Cthulhu, Bane, you know it’s physically hurting me not to say it – fraud.  Both are third-rate intellects; to say that Shapiro’s books are “outstanding” defies belief.  As I’ve written previously, now that the Littlest Chickenhawk has introduced us to the concepts of college professors being liberal and American men liking porn, we’re eagerly awaiting his next two books, Oxygen (very important!) and Water (wet!).\nThe problem with Shapiro and Malkin is that they are, along with a few others, being pushed to the forefront as the next generation of conservative opinion leader.  This is a death trap for conservativism, because both are big government courtesans, the sort I referred to as\nScortus medius washingtonia\nin Media Whores, the unpublished book for which a conservative publishing house initially offered a contract and then paid me not to write.\nI’m not bitter about that – the only thing better than getting paid to write is getting paid not to write – and I’d rather write fiction anyhow.  But don’t believe for one second that it’s a coincidence how every mainstream media figurehead, left and right, will ultimately come down on the side of big government.\nI trash Malkin and Shapiro, not because they are intellectual garbage, but because they are intellectual garbage that far too many otherwise decent individuals inexplicably scarf up as though they were a three-course meal.  If you saw a little kid gobbling used diapers, coffee grinds and banana peels from a trash can on the sidewalk, wouldn’t you try to stop him?  Conservatives don’t need me to warn them about Maureen Dowd, Eric Alterman and Michael Moore, they need to be warned about the nominally right-wing big government lovers who are so busy pointing “look, no clothes!” at the Left that no one notices they are themselves skyclad.\nAt least Malkin has an excuse for being a girl and hiding instead of publicly defending her work.  Shapiro tried to offer a pre-emptive defense, got deservedly bitchslapped and wasn’t even man enough to defend himself from an actual accuser despite previously spending two straight weeks addressing imaginary ones.\nUnlike those I criticize so sharply, at least I take the time to address my critics’ arguments, often in depth, before I indulge myself by treating “them like crap”.  And unlike Malkin, I never offer up pop psychological explanations for my critics’ attacks in lieu of a substantive response.  As for Christianity, I seem to recall Jesus Christ wasn’t exactly shy or soft-spoken when he got in the face of hypocrites who made a habit of sucking up to government authority.\nStill, I understand that there are plenty of those, like Singleminded, who consider this sort of thing to be distasteful and would rather I was more moderate in my polemics.  I certainly respect this perspective and I take no offense at his expressing this nor at his recommendation.\nOf course, I still don’t give an airborne rodent’s posterior and I will “cool it” with regards to “right-wing” courtesans and charlatans in the Commentariat about the same time I give up my repetitive and redundant attacks on feminist equalitarians, Marxist socialists, Republican backstabbers, Manchester United and the Green Bay Packers.\nIsn’t it amazing how everyone has a pet theory of why you are attacking a target that somehow avoids them having to address the points raised?  At least, that’s how it appears to a bitter, jealous, self-hating, secretly-gay capitalist running dog who can’t get laid.\nPN responds to my response:\nYou exploit Malkin’s ethnicity and the fact that men generally find her attractive in an effort to humiliate her and further mock and discredit what she says. This is neither decent nor is it the equal treatment you claim women deserve (I don’t believe that women who want to play on an equal playing field deserve special treatment or respect–in case you forgot). Would you ever take advantage of a man’s looks (whether they be good or bad) or his ethnicity to do what you’re doing to Malkin? I highly doubt it. If you did, you’d sound so utterly stupid. Imagine, people talking about how you tried to refute what Mister-Man said by calling him ugly…or claiming that people only agree with him because he’s so gosh-darned-good-lookin’…! So if you wouldn’t do this to a man, you’re guilty of giving women the special treatment (albeit subpar) you so strongly expressed they don’t deserve.\nSo Michelle is a media whore–call her that. Call her exactly that. Don’t call her a name that alludes to a Da Nang hooker trying to solicit business by using the phrase, “Me so horny. Me love you long time.” You and I, along with everyone else who sees you calling her “Me-So,” knows that her media whorishness is not the only thing that this name references. Like I said above, it exploits her ethnicity, the way she looks, and her gender. Would this metaphor, this nickname, still be applicable if she were, say, an ugly, media whore Dutchman? He’d still be named Michelle, of course–we most certainly would not want to deprive you of that oh-so-clever and spicy use of alliteration.\nFirst, if Me So doesn’t want to be mocked for her ethnicity and her gender, she should have known better than to be born a Philippina.  The blame lies entirely with her.  No one exploits Me So’s looks more than Miz Malkin herself; if she looked like Helen Thomas there is not a chance in Hell that she’d have a syndicated column or a book deal, much less appear from time to time on Fox.  Seriously, other than her internment idiocy, she’s neither written nor said virtually anything that ten other faux conservatives haven’t said before.\nThat’s fine, I have no problem with those whose careers are entirely based on their physical attractions; I quite like them actually.  But even the dimmest model or stripper understands t\nhis, while Malkin and other TV wanna-bees are desparate to convince us and them that it’s actually their intellects on offer.  Please.  It’s called marketing, get used to it as long as we still live in a quasi-capitalist society.  In a truly meritocratic media, Fred Reed would be the most widely-syndicated columnist; he’s a far better writer than Ann Coulter and far more amusing than Jonah Goldberg, who is probably the best of the new breed.  And yet, he never had a shot.\nEveryone has to have a gimmick now.  Me So’s schtick is Ann Coulter II: half the brains and twice the whore (minority included!).  Shapiro’s bit is the same as Kyle Williams, look, ma, the little kid can write in complete sentences!  Kyle lost interest in the trained monkey act; it will be interesting to see if Shapiro eventually does the same or goes right into politics proper.  WND and UPS could never quite figure out what my gimmick was supposed to be – WND went with the male Ann Coulter thing, while UPS was thinking WFB with attitude – but I simply stuck with the arrogant white male motif that has served me so well for lo, these many years.\nThere is not, it turns out, a market for that in the mainstream media or in the conservative publishing world. C’est la vie.  Not only was I not surprised, but I’m still shocked that UPS managed to sell the column to the Dallas Morning News, even if it was dropped before it ever ran.\nWould I ever take advantage of a man’s weaknesses?  In a heartbeat.  Actually, there are those who would argue that what I did to Brave Sir William and the Littlest Chickenhawk was worse; the vast bulk of my criticism of Malkin is mind-numblingly substantive.\nWhich leaves us with the interesting question of what I would call an ugly, male Dutch media whore.  Well, that’s obvious.  Amstertrannie.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-24T15:55:00+00:00"
}