{
  "url": "https://voxday.net/2005/11/08/its-not-that-difficu/",
  "scraped_at": "2026-01-08T20:49:10.017223",
  "title": "It’s not that difficult",
  "date_display": "November 8, 2005",
  "date_iso": "2005-11-08T10:19:00+00:00",
  "date_from_url": "2005-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I warn, they ignore, I act.  I’m not much given to bluffing.  If the Banned wish to run off and play the martyr, that’s their right.  My track record of tolerating open criticism speaks for itself.  If the Banned want to come back and abide by the rules, as most of those previously banned at one time or another have done, that’s perfectly fine with me.</p><p>Perhaps this comes as a surprise to some of you, but I don’t read all of the comments.  If you tend to repeat yourself or are commenting incessantly on a posted thread, you can be quite sure that I’m not paying any attention to you unless I’m directly involved in the discussion.  The fact that I may have responded to one post out of many only means that Spacebunny or someone else has brought it to my attention.</p><p>As for yesterday’s victim du jour, Scintan said it best.  “<em>if she’s bleeding out of her eyes and dies just as she hits the send button, does that change the correctness of her position…?</em>”  No, it does not.  This blog is neither an echo chamber nor a therapy group; if you can’t back up your assertions, your argument will be ripped to shreds regardless of your creed, color, political party and health status.  If you can’t even answer a simple yes or no question, you will also be mocked.</p><p>The world is as it is.  The truth is what it is.  2+2=4 for the fit young athlete and the decrepit Alzheimer’s patient alike.  Furthermore, we can have personal sympathy for the evils that beset an individual and wish them well even as we eviscerate their cowardly intellectual dishonesty and are amused by their dearth of logic.</p><p>There are thousands of blogs where a visitor will be treated with kind condescension.  This is not one of them.  If you want respect, you will be given the same opportunity to earn it as everyone else.  A few simple guidelines:</p><p>1.  If asked a question, answer it.<br>2.  If you are asking a question of someone else, allow the person to answer it before asking another one.<br>3.  One you have made your point, stop.  Repetition only works to convince those who aren’t paying attention.<br>4.  Many regulars here scored exceptionally well on the Reading portion of the SAT.  Trying to play games with intentional misreadings of others’ comments doesn’t work here, it only makes you look like a dishonest ass.<br>5.  Silence does not equal agreement or being awed by your argument.  If people aren’t responding to your posts, there’s a reasonable chance they just think you’re a moron.<br>6.  Confusing metaphors with reality is just… just don’t.<br>7.  Mild pedantism is fine.  But don’t overdo it, it’s tiresome.</br></br></br></br></br></br></p></div>",
  "content_text": "I warn, they ignore, I act.  I’m not much given to bluffing.  If the Banned wish to run off and play the martyr, that’s their right.  My track record of tolerating open criticism speaks for itself.  If the Banned want to come back and abide by the rules, as most of those previously banned at one time or another have done, that’s perfectly fine with me.\nPerhaps this comes as a surprise to some of you, but I don’t read all of the comments.  If you tend to repeat yourself or are commenting incessantly on a posted thread, you can be quite sure that I’m not paying any attention to you unless I’m directly involved in the discussion.  The fact that I may have responded to one post out of many only means that Spacebunny or someone else has brought it to my attention.\nAs for yesterday’s victim du jour, Scintan said it best.  “\nif she’s bleeding out of her eyes and dies just as she hits the send button, does that change the correctness of her position…?\n”  No, it does not.  This blog is neither an echo chamber nor a therapy group; if you can’t back up your assertions, your argument will be ripped to shreds regardless of your creed, color, political party and health status.  If you can’t even answer a simple yes or no question, you will also be mocked.\nThe world is as it is.  The truth is what it is.  2+2=4 for the fit young athlete and the decrepit Alzheimer’s patient alike.  Furthermore, we can have personal sympathy for the evils that beset an individual and wish them well even as we eviscerate their cowardly intellectual dishonesty and are amused by their dearth of logic.\nThere are thousands of blogs where a visitor will be treated with kind condescension.  This is not one of them.  If you want respect, you will be given the same opportunity to earn it as everyone else.  A few simple guidelines:\n1.  If asked a question, answer it.\n2.  If you are asking a question of someone else, allow the person to answer it before asking another one.\n3.  One you have made your point, stop.  Repetition only works to convince those who aren’t paying attention.\n4.  Many regulars here scored exceptionally well on the Reading portion of the SAT.  Trying to play games with intentional misreadings of others’ comments doesn’t work here, it only makes you look like a dishonest ass.\n5.  Silence does not equal agreement or being awed by your argument.  If people aren’t responding to your posts, there’s a reasonable chance they just think you’re a moron.\n6.  Confusing metaphors with reality is just… just don’t.\n7.  Mild pedantism is fine.  But don’t overdo it, it’s tiresome.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-08T10:19:00+00:00"
}