{
  "url": "https://voxday.net/2005/11/29/kant-and-buffalo/",
  "scraped_at": "2026-01-08T20:51:11.227547",
  "title": "Kant and the Buffalo",
  "date_display": "November 29, 2005",
  "date_iso": "2005-11-29T08:38:00+00:00",
  "date_from_url": "2005-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The White Buffalo <a href=\"http://www.pandagon.net/archives/2005/11/the_subtext_is.html\">runs rampant at Pandagon</a>:</p><blockquote><p>White Buffalo: <b> What is the intrinsic worth of all human beings derived from sans a higher creator? That’s VD’s point. There is no accepted, logically defensible standard that atheists/agnostics agree on. You want everyone to play nice so you say people have intrinsic worth, but at the same time you say people evolved by accident over millions of years from pond scum. Since when did accident’s have instrinsic worth? And if they don’t, why should one not violate them?</b></p><p>Pandagonian 1: <em>Buffy, go read some philosophy. I’m not trying to be nasty; there are literally dozens of introductory-level philosophy books that introduce ideas like Kant’s Universal Imperative, which is just one of the many ways to get a non-deistic ethical system off the ground.</em></p><p>Pandagonian 2: <em>I second the Kant recommendation; read up. God won’t smite you with lightning, I promise. I’ve done it myself and it’s perfectly safe.</em></p><p>White Buffalo: <b>Kant’s Categorical Imperative (He doesn’t have a Universal Imperative) does not assign intrinsic value to humans. It asserts that one should act only in ways that one could will that action to become a universal law. So pretty much Do unto others as you would have them do unto you. Nothing particulalry original there, and not a formula for determining special value for humans, which is what I asked.</b></p><p>Pandagonian 1: <em>Buffy, I apologize for messing up my terminology. I tossed off my comment during a slow spell at work. Correcting me, though, is definitely not the way to continue a constructive argument. If you want to flame, I can do that too, but I’d prefer to stick to one or the other.</em></p></blockquote><p>CORRECTING ME IS DEFINITELY NOT THE WAY TO CONTINUE A CONSTRUCTIVE ARGUMENT.  That is beautiful, simply beautiful.  It could serve as the motto for the entire left-wing of the blogosphere.  When caught with your pants down – notice that this is the guy who thinks he can get by with a naked argument from authority – clearly the correct solution is to criticize the person who notices.</p><p>It’s generally a bad idea to try pulling a philosophical fast one on a guy whose brother-in-law is getting a PhD in philosophy.  When you’ve got one of those around, everybody gets to hear more Kant than they want.</p></div>",
  "content_text": "The White Buffalo\nruns rampant at Pandagon\n:\nWhite Buffalo:\nWhat is the intrinsic worth of all human beings derived from sans a higher creator? That’s VD’s point. There is no accepted, logically defensible standard that atheists/agnostics agree on. You want everyone to play nice so you say people have intrinsic worth, but at the same time you say people evolved by accident over millions of years from pond scum. Since when did accident’s have instrinsic worth? And if they don’t, why should one not violate them?\nPandagonian 1:\nBuffy, go read some philosophy. I’m not trying to be nasty; there are literally dozens of introductory-level philosophy books that introduce ideas like Kant’s Universal Imperative, which is just one of the many ways to get a non-deistic ethical system off the ground.\nPandagonian 2:\nI second the Kant recommendation; read up. God won’t smite you with lightning, I promise. I’ve done it myself and it’s perfectly safe.\nWhite Buffalo:\nKant’s Categorical Imperative (He doesn’t have a Universal Imperative) does not assign intrinsic value to humans. It asserts that one should act only in ways that one could will that action to become a universal law. So pretty much Do unto others as you would have them do unto you. Nothing particulalry original there, and not a formula for determining special value for humans, which is what I asked.\nPandagonian 1:\nBuffy, I apologize for messing up my terminology. I tossed off my comment during a slow spell at work. Correcting me, though, is definitely not the way to continue a constructive argument. If you want to flame, I can do that too, but I’d prefer to stick to one or the other.\nCORRECTING ME IS DEFINITELY NOT THE WAY TO CONTINUE A CONSTRUCTIVE ARGUMENT.  That is beautiful, simply beautiful.  It could serve as the motto for the entire left-wing of the blogosphere.  When caught with your pants down – notice that this is the guy who thinks he can get by with a naked argument from authority – clearly the correct solution is to criticize the person who notices.\nIt’s generally a bad idea to try pulling a philosophical fast one on a guy whose brother-in-law is getting a PhD in philosophy.  When you’ve got one of those around, everybody gets to hear more Kant than they want.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-29T08:38:00+00:00"
}