{
  "url": "https://voxday.net/2005/11/11/literary-abomination/",
  "scraped_at": "2026-01-08T20:49:27.908377",
  "title": "A literary abomination",
  "date_display": "November 11, 2005",
  "date_iso": "2005-11-11T19:08:00+00:00",
  "date_from_url": "2005-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Her lips quirked.”  “He quirked a smile.”  I’ve noticed this disgusting verbing of a perfectly good noun appearing more and more often in recent fantasy and science fiction; David Weber commits it countless times with all the <em>joie de morte</em> of a mass murderer on PCP in his Honor Harrington novels.  Jim Butcher, whose books I otherwise enjoy, is also a serial offender, as is Laurel Hamilton if my scarred memory serves me correctly.</p><p>It’s just pure lunacy.  These writers wouldn’t write “gooder” and they aren’t from the Umberto Eco school of inventing words for the sheer pleasure of inflicting intellectual torture on translators, so why are they so repeatedly insistent on kicking the reader in the teeth like this?</p><p>The OED has it thusly: NOUN 1 A peculiar behavioral habit.  2 A strange chance occurrence.  3 A sudden twist, turn or curve.  DERIVATIVES Quirkish (adjective). Quirky (adjective)</p><p>Do you see a verb anywhere in there?  Because I don’t.  I tell you the truth.  Every time I read that a character’s lips “quirked” or that she “quirks a smile” it makes me want to drive my fist right into those fictional lips.</p></div>",
  "content_text": "“Her lips quirked.”  “He quirked a smile.”  I’ve noticed this disgusting verbing of a perfectly good noun appearing more and more often in recent fantasy and science fiction; David Weber commits it countless times with all the\njoie de morte\nof a mass murderer on PCP in his Honor Harrington novels.  Jim Butcher, whose books I otherwise enjoy, is also a serial offender, as is Laurel Hamilton if my scarred memory serves me correctly.\nIt’s just pure lunacy.  These writers wouldn’t write “gooder” and they aren’t from the Umberto Eco school of inventing words for the sheer pleasure of inflicting intellectual torture on translators, so why are they so repeatedly insistent on kicking the reader in the teeth like this?\nThe OED has it thusly: NOUN 1 A peculiar behavioral habit.  2 A strange chance occurrence.  3 A sudden twist, turn or curve.  DERIVATIVES Quirkish (adjective). Quirky (adjective)\nDo you see a verb anywhere in there?  Because I don’t.  I tell you the truth.  Every time I read that a character’s lips “quirked” or that she “quirks a smile” it makes me want to drive my fist right into those fictional lips.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-11T19:08:00+00:00"
}