{
  "url": "https://voxday.net/2005/11/04/mailvox-australian-whinge/",
  "scraped_at": "2026-01-08T20:48:54.985051",
  "title": "Mailvox: An Australian whinge",
  "date_display": "November 4, 2005",
  "date_iso": "2005-11-04T14:19:00+00:00",
  "date_from_url": "2005-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JamieR keeps Nate up to date:</p><blockquote><p>If you didn’t know (you most probably did), if Australia beats Uruguay on November 12 in Uruguay, we qualify for the World Cup.  We always get the hard route, Oceania doesn’t get an automatic qualifier, and that usually means we have to face the South American team that finishes fifth, of all bloody regions!  We almost had to play Brazil to qualify in 2002…</p><p>And sure, if we win on November 12, there’s another game in Sydney 4 days later, but that’s in the bag if we win in Montevideo. These are the same pricks that prevented us from qualifying for 2002 – with their home ground tactics of hiring mobs to spit on our players arriving at the airport, abusing them and trying to fight them, and forcing our team to stay holed up in their hotel rooms like prisoners, unable to do anything but sit and wait for the game to start …and that’s when the fans got rough. This time around, we’re going to Argentina to train, and get into Uruguay at the last minute and head straight to the ground after that.</p></blockquote><p>Good luck, mate.  I wouldn’t mind seeing the Ozzies make the <em>mondiale</em>.  As for me, I’m just hoping Team USA makes it farther than the Italians again.  My calcio-playing friends always enjoy a rousing round of The Star-Spangled Banner being sung in their ear; my Portugeuse teammate introduced me to some very bad new words after the USA scored its third goal against Figo and company last time around.</p><p>I’m kind of conflicted about France, though.  While Spacebunny and I always pull for England, it’s hard to cheer against current and former Arsenal stalwarts such as Henry, Pires, Viera and Wiltord.</p><p>Speaking of Arsenal, how about that Dutch kid?  The second-coming of Dennis Bergkamp, he is.  I thought he had that five-minute hat-trick until the ball went wide.</p></div>",
  "content_text": "JamieR keeps Nate up to date:\nIf you didn’t know (you most probably did), if Australia beats Uruguay on November 12 in Uruguay, we qualify for the World Cup.  We always get the hard route, Oceania doesn’t get an automatic qualifier, and that usually means we have to face the South American team that finishes fifth, of all bloody regions!  We almost had to play Brazil to qualify in 2002…\nAnd sure, if we win on November 12, there’s another game in Sydney 4 days later, but that’s in the bag if we win in Montevideo. These are the same pricks that prevented us from qualifying for 2002 – with their home ground tactics of hiring mobs to spit on our players arriving at the airport, abusing them and trying to fight them, and forcing our team to stay holed up in their hotel rooms like prisoners, unable to do anything but sit and wait for the game to start …and that’s when the fans got rough. This time around, we’re going to Argentina to train, and get into Uruguay at the last minute and head straight to the ground after that.\nGood luck, mate.  I wouldn’t mind seeing the Ozzies make the\nmondiale\n.  As for me, I’m just hoping Team USA makes it farther than the Italians again.  My calcio-playing friends always enjoy a rousing round of The Star-Spangled Banner being sung in their ear; my Portugeuse teammate introduced me to some very bad new words after the USA scored its third goal against Figo and company last time around.\nI’m kind of conflicted about France, though.  While Spacebunny and I always pull for England, it’s hard to cheer against current and former Arsenal stalwarts such as Henry, Pires, Viera and Wiltord.\nSpeaking of Arsenal, how about that Dutch kid?  The second-coming of Dennis Bergkamp, he is.  I thought he had that five-minute hat-trick until the ball went wide.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-04T14:19:00+00:00"
}