{
  "url": "https://voxday.net/2005/11/03/mailvox-in-adjectives-we-trus/",
  "scraped_at": "2026-01-08T20:48:48.987191",
  "title": "Mailvox: in adjectives we trust",
  "date_display": "November 3, 2005",
  "date_iso": "2005-11-03T23:10:00+00:00",
  "date_from_url": "2005-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Papapete assaults the language:</p><blockquote><p>Gregg (and Vox to a certain extent) are technically correct. However, if you ask the proverbial “man-on-the-street” you would get a definition much closer to Chuck’s than Gregg’s. Therefore Gregg and Vox are technically correct in calling Japanese internment camps “concentration camps”. If one uses the popular definition, then the internment camps weren’t “concentration camps”.</p><p>Vox, you know what the connotations of “concentration camps” are as well as I do. To use that term in this instance is less than honest.</p></blockquote><p>And if you ask the proverbial “man-on-the-street” he will also tell you that the Founding Fathers established America as a democracy, that the Federal Reserve is a government institution and that the United Nations is an idealistic force for good.  This does not make him correct, this simply makes him ignorant.  The fact that Chuck, and presumably, Papapete, wish to mutilate the language of a well-defined word simply to whitewash American history does not make me less than honest.</p><p>There have been many concentration camps in the 20th century.  The 33 camps in which the British imprisoned the Boers from 1899-1902 were, prior to the National Socialist varieties, the most infamous.</p><p>From Wikipedia: <em>“Over the course of the twentieth century, the arbitrary internment of civilians by the authority of the state became more common and reached a climax with the practice of genocide in the death camps of the Nazi regime in Germany, and with the Gulag system of forced labor camps of the Soviet Union. As a result of this trend, the term concentration camp carries many of the connotations of extermination camp and is sometimes used synonymously. In technical discussion, however, it is important to understand that a concentration camp is not, by definition, always a Nazi-style death-camp.”</em></p><p>The 1/1/2005 Washington Post report on the federal government’s plan to establish camps in the United States as part of the Global Struggle Against Violent Extremism might seem alarming at first, but fortunately they are described as “detention camps”, so those worried about “internment camps”, “concentration camps” or “death camps” need not lose any sleep over them.</p><p>If you can’t put your faith in an adjective, what can you trust?</p></div>",
  "content_text": "Papapete assaults the language:\nGregg (and Vox to a certain extent) are technically correct. However, if you ask the proverbial “man-on-the-street” you would get a definition much closer to Chuck’s than Gregg’s. Therefore Gregg and Vox are technically correct in calling Japanese internment camps “concentration camps”. If one uses the popular definition, then the internment camps weren’t “concentration camps”.\nVox, you know what the connotations of “concentration camps” are as well as I do. To use that term in this instance is less than honest.\nAnd if you ask the proverbial “man-on-the-street” he will also tell you that the Founding Fathers established America as a democracy, that the Federal Reserve is a government institution and that the United Nations is an idealistic force for good.  This does not make him correct, this simply makes him ignorant.  The fact that Chuck, and presumably, Papapete, wish to mutilate the language of a well-defined word simply to whitewash American history does not make me less than honest.\nThere have been many concentration camps in the 20th century.  The 33 camps in which the British imprisoned the Boers from 1899-1902 were, prior to the National Socialist varieties, the most infamous.\nFrom Wikipedia:\n“Over the course of the twentieth century, the arbitrary internment of civilians by the authority of the state became more common and reached a climax with the practice of genocide in the death camps of the Nazi regime in Germany, and with the Gulag system of forced labor camps of the Soviet Union. As a result of this trend, the term concentration camp carries many of the connotations of extermination camp and is sometimes used synonymously. In technical discussion, however, it is important to understand that a concentration camp is not, by definition, always a Nazi-style death-camp.”\nThe 1/1/2005 Washington Post report on the federal government’s plan to establish camps in the United States as part of the Global Struggle Against Violent Extremism might seem alarming at first, but fortunately they are described as “detention camps”, so those worried about “internment camps”, “concentration camps” or “death camps” need not lose any sleep over them.\nIf you can’t put your faith in an adjective, what can you trust?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-03T23:10:00+00:00"
}