{
  "url": "https://voxday.net/2005/11/10/mailvox-terrible-sycophants/",
  "scraped_at": "2026-01-08T20:49:24.953251",
  "title": "Mailvox: terrible sycophants",
  "date_display": "November 10, 2005",
  "date_iso": "2005-11-10T15:46:00+00:00",
  "date_from_url": "2005-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which DM of Key Words demonstrates that I have some of the worst sycophants in the blogosphere.  It apparently seems to have escaped whole swaths of the Voxologisti that the entire point of being a sycophant <em>cum</em> sock puppet is supposed to revolve around offering mindless adulation and enthusiastically embracing my every drop of wisdom, however errant.  DM <a href=\"http://key-words.blogspot.com/2005/11/muddying-workforce-waters-for-women.html\">addresses the critique of Ralph Peters I posted yesterday</a>:</p><blockquote><p>Vox is not taking on the concept that increasing the number of workers an employer has to choose from helps the employer and – in doing so – also helps the economy. Instead he is bringing in distractors like comparing 1800’s growth to growth today (basically comparing a relatively new market that was expanding with each state added to the union to a well established one) or women in the armed forces (always good to sidetrack the issue).</p><p>This miss on the issue at hand is probably not accidental. Vox actually has a degree in economics from an Ivy League institution, so he is more than familiar with the pros and cons of a free market. He knows that offering “a or b” is more economically beneficial than simply offering “a,” so he knows he can’t win on a strictly economic front. He has other issues with women in the workforce – some actually well founded – and so attacks arguments that are contrary to the outcome he would prefer.</p><p>Personally, I feel he would be better off fighting his battles on his own territory. He does have valid issues that he can easily back up and can probably stand on their own merits. He doesn’t need to jump into side issues like this.</p></blockquote><p>Before I address the substance, let me point out a few things.  1.  I don’t have a degree in econ from an Ivy League institution, I have degrees in Econ and Asian Studies (plus a history minor) from an Ivy League wannabee institution.  Same price, less status, prettier girls, better parties.  2.  Since Peters brought up women in the armed forces as a primary example of his point, it’s hardly side-tracking the issue.</p><p>Indeed, I will even use that example to demonstrate how the entire argument can be won on the purely economic front DM mentions.  According to DM’s argument, the ability to choose A or B is always more beneficial than if A alone is on offer.  And this is true, in general, but it only holds true in the most general and simplistic senses and is dependent upon a rational actor making the selection.</p><p>For example, the ability to have A and B serving together in the military is no different than the ability to employ A and B in the workplace.  Assuming a perfectly rational recruiting process or employer, the best Bs will replace the worst As, thereby improving military efficiency or corporate productivity and therefore increasing economic growth.  However, this reasonable assumption fails to account for the very real possibility that a mixed military/workforce will introduce an element of disharmony (c) that will the average productivity of the As such that (A+B)c &lt; 2A.  What DM assumes is a settled case of economic theory is in fact no such thing.  The salient question is whether (c) actually exists, and if so, if it is sufficient to reduce the average productivity of A.  Furthermore, copious evidence exists to demonstrate that the recruiter/employer is not, in fact, perfectly rational and is quite willing to accept less productive Bs to replace more productive As.  (To DM’s credit, he suggests this possibility as an outside factor, although I tend to see it as an internal one inherent to the predictable characteristics of the Bs under discussion.)  Now, to address the question of why I did not make use of this analysis in the first place.  The answer is the notorious shaving implement of Occam.  Peter’s entire argument is founded on the flimsy and inaccurate assertion of “stunning” economic growth in the past fifty years.  Since his entire argument is based on this, the easiest way to take it down is to simply demonstrate that the present rate of economic growth – which has averaged 3.3 percent over the last decade – is nothing special.  (My suspicion is that he was misled by the big increase in GDP per capita without taking inflation into account.)  Interestingly enough, as our correction of DM’s theory would indicate, productivity per worker and the corresponding rate of economic growth has slowed significantly in the last 32 years since women entered the workforce in sufficient numbers to reduce the average wage rate, and not only in the USA but <a href=\"http://64.233.183.104/search?q=cache:92o0GDT3Y0MJ:www.j-bradford-delong.net/macro_online/ms/ch5/Chapter_5.pdf+US+economic+growth+1800+to+2000&amp;hl=de\">in every G7 country</a>.</p><p>1950-1973 Output per Worker Annual Growth USA<br>2.1%</br></p><p>1973-1995 Output per Worker Annual Growth USA<br>United States<br>0.6%</br></br></p><p>This would tend to support the concept of a productivity reducing (c) element at work.</p></div>",
  "content_text": "In which DM of Key Words demonstrates that I have some of the worst sycophants in the blogosphere.  It apparently seems to have escaped whole swaths of the Voxologisti that the entire point of being a sycophant\ncum\nsock puppet is supposed to revolve around offering mindless adulation and enthusiastically embracing my every drop of wisdom, however errant.  DM\naddresses the critique of Ralph Peters I posted yesterday\n:\nVox is not taking on the concept that increasing the number of workers an employer has to choose from helps the employer and – in doing so – also helps the economy. Instead he is bringing in distractors like comparing 1800’s growth to growth today (basically comparing a relatively new market that was expanding with each state added to the union to a well established one) or women in the armed forces (always good to sidetrack the issue).\nThis miss on the issue at hand is probably not accidental. Vox actually has a degree in economics from an Ivy League institution, so he is more than familiar with the pros and cons of a free market. He knows that offering “a or b” is more economically beneficial than simply offering “a,” so he knows he can’t win on a strictly economic front. He has other issues with women in the workforce – some actually well founded – and so attacks arguments that are contrary to the outcome he would prefer.\nPersonally, I feel he would be better off fighting his battles on his own territory. He does have valid issues that he can easily back up and can probably stand on their own merits. He doesn’t need to jump into side issues like this.\nBefore I address the substance, let me point out a few things.  1.  I don’t have a degree in econ from an Ivy League institution, I have degrees in Econ and Asian Studies (plus a history minor) from an Ivy League wannabee institution.  Same price, less status, prettier girls, better parties.  2.  Since Peters brought up women in the armed forces as a primary example of his point, it’s hardly side-tracking the issue.\nIndeed, I will even use that example to demonstrate how the entire argument can be won on the purely economic front DM mentions.  According to DM’s argument, the ability to choose A or B is always more beneficial than if A alone is on offer.  And this is true, in general, but it only holds true in the most general and simplistic senses and is dependent upon a rational actor making the selection.\nFor example, the ability to have A and B serving together in the military is no different than the ability to employ A and B in the workplace.  Assuming a perfectly rational recruiting process or employer, the best Bs will replace the worst As, thereby improving military efficiency or corporate productivity and therefore increasing economic growth.  However, this reasonable assumption fails to account for the very real possibility that a mixed military/workforce will introduce an element of disharmony (c) that will the average productivity of the As such that (A+B)c < 2A.  What DM assumes is a settled case of economic theory is in fact no such thing.  The salient question is whether (c) actually exists, and if so, if it is sufficient to reduce the average productivity of A.  Furthermore, copious evidence exists to demonstrate that the recruiter/employer is not, in fact, perfectly rational and is quite willing to accept less productive Bs to replace more productive As.  (To DM’s credit, he suggests this possibility as an outside factor, although I tend to see it as an internal one inherent to the predictable characteristics of the Bs under discussion.)  Now, to address the question of why I did not make use of this analysis in the first place.  The answer is the notorious shaving implement of Occam.  Peter’s entire argument is founded on the flimsy and inaccurate assertion of “stunning” economic growth in the past fifty years.  Since his entire argument is based on this, the easiest way to take it down is to simply demonstrate that the present rate of economic growth – which has averaged 3.3 percent over the last decade – is nothing special.  (My suspicion is that he was misled by the big increase in GDP per capita without taking inflation into account.)  Interestingly enough, as our correction of DM’s theory would indicate, productivity per worker and the corresponding rate of economic growth has slowed significantly in the last 32 years since women entered the workforce in sufficient numbers to reduce the average wage rate, and not only in the USA but\nin every G7 country\n.\n1950-1973 Output per Worker Annual Growth USA\n2.1%\n1973-1995 Output per Worker Annual Growth USA\nUnited States\n0.6%\nThis would tend to support the concept of a productivity reducing (c) element at work.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-10T15:46:00+00:00"
}