{
  "url": "https://voxday.net/2005/11/29/mailvox-someone-needs-dictionary/",
  "scraped_at": "2026-01-08T20:51:17.345476",
  "title": "Mailvox: someone needs a dictionary",
  "date_display": "November 29, 2005",
  "date_iso": "2005-11-29T15:54:00+00:00",
  "date_from_url": "2005-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Jade Knight is not exactly studying for the bar:</p><blockquote><p>Vox, mind posting a blog explaining to some of your hangers-on a little about the Public Domain?  A few of them seem to have the (quite erroneous) idea that anything to be found on the Internet is automatically in the public domain.</p><p>And this seems to be some of the more “benevolent” of their errors.</p><p>Truly, you should pick your champions better. They do anything but uphold your intelligence to a neutral observer.</p></blockquote><p>I was unaware that any of the Volk were wrongly profiting from the intellectual property of your friend with the LiveJournal.  Are they selling t-shirts with the trademarked phrase “I’m Going To Puke Now”?  Are they scraping the collective output of the Feminist Mormon Housewives, printing it and selling it at Barnes &amp; Noble and other fine bookstores?</p><p>If so, I’d encourage you to tell your friend to hire one of the lawyers here – The Perfect Aryan Male is a trademark and copyright law specialist – and have him write them a cease-and-desist order.</p><p>As for champions, the fact that there may be a few other big dogs lurking about the premises doesn’t mean I can’t take care of myself.  They’re not mine, I don’t feed them, they simply enjoy making a snack of the odd sheep passing by.  And when they do, I seldom bother to chime in as there’s little point in picking through the remains and chomping them again.</p><p>Now run along, little boy, run along.</p><p>UPDATE: Jade Knight helpfully explains that he’s not the one who needs a dictionary.  His comment quoted above was made here in response to an inaccurate remark made elsewhere that I did not see.  I am sorry for ripping him instead of the party who rightly deserved it.  By way of apology, I’ll explain what Jade was hoping I’d point out: public domain is intellectual property that is no longer copyrighted.  Copyright extends for the life of the author plus (X) years – Congress changed it recently at Disney’s <s>behest</s> request and I’m not sure what it is off the top of my head, 70 perhaps – after that time, a work is considered to be in the public domain and can be used by anyone.</p><p>This is why, when you go to Barnes and Noble, you’ll see numerous different versions of Pride and Prejudice or The Complete Works of Edgar Allen Poe.  Anyone can publish a book that is in the public domain, and publishers like this because they need not share any royalties with the copyright holder or his heirs.</p><p>Blogs, LiveJournals and personal correspondence are not in the public domain.  They are considered to be a form of copyrighted material, use of which is governed by the Fair Use law.  So, you can freely quote from another blog or a newspaper, so long as you do it within reason and don’t claim the work as your own.</p><p>Stacer’s objection, as I understand it from a friend of hers who emailed me, was that she thought a LiveJournal was private.  This is, as she has discovered, not true, it is public.  It is not, however, in the public domain.</p></div>",
  "content_text": "The Jade Knight is not exactly studying for the bar:\nVox, mind posting a blog explaining to some of your hangers-on a little about the Public Domain?  A few of them seem to have the (quite erroneous) idea that anything to be found on the Internet is automatically in the public domain.\nAnd this seems to be some of the more “benevolent” of their errors.\nTruly, you should pick your champions better. They do anything but uphold your intelligence to a neutral observer.\nI was unaware that any of the Volk were wrongly profiting from the intellectual property of your friend with the LiveJournal.  Are they selling t-shirts with the trademarked phrase “I’m Going To Puke Now”?  Are they scraping the collective output of the Feminist Mormon Housewives, printing it and selling it at Barnes & Noble and other fine bookstores?\nIf so, I’d encourage you to tell your friend to hire one of the lawyers here – The Perfect Aryan Male is a trademark and copyright law specialist – and have him write them a cease-and-desist order.\nAs for champions, the fact that there may be a few other big dogs lurking about the premises doesn’t mean I can’t take care of myself.  They’re not mine, I don’t feed them, they simply enjoy making a snack of the odd sheep passing by.  And when they do, I seldom bother to chime in as there’s little point in picking through the remains and chomping them again.\nNow run along, little boy, run along.\nUPDATE: Jade Knight helpfully explains that he’s not the one who needs a dictionary.  His comment quoted above was made here in response to an inaccurate remark made elsewhere that I did not see.  I am sorry for ripping him instead of the party who rightly deserved it.  By way of apology, I’ll explain what Jade was hoping I’d point out: public domain is intellectual property that is no longer copyrighted.  Copyright extends for the life of the author plus (X) years – Congress changed it recently at Disney’s\nbehest\nrequest and I’m not sure what it is off the top of my head, 70 perhaps – after that time, a work is considered to be in the public domain and can be used by anyone.\nThis is why, when you go to Barnes and Noble, you’ll see numerous different versions of Pride and Prejudice or The Complete Works of Edgar Allen Poe.  Anyone can publish a book that is in the public domain, and publishers like this because they need not share any royalties with the copyright holder or his heirs.\nBlogs, LiveJournals and personal correspondence are not in the public domain.  They are considered to be a form of copyrighted material, use of which is governed by the Fair Use law.  So, you can freely quote from another blog or a newspaper, so long as you do it within reason and don’t claim the work as your own.\nStacer’s objection, as I understand it from a friend of hers who emailed me, was that she thought a LiveJournal was private.  This is, as she has discovered, not true, it is public.  It is not, however, in the public domain.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-29T15:54:00+00:00"
}