{
  "url": "https://voxday.net/2005/11/30/media-whores-chapter-two/",
  "scraped_at": "2026-01-08T20:51:26.511250",
  "title": "Media Whores – Chapter Two",
  "date_display": "November 30, 2005",
  "date_iso": "2005-11-30T12:05:00+00:00",
  "date_from_url": "2005-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Eman asked for a definition of a media whore a few days ago.  Here, as promised, is one.  This is only a partial definition, however, and it is related to the variant I describe as the courtesan, as opposed to its charlatan counterpart.</em></p><p><b>MEDIA WHORES – CHAPTER TWO</b><br>The Courtesans<br><em>Cogliendo le rose.</em></br></br></p><p>Aristotle insists that in the process of rhetorical discourse, it is necessary to define one’s premises.  The media brothel exists, of this there can be no doubt, but what defines the whores who inhabit it?  For just as not everyone to be found within a brothel is a prostitute, not everyone in the media – not even everyone on camera – is a media whore.</p><p>Not all whores are created equal.  I was once acquainted with a girl, who, a few years later, happened to find employment working for a certain infamous Hollywood madam.  As we had remained friends, when the media pressure got too intense, she took refuge with me in Minnesota, which is the geographical equivalent of Stealth technology where the media’s radar is concerned.  This girl might have shared a profession with the local hookers working Hennepin Avenue, but the difference between them was both immediately obvious and deeply profound.(1)</p><p>Whereas the street hooker is employed solely to provide momentary gratification for a man’s physical needs, the call girl is primarily called upon to stimulate his ego.(2)  But in either case, all principles are sacrificed in favor of one over-riding principle, the pursuit of the almighty dollar by any means necessary.  In the same way, one can distinguish between the two primary sub-species of media whores: the courtesans, or those who are in service to others, and the charlatans, those who are in service only to themselves.</p><p>During the Renaissance, the courtesans of Venice were famous throughout Europe.  They were confused with the noble ladies of the day, just as today’s media whores are often mistaken for public intellectuals.  Georgina Masson, the author of “Courtesans of the Italian Renaissance”, writes, <em>“it was a public shame that prostitutes were to be seen in the streets and churches, and elsewhere, so much bejewelled and well-dressed, that very often noble ladies and women citizens [of Venice], because there is no difference in their attire from that of the above-said women, are confused with them; not only by foreigners, but by the inhabitants [of Venice], who are unable to tell the good from the bad.”</em></p><p>In the case of the courtesans of the mainstream media, their devotion to the lofty ideals of their would-be profession(3) is entirely absent, regardless of whether they belong to the nominally objective reporting class, or the openly biased commentary class.(4)  This can be best demonstrated by investigating the standards set by the professionals themselves.  According to the Society of Professional Journalists, a journalist should at all times be physically strong, mentally awake and morally straight.(5)  Furthermore, a journalist must:</p><p>1. Seek Truth and Report It.  Journalists should be honest, fair and courageous in gathering, reporting and interpreting information.<br>2. Minimize Harm.  Ethical journalists treat sources, subjects and colleagues as human beings deserving of respect.<br>3. Act Independently. Journalists should be free of obligation to any interest other than the public’s right to know.<br>4. Be Accountable.  Journalists are accountable to their readers, listeners, viewers and each other.</br></br></br></p><p>Some of the specific points of journalistic conduct are as follows:</p><p>● Give voice to the voiceless; official and unofficial sources of information can be equally valid.<br>● Diligently seek out subjects of news stories to give them the opportunity to respond to allegations of wrongdoing.<br>● Distinguish between advocacy and news reporting. Analysis and commentary should be labeled and not misrepresent fact or context.<br>● Show good taste.<br>● Never plagiarize.</br></br></br></br></p><p>As anyone who has read a newspaper or watched a news broadcast lately will  recognize, these points of journalistic conduct are honored mainly in the breach.  Take the latter, for instance.  The Associated Press is nothing but one gigantic mass of plagiarism, as it is standard practice for reporters to take a story that has been written by someone else, move a few words around, then publish it under their own byline.  If the standards for fictional plagiarism were this loose, one could publish a fat trilogy about a short, but stout-hearted little fellow travelling across Terra Media to Nordor destroy the Singular Ring in the fires of Mount Death without fear of the Tolkein estate dropping a battalion of paratrooper-lawyers armed with flamethrowers on your front lawn.</p><p>Here’s a shining example of AP-approved plagiarism from when the Swiftvet controversy first exploded, when the Saint Paul Pioneer Press ran an article from the Dallas Morning News that bore an eerie resemblance to another article that had run the day before in the Star Tribune.</p><p>The first similarity I noticed was this description of Swift Boat Vet John O’Neill. As written by Bob Von Sternberg on Saturday in the Star Tribune: <em>“In the book, longtime Kerry nemesis John O’Neill accuses him of distorting his war record for political gain.”</em> And as written by Bob Tarrant in the Dallas Morning News: <em>“The book, “Unfit for Command,” is co-authored by longtime Kerry nemesis John O’Neill, a Houston lawyer who followed Kerry as commander of Patrol Craft Fast 94.”</em></p><p>I suppose it’s possible that’s a coincidence. When you’re trying to subtly undermine a man’s credibility, there are only so many words in the English language to use for a particular set of facts. Although I think using “chronic Kerry cat caller” works even better than “long time Kerry nemesis”.  My charitable instincts faded when I came across these characterizations of chronic Kerry cat caller George Elliot. First, Von Sternberg in the Star Tribune:</p><p><em>“One, retired Capt. George Elliott, reportedly recanted his accusation that Kerry did not deserve his Silver Star. But after the Boston Globe published a story quoting him as saying he withdrew the charges, the Swift Boat Veterans released an affidavit in which Elliott swore he stood by his accusation. But in 1996, Elliott had been quoted in news reports praising Kerry’s actions as courageous.”</em></p><p>Now, Tarrant in the Dallas Morning News: <em>“One member in the ad, retired Capt. George Elliott, reportedly recanted his accusations that Kerry did not deserve his Silver Star. But after the Boston Globe published that, the Swift Boat Veterans released an affidavit in which Elliott swore he stood by his accusation. But in 1996, Elliott was quoted in news reports praising Kerry’s actions as courageous.”</em>(6)</p><p>Of course, mere thievery does not a courtesan make.  Other moral lapses are required, preferably those involving a supine position.  Here, too, the modern media does not disappoint, as the distinction between advocacy and news reporting has not so much been eroded as obliterated entirely, not only on the cable television networks, but also in more traditional institutions priding themselves on their celodurismo.(7)  That the media has abandoned reporting in favor of advocacy would not be so worrisome, were it not for the fact of the john for whom it has reliably and monolithically chosen to whore itself.  This, then, leads us to a formal description of the most common subspecies of <em>Scortus medius</em>, the Big Government Courtesan.</p><p>BIG GOVERNMENT COURTESAN<br><em>Scortus medius washingtonia</em></br></p><p><b>Description</b> Pasty white to dark brown, often with white-tipped hairs, giving grizzled appearance. Dark suit with white shirt and red tie.  Facial profile usually clean-shaven. In some areas, individuals may appear brownish or blackish, rarely bronze.  Single pair of prominent incisors<br> .  Ht about 6′ 0″ (130 cm); Wt 175–250 lb (77–112 kg); some individuals to 300 lb (133 kg). Female has blonde hair, usually dark at the roots.  Ht about 5′ 4″ (130 cm); Wt 115–135 lb (147–680 kg)</br></p><p><b>Breeding</b> After 4-7 year gestation in elite Ivy League university, young attach themselves to internship programs and entry level positions at media institutions or Congressional offices.</p><p><b>Habitat</b> Urban centers.  Favors television studios, newspaper offices and law firms.</p><p><b>Range</b> Most of U.S., except less common in rural Texas, n Idaho, New Hampshire and South Carolina.  Concentrated most strongly on the coasts.  Also s British Columbia east to Toronto.</p><p><em>Scortus medius washingtonia</em> is as common as <em>Blattella germanica</em>, and appears to serve much the same purpose.  Day after day, in broadcast after broadcast and newspaper after newspaper, it infests American homes and spreads disease by forcing the American people to submit to its deluge of its pro-government propaganda.  This is the case at every level, local, state and federal, and in those very rare cases when the coverage is negative, it is almost invariably focused on criticizing the government concerned for failing to act in an appropriately expansive manner.  One will wait in vain to hear <em>washingtonia</em> suggest that any matter, public or private, is not an appropriate concern of government.(8)</p><p>If the crisis of the day is a slowing economy throwing people out of work, the only answer, according to the courtesan media, is to turn to government to solve the problem.  If the problem is precisely the opposite, an overheated economy driving up prices, the solution is, again, government action.  If a global ice age and the threat of rampaging glaciers is imminent, the government must act.  If, on the other hand, global warming is about to cause the polar ice caps to melt and drown the coasts, the government must act.  The courtesan media is not unlike the man with the proverbial hammer, who perceives every problem as a nail in need of hammering.</p><p>In fact, it is almost impossible to conceive a problem for which <em>washingtonia</em> does not recommend expanding the seize and reach of government.  Strangely enough, this holds true even if the problem with which the media is concerning itself was caused by government in the first place.  This may be because the concept of accuracy is entirely foreign to the news media, as no other industry, not even the telephone psychics industry, has recorded such a poor predictive record on matters great and small.</p><p>Greg Easterbrook of the Brookings Institute has kept track of the New York Times quixotic quest to predict the final score of an NFL game.   Over four seasons, from 2000 to 2003, the Paper of Record went 3-1,085, an accuracy percentage of less than one-tenth of one percent.  And even that was the result of a blazing hot 2003 season, wherein the Times racked up two of its three correct predictions in going 2-270.  These wildly inaccurate sports predictions are harmless enough, but the effects are not so innocent where more serious matters of politics are concerned.</p><p>For example, when the Minnesota state legislature debated a proposed gun carry law in 2002, the  Minneapolis Star Tribune dredged up the same dire predictions of imminent bloodshed that the Dallas Morning News and other Texas newspapers had promulgated prior to the passage of Texas’ concealed-carry law in 1995.  The Star Tribune did so despite the fact that the Texas papers were proved to be completely wrong, as Texas murder rates dropped 50 percent from 1995 to 2000(9), 1.58 times faster than the decline in the national murder rate.  The Star Tribune repeatedly used these hysterical and baseless predictions to justify its editorial opposition to the proposed carry law, which finally passed in 2002 despite the Minnesota media’s bitter jihad against it.</p><p>Nor did the Star Tribune change its tune even after it became clear that the cornucopia of shootouts it predicted simply were not occurring with any degree of regularity, or indeed, at all.  Of the 15,734 carry permits issued by the state in 2003, only 20 were suspended, revoked or canceled, and none for serious crimes.(10)  One could almost feel their disappointment at not being able to break out the giant MURDEROPOLIS headline they’d been saving for the incipient Wild Midwest stories they were so eagerly anticipating.</p><p>In like manner, the courtesan media is repeatedly and woefully inaccurate in its economic coverage.  This is partly unavoidable, because the vast majority of commentators, aside from Dr. Thomas Sowell, (Senior Fellow, the Hoover Institution, Stanford University), Dr. Walter Williams, (Professor of Economics, George Mason University), Dr. Paul Craig Roberts, (former assistant secretary, U.S. Treasury), and, despite his muddle-headed Keynesianism, Dr. Paul Krugman, (Professor of Economics, Princeton University), could not tell you what M3(11) was to save their life.  Unfortunately, complete ignorance seldom prevents paperboys and talking heads from opining regularly on the subject once known as political economy.</p><p>This ignorant advocacy invariably insists that increasing government revenue through taxes and increasing government spending will strengthen the economy, despite the fact that the two actions are mutually contradictory in mainstream economic terms.(12)  Not only that, but economic history is very clear that the lethal combination of increased taxation and government spending inevitably ends badly in the long term.(13) Given that the Congress has already managed to destroy 94.71 percent(14) of the value of the U.S. dollar in 91 years, there is no reason to believe that things will end up any differently this time.</p><p>But the long term manifestly does not concern <em>medius washingtonia</em>, as it is usually impossible for the species to recall anything said or written the day before.  A short-term memory is an identifying marker key to spotting any media whore, but particularly one of the courtesan class.  For example, every estimate provided by the Washington Post predicting the results of income tax cuts for the last 20 years has significantly overestimated the subsequent net loss of government revenue.  And by the same token, every prediction it has made about the expected results of income tax hikes has significantly underestimated the net increase of government revenue.</p><p>This is because the Post’s economics writers use a static model of revenue analysis.  In other words, their model assumes that no one’s behavior will change as a result of their taxes going up or down.  This is, of course, not only completely illogical and wholly unrealistic, but contrary to every economic model developed since Adam Smith wrote “The Wealth of Nations” in 1776.  Although guaranteed to be inaccurate, the Post, along with almost every major newspaper, continues to use this static scoring model because the Joint Tax Committee of Congress and most state governments do.</p><p>And why do these governments insist on using such a broken analytical tool?  Because from their point of view, anything with an inherent bias towards exaggerating the positive impact of tax increases and the negative impact of tax cuts is, by definition, not broken.  Accuracy be damned, in the tangential world of the government bureaucrat, anything that increases budgets is good and anything that decreases them is bad.  The fact that the estimates for 2002, 2003 and 2004 were all errant with the same bias is no more relevant to these bureaucrats making estimates for 2005, or the courtesan media obediently passing these hopeless predictions on to an unsuspecting public, than the past phases of Jupiter.</p><p>Another example is the coverage of the Commerce Department’s revision of U.S. Gross Domestic Product in the second quarter of 2004.  Originally calculated at 3.0 percent, the number was revised to 2.8 percent on August 27, 2004.  The Associated Press reported that t<br> his was “slightly better than the 2.7 percent growth rate that some economists had forecast.”(15)</br></p><p>The problem is that earlier in the year, the Wall Street Journal’s Monthly Survey was reporting the consensus estimate to be 4.5 percent, with some economists predicting as high as 6 percent in May.  First, in a $10 trillion economy, this is a whopping miscalculation of between $170 and $320 billion.  That’s tremendous, but then, economics is more of an inexact art than a science.  More troubling, however, is the Associated Press’s disregard for the economists’ actual historical estimates in what appears to be an attempt to provide cover for the consensus view, especially when reminders of earlier optimism would likely have had negative effects on the stock market in the leadup to a November election.</p><p>A short-term memory is not the only identifier of a big government media whore.  Other important identifying characteristics include the following:</p><p>● The ability to turn on a dime.  Prior to the Iowa primaries, Howard Dean was the foremost beneficiary of mainstream media love.  As soon as the Democratic elders realized that he might actually win the nomination, the love for Howard ended faster than a Jennifer Lopez marriage.<br>● An eagerness to take the government at its word.  For some reason, it is standard practice to assume that the credibility of a government agency always trumps that of a private individual, even if there is no evidence in support of the government’s position.  The typical no-holds-barred investigation runs as follows: a) an individual makes a charge about a government agency and provides evidence.  b) the reporter asks an individual in the employ of the government agency if the charge is true while ignoring the evidence.  c) the employee of the government agency denies the charge.  d) the reporter reports that the charge is not true.(16)<br>● A distaste for independent thinking.  One need only look at the flocks of reporters that wait breathlessly upon the press releases issued by the White House, the Federal Reserve and other government institutions before turning around and regurgitating them for the public without even reading them to realize that most reporters are not so much reporting news as they are acting as de facto publicists for whatever agency or politician they are covering.<br>● A servile attitude towards government officials.  In discussing PBS Jim Lehrer’s moderation of the 2000 presidential debates, Jeff Cohen, the executive director of the media watchdog group Fairness and Accuracy in Reporting(17), said “The debates have become sort of like poll-tested posturing and rhetoric that never gets pierced by Lehrer.  The style of interviewing that he’s perfected is civil, though a more accurate term might be servile.”<br>● A cheerleader mentality.  Gary North writes of just such a mindset:  “A cheerleader seeks attention. He wants to be seen. It is not clear to him or anyone else why he should be seen. His means of gaining attention is to attach himself to a team. He wants to be on the winning side. He wants to be seen on the winning side.   Cheerleaders pretend that they control the crowd. The crowd pretends that their organized cheers in some way help their team or thwart the opposing team. They stand, they sit, they cheer in an organized way. They do what the head cheerleader tells them to do. These efforts have no effect. The team pays no attention. The outcome of the game is not influenced by organized cheers. This is boola-boola in action. This is a system of pretense: layers of pretense. The cheerleader thinks of himself as part of the team effort. He isn’t. The individuals in the crowd think of themselves as part of the team effort. They aren’t.”</br></br></br></br></p><p>The significant difference here, though, is that big government’s cheerleaders in the media do play an important role in the team effort.  It is no accident that as the corporate media has gotten larger and its relationship with government more incestuous, the old tradition of the Fourth Estate providing a check on the other three has faded away.  The list of those who’ve gone from government service straight into the media is a long one and extends to both sides of the factional aisle, including luminaries such as George Stephanopolous, Pat Buchanan, Peggy Noonan, David Frum, David Gergen and James Carville, to give a few of many possible examples.</p><p>This is why the word “cheerleader” fails to do justice to those who have so richly earned the title of <em>Scortus medius washingtonia</em>, big government courtesan.</p><p><b>(1)</b>I am speaking of variances in comportment and purpose, you understand.</p><p><b>(2)</b>Paying $1,500 a night to have sex is morally reprehensible.  Paying $1,500 to NOT have sex would seem to suggest rather strongly that the money would be better spent on a psychiatrist than a high-class prostitute.</p><p><b>(3)</b>Journalists like to consider their occupation a profession, but as the late Michael Kelly of the Washington Post explained to Hugh Hewitt, a true profession requires a license and a governing body, both of which are lacking in the case of journalism.  Hairdressers have a better case.</p><p><b>(4)</b>There is supposed to be a nominal difference between the two, not that you’d know it by listening to disgruntled liberals fulminating about Fox News Channel’s editorial commentators lacking journalistic integrity.  Or by reading the “objective news reporting” of the New York Times, for that matter.</p><p><b>(5)</b>Sorry, that’s the Boy Scouts, isn’t it.  I was just a little overwhelmed by the raw fumes of moral purity and journalistic integrity emanating from the Society.</p><p><b>(6)</b>I didn’t actually write any of that.  I just cut and pasted the entire thing, beginning with “The first similarity…” from my man Saint Paul of the Fraters Libertas blog.  But I manifestly did not do anything questionable because I am the proud owner of a license to steal, that is to say, a Press Card from Universal Press Syndicate.  I am journalist, hear me roar!</p><p><b>(7)</b>i.e. the hardest of the hard news.</p><p><b>(8)</b>Unless the future of a prominent Democratic politician is at risk.  In which case, everything must be considered a private matter and we should all pretend it never happened.  Sex is the one subject beyond government purview, unless you happen to need a condom, a birth control pill or an abortion, in which case the government is expected to provide it for you.</p><p><b>(9)</b>The National Center for Policy Analysis, May 26, 2000.</p><p><b>(10)</b> “Of 15,873 who applied for the permits in 2003, 139 were denied, according to a Bureau of Criminal Apprehension report released Monday.  Another 20 permits were suspended, revoked or canceled. In three cases, they were taken away because permit carriers were under the influence of alcohol. In two other cases, holders were under restraining orders for stalking or threatening people. In one case, a permit was suspended over the reckless discharge of a gun.  Another wrote a bad check.”  Star Tribune, March 2, 2004.  Note that this is quoted from an editorial written by former Minnesota governor Arne Carlson arguing AGAINST the Minnesota Personal Protection Act.</p><p><b>(11)</b>The broad measure of money supply, not the BMW.  It is now being phased out, so the proletariat don’t immediately realize the implications of Ben Bernahnke’s printing press philosophy.</p><p><b>(12)</b>The mainstream Keynesian formulation is C+I+G+(x-m) = GDP.  Increased taxation reduces C and I, while increased government spending increases G.  So, the two tend to cancel each other out, leaving only the question of which is more efficient, Consumer spending + business Investment or Government spending.  As history suggests that government efficiency is inherently oxymoronic, the answer should be obvious.</p><p><b>(13)</b> Hence John Maynard Keynes most famous quote: “In the long run, we are all dead.”  Our problem is that J<br> ohn Maynard is dead and the long run is now.</br></p><p><b>(14)</b>According to the Federal Reserve Bank of Minneapolis.  In the unlikely event you know anything about hedonic adjustment and the fiction known as the Consumer Price Index, then you understand the real situation is actually worse.</p><p><b>(15)</b> “Economy More Sluggish Than First Thought”.  Jeanine Aversa, Associated Press, August 27, 2004.  Despite the title, only the earlier official 3.0 percent estimate by the Commerce Department is mentioned.</p><p><b>(16)</b>I once spoke with the editor of a large metropolitan newspaper about this sort of thing.  He refused to believe that his reporter could possibly have been played so badly by a state government employee until I emailed him the story his reporter had written, the misleading statements about the state law by the state employee and the actual text of the state law.  It was immediately evident that the reporter had never bothered to so much as glance at the law.</p><p><b>(17)</b>The Associated Press, 10/18/2000.  For a former senior producer of Donahue and founder of a leftist media organization to call you servile, you’ve got to have an awful lot of shoe-black on your tongue.</p></div>",
  "content_text": "Eman asked for a definition of a media whore a few days ago.  Here, as promised, is one.  This is only a partial definition, however, and it is related to the variant I describe as the courtesan, as opposed to its charlatan counterpart.\nMEDIA WHORES – CHAPTER TWO\nThe Courtesans\nCogliendo le rose.\nAristotle insists that in the process of rhetorical discourse, it is necessary to define one’s premises.  The media brothel exists, of this there can be no doubt, but what defines the whores who inhabit it?  For just as not everyone to be found within a brothel is a prostitute, not everyone in the media – not even everyone on camera – is a media whore.\nNot all whores are created equal.  I was once acquainted with a girl, who, a few years later, happened to find employment working for a certain infamous Hollywood madam.  As we had remained friends, when the media pressure got too intense, she took refuge with me in Minnesota, which is the geographical equivalent of Stealth technology where the media’s radar is concerned.  This girl might have shared a profession with the local hookers working Hennepin Avenue, but the difference between them was both immediately obvious and deeply profound.(1)\nWhereas the street hooker is employed solely to provide momentary gratification for a man’s physical needs, the call girl is primarily called upon to stimulate his ego.(2)  But in either case, all principles are sacrificed in favor of one over-riding principle, the pursuit of the almighty dollar by any means necessary.  In the same way, one can distinguish between the two primary sub-species of media whores: the courtesans, or those who are in service to others, and the charlatans, those who are in service only to themselves.\nDuring the Renaissance, the courtesans of Venice were famous throughout Europe.  They were confused with the noble ladies of the day, just as today’s media whores are often mistaken for public intellectuals.  Georgina Masson, the author of “Courtesans of the Italian Renaissance”, writes,\n“it was a public shame that prostitutes were to be seen in the streets and churches, and elsewhere, so much bejewelled and well-dressed, that very often noble ladies and women citizens [of Venice], because there is no difference in their attire from that of the above-said women, are confused with them; not only by foreigners, but by the inhabitants [of Venice], who are unable to tell the good from the bad.”\nIn the case of the courtesans of the mainstream media, their devotion to the lofty ideals of their would-be profession(3) is entirely absent, regardless of whether they belong to the nominally objective reporting class, or the openly biased commentary class.(4)  This can be best demonstrated by investigating the standards set by the professionals themselves.  According to the Society of Professional Journalists, a journalist should at all times be physically strong, mentally awake and morally straight.(5)  Furthermore, a journalist must:\n1. Seek Truth and Report It.  Journalists should be honest, fair and courageous in gathering, reporting and interpreting information.\n2. Minimize Harm.  Ethical journalists treat sources, subjects and colleagues as human beings deserving of respect.\n3. Act Independently. Journalists should be free of obligation to any interest other than the public’s right to know.\n4. Be Accountable.  Journalists are accountable to their readers, listeners, viewers and each other.\nSome of the specific points of journalistic conduct are as follows:\n● Give voice to the voiceless; official and unofficial sources of information can be equally valid.\n● Diligently seek out subjects of news stories to give them the opportunity to respond to allegations of wrongdoing.\n● Distinguish between advocacy and news reporting. Analysis and commentary should be labeled and not misrepresent fact or context.\n● Show good taste.\n● Never plagiarize.\nAs anyone who has read a newspaper or watched a news broadcast lately will  recognize, these points of journalistic conduct are honored mainly in the breach.  Take the latter, for instance.  The Associated Press is nothing but one gigantic mass of plagiarism, as it is standard practice for reporters to take a story that has been written by someone else, move a few words around, then publish it under their own byline.  If the standards for fictional plagiarism were this loose, one could publish a fat trilogy about a short, but stout-hearted little fellow travelling across Terra Media to Nordor destroy the Singular Ring in the fires of Mount Death without fear of the Tolkein estate dropping a battalion of paratrooper-lawyers armed with flamethrowers on your front lawn.\nHere’s a shining example of AP-approved plagiarism from when the Swiftvet controversy first exploded, when the Saint Paul Pioneer Press ran an article from the Dallas Morning News that bore an eerie resemblance to another article that had run the day before in the Star Tribune.\nThe first similarity I noticed was this description of Swift Boat Vet John O’Neill. As written by Bob Von Sternberg on Saturday in the Star Tribune:\n“In the book, longtime Kerry nemesis John O’Neill accuses him of distorting his war record for political gain.”\nAnd as written by Bob Tarrant in the Dallas Morning News:\n“The book, “Unfit for Command,” is co-authored by longtime Kerry nemesis John O’Neill, a Houston lawyer who followed Kerry as commander of Patrol Craft Fast 94.”\nI suppose it’s possible that’s a coincidence. When you’re trying to subtly undermine a man’s credibility, there are only so many words in the English language to use for a particular set of facts. Although I think using “chronic Kerry cat caller” works even better than “long time Kerry nemesis”.  My charitable instincts faded when I came across these characterizations of chronic Kerry cat caller George Elliot. First, Von Sternberg in the Star Tribune:\n“One, retired Capt. George Elliott, reportedly recanted his accusation that Kerry did not deserve his Silver Star. But after the Boston Globe published a story quoting him as saying he withdrew the charges, the Swift Boat Veterans released an affidavit in which Elliott swore he stood by his accusation. But in 1996, Elliott had been quoted in news reports praising Kerry’s actions as courageous.”\nNow, Tarrant in the Dallas Morning News:\n“One member in the ad, retired Capt. George Elliott, reportedly recanted his accusations that Kerry did not deserve his Silver Star. But after the Boston Globe published that, the Swift Boat Veterans released an affidavit in which Elliott swore he stood by his accusation. But in 1996, Elliott was quoted in news reports praising Kerry’s actions as courageous.”\n(6)\nOf course, mere thievery does not a courtesan make.  Other moral lapses are required, preferably those involving a supine position.  Here, too, the modern media does not disappoint, as the distinction between advocacy and news reporting has not so much been eroded as obliterated entirely, not only on the cable television networks, but also in more traditional institutions priding themselves on their celodurismo.(7)  That the media has abandoned reporting in favor of advocacy would not be so worrisome, were it not for the fact of the john for whom it has reliably and monolithically chosen to whore itself.  This, then, leads us to a formal description of the most common subspecies of\nScortus medius\n, the Big Government Courtesan.\nBIG GOVERNMENT COURTESAN\nScortus medius washingtonia\nDescription\nPasty white to dark brown, often with white-tipped hairs, giving grizzled appearance. Dark suit with white shirt and red tie.  Facial profile usually clean-shaven. In some areas, individuals may appear brownish or blackish, rarely bronze.  Single pair of prominent incisors\n.  Ht about 6′ 0″ (130 cm); Wt 175–250 lb (77–112 kg); some individuals to 300 lb (133 kg). Female has blonde hair, usually dark at the roots.  Ht about 5′ 4″ (130 cm); Wt 115–135 lb (147–680 kg)\nBreeding\nAfter 4-7 year gestation in elite Ivy League university, young attach themselves to internship programs and entry level positions at media institutions or Congressional offices.\nHabitat\nUrban centers.  Favors television studios, newspaper offices and law firms.\nRange\nMost of U.S., except less common in rural Texas, n Idaho, New Hampshire and South Carolina.  Concentrated most strongly on the coasts.  Also s British Columbia east to Toronto.\nScortus medius washingtonia\nis as common as\nBlattella germanica\n, and appears to serve much the same purpose.  Day after day, in broadcast after broadcast and newspaper after newspaper, it infests American homes and spreads disease by forcing the American people to submit to its deluge of its pro-government propaganda.  This is the case at every level, local, state and federal, and in those very rare cases when the coverage is negative, it is almost invariably focused on criticizing the government concerned for failing to act in an appropriately expansive manner.  One will wait in vain to hear\nwashingtonia\nsuggest that any matter, public or private, is not an appropriate concern of government.(8)\nIf the crisis of the day is a slowing economy throwing people out of work, the only answer, according to the courtesan media, is to turn to government to solve the problem.  If the problem is precisely the opposite, an overheated economy driving up prices, the solution is, again, government action.  If a global ice age and the threat of rampaging glaciers is imminent, the government must act.  If, on the other hand, global warming is about to cause the polar ice caps to melt and drown the coasts, the government must act.  The courtesan media is not unlike the man with the proverbial hammer, who perceives every problem as a nail in need of hammering.\nIn fact, it is almost impossible to conceive a problem for which\nwashingtonia\ndoes not recommend expanding the seize and reach of government.  Strangely enough, this holds true even if the problem with which the media is concerning itself was caused by government in the first place.  This may be because the concept of accuracy is entirely foreign to the news media, as no other industry, not even the telephone psychics industry, has recorded such a poor predictive record on matters great and small.\nGreg Easterbrook of the Brookings Institute has kept track of the New York Times quixotic quest to predict the final score of an NFL game.   Over four seasons, from 2000 to 2003, the Paper of Record went 3-1,085, an accuracy percentage of less than one-tenth of one percent.  And even that was the result of a blazing hot 2003 season, wherein the Times racked up two of its three correct predictions in going 2-270.  These wildly inaccurate sports predictions are harmless enough, but the effects are not so innocent where more serious matters of politics are concerned.\nFor example, when the Minnesota state legislature debated a proposed gun carry law in 2002, the  Minneapolis Star Tribune dredged up the same dire predictions of imminent bloodshed that the Dallas Morning News and other Texas newspapers had promulgated prior to the passage of Texas’ concealed-carry law in 1995.  The Star Tribune did so despite the fact that the Texas papers were proved to be completely wrong, as Texas murder rates dropped 50 percent from 1995 to 2000(9), 1.58 times faster than the decline in the national murder rate.  The Star Tribune repeatedly used these hysterical and baseless predictions to justify its editorial opposition to the proposed carry law, which finally passed in 2002 despite the Minnesota media’s bitter jihad against it.\nNor did the Star Tribune change its tune even after it became clear that the cornucopia of shootouts it predicted simply were not occurring with any degree of regularity, or indeed, at all.  Of the 15,734 carry permits issued by the state in 2003, only 20 were suspended, revoked or canceled, and none for serious crimes.(10)  One could almost feel their disappointment at not being able to break out the giant MURDEROPOLIS headline they’d been saving for the incipient Wild Midwest stories they were so eagerly anticipating.\nIn like manner, the courtesan media is repeatedly and woefully inaccurate in its economic coverage.  This is partly unavoidable, because the vast majority of commentators, aside from Dr. Thomas Sowell, (Senior Fellow, the Hoover Institution, Stanford University), Dr. Walter Williams, (Professor of Economics, George Mason University), Dr. Paul Craig Roberts, (former assistant secretary, U.S. Treasury), and, despite his muddle-headed Keynesianism, Dr. Paul Krugman, (Professor of Economics, Princeton University), could not tell you what M3(11) was to save their life.  Unfortunately, complete ignorance seldom prevents paperboys and talking heads from opining regularly on the subject once known as political economy.\nThis ignorant advocacy invariably insists that increasing government revenue through taxes and increasing government spending will strengthen the economy, despite the fact that the two actions are mutually contradictory in mainstream economic terms.(12)  Not only that, but economic history is very clear that the lethal combination of increased taxation and government spending inevitably ends badly in the long term.(13) Given that the Congress has already managed to destroy 94.71 percent(14) of the value of the U.S. dollar in 91 years, there is no reason to believe that things will end up any differently this time.\nBut the long term manifestly does not concern\nmedius washingtonia\n, as it is usually impossible for the species to recall anything said or written the day before.  A short-term memory is an identifying marker key to spotting any media whore, but particularly one of the courtesan class.  For example, every estimate provided by the Washington Post predicting the results of income tax cuts for the last 20 years has significantly overestimated the subsequent net loss of government revenue.  And by the same token, every prediction it has made about the expected results of income tax hikes has significantly underestimated the net increase of government revenue.\nThis is because the Post’s economics writers use a static model of revenue analysis.  In other words, their model assumes that no one’s behavior will change as a result of their taxes going up or down.  This is, of course, not only completely illogical and wholly unrealistic, but contrary to every economic model developed since Adam Smith wrote “The Wealth of Nations” in 1776.  Although guaranteed to be inaccurate, the Post, along with almost every major newspaper, continues to use this static scoring model because the Joint Tax Committee of Congress and most state governments do.\nAnd why do these governments insist on using such a broken analytical tool?  Because from their point of view, anything with an inherent bias towards exaggerating the positive impact of tax increases and the negative impact of tax cuts is, by definition, not broken.  Accuracy be damned, in the tangential world of the government bureaucrat, anything that increases budgets is good and anything that decreases them is bad.  The fact that the estimates for 2002, 2003 and 2004 were all errant with the same bias is no more relevant to these bureaucrats making estimates for 2005, or the courtesan media obediently passing these hopeless predictions on to an unsuspecting public, than the past phases of Jupiter.\nAnother example is the coverage of the Commerce Department’s revision of U.S. Gross Domestic Product in the second quarter of 2004.  Originally calculated at 3.0 percent, the number was revised to 2.8 percent on August 27, 2004.  The Associated Press reported that t\nhis was “slightly better than the 2.7 percent growth rate that some economists had forecast.”(15)\nThe problem is that earlier in the year, the Wall Street Journal’s Monthly Survey was reporting the consensus estimate to be 4.5 percent, with some economists predicting as high as 6 percent in May.  First, in a $10 trillion economy, this is a whopping miscalculation of between $170 and $320 billion.  That’s tremendous, but then, economics is more of an inexact art than a science.  More troubling, however, is the Associated Press’s disregard for the economists’ actual historical estimates in what appears to be an attempt to provide cover for the consensus view, especially when reminders of earlier optimism would likely have had negative effects on the stock market in the leadup to a November election.\nA short-term memory is not the only identifier of a big government media whore.  Other important identifying characteristics include the following:\n● The ability to turn on a dime.  Prior to the Iowa primaries, Howard Dean was the foremost beneficiary of mainstream media love.  As soon as the Democratic elders realized that he might actually win the nomination, the love for Howard ended faster than a Jennifer Lopez marriage.\n● An eagerness to take the government at its word.  For some reason, it is standard practice to assume that the credibility of a government agency always trumps that of a private individual, even if there is no evidence in support of the government’s position.  The typical no-holds-barred investigation runs as follows: a) an individual makes a charge about a government agency and provides evidence.  b) the reporter asks an individual in the employ of the government agency if the charge is true while ignoring the evidence.  c) the employee of the government agency denies the charge.  d) the reporter reports that the charge is not true.(16)\n● A distaste for independent thinking.  One need only look at the flocks of reporters that wait breathlessly upon the press releases issued by the White House, the Federal Reserve and other government institutions before turning around and regurgitating them for the public without even reading them to realize that most reporters are not so much reporting news as they are acting as de facto publicists for whatever agency or politician they are covering.\n● A servile attitude towards government officials.  In discussing PBS Jim Lehrer’s moderation of the 2000 presidential debates, Jeff Cohen, the executive director of the media watchdog group Fairness and Accuracy in Reporting(17), said “The debates have become sort of like poll-tested posturing and rhetoric that never gets pierced by Lehrer.  The style of interviewing that he’s perfected is civil, though a more accurate term might be servile.”\n● A cheerleader mentality.  Gary North writes of just such a mindset:  “A cheerleader seeks attention. He wants to be seen. It is not clear to him or anyone else why he should be seen. His means of gaining attention is to attach himself to a team. He wants to be on the winning side. He wants to be seen on the winning side.   Cheerleaders pretend that they control the crowd. The crowd pretends that their organized cheers in some way help their team or thwart the opposing team. They stand, they sit, they cheer in an organized way. They do what the head cheerleader tells them to do. These efforts have no effect. The team pays no attention. The outcome of the game is not influenced by organized cheers. This is boola-boola in action. This is a system of pretense: layers of pretense. The cheerleader thinks of himself as part of the team effort. He isn’t. The individuals in the crowd think of themselves as part of the team effort. They aren’t.”\nThe significant difference here, though, is that big government’s cheerleaders in the media do play an important role in the team effort.  It is no accident that as the corporate media has gotten larger and its relationship with government more incestuous, the old tradition of the Fourth Estate providing a check on the other three has faded away.  The list of those who’ve gone from government service straight into the media is a long one and extends to both sides of the factional aisle, including luminaries such as George Stephanopolous, Pat Buchanan, Peggy Noonan, David Frum, David Gergen and James Carville, to give a few of many possible examples.\nThis is why the word “cheerleader” fails to do justice to those who have so richly earned the title of\nScortus medius washingtonia\n, big government courtesan.\n(1)\nI am speaking of variances in comportment and purpose, you understand.\n(2)\nPaying $1,500 a night to have sex is morally reprehensible.  Paying $1,500 to NOT have sex would seem to suggest rather strongly that the money would be better spent on a psychiatrist than a high-class prostitute.\n(3)\nJournalists like to consider their occupation a profession, but as the late Michael Kelly of the Washington Post explained to Hugh Hewitt, a true profession requires a license and a governing body, both of which are lacking in the case of journalism.  Hairdressers have a better case.\n(4)\nThere is supposed to be a nominal difference between the two, not that you’d know it by listening to disgruntled liberals fulminating about Fox News Channel’s editorial commentators lacking journalistic integrity.  Or by reading the “objective news reporting” of the New York Times, for that matter.\n(5)\nSorry, that’s the Boy Scouts, isn’t it.  I was just a little overwhelmed by the raw fumes of moral purity and journalistic integrity emanating from the Society.\n(6)\nI didn’t actually write any of that.  I just cut and pasted the entire thing, beginning with “The first similarity…” from my man Saint Paul of the Fraters Libertas blog.  But I manifestly did not do anything questionable because I am the proud owner of a license to steal, that is to say, a Press Card from Universal Press Syndicate.  I am journalist, hear me roar!\n(7)\ni.e. the hardest of the hard news.\n(8)\nUnless the future of a prominent Democratic politician is at risk.  In which case, everything must be considered a private matter and we should all pretend it never happened.  Sex is the one subject beyond government purview, unless you happen to need a condom, a birth control pill or an abortion, in which case the government is expected to provide it for you.\n(9)\nThe National Center for Policy Analysis, May 26, 2000.\n(10)\n“Of 15,873 who applied for the permits in 2003, 139 were denied, according to a Bureau of Criminal Apprehension report released Monday.  Another 20 permits were suspended, revoked or canceled. In three cases, they were taken away because permit carriers were under the influence of alcohol. In two other cases, holders were under restraining orders for stalking or threatening people. In one case, a permit was suspended over the reckless discharge of a gun.  Another wrote a bad check.”  Star Tribune, March 2, 2004.  Note that this is quoted from an editorial written by former Minnesota governor Arne Carlson arguing AGAINST the Minnesota Personal Protection Act.\n(11)\nThe broad measure of money supply, not the BMW.  It is now being phased out, so the proletariat don’t immediately realize the implications of Ben Bernahnke’s printing press philosophy.\n(12)\nThe mainstream Keynesian formulation is C+I+G+(x-m) = GDP.  Increased taxation reduces C and I, while increased government spending increases G.  So, the two tend to cancel each other out, leaving only the question of which is more efficient, Consumer spending + business Investment or Government spending.  As history suggests that government efficiency is inherently oxymoronic, the answer should be obvious.\n(13)\nHence John Maynard Keynes most famous quote: “In the long run, we are all dead.”  Our problem is that J\nohn Maynard is dead and the long run is now.\n(14)\nAccording to the Federal Reserve Bank of Minneapolis.  In the unlikely event you know anything about hedonic adjustment and the fiction known as the Consumer Price Index, then you understand the real situation is actually worse.\n(15)\n“Economy More Sluggish Than First Thought”.  Jeanine Aversa, Associated Press, August 27, 2004.  Despite the title, only the earlier official 3.0 percent estimate by the Commerce Department is mentioned.\n(16)\nI once spoke with the editor of a large metropolitan newspaper about this sort of thing.  He refused to believe that his reporter could possibly have been played so badly by a state government employee until I emailed him the story his reporter had written, the misleading statements about the state law by the state employee and the actual text of the state law.  It was immediately evident that the reporter had never bothered to so much as glance at the law.\n(17)\nThe Associated Press, 10/18/2000.  For a former senior producer of Donahue and founder of a leftist media organization to call you servile, you’ve got to have an awful lot of shoe-black on your tongue.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-30T12:05:00+00:00"
}