{
  "url": "https://voxday.net/2005/11/27/meet-mrs-dr-catlady/",
  "scraped_at": "2026-01-08T20:50:59.186021",
  "title": "Meet Mrs. Dr. Catlady",
  "date_display": "November 27, 2005",
  "date_iso": "2005-11-27T17:22:00+00:00",
  "date_from_url": "2005-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What a delightful surprise!  Dr. Catlady’s fiance turns out to be one of the lovely and charming minxes from Electrolite!  Now, <a href=\"http://www.livejournal.com/users/scott_lynch/166448.html?mode=reply&amp;style=mine\">first read how he characterizes our exchange</a>, then note the minor bit of information he omits:</p><blockquote><p>“Jigna Desai, associate professor. BA in Astrophysics from MIT.</p><p>She’s the second core professor on the list.</p><p>Jacquelyn Zita, BA in Biology from Washington University.</p><p>She’s the ninth core professor on the list.</p><p>Two “lab science” degrees in just thirty seconds of research, Vox. Now, if you didn’t know this, it means you didn’t do any research before you started tossing out “facts” in public. If you did know this, it means you’ll lie to preserve your caricature before you’ll incorporate contradictory evidence honestly into your arguments. A third and possibly more charitable interpretation is that you’re just a really, really sloppy reader.”</p><p>His response was (in addition to noting that I had mistakenly written ‘BA’ for one of those degrees which was actually a ‘BS,’ which of course negates my response in its entirety):</p><p>“Yeah, real scientists, those two. Feeble, Scott, very feeble.”</p><p>And my final words:</p><p>“No, truthful, Vox, very truthful. Your exact words, easily disproven, were “not a single scientist in the bunch.” I suppose, of course, that the fact these women merely earned degrees in hard science disciplines isn’t enough to fit the Vox Day Conveniently Adjustable Definition of a scientist. But then, you can special-plead your way out of anything if your streak of intellectual cowardice is wide enough. Yours is an eight-lane highway.”</p></blockquote><p>Oxford would also appear to disagree, as it defines a scientist as “a person who has expert knowledge of one or more of the natural or physical sciences”.  Is a bachelor’s degree sufficient to grant “expert knowledge”?  I certainly don’t think so, as the linguistics suggest that one would require at least a “master’s” to fit this dictionary definition.</p><p>The colloquial understanding of a scientist is one who researches science and, to a lesser extent, teaches it in a university setting.  So, let’s see what those two “scientists” are researching and teaching, shall we?  By the way, this aspect is something I pointed out at the time, but Mrs. Dr. Catlady somehow doesn’t see fit to mention it in his “very truthful” account of the exchange.</p><p><em>“You could probably count on one hand the number of M.I.T. astrophysics alumni <a href=\"http://www2.cla.umn.edu/clatoday/FW2003/Desai.html\">who do research in Hindi cinema</a>. Actually, there may be only one. Her name is Jigna Desai, and she’s at the University of Minnesota….  While earning her bachelor’s degree in astrophysics at M.I.T., she says, she realized that “teaching physics wouldn’t get at the social justice issues that were important to me.” So instead of a physics lab, she opted for the University of Minnesota, where she could get a minor in feminist studies while she earned her doctorate in English.</em></p><p>As a part of her scientific exploration: <em>“<a href=\"http://www.frontlist.com/detail/041596685X\">From a feminist and queer perspective</a>, Jigna Desai explores the hybrid cinema of the Brown Atlantic through a close look at films in English…”</em></p><p>As for our other “scientist”, <a href=\"http://womenstudy.cla.umn.edu/faculty/gradExpertise.php?UID=zitax001\">Jacquelyne Zita</a>, she is busily engaged with feminist theory and philosophy, gender, lesbian/gay studies as an associate professor of Women’s Studies.</p><p>No wonder women scientists have such a hard time developing new technologies and receiving patents.  Perhaps if they spent less time researching queer Hindu cinema or <a href=\"http://chronicle.com/free/v45/i14/14a01001.htm\">“giving students a map of feminist history”</a> and more in the laboratory, they might actually get somewhere.  I have a BS in economics and a BA in Asian studies, that doesn’t make me an economist any more than it makes me Asian.</p></div>",
  "content_text": "What a delightful surprise!  Dr. Catlady’s fiance turns out to be one of the lovely and charming minxes from Electrolite!  Now,\nfirst read how he characterizes our exchange\n, then note the minor bit of information he omits:\n“Jigna Desai, associate professor. BA in Astrophysics from MIT.\nShe’s the second core professor on the list.\nJacquelyn Zita, BA in Biology from Washington University.\nShe’s the ninth core professor on the list.\nTwo “lab science” degrees in just thirty seconds of research, Vox. Now, if you didn’t know this, it means you didn’t do any research before you started tossing out “facts” in public. If you did know this, it means you’ll lie to preserve your caricature before you’ll incorporate contradictory evidence honestly into your arguments. A third and possibly more charitable interpretation is that you’re just a really, really sloppy reader.”\nHis response was (in addition to noting that I had mistakenly written ‘BA’ for one of those degrees which was actually a ‘BS,’ which of course negates my response in its entirety):\n“Yeah, real scientists, those two. Feeble, Scott, very feeble.”\nAnd my final words:\n“No, truthful, Vox, very truthful. Your exact words, easily disproven, were “not a single scientist in the bunch.” I suppose, of course, that the fact these women merely earned degrees in hard science disciplines isn’t enough to fit the Vox Day Conveniently Adjustable Definition of a scientist. But then, you can special-plead your way out of anything if your streak of intellectual cowardice is wide enough. Yours is an eight-lane highway.”\nOxford would also appear to disagree, as it defines a scientist as “a person who has expert knowledge of one or more of the natural or physical sciences”.  Is a bachelor’s degree sufficient to grant “expert knowledge”?  I certainly don’t think so, as the linguistics suggest that one would require at least a “master’s” to fit this dictionary definition.\nThe colloquial understanding of a scientist is one who researches science and, to a lesser extent, teaches it in a university setting.  So, let’s see what those two “scientists” are researching and teaching, shall we?  By the way, this aspect is something I pointed out at the time, but Mrs. Dr. Catlady somehow doesn’t see fit to mention it in his “very truthful” account of the exchange.\n“You could probably count on one hand the number of M.I.T. astrophysics alumni\nwho do research in Hindi cinema\n. Actually, there may be only one. Her name is Jigna Desai, and she’s at the University of Minnesota….  While earning her bachelor’s degree in astrophysics at M.I.T., she says, she realized that “teaching physics wouldn’t get at the social justice issues that were important to me.” So instead of a physics lab, she opted for the University of Minnesota, where she could get a minor in feminist studies while she earned her doctorate in English.\nAs a part of her scientific exploration:\n“\nFrom a feminist and queer perspective\n, Jigna Desai explores the hybrid cinema of the Brown Atlantic through a close look at films in English…”\nAs for our other “scientist”,\nJacquelyne Zita\n, she is busily engaged with feminist theory and philosophy, gender, lesbian/gay studies as an associate professor of Women’s Studies.\nNo wonder women scientists have such a hard time developing new technologies and receiving patents.  Perhaps if they spent less time researching queer Hindu cinema or\n“giving students a map of feminist history”\nand more in the laboratory, they might actually get somewhere.  I have a BS in economics and a BA in Asian studies, that doesn’t make me an economist any more than it makes me Asian.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-27T17:22:00+00:00"
}