{
  "url": "https://voxday.net/2005/11/02/note-from-farmer-to/",
  "scraped_at": "2026-01-08T20:48:44.493597",
  "title": "A note from Farmer Tom",
  "date_display": "November 2, 2005",
  "date_iso": "2005-11-02T19:08:00+00:00",
  "date_from_url": "2005-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>My wife and I would like to thank all of you who have prayed for us and for the family. We have been so encouraged by those who told us they were praying for us. We have also felt that Peace that only the Holy Spirit brings to those that know that “Our Faith is Not in Vain”.  Thank You Again.</em></p><p><a href=\"http://twinkleye.com/\">Steve Logemann</a> was born in 1960 and lived all his life near the town of Ledyard, Iowa. He loved the farm and went to two years of Community College in an Ag Studies Program after his graduation from the local high school. He also loved working with computers and was constantly updating his system, trouble shooting other peoples systems for them and talking about the latest programs, software and hardware. He tied his love of farming with the love of computers by doing all the record keeping of his operation on the computers, eventually leading to mapping systems using GPS to study soil types, seed varities, and yields of the crops he grew. His skill with computers was good enough that he was hired by a local computer business to assemble, service and sell computers when he wasn’t farming.</p><p>Steve was very involved in the activities of Raccon River Bible Camp, a independent fundamental Bible camp near Scranton, IA. From the time he was a young boy he was there every summer, learning God’s Word, fellowshiping  with other believers and growing in his personal relationship with Jesus Christ. He was nominated to the camp board and served as a board member for more than 15 years. Steve met his wife at camp as well and she served as the camp treasuer with her husband. <br>They were blessed with four children, and they have already mentioned times as camp with Steve as some of the memories they will always treasure. Steve was also very active in his church, was a deacon, a Sunday school teacher, and usher.</br></p><p>Steve was killed in an accident during harvest, somehow he was run over by the combine while his father was unloading corn into a wagon.</p><p>Several have asked about contributing to the family. Steve’s wife told me, that memorials should be sent in his name to</p><p>Raccoon River Bible Camp<br>875 B. Avenue<br>Scranton, IA  51462</br></br></p></div>",
  "content_text": "My wife and I would like to thank all of you who have prayed for us and for the family. We have been so encouraged by those who told us they were praying for us. We have also felt that Peace that only the Holy Spirit brings to those that know that “Our Faith is Not in Vain”.  Thank You Again.\nSteve Logemann\nwas born in 1960 and lived all his life near the town of Ledyard, Iowa. He loved the farm and went to two years of Community College in an Ag Studies Program after his graduation from the local high school. He also loved working with computers and was constantly updating his system, trouble shooting other peoples systems for them and talking about the latest programs, software and hardware. He tied his love of farming with the love of computers by doing all the record keeping of his operation on the computers, eventually leading to mapping systems using GPS to study soil types, seed varities, and yields of the crops he grew. His skill with computers was good enough that he was hired by a local computer business to assemble, service and sell computers when he wasn’t farming.\nSteve was very involved in the activities of Raccon River Bible Camp, a independent fundamental Bible camp near Scranton, IA. From the time he was a young boy he was there every summer, learning God’s Word, fellowshiping  with other believers and growing in his personal relationship with Jesus Christ. He was nominated to the camp board and served as a board member for more than 15 years. Steve met his wife at camp as well and she served as the camp treasuer with her husband.\nThey were blessed with four children, and they have already mentioned times as camp with Steve as some of the memories they will always treasure. Steve was also very active in his church, was a deacon, a Sunday school teacher, and usher.\nSteve was killed in an accident during harvest, somehow he was run over by the combine while his father was unloading corn into a wagon.\nSeveral have asked about contributing to the family. Steve’s wife told me, that memorials should be sent in his name to\nRaccoon River Bible Camp\n875 B. Avenue\nScranton, IA  51462",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-02T19:08:00+00:00"
}