{
  "url": "https://voxday.net/2005/11/29/stampede-of-two/",
  "scraped_at": "2026-01-08T20:51:18.825830",
  "title": "A stampede of two",
  "date_display": "November 29, 2005",
  "date_iso": "2005-11-29T17:36:00+00:00",
  "date_from_url": "2005-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Blogger Blaster <a href=\"http://www.pandagon.net/archives/2005/11/the_subtext_is.html\">joins the White Buffalo in trampling the sheep</a>:</p><blockquote><p>BB:<b>The introduction of God solves one crucial thing. It provides an objective measure of right and wrong.</b></p><p>Let me give an example..</p><p>Says the Moral Relativist: “Rapist… what you do is evil.”</p><p>Says the Rapist: “No. What I do is good. For I define good as that which pleases me.”</p><p>Says the Moral Relativist: “But you are harming another.”</p><p>Says the Rapist: “A living things seeks to discharge its strength. I am strong. It is my purpose to use that strength. The weak are here for the strong to use as they so choose.”</p><p>Says the Moral Relativist: “ummm…”</p><p>While it may be distastful… it is simply obtuse to claim that “Because God said so.” cannot be a useful tool in controlling the masses.</p><p>Rumblelizard:<em>That’s an awfully stupid moral relativist your Rapist is talking to, BB.</em></p><p>Christopher :<em>Let’s try another dialogue:</em></p><p>Moral non-reletivist: Rapist, what you do is wrong, god said so.</p><p>Rapist: No, god has said that women are to be subordinate to men. I’m acting out my divine right.</p><p>Moral etc.: Ummm…</p><p>Bloggerblaster:<b>Depending on which god you’re referring to that could be correct, or incorrect. Certainly the God of Islam would agree. Which is why in moslem countries rape victims are either forced to marry the rapist, or they are killed.  Interestingly… Nations with Christian influences handle rape much differently.  Wonder why that is?</b></p><p>RumbleLizard, But you are not a stupid moral relativist… so please… enlighten me. I honestly do not know what basis a moral relativist has for justifying the belief that his belief that rape is wrong, is in anyway more correct than another’s view that rape is right.</p><p>I know what I believe… Like Buffy the White, I’d like to know what you believe.  Is it all just Might Makes Right?</p><p>Christopher: <em>Um… BloggerBlaster, you didn’t address my point, which is that essentially the one conception of god isn’t any more convincing or true then the other.  Instead of me arguing personally with the psycho, it’s the psycho’s idea of god arguing with my idea of god.  And whether it’s us or our gods that are arguing, the method for resolving the argument remains the same; The person with more power prevents the person with less power from acting on their version of morality….  Like I said, I don’t have an answer for you on how to objectively prove that goodness is good. But the idea of god doesn’t help.</em></p><p>Rumblelizard: <em>Well, first off, BB, a *real* moral relativist wouldn’t even get so far as to tell the Rapist that what he did was “evil.” “Moral relativists” make no moral judgements, because it’s all “relative,” remember?  Refuting the argument of the Rapist really only needs some observations along the “there’s always a bigger fish, and how would you like being the rapee” plus “complying with the golden rule = pragmatic good for all” line. </em></p></blockquote><p>I’m not surprised that the response of the Pandagonians boiled down to Might Makes Right – a pro-rape argument if I’ve ever heard one – combined with some feeble hand-waving that wouldn’t convince a two-year old.  “How would you like it?”  Yes, that’s a powerful foundation for an objective morality indeed.  The heart of the Left is always a dark one, hidden beneath its posturing pretense to moral superiority</p><p>I am, however, deeply shocked that the Blogger Blaster managed to remain within shouting distance – okay, whistling distance – of conventional spelling and capitalization.</p></div>",
  "content_text": "The Blogger Blaster\njoins the White Buffalo in trampling the sheep\n:\nBB:\nThe introduction of God solves one crucial thing. It provides an objective measure of right and wrong.\nLet me give an example..\nSays the Moral Relativist: “Rapist… what you do is evil.”\nSays the Rapist: “No. What I do is good. For I define good as that which pleases me.”\nSays the Moral Relativist: “But you are harming another.”\nSays the Rapist: “A living things seeks to discharge its strength. I am strong. It is my purpose to use that strength. The weak are here for the strong to use as they so choose.”\nSays the Moral Relativist: “ummm…”\nWhile it may be distastful… it is simply obtuse to claim that “Because God said so.” cannot be a useful tool in controlling the masses.\nRumblelizard:\nThat’s an awfully stupid moral relativist your Rapist is talking to, BB.\nChristopher :\nLet’s try another dialogue:\nMoral non-reletivist: Rapist, what you do is wrong, god said so.\nRapist: No, god has said that women are to be subordinate to men. I’m acting out my divine right.\nMoral etc.: Ummm…\nBloggerblaster:\nDepending on which god you’re referring to that could be correct, or incorrect. Certainly the God of Islam would agree. Which is why in moslem countries rape victims are either forced to marry the rapist, or they are killed.  Interestingly… Nations with Christian influences handle rape much differently.  Wonder why that is?\nRumbleLizard, But you are not a stupid moral relativist… so please… enlighten me. I honestly do not know what basis a moral relativist has for justifying the belief that his belief that rape is wrong, is in anyway more correct than another’s view that rape is right.\nI know what I believe… Like Buffy the White, I’d like to know what you believe.  Is it all just Might Makes Right?\nChristopher:\nUm… BloggerBlaster, you didn’t address my point, which is that essentially the one conception of god isn’t any more convincing or true then the other.  Instead of me arguing personally with the psycho, it’s the psycho’s idea of god arguing with my idea of god.  And whether it’s us or our gods that are arguing, the method for resolving the argument remains the same; The person with more power prevents the person with less power from acting on their version of morality….  Like I said, I don’t have an answer for you on how to objectively prove that goodness is good. But the idea of god doesn’t help.\nRumblelizard:\nWell, first off, BB, a *real* moral relativist wouldn’t even get so far as to tell the Rapist that what he did was “evil.” “Moral relativists” make no moral judgements, because it’s all “relative,” remember?  Refuting the argument of the Rapist really only needs some observations along the “there’s always a bigger fish, and how would you like being the rapee” plus “complying with the golden rule = pragmatic good for all” line.\nI’m not surprised that the response of the Pandagonians boiled down to Might Makes Right – a pro-rape argument if I’ve ever heard one – combined with some feeble hand-waving that wouldn’t convince a two-year old.  “How would you like it?”  Yes, that’s a powerful foundation for an objective morality indeed.  The heart of the Left is always a dark one, hidden beneath its posturing pretense to moral superiority\nI am, however, deeply shocked that the Blogger Blaster managed to remain within shouting distance – okay, whistling distance – of conventional spelling and capitalization.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-29T17:36:00+00:00"
}