{
  "url": "https://voxday.net/2005/11/30/theys-all-my-bitches-now/",
  "scraped_at": "2026-01-08T20:51:20.301661",
  "title": "Theys all my bitches now",
  "date_display": "November 30, 2005",
  "date_iso": "2005-11-30T01:22:00+00:00",
  "date_from_url": "2005-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s like <a href=\"http://blog.shrub.com/archives/tekanji/2005-11-29_76\">the telephone game in kindergarten</a>:</p><blockquote><p>Is November “National Blame The Victim Month” or something? No, I mean seriously. First it was Nick Kiddle’s post on hir near-rape experience and the discussions that followed it, then there was the McDonalds thing, and the British poll, and now some idiot who I’ve never heard of before now (Vox Day) believes that rape is a man’s right because women are his property. No joke.</p></blockquote><p>This just keeps getting better.  At this rate, within a week there will be frightened women bloggers sending out email alerts (!) warning of how I brutally raped Amandagon, Wonkette and Me So Michelle.  Not to mention Renee, of course, but that really didn’t count since she volunteered.</p><p>In another two weeks, catladies across the country will be frantically switching to battery-operated machinery for fear of being molested by an uploaded superintelligence possessing their “massagers” through the current.</p><p>“Near-rape experience”.  Ah yes, isn’t that what it’s called when a man glances up and a nearby feminist thinks he may have been looking at her?  Scary stuff!</p><p>UPDATE: These Strong Independent Women aren’t just “sick” and prone to “puke” and wet themselves before the awe-inspiring terror of an alien idea: <em>I’m still thinking about something I was reading last night that actually moved me to tears. Vox Day has been holding forth that there is no such thing as date rape.</em></p><p>Well, if you’re going to cry about it, it’s obvious that I must modify my thought processes.  I myself am feeling on the verge of tears… of laughter.</p></div>",
  "content_text": "It’s like\nthe telephone game in kindergarten\n:\nIs November “National Blame The Victim Month” or something? No, I mean seriously. First it was Nick Kiddle’s post on hir near-rape experience and the discussions that followed it, then there was the McDonalds thing, and the British poll, and now some idiot who I’ve never heard of before now (Vox Day) believes that rape is a man’s right because women are his property. No joke.\nThis just keeps getting better.  At this rate, within a week there will be frightened women bloggers sending out email alerts (!) warning of how I brutally raped Amandagon, Wonkette and Me So Michelle.  Not to mention Renee, of course, but that really didn’t count since she volunteered.\nIn another two weeks, catladies across the country will be frantically switching to battery-operated machinery for fear of being molested by an uploaded superintelligence possessing their “massagers” through the current.\n“Near-rape experience”.  Ah yes, isn’t that what it’s called when a man glances up and a nearby feminist thinks he may have been looking at her?  Scary stuff!\nUPDATE: These Strong Independent Women aren’t just “sick” and prone to “puke” and wet themselves before the awe-inspiring terror of an alien idea:\nI’m still thinking about something I was reading last night that actually moved me to tears. Vox Day has been holding forth that there is no such thing as date rape.\nWell, if you’re going to cry about it, it’s obvious that I must modify my thought processes.  I myself am feeling on the verge of tears… of laughter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-30T01:22:00+00:00"
}