{
  "url": "https://voxday.net/2005/11/27/umberto-eco-comes-to-chesterton/",
  "scraped_at": "2026-01-08T20:50:57.339590",
  "title": "Umberto Eco comes to Chesterton",
  "date_display": "November 27, 2005",
  "date_iso": "2005-11-27T14:43:00+00:00",
  "date_from_url": "2005-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Umberto Eco shows himself to be <a href=\"http://www.telegraph.co.uk/comment/personal-view/3621313/God-isnt-big-enough-for-some-people.html\">a moralist in spite of himself</a>:</p><blockquote><p> Human<br> beings are religious animals. It is psychologically very hard to go<br> through life without the justification, and the hope, provided by<br> religion. You can see this in the positivist scientists of the 19th<br> century.</br></br></br></br></p><p>They insisted that they were describing the universe in<br> rigorously materialistic terms – yet at night they attended seances and<br> tried to summon up the spirits of the dead. Even today, I frequently<br> meet scientists who, outside their own narrow discipline, are<br> superstitious – to such an extent that it sometimes seems to me that to<br> be a rigorous unbeliever today, you have to be a philosopher. Or perhaps<br> a priest….</br></br></br></br></br></br></p><p>G K Chesterton is often credited with observing:<br> “When a man ceases to believe in God, he doesn’t believe in nothing. He<br> believes in anything.” Whoever said it – he was right. We are supposed<br> to live in a sceptical age. In fact, we live in an age of outrageous<br> credulity.</br></br></br></br></p></blockquote><p>Eco, a non-Christian but a great humanist<br> in the best sense of the term, herein expresses the essence of<br> Voltaire’s point regarding the fundamental necessity of religion.  Human<br> beings are not capable of maintaining a spiritual vaccuum and they will<br> fill that void with faith in something.  In some cases, they will fill<br> it with something harmless, in others, something silly, in still others,<br> something actively evil.</br></br></br></br></br></br></p><p>I see Eco’s article as tangentially<br> related to yesterday’s discussion, which demonstrated again how decent<br> atheists and agnostics raised in a Christian culture parasitically and<br> irrationally latch onto the greater part of the morality they reject as a<br> whole, causing them to react in horror as their fellow disbelievers not<br> privy or more resistant to such moral indoctrination behave rationally<br> in the manner exhorted by Nietzsche and accepted with sardonic<br> resignation by the existentialists.</br></br></br></br></br></br></br></p><p>The essential point that<br> continues to evade most of these decent disbelievers is that regardless<br> of the ethical structure he erects to rationalize his subscription to<br> traditional morals imposed on his consciousness by society, he has no<br> logic beyond simple utilitarianism to offer anyone else.  His definition<br> of good and evil – assuming he even accepts such things – is his alone.<br> He can say to the rapist “what you do is evil”, but he has no<br> effective response when the certainly rapist says to him “what I do is<br> good, because I define good as that which pleases me” or ” A living<br> thing seeks above all to discharge its strength” nor does he have a<br> legitimate grounds for preventing or punishing the rapist.</br></br></br></br></br></br></br></br></br></br></p><p>Even<br> the ethical arguments based on utilitarianism can fail here.  In a<br> demographically declining West, the rapist can quite reasonably argue<br> that he is committing an act for the good of society, even for the good<br> of humanity, in forcing himself on a woman who intends to remain<br> childless.  Indeed, an honest devotee of “the greater good” would have<br> to at least consider supporting a policy of forcibly impregnating the<br> most intelligent women, accompanied, of course, with a revivial of the<br> historical eugenicism aimed at sterilizing the least intelligent.</br></br></br></br></br></br></br></br></p><p>This<br> is, of course, abhorrent to the Christian morality, which Nietzsche<br> rightly viewed as a defender of the weak.  But on what grounds does a<br> utilitarian object?</br></br></br></p><p>There is no dearth of philosophical systems<br> of ethics, and they are all useless because they make no logical claim<br> on those who do not voluntarily accept it.  This is why the atheist, the<br> agnostic and the pagan so readily resort to force as a substitute for<br> ethics, because their arguments are toothless.  To be fair, one must<br> admit there is no shortage of Christians who do the same in their<br> confusion of government-mandated legality with Biblically-mandated<br> morality.</br></br></br></br></br></br></br></p><p>Eco quotes another lapsed Catholic, Joyce: <i>“”What<br> kind of liberation would that be to forsake an absurdity which is<br> logical and coherent and to embrace one which is illogical and<br> incoherent?”</br></br></br></i> I would add: what profits it an individual to forsake<br> a morality which is logical and coherent and to embrace one which is<br> illogical, incoherent and inapplicable to others?</br></br></p><p>(In case it is not readily apparent, I did not translate this for The Telegraph.)</p></div>",
  "content_text": "Umberto Eco shows himself to be\na moralist in spite of himself\n:\nHuman\nbeings are religious animals. It is psychologically very hard to go\nthrough life without the justification, and the hope, provided by\nreligion. You can see this in the positivist scientists of the 19th\ncentury.\nThey insisted that they were describing the universe in\nrigorously materialistic terms – yet at night they attended seances and\ntried to summon up the spirits of the dead. Even today, I frequently\nmeet scientists who, outside their own narrow discipline, are\nsuperstitious – to such an extent that it sometimes seems to me that to\nbe a rigorous unbeliever today, you have to be a philosopher. Or perhaps\na priest….\nG K Chesterton is often credited with observing:\n“When a man ceases to believe in God, he doesn’t believe in nothing. He\nbelieves in anything.” Whoever said it – he was right. We are supposed\nto live in a sceptical age. In fact, we live in an age of outrageous\ncredulity.\nEco, a non-Christian but a great humanist\nin the best sense of the term, herein expresses the essence of\nVoltaire’s point regarding the fundamental necessity of religion.  Human\nbeings are not capable of maintaining a spiritual vaccuum and they will\nfill that void with faith in something.  In some cases, they will fill\nit with something harmless, in others, something silly, in still others,\nsomething actively evil.\nI see Eco’s article as tangentially\nrelated to yesterday’s discussion, which demonstrated again how decent\natheists and agnostics raised in a Christian culture parasitically and\nirrationally latch onto the greater part of the morality they reject as a\nwhole, causing them to react in horror as their fellow disbelievers not\nprivy or more resistant to such moral indoctrination behave rationally\nin the manner exhorted by Nietzsche and accepted with sardonic\nresignation by the existentialists.\nThe essential point that\ncontinues to evade most of these decent disbelievers is that regardless\nof the ethical structure he erects to rationalize his subscription to\ntraditional morals imposed on his consciousness by society, he has no\nlogic beyond simple utilitarianism to offer anyone else.  His definition\nof good and evil – assuming he even accepts such things – is his alone.\nHe can say to the rapist “what you do is evil”, but he has no\neffective response when the certainly rapist says to him “what I do is\ngood, because I define good as that which pleases me” or ” A living\nthing seeks above all to discharge its strength” nor does he have a\nlegitimate grounds for preventing or punishing the rapist.\nEven\nthe ethical arguments based on utilitarianism can fail here.  In a\ndemographically declining West, the rapist can quite reasonably argue\nthat he is committing an act for the good of society, even for the good\nof humanity, in forcing himself on a woman who intends to remain\nchildless.  Indeed, an honest devotee of “the greater good” would have\nto at least consider supporting a policy of forcibly impregnating the\nmost intelligent women, accompanied, of course, with a revivial of the\nhistorical eugenicism aimed at sterilizing the least intelligent.\nThis\nis, of course, abhorrent to the Christian morality, which Nietzsche\nrightly viewed as a defender of the weak.  But on what grounds does a\nutilitarian object?\nThere is no dearth of philosophical systems\nof ethics, and they are all useless because they make no logical claim\non those who do not voluntarily accept it.  This is why the atheist, the\nagnostic and the pagan so readily resort to force as a substitute for\nethics, because their arguments are toothless.  To be fair, one must\nadmit there is no shortage of Christians who do the same in their\nconfusion of government-mandated legality with Biblically-mandated\nmorality.\nEco quotes another lapsed Catholic, Joyce:\n“”What\nkind of liberation would that be to forsake an absurdity which is\nlogical and coherent and to embrace one which is illogical and\nincoherent?”\nI would add: what profits it an individual to forsake\na morality which is logical and coherent and to embrace one which is\nillogical, incoherent and inapplicable to others?\n(In case it is not readily apparent, I did not translate this for The Telegraph.)",
  "tags": [
    "Eco",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2005-11-27T14:43:00+00:00"
}