{
  "url": "https://voxday.net/2005/11/28/you-are-property-girls/",
  "scraped_at": "2026-01-08T20:51:08.068125",
  "title": "You are property, girls",
  "date_display": "November 28, 2005",
  "date_iso": "2005-11-28T10:40:00+00:00",
  "date_from_url": "2005-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stacer <a href=\"http://www.livejournal.com/users/norroway/57877.html\">needs someone to explain the dark mystery of my appeal to her</a>:</p><blockquote><p>I was reading a post on Feminist Mormon Housewives that led me to a link on Hugo’s blog that led me to another of Hugo’s posts that led me somewhere else, can’t remember, which led me to this disgusting diatribe. Basically, the guy says that women are property and rape doesn’t exist. And I have friends who think this guy is great?!</p><p>So please, those of you who read him, please, please, please tell me why you think he has any sort of redeeming qualities. I’m going to go puke now.</p></blockquote><p>Perhaps this is because they can actually read.  Stating that date rape is a myth and cannot possibly be considered a crime is not tantamount to stating that rape doesn’t exist.  And why do women think that anyone cares if they “feel sick” or “can’t breathe” when exposed to an alien idea?  Do they think this expressed incapacity to survive exposure to diverse modes of thought makes people take them more or less seriously?  What’s funny is how some of them will then proceed to assert my narrow-mindedness, completely unaware of the irony.</p><p>As to the matter under discussion, you can choose your poison, girls, but one way or another, you are property.  Deal with it.  And don’t feel so bad.  In most cases, the guys are property too.</p><p>As a libertarian, I consider an individual, male or female, to hold the property title to himself; as a Christian libertarian, I would further assert that a woman does not hold the property title to an unborn child that happens to be present in her body, based on the distinct DNA.  But in general, I believe that you have the perfect right to put, or not put, as many chemicals, bullets and penises in yourself as you like.</p><p>Now, the wisdom or the morality of doing so is another matter entirely, and in any case, there is no shortage of those who disagree with my take on the concept:</p><p>1.  The US federal government, which engages in a little legal sleight-of-hand confusing the juristical person (YOUR NAME) and the natural person (Your Name).  If you happen to confuse the two and go along with the charade, well, that’s really not their fault, now, is it?  You may not be <em>de jure</em> property, but you certainly are <em>de facto</em>.</p><p>2.  Left-wing ideology holds that the individual is the property of the state, as everything belongs to the people via the state prior to its inevitable and inexplicable withering away.  Hence the state-owned brothels that are a feature of most communist nations, where the loftiest ambition of a majority of schoolgirls is to become a hard currency hooker; from each according to her ability, right?  On a related note, you may recall that the socialist-run Bundesrepublik was recently on the verge of requiring women on the dole to work as prostitutes.  And as Mussolini famously said: <em>“Tutto nello stato, niente al di fuori dello stato, nulla contro lo stato.”</em> Do you see any exception for individuals there?  I certainly don’t.</p><p>3.  There are no shortage of Muslim and African countries where women are the property of their fathers and husbands.  The fact that Stacer doesn’t like this doesn’t change the legal reality.  And unless she is a cultural bigot, how can she possibly object to a cultural tradition held by over a billion people?  In these countries, some men are property, others are not.</p><p>4.  The United Nations purports to grant a list of basic human rights, but then goes on to declare that none of the rights therein may be exercised to the detriment of the interests of the United Nations.  Ergo, the UN position can be legitimately extrapolated to conclude that individual humans are the property of the United Nations, which makes sense considering that many of the member states which make up the UN subscribe to property concepts 2 and 3.</p><p>5.  A feudal monarchy presupposes most property, including lands, buildings, rents, crops, animals and people, belongs to the king.  Such property could be held on the king’s behalf, but the monarch still ultimately held title.  The intrinsic link between the historical notion that title to all property and persons belongs to the king as head of state and the revolutionary concept that all title is held by the collective people through the vehicle of the state itself is why Hayek’s famous critique of the Left is entitled “The Road to Serfdom”.</p><p>6.  The Christian believes that he belongs to God.  He believes that everything else belongs to “the prince of this world”.</p><p>You are property.  The only question is: who owns you?</p><p>UPDATE: Amandagon, much to my surprise, <a href=\"http://www.pandagon.net/archives/2005/11/the_subtext_is.html\">reveals herself to be an unexpected champion of firearms ownership</a>: <em>But this is the very best example of how biology is misunderstood by the Vox Day crowd–they seem unable to understand that women are in fact fully functioning, muscular animals who can do things like, for instance, lift a gun and shoot it.</em></p><p>Right, it would NEVER occur to a bunch of right-wing libertarian extremists and conservative Constitutionalists who probably own several million rounds of ammunition between them that women can shoot guns.  I own assault rifles of which most people have never even heard, Space Bunny has a laser on her Glock nine and the mere mention of a preferred caliber can spark disputation to rival that of evolution, abortion or the Civil War… so, what do you shoot, Amanda?  As if the various feminist groups aren’t almost as anti-gun as they are pro-abortion.</p><p>And speaking of massive Pandagunk in your synapses, check out this beauty from Mildred: <em>But the most essential part of all libertarianism is moral relativism! If he calls himself a libertarian and then says “from a moral relativist’s view…” how is that…. how can he… what the…Oh my God…  Argh! The Stupidity! The Stupidity! *nose bleeds*</em></p><p>This is the flip-side of what we usually see from conservatives, conflating legality with morality.  Libertarianism is a political ideology relating to governments, not a religious or ethical ideology relating to individuals.  It’s not surprising that the mere act of thinking should cause Mildred’s brain to swell and bleed, as she also managed completely misread my earlier post and believed I was championing the notion of a Nietszchean claim on any desirable bodies in my vicinity.</p><p>Would she not look beautiful in chains?  Just call me Tarl.</p></div>",
  "content_text": "Stacer\nneeds someone to explain the dark mystery of my appeal to her\n:\nI was reading a post on Feminist Mormon Housewives that led me to a link on Hugo’s blog that led me to another of Hugo’s posts that led me somewhere else, can’t remember, which led me to this disgusting diatribe. Basically, the guy says that women are property and rape doesn’t exist. And I have friends who think this guy is great?!\nSo please, those of you who read him, please, please, please tell me why you think he has any sort of redeeming qualities. I’m going to go puke now.\nPerhaps this is because they can actually read.  Stating that date rape is a myth and cannot possibly be considered a crime is not tantamount to stating that rape doesn’t exist.  And why do women think that anyone cares if they “feel sick” or “can’t breathe” when exposed to an alien idea?  Do they think this expressed incapacity to survive exposure to diverse modes of thought makes people take them more or less seriously?  What’s funny is how some of them will then proceed to assert my narrow-mindedness, completely unaware of the irony.\nAs to the matter under discussion, you can choose your poison, girls, but one way or another, you are property.  Deal with it.  And don’t feel so bad.  In most cases, the guys are property too.\nAs a libertarian, I consider an individual, male or female, to hold the property title to himself; as a Christian libertarian, I would further assert that a woman does not hold the property title to an unborn child that happens to be present in her body, based on the distinct DNA.  But in general, I believe that you have the perfect right to put, or not put, as many chemicals, bullets and penises in yourself as you like.\nNow, the wisdom or the morality of doing so is another matter entirely, and in any case, there is no shortage of those who disagree with my take on the concept:\n1.  The US federal government, which engages in a little legal sleight-of-hand confusing the juristical person (YOUR NAME) and the natural person (Your Name).  If you happen to confuse the two and go along with the charade, well, that’s really not their fault, now, is it?  You may not be\nde jure\nproperty, but you certainly are\nde facto\n.\n2.  Left-wing ideology holds that the individual is the property of the state, as everything belongs to the people via the state prior to its inevitable and inexplicable withering away.  Hence the state-owned brothels that are a feature of most communist nations, where the loftiest ambition of a majority of schoolgirls is to become a hard currency hooker; from each according to her ability, right?  On a related note, you may recall that the socialist-run Bundesrepublik was recently on the verge of requiring women on the dole to work as prostitutes.  And as Mussolini famously said:\n“Tutto nello stato, niente al di fuori dello stato, nulla contro lo stato.”\nDo you see any exception for individuals there?  I certainly don’t.\n3.  There are no shortage of Muslim and African countries where women are the property of their fathers and husbands.  The fact that Stacer doesn’t like this doesn’t change the legal reality.  And unless she is a cultural bigot, how can she possibly object to a cultural tradition held by over a billion people?  In these countries, some men are property, others are not.\n4.  The United Nations purports to grant a list of basic human rights, but then goes on to declare that none of the rights therein may be exercised to the detriment of the interests of the United Nations.  Ergo, the UN position can be legitimately extrapolated to conclude that individual humans are the property of the United Nations, which makes sense considering that many of the member states which make up the UN subscribe to property concepts 2 and 3.\n5.  A feudal monarchy presupposes most property, including lands, buildings, rents, crops, animals and people, belongs to the king.  Such property could be held on the king’s behalf, but the monarch still ultimately held title.  The intrinsic link between the historical notion that title to all property and persons belongs to the king as head of state and the revolutionary concept that all title is held by the collective people through the vehicle of the state itself is why Hayek’s famous critique of the Left is entitled “The Road to Serfdom”.\n6.  The Christian believes that he belongs to God.  He believes that everything else belongs to “the prince of this world”.\nYou are property.  The only question is: who owns you?\nUPDATE: Amandagon, much to my surprise,\nreveals herself to be an unexpected champion of firearms ownership\n:\nBut this is the very best example of how biology is misunderstood by the Vox Day crowd–they seem unable to understand that women are in fact fully functioning, muscular animals who can do things like, for instance, lift a gun and shoot it.\nRight, it would NEVER occur to a bunch of right-wing libertarian extremists and conservative Constitutionalists who probably own several million rounds of ammunition between them that women can shoot guns.  I own assault rifles of which most people have never even heard, Space Bunny has a laser on her Glock nine and the mere mention of a preferred caliber can spark disputation to rival that of evolution, abortion or the Civil War… so, what do you shoot, Amanda?  As if the various feminist groups aren’t almost as anti-gun as they are pro-abortion.\nAnd speaking of massive Pandagunk in your synapses, check out this beauty from Mildred:\nBut the most essential part of all libertarianism is moral relativism! If he calls himself a libertarian and then says “from a moral relativist’s view…” how is that…. how can he… what the…Oh my God…  Argh! The Stupidity! The Stupidity! *nose bleeds*\nThis is the flip-side of what we usually see from conservatives, conflating legality with morality.  Libertarianism is a political ideology relating to governments, not a religious or ethical ideology relating to individuals.  It’s not surprising that the mere act of thinking should cause Mildred’s brain to swell and bleed, as she also managed completely misread my earlier post and believed I was championing the notion of a Nietszchean claim on any desirable bodies in my vicinity.\nWould she not look beautiful in chains?  Just call me Tarl.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-11-28T10:40:00+00:00"
}