{
  "url": "https://voxday.net/2003/11/07/because-democrats-are-socialists/",
  "scraped_at": "2025-12-13T15:33:44.740073",
  "title": "Because Democrats ARE Socialists",
  "date_display": "November 7, 2003",
  "date_iso": "2003-11-07T16:18:00+00:00",
  "date_from_url": "2003-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tim Graham of NRO writes: <em>This caught my ear last night on C-SPAN radio during the commute. In the Senate Judiciary Committee hearing on Janice Rogers Brown, the Democrats took turns denouncing Brown for her shocking statement that the New Deal marked a “socialist revolution”! This is where you show them what Milton Friedman put in “Free to Choose,” that the 1928 Socialist Party platform under candidate Norman Thomas is pretty much all government reality now (and was 20 years ago).</em></p><p>Of course they’re denouncing her.  She’s onto them and is willing to call them out on it.  There’s nothing shocking about what she is saying – although if she points out that Herbert Hoover, far from being a champion of business and the free market, was also more than a bit of a socialist, I would be surprised.</p></div>",
  "content_text": "Tim Graham of NRO writes:\nThis caught my ear last night on C-SPAN radio during the commute. In the Senate Judiciary Committee hearing on Janice Rogers Brown, the Democrats took turns denouncing Brown for her shocking statement that the New Deal marked a “socialist revolution”! This is where you show them what Milton Friedman put in “Free to Choose,” that the 1928 Socialist Party platform under candidate Norman Thomas is pretty much all government reality now (and was 20 years ago).\nOf course they’re denouncing her.  She’s onto them and is willing to call them out on it.  There’s nothing shocking about what she is saying – although if she points out that Herbert Hoover, far from being a champion of business and the free market, was also more than a bit of a socialist, I would be surprised.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-07T16:18:00+00:00"
}