{
  "url": "https://voxday.net/2003/11/05/bring-back-tearaways/",
  "scraped_at": "2025-12-13T15:33:21.564159",
  "title": "Bring back the tearaways",
  "date_display": "November 5, 2003",
  "date_iso": "2003-11-05T11:56:00+00:00",
  "date_from_url": "2003-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I haven’t been heavily into college sports since I was a kid – I used to love watching the old Southwestern Conference games with the all-out running attacks and the tearaway jerseys and one of my most prized possessions was a white mesh Texas Longhorns practice jersey – but I’m intrigued by all this <a href=\"http://sportsillustrated.cnn.com/2003/writers/stewart_mandel/11/04/conference.breakdown/index.html\">conference hopping</a>.  It started out being all about the football and the ACC, and I like how adding Miami, Virginia Tech and BC will prevent Florida State from walking away with the title every year.</p><p>But with the Big East replacing the loss of those three teams with Cinncinati, Louisville and Marquette, holy smokes!  There’s a conference to own basketball season tickets.  As for Conference USA and the WAC, who really cares?  They’re regional conferences of no more national interest than the Mountain West or the Atlantic 10.</p><p>Now, we just have to get Notre Dame to join the Big Ten, get the Big Ten to change its increasingly inaccurate name to the Big 12, have the Big 12 change its name to the SouthWestern Conference – and bring back the tearaways while we’re at it – and have Army join the Patriot League.  That’s my platform if I ever run for NCAA president.  Oh, and let’s pay the doggone players, while we’re at it.  Don’t bind the mouths of the cows that drag the ploughs, or however that goes.</p></div>",
  "content_text": "I haven’t been heavily into college sports since I was a kid – I used to love watching the old Southwestern Conference games with the all-out running attacks and the tearaway jerseys and one of my most prized possessions was a white mesh Texas Longhorns practice jersey – but I’m intrigued by all this\nconference hopping\n.  It started out being all about the football and the ACC, and I like how adding Miami, Virginia Tech and BC will prevent Florida State from walking away with the title every year.\nBut with the Big East replacing the loss of those three teams with Cinncinati, Louisville and Marquette, holy smokes!  There’s a conference to own basketball season tickets.  As for Conference USA and the WAC, who really cares?  They’re regional conferences of no more national interest than the Mountain West or the Atlantic 10.\nNow, we just have to get Notre Dame to join the Big Ten, get the Big Ten to change its increasingly inaccurate name to the Big 12, have the Big 12 change its name to the SouthWestern Conference – and bring back the tearaways while we’re at it – and have Army join the Patriot League.  That’s my platform if I ever run for NCAA president.  Oh, and let’s pay the doggone players, while we’re at it.  Don’t bind the mouths of the cows that drag the ploughs, or however that goes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-05T11:56:00+00:00"
}