{
  "url": "https://voxday.net/2003/11/12/calling-feminist-feminazi-is-insult-to/",
  "scraped_at": "2025-12-13T15:34:24.427270",
  "title": "Calling a feminist a feminazi is an insult to National Socialism",
  "date_display": "November 12, 2003",
  "date_iso": "2003-11-12T13:51:00+00:00",
  "date_from_url": "2003-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AT writes again: <em>Why is it when its about sex, men seem to only reap the benefits and none of the consequences – the burden of the female sex, apparently. What nazis perceived to be a deadly enemy was pure, unadulterated brainwashing – kind of like men that think that women have abortions to get promotions and orgasms….. Are your parents like this to, or did you join a cult? I am just curious.</em></p><p>Let’s just count the flaws:</p><p>1.  Yes, pregnancy is the burden of the female sex.  This is news to you?  Did you miss health class?<br> <br>2.  By AT’s absurd fairness-based logic, unless a man has the equal right to rip a baby out of his impregnated lover’s womb and kill it, he should not be held responsible for the child.<br> <br>3.  Yes, the National Socialists brainwashed the German population into believing that Jews were not humans, in much the same way that the murderous feminist movement has brainwashed a portion of the American population into believing that an unborn child is not a human.<br> <br>4.  Most women get abortions simply because they don’t wish to deal with the hassle of a pregnancy.  And while a pregnancy is inarguably a physical and emotional strain, the abortionettes can’t even argue that the decision to kill the baby has anything to do with the burden of raising the child, since adoption is a perfectly reasonable alternative.  Bringing side issues such as rape and health of the mother is irrelevant, since only a tiny percentage of abortions have anything to do with either.  In any event, we don’t kill the children of criminals, so the fact that a child is the product of a rape is no justification for taking an innocent human life.<br> <br>5.  There are millions of people across the country who believe that killing babies, born or unborn, is murder.  The fact that AT thinks it is necessary to be a member of a cult to believe this just shows how far removed from reality or any sense of morality she is.</br></br></br></br></br></br></br></br></p><p>I wonder how long the abortionettes would hold to their position that an unborn baby is simply an inhuman mass of tissue if someone started taking a baseball bat to the bellies of pregnant women who have supported abortion rights.  Because, by abortionette logic, that’s nothing more than a simple case of battery, after all.  Not even a felony.  No wonder the Connor and Laci Peterson case empties their intestines.</p><p>We think we’re better than Nazi Germany, because we haven’t killed 6 million Jews.  We’ve only murdered 40 million babies.  Future civilizations will not only judge us, it will despise us more than we loathe Nazi Germany.</p></div>",
  "content_text": "AT writes again:\nWhy is it when its about sex, men seem to only reap the benefits and none of the consequences – the burden of the female sex, apparently. What nazis perceived to be a deadly enemy was pure, unadulterated brainwashing – kind of like men that think that women have abortions to get promotions and orgasms….. Are your parents like this to, or did you join a cult? I am just curious.\nLet’s just count the flaws:\n1.  Yes, pregnancy is the burden of the female sex.  This is news to you?  Did you miss health class?\n2.  By AT’s absurd fairness-based logic, unless a man has the equal right to rip a baby out of his impregnated lover’s womb and kill it, he should not be held responsible for the child.\n3.  Yes, the National Socialists brainwashed the German population into believing that Jews were not humans, in much the same way that the murderous feminist movement has brainwashed a portion of the American population into believing that an unborn child is not a human.\n4.  Most women get abortions simply because they don’t wish to deal with the hassle of a pregnancy.  And while a pregnancy is inarguably a physical and emotional strain, the abortionettes can’t even argue that the decision to kill the baby has anything to do with the burden of raising the child, since adoption is a perfectly reasonable alternative.  Bringing side issues such as rape and health of the mother is irrelevant, since only a tiny percentage of abortions have anything to do with either.  In any event, we don’t kill the children of criminals, so the fact that a child is the product of a rape is no justification for taking an innocent human life.\n5.  There are millions of people across the country who believe that killing babies, born or unborn, is murder.  The fact that AT thinks it is necessary to be a member of a cult to believe this just shows how far removed from reality or any sense of morality she is.\nI wonder how long the abortionettes would hold to their position that an unborn baby is simply an inhuman mass of tissue if someone started taking a baseball bat to the bellies of pregnant women who have supported abortion rights.  Because, by abortionette logic, that’s nothing more than a simple case of battery, after all.  Not even a felony.  No wonder the Connor and Laci Peterson case empties their intestines.\nWe think we’re better than Nazi Germany, because we haven’t killed 6 million Jews.  We’ve only murdered 40 million babies.  Future civilizations will not only judge us, it will despise us more than we loathe Nazi Germany.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-12T13:51:00+00:00"
}