{
  "url": "https://voxday.net/2003/11/04/forget-lcd/",
  "scraped_at": "2025-12-13T15:33:13.706253",
  "title": "Forget the LCD",
  "date_display": "November 4, 2003",
  "date_iso": "2003-11-04T13:04:00+00:00",
  "date_from_url": "2003-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reader ML writes: <em>“I really like what you have to say. But… your columns can be hard to read and follow. Very hard. I doubt that much more than 2% of U.S. are capable of and are willing to follow some of your deeper articles. I’ve quit in the middle of your column before. Please allow me to make the recommendation that was made to me in high school: consider who your audience is and write for them. It’s still good advice, even after all these years. btw, Who are your audience? Maybe I’m just trying to read someone else’s mail.”</em></p><p>ML is probably correct in saying that my columns can be a little dense at times, though I would imagine that percentage to be somewhat higher.  But I have no intention of altering the column in order to [choose your description – a) make it more accessible; b) chase readership; c) dumb it down], since there is already a plethora of columnists writing for the mainstream conservative audience.  For example, Rich Lowry’s recent column entitled <a href=\"http://www.townhall.com/columnists/richlowry/rl20031103.shtml\">Black Hawk Down, Again</a> and its stay-the-course theme was predictable within minutes of the Chinook being shot down.  In fact, I even predicted it to my UPS editor.  Does that make Rich a bad columnist?  Of course not – he’s one of my favorites among the younger set – only different than the sort of columnist I want to be.  I’d much rather have a career following the likes of George Will or Thomas Sowell instead of Rush Limbaugh or Ann Coulter.  That’s just my preference.</p><p>My belief is that most readers enjoy being stretched intellectually from time to time.  I know I do, though certainly not always.  Sometimes I feel like slogging through Calvino in the original, and other times I prefer to take it easy with a trashy Dragonlance novel.  Speaking of which, <em>The Dragons of Krynn</em> is pretty good, but avoid <em>Darkness and Light</em> at all costs.  Bad, bad, bad, bad, bad!  Anyhow, I’d rather know that people skip past my column from time to time when they don’t feel like dealing with it than attempt to chase some phantom sweet spot or pursue the lowest common denominator.</p><p>Who is my audience?  I would say everyone who loves freedom, liberty and Constitutional America.  One does not have to grok the fullness or be my Ideal Reader in order to take a useful bit of information away from a column.  But don’t worry.  I like to keep things simple and light-hearted from time to time too.  Just wait for next week’s WND column.  It’s as accessible and slashingly contemptuous of the Left as Miss Coulter’s most perjorative missives.</p></div>",
  "content_text": "Reader ML writes:\n“I really like what you have to say. But… your columns can be hard to read and follow. Very hard. I doubt that much more than 2% of U.S. are capable of and are willing to follow some of your deeper articles. I’ve quit in the middle of your column before. Please allow me to make the recommendation that was made to me in high school: consider who your audience is and write for them. It’s still good advice, even after all these years. btw, Who are your audience? Maybe I’m just trying to read someone else’s mail.”\nML is probably correct in saying that my columns can be a little dense at times, though I would imagine that percentage to be somewhat higher.  But I have no intention of altering the column in order to [choose your description – a) make it more accessible; b) chase readership; c) dumb it down], since there is already a plethora of columnists writing for the mainstream conservative audience.  For example, Rich Lowry’s recent column entitled\nBlack Hawk Down, Again\nand its stay-the-course theme was predictable within minutes of the Chinook being shot down.  In fact, I even predicted it to my UPS editor.  Does that make Rich a bad columnist?  Of course not – he’s one of my favorites among the younger set – only different than the sort of columnist I want to be.  I’d much rather have a career following the likes of George Will or Thomas Sowell instead of Rush Limbaugh or Ann Coulter.  That’s just my preference.\nMy belief is that most readers enjoy being stretched intellectually from time to time.  I know I do, though certainly not always.  Sometimes I feel like slogging through Calvino in the original, and other times I prefer to take it easy with a trashy Dragonlance novel.  Speaking of which,\nThe Dragons of Krynn\nis pretty good, but avoid\nDarkness and Light\nat all costs.  Bad, bad, bad, bad, bad!  Anyhow, I’d rather know that people skip past my column from time to time when they don’t feel like dealing with it than attempt to chase some phantom sweet spot or pursue the lowest common denominator.\nWho is my audience?  I would say everyone who loves freedom, liberty and Constitutional America.  One does not have to grok the fullness or be my Ideal Reader in order to take a useful bit of information away from a column.  But don’t worry.  I like to keep things simple and light-hearted from time to time too.  Just wait for next week’s WND column.  It’s as accessible and slashingly contemptuous of the Left as Miss Coulter’s most perjorative missives.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-04T13:04:00+00:00"
}