{
  "url": "https://voxday.net/2003/11/09/here-we-go-again-9/",
  "scraped_at": "2025-12-13T15:33:52.571283",
  "title": "Here we go again….",
  "date_display": "November 9, 2003",
  "date_iso": "2003-11-09T13:05:00+00:00",
  "date_from_url": "2003-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I touched on this in my column for next week.  But the raw breakdown is even more astounding than the overall numbers.  You’d think that only 62 years after the Final Solution was put into action, Germans and Austrians might be a little more circumspect about their <em>judenhassen.</em></p><p><em>A European Union poll of 7500 found that 59 percent deemed Israel “a threat to peace in the world” with figures rising to 60 percent in Britain, 65 in Germany, 69 in Austria and 74 in Holland.</em></p><p>I’m telling you, this War on Terror is no such thing.  It is rather the beginning of World War III, which is in the process of spreading to Europe – most likely in France or Holland – long before it comes to an end in the Middle East.  The sooner that our opinion elites begin to understand this, the sooner the West can go about winning it.  This is a continuation of the long Western struggle against the Saracen, and its difficulty is compounded by the fact that Europe no longer consists of fractious states with the common bond of Christian culture, but is divided into three.  The West now has the huge benefit of America, but America is divided into three as well.  At this point, only Christian America can be counted on to support the war once its true nature becomes apparent to everyone, while Neutral and Godless America will likely still hope to avoid taking sides.</p><p>Of course, they can’t.  If the jihadis are willing to kill Saudi Muslims they consider insufficiently enthusiastic about the cause, why would anyone think that an atheist American isn’t fair game for them, no matter how keen he is on understanding why they hate him?</p></div>",
  "content_text": "I touched on this in my column for next week.  But the raw breakdown is even more astounding than the overall numbers.  You’d think that only 62 years after the Final Solution was put into action, Germans and Austrians might be a little more circumspect about their\njudenhassen.\nA European Union poll of 7500 found that 59 percent deemed Israel “a threat to peace in the world” with figures rising to 60 percent in Britain, 65 in Germany, 69 in Austria and 74 in Holland.\nI’m telling you, this War on Terror is no such thing.  It is rather the beginning of World War III, which is in the process of spreading to Europe – most likely in France or Holland – long before it comes to an end in the Middle East.  The sooner that our opinion elites begin to understand this, the sooner the West can go about winning it.  This is a continuation of the long Western struggle against the Saracen, and its difficulty is compounded by the fact that Europe no longer consists of fractious states with the common bond of Christian culture, but is divided into three.  The West now has the huge benefit of America, but America is divided into three as well.  At this point, only Christian America can be counted on to support the war once its true nature becomes apparent to everyone, while Neutral and Godless America will likely still hope to avoid taking sides.\nOf course, they can’t.  If the jihadis are willing to kill Saudi Muslims they consider insufficiently enthusiastic about the cause, why would anyone think that an atheist American isn’t fair game for them, no matter how keen he is on understanding why they hate him?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-09T13:05:00+00:00"
}