{
  "url": "https://voxday.net/2003/11/21/i-am-dangerous-derbman/",
  "scraped_at": "2025-12-13T15:35:43.091738",
  "title": "I am dangerous… Derb…man",
  "date_display": "November 21, 2003",
  "date_iso": "2003-11-21T19:19:00+00:00",
  "date_from_url": "2003-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Derbyshire of National Review writes: <em>Jonah, Ramesh: Seems to me these libertarians e-mailing in saying “let’s get govt. out of the marriage business” might as well call themselves Anarchists. Their line seems to be: “We don’t need no steenkin government to tell us what marriage is. We got our churches to do that for us.” The logic here is:</em></p><p>—Marriage is a private thing between two people.<br> <br>—The govt has no business messing in our private lives.</br></br></p><p>Both are tenable, just about. Problem is, they throw 2,300 yrs of conservative thinking down the trash chute.  Come on. We are being invited to join a revolution here. And it’s not a conservative revolution.</p><p>I feel like Maverick in Top Gun.  The amusing thing is that I have been saying for years that I am not a conservative.  Finally, someone agrees!  I still laugh every time a left-liberal wets himself because of something I’ve written and accuses me of being an arch-conservative.  However, I’m a little disappointed with Derb’s rhetoric here.  I know he doesn’t actually believe that the government does nothing but manage society through its laws relating to marital status.  And anyone who argues that the church defines marriage is far more likely to be a Christian Libertarian than one of our secular brothers-in-intellectual-arms, if you want to know what to call someone of this persuasion.  Anarchist isn’t even a near miss.</p></div>",
  "content_text": "John Derbyshire of National Review writes:\nJonah, Ramesh: Seems to me these libertarians e-mailing in saying “let’s get govt. out of the marriage business” might as well call themselves Anarchists. Their line seems to be: “We don’t need no steenkin government to tell us what marriage is. We got our churches to do that for us.” The logic here is:\n—Marriage is a private thing between two people.\n—The govt has no business messing in our private lives.\nBoth are tenable, just about. Problem is, they throw 2,300 yrs of conservative thinking down the trash chute.  Come on. We are being invited to join a revolution here. And it’s not a conservative revolution.\nI feel like Maverick in Top Gun.  The amusing thing is that I have been saying for years that I am not a conservative.  Finally, someone agrees!  I still laugh every time a left-liberal wets himself because of something I’ve written and accuses me of being an arch-conservative.  However, I’m a little disappointed with Derb’s rhetoric here.  I know he doesn’t actually believe that the government does nothing but manage society through its laws relating to marital status.  And anyone who argues that the church defines marriage is far more likely to be a Christian Libertarian than one of our secular brothers-in-intellectual-arms, if you want to know what to call someone of this persuasion.  Anarchist isn’t even a near miss.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-21T19:19:00+00:00"
}