{
  "url": "https://voxday.net/2003/11/21/ill-admit-it-im-los/",
  "scraped_at": "2025-12-13T15:35:48.239609",
  "title": "I’ll admit it, I’m lost",
  "date_display": "November 21, 2003",
  "date_iso": "2003-11-21T22:21:00+00:00",
  "date_from_url": "2003-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was expecting a few emails that would be beyond my ability to digest or dispute, I just wasn’t expecting them from my side!  I mean, I can follow the concept-analogy point, but other than that, I have to confess that I’ve never even HEARD of what he’s talking about.  Now, I’m fully aware that there are worlds within worlds everywhere you look – I’ll never forget seeing horizons expand before me after asking our credit manager exactly what he did all day – but generally, I’ve read broadly enough in three languages to have something at least ring a bell most of the time.  This time – nada.</p><p>The Reverend C writes: <em>As a 150+ who is not a member of any IQ club, I am constantly reminded of the reason I am a Christian every time I read atheist slams. It never does cease to amaze that atheists seem never to have been exposed to religious thought above the Sunday-school level. Perhaps when confronted with an overly literalistic slam on anthropomorphism, you could inquire concerning said writer’s knowledge of: a) via negativa theology; b) the analogia entis. These currents have only been around since, oh, I don’t know, the 4th C. AD, but hey, who’s counting? Are they not aware that pressing back the conceptual boundaries _requires_ analogies to sense data, analogies which are then cleansed, as far as possible, from their sensual forebears?</em></p><p>Find any volume of von Balthasar’s great trilogy (the Glory of the Lord, Theo-drama, Theo-logic). There you will find upwards of twenty volumes detailing a fundamental theology based on the convertability of transcendentals (beauty, truth, goodness). Not to mention, some unbelievable patterns of and for scholarship. </p><p>Wasn’t Balthasar the bad guy on Battlestar Galactica?  Only twenty volumes… hmmm, if it’s all the same to you, I think I’ll stick with finishing my second immersion in the literary pleasure that is <em>Cryptonomicon</em>.  So, if any atheist would care to enlighten me with regards to the Black Road of Balthasar or the Parable of the Duck, I’d appreciate it.  And here I was content with being familiar with the ontological argument and mechanical avunculogratulation.</p></div>",
  "content_text": "I was expecting a few emails that would be beyond my ability to digest or dispute, I just wasn’t expecting them from my side!  I mean, I can follow the concept-analogy point, but other than that, I have to confess that I’ve never even HEARD of what he’s talking about.  Now, I’m fully aware that there are worlds within worlds everywhere you look – I’ll never forget seeing horizons expand before me after asking our credit manager exactly what he did all day – but generally, I’ve read broadly enough in three languages to have something at least ring a bell most of the time.  This time – nada.\nThe Reverend C writes:\nAs a 150+ who is not a member of any IQ club, I am constantly reminded of the reason I am a Christian every time I read atheist slams. It never does cease to amaze that atheists seem never to have been exposed to religious thought above the Sunday-school level. Perhaps when confronted with an overly literalistic slam on anthropomorphism, you could inquire concerning said writer’s knowledge of: a) via negativa theology; b) the analogia entis. These currents have only been around since, oh, I don’t know, the 4th C. AD, but hey, who’s counting? Are they not aware that pressing back the conceptual boundaries _requires_ analogies to sense data, analogies which are then cleansed, as far as possible, from their sensual forebears?\nFind any volume of von Balthasar’s great trilogy (the Glory of the Lord, Theo-drama, Theo-logic). There you will find upwards of twenty volumes detailing a fundamental theology based on the convertability of transcendentals (beauty, truth, goodness). Not to mention, some unbelievable patterns of and for scholarship.\nWasn’t Balthasar the bad guy on Battlestar Galactica?  Only twenty volumes… hmmm, if it’s all the same to you, I think I’ll stick with finishing my second immersion in the literary pleasure that is\nCryptonomicon\n.  So, if any atheist would care to enlighten me with regards to the Black Road of Balthasar or the Parable of the Duck, I’d appreciate it.  And here I was content with being familiar with the ontological argument and mechanical avunculogratulation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-21T22:21:00+00:00"
}