{
  "url": "https://voxday.net/2003/11/10/is-you-is-or-is-you-aint-my-nazi/",
  "scraped_at": "2025-12-13T15:34:02.439767",
  "title": "Is you is or is you ain’t my Nazi?",
  "date_display": "November 10, 2003",
  "date_iso": "2003-11-10T16:14:00+00:00",
  "date_from_url": "2003-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Abortion is not only widely deployed against children with Down Syndrome. It is expected, and praised. Jocelyn Elders, just prior to being named Bill Clinton’s surgeon general, famously proclaimed that abortion “has had an important and positive public-health effect” because it reduced “the number of children afflicted with severe defects.” She pointed out that “the number of Down Syndrome infants in Washington state in 1976 was 64 percent lower than it would have been without legal abortion.”</p><p><a href=\"http://www.nationalreview.com/shiflett/shiflett200311100904.asp\">Dave Shiflett</a> may not have a clue about the political spectrum – no one on the political right supports eugenics – but he can see the winds of so-called progress blowing towards increased state-sanctioned murder in this country too.  Do you?  Perhaps we should just kill the lame and the crippled people too, not to mention the fat and ugly – they’re such a blight on society.</p></div>",
  "content_text": "Abortion is not only widely deployed against children with Down Syndrome. It is expected, and praised. Jocelyn Elders, just prior to being named Bill Clinton’s surgeon general, famously proclaimed that abortion “has had an important and positive public-health effect” because it reduced “the number of children afflicted with severe defects.” She pointed out that “the number of Down Syndrome infants in Washington state in 1976 was 64 percent lower than it would have been without legal abortion.”\nDave Shiflett\nmay not have a clue about the political spectrum – no one on the political right supports eugenics – but he can see the winds of so-called progress blowing towards increased state-sanctioned murder in this country too.  Do you?  Perhaps we should just kill the lame and the crippled people too, not to mention the fat and ugly – they’re such a blight on society.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-10T16:14:00+00:00"
}