{
  "url": "https://voxday.net/2003/11/10/is-you-is-or-is-you-aint-my-nazi-ii/",
  "scraped_at": "2025-12-13T15:34:04.337206",
  "title": "Is you is or is you ain’t my Nazi? – II",
  "date_display": "November 10, 2003",
  "date_iso": "2003-11-10T16:22:00+00:00",
  "date_from_url": "2003-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CD writes: <em>“If you would pause just long enough to pull your head out of Israel’s ass you’ll see that Israel, by way of it’s policy of grabbing land the belongs to the Palestinian people, is responsible for the state of the world today.”</em></p><p>So THAT’S why Rwanda is such a murderous mess.  Not to mention the Sudan, North Korea, Indonesia, Tibet, Chechnya, Bosnia and Zimbabwe etc.  It’s all because of a little sliver of land to which a thrice-conquered people have not given up claim.  By this cretinous reckoning, German suicide bombers should be blowing themselves up in Danzig – that is to say, Gdansk.</p><p>Idiots.  Of course, his first question was: are you Jewish?  No, I’m not.  You don’t have to be Jewish to see that there is far more evil in the world than one tiny ethnic minority can possibly be responsible for.  And the fruits of <em>judenhassen</em> aren’t exactly in line with the fruits of the Spirit.</p></div>",
  "content_text": "CD writes:\n“If you would pause just long enough to pull your head out of Israel’s ass you’ll see that Israel, by way of it’s policy of grabbing land the belongs to the Palestinian people, is responsible for the state of the world today.”\nSo THAT’S why Rwanda is such a murderous mess.  Not to mention the Sudan, North Korea, Indonesia, Tibet, Chechnya, Bosnia and Zimbabwe etc.  It’s all because of a little sliver of land to which a thrice-conquered people have not given up claim.  By this cretinous reckoning, German suicide bombers should be blowing themselves up in Danzig – that is to say, Gdansk.\nIdiots.  Of course, his first question was: are you Jewish?  No, I’m not.  You don’t have to be Jewish to see that there is far more evil in the world than one tiny ethnic minority can possibly be responsible for.  And the fruits of\njudenhassen\naren’t exactly in line with the fruits of the Spirit.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-10T16:22:00+00:00"
}