{
  "url": "https://voxday.net/2003/11/13/it-started-long-before-tha/",
  "scraped_at": "2025-12-13T15:34:26.350704",
  "title": "It started long before that",
  "date_display": "November 13, 2003",
  "date_iso": "2003-11-13T13:11:00+00:00",
  "date_from_url": "2003-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Marine DH writes: <em>“Being a former Marine from the “Old Corps” (before kevlar, humvees, and “sensitivity training”), I concur with your contentions completely.  It is sad that we are allowing hollywood to cultivate society in believing that any woman can beat any man.  The “Women in Combat” issue has always been one of my pet peeves, and will continue to be until this nation wakes up and recognizes the error of its ways.  I’m sure you have witnessed the plethora of info on the issue (both pro and con).  There may be one absolutely stellar piece on this subject that you may or may not be aware of. I came across… this essay titled <a href=\"http://www.scholia.net/pdf%20files/WomenCombat1.PDF\">Women in Combat: Exploring the Issues</a> by Rev. Leroy Vogel, Chaplain, US Navy (Retired).  Being a marine, I felt an immediate affinity because marine chaplains are US Navy.  This piece is an absolute gem.  Probably the best essay on the current issue that I have come across so far.</em></p><p>What I find even more fascinating with Fr. Keefe’s dialogs, is his introduction of John Stuart Mill.  Probably one of the original earlier feminists of the mid 19th century. (a man no less)  What you begin to realize here is the direct connection of the issue of “women in combat” to pure (neo)liberalism.  “Women in combat” is simply the epitome of the entire egalitarian movement.  This really illustrates the entire elitists mind-set, and their convoluted understanding of liberty.  That is, for them, liberty is for the “elite”; and slavery is for the common man to be so grateful to them to be led to the “way”.  Now you begin to understand why elitists in power when they pass laws for “the governed”, but exempt themselves from these same laws.”</p><p>Good points throughout, to be sure, with only one minor omission  The concepts of women in combat and an elite beyond the laws guiding society were developed long before John Stuart Mill was pushing the idea.  You’ll find both notions articulated explicitely in Plato’s Republic, and I’ll even be touching briefly on the latter point in next week’s column on atheism.</p><p>Email from my Marine readers is always in-depth, thoughtful and articulate.  Doesn’t surprise me in the least.</p></div>",
  "content_text": "Marine DH writes:\n“Being a former Marine from the “Old Corps” (before kevlar, humvees, and “sensitivity training”), I concur with your contentions completely.  It is sad that we are allowing hollywood to cultivate society in believing that any woman can beat any man.  The “Women in Combat” issue has always been one of my pet peeves, and will continue to be until this nation wakes up and recognizes the error of its ways.  I’m sure you have witnessed the plethora of info on the issue (both pro and con).  There may be one absolutely stellar piece on this subject that you may or may not be aware of. I came across… this essay titled\nWomen in Combat: Exploring the Issues\nby Rev. Leroy Vogel, Chaplain, US Navy (Retired).  Being a marine, I felt an immediate affinity because marine chaplains are US Navy.  This piece is an absolute gem.  Probably the best essay on the current issue that I have come across so far.\nWhat I find even more fascinating with Fr. Keefe’s dialogs, is his introduction of John Stuart Mill.  Probably one of the original earlier feminists of the mid 19th century. (a man no less)  What you begin to realize here is the direct connection of the issue of “women in combat” to pure (neo)liberalism.  “Women in combat” is simply the epitome of the entire egalitarian movement.  This really illustrates the entire elitists mind-set, and their convoluted understanding of liberty.  That is, for them, liberty is for the “elite”; and slavery is for the common man to be so grateful to them to be led to the “way”.  Now you begin to understand why elitists in power when they pass laws for “the governed”, but exempt themselves from these same laws.”\nGood points throughout, to be sure, with only one minor omission  The concepts of women in combat and an elite beyond the laws guiding society were developed long before John Stuart Mill was pushing the idea.  You’ll find both notions articulated explicitely in Plato’s Republic, and I’ll even be touching briefly on the latter point in next week’s column on atheism.\nEmail from my Marine readers is always in-depth, thoughtful and articulate.  Doesn’t surprise me in the least.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-13T13:11:00+00:00"
}