{
  "url": "https://voxday.net/2003/11/04/it-sells-they-say/",
  "scraped_at": "2025-12-13T15:33:17.902007",
  "title": "It sells, they say",
  "date_display": "November 4, 2003",
  "date_iso": "2003-11-04T21:17:00+00:00",
  "date_from_url": "2003-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reader ME writes: <em>“I just wanted to let you know that I thoroughly enjoy your columns, and your blogs.  I clicked on your <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35278\">Shadows, Sex and Sorrow</a> column cause it had the word “sex” in it, and I was thoroughly impressed.  I don’t come across too many columns on Christian philosophy.  I checked out all your other stuff and was almost as impressed.  I will definitely be following your stuff from now on.”</em></p><p>I’m a little unsure of what to make of this.  I mean, I’m delighted he enjoys the column et al and plans to follow it, of course, but there’s just something disarmingly humorous about how he explains his discovery of the column.  So, in the interest of pursuing maximum readership, I’ve decided that henceforth, the titles of all columns will contain either a double-entendre, a direct sexual reference, or spell out something titillating in Bible Code patterns.</p><p>I think I just heard my UPS editor’s heart skip a beat.  You know I’m kidding, right?</p></div>",
  "content_text": "Reader ME writes:\n“I just wanted to let you know that I thoroughly enjoy your columns, and your blogs.  I clicked on your\nShadows, Sex and Sorrow\ncolumn cause it had the word “sex” in it, and I was thoroughly impressed.  I don’t come across too many columns on Christian philosophy.  I checked out all your other stuff and was almost as impressed.  I will definitely be following your stuff from now on.”\nI’m a little unsure of what to make of this.  I mean, I’m delighted he enjoys the column et al and plans to follow it, of course, but there’s just something disarmingly humorous about how he explains his discovery of the column.  So, in the interest of pursuing maximum readership, I’ve decided that henceforth, the titles of all columns will contain either a double-entendre, a direct sexual reference, or spell out something titillating in Bible Code patterns.\nI think I just heard my UPS editor’s heart skip a beat.  You know I’m kidding, right?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-04T21:17:00+00:00"
}