{
  "url": "https://voxday.net/2003/11/26/killing-those-fucking-ragheads/",
  "scraped_at": "2025-12-13T15:36:22.520461",
  "title": "Killing those fucking ragheads",
  "date_display": "November 26, 2003",
  "date_iso": "2003-11-26T18:23:00+00:00",
  "date_from_url": "2003-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anti-Islamic <a href=\"http://www.utcollegerepublicans.org/\">hate speech</a>?  No, actually it is yet another example of the open-minded toleration practiced on campus these days.  After writing an <a href=\"http://dailybeacon.utk.edu/article.php/12707\">editorial</a> on the dearth of conservative speakers being brought in by the university-funded Issues Committee at the University of Tennessee, a conservative activist who happens to be a Sikh was slagged rather viciously by the Committtee members who thought their email was secure.</p><p>“like most of you, i spent much of my day drafting a letter to the editor in response to the piece. however, i probably spent more time thinking about what a little brat this guy is and what i would do to him given the chance–torture that would put the spanish inquisition to shame” said one devotee of tolerance.</p><p>Another tireless activist for world peace concurred, suggesting “”…if you see one of those ragheads, shoot him in the fucking face.”</p><p>Being somewhat technologically illiterate, these left-wing advocates of civil discourse were unaware that they were sending their emails to conservatives who did not share their desire to commit violence and torture on those whose opinions differed from their own.  Now, how many times do I need to tell everyone – download GPG or PGP and encrypt your bloody email!</p><p>I actually had a brief chat with the head of the Issues Committee.  She sounds like a very nice young woman, but she’s obviously just beginning to learn the rules of the game.   After telling me that some statements had been “misconstrued”, she mentioned that she’d need to talk to her advisor first.  Fair enough.  I’m looking forward to hearing how they should have been construed.  The Left does so love to twist the language; for a polyglot like myself, it’s always a pleasure to view the contortions.</p><p>UT Deans Brown and Thompson are a little more experienced.  Neither one is in the office today.  I’m so shocked!  At least they can give thanks for a timely Thanksgiving holiday.</p></div>",
  "content_text": "Anti-Islamic\nhate speech\n?  No, actually it is yet another example of the open-minded toleration practiced on campus these days.  After writing an\neditorial\non the dearth of conservative speakers being brought in by the university-funded Issues Committee at the University of Tennessee, a conservative activist who happens to be a Sikh was slagged rather viciously by the Committtee members who thought their email was secure.\n“like most of you, i spent much of my day drafting a letter to the editor in response to the piece. however, i probably spent more time thinking about what a little brat this guy is and what i would do to him given the chance–torture that would put the spanish inquisition to shame” said one devotee of tolerance.\nAnother tireless activist for world peace concurred, suggesting “”…if you see one of those ragheads, shoot him in the fucking face.”\nBeing somewhat technologically illiterate, these left-wing advocates of civil discourse were unaware that they were sending their emails to conservatives who did not share their desire to commit violence and torture on those whose opinions differed from their own.  Now, how many times do I need to tell everyone – download GPG or PGP and encrypt your bloody email!\nI actually had a brief chat with the head of the Issues Committee.  She sounds like a very nice young woman, but she’s obviously just beginning to learn the rules of the game.   After telling me that some statements had been “misconstrued”, she mentioned that she’d need to talk to her advisor first.  Fair enough.  I’m looking forward to hearing how they should have been construed.  The Left does so love to twist the language; for a polyglot like myself, it’s always a pleasure to view the contortions.\nUT Deans Brown and Thompson are a little more experienced.  Neither one is in the office today.  I’m so shocked!  At least they can give thanks for a timely Thanksgiving holiday.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-26T18:23:00+00:00"
}