{
  "url": "https://voxday.net/2003/11/17/left-is-right-for-once/",
  "scraped_at": "2025-12-13T15:34:59.863354",
  "title": "The Left is right… for once",
  "date_display": "November 17, 2003",
  "date_iso": "2003-11-17T08:56:00+00:00",
  "date_from_url": "2003-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t often agree with the leftist writers at WND, though I have enjoyed an occasional exchange of email with both Bill Press and Marilyn Lois Polak.  But Ellen Ratner has the Bush administration dead to rights in this column, in which <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=35641\">she points out </a>only a few of the administration’ inconsistencies.  I mean, she doesn’t even point out that last week, the president predictably began backing away from his previous commitment to allowing democracy in Iraq – something that only surprises those who don’t remember the last democratic vote in Algeria, which was cancelled by the military at the last minute.</p><p>You see, radical Islamic populations have this disturbing, but predictable tendency to elect radical Islamic politicians.  This is likely what will happen in Iraq the moment that a popular vote is permitted, which is why it makes no difference what the administration says, they simply can’t allow a vote without first putting into place a convoluted system designed to prevent the will of the people from prevailing.  This is, of course, only one of the reasons our Founding Fathers weren’t dumb enough to design this nation as a democracy, and why our sanctification of the idea is so astoundingly stupid.</p><p>Ellen also doesn’t point out that we’re not even at war, from a legal point of view.  Which renders all the administration’s arguments about “enemy combatants” completely moot.  I thought ignorance of the law is no excuse, Mr. Attorney General.</p></div>",
  "content_text": "I don’t often agree with the leftist writers at WND, though I have enjoyed an occasional exchange of email with both Bill Press and Marilyn Lois Polak.  But Ellen Ratner has the Bush administration dead to rights in this column, in which\nshe points out\nonly a few of the administration’ inconsistencies.  I mean, she doesn’t even point out that last week, the president predictably began backing away from his previous commitment to allowing democracy in Iraq – something that only surprises those who don’t remember the last democratic vote in Algeria, which was cancelled by the military at the last minute.\nYou see, radical Islamic populations have this disturbing, but predictable tendency to elect radical Islamic politicians.  This is likely what will happen in Iraq the moment that a popular vote is permitted, which is why it makes no difference what the administration says, they simply can’t allow a vote without first putting into place a convoluted system designed to prevent the will of the people from prevailing.  This is, of course, only one of the reasons our Founding Fathers weren’t dumb enough to design this nation as a democracy, and why our sanctification of the idea is so astoundingly stupid.\nEllen also doesn’t point out that we’re not even at war, from a legal point of view.  Which renders all the administration’s arguments about “enemy combatants” completely moot.  I thought ignorance of the law is no excuse, Mr. Attorney General.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-17T08:56:00+00:00"
}