{
  "url": "https://voxday.net/2003/11/02/linux-bunny/",
  "scraped_at": "2025-12-13T15:32:55.783796",
  "title": "Linux Bunny",
  "date_display": "November 2, 2003",
  "date_iso": "2003-11-02T13:33:00+00:00",
  "date_from_url": "2003-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And then I realized I loved her more than I ever had before….  Yes, she’s hot, she’s blonde and now <em>she’s down with the Penguin</em>.  I’m even a little envious of her setup, as her Windows partition is VFAT, not NTFS, so she has full write access to her old Windows files.  Come on, hackers, let’s get cracking on that NTFS format!  The mountain is not yet climbed!</p><p>Anyhow, installing Linux on her machine – more to the point, downloading 1.7 Gigs of CDs – has taken a bit of time and caused the relative dearth of bloggage lately.  And since everyone has different operating idiosyncracies, her use of web mail has necessitated my learning a bit about the so-called poppers, which allow POP and STMP access to the more popular web programs such as Hotmail and Yahoo! Mail.  There are a bunch of them, but <a href=\"http://hotwayd.sourceforge.net/\">Hotwayd</a> is proven to work with Evolution, so that’s the one I went with.  Report to follow soon.</p><p>For some reason, I just had a very strange flashback to that weird Apple commercial with Jeff Goldblum.  That was a humiliating experience for me, as I was absolutely sure the IMAC was going to bomb.  Who would want a computer that was crippled to the point of being little more than an email machine, but cost as much as a real computer?  Well, a lot of people who hadn’t used the Internet before, it turns out.</p><p>Since Linux now has no trouble handling all the email, surfing and word processing that consists of the vast majority of casual computer usage, it can only be a matter of time before someone creates a cheap Linux blackbox and sells a bunch of them.  They probably won’t come in tangerine, though.  So, Apple still has that going for it.</p></div>",
  "content_text": "And then I realized I loved her more than I ever had before….  Yes, she’s hot, she’s blonde and now\nshe’s down with the Penguin\n.  I’m even a little envious of her setup, as her Windows partition is VFAT, not NTFS, so she has full write access to her old Windows files.  Come on, hackers, let’s get cracking on that NTFS format!  The mountain is not yet climbed!\nAnyhow, installing Linux on her machine – more to the point, downloading 1.7 Gigs of CDs – has taken a bit of time and caused the relative dearth of bloggage lately.  And since everyone has different operating idiosyncracies, her use of web mail has necessitated my learning a bit about the so-called poppers, which allow POP and STMP access to the more popular web programs such as Hotmail and Yahoo! Mail.  There are a bunch of them, but\nHotwayd\nis proven to work with Evolution, so that’s the one I went with.  Report to follow soon.\nFor some reason, I just had a very strange flashback to that weird Apple commercial with Jeff Goldblum.  That was a humiliating experience for me, as I was absolutely sure the IMAC was going to bomb.  Who would want a computer that was crippled to the point of being little more than an email machine, but cost as much as a real computer?  Well, a lot of people who hadn’t used the Internet before, it turns out.\nSince Linux now has no trouble handling all the email, surfing and word processing that consists of the vast majority of casual computer usage, it can only be a matter of time before someone creates a cheap Linux blackbox and sells a bunch of them.  They probably won’t come in tangerine, though.  So, Apple still has that going for it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-02T13:33:00+00:00"
}