{
  "url": "https://voxday.net/2003/11/17/mailbox-they-never-learn/",
  "scraped_at": "2025-12-13T15:35:01.347705",
  "title": "Mailbox – they never learn",
  "date_display": "November 17, 2003",
  "date_iso": "2003-11-17T10:13:00+00:00",
  "date_from_url": "2003-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TW writes: <em>As an atheist, I found your column to be simplistic and illogical, rendering your title just a tad ironic. I’d label it, and therefore you,  hypocritical as well, but for the fact that one cannot be hypocritical if he has no understanding of what he’s done. Your comments are wholly unbecoming of one who employs Mensa status as a credential. If you need a one-liner description on the column, it’s: My God, that was profoundly ignorant.</em></p><p>Of course, TW doesn’t provide a single example of how the column is simplistic, illogical, hypocritical or ignorant.  Mostly because he can’t.  Nevertheless, we’re just expected to take his word for it, never mind that my argument is in synchronicity with the intellectual positions of two of history’s leading atheists.  I thought this bit was particularly amusing: “As an atheist…. My God….”  So TW, by just what god do you swear?  And why?  This is genuine irony, in contrast to TW’s understanding of the concept, which rivals that of Miss Alanis Morrissette.</p><p>I’ve pointed this out before to my would-be critics, apparently to little avail:  Don’t bring it unless you can back it up.  TW sounds exactly like many a clueless feminist – substitute woman for atheist and sexist for hypocritical and it would be identical to emails I’ve received in the past.  And profoundly ignorant?  Yes, because the op/ed bar has been set so high that people are bored with Maureen Dowd’s constant expositions on Plato, the Encyclopedists and quantum mechanics.  This is nothing but defensive name-calling without substance.  Color me underwhelmed.</p></div>",
  "content_text": "TW writes:\nAs an atheist, I found your column to be simplistic and illogical, rendering your title just a tad ironic. I’d label it, and therefore you,  hypocritical as well, but for the fact that one cannot be hypocritical if he has no understanding of what he’s done. Your comments are wholly unbecoming of one who employs Mensa status as a credential. If you need a one-liner description on the column, it’s: My God, that was profoundly ignorant.\nOf course, TW doesn’t provide a single example of how the column is simplistic, illogical, hypocritical or ignorant.  Mostly because he can’t.  Nevertheless, we’re just expected to take his word for it, never mind that my argument is in synchronicity with the intellectual positions of two of history’s leading atheists.  I thought this bit was particularly amusing: “As an atheist…. My God….”  So TW, by just what god do you swear?  And why?  This is genuine irony, in contrast to TW’s understanding of the concept, which rivals that of Miss Alanis Morrissette.\nI’ve pointed this out before to my would-be critics, apparently to little avail:  Don’t bring it unless you can back it up.  TW sounds exactly like many a clueless feminist – substitute woman for atheist and sexist for hypocritical and it would be identical to emails I’ve received in the past.  And profoundly ignorant?  Yes, because the op/ed bar has been set so high that people are bored with Maureen Dowd’s constant expositions on Plato, the Encyclopedists and quantum mechanics.  This is nothing but defensive name-calling without substance.  Color me underwhelmed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-17T10:13:00+00:00"
}