{
  "url": "https://voxday.net/2003/11/25/mailbox-violins-wai/",
  "scraped_at": "2025-12-13T15:36:06.296331",
  "title": "Mailbox – the violins wail",
  "date_display": "November 25, 2003",
  "date_iso": "2003-11-25T10:22:00+00:00",
  "date_from_url": "2003-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JH writes through the tears: <em>Even though I proudly identify myself as a liberal, I absorb as much right wing media as I can and reading your column is always good for a laugh. I notice that your bio refers to you as a “Christian libertarian”. Can you please tell me where in any Christian doctrine it says that its acceptable to call names like “Lizard Queen”, “snob”, “cold-blooded”, or (and this is my favorite) referring to someone as being “in the direct matrilineal line of Lilith, daughter of Asmodael, Hell Baron of the Seventh Circle”. I attended years of Catholic school and every time I called names like that I was told to go to confession. I know that for those of you on the right its all right to think this way about Hillary Clinton because she’s the epitome of evil, but I forgot liberals think the right is evil and the right just thinks that liberals are mistaken.  Congratulations on raising the state of debate in America.</em></p><p>Since JH is confused, let me explain that my column on WorldNetDaily is an op/ed column, wherein one is expected to engage in op/ed rhetoric. Everyone knows what rhetoric is, I hope?  Although I generally prefer <em>logos</em>, using <em>pathos</em> occasionally is fun and a nice change of pace.  The state-of-debate point cracked me up, since editors at some of America’s largest newspapers have complained that they can’t follow my references or the complex sentence structure that I favor and asked if I would please – ahem- make it more accessible.  I suppose JH is only reading my column since he’s bored with Maureen Dowd’s constant delving into Plato, Goethe,Calvino, Nietszche, Open Text, Open Source, and, of course, the Conscript Fathers.</p><p>Perhaps I should imitate Paul Krugman and just make things up on the fly:</p><p>PK: President Bush’s budget will cause ten million jobs to be lost next year!<br> <br>Krugman Truth Squad:  Um, Paul, the budget covers the next decade.  So, even if you’re right, which you aren’t, that’s one million.  As in, ten divided by ten?<br> <br>PK: (freezes for a long, uncomfortable moment like a deer caught in the headlights before trying to bluff it out)  How dare you question my math, fool!  Don’t you know I am a professor of economics?  At Princeton!<br> <br>KTS: So, is this Quantum Economics or something?<br> <br>PK:   You hateful bigots, you are stalking me!  (bursts into tears)</br></br></br></br></br></br></br></br></p><p>When did I ever write that liberals are mistaken?  Sure, they’re mistaken about what they call themselves, as they are anti-liberal.  BTW, I never even write liberal, I only use left-liberal as a partial concession to the perverted parlance of American politics.  I do think left-liberals are mistaken with regards to their fundamental assumptions, which I think tends to reveal their functional – and quite frequently, actual in the IQ sense – stupidity.  I also believe that their ultimate goals of egalitarianism and one-world government are deeply and profoundly evil.  I do not, however, believe that JH is very familiar with my column.  He’s clearly conflating me with other writers of the Right, although he does appear to know enough to avoid referring to me as a conservative.</p><p>It amuses me how America’s left-liberals believe they can run around calling everyone stupid,hate-filled bigots, then yowl like wounded kittens every time someone writes something insufficiently adoring about the object of their idol worship.  Don’t bring it if you can’t take it, Penelope.  And stop blubbering, Paul!</p></div>",
  "content_text": "JH writes through the tears:\nEven though I proudly identify myself as a liberal, I absorb as much right wing media as I can and reading your column is always good for a laugh. I notice that your bio refers to you as a “Christian libertarian”. Can you please tell me where in any Christian doctrine it says that its acceptable to call names like “Lizard Queen”, “snob”, “cold-blooded”, or (and this is my favorite) referring to someone as being “in the direct matrilineal line of Lilith, daughter of Asmodael, Hell Baron of the Seventh Circle”. I attended years of Catholic school and every time I called names like that I was told to go to confession. I know that for those of you on the right its all right to think this way about Hillary Clinton because she’s the epitome of evil, but I forgot liberals think the right is evil and the right just thinks that liberals are mistaken.  Congratulations on raising the state of debate in America.\nSince JH is confused, let me explain that my column on WorldNetDaily is an op/ed column, wherein one is expected to engage in op/ed rhetoric. Everyone knows what rhetoric is, I hope?  Although I generally prefer\nlogos\n, using\npathos\noccasionally is fun and a nice change of pace.  The state-of-debate point cracked me up, since editors at some of America’s largest newspapers have complained that they can’t follow my references or the complex sentence structure that I favor and asked if I would please – ahem- make it more accessible.  I suppose JH is only reading my column since he’s bored with Maureen Dowd’s constant delving into Plato, Goethe,Calvino, Nietszche, Open Text, Open Source, and, of course, the Conscript Fathers.\nPerhaps I should imitate Paul Krugman and just make things up on the fly:\nPK: President Bush’s budget will cause ten million jobs to be lost next year!\nKrugman Truth Squad:  Um, Paul, the budget covers the next decade.  So, even if you’re right, which you aren’t, that’s one million.  As in, ten divided by ten?\nPK: (freezes for a long, uncomfortable moment like a deer caught in the headlights before trying to bluff it out)  How dare you question my math, fool!  Don’t you know I am a professor of economics?  At Princeton!\nKTS: So, is this Quantum Economics or something?\nPK:   You hateful bigots, you are stalking me!  (bursts into tears)\nWhen did I ever write that liberals are mistaken?  Sure, they’re mistaken about what they call themselves, as they are anti-liberal.  BTW, I never even write liberal, I only use left-liberal as a partial concession to the perverted parlance of American politics.  I do think left-liberals are mistaken with regards to their fundamental assumptions, which I think tends to reveal their functional – and quite frequently, actual in the IQ sense – stupidity.  I also believe that their ultimate goals of egalitarianism and one-world government are deeply and profoundly evil.  I do not, however, believe that JH is very familiar with my column.  He’s clearly conflating me with other writers of the Right, although he does appear to know enough to avoid referring to me as a conservative.\nIt amuses me how America’s left-liberals believe they can run around calling everyone stupid,hate-filled bigots, then yowl like wounded kittens every time someone writes something insufficiently adoring about the object of their idol worship.  Don’t bring it if you can’t take it, Penelope.  And stop blubbering, Paul!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-25T10:22:00+00:00"
}