{
  "url": "https://voxday.net/2003/11/05/martyred-fraud/",
  "scraped_at": "2025-12-13T15:33:25.401499",
  "title": "The martyred fraud",
  "date_display": "November 5, 2003",
  "date_iso": "2003-11-05T17:59:00+00:00",
  "date_from_url": "2003-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always suspected Yitzhak Rabin was more show than substance – after all, what kind of master strategist would have conceived, much less championed, the Oslo Accords, as they were a suicidal loser’s gamble from the very start.  Ben Shapiro does an excellent job of <a href=\"http://www.townhall.com/columnists/benshapiro/bs20031105.shtml\">exploding the myth</a>, which, as he points out, must be done if Israel is ever going to face up to the need to defend herself.</p><p>And yet the Israli peace camp is still calling for Oslo II.  The self-destructive naivete that appears to be the curse of the Jewish people can be summed up in just one example.  Whereas Americans put up fences to secure backyard swimming pools, Israelis are still debating over whether to put one up in order to keep out snipers and suicide bombers.</p></div>",
  "content_text": "I always suspected Yitzhak Rabin was more show than substance – after all, what kind of master strategist would have conceived, much less championed, the Oslo Accords, as they were a suicidal loser’s gamble from the very start.  Ben Shapiro does an excellent job of\nexploding the myth\n, which, as he points out, must be done if Israel is ever going to face up to the need to defend herself.\nAnd yet the Israli peace camp is still calling for Oslo II.  The self-destructive naivete that appears to be the curse of the Jewish people can be summed up in just one example.  Whereas Americans put up fences to secure backyard swimming pools, Israelis are still debating over whether to put one up in order to keep out snipers and suicide bombers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-05T17:59:00+00:00"
}