{
  "url": "https://voxday.net/2003/11/10/nazi-reviva/",
  "scraped_at": "2025-12-13T15:33:56.943671",
  "title": "Nazi revival",
  "date_display": "November 10, 2003",
  "date_iso": "2003-11-10T08:47:00+00:00",
  "date_from_url": "2003-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some readers are wondering about my continual hammering on the kinship between the historical National Socialists and their modern descendants – in America, the current Democratic party, in Europe, the European Union.  The truth is that Democrats and Eurocrats, while in general ideological agreement with the Nazis, are actually almost identical to the Italian Fascist party, which was the original Third Way.</p><p>It’s interesting to see that those who are obsessed with the non-existent threat posed by a few whacked-out losers waving swastikas should be so blind to the development of the EU’s Fourth Reich, which represents the most recent attempt to reunite the Frankish empire of Charlegmagne.  Or, if you prefer, Karl der Grosse, which is how his German-speaking heirs refer to him.  Lest anyone take seriously the eurofascists’ attitude towards democracy, note that the political whores who are attempting to usher in the New European Order are doing their best to ensure that the people of France and Britain <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2003/11/09/neuro09.xml&amp;sSheet=/news/2003/11/09/ixnewstop.html\">will not be permitted to protest</a> their subjugation to their new masters.</p><p><em>“France narrowly won the referendum on the Maastricht Treaty and there are suggestions that it could lose a plebiscite on the European constitution. Ministers are also concerned that pressure for a referendum in Britain would escalate sharply if such a close neighbour as France opted for one.”</em></p><p>What good is a constitution, after all, if the people are allowed a voice?  And why should they be permitted to be heard anyhow, since as the world has been repeatedly assured for years, the EU isn’t a political entity, it’s just an organization to facilitate trade and economic development – oh, wait, they lied about that too, didn’t they.</p></div>",
  "content_text": "Some readers are wondering about my continual hammering on the kinship between the historical National Socialists and their modern descendants – in America, the current Democratic party, in Europe, the European Union.  The truth is that Democrats and Eurocrats, while in general ideological agreement with the Nazis, are actually almost identical to the Italian Fascist party, which was the original Third Way.\nIt’s interesting to see that those who are obsessed with the non-existent threat posed by a few whacked-out losers waving swastikas should be so blind to the development of the EU’s Fourth Reich, which represents the most recent attempt to reunite the Frankish empire of Charlegmagne.  Or, if you prefer, Karl der Grosse, which is how his German-speaking heirs refer to him.  Lest anyone take seriously the eurofascists’ attitude towards democracy, note that the political whores who are attempting to usher in the New European Order are doing their best to ensure that the people of France and Britain\nwill not be permitted to protest\ntheir subjugation to their new masters.\n“France narrowly won the referendum on the Maastricht Treaty and there are suggestions that it could lose a plebiscite on the European constitution. Ministers are also concerned that pressure for a referendum in Britain would escalate sharply if such a close neighbour as France opted for one.”\nWhat good is a constitution, after all, if the people are allowed a voice?  And why should they be permitted to be heard anyhow, since as the world has been repeatedly assured for years, the EU isn’t a political entity, it’s just an organization to facilitate trade and economic development – oh, wait, they lied about that too, didn’t they.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-10T08:47:00+00:00"
}