{
  "url": "https://voxday.net/2003/11/14/paradox-of-knowing-everything/",
  "scraped_at": "2025-12-13T15:34:36.676553",
  "title": "The paradox of knowing everything",
  "date_display": "November 14, 2003",
  "date_iso": "2003-11-14T09:44:00+00:00",
  "date_from_url": "2003-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reader TD writes: <em>I am incredibly curious as to how you resolve the paradox of free will and absolute omniscience.  If the Judeo-Christian God construct is absolutely omniscient and has temporal insight into said omniscience, how does free will actually function?  This is, of course, the paradox of Calvinism.</em></p><p>I see two obvious flaws with this apparent paradox.  First, omniscience does not imply omniactience. (probably incorrect – I want the word for all-acting).  A being who is all-knowing and all-powerful still has the ability to choose not to act, or even, so to speak, not to look.  Let me give an example.  I designed a computer game with a friend which was never released, but possessed a sophisticated AI-system which is still more advanced than any game available today.  As the programmer, my friend had complete control over, and complete knowledge of, each of the AI-controlled characters.  His powers in that computer world were god-like, as at any moment, he could see precisely what was going through the character’s head and know not only what it was doing, but why it was doing what it was doing.</p><p>Nevertheless, most of the time, my friend chose not to look or to control.  Instead, he sat back and watched what resulted from the interactions of his characters.  He was certainly capable of working out all the probabilities beforehand, but he seldom did.  I am not saying that I am sure God really opts to act in this manner, only that it is dangerous and borderline blasphemous to say that He cannot.  Given the evil state of the fallen world, I would submit that this point of view is consistent with both the Scriptures and what we perceive as the world’s reality.  To know is not to dictate, and by the same token, to be able to know is not to make the decision to know.</p><p>Second, I increasingly suspect that God is trans-temporal.  I theorize he stands outside of time as well as our physical space, seeing both as a sort of small, self-contained structure.  This may account for the strange “I am” terminology used by both the burning bush of Moses as well as by Jesus Christ himself.  This would necessarily require some implications which are generally not taken into account by either side of the Calvinist question.</p><p>I am no theologian, and I don’t know the great theological thinkers anywhere nearly as well as I know the economists, philosophers and historians of yore.  My lack of interest in this regard is mostly because Jesus and Paul both tell us that not only do we not understand God, but that we are not even capable of understanding God.  I am content to put my trust in Jesus Christ, with the hope that one day, he will not only shield me from the righteous judgment of God with his grace, but also explain it all to me.</p></div>",
  "content_text": "Reader TD writes:\nI am incredibly curious as to how you resolve the paradox of free will and absolute omniscience.  If the Judeo-Christian God construct is absolutely omniscient and has temporal insight into said omniscience, how does free will actually function?  This is, of course, the paradox of Calvinism.\nI see two obvious flaws with this apparent paradox.  First, omniscience does not imply omniactience. (probably incorrect – I want the word for all-acting).  A being who is all-knowing and all-powerful still has the ability to choose not to act, or even, so to speak, not to look.  Let me give an example.  I designed a computer game with a friend which was never released, but possessed a sophisticated AI-system which is still more advanced than any game available today.  As the programmer, my friend had complete control over, and complete knowledge of, each of the AI-controlled characters.  His powers in that computer world were god-like, as at any moment, he could see precisely what was going through the character’s head and know not only what it was doing, but why it was doing what it was doing.\nNevertheless, most of the time, my friend chose not to look or to control.  Instead, he sat back and watched what resulted from the interactions of his characters.  He was certainly capable of working out all the probabilities beforehand, but he seldom did.  I am not saying that I am sure God really opts to act in this manner, only that it is dangerous and borderline blasphemous to say that He cannot.  Given the evil state of the fallen world, I would submit that this point of view is consistent with both the Scriptures and what we perceive as the world’s reality.  To know is not to dictate, and by the same token, to be able to know is not to make the decision to know.\nSecond, I increasingly suspect that God is trans-temporal.  I theorize he stands outside of time as well as our physical space, seeing both as a sort of small, self-contained structure.  This may account for the strange “I am” terminology used by both the burning bush of Moses as well as by Jesus Christ himself.  This would necessarily require some implications which are generally not taken into account by either side of the Calvinist question.\nI am no theologian, and I don’t know the great theological thinkers anywhere nearly as well as I know the economists, philosophers and historians of yore.  My lack of interest in this regard is mostly because Jesus and Paul both tell us that not only do we not understand God, but that we are not even capable of understanding God.  I am content to put my trust in Jesus Christ, with the hope that one day, he will not only shield me from the righteous judgment of God with his grace, but also explain it all to me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-14T09:44:00+00:00"
}