{
  "url": "https://voxday.net/2003/11/17/poisoning-sou/",
  "scraped_at": "2025-12-13T15:34:58.045551",
  "title": "Poisoning the soul",
  "date_display": "November 17, 2003",
  "date_iso": "2003-11-17T08:41:00+00:00",
  "date_from_url": "2003-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do you ever get the impression that a young baby is more aware of what is going on than you think it should be?  One of the pastors I respect most theorizes that the spirit is mature at birth, and is capable of being influenced by things that can’t possibly be grasped by its developing mind.  That makes this report of <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=35633\">a baby toy that says “I hate you”</a> even more chilling.  There’s no way of knowing, of course, but I suspect that the evil logic behind whoever hid this message behind the soothing melodies is more spiritual than political.</p><p><a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=35640\">My column today</a> notwithstanding, there is much evil that is done by those who are not atheists.  The worst evildoers are those who have a glimmering of understanding of how the spiritual world operates, and attempt to use that knowledge against others.  To use it against defenseless infants is truly despicable.</p><p>To understand infinity, one need only contemplate the limits of human perversity.</p></div>",
  "content_text": "Do you ever get the impression that a young baby is more aware of what is going on than you think it should be?  One of the pastors I respect most theorizes that the spirit is mature at birth, and is capable of being influenced by things that can’t possibly be grasped by its developing mind.  That makes this report of\na baby toy that says “I hate you”\neven more chilling.  There’s no way of knowing, of course, but I suspect that the evil logic behind whoever hid this message behind the soothing melodies is more spiritual than political.\nMy column today\nnotwithstanding, there is much evil that is done by those who are not atheists.  The worst evildoers are those who have a glimmering of understanding of how the spiritual world operates, and attempt to use that knowledge against others.  To use it against defenseless infants is truly despicable.\nTo understand infinity, one need only contemplate the limits of human perversity.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-17T08:41:00+00:00"
}