{
  "url": "https://voxday.net/2003/11/27/red-sea/",
  "scraped_at": "2025-12-13T15:36:24.492572",
  "title": "The Red Sea",
  "date_display": "November 27, 2003",
  "date_iso": "2003-11-27T13:44:00+00:00",
  "date_from_url": "2003-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Mogambo Guru: <em>“I think that I am getting the hang of using a calculator and would like to, you know, show off a little bit, so I had an interesting session with a calculator. But for some strange reason, whenever I multiplied $38 billion a week times 52 weeks in a year, I got a wrong answer. Guess what I got? I know you are going to laugh when you see it, and remember that the calculator was obviously broken, as I kept getting the answer $1.976 trillion! Seeing a number that huge is like getting hit with a sledgehammer to the skull, as you realize that no sane person would voluntarily plunge his own country farther into debt at that rate – and I am talking about amassing debt to the tune of 20% of GDP here!”</em></p><p>$38 billion in new Treasury debt this week.  Which is basically $2 trillion a year.  Keep in mind that the annual US economy is <em>only</em> $10.4 trillion.  That’s where the 8.2 percent <em>growth</em> is coming from – growth by debt.  This can only be paid off by inflation, so you would be wise to buckle your seatbelts.</p><p>Mogambo, you’ve got one vote for President.  Mine.</p></div>",
  "content_text": "From the Mogambo Guru:\n“I think that I am getting the hang of using a calculator and would like to, you know, show off a little bit, so I had an interesting session with a calculator. But for some strange reason, whenever I multiplied $38 billion a week times 52 weeks in a year, I got a wrong answer. Guess what I got? I know you are going to laugh when you see it, and remember that the calculator was obviously broken, as I kept getting the answer $1.976 trillion! Seeing a number that huge is like getting hit with a sledgehammer to the skull, as you realize that no sane person would voluntarily plunge his own country farther into debt at that rate – and I am talking about amassing debt to the tune of 20% of GDP here!”\n$38 billion in new Treasury debt this week.  Which is basically $2 trillion a year.  Keep in mind that the annual US economy is\nonly\n$10.4 trillion.  That’s where the 8.2 percent\ngrowth\nis coming from – growth by debt.  This can only be paid off by inflation, so you would be wise to buckle your seatbelts.\nMogambo, you’ve got one vote for President.  Mine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-27T13:44:00+00:00"
}