{
  "url": "https://voxday.net/2003/11/21/reloaded/",
  "scraped_at": "2025-12-13T15:35:41.267808",
  "title": "Reloaded",
  "date_display": "November 21, 2003",
  "date_iso": "2003-11-21T17:58:00+00:00",
  "date_from_url": "2003-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After some gentle persuasion, I finally watched <em>Matrix Reloaded</em> this week.  I’d avoided doing so primarily because I liked the first movie so much that I knew the sequel couldn’t possibly live up to it.  I was pleased to find that it was a pretty good movie after all, although I am informed that the fact that an interruption caused me to miss a good portion of the scenes set in Zion may have enhanced my enjoyment.  I particularly liked the Merovingian, although the fact that I know of the Merovingian kings as well as their mythic connection with the cadet line of Jesus Christ – alternatively, with the sea-goat Makaru – left me with the impression that the writers a) are doing something very thematically complex that I can’t follow; or b) have found themselves in a little over their heads and are throwing in everything but the kitchen sink to disguise this.</p><p>I think (b) is more likely, but I’m open to the notion that I’m wrong.  Neo is a strange sort of Christ figure – if you can’t pick that up by now, you are in serious denial – as he doesn’t seem to follow any destiny so much as direct orders from pretty much everyone he encounters.  This strikes me as suboptimal thriller writing, but the effects and the overall setting for the story are intriguing enough that it held my interest throughout.  Still, it will probably be another two years before I bother seeing the third.</p><p>I will, of course, be at <em>Return of the King</em> on opening night.</p></div>",
  "content_text": "After some gentle persuasion, I finally watched\nMatrix Reloaded\nthis week.  I’d avoided doing so primarily because I liked the first movie so much that I knew the sequel couldn’t possibly live up to it.  I was pleased to find that it was a pretty good movie after all, although I am informed that the fact that an interruption caused me to miss a good portion of the scenes set in Zion may have enhanced my enjoyment.  I particularly liked the Merovingian, although the fact that I know of the Merovingian kings as well as their mythic connection with the cadet line of Jesus Christ – alternatively, with the sea-goat Makaru – left me with the impression that the writers a) are doing something very thematically complex that I can’t follow; or b) have found themselves in a little over their heads and are throwing in everything but the kitchen sink to disguise this.\nI think (b) is more likely, but I’m open to the notion that I’m wrong.  Neo is a strange sort of Christ figure – if you can’t pick that up by now, you are in serious denial – as he doesn’t seem to follow any destiny so much as direct orders from pretty much everyone he encounters.  This strikes me as suboptimal thriller writing, but the effects and the overall setting for the story are intriguing enough that it held my interest throughout.  Still, it will probably be another two years before I bother seeing the third.\nI will, of course, be at\nReturn of the King\non opening night.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-21T17:58:00+00:00"
}