{
  "url": "https://voxday.net/2003/11/08/seriously-infected-with-stupidity/",
  "scraped_at": "2025-12-13T15:33:47.730677",
  "title": "Seriously infected with stupidity",
  "date_display": "November 8, 2003",
  "date_iso": "2003-11-08T08:27:00+00:00",
  "date_from_url": "2003-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Abraham Foxman, the national director of the Anti-Defamation League (ADL) said of Gibson, “I think he’s infected — seriously infected — with some very, very serious anti-Semitic views.”</em></p><p>Mr. Foxman is a <a href=\"http://www.cnsnews.com/ViewCulture.asp?Page=Culturearchive200311CUL20031107c.html\">stunningly myopic man</a>.  Since he can’t seem to get it through his thick skull, let me point out that the Crucifixion of Jesus Christ IS NOT ABOUT JEWS!  Except in that Jesus, a Jew, died for Jews just like he did for everyone else.  It is inexcusable and incredibly short-sighted to attempt to accuse a good man of anti-Semitism who is guilty of doing nothing more than articulating the Gospels in a visual medium.  Forget the very valid argument about artistic freedom – where is Mr. Foxman when Christians are defamed in what passes for art these days – if believing in the truth of the New Testament makes me an anti-Semite, well, then I’m an irredeemable anti-Semite, all my defenses of Jews and Israel notwithstanding.  Do the Jews have so many friends in the world today that it makes sense to alienate their only consistent defenders?  Without evangelical American Christians, who do they expect to come to their defense, French existentialists?  Lesbian neo-pagan Wiccans from San Francisco?</p><p>Guess what, Mr. Foxman.  Only Christian fundamentalists who take the Bible literally give a damn about Israel.  Because if you don’t believe  that there is a God who made a binding promise to Abraham, a God whose only son died to save the souls of men, a God who gave John a prophecy in which the Jews’ return to Israel is an integral part, then Israel is nothing but another “s—– little country”.  European guilt over the Holocaust is dying with the WWII generation and in another fifty years, a Muslim-dominated Old World will be about as friendly to Israel as Syria is now.  Atheist America doesn’t care about Jews anymore than it cares about Rwandans, Tibetans or Sudanese – and why should it?</p><p>Furthermore, if it is acceptable to blame Christians today for the actions of Christians 500 years ago, guess what?  It’s perfectly reasonable to blame Jews for the actions of Jews 2000 years ago.  Michael Medved, who is himself Jewish, understands this. “My concern is that the campaign against The Passion is provoking far more anti-Semitism than the movie itself ever could.”</p></div>",
  "content_text": "Abraham Foxman, the national director of the Anti-Defamation League (ADL) said of Gibson, “I think he’s infected — seriously infected — with some very, very serious anti-Semitic views.”\nMr. Foxman is a\nstunningly myopic man\n.  Since he can’t seem to get it through his thick skull, let me point out that the Crucifixion of Jesus Christ IS NOT ABOUT JEWS!  Except in that Jesus, a Jew, died for Jews just like he did for everyone else.  It is inexcusable and incredibly short-sighted to attempt to accuse a good man of anti-Semitism who is guilty of doing nothing more than articulating the Gospels in a visual medium.  Forget the very valid argument about artistic freedom – where is Mr. Foxman when Christians are defamed in what passes for art these days – if believing in the truth of the New Testament makes me an anti-Semite, well, then I’m an irredeemable anti-Semite, all my defenses of Jews and Israel notwithstanding.  Do the Jews have so many friends in the world today that it makes sense to alienate their only consistent defenders?  Without evangelical American Christians, who do they expect to come to their defense, French existentialists?  Lesbian neo-pagan Wiccans from San Francisco?\nGuess what, Mr. Foxman.  Only Christian fundamentalists who take the Bible literally give a damn about Israel.  Because if you don’t believe  that there is a God who made a binding promise to Abraham, a God whose only son died to save the souls of men, a God who gave John a prophecy in which the Jews’ return to Israel is an integral part, then Israel is nothing but another “s—– little country”.  European guilt over the Holocaust is dying with the WWII generation and in another fifty years, a Muslim-dominated Old World will be about as friendly to Israel as Syria is now.  Atheist America doesn’t care about Jews anymore than it cares about Rwandans, Tibetans or Sudanese – and why should it?\nFurthermore, if it is acceptable to blame Christians today for the actions of Christians 500 years ago, guess what?  It’s perfectly reasonable to blame Jews for the actions of Jews 2000 years ago.  Michael Medved, who is himself Jewish, understands this. “My concern is that the campaign against The Passion is provoking far more anti-Semitism than the movie itself ever could.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-08T08:27:00+00:00"
}