{
  "url": "https://voxday.net/2003/11/24/strange-semantics/",
  "scraped_at": "2025-12-13T15:35:56.754389",
  "title": "Strange Semantics",
  "date_display": "November 24, 2003",
  "date_iso": "2003-11-24T08:05:00+00:00",
  "date_from_url": "2003-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the second response to <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35640\">The Irrational Atheist</a> selected, from one SS. It is noteworthy primarily for correctly ascertaining that the Socrates quote actually had nothing directly to do with the subject of atheism, but more on that later. I’m not sure if the person who wrote this emailed it to me, or if someone else did, regardless, it was certainly one that demanded answer. In this case, SS is quoted in full in italics, my reply to SS is in bold.</p><p><em>So, someone has decided to trot out the hackneyed, unsound argument that because atheists don’t have God, they don’t have any (rational) foundation for morality or ethics. Woohoo! You have to wonder if these people read! I mean at all. The name-dropping doesn’t convince me. Let’s go through this, paragraph by paragraph, and see if there’s any substance in there.</em></p><p><strong>Name-dropping shouldn’t convince one of anything, except that the author does, quite obviously, read. This introductory paragraph is typically meaningless chest-beating, but the last sentence indicates that SS is willing to give it a fair shake. Let’s do it. </strong></p><p><em>Paragraph 1: Ummm… ok </em></p><p><strong>Likewise.</strong></p><p><em>Paragraph 2: It’s important to remember that the people doing most of the murdering in France were Christians. Most of the intellectuals, atheist or Christian, who had championed Enlightenment ideals, and were still alive when the terror began in France, were disheartened and distanced themselves from it. Ironically (given what this paragraph says), one of the few intellectuals to continue championing the Enlightenment, and to even excuse the terror, was Kant, a Christian. Remember that the Enlightenment was not, for the most part, an atheistic movement (primarily, it was an attempt to reconcile Christian and secular/scientific values). Furthermore, France wasn’t the only place where the Enlightenment played out. The United States was the other, and I don’t see this article mentioning the success it had here.</em></p><p><strong>Some massive and unsupported assumptions here. Since atheists almost uniformly consider the deism of the Enlightenment as a significant step in the evolution of modern atheistic philosophy, I think it is odd, if not dishonest, to suddenly attempt to turn around and classify their deist heroes as religious men philosophically akin to evangelical Christians. Do Rousseau, Diderot and Voltaire truly belong to the party of those they regularly attacked? While Maximillian Robespierre did execute the avowedly atheist revolutionary leader Jacques-Rene Hebert for desecrating the altar at Notre Dame and creating a cult of Reason – hmmmm – he was no Christian. He was, rather, a deist, the very sort of quasi-religious man that atheists wrongly claim most of America’s founding fathers were in an attempt to portray the early United States as a non-Christian nation. Read the Cult of the Supreme Being, which was inspired by Jean-Jacque Rousseau’s deistic philosophy, and which Robespierre pushed the National Convention to adopt as France’s official religion in the place of Roman Catholic Christianity, to get an insight into his thinking.</strong></p><p>As to America, it was founded by a very different group of men. Of the 250 Founding Fathers, only a tiny percentage, between 3 and 7 individuals, were deists or irreligious. There were more Founders involved in founding the American Bible Institute than can be credibly called deists, much less atheists. 27 of the 56 signers of the Declaration of Independence held seminary degrees or Bible school degrees and their affiliations with various Christian denominations were as follows: 34 Episcopalians, 13 Congregationalists, 6 Presbyterians, 1 Baptist, 1 Roman Catholic, and 1 Quaker. I submit that it was this divergence of allegience – between reason/deism and Jesus Christ – that accounts for the tremendous difference between the two revolutions.</p><p>Admittedly, it would be beneficial to have a better understanding of the religious affiliations, or lack thereof, of the French National Assembly and the Committee of Public Safety to support my claim. But given the strong degree of anticlericalism and the enthusiasm with which the openly religious were slaughtered, and the bloody fruit repeatedly harvested by those anti-religious ideologies that claim inspiration from the French Revolution, I stand by my assertion, pending specific information to the contrary. I would certainly welcome any research in this regard, as Simon Schama’s Citizens and A Tale of Two Cities represents the greater part of my familiarity with the French Revolution. It is also nothing more than an assumption to claim that the Jacobins or the National Assemblymen were Christian, especially given that SS provides no information with regards to a single Jacobin’s religious affiliation or claim of submitting to the Lordship of Jesus Christ. It is a huge failure of logic for SS to assume that every individual in a Christian-dominated society is necessarily a Christian himself. By his logic, future historians might well wrongly consider him to be a Christian.</p><p><em>Paragraph 3: Again, pretty much everyone in the west, Christian, atheist, or whatever, puts his or her faith in science. The linguistic division of labor does require faith, but it’s a pragmatic faith, and in the west, a ubiquitous one. The example in the blog (age of the earth) is interesting. I imagine most non-scientists are agnostic about the actual age of the earth, though they think it’s quite old. And of course, one doesn’t need to be a specialist to have good reasons for believing this (fossilized bones of animals that no longer exist, for example, is a good reason for thinking that the Earth has been around for a while, and there are plenty more). It’s fairly trivial to show that all rational arguments are based at some point, in their explicit or implicit premises, on assumptions that cannot be verified. This doesn’t make them irrational. Of course, the bulk of specialized science is irrelevant to most atheist’s beliefs systems, and probably unknown completely, so parts of this are wholly misguided (or dishonest, it’s hard to tell which).</em></p><p><strong>Following the example set by HG, SS misses the point, though not as completely. He assumes that most atheists have far more information and have spent more time thinking about their belief systems than I have usually witnessed or heard them claim. One does not have to have perfect knowledge to be rational, but to use two common examples, one has to at least know what evolution or the big bang actually is in order to claim that it is the foundation upon which one’s rational belief system has been constructed. Furthermore, the fact that one’s faith is pragmatic and ubiquitous does not make it any less faith, or prove that one has reasoned one’s way to the conclusions it provides.</strong></p><p><em>Paragraph 4: I’m not sure this faith is either as blind as the religious faith (which also generally relies on experts, but is also non-demonstrable, whereas most science, outside of particle physics, is demonstrable). “Childlike” makes no sense here, either, but hey, at least it’s in keeping with the tone of the article. How is it childlike, again? I’m not sure how it’s irrational, either. Appeal to authority? I suppose, but it’s not really that in the sense that the fallacy with that name is meant to discourage, and since most science is demonstrable, it can be rationally evaluated even by non-experts, though they presumably won’t have all the facts. Also see the comments on Paragraph 3.</em></p><p><strong>More failures of logic. The fact that it is demonstrable does not mean that it has been demonstrated to the believing individual. Furthermore, how can SS claim that religious faith is non-demonstrable? The Bible is no less a historical document, by any historian’s standard, than anything recorded by Arrian, Herodotus or Thucydides. Indeed, the history of archeology is rife with examples of where the archeologists of the day have been wrong and the Bible has been subsequently proven more reliable by comparison – Hittites, anyone? And then there’s the so-called myth of the Assyrians, too. How quickly these scientists forget! Also, many Christians will openly declare that God’s power has been demonstrated to them – apparently SS is not only willing, but eager, to dismiss their testimony out of hand. Childlike, of course, is a sarcastic reference to the most perfect, unquestioning form of faith as defined in the Bible. And he’s not sure that I read?</strong></p><p>Paragraph 5: We don’t?  How can you know this?  Is God the only good reason?  Might we come up with other systems of values that lead to similar humanist conclusions?  There’s no argument in the article that we can’t, and since plenty have, the burden is on the author of this article to show how these fail.</p><p><strong>There is no argument that no atheist can, my argument is that the overwhelming majority of atheists can’t, haven’t, don’t and won’t.  Ayn Rand has come up with a rational system of sorts.  Utilitarianism, for all its lack of believability, is another possibility.  However, I know many atheists and exactly none of them subscribe to either – and most are completely unfamiliar with both.  In fact, none are even able to say much about their own moral systems, except to make banal claims such as “killing people is obviously bad” and assert self-evidence where none exists.  Furthermore, my understanding is that the atheist position is generally that the burden of proof is on the theist to prove that God exists, not the atheist to prove that he does not.  Why the sudden reversal here?  Because, of course, SS’ case is weak and he knows it.  Is it a coincidence that the purportedly independently-reasoned moral system of the average Western atheist usually happens to mimic, almost precisely, the Judeo-Christian ethic in which he and his parents have been raised?  I do not find this credible.</strong></p><p><em>Paragraph 6:  This paragraph seems to apply to both most atheists and most Christians (and the majority of people in general).  People tend to be fair-weather moralists.  I don’t know any atheists who argue otherwise.  Atheists don’t think that not believing in God makes them less human, less prone to human fallibility.</em></p><p><strong>The Christian who is a fair-weather moralist falls far short of the Biblical standards as laid forth in the Bible.  The same is not true of the atheist, who simply modifies his individual moral system to match with his desires – if he is rational.  The last statement is demonstrably untrue.  I received many emails from atheists expressing the notion that they are better people, more altruistic, more moral and of a higher ethos because they do not believe in God.  I suspect that like others who have emailed, SS needs to take more consideration of the vast breadth of the cognitive spectrum of the godless.</strong></p><p>Paragraph 7: A value parasite?  How so, again?  Because he worked with the ethics inherent in his culture?  Umm… who doesn’t?  In addition, I’m not sure the author knows what “post-facto” and “rationalization” mean, given that atheists may actually use things like consequentialist (including, perhaps, utilitarian) or altruistic considerations in determining their behavior.  I imagine these things can even become internalized and automatized (they certainly seem to be in most of us), just like any other ethic.  One might even argue that Chistians (and other types of believers) use similar considerations, and that their theological justifactions are “rationalizations.”</p><p><strong>A moral parasite, because the atheist is not only making use of a moral system to which he does not subscribe, but his individual modifications, taken in the collective and writ large upon the society, have the effect of poisoning it.  Hence the ongoing secularization and decline of America.  Who doesn’t?  Among others, Christians are commanded not to.  “Be in the world, but not of it.”  Not that all, or even most succeed, but the extent to which evangelical Christians freak out those of the tolerant, PC secular media ethic demonstrates that many do.</strong></p><p>I should have said “ex post facto” of course, but after the fact rationalization is exactly the way in which I believe most people naturally behave.  I don’t believe that most people determine their behavior, I believe that most people act first and think later.  I find that even those who really try very hard to think first are usually too influenced by their momentary desires to perform a truly rational analysis.  Everyone does this, Christians included, and I’ll freely admit that some of the worst rationalizations I’ve ever heard have come from Christians attempting to justify their anti-Scriptural decisions based on Scripture.  But in the Christian’s case, this is clearly wrong and is usually condemned quite strongly by fellow Christians.</p><p><em>Paragraph 8: “I am saying nothing new here.”  No, you’re not, not even close.  Socrates was an atheist martyr (he wasn’t really an atheist, but we’ll claim him if you don’t want him)?   Hmmm… I wonder if the author has read the Republic.  Taking that quote out of context is odd, here.  It’ be interesting to see if the author knows what comes next (this quote is part of a section containing one of the most interesting metaphors in Plato, leaders as physicians, and a discussion on marriage and breeding… I’m not sure if many atheists adhere to the ideas stated in this section of the Republic, and the ones who do are not alone – Eugenics was big among Christians in the U.S. in the early part of the 20th century).  Of course, Plato has been more influential in Christian theology and philosophy than anywhere else, and his elitism has often been a difficult to reconcile part of his political thought in all philosophical circles.</em></p><p><strong>Yes, you can have Socrates.  I don’t believe his theistic protestations, and my reading of him is that a) the god of whom he spoke was his reason; b) the absence of gods and the ur-deity of Man was an important part of the secret wisdom.  The quote, as SS and a few others with the eyes to see have seen, was totally unconnected with the subject and I used it as both a key to understanding the article as well as a test designed to weed out the lesser lights – I have not only read the Republic, but I consider it central to understanding most 20th Century ideologies.  The deeper point, since I have no objection to making it clear to those who have bothered to follow the debate, is that while my argument can be rightly viewed as a defense of a religious worldview, it is not only neither new nor Christian, it is in fact synonymous with and an important part of the atheist elite’s justification for their right to rule over society.  And for older, non-atheist elites as well.</strong></p><p><em>Paragraph 9: Religion has been used as a means of control throughout history, by the religious as much as the areligious.</em></p><p><strong>Seneca said it was useful.  Socrates, Voltaire and I all happen to believe that it is necessary.  I believe it is almost always necessary for individual morality just as it is necessary for the morals of society, and that we are beginning to see the results of allowing the once-secret knowledge to spill out over the masses.  Fortunately, in my opinion, most modern atheists are irrational, intellectually lazy moral parasites, which tends to reduce the impact given a Judeo-Christian society.  Nevertheless, the post-Enlightenment world has already witnessed the bloodiest and most brutal century in Man’s history.  Atheists may believe this to be a coincidence; I have already stated that I do not.  And as more people turn their backs on God, worse will come.  The irrational atheist says never again, I say it is inevitable.  And somewhere, the rational atheist asks, why should I not?</strong></p><p><em>Paragraph 10: I don’t know what to say to this.  It’s true, but irrelevant to his points about atheists.  See comment on Paragraph 9.  Still,</em></p><p><strong>It is not irrelevant.  The fact that Voltaire, hero of atheists everywhere, should greatly fear the consequences of permitting atheism to take root amongst those inequipped to handle its implications, is directly relevant to my opinion that rational atheists are likely to lead humanity to the grave.  At the very least, this should encourage an atheist to consider the likely implications of his non-belief, not only for him, but for the world around him.</strong></p><p><em>Paragraph 11: This is, of course, nonsense.  Most atheists who have the courage to, using the language of Nietzsche, create their own tables of values now that God is dead and we can no longer use His, are not sociopaths.  Granted, most atheists (and non-atheists) do take the easy road, and stick within the value systems within which they were socialized, for the most part, but this isn’t necessarily irrational, and the opposite of doing so isn’t sociopathy.  Do most atheists not reflect on their ethical beliefs/values?  I imagine that’s true, but the same goes for everyone else.  I don’t know many atheists who would claim that atheists, as a group, are any different in this way from the rest of the intellectually lazy population.</em></p><p><strong>Here SS unwittingly concedes much of the argument, despite his many protestations above.  He may not know many atheists who claim this, but I do.  I also have the emails to prove it.  And it is irrational to “take the easy road and stick within… value systems”.  Irrational is defined as not rational.  Rational is defined:</strong></p><p>[adj]  having its source in or being guided by the intellect (distinguished from experience or emotion)<br> <br>[adj]  of or associated with or requiring the use of the mind<br> <br>[adj]  consistent with or based on or using reason</br></br></br></br></p><p>Simply doing what everyone around you is doing, believing what everyone around you believes does not have much to do with any of these definitions, much less constructing a coherent and independent moral system.  It may be reasonable to do as everyone else does in order to keep from drawing attention to yourself, but you can hardly argue that you are guided by reason, since herd animals do the same.  As for sociopathy, I have no research on this, but I’m quite confident that there are more serial killers lacking religious faith than are committed Church-going evangelical Christians.  As before, any non-anecdotal information to the contrary is welcome.<br> <br><em><br> <br>Paragraph 12:  This is nonses, as well.  Since we know from history that the Enlightement’s guillotine was as much or more a Christian tool as it was an atheist one, and since the Holocaust of Nazi Germany was carried out, primarily, by nominal Christians, one wonders why they’re attached to the “path of the philosopher” and attributed to atheists.  For Christian-perpetrated holocausts, by the way, we don’t need to look back at the Inquisition.  The Balkans, or present day Africa, will do fine. </br></br></em></br></br></p><p><strong>The Jacobins were not Christians, by any stretch of the imagination, as has been already discussed.  Notice the choice of “carried out” and “nominal”, since the Holocaust was conceived and led by atheists who explicitely desired to wipe out Judeo-Christianity.  If a nominal Christian does something, it is a real stretch to assign his motivation to a faith he may not even have.  The Inquisition accounted for 6,000 deaths in 356 years; hardly a Holocaust.  Europe – including the Balkans, is no longer considered even nominally Christian, and the conflict there is ethnic, not religious, at any rate. Post-colonial massacres in Africa have been ethnic when they have not been socialist or Islamic; as to the pre-Colonial era, one needs to know the religious affiliation of the colonial leaders to make any such statement.  SS turns out to have a very poor grasp of history.</strong></p><p><em>I don’t know of any studies demonstrating that the incidence of human rights violations is higher among atheists (percentage wise or in absolute numbers) than among the religious, and I doubt that if such a study were conducted we would find such a difference.  This would be much more interesting if the author had actual facts/data/studies to back it up.  The author is right in that the consequences of breaking away from the culturally and psychologically solid foundation of western religion is very difficult, and the consequences can be painful.  Since Nietzsche, much of philosophy has attempted to build a foundation for ethics after the symbolic death of God.  Some of it has been successful, and some has not.  It’s interesting that most atheistic philosophical movements in the 20th century have criticized science as often or more often than they’ve criticized religion.  Rational or scientific realism is on as shaky a ground as religion, among atheistic philosophers.  I wonder if the author knew this?</em></p><p><strong>I agree, it would be more interesting.  Maybe when I have a team of 14 researchers, I’ll do just that.  There is, however, the many incidents of democide committed by atheist socialist mortacracies, which in a relatively short period of time has amassed a body count unparalleled in human history.  I find it intriguing that atheists are now attempting to deny any connection between Communism, socialism and atheism, when for many years atheist intellectuals were arguing for the obvious superiority of the godless State.  Also, while I very much agree that for many Leftists, the State serves as a sort of god – or to paraphrase Schumpeter, there is no god but History and Karl Marx is its prophet – the State as God metaphor is a very questionable escape device for the atheist uncomfortable with the murderous results of godless state rule.</strong></p><p>I did not know that rational realism is on as shaky a ground as religion.  Philosophy is only a tertiary interest of mine at best, which is why I seldom write on it.  But it is an interesting intellectual development.  I left off SS’ final paragraph, which is primarily an inaccurate summary of my argument and more chest-beating. </p></div>",
  "content_text": "This is the second response to\nThe Irrational Atheist\nselected, from one SS. It is noteworthy primarily for correctly ascertaining that the Socrates quote actually had nothing directly to do with the subject of atheism, but more on that later. I’m not sure if the person who wrote this emailed it to me, or if someone else did, regardless, it was certainly one that demanded answer. In this case, SS is quoted in full in italics, my reply to SS is in bold.\nSo, someone has decided to trot out the hackneyed, unsound argument that because atheists don’t have God, they don’t have any (rational) foundation for morality or ethics. Woohoo! You have to wonder if these people read! I mean at all. The name-dropping doesn’t convince me. Let’s go through this, paragraph by paragraph, and see if there’s any substance in there.\nName-dropping shouldn’t convince one of anything, except that the author does, quite obviously, read. This introductory paragraph is typically meaningless chest-beating, but the last sentence indicates that SS is willing to give it a fair shake. Let’s do it.\nParagraph 1: Ummm… ok\nLikewise.\nParagraph 2: It’s important to remember that the people doing most of the murdering in France were Christians. Most of the intellectuals, atheist or Christian, who had championed Enlightenment ideals, and were still alive when the terror began in France, were disheartened and distanced themselves from it. Ironically (given what this paragraph says), one of the few intellectuals to continue championing the Enlightenment, and to even excuse the terror, was Kant, a Christian. Remember that the Enlightenment was not, for the most part, an atheistic movement (primarily, it was an attempt to reconcile Christian and secular/scientific values). Furthermore, France wasn’t the only place where the Enlightenment played out. The United States was the other, and I don’t see this article mentioning the success it had here.\nSome massive and unsupported assumptions here. Since atheists almost uniformly consider the deism of the Enlightenment as a significant step in the evolution of modern atheistic philosophy, I think it is odd, if not dishonest, to suddenly attempt to turn around and classify their deist heroes as religious men philosophically akin to evangelical Christians. Do Rousseau, Diderot and Voltaire truly belong to the party of those they regularly attacked? While Maximillian Robespierre did execute the avowedly atheist revolutionary leader Jacques-Rene Hebert for desecrating the altar at Notre Dame and creating a cult of Reason – hmmmm – he was no Christian. He was, rather, a deist, the very sort of quasi-religious man that atheists wrongly claim most of America’s founding fathers were in an attempt to portray the early United States as a non-Christian nation. Read the Cult of the Supreme Being, which was inspired by Jean-Jacque Rousseau’s deistic philosophy, and which Robespierre pushed the National Convention to adopt as France’s official religion in the place of Roman Catholic Christianity, to get an insight into his thinking.\nAs to America, it was founded by a very different group of men. Of the 250 Founding Fathers, only a tiny percentage, between 3 and 7 individuals, were deists or irreligious. There were more Founders involved in founding the American Bible Institute than can be credibly called deists, much less atheists. 27 of the 56 signers of the Declaration of Independence held seminary degrees or Bible school degrees and their affiliations with various Christian denominations were as follows: 34 Episcopalians, 13 Congregationalists, 6 Presbyterians, 1 Baptist, 1 Roman Catholic, and 1 Quaker. I submit that it was this divergence of allegience – between reason/deism and Jesus Christ – that accounts for the tremendous difference between the two revolutions.\nAdmittedly, it would be beneficial to have a better understanding of the religious affiliations, or lack thereof, of the French National Assembly and the Committee of Public Safety to support my claim. But given the strong degree of anticlericalism and the enthusiasm with which the openly religious were slaughtered, and the bloody fruit repeatedly harvested by those anti-religious ideologies that claim inspiration from the French Revolution, I stand by my assertion, pending specific information to the contrary. I would certainly welcome any research in this regard, as Simon Schama’s Citizens and A Tale of Two Cities represents the greater part of my familiarity with the French Revolution. It is also nothing more than an assumption to claim that the Jacobins or the National Assemblymen were Christian, especially given that SS provides no information with regards to a single Jacobin’s religious affiliation or claim of submitting to the Lordship of Jesus Christ. It is a huge failure of logic for SS to assume that every individual in a Christian-dominated society is necessarily a Christian himself. By his logic, future historians might well wrongly consider him to be a Christian.\nParagraph 3: Again, pretty much everyone in the west, Christian, atheist, or whatever, puts his or her faith in science. The linguistic division of labor does require faith, but it’s a pragmatic faith, and in the west, a ubiquitous one. The example in the blog (age of the earth) is interesting. I imagine most non-scientists are agnostic about the actual age of the earth, though they think it’s quite old. And of course, one doesn’t need to be a specialist to have good reasons for believing this (fossilized bones of animals that no longer exist, for example, is a good reason for thinking that the Earth has been around for a while, and there are plenty more). It’s fairly trivial to show that all rational arguments are based at some point, in their explicit or implicit premises, on assumptions that cannot be verified. This doesn’t make them irrational. Of course, the bulk of specialized science is irrelevant to most atheist’s beliefs systems, and probably unknown completely, so parts of this are wholly misguided (or dishonest, it’s hard to tell which).\nFollowing the example set by HG, SS misses the point, though not as completely. He assumes that most atheists have far more information and have spent more time thinking about their belief systems than I have usually witnessed or heard them claim. One does not have to have perfect knowledge to be rational, but to use two common examples, one has to at least know what evolution or the big bang actually is in order to claim that it is the foundation upon which one’s rational belief system has been constructed. Furthermore, the fact that one’s faith is pragmatic and ubiquitous does not make it any less faith, or prove that one has reasoned one’s way to the conclusions it provides.\nParagraph 4: I’m not sure this faith is either as blind as the religious faith (which also generally relies on experts, but is also non-demonstrable, whereas most science, outside of particle physics, is demonstrable). “Childlike” makes no sense here, either, but hey, at least it’s in keeping with the tone of the article. How is it childlike, again? I’m not sure how it’s irrational, either. Appeal to authority? I suppose, but it’s not really that in the sense that the fallacy with that name is meant to discourage, and since most science is demonstrable, it can be rationally evaluated even by non-experts, though they presumably won’t have all the facts. Also see the comments on Paragraph 3.\nMore failures of logic. The fact that it is demonstrable does not mean that it has been demonstrated to the believing individual. Furthermore, how can SS claim that religious faith is non-demonstrable? The Bible is no less a historical document, by any historian’s standard, than anything recorded by Arrian, Herodotus or Thucydides. Indeed, the history of archeology is rife with examples of where the archeologists of the day have been wrong and the Bible has been subsequently proven more reliable by comparison – Hittites, anyone? And then there’s the so-called myth of the Assyrians, too. How quickly these scientists forget! Also, many Christians will openly declare that God’s power has been demonstrated to them – apparently SS is not only willing, but eager, to dismiss their testimony out of hand. Childlike, of course, is a sarcastic reference to the most perfect, unquestioning form of faith as defined in the Bible. And he’s not sure that I read?\nParagraph 5: We don’t?  How can you know this?  Is God the only good reason?  Might we come up with other systems of values that lead to similar humanist conclusions?  There’s no argument in the article that we can’t, and since plenty have, the burden is on the author of this article to show how these fail.\nThere is no argument that no atheist can, my argument is that the overwhelming majority of atheists can’t, haven’t, don’t and won’t.  Ayn Rand has come up with a rational system of sorts.  Utilitarianism, for all its lack of believability, is another possibility.  However, I know many atheists and exactly none of them subscribe to either – and most are completely unfamiliar with both.  In fact, none are even able to say much about their own moral systems, except to make banal claims such as “killing people is obviously bad” and assert self-evidence where none exists.  Furthermore, my understanding is that the atheist position is generally that the burden of proof is on the theist to prove that God exists, not the atheist to prove that he does not.  Why the sudden reversal here?  Because, of course, SS’ case is weak and he knows it.  Is it a coincidence that the purportedly independently-reasoned moral system of the average Western atheist usually happens to mimic, almost precisely, the Judeo-Christian ethic in which he and his parents have been raised?  I do not find this credible.\nParagraph 6:  This paragraph seems to apply to both most atheists and most Christians (and the majority of people in general).  People tend to be fair-weather moralists.  I don’t know any atheists who argue otherwise.  Atheists don’t think that not believing in God makes them less human, less prone to human fallibility.\nThe Christian who is a fair-weather moralist falls far short of the Biblical standards as laid forth in the Bible.  The same is not true of the atheist, who simply modifies his individual moral system to match with his desires – if he is rational.  The last statement is demonstrably untrue.  I received many emails from atheists expressing the notion that they are better people, more altruistic, more moral and of a higher ethos because they do not believe in God.  I suspect that like others who have emailed, SS needs to take more consideration of the vast breadth of the cognitive spectrum of the godless.\nParagraph 7: A value parasite?  How so, again?  Because he worked with the ethics inherent in his culture?  Umm… who doesn’t?  In addition, I’m not sure the author knows what “post-facto” and “rationalization” mean, given that atheists may actually use things like consequentialist (including, perhaps, utilitarian) or altruistic considerations in determining their behavior.  I imagine these things can even become internalized and automatized (they certainly seem to be in most of us), just like any other ethic.  One might even argue that Chistians (and other types of believers) use similar considerations, and that their theological justifactions are “rationalizations.”\nA moral parasite, because the atheist is not only making use of a moral system to which he does not subscribe, but his individual modifications, taken in the collective and writ large upon the society, have the effect of poisoning it.  Hence the ongoing secularization and decline of America.  Who doesn’t?  Among others, Christians are commanded not to.  “Be in the world, but not of it.”  Not that all, or even most succeed, but the extent to which evangelical Christians freak out those of the tolerant, PC secular media ethic demonstrates that many do.\nI should have said “ex post facto” of course, but after the fact rationalization is exactly the way in which I believe most people naturally behave.  I don’t believe that most people determine their behavior, I believe that most people act first and think later.  I find that even those who really try very hard to think first are usually too influenced by their momentary desires to perform a truly rational analysis.  Everyone does this, Christians included, and I’ll freely admit that some of the worst rationalizations I’ve ever heard have come from Christians attempting to justify their anti-Scriptural decisions based on Scripture.  But in the Christian’s case, this is clearly wrong and is usually condemned quite strongly by fellow Christians.\nParagraph 8: “I am saying nothing new here.”  No, you’re not, not even close.  Socrates was an atheist martyr (he wasn’t really an atheist, but we’ll claim him if you don’t want him)?   Hmmm… I wonder if the author has read the Republic.  Taking that quote out of context is odd, here.  It’ be interesting to see if the author knows what comes next (this quote is part of a section containing one of the most interesting metaphors in Plato, leaders as physicians, and a discussion on marriage and breeding… I’m not sure if many atheists adhere to the ideas stated in this section of the Republic, and the ones who do are not alone – Eugenics was big among Christians in the U.S. in the early part of the 20th century).  Of course, Plato has been more influential in Christian theology and philosophy than anywhere else, and his elitism has often been a difficult to reconcile part of his political thought in all philosophical circles.\nYes, you can have Socrates.  I don’t believe his theistic protestations, and my reading of him is that a) the god of whom he spoke was his reason; b) the absence of gods and the ur-deity of Man was an important part of the secret wisdom.  The quote, as SS and a few others with the eyes to see have seen, was totally unconnected with the subject and I used it as both a key to understanding the article as well as a test designed to weed out the lesser lights – I have not only read the Republic, but I consider it central to understanding most 20th Century ideologies.  The deeper point, since I have no objection to making it clear to those who have bothered to follow the debate, is that while my argument can be rightly viewed as a defense of a religious worldview, it is not only neither new nor Christian, it is in fact synonymous with and an important part of the atheist elite’s justification for their right to rule over society.  And for older, non-atheist elites as well.\nParagraph 9: Religion has been used as a means of control throughout history, by the religious as much as the areligious.\nSeneca said it was useful.  Socrates, Voltaire and I all happen to believe that it is necessary.  I believe it is almost always necessary for individual morality just as it is necessary for the morals of society, and that we are beginning to see the results of allowing the once-secret knowledge to spill out over the masses.  Fortunately, in my opinion, most modern atheists are irrational, intellectually lazy moral parasites, which tends to reduce the impact given a Judeo-Christian society.  Nevertheless, the post-Enlightenment world has already witnessed the bloodiest and most brutal century in Man’s history.  Atheists may believe this to be a coincidence; I have already stated that I do not.  And as more people turn their backs on God, worse will come.  The irrational atheist says never again, I say it is inevitable.  And somewhere, the rational atheist asks, why should I not?\nParagraph 10: I don’t know what to say to this.  It’s true, but irrelevant to his points about atheists.  See comment on Paragraph 9.  Still,\nIt is not irrelevant.  The fact that Voltaire, hero of atheists everywhere, should greatly fear the consequences of permitting atheism to take root amongst those inequipped to handle its implications, is directly relevant to my opinion that rational atheists are likely to lead humanity to the grave.  At the very least, this should encourage an atheist to consider the likely implications of his non-belief, not only for him, but for the world around him.\nParagraph 11: This is, of course, nonsense.  Most atheists who have the courage to, using the language of Nietzsche, create their own tables of values now that God is dead and we can no longer use His, are not sociopaths.  Granted, most atheists (and non-atheists) do take the easy road, and stick within the value systems within which they were socialized, for the most part, but this isn’t necessarily irrational, and the opposite of doing so isn’t sociopathy.  Do most atheists not reflect on their ethical beliefs/values?  I imagine that’s true, but the same goes for everyone else.  I don’t know many atheists who would claim that atheists, as a group, are any different in this way from the rest of the intellectually lazy population.\nHere SS unwittingly concedes much of the argument, despite his many protestations above.  He may not know many atheists who claim this, but I do.  I also have the emails to prove it.  And it is irrational to “take the easy road and stick within… value systems”.  Irrational is defined as not rational.  Rational is defined:\n[adj]  having its source in or being guided by the intellect (distinguished from experience or emotion)\n[adj]  of or associated with or requiring the use of the mind\n[adj]  consistent with or based on or using reason\nSimply doing what everyone around you is doing, believing what everyone around you believes does not have much to do with any of these definitions, much less constructing a coherent and independent moral system.  It may be reasonable to do as everyone else does in order to keep from drawing attention to yourself, but you can hardly argue that you are guided by reason, since herd animals do the same.  As for sociopathy, I have no research on this, but I’m quite confident that there are more serial killers lacking religious faith than are committed Church-going evangelical Christians.  As before, any non-anecdotal information to the contrary is welcome.\nParagraph 12:  This is nonses, as well.  Since we know from history that the Enlightement’s guillotine was as much or more a Christian tool as it was an atheist one, and since the Holocaust of Nazi Germany was carried out, primarily, by nominal Christians, one wonders why they’re attached to the “path of the philosopher” and attributed to atheists.  For Christian-perpetrated holocausts, by the way, we don’t need to look back at the Inquisition.  The Balkans, or present day Africa, will do fine.\nThe Jacobins were not Christians, by any stretch of the imagination, as has been already discussed.  Notice the choice of “carried out” and “nominal”, since the Holocaust was conceived and led by atheists who explicitely desired to wipe out Judeo-Christianity.  If a nominal Christian does something, it is a real stretch to assign his motivation to a faith he may not even have.  The Inquisition accounted for 6,000 deaths in 356 years; hardly a Holocaust.  Europe – including the Balkans, is no longer considered even nominally Christian, and the conflict there is ethnic, not religious, at any rate. Post-colonial massacres in Africa have been ethnic when they have not been socialist or Islamic; as to the pre-Colonial era, one needs to know the religious affiliation of the colonial leaders to make any such statement.  SS turns out to have a very poor grasp of history.\nI don’t know of any studies demonstrating that the incidence of human rights violations is higher among atheists (percentage wise or in absolute numbers) than among the religious, and I doubt that if such a study were conducted we would find such a difference.  This would be much more interesting if the author had actual facts/data/studies to back it up.  The author is right in that the consequences of breaking away from the culturally and psychologically solid foundation of western religion is very difficult, and the consequences can be painful.  Since Nietzsche, much of philosophy has attempted to build a foundation for ethics after the symbolic death of God.  Some of it has been successful, and some has not.  It’s interesting that most atheistic philosophical movements in the 20th century have criticized science as often or more often than they’ve criticized religion.  Rational or scientific realism is on as shaky a ground as religion, among atheistic philosophers.  I wonder if the author knew this?\nI agree, it would be more interesting.  Maybe when I have a team of 14 researchers, I’ll do just that.  There is, however, the many incidents of democide committed by atheist socialist mortacracies, which in a relatively short period of time has amassed a body count unparalleled in human history.  I find it intriguing that atheists are now attempting to deny any connection between Communism, socialism and atheism, when for many years atheist intellectuals were arguing for the obvious superiority of the godless State.  Also, while I very much agree that for many Leftists, the State serves as a sort of god – or to paraphrase Schumpeter, there is no god but History and Karl Marx is its prophet – the State as God metaphor is a very questionable escape device for the atheist uncomfortable with the murderous results of godless state rule.\nI did not know that rational realism is on as shaky a ground as religion.  Philosophy is only a tertiary interest of mine at best, which is why I seldom write on it.  But it is an interesting intellectual development.  I left off SS’ final paragraph, which is primarily an inaccurate summary of my argument and more chest-beating.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-24T08:05:00+00:00"
}