{
  "url": "https://voxday.net/2003/11/11/targeting-civilians/",
  "scraped_at": "2025-12-13T15:34:09.692124",
  "title": "Targeting civilians",
  "date_display": "November 11, 2003",
  "date_iso": "2003-11-11T11:28:00+00:00",
  "date_from_url": "2003-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently some Muslims are still in a tizzy about <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=26870\">my strategic solution</a> to ending the latest flare-up in the Israeli-Palestinian war.  Let’s put this into perspective here.  In World War II, the United States inflicted an <a href=\"http://en.wikipedia.org/wiki/List_of_World_War_II_casualties_by_country\">estimated 672,000 civilian fatalities</a> on the Japanese as payback for 2,403 casualties at Pearl Harbor.</p><p>That’s a rate of 280 to 1, far higher than the 100 to 1 ratio for responding to civilian deaths that I feel would suffice to quickly dissuade the Palestinian leadership from continuing its terrorist campaign.  Remember, at the time I wrote that controversial column, the PLO leadership was publicly proclaiming the success of its murderous strategy since it had lowered the Israeli-Palestinian kill ratio from 10-1 to 3-1.  If that’s their measure of success, then it’s pretty obvious that any efforts to convince them of the failure of their strategy must be directed at their chosen metrics.  As for the 1000 to 1 suggestion, well, there’s a deeper point there.  LEAVE THE KIDS OUT OF IT!</p><p>No children, Jewish, Palestinian, Christian or Muslim, should be involved in this, or any war.  If you believe that murdering children is necessary for your cause, whatever it might be, then I have no problem with the Mossad, the IDF or the US Marines taking you out.  The sooner, the better.</p><p>I think one reason that the column was controversial, and one of the reasons that the United States has had a difficult time winning wars since the Korean “police action”, is that both the American people and its leadership are unwilling to face up to the reality of what war is.</p><p><em>“Our bravery is too negative. We talk too much of sacrifice, of the glory of dying that freedom may live. Of course we are willing to die but that is not enough. We must be eager to kill, to inflict on the enemy — the hated enemy — wounds, death and destruction. If we die killing, well and good, but if we fight hard enough, viciously enough, we will kill and live.”</em> – George S. Patton</p><p>I submit that men like General Patton and the legendary Marines’ Marine, Chesty Puller, know a lot more about wars and how to win them than the politician-generals who have bungled every military action since Korea, including Iraq: Part I and the misnamed War on Terror.  If we do not have the will to fight this war, so be it.  In that case, we must bring the troops home and hope for the best.  I am not entirely opposed to this option as I have my own doubts about the war, mostly due to its deleterious effect on human liberty.  But if the people’s decision is to fight a war that has been repeatedly declared against us by our Islamic enemies, (and this is why a Congressionally-approved Declaration of War is an absolute necessity), then unleash the damned hounds and don’t look back.</p></div>",
  "content_text": "Apparently some Muslims are still in a tizzy about\nmy strategic solution\nto ending the latest flare-up in the Israeli-Palestinian war.  Let’s put this into perspective here.  In World War II, the United States inflicted an\nestimated 672,000 civilian fatalities\non the Japanese as payback for 2,403 casualties at Pearl Harbor.\nThat’s a rate of 280 to 1, far higher than the 100 to 1 ratio for responding to civilian deaths that I feel would suffice to quickly dissuade the Palestinian leadership from continuing its terrorist campaign.  Remember, at the time I wrote that controversial column, the PLO leadership was publicly proclaiming the success of its murderous strategy since it had lowered the Israeli-Palestinian kill ratio from 10-1 to 3-1.  If that’s their measure of success, then it’s pretty obvious that any efforts to convince them of the failure of their strategy must be directed at their chosen metrics.  As for the 1000 to 1 suggestion, well, there’s a deeper point there.  LEAVE THE KIDS OUT OF IT!\nNo children, Jewish, Palestinian, Christian or Muslim, should be involved in this, or any war.  If you believe that murdering children is necessary for your cause, whatever it might be, then I have no problem with the Mossad, the IDF or the US Marines taking you out.  The sooner, the better.\nI think one reason that the column was controversial, and one of the reasons that the United States has had a difficult time winning wars since the Korean “police action”, is that both the American people and its leadership are unwilling to face up to the reality of what war is.\n“Our bravery is too negative. We talk too much of sacrifice, of the glory of dying that freedom may live. Of course we are willing to die but that is not enough. We must be eager to kill, to inflict on the enemy — the hated enemy — wounds, death and destruction. If we die killing, well and good, but if we fight hard enough, viciously enough, we will kill and live.”\n– George S. Patton\nI submit that men like General Patton and the legendary Marines’ Marine, Chesty Puller, know a lot more about wars and how to win them than the politician-generals who have bungled every military action since Korea, including Iraq: Part I and the misnamed War on Terror.  If we do not have the will to fight this war, so be it.  In that case, we must bring the troops home and hope for the best.  I am not entirely opposed to this option as I have my own doubts about the war, mostly due to its deleterious effect on human liberty.  But if the people’s decision is to fight a war that has been repeatedly declared against us by our Islamic enemies, (and this is why a Congressionally-approved Declaration of War is an absolute necessity), then unleash the damned hounds and don’t look back.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-11T11:28:00+00:00"
}