{
  "url": "https://voxday.net/2003/11/24/there-they-go-again-2/",
  "scraped_at": "2025-12-13T15:36:00.433532",
  "title": "There they go again",
  "date_display": "November 24, 2003",
  "date_iso": "2003-11-24T14:24:00+00:00",
  "date_from_url": "2003-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“The British Left intermittently erupts like a pustule upon the buttock of a rather good country. Seventy years ago it opposed mobilization against Adolf Hitler and worshipped the other [master of] genocide, Josef Stalin. It has marched for Mao, Ho Chi Minh, Khrushchev, Brezhnev, and Andropov. It has slobbered over Ceausescu and Mugabe. It has demonstrated against everything and everyone American for a century. Broadly speaking, it hates your country first, mine second.”<br> <br>– Frederick Forsyth</br></br></p><p>Thank you, <a href=\"http://www.nationalreview.com/impromptus/impromptus200311240001.asp\">Jay Nordlinger of NRO</a>, for bringing this appropos indictment to our attention.  Think about it, all you self-righteous left-wing lunatics.  Look at who your predecessors have supported in the past.  Do you notice any pattern there?  Maybe, just maybe, you might want to reconsider the accuracy of your Marxian analysis.</p><p>It reminds me of a great line from <em>Spawn,</em> when the demon looks at three would-be devil worshippers and laments: “why do we get all the idiots?”</p></div>",
  "content_text": "“The British Left intermittently erupts like a pustule upon the buttock of a rather good country. Seventy years ago it opposed mobilization against Adolf Hitler and worshipped the other [master of] genocide, Josef Stalin. It has marched for Mao, Ho Chi Minh, Khrushchev, Brezhnev, and Andropov. It has slobbered over Ceausescu and Mugabe. It has demonstrated against everything and everyone American for a century. Broadly speaking, it hates your country first, mine second.”\n– Frederick Forsyth\nThank you,\nJay Nordlinger of NRO\n, for bringing this appropos indictment to our attention.  Think about it, all you self-righteous left-wing lunatics.  Look at who your predecessors have supported in the past.  Do you notice any pattern there?  Maybe, just maybe, you might want to reconsider the accuracy of your Marxian analysis.\nIt reminds me of a great line from\nSpawn,\nwhen the demon looks at three would-be devil worshippers and laments: “why do we get all the idiots?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-24T14:24:00+00:00"
}