{
  "url": "https://voxday.net/2003/11/15/this-isnt-news/",
  "scraped_at": "2025-12-13T15:34:45.457831",
  "title": "This isn’t news",
  "date_display": "November 15, 2003",
  "date_iso": "2003-11-15T08:24:00+00:00",
  "date_from_url": "2003-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35631\">A high-ranking intelligence official</a> recently told me something startling. Our “enemy” in Iraq doesn’t consist of just a few Baathist/Saddam remnants that can be easily rooted out, as Bush and our defense establishment have been constantly telling us. Rather, we are facing an actual guerrilla warfare effort being almost openly orchestrated against us by Syria, and in part by other Arab countries, including Iran.  This official explained that almost half the guerrillas and terrorists entering Iraq come from Syria, where they are equipped with weapons and provided with the latest intelligence information, which is shared with them by Iran. Other militants are sent from Kuwait, Iran and even Saudi Arabia. There is little evidence that recent attacks against our troops are being orchestrated by remaining Saddam loyalists hiding in surrounding areas, he stated.</em></p><p>This is pretty substantial information. It changes everything about what lies ahead for our soldiers, and highlights a consistent mistake by the Bush administration of holding important things back from the American people. The picture being painted by the White House of a final resistance effort on the part of Saddam’s regime may be inaccurate and misleading. And this will likely haunt President Bush in the very near future.</p><p>It’s not only high-ranking intelligence officers who are saying this.  The Coalition officer I spoke with this week told me the same thing; it’s not  Iraqis that are attacking them, but the imported jihadists from other Arab countries.  And as <a href=\"http://voxday.blogspot.com/2003_11_01_voxday_archive.html#106875464697821198\">I already wrote</a>, they’re not being aggressively pursued, for the most part, for fear of destabilizing the situation.  This strategy is doomed to failure, as the entire goal of the foreign jihadists is to keep the situation unstable in order to keep US troops pinned down in Iraq and unable to open a new front in Syria, Iraq or Saudi Arabia.  It appears that the strategists of the jihad learned something from Afghanistan, as their previous strategy of melting away into Pakistan and the mountains only freed up US forces to move onto Iraq.</p><p>I believe that the war must be fought, since it will be waged against us regardless of what we do.  However, I am increasingly of the opinion that George Bush is the wrong man to lead the war effort.  He has not publicly identified the enemy, followed the Constitution or told the American people the truth about the difficulties now facing the occupation.  Kneejerk Republicans should note that President Bush has actually been worse in this regard than FDR, the worst President that America has ever known.</p></div>",
  "content_text": "A high-ranking intelligence official\nrecently told me something startling. Our “enemy” in Iraq doesn’t consist of just a few Baathist/Saddam remnants that can be easily rooted out, as Bush and our defense establishment have been constantly telling us. Rather, we are facing an actual guerrilla warfare effort being almost openly orchestrated against us by Syria, and in part by other Arab countries, including Iran.  This official explained that almost half the guerrillas and terrorists entering Iraq come from Syria, where they are equipped with weapons and provided with the latest intelligence information, which is shared with them by Iran. Other militants are sent from Kuwait, Iran and even Saudi Arabia. There is little evidence that recent attacks against our troops are being orchestrated by remaining Saddam loyalists hiding in surrounding areas, he stated.\nThis is pretty substantial information. It changes everything about what lies ahead for our soldiers, and highlights a consistent mistake by the Bush administration of holding important things back from the American people. The picture being painted by the White House of a final resistance effort on the part of Saddam’s regime may be inaccurate and misleading. And this will likely haunt President Bush in the very near future.\nIt’s not only high-ranking intelligence officers who are saying this.  The Coalition officer I spoke with this week told me the same thing; it’s not  Iraqis that are attacking them, but the imported jihadists from other Arab countries.  And as\nI already wrote\n, they’re not being aggressively pursued, for the most part, for fear of destabilizing the situation.  This strategy is doomed to failure, as the entire goal of the foreign jihadists is to keep the situation unstable in order to keep US troops pinned down in Iraq and unable to open a new front in Syria, Iraq or Saudi Arabia.  It appears that the strategists of the jihad learned something from Afghanistan, as their previous strategy of melting away into Pakistan and the mountains only freed up US forces to move onto Iraq.\nI believe that the war must be fought, since it will be waged against us regardless of what we do.  However, I am increasingly of the opinion that George Bush is the wrong man to lead the war effort.  He has not publicly identified the enemy, followed the Constitution or told the American people the truth about the difficulties now facing the occupation.  Kneejerk Republicans should note that President Bush has actually been worse in this regard than FDR, the worst President that America has ever known.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-15T08:24:00+00:00"
}