{
  "url": "https://voxday.net/2003/11/01/vast-intellectual-chas/",
  "scraped_at": "2025-12-13T15:32:53.931817",
  "title": "A vast intellectual chasm",
  "date_display": "November 1, 2003",
  "date_iso": "2003-11-01T20:48:00+00:00",
  "date_from_url": "2003-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As readers of my column know, a friend of mine committed suicide a few months ago.  I wrote <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35278\">Shadows, Sex and Sorrow</a> in an attempt to express some thoughts that my friend’s action had inspired, as well as to say a few things that I wish I had thought to say to her.  I was not writing a eulogy, nor was I writing for the benefit of those who knew her.  Indeed, I did not even tell anyone who knew her about that particular column.</p><p>Nevertheless, word has a way of getting around, and so a number of her friends and family have apparently come across the article.  Many of them understood the spirit in which the piece was written, some, however, have not.  I received one interesting email – an extremely polite one, I hasten to add – which raised some points worth addressing.  It was from a friend of my friend of whom I was previously unaware and who I have never met.</p><p><em>I’m sure you can imagine that I, and others I’m sure, would be pained by your description of her suicide as a decision of “cold logic in its remorseless nihilism.” I don’t know whether anyone besides God knows the reality of her suicide.   Perhaps you were completely accurate in your description, through your own spiritual confirmations.  But either way, it is my hope that all of our spiritual convictions are always tempered by our most compassionate vulnerabilities when writing or reflecting about [her] or others who share struggles similar to hers.</em></p><p>Now, it was never my intention to inflict pain upon anyone in writing this particular column, most particularly not upon those who have already suffered a tremendous loss.  And yet, something bothered me about the assertion that one should temper one’s spiritual convictions simply to spare the feelings of those who do not share them.  Would one temper one’s view of the gravitational force and the role it played in the death of one who jumped from a rooftop?  Especially if one was speaking with those who did not share one’s belief in gravity?</p><p>It was clear to me that the writer did not understand that although my friend was obviously the inspiration for the column, the piece was also addressing much more universal matters than a single human life.  From the perspective from which I write, all nihilism – and thus suicide – is rational given an atheistic worldview.  This logic contradicts the mainstream perspective, which, being a veneer of Judeo-Christian ethics without the underlying belief system, is highly irrational.  I am far from the first to point this out, however, people are more accustomed to hearing it from the likes of Nietszche, Sartre and Camus, not to mention Voltaire and Socrates, than an evangelical Christian.  And yet, I am not saying anything that has not been said before, and more eloquently, by some of humanity’s greatest minds.  Very few people are truly able to handle the inherent implications of being their own god.</p><p>I said as much in a response to the writer, who in his response clarified that my initial take on his email had been correct. <em>“I… am writing to restate my hope that you grow to gain a more heartfelt appreciation of [her] and perhaps of those who do not share your specific religious views.”</em> At first I though this was strange, as I could not see how anything I had written could possibly be construed as a lack of appreciation for my friend.  But to the faithless, the notion that an individual is responsible for his own actions is frightening, since relying only on oneself to bear the entire weight of an uncaring universe is simply more than can be faced by any except the most exceptional.  This is why Nietzsche – not one to shirk the dark – considered Christianity a coward’s path, and likely why the writer interpreted my bringing up the point as being uncompassionate.  But in what sense can it be considered compassion to leave others to drown in the dark?  I do not regret a single word I wrote; I regret only that I did not articulate them in time to share them with my friend.</p><p>Pat Buchanan and others have written of a great cultural war that is dividing America.  They are no doubt correct, but what is perhaps more ominous is that the two poles of religious faith and secular humanism have separated to the point that it is becoming very difficult to communicate effectively across the divide.  The friend of my friend also added <em>“I’m not sure this dialogue will be fruitful right now…. In any case, I would like to leave off corresponding here.”</em></p><p>I’m afraid his instincts are probably correct.</p></div>",
  "content_text": "As readers of my column know, a friend of mine committed suicide a few months ago.  I wrote\nShadows, Sex and Sorrow\nin an attempt to express some thoughts that my friend’s action had inspired, as well as to say a few things that I wish I had thought to say to her.  I was not writing a eulogy, nor was I writing for the benefit of those who knew her.  Indeed, I did not even tell anyone who knew her about that particular column.\nNevertheless, word has a way of getting around, and so a number of her friends and family have apparently come across the article.  Many of them understood the spirit in which the piece was written, some, however, have not.  I received one interesting email – an extremely polite one, I hasten to add – which raised some points worth addressing.  It was from a friend of my friend of whom I was previously unaware and who I have never met.\nI’m sure you can imagine that I, and others I’m sure, would be pained by your description of her suicide as a decision of “cold logic in its remorseless nihilism.” I don’t know whether anyone besides God knows the reality of her suicide.   Perhaps you were completely accurate in your description, through your own spiritual confirmations.  But either way, it is my hope that all of our spiritual convictions are always tempered by our most compassionate vulnerabilities when writing or reflecting about [her] or others who share struggles similar to hers.\nNow, it was never my intention to inflict pain upon anyone in writing this particular column, most particularly not upon those who have already suffered a tremendous loss.  And yet, something bothered me about the assertion that one should temper one’s spiritual convictions simply to spare the feelings of those who do not share them.  Would one temper one’s view of the gravitational force and the role it played in the death of one who jumped from a rooftop?  Especially if one was speaking with those who did not share one’s belief in gravity?\nIt was clear to me that the writer did not understand that although my friend was obviously the inspiration for the column, the piece was also addressing much more universal matters than a single human life.  From the perspective from which I write, all nihilism – and thus suicide – is rational given an atheistic worldview.  This logic contradicts the mainstream perspective, which, being a veneer of Judeo-Christian ethics without the underlying belief system, is highly irrational.  I am far from the first to point this out, however, people are more accustomed to hearing it from the likes of Nietszche, Sartre and Camus, not to mention Voltaire and Socrates, than an evangelical Christian.  And yet, I am not saying anything that has not been said before, and more eloquently, by some of humanity’s greatest minds.  Very few people are truly able to handle the inherent implications of being their own god.\nI said as much in a response to the writer, who in his response clarified that my initial take on his email had been correct.\n“I… am writing to restate my hope that you grow to gain a more heartfelt appreciation of [her] and perhaps of those who do not share your specific religious views.”\nAt first I though this was strange, as I could not see how anything I had written could possibly be construed as a lack of appreciation for my friend.  But to the faithless, the notion that an individual is responsible for his own actions is frightening, since relying only on oneself to bear the entire weight of an uncaring universe is simply more than can be faced by any except the most exceptional.  This is why Nietzsche – not one to shirk the dark – considered Christianity a coward’s path, and likely why the writer interpreted my bringing up the point as being uncompassionate.  But in what sense can it be considered compassion to leave others to drown in the dark?  I do not regret a single word I wrote; I regret only that I did not articulate them in time to share them with my friend.\nPat Buchanan and others have written of a great cultural war that is dividing America.  They are no doubt correct, but what is perhaps more ominous is that the two poles of religious faith and secular humanism have separated to the point that it is becoming very difficult to communicate effectively across the divide.  The friend of my friend also added\n“I’m not sure this dialogue will be fruitful right now…. In any case, I would like to leave off corresponding here.”\nI’m afraid his instincts are probably correct.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-01T20:48:00+00:00"
}