{
  "url": "https://voxday.net/2003/11/26/weve-got-tea/",
  "scraped_at": "2025-12-13T15:36:16.965830",
  "title": "We’ve got the tea",
  "date_display": "November 26, 2003",
  "date_iso": "2003-11-26T08:14:00+00:00",
  "date_from_url": "2003-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cal Thomas writes: <em>The time when the Republican Party stood for something worth standing for is over. The “G” in GOP might as well stand for government. Smaller, less intrusive government with less spending and lower taxes is the stuff of history books and fond memories for a party that once had a purpose. But Republicans, having tasted power, are now drunk with it. Like the Democrats before them who became inebriated with the wine of success, Republicans now seem interested only in preserving their elective offices.</em></p><p>Truly there is less than a dime’s worth of difference between the two parties…. Is it time for another revolution yet? Who’s got the tea?</p><p>The Libertarians have it, Mr. Thomas.  In shiploads.  You are either for the use of government to control individuals or you are against it.  If you are against the use of government to control individuals, instead of simply guarding their unalienable rights, you should not support the Republican party.  Yes, Republicans are better than Democrats.  So what?  Democrats are better than Communists, but that’s no reason to support them.</p></div>",
  "content_text": "Cal Thomas writes:\nThe time when the Republican Party stood for something worth standing for is over. The “G” in GOP might as well stand for government. Smaller, less intrusive government with less spending and lower taxes is the stuff of history books and fond memories for a party that once had a purpose. But Republicans, having tasted power, are now drunk with it. Like the Democrats before them who became inebriated with the wine of success, Republicans now seem interested only in preserving their elective offices.\nTruly there is less than a dime’s worth of difference between the two parties…. Is it time for another revolution yet? Who’s got the tea?\nThe Libertarians have it, Mr. Thomas.  In shiploads.  You are either for the use of government to control individuals or you are against it.  If you are against the use of government to control individuals, instead of simply guarding their unalienable rights, you should not support the Republican party.  Yes, Republicans are better than Democrats.  So what?  Democrats are better than Communists, but that’s no reason to support them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-26T08:14:00+00:00"
}