{
  "url": "https://voxday.net/2003/11/26/what-income-tax/",
  "scraped_at": "2025-12-13T15:36:20.636055",
  "title": "What income tax",
  "date_display": "November 26, 2003",
  "date_iso": "2003-11-26T09:38:00+00:00",
  "date_from_url": "2003-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Does this <a href=\"http://www.givemeliberty.org/rtplawsuit/update11-26-03.htm\">sham of a court case</a> sound anything like a government that is confident of its position before the law and Constitution?  No way.  The man was jailed for six months pre-trial for the “crime” of not withholding income tax from his employees, and the judge is not only shamelessly manipulating witnesses, but refusing to allow the jury to even look at the income tax code!  No wonder the jury smelled a rat.  I just wonder if the one hold-out from acquittal was a plant or had an IQ below 60.</p><p>Meanwhile, the corrupt IRS-federal court cabal has moved its “<a href=\"http://joebanister.blogspot.com/\">hearing</a>” of former IRS agent Joe Banister to a military installation, to which all public access is forbidden in direct contradiction of Detroit Free Press v. Ashcroft, 303 F.3d 681 (Sixth Circuit 2002).  I imagine that the IRS-FC cabal would argue that the hearing isn’t “quasi-judicial”.  And they’re correct.  It isn’t judicial at all.  I’m only surprised they’re not holding it at Guantanamo Bay.</p><p>We are quickly moving towards the point where the income tax fraud is unmasked for all to clearly see.  The IRS-FC cabal is getting increasingly desperate.  The fact that they find it hard to win even when the decks are stacked will make them even more vicious until the light of truth sweeps them away altogether.  By the way, someone with more time than me needs to create a repository of all these court transcripts for future use and reference.  When someone does so, please let me know the link.</p></div>",
  "content_text": "Does this\nsham of a court case\nsound anything like a government that is confident of its position before the law and Constitution?  No way.  The man was jailed for six months pre-trial for the “crime” of not withholding income tax from his employees, and the judge is not only shamelessly manipulating witnesses, but refusing to allow the jury to even look at the income tax code!  No wonder the jury smelled a rat.  I just wonder if the one hold-out from acquittal was a plant or had an IQ below 60.\nMeanwhile, the corrupt IRS-federal court cabal has moved its “\nhearing\n” of former IRS agent Joe Banister to a military installation, to which all public access is forbidden in direct contradiction of Detroit Free Press v. Ashcroft, 303 F.3d 681 (Sixth Circuit 2002).  I imagine that the IRS-FC cabal would argue that the hearing isn’t “quasi-judicial”.  And they’re correct.  It isn’t judicial at all.  I’m only surprised they’re not holding it at Guantanamo Bay.\nWe are quickly moving towards the point where the income tax fraud is unmasked for all to clearly see.  The IRS-FC cabal is getting increasingly desperate.  The fact that they find it hard to win even when the decks are stacked will make them even more vicious until the light of truth sweeps them away altogether.  By the way, someone with more time than me needs to create a repository of all these court transcripts for future use and reference.  When someone does so, please let me know the link.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-26T09:38:00+00:00"
}