{
  "url": "https://voxday.net/2003/11/22/who-is-more-rationa/",
  "scraped_at": "2025-12-13T15:35:50.079903",
  "title": "Who is more rational?",
  "date_display": "November 22, 2003",
  "date_iso": "2003-11-22T11:06:00+00:00",
  "date_from_url": "2003-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the question asked by atheist critic HG, who took the time to respond at length to each paragraph.  The beginning of my original paragraph is in italics, his response is quoted in full, and my subsequent reply is in bold.  I expect this should help dispell the oft-repeated accusation that my failure to respond to anyone stems from some form of cowardice.  And thanks, to HG and everyone else who took the time to compose a thoughtful and considerate response to <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35640\">The Irrational Atheist</a>.  If you happen to be interested, I expect to post at least one more response at length on this subject, but please also keep in mind that every new column generates its own little deluge of email.</p><p><em>&gt;The idea that he is a devotee of reason….</em></p><p>Lest you forget, that “so-called Age of Enlightenment” also ushered in the rediscovery of the principles of democracy upon which our country’s founders relied upon heavily. This is especially true when you realize that many of that age’s philosophers were building upon the writings of pre-cursors such as Locke and Hume.</p><p><strong>I’m not a big fan of democracy either, at least not the fetish that is its latter-day universal form.  The founders were mistrustful of it as well, which is why they hedged it about so in the Constitution.  I am a Christian Libertarian and a republican, not a democrat, a Democrat or a Republican.  Thus, this point means little to me.</strong></p><p><em>&gt;The atheist is without God….</em></p><p>As you know, the scientific process is used for studying a particular idea. It is that process which gave us modern geology, cosmology, evolution, genetic engineering, et cetera. However knowledge and faith of that process has nothing to do with the knowledge of those grand scientific theories which have been developed in the years since it was first conceived and implemented. Why does someone using the scientific method to study the principle of structural elasticity care about the latest modern theories on star formation or cosmic expansion? They don’t. They therefore require no foundation in such a theory in order for them to pursue their own scientific process. His faith in the process is therefore not undermined at all by the lack of such knowledge.</p><p><strong>HG, like most of his fellow critics, completely missed my point.  I did not attack the scientific method or the truth that is determined by repeated tests with reliable and predictable results.  Whereas a scientist will declare that of course he does not believe there are multiple universes since it is only a hypothesis designed to counter the anthropic principle, the non-elite atheist whose only exposure to science is his science fiction novels will declare that of course they exist since Dr. X said so – this is the faith in science of which I spoke.  The same holds true of evolution, the geological age of the Earth and many other untested scientific and pseudo-scientific hypotheses.  Based on my experience as well as the emails I have received, the number of atheists who fall in the latter category far exceeds the number of those who belong to the former.</strong></p><p><em>&gt;In fairness, he cannot be faulted for this….</em></p><p>The failure in perception is your own. You believe that in order to use reason or scientific process on one particular thing, a person needs to have full knowledge of all things which have been discovered or postulated from that process. There is no reason to believe that such a conclusion is warranted. I’ve highlighted one very simple example above where it isn’t warrented, of which there are a near infinite number.</p><p><strong>No, I don’t.  HG’s failure to grasp the first point led him to make a mistaken conclusion here.  It’s not that full knowledge is required with regards to a certain subject… it’s that when no knowledge except untested hypotheses exists on the subject, but the untested hypotheses are accepted as tested and proven fact by the less than fully informed, this is blind faith, not reason.  Statements that begin with “according to science”, “studies show” and “everyone knows” are strong indicators of this sort of unreasoning faith.</strong></p><p><em>&gt;The irrationality of the atheist….</em></p><p>Why should the origin of a given rule be important when its effectiveness is self evident? That “irrational reason” you highlighted above is what allows a person to see the effectiveness in such moral concepts as the Golden Rule. In fact the ubiquitousness of certain morals is derived from the fact that it is readily observable to be a stabilizer of a society. Whether that was something our ancestors inferred over thousands of years of experience or had written into stone tablets at a particular moment by a supernatural being is irrelevant to its effectiveness. The atheist seeks to adhere to the effective rules of life because they work, not because they believe some invisible entity proposed them. That doesn’t point to irrationality on their part but rational thought applied to a given principle. Irrationality would be adhering to principles which are shown time and again to be cultural artifacts and superstition.</p><p><strong>I do not agree that the effectiveness of the Gold Rule is self-evident.  History suggests otherwise.  Gandhi’s campaign depended upon the good will of India’s British overlords to succeed; Tianamen Square is one example of the limits of dependence upon the good will of tyrants.  While there are surely a few atheists who operate from the highly abstract concept of altruistic utilitarianism, the overwhelming majority of those with whom I have spoken do not.  Their morality is utterly dependent upon the theistic morality in which they have lived, one which they have never questioned.  This does not make them bad people – actually the opposite – but irrational and unreasoning nevertheless.  Their usual answer, when asked why thou shalt not kill, is something on the order of “because killing is bad”.   Remember, they, too are atheists.  Just as I willingly claim kinship who believe in the inerrant truth of the Bible without having giving the matter a moment’s thought, even the most intelligent secular scientist must acknowledge both the amoral nihilist and the mindless, godless existentialist frat boy as his atheistic brethren.</strong></p><p><em>&gt;Still, even the most admirable of atheists is nothing more than a moral parasite….</em></p><p>Speaking from a theistic perspective you draw that conclusion. Speaking from a non-theistic position the parasite is simply an assimilator. Are we parasites for absorbing the knowledge of previous generations and applying it to our present day life? Are the present day religions who based their laws on predecessor regional religions parasite religions for doing so (that includes Judaism and Christianity by the way)? The great genius of man is his capacity to learn both from other’s lessons as well as their own. The atheist’s borrowing is nothing more than implementing and living by what has been shown time and again to work. These universal rules require no divine origin as proof of usefulness because its effectiveness is readily apparent to any observer. It is therefore rational, not irrational, to try and implement them in one’s personal code of ethics.</p><p><strong>Despite any similarities, Judeo-Christian law cannot be described as being based on predecessor regional religions, as by its own lights it is based on the Word of God.  It is internally consistent and complete.  HG is also agreeing here that the atheist is borrowing and assimilating, not developing from first principles, as more abstract-oriented atheists have stated.  A decision to assimilate and borrow and behave according to the dominant ethic is certainly rational in light of the cultural norm, however, it is intellectually irrational which is precisely why the abstract atheists deny that atheists do this.  Some even go so far as to deny atheists of HG’s stripe as being atheists – I do not agree.  This notion also depends, again, on the assumption of the efficacy of the Golden Rule.  I still disagree there, too.</strong></p><p>You next highlight the fact that most people can’t be rational atheists. That is probably true. Most people don’t want to spend the time to actually study these sorts of topics, nor do they have the capacity to. Many who do have the capacity would still rather have their ethics spoon fed to them as well, since it is easier than trying to imagine how mere mortal man could have figured all this out by themselves. “Religion” however can come without trying to pray to a particular deity or set of deities. It can also come without the absolutist teachings that have historically gone along with it, as Catholics and Buddhists have started teaching the rest of the world.</p><p><strong>I was very surprised to come across this admission, considering the previous points raised.  And, as I have stated before, an argument against the rationality of atheism neither presupposes a belief in a specific religious system nor the rationality of the theist.</strong></p><p><em>&gt;This is not to say there are no atheists who are rational….</em></p><p>I’m sure you added this last part for some spice. You here are implying that all atheists are either irrational or rational sociopaths to the exclusion of all other possibilities. As a former atheist by your own admission, which were you? This sort of slight is equally reprehensible as someone assuming you’re a moron because you are a Christian. Such a slight you’ve admitted trying to stave off with your Mensa label, yet you don’t mind throwing such blanket and biased statements at other belief systems. How hypocritical on your part.</p><p><strong>Correct, although I do believe it AS A GENERALITY.  I’m an op/ed columnist with a taste for polemicist rhetoric, after all, and this is op/ed commentary, not a scholarly article.  And my regular readers know that a certain amount of discretion with regards to the degree of literalism is always necessary when reading my columns.  Is it really necessary for me to state, for the record, that I do not believe Hillary Clinton is a crocodile?  I believe that the vast majority of Western atheists are good people who irrationally, but understandably, subscribe to the morality dominant in their culture.  I believe that a small minority of atheists are rational sociopaths – unfortunately, these are the ones who seem to have the will to power.  I also believe that an even smaller minority are rational and moral – these individuals are those capable of allowing the abstract to rule the material.  They are the virtuous few of whom Socrates spoke.  They are also numerically insignificant.  As for the latter statement, what you see as being hypocrisy, I see as turnabout being fair play.  It is also very amusing to see how being labled irrational sends most atheists through the roof, as it pricks the very root of their pride.</strong></p><p>The virtuous few from whom I heard appeared to realize that I was not talking about them, with only two or three exceptions.  They tended to see the piece as humorous and reasonably fair, if handicapped by virtue of the misapprenhensions of the writer.  As to the other question, I was somewhat of a rational quasi-sociopath, who was always amused at how I would receive lectures on my “bad” behavior from atheists who subscribed to moral relativism.  “Do what thou wilt, with due regard for the policeman around the corner” was pretty much my amoral code.</p><p><em>&gt;Without God, there is only the left-hand path…. </em></p><p>As a person of faith this seems to be the only rational conclusion for you. You start with the presumption that we began with god given ethics which we are now diverging from. The “death of god” therefore marks the death of civilization. The atheist starts from the notion that man pulled himself from the wild to civilization. Since it is a much harder task to discover something as opposed to maintain or learn it, as is evident in the documented history of technology around us, there is no need to worry about the repercussions of having atheists in our society. It’s true that atheism won’t work for everybody, but what belief system does?</p><p><strong>Obviously I agree with the first statement.  I very much disagree with the latter conclusion, as it ignores both the warnings of Voltaire as well as the history of the 20th century.  Atheist anti-religious ideological movements have killed more people in less time than the worst religious inspired warfare.  Worse, such movements don’t even require war, as they typically involve the society turning on itself.  This has been the murderous French Revolutionary model which has been exported to cultures ranging from Western post-Enlightenment Germany to New World Mexico and the Eastern societies of China and Kampuchea.  Atheists often attempt to insist that the substitution of the State for God does not lie at their hands.  I don’t buy it, nor did the architects of such man-made disasters.</strong></p><p>Interestingly you pretend in the comments to this article, and in fact in one line of the article, to be noncommittal on the type of religion necessary. As a “Southern Baptist Christian fundamentalist” I doubt that you take any credence in the morals embedded in Islam, Hinduism, Buddhism or any other “ism” are any more than fanciful creation by humans.<br> <br><strong><br> <br>I’m not noncommittal, but the argument is.  A Hindu could make the very same points.  Consider that I cited three non-Christian thinkers without a single reference to the Bible or any theologian.</br></br></strong></br></br></p><p>If you believe otherwise, then I would doubt your self professed affiliation, especially the “fundamentalist” part. You therefore believe that all of the followers of all these other religions are delusional. Namely, they have deluded themselves into believing they have some sort of transcendental knowledge encapsulated in their belief system which compels them to follow their moral laws. Obviously many of those religions’ fundamentalist followers would say the same thing about Christians. You therefore have all religions claiming everyone else is delusively following their own moral codes. Ironically, the core of those moral codes have significant overlap. Therefore the religious are blindly following their individual “delusions” and still managing to keep their civilizations afloat.</p><p><strong>I don’t believe otherwise, so no problem there.  Christians don’t believe the faithful of other religions are deluded, but are instead deceived by an intelligent, supernatural army  That the deception would bear some similarities to the base moral core is not to be unexpected, indeed, the apostle Paul writes more than once in warning to be careful of the inevitable perversions of the New Testament teachings.  And since the other religions, like the irrational atheists, are working off of the fundamental moral core, it should come as no surprise that their civilizations should benefit by this.</strong></p><p>The rational atheist on the other hand observes this fact, and sees the common codes which have effectively bound the society together. They have thus “borrowed” those common elements, like any good creature capable of learning would do, and ties them into a cohesive code of ethics for themselves. If they did a half decent job of it, those codes of ethics may even get adopted by other atheists and agnostics–for no other reason than the fact that they work. Between the fundamentalists and the atheists, who is being more rational?</p><p><strong>This assumes a great deal.  Why should a rational atheist not observe the fact, and assume that he can take advantage of the weaknesses of the mythology to create a better one of his own, or simply to better realize his individual desires?  As did Voltaire, I see no reason why he could or should not.  I believe that it is precisely this reasoning that has led so many rational, godless men into destruction of one form or another, be it of themselves or others.  I am not insisting that an atheist cannot rationally come to a utilitarian moral perspective, but I don’t believe it is anywhere nearly as common or likely as most atheists would like to believe.  I expect the rational ones are far more likely to embrace nihilism, existentialism and sociopathy.  At the same time, keep in mind that far from despising the irrational atheists, they give me hope in the remnants of goodness that remain in fallen Man.</strong></p><p>Who is more rational? It is rational for the irrational atheist to behave as he does in a Judeo-Christian society, but his behavior – the virtuous few excluded – is irrational by his own logic.  The Christian’s morality is rational within the peculiar framework of the Judeo-Christian belief system, but it is utterly irrational from an outside perspective.  I am not temporizing here, I wrote the original article from the perspective that there are few, very few, who can truly say that their behavior and beliefs are entirely rational and moral.  In any case, I am not one of them.  The odds are statistically slim that you are either.</p></div>",
  "content_text": "This is the question asked by atheist critic HG, who took the time to respond at length to each paragraph.  The beginning of my original paragraph is in italics, his response is quoted in full, and my subsequent reply is in bold.  I expect this should help dispell the oft-repeated accusation that my failure to respond to anyone stems from some form of cowardice.  And thanks, to HG and everyone else who took the time to compose a thoughtful and considerate response to\nThe Irrational Atheist\n.  If you happen to be interested, I expect to post at least one more response at length on this subject, but please also keep in mind that every new column generates its own little deluge of email.\n>The idea that he is a devotee of reason….\nLest you forget, that “so-called Age of Enlightenment” also ushered in the rediscovery of the principles of democracy upon which our country’s founders relied upon heavily. This is especially true when you realize that many of that age’s philosophers were building upon the writings of pre-cursors such as Locke and Hume.\nI’m not a big fan of democracy either, at least not the fetish that is its latter-day universal form.  The founders were mistrustful of it as well, which is why they hedged it about so in the Constitution.  I am a Christian Libertarian and a republican, not a democrat, a Democrat or a Republican.  Thus, this point means little to me.\n>The atheist is without God….\nAs you know, the scientific process is used for studying a particular idea. It is that process which gave us modern geology, cosmology, evolution, genetic engineering, et cetera. However knowledge and faith of that process has nothing to do with the knowledge of those grand scientific theories which have been developed in the years since it was first conceived and implemented. Why does someone using the scientific method to study the principle of structural elasticity care about the latest modern theories on star formation or cosmic expansion? They don’t. They therefore require no foundation in such a theory in order for them to pursue their own scientific process. His faith in the process is therefore not undermined at all by the lack of such knowledge.\nHG, like most of his fellow critics, completely missed my point.  I did not attack the scientific method or the truth that is determined by repeated tests with reliable and predictable results.  Whereas a scientist will declare that of course he does not believe there are multiple universes since it is only a hypothesis designed to counter the anthropic principle, the non-elite atheist whose only exposure to science is his science fiction novels will declare that of course they exist since Dr. X said so – this is the faith in science of which I spoke.  The same holds true of evolution, the geological age of the Earth and many other untested scientific and pseudo-scientific hypotheses.  Based on my experience as well as the emails I have received, the number of atheists who fall in the latter category far exceeds the number of those who belong to the former.\n>In fairness, he cannot be faulted for this….\nThe failure in perception is your own. You believe that in order to use reason or scientific process on one particular thing, a person needs to have full knowledge of all things which have been discovered or postulated from that process. There is no reason to believe that such a conclusion is warranted. I’ve highlighted one very simple example above where it isn’t warrented, of which there are a near infinite number.\nNo, I don’t.  HG’s failure to grasp the first point led him to make a mistaken conclusion here.  It’s not that full knowledge is required with regards to a certain subject… it’s that when no knowledge except untested hypotheses exists on the subject, but the untested hypotheses are accepted as tested and proven fact by the less than fully informed, this is blind faith, not reason.  Statements that begin with “according to science”, “studies show” and “everyone knows” are strong indicators of this sort of unreasoning faith.\n>The irrationality of the atheist….\nWhy should the origin of a given rule be important when its effectiveness is self evident? That “irrational reason” you highlighted above is what allows a person to see the effectiveness in such moral concepts as the Golden Rule. In fact the ubiquitousness of certain morals is derived from the fact that it is readily observable to be a stabilizer of a society. Whether that was something our ancestors inferred over thousands of years of experience or had written into stone tablets at a particular moment by a supernatural being is irrelevant to its effectiveness. The atheist seeks to adhere to the effective rules of life because they work, not because they believe some invisible entity proposed them. That doesn’t point to irrationality on their part but rational thought applied to a given principle. Irrationality would be adhering to principles which are shown time and again to be cultural artifacts and superstition.\nI do not agree that the effectiveness of the Gold Rule is self-evident.  History suggests otherwise.  Gandhi’s campaign depended upon the good will of India’s British overlords to succeed; Tianamen Square is one example of the limits of dependence upon the good will of tyrants.  While there are surely a few atheists who operate from the highly abstract concept of altruistic utilitarianism, the overwhelming majority of those with whom I have spoken do not.  Their morality is utterly dependent upon the theistic morality in which they have lived, one which they have never questioned.  This does not make them bad people – actually the opposite – but irrational and unreasoning nevertheless.  Their usual answer, when asked why thou shalt not kill, is something on the order of “because killing is bad”.   Remember, they, too are atheists.  Just as I willingly claim kinship who believe in the inerrant truth of the Bible without having giving the matter a moment’s thought, even the most intelligent secular scientist must acknowledge both the amoral nihilist and the mindless, godless existentialist frat boy as his atheistic brethren.\n>Still, even the most admirable of atheists is nothing more than a moral parasite….\nSpeaking from a theistic perspective you draw that conclusion. Speaking from a non-theistic position the parasite is simply an assimilator. Are we parasites for absorbing the knowledge of previous generations and applying it to our present day life? Are the present day religions who based their laws on predecessor regional religions parasite religions for doing so (that includes Judaism and Christianity by the way)? The great genius of man is his capacity to learn both from other’s lessons as well as their own. The atheist’s borrowing is nothing more than implementing and living by what has been shown time and again to work. These universal rules require no divine origin as proof of usefulness because its effectiveness is readily apparent to any observer. It is therefore rational, not irrational, to try and implement them in one’s personal code of ethics.\nDespite any similarities, Judeo-Christian law cannot be described as being based on predecessor regional religions, as by its own lights it is based on the Word of God.  It is internally consistent and complete.  HG is also agreeing here that the atheist is borrowing and assimilating, not developing from first principles, as more abstract-oriented atheists have stated.  A decision to assimilate and borrow and behave according to the dominant ethic is certainly rational in light of the cultural norm, however, it is intellectually irrational which is precisely why the abstract atheists deny that atheists do this.  Some even go so far as to deny atheists of HG’s stripe as being atheists – I do not agree.  This notion also depends, again, on the assumption of the efficacy of the Golden Rule.  I still disagree there, too.\nYou next highlight the fact that most people can’t be rational atheists. That is probably true. Most people don’t want to spend the time to actually study these sorts of topics, nor do they have the capacity to. Many who do have the capacity would still rather have their ethics spoon fed to them as well, since it is easier than trying to imagine how mere mortal man could have figured all this out by themselves. “Religion” however can come without trying to pray to a particular deity or set of deities. It can also come without the absolutist teachings that have historically gone along with it, as Catholics and Buddhists have started teaching the rest of the world.\nI was very surprised to come across this admission, considering the previous points raised.  And, as I have stated before, an argument against the rationality of atheism neither presupposes a belief in a specific religious system nor the rationality of the theist.\n>This is not to say there are no atheists who are rational….\nI’m sure you added this last part for some spice. You here are implying that all atheists are either irrational or rational sociopaths to the exclusion of all other possibilities. As a former atheist by your own admission, which were you? This sort of slight is equally reprehensible as someone assuming you’re a moron because you are a Christian. Such a slight you’ve admitted trying to stave off with your Mensa label, yet you don’t mind throwing such blanket and biased statements at other belief systems. How hypocritical on your part.\nCorrect, although I do believe it AS A GENERALITY.  I’m an op/ed columnist with a taste for polemicist rhetoric, after all, and this is op/ed commentary, not a scholarly article.  And my regular readers know that a certain amount of discretion with regards to the degree of literalism is always necessary when reading my columns.  Is it really necessary for me to state, for the record, that I do not believe Hillary Clinton is a crocodile?  I believe that the vast majority of Western atheists are good people who irrationally, but understandably, subscribe to the morality dominant in their culture.  I believe that a small minority of atheists are rational sociopaths – unfortunately, these are the ones who seem to have the will to power.  I also believe that an even smaller minority are rational and moral – these individuals are those capable of allowing the abstract to rule the material.  They are the virtuous few of whom Socrates spoke.  They are also numerically insignificant.  As for the latter statement, what you see as being hypocrisy, I see as turnabout being fair play.  It is also very amusing to see how being labled irrational sends most atheists through the roof, as it pricks the very root of their pride.\nThe virtuous few from whom I heard appeared to realize that I was not talking about them, with only two or three exceptions.  They tended to see the piece as humorous and reasonably fair, if handicapped by virtue of the misapprenhensions of the writer.  As to the other question, I was somewhat of a rational quasi-sociopath, who was always amused at how I would receive lectures on my “bad” behavior from atheists who subscribed to moral relativism.  “Do what thou wilt, with due regard for the policeman around the corner” was pretty much my amoral code.\n>Without God, there is only the left-hand path….\nAs a person of faith this seems to be the only rational conclusion for you. You start with the presumption that we began with god given ethics which we are now diverging from. The “death of god” therefore marks the death of civilization. The atheist starts from the notion that man pulled himself from the wild to civilization. Since it is a much harder task to discover something as opposed to maintain or learn it, as is evident in the documented history of technology around us, there is no need to worry about the repercussions of having atheists in our society. It’s true that atheism won’t work for everybody, but what belief system does?\nObviously I agree with the first statement.  I very much disagree with the latter conclusion, as it ignores both the warnings of Voltaire as well as the history of the 20th century.  Atheist anti-religious ideological movements have killed more people in less time than the worst religious inspired warfare.  Worse, such movements don’t even require war, as they typically involve the society turning on itself.  This has been the murderous French Revolutionary model which has been exported to cultures ranging from Western post-Enlightenment Germany to New World Mexico and the Eastern societies of China and Kampuchea.  Atheists often attempt to insist that the substitution of the State for God does not lie at their hands.  I don’t buy it, nor did the architects of such man-made disasters.\nInterestingly you pretend in the comments to this article, and in fact in one line of the article, to be noncommittal on the type of religion necessary. As a “Southern Baptist Christian fundamentalist” I doubt that you take any credence in the morals embedded in Islam, Hinduism, Buddhism or any other “ism” are any more than fanciful creation by humans.\nI’m not noncommittal, but the argument is.  A Hindu could make the very same points.  Consider that I cited three non-Christian thinkers without a single reference to the Bible or any theologian.\nIf you believe otherwise, then I would doubt your self professed affiliation, especially the “fundamentalist” part. You therefore believe that all of the followers of all these other religions are delusional. Namely, they have deluded themselves into believing they have some sort of transcendental knowledge encapsulated in their belief system which compels them to follow their moral laws. Obviously many of those religions’ fundamentalist followers would say the same thing about Christians. You therefore have all religions claiming everyone else is delusively following their own moral codes. Ironically, the core of those moral codes have significant overlap. Therefore the religious are blindly following their individual “delusions” and still managing to keep their civilizations afloat.\nI don’t believe otherwise, so no problem there.  Christians don’t believe the faithful of other religions are deluded, but are instead deceived by an intelligent, supernatural army  That the deception would bear some similarities to the base moral core is not to be unexpected, indeed, the apostle Paul writes more than once in warning to be careful of the inevitable perversions of the New Testament teachings.  And since the other religions, like the irrational atheists, are working off of the fundamental moral core, it should come as no surprise that their civilizations should benefit by this.\nThe rational atheist on the other hand observes this fact, and sees the common codes which have effectively bound the society together. They have thus “borrowed” those common elements, like any good creature capable of learning would do, and ties them into a cohesive code of ethics for themselves. If they did a half decent job of it, those codes of ethics may even get adopted by other atheists and agnostics–for no other reason than the fact that they work. Between the fundamentalists and the atheists, who is being more rational?\nThis assumes a great deal.  Why should a rational atheist not observe the fact, and assume that he can take advantage of the weaknesses of the mythology to create a better one of his own, or simply to better realize his individual desires?  As did Voltaire, I see no reason why he could or should not.  I believe that it is precisely this reasoning that has led so many rational, godless men into destruction of one form or another, be it of themselves or others.  I am not insisting that an atheist cannot rationally come to a utilitarian moral perspective, but I don’t believe it is anywhere nearly as common or likely as most atheists would like to believe.  I expect the rational ones are far more likely to embrace nihilism, existentialism and sociopathy.  At the same time, keep in mind that far from despising the irrational atheists, they give me hope in the remnants of goodness that remain in fallen Man.\nWho is more rational? It is rational for the irrational atheist to behave as he does in a Judeo-Christian society, but his behavior – the virtuous few excluded – is irrational by his own logic.  The Christian’s morality is rational within the peculiar framework of the Judeo-Christian belief system, but it is utterly irrational from an outside perspective.  I am not temporizing here, I wrote the original article from the perspective that there are few, very few, who can truly say that their behavior and beliefs are entirely rational and moral.  In any case, I am not one of them.  The odds are statistically slim that you are either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-22T11:06:00+00:00"
}