{
  "url": "https://voxday.net/2003/11/19/will-you-take-this-sheep/",
  "scraped_at": "2025-12-13T15:35:27.320249",
  "title": "Will you take this sheep…",
  "date_display": "November 19, 2003",
  "date_iso": "2003-11-19T15:52:00+00:00",
  "date_from_url": "2003-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d personally prefer to see the Christian churches separate marriage before God from marriage before the State.  But, given the realities of American politics, <em>Goodridge</em> has now shown why the Defense of Marriage Amendment is both necessary and inevitable.  Still, conservatives should take note: <em>Goodridge</em> and gay marriage are the direct result of attempting to use state power for conservative and traditional ends.  It’s the old good king/bad king problem.  Investing power in the crown ensures that it will one day be worn by a man of evil intent.</p><p>Let them have their state marriages.  Let men marry men, women marry golden retrievers and whatever other combinations those of diverse inclinations will be pushing next.  In any case, the Church must break off its collusion with the State, which, in my opinion, is a desirable thing anyhow.</p><p>And by the way, congratulations, George Bush. <em>Goodridge</em> just assured his re-election.  Hillary can’t run now, as gay marriage and DOMA just became a major campaign issue, and anyone opposing DOMA will get slaughtered.</p></div>",
  "content_text": "I’d personally prefer to see the Christian churches separate marriage before God from marriage before the State.  But, given the realities of American politics,\nGoodridge\nhas now shown why the Defense of Marriage Amendment is both necessary and inevitable.  Still, conservatives should take note:\nGoodridge\nand gay marriage are the direct result of attempting to use state power for conservative and traditional ends.  It’s the old good king/bad king problem.  Investing power in the crown ensures that it will one day be worn by a man of evil intent.\nLet them have their state marriages.  Let men marry men, women marry golden retrievers and whatever other combinations those of diverse inclinations will be pushing next.  In any case, the Church must break off its collusion with the State, which, in my opinion, is a desirable thing anyhow.\nAnd by the way, congratulations, George Bush.\nGoodridge\njust assured his re-election.  Hillary can’t run now, as gay marriage and DOMA just became a major campaign issue, and anyone opposing DOMA will get slaughtered.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-19T15:52:00+00:00"
}