{
  "url": "https://voxday.net/2003/11/22/yes-i-can-te/",
  "scraped_at": "2025-12-13T15:35:51.932445",
  "title": "Yes, I can tell",
  "date_display": "November 22, 2003",
  "date_iso": "2003-11-22T20:29:00+00:00",
  "date_from_url": "2003-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JH writes: <em>I know next to nothing about Voltaire and Diderot, and less about the French Revolution; none have any bearing on how I arrive at my particular philosophical viewpoint. I suffer little time to argue about the historical atrocities of atheists versus theists. Adolf Hitler, by the way, was neither an Episcopalian nor an atheist. He was baptized as a Roman Catholic, served as an altar boy, and was confirmed as a soldier in Christ. He claimed to be doing the Lords work by killing Jews. He never left the Church, and the Church never left him. If there was ever a case for excommunication, it was Hitler, yet it never happened, not even posthumously. Id love to hear that doddering old man in Rome explain that one.</em></p><p>He doesn’t know very much about Hitler and National Socialism either.  A few quotes from the unlamented architects of the Holocaust:</p><p>“The Jew who fraudulently introduced Christianity to the ancient world-in order to ruin it-reopened the same breach in modern times, this time taking as his pretext the social question.  It’s the same sleight of hand as before.  Just as Saul has changed into St. Paul, Mordechai became Karl Marx.”  – Adolf Hitler</p><p>Christianity was “the heaviest blow that ever struck humanity” and “introduced the deliberate lie of religion into the world”. – Adolf Hitler</p><p>“In the same way, any doctrine which is anti-Communist, any doctrine which is anti-Christian must <em>ipso facto</em>, be anti-Jewish as well.  The National Socialist doctrine is therefore anti-Jewish <em>in excelsis</em>, for it is both anti-Communist and anti-Christian.” – Martin Bormann</p><p>I don’t suppose it’s possible that given these statements, one might conclude that these gentlemen had fallen away – just a bit – from their youthful Christian upbringings, do you?  And at what age was it, exactly, that you had your irreligious awakening?<br/></p></div>",
  "content_text": "JH writes:\nI know next to nothing about Voltaire and Diderot, and less about the French Revolution; none have any bearing on how I arrive at my particular philosophical viewpoint. I suffer little time to argue about the historical atrocities of atheists versus theists. Adolf Hitler, by the way, was neither an Episcopalian nor an atheist. He was baptized as a Roman Catholic, served as an altar boy, and was confirmed as a soldier in Christ. He claimed to be doing the Lords work by killing Jews. He never left the Church, and the Church never left him. If there was ever a case for excommunication, it was Hitler, yet it never happened, not even posthumously. Id love to hear that doddering old man in Rome explain that one.\nHe doesn’t know very much about Hitler and National Socialism either.  A few quotes from the unlamented architects of the Holocaust:\n“The Jew who fraudulently introduced Christianity to the ancient world-in order to ruin it-reopened the same breach in modern times, this time taking as his pretext the social question.  It’s the same sleight of hand as before.  Just as Saul has changed into St. Paul, Mordechai became Karl Marx.”  – Adolf Hitler\nChristianity was “the heaviest blow that ever struck humanity” and “introduced the deliberate lie of religion into the world”. – Adolf Hitler\n“In the same way, any doctrine which is anti-Communist, any doctrine which is anti-Christian must\nipso facto\n, be anti-Jewish as well.  The National Socialist doctrine is therefore anti-Jewish\nin excelsis\n, for it is both anti-Communist and anti-Christian.” – Martin Bormann\nI don’t suppose it’s possible that given these statements, one might conclude that these gentlemen had fallen away – just a bit – from their youthful Christian upbringings, do you?  And at what age was it, exactly, that you had your irreligious awakening?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-22T20:29:00+00:00"
}