{
  "url": "https://voxday.net/2003/11/13/yes-i-love-black-man/",
  "scraped_at": "2025-12-13T15:34:33.365462",
  "title": "Yes, I love a black man",
  "date_display": "November 13, 2003",
  "date_iso": "2003-11-13T16:31:00+00:00",
  "date_from_url": "2003-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daunte Culpepper is the best QB the Vikings have had since Fran Tarkenton.  By the time he is done, he may well have done what our much-loved Georgia Peach couldn’t do, which is lead the Mighty Purple to a Super Bowl victory.  How anyone can <a href=\"http://www.startribune.com/stories/1712/4209373.html\">blame a quarterback</a> with a 107.1 rating, 15 TDs, 3 INTs for three straight losses in which the defense leaked like an upwardly mobile Pentagon staffer is completely beyond me.</p><p>By the way, Howard Dean and the rest of the Southern-hating crew running for president might want to note that these idiot racists hail from one of the most liberal states in the country – and about as far North as it gets.</p><p>It’s insane.  Donavan McNabb throws for 1 TD and barely more than a hundred yards while the Philly D stones the opposition, and he gets the credit.  Daunte throws for 370 yards and 4 TDs while the defense gives up 42 points to a lousy Chargers team, and he gets the blame.  Do these guys actually watch football?</p></div>",
  "content_text": "Daunte Culpepper is the best QB the Vikings have had since Fran Tarkenton.  By the time he is done, he may well have done what our much-loved Georgia Peach couldn’t do, which is lead the Mighty Purple to a Super Bowl victory.  How anyone can\nblame a quarterback\nwith a 107.1 rating, 15 TDs, 3 INTs for three straight losses in which the defense leaked like an upwardly mobile Pentagon staffer is completely beyond me.\nBy the way, Howard Dean and the rest of the Southern-hating crew running for president might want to note that these idiot racists hail from one of the most liberal states in the country – and about as far North as it gets.\nIt’s insane.  Donavan McNabb throws for 1 TD and barely more than a hundred yards while the Philly D stones the opposition, and he gets the credit.  Daunte throws for 370 yards and 4 TDs while the defense gives up 42 points to a lousy Chargers team, and he gets the blame.  Do these guys actually watch football?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-13T16:31:00+00:00"
}