{
  "url": "https://voxday.net/2003/11/15/yes-eu-is-antisemitic/",
  "scraped_at": "2025-12-13T15:34:47.289534",
  "title": "Yes, the EU is antisemitic",
  "date_display": "November 15, 2003",
  "date_iso": "2003-11-15T14:40:00+00:00",
  "date_from_url": "2003-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of course, the short-sighted lunatics at the Anti-Defamation League are more concerned about a Mel Gibson movie which is NOT antisemitic than the <em>judenhassen</em> of the second richest and third most powerful government in the world.  Ealier today, I happened to glance at a friend’s copy of the latest Panorama, one of the leading Italian cultural magazines, which featured an editorial titled “Si, l’Europa e’ antisemita”.</p><p>These are the children of the original Jew-haters, and they are building a new fascist empire on the ashes of the old.  And yet, even America’s Jews don’t seem to think its worth worrying about.  I used to wonder how on Earth it was possible that so many Jews didn’t leave Germany when the writing was quite clearly on the wall long before 1941 marked the inauguration of the Final Solution.  Now, I begin to understand.</p><p>For those who think that it can’t happen here – or in this particular case, there again – remember that <em>it is always happening somewhere!</em></p></div>",
  "content_text": "Of course, the short-sighted lunatics at the Anti-Defamation League are more concerned about a Mel Gibson movie which is NOT antisemitic than the\njudenhassen\nof the second richest and third most powerful government in the world.  Ealier today, I happened to glance at a friend’s copy of the latest Panorama, one of the leading Italian cultural magazines, which featured an editorial titled “Si, l’Europa e’ antisemita”.\nThese are the children of the original Jew-haters, and they are building a new fascist empire on the ashes of the old.  And yet, even America’s Jews don’t seem to think its worth worrying about.  I used to wonder how on Earth it was possible that so many Jews didn’t leave Germany when the writing was quite clearly on the wall long before 1941 marked the inauguration of the Final Solution.  Now, I begin to understand.\nFor those who think that it can’t happen here – or in this particular case, there again – remember that\nit is always happening somewhere!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-11-15T14:40:00+00:00"
}