{
  "url": "https://voxday.net/2021/10/31/an-empire-in-decline/",
  "scraped_at": "2026-01-08T12:57:23.914352",
  "title": "An Empire in Decline",
  "date_display": "October 31, 2021",
  "date_iso": "2021-10-31T16:05:29+00:00",
  "date_from_url": "2021-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It might seem a little strange that the Chinese media is still discussing the English empire in terms of decline, given that everyone recognizes the empire “on which the sun never sets” is no more. Except it is apparent that in doing so, they are actually referring <a href=\"https://sputniknews.com/20211030/us-media-acknowledges-ugly-reality-that-america-could-lose-war-with-china-over-taiwan-1090349874.html\">to the declining imperial USA</a>, as the Russian media clearly understands.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The United States must come to terms with the reality that it no longer enjoys “military primacy” in the Western Pacific, and confront the “ugly” reality that it may lose a military conflict with China over Taiwan, Graham Allison, professor of government at the Harvard Kennedy School, has warned.</p><p>In a piece for <em>The National Interest, </em>Allison pointed to recent analyses on the possibility of war over Taiwan by a number of senior current and former officials, including ex-Vice Joint Chiefs Chairman James Winnefeld and former-CIA Director Michael Morell, who recently concluded that the Chinese military could deliver a fait accompli on Taiwan before Washington even mustered its forces.</p><p>Col. Bob Work, former deputy secretary of defence under Barack Obama and Joe Biden, has expressed even greater pessimism, stating publicly (Allison’s paraphrasing) that “in the most realistic war games the Pentagon has been able to design simulating war over Taiwan, the score is eighteen to zero. And the eighteen is not Team USA.”</p><p>The reasons for this are twofold, according to Allison. The first, as former Secretary of Defence Jim Mattis said in his 2018 National Defence Strategy, is that the US no longer enjoys its post-Cold War “dominant superiority in every operating domain,” including the ability to “generally deploy our forces when we wanted, assemble them where we wanted, and operate how we wanted. Today, every domain is contested – air, land, sea, space and cyberspace.”</p><p>The second, Allison notes, relates to China’s radical advances in its anti-access/area-denial (A2/AD) capabilities – consisting of everything from anti-ship and anti-air missile systems to long range ballistic and cruise missiles, electronic warfare and interceptor aircraft.</p></blockquote><p>This loss of global imperial hegemony is actually good for Americans, as the rise of the nationalist regional powers increases the chances that Americans will finally begin to recognize that their democracy is a fraud, they no longer rule themselves, and they have not done so for some time now.</p><p>One need not be a particular fan of China, Russia, or Iran to observe that their rise is detrimental to America’s enemies.</p><p><em><a href=\"https://social.infogalactic.com/micropost/019e7a34-f951-41ff-8e50-ed8a5f241376\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It might seem a little strange that the Chinese media is still discussing the English empire in terms of decline, given that everyone recognizes the empire “on which the sun never sets” is no more. Except it is apparent that in doing so, they are actually referring\nto the declining imperial USA\n, as the Russian media clearly understands.\nThe United States must come to terms with the reality that it no longer enjoys “military primacy” in the Western Pacific, and confront the “ugly” reality that it may lose a military conflict with China over Taiwan, Graham Allison, professor of government at the Harvard Kennedy School, has warned.\nIn a piece for\nThe National Interest,\nAllison pointed to recent analyses on the possibility of war over Taiwan by a number of senior current and former officials, including ex-Vice Joint Chiefs Chairman James Winnefeld and former-CIA Director Michael Morell, who recently concluded that the Chinese military could deliver a fait accompli on Taiwan before Washington even mustered its forces.\nCol. Bob Work, former deputy secretary of defence under Barack Obama and Joe Biden, has expressed even greater pessimism, stating publicly (Allison’s paraphrasing) that “in the most realistic war games the Pentagon has been able to design simulating war over Taiwan, the score is eighteen to zero. And the eighteen is not Team USA.”\nThe reasons for this are twofold, according to Allison. The first, as former Secretary of Defence Jim Mattis said in his 2018 National Defence Strategy, is that the US no longer enjoys its post-Cold War “dominant superiority in every operating domain,” including the ability to “generally deploy our forces when we wanted, assemble them where we wanted, and operate how we wanted. Today, every domain is contested – air, land, sea, space and cyberspace.”\nThe second, Allison notes, relates to China’s radical advances in its anti-access/area-denial (A2/AD) capabilities – consisting of everything from anti-ship and anti-air missile systems to long range ballistic and cruise missiles, electronic warfare and interceptor aircraft.\nThis loss of global imperial hegemony is actually good for Americans, as the rise of the nationalist regional powers increases the chances that Americans will finally begin to recognize that their democracy is a fraud, they no longer rule themselves, and they have not done so for some time now.\nOne need not be a particular fan of China, Russia, or Iran to observe that their rise is detrimental to America’s enemies.\nDISCUSS ON SG",
  "tags": [
    "China",
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-31T16:17:52+00:00"
}