{
  "url": "https://voxday.net/2021/10/24/be-vigilant/",
  "scraped_at": "2026-01-08T12:56:37.668432",
  "title": "Be Vigilant",
  "date_display": "October 24, 2021",
  "date_iso": "2021-10-24T11:10:17+00:00",
  "date_from_url": "2021-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not a priest. I’m not a theologian. I have no secret knowledge of whatever dark and esoteric science was involved in developing the vaxxes. But, for whatever reason, I do possess sufficient spiritual discernment to know that <a href=\"https://www.expandingawarenessrelations.com/are-the-vaccines-affecting-our-spirituality-there-may-be-more-to-it-than-we-think/\">the vaxx is something to be rejected</a> and avoided at literally all costs. And I am very far from alone in this regard.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A well-respected Priest-monk who perform exorcisms, once told me what a demon said to him. The demon said to him, “How are you Christians fearful of death? I have seduced and deceived you into taking the vaccine with the fear of death!” A demon again confesses that the vaccines are his doing. In fact, he says, “We did a ceremony at a Lodge in America for the vaccines.”</p><p>See what the demon confesses! The demon continues: “What did you fear? For you (Christians), death does not exist.” For Christians, death does not exist. Do you understand, fellow brothers and sisters, where we’ve come to?</p><p>In the Gospels, Christ said something correlating with our present situation. When He entered Jerusalem and the children were calling out, “Hosana! Blessed is He who comes in the name of the Lord!” The children were proclaiming Jesus as the awaited Messiah. And others who were indignant were saying to Jesus, “Are you hearing what they are saying to you?” Christ responds, “I tell you that if these should hold their peace, the stones would immediately cry out.”</p><p>So correlating with today’s situation, now that the Priest and Archpriest are not proclaiming that death has been conquered, the demons are proclaiming it instead: “How are you Christians fearful of death? And are all running to take this vaccine?”</p><p>Which isn’t really a vaccine, but rather a gene therapy/technology, with the aim of oppressing humans. This is the aim, which is why there will be more dosages. In fact, there are many people who say there will be 7 dosages. The demons also state that there will be 7 dosages.</p><p>Those who were deceived into taking the first or second dosage, hopefully, will not take the remaining dosages. May they repent, weep and go to confession, because their salvation is in danger. We all ought to be vigilant of this.</p></blockquote><p>And while I am as skeptical as any atheist about those whose demono-calvinism interprets every unfortunate or unpleasant event as being the result of evil intervention in their lives – you know what I mean, the sort of individual who requests an exorcism because “I feel a little blue today” and believes the Lego brick he stepped on the night before was personally placed there by the Prince of Hell – there is a very strong stench of sulfur about literally everything related to both Covid and the vaxxes.</p><p>In fact, it would not surprise me in the least if the ritual that is suspected to have taken place at Davos, Switzerland in the second week of October, 2020 marked the official launch of what appears to be a literally infernal campaign.</p><p>For the non-believer, there are no shortage of logical, medical, and scientific reasons to reject the vaxxes. The case against them is very far from merely spiritual. But the spiritual aspects that many discerning individuals have detected are a reason for pureblood Christians be particularly vigilant, especially in light of <a href=\"https://www.youtube.com/watch?v=KDRKmNf3rT0\" rel=\"noreferrer noopener\" target=\"_blank\">the predictive programming</a> now being broadcast to the public.</p><p>What does “be vigilant” mean in this context? It means checking what is in every shot and substance being administered to you or to your children in a medical situation. It means keeping your children out of the public schools. It means talking to your kids who are in college, to make sure they are ready for the social and administrative pressure that will be applied to them. It means accepting, in advance, that you won’t be participating in that public event, taking that vacation, or visiting those family members.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5bf4fae4-ba55-433a-880a-e155610c9d11\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m not a priest. I’m not a theologian. I have no secret knowledge of whatever dark and esoteric science was involved in developing the vaxxes. But, for whatever reason, I do possess sufficient spiritual discernment to know that\nthe vaxx is something to be rejected\nand avoided at literally all costs. And I am very far from alone in this regard.\nA well-respected Priest-monk who perform exorcisms, once told me what a demon said to him. The demon said to him, “How are you Christians fearful of death? I have seduced and deceived you into taking the vaccine with the fear of death!” A demon again confesses that the vaccines are his doing. In fact, he says, “We did a ceremony at a Lodge in America for the vaccines.”\nSee what the demon confesses! The demon continues: “What did you fear? For you (Christians), death does not exist.” For Christians, death does not exist. Do you understand, fellow brothers and sisters, where we’ve come to?\nIn the Gospels, Christ said something correlating with our present situation. When He entered Jerusalem and the children were calling out, “Hosana! Blessed is He who comes in the name of the Lord!” The children were proclaiming Jesus as the awaited Messiah. And others who were indignant were saying to Jesus, “Are you hearing what they are saying to you?” Christ responds, “I tell you that if these should hold their peace, the stones would immediately cry out.”\nSo correlating with today’s situation, now that the Priest and Archpriest are not proclaiming that death has been conquered, the demons are proclaiming it instead: “How are you Christians fearful of death? And are all running to take this vaccine?”\nWhich isn’t really a vaccine, but rather a gene therapy/technology, with the aim of oppressing humans. This is the aim, which is why there will be more dosages. In fact, there are many people who say there will be 7 dosages. The demons also state that there will be 7 dosages.\nThose who were deceived into taking the first or second dosage, hopefully, will not take the remaining dosages. May they repent, weep and go to confession, because their salvation is in danger. We all ought to be vigilant of this.\nAnd while I am as skeptical as any atheist about those whose demono-calvinism interprets every unfortunate or unpleasant event as being the result of evil intervention in their lives – you know what I mean, the sort of individual who requests an exorcism because “I feel a little blue today” and believes the Lego brick he stepped on the night before was personally placed there by the Prince of Hell – there is a very strong stench of sulfur about literally everything related to both Covid and the vaxxes.\nIn fact, it would not surprise me in the least if the ritual that is suspected to have taken place at Davos, Switzerland in the second week of October, 2020 marked the official launch of what appears to be a literally infernal campaign.\nFor the non-believer, there are no shortage of logical, medical, and scientific reasons to reject the vaxxes. The case against them is very far from merely spiritual. But the spiritual aspects that many discerning individuals have detected are a reason for pureblood Christians be particularly vigilant, especially in light of\nthe predictive programming\nnow being broadcast to the public.\nWhat does “be vigilant” mean in this context? It means checking what is in every shot and substance being administered to you or to your children in a medical situation. It means keeping your children out of the public schools. It means talking to your kids who are in college, to make sure they are ready for the social and administrative pressure that will be applied to them. It means accepting, in advance, that you won’t be participating in that public event, taking that vacation, or visiting those family members.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-24T11:28:29+00:00"
}