{
  "url": "https://voxday.net/2021/10/18/china-refuses-to-flex/",
  "scraped_at": "2026-01-08T12:55:59.597745",
  "title": "China Refuses to Flex",
  "date_display": "October 18, 2021",
  "date_iso": "2021-10-18T12:00:00+00:00",
  "date_from_url": "2021-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Global Times <a href=\"https://www.globaltimes.cn/page/202110/1236541.shtml\">won’t even admit the existenc</a>e of the hypersonic orbital glider that has been widely reported across the West:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The <em>Financial Times</em> (FT) quoted on Saturday several sources saying that “the Chinese military launched a rocket that carried a hypersonic glide vehicle” in August and judged it to be a “nuclear-capable hypersonic missile.” According to the FT article, the missile “flew through low-orbit space” and could help China “negate” US missile defense systems which are designed to target the fixed parabolic trajectory of a ballistic missile. The progress of the Chinese military has “caught US intelligence by surprise,” the report said.</p><p>The US generally has the ability to monitor global missile launches. If the FT report is to be believed, it means that there is a key new member in China’s nuclear deterrence system, which is a new blow to the US’ mentality of strategic superiority over China. According to the FT, the China Academy of Launch Vehicle Technology announced the 77th and 79th launches of the Long March 2C rocket, but there was no announcement of a 78th launch. The report believes the 78th “secret launch” may be to test the above-mentioned hypersonic missile.</p><p>The FT also reported that China has tested a new space capability with a hypersonic missile, citing sources. It said the missile missed its target by about more than 30 kilometers, yet the test showed that “China had made astounding progress on hypersonic weapons.” But if Chinese authorities do not voluntarily release such top defense secrets, others can only speculate based on technical monitoring methods.</p><p>It is meaningless to discuss the credibility of the FT report. But it is important to note the unstoppable trend that China is narrowing the gap with the US in some key military technologies as China is continuously developing its economic and technological strength. China doesn’t need to engage in an “arms race” with the US – it is capable of weakening the US’ overall advantages over China by developing military power at its own pace.</p></blockquote><p>China appears to be attempting to reassure the world that despite its weapons development program, its ambitions are toward regional, rather than global, dominance. I tend to believe them, simply because for over two thousand years, they have been considerably more sinned against than sinning with regards to foreign intervention. According to Lee Kuan Yew, even their invasion of Vietnam was limited to containing “the Prussians of Southeast Asia” and dissuading the Vietnamese from expanding their field of operations beyond their occupation of Cambodia.</p><p>Of course, that’s the problem with imperialism. In order to be left alone, a nation has to develop sufficient strength to impose its will upon its neighbors. The question, then, is if that nation can simultaneously develop sufficient moral strength to resist the imperialist temptation.</p><p>One has to admire the dry restraint of the Chinese foreign ministry. It’s all about space tourism, you see.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Speaking during a regular press briefing on Monday, Chinese foreign ministry spokesman Zhao Lijian was asked to comment on a report from the <em>Financial Times</em> that Beijing had conducted a hypersonic missile test in August, which had shocked US intelligence. The spokesman stated that China had undertaken “routine spacecraft test” to evaluate the rocket’s reusable technology. “This is of great significance for reducing the cost of the spacecraft. The peaceful use of space provides a convenient and inexpensive way to travel,” Zhao added.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/b7552fe2-bbeb-493c-85bd-af7588c79428\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Global Times\nwon’t even admit the existenc\ne of the hypersonic orbital glider that has been widely reported across the West:\nThe\nFinancial Times\n(FT) quoted on Saturday several sources saying that “the Chinese military launched a rocket that carried a hypersonic glide vehicle” in August and judged it to be a “nuclear-capable hypersonic missile.” According to the FT article, the missile “flew through low-orbit space” and could help China “negate” US missile defense systems which are designed to target the fixed parabolic trajectory of a ballistic missile. The progress of the Chinese military has “caught US intelligence by surprise,” the report said.\nThe US generally has the ability to monitor global missile launches. If the FT report is to be believed, it means that there is a key new member in China’s nuclear deterrence system, which is a new blow to the US’ mentality of strategic superiority over China. According to the FT, the China Academy of Launch Vehicle Technology announced the 77th and 79th launches of the Long March 2C rocket, but there was no announcement of a 78th launch. The report believes the 78th “secret launch” may be to test the above-mentioned hypersonic missile.\nThe FT also reported that China has tested a new space capability with a hypersonic missile, citing sources. It said the missile missed its target by about more than 30 kilometers, yet the test showed that “China had made astounding progress on hypersonic weapons.” But if Chinese authorities do not voluntarily release such top defense secrets, others can only speculate based on technical monitoring methods.\nIt is meaningless to discuss the credibility of the FT report. But it is important to note the unstoppable trend that China is narrowing the gap with the US in some key military technologies as China is continuously developing its economic and technological strength. China doesn’t need to engage in an “arms race” with the US – it is capable of weakening the US’ overall advantages over China by developing military power at its own pace.\nChina appears to be attempting to reassure the world that despite its weapons development program, its ambitions are toward regional, rather than global, dominance. I tend to believe them, simply because for over two thousand years, they have been considerably more sinned against than sinning with regards to foreign intervention. According to Lee Kuan Yew, even their invasion of Vietnam was limited to containing “the Prussians of Southeast Asia” and dissuading the Vietnamese from expanding their field of operations beyond their occupation of Cambodia.\nOf course, that’s the problem with imperialism. In order to be left alone, a nation has to develop sufficient strength to impose its will upon its neighbors. The question, then, is if that nation can simultaneously develop sufficient moral strength to resist the imperialist temptation.\nOne has to admire the dry restraint of the Chinese foreign ministry. It’s all about space tourism, you see.\nSpeaking during a regular press briefing on Monday, Chinese foreign ministry spokesman Zhao Lijian was asked to comment on a report from the\nFinancial Times\nthat Beijing had conducted a hypersonic missile test in August, which had shocked US intelligence. The spokesman stated that China had undertaken “routine spacecraft test” to evaluate the rocket’s reusable technology. “This is of great significance for reducing the cost of the spacecraft. The peaceful use of space provides a convenient and inexpensive way to travel,” Zhao added.\nDISCUSS ON SG",
  "tags": [
    "China",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-18T12:39:28+00:00"
}