{
  "url": "https://voxday.net/2021/10/26/china-bets-on-surrender/",
  "scraped_at": "2026-01-08T12:56:53.463847",
  "title": "China Bets on Surrender",
  "date_display": "October 26, 2021",
  "date_iso": "2021-10-26T18:49:00+00:00",
  "date_from_url": "2021-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that the USA’s “strategic ambiguity” is no more, China is openly putting <a href=\"https://www.globaltimes.cn/page/202110/1237357.shtml\">pressure on the Taiwanese leadership</a> to prepare for a quick surrender:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Tsai Ing-wen authority has said that the island will defend itself “to the very last day” if the Chinese mainland attacks. Most people know they are bluffing. A recent <em>Wall Street Journal</em> report quoted several experts as assessing that Taiwan’s military has “poor preparation and low morale”. Also, “adult men in Taiwan don’t actually want to fight”. The article doubted the island would stand much chance against China’s People’s Liberation Army. The report also advised that the Taiwan military could become far more effective by training with the US.</p><p>How could it be possible to boost the low morale of the Taiwan military by training with the US army? In 2003, I asked a former soldier in Taiwan “whether the island is able to defend itself if a war breaks out?” He made it very clear that the answer is “no”. I then asked him how long he thinks the island could hold, he answered that, “Maybe dozens of hours.” That was a long time ago. Today, the military capability comparison between the Chinese mainland and the island of Taiwan is completely different from that of 18 years ago.</p><p>From my point of view, first of all, the mainland doesn’t want to fight a war. It has the will to safeguard peace and take war as the last resort. Second, the Democratic Progressive Party authorities dare not fight. They are making bluffs, but they know very well that the island’s military forces are weak. They cannot withstand even a single blow. If there is a war, Taiwan will be surely defeated and collapse….</p><p>My prediction is that a war in the Taiwan Straits may eventually be avoided. That is when the strong military pressure of the mainland bows down the will of pro-independence forces in Taiwan island. The situation is changing. The goodwill and patience of the mainland is not to be consumed by DPP authorities endlessly. If the Taiwan question escalates so that it can only be solved through military means, the sudden surrender of Taiwan authorities who dare not fight is within everyone’s expectation.</p></blockquote><p>That’s my expectation as well. As the rule of lies has made it ever more clear that nothing that comes out of the mouths of the rulers of the West should be trusted, more and more people around the world are grasping that what we perceived to be reality in the past was never anything more than an illusion meant to cause us to defeat ourselves through fear.</p><p>At this point, the only thing protecting Taiwan island is the mainland’s desire to avoid harming the population and the techno-industrial infrastructure.</p><p><em><a href=\"https://social.infogalactic.com/micropost/00ecad52-b57d-49a4-82ee-1a7132f877df\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now that the USA’s “strategic ambiguity” is no more, China is openly putting\npressure on the Taiwanese leadership\nto prepare for a quick surrender:\nThe Tsai Ing-wen authority has said that the island will defend itself “to the very last day” if the Chinese mainland attacks. Most people know they are bluffing. A recent\nWall Street Journal\nreport quoted several experts as assessing that Taiwan’s military has “poor preparation and low morale”. Also, “adult men in Taiwan don’t actually want to fight”. The article doubted the island would stand much chance against China’s People’s Liberation Army. The report also advised that the Taiwan military could become far more effective by training with the US.\nHow could it be possible to boost the low morale of the Taiwan military by training with the US army? In 2003, I asked a former soldier in Taiwan “whether the island is able to defend itself if a war breaks out?” He made it very clear that the answer is “no”. I then asked him how long he thinks the island could hold, he answered that, “Maybe dozens of hours.” That was a long time ago. Today, the military capability comparison between the Chinese mainland and the island of Taiwan is completely different from that of 18 years ago.\nFrom my point of view, first of all, the mainland doesn’t want to fight a war. It has the will to safeguard peace and take war as the last resort. Second, the Democratic Progressive Party authorities dare not fight. They are making bluffs, but they know very well that the island’s military forces are weak. They cannot withstand even a single blow. If there is a war, Taiwan will be surely defeated and collapse….\nMy prediction is that a war in the Taiwan Straits may eventually be avoided. That is when the strong military pressure of the mainland bows down the will of pro-independence forces in Taiwan island. The situation is changing. The goodwill and patience of the mainland is not to be consumed by DPP authorities endlessly. If the Taiwan question escalates so that it can only be solved through military means, the sudden surrender of Taiwan authorities who dare not fight is within everyone’s expectation.\nThat’s my expectation as well. As the rule of lies has made it ever more clear that nothing that comes out of the mouths of the rulers of the West should be trusted, more and more people around the world are grasping that what we perceived to be reality in the past was never anything more than an illusion meant to cause us to defeat ourselves through fear.\nAt this point, the only thing protecting Taiwan island is the mainland’s desire to avoid harming the population and the techno-industrial infrastructure.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-26T19:15:34+00:00"
}