{
  "url": "https://voxday.net/2021/10/26/seeing-through-shapiro/",
  "scraped_at": "2026-01-08T12:56:49.768967",
  "title": "Seeing Through Shapiro",
  "date_display": "October 26, 2021",
  "date_iso": "2021-10-26T12:00:00+00:00",
  "date_from_url": "2021-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been 16 years since I first pointed out that Ben Shapiro is a gatekeeper, a liar, and a fraud, but finally Christians and other influencers on the Right are seeing through his deceitful act.</p><p><em>Ben Shapiro hates Christ, rejects Christ, and is therefore by definition Anti-Christ. Christians should not be lending their time and money to this man. They should be sharing the Gospel with him instead and praying for his acceptance of Jesus Christ the King of Kings.</em><br/>– Andrew Torba</p><p><em>Ben Shapiro wrote a new book telling us the real enemy we face, which is the “authoritarians,” both on the left and on the right, like the Jan 6th protestors who tried to overthrow our government so they could personally seize power over all of us. Nobody buys these books. I’ll bet Ben Shapiro has fewer honest fans than I do. But he has a $24 million dollar budget for his website, to run a massive staff, to spew all of this. And he does that all while a grossly criminal, illegal conspiracy, commits crimes which are not just technically illegal, but which utterly savages the very essence of the concepts of American freedom, privacy, and the United States Constitution. And Shapiro is a knowing paid agent of this enemy. And he is getting paid very well for it.</em><br/>– Anonymous Conservative</p><p>Now the Zoomers are starting <a href=\"https://media.gab.com/system/media_attachments/files/088/747/430/original/5403a9559edca3c0.mp4\">to publicly call him out</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>AUDIENCE MEMBER:</strong> So in 2019 you went on Joe Rogan’s podcast, and you had a religious conversation with him. You were asked about your view on Jesus Christ, and you said “Jesus was a Jewish rebel who tried to lead a revolt against the Romans and was killed for his trouble.” My question is, Jesus said to give to Caesar what is Caesar’s, and the roman governor even said it first that he was not guilty of any crime. So, given all of this, how can you argue that he tried to lead a revolt against the Romans.</p><p><strong>SHAPIRO:</strong> Right, so I mean, you’re assuming, so I said, from the Jewish perspective, right, I’m not arguing from the Christian perspective, I presume that nearly everyone in this room knows the New Testament better than I do.</p><p>I do know the Jewish perspective on Jesus better than most people who are Christian, right, because it’s the Jewish perspective on Jesus. The Jewish perspective on Jesus does not accept the historicity of the gospels, if it did, then we’d all be christian, right? So the Jewish perspective on Jesus is that like many people at the time and this was true throughout that entire period, there were a lot of Jews who were attempting to lead political revolts against the Romans. The Jewish definition of a Messiah is very different from the Christian definition of the Messiah. The Christian definition of the Messiah and of Jesus is of course a unification of God and man, right? This doesn’t exist in the notion of Jewish philosophy. In Jewish philosophy, the Messiah is a person who accomplishes particular goals according to Maimonides: the gathering of the exiles, the reestablishment of a Davidic kingdom, the reestablishment of Jewish sovereignty in the land of Israel, right? So from a Jewish perspective, if someone was trying to be the Messiah, they would be a political figure. When I said that he was killed for the trouble, that was not demeaning of him. I assume that if I had been living at the time, I also would have been attempting to lead a revolt against the Romans, just like half the Jews were, right? This is why the temple was destroyed, this is why Jews were put into exile, several times, so that was not a smear against Jesus as a Jew, it’s just a recognition that Jews don’t believe in Jesus as a divine figure. And if we did then we’d be Christian.</p><p><strong>AUDIENCE MEMBER:</strong> Well, then I probably would’ve changed the phraseology of that, because, then again, if that was the case, then he would’ve been going against Jewish law, and since that would’ve made him a political figure, then he would’ve been going against Jewish law, not Roman law.</p><p><strong>SHAPIRO:</strong> No, leading a revolt against the Romans wouldn’t have been going against Jewish law either. We don’t want to get into a long, complex debate over what Jews think about the historicity and the take on Judaism that’s in the Gospels. That’s a pretty long conversation, honestly it’s really interesting and it’s kind of fascinating, but under Jewish law, even if you read the New Testament, Jesus’s claims aren’t punishable under Jewish law by death, actually.</p></blockquote><p>What a despicable little weasel.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f1a20b8d-1d98-4ecd-ac37-aed70f22afc3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s been 16 years since I first pointed out that Ben Shapiro is a gatekeeper, a liar, and a fraud, but finally Christians and other influencers on the Right are seeing through his deceitful act.\nBen Shapiro hates Christ, rejects Christ, and is therefore by definition Anti-Christ. Christians should not be lending their time and money to this man. They should be sharing the Gospel with him instead and praying for his acceptance of Jesus Christ the King of Kings.\n– Andrew Torba\nBen Shapiro wrote a new book telling us the real enemy we face, which is the “authoritarians,” both on the left and on the right, like the Jan 6th protestors who tried to overthrow our government so they could personally seize power over all of us. Nobody buys these books. I’ll bet Ben Shapiro has fewer honest fans than I do. But he has a $24 million dollar budget for his website, to run a massive staff, to spew all of this. And he does that all while a grossly criminal, illegal conspiracy, commits crimes which are not just technically illegal, but which utterly savages the very essence of the concepts of American freedom, privacy, and the United States Constitution. And Shapiro is a knowing paid agent of this enemy. And he is getting paid very well for it.\n– Anonymous Conservative\nNow the Zoomers are starting\nto publicly call him out\n.\nAUDIENCE MEMBER:\nSo in 2019 you went on Joe Rogan’s podcast, and you had a religious conversation with him. You were asked about your view on Jesus Christ, and you said “Jesus was a Jewish rebel who tried to lead a revolt against the Romans and was killed for his trouble.” My question is, Jesus said to give to Caesar what is Caesar’s, and the roman governor even said it first that he was not guilty of any crime. So, given all of this, how can you argue that he tried to lead a revolt against the Romans.\nSHAPIRO:\nRight, so I mean, you’re assuming, so I said, from the Jewish perspective, right, I’m not arguing from the Christian perspective, I presume that nearly everyone in this room knows the New Testament better than I do.\nI do know the Jewish perspective on Jesus better than most people who are Christian, right, because it’s the Jewish perspective on Jesus. The Jewish perspective on Jesus does not accept the historicity of the gospels, if it did, then we’d all be christian, right? So the Jewish perspective on Jesus is that like many people at the time and this was true throughout that entire period, there were a lot of Jews who were attempting to lead political revolts against the Romans. The Jewish definition of a Messiah is very different from the Christian definition of the Messiah. The Christian definition of the Messiah and of Jesus is of course a unification of God and man, right? This doesn’t exist in the notion of Jewish philosophy. In Jewish philosophy, the Messiah is a person who accomplishes particular goals according to Maimonides: the gathering of the exiles, the reestablishment of a Davidic kingdom, the reestablishment of Jewish sovereignty in the land of Israel, right? So from a Jewish perspective, if someone was trying to be the Messiah, they would be a political figure. When I said that he was killed for the trouble, that was not demeaning of him. I assume that if I had been living at the time, I also would have been attempting to lead a revolt against the Romans, just like half the Jews were, right? This is why the temple was destroyed, this is why Jews were put into exile, several times, so that was not a smear against Jesus as a Jew, it’s just a recognition that Jews don’t believe in Jesus as a divine figure. And if we did then we’d be Christian.\nAUDIENCE MEMBER:\nWell, then I probably would’ve changed the phraseology of that, because, then again, if that was the case, then he would’ve been going against Jewish law, and since that would’ve made him a political figure, then he would’ve been going against Jewish law, not Roman law.\nSHAPIRO:\nNo, leading a revolt against the Romans wouldn’t have been going against Jewish law either. We don’t want to get into a long, complex debate over what Jews think about the historicity and the take on Judaism that’s in the Gospels. That’s a pretty long conversation, honestly it’s really interesting and it’s kind of fascinating, but under Jewish law, even if you read the New Testament, Jesus’s claims aren’t punishable under Jewish law by death, actually.\nWhat a despicable little weasel.\nDISCUSS ON SG",
  "tags": [
    "cuckservative",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-26T13:59:52+00:00"
}