{
  "url": "https://voxday.net/2021/10/19/that-would-explain-a-lot/",
  "scraped_at": "2026-01-08T12:56:04.793491",
  "title": "That Would Explain a Lot",
  "date_display": "October 19, 2021",
  "date_iso": "2021-10-19T09:45:19+00:00",
  "date_from_url": "2021-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz delves deeply into a <a href=\"https://www.unz.com/runz/american-pravda-remembering-the-liberty/\">surprisingly compelling theory</a> concerning a) why Israel attacked the USS Liberty, b) why US Secretary of Defense refused to permit the Sixth Fleet to defend it, and c) why the US government aggressively covered up the undeniable fact of Israeli responsibility for the attack:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I had never heard of Peter Hounam and a book entitled <em>Operation Cyanide</em> containing wild talk of World War III in the subtitle certainly multiplied my doubts, but the cover carried a glowing endorsement by the BBC World Affairs Editor, hardly the sort of individual likely to lend his name to crackpots. Moreover, according to the back flap, Hounam had spent thirty years in mainstream British journalism, including a long stint as Chief Investigative Journalist at the London Sunday Times, so he obviously possessed serious credentials.</p><p>A bit of casual Googling confirmed these facts and also revealed that in 1987 Hounam had led the<em> Sunday Times </em>team that broke the huge story of Israel’s nuclear weapons program, with the evidence provided by Israeli technician Mordechai Vanunu, just before he was kidnapped by Mossad, returned to Israel, and given a twenty year prison sentence. Hounam certainly had a much more impressive background than I had initally assumed.</p><p>The book itself was of moderate length, running perhaps 100,000 words, but quite professionally written. The author carefully distinguished between solid evidence and cautious speculation, while also weighing the credibility of the various individuals whom he had interviewed and the other material used to support his conclusions. He drew upon most of the same earlier sources with which I was already familiar, as well as a few others that were new to me, generally explaining how he reached his conclusions and why. The overall text struck me as having exactly the sort of solid workmanship that one might expect from someone who had spent three decades in British investigative journalism, including a position near the top of the profession.</p><p>As Hounam explained on the first page, he had been approached in 2000 by a British television producer, who recruited him for a project to uncover the truth of the attack on the Liberty, an incident then entirely unfamiliar to him. His research of the history occupied the next two years, and included travels throughout the United States and Israel to interview numerous key figures. The result was an hour-long BBC documentary Dead in the Water, eventually shown on British television, as well as the book he concurrently produced based upon all the research he had collected.</p><p>As I began the text, the first pages of the Introduction immediately captured my attention. In late 2002, with the book almost completed, Hounam was contacted by Jim Nanjo, a 65-year-old retired American pilot with an interesting story to tell. During the mid-1960s he had served in a squadron of strategic nuclear bombers based in California, always on alert for the command to attack the USSR in the event of war. On three separate occasions during that period, he and the other pilots had been scrambled into their cockpits on a full-war alert rather than a training exercise, sitting in the planes for hours while awaiting the signal to launch their nuclear attack. Each time, they only discovered the event that had triggered the red alert after they received the stand-down order and walked back to their base. Once it had been the JFK assassination and another time the North Korean seizure of the U.S.S. Pueblo, with the third incident being the 1967 attack upon the Liberty.</p><p>All of this made perfect sense, but when Hounam checked the pilot’s reported chronology, he discovered that the squadron had actually been put on full war-alert status at least an hour before the Liberty came under Israeli attack, an astonishing logical inconsistency if correct.</p><p>Memories may easily grow faulty after 35 years, but this strange anomaly was merely one of many that Hounam encountered during his exhaustive investigation and the facts that he uncovered gradually resolved themselves into the outline of a radically different reconstruction of historical events. Although more than half the book recounts the standard elements of the Liberty story that I had already read many times before, the other material was entirely new to me, never mentioned elsewhere.</p><p>President Johnson was a notorious micro-manager, very closely monitoring daily casualties in Vietnam, as well as the sudden new outbreak of war in the Middle East, and he always demanded to be told immediately of any important development. Yet when America’s most advanced spy ship with a crew of nearly 300 reported that it was under deadly attack by unknown enemy forces, he seems never to have been informed, at least according to the official White House logs. Instead, he supposedly spent the morning casually eating his favorite breakfast and then mostly engaging in domestic political chit-chat with various senators.</p><p>Declassified documents from the CIA, the NSA, and the Pentagon prove that red-alert messages had been sent to the White House Situation Room almost immediately, and American military policy is that any flash message reporting an attack on a U.S. naval vessel must be immediately passed to the president, even if he is asleep. Yet according to the official records, Johnson—wide awake and alert—received no notice until almost two hours later, after the assault on the Liberty had ended. Moreover, even when finally informed, he seemed to pay little attention to the most serious naval attack our country had suffered since World War II, instead focusing upon minor domestic political issues. Johnson did put in two calls to Secretary of Defense Robert McNamara, who according to naval logs minutes later ordered the recall of the carrier planes sent to rescue the Liberty, and Secretary of State Dean Rusk later stated that McNamara would never have made that decision without first discussing it with his president. But based upon the official records Johnson himself had not yet been informed that any attack had occurred.</p><p>Indeed, according to the later recollections of Rusk and top intelligence advisor Clark Clifford, during the morning Situation Room meeting two hours later, the Soviets were still believed responsible for the attack, and the participants had a sense that war might have already broken out. Although the Israeli identity of the attackers had been known for more than an hour, most of our top government leaders still seemed to be contemplating World War III with the USSR.</p><p>Hounam believes that these numerous, glaring discrepancies indicated the official logs had been altered in potentially very serious ways, apparently with the intent of insulating President Johnson from having learned of the attack and its crucial details until long after that had occurred. The author’s analysis of these severe chronological discrepancies seems quite meticulous to me, covering several pages, and should be carefully read by anyone interested in these highly suspicious events and the seemingly doctored record.</p><p>Hounam also focused upon several unexplained elements presented in the books by Ennes and others. There does seem solid if very fragmentary evidence that the Liberty‘s positioning off the Egyptian coast was part of some broader American strategic plan, whose still classified details remain largely obscure to us. Ennes’ book briefly mentioned that an American submarine had secretly joined the Liberty as it traveled to its destination, and had actually been present throughout the entire attack, with some of the sailors seeing its periscope. Although one of the crew had been privy to the classified details, he later refused to divulge them to Ennes when asked. According to some accounts, the sub had even used a periscope camera to take photographs of the attack, which various individuals later claimed to have seen. The official name for that secret submarine project was “Operation Cyanide,” which Hounam used for the title of his book. One heavily-redacted government document obtained by Hounam provides tantalizing clues as to why the Liberty had officially been sent to the coast, but anything more than that is speculation.</p><p>There were other strange anomalies. A senior NSA official had been strongly opposed to sending the Liberty into a potentially dangerous war-zone but had been overruled, while the ship’s request for a destroyer escort from the Sixth Fleet had been summarily refused. The day before the attack, top NSA and Pentagon officials had recognized the obvious peril to the ship, even receiving a CIA intelligence report that the Israelis planned to attack, and this led to several urgent messages being sent from Washington, ordering the captain to withdraw to a safe distance 100 miles from the coast; but through a bizarre and inexplicable series of repeated routing errors, none of those messages had ever been received. All of these seemingly coincidental decisions and mistakes had ensured that the Liberty was alone and defenseless in a highly vulnerable location, and that it remained there until the Israeli attack finally came.</p><p>Hounam also sketched out the broader geopolitical context to the events he described. Although originally open to friendly relations with America, Egyptian leader Gamal Nasser had been denied promised US assistance due to the pressure of our powerful Israel Lobby and was therefore pushed into the arms of the USSR, becoming a key regional ally, arming his military forces with Soviet weaponry and even allowing nuclear-capable Soviet strategic bombers to be based on his territory. As a consequence, Johnson became intensely hostile towards Nasser, regarding him as “another Castro” and seeking the overthrow of his regime. This was one of the major reasons his administration offered a green-light to Israel’s decision to launch the Six Day War.</p><p>In the opening hours of that conflict, Israel’s surprise attack had destroyed the bulk of the Egyptian and Syrian air forces on the ground, and these devastating losses soon led Nasser and other Arab leaders to publicly accuse the American military of having entered the war on Israel’s side, charges almost universally dismissed as ridiculous both by journalists at the time and by later historians. But Hounam’s detailed investigation uncovered considerable evidence that that Nasser’s claims may have been true, at least with regard to aerial reconnaissance and electronic communications.</p><p>According to the statements of former American airman Greg Reight, he and his aerial photo reconnaissance unit were secretly deployed to Israel, assisting the attack by determining enemy losses and helping to select subsequent targets. This personal account closely matched the details of the overall operation previously described in Green’s book almost two decades earlier. All these claims were supported by the extremely sharp photos of destroyed Egyptian airfields later released by Israel and published in American news magazines since experts agreed that the Israeli air force did not then possess any of the necessary camera equipment.</p><p>A successful Florida businessman named Joe Sorrels provided a very detailed account of how his American intelligence unit had been infiltrated into Egypt’s Sinai Peninsula before hostilities began and set up electronic monitoring and “spoofing” equipment, which may have played a crucial strategic role in enabling the sweeping Israeli victory. There were even claims that American electronic expertise helped locate the crucial gaps in the radar defenses of the Egyptian airfields that allowed Israel’s surprise attack to become so successful.</p><p>Hounam also emphasized the likely political motive behind Johnson’s possible decision to directly back Israel. By 1967 the Vietnam War was going badly, with mounting American losses and no victory in sight, and if this quagmire continued, the president’s reelection the following year might become very difficult. But if the Soviets suffered a humiliating setback in the Middle East, with their Egyptian and Syrian allies crushed by Israel, perhaps culminating in Nasser’s overthrow, that success might compensate for the problems in Southeast Asia, diverting public attention toward much more positive developments in a different region. Moreover, the influential Jewish groups that had once been among Johnson’s strongest supporters had lately become leading critics of the continuing Vietnam conflict; but since they were intensely pro-Israel, success in the Middle East might bring them back into the fold.</p><p>This provides the background for one of Hounam’s most controversial suggestions. He notes that in 1964, Johnson had persuaded Congress to pass the Tonkin Gulf Resolution by a near-unanimous vote, authorizing military strikes against North Vietnam, but based upon an alleged attack upon American destroyers that most historians now agree was fictional. Although the resulting Vietnam War eventually became highly unpopular, Johnson’s initial “retaliatory” airstrikes just three months before the 1964 election rallied the country around him and helped ensure his huge landslide reelection victory against Sen. Barry Goldwater. And according to Ephraim Evren, a top Israeli diplomat in the U.S., just a few days before the outbreak of the Six Day War Johnson met with him privately and emphasized the urgent need “to get Congress to pass another Tonkin resolution,” but this time with regard to the Middle East. An excuse for direct, successful American military intervention on Israel’s behalf would obviously have solved many of Johnson’s existing political problems, greatly boosting his otherwise difficult reelection prospects the following year.</p><p>We must always keep in mind that only a miracle kept the Liberty afloat, and if it had been sunk without survivors as expected, almost no one in American media or government would have dared accuse Israel of such an irrational act. Instead, as Stephen Green had first suggested in 1984, Egyptian forces would very likely have been blamed, producing powerful demands for immediate American retaliation, but probably on a vastly greater scale than the fictional Tonkin Gulf attack, which had inflicted no injuries.</p><p>Indeed, Hounam’s detailed investigation discovered strong evidence that a powerful American “retaliatory” strike against Egypt had already been put into motion from almost the moment that the Liberty was first attacked. Paul Nes then served as charge d’Affaires at the U.S. Embassy in Cairo, and in a taped interview he recalled receiving an urgent flash message alerting him that the Liberty had been attacked, presumably by Egyptian planes, and that bombers from an American carrier were already on their way to strike Cairo in retaliation. With an American-Egyptian war about to break out, Nes and his subordinates immediately began destroying all their important documents. But not long afterward, another flash message arrived, identifying the attackers as Israeli and saying that the air strike had been called off. According to some accounts, the American warplanes were just minutes from Egypt’s capital city when they were recalled.</p><cite><em>American Pravda: Remembering the Liberty</em>, Ron Unz, 18 October 2021</cite></blockquote><p>In other words, the attack on the USS Liberty appears to have been a failed false flag in the USS Maine/Gulf of Tonkin mode, a precursor of the successful 9/11 false flag, and one was intended to justify a US attack on Egypt that may have been intended to be a nuclear strike. It was anti-American treachery on the part of both the Israeli and the US governments of the time, which explains why both governments have so assiduously attempted to silence all of the witnesses and bury all the evidence ever since.</p><p>And the Egyptian hypothesis helps clarify the reason 9/11 happened, as a US government willing to enlist a foreign government to sink its own near-defenseless ship, <a href=\"https://infogalactic.com/info/Operation_Northwoods\" rel=\"noreferrer noopener\" target=\"_blank\">or to blow up a civilian airliner</a>, is obviously one that is willing to permit a few thousand of its civilians to die in order to justify a war it intends to wage in the Middle East. The attack on Afghanistan never, ever, made any sense, not even at the time. The only real question about 9/11 is whether it was the Israeli government or the Saudi government, or both, who were utilized by the US leadership. Logic, combined with the failure of the historical false flag, tends to suggest the Saudis were the responsible party, but the Israelis knew about the planned wars and were observing the operation.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bd41bd20-94ab-4962-8459-220f2355d7cc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Ron Unz delves deeply into a\nsurprisingly compelling theory\nconcerning a) why Israel attacked the USS Liberty, b) why US Secretary of Defense refused to permit the Sixth Fleet to defend it, and c) why the US government aggressively covered up the undeniable fact of Israeli responsibility for the attack:\nI had never heard of Peter Hounam and a book entitled\nOperation Cyanide\ncontaining wild talk of World War III in the subtitle certainly multiplied my doubts, but the cover carried a glowing endorsement by the BBC World Affairs Editor, hardly the sort of individual likely to lend his name to crackpots. Moreover, according to the back flap, Hounam had spent thirty years in mainstream British journalism, including a long stint as Chief Investigative Journalist at the London Sunday Times, so he obviously possessed serious credentials.\nA bit of casual Googling confirmed these facts and also revealed that in 1987 Hounam had led the\nSunday Times\nteam that broke the huge story of Israel’s nuclear weapons program, with the evidence provided by Israeli technician Mordechai Vanunu, just before he was kidnapped by Mossad, returned to Israel, and given a twenty year prison sentence. Hounam certainly had a much more impressive background than I had initally assumed.\nThe book itself was of moderate length, running perhaps 100,000 words, but quite professionally written. The author carefully distinguished between solid evidence and cautious speculation, while also weighing the credibility of the various individuals whom he had interviewed and the other material used to support his conclusions. He drew upon most of the same earlier sources with which I was already familiar, as well as a few others that were new to me, generally explaining how he reached his conclusions and why. The overall text struck me as having exactly the sort of solid workmanship that one might expect from someone who had spent three decades in British investigative journalism, including a position near the top of the profession.\nAs Hounam explained on the first page, he had been approached in 2000 by a British television producer, who recruited him for a project to uncover the truth of the attack on the Liberty, an incident then entirely unfamiliar to him. His research of the history occupied the next two years, and included travels throughout the United States and Israel to interview numerous key figures. The result was an hour-long BBC documentary Dead in the Water, eventually shown on British television, as well as the book he concurrently produced based upon all the research he had collected.\nAs I began the text, the first pages of the Introduction immediately captured my attention. In late 2002, with the book almost completed, Hounam was contacted by Jim Nanjo, a 65-year-old retired American pilot with an interesting story to tell. During the mid-1960s he had served in a squadron of strategic nuclear bombers based in California, always on alert for the command to attack the USSR in the event of war. On three separate occasions during that period, he and the other pilots had been scrambled into their cockpits on a full-war alert rather than a training exercise, sitting in the planes for hours while awaiting the signal to launch their nuclear attack. Each time, they only discovered the event that had triggered the red alert after they received the stand-down order and walked back to their base. Once it had been the JFK assassination and another time the North Korean seizure of the U.S.S. Pueblo, with the third incident being the 1967 attack upon the Liberty.\nAll of this made perfect sense, but when Hounam checked the pilot’s reported chronology, he discovered that the squadron had actually been put on full war-alert status at least an hour before the Liberty came under Israeli attack, an astonishing logical inconsistency if correct.\nMemories may easily grow faulty after 35 years, but this strange anomaly was merely one of many that Hounam encountered during his exhaustive investigation and the facts that he uncovered gradually resolved themselves into the outline of a radically different reconstruction of historical events. Although more than half the book recounts the standard elements of the Liberty story that I had already read many times before, the other material was entirely new to me, never mentioned elsewhere.\nPresident Johnson was a notorious micro-manager, very closely monitoring daily casualties in Vietnam, as well as the sudden new outbreak of war in the Middle East, and he always demanded to be told immediately of any important development. Yet when America’s most advanced spy ship with a crew of nearly 300 reported that it was under deadly attack by unknown enemy forces, he seems never to have been informed, at least according to the official White House logs. Instead, he supposedly spent the morning casually eating his favorite breakfast and then mostly engaging in domestic political chit-chat with various senators.\nDeclassified documents from the CIA, the NSA, and the Pentagon prove that red-alert messages had been sent to the White House Situation Room almost immediately, and American military policy is that any flash message reporting an attack on a U.S. naval vessel must be immediately passed to the president, even if he is asleep. Yet according to the official records, Johnson—wide awake and alert—received no notice until almost two hours later, after the assault on the Liberty had ended. Moreover, even when finally informed, he seemed to pay little attention to the most serious naval attack our country had suffered since World War II, instead focusing upon minor domestic political issues. Johnson did put in two calls to Secretary of Defense Robert McNamara, who according to naval logs minutes later ordered the recall of the carrier planes sent to rescue the Liberty, and Secretary of State Dean Rusk later stated that McNamara would never have made that decision without first discussing it with his president. But based upon the official records Johnson himself had not yet been informed that any attack had occurred.\nIndeed, according to the later recollections of Rusk and top intelligence advisor Clark Clifford, during the morning Situation Room meeting two hours later, the Soviets were still believed responsible for the attack, and the participants had a sense that war might have already broken out. Although the Israeli identity of the attackers had been known for more than an hour, most of our top government leaders still seemed to be contemplating World War III with the USSR.\nHounam believes that these numerous, glaring discrepancies indicated the official logs had been altered in potentially very serious ways, apparently with the intent of insulating President Johnson from having learned of the attack and its crucial details until long after that had occurred. The author’s analysis of these severe chronological discrepancies seems quite meticulous to me, covering several pages, and should be carefully read by anyone interested in these highly suspicious events and the seemingly doctored record.\nHounam also focused upon several unexplained elements presented in the books by Ennes and others. There does seem solid if very fragmentary evidence that the Liberty‘s positioning off the Egyptian coast was part of some broader American strategic plan, whose still classified details remain largely obscure to us. Ennes’ book briefly mentioned that an American submarine had secretly joined the Liberty as it traveled to its destination, and had actually been present throughout the entire attack, with some of the sailors seeing its periscope. Although one of the crew had been privy to the classified details, he later refused to divulge them to Ennes when asked. According to some accounts, the sub had even used a periscope camera to take photographs of the attack, which various individuals later claimed to have seen. The official name for that secret submarine project was “Operation Cyanide,” which Hounam used for the title of his book. One heavily-redacted government document obtained by Hounam provides tantalizing clues as to why the Liberty had officially been sent to the coast, but anything more than that is speculation.\nThere were other strange anomalies. A senior NSA official had been strongly opposed to sending the Liberty into a potentially dangerous war-zone but had been overruled, while the ship’s request for a destroyer escort from the Sixth Fleet had been summarily refused. The day before the attack, top NSA and Pentagon officials had recognized the obvious peril to the ship, even receiving a CIA intelligence report that the Israelis planned to attack, and this led to several urgent messages being sent from Washington, ordering the captain to withdraw to a safe distance 100 miles from the coast; but through a bizarre and inexplicable series of repeated routing errors, none of those messages had ever been received. All of these seemingly coincidental decisions and mistakes had ensured that the Liberty was alone and defenseless in a highly vulnerable location, and that it remained there until the Israeli attack finally came.\nHounam also sketched out the broader geopolitical context to the events he described. Although originally open to friendly relations with America, Egyptian leader Gamal Nasser had been denied promised US assistance due to the pressure of our powerful Israel Lobby and was therefore pushed into the arms of the USSR, becoming a key regional ally, arming his military forces with Soviet weaponry and even allowing nuclear-capable Soviet strategic bombers to be based on his territory. As a consequence, Johnson became intensely hostile towards Nasser, regarding him as “another Castro” and seeking the overthrow of his regime. This was one of the major reasons his administration offered a green-light to Israel’s decision to launch the Six Day War.\nIn the opening hours of that conflict, Israel’s surprise attack had destroyed the bulk of the Egyptian and Syrian air forces on the ground, and these devastating losses soon led Nasser and other Arab leaders to publicly accuse the American military of having entered the war on Israel’s side, charges almost universally dismissed as ridiculous both by journalists at the time and by later historians. But Hounam’s detailed investigation uncovered considerable evidence that that Nasser’s claims may have been true, at least with regard to aerial reconnaissance and electronic communications.\nAccording to the statements of former American airman Greg Reight, he and his aerial photo reconnaissance unit were secretly deployed to Israel, assisting the attack by determining enemy losses and helping to select subsequent targets. This personal account closely matched the details of the overall operation previously described in Green’s book almost two decades earlier. All these claims were supported by the extremely sharp photos of destroyed Egyptian airfields later released by Israel and published in American news magazines since experts agreed that the Israeli air force did not then possess any of the necessary camera equipment.\nA successful Florida businessman named Joe Sorrels provided a very detailed account of how his American intelligence unit had been infiltrated into Egypt’s Sinai Peninsula before hostilities began and set up electronic monitoring and “spoofing” equipment, which may have played a crucial strategic role in enabling the sweeping Israeli victory. There were even claims that American electronic expertise helped locate the crucial gaps in the radar defenses of the Egyptian airfields that allowed Israel’s surprise attack to become so successful.\nHounam also emphasized the likely political motive behind Johnson’s possible decision to directly back Israel. By 1967 the Vietnam War was going badly, with mounting American losses and no victory in sight, and if this quagmire continued, the president’s reelection the following year might become very difficult. But if the Soviets suffered a humiliating setback in the Middle East, with their Egyptian and Syrian allies crushed by Israel, perhaps culminating in Nasser’s overthrow, that success might compensate for the problems in Southeast Asia, diverting public attention toward much more positive developments in a different region. Moreover, the influential Jewish groups that had once been among Johnson’s strongest supporters had lately become leading critics of the continuing Vietnam conflict; but since they were intensely pro-Israel, success in the Middle East might bring them back into the fold.\nThis provides the background for one of Hounam’s most controversial suggestions. He notes that in 1964, Johnson had persuaded Congress to pass the Tonkin Gulf Resolution by a near-unanimous vote, authorizing military strikes against North Vietnam, but based upon an alleged attack upon American destroyers that most historians now agree was fictional. Although the resulting Vietnam War eventually became highly unpopular, Johnson’s initial “retaliatory” airstrikes just three months before the 1964 election rallied the country around him and helped ensure his huge landslide reelection victory against Sen. Barry Goldwater. And according to Ephraim Evren, a top Israeli diplomat in the U.S., just a few days before the outbreak of the Six Day War Johnson met with him privately and emphasized the urgent need “to get Congress to pass another Tonkin resolution,” but this time with regard to the Middle East. An excuse for direct, successful American military intervention on Israel’s behalf would obviously have solved many of Johnson’s existing political problems, greatly boosting his otherwise difficult reelection prospects the following year.\nWe must always keep in mind that only a miracle kept the Liberty afloat, and if it had been sunk without survivors as expected, almost no one in American media or government would have dared accuse Israel of such an irrational act. Instead, as Stephen Green had first suggested in 1984, Egyptian forces would very likely have been blamed, producing powerful demands for immediate American retaliation, but probably on a vastly greater scale than the fictional Tonkin Gulf attack, which had inflicted no injuries.\nIndeed, Hounam’s detailed investigation discovered strong evidence that a powerful American “retaliatory” strike against Egypt had already been put into motion from almost the moment that the Liberty was first attacked. Paul Nes then served as charge d’Affaires at the U.S. Embassy in Cairo, and in a taped interview he recalled receiving an urgent flash message alerting him that the Liberty had been attacked, presumably by Egyptian planes, and that bombers from an American carrier were already on their way to strike Cairo in retaliation. With an American-Egyptian war about to break out, Nes and his subordinates immediately began destroying all their important documents. But not long afterward, another flash message arrived, identifying the attackers as Israeli and saying that the air strike had been called off. According to some accounts, the American warplanes were just minutes from Egypt’s capital city when they were recalled.\nAmerican Pravda: Remembering the Liberty\n, Ron Unz, 18 October 2021\nIn other words, the attack on the USS Liberty appears to have been a failed false flag in the USS Maine/Gulf of Tonkin mode, a precursor of the successful 9/11 false flag, and one was intended to justify a US attack on Egypt that may have been intended to be a nuclear strike. It was anti-American treachery on the part of both the Israeli and the US governments of the time, which explains why both governments have so assiduously attempted to silence all of the witnesses and bury all the evidence ever since.\nAnd the Egyptian hypothesis helps clarify the reason 9/11 happened, as a US government willing to enlist a foreign government to sink its own near-defenseless ship,\nor to blow up a civilian airliner\n, is obviously one that is willing to permit a few thousand of its civilians to die in order to justify a war it intends to wage in the Middle East. The attack on Afghanistan never, ever, made any sense, not even at the time. The only real question about 9/11 is whether it was the Israeli government or the Saudi government, or both, who were utilized by the US leadership. Logic, combined with the failure of the historical false flag, tends to suggest the Saudis were the responsible party, but the Israelis knew about the planned wars and were observing the operation.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-19T10:25:55+00:00"
}