{
  "url": "https://voxday.net/2021/10/15/the-eminence-grise/",
  "scraped_at": "2026-01-08T12:55:35.943499",
  "title": "The Éminence Grise",
  "date_display": "October 15, 2021",
  "date_iso": "2021-10-15T10:00:37+00:00",
  "date_from_url": "2021-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you ever wondered why my views have tended to sound so harmonious with Chinese policy in recent years, it’s because the leading Chinese intellectual has been looking at the same things I’ve been looking at, reading the same books I’ve been reading, observing the same things I’ve been observing, and <a href=\"https://palladiummag.com/2021/10/11/the-triumph-and-terror-of-wang-huning/\">reaching strikingly similar conclusions… </a>only he did it 13 years before I did. Of course, it’s extremely informative to observe the difference between the way Wang Huning was embraced by the Chinese elite and the way I was systematically banished and minimized by the Western elite.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At this point, like many during those heady years of reform and opening, Wang remained hopeful that liberalism could play a positive role in China, writing that his recommendations could allow “the components of the modern structure that embody the spirit of modern democracy and humanism [to] find the support they need to take root and grow.”</p><p>That would soon change.</p><p>Also in 1988, Wang—having risen with unprecedented speed to become Fudan’s youngest full professor at age 30—won a coveted scholarship (facilitated by the American Political Science Association) to spend six months in the United States as a visiting scholar. Profoundly curious about America, Wang took full advantage, wandering about the country like a sort of latter-day Chinese Alexis de Tocqueville, visiting more than 30 cities and nearly 20 universities.</p><p>What he found deeply disturbed him, permanently shifting his view of the West and the consequences of its ideas.</p><p>Wang recorded his observations in a memoir that would become his most famous work: the 1991 book <em>America Against America</em>. In it, he marvels at homeless encampments in the streets of Washington DC, out-of-control drug crime in poor black neighborhoods in New York and San Francisco, and corporations that seemed to have fused themselves to and taken over responsibilities of government. Eventually, he concludes that America faces an “unstoppable undercurrent of crisis” produced by its societal contradictions, including between rich and poor, white and black, democratic and oligarchic power, egalitarianism and class privilege, individual rights and collective responsibilities, cultural traditions and the solvent of liquid modernity.</p><p>But while Americans can, he says, perceive that they are faced with “intricate social and cultural problems,” they “tend to think of them as scientific and technological problems” to be solved separately. This gets them nowhere, he argues, because their problems are in fact all inextricably interlinked and have the same root cause: a radical, nihilistic individualism at the heart of modern American liberalism.</p><p>“The real cell of society in the United States is the individual,” he finds. This is so because the cell most foundational (per Aristotle) to society, “the family, has disintegrated.” Meanwhile, in the American system, “everything has a dual nature, and the glamour of high commodification abounds. Human flesh, sex, knowledge, politics, power, and law can all become the target of commodification.” This “commodification, in many ways, corrupts society and leads to a number of serious social problems.” In the end, “the American economic system has created human loneliness” as its foremost product, along with spectacular inequality. As a result, “nihilism has become the American way, which is a fatal shock to cultural development and the American spirit.”</p><p>Moreover, he says that the “American spirit is facing serious challenges” from new ideational competitors. Reflecting on the universities he visited and quoting approvingly from Allan Bloom’s <em>The Closing of the American Mind</em>, he notes a growing tension between Enlightenment liberal rationalism and a “younger generation [that] is ignorant of traditional Western values” and actively rejects its cultural inheritance. “If the value system collapses,” he wonders, “how can the social system be sustained?”</p><p>Ultimately, he argues, when faced with critical social issues like drug addiction, America’s atomized, deracinated, and dispirited society has found itself with “an insurmountable problem” because it no longer has any coherent conceptual grounds from which to mount any resistance.</p><p>Once idealistic about America, at the start of 1989 the young Wang returned to China and, promoted to Dean of Fudan’s International Politics Department, became a leading opponent of liberalization.</p><p>He began to argue that China had to resist global liberal influence and become a culturally unified and self-confident nation governed by a strong, centralized party-state. He would develop these ideas into what has become known as China’s “Neo-Authoritarian” movement—though Wang never used the term, identifying himself with China’s “Neo-Conservatives.” This reflected his desire to blend Marxist socialism with traditional Chinese Confucian values and Legalist political thought, maximalist Western ideas of state sovereignty and power, and nationalism in order to synthesize a new basis for long-term stability and growth immune to Western liberalism.</p></blockquote><p>Of course, what works for China will not work for the West. Among other things, a Western nation cannot turn to Confucian values it never had. As Lee Kuan Yew reminds us in his memoirs, different peoples must construct their own forms of government that are suited to their customs and culture. But even though Wang’s precise prescription is not an option for us, that does not mean that his diagnosis of the West’s problem being the neo-liberal world order and its rejection of traditional Christian values should be ignored.</p><p>Nor does that mean that a Western form of Neo-Authoritarianism designed to restore Western values and Western nationalisms should not be pursued with the same vigor that China has constructed its post-Maoist system, and with a similar confidence of success. The more important question for Americans is: precisely what should American Neo-Authoritarianism look like?</p><p><em><a href=\"https://social.infogalactic.com/micropost/9a546765-81e9-499c-91a8-c30e29b3001e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If you ever wondered why my views have tended to sound so harmonious with Chinese policy in recent years, it’s because the leading Chinese intellectual has been looking at the same things I’ve been looking at, reading the same books I’ve been reading, observing the same things I’ve been observing, and\nreaching strikingly similar conclusions…\nonly he did it 13 years before I did. Of course, it’s extremely informative to observe the difference between the way Wang Huning was embraced by the Chinese elite and the way I was systematically banished and minimized by the Western elite.\nAt this point, like many during those heady years of reform and opening, Wang remained hopeful that liberalism could play a positive role in China, writing that his recommendations could allow “the components of the modern structure that embody the spirit of modern democracy and humanism [to] find the support they need to take root and grow.”\nThat would soon change.\nAlso in 1988, Wang—having risen with unprecedented speed to become Fudan’s youngest full professor at age 30—won a coveted scholarship (facilitated by the American Political Science Association) to spend six months in the United States as a visiting scholar. Profoundly curious about America, Wang took full advantage, wandering about the country like a sort of latter-day Chinese Alexis de Tocqueville, visiting more than 30 cities and nearly 20 universities.\nWhat he found deeply disturbed him, permanently shifting his view of the West and the consequences of its ideas.\nWang recorded his observations in a memoir that would become his most famous work: the 1991 book\nAmerica Against America\n. In it, he marvels at homeless encampments in the streets of Washington DC, out-of-control drug crime in poor black neighborhoods in New York and San Francisco, and corporations that seemed to have fused themselves to and taken over responsibilities of government. Eventually, he concludes that America faces an “unstoppable undercurrent of crisis” produced by its societal contradictions, including between rich and poor, white and black, democratic and oligarchic power, egalitarianism and class privilege, individual rights and collective responsibilities, cultural traditions and the solvent of liquid modernity.\nBut while Americans can, he says, perceive that they are faced with “intricate social and cultural problems,” they “tend to think of them as scientific and technological problems” to be solved separately. This gets them nowhere, he argues, because their problems are in fact all inextricably interlinked and have the same root cause: a radical, nihilistic individualism at the heart of modern American liberalism.\n“The real cell of society in the United States is the individual,” he finds. This is so because the cell most foundational (per Aristotle) to society, “the family, has disintegrated.” Meanwhile, in the American system, “everything has a dual nature, and the glamour of high commodification abounds. Human flesh, sex, knowledge, politics, power, and law can all become the target of commodification.” This “commodification, in many ways, corrupts society and leads to a number of serious social problems.” In the end, “the American economic system has created human loneliness” as its foremost product, along with spectacular inequality. As a result, “nihilism has become the American way, which is a fatal shock to cultural development and the American spirit.”\nMoreover, he says that the “American spirit is facing serious challenges” from new ideational competitors. Reflecting on the universities he visited and quoting approvingly from Allan Bloom’s\nThe Closing of the American Mind\n, he notes a growing tension between Enlightenment liberal rationalism and a “younger generation [that] is ignorant of traditional Western values” and actively rejects its cultural inheritance. “If the value system collapses,” he wonders, “how can the social system be sustained?”\nUltimately, he argues, when faced with critical social issues like drug addiction, America’s atomized, deracinated, and dispirited society has found itself with “an insurmountable problem” because it no longer has any coherent conceptual grounds from which to mount any resistance.\nOnce idealistic about America, at the start of 1989 the young Wang returned to China and, promoted to Dean of Fudan’s International Politics Department, became a leading opponent of liberalization.\nHe began to argue that China had to resist global liberal influence and become a culturally unified and self-confident nation governed by a strong, centralized party-state. He would develop these ideas into what has become known as China’s “Neo-Authoritarian” movement—though Wang never used the term, identifying himself with China’s “Neo-Conservatives.” This reflected his desire to blend Marxist socialism with traditional Chinese Confucian values and Legalist political thought, maximalist Western ideas of state sovereignty and power, and nationalism in order to synthesize a new basis for long-term stability and growth immune to Western liberalism.\nOf course, what works for China will not work for the West. Among other things, a Western nation cannot turn to Confucian values it never had. As Lee Kuan Yew reminds us in his memoirs, different peoples must construct their own forms of government that are suited to their customs and culture. But even though Wang’s precise prescription is not an option for us, that does not mean that his diagnosis of the West’s problem being the neo-liberal world order and its rejection of traditional Christian values should be ignored.\nNor does that mean that a Western form of Neo-Authoritarianism designed to restore Western values and Western nationalisms should not be pursued with the same vigor that China has constructed its post-Maoist system, and with a similar confidence of success. The more important question for Americans is: precisely what should American Neo-Authoritarianism look like?\nDISCUSS ON SG",
  "tags": [
    "China",
    "globalism",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-15T10:56:36+00:00"
}