{
  "url": "https://voxday.net/2021/10/08/us-provides-casus-belli/",
  "scraped_at": "2026-01-08T12:54:45.970470",
  "title": "US Provides Casus Belli",
  "date_display": "October 8, 2021",
  "date_iso": "2021-10-08T10:35:33+00:00",
  "date_from_url": "2021-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US military <a href=\"https://www.newsmax.com/politics/taiwan-us-troops-china/2021/10/07/id/1039559/\" rel=\"noreferrer noopener\" target=\"_blank\">has now provided China with a legitimate reason</a> to take action in Taiwan. Whether it is intended as bait or whether it’s simply reprehensible stupidity, I cannot say.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Small units of Taiwan’s military ground forces have been trained by a U.S. special operations unit and a contingent of Marines, who have been secretly operating in that country, The Wall Street Journal is reporting.</p><p>Some two dozen members of U.S. special-operations and support troops have been conducting the training in an effort to strengthen Taiwan’s defenses in light of concerns about potential aggression by China.</p><p>Officials tell the paper that American forces have been conducting the training for at least a year.</p></blockquote><p>To put it in perspective, imagine what the response from Washington would be if Russian Spetsnaz units were secretly operating in Idaho, training small units of “right wing extremists” and “Christian antivaxxers”. Remember, Taiwan is a Chinese province, and there is almost certainly a higher percentage of Taiwanese that wish to be governed by Beijing than Idahoans that want to be governed by Washington.</p><p>The <em>Global Times</em>, which is an English-speaking mouthpiece for the CPC, has made it very clear that this sort of foreign military intervention <a href=\"https://www.globaltimes.cn/page/202110/1235761.shtml\" rel=\"noreferrer noopener\" target=\"_blank\">will not be tolerated</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It is impossible for any foreign force to deter or stop the process of China’s reunification as the mainland is determined to crack down on all kinds of foreign intervention and capable of doing so, and could reunify the island by force if necessary, Yuan Zheng, deputy director of the Institute of American Studies at the Chinese Academy of Social Sciences, told the Global Times on Thursday.</p><p>“The only thing that matters for the US and its allies is that how big a price they want to pay to test China’s strength and determination on this matter,” Yuan noted.</p><p>That the island of Taiwan’s attempts to resist reunification by force cannot succeed, and no matter what weapons the Taiwan secessionists make or buy, they cannot change the fact that the PLA has overwhelming advantages in the Taiwan Straits and surrounding areas, analysts said, stressing that once the mainland decides to solve the Taiwan question by force, no weapon can deter the unshakeable determination of 1.4 billion people to realize national reunification.</p><cite>“PLA presence around Taiwan ‘targets secessionism, foreign forces’”, <em>Global Times</em>, 7 October 2021</cite></blockquote><p>The reason that they’re trying to train the Taiwanese forces is pretty obvious, though, as the island’s military has clearly become incapable of presenting the PLA with a hard target as <a href=\"https://scholars-stage.org/why-i-fear-for-taiwan/\" rel=\"noreferrer noopener\" target=\"_blank\">its capabilities have declined</a> relative to those of the mainland.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Two years back I wrote an article for <em>Foreign Policy</em> with the title “Taiwan Can Win a War With China.” In a recent interview with Jordan Schneider I stated that I can no longer endorse the declaration in that title. While I discuss my change of heart on the podcast, I think it is best if I fully write out why my assessment has changed.</p><p>I wrote that article in the early Spring of 2018. Around 70% of its contents reflected research presented in Ian Easton’s book, <em>The Chinese Invasion Threat</em>, another 15% or so was drawn from a journal article published by Michael Beckely in the <em>International Security Review</em>, and the last 15% or so drew from my own analysis. A lot of the writing and research behind Easton’s book comes from 2015-2016. Things have gotten worse, not better, since then, and if Easton’s more recent op-ed pieces are a fair judge of his opinions, he has also grown more pessimistic in the years since.</p><p>My pessimism is grounded in the nine months I spent in Taiwan in 2019….</p><p>You might divide the challenges Taiwan faces into two parts: problems of military strategy and problems of training, culture and morale. These problems can be laid at the feet of the ROC military (especially the ROC Army), but behind them lies another, more serious layer of dysfunction. This layer is more serious because it infects not the military but the civilian leadership tasked with reforming the defense system. Responsibility for military strategy and morale ultimately lies with Taiwanese politicians, and to a lesser extent, the voters who bring them to office. But Taiwan is marred by a dysfunctional civil-military relationship, destructive partisan infighting, and a spirit of defeatism. These political dynamics make it difficult for Taiwan to make the reforms that might guarantee its safety and autonomy.</p><p>The problems with Taiwanese military strategy are well known. The essential issues are these: for the last decade, Taiwanese force procurement has been weighted towards expensive, high-end platforms that are high on prestige but of limited utility in an actual conflict with the PLA. 20 years ago doubling down on the high-tech edge made sense, as it was seen as a force multiplier that might counteract the weight of numbers China could throw into the fight. But the situation has changed: the PLA has parity on just about every system the Taiwanese can field (or buy from us in the future), and for some systems they simply outclass the Taiwanese altogether. The Chinese thus not only have more equipment, but better equipment on top of it.</p><cite>“Why I Fear For Taiwan”, Tanner Greer, 11 September 2020</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/e4b04da3-9b7b-4a4e-9498-269b8d18f901\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The US military\nhas now provided China with a legitimate reason\nto take action in Taiwan. Whether it is intended as bait or whether it’s simply reprehensible stupidity, I cannot say.\nSmall units of Taiwan’s military ground forces have been trained by a U.S. special operations unit and a contingent of Marines, who have been secretly operating in that country, The Wall Street Journal is reporting.\nSome two dozen members of U.S. special-operations and support troops have been conducting the training in an effort to strengthen Taiwan’s defenses in light of concerns about potential aggression by China.\nOfficials tell the paper that American forces have been conducting the training for at least a year.\nTo put it in perspective, imagine what the response from Washington would be if Russian Spetsnaz units were secretly operating in Idaho, training small units of “right wing extremists” and “Christian antivaxxers”. Remember, Taiwan is a Chinese province, and there is almost certainly a higher percentage of Taiwanese that wish to be governed by Beijing than Idahoans that want to be governed by Washington.\nThe\nGlobal Times\n, which is an English-speaking mouthpiece for the CPC, has made it very clear that this sort of foreign military intervention\nwill not be tolerated\n:\nIt is impossible for any foreign force to deter or stop the process of China’s reunification as the mainland is determined to crack down on all kinds of foreign intervention and capable of doing so, and could reunify the island by force if necessary, Yuan Zheng, deputy director of the Institute of American Studies at the Chinese Academy of Social Sciences, told the Global Times on Thursday.\n“The only thing that matters for the US and its allies is that how big a price they want to pay to test China’s strength and determination on this matter,” Yuan noted.\nThat the island of Taiwan’s attempts to resist reunification by force cannot succeed, and no matter what weapons the Taiwan secessionists make or buy, they cannot change the fact that the PLA has overwhelming advantages in the Taiwan Straits and surrounding areas, analysts said, stressing that once the mainland decides to solve the Taiwan question by force, no weapon can deter the unshakeable determination of 1.4 billion people to realize national reunification.\n“PLA presence around Taiwan ‘targets secessionism, foreign forces’”,\nGlobal Times\n, 7 October 2021\nThe reason that they’re trying to train the Taiwanese forces is pretty obvious, though, as the island’s military has clearly become incapable of presenting the PLA with a hard target as\nits capabilities have declined\nrelative to those of the mainland.\nTwo years back I wrote an article for\nForeign Policy\nwith the title “Taiwan Can Win a War With China.” In a recent interview with Jordan Schneider I stated that I can no longer endorse the declaration in that title. While I discuss my change of heart on the podcast, I think it is best if I fully write out why my assessment has changed.\nI wrote that article in the early Spring of 2018. Around 70% of its contents reflected research presented in Ian Easton’s book,\nThe Chinese Invasion Threat\n, another 15% or so was drawn from a journal article published by Michael Beckely in the\nInternational Security Review\n, and the last 15% or so drew from my own analysis. A lot of the writing and research behind Easton’s book comes from 2015-2016. Things have gotten worse, not better, since then, and if Easton’s more recent op-ed pieces are a fair judge of his opinions, he has also grown more pessimistic in the years since.\nMy pessimism is grounded in the nine months I spent in Taiwan in 2019….\nYou might divide the challenges Taiwan faces into two parts: problems of military strategy and problems of training, culture and morale. These problems can be laid at the feet of the ROC military (especially the ROC Army), but behind them lies another, more serious layer of dysfunction. This layer is more serious because it infects not the military but the civilian leadership tasked with reforming the defense system. Responsibility for military strategy and morale ultimately lies with Taiwanese politicians, and to a lesser extent, the voters who bring them to office. But Taiwan is marred by a dysfunctional civil-military relationship, destructive partisan infighting, and a spirit of defeatism. These political dynamics make it difficult for Taiwan to make the reforms that might guarantee its safety and autonomy.\nThe problems with Taiwanese military strategy are well known. The essential issues are these: for the last decade, Taiwanese force procurement has been weighted towards expensive, high-end platforms that are high on prestige but of limited utility in an actual conflict with the PLA. 20 years ago doubling down on the high-tech edge made sense, as it was seen as a force multiplier that might counteract the weight of numbers China could throw into the fight. But the situation has changed: the PLA has parity on just about every system the Taiwanese can field (or buy from us in the future), and for some systems they simply outclass the Taiwanese altogether. The Chinese thus not only have more equipment, but better equipment on top of it.\n“Why I Fear For Taiwan”, Tanner Greer, 11 September 2020\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-10-08T10:55:53+00:00"
}