{
  "url": "https://voxday.net/2021/03/22/a-tale-of-two-tickets/",
  "scraped_at": "2025-12-21T22:41:58.921382",
  "title": "A tale of two tickets",
  "date_display": "March 22, 2021",
  "date_iso": "2021-03-22T20:00:03+00:00",
  "date_from_url": "2021-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> This is what a ticket-taker <a href=\"https://www.dailymail.co.uk/femail/article-9385645/Richard-Osmans-debut-crime-novel-set-sell-millionth-copy.html\" rel=\"noopener\" target=\"_blank\">looks like</a>:</p><blockquote><p>Quiz show star Richard Osman is set to sell his millionth copy of his debut novel this week, making it only the second adult fiction hardback to reach the milestone in the UK this century. The Pointless co-presenter, 50, admitted he was ‘excited’ by the soaring sales figures of <i>The Thursday Murder Club</i>, the Times reported.</p><p>The crime novel takes place in a quiet retirement village, where four unlikely friends meet weekly to discuss unsolved crimes but are unexpectedly thrown into the middle of a real-life case when a local developer is found dead. </p><p>Speaking about his literary achievement, Richard told the publication: ‘Sociologically I find it fascinating, personally I find it humbling and, as someone who’s obsessed with numbers, I find it exciting.</p><p>His novel will be only the second adult fiction hardback to sell more than one million copies in the UK this century; the last novel to reach the rare achievement was <i>The Tattooist of Auschwitz</i> by Heather Morris. </p><p><i>The Thursday Murder Club</i> was published by Viking in September and quickly shot to No 1 in the charts and has remained in the top ten fiction hardbacks ever since. By the week ending March 13th, the novel had amazingly sold 979,426 copies and is incredibly set to reach seven figures this week.</p><p>The House of Games presenter said he had ‘always’ wanted to write crime novels and started the book three years ago. Two more instalments have already been commissioned while Steven Spielberg has snapped up the film rights. </p></blockquote><p>I’ll check the book out at some point, as there is certainly a large Agatha Christie-sized hole in the murder mystery market, but I very much doubt the book is truly the stunning masterpiece of a literary debut that its success would seem to indicate. On the other hand, here is what happens to legitimate talents <a href=\"https://www.rt.com/sport/518783-djokovic-serbian-model-claims-sex-tape-plot/\" rel=\"noopener\" target=\"_blank\">who don’t take the ticket</a>.</p><blockquote><p>Serbian stunner Natalija Scekic has sensationally claimed that she was offered €60,000 to seduce Novak Djokovic and capture a sexual encounter between the pair on tape in order to ruin the tennis star’s image and marriage.</p><p>Scekic said she jetted to London for what she thought was a business meeting, only for an unnamed acquaintance to propose a honey trap to tarnish the reputation of 18-time Grand Slam winner Djokovic.</p><p>“It is true that a guy contacted me. I know him from the city [of London] and I considered him a serious guy,” Scekic told <i>Svet &amp; Scandal</i> magazine earlier this month, as reported by Marca. “I am familiar with their work and they were good. When he asked me for a date, I thought it was for a business matter. However, as the conversation progressed, I saw that it had nothing to do with my life. I thought it was a hidden camera when he told me that I had to seduce Novak and film it, but not to worry about that because he was already taking care of that. He told me I could get about €60,000 ($71,000) for that and a trip wherever I wanted.”</p></blockquote><p>Never, ever, trust an attractive woman whose attraction to you appears unexpected, irrational, or otherwise outside your usual experience. Especially if you’re married. And extra-especially if she’s more attractive than the average woman who has shown interest in you in the past. She is invariably being paid by someone else to compromise you in one way or another.</p></div>",
  "content_text": "This is what a ticket-taker\nlooks like\n:\nQuiz show star Richard Osman is set to sell his millionth copy of his debut novel this week, making it only the second adult fiction hardback to reach the milestone in the UK this century. The Pointless co-presenter, 50, admitted he was ‘excited’ by the soaring sales figures of\nThe Thursday Murder Club\n, the Times reported.\nThe crime novel takes place in a quiet retirement village, where four unlikely friends meet weekly to discuss unsolved crimes but are unexpectedly thrown into the middle of a real-life case when a local developer is found dead.\nSpeaking about his literary achievement, Richard told the publication: ‘Sociologically I find it fascinating, personally I find it humbling and, as someone who’s obsessed with numbers, I find it exciting.\nHis novel will be only the second adult fiction hardback to sell more than one million copies in the UK this century; the last novel to reach the rare achievement was\nThe Tattooist of Auschwitz\nby Heather Morris.\nThe Thursday Murder Club\nwas published by Viking in September and quickly shot to No 1 in the charts and has remained in the top ten fiction hardbacks ever since. By the week ending March 13th, the novel had amazingly sold 979,426 copies and is incredibly set to reach seven figures this week.\nThe House of Games presenter said he had ‘always’ wanted to write crime novels and started the book three years ago. Two more instalments have already been commissioned while Steven Spielberg has snapped up the film rights.\nI’ll check the book out at some point, as there is certainly a large Agatha Christie-sized hole in the murder mystery market, but I very much doubt the book is truly the stunning masterpiece of a literary debut that its success would seem to indicate. On the other hand, here is what happens to legitimate talents\nwho don’t take the ticket\n.\nSerbian stunner Natalija Scekic has sensationally claimed that she was offered €60,000 to seduce Novak Djokovic and capture a sexual encounter between the pair on tape in order to ruin the tennis star’s image and marriage.\nScekic said she jetted to London for what she thought was a business meeting, only for an unnamed acquaintance to propose a honey trap to tarnish the reputation of 18-time Grand Slam winner Djokovic.\n“It is true that a guy contacted me. I know him from the city [of London] and I considered him a serious guy,” Scekic told\nSvet & Scandal\nmagazine earlier this month, as reported by Marca. “I am familiar with their work and they were good. When he asked me for a date, I thought it was for a business matter. However, as the conversation progressed, I saw that it had nothing to do with my life. I thought it was a hidden camera when he told me that I had to seduce Novak and film it, but not to worry about that because he was already taking care of that. He told me I could get about €60,000 ($71,000) for that and a trip wherever I wanted.”\nNever, ever, trust an attractive woman whose attraction to you appears unexpected, irrational, or otherwise outside your usual experience. Especially if you’re married. And extra-especially if she’s more attractive than the average woman who has shown interest in you in the past. She is invariably being paid by someone else to compromise you in one way or another.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-22T20:00:03+00:00"
}