{
  "url": "https://voxday.net/2021/03/07/an-army-of-retards/",
  "scraped_at": "2025-12-21T22:40:17.033789",
  "title": "An Army of retards",
  "date_display": "March 7, 2021",
  "date_iso": "2021-03-07T10:48:10+00:00",
  "date_from_url": "2021-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The USA is going to lose its next war, and in a manner that will not permit apologists to claim “well, we didn’t really try” or “the politicians sold us out” as they have with Vietnam and Korea. The reason is that <a href=\"https://www.unz.com/akarlin/woke-mil/\" rel=\"noopener\" target=\"_blank\">the cognitive capability of the officer class is collapsing</a>.</p><blockquote><p>On paper, the US still has by far the world’s strongest military. This is the case whether or not you measure it by military spending, by various indices of military power (e.g. MEU, CAP, or the CMP developed on this blog), or as pertains to the narrower if arguably more relevant naval sphere, by naval megatonnage (even if the gap with China rapidly shrinks as the PLAN adds the equivalent of a major European Great Power navy every single year).</p><p>However, there are increasing reasons to think that large parts of this superiority could be becoming illusory – a dangerous state of affairs, given the recovery of bipartisan support for US military intervention and American elites’ oft-stated confidence in their military supremacy.</p><p>Some of these reasons are well covered in the military/strategy sphere, such as those relating to issues of the technological convergence of Chinese and other potential adversaries’ weapons systems. The most hyped example are Russian/Chinese hypersonic weapons, though there are many more prosaic examples, ranging from progressive improvements in Chinese fighter engines to the unexpected precision of Iranian ballistic missiles. This is accompanied by US procurement failures, with the F-35 program being the most high-profile example. However, what has not been written as much about is the rapid degradation of the human capital component in the US military – a factor that is no less important than military capital or technological prowess.</p><p>Fundamentally, you need your military forces to be staffed with high IQ and well trained men with high morale and commitment to its cause. High IQ is especially important in commanding positions and in the more “g loaded” services. According to a 2015 paper by M.F. Cancian and M.W. Klein, it seems to have been going rapidly down even before the diversity drives of the 2010s. The cognitive performance of US Marine officers has seen a 10 IQ point decline between the 1980s and 2010.</p></blockquote><p>A ten-point decline is even worse than my calculations of the decline in average intelligence of the US population since 1960. My suspicion is that feminism has exacerbated the problem, as the most intelligent women from the most intelligent ethnic groups are failing to marry or have children, thereby multiplying the negative effects of non-European immigration.</p><blockquote><p>By multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.</p><p>Even the left-wing British paper, <i>The Guardian</i>, was recently forced to take note of this phenomenon, as it reported that scientists have determined genes influence academic ability across all subjects, and that as much as 60 percent of the observed differences between various population groups can be explained by genetic factors. So, the mass migration of the last 50 years has been materially dysgenic and has literally made Americans stupider on average. It’s not just you, mass entertainment really has been dumbed down in recent decades in order to appeal to what is an even lower common denominator than before.</p><p>Whatever one thinks of these changes, this is one of the fastest demographic transformations of a nation in recorded human history, and it is the direct result of public policy.</p></blockquote><p>The USA is already Portugal with nukes. No wonder Russia and China are increasingly confident of their ability to break free of the post-WWII neoliberal order. A military whose strength is diversity is a military that lacks any actual strengths and will soon be defeated.</p></div>",
  "content_text": "The USA is going to lose its next war, and in a manner that will not permit apologists to claim “well, we didn’t really try” or “the politicians sold us out” as they have with Vietnam and Korea. The reason is that\nthe cognitive capability of the officer class is collapsing\n.\nOn paper, the US still has by far the world’s strongest military. This is the case whether or not you measure it by military spending, by various indices of military power (e.g. MEU, CAP, or the CMP developed on this blog), or as pertains to the narrower if arguably more relevant naval sphere, by naval megatonnage (even if the gap with China rapidly shrinks as the PLAN adds the equivalent of a major European Great Power navy every single year).\nHowever, there are increasing reasons to think that large parts of this superiority could be becoming illusory – a dangerous state of affairs, given the recovery of bipartisan support for US military intervention and American elites’ oft-stated confidence in their military supremacy.\nSome of these reasons are well covered in the military/strategy sphere, such as those relating to issues of the technological convergence of Chinese and other potential adversaries’ weapons systems. The most hyped example are Russian/Chinese hypersonic weapons, though there are many more prosaic examples, ranging from progressive improvements in Chinese fighter engines to the unexpected precision of Iranian ballistic missiles. This is accompanied by US procurement failures, with the F-35 program being the most high-profile example. However, what has not been written as much about is the rapid degradation of the human capital component in the US military – a factor that is no less important than military capital or technological prowess.\nFundamentally, you need your military forces to be staffed with high IQ and well trained men with high morale and commitment to its cause. High IQ is especially important in commanding positions and in the more “g loaded” services. According to a 2015 paper by M.F. Cancian and M.W. Klein, it seems to have been going rapidly down even before the diversity drives of the 2010s. The cognitive performance of US Marine officers has seen a 10 IQ point decline between the 1980s and 2010.\nA ten-point decline is even worse than my calculations of the decline in average intelligence of the US population since 1960. My suspicion is that feminism has exacerbated the problem, as the most intelligent women from the most intelligent ethnic groups are failing to marry or have children, thereby multiplying the negative effects of non-European immigration.\nBy multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.\nEven the left-wing British paper,\nThe Guardian\n, was recently forced to take note of this phenomenon, as it reported that scientists have determined genes influence academic ability across all subjects, and that as much as 60 percent of the observed differences between various population groups can be explained by genetic factors. So, the mass migration of the last 50 years has been materially dysgenic and has literally made Americans stupider on average. It’s not just you, mass entertainment really has been dumbed down in recent decades in order to appeal to what is an even lower common denominator than before.\nWhatever one thinks of these changes, this is one of the fastest demographic transformations of a nation in recorded human history, and it is the direct result of public policy.\nThe USA is already Portugal with nukes. No wonder Russia and China are increasingly confident of their ability to break free of the post-WWII neoliberal order. A military whose strength is diversity is a military that lacks any actual strengths and will soon be defeated.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-07T10:48:10+00:00"
}