{
  "url": "https://voxday.net/2021/03/08/everything-will-never-be-enough/",
  "scraped_at": "2025-12-21T22:40:26.311789",
  "title": "Everything will never be enough",
  "date_display": "March 8, 2021",
  "date_iso": "2021-03-08T10:39:18+00:00",
  "date_from_url": "2021-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can allow an African to marry your posterity. You can load them down with money, titles, precious jewels, and property. You can give them fame, fortune, and family. And <a href=\"https://www.dailymail.co.uk/news/article-9337047/Meghan-claims-Royals-banned-Archie-Prince-concerns-dark-be.html\" rel=\"noopener\" target=\"_blank\">they will still not even hesitate to call you racist</a> the moment it suits them to do so:</p><blockquote><p>Meghan Markle today used her bombshell Oprah Winfrey interview to accuse the Royal Family of having ‘concerns’ about ‘how dark’ Archie’s skin would be before he was born because she is mixed-race and Harry is white.</p><p>The Duchess of Sussex also described her ‘pain’ that officials had denied Archie the title of prince and accused Buckingham Palace of failing to protect him by denying him 24/7 security.</p><p>Meghan refused to say which royal had the conversation with Harry about Archie’s skin colour, claiming it would be ‘damaging’ to the person in her husband’s family who raised it. She told Miss Winfrey that it was ‘a pretty safe’ assumption to suggest that the royal family member was ‘concerned’ that Archie being ‘too brown’ was ‘a problem’. </p><p>When asked if it was ‘important’ for Meghan that Archie be called a prince, she said she doesn’t have any attachment to the ‘grandeur’ of official titles. But she said it was about ‘the idea of our son not being safe, and also the idea of the first member of colour in this family not being titled in the same way that other grandchildren would be.’ </p></blockquote><p>Unlike most other peoples, Europeans have always been suckers for sob stories. There is a reason you don’t see UNICEF and the WWF advertising in Asian nations. There is a reason it was British pop stars declaring they were the world and trying to raise money for starving Ethiopians in the 80s, and not Russian or Brazilian pop stars. But Europeans are particular suckers for African grifters. I’ve known two of the latter fairly well, and you would be astonished at how many second chances both of them were given by every single white authority in their lives. I mean, their second chances were measured in the <i>dozens</i>.</p></div>",
  "content_text": "You can allow an African to marry your posterity. You can load them down with money, titles, precious jewels, and property. You can give them fame, fortune, and family. And\nthey will still not even hesitate to call you racist\nthe moment it suits them to do so:\nMeghan Markle today used her bombshell Oprah Winfrey interview to accuse the Royal Family of having ‘concerns’ about ‘how dark’ Archie’s skin would be before he was born because she is mixed-race and Harry is white.\nThe Duchess of Sussex also described her ‘pain’ that officials had denied Archie the title of prince and accused Buckingham Palace of failing to protect him by denying him 24/7 security.\nMeghan refused to say which royal had the conversation with Harry about Archie’s skin colour, claiming it would be ‘damaging’ to the person in her husband’s family who raised it. She told Miss Winfrey that it was ‘a pretty safe’ assumption to suggest that the royal family member was ‘concerned’ that Archie being ‘too brown’ was ‘a problem’.\nWhen asked if it was ‘important’ for Meghan that Archie be called a prince, she said she doesn’t have any attachment to the ‘grandeur’ of official titles. But she said it was about ‘the idea of our son not being safe, and also the idea of the first member of colour in this family not being titled in the same way that other grandchildren would be.’\nUnlike most other peoples, Europeans have always been suckers for sob stories. There is a reason you don’t see UNICEF and the WWF advertising in Asian nations. There is a reason it was British pop stars declaring they were the world and trying to raise money for starving Ethiopians in the 80s, and not Russian or Brazilian pop stars. But Europeans are particular suckers for African grifters. I’ve known two of the latter fairly well, and you would be astonished at how many second chances both of them were given by every single white authority in their lives. I mean, their second chances were measured in the\ndozens\n.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-08T10:39:18+00:00"
}