{
  "url": "https://voxday.net/2021/03/10/in-which-i-disagree/",
  "scraped_at": "2025-12-21T22:40:43.813239",
  "title": "In which I disagree",
  "date_display": "March 10, 2021",
  "date_iso": "2021-03-10T16:07:51+00:00",
  "date_from_url": "2021-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Herald, Arkhaven’s excellent lead blogger, has pronounced his judgment of <i>Wanda Vision</i>: <a href=\"https://arkhavencomics.com/2021/03/05/the-dark-herald-does-not-recommend-wanda-vision/\" rel=\"noopener\" target=\"_blank\">acceptably mediocre</a>, in a spoiler-filled review of the nine-episode Marvel series:</p><blockquote><p>And that is all that Wanda Vision is.  Acceptably mediocre.  The fans came up with much more interesting theories than the show eventually delivered to its audience. Still better than DC, is about as high a bar as Marvel can manage at this point.  And they can only achieve that level of excellence because DC keeps lowering the bar.</p><p>I think it’s easier to start with what wasn’t Marvel’s fault.  </p><p>In 2020 Disney had discovered the rather disturbing viewer practice of “streamer branch swinging.”  Since most people can’t afford all of the streaming services, they only subscribe to one long enough to watch the “halo properties” and then cancel once they’ve seen them.  Consequently, Disney decided to take what was a six-episode mini-series and drag it out for nine episodes.  The first three episodes were clearly originally meant to be one episode.  It would have still been a bowl of “meh” but at least it would have been a well-paced one.  As it was, we got to see three episodes inside of Wanda’s TV world without any real plot progression over the course of three weeks.  Basically, the first act went on way too long, and it wasn’t planned that way. The end result was that the audience became disengaged and left.</p><p>This was a disastrous mistake made by Bob Chapek’s bean-counters.  Anyone from the creative side of things would have immediately recognized that this would ruin the pacing and it did.  However, Chapek is an accountant with the soul of an accountant and now the clerks from budgeting are making terrible decisions based on “data-driven audience insights.”  Except, by the time you have the data, the audience has already canceled Disney Plus and is giving HBOmax another shot because they want to watch the Snyder Cut.</p><p>The second problem was also delivered courtesy of Disney.  </p><p>When the higher-ups at Disney got pissed off because Gina Carrano compared the persecution of pro-Trumpers to the persecution of Jews by the Nazis, they fired her in a rage.  How dare she compare our righteous pogrom against redneck-terrorists with the holocaust?!  And the blowback from the fans killed all social media engagement with Wanda Vision.  Everyone stopped talking about the show.  Great call Bob!</p><p>As for the show itself, the whole thing was a nothing burger.  All of the reveals that were hinted at ended up being duller than the actual plot.  If you googled Twins of the Scarlett Witch, then you already know how it ended….</p><p>It was all about female empowerment.  </p><p>That was what the show was really about.  It was a replay of Captain Marvel’s basic message of a woman needing to break through the emotional baggage that was restraining her in order to reach her full potential.</p><p>So far as the show’s creators were concerned, what Wanda did, in the end, was sad but of course quite necessary.  Because domestic happiness was always just an illusion created by decades of TV sitcoms to keep women down.  She had to discard these illusions so that the Scarlett Witch could rise unencumbered by the ties of family life. </p><p>A normal feminine desire to have a home, a husband, and children were the chains that bound her.  At the end of the show, she chose to abandon all these things and become the Scarlett Witch. Even though that would mean she would be alone.  But that was the price she was going to have to pay in order to reach her fullest potential.</p><p>Wanda’s family had to be destroyed in order for her to be empowered.</p></blockquote><p>While I always hesitate to share an opinion that is massively less-informed than a genuine expert’s perspective, what I think we have here is a distinction between an informed Marvel fan’s perspective and an uninformed non-Marvel non-fan’s perspective on the series. Unlike Dark Herald, I didn’t watch <i>Wanda Vision</i> from the perspective of someone who knew considerably more about the subject than having seen less than half of the MCU movies, most of which had only been viewed in order to learn how to write superhero movie scripts.</p><p>And at least from the ignorant, non-Marvel non-fan’s perspective, <i>Wanda Vision</i> was a surprisingly good, surprisingly powerful story about a woman wrestling with horrific grief. The alternative interpretations and possibilities that were not pursued are meaningless to me, because I didn’t know anything about the various historical storylines from the original comics, and therefore the production pyrotechnics with the evolving TV sitcom styles were presented were sufficiently intriguing to hold my interest in that regard.</p><p>There was, of course, an amount of the usual Marvel SJW nonsense, but it was minimal by today’s standards and did not conflict with the storytelling. As for the feminism, while that may have been how the core storyteller managed to get the whole thing greenlighted by Marvel’s congerged management, I don’t think that was what the show was really about. </p><p>The key factor, to me, is that Wanda’s family didn’t exist. None of what she sacrificed was real. She was stubbornly dwelling inside a false reality of her own creation because she could not bear to accept the pain of her loss. And that story, or at least that element of the story, was a genuinely powerful one. The Wanda Maximoff portrayed in <i>Wanda Vision</i> was easily the most sympathetic character I’ve ever seen in a comic derivative.(1) To me, <i>Wanda Vision</i> wasn’t about the rejection of home, husband, and children, but to the contrary, about the supreme importance and desirability of those things, because the viewer could not grasp the depth of Wanda’s grief and sense of loss if that were not the case.</p><p>Which is why I thought it was considerably better than acceptably mediocre. If everything Marvel produced was similarly “mediocre”, it wouldn’t be in freefall. Of course, I still cannot recommend that anyone watch it, if doing so were to require supporting the Devil Mouse in any way, shape, or form.</p><p><i>(1) Pepper Potts from the original Iron Man movie remains my favorite, of course.</i></p></div>",
  "content_text": "The Dark Herald, Arkhaven’s excellent lead blogger, has pronounced his judgment of\nWanda Vision\n:\nacceptably mediocre\n, in a spoiler-filled review of the nine-episode Marvel series:\nAnd that is all that Wanda Vision is.  Acceptably mediocre.  The fans came up with much more interesting theories than the show eventually delivered to its audience. Still better than DC, is about as high a bar as Marvel can manage at this point.  And they can only achieve that level of excellence because DC keeps lowering the bar.\nI think it’s easier to start with what wasn’t Marvel’s fault.\nIn 2020 Disney had discovered the rather disturbing viewer practice of “streamer branch swinging.”  Since most people can’t afford all of the streaming services, they only subscribe to one long enough to watch the “halo properties” and then cancel once they’ve seen them.  Consequently, Disney decided to take what was a six-episode mini-series and drag it out for nine episodes.  The first three episodes were clearly originally meant to be one episode.  It would have still been a bowl of “meh” but at least it would have been a well-paced one.  As it was, we got to see three episodes inside of Wanda’s TV world without any real plot progression over the course of three weeks.  Basically, the first act went on way too long, and it wasn’t planned that way. The end result was that the audience became disengaged and left.\nThis was a disastrous mistake made by Bob Chapek’s bean-counters.  Anyone from the creative side of things would have immediately recognized that this would ruin the pacing and it did.  However, Chapek is an accountant with the soul of an accountant and now the clerks from budgeting are making terrible decisions based on “data-driven audience insights.”  Except, by the time you have the data, the audience has already canceled Disney Plus and is giving HBOmax another shot because they want to watch the Snyder Cut.\nThe second problem was also delivered courtesy of Disney.\nWhen the higher-ups at Disney got pissed off because Gina Carrano compared the persecution of pro-Trumpers to the persecution of Jews by the Nazis, they fired her in a rage.  How dare she compare our righteous pogrom against redneck-terrorists with the holocaust?!  And the blowback from the fans killed all social media engagement with Wanda Vision.  Everyone stopped talking about the show.  Great call Bob!\nAs for the show itself, the whole thing was a nothing burger.  All of the reveals that were hinted at ended up being duller than the actual plot.  If you googled Twins of the Scarlett Witch, then you already know how it ended….\nIt was all about female empowerment.\nThat was what the show was really about.  It was a replay of Captain Marvel’s basic message of a woman needing to break through the emotional baggage that was restraining her in order to reach her full potential.\nSo far as the show’s creators were concerned, what Wanda did, in the end, was sad but of course quite necessary.  Because domestic happiness was always just an illusion created by decades of TV sitcoms to keep women down.  She had to discard these illusions so that the Scarlett Witch could rise unencumbered by the ties of family life.\nA normal feminine desire to have a home, a husband, and children were the chains that bound her.  At the end of the show, she chose to abandon all these things and become the Scarlett Witch. Even though that would mean she would be alone.  But that was the price she was going to have to pay in order to reach her fullest potential.\nWanda’s family had to be destroyed in order for her to be empowered.\nWhile I always hesitate to share an opinion that is massively less-informed than a genuine expert’s perspective, what I think we have here is a distinction between an informed Marvel fan’s perspective and an uninformed non-Marvel non-fan’s perspective on the series. Unlike Dark Herald, I didn’t watch\nWanda Vision\nfrom the perspective of someone who knew considerably more about the subject than having seen less than half of the MCU movies, most of which had only been viewed in order to learn how to write superhero movie scripts.\nAnd at least from the ignorant, non-Marvel non-fan’s perspective,\nWanda Vision\nwas a surprisingly good, surprisingly powerful story about a woman wrestling with horrific grief. The alternative interpretations and possibilities that were not pursued are meaningless to me, because I didn’t know anything about the various historical storylines from the original comics, and therefore the production pyrotechnics with the evolving TV sitcom styles were presented were sufficiently intriguing to hold my interest in that regard.\nThere was, of course, an amount of the usual Marvel SJW nonsense, but it was minimal by today’s standards and did not conflict with the storytelling. As for the feminism, while that may have been how the core storyteller managed to get the whole thing greenlighted by Marvel’s congerged management, I don’t think that was what the show was really about.\nThe key factor, to me, is that Wanda’s family didn’t exist. None of what she sacrificed was real. She was stubbornly dwelling inside a false reality of her own creation because she could not bear to accept the pain of her loss. And that story, or at least that element of the story, was a genuinely powerful one. The Wanda Maximoff portrayed in\nWanda Vision\nwas easily the most sympathetic character I’ve ever seen in a comic derivative.(1) To me,\nWanda Vision\nwasn’t about the rejection of home, husband, and children, but to the contrary, about the supreme importance and desirability of those things, because the viewer could not grasp the depth of Wanda’s grief and sense of loss if that were not the case.\nWhich is why I thought it was considerably better than acceptably mediocre. If everything Marvel produced was similarly “mediocre”, it wouldn’t be in freefall. Of course, I still cannot recommend that anyone watch it, if doing so were to require supporting the Devil Mouse in any way, shape, or form.\n(1) Pepper Potts from the original Iron Man movie remains my favorite, of course.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-10T16:07:51+00:00"
}