{
  "url": "https://voxday.net/2021/03/09/living-the-faith/",
  "scraped_at": "2025-12-21T22:40:40.139614",
  "title": "Living the faith",
  "date_display": "March 9, 2021",
  "date_iso": "2021-03-09T22:37:35+00:00",
  "date_from_url": "2021-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve always been pleased to call Milo my friend. Today, <a href=\"https://www.lifesitenews.com/news/activist-milo-yiannopoulos-is-now-ex-gay-consecrating-his-life-to-st-joseph\" rel=\"noopener\" target=\"_blank\">I am proud to do so</a>:</p><blockquote><p>Milo Yiannopoulos, the gay man whose conservative messaging and willingness to speak the truth sparked riots on university campuses may well trigger more outrage now that he describes himself as “Ex-Gay” and “sodomy free,” and is leading a daily consecration to St. Joseph online.</p><p>Two years ago, when Church Militant’s Michael Voris famously challenged Yiannopoulos to live a chaste life, Yiannopoulos was not defensive. Instead, he acquiesced, and humbly admitted his human weakness.</p><p>“I know everything you’re saying, and I’m just not there yet. And I don’t know if I’ll get there,” Yiannopoulos told Voris at the time.</p><p>It seems that he has now arrived “there.”</p><p>LifeSite: I imagine that to many who follow you, your recent decision to publicly identify as “Milo, Ex-Gay” may seem like a 180-degree turn. Are you also surprised that your life has taken this turn? Or is it unsurprising, a natural and perhaps inevitable progression in your life? I ask this because over the last few years things that you’ve said have hinted at being drawn in this direction.</p><p>Milo: When I used to kid that I only became gay to torment my mother, I wasn’t entirely joking. Of course, I was never wholly at home in the gay lifestyle — Who is? Who could be? — and only leaned heavily into it in public because it drove liberals crazy to see a handsome, charismatic, intelligent gay man riotously celebrating conservative principles.</p><p>That’s not to say I didn’t throw myself enthusiastically into degeneracy of all kinds in my private life. I suppose I felt that’s all I deserved. I’d love to say it was all an act, and I’ve been straight this whole time, but even I don’t have that kind of commitment to performance art. Talk about method acting …</p><p>LifeSite: Was there any event, or series of events, that triggered your decision to become “sodomy free,” and to do so publicly? Did God knock you off your horse as he did Saul; or did it come about some other way? Please explain.</p><p>Milo: Four years ago, I gave an interview to America magazine which they declined to print. It’s taken me a long time to live up to the claims I made in that interview, but I am finally doing it. Anyone who’s read me closely over the past decade must surely have seen this coming. I wasn’t shy about dropping hints. In my New York Times-bestselling book <i>Dangerous</i>, I heavily hinted I might be “coming out” as straight in the future. And in my recent stream-of-consciousness Telegram feed, I’ve been even more explicit — stomach-churningly so, if the comments under my “x days without sodomy” posts are anything to go by.</p><p>I’ve always thought of myself as a Jack Bauer sort of figure — the guy who does the hideous, inexcusable things no one else can stomach, without which the Republic will fall. I know that means my name will always be cursed, and I’ll always be a scorned outsider, so the temptation is to throw out any consideration of living well or truthfully. But even Jack Bauer has to confront his maker sooner or later.</p></blockquote><p>No doubt there will be no shortage of doubters, of those who will believe this is merely Milo, having run out of conventional outrages to commit in an openly wicked society, is now finding a new way to break the outrage barrier. But I have less doubt in the sincerity of Milo’s belief in, and fear of, God than I do in the average well-behaved churchgoing Christian man’s.</p><p>Milo is a man of spectacular gifts and equally spectacular flaws. But he is also a man of unusual courage. And if you doubt his sincerity, then I suggest that you pray for him to find it.</p></div>",
  "content_text": "I’ve always been pleased to call Milo my friend. Today,\nI am proud to do so\n:\nMilo Yiannopoulos, the gay man whose conservative messaging and willingness to speak the truth sparked riots on university campuses may well trigger more outrage now that he describes himself as “Ex-Gay” and “sodomy free,” and is leading a daily consecration to St. Joseph online.\nTwo years ago, when Church Militant’s Michael Voris famously challenged Yiannopoulos to live a chaste life, Yiannopoulos was not defensive. Instead, he acquiesced, and humbly admitted his human weakness.\n“I know everything you’re saying, and I’m just not there yet. And I don’t know if I’ll get there,” Yiannopoulos told Voris at the time.\nIt seems that he has now arrived “there.”\nLifeSite: I imagine that to many who follow you, your recent decision to publicly identify as “Milo, Ex-Gay” may seem like a 180-degree turn. Are you also surprised that your life has taken this turn? Or is it unsurprising, a natural and perhaps inevitable progression in your life? I ask this because over the last few years things that you’ve said have hinted at being drawn in this direction.\nMilo: When I used to kid that I only became gay to torment my mother, I wasn’t entirely joking. Of course, I was never wholly at home in the gay lifestyle — Who is? Who could be? — and only leaned heavily into it in public because it drove liberals crazy to see a handsome, charismatic, intelligent gay man riotously celebrating conservative principles.\nThat’s not to say I didn’t throw myself enthusiastically into degeneracy of all kinds in my private life. I suppose I felt that’s all I deserved. I’d love to say it was all an act, and I’ve been straight this whole time, but even I don’t have that kind of commitment to performance art. Talk about method acting …\nLifeSite: Was there any event, or series of events, that triggered your decision to become “sodomy free,” and to do so publicly? Did God knock you off your horse as he did Saul; or did it come about some other way? Please explain.\nMilo: Four years ago, I gave an interview to America magazine which they declined to print. It’s taken me a long time to live up to the claims I made in that interview, but I am finally doing it. Anyone who’s read me closely over the past decade must surely have seen this coming. I wasn’t shy about dropping hints. In my New York Times-bestselling book\nDangerous\n, I heavily hinted I might be “coming out” as straight in the future. And in my recent stream-of-consciousness Telegram feed, I’ve been even more explicit — stomach-churningly so, if the comments under my “x days without sodomy” posts are anything to go by.\nI’ve always thought of myself as a Jack Bauer sort of figure — the guy who does the hideous, inexcusable things no one else can stomach, without which the Republic will fall. I know that means my name will always be cursed, and I’ll always be a scorned outsider, so the temptation is to throw out any consideration of living well or truthfully. But even Jack Bauer has to confront his maker sooner or later.\nNo doubt there will be no shortage of doubters, of those who will believe this is merely Milo, having run out of conventional outrages to commit in an openly wicked society, is now finding a new way to break the outrage barrier. But I have less doubt in the sincerity of Milo’s belief in, and fear of, God than I do in the average well-behaved churchgoing Christian man’s.\nMilo is a man of spectacular gifts and equally spectacular flaws. But he is also a man of unusual courage. And if you doubt his sincerity, then I suggest that you pray for him to find it.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-09T22:37:35+00:00"
}