{
  "url": "https://voxday.net/2021/03/15/officially-the-old-guy/",
  "scraped_at": "2025-12-21T22:41:19.213544",
  "title": "Officially the old guy",
  "date_display": "March 15, 2021",
  "date_iso": "2021-03-15T23:34:04+00:00",
  "date_from_url": "2021-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the hard things about veterans’ sports is that it’s only a matter of time before the old guy retires. It’s strange, because it’s not like anything changes all that much, but somehow, it’s never quite the same once a player stops showing up for practice. Sometimes it’s a job, sometimes it’s family circumstances, but usually it’s an injury of some sort that is the cause. Sometimes it’s serious and there is no choice. More often, it’s a nagging minor injury that the player simply can’t manage to shake, and which reminds him of his mortality.</p><p>Soccer is a young man’s game. Veteran status over here begins at 32. I was already quite old for a player when I joined my current team 10 years ago, but somehow I’ve managed to hold my own despite slowing down a little and being moved from striker to the wing. I even scored a few goals in the most recent season, including one game-winner. But I was never the oldest on the team, in fact, I’ve never been the oldest player on any team dating back to when I first started playing at the age of 7 for the North Suburban Soccer Association.</p><p>I am 11 months younger than my teammate S, a tough defender who deceptively looks about 10 years younger than his 53 years – he also looks <i>exactly </i>like the Bond actor Christopher Walz – although unfortunately, he is now my former teammate, having announced his retirement from the club to the team tonight. So, as of now, I am officially “the old guy”.</p><p>I don’t know how long I’ll be able to keep playing. When I was 45, an opposing player of the same age and I agreed that we would try to play until 50. Five years later, we both had a good game against each other, and declared that we could easily make it to 55. But tonight, after S’s announcement, the end of the road suddenly feels as if it is looming just a little bit closer than before.</p><p>I’ve been very, very lucky. I’ve been fortunate to play at a higher level than I ever imagined, to play against better competition than I ever expected, and to have been a part of five championship teams since I moved to Europe. There are still few things I enjoy more than the intoxicating thrill of finding the open space, kicking the ball and seeing it flash past the keeper into the back of the net. I don’t want to stop. I have no intention of stopping. But I know that Father Time always wins in the end.</p><p>Nevertheless, I’ll play as long and as hard as I can, until it comes time for me to take off my jersey for the last time and pass the burden of being the old guy onto the next player in line.</p></div>",
  "content_text": "One of the hard things about veterans’ sports is that it’s only a matter of time before the old guy retires. It’s strange, because it’s not like anything changes all that much, but somehow, it’s never quite the same once a player stops showing up for practice. Sometimes it’s a job, sometimes it’s family circumstances, but usually it’s an injury of some sort that is the cause. Sometimes it’s serious and there is no choice. More often, it’s a nagging minor injury that the player simply can’t manage to shake, and which reminds him of his mortality.\nSoccer is a young man’s game. Veteran status over here begins at 32. I was already quite old for a player when I joined my current team 10 years ago, but somehow I’ve managed to hold my own despite slowing down a little and being moved from striker to the wing. I even scored a few goals in the most recent season, including one game-winner. But I was never the oldest on the team, in fact, I’ve never been the oldest player on any team dating back to when I first started playing at the age of 7 for the North Suburban Soccer Association.\nI am 11 months younger than my teammate S, a tough defender who deceptively looks about 10 years younger than his 53 years – he also looks\nexactly\nlike the Bond actor Christopher Walz – although unfortunately, he is now my former teammate, having announced his retirement from the club to the team tonight. So, as of now, I am officially “the old guy”.\nI don’t know how long I’ll be able to keep playing. When I was 45, an opposing player of the same age and I agreed that we would try to play until 50. Five years later, we both had a good game against each other, and declared that we could easily make it to 55. But tonight, after S’s announcement, the end of the road suddenly feels as if it is looming just a little bit closer than before.\nI’ve been very, very lucky. I’ve been fortunate to play at a higher level than I ever imagined, to play against better competition than I ever expected, and to have been a part of five championship teams since I moved to Europe. There are still few things I enjoy more than the intoxicating thrill of finding the open space, kicking the ball and seeing it flash past the keeper into the back of the net. I don’t want to stop. I have no intention of stopping. But I know that Father Time always wins in the end.\nNevertheless, I’ll play as long and as hard as I can, until it comes time for me to take off my jersey for the last time and pass the burden of being the old guy onto the next player in line.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-15T23:34:04+00:00"
}