{
  "url": "https://voxday.net/2021/03/19/patreon-is-a-factory-of-filth/",
  "scraped_at": "2025-12-21T22:41:40.943311",
  "title": "Patreon is a factory of filth",
  "date_display": "March 19, 2021",
  "date_iso": "2021-03-19T18:31:12+00:00",
  "date_from_url": "2021-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Note that the individual <a href=\"https://www.monstersandcritics.com/celebrity/youtuber-yagami-yato-responds-to-allegations-of-sexually-grooming-minors/\" rel=\"noopener\" target=\"_blank\">being accused of targeting minors</a> is the #4 Creator on Patreon, with 22,377 patrons as of today and 819 posts on the Patreon platform:</p><blockquote><p>YouTuber Yagami Yato has spoken out about accusations of providing sexually explicit material to children and of grooming minors.</p><p>Yagami Yato is a voice artist who produces voiceovers for animation videos, usually from anime. Her popular YouTube Channel has over 800,000 followers. Some of her work is considered to be NSFW (not safe for work), which has led to the recent controversy around accusations she has been promoting obscene material to children.</p><p>Her Patreon account is for more explicitly adult work, whereas her YouTube Channel is meant for material appropriate for all ages.</p><p>Fuel was added to the fire a few days ago when an anonymous Twitter account referring to themselves as Yagami Yato Confessions claimed that Yato had groomed them when they joined her Discord server as a teenager in high school. They claimed that Yato used many minors as her moderators….</p><p>Yagami Yato stated that all her NSFW material will now be locked behind her Patreon account, which has adequate safeguards.</p></blockquote><p>Patreon currently has 45,054 self-identified NSFW creators with one or more patrons, which represents 23.6 percent of its 190,961 creators, and six of the top 25. A considerable number of those NSFW creators feature content on the Patreon platform that is <i>wildly</i> in violation of Patreon’s Community Guidelines, despite Patreon’s public claim to have “zero tolerance” for such content. </p><p>What is significant is that Patreon was previously called on the carpet by its payment processors back in 2017, and in response, <a href=\"https://www.engadget.com/2018-06-29-patreon-crackdown-sex-worker-accounts.html\" rel=\"noopener\" target=\"_blank\">pretended to have dealt with the issue</a> by banning a few porn stars and prostitutes. </p><blockquote><p>Patreon has begun a fresh crackdown on users who make and sell adult-related content services on its crowdsourced patronage platform. The company has begun to suspend and report users who use the site to sell suggestive material, including Vex Ashley, creator of Four Chambers. According to Motherboard, users have been told that the reason for their suspension is “implied nudity.”</p><p>This story begins last September, when Patreon raised $60 million from investors in order to further grow its business. Not long after, the company altered its content policy, replacing vague prohibitions on the sale of illegal adult content with more specific terms. This included a ban on the platform to sell images, video and other material, as well as services such as webcam sessions.</p><p>The move was surprising, since Patreon had allegedly courted, and engaged with, sex workers and performers. These people had come to rely upon Patreon as a source of income, and when the new terms were published, it caused shockwaves in the industry. After a series of news reports, the company attempted to walk back its stance. CEO Jack Conte said that it “broke” his “heart” that the individuals involved were left fearing for their livelihoods, and lives.</p><p>When Engadget spoke to a Patreon spokesperson on the matter, they said that the “the TL;DR is that if what you were doing before was okay, then probably what you’re continuing to do is okay.” There appeared to be an implication, too, that Patreon would only crack down on illegal content, such as bestiality. And that moderators would essentially turn a blind eye to content that took place between consenting adults.</p></blockquote><p>But even a cursory review of the Patreon site today is sufficient to prove otherwise. For example, this is a description of a feature in the #94 creator’s NFSW adult game, <a href=\"https://www.patreon.com/BreedersOfTheNephelym\" rel=\"noopener\" target=\"_blank\">Breeders of the Nephelym</a>, despite Patreon claiming to have a zero-tolerance policy for rape. </p><blockquote><p>Wild Nephelym can be found around the Spawning Shrines. Nephelym can be caught using two different approaches, namely:</p><ul style=\"text-align: left;\"><li>Surprise Sex.</li><li>Giving the Nephelym their preferred liquid. </li></ul></blockquote></div>",
  "content_text": "Note that the individual\nbeing accused of targeting minors\nis the #4 Creator on Patreon, with 22,377 patrons as of today and 819 posts on the Patreon platform:\nYouTuber Yagami Yato has spoken out about accusations of providing sexually explicit material to children and of grooming minors.\nYagami Yato is a voice artist who produces voiceovers for animation videos, usually from anime. Her popular YouTube Channel has over 800,000 followers. Some of her work is considered to be NSFW (not safe for work), which has led to the recent controversy around accusations she has been promoting obscene material to children.\nHer Patreon account is for more explicitly adult work, whereas her YouTube Channel is meant for material appropriate for all ages.\nFuel was added to the fire a few days ago when an anonymous Twitter account referring to themselves as Yagami Yato Confessions claimed that Yato had groomed them when they joined her Discord server as a teenager in high school. They claimed that Yato used many minors as her moderators….\nYagami Yato stated that all her NSFW material will now be locked behind her Patreon account, which has adequate safeguards.\nPatreon currently has 45,054 self-identified NSFW creators with one or more patrons, which represents 23.6 percent of its 190,961 creators, and six of the top 25. A considerable number of those NSFW creators feature content on the Patreon platform that is\nwildly\nin violation of Patreon’s Community Guidelines, despite Patreon’s public claim to have “zero tolerance” for such content.\nWhat is significant is that Patreon was previously called on the carpet by its payment processors back in 2017, and in response,\npretended to have dealt with the issue\nby banning a few porn stars and prostitutes.\nPatreon has begun a fresh crackdown on users who make and sell adult-related content services on its crowdsourced patronage platform. The company has begun to suspend and report users who use the site to sell suggestive material, including Vex Ashley, creator of Four Chambers. According to Motherboard, users have been told that the reason for their suspension is “implied nudity.”\nThis story begins last September, when Patreon raised $60 million from investors in order to further grow its business. Not long after, the company altered its content policy, replacing vague prohibitions on the sale of illegal adult content with more specific terms. This included a ban on the platform to sell images, video and other material, as well as services such as webcam sessions.\nThe move was surprising, since Patreon had allegedly courted, and engaged with, sex workers and performers. These people had come to rely upon Patreon as a source of income, and when the new terms were published, it caused shockwaves in the industry. After a series of news reports, the company attempted to walk back its stance. CEO Jack Conte said that it “broke” his “heart” that the individuals involved were left fearing for their livelihoods, and lives.\nWhen Engadget spoke to a Patreon spokesperson on the matter, they said that the “the TL;DR is that if what you were doing before was okay, then probably what you’re continuing to do is okay.” There appeared to be an implication, too, that Patreon would only crack down on illegal content, such as bestiality. And that moderators would essentially turn a blind eye to content that took place between consenting adults.\nBut even a cursory review of the Patreon site today is sufficient to prove otherwise. For example, this is a description of a feature in the #94 creator’s NFSW adult game,\nBreeders of the Nephelym\n, despite Patreon claiming to have a zero-tolerance policy for rape.\nWild Nephelym can be found around the Spawning Shrines. Nephelym can be caught using two different approaches, namely:\nSurprise Sex.\nGiving the Nephelym their preferred liquid.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2021-03-19T18:31:12+00:00"
}