{
  "url": "https://voxday.net/2021/03/13/physician-heal-thyself/",
  "scraped_at": "2025-12-21T22:41:02.203193",
  "title": "Physician, heal thyself",
  "date_display": "March 13, 2021",
  "date_iso": "2021-03-13T14:00:00+00:00",
  "date_from_url": "2021-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A recent<i> Financial Times</i> review of Jordan Peterson’s new book underlines why it is a very bad idea to take lessons from life’s losers:</p><blockquote><p>Fifty pages into Jordan Peterson’s new book, <i>Beyond Order</i>, I called the FT books editor. I don’t think we ought to review this, I said. I explained that the author had suffered three years of emotional and physical hell, which he dispassionately catalogues in the book’s introduction. He’d become addicted to an anti-anxiety drug, which he started taking after he drank some apple cider that didn’t agree with him.</p><p>He’d tried to come off the drug, had been suicidal and diagnosed with schizophrenia — after which he flew to Moscow against his doctors’ orders to a hospital where they put him in a coma for nine days to help with the detox, after which he had to relearn how to walk. He ended up in a rehab clinic in Serbia — and also contracted Covid-19.</p><p>Over those same three years, his wife nearly died of cancer, and he had to deal with the stress of going from being an obscure Canadian psychology professor to a global sensation doing a 160-stop world tour and being watched by 200m people on YouTube.</p><p>I told the editor that, apart from the brief and riveting “Overture” describing this trip to hell, the new book was so far unreadable. It is billed as a book to comfort us in these unstable times and connect us with our inner strength, partly by showing how much of “life’s meaning” is to be found by reaching beyond the ordered domain of what we know.</p><p>At first glance, the result certainly seems chaotic. One minute Peterson is telling you to imagine who you could be and aim at that, then he’s on about ancient alchemists, then discussing unwelcome letters one might receive from the tax authorities, then back to some mystic stuff about Jupiter and Mars, leading to an extended account of how the snitch in Quidditch, the game played at JK Rowling’s Hogwarts, symbolises chaos. The poor man must have been unwell when he wrote all this, so it would be unfair to trash it.</p><p>I even wondered why the people at Penguin had rushed to publish it, when they should have told him to wait until he was better. </p></blockquote><p>Here is a more useful rule for life than any Jordan Peterson has on offer: don’t take advice from suicidal drug addicts. </p></div>",
  "content_text": "A recent\nFinancial Times\nreview of Jordan Peterson’s new book underlines why it is a very bad idea to take lessons from life’s losers:\nFifty pages into Jordan Peterson’s new book,\nBeyond Order\n, I called the FT books editor. I don’t think we ought to review this, I said. I explained that the author had suffered three years of emotional and physical hell, which he dispassionately catalogues in the book’s introduction. He’d become addicted to an anti-anxiety drug, which he started taking after he drank some apple cider that didn’t agree with him.\nHe’d tried to come off the drug, had been suicidal and diagnosed with schizophrenia — after which he flew to Moscow against his doctors’ orders to a hospital where they put him in a coma for nine days to help with the detox, after which he had to relearn how to walk. He ended up in a rehab clinic in Serbia — and also contracted Covid-19.\nOver those same three years, his wife nearly died of cancer, and he had to deal with the stress of going from being an obscure Canadian psychology professor to a global sensation doing a 160-stop world tour and being watched by 200m people on YouTube.\nI told the editor that, apart from the brief and riveting “Overture” describing this trip to hell, the new book was so far unreadable. It is billed as a book to comfort us in these unstable times and connect us with our inner strength, partly by showing how much of “life’s meaning” is to be found by reaching beyond the ordered domain of what we know.\nAt first glance, the result certainly seems chaotic. One minute Peterson is telling you to imagine who you could be and aim at that, then he’s on about ancient alchemists, then discussing unwelcome letters one might receive from the tax authorities, then back to some mystic stuff about Jupiter and Mars, leading to an extended account of how the snitch in Quidditch, the game played at JK Rowling’s Hogwarts, symbolises chaos. The poor man must have been unwell when he wrote all this, so it would be unfair to trash it.\nI even wondered why the people at Penguin had rushed to publish it, when they should have told him to wait until he was better.\nHere is a more useful rule for life than any Jordan Peterson has on offer: don’t take advice from suicidal drug addicts.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-13T14:00:00+00:00"
}