{
  "url": "https://voxday.net/2021/03/20/planning-to-lose-a-proxy-war/",
  "scraped_at": "2025-12-21T22:41:44.616590",
  "title": "Planning to lose a proxy war",
  "date_display": "March 20, 2021",
  "date_iso": "2021-03-20T12:18:21+00:00",
  "date_from_url": "2021-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The neoclowns running the Biden Not-Administration <a href=\"https://www.unz.com/akarlin/biden-to-exchange-donbass-for-nord-stream/\" rel=\"noopener\" target=\"_blank\">appear to be planning to lose a war</a> between Ukraine and Russia in order to sabotage the Nord Stream 2 pipeline project. </p><blockquote><p>The NAF, to be clear, doesn’t stand any chance in a full scale Ukrainian assault. Even in 2014, when the Ukrainian Army was much less organized, Russian artillery and EW intervention proved critical. The Ukrainian military has since had more than half a decade of getting 5{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of Ukraine’s GDP lavished on it. While Ukraine’s GDP is unimpressive, this is still a high numerator and Russian involvement would have to be more overt than in 2014 if the Donbass is to be saved.</p><p>Considering that 100,000’s of Donbass residents are now also Russian citizens, not doing so would discredit Putin domestically.</p><p>This, then, might be the game plan. By provoking a Russian intervention, it could finally provide the US with the arguments to finally pressure Germany into shutting down Nord Stream 2, just a few months before its projected completion. (Contra popular conceptions, Germany is more invested into NS2 than is Russia, and stands to lose relatively more from a last minute torpedoing of the project). NS2 threatens to deprive Ukraine of $2-3 billion dollars in annual transit fees. These are not insignificant sums for a country with a GDP of $150 billion and are well worth the lives of a few hundred Ukrainian soldiers, who – as Strana‘s sources report – plan to stop the offensive and probably retreat should Russian troops go in….</p><p>There’s another piece of the puzzle that slid into place today. Biden told Putin that “he will pay a price” for his “meddling” in the US elections on coming to power in January. Soon after, no other than RT chief editor Margarita Simonyan was in the LDNR, demanding that Russia take it home in a conference dedicated to the “Doctrine of the Russian Donbass.” I would say that <a href=\"https://www.unz.com/akarlin/the-russian-donbass-is-here-to-stay/\" rel=\"noopener\" target=\"_blank\">this is unlikely to have been a coincidence</a>.</p></blockquote><p>This strategy may appear to be insane from a conventional view of military strategy. But remember, the neoclowns core philosophy is inversive and they have made an art of winning through losing and playing the victim. </p></div>",
  "content_text": "The neoclowns running the Biden Not-Administration\nappear to be planning to lose a war\nbetween Ukraine and Russia in order to sabotage the Nord Stream 2 pipeline project.\nThe NAF, to be clear, doesn’t stand any chance in a full scale Ukrainian assault. Even in 2014, when the Ukrainian Army was much less organized, Russian artillery and EW intervention proved critical. The Ukrainian military has since had more than half a decade of getting 5{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of Ukraine’s GDP lavished on it. While Ukraine’s GDP is unimpressive, this is still a high numerator and Russian involvement would have to be more overt than in 2014 if the Donbass is to be saved.\nConsidering that 100,000’s of Donbass residents are now also Russian citizens, not doing so would discredit Putin domestically.\nThis, then, might be the game plan. By provoking a Russian intervention, it could finally provide the US with the arguments to finally pressure Germany into shutting down Nord Stream 2, just a few months before its projected completion. (Contra popular conceptions, Germany is more invested into NS2 than is Russia, and stands to lose relatively more from a last minute torpedoing of the project). NS2 threatens to deprive Ukraine of $2-3 billion dollars in annual transit fees. These are not insignificant sums for a country with a GDP of $150 billion and are well worth the lives of a few hundred Ukrainian soldiers, who – as Strana‘s sources report – plan to stop the offensive and probably retreat should Russian troops go in….\nThere’s another piece of the puzzle that slid into place today. Biden told Putin that “he will pay a price” for his “meddling” in the US elections on coming to power in January. Soon after, no other than RT chief editor Margarita Simonyan was in the LDNR, demanding that Russia take it home in a conference dedicated to the “Doctrine of the Russian Donbass.” I would say that\nthis is unlikely to have been a coincidence\n.\nThis strategy may appear to be insane from a conventional view of military strategy. But remember, the neoclowns core philosophy is inversive and they have made an art of winning through losing and playing the victim.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-20T12:18:21+00:00"
}