{
  "url": "https://voxday.net/2021/03/27/that-would-be-an-improvement/",
  "scraped_at": "2025-12-21T22:42:31.244400",
  "title": "That would be an improvement",
  "date_display": "March 27, 2021",
  "date_iso": "2021-03-27T11:04:01+00:00",
  "date_from_url": "2021-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no problem knowing that people are loyal to their own. That is good, natural, and true. To fail to be loyal to your own kind is to reduce yourself below the level of the animals, no matter how you try to rationalize your disloyalty. What I have a problem with is people lying to me and telling me that they possess “dual loyalties” when they obviously don’t. However, <a href=\"https://www.timesofisrael.com/in-blunt-interview-pollard-claims-jews-will-always-have-dual-loyalty/\" rel=\"noopener\" target=\"_blank\">what Jonathan Pollard is describing here</a> isn’t actually “dual loyalty”, but rather the loyalty gradient that reflects how humans actually operate:</p><blockquote><p>Asked how he felt about being accused by US Jews of having dual loyalties, Pollard did not take issue with the title. “If you don’t like the accusation of double loyalty, then go the F*** home,” he said bluntly.</p><p>“It’s as simple as that. If you live in a country where you are constantly under that charge, then you don’t belong there. You go home. You come home. If you[‘re] outside Israel, then you live in a society in which you are basically considered unreliable. The bottom line on this charge of dual loyalty is, I’m sorry, we’re Jews, and if we’re Jews, we will always have dual loyalty,” he added.</p><p>An he suggested that if asked for advice, he would counsel a young US Jew working in the American security apparatus to spy for Israel.</p><p>“I’d tell him, not doing anything is unacceptable. So simply going home [to Israel] is not acceptable. Making aliyah is not acceptable,” Pollard said. “You have to make a decision whether your concern for Israel and loyalty to Israel and loyalty to your fellow Jews is more important than your life.</p><p>“If you do nothing, and you turn your back, or simply make aliyah, and go on with your life, you’ll be no better than those Jews who before and after the destruction of the Temple said, ‘It’s not my responsibility.’”</p></blockquote><p>Pollard is rightly regarded by Israel as a hero. And as a traitorous US citizen, Pollard should have been executed for his crimes against the American nation. Nations have interests, they do not have friends. As a general rule, it is wise to take people at their word when they tell you that they are disloyal, or that you are their enemy. </p><p>And as history demonstrates, national governments that permit foreigners to rule over their nation and work in their security apparatuses invariably fall.</p></div>",
  "content_text": "I have no problem knowing that people are loyal to their own. That is good, natural, and true. To fail to be loyal to your own kind is to reduce yourself below the level of the animals, no matter how you try to rationalize your disloyalty. What I have a problem with is people lying to me and telling me that they possess “dual loyalties” when they obviously don’t. However,\nwhat Jonathan Pollard is describing here\nisn’t actually “dual loyalty”, but rather the loyalty gradient that reflects how humans actually operate:\nAsked how he felt about being accused by US Jews of having dual loyalties, Pollard did not take issue with the title. “If you don’t like the accusation of double loyalty, then go the F*** home,” he said bluntly.\n“It’s as simple as that. If you live in a country where you are constantly under that charge, then you don’t belong there. You go home. You come home. If you[‘re] outside Israel, then you live in a society in which you are basically considered unreliable. The bottom line on this charge of dual loyalty is, I’m sorry, we’re Jews, and if we’re Jews, we will always have dual loyalty,” he added.\nAn he suggested that if asked for advice, he would counsel a young US Jew working in the American security apparatus to spy for Israel.\n“I’d tell him, not doing anything is unacceptable. So simply going home [to Israel] is not acceptable. Making aliyah is not acceptable,” Pollard said. “You have to make a decision whether your concern for Israel and loyalty to Israel and loyalty to your fellow Jews is more important than your life.\n“If you do nothing, and you turn your back, or simply make aliyah, and go on with your life, you’ll be no better than those Jews who before and after the destruction of the Temple said, ‘It’s not my responsibility.’”\nPollard is rightly regarded by Israel as a hero. And as a traitorous US citizen, Pollard should have been executed for his crimes against the American nation. Nations have interests, they do not have friends. As a general rule, it is wise to take people at their word when they tell you that they are disloyal, or that you are their enemy.\nAnd as history demonstrates, national governments that permit foreigners to rule over their nation and work in their security apparatuses invariably fall.",
  "tags": [
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-27T11:04:01+00:00"
}