{
  "url": "https://voxday.net/2021/03/28/the-relevance-of-clauswitz/",
  "scraped_at": "2025-12-21T22:42:34.886055",
  "title": "The relevance of Clauswitz",
  "date_display": "March 28, 2021",
  "date_iso": "2021-03-28T13:00:05+00:00",
  "date_from_url": "2021-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Military Strategy Magazine</i> <a href=\"https://www.militarystrategymagazine.com/article/a-note-from-the-editor-the-continuing-relevance-of-clausewitz/\" rel=\"noopener\" target=\"_blank\">devotes an entire issue</a> to the immortal Carl von Clausewitz, the second-greatest military philosopher in human history:</p><blockquote><p>As someone with a reputation for adhering to the teachings of Carl von Clausewitz it would seem odd if I were to do anything but commend the writing contained in this <i>Military Strategy Magazine Special Edition</i> to our readers, so please take that as a given.</p><p>My introduction to Clausewitz came via the late Colin Gray and his work <i>Another Bloody Century</i>. To that point I had been deeply skeptical of Clausewitz and his academic fan club, never having set foot in a university, attended any lectures and left school at 16. Thus it speaks in Clausewitz’s immense favor that when I actually engaged with the text and the more commonsense commentaries about it, <i>On War</i> immediately began to answer questions that had so far left me confused and bewildered as to the unedifying, confused and clown infested swamp which is modern military thought – and if you think that harsh, Clausewitz would probably not argue with that description because he wrote to clarify and inform his peers, not confuse them further with reputational writing intended to show how clever he was. Clausewitz may not live in the Corporals club, but he should be more of a welcome visitor than many think.</p><p>Clausewitz really lives and dies in Professional Military Education (PME). Romping through <i>On War</i> next to other works is a miserable introduction yet that is how many come to meet Clausewitz’s work, yet why should anyone bother? To quote Colin Gray, “if not Clausewitz, then who?”</p><p>Ironically, if PME was as practice and evidence based, as some claim, no one would need to teach or even read Clausewitz because a 189-year-old book should have been surpassed by clearer and better work found in modern curricula but barring this somewhat nugatory observation it is fair to state that both reading and understanding <i>On War</i> will never set you wrong or harm your understanding of War and Warfare.</p><p>In well over a decade as Editor of <i>Infinity Journal</i>, now <i>Military Strategy Magazine</i> (MSM), and many, many email exchanges and ‘blog’ posts, I have seen all the critiques of Clausewitz flounder, mostly on the simple fault of not having read the book, or not understood the words on the page.</p><p>As I have said many times before, Clausewitz is not beyond criticism. There are things he did not say, and things he did not say clearly or well. He was prone to overstatement and using analogies that were perhaps not the best. He didn’t mention naval forces. He didn’t deal as well as he might with Logistics or Intelligence, but very few have, and no other military theorist is held to same semantic standards or levels of rigor as Clausewitz, mainly due to the efforts of more failure prone theorists such as Fuller and Liddell-Hart, post 1918.</p><p>Read Clausewitz. Read <i>On War</i>. Everything and anything Clausewitz ever wrote, and make sure to read it more than once. If you don’t get it or think it’s turgid and boring, try and speak to those who don’t and ask for clarity and insights. No soldier or officer was worse at his job for having engaged with Clausewitz.</p></blockquote><p>One of the things that is most striking about reading these various articles for anyone who has read Lind, van Creveld, and the Chinese duo of Qiao and Wang, is the utter necessity for more post-Clausewitzian thinking on strategy, operations, and tactics. Martin van Creveld was absolutely correct in his explication of the transformation of war, as the Clausewitzian framework has become too limited to serve as a sound philosophical basis to understand 21st century warfare.</p><p>That doesn’t render any of his core concepts less valid or important. Clausewitz absolutely remains relevant, and only a fool hell-bent on defeat would disregard his works anymore than one would disregard Sun Tzu’s aphorisms simply because the Chinese framework is outdated too. There is, for example, friction in “unrestricted warfare” just as there was on the Napoleonic battlefield. The point that I am making here, with all due respect and deference to the great Prussian, is that the Clausewitzian trinitarian framework no longer encapsulates war in all its forms, and therefore tends to suppress rather than support a comprehensive understanding of modern warfare.</p></div>",
  "content_text": "Military Strategy Magazine\ndevotes an entire issue\nto the immortal Carl von Clausewitz, the second-greatest military philosopher in human history:\nAs someone with a reputation for adhering to the teachings of Carl von Clausewitz it would seem odd if I were to do anything but commend the writing contained in this\nMilitary Strategy Magazine Special Edition\nto our readers, so please take that as a given.\nMy introduction to Clausewitz came via the late Colin Gray and his work\nAnother Bloody Century\n. To that point I had been deeply skeptical of Clausewitz and his academic fan club, never having set foot in a university, attended any lectures and left school at 16. Thus it speaks in Clausewitz’s immense favor that when I actually engaged with the text and the more commonsense commentaries about it,\nOn War\nimmediately began to answer questions that had so far left me confused and bewildered as to the unedifying, confused and clown infested swamp which is modern military thought – and if you think that harsh, Clausewitz would probably not argue with that description because he wrote to clarify and inform his peers, not confuse them further with reputational writing intended to show how clever he was. Clausewitz may not live in the Corporals club, but he should be more of a welcome visitor than many think.\nClausewitz really lives and dies in Professional Military Education (PME). Romping through\nOn War\nnext to other works is a miserable introduction yet that is how many come to meet Clausewitz’s work, yet why should anyone bother? To quote Colin Gray, “if not Clausewitz, then who?”\nIronically, if PME was as practice and evidence based, as some claim, no one would need to teach or even read Clausewitz because a 189-year-old book should have been surpassed by clearer and better work found in modern curricula but barring this somewhat nugatory observation it is fair to state that both reading and understanding\nOn War\nwill never set you wrong or harm your understanding of War and Warfare.\nIn well over a decade as Editor of\nInfinity Journal\n, now\nMilitary Strategy Magazine\n(MSM), and many, many email exchanges and ‘blog’ posts, I have seen all the critiques of Clausewitz flounder, mostly on the simple fault of not having read the book, or not understood the words on the page.\nAs I have said many times before, Clausewitz is not beyond criticism. There are things he did not say, and things he did not say clearly or well. He was prone to overstatement and using analogies that were perhaps not the best. He didn’t mention naval forces. He didn’t deal as well as he might with Logistics or Intelligence, but very few have, and no other military theorist is held to same semantic standards or levels of rigor as Clausewitz, mainly due to the efforts of more failure prone theorists such as Fuller and Liddell-Hart, post 1918.\nRead Clausewitz. Read\nOn War\n. Everything and anything Clausewitz ever wrote, and make sure to read it more than once. If you don’t get it or think it’s turgid and boring, try and speak to those who don’t and ask for clarity and insights. No soldier or officer was worse at his job for having engaged with Clausewitz.\nOne of the things that is most striking about reading these various articles for anyone who has read Lind, van Creveld, and the Chinese duo of Qiao and Wang, is the utter necessity for more post-Clausewitzian thinking on strategy, operations, and tactics. Martin van Creveld was absolutely correct in his explication of the transformation of war, as the Clausewitzian framework has become too limited to serve as a sound philosophical basis to understand 21st century warfare.\nThat doesn’t render any of his core concepts less valid or important. Clausewitz absolutely remains relevant, and only a fool hell-bent on defeat would disregard his works anymore than one would disregard Sun Tzu’s aphorisms simply because the Chinese framework is outdated too. There is, for example, friction in “unrestricted warfare” just as there was on the Napoleonic battlefield. The point that I am making here, with all due respect and deference to the great Prussian, is that the Clausewitzian trinitarian framework no longer encapsulates war in all its forms, and therefore tends to suppress rather than support a comprehensive understanding of modern warfare.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-28T12:00:05+00:00"
}