{
  "url": "https://voxday.net/2021/03/27/white-america-begins-to-secede/",
  "scraped_at": "2025-12-21T22:42:33.053144",
  "title": "White America begins to secede",
  "date_display": "March 27, 2021",
  "date_iso": "2021-03-27T17:00:06+00:00",
  "date_from_url": "2021-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s currently being described as “outstate vs metro”, “country vs city” and “rural vs urban”, but that’s all just a euphemistic way of <a href=\"https://www.fox9.com/news/minnesota-lawmaker-introduces-bill-to-allow-counties-to-join-south-dakota\" rel=\"noopener\" target=\"_blank\">describing the obviou</a>s. Jews didn’t want to be ruled by Romans. Africans and Indians didn’t want to be ruled by the British. So, it shouldn’t be a surprise that Americans and other whites of European descent aren’t exactly enthusiastic about being ruled by the POX.</p><blockquote><p>A Republican Minnesota state representative is introducing legislation that would create a pathway for Minnesota counties to secede from the state and join the South Dakota.</p><p>Rep. Jeremy Munson (R-Crystal Lake) introduced the bill Thursday and tweeted out an image of his vision, which depicted nearly every county west of the Twin Cities metro as part of a newly imagined South Dakota. </p><p>“Minnesota becomes more politically polarized every year and the metro politicians have shown us that rural Minnesotans are no longer represented by St Paul. It’s time to leave,” read a webpage on Munson’s campaign website.</p><p>The idea echoes a similar push among rural Oregon counties to join Idaho.</p><p>Republican South Dakota Governor Kristi Noem appeared to be in support of Munson’s idea, by retweeting his plan.</p></blockquote><p>It’s an excellent idea, and every Minnesotan on either side of the divide should embrace it. But this is just a minor precursor of the eventual breakup, which probably will not be entirely peaceful and political in nature. </p></div>",
  "content_text": "It’s currently being described as “outstate vs metro”, “country vs city” and “rural vs urban”, but that’s all just a euphemistic way of\ndescribing the obviou\ns. Jews didn’t want to be ruled by Romans. Africans and Indians didn’t want to be ruled by the British. So, it shouldn’t be a surprise that Americans and other whites of European descent aren’t exactly enthusiastic about being ruled by the POX.\nA Republican Minnesota state representative is introducing legislation that would create a pathway for Minnesota counties to secede from the state and join the South Dakota.\nRep. Jeremy Munson (R-Crystal Lake) introduced the bill Thursday and tweeted out an image of his vision, which depicted nearly every county west of the Twin Cities metro as part of a newly imagined South Dakota.\n“Minnesota becomes more politically polarized every year and the metro politicians have shown us that rural Minnesotans are no longer represented by St Paul. It’s time to leave,” read a webpage on Munson’s campaign website.\nThe idea echoes a similar push among rural Oregon counties to join Idaho.\nRepublican South Dakota Governor Kristi Noem appeared to be in support of Munson’s idea, by retweeting his plan.\nIt’s an excellent idea, and every Minnesotan on either side of the divide should embrace it. But this is just a minor precursor of the eventual breakup, which probably will not be entirely peaceful and political in nature.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-03-27T17:00:06+00:00"
}