{
  "url": "https://voxday.net/2006/05/22/code-of-da-vinci-is-vote-republican/",
  "scraped_at": "2026-01-08T21:08:40.310744",
  "title": "The code of Da Vinci is: Vote Republican!",
  "date_display": "May 22, 2006",
  "date_iso": "2006-05-22T15:38:00+00:00",
  "date_from_url": "2006-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stanley Kurtz presents <a href=\"http://corner.nationalreview.com/post/?q=OTViNzkwZjE1ODRiM2FhODA0ZjZmMzAxZWYyMmQ1OTA=\">a fascinating exercise in illogic</a>:</p><blockquote><p>I just saw The Da Vinci Code.  Point one: Michael Novak’s review is dead on. <br>Point two: This movie is a salutary kick in the teeth for conservatives.  There’s no gainsaying the fact that the Narnia movie was a big deal.  Having conceded that, the fact remains that when it comes to exercising influence on the fundamental levers of American culture, conservatives remain in a pathetically weakened position.</br></p><p>I may not be a professor of “symbology,” but I have taught at Harvard and studied religious symbolism.  So I feel in a particularly strong position to reveal the entirely unsecret conspiracy against patriotism, tradition, and religion hiding in plain sight on our movie and television screens, in our universities, and on the pages of the mainstream press.  Conservatives have forgotten just how precarious our position is.  One cable news channel, talk radio, and the blogosphere do not an invincible army make.  It only seems that way because we also have nominal control of the reigns of power.  But lose our foothold in government, and conservatives are up a creek.  The other side controls the levers of cultural power in this country, and we are the enemy in their eyes (and on their screens).</p><p>Conservatives need to face the fact that our position in this culture is genuinely precarious.  If we lose our hold on power, we’ll scream bloody murder on our outlets at everything the other side does.  Yet those screams may only confirm our helplessness.  The deep cultural dimension of our political battles makes an ordinary transfer of political power far more consequential than it was in the days when America had a bipartisan foreign policy and a broad cultural consensus.  We can dream about forcing Republicans to the right and then riding back into power two years later, but one big loss could easily turn conservatives back into a marginal cultural force for some time.</p></blockquote><p>You would think with those very impressive credentials in quasi-semiotics Mr. Kurtz would recognize that the Republicans he pitches as the last great hope for conservatives are every bit as sold out to the very forces of darkness he sees behind the Da Vinci Code as their Democratic counterparts.</p><p>Two uniforms, one team.</p><p>I am beginning to think that this administration’s open betrayal of Americans is going to cause some of these NROniks to require therapy, if not medication.  You can see the cognitive dissonance tearing at their minds in nearly every half-baked defense of their “conservative” party.</p><p>It may require a morbid sense of humor, but I think I’m going to quite enjoy November.  Remember when all those pragmatic pundits and self-proclaimed strategists said that the Republicans had to govern to the Left in order to stay popular, continue to win elections and retain power?</p><p>That was awesome!</p><p>Seriously, how hard is it for these genuiuses to grasp the obvious?  Reagan wins landslide victories.  The conservative Contract With America takes Congress.  Naturally, <em>and supposedly in order to stay in power</em>, the Republican politicians tack left and now find themselves on the verge of another long stint in the political wilderness.  If Karl Rove is a political genius, then he must be Democrat.</p><p>So, vote Republican or else Tom Hanks will make more movies!</p></div>",
  "content_text": "Stanley Kurtz presents\na fascinating exercise in illogic\n:\nI just saw The Da Vinci Code.  Point one: Michael Novak’s review is dead on.\nPoint two: This movie is a salutary kick in the teeth for conservatives.  There’s no gainsaying the fact that the Narnia movie was a big deal.  Having conceded that, the fact remains that when it comes to exercising influence on the fundamental levers of American culture, conservatives remain in a pathetically weakened position.\nI may not be a professor of “symbology,” but I have taught at Harvard and studied religious symbolism.  So I feel in a particularly strong position to reveal the entirely unsecret conspiracy against patriotism, tradition, and religion hiding in plain sight on our movie and television screens, in our universities, and on the pages of the mainstream press.  Conservatives have forgotten just how precarious our position is.  One cable news channel, talk radio, and the blogosphere do not an invincible army make.  It only seems that way because we also have nominal control of the reigns of power.  But lose our foothold in government, and conservatives are up a creek.  The other side controls the levers of cultural power in this country, and we are the enemy in their eyes (and on their screens).\nConservatives need to face the fact that our position in this culture is genuinely precarious.  If we lose our hold on power, we’ll scream bloody murder on our outlets at everything the other side does.  Yet those screams may only confirm our helplessness.  The deep cultural dimension of our political battles makes an ordinary transfer of political power far more consequential than it was in the days when America had a bipartisan foreign policy and a broad cultural consensus.  We can dream about forcing Republicans to the right and then riding back into power two years later, but one big loss could easily turn conservatives back into a marginal cultural force for some time.\nYou would think with those very impressive credentials in quasi-semiotics Mr. Kurtz would recognize that the Republicans he pitches as the last great hope for conservatives are every bit as sold out to the very forces of darkness he sees behind the Da Vinci Code as their Democratic counterparts.\nTwo uniforms, one team.\nI am beginning to think that this administration’s open betrayal of Americans is going to cause some of these NROniks to require therapy, if not medication.  You can see the cognitive dissonance tearing at their minds in nearly every half-baked defense of their “conservative” party.\nIt may require a morbid sense of humor, but I think I’m going to quite enjoy November.  Remember when all those pragmatic pundits and self-proclaimed strategists said that the Republicans had to govern to the Left in order to stay popular, continue to win elections and retain power?\nThat was awesome!\nSeriously, how hard is it for these genuiuses to grasp the obvious?  Reagan wins landslide victories.  The conservative Contract With America takes Congress.  Naturally,\nand supposedly in order to stay in power\n, the Republican politicians tack left and now find themselves on the verge of another long stint in the political wilderness.  If Karl Rove is a political genius, then he must be Democrat.\nSo, vote Republican or else Tom Hanks will make more movies!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-22T14:38:00+00:00"
}