{
  "url": "https://voxday.net/2006/05/02/do-they-teach-that-move-in-teacher/",
  "scraped_at": "2026-01-08T21:06:29.292694",
  "title": "Do they teach that move in teacher school?",
  "date_display": "May 2, 2006",
  "date_iso": "2006-05-02T20:56:00+00:00",
  "date_from_url": "2006-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>A high school teacher in Belleville, Ill., <a href=\"http://www.local6.com/news/9143860/detail.html\">was arrested and charged with breaking the neck of a 17-year-old student</a> and then leaving her to die in some woods, according to police.  Investigators said Samson Shelton, 26, who is a teacher at Columbia High School, tried to strangle Ashley Reeves and then left her to die.</p><p>Shelton was with St. Clair County detectives when they found Reeves in a park in Belleville. She survived in the woods for 30 hours before she was found…. Police said the Shelton and Reeves apparently had a relationship, Local 6 News reported.</p></blockquote><p>Those public schools just keep looking better and better, don’t they…. Sure, there might be a few bad apples at on the staff there, but I’ll bet the facilities are first rate!</p></div>",
  "content_text": "A high school teacher in Belleville, Ill.,\nwas arrested and charged with breaking the neck of a 17-year-old student\nand then leaving her to die in some woods, according to police.  Investigators said Samson Shelton, 26, who is a teacher at Columbia High School, tried to strangle Ashley Reeves and then left her to die.\nShelton was with St. Clair County detectives when they found Reeves in a park in Belleville. She survived in the woods for 30 hours before she was found…. Police said the Shelton and Reeves apparently had a relationship, Local 6 News reported.\nThose public schools just keep looking better and better, don’t they…. Sure, there might be a few bad apples at on the staff there, but I’ll bet the facilities are first rate!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-02T19:56:00+00:00"
}