{
  "url": "https://voxday.net/2006/05/10/equalitarian-injustice/",
  "scraped_at": "2026-01-08T21:07:17.385737",
  "title": "Equalitarian injustice",
  "date_display": "May 10, 2006",
  "date_iso": "2006-05-10T15:54:00+00:00",
  "date_from_url": "2006-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the first among an ESPN sportswriter’s recommendations for Augusta’s new chairman:</p><blockquote><p>Women Members<br>We are a private club, but we are also a public golfing treasure. Outgoing chairman Hootie Johnson, and some of our more medieval members, never have fully understood that relationship. Hootie saw small picture (Martha Burk and bayonets) instead of big picture (it’s the right thing to do). So how about we join the 21st century and extend membership invitations to at least two women?</br></p></blockquote><p>Dear Mr. Wojciechowski,</p><p>I fail to understand your crusade against men being able to belong to private clubs, but I certainly await with interest your forthcoming excoriation of women’s clubs such as Curves, as well as blatantly sexist women’s sporting organizations like the LPGA.  I would encourage you to expand your anti-sexist campaign to the federal prison system, which also exhibits open sexism by refusing to practice gender equality in its cell assignments.</p><p>As was well established in Brown vs Board of Education, separate is not equal.  I hope you will soon address this terrible injustice in our society.</p><p>Regards,<br>Vox</br></p></div>",
  "content_text": "This is the first among an ESPN sportswriter’s recommendations for Augusta’s new chairman:\nWomen Members\nWe are a private club, but we are also a public golfing treasure. Outgoing chairman Hootie Johnson, and some of our more medieval members, never have fully understood that relationship. Hootie saw small picture (Martha Burk and bayonets) instead of big picture (it’s the right thing to do). So how about we join the 21st century and extend membership invitations to at least two women?\nDear Mr. Wojciechowski,\nI fail to understand your crusade against men being able to belong to private clubs, but I certainly await with interest your forthcoming excoriation of women’s clubs such as Curves, as well as blatantly sexist women’s sporting organizations like the LPGA.  I would encourage you to expand your anti-sexist campaign to the federal prison system, which also exhibits open sexism by refusing to practice gender equality in its cell assignments.\nAs was well established in Brown vs Board of Education, separate is not equal.  I hope you will soon address this terrible injustice in our society.\nRegards,\nVox",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-10T14:54:00+00:00"
}