{
  "url": "https://voxday.net/2006/05/05/foolishness-of-pragmatis/",
  "scraped_at": "2026-01-08T21:06:45.841995",
  "title": "The foolishness of pragmatism",
  "date_display": "May 5, 2006",
  "date_iso": "2006-05-05T12:16:00+00:00",
  "date_from_url": "2006-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg appears to be waking up to it.  Will Hugh Hewitt be next?</p><blockquote><p>When you stand on a clear principle, clearly expressed and understood, you get credit even from those who disagree with you. And to be fair to Bush, he has stuck to principle in defiance of the prevailing winds of opinion on a host of issues. But when it comes to a vast swath of domestic policy, there seems to be no principled boundaries to his thinking. Much like Nixon and other presidents in the Progressive tradition, public policy is driven by pragmatism and do-gooderism rather than classically liberal principles about the role of the state.</p><p>I didn’t give Bush credit for his Social Security plan — in part because it failed so miserably, alas. But that plan when put alongside his Medicare plan certainly demonstrates that there is no binding set of rules which govern Bush’s approach to domestic affairs. This creates a trap unique to conservative presidents. If you refuse to “help” the poor with Plan A, but you have no objection to a similarly statist Plan B, critics and friends alike have to look to something other than philosophy to explain your support. Critics will opt towards explanations of cronyism, corruption and hard-heartedness. Friends, over time, will assume political expediency.</p></blockquote><p>Of course, that one principle Dear Jorge has stuck to is his loyalty to transnational globalism.  Conservatives should have known he would sell them out at the first opportunity.  Perhaps it will make conservatives feel better to look at it this way, they didn’t have much say in governance for the last eight years, but at least they’ll get to bear the blame for them as the country gets handed over to an even more left-wing set.</p><p>This demonstrates why it was the height of idiocy for conservatives to rush to embrace a man who was manifestly never one of them.  It’s bad enough to be damned for something you did, but it’s even worse to be damned for something you didn’t do.</p><p>That this is happening can be seen in the piece to which Goldberg was, in part, responding: <em>“Notwithstanding the fact that the Bush administration has violated every tenet of this strain of conservatism for the last five years, conservatives will not be permitted to distance themselves from this administration — as they are transparently and pitifully trying to do now that Bush’s presidency is failed and is dying a rapid death (see e.g., this characteristically dishonest attempt by Jonah Goldberg to characterize the two failed Republican Presidents – Nixon and Bush – as “liberals” in order to imply that their failure is not a failure of conservatives; funny how we never heard any of that when The Commander had approval ratings in the 60s’. With rare and noble exception, conservatives did not repudiate Bush until very recently. To the contrary, they have vigorously supported and claimed him (while he was popular), and he is their creation. They are and should be stuck with him.</em></p><p>And the critic – Glenn Greenwald – has a point.  For all that Jonah points out a few criticisms that have been made of the Bush administration by National Review, (and from my perspective, only Ponnuru’s have been consistent and substantive), it’s telling to note that even now, Goldberg refuses to repudiate Bush or deem his presidency a failure.</p><p>That being said, I see nothing dishonest about what Goldberg is writing either.  While he’s apparently caught between conservative principles and the seductive appeal of pragmatically embracing the realities of power, he has never been a mindless Bush cheerleader like a number of his NRO colleagues and has been rightfully suspicious of both compassionate conservativism and its crunchy variant from the start.</p></div>",
  "content_text": "Jonah Goldberg appears to be waking up to it.  Will Hugh Hewitt be next?\nWhen you stand on a clear principle, clearly expressed and understood, you get credit even from those who disagree with you. And to be fair to Bush, he has stuck to principle in defiance of the prevailing winds of opinion on a host of issues. But when it comes to a vast swath of domestic policy, there seems to be no principled boundaries to his thinking. Much like Nixon and other presidents in the Progressive tradition, public policy is driven by pragmatism and do-gooderism rather than classically liberal principles about the role of the state.\nI didn’t give Bush credit for his Social Security plan — in part because it failed so miserably, alas. But that plan when put alongside his Medicare plan certainly demonstrates that there is no binding set of rules which govern Bush’s approach to domestic affairs. This creates a trap unique to conservative presidents. If you refuse to “help” the poor with Plan A, but you have no objection to a similarly statist Plan B, critics and friends alike have to look to something other than philosophy to explain your support. Critics will opt towards explanations of cronyism, corruption and hard-heartedness. Friends, over time, will assume political expediency.\nOf course, that one principle Dear Jorge has stuck to is his loyalty to transnational globalism.  Conservatives should have known he would sell them out at the first opportunity.  Perhaps it will make conservatives feel better to look at it this way, they didn’t have much say in governance for the last eight years, but at least they’ll get to bear the blame for them as the country gets handed over to an even more left-wing set.\nThis demonstrates why it was the height of idiocy for conservatives to rush to embrace a man who was manifestly never one of them.  It’s bad enough to be damned for something you did, but it’s even worse to be damned for something you didn’t do.\nThat this is happening can be seen in the piece to which Goldberg was, in part, responding:\n“Notwithstanding the fact that the Bush administration has violated every tenet of this strain of conservatism for the last five years, conservatives will not be permitted to distance themselves from this administration — as they are transparently and pitifully trying to do now that Bush’s presidency is failed and is dying a rapid death (see e.g., this characteristically dishonest attempt by Jonah Goldberg to characterize the two failed Republican Presidents – Nixon and Bush – as “liberals” in order to imply that their failure is not a failure of conservatives; funny how we never heard any of that when The Commander had approval ratings in the 60s’. With rare and noble exception, conservatives did not repudiate Bush until very recently. To the contrary, they have vigorously supported and claimed him (while he was popular), and he is their creation. They are and should be stuck with him.\nAnd the critic – Glenn Greenwald – has a point.  For all that Jonah points out a few criticisms that have been made of the Bush administration by National Review, (and from my perspective, only Ponnuru’s have been consistent and substantive), it’s telling to note that even now, Goldberg refuses to repudiate Bush or deem his presidency a failure.\nThat being said, I see nothing dishonest about what Goldberg is writing either.  While he’s apparently caught between conservative principles and the seductive appeal of pragmatically embracing the realities of power, he has never been a mindless Bush cheerleader like a number of his NRO colleagues and has been rightfully suspicious of both compassionate conservativism and its crunchy variant from the start.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-05T11:16:00+00:00"
}