{
  "url": "https://voxday.net/2006/05/17/harold-finally-comes-out-to-play/",
  "scraped_at": "2026-01-08T21:08:06.882061",
  "title": "Harold finally comes out to play",
  "date_display": "May 17, 2006",
  "date_iso": "2006-05-17T12:45:00+00:00",
  "date_from_url": "2006-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But it’s <a href=\"http://calledasseen.blogspot.com/2006/05/response-to-vox-day.html#links\">a poor effort indeed</a>:</p><blockquote><p>t seems Vox Populi, the blog Vox Day has, is taking me up on the offer. He has already misread my contempt and refusal to tolerate defense of his indefensible column as me being a “Chickenboy”. To do so… well, that says more about you than me, Mr. Day.  My anger and disgust with your column comes due to the fact that I think the first principles that this country was founded on mean something. Particularly, when we laid out the reasons for breaking away from England:</p><p>We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.</p></blockquote><p>Let the irrelevant preening begin!</p><blockquote><p>Now, let’s lay some cards down on the table. If we, as Americans, are to believe what Thomas Jefferson wrote, then the following statement in the President’s speech is non-controversial:</p><p>We must always remember that real lives will be affected by our debates and decisions, and that every human being has dignity and value no matter what their citizenship papers say.</p><p>Then how are we to react when someone writes the following statement?</p><p>And he will be lying, again, just as he lied when he said: “Massive deportation of the people here is unrealistic – it’s just not going to work.”</p><p>Not only will it work, but one can easily estimate how long it would take. If it took the Germans less than four years to rid themselves of 6 million Jews, many of whom spoke German and were fully integrated into German society, it couldn’t possibly take more than eight years to deport 12 million illegal aliens, many of whom don’t speak English and are not integrated into American society.</p></blockquote><p>You don’t have to bring Thomas Jefferson into it in order to read the following and very simple argument.</p><p>George Bush said X.  George Bush lied.  Here’s an example of proof to the contrary only 65 years old.  The correct way to react is to examine the proof and decide if it is sufficient to determine whether George Bush lied or not.  As it happens, he did.  I find it interesting that to a man, the conservatives “outraged” by my comments are all Bush supporters; none of them have admitted that my bust of Bush’s lie is spot-on.</p><p>Furthermore, Thomas Jefferson is not Holy Writ and while Harold may be informed by the man’s words every time you place fingertips on keyboard, I am not.  And finally, deporting an illegal alien does not detract from his basic human worth any more than arresting him for shoplifting does.</p><blockquote><p>Let’s be honest about the Nazis. They felt that there was a super-race – they called it Aryans. Other races were to be subjected – to be slaves, or second-class citizens. They targeted Jews, gypsies, and others for extermination, also known as the Holocaust. And you, Mr. Day, were at the very least, using it as a way to rebut the President of the United States. You might call yourself a libertarian, but your column came across as something far different from that, and extremely odious. It’s not quite the worst that I have seen.</p></blockquote><p>My column came across as nothing of the sort to anyone not looking to preen for the masses and pretend outrage.  I neither endorsed mass deportation nor supported a border fence, in fact, I came out explicitly against the latter in case you missed the title and the vast majority of the column.  German history is real and provides those who study history with many examples, some evil, some good and some neutral.  The mere mention of National Socialist Germany is not synonymous with sympathy for its policies, and unlike you, I actually know what they were.</p><p>Since I don’t merely call myself a libertarian but actually happen to be one, <a href=\"http://www.voxday.net/cave/planks.html\">I also support far fewer of them than you do, Harold</a>.</p><blockquote><p>That’s what this comes down to. You are either with Thomas Jefferson and President Bush, or you are with the perpetrators of one of the most evil acts in recorded history. I do not think that any sort of middle ground is possible in this – nor can such a blanket endorsement be explained away as merely “drawing upon the lessons of history”. Because if it can be done to 12 million illegals, who else can it be done to?</p></blockquote><p>That’s the most feeble false dichotomy I’ve seen in several years of this blog.  You’re a laughable joke, Harold.  Mass slaughter has been with mankind for all of recorded history and only by preventing a power imbalance on the side of central government can it be avoided.  Thomas Jefferson and George Bush are on different sides of that debate, you sad cretin.</p><blockquote><p>Slopes can get very slippery, as we have seen on other issues. We’ve gone from debates over whether or not a woman has the right to terminate a pregnancy or whether someone has the right to have a living will to seeing a Western European country practice out-and-out euthanasia, and debate over whether it should be legalized here.</p><p>In the same vein, we also see that from those who wish to practice gun control. It starts with just a few things – bans on guns that have “no legitimate sporting purposes”, as the gun-control advocates claim. But then they demand more and more. Soon, they want to tell you how many you will be allowed to have in a month. Then they want to make you demonstrate to someone else that you need a given gun.</p></blockquote><p>Agreed.</p><blockquote><p>The reason I’m calling you a Nazi, Mr. Day, is because your column seems to have a lot more in common with them than it did with what this country is founded on. So you don’t like Michelle Malkin. Big deal.</p></blockquote><p>Yes, clearly the National Socialists were opposed to strong central government, as I explicitly opposed in my column.  Furthermore, I have nothing personal against Michelle Malkin, I opposed her fraudulent defense of internment because it was a) historically inaccurate and b) an advocation of increasing central state power.  That is absolutely relevant to the matter under discussion and also eliminates your ridiculous case.</p><blockquote><p>When it comes to the principles espoused by Jefferson vs. the actions of Hitler, there is no middle ground, Mr. Day. You’re with one or the other, as is the case in the war on terror. I’m going to follow the President’s lead and err on the side of Thomas Jefferson’s principles. You are free to say or do otherwise, but complaining when you get called out on it looks bad. A pitcher who complains about a batter charging the mound after getting plunked by a pitch looks better.</p></blockquote><p>False dichotomy, again.  I’m not complaining at all, I’m openly mocking quasi-illiterate morons like you, Michael Medved and others who leaped before they looked.</p><blockquote><p>You sent some of your fans to come on over and talk trash. But I see that none of them even tried to defend what you wrote. If you can reconcile citing what Nazi Germany did to Jews with the notion that even illegal immigrants – as human beings – have dignity and value, then do so. If you find that it is impossible, then have the courage – and honesty – to come out and say so. If you lack the ability to do either, then say so. Are you too chicken to do so?</p></blockquote><p>And now Young Harold is reduced to lying.  I didn’t send anyone over to his web site, nor, <a href=\"http://www.blogger.com/comment.g?blogID=9762062&amp;postID=114774540286786863\">as you can see for yourself</a>, did anyone talk trash.  Furthermore, several people openly defended what I wrote, which, if you look at the time stamps of Harold’s second post compared to that of the comments, proves that he is blatantly lying.</p><p>There is nothing inherently contradictory in citing something bad that on<br> e group of people did to another group of people and asserting that human beings have dignity and value.  Harold has a strangely limited little mind that sees nonexistent dichotomies everywhere even as he misses rather obvious ones, like Jefferson v. Bush and National Socialism v. libertarianism.</br></p><p>In summary, a truly pathetic attempt, Harold.  False dichotomies, demonstrations of both ideological ignorance and reading comprehension problems, and finally, a resort to two outright lies. You would have been better off running home to Mommy.</p><p>But on an amusing final note, Harold also posted this:</p><blockquote><p>In the two days since Vox Day’s column, Michelle has to have known that there was a controversy. She has not found the time to say a single word about Mr. Day’s odious column, but did find time to write an insulting column filled with hyperbole, to complain about 22 Senators who didn’t vote the way she would have had them vote, and to live-blog a speech she’d made her mind up on before even listening to.</p></blockquote><p>Yeah, you’ll likely be waiting a long, long time before Michelle Malkin has anything to say about me, Harold.  And you can be absolutely sure it has nothing whatsoever to do with her secretly agreeing with me or harboring a hidden passion for my smoldering sexuality.</p></div>",
  "content_text": "But it’s\na poor effort indeed\n:\nt seems Vox Populi, the blog Vox Day has, is taking me up on the offer. He has already misread my contempt and refusal to tolerate defense of his indefensible column as me being a “Chickenboy”. To do so… well, that says more about you than me, Mr. Day.  My anger and disgust with your column comes due to the fact that I think the first principles that this country was founded on mean something. Particularly, when we laid out the reasons for breaking away from England:\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\nLet the irrelevant preening begin!\nNow, let’s lay some cards down on the table. If we, as Americans, are to believe what Thomas Jefferson wrote, then the following statement in the President’s speech is non-controversial:\nWe must always remember that real lives will be affected by our debates and decisions, and that every human being has dignity and value no matter what their citizenship papers say.\nThen how are we to react when someone writes the following statement?\nAnd he will be lying, again, just as he lied when he said: “Massive deportation of the people here is unrealistic – it’s just not going to work.”\nNot only will it work, but one can easily estimate how long it would take. If it took the Germans less than four years to rid themselves of 6 million Jews, many of whom spoke German and were fully integrated into German society, it couldn’t possibly take more than eight years to deport 12 million illegal aliens, many of whom don’t speak English and are not integrated into American society.\nYou don’t have to bring Thomas Jefferson into it in order to read the following and very simple argument.\nGeorge Bush said X.  George Bush lied.  Here’s an example of proof to the contrary only 65 years old.  The correct way to react is to examine the proof and decide if it is sufficient to determine whether George Bush lied or not.  As it happens, he did.  I find it interesting that to a man, the conservatives “outraged” by my comments are all Bush supporters; none of them have admitted that my bust of Bush’s lie is spot-on.\nFurthermore, Thomas Jefferson is not Holy Writ and while Harold may be informed by the man’s words every time you place fingertips on keyboard, I am not.  And finally, deporting an illegal alien does not detract from his basic human worth any more than arresting him for shoplifting does.\nLet’s be honest about the Nazis. They felt that there was a super-race – they called it Aryans. Other races were to be subjected – to be slaves, or second-class citizens. They targeted Jews, gypsies, and others for extermination, also known as the Holocaust. And you, Mr. Day, were at the very least, using it as a way to rebut the President of the United States. You might call yourself a libertarian, but your column came across as something far different from that, and extremely odious. It’s not quite the worst that I have seen.\nMy column came across as nothing of the sort to anyone not looking to preen for the masses and pretend outrage.  I neither endorsed mass deportation nor supported a border fence, in fact, I came out explicitly against the latter in case you missed the title and the vast majority of the column.  German history is real and provides those who study history with many examples, some evil, some good and some neutral.  The mere mention of National Socialist Germany is not synonymous with sympathy for its policies, and unlike you, I actually know what they were.\nSince I don’t merely call myself a libertarian but actually happen to be one,\nI also support far fewer of them than you do, Harold\n.\nThat’s what this comes down to. You are either with Thomas Jefferson and President Bush, or you are with the perpetrators of one of the most evil acts in recorded history. I do not think that any sort of middle ground is possible in this – nor can such a blanket endorsement be explained away as merely “drawing upon the lessons of history”. Because if it can be done to 12 million illegals, who else can it be done to?\nThat’s the most feeble false dichotomy I’ve seen in several years of this blog.  You’re a laughable joke, Harold.  Mass slaughter has been with mankind for all of recorded history and only by preventing a power imbalance on the side of central government can it be avoided.  Thomas Jefferson and George Bush are on different sides of that debate, you sad cretin.\nSlopes can get very slippery, as we have seen on other issues. We’ve gone from debates over whether or not a woman has the right to terminate a pregnancy or whether someone has the right to have a living will to seeing a Western European country practice out-and-out euthanasia, and debate over whether it should be legalized here.\nIn the same vein, we also see that from those who wish to practice gun control. It starts with just a few things – bans on guns that have “no legitimate sporting purposes”, as the gun-control advocates claim. But then they demand more and more. Soon, they want to tell you how many you will be allowed to have in a month. Then they want to make you demonstrate to someone else that you need a given gun.\nAgreed.\nThe reason I’m calling you a Nazi, Mr. Day, is because your column seems to have a lot more in common with them than it did with what this country is founded on. So you don’t like Michelle Malkin. Big deal.\nYes, clearly the National Socialists were opposed to strong central government, as I explicitly opposed in my column.  Furthermore, I have nothing personal against Michelle Malkin, I opposed her fraudulent defense of internment because it was a) historically inaccurate and b) an advocation of increasing central state power.  That is absolutely relevant to the matter under discussion and also eliminates your ridiculous case.\nWhen it comes to the principles espoused by Jefferson vs. the actions of Hitler, there is no middle ground, Mr. Day. You’re with one or the other, as is the case in the war on terror. I’m going to follow the President’s lead and err on the side of Thomas Jefferson’s principles. You are free to say or do otherwise, but complaining when you get called out on it looks bad. A pitcher who complains about a batter charging the mound after getting plunked by a pitch looks better.\nFalse dichotomy, again.  I’m not complaining at all, I’m openly mocking quasi-illiterate morons like you, Michael Medved and others who leaped before they looked.\nYou sent some of your fans to come on over and talk trash. But I see that none of them even tried to defend what you wrote. If you can reconcile citing what Nazi Germany did to Jews with the notion that even illegal immigrants – as human beings – have dignity and value, then do so. If you find that it is impossible, then have the courage – and honesty – to come out and say so. If you lack the ability to do either, then say so. Are you too chicken to do so?\nAnd now Young Harold is reduced to lying.  I didn’t send anyone over to his web site, nor,\nas you can see for yourself\n, did anyone talk trash.  Furthermore, several people openly defended what I wrote, which, if you look at the time stamps of Harold’s second post compared to that of the comments, proves that he is blatantly lying.\nThere is nothing inherently contradictory in citing something bad that on\ne group of people did to another group of people and asserting that human beings have dignity and value.  Harold has a strangely limited little mind that sees nonexistent dichotomies everywhere even as he misses rather obvious ones, like Jefferson v. Bush and National Socialism v. libertarianism.\nIn summary, a truly pathetic attempt, Harold.  False dichotomies, demonstrations of both ideological ignorance and reading comprehension problems, and finally, a resort to two outright lies. You would have been better off running home to Mommy.\nBut on an amusing final note, Harold also posted this:\nIn the two days since Vox Day’s column, Michelle has to have known that there was a controversy. She has not found the time to say a single word about Mr. Day’s odious column, but did find time to write an insulting column filled with hyperbole, to complain about 22 Senators who didn’t vote the way she would have had them vote, and to live-blog a speech she’d made her mind up on before even listening to.\nYeah, you’ll likely be waiting a long, long time before Michelle Malkin has anything to say about me, Harold.  And you can be absolutely sure it has nothing whatsoever to do with her secretly agreeing with me or harboring a hidden passion for my smoldering sexuality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-17T11:45:00+00:00"
}