{
  "url": "https://voxday.net/2006/05/16/if-he-wants-fight-i-wont-disappoin/",
  "scraped_at": "2026-01-08T21:07:54.054502",
  "title": "If he wants a fight, I won’t disappoint him",
  "date_display": "May 16, 2006",
  "date_iso": "2006-05-16T20:23:00+00:00",
  "date_from_url": "2006-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Harold Hutchinson <a href=\"http://calledasseen.blogspot.com/2006/05/with-stuff-like-this.html\">clearly harbors masochistic yearnings</a>:</p><blockquote><p>Let me lay this out front – this is the type of talk that leads people to ask questions about the opponents to the President’s plan. Questions about just what, exactly, it is they want. Questions about whether they went off their anti-psychotic medications – or need to be on them. Questions about just what the hell it is the really want. And the answer never come. They cry “race-baiting” and then claim that nobody wishes to debate them honestly.</p></blockquote><p>The answers never come?  Apparently you didn’t read past the mention of German history, or even manage to remember the title of the piece.  Very well, shall repeat my desires for Mr. Hutchinson’s benefit.  I want illegal aliens to return to their countries of origin.  I don’t want a fence.  I don’t want a national ID card, the Patriot Act or a Department of Homeland Security.  I want the states and private land owners to protect their own land as they see fit without interference from the federal government.  I want all social services limited to citizens of the sovereign states.  I don’t want mass deportations by the federal government despite believing, <em>contra</em> President Bush’s assertions, that they are emininently practical, because they are unnecessary.  I want proven illegals deported immediately.</p><p>Is that sufficiently clear, Mr. Hutchinson?  Please note that I have not cried “race-baiting” and I am perfectly willing to school anyone who wishes to debate me honestly or otherwise.</p><blockquote><p>I’m sorry, but this is the type of talk – and conduct – that has royally turned me off. What is just as bad is the fact that too many conservatives turn a blind eye to all of this. Other tacitly embrace it. Michelle Malkin, for instance, gives VDARE a one-day head start on her columns (as opposed to Townhall.com). She has also approvingly cited Lawrence Auster and Steve Sailer. She recommends VDARE, despite the fact that it runs stuff from Jared Taylor, who happens to be buddy-buddy with the likes of David Duke and Don Black – the webmaster of Stormfront. See what founders of the site RedState.com (no bastion of political correctness) had to say about Auster and Sailer. Decide for yourself if her claims that those who question these connections are engaged in mischaracterization, as she claimed during the controversy over the UAE’s ports deal, or if she has been turning a blind eye to some serious slime.</p></blockquote><p>If you’re looking for me to defend Me So Michelle, well, you’ll have to look elsewhere.  See the August archives for enough detail to make you cry….  I can’t say that turning on someone named Harold has ever been a particular goal of mine.</p><blockquote><p>Do you even give a damn that he’s drawing upon Nazi Germany? Or do you not care as long as the checks clear? Do you really stand with all of this? Do you consider that sort of stuff acceptable? Michelle, do you believe in this stuff?  As far as I am concerned, Michelle, Master Gunnery Sergeant Guadalupe Denogean is far more of an American than Taylor, Auster, and Sailer combined. He has certainly risked a lot more for this country and gave far more than Tom Tancredo ever has.</p></blockquote><p>Since when did drawing upon the historical lessons of Germany, be it during the National Socialist era or the Teutoberger Wald era, become verboten?  Does Mr. Hutchinson similarly avoid flying on jets because National Socialist scientists developed them?  It’s also interesting to see how he is quantifying and ranking Americanness.  Such fun!  How do blacks rate, Harold?  How about Jews with Israeli citizenship?  Do you get an extra five points for supporting the Iraqi Occupation?</p><blockquote><p>If it sounds like I’m in the mood for a fight, it’s because I am. I’m sick of being told that somehow, I believe in “post-America” and that my level of commitment to this country is no more than shacking up. I’ve had enough of the abuse that Malkin and others heap on me for not being quiet about the thoughts I have on this issue – all because I have disagreed with them.  I’m not running away. I’m in the mood for a fight. Bring it on.</p></blockquote><p>I’m curious to know how many immigrants are considered acceptable by the pro-immigration crowd.  We know that 30 million Mexicans and others are acceptable to them, are 300 million Chinese similarly okay?  At what point between 12 million immigrants and 300 million immigrants does racism begin?  And precisely what quantity of immigrants will cause significant change in the American political system given our quasi-democratic system?</p><p>On a tangential note, one supportive reader pointed out that last night Dear Jorge boasted that six million immigrants had already been deported.  It seems to me that he just shot himself in the tongue and proved my case that he was previously lying in one fell swoop.</p></div>",
  "content_text": "Harold Hutchinson\nclearly harbors masochistic yearnings\n:\nLet me lay this out front – this is the type of talk that leads people to ask questions about the opponents to the President’s plan. Questions about just what, exactly, it is they want. Questions about whether they went off their anti-psychotic medications – or need to be on them. Questions about just what the hell it is the really want. And the answer never come. They cry “race-baiting” and then claim that nobody wishes to debate them honestly.\nThe answers never come?  Apparently you didn’t read past the mention of German history, or even manage to remember the title of the piece.  Very well, shall repeat my desires for Mr. Hutchinson’s benefit.  I want illegal aliens to return to their countries of origin.  I don’t want a fence.  I don’t want a national ID card, the Patriot Act or a Department of Homeland Security.  I want the states and private land owners to protect their own land as they see fit without interference from the federal government.  I want all social services limited to citizens of the sovereign states.  I don’t want mass deportations by the federal government despite believing,\ncontra\nPresident Bush’s assertions, that they are emininently practical, because they are unnecessary.  I want proven illegals deported immediately.\nIs that sufficiently clear, Mr. Hutchinson?  Please note that I have not cried “race-baiting” and I am perfectly willing to school anyone who wishes to debate me honestly or otherwise.\nI’m sorry, but this is the type of talk – and conduct – that has royally turned me off. What is just as bad is the fact that too many conservatives turn a blind eye to all of this. Other tacitly embrace it. Michelle Malkin, for instance, gives VDARE a one-day head start on her columns (as opposed to Townhall.com). She has also approvingly cited Lawrence Auster and Steve Sailer. She recommends VDARE, despite the fact that it runs stuff from Jared Taylor, who happens to be buddy-buddy with the likes of David Duke and Don Black – the webmaster of Stormfront. See what founders of the site RedState.com (no bastion of political correctness) had to say about Auster and Sailer. Decide for yourself if her claims that those who question these connections are engaged in mischaracterization, as she claimed during the controversy over the UAE’s ports deal, or if she has been turning a blind eye to some serious slime.\nIf you’re looking for me to defend Me So Michelle, well, you’ll have to look elsewhere.  See the August archives for enough detail to make you cry….  I can’t say that turning on someone named Harold has ever been a particular goal of mine.\nDo you even give a damn that he’s drawing upon Nazi Germany? Or do you not care as long as the checks clear? Do you really stand with all of this? Do you consider that sort of stuff acceptable? Michelle, do you believe in this stuff?  As far as I am concerned, Michelle, Master Gunnery Sergeant Guadalupe Denogean is far more of an American than Taylor, Auster, and Sailer combined. He has certainly risked a lot more for this country and gave far more than Tom Tancredo ever has.\nSince when did drawing upon the historical lessons of Germany, be it during the National Socialist era or the Teutoberger Wald era, become verboten?  Does Mr. Hutchinson similarly avoid flying on jets because National Socialist scientists developed them?  It’s also interesting to see how he is quantifying and ranking Americanness.  Such fun!  How do blacks rate, Harold?  How about Jews with Israeli citizenship?  Do you get an extra five points for supporting the Iraqi Occupation?\nIf it sounds like I’m in the mood for a fight, it’s because I am. I’m sick of being told that somehow, I believe in “post-America” and that my level of commitment to this country is no more than shacking up. I’ve had enough of the abuse that Malkin and others heap on me for not being quiet about the thoughts I have on this issue – all because I have disagreed with them.  I’m not running away. I’m in the mood for a fight. Bring it on.\nI’m curious to know how many immigrants are considered acceptable by the pro-immigration crowd.  We know that 30 million Mexicans and others are acceptable to them, are 300 million Chinese similarly okay?  At what point between 12 million immigrants and 300 million immigrants does racism begin?  And precisely what quantity of immigrants will cause significant change in the American political system given our quasi-democratic system?\nOn a tangential note, one supportive reader pointed out that last night Dear Jorge boasted that six million immigrants had already been deported.  It seems to me that he just shot himself in the tongue and proved my case that he was previously lying in one fell swoop.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-16T19:23:00+00:00"
}