{
  "url": "https://voxday.net/2006/05/20/in-defense-of-me-so-michelle/",
  "scraped_at": "2026-01-08T21:08:31.080371",
  "title": "In defense of Me So Michelle",
  "date_display": "May 20, 2006",
  "date_iso": "2006-05-20T23:00:00+00:00",
  "date_from_url": "2006-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Captain Ed <a href=\"http://www.captainsquartersblog.com/mt/archives/007025.php#comments\">defends Miz Malkin</a>:</p><blockquote><p>What people who engage in these kind of tactics — on either the right or the left, it’s all the same — is that the attacks reveal themselves as haters, not the object of their scorn. If they dislike what Michelle says, then they should counter her arguments with their own, or contradictory facts. Pareene shows what happens when the critics have neither. They engage in ad-hominem attacks designed to humiliate their opponents and to either get them to respond in kind or to withdraw from the debate althogether. It’s a cowardly tactic besides being immature and (in this case) misogynistic.</p></blockquote><p>I disagree with the good Captain here for multiple reasons and the number of the reasons shall be three.  There shall not be five reasons, neither shall there be two, except in that I proceedeth on to three.</p><p>1.  The vast majority human beings are incapable of rational argument.  The normal person rationalizes an emtional position, he does not think the matter through, reach a logical conclusion and then patiently examine the conceptual steps from start to finish.  One has merely to look at how many people couldn’t resist hurling the Nazi label last week despite the fact that the accusation made no sense whatsoever on multiple levels.  Since most people have no idea how to go about either methodically constructing or criticizing an argument, why be surprised when they don’t?</p><p>2.  Me So Michelle is currently the foremost example of a media whore and she deserves to be treated like one.  If the woman would engage in substantive discussion, which she repeatedly and reliably refuses to do – I know the Captain is well aware of this, considering how she ducked me on his own radio show – then she would have grounds for complaining about being treated unfairly.  But since she won’t do so, she deserves the treatment she gets.  What incentive is there for anyone to provide her with counterarguments?  Why should anyone bother taking the time to do research and assemble facts that prove her wrong?  Her response will be the same as if one simply calls her a stupid Asian skank and has done with it.</p><p>Hey, I’m still willing to have a factual, refereed and insult-free debate on the military necessity for WWII-era Japanese internment with her.  Is she?  And if not, then she and her defenders should simply admit that she has no interest in substantive criticism and stop whining about the <em>ad hominum</em> attacks.</p><p>3.  Name-calling is loads of fun.  If it wasn’t, we wouldn’t do it.  No doubt RAW would insist that we are merely indulging our inner primate and playing out virtual dominance games through metaphorical feces-flinging, but regardless, name-calling is a fundamental and time-honored form of human interaction.  There are places for civilized and refined behavior, but save the cucumber sandwiches for the tea parties.  The Internet is more akin to a vast sewage system than a Victorian social network anyway, so whether you run a little treatment plant or dump more than your fair share of filth in to the pipes – and why does <a href=\"http://banedad.blogspot.com/\">The Reaper’s Hairball</a> spring insensibly to mind here? – you might as well adjust to the stench and learn to tune it out.</p></div>",
  "content_text": "Captain Ed\ndefends Miz Malkin\n:\nWhat people who engage in these kind of tactics — on either the right or the left, it’s all the same — is that the attacks reveal themselves as haters, not the object of their scorn. If they dislike what Michelle says, then they should counter her arguments with their own, or contradictory facts. Pareene shows what happens when the critics have neither. They engage in ad-hominem attacks designed to humiliate their opponents and to either get them to respond in kind or to withdraw from the debate althogether. It’s a cowardly tactic besides being immature and (in this case) misogynistic.\nI disagree with the good Captain here for multiple reasons and the number of the reasons shall be three.  There shall not be five reasons, neither shall there be two, except in that I proceedeth on to three.\n1.  The vast majority human beings are incapable of rational argument.  The normal person rationalizes an emtional position, he does not think the matter through, reach a logical conclusion and then patiently examine the conceptual steps from start to finish.  One has merely to look at how many people couldn’t resist hurling the Nazi label last week despite the fact that the accusation made no sense whatsoever on multiple levels.  Since most people have no idea how to go about either methodically constructing or criticizing an argument, why be surprised when they don’t?\n2.  Me So Michelle is currently the foremost example of a media whore and she deserves to be treated like one.  If the woman would engage in substantive discussion, which she repeatedly and reliably refuses to do – I know the Captain is well aware of this, considering how she ducked me on his own radio show – then she would have grounds for complaining about being treated unfairly.  But since she won’t do so, she deserves the treatment she gets.  What incentive is there for anyone to provide her with counterarguments?  Why should anyone bother taking the time to do research and assemble facts that prove her wrong?  Her response will be the same as if one simply calls her a stupid Asian skank and has done with it.\nHey, I’m still willing to have a factual, refereed and insult-free debate on the military necessity for WWII-era Japanese internment with her.  Is she?  And if not, then she and her defenders should simply admit that she has no interest in substantive criticism and stop whining about the\nad hominum\nattacks.\n3.  Name-calling is loads of fun.  If it wasn’t, we wouldn’t do it.  No doubt RAW would insist that we are merely indulging our inner primate and playing out virtual dominance games through metaphorical feces-flinging, but regardless, name-calling is a fundamental and time-honored form of human interaction.  There are places for civilized and refined behavior, but save the cucumber sandwiches for the tea parties.  The Internet is more akin to a vast sewage system than a Victorian social network anyway, so whether you run a little treatment plant or dump more than your fair share of filth in to the pipes – and why does\nThe Reaper’s Hairball\nspring insensibly to mind here? – you might as well adjust to the stench and learn to tune it out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-20T22:00:00+00:00"
}