{
  "url": "https://voxday.net/2006/05/14/its-way-that-he-moves-things-that-he/",
  "scraped_at": "2026-01-08T21:07:39.248254",
  "title": "It’s the way that he moves, the things that he do",
  "date_display": "May 14, 2006",
  "date_iso": "2006-05-14T20:11:00+00:00",
  "date_from_url": "2006-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whoa-oh-oh.  And we hear again from JB:</p><blockquote><p>Yeah, I agree it was a poor e-mail that I originally wrote. I should’ve just summarized my objection in one sentence: if it’s better for women to stay home because it reduces supply, why not keep most of the men home, too, putting salaries through the roof?</p></blockquote><p>JB – who is actually a decent guy – isn’t referring to the previous email posted here, but one sent to me several weeks ago that I ignored.  (You may wish to note that the longer and more meandering an email, the greater the chance that I will not respond to it.  Either present a complete case or ask straightforward questions.)</p><p>While I won’t say that he now presents a good question, it is at least a straightforward one.  But to address the question directly, an economy with dearth of men will not thrive in the short and intermediate terms, because economic growth depends on technological advancement.  As has been demonstrated quite conclusively over thirty years of equalitarianism, technological advancement is a man’s game, and indeed, largely a young man’s game* at that.</p><p>In the long term, the economy requires more women to stay home and raise families than currently do because working women are less likely to marry, less likely to have children and more likely to have fewer children.  Men simply can’t do that and the alternative, as I have repeatedly pointed out, is to import Muslims and Mexicans.  Subsituting <i>gastarbeiter</i> for children has not worked well for the Bundesrepublik and it is unlikely to work any better in America.</p><p>*<em>I was once invited to an elite gathering of 20 CEOs.  Andy Grove of Intel was the host, and the head of Viacom was there along with several other Fortune 500 organizations.  When one of the big kahunas wondered aloud why there were three young guys with leather jackets and earrings at the table with his respectable ilk, Grove explained that we were there as representatives of the game industry and the only ones pressuring Intel to make faster computers.</em></p><p>Now I’m the one wondering what anyone needs a 3GHz computer for.  But I’m not so old that the thought of a physics model accelerator doesn’t give me a momentary thrill.</p></div>",
  "content_text": "Whoa-oh-oh.  And we hear again from JB:\nYeah, I agree it was a poor e-mail that I originally wrote. I should’ve just summarized my objection in one sentence: if it’s better for women to stay home because it reduces supply, why not keep most of the men home, too, putting salaries through the roof?\nJB – who is actually a decent guy – isn’t referring to the previous email posted here, but one sent to me several weeks ago that I ignored.  (You may wish to note that the longer and more meandering an email, the greater the chance that I will not respond to it.  Either present a complete case or ask straightforward questions.)\nWhile I won’t say that he now presents a good question, it is at least a straightforward one.  But to address the question directly, an economy with dearth of men will not thrive in the short and intermediate terms, because economic growth depends on technological advancement.  As has been demonstrated quite conclusively over thirty years of equalitarianism, technological advancement is a man’s game, and indeed, largely a young man’s game* at that.\nIn the long term, the economy requires more women to stay home and raise families than currently do because working women are less likely to marry, less likely to have children and more likely to have fewer children.  Men simply can’t do that and the alternative, as I have repeatedly pointed out, is to import Muslims and Mexicans.  Subsituting\ngastarbeiter\nfor children has not worked well for the Bundesrepublik and it is unlikely to work any better in America.\n*\nI was once invited to an elite gathering of 20 CEOs.  Andy Grove of Intel was the host, and the head of Viacom was there along with several other Fortune 500 organizations.  When one of the big kahunas wondered aloud why there were three young guys with leather jackets and earrings at the table with his respectable ilk, Grove explained that we were there as representatives of the game industry and the only ones pressuring Intel to make faster computers.\nNow I’m the one wondering what anyone needs a 3GHz computer for.  But I’m not so old that the thought of a physics model accelerator doesn’t give me a momentary thrill.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-14T19:11:00+00:00"
}