{
  "url": "https://voxday.net/2006/05/16/michael-medved-and-moronic-imperative/",
  "scraped_at": "2026-01-08T21:07:57.712143",
  "title": "Michael Medved and the moronic imperative",
  "date_display": "May 16, 2006",
  "date_iso": "2006-05-16T21:46:00+00:00",
  "date_from_url": "2006-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Did I just hear Micheal Medved call you, Vox Day, by name and then refer to you as a Nazi-lover? That’s some rather negative mass advertising, Big Daddy. I hate hearing that. Some caller was referrring to your comments, don’t know who.</p></blockquote><p>Why would it concern me?  Michael Medved is an intellectual joke who wouldn’t know a National Socialist from a Volkswagen. <em>We just dropped it like it’s hot, Michael, V-Dub!</em> As I said previously, anyone who is capable of confusing a National Socialist with a libertarian is not capable of adult conversation.</p><p>Think of it as something akin to a minimum height at the amusement park.  You must be smarter than X if you want to play.</p><p>Like most faux conservatives, Medved dislikes libertarians – or in his parlance, losertarians – so calling them Nazi-lovers is a temptation akin to a fat girl diving into her favorite ice cream.  The fact that it makes no sense won’t trouble him at all, he’s in radio and no one will remember the words tomorrow, much less next week.</p><p>I also declined Mr. Colmes kind invitation and suggested that he simply read the column on the air and let everyone get worked up about it.  I’m not interested, since producers are just doing their job in trolling for fodder for the daily Two Minute Hate.  As I noted in my email, mere column reading seems to work well enough as outrage-generating material for that Air America lady.  Considering that the radio crowd is arguably several points lower on the IQ scale than the Internet crowd, yesterday’s vapors tend to indicate that a reading in Mr. Colmes dulcet tones will inspire the desired Pavlovian reaction.</p></div>",
  "content_text": "Did I just hear Micheal Medved call you, Vox Day, by name and then refer to you as a Nazi-lover? That’s some rather negative mass advertising, Big Daddy. I hate hearing that. Some caller was referrring to your comments, don’t know who.\nWhy would it concern me?  Michael Medved is an intellectual joke who wouldn’t know a National Socialist from a Volkswagen.\nWe just dropped it like it’s hot, Michael, V-Dub!\nAs I said previously, anyone who is capable of confusing a National Socialist with a libertarian is not capable of adult conversation.\nThink of it as something akin to a minimum height at the amusement park.  You must be smarter than X if you want to play.\nLike most faux conservatives, Medved dislikes libertarians – or in his parlance, losertarians – so calling them Nazi-lovers is a temptation akin to a fat girl diving into her favorite ice cream.  The fact that it makes no sense won’t trouble him at all, he’s in radio and no one will remember the words tomorrow, much less next week.\nI also declined Mr. Colmes kind invitation and suggested that he simply read the column on the air and let everyone get worked up about it.  I’m not interested, since producers are just doing their job in trolling for fodder for the daily Two Minute Hate.  As I noted in my email, mere column reading seems to work well enough as outrage-generating material for that Air America lady.  Considering that the radio crowd is arguably several points lower on the IQ scale than the Internet crowd, yesterday’s vapors tend to indicate that a reading in Mr. Colmes dulcet tones will inspire the desired Pavlovian reaction.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-16T20:46:00+00:00"
}