{
  "url": "https://voxday.net/2006/05/31/professors-heretical-thoughts/",
  "scraped_at": "2026-01-08T21:09:10.068471",
  "title": "A professor’s heretical thoughts",
  "date_display": "May 31, 2006",
  "date_iso": "2006-05-31T13:27:00+00:00",
  "date_from_url": "2006-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems Forbes Magazine and I are not the only ones <a href=\"http://www.heartland.org/pdf/14774.pdf\">dubious about the value of a modern college education</a> (Link to PDF):</p><blockquote><p>In America and all across the western world, intellectuals are enthralled with the abolition of moral and intellectual standards.  In the courts and in the media, as well as the classroom, they are ramming this dogma down the throats of the vast majority….</p><p>But am I not endorsing the very anti-intellectualism I decry? Not at all. Authentic, rigorous higher education is simply not designed for everybody. By pretending otherwise, we spend millions on counterfeit courses, cheat those who would have benefited from genuine learning, and frustrate legions of young people who drop out and flunk out. Nothing, of course, prevents those who opt for vocational <br>training to investigate the world of books and ideas. Indeed, they may do so without being exposed to the leftist slant that colors much of the current academic experience.</br></p><p>As is often said, democracy depends upon an informed citizenry. But “informed” is not a synonym for half-educated or badly-educated. There is such a thing as self-education, of course, and after decades in the college classroom I’ve become convinced that it is the hope of the future.</p></blockquote><p>Formal education is mostly a scam.  For example, I have a piece of paper that claims I am some sort of expert on Asia and can speak Japanese as well as what passes for the lingua franca of the Dismal Science.  I also have a few college credits of German, (albeit only thanks to a good high school teacher and decent results on an AP test).</p><p>The reality is that I can understand a few words of Japanese on a good day and if I’m lucky I might be able to respond with some polite noises.  I can get by reasonably well in German as long as the conversation remains simple and superficial. <em>Es tut mir leid, ich spreche nur ein wenig Deutsch, sprechen Sie mehr langsam, bitte….</em> However, I am fully functional in Italian despite my complete lack of corresponding academic credentials.  Go figure.</p><p>As the price of college continues to spiral, as grade inflation continues apace and as the mind sewage of left-wing propaganda continues to flow, one really has to wonder why any parent in his right mind would encourage his child to attend a university.</p></div>",
  "content_text": "It seems Forbes Magazine and I are not the only ones\ndubious about the value of a modern college education\n(Link to PDF):\nIn America and all across the western world, intellectuals are enthralled with the abolition of moral and intellectual standards.  In the courts and in the media, as well as the classroom, they are ramming this dogma down the throats of the vast majority….\nBut am I not endorsing the very anti-intellectualism I decry? Not at all. Authentic, rigorous higher education is simply not designed for everybody. By pretending otherwise, we spend millions on counterfeit courses, cheat those who would have benefited from genuine learning, and frustrate legions of young people who drop out and flunk out. Nothing, of course, prevents those who opt for vocational\ntraining to investigate the world of books and ideas. Indeed, they may do so without being exposed to the leftist slant that colors much of the current academic experience.\nAs is often said, democracy depends upon an informed citizenry. But “informed” is not a synonym for half-educated or badly-educated. There is such a thing as self-education, of course, and after decades in the college classroom I’ve become convinced that it is the hope of the future.\nFormal education is mostly a scam.  For example, I have a piece of paper that claims I am some sort of expert on Asia and can speak Japanese as well as what passes for the lingua franca of the Dismal Science.  I also have a few college credits of German, (albeit only thanks to a good high school teacher and decent results on an AP test).\nThe reality is that I can understand a few words of Japanese on a good day and if I’m lucky I might be able to respond with some polite noises.  I can get by reasonably well in German as long as the conversation remains simple and superficial.\nEs tut mir leid, ich spreche nur ein wenig Deutsch, sprechen Sie mehr langsam, bitte….\nHowever, I am fully functional in Italian despite my complete lack of corresponding academic credentials.  Go figure.\nAs the price of college continues to spiral, as grade inflation continues apace and as the mind sewage of left-wing propaganda continues to flow, one really has to wonder why any parent in his right mind would encourage his child to attend a university.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-31T12:27:00+00:00"
}