{
  "url": "https://voxday.net/2006/05/02/sacralization-of-politics-and-cult-of/",
  "scraped_at": "2026-01-08T21:06:27.452199",
  "title": "The sacralization of politics and the cult of the idea",
  "date_display": "May 2, 2006",
  "date_iso": "2006-05-02T08:25:00+00:00",
  "date_from_url": "2006-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From FASCISTI by Giordano Bruno Guerri</p><blockquote><p>Secondo Emilio Gentile, il maggiore storico italiano del tema, al cui lavoro questo capitolo deve molto, “il xx secolo puo esser definito <em>l’epoca della sacralizzazione della politica</em>” e il facismo fu il primo esperimento di “istituzionalizzazione di una nuova religione laica” dai tempi della rivoluzione francese.  Il culto che il regime dedico a se stesso dunque non fu soltanto un fenomeno di propaganda, di buona o mala fede da parte di organizzatori e organizzati:</p><p><em>Il problema e piu serio e anche piu drammatico.  I riti e le feste di massa volevano educare per convertire, investendo i valori fondamentali e i fini ultimi dell’esistenza.  La funzione della liturgia di massa andava oltre l’aspetto ludico o demagogico, e pure era presente: mirava a conquistare e plasmare la coscienza morale, la mentalita, i costumi della gente, e persino i suoi piu intimi sentimenti sulla vita e sulla morte.  Nella socializzazione di una religione politica capace di cambiare il carattere degli italiani, trasformandoli in una comunita di credenti nel culto del littorio, i fascisti vedevano la principale condizione per gettare le fondamenta di uno Stato destinato a durare nel tempo e a lasciare nei secoli l’impronta di una nuova civilta.</em></p><p>Gli stessi fenomeni si verificarono nella rivoluzione sovietica e nel movimento nazista.  Ma anche tutte le elite politiche ed economiche democratiche del mondo occidentale ebbero, nel primo dopoguerra, il problema del consenso: “La nuova epoca, quella di un capitalismo organizzato, in forte crescita e tendente a un consumo di massa, richiedeva un governo fondato sul consenso generale. (V. De Grazia).  I regimi totalitari perseguirono quel consenso sopratutto attraverso un culto religioso dell'”idea”, mentre le democrazie cercarono maggiormente di soddisfare le esigenze materiali del popolo.</p></blockquote><p>It is amazing to see the difference between the original sources and histories of those who actually experienced historical fascism and the revisionist summaries of the American academics who wished to use it as a means of whitewashing socialism.  The falsehood of the specious claims that Fascism was embraced by the Catholic church, or even a synthesis of socialism and Catholicism, or that National Socialism was a Christian phenomenon is belied by the European historians, who are not exactly right-wing Protestants.</p><p>I’ll translate this later, but the essential point Guerri is making here is that all three of the twentieth-century totalitarianisms were manufactured religious cults with the State and People substituted for God.  They were attempts to replace Christianity with a political religion, and the astute reader will perceive the ominous significance underlying the Lizard Queen’s “politics of meaning”, which, like its intellectual predecessors, specifically decries the democratic focus on satisfying the material needs of the populace.</p></div>",
  "content_text": "From FASCISTI by Giordano Bruno Guerri\nSecondo Emilio Gentile, il maggiore storico italiano del tema, al cui lavoro questo capitolo deve molto, “il xx secolo puo esser definito\nl’epoca della sacralizzazione della politica\n” e il facismo fu il primo esperimento di “istituzionalizzazione di una nuova religione laica” dai tempi della rivoluzione francese.  Il culto che il regime dedico a se stesso dunque non fu soltanto un fenomeno di propaganda, di buona o mala fede da parte di organizzatori e organizzati:\nIl problema e piu serio e anche piu drammatico.  I riti e le feste di massa volevano educare per convertire, investendo i valori fondamentali e i fini ultimi dell’esistenza.  La funzione della liturgia di massa andava oltre l’aspetto ludico o demagogico, e pure era presente: mirava a conquistare e plasmare la coscienza morale, la mentalita, i costumi della gente, e persino i suoi piu intimi sentimenti sulla vita e sulla morte.  Nella socializzazione di una religione politica capace di cambiare il carattere degli italiani, trasformandoli in una comunita di credenti nel culto del littorio, i fascisti vedevano la principale condizione per gettare le fondamenta di uno Stato destinato a durare nel tempo e a lasciare nei secoli l’impronta di una nuova civilta.\nGli stessi fenomeni si verificarono nella rivoluzione sovietica e nel movimento nazista.  Ma anche tutte le elite politiche ed economiche democratiche del mondo occidentale ebbero, nel primo dopoguerra, il problema del consenso: “La nuova epoca, quella di un capitalismo organizzato, in forte crescita e tendente a un consumo di massa, richiedeva un governo fondato sul consenso generale. (V. De Grazia).  I regimi totalitari perseguirono quel consenso sopratutto attraverso un culto religioso dell'”idea”, mentre le democrazie cercarono maggiormente di soddisfare le esigenze materiali del popolo.\nIt is amazing to see the difference between the original sources and histories of those who actually experienced historical fascism and the revisionist summaries of the American academics who wished to use it as a means of whitewashing socialism.  The falsehood of the specious claims that Fascism was embraced by the Catholic church, or even a synthesis of socialism and Catholicism, or that National Socialism was a Christian phenomenon is belied by the European historians, who are not exactly right-wing Protestants.\nI’ll translate this later, but the essential point Guerri is making here is that all three of the twentieth-century totalitarianisms were manufactured religious cults with the State and People substituted for God.  They were attempts to replace Christianity with a political religion, and the astute reader will perceive the ominous significance underlying the Lizard Queen’s “politics of meaning”, which, like its intellectual predecessors, specifically decries the democratic focus on satisfying the material needs of the populace.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-02T07:25:00+00:00"
}