{
  "url": "https://voxday.net/2006/05/24/schadenfreude-and-softness-of-science/",
  "scraped_at": "2026-01-08T21:08:49.603114",
  "title": "Schadenfreude and the softness of science fiction",
  "date_display": "May 24, 2006",
  "date_iso": "2006-05-24T08:38:00+00:00",
  "date_from_url": "2006-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From “Science Once Again Nudges Science Fiction Towards Fantasy” in the Spring ’06 SFWA Bulletin:</p><blockquote><p>The latest nail which science has driven into the coffin of science fiction appears in the March 2006 issue of <em>Scientific American</em> in an article entitled “Shielding Space Travellers” by Eugene N. Parker.  Roughly, cosmic rays produce radiation expressed as “rems per year”, and at sea level we receive 0.02 – 0.04, about the equivalent of a couple of x-rays….. Our faithful robots report that interplanetary space, which must be traversed to reach Mars, experiences 13-25 rem per year, so that Martian astronauts would receive a dose of more than 80 rems per round trip….</p><p>So our space ships will need to be shielded with the equivalent of five meters of water, making them so hopelessly massive that the needed acceleration to move them from here to there is simply impossible.</p></blockquote><p>As one who has always felt that the focus of most science fiction writers on “getting the science right” while getting nearly everything else from religion to basic human relations wrong was pedantry bordering on autism, this news makes me laugh.</p><p>Now, certainly several writers will invent cunning ways around this apparent limitation, but the vast majority will simply ignore it while continuing to posture ostentatiously about their commitment to scientific verity.  Wny, without space travel, it will be obvious that romance novels in space are nothing but… romance novels!</p><p>For me, there is little difference between science fiction and fantasy.  They are essentially the same genre wherein the point is entertainment and escapism, with an edifying theme thrown somewhere in the mix if the writer is so inclined.  (I have to say, I am increasingly disinclined to do so, having rather overdone it in my first novel.)  Nevertheless, it is certainly amusing that while the supernatural of which I write from time to time remains possible while the space travel that is a fixture of so much sober and serious science fiction looks increasingly improbable.</p></div>",
  "content_text": "From “Science Once Again Nudges Science Fiction Towards Fantasy” in the Spring ’06 SFWA Bulletin:\nThe latest nail which science has driven into the coffin of science fiction appears in the March 2006 issue of\nScientific American\nin an article entitled “Shielding Space Travellers” by Eugene N. Parker.  Roughly, cosmic rays produce radiation expressed as “rems per year”, and at sea level we receive 0.02 – 0.04, about the equivalent of a couple of x-rays….. Our faithful robots report that interplanetary space, which must be traversed to reach Mars, experiences 13-25 rem per year, so that Martian astronauts would receive a dose of more than 80 rems per round trip….\nSo our space ships will need to be shielded with the equivalent of five meters of water, making them so hopelessly massive that the needed acceleration to move them from here to there is simply impossible.\nAs one who has always felt that the focus of most science fiction writers on “getting the science right” while getting nearly everything else from religion to basic human relations wrong was pedantry bordering on autism, this news makes me laugh.\nNow, certainly several writers will invent cunning ways around this apparent limitation, but the vast majority will simply ignore it while continuing to posture ostentatiously about their commitment to scientific verity.  Wny, without space travel, it will be obvious that romance novels in space are nothing but… romance novels!\nFor me, there is little difference between science fiction and fantasy.  They are essentially the same genre wherein the point is entertainment and escapism, with an edifying theme thrown somewhere in the mix if the writer is so inclined.  (I have to say, I am increasingly disinclined to do so, having rather overdone it in my first novel.)  Nevertheless, it is certainly amusing that while the supernatural of which I write from time to time remains possible while the space travel that is a fixture of so much sober and serious science fiction looks increasingly improbable.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-24T07:38:00+00:00"
}