{
  "url": "https://voxday.net/2006/05/10/three-monkey-ma/",
  "scraped_at": "2026-01-08T21:07:15.542103",
  "title": "Three Monkey math",
  "date_display": "May 10, 2006",
  "date_iso": "2006-05-10T14:39:00+00:00",
  "date_from_url": "2006-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Podhoretz tries the mathematically ignorant con on The Corner:</p><blockquote><p>Derb, You Need… [John Podhoretz]</p><p>…to read Can She Be Stopped?, a book that explains why the third-party temptation for people on the Right is nothing less than a vote for the Left.</p></blockquote><p>Yes, because to these Republican geniuses, 1+0=2.  No wonder they can’t balance the budget.  Perhaps I should explain for those of you who are too slow to grasp basic arithmetic.</p><p>Take three individuals, one Democrat, one Republican, and one Libertarian.  The Democrat votes Democrat.  The Republican votes Republican.  Now, here comes the part that is too hard for the political pundit.</p><p>If the Libertarian votes Libertarian, how many votes have the Democrats received?</p><p>If you answered two, you just might be a Three Monkey Republican.</p><p>Update – Unsurprisingly, the faux conservative is pushing Giuliani as the Lizard Queen Killer.  Yeah, I seem to recall that was going to be the strategy to keep her out of the Senate too.  The amazing thing is how Podhoretz even attempts to explain away Murdoch’s fundraiser for Hillary as an attempt to keep her in the Senate instead of the White House.  It’s hard to believe how much contempt this man has for his readers!  One NROnik, Tim Graham, <a href=\"http://corner.nationalreview.com/post/?q=NjU2NDMwMmUxYTZmYmU2NWM1NGNmNDM0MDE2ODVmOTE=\">responds thusly</a>:</p><blockquote><p>J-Pod, I heard your third-party spiel on Hannity yesterday (nice), but you’re recommending running Rudy Giuliani. How is that not a vote for the left? Hey, let’s run a pro-gay, pro-abortion, liberal Republican with a tabloid-disaster marital record. Cut out his mayoral record on crime and his tough stand on terror, and he IS Hillary. (Well, actually he’s Bill on the cheating, but you know what I mean.) If you don’t want a third party in the race, don’t push for Rudy. Even a “nomination conversion” on social issues isn’t going to save him.</p></blockquote><p>If Giuliani is the Republican nominee, we may only see a Hillary win, but a Hillary landslide.  Republicans might as well put up an official “no conservatives allowed” sign as nominate that self-promoting shyster.</p></div>",
  "content_text": "Podhoretz tries the mathematically ignorant con on The Corner:\nDerb, You Need… [John Podhoretz]\n…to read Can She Be Stopped?, a book that explains why the third-party temptation for people on the Right is nothing less than a vote for the Left.\nYes, because to these Republican geniuses, 1+0=2.  No wonder they can’t balance the budget.  Perhaps I should explain for those of you who are too slow to grasp basic arithmetic.\nTake three individuals, one Democrat, one Republican, and one Libertarian.  The Democrat votes Democrat.  The Republican votes Republican.  Now, here comes the part that is too hard for the political pundit.\nIf the Libertarian votes Libertarian, how many votes have the Democrats received?\nIf you answered two, you just might be a Three Monkey Republican.\nUpdate – Unsurprisingly, the faux conservative is pushing Giuliani as the Lizard Queen Killer.  Yeah, I seem to recall that was going to be the strategy to keep her out of the Senate too.  The amazing thing is how Podhoretz even attempts to explain away Murdoch’s fundraiser for Hillary as an attempt to keep her in the Senate instead of the White House.  It’s hard to believe how much contempt this man has for his readers!  One NROnik, Tim Graham,\nresponds thusly\n:\nJ-Pod, I heard your third-party spiel on Hannity yesterday (nice), but you’re recommending running Rudy Giuliani. How is that not a vote for the left? Hey, let’s run a pro-gay, pro-abortion, liberal Republican with a tabloid-disaster marital record. Cut out his mayoral record on crime and his tough stand on terror, and he IS Hillary. (Well, actually he’s Bill on the cheating, but you know what I mean.) If you don’t want a third party in the race, don’t push for Rudy. Even a “nomination conversion” on social issues isn’t going to save him.\nIf Giuliani is the Republican nominee, we may only see a Hillary win, but a Hillary landslide.  Republicans might as well put up an official “no conservatives allowed” sign as nominate that self-promoting shyster.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-05-10T13:39:00+00:00"
}