{
  "url": "https://voxday.net/2015/02/22/a-bad-joke/",
  "scraped_at": "2025-12-16T12:46:13.137106",
  "title": "A bad joke",
  "date_display": "February 22, 2015",
  "date_iso": "2015-02-22T09:58:00+00:00",
  "date_from_url": "2015-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer observes <a href=\"http://www.unz.com/isteve/commentary-bob-hopes-not-funny-because-he-wasnt-jewish/\">an almost inexplicable slam</a> on a great American comedian:</p><blockquote class=\"tr_bq\"><p> Hope is of real value as a chronicle of a career. For even though Bob Hope’s work is no longer capable of holding the attention of modern audiences, it is still interesting to learn the details of how he turned himself into a star and then managed to stay on top of the mass-culture heap long after most of his less-driven contemporaries had vanished from sight. But Zoglin, for all his admirable thoroughness, inexplicably fails to emphasize the central fact about Hope and his career—one that not only goes a long way toward explaining why he was so successful, but also why we no longer find him funny.</p><p>Simply: He wasn’t Jewish.</p><p>What was missing from his style? Even though Hope was a first-generation<br> European immigrant, there was nothing remotely ethnic about his stage<br> manner. He was among the few successful WASP comics of his generation,<br> and despite the fact that he hired such Jewish writers as Larry Gelbart<br> and Mel Shavelson, the jokes they penned for him lacked the sharp ironic<br> tang of Jewish humor that is to this day one of the essential<br> ingredients in American comedy.</br></br></br></br></br></br></p><p>During World War II, when Americans shared both a common culture and an<br> iron determination to prevail over their common enemy, such a comedian<br> could speak for millions of listeners from coast to coast. But that<br> America no longer exists, and the Americans of the 21st century demand<br> more from comedy than mere reassurance. That is why Bob Hope is<br> forgotten today, and will remain so. All he had to offer were punchlines<br> that no longer have punch.</br></br></br></br></br></br></p></blockquote><p>As one commenter mentioned, this appears to be an attempt by the Dutch Teachout to curry favor with the inward-focused aging Jews who read Commentary and think Woody Allen and Lenny Bruce are the epitome of humor. Hope held up a hell of a lot better than either Allen or Bruce have, and Allen isn’t even dead yet. Let’s face it, the funniest thing Allen ever produced was his self-parodying, quasi-incestuous marriage.</p><p>I’ve never been able to stand what is described as “Jewish humor” myself; I disliked it long before I had any idea that the stupid sort of sex-and-toilet “humor” produced by the likes of Mel Brooks and the whiny tedium of Woody Allen had anything in common, let alone were claimed by a particular ethnic heritage. Later, I tried watching “Seinfeld” and completely failed to see what was supposed to be funny about Jerry Seinfeld whining all the time.</p><p>Joan Rivers could be amusing in small doses, but one of the main things I’ve noticed about “Jewish humor” is that it seems to have a strong tendency to beat a joke to death. “Hey, did you think that was mildly amusing? Let me repeat it three more times and that will make it HILARIOUS, right?” Well, no. That’s actually one thing I wish non-comedians would understand. If you told a little story and you found the reaction to be underwhelming, don’t repeat it. It’s not going to be any more amusing the second time.</p><p>Now, I’ve always assumed there was a great divide between those who found Monty Python amusing and those who thought Benny Hill was a riot. “Jewish humor” strikes me as being more akin to an American form of Benny Hill, as it tends to involve a lot of mugging and sexual themes.</p><p>Then again, the second-funniest comic in the world, Frankie Boyle (Simon Evans, two of whose clips are below, is the funniest in my opinion), utilizes a lot of sexual themes, although usually in a very dark way. <i>“Watching gymnastics is just pedophilia for cowards.”</i> But there is an enormous gap between that sort of black humor and Woody Allen whining to his therapist or Mel Brooks’s masturbating cavemen. I remember people talking about how funny Brooks’s History of the World: Part I was so I rented it one night; I don’t think I made it more than 15 minutes before ejecting the tape from the VCR in disgust. Keep in mind that <a href=\"https://www.youtube.com/watch?v=Db3e8Qw9hhs\">this scene</a> is supposed to be THE most HILARIOUS one from the movie. Notice, in particular, the repetition I mentioned; The very lame joke on French pronunciations is hammered home no less than TWELVE times at the very start. Yeah, that’s just fucking <i>brilliant</i>. Then contrast that sort of production, complete with writers, sets, and actors, with the following examples of Simon Evans utilizing nothing more than a microphone.</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/2oaoIxbpy1o?feature=player_detailpage\" width=\"512\"></iframe></p><p>Of course, it’s pretty much pointless to view comedy as anything but subjective, something that is much more apparent when you live in continental Europe. German humor is freaking ghastly, it’s like black comedy without the comedy. Italian humor is bawdy and straightforward; they simply don’t recognize sarcasm at all. French humor is similar to Italian humor, although a bit more relaxed and less silly, and I haven’t figured out Spanish humor yet. It’s no surprise that English humor has such an impact on American humor; it’s not because they speak the same language, but because it’s broad-spectrum humor that is often appreciated by non-English speakers.</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/mIL8F53V4yY?feature=player_detailpage\" width=\"512\"></iframe><br> <br> “I’m just a comedian goes first!” I would have loved to see Evans skewer the Jon Stewart Show, as Stewart, unlike Mel Brooks and Woody Allen, can be funny, but like Russell Brand, hides behind his comedian’s mask whenever his serious arguments fall short.</br></br></p><p> UPDATE: I found this pair of Twitter exchanges to be more personally amusing than the entire oeuvre of either comedian mentioned:</p><p> Vox Day ‏@voxday<br> I’m curious how anyone could have ever thought Woody Allen was amusing. The only funny thing he ever did was bang his ugly stepdaughter.</br></p><p>Jackie DeLister ‏@JackieDeeNJ<br>Yes, Annie Hall won the Oscar for no reason -_-</br></p><p>Vox Day ‏@voxday<br>So did Titanic. And it had more genuine laughs.</br></p><p>——–</p><p> Vox Day ‏@voxday<br>And who finds Mel Brooks funny? This is said to be<br> the funniest scene of his funniest movie:<br> https://www.youtube.com/watch?v=Db3e8Qw9hhs … It’s BRUTALLY stupid.</br></br></br></p><p>Jackie DeLister ‏@JackieDeeNJ<br>@voxday Are you anti-Semitic?</br></p></div>",
  "content_text": "Steve Sailer observes\nan almost inexplicable slam\non a great American comedian:\nHope is of real value as a chronicle of a career. For even though Bob Hope’s work is no longer capable of holding the attention of modern audiences, it is still interesting to learn the details of how he turned himself into a star and then managed to stay on top of the mass-culture heap long after most of his less-driven contemporaries had vanished from sight. But Zoglin, for all his admirable thoroughness, inexplicably fails to emphasize the central fact about Hope and his career—one that not only goes a long way toward explaining why he was so successful, but also why we no longer find him funny.\nSimply: He wasn’t Jewish.\nWhat was missing from his style? Even though Hope was a first-generation\nEuropean immigrant, there was nothing remotely ethnic about his stage\nmanner. He was among the few successful WASP comics of his generation,\nand despite the fact that he hired such Jewish writers as Larry Gelbart\nand Mel Shavelson, the jokes they penned for him lacked the sharp ironic\ntang of Jewish humor that is to this day one of the essential\ningredients in American comedy.\nDuring World War II, when Americans shared both a common culture and an\niron determination to prevail over their common enemy, such a comedian\ncould speak for millions of listeners from coast to coast. But that\nAmerica no longer exists, and the Americans of the 21st century demand\nmore from comedy than mere reassurance. That is why Bob Hope is\nforgotten today, and will remain so. All he had to offer were punchlines\nthat no longer have punch.\nAs one commenter mentioned, this appears to be an attempt by the Dutch Teachout to curry favor with the inward-focused aging Jews who read Commentary and think Woody Allen and Lenny Bruce are the epitome of humor. Hope held up a hell of a lot better than either Allen or Bruce have, and Allen isn’t even dead yet. Let’s face it, the funniest thing Allen ever produced was his self-parodying, quasi-incestuous marriage.\nI’ve never been able to stand what is described as “Jewish humor” myself; I disliked it long before I had any idea that the stupid sort of sex-and-toilet “humor” produced by the likes of Mel Brooks and the whiny tedium of Woody Allen had anything in common, let alone were claimed by a particular ethnic heritage. Later, I tried watching “Seinfeld” and completely failed to see what was supposed to be funny about Jerry Seinfeld whining all the time.\nJoan Rivers could be amusing in small doses, but one of the main things I’ve noticed about “Jewish humor” is that it seems to have a strong tendency to beat a joke to death. “Hey, did you think that was mildly amusing? Let me repeat it three more times and that will make it HILARIOUS, right?” Well, no. That’s actually one thing I wish non-comedians would understand. If you told a little story and you found the reaction to be underwhelming, don’t repeat it. It’s not going to be any more amusing the second time.\nNow, I’ve always assumed there was a great divide between those who found Monty Python amusing and those who thought Benny Hill was a riot. “Jewish humor” strikes me as being more akin to an American form of Benny Hill, as it tends to involve a lot of mugging and sexual themes.\nThen again, the second-funniest comic in the world, Frankie Boyle (Simon Evans, two of whose clips are below, is the funniest in my opinion), utilizes a lot of sexual themes, although usually in a very dark way.\n“Watching gymnastics is just pedophilia for cowards.”\nBut there is an enormous gap between that sort of black humor and Woody Allen whining to his therapist or Mel Brooks’s masturbating cavemen. I remember people talking about how funny Brooks’s History of the World: Part I was so I rented it one night; I don’t think I made it more than 15 minutes before ejecting the tape from the VCR in disgust. Keep in mind that\nthis scene\nis supposed to be THE most HILARIOUS one from the movie. Notice, in particular, the repetition I mentioned; The very lame joke on French pronunciations is hammered home no less than TWELVE times at the very start. Yeah, that’s just fucking\nbrilliant\n. Then contrast that sort of production, complete with writers, sets, and actors, with the following examples of Simon Evans utilizing nothing more than a microphone.\nOf course, it’s pretty much pointless to view comedy as anything but subjective, something that is much more apparent when you live in continental Europe. German humor is freaking ghastly, it’s like black comedy without the comedy. Italian humor is bawdy and straightforward; they simply don’t recognize sarcasm at all. French humor is similar to Italian humor, although a bit more relaxed and less silly, and I haven’t figured out Spanish humor yet. It’s no surprise that English humor has such an impact on American humor; it’s not because they speak the same language, but because it’s broad-spectrum humor that is often appreciated by non-English speakers.\n“I’m just a comedian goes first!” I would have loved to see Evans skewer the Jon Stewart Show, as Stewart, unlike Mel Brooks and Woody Allen, can be funny, but like Russell Brand, hides behind his comedian’s mask whenever his serious arguments fall short.\nUPDATE: I found this pair of Twitter exchanges to be more personally amusing than the entire oeuvre of either comedian mentioned:\nVox Day ‏@voxday\nI’m curious how anyone could have ever thought Woody Allen was amusing. The only funny thing he ever did was bang his ugly stepdaughter.\nJackie DeLister ‏@JackieDeeNJ\nYes, Annie Hall won the Oscar for no reason -_-\nVox Day ‏@voxday\nSo did Titanic. And it had more genuine laughs.\n——–\nVox Day ‏@voxday\nAnd who finds Mel Brooks funny? This is said to be\nthe funniest scene of his funniest movie:\nhttps://www.youtube.com/watch?v=Db3e8Qw9hhs … It’s BRUTALLY stupid.\nJackie DeLister ‏@JackieDeeNJ\n@voxday Are you anti-Semitic?",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-22T09:58:00+00:00"
}