{
  "url": "https://voxday.net/2015/02/19/a-rabbit-visits/",
  "scraped_at": "2025-12-16T12:45:50.728461",
  "title": "A rabbit visits",
  "date_display": "February 19, 2015",
  "date_iso": "2015-02-19T01:31:00+00:00",
  "date_from_url": "2015-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was rather amusing to see a Whatever rabbit creep out of the warren just long enough to discover this place, only to run quickly away to warn all the other rabbits how dark and scary and terrible it is:</p><blockquote class=\"tr_bq\"><p> I’m a fairly casual Scalzi fan. I read Whatever regularly and I’ve read almost all of your books (most of them from the library – sorry!) and I’ve enjoyed almost all of them. I’m aware of some of the controversies that have floated around in the past, but this is the first time I actually ventured into the comments section of one of the bizarre blog posts you’ve commented upon. I was somewhat repelled by some of the comments supporting this idiotic blog post, but then I made the mistake of clicking on a link to one of the commentator’s blogs.</p><p>Holy shit, I have never descended into such a cesspool of ignorance and hatred – even on Youtube. John, what on earth did you manage to do in order to generate such vitriol? I ended up on a page where you were continually referred to as ‘McRapey’ and these….people…were gleefully interpreting this post as ‘the head rabbit trying to reassure the warren’ as the bulldozers came closer. I vaguely recall the whole ‘McRapey’ thing, but wasn’t that years ago? And how on earth have so many other troglodytes gathered together to gibber their hatred of you into the darkness? Dammit John, the worst thing I’ve ever thought of you was that Old Man’s War seemed too derivative of The Forever War- these people want you slowly tortured to death!</p><p>Hey, I understand there are horrible people out there and I understand that the Internet encourages bellicose assholery that would never be said face to face in the real world. But good god, you’ve managed to put a serious dent in my faith in humanity overall. These people are so…pathetic…and yet they hate you SOOOO MUCH! I’m impressed that you can express such sympathy to these obviously mentally-ill individuals. Hugs? I’d rather see them in asylums with padded walls, stout locks and some very patient psychiatrists.</p></blockquote><p>So brave. And he wants to see all of you obviously mentally-ill individuals locked up in asylums. That’s a totally new and different position for the Left, isn’t it? It’s particularly funny to see a casual Scalzi fan call anyone else pathetic. One can only roll ones eyes at those who haven’t seen through the charlatan’s act yet. McRapey’s response was, as always, laden with his unique combination of lies and self-serving spin:</p><blockquote class=\"tr_bq\"><p> You appear to have landed on the site of Theodore Beale/Vox Day. The short version is he’s an odious little man who is deeply envious of my career, which he feels he should have, and lies about me a lot to make himself feel better. It doesn’t appear to be working very well, either in making him feel better, or doing any material damage to me. I had in fact already cut him out of my ego surfing (the poor lad cannot go a day or two without talking about me) long before I made my Lenten observation choice this year. So he didn’t affect the choice one way or the other.</p></blockquote><p>This should be fun. Let’s chronicle the lies:</p><ol><li>“Odious little man”. Odious is subjective, but I am taller and heavier than my favorite former NFL cornerback, Antoine Winfield. Unlike Larry Correia, I couldn’t crush Scalzi’s skull with my bare hands, but I could probably snap his tubby neck.</li><li>“deeply envious of my career”. Yes, that’s why I write 850-page epic fantasy novels, so I can have a career like a guy who openly rips off Heinlein, Piper, Dick, and Star Trek in order to write novels less than half that long. That’s also why I spend my time doing anthologies with Jerry Pournelle, editing landmark military theory by Bill Lind and Martin van Creveld, and working with great authors like Tom Kratman and John C. Wright. When I’m not designing ground-breaking computer games. I don’t envy <i>anything </i>about him. Not his career, not his blog traffic, not his fans, not his publisher, not his looks, not his wife, and not his life. The one thing that impresses me about him is his astonishing ability to put lipstick on a bowel movement and sell it to the sufficiently credulous. But I don’t envy it.</li><li>“which he feels he should have”. I had my shot at that kind of career. I turned down the Starcraft tie-in novels that Pocket Books and Blizzard asked me to write. Once they started talking about the Queen of Blades cackling evilly before she swept dramatically offstage, I decided it was not for me.</li><li>“Lies about me a lot”. Au contraire. John Scalzi lies about himself a lot. I tell the truth about him, truth which is always supported by conclusive evidence. For example, John inflated his “extraordinary amount” of site traffic by 5x in <a href=\"http://www.lightspeedmagazine.com/nonfiction/interview-john-scalzi/\">a 2010 interview with Lightspeed Magazine</a>. I merely exposed the fact that he was actually getting 12,860 pageviews per day, considerably less than the 64,500 daily pageviews he was claiming</li><li>“to make himself feel better”. I lift weights and score goals to make myself feel better. Doing a set of curls at 115 or putting the ball in the net is what makes me feel good. Dealing with Scalzi is more like picking up after the dogs. Someone has to do it, but it’s kind of disgusting.</li><li>“doing any material damage to me”. Scalzi’s site traffic is down by as much as 60 percent from when it peaked at 1,027,644 in May 2012. Many of the people who used to support him and read him simply don’t anymore. Not all of that is down to me, of course. A lot of people caught on to his fraudulent act over time, just as I eventually did. And by his own admission, he’s now out of contract with Tor Books.</li><li>“cut him out of my ego surfing”. Probably, but not necessarily, a lie.This guy publicly admits to searching the Internet for references to himself <i>several times a DAY</i>. What are the odds he’s telling the truth here? Good lord, I haven’t searched my name in months. If I want to read fiction about myself, I’ll just go to my Wikipedia page.</li><li><strike>“he didn’t affect the choice one way or the other.”</strike> Actually, I buy this. If Scalzi is observing Lent, good for him. At least he appears to be looking in the right direction. One hopes he will finds what he needs to fill the gaping hole in his heart.</li></ol><p>Total = 6 lies and one possible lie in 5 sentences. Scalzi’s not even trying; he can usually average 2+ per sentence without even breaking a sweat. And even his worst calumnies were easily exceeded by this wild-eyed rabbit’s foot-stomping performance:</p><blockquote class=\"tr_bq\"><p> The right wing has proven time again that they have no imagination, much less any capability for rational thought. They are never going to dominate the awards simply for the fact that they can’t write for shit. Right now they are promoting John C Wright, hah! puulllezze! That idiot couldn’t write his way out of a paper bag and will never win any award. Let them try to take over the awards, I say bring it on.</p></blockquote><p>(shakes head) It’s like they don’t even know what the words they are using mean.</p></div>",
  "content_text": "It was rather amusing to see a Whatever rabbit creep out of the warren just long enough to discover this place, only to run quickly away to warn all the other rabbits how dark and scary and terrible it is:\nI’m a fairly casual Scalzi fan. I read Whatever regularly and I’ve read almost all of your books (most of them from the library – sorry!) and I’ve enjoyed almost all of them. I’m aware of some of the controversies that have floated around in the past, but this is the first time I actually ventured into the comments section of one of the bizarre blog posts you’ve commented upon. I was somewhat repelled by some of the comments supporting this idiotic blog post, but then I made the mistake of clicking on a link to one of the commentator’s blogs.\nHoly shit, I have never descended into such a cesspool of ignorance and hatred – even on Youtube. John, what on earth did you manage to do in order to generate such vitriol? I ended up on a page where you were continually referred to as ‘McRapey’ and these….people…were gleefully interpreting this post as ‘the head rabbit trying to reassure the warren’ as the bulldozers came closer. I vaguely recall the whole ‘McRapey’ thing, but wasn’t that years ago? And how on earth have so many other troglodytes gathered together to gibber their hatred of you into the darkness? Dammit John, the worst thing I’ve ever thought of you was that Old Man’s War seemed too derivative of The Forever War- these people want you slowly tortured to death!\nHey, I understand there are horrible people out there and I understand that the Internet encourages bellicose assholery that would never be said face to face in the real world. But good god, you’ve managed to put a serious dent in my faith in humanity overall. These people are so…pathetic…and yet they hate you SOOOO MUCH! I’m impressed that you can express such sympathy to these obviously mentally-ill individuals. Hugs? I’d rather see them in asylums with padded walls, stout locks and some very patient psychiatrists.\nSo brave. And he wants to see all of you obviously mentally-ill individuals locked up in asylums. That’s a totally new and different position for the Left, isn’t it? It’s particularly funny to see a casual Scalzi fan call anyone else pathetic. One can only roll ones eyes at those who haven’t seen through the charlatan’s act yet. McRapey’s response was, as always, laden with his unique combination of lies and self-serving spin:\nYou appear to have landed on the site of Theodore Beale/Vox Day. The short version is he’s an odious little man who is deeply envious of my career, which he feels he should have, and lies about me a lot to make himself feel better. It doesn’t appear to be working very well, either in making him feel better, or doing any material damage to me. I had in fact already cut him out of my ego surfing (the poor lad cannot go a day or two without talking about me) long before I made my Lenten observation choice this year. So he didn’t affect the choice one way or the other.\nThis should be fun. Let’s chronicle the lies:\n“Odious little man”. Odious is subjective, but I am taller and heavier than my favorite former NFL cornerback, Antoine Winfield. Unlike Larry Correia, I couldn’t crush Scalzi’s skull with my bare hands, but I could probably snap his tubby neck.\n“deeply envious of my career”. Yes, that’s why I write 850-page epic fantasy novels, so I can have a career like a guy who openly rips off Heinlein, Piper, Dick, and Star Trek in order to write novels less than half that long. That’s also why I spend my time doing anthologies with Jerry Pournelle, editing landmark military theory by Bill Lind and Martin van Creveld, and working with great authors like Tom Kratman and John C. Wright. When I’m not designing ground-breaking computer games. I don’t envy\nanything\nabout him. Not his career, not his blog traffic, not his fans, not his publisher, not his looks, not his wife, and not his life. The one thing that impresses me about him is his astonishing ability to put lipstick on a bowel movement and sell it to the sufficiently credulous. But I don’t envy it.\n“which he feels he should have”. I had my shot at that kind of career. I turned down the Starcraft tie-in novels that Pocket Books and Blizzard asked me to write. Once they started talking about the Queen of Blades cackling evilly before she swept dramatically offstage, I decided it was not for me.\n“Lies about me a lot”. Au contraire. John Scalzi lies about himself a lot. I tell the truth about him, truth which is always supported by conclusive evidence. For example, John inflated his “extraordinary amount” of site traffic by 5x in\na 2010 interview with Lightspeed Magazine\n. I merely exposed the fact that he was actually getting 12,860 pageviews per day, considerably less than the 64,500 daily pageviews he was claiming\n“to make himself feel better”. I lift weights and score goals to make myself feel better. Doing a set of curls at 115 or putting the ball in the net is what makes me feel good. Dealing with Scalzi is more like picking up after the dogs. Someone has to do it, but it’s kind of disgusting.\n“doing any material damage to me”. Scalzi’s site traffic is down by as much as 60 percent from when it peaked at 1,027,644 in May 2012. Many of the people who used to support him and read him simply don’t anymore. Not all of that is down to me, of course. A lot of people caught on to his fraudulent act over time, just as I eventually did. And by his own admission, he’s now out of contract with Tor Books.\n“cut him out of my ego surfing”. Probably, but not necessarily, a lie.This guy publicly admits to searching the Internet for references to himself\nseveral times a DAY\n. What are the odds he’s telling the truth here? Good lord, I haven’t searched my name in months. If I want to read fiction about myself, I’ll just go to my Wikipedia page.\n“he didn’t affect the choice one way or the other.”\nActually, I buy this. If Scalzi is observing Lent, good for him. At least he appears to be looking in the right direction. One hopes he will finds what he needs to fill the gaping hole in his heart.\nTotal = 6 lies and one possible lie in 5 sentences. Scalzi’s not even trying; he can usually average 2+ per sentence without even breaking a sweat. And even his worst calumnies were easily exceeded by this wild-eyed rabbit’s foot-stomping performance:\nThe right wing has proven time again that they have no imagination, much less any capability for rational thought. They are never going to dominate the awards simply for the fact that they can’t write for shit. Right now they are promoting John C Wright, hah! puulllezze! That idiot couldn’t write his way out of a paper bag and will never win any award. Let them try to take over the awards, I say bring it on.\n(shakes head) It’s like they don’t even know what the words they are using mean.",
  "tags": [
    "McRapey",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-19T01:31:00+00:00"
}