{
  "url": "https://voxday.net/2015/02/18/a-tale-of-two-comments/",
  "scraped_at": "2025-12-16T12:45:45.257788",
  "title": "A tale of two comments",
  "date_display": "February 18, 2015",
  "date_iso": "2015-02-18T09:53:00+00:00",
  "date_from_url": "2015-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kevin Standlee and I were <a href=\"http://file770.com/?p=20905#comments\">exchanging comments at File 770</a> about Patrick Richardson’s post concerning how he was <a href=\"https://otherwheregazette.wordpress.com/2015/02/15/not-a-real-fan/\">not considered a Real Fan</a> of science fiction and fantasy:</p><blockquote class=\"tr_bq\"><p> KS: <i>It sounds very much to me like, “Because there aren’t more people who think JUST LIKE ME!”</i></p><p>VD: Then why are so many of you bitching about the fact that we’re flooding<br> the Hugo voting with more people who do, in fact, think like us? Larry<br> brought in a few dozen voters last year. Now we’re bringing in a few<br> hundred more. You want more people? Fine. We’ll give you more people.</br></br></br></p><p>KS: <i>Yep, go ahead. What many of us object to is the implication that people should nominate/vote for things without reading them, because it will make the Bad People Cry. Even more annoying to me is the implication that those of us who have been voting have been doing so for Evil Political Reasons, not because we like the works involved. This strikes me very much as an argument made by people who have so little empathy that they can’t believe any rational person would like things other than what they like, and therefore the only reason things they don’t like win is because of the system being borked by Evil People.</i></p><p>VD: The rules were established last year when the other side declared they<br> did not have to read our works to vote on them…. How can you condemn us for nothing more than<br> following the example they set last year? We were being generous. If you actually think mediocre hackwork like <i><br> Redshirts </br></i>and <i>Ancillary Justice</i> and “If You Were a Dinosaur, My Love”<br> represents the best of science fiction today, I feel pity for you. If<br> you were supporting that sort of thing for Evil Political Reasons, at<br> least I could understand that. If you simply like wallowing in literary<br> excrement, well… that is your prerogative.</br></br></br></br></br></br></p></blockquote><p>It’s interesting to see how the goalposts move, is it not? But I encourage you all to note that everyone from Kevin Standlee to John Scalzi now publicly declares it’s fine, it’s great, it’s wonderful that so many Sad Puppies have gotten involved in the Hugo voting process. They never seem to mention the <a href=\"http://www.milobookclub.com/2015/02/02/rabid-puppies-2015/\">Rabid Puppies</a> though. I wonder why that might be?</p><p>Meanwhile, they continue to ignore the fact that the pinkshirts are <i>continuing </i>to do <i>the very thing</i> they accuse our side of doing, which is to say, voting and nominating without reading everything and blindly rejecting the other side’s works on pure political grounds. Consider this very typical and telling comment from a Whatever rabbit:</p><div class=\"comment-content\"><blockquote class=\"tr_bq\"><p> This blog post and the extended discussion in the comments<br> caused me to seek out the Sad Puppy Slate for this year. <b> I readily<br> concede that I haven’t read any of the books or stories on this slate</br></b>;<br> but then, there are incredibly huge numbers of books and stories and<br> articles I haven’t read that were published in 2014.  It’s the nature of<br> the field.</br></br></br></br></p><p>My curiosity did lead me to check out one of the books in the “related works” category:  John Wright’s <i>Transhuman and Subhuman: Essays on Science Fiction and Awful Truth</i>.<br> One of the Amazon reviews of the book quotes one essay in which Wright<br> writes:  “girls who do not like love stories are well advised to learn<br> to like them, because such stories deal with the essential and paramount<br> realities on which much or most of that girl’s happiness in life will<br> hinge.”</br></br></br></br></br></p><p>Yikes!  If that’s a sample of what is in store here, I am not<br> inclined to spend $4.99 to purchase the book for my Kindle.  After all,<br> I’m a woman (not a girl, please note) whose happiness in life is<br> certainly greater for the love of my beloved husband, but who was also<br> very happy with a thriving career, thousands of books, great friends,<br> frequent travel and an abundance of furry critters before he came into<br> my life.  The idea that I can’t be happy without a man — well, you know<br> that old saying about fish and bicycles.</br></br></br></br></br></br></br></p><p>So it appears that, once again this year, the slate has been chosen<br> not with an eye toward the quality of the work in question, but as a<br> means of sticking a thumb into the eye of those not likely to vote for<br> the proposed slate.  How does this win hearts and minds?  Or is the<br> battle the real end here, with persuasion not even intended?  What does<br> that prove?</br></br></br></br></br></p></blockquote><p>The pinkshirts are claiming to be able to judge our quality without ever reading any of it. Meanwhile, we openly mock the quality of the crap they hold up to be science fiction’s best precisely because we HAVE read it, my love. And there isn’t a word of criticism from the nominal Hugo moderates for the likes of this pinkshirt who hasn’t read a single thing from the other side, but rejects all of it on the basis of a single quote from a single review of a book. Furthermore, having been reading the Amazon reviews, she has to be aware that it is a book with 22 ratings averaging 4.8 stars, and yet she claims that single quote somehow indicates that it is a work that has not been chosen for its quality! It’s not just the pinkshirt-nominated works that reek of bullshit.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/02/transhuman_1_criticism.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"215\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/02/transhuman_1_criticism.jpg\" width=\"320\"/></a></div><p>Remember, both Sad Puppies and Rabid Puppies have recommended for nomination John C. Wright’s highly regarded <i>Transhuman and Subhuman</i>, which was a #1 bestseller in Science Fiction History &amp; Criticism and is still a Top 20 bestseller in Philosophy&gt;Good &amp; Evil, in the Best Related Work category that was won last year by an openly tendentious, ideologically-charged <i>BLOG POST</i>. But somehow, <i>we’re </i>accused of being the side that places politics over quality. The evidence strongly suggests otherwise.</p></div></div>",
  "content_text": "Kevin Standlee and I were\nexchanging comments at File 770\nabout Patrick Richardson’s post concerning how he was\nnot considered a Real Fan\nof science fiction and fantasy:\nKS:\nIt sounds very much to me like, “Because there aren’t more people who think JUST LIKE ME!”\nVD: Then why are so many of you bitching about the fact that we’re flooding\nthe Hugo voting with more people who do, in fact, think like us? Larry\nbrought in a few dozen voters last year. Now we’re bringing in a few\nhundred more. You want more people? Fine. We’ll give you more people.\nKS:\nYep, go ahead. What many of us object to is the implication that people should nominate/vote for things without reading them, because it will make the Bad People Cry. Even more annoying to me is the implication that those of us who have been voting have been doing so for Evil Political Reasons, not because we like the works involved. This strikes me very much as an argument made by people who have so little empathy that they can’t believe any rational person would like things other than what they like, and therefore the only reason things they don’t like win is because of the system being borked by Evil People.\nVD: The rules were established last year when the other side declared they\ndid not have to read our works to vote on them…. How can you condemn us for nothing more than\nfollowing the example they set last year? We were being generous. If you actually think mediocre hackwork like\nRedshirts\nand\nAncillary Justice\nand “If You Were a Dinosaur, My Love”\nrepresents the best of science fiction today, I feel pity for you. If\nyou were supporting that sort of thing for Evil Political Reasons, at\nleast I could understand that. If you simply like wallowing in literary\nexcrement, well… that is your prerogative.\nIt’s interesting to see how the goalposts move, is it not? But I encourage you all to note that everyone from Kevin Standlee to John Scalzi now publicly declares it’s fine, it’s great, it’s wonderful that so many Sad Puppies have gotten involved in the Hugo voting process. They never seem to mention the\nRabid Puppies\nthough. I wonder why that might be?\nMeanwhile, they continue to ignore the fact that the pinkshirts are\ncontinuing\nto do\nthe very thing\nthey accuse our side of doing, which is to say, voting and nominating without reading everything and blindly rejecting the other side’s works on pure political grounds. Consider this very typical and telling comment from a Whatever rabbit:\nThis blog post and the extended discussion in the comments\ncaused me to seek out the Sad Puppy Slate for this year.\nI readily\nconcede that I haven’t read any of the books or stories on this slate\n;\nbut then, there are incredibly huge numbers of books and stories and\narticles I haven’t read that were published in 2014.  It’s the nature of\nthe field.\nMy curiosity did lead me to check out one of the books in the “related works” category:  John Wright’s\nTranshuman and Subhuman: Essays on Science Fiction and Awful Truth\n.\nOne of the Amazon reviews of the book quotes one essay in which Wright\nwrites:  “girls who do not like love stories are well advised to learn\nto like them, because such stories deal with the essential and paramount\nrealities on which much or most of that girl’s happiness in life will\nhinge.”\nYikes!  If that’s a sample of what is in store here, I am not\ninclined to spend $4.99 to purchase the book for my Kindle.  After all,\nI’m a woman (not a girl, please note) whose happiness in life is\ncertainly greater for the love of my beloved husband, but who was also\nvery happy with a thriving career, thousands of books, great friends,\nfrequent travel and an abundance of furry critters before he came into\nmy life.  The idea that I can’t be happy without a man — well, you know\nthat old saying about fish and bicycles.\nSo it appears that, once again this year, the slate has been chosen\nnot with an eye toward the quality of the work in question, but as a\nmeans of sticking a thumb into the eye of those not likely to vote for\nthe proposed slate.  How does this win hearts and minds?  Or is the\nbattle the real end here, with persuasion not even intended?  What does\nthat prove?\nThe pinkshirts are claiming to be able to judge our quality without ever reading any of it. Meanwhile, we openly mock the quality of the crap they hold up to be science fiction’s best precisely because we HAVE read it, my love. And there isn’t a word of criticism from the nominal Hugo moderates for the likes of this pinkshirt who hasn’t read a single thing from the other side, but rejects all of it on the basis of a single quote from a single review of a book. Furthermore, having been reading the Amazon reviews, she has to be aware that it is a book with 22 ratings averaging 4.8 stars, and yet she claims that single quote somehow indicates that it is a work that has not been chosen for its quality! It’s not just the pinkshirt-nominated works that reek of bullshit.\nRemember, both Sad Puppies and Rabid Puppies have recommended for nomination John C. Wright’s highly regarded\nTranshuman and Subhuman\n, which was a #1 bestseller in Science Fiction History & Criticism and is still a Top 20 bestseller in Philosophy>Good & Evil, in the Best Related Work category that was won last year by an openly tendentious, ideologically-charged\nBLOG POST\n. But somehow,\nwe’re\naccused of being the side that places politics over quality. The evidence strongly suggests otherwise.",
  "tags": [
    "Hugo Award",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-18T09:53:00+00:00"
}