{
  "url": "https://voxday.net/2015/02/27/an-sjw-guide-to-making-games/",
  "scraped_at": "2025-12-16T12:46:47.948946",
  "title": "An SJW guide to making games",
  "date_display": "February 27, 2015",
  "date_iso": "2015-02-27T12:40:00+00:00",
  "date_from_url": "2015-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anita Sarkeesian is not, by her own admission, a gamer. Nor is she a game developer, let alone a game designer. Kotaku <a href=\"https://archive.today/sotij#selection-7387.1-7398.0\">quoted her as follows</a>:</p><blockquote class=\"tr_bq\"><p> Sarkeesian mentioned her time in grad school, which I believe was the same time she was saying in that clip that she wasn’t a fan of games. “If you asked me at the time, I would probably have said I wasn’t a gamer,” she said. Under her breath she added: “I don’t even know if I want to say that now, but whatever.”</p></blockquote><p>She’s not a gamer. She knows nothing about games. She is a classic SJW entryist, invading a culture to which she does not belong in order to change it according to her principles. Her list of “improvements”:</p><p>“Eight things developers can do to make games less shitty for women.”</p><ol><li>Avoid the Smurfette principle (don’t have just one female character in an ensemble cast, let alone one whose personality is more or less “girl” or “woman.”)</li><li>“Lingerie is not armor” (Dress female characters as something other than sex objects.)</li><li>Have female characters of various body types</li><li>Don’t over-emphasize female characters’ rear ends, not any more than you would the average male character’s</li><li>Include more female characters of color.</li><li>Animate female characters to move the way normal women, soldiers or athletes would move.</li><li>Record female character voiceover so that pain sounds painful, not orgasmic.</li><li>Include female enemies, but don’t sexualize those enemies.</li></ol><p>My response, as a professional game developer, is simple and straightforward. Go to Hell. I don’t tell Anita Sarkeesian how to publicly media-whore herself for a living and she has no business telling me or any other game designer how to make the games we wish to make. Only one point would even theoretically improve any game in even a minor way, and it could be applied equally well to TV and movies, namely, point 6. What is the point of motion capturing a giraffe if you’re trying to portray a cheetah?</p><p>If she thinks my game, or any other game, is “shitty for women”, that’s her right. And it’s my right, and the right of every other single game designer and developer in the industry to tell her that I don’t give the smallest quantum of a damn what she thinks. It is also our right to continue ignoring her recommendations as we go about making the games we want to make rather than the games she would prefer made.</p><p>I am, however, willing to implement one of her suggestions. We will implement her point #7 in <i>First Sword</i> if Anita Sarkeesian volunteers to submit to a physical but non-sexual beating and have the painful sounds she makes in the course of that beating recorded. Solely in the interests of verisimilitude and making games less shitty for women, of course. That’s not a threat, it is merely an offer. She can, of course, refuse, and thereby inform the world that her commitment to her cause is rather less than total. Then we will continue doing exactly what we were doing before she started trying to tell us what to do.</p><p>However, her points do serve to demonstrate the utter futility, the utter <i>idiocy</i>, of giving in to her demands. First the complaint was that there weren’t any women. Now the complaint is that there aren’t enough women, they aren’t dressed right, they’re the wrong color, they don’t walk in the approved fashion, they make the wrong noises, and so on. It never ends.</p><p>Any game developer who is dumb enough to think the demands are going to stop there simply hasn’t been paying attention to anything that has happened in the last 50 years. Just say no to SJWs. Just say no to non-gamers trying to tell game industry professionals how to do their jobs.</p></div>",
  "content_text": "Anita Sarkeesian is not, by her own admission, a gamer. Nor is she a game developer, let alone a game designer. Kotaku\nquoted her as follows\n:\nSarkeesian mentioned her time in grad school, which I believe was the same time she was saying in that clip that she wasn’t a fan of games. “If you asked me at the time, I would probably have said I wasn’t a gamer,” she said. Under her breath she added: “I don’t even know if I want to say that now, but whatever.”\nShe’s not a gamer. She knows nothing about games. She is a classic SJW entryist, invading a culture to which she does not belong in order to change it according to her principles. Her list of “improvements”:\n“Eight things developers can do to make games less shitty for women.”\nAvoid the Smurfette principle (don’t have just one female character in an ensemble cast, let alone one whose personality is more or less “girl” or “woman.”)\n“Lingerie is not armor” (Dress female characters as something other than sex objects.)\nHave female characters of various body types\nDon’t over-emphasize female characters’ rear ends, not any more than you would the average male character’s\nInclude more female characters of color.\nAnimate female characters to move the way normal women, soldiers or athletes would move.\nRecord female character voiceover so that pain sounds painful, not orgasmic.\nInclude female enemies, but don’t sexualize those enemies.\nMy response, as a professional game developer, is simple and straightforward. Go to Hell. I don’t tell Anita Sarkeesian how to publicly media-whore herself for a living and she has no business telling me or any other game designer how to make the games we wish to make. Only one point would even theoretically improve any game in even a minor way, and it could be applied equally well to TV and movies, namely, point 6. What is the point of motion capturing a giraffe if you’re trying to portray a cheetah?\nIf she thinks my game, or any other game, is “shitty for women”, that’s her right. And it’s my right, and the right of every other single game designer and developer in the industry to tell her that I don’t give the smallest quantum of a damn what she thinks. It is also our right to continue ignoring her recommendations as we go about making the games we want to make rather than the games she would prefer made.\nI am, however, willing to implement one of her suggestions. We will implement her point #7 in\nFirst Sword\nif Anita Sarkeesian volunteers to submit to a physical but non-sexual beating and have the painful sounds she makes in the course of that beating recorded. Solely in the interests of verisimilitude and making games less shitty for women, of course. That’s not a threat, it is merely an offer. She can, of course, refuse, and thereby inform the world that her commitment to her cause is rather less than total. Then we will continue doing exactly what we were doing before she started trying to tell us what to do.\nHowever, her points do serve to demonstrate the utter futility, the utter\nidiocy\n, of giving in to her demands. First the complaint was that there weren’t any women. Now the complaint is that there aren’t enough women, they aren’t dressed right, they’re the wrong color, they don’t walk in the approved fashion, they make the wrong noises, and so on. It never ends.\nAny game developer who is dumb enough to think the demands are going to stop there simply hasn’t been paying attention to anything that has happened in the last 50 years. Just say no to SJWs. Just say no to non-gamers trying to tell game industry professionals how to do their jobs.",
  "tags": [
    "#GamerGate",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-27T12:40:00+00:00"
}