{
  "url": "https://voxday.net/2015/02/01/an-sjw-hugo-slate/",
  "scraped_at": "2025-12-16T12:43:54.079794",
  "title": "A SJW Hugo slate",
  "date_display": "February 1, 2015",
  "date_iso": "2015-02-01T18:17:00+00:00",
  "date_from_url": "2015-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><i>JASON SANFORD IS CAMPAIGNING FOR HUGO AWARDS! I REPEAT: <a href=\"http://www.jasonsanford.com/blog/2015/2/my-hugo-and-nebula-award-nominations\">JASON SANFORD IS CAMPAIGNING FOR HUGO AWARDS</a>! </i></b>Call the Thought Police! Alert the Social Justice Media! Sound the Raciss Siren… oh, wait a minute… never mind, it’s all right, he’s got his SJW card.</p><blockquote class=\"tr_bq\"><p> <b>Best Novels</b></p><p>  <i>The Mirror Empire: Worldbreaker Saga 1 </i>by Kameron Hurley. See my original review of the novel.<br>      <br>     <i>The Three-Body Problem</i> by Cixin Liu, translated by Ken Liu. This is why we need translated fiction! This novel, which spans recent Chinese history as it revolves around a strange case of alien contact is one of the best hard science fiction novels I’ve read in years. Can’t wait to read the next book in the trilogy.<br>      <br>     <i>Defenders </i>by Will McIntosh. Just when I thought I’d read every type of alien invasion and military SF story out there, along comes Will McIntosh with something new.<br>      <br>     <i>Lagoon </i>by Nnedi Okorafor. Wow. That’s all I could say after reading this novel, which explores what happens when first contact happens in Lagos, Nigeria. I’ve always loved Nnedi Okorafor’s amazing ability to create true-life characters which both resonate with readers and stories and twist you into new directions — and Lagoon does this and far more in superb ways. Unfortunately, the novel is hard to find in the USA (I had to order a copy from the UK). The USA release is slated for later this year.<br>      <br>     <i>Annihilation </i>by Jeff VanderMeer. If I could, I’d nominate the entire Southern Reach series as one complete work. See my original review of the series.</br></br></br></br></br></br></br></br></p></blockquote><p>He’s got a woman (check), a Chinese man (check), a white man (tsk tsk), a black woman with an African name (check, check, check), and another white man (seriously? Bad SJW!) Alas, poor McRapey. Too white, and for the first time in his life, too male.</p><p>But where are the Native Americans? Where are the Hispanics? Where is the transgendered handicapable lesbian Baha’ist from Papua New Guinea? Why does Jason Sanford hate Mexicans and Indians and Belgians?</p><p>Anyhow, I now look forward to seeing all the Hugo voters who pointed and shrieked at Larry Correia treat Jason Sanford in precisely the same manner. Don’t you? In the meantime, you can play SJW bingo! See if you can find all five!</p><ul><li>“explores this topic in a unique and interesting manner.”  </li><li>“An all-too-rare fictional look…”</li><li>“a subgenre which until recently limited itself in unacceptable ways.”</li><li>“opens our eyes to new realms of possibility and imagination.”</li><li>“beginning an amazing journey as an author…”</li></ul><p>My favorite part is the way Sanford uses the word “amazing” four times. But remember, he’s a PROFESSIONAL writer, people. Don’t try this at home.</p><ul></ul></div>",
  "content_text": "JASON SANFORD IS CAMPAIGNING FOR HUGO AWARDS! I REPEAT:\nJASON SANFORD IS CAMPAIGNING FOR HUGO AWARDS\n!\nCall the Thought Police! Alert the Social Justice Media! Sound the Raciss Siren… oh, wait a minute… never mind, it’s all right, he’s got his SJW card.\nBest Novels\nThe Mirror Empire: Worldbreaker Saga 1\nby Kameron Hurley. See my original review of the novel.\nThe Three-Body Problem\nby Cixin Liu, translated by Ken Liu. This is why we need translated fiction! This novel, which spans recent Chinese history as it revolves around a strange case of alien contact is one of the best hard science fiction novels I’ve read in years. Can’t wait to read the next book in the trilogy.\nDefenders\nby Will McIntosh. Just when I thought I’d read every type of alien invasion and military SF story out there, along comes Will McIntosh with something new.\nLagoon\nby Nnedi Okorafor. Wow. That’s all I could say after reading this novel, which explores what happens when first contact happens in Lagos, Nigeria. I’ve always loved Nnedi Okorafor’s amazing ability to create true-life characters which both resonate with readers and stories and twist you into new directions — and Lagoon does this and far more in superb ways. Unfortunately, the novel is hard to find in the USA (I had to order a copy from the UK). The USA release is slated for later this year.\nAnnihilation\nby Jeff VanderMeer. If I could, I’d nominate the entire Southern Reach series as one complete work. See my original review of the series.\nHe’s got a woman (check), a Chinese man (check), a white man (tsk tsk), a black woman with an African name (check, check, check), and another white man (seriously? Bad SJW!) Alas, poor McRapey. Too white, and for the first time in his life, too male.\nBut where are the Native Americans? Where are the Hispanics? Where is the transgendered handicapable lesbian Baha’ist from Papua New Guinea? Why does Jason Sanford hate Mexicans and Indians and Belgians?\nAnyhow, I now look forward to seeing all the Hugo voters who pointed and shrieked at Larry Correia treat Jason Sanford in precisely the same manner. Don’t you? In the meantime, you can play SJW bingo! See if you can find all five!\n“explores this topic in a unique and interesting manner.”\n“An all-too-rare fictional look…”\n“a subgenre which until recently limited itself in unacceptable ways.”\n“opens our eyes to new realms of possibility and imagination.”\n“beginning an amazing journey as an author…”\nMy favorite part is the way Sanford uses the word “amazing” four times. But remember, he’s a PROFESSIONAL writer, people. Don’t try this at home.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-01T18:17:00+00:00"
}