{
  "url": "https://voxday.net/2015/02/03/atheism-and-problem-of-ignorance/",
  "scraped_at": "2025-12-16T12:44:05.087158",
  "title": "Atheism and the problem of ignorance",
  "date_display": "February 3, 2015",
  "date_iso": "2015-02-03T10:04:00+00:00",
  "date_from_url": "2015-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I’ve seen more than a few episodes of QI, I’ve never considered Stephen Fry to be either very well informed or very intelligent. He strikes me as a considerably messed-up actor who plays the role of an educated and intelligent man for the masses, as opposed to actually being such a creature. Of course, it’s a lot harder to sound intelligent when you’re not being fed lines through your earpiece, which explains how Fry managed to <a href=\"http://www.telegraph.co.uk/news/religion/11381589/Watch-Stephen-Fry-brands-God-utterly-utterly-evil.html\">betray an astonishing ignorance</a> of nearly 2,000 years of Christian theology and abandoning one primary atheist line of defense in the process:</p><blockquote class=\"tr_bq\"><p> Fry was being interviewed for an Irish television show called The Meaning of Life when he launched into an impassioned tirade about God’s existence. Asked if he thought he would get to heaven, he replied: “No, but I wouldn’t want to. I wouldn’t want to get in on his terms. They’re wrong.</p><p>He added: “The God who created this universe, if he created this universe, is quite clearly a maniac, an utter maniac, totally selfish. We have to spend our lives on our knees thanking him. What kind of God would do that?”</p><p>“Yes, the world is very splendid, but it also has in it insects whose whole life cycle is to burrow into the eyes of children and make them blind. Why? Why did you do that to us? It is simply not acceptable. Atheism is not just about not believing there’s a god. On the assumption there is one, what kind of God is he? It’s perfectly apparent that was monstrous, utterly monstrous, and deserves no respect.”</p></blockquote><p>Now, for those whose knowledge of theology does not rise to the level of the Narnia novels, let me point out that basic Christian theology points out that while God’s Creation was initially perfect, it was His choice to give both Man and Angel free will that permitted Lucifer’s initial fall from Heaven, and Man’s subsequent fall from Grace. From these two failures entered in every form of sin, death, and evil.</p><p>Furthermore, Jesus Christ himself made it very clear that it is not the Creator God who rules the Earth. Hence his command to Christians to be IN the world rather than OF it. He specifically refers to Satan as both the prince and the ruler of the world, as one translation has John 12:31: <i>The time for judging this world has come, when Satan, the ruler of this world, will be cast out.</i></p><p>Fry is clearly blaming the wrong party. The utter maniac, the totally selfish and utterly monstrous being he castigates is not the Creator God. It is the usurper who rules the world, whose name is devil, Satan, Lucifer. And what makes his rant so ridiculously stupid is that all of this information is not only in the Bible, but in Milton, in Lewis, in Tolkien, and indeed, in many of the greatest works of the Western artistic canon. God is not “utterly evil”. God is good, and loving, and thank God, merciful. It is the ruler of this world, the prince of the powers of the air, who is utterly and irredeemably evil.</p><p>Ironically enough, Fry commits the same sin as that utter evil, in demanding the right of the clay to judge the potter.</p><p>Notice that Fry also insists that, contra both linguistic etymology and practically every petty Internet atheist ever, “atheism is not just about not believing there’s a god”. In other words, he is conflating atheism and secular humanism, something other atheists have tried very hard to distinguish, and for good reason, because doing so simply transforms atheism into a pallid religion that has no ability to compete intellectually or spiritually with Christianity, Islam, or paganism.</p><p>And then he descended into utter self-parody when he claimed to prefer Greek paganism: <i>“Fry said he preferred the religion of the ancient Greeks whose Gods did not<br> present themselves as being “all-seeing, all-wise, all-kind, all<br> beneficent”.” </br></br></i>This is rather amusing, as the Greek gods were a collection of rapists, adulterers, and murderers who were descended of a parricide and never hesitated to shed vast quantities of human blood in pursuit of their selfish objectives.</p><p>In just one interview, it can be seen that Stephen Fry is a fraud. He is not a brilliant man, but rather, an obtuse and ignorant charlatan.</p><p>UPDATE: No wonder he gets away with it. Consider his fans:</p><blockquote class=\"tr_bq\"><p> Milo Yiannopoulos ‏@Nero<br> Perhaps the neatest skewering of @stephenfry ever, from @voxday</br></p><p>Steve Skipper ‏@SteveSkipper<br>@Nero @stephenfry hardly a skewering, @voxday is using elements of a fictional myth to explain a fictional myth</br></p><p>Vox Day ‏@voxday<br> You’re missing the point. To intelligently criticize a myth, you must criticize THE ACTUAL MYTH.</br></p><p>Steve Skipper ‏@SteveSkipper<br>@voxday @Nero @stephenfry whatever</br></p></blockquote></div>",
  "content_text": "Although I’ve seen more than a few episodes of QI, I’ve never considered Stephen Fry to be either very well informed or very intelligent. He strikes me as a considerably messed-up actor who plays the role of an educated and intelligent man for the masses, as opposed to actually being such a creature. Of course, it’s a lot harder to sound intelligent when you’re not being fed lines through your earpiece, which explains how Fry managed to\nbetray an astonishing ignorance\nof nearly 2,000 years of Christian theology and abandoning one primary atheist line of defense in the process:\nFry was being interviewed for an Irish television show called The Meaning of Life when he launched into an impassioned tirade about God’s existence. Asked if he thought he would get to heaven, he replied: “No, but I wouldn’t want to. I wouldn’t want to get in on his terms. They’re wrong.\nHe added: “The God who created this universe, if he created this universe, is quite clearly a maniac, an utter maniac, totally selfish. We have to spend our lives on our knees thanking him. What kind of God would do that?”\n“Yes, the world is very splendid, but it also has in it insects whose whole life cycle is to burrow into the eyes of children and make them blind. Why? Why did you do that to us? It is simply not acceptable. Atheism is not just about not believing there’s a god. On the assumption there is one, what kind of God is he? It’s perfectly apparent that was monstrous, utterly monstrous, and deserves no respect.”\nNow, for those whose knowledge of theology does not rise to the level of the Narnia novels, let me point out that basic Christian theology points out that while God’s Creation was initially perfect, it was His choice to give both Man and Angel free will that permitted Lucifer’s initial fall from Heaven, and Man’s subsequent fall from Grace. From these two failures entered in every form of sin, death, and evil.\nFurthermore, Jesus Christ himself made it very clear that it is not the Creator God who rules the Earth. Hence his command to Christians to be IN the world rather than OF it. He specifically refers to Satan as both the prince and the ruler of the world, as one translation has John 12:31:\nThe time for judging this world has come, when Satan, the ruler of this world, will be cast out.\nFry is clearly blaming the wrong party. The utter maniac, the totally selfish and utterly monstrous being he castigates is not the Creator God. It is the usurper who rules the world, whose name is devil, Satan, Lucifer. And what makes his rant so ridiculously stupid is that all of this information is not only in the Bible, but in Milton, in Lewis, in Tolkien, and indeed, in many of the greatest works of the Western artistic canon. God is not “utterly evil”. God is good, and loving, and thank God, merciful. It is the ruler of this world, the prince of the powers of the air, who is utterly and irredeemably evil.\nIronically enough, Fry commits the same sin as that utter evil, in demanding the right of the clay to judge the potter.\nNotice that Fry also insists that, contra both linguistic etymology and practically every petty Internet atheist ever, “atheism is not just about not believing there’s a god”. In other words, he is conflating atheism and secular humanism, something other atheists have tried very hard to distinguish, and for good reason, because doing so simply transforms atheism into a pallid religion that has no ability to compete intellectually or spiritually with Christianity, Islam, or paganism.\nAnd then he descended into utter self-parody when he claimed to prefer Greek paganism:\n“Fry said he preferred the religion of the ancient Greeks whose Gods did not\npresent themselves as being “all-seeing, all-wise, all-kind, all\nbeneficent”.”\nThis is rather amusing, as the Greek gods were a collection of rapists, adulterers, and murderers who were descended of a parricide and never hesitated to shed vast quantities of human blood in pursuit of their selfish objectives.\nIn just one interview, it can be seen that Stephen Fry is a fraud. He is not a brilliant man, but rather, an obtuse and ignorant charlatan.\nUPDATE: No wonder he gets away with it. Consider his fans:\nMilo Yiannopoulos ‏@Nero\nPerhaps the neatest skewering of @stephenfry ever, from @voxday\nSteve Skipper ‏@SteveSkipper\n@Nero @stephenfry hardly a skewering, @voxday is using elements of a fictional myth to explain a fictional myth\nVox Day ‏@voxday\nYou’re missing the point. To intelligently criticize a myth, you must criticize THE ACTUAL MYTH.\nSteve Skipper ‏@SteveSkipper\n@voxday @Nero @stephenfry whatever",
  "tags": [
    "atheism",
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-03T10:04:00+00:00"
}