{
  "url": "https://voxday.net/2015/02/23/book-bomb-second-run/",
  "scraped_at": "2025-12-16T12:46:19.777665",
  "title": "Book Bomb, second run",
  "date_display": "February 23, 2015",
  "date_iso": "2015-02-23T17:00:00+00:00",
  "date_from_url": "2015-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry announces the Sad Puppies 3 <a href=\"http://monsterhunternation.com/2015/02/23/sad-puppy-update-book-bomb-for-the-short-fiction-this-wednesday/\">Short Fiction Book Bomb</a>:</p><blockquote class=\"tr_bq\"><p> Mark your calenders. We will be Book Bombing the short fiction categories this Wednesday.</p><p>The Novella Category Bomb was a huge success. Thousands of copies were moved. A week later and they’re still on their respective genres bestseller lists. So basically we made sure that these will be the most widely read items in their category.</p><p>Now we’re going to do the same thing for the short stories and novelettes. Sad Puppies is all about getting people to nominate based on what they like, as opposed to what they are supposed to like.</p></blockquote><p>Now, there are some differences in the Rabid Puppies and Sad Puppies recommendations here, so what we’re going to do in addition to fully supporting the Short Fiction Book Bomb is a) post links to the two Rabid Puppies stories by Steve Rzasa and John C. Wright so people can read them for free, and b) post a link to <i>The Book of Feasts &amp; Seasons</i> which contains two Rabid Puppies recommendations, one for novelette and one for short story, so Book Bombers can bomb it if they wish to do so.</p><p>I’ll even throw in a link to a free story that is neither on the Sad Puppies nor the Rabid Puppies list, but is one that some of you might enjoy reading if you haven’t already read <i>The Altar of Hate</i>.</p><p>As before, if you’ve previously read the works, we encourage you to post reviews on Amazon.</p></div>",
  "content_text": "Larry announces the Sad Puppies 3\nShort Fiction Book Bomb\n:\nMark your calenders. We will be Book Bombing the short fiction categories this Wednesday.\nThe Novella Category Bomb was a huge success. Thousands of copies were moved. A week later and they’re still on their respective genres bestseller lists. So basically we made sure that these will be the most widely read items in their category.\nNow we’re going to do the same thing for the short stories and novelettes. Sad Puppies is all about getting people to nominate based on what they like, as opposed to what they are supposed to like.\nNow, there are some differences in the Rabid Puppies and Sad Puppies recommendations here, so what we’re going to do in addition to fully supporting the Short Fiction Book Bomb is a) post links to the two Rabid Puppies stories by Steve Rzasa and John C. Wright so people can read them for free, and b) post a link to\nThe Book of Feasts & Seasons\nwhich contains two Rabid Puppies recommendations, one for novelette and one for short story, so Book Bombers can bomb it if they wish to do so.\nI’ll even throw in a link to a free story that is neither on the Sad Puppies nor the Rabid Puppies list, but is one that some of you might enjoy reading if you haven’t already read\nThe Altar of Hate\n.\nAs before, if you’ve previously read the works, we encourage you to post reviews on Amazon.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-23T17:00:00+00:00"
}