{
  "url": "https://voxday.net/2015/02/09/brain-hacking-rabbits/",
  "scraped_at": "2025-12-16T12:44:42.933839",
  "title": "Brain-hacking the rabbits",
  "date_display": "February 9, 2015",
  "date_iso": "2015-02-09T13:00:00+00:00",
  "date_from_url": "2015-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really rather remarkable how much rabbit behavior is explained by the r/K model. It puts into perspective so much of what looks completely inexplicable to the sane and more conservative mind that is neither ruled by rhetoric nor dependent upon social status.</p><p>The Anonymous Conservative has cogitated upon the matter and thinks he may have come up with a means of helping the poor, frightened rodents escape the limits of their failed ideology <a href=\"http://www.anonymousconservative.com/blog/using-the-rabbits-amygdalae-to-trigger-conservative-ideological-conversion/\">through hacking their brains</a>.</p><blockquote class=\"tr_bq\"><p> When John Scalzi claimed 50K unique visitors per day on his blog, it<br> didn’t matter whether he had that accomplishment or not. What mattered<br> from the rabbit perspective is if he could create that impression. As in<br> all of rabbitry, the reality flows from the impression, which itself<br> need not flow from any tangible reality. Scalzi claimed it, it was<br> parroted in an article, people got the impression that he had social<br> status, and as a result, social status flowed from the impression.</br></br></br></br></br></br></p><p>This offers the prospect of creating interesting brain hacks, if the<br> K-strategist can train themselves to operate within the liberal<br> cognitive framework. Presently Conservatives concern themselves with<br> reality, and ignore social status. We assume that success is Thomas<br> Edison, and not Kim Kardashian, and our arguments are formed around that<br> assumption.</br></br></br></br></br></p><p>Instead, the Conservative should focus more on creating memes which<br> socially diminish and denigrate liberals, making them appear impotent<br> and inferior. Since to the leftist, reality flows from impression, and<br> social dominance is all important, you must create memes which tie an<br> anchor of inferiority and impotence to leftists, and let the reality<br> flow from that.</br></br></br></br></br></p><p>As an example, what the rabbit meme Vox created does at its core is<br> create an impression of inherent inability, unfitness, weakness, and<br> social inferiority, and attach it cleverly to those who embrace the<br> r-strategy of liberalism. Once those circumstances are created, and the<br> meme’s permeation is great enough that the rabbit cannot escape it, it<br> will prove amazingly unsettling to the rabbits, for whom impression is<br> reality, and reality is impression. Here is a popular impression saying<br> liberals are weak and impotent. Since to the rabbit truth is what other<br> people think, if they self-identify as a liberal, then they will be<br> accepting that people will think they are weak and impotent, and this<br> will make them weak and impotent. (In many ways the rabbit’s perception<br> is actually an accurate read of the reality in a r-selected world.)</br></br></br></br></br></br></br></br></br></br></br></p><p>At that point, a liberal brain will have only one pathway to<br> alleviate the amygdala angst generated by the social damage it sees<br> flowing from that meme – the rabbit can only tell itself that it isn’t a<br> rabbit. To divorce itself from rabbitry, it must abandon every issue<br> that is a part of the rabbit’s r-selected reproductive strategy, and<br> then turn its back on the rest of the warren of rabbits.</br></br></br></br></br></p></blockquote><p>No wonder they so hate being called rabbits. What I find remarkable about what AC is doing here is the way he is articulating and putting into practice some of the principles that Aristotle first elucidated in his <i>Rhetoric</i>. After all, of whom do you think Aristotle was writing when he described those whose minds cannot be changed by information?</p><p>Speaking of rhetorically limited minds where reality flows from the impression, I found this comment by a rabbit to be all too typical”:</p><blockquote class=\"tr_bq\"><p> David W. on <a href=\"http://file770.com/?p=20725&amp;cpage=1#comment-245434\">February 6, 2015 at 7:16 am</a> said:<br> Sorry, but a DNA test result doesn’t make one a “Native American”, but<br> the writers of this horsecrap couldn’t care less about fact, obviously.</br></br></p></blockquote><p>Fascinating. One wonders what would suffice to make one a “Native American” if not DNA, particularly when it says “Native American” on the DNA results and the Bureau of Indian Affairs issues Certificates of Indian Blood.</p></div>",
  "content_text": "It’s really rather remarkable how much rabbit behavior is explained by the r/K model. It puts into perspective so much of what looks completely inexplicable to the sane and more conservative mind that is neither ruled by rhetoric nor dependent upon social status.\nThe Anonymous Conservative has cogitated upon the matter and thinks he may have come up with a means of helping the poor, frightened rodents escape the limits of their failed ideology\nthrough hacking their brains\n.\nWhen John Scalzi claimed 50K unique visitors per day on his blog, it\ndidn’t matter whether he had that accomplishment or not. What mattered\nfrom the rabbit perspective is if he could create that impression. As in\nall of rabbitry, the reality flows from the impression, which itself\nneed not flow from any tangible reality. Scalzi claimed it, it was\nparroted in an article, people got the impression that he had social\nstatus, and as a result, social status flowed from the impression.\nThis offers the prospect of creating interesting brain hacks, if the\nK-strategist can train themselves to operate within the liberal\ncognitive framework. Presently Conservatives concern themselves with\nreality, and ignore social status. We assume that success is Thomas\nEdison, and not Kim Kardashian, and our arguments are formed around that\nassumption.\nInstead, the Conservative should focus more on creating memes which\nsocially diminish and denigrate liberals, making them appear impotent\nand inferior. Since to the leftist, reality flows from impression, and\nsocial dominance is all important, you must create memes which tie an\nanchor of inferiority and impotence to leftists, and let the reality\nflow from that.\nAs an example, what the rabbit meme Vox created does at its core is\ncreate an impression of inherent inability, unfitness, weakness, and\nsocial inferiority, and attach it cleverly to those who embrace the\nr-strategy of liberalism. Once those circumstances are created, and the\nmeme’s permeation is great enough that the rabbit cannot escape it, it\nwill prove amazingly unsettling to the rabbits, for whom impression is\nreality, and reality is impression. Here is a popular impression saying\nliberals are weak and impotent. Since to the rabbit truth is what other\npeople think, if they self-identify as a liberal, then they will be\naccepting that people will think they are weak and impotent, and this\nwill make them weak and impotent. (In many ways the rabbit’s perception\nis actually an accurate read of the reality in a r-selected world.)\nAt that point, a liberal brain will have only one pathway to\nalleviate the amygdala angst generated by the social damage it sees\nflowing from that meme – the rabbit can only tell itself that it isn’t a\nrabbit. To divorce itself from rabbitry, it must abandon every issue\nthat is a part of the rabbit’s r-selected reproductive strategy, and\nthen turn its back on the rest of the warren of rabbits.\nNo wonder they so hate being called rabbits. What I find remarkable about what AC is doing here is the way he is articulating and putting into practice some of the principles that Aristotle first elucidated in his\nRhetoric\n. After all, of whom do you think Aristotle was writing when he described those whose minds cannot be changed by information?\nSpeaking of rhetorically limited minds where reality flows from the impression, I found this comment by a rabbit to be all too typical”:\nDavid W. on\nFebruary 6, 2015 at 7:16 am\nsaid:\nSorry, but a DNA test result doesn’t make one a “Native American”, but\nthe writers of this horsecrap couldn’t care less about fact, obviously.\nFascinating. One wonders what would suffice to make one a “Native American” if not DNA, particularly when it says “Native American” on the DNA results and the Bureau of Indian Affairs issues Certificates of Indian Blood.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-09T13:00:00+00:00"
}