{
  "url": "https://voxday.net/2015/02/26/curses-foiled-again/",
  "scraped_at": "2025-12-16T12:46:42.855782",
  "title": "Curses, foiled again!",
  "date_display": "February 26, 2015",
  "date_iso": "2015-02-26T16:15:00+00:00",
  "date_from_url": "2015-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once more, the techno-left is astonished by the discovery that giving more control to the federal government <a href=\"https://www.eff.org/deeplinks/2015/02/dear-fcc-rethink-those-vague-general-conduct-rules\">doesn’t work out in exactly the precision fine-tuned way they had planned</a> in order to solve every problem everyone except white Christian men have with everything and implement a socially just paradise on this Earth:</p><blockquote class=\"tr_bq\"><p> For many months, EFF has been working with a broad coalition of advocates to persuade the Federal Communications Commission to adopt new Open Internet rules that would survive legal scrutiny and actually help protect the Open Internet. Our message has been clear from the beginning: the FCC has a role to play, but its role must be firmly bounded.</p><p>Two weeks ago, we learned that we had likely managed the first goal—the FCC is going to do the right thing and reclassify broadband as a telecommunications service, giving it the ability to make new, meaningful Open Internet rules.  But we are deeply concerned that the FCC’s new rules will include a provision that sounds like a recipe for overreach and confusion: the so-called “general conduct rule.”</p></blockquote><p>It never seems to occur to them that the only thing that will ever work is to keep the government the fuck out of it. Once the principle of government “management” is established, the goose is cooked. The only question is to what extent, and to whose benefit.</p><p>Once you declare “the FCC has a role to play”, your part is done. You won’t get to tell them how to play it. The FCC will decide that for itself, thank you very much.</p></div>",
  "content_text": "Once more, the techno-left is astonished by the discovery that giving more control to the federal government\ndoesn’t work out in exactly the precision fine-tuned way they had planned\nin order to solve every problem everyone except white Christian men have with everything and implement a socially just paradise on this Earth:\nFor many months, EFF has been working with a broad coalition of advocates to persuade the Federal Communications Commission to adopt new Open Internet rules that would survive legal scrutiny and actually help protect the Open Internet. Our message has been clear from the beginning: the FCC has a role to play, but its role must be firmly bounded.\nTwo weeks ago, we learned that we had likely managed the first goal—the FCC is going to do the right thing and reclassify broadband as a telecommunications service, giving it the ability to make new, meaningful Open Internet rules.  But we are deeply concerned that the FCC’s new rules will include a provision that sounds like a recipe for overreach and confusion: the so-called “general conduct rule.”\nIt never seems to occur to them that the only thing that will ever work is to keep the government the fuck out of it. Once the principle of government “management” is established, the goose is cooked. The only question is to what extent, and to whose benefit.\nOnce you declare “the FCC has a role to play”, your part is done. You won’t get to tell them how to play it. The FCC will decide that for itself, thank you very much.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-26T16:15:00+00:00"
}