{
  "url": "https://voxday.net/2015/02/19/detonating-eu/",
  "scraped_at": "2025-12-16T12:45:55.466847",
  "title": "Detonating the EU",
  "date_display": "February 19, 2015",
  "date_iso": "2015-02-19T09:33:00+00:00",
  "date_from_url": "2015-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Greek has their finger <a href=\"http://www.telegraph.co.uk/finance/comment/ambroseevans_pritchard/11421500/ECB-risks-crippling-political-damage-if-Greece-forced-to-default.html\">on a bigger trigger</a> than most people realize:</p><blockquote class=\"tr_bq\"><p> The political detonating pin for Greek contagion in Europe is an obscure mechanism used by the eurozone’s nexus of central banks to settle accounts. If Greece is forced out of the euro in acrimonious circumstances – a 50/50 risk given the continued refusal of the creditor core to acknowledge their own guilt and strategic errors – the country will not only default on its EMU rescue packages, but also on its “Target2” liabilities to the European Central Bank.</p><p>In normal times, Target2 adjustments are routine and self-correcting. They occur automatically as money is shifted around the currency bloc. The US Federal Reserve has a similar internal system to square books across regions. They turn nuclear if monetary union breaks up.</p><p>The Target2 “debts” owed by Greece’s central bank to the ECB jumped to €49bn in December as capital flight accelerated on fears of a Syriza victory. They may have reached €65bn or €70bn by now….</p><p>The Eurogroup insists that the primary budget surplus be raised from 1.5pc of<br> GDP in 2014, to 3pc this year and 4.5pc next year. As Nobel economist Paul<br> Krugman says, they want to force a country that is already reeling from six<br> years of depression – with the jobless rate still near 50pc – to triple its<br> surplus for no other purpose than paying off foreign creditors for decades<br> to come. They are doing to Greece what the Western allies did to a defeated<br> Germany at Versailles in 1919: imposing unpayable and mutually-destructive<br> reparations on a prostrate nation.</br></br></br></br></br></br></br></p></blockquote><p>Combined with the fact that ISIS is planning to flood southern Italy with “immigrant” invaders, it becomes readily apparent that the EU may not last another eight years. The difference between 1933 and 2023 is that the enemy is no longer defined as other Europeans, but Islamic and African invaders.</p><p>Italians are already demanding that the Italian navy start sinking boats coming across the Mediterranean and attacking refugee holding centers. The Spanish are looking at the Greek situation and wondering why they should not do the same. The Front National is rising quickly in France; the rise of PEGIDA has been arrested but it will resume soon enough, along with support for AfD once the news of Germany being on the hook for up to €515 billion penetrates the electorate.</p><p>No wonder Juncker, the unelected Head of the European Commission has turned openly anti-democratic. But he is as delusional as Hitler in the bunker. Gunnar Beck from London University makes an equally apt comparison: <i>“Germany’s leaders can’t let Greece leave the euro, and the Greeks know<br> it. They will die in a ditch to defend the euro. This is our Eastern Front,<br> our Battle of Kursk, and I’m afraid to say that it will end in unconditional<br> surrender by Germany,” he said. <br> </br></br></br></br></i></p><p>Like gravity, economics always wins in the end.</p></div>",
  "content_text": "Greek has their finger\non a bigger trigger\nthan most people realize:\nThe political detonating pin for Greek contagion in Europe is an obscure mechanism used by the eurozone’s nexus of central banks to settle accounts. If Greece is forced out of the euro in acrimonious circumstances – a 50/50 risk given the continued refusal of the creditor core to acknowledge their own guilt and strategic errors – the country will not only default on its EMU rescue packages, but also on its “Target2” liabilities to the European Central Bank.\nIn normal times, Target2 adjustments are routine and self-correcting. They occur automatically as money is shifted around the currency bloc. The US Federal Reserve has a similar internal system to square books across regions. They turn nuclear if monetary union breaks up.\nThe Target2 “debts” owed by Greece’s central bank to the ECB jumped to €49bn in December as capital flight accelerated on fears of a Syriza victory. They may have reached €65bn or €70bn by now….\nThe Eurogroup insists that the primary budget surplus be raised from 1.5pc of\nGDP in 2014, to 3pc this year and 4.5pc next year. As Nobel economist Paul\nKrugman says, they want to force a country that is already reeling from six\nyears of depression – with the jobless rate still near 50pc – to triple its\nsurplus for no other purpose than paying off foreign creditors for decades\nto come. They are doing to Greece what the Western allies did to a defeated\nGermany at Versailles in 1919: imposing unpayable and mutually-destructive\nreparations on a prostrate nation.\nCombined with the fact that ISIS is planning to flood southern Italy with “immigrant” invaders, it becomes readily apparent that the EU may not last another eight years. The difference between 1933 and 2023 is that the enemy is no longer defined as other Europeans, but Islamic and African invaders.\nItalians are already demanding that the Italian navy start sinking boats coming across the Mediterranean and attacking refugee holding centers. The Spanish are looking at the Greek situation and wondering why they should not do the same. The Front National is rising quickly in France; the rise of PEGIDA has been arrested but it will resume soon enough, along with support for AfD once the news of Germany being on the hook for up to €515 billion penetrates the electorate.\nNo wonder Juncker, the unelected Head of the European Commission has turned openly anti-democratic. But he is as delusional as Hitler in the bunker. Gunnar Beck from London University makes an equally apt comparison:\n“Germany’s leaders can’t let Greece leave the euro, and the Greeks know\nit. They will die in a ditch to defend the euro. This is our Eastern Front,\nour Battle of Kursk, and I’m afraid to say that it will end in unconditional\nsurrender by Germany,” he said.\nLike gravity, economics always wins in the end.",
  "tags": [
    "economics",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-19T09:33:00+00:00"
}