{
  "url": "https://voxday.net/2015/02/16/go-to-israel-now/",
  "scraped_at": "2025-12-16T12:45:33.124353",
  "title": "Go to Israel. Now.",
  "date_display": "February 16, 2015",
  "date_iso": "2015-02-16T13:00:00+00:00",
  "date_from_url": "2015-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been saying it for a while, but Israeli Prime Minister Netanyahu is beating the drum <a href=\"http://news.yahoo.com/netanyahu-urges-jews-move-israel-copenhagen-attacks-111012753.html;_ylt=AwrBJR_ZsuBUUSsAN.nQtDMD\">even more strongly</a>:</p><blockquote class=\"tr_bq\"><p> Israeli Prime Minister Benjamin Netanyahu on Sunday urged European Jews to move to Israel after a Jewish man was killed in an attack outside Copenhagen’s main synagogue.</p><p>“Israel is your home. We are preparing and calling for the absorption of mass immigration from Europe,” Netanyahu said in a statement, repeating a similar call after attacks by jihadists in Paris last month when four Jews were among the dead.</p><p>The cabinet later on Sunday submitted a plan to encourage the absorption<br> of Jews from France, Belgium and Ukraine, and would discuss immigration<br> from other European countries at a later date. </br></br></p></blockquote><p>Jews are neither Europeans nor Christians, neither are they Muslims, so they need to get the hell out of the way and stay safely out of the way of the coming wars. Too many of them have caused too much damage to themselves, to Europe, and to the USA by idiotically encouraging third world immigration in a foolish attempt to protect themselves against Christians who never had any intention of harming them.</p><p>Sam Huntington’s long-foreseen <a href=\"http://edvardas.home.mruni.eu/wp-content/uploads/2008/10/huntington.pdf\">Clash of Civilizations</a> (PDF) is approaching. Those who are opposed to Christian civilization are going to lose again; even the European seculars and pagans are beginning to understand the importance of Christian civilization. I’ve read one of his book and Netanyahu is a good student of not only history in general, but military history in particular, and he understands that if Europe’s Jews continue to stupidly stand in the way of Europeans defending their civilization against the Muslim onslaught, they’re going to be wiped out again.</p><p>That, incidentally, is why France’s prime minister is desperately arguing against the Israeli prime minister’s appeal to Europe’s Jews. Not because he loves Jews more than Netanyahu, but because he is cynically using them as a means of keeping the nationalist leadership that will replace him at bay.</p><p>Israel should no more stand in the way of Europe defending herself against Islamic expansion than Europe should interfere with Israel defending herself Islamic aggression. It appears that Netanyahu, for one, understands that strong Christian nations in Europe are considerably better for Israel than a Muslim-conquered Europe.</p><p>At the moment, I am editing a book by a brilliant Israeli military historian that will be available later this month to newsletter subscribers. And in thinking about how Man’s strategic thinking has developed, it is becoming increasingly evident that the modern militaries presently lack the theoretical means to grasp how events are taking shape or what to do with them. Forget the bromide about how generals are always fighting the last war, right now, the politicians and their military advisors are mostly caught up in entirely fictional theater based on a geopolitical structure that has very little relation to either the current reality or the global wars of the future.</p></div>",
  "content_text": "I’ve been saying it for a while, but Israeli Prime Minister Netanyahu is beating the drum\neven more strongly\n:\nIsraeli Prime Minister Benjamin Netanyahu on Sunday urged European Jews to move to Israel after a Jewish man was killed in an attack outside Copenhagen’s main synagogue.\n“Israel is your home. We are preparing and calling for the absorption of mass immigration from Europe,” Netanyahu said in a statement, repeating a similar call after attacks by jihadists in Paris last month when four Jews were among the dead.\nThe cabinet later on Sunday submitted a plan to encourage the absorption\nof Jews from France, Belgium and Ukraine, and would discuss immigration\nfrom other European countries at a later date.\nJews are neither Europeans nor Christians, neither are they Muslims, so they need to get the hell out of the way and stay safely out of the way of the coming wars. Too many of them have caused too much damage to themselves, to Europe, and to the USA by idiotically encouraging third world immigration in a foolish attempt to protect themselves against Christians who never had any intention of harming them.\nSam Huntington’s long-foreseen\nClash of Civilizations\n(PDF) is approaching. Those who are opposed to Christian civilization are going to lose again; even the European seculars and pagans are beginning to understand the importance of Christian civilization. I’ve read one of his book and Netanyahu is a good student of not only history in general, but military history in particular, and he understands that if Europe’s Jews continue to stupidly stand in the way of Europeans defending their civilization against the Muslim onslaught, they’re going to be wiped out again.\nThat, incidentally, is why France’s prime minister is desperately arguing against the Israeli prime minister’s appeal to Europe’s Jews. Not because he loves Jews more than Netanyahu, but because he is cynically using them as a means of keeping the nationalist leadership that will replace him at bay.\nIsrael should no more stand in the way of Europe defending herself against Islamic expansion than Europe should interfere with Israel defending herself Islamic aggression. It appears that Netanyahu, for one, understands that strong Christian nations in Europe are considerably better for Israel than a Muslim-conquered Europe.\nAt the moment, I am editing a book by a brilliant Israeli military historian that will be available later this month to newsletter subscribers. And in thinking about how Man’s strategic thinking has developed, it is becoming increasingly evident that the modern militaries presently lack the theoretical means to grasp how events are taking shape or what to do with them. Forget the bromide about how generals are always fighting the last war, right now, the politicians and their military advisors are mostly caught up in entirely fictional theater based on a geopolitical structure that has very little relation to either the current reality or the global wars of the future.",
  "tags": [
    "Clash of Civilizations",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-16T13:00:00+00:00"
}