{
  "url": "https://voxday.net/2015/02/12/guns-are-not-motive-force/",
  "scraped_at": "2025-12-16T12:45:07.118399",
  "title": "Guns are not a motive force",
  "date_display": "February 12, 2015",
  "date_iso": "2015-02-12T20:56:00+00:00",
  "date_from_url": "2015-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has always been obvious that guns don’t cause suicide; the USA has never had the highest rate of suicide in the world. But now that the UK has effectively banned most gun ownership, it is becoming harder and harder to claim that there is any relationship between gun ownership rates and suicide rates. Dr. Helen <a href=\"http://pjmedia.com/drhelen/2015/02/12/interesting-data-on-male-suicide/\">draws attention to the statistical reality</a>:</p><blockquote class=\"tr_bq\"><p> The article is about the high suicide rate in the UK and states: “Suicides of men aged 45-59 have risen by 40% in a decade, and account for a quarter of all suicides in the UK.” There is a graph pointing out that a majority of men (and a number of women) in the UK die by suffocation or hanging: 58% of male suicides and 36% of female suicides use this method. We always hear that it is the proliferation of guns that causes much of the male suicide in the US but if the guns are the problem, why is there also a high incidence of male suicide in the UK?</p></blockquote><p>Perhaps the UK should consider also banning ropes and plastic bags. After all, if it saves just one life, it will be worth it. The reality is that no automotive society should attempt to restrict any popular means of committing suicide; there are already far more auto suicides than most people realize.</p></div>",
  "content_text": "It has always been obvious that guns don’t cause suicide; the USA has never had the highest rate of suicide in the world. But now that the UK has effectively banned most gun ownership, it is becoming harder and harder to claim that there is any relationship between gun ownership rates and suicide rates. Dr. Helen\ndraws attention to the statistical reality\n:\nThe article is about the high suicide rate in the UK and states: “Suicides of men aged 45-59 have risen by 40% in a decade, and account for a quarter of all suicides in the UK.” There is a graph pointing out that a majority of men (and a number of women) in the UK die by suffocation or hanging: 58% of male suicides and 36% of female suicides use this method. We always hear that it is the proliferation of guns that causes much of the male suicide in the US but if the guns are the problem, why is there also a high incidence of male suicide in the UK?\nPerhaps the UK should consider also banning ropes and plastic bags. After all, if it saves just one life, it will be worth it. The reality is that no automotive society should attempt to restrict any popular means of committing suicide; there are already far more auto suicides than most people realize.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-12T20:56:00+00:00"
}