{
  "url": "https://voxday.net/2015/02/09/hyperspace-demons/",
  "scraped_at": "2025-12-16T12:44:41.446585",
  "title": "Hyperspace Demons",
  "date_display": "February 9, 2015",
  "date_iso": "2015-02-09T09:28:00+00:00",
  "date_from_url": "2015-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.castaliahouse.com/downloads/hyperspace-demons/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.castaliahouse.com/wp-content/uploads/2015/02/HD256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.castaliahouse.com/wp-content/uploads/2015/02/HD256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><a href=\"http://www.castaliahouse.com/downloads/hyperspace-demons/\"><b><i>In space, the demons can hear you scream.</i></b></a><br> <i><br>Space travel has always come with risks. But hyperspace travel comes with one particularly frightening hazard, namely, the non-corporeal dark energy-based macrobiotic entities that inhabit the void and are insensibly drawn to the presence of human minds. Once penetrated by a macrobe, the infected human mind rapidly devolves into raving insanity, which usually presents in a homicidal manner. Fortunately, hyperspace-capable ships are protected by a dark energy resonator that keeps the macrobes away and thereby permits safe interstellar travel.</br></i></br></p><p>But what happens when a ship’s resonator is sabotaged while it is traveling through hyperspace? And who would be so insane as to unleash a demonic infection of mutating madness on an entire ship’s crew?</p><p><a href=\"http://www.castaliahouse.com/downloads/hyperspace-demons/\"><b><i>Hyperspace Demons</i></b></a> is a novella by Jonathan Moeller, one of the most prolific self-published authors of science fiction and fantasy today. Featuring a cover by JartStar, <i>Hyperspace Demons</i> is his first publication with Castalia House. And in respect of Anonymous Conservative’s newly announced free days (about which more after the jump), we’re extending the New Release newsletter offer for two more days, which means that if you buy <a href=\"http://www.castaliahouse.com/downloads/hyperspace-demons/\"><b><i>Hyperspace Demons</i></b></a> from Castalia House today or tomorrow, you will also receive a free copy of Jonathan’s <i>Frostborn: The Gray Knight. </i>If you would like to sign up for the New Release newsletter to take advantage of similar offers in the future, <a href=\"http://www.castaliahouse.com/subscribe-to-our-newsletter/\">you can do so here</a>.</p><p>I’m also looking for ten volunteers to review <i>Hyperspace Demons</i>. If you’re interested, please email me with HYPER in the subject and specify MOBI or EPUB.</p><p><a name=\"more\"></a>Now about those free books. Anonymous Conservative writes:<br/></p><blockquote class=\"tr_bq\"><p> For those interested, <i><a href=\"http://www.castaliahouse.com/downloads/the-evolutionary-psychology-behind-politics/\">The Evolutionary Psychology Behind Politics</a></i>,<br> <a href=\"http://www.castaliahouse.com/downloads/how-to-deal-with-narcissists/\"><i>How to Deal with Narcissists</i></a>, and <i>The Altar of Hate</i> by Vox Day will all<br> be free in ebook form at Castalia House on Monday and Tuesday.<i> </i><i> </i><i><a href=\"http://www.castaliahouse.com/downloads/the-altar-of-hate/\" title=\"The Altar of Hate\">The Altar of Hate</a></i> is a compilation of ten great stories ranging from fantasy to military fcience fiction. As one reviewer wrote, “<i>Each<br> offering contained in The Altar of Hate tickles or provokes the mind<br> with salacious ‘what ifs’ and glances behind the veil of reality. The<br> stories move along, but one feels the uneasy eyes of the abyss staring<br> back as you progress, as it were, through a darkened ancient forest.<br> Only an author of the first rank could achieve this.</br></br></br></br></br></i>” While I don’t have that big of a readership compared to Vox, I’m<br> hoping those here who haven’t yet stopped by Castalia’s website and<br> partaken of their incredible titles will maybe find a great new source<br> for all their high quality<br> sci-fi/fantasy/military-theory/educational/non-fiction needs, and in so<br> doing help establish our foothold on this great new beachhead in the<br> publishing world. If we can get Castalia to the point it is the new<br> Simon and Schuster, we will have helped alter the very terrain on which<br> our future battles will be fought. It is an exciting time in Conservatism. The theories beneath<br> political science are shifting, the cultural tides in publishing are<br> changing, and maybe the very natures of our citizens are becoming more<br> K-selected. It feels like we are approaching a turning point rapidly,<br> and just at the right time. Until the turning point comes, take some free books, then tell your<br> friends about r/K, and rave to your friends about how awesome Castalia House is. We are making a difference with every person we tell.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>In other words, if you buy <i>Hyperspace Demons</i> today, you can pick up as many as four free books for $2.99. Not a bad deal. And speaking of “how awesome Castalia House is”, if you have any interest in fantasy and science fiction and haven’t already bookmarked the Castalia House blog, you are really missing out on some excellent and intelligent content. One of our newest bloggers, Morgan, is rapidly demonstrating that he’s capable of hanging with Jeffro, Daniel, and Scooter with his detailed anthology reviews; you’ll want to read <a href=\"http://www.castaliahouse.com/the-sword-sorcery-anthology/\">his post on <i>The Sword &amp; Sorcery Anthology</i></a>, with an introduction by David Drake, complete with a comment by David Drake himself:</p><blockquote class=\"tr_bq\"><p> A couple of years back, if you searched for Tachyon Publications’ The Secret History of Fantasy on Google Books, this is what would come up:</p><p>“Tired of the same old fantasy? Here are nineteen much-needed antidotes to cliched tales of swords and sorcery. Fantasy is back, and it’s better than ever!”</p><p>The lure of filthy lucre must have proven to be too much as Tachyon published The Sword &amp; Sorcery Anthology in 2012…. The 1970s entries are dependable. Karl Edward Wagner’s “Undertow” is<br> one of the most memorable Kane stories. The Ramsey Campbell story has<br> never been reprinted to my knowledge.</br></br></p><p>Some of the seven post 1980 stories get dodgy. There was sword and sorcery in the 1980s in <i>Fantasy Book</i> and <i>Space &amp; Time</i>. The 1990s were lean and grim but still you had <i>Shadow Sword</i> and <i>Adventures in Sword and Sorcery</i>. The editors did no deep excavation.</p><p>I never thought of Jane Yolen as a sword and sorcery writer. I used to read her stories in <i>The Magazine of Fantasy &amp; Science Fiction</i><br> decades back and liked them. Her story is good if not a bit clichéd.<br> Does anyone find it disturbing there was an anthology entitled <i>Warrior Princesses</i>? That is where “Become a Warrior” originally appeared.</br></br></p><p>Two stories are from Marion Zimmer Bradley’s <i>Sword and Sorceress</i><br> anthologies. My view is Bradley’s anthology series quickly created a<br> new category that can be called femizon fantasy that is distinct from<br> sword and sorcery. The Charles Saunders story was a highlight of the<br> original <i>Sword and Sorceress</i> and the highlight of the chronological later stories. Why was Rachel Pollack’s “The Red Guild” included (<i>Sword and Sorceress #2</i>)? You can stamp generic femizon story on this one.</br></br></br></br></p></blockquote></div>",
  "content_text": "In space, the demons can hear you scream.\nSpace travel has always come with risks. But hyperspace travel comes with one particularly frightening hazard, namely, the non-corporeal dark energy-based macrobiotic entities that inhabit the void and are insensibly drawn to the presence of human minds. Once penetrated by a macrobe, the infected human mind rapidly devolves into raving insanity, which usually presents in a homicidal manner. Fortunately, hyperspace-capable ships are protected by a dark energy resonator that keeps the macrobes away and thereby permits safe interstellar travel.\nBut what happens when a ship’s resonator is sabotaged while it is traveling through hyperspace? And who would be so insane as to unleash a demonic infection of mutating madness on an entire ship’s crew?\nHyperspace Demons\nis a novella by Jonathan Moeller, one of the most prolific self-published authors of science fiction and fantasy today. Featuring a cover by JartStar,\nHyperspace Demons\nis his first publication with Castalia House. And in respect of Anonymous Conservative’s newly announced free days (about which more after the jump), we’re extending the New Release newsletter offer for two more days, which means that if you buy\nHyperspace Demons\nfrom Castalia House today or tomorrow, you will also receive a free copy of Jonathan’s\nFrostborn: The Gray Knight.\nIf you would like to sign up for the New Release newsletter to take advantage of similar offers in the future,\nyou can do so here\n.\nI’m also looking for ten volunteers to review\nHyperspace Demons\n. If you’re interested, please email me with HYPER in the subject and specify MOBI or EPUB.\nNow about those free books. Anonymous Conservative writes:\nFor those interested,\nThe Evolutionary Psychology Behind Politics\n,\nHow to Deal with Narcissists\n, and\nThe Altar of Hate\nby Vox Day will all\nbe free in ebook form at Castalia House on Monday and Tuesday.\nThe Altar of Hate\nis a compilation of ten great stories ranging from fantasy to military fcience fiction. As one reviewer wrote, “\nEach\noffering contained in The Altar of Hate tickles or provokes the mind\nwith salacious ‘what ifs’ and glances behind the veil of reality. The\nstories move along, but one feels the uneasy eyes of the abyss staring\nback as you progress, as it were, through a darkened ancient forest.\nOnly an author of the first rank could achieve this.\n” While I don’t have that big of a readership compared to Vox, I’m\nhoping those here who haven’t yet stopped by Castalia’s website and\npartaken of their incredible titles will maybe find a great new source\nfor all their high quality\nsci-fi/fantasy/military-theory/educational/non-fiction needs, and in so\ndoing help establish our foothold on this great new beachhead in the\npublishing world. If we can get Castalia to the point it is the new\nSimon and Schuster, we will have helped alter the very terrain on which\nour future battles will be fought. It is an exciting time in Conservatism. The theories beneath\npolitical science are shifting, the cultural tides in publishing are\nchanging, and maybe the very natures of our citizens are becoming more\nK-selected. It feels like we are approaching a turning point rapidly,\nand just at the right time. Until the turning point comes, take some free books, then tell your\nfriends about r/K, and rave to your friends about how awesome Castalia House is. We are making a difference with every person we tell.\nIn other words, if you buy\nHyperspace Demons\ntoday, you can pick up as many as four free books for $2.99. Not a bad deal. And speaking of “how awesome Castalia House is”, if you have any interest in fantasy and science fiction and haven’t already bookmarked the Castalia House blog, you are really missing out on some excellent and intelligent content. One of our newest bloggers, Morgan, is rapidly demonstrating that he’s capable of hanging with Jeffro, Daniel, and Scooter with his detailed anthology reviews; you’ll want to read\nhis post on\nThe Sword & Sorcery Anthology\n, with an introduction by David Drake, complete with a comment by David Drake himself:\nA couple of years back, if you searched for Tachyon Publications’ The Secret History of Fantasy on Google Books, this is what would come up:\n“Tired of the same old fantasy? Here are nineteen much-needed antidotes to cliched tales of swords and sorcery. Fantasy is back, and it’s better than ever!”\nThe lure of filthy lucre must have proven to be too much as Tachyon published The Sword & Sorcery Anthology in 2012…. The 1970s entries are dependable. Karl Edward Wagner’s “Undertow” is\none of the most memorable Kane stories. The Ramsey Campbell story has\nnever been reprinted to my knowledge.\nSome of the seven post 1980 stories get dodgy. There was sword and sorcery in the 1980s in\nFantasy Book\nand\nSpace & Time\n. The 1990s were lean and grim but still you had\nShadow Sword\nand\nAdventures in Sword and Sorcery\n. The editors did no deep excavation.\nI never thought of Jane Yolen as a sword and sorcery writer. I used to read her stories in\nThe Magazine of Fantasy & Science Fiction\ndecades back and liked them. Her story is good if not a bit clichéd.\nDoes anyone find it disturbing there was an anthology entitled\nWarrior Princesses\n? That is where “Become a Warrior” originally appeared.\nTwo stories are from Marion Zimmer Bradley’s\nSword and Sorceress\nanthologies. My view is Bradley’s anthology series quickly created a\nnew category that can be called femizon fantasy that is distinct from\nsword and sorcery. The Charles Saunders story was a highlight of the\noriginal\nSword and Sorceress\nand the highlight of the chronological later stories. Why was Rachel Pollack’s “The Red Guild” included (\nSword and Sorceress #2\n)? You can stamp generic femizon story on this one.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-09T09:28:00+00:00"
}