{
  "url": "https://voxday.net/2015/02/07/immigration-against-plague/",
  "scraped_at": "2025-12-16T12:44:31.144564",
  "title": "Immigration saving America",
  "date_display": "February 7, 2015",
  "date_iso": "2015-02-07T09:09:00+00:00",
  "date_from_url": "2015-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Among the many blessings of open borders and diversity is the remarkable way immigrants are <a href=\"http://dailycaller.com/2015/02/06/report-immigration-increases-genital-mutilation-among-american-girls/\">curbing the temptation</a> for their daughters to behave like Western whores:</p><blockquote class=\"tr_bq\"><p> More girls in America are having their genitalia mutilated as immigration increases the vibrant diversity of U.S. neighborhoods, says a new report by a D.C.-based nonprofit.</p><p>In 2013, “there were up to 507,000 U.S. women and girls who had undergone [genital mutilation] or were at risk of the procedure… the rapid increase in women and girls at risk reflects an increase in immigration to the United States,” said the Friday report by the Population Reference Bureau.</p><p>“We’re seeing a lot more F.G.M.,” Dr. Gretchen Heinrichs, a gynecologist, told The New York Times. FGM stands for female genital mutilation….. Between 2000 and 2013, the African immigrant population in the United States more than doubled, from 881,000 to 1.8 million, said the new report.</p></blockquote><p>Immigrants will play a vital role in ending the threat posed by slutwalks, college campuses, and the television show <i>Girls</i>. Among the other manifold blessings of vibrant diversity include curative rape for lesbianism and skilled spellcasters who can magically bring back a straying man to you. Unfortunately, practitioners have determined that contra expectations, chopping off the body parts of white people do not work for <i>mutu </i>purposes in the same manner as albinos.</p><p>So the next time some bigoted anti-immigrationist makes a crack about jobs or ethnic food, remind him that immigrants may turn out to be the key to ending the rampant plague of rampaging sluts in America.</p></div>",
  "content_text": "Among the many blessings of open borders and diversity is the remarkable way immigrants are\ncurbing the temptation\nfor their daughters to behave like Western whores:\nMore girls in America are having their genitalia mutilated as immigration increases the vibrant diversity of U.S. neighborhoods, says a new report by a D.C.-based nonprofit.\nIn 2013, “there were up to 507,000 U.S. women and girls who had undergone [genital mutilation] or were at risk of the procedure… the rapid increase in women and girls at risk reflects an increase in immigration to the United States,” said the Friday report by the Population Reference Bureau.\n“We’re seeing a lot more F.G.M.,” Dr. Gretchen Heinrichs, a gynecologist, told The New York Times. FGM stands for female genital mutilation….. Between 2000 and 2013, the African immigrant population in the United States more than doubled, from 881,000 to 1.8 million, said the new report.\nImmigrants will play a vital role in ending the threat posed by slutwalks, college campuses, and the television show\nGirls\n. Among the other manifold blessings of vibrant diversity include curative rape for lesbianism and skilled spellcasters who can magically bring back a straying man to you. Unfortunately, practitioners have determined that contra expectations, chopping off the body parts of white people do not work for\nmutu\npurposes in the same manner as albinos.\nSo the next time some bigoted anti-immigrationist makes a crack about jobs or ethnic food, remind him that immigrants may turn out to be the key to ending the rampant plague of rampaging sluts in America.",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-07T09:09:00+00:00"
}