{
  "url": "https://voxday.net/2015/02/08/in-support-of-puppies/",
  "scraped_at": "2025-12-16T12:44:36.631629",
  "title": "In support of Puppies",
  "date_display": "February 8, 2015",
  "date_iso": "2015-02-08T11:19:00+00:00",
  "date_from_url": "2015-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amal El-Mohtar bravely <a href=\"http://amalelmohtar.com/2014/01/09/of-awards-eligibility-lists-and-unbearable-smugness/\">supports Rabid Puppies and Sad Puppies 3</a>:</p><blockquote class=\"tr_bq\"><p> We need to have a serious talk about awards and eligibility and the<br> awkward eggshell-dance people feel obligated to do every time this year.</br></p><p>Recently I went on a tear on Twitter because I saw women for whom I have tremendous admiration and respect<br> speak up about how difficult they find it to overcome shyness and low<br> self-esteem enough to talk about their work, and what an ongoing<br> struggle it is for them to find value in their art, to think of it as in<br> any way contributing anything to the world.<br/></br></br></br></br></p><blockquote class=\"twitter-tweet\" lang=\"en\"><p> <i>Women agonizing over<br> whether or not to post your award-eligible work? You don’t need this<br> but: I give you permission. I want your lists.</br></br></i><br> <i>— Amal El-Mohtar (@tithenai)</i></br></p></blockquote><p>There’s a peculiar, unbearable, vicious smugness in sitting back and<br> talking about how tacky it is of people to list their publications and<br> that of course YOU won’t do so because while winning awards is nice<br> naturally YOU don’t really care about them. I find that behaviour<br> several orders of magnitude more repellent than asking for votes.<br> Requests for votes I can ignore; what I can’t ignore is the real toll<br> taken on brilliantly talented people by this kind of rhetoric —<br> brilliantly talented people who already think themselves unworthy of any<br> kind of positive attention.</br></br></br></br></br></br></br></br></p><p>Can we please just accept — and make widespread the acceptance! —<br> that making lists during Awards season is fine? That it’s standard?</br></p></blockquote><p>There you have it. Making lists is fine. It is standard. People like Amal expressly <i>want </i>our lists. So what on Earth can the pinkshirts possibly be complaining about? Is it, perhaps, the fact that <a href=\"http://www.milobookclub.com/2015/02/02/rabid-puppies-2015/\">our lists</a> are not the same as <a href=\"http://www.jasonsanford.com/blog/2015/2/my-hugo-and-nebula-award-nominations\">their lists</a>?</p><p> I have tremendous admiration and respect<br> for Larry Correia and Brad Torgersen, especially in light of how they have courageously overcome shyness and low<br> self-esteem enough to talk about their work.</br></br></p></div>",
  "content_text": "Amal El-Mohtar bravely\nsupports Rabid Puppies and Sad Puppies 3\n:\nWe need to have a serious talk about awards and eligibility and the\nawkward eggshell-dance people feel obligated to do every time this year.\nRecently I went on a tear on Twitter because I saw women for whom I have tremendous admiration and respect\nspeak up about how difficult they find it to overcome shyness and low\nself-esteem enough to talk about their work, and what an ongoing\nstruggle it is for them to find value in their art, to think of it as in\nany way contributing anything to the world.\nWomen agonizing over\nwhether or not to post your award-eligible work? You don’t need this\nbut: I give you permission. I want your lists.\n— Amal El-Mohtar (@tithenai)\nThere’s a peculiar, unbearable, vicious smugness in sitting back and\ntalking about how tacky it is of people to list their publications and\nthat of course YOU won’t do so because while winning awards is nice\nnaturally YOU don’t really care about them. I find that behaviour\nseveral orders of magnitude more repellent than asking for votes.\nRequests for votes I can ignore; what I can’t ignore is the real toll\ntaken on brilliantly talented people by this kind of rhetoric —\nbrilliantly talented people who already think themselves unworthy of any\nkind of positive attention.\nCan we please just accept — and make widespread the acceptance! —\nthat making lists during Awards season is fine? That it’s standard?\nThere you have it. Making lists is fine. It is standard. People like Amal expressly\nwant\nour lists. So what on Earth can the pinkshirts possibly be complaining about? Is it, perhaps, the fact that\nour lists\nare not the same as\ntheir lists\n?\nI have tremendous admiration and respect\nfor Larry Correia and Brad Torgersen, especially in light of how they have courageously overcome shyness and low\nself-esteem enough to talk about their work.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-08T11:19:00+00:00"
}