{
  "url": "https://voxday.net/2015/02/11/mailvox-controlling-christian/",
  "scraped_at": "2025-12-16T12:44:55.023572",
  "title": "Mailvox: the anti-Puritans",
  "date_display": "February 11, 2015",
  "date_iso": "2015-02-11T11:01:00+00:00",
  "date_from_url": "2015-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SJ emails and makes what I consider to be <a href=\"http://www.milobookclub.com/2015/02/10/mailvox-christian-book-ratings/\">an all-too-common mistake</a> among Christians with regards to the rating system I created upon request yesterday:</p><blockquote class=\"tr_bq\"><p> Read your post on a Christian Ratings System. As the father of two young boys, there is a lot I like about this. And I laugh at how similar my experiences are with other Christian fathers. But I think it is important to think through one aspect of this sort of effort: Christians have self-selected towards being at the bottom of the food chain, often the victims, in our modern society.</p><p>That isn’t necessarily meant as a defense of modern society, other than being a reminder of the reality we live in. Regardless, I am sick and tired of Christians coming up on the short end, and I am concerned that the lesson that our churches and families are teaching our young men. With my own boys, I have taken the tack of raising Christian men in a Fallen and potentially violent world. I see no disparity between Christianity, being strong, and being realistic. In, not of.</p><p>Thus, I don’t necessarily argue with the idea of scores per se, but of the thresholds. For example, I am not sure that I wouldn’t let my boys read something more than a 15, and I balk at saying that a book that contains openly atheist characters scores a +3. What about the atheist characters being contrasted with Christian characters? What about setting up an atheist for a religious awakening?</p><p>My point is really not to pick nits, or to argue line items, but to try to argue for:</p><p>a) a more granular system that allows for more insight into the “Christians” of the book<br> b) in support of (a) but more tangentially, possibly having categories of scores<br> c) somehow trying to allow for books and material that encourages a realistic approach to Christianity</br></br></p><p>It’s really this latter point that makes me write this email because by making such a scoring system seems likely to help the self-same self-selecting Christians to self-select into ever more naive, victim-filled categories. I think this is especially true if the system is more or less linear and additive, as you have suggested. Ultimately, you are on to a great idea here, but it shouldn’t abide by the standards and metrics that a Fallen world has seen fit to place on Christianity. For example, some Christians swear, dammit, and the Song of Solomon is ostensibly about Sex. Perhaps with a little more granularity and possibly with some helpful Categories, this becomes a tool to teach rather than a grading system for my 4th grade Sunday School teacher.</p></blockquote><p>I think we may need a word to describe the modern Christian anti-Puritan, the sort of Christian who fears that somewhere, somehow, there might be another Christian out there who is insufficiently exposed to the world. But is there truly a Christian in the world of 2015 who is <i>insufficiently exposed</i> to the material existence of godlessness, obscenity, sex, and sin? And what shall we call these advocates of being sufficiently engulfed by the world, though not of it? Soilitans? Filthians? Those Who Wallow? Edified Mudrollers?</p><p>My more literate response is to quote Aslan: <i>“Child…I am telling your story, not hers. I tell no one any story but his own.”</i></p><p>It is no more SJ’s business to concern himself with how these self-selecting Christians self-select into ever more naive, victim-filled categories than it is for them to determine the precise threshold that will determine what books his young boys are permitted to read. And notice that all of his concerns are about influence and interpretation; he is bothered by the idea of simply permitting other Christians to acquire accurate information about the books and make their own judgments concerning them. In answer to his questions and points:</p><ol><li>What about the atheist characters being contrasted with Christian characters?</li><li>What about setting up an atheist for a religious awakening?</li><li>a more granular system that allows for more insight into the “Christians” of the book</li><li>in support of (3) but more tangentially, possibly having categories of scores</li><li>somehow trying to allow for books and material that encourages a realistic approach to Christianity </li></ol><p>1. What about them? Whether they are contrasted with Christian characters or not, the either exist in the book or they don’t. Why should parents who don’t want their children to be prematurely exposed to atheism be intentionally kept in the dark from knowing that there is a godless character in a book?</p><p>2. What about it? I’d rather like a system that would warn me: LAME AND UTTERLY CONVENTIONAL CONVERSION STORY AHEAD so I could avoid ever reading the book. “And then he became a Christian and lived happily ever after” is not the sort of thing I’m interested in supporting even if that was within the scope of the rating system. Which it isn’t. Regardless of what happens to the atheist over the course of the book, he is still there. How can any Christian rationally oppose parents simply being informed of godlessness in their children’s books?</p><p>I am perhaps uniquely qualified to comment on this. Does anyone seriously think I am even remotely afraid of exposing my children to atheist arguments, let alone fictional atheist characters presenting dumbed-down versions of those arguments? I throw Plato and Cicero and William S. Lind at my kids, does anyone seriously doubt that they can chew up arguments presented by the likes of Sam Harris and Richard Dawkins without even blinking? At the same time, I’d still like to know that they are being tested in this way when it is taking place.</p><p>3. No. That goes well beyond the purpose of the rating system, which is to simply inform parents what is in the book. It doesn’t involve insight into anyone, for any reason. It describes, it doesn’t interpret.</p><p>4. The more complicated the system, the less useful it is and the less anyone will use it. Again, this is an attempt to sneak interpretation and influence in through the back door.</p><p>5. And who is to define “a realistic approach to Christianity”? I doubt anyone wants me doing that. Here the attempt to influence is overt, which is in absolute contradiction to the intention of the ratings system, which is simply to inform parents of what specific elements are present within works of fiction.</p><p>The rating system is a tool for people to use, not a tool for using people. Try to keep that in mind if you’re looking to improve it.</p></div>",
  "content_text": "SJ emails and makes what I consider to be\nan all-too-common mistake\namong Christians with regards to the rating system I created upon request yesterday:\nRead your post on a Christian Ratings System. As the father of two young boys, there is a lot I like about this. And I laugh at how similar my experiences are with other Christian fathers. But I think it is important to think through one aspect of this sort of effort: Christians have self-selected towards being at the bottom of the food chain, often the victims, in our modern society.\nThat isn’t necessarily meant as a defense of modern society, other than being a reminder of the reality we live in. Regardless, I am sick and tired of Christians coming up on the short end, and I am concerned that the lesson that our churches and families are teaching our young men. With my own boys, I have taken the tack of raising Christian men in a Fallen and potentially violent world. I see no disparity between Christianity, being strong, and being realistic. In, not of.\nThus, I don’t necessarily argue with the idea of scores per se, but of the thresholds. For example, I am not sure that I wouldn’t let my boys read something more than a 15, and I balk at saying that a book that contains openly atheist characters scores a +3. What about the atheist characters being contrasted with Christian characters? What about setting up an atheist for a religious awakening?\nMy point is really not to pick nits, or to argue line items, but to try to argue for:\na) a more granular system that allows for more insight into the “Christians” of the book\nb) in support of (a) but more tangentially, possibly having categories of scores\nc) somehow trying to allow for books and material that encourages a realistic approach to Christianity\nIt’s really this latter point that makes me write this email because by making such a scoring system seems likely to help the self-same self-selecting Christians to self-select into ever more naive, victim-filled categories. I think this is especially true if the system is more or less linear and additive, as you have suggested. Ultimately, you are on to a great idea here, but it shouldn’t abide by the standards and metrics that a Fallen world has seen fit to place on Christianity. For example, some Christians swear, dammit, and the Song of Solomon is ostensibly about Sex. Perhaps with a little more granularity and possibly with some helpful Categories, this becomes a tool to teach rather than a grading system for my 4th grade Sunday School teacher.\nI think we may need a word to describe the modern Christian anti-Puritan, the sort of Christian who fears that somewhere, somehow, there might be another Christian out there who is insufficiently exposed to the world. But is there truly a Christian in the world of 2015 who is\ninsufficiently exposed\nto the material existence of godlessness, obscenity, sex, and sin? And what shall we call these advocates of being sufficiently engulfed by the world, though not of it? Soilitans? Filthians? Those Who Wallow? Edified Mudrollers?\nMy more literate response is to quote Aslan:\n“Child…I am telling your story, not hers. I tell no one any story but his own.”\nIt is no more SJ’s business to concern himself with how these self-selecting Christians self-select into ever more naive, victim-filled categories than it is for them to determine the precise threshold that will determine what books his young boys are permitted to read. And notice that all of his concerns are about influence and interpretation; he is bothered by the idea of simply permitting other Christians to acquire accurate information about the books and make their own judgments concerning them. In answer to his questions and points:\nWhat about the atheist characters being contrasted with Christian characters?\nWhat about setting up an atheist for a religious awakening?\na more granular system that allows for more insight into the “Christians” of the book\nin support of (3) but more tangentially, possibly having categories of scores\nsomehow trying to allow for books and material that encourages a realistic approach to Christianity\n1. What about them? Whether they are contrasted with Christian characters or not, the either exist in the book or they don’t. Why should parents who don’t want their children to be prematurely exposed to atheism be intentionally kept in the dark from knowing that there is a godless character in a book?\n2. What about it? I’d rather like a system that would warn me: LAME AND UTTERLY CONVENTIONAL CONVERSION STORY AHEAD so I could avoid ever reading the book. “And then he became a Christian and lived happily ever after” is not the sort of thing I’m interested in supporting even if that was within the scope of the rating system. Which it isn’t. Regardless of what happens to the atheist over the course of the book, he is still there. How can any Christian rationally oppose parents simply being informed of godlessness in their children’s books?\nI am perhaps uniquely qualified to comment on this. Does anyone seriously think I am even remotely afraid of exposing my children to atheist arguments, let alone fictional atheist characters presenting dumbed-down versions of those arguments? I throw Plato and Cicero and William S. Lind at my kids, does anyone seriously doubt that they can chew up arguments presented by the likes of Sam Harris and Richard Dawkins without even blinking? At the same time, I’d still like to know that they are being tested in this way when it is taking place.\n3. No. That goes well beyond the purpose of the rating system, which is to simply inform parents what is in the book. It doesn’t involve insight into anyone, for any reason. It describes, it doesn’t interpret.\n4. The more complicated the system, the less useful it is and the less anyone will use it. Again, this is an attempt to sneak interpretation and influence in through the back door.\n5. And who is to define “a realistic approach to Christianity”? I doubt anyone wants me doing that. Here the attempt to influence is overt, which is in absolute contradiction to the intention of the ratings system, which is simply to inform parents of what specific elements are present within works of fiction.\nThe rating system is a tool for people to use, not a tool for using people. Try to keep that in mind if you’re looking to improve it.",
  "tags": [
    "books",
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-11T11:01:00+00:00"
}