{
  "url": "https://voxday.net/2015/02/03/mailvox-atheist-theology-or-ignorance/",
  "scraped_at": "2025-12-16T12:44:08.727199",
  "title": "Mailvox: atheist theology or the ignorance therein",
  "date_display": "February 3, 2015",
  "date_iso": "2015-02-03T17:01:00+00:00",
  "date_from_url": "2015-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The self-aware  Trimegistus seems to share my incredulity:</p><blockquote class=\"tr_bq\"><p> I ‘m an unbeliever (I stopped using the term “atheist” when it became a<br> synonym for “self-righteous asshole”) and the staggering ignorance of<br> other unbelievers always shocks me. I know I’m not an expert on<br> theology; I know history, I’ve read Lewis and Sayers and St. Augustine<br> but that’s about it — and yet I’m like the frickin’ Vatican Curia<br> compared to the general run of atheists.</br></br></br></br></br></p></blockquote><p>One thing I’ve noticed about many atheists of the general run variety is that they cannot follow simple if/then statements. Consider these facepalm-inspiring tweets inspired by this morning’s post:</p><blockquote class=\"tr_bq\"><p> Milo Yiannopoulos ‏@Nero<br>Perhaps the neatest skewering of @stephenfry ever, from @voxday</br></p><p>#OttawaStrong ‏@Canadastani<br>Summary: God is real because the bible says god is real! LALALALLALAKALALALALALALALA I CAN’T HEAR YOU!!! #bacon</br></p><p>Vox Day ‏@voxday<br>Your summary is false. I merely pointed out the God-concept he is attacking is not the Christian God.</br></p><p>Dan Sereduick ‏@Globalizer360<br>Your summary of the Christian god is one that exists in advanced theology, not in ordinary religion.</br></p><p>Vox Day ‏@voxday<br>The Chronicles of Narnia and The Lord of the Rings are NOT advanced Christian theology.</br></p><p>#OttawaStrong ‏@Canadastani<br>Your imagination is not a real place either, but that doesn’t stop your imaginary friend Yahweh.</br></p><p>Vox Day ‏@voxday now<br>Look, you can’t criticize fiction for things that are not there. Sauron is not in Narnia.</br></p></blockquote><p>It’s not that hard. My critique of Fry holds whether God exists or not. Christian theology is very well-defined. It is explained on multiple levels, from Tertullian and Thomas Aquinas all the way down to children’s novels like the Chronicles of Narnia. And yet, Stephen Fry quite clearly doesn’t know ANY of it.</p><p>You don’t have to believe in something to know what it is. I don’t believe in the Labor Theory of Value, but I can explain it to you. I don’t believe in Keynesian Economics, but I can explain multiple variants of it to you. I am skeptical of the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow, but I can explain how it is supposed to work.</p><p>The Cross and the Resurrection of Jesus Christ are the core of the Christian faith. And that core is absolutely and utterly predicated on the EVIL OF A FALLEN WORLD. So for Fry to claim that the observable existence of evil somehow condemns the Creator God requires either a) perverted quasi-Calvinism or b) stupendous ignorance.</p></div>",
  "content_text": "The self-aware  Trimegistus seems to share my incredulity:\nI ‘m an unbeliever (I stopped using the term “atheist” when it became a\nsynonym for “self-righteous asshole”) and the staggering ignorance of\nother unbelievers always shocks me. I know I’m not an expert on\ntheology; I know history, I’ve read Lewis and Sayers and St. Augustine\nbut that’s about it — and yet I’m like the frickin’ Vatican Curia\ncompared to the general run of atheists.\nOne thing I’ve noticed about many atheists of the general run variety is that they cannot follow simple if/then statements. Consider these facepalm-inspiring tweets inspired by this morning’s post:\nMilo Yiannopoulos ‏@Nero\nPerhaps the neatest skewering of @stephenfry ever, from @voxday\n#OttawaStrong ‏@Canadastani\nSummary: God is real because the bible says god is real! LALALALLALAKALALALALALALALA I CAN’T HEAR YOU!!! #bacon\nVox Day ‏@voxday\nYour summary is false. I merely pointed out the God-concept he is attacking is not the Christian God.\nDan Sereduick ‏@Globalizer360\nYour summary of the Christian god is one that exists in advanced theology, not in ordinary religion.\nVox Day ‏@voxday\nThe Chronicles of Narnia and The Lord of the Rings are NOT advanced Christian theology.\n#OttawaStrong ‏@Canadastani\nYour imagination is not a real place either, but that doesn’t stop your imaginary friend Yahweh.\nVox Day ‏@voxday now\nLook, you can’t criticize fiction for things that are not there. Sauron is not in Narnia.\nIt’s not that hard. My critique of Fry holds whether God exists or not. Christian theology is very well-defined. It is explained on multiple levels, from Tertullian and Thomas Aquinas all the way down to children’s novels like the Chronicles of Narnia. And yet, Stephen Fry quite clearly doesn’t know ANY of it.\nYou don’t have to believe in something to know what it is. I don’t believe in the Labor Theory of Value, but I can explain it to you. I don’t believe in Keynesian Economics, but I can explain multiple variants of it to you. I am skeptical of the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow, but I can explain how it is supposed to work.\nThe Cross and the Resurrection of Jesus Christ are the core of the Christian faith. And that core is absolutely and utterly predicated on the EVIL OF A FALLEN WORLD. So for Fry to claim that the observable existence of evil somehow condemns the Creator God requires either a) perverted quasi-Calvinism or b) stupendous ignorance.",
  "tags": [
    "atheism",
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-03T17:01:00+00:00"
}