{
  "url": "https://voxday.net/2015/02/13/men-in-women-suits/",
  "scraped_at": "2025-12-16T12:45:08.968303",
  "title": "Men in women suits",
  "date_display": "February 13, 2015",
  "date_iso": "2015-02-13T10:59:00+00:00",
  "date_from_url": "2015-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Silvia Moreno-Garcia says <a href=\"http://www.locusmag.com/Roundtable/2015/02/silvia-moreno-garcia-guest-post-say-no-to-strong-female-characters/\">no to strong female characters</a>:</p><blockquote class=\"tr_bq\"><p> I was not a fan of The Book of Life. I will not elaborate too much on this point except to mention that when I watched it I recalled a bit from <a href=\"http://www.newstatesman.com/culture/2013/08/i-hate-strong-female-characters\">an article by Sophia McDougall</a> published in The New Statesman:</p><p><i>I remember watching Shrek with my mother.</i></p><p>“The Princess knew kung-fu! That was nice,” I said. And yet I had a vague sense of unease, a sense that I was saying it because it was what I was supposed to say.</p><p>She rolled her eyes. “All the princesses know kung-fu now.”</p><p>I thought the same thing about the heroine of The Book of Life. She knows kung-fu and she spews the kind of “feisty” attitude we must associate with heroines and she is therefore strong and everything is kosher.</p><p>In an effort to get a wider variety of women in movies and books, we have often heard the mantra that we need more strong female characters. However, as some commentators <a href=\"http://www.overthinkingit.com/2008/08/18/why-strong-female-characters-are-bad-for-women/\">have noted</a> “strong” has often become a code word for a very specific kind of character. The kind that must demonstrate her chops via feats of physical strength. So, for example, in Pirates of the Caribbean 2 the heroine Elizabeth Swann has now acquired fencing skills. This serves as a credential for her “strength” even though the character had demonstrated “strength” of another type already in the first movie: she was smart, even devious, managing to wriggle her way out of more than one situation.</p><p>Shana Mlawski did an interesting study of male and female characters a few years ago. The main question she wanted to answer was whether male characters are more immediately likeable than female characters. <a href=\"http://www.overthinkingit.com/2010/06/28/are-male-characters-more-likable-than-female-characters\">Her conclusion</a>:</p><p><i>All of the above data suggest to me that we (or at least the critics at EW) like a wide variety of male character types but prefer our women to be two-dimensionally “badass” and/or evil.</i></p><p>That means that badasses like Sarah Connor and villains like Catherine Trammell could be palatable to audiences. Male characters, however, were allowed to come in a wider range and still deemed likeable. Men, Mlwaski, writes, could be “passive” characters. Women? They could blow stuff up or kill people….</p><p>In fact, a couple of weeks ago I watched the 1980s adaptation of <b><i>Flash Gordon</i></b> and<br> was mildly delighted to see that Dale Arden was “strong” too! Despite<br> the cheesiness and bubbly sexism Dale kicked ass! She was for the<br> duration of the film most interested in exclaiming FLASH! but at one<br> point she took off her heels and beat about half a dozen guards. Strong<br> woman, indeed.</br></br></br></br></br></p><p>And that, I guess, is my point. We really haven’t gotten that far from Dale and her display of 1980s strength.</p></blockquote><p> Sarah Hoyt says much the same thing <a href=\"http://accordingtohoyt.com/2015/02/12/why-i-dont-write-stories-set-in-portugal-a-blast-from-the-past-in-three-parts-october-2007/\">in passing</a> while writing about Portugal:</p><blockquote class=\"tr_bq\"><p> In the same way the ten-thousandth Empowered Woman Defeats Evil Males saga might posibly contribute to the self-esteem of some severely battered woman who SOMEHOW managed to avoid all other identical tomes rolling off the presses for the last twenty years at least.  For me they are just a “oh, heck, yeah.  Go sisterrrr.  YAWN” as I toss the book aside. </p></blockquote><p>I have three main objections to strong female characters. First, the basic concept is a lie. Barring mystical powers or divine heritage, the strong female character is simply nonsense. They don’t exist, they aren’t convincingly imagined or portrayed, and they’re essentially nothing more than token feminist propaganda devices. Freud would, in this case correctly, put the whole phenomenon down to penis envy.</p><p>Second, it is tedious. As both women note, strong female characters are neither new nor interesting. If you’re blindly copying a trope that hasn’t been new for three decades, you’re just boring the reader. And third, it is dreadful writing. Most “strong female” characters observably are not women, they are simply male characters dressed in female suits. They don’t talk like women, they don’t act like women, and when we’re shown their interior monologues, they don’t think like women either. They’re about as convincingly female as those latent serial killers who like to wear those bizarre rubber women suits. They are, in fact, the literary equivalent of those freaks.</p><p>I’m not the only one to notice this. Carina Chocano observes:<i> ““Strong female characters,” in other words, are often just female characters with the gendered behavior taken out.” </i>In other words, they’re one-dimensional men in women suits.</p><p>Ironically, men tend to write more interesting “strong female characters” because<br> at least they know what men think like when they are writing about men<br> in women suits. When women do it, they’re writing what they imagine the<br> man the female writer is pretending is a woman would think like. It’s<br> convoluted, it’s insane, and it should be no surprise to anyone that most stories based on<br> such self-contradictory characters don’t turn out very well.</br></br></br></br></br></p><p>On a tangential note, McRapey was bragging about how people couldn’t tell if the protagonist of <i>Lock In</i> was male or female throughout the entire book. He even had two separate narrators, one of each sex, for the audio book. Now, not only is that silly stunt-writing, but think about the literary implications. It means the behavior of the character and its interior monologue is so haplessly inept and unrealistically bland that the reader cannot even ascertain something as intrinsically basic to human identity as the mere sex of the character.</p><p>Can you imagine if you couldn’t tell from their behavior if Anna Karenina was a woman or if Aragorn was a man? Would that inability improve or detract from the story? Strong female characters are bad enough, but the occluded sex of <i>Lock In</i> marks a new depth in bad science fiction writing.</p></div>",
  "content_text": "Silvia Moreno-Garcia says\nno to strong female characters\n:\nI was not a fan of The Book of Life. I will not elaborate too much on this point except to mention that when I watched it I recalled a bit from\nan article by Sophia McDougall\npublished in The New Statesman:\nI remember watching Shrek with my mother.\n“The Princess knew kung-fu! That was nice,” I said. And yet I had a vague sense of unease, a sense that I was saying it because it was what I was supposed to say.\nShe rolled her eyes. “All the princesses know kung-fu now.”\nI thought the same thing about the heroine of The Book of Life. She knows kung-fu and she spews the kind of “feisty” attitude we must associate with heroines and she is therefore strong and everything is kosher.\nIn an effort to get a wider variety of women in movies and books, we have often heard the mantra that we need more strong female characters. However, as some commentators\nhave noted\n“strong” has often become a code word for a very specific kind of character. The kind that must demonstrate her chops via feats of physical strength. So, for example, in Pirates of the Caribbean 2 the heroine Elizabeth Swann has now acquired fencing skills. This serves as a credential for her “strength” even though the character had demonstrated “strength” of another type already in the first movie: she was smart, even devious, managing to wriggle her way out of more than one situation.\nShana Mlawski did an interesting study of male and female characters a few years ago. The main question she wanted to answer was whether male characters are more immediately likeable than female characters.\nHer conclusion\n:\nAll of the above data suggest to me that we (or at least the critics at EW) like a wide variety of male character types but prefer our women to be two-dimensionally “badass” and/or evil.\nThat means that badasses like Sarah Connor and villains like Catherine Trammell could be palatable to audiences. Male characters, however, were allowed to come in a wider range and still deemed likeable. Men, Mlwaski, writes, could be “passive” characters. Women? They could blow stuff up or kill people….\nIn fact, a couple of weeks ago I watched the 1980s adaptation of\nFlash Gordon\nand\nwas mildly delighted to see that Dale Arden was “strong” too! Despite\nthe cheesiness and bubbly sexism Dale kicked ass! She was for the\nduration of the film most interested in exclaiming FLASH! but at one\npoint she took off her heels and beat about half a dozen guards. Strong\nwoman, indeed.\nAnd that, I guess, is my point. We really haven’t gotten that far from Dale and her display of 1980s strength.\nSarah Hoyt says much the same thing\nin passing\nwhile writing about Portugal:\nIn the same way the ten-thousandth Empowered Woman Defeats Evil Males saga might posibly contribute to the self-esteem of some severely battered woman who SOMEHOW managed to avoid all other identical tomes rolling off the presses for the last twenty years at least.  For me they are just a “oh, heck, yeah.  Go sisterrrr.  YAWN” as I toss the book aside.\nI have three main objections to strong female characters. First, the basic concept is a lie. Barring mystical powers or divine heritage, the strong female character is simply nonsense. They don’t exist, they aren’t convincingly imagined or portrayed, and they’re essentially nothing more than token feminist propaganda devices. Freud would, in this case correctly, put the whole phenomenon down to penis envy.\nSecond, it is tedious. As both women note, strong female characters are neither new nor interesting. If you’re blindly copying a trope that hasn’t been new for three decades, you’re just boring the reader. And third, it is dreadful writing. Most “strong female” characters observably are not women, they are simply male characters dressed in female suits. They don’t talk like women, they don’t act like women, and when we’re shown their interior monologues, they don’t think like women either. They’re about as convincingly female as those latent serial killers who like to wear those bizarre rubber women suits. They are, in fact, the literary equivalent of those freaks.\nI’m not the only one to notice this. Carina Chocano observes:\n““Strong female characters,” in other words, are often just female characters with the gendered behavior taken out.”\nIn other words, they’re one-dimensional men in women suits.\nIronically, men tend to write more interesting “strong female characters” because\nat least they know what men think like when they are writing about men\nin women suits. When women do it, they’re writing what they imagine the\nman the female writer is pretending is a woman would think like. It’s\nconvoluted, it’s insane, and it should be no surprise to anyone that most stories based on\nsuch self-contradictory characters don’t turn out very well.\nOn a tangential note, McRapey was bragging about how people couldn’t tell if the protagonist of\nLock In\nwas male or female throughout the entire book. He even had two separate narrators, one of each sex, for the audio book. Now, not only is that silly stunt-writing, but think about the literary implications. It means the behavior of the character and its interior monologue is so haplessly inept and unrealistically bland that the reader cannot even ascertain something as intrinsically basic to human identity as the mere sex of the character.\nCan you imagine if you couldn’t tell from their behavior if Anna Karenina was a woman or if Aragorn was a man? Would that inability improve or detract from the story? Strong female characters are bad enough, but the occluded sex of\nLock In\nmarks a new depth in bad science fiction writing.",
  "tags": [
    "McRapey",
    "Pink SF",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-13T10:59:00+00:00"
}