{
  "url": "https://voxday.net/2015/02/08/more-measles-facts/",
  "scraped_at": "2025-12-16T12:44:38.096006",
  "title": "More measles facts",
  "date_display": "February 8, 2015",
  "date_iso": "2015-02-08T16:54:00+00:00",
  "date_from_url": "2015-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US goverment reports <a href=\"http://www.wnd.com/2015/02/measles-vaccines-kill-more-than-measles/\">more killed by measles vaccinations than by measles</a> in the USA:</p><blockquote class=\"tr_bq\"><p> While those opposing mandatory vaccination for measles are widely portrayed as ignorant and even dangerous by some officials, pundits and even news media accounts, Centers for Disease Control records reveal a startling truth – while no one has died of measles in the U.S. in the last 12 years, 108 have died as a result of the adverse effects of the vaccine in that same time period.</p><p>The death statistics are recorded by Vaccine Adverse Event Reporting System, or VAERS, which captures only a small percentage of the actual number of deaths and other adverse reactions to the vaccine. In addition, 96 of the 108 deaths in that 12-year time period were a result of the MMR vaccine, now the preferred shot for measles immunization.</p></blockquote><p>Now, it’s important not to exaggerate the relative risks involved. Nine deaths per year is still considerably less than <a href=\"http://www.milobookclub.com/2015/02/05/measles-actual-risks/\">the 248 per year I estimate</a> would result from a completely unvaccinated situation. However, given the fact that some countries, such as the UK, have historically seen LOWER rates of measles incidence at moderate levels of vaccine coverage, it is entirely possible that the optimal risk-minimization level of vaccination for measles is considerably below 100 percent.</p><p>This may sound counter-intuitive, but a vaccination regime that prioritized testing for vaccine susceptibility and excluded those children deemed likely to experience an adverse reaction would almost certainly meet considerably less virulent opposition than the present one, let alone the more oppressive regime envisioned by some of the more rabid pro-vaxxers. Providing an alternative delayed schedule and stretching it out would almost surely help in this regard as well. The fact is that if you’re genuinely concerned about the falling vaccine uptake, the very last thing you should support is doubling-down on the public pressure and propaganda approach. It not only isn’t working, it is <i>observably backfiring</i>.</p><p>No amount of propaganda is going to convince anyone who has seen, with their own eyes, an adverse reaction, or had one described to them. And adverse reactions most certainly do happen. That’s a fact, and the sooner the pro-vaccine community accepts it and stops trying to hide it, the sooner a more effective solution can be found.</p><p>Nothing creates more fear, uncertainty, and doubt than shaded truths and a blanket refusal to answer obvious questions. Rhetoric is no answer for serious doubts, be they reasonable or unreasonable. And as for increasing the pressure via legal means, it shouldn’t take a vast amount of foresight to anticipate what sort of adverse reactions are going to occur if doctors begin forcibly administering vaccines to children without parental consent and a child subsequently experiences a fatal adverse reaction.</p><p>One unanticipated outcome of forced vaccinations could well be the complete refusal of medical professionals to administer them.</p></div>",
  "content_text": "The US goverment reports\nmore killed by measles vaccinations than by measles\nin the USA:\nWhile those opposing mandatory vaccination for measles are widely portrayed as ignorant and even dangerous by some officials, pundits and even news media accounts, Centers for Disease Control records reveal a startling truth – while no one has died of measles in the U.S. in the last 12 years, 108 have died as a result of the adverse effects of the vaccine in that same time period.\nThe death statistics are recorded by Vaccine Adverse Event Reporting System, or VAERS, which captures only a small percentage of the actual number of deaths and other adverse reactions to the vaccine. In addition, 96 of the 108 deaths in that 12-year time period were a result of the MMR vaccine, now the preferred shot for measles immunization.\nNow, it’s important not to exaggerate the relative risks involved. Nine deaths per year is still considerably less than\nthe 248 per year I estimate\nwould result from a completely unvaccinated situation. However, given the fact that some countries, such as the UK, have historically seen LOWER rates of measles incidence at moderate levels of vaccine coverage, it is entirely possible that the optimal risk-minimization level of vaccination for measles is considerably below 100 percent.\nThis may sound counter-intuitive, but a vaccination regime that prioritized testing for vaccine susceptibility and excluded those children deemed likely to experience an adverse reaction would almost certainly meet considerably less virulent opposition than the present one, let alone the more oppressive regime envisioned by some of the more rabid pro-vaxxers. Providing an alternative delayed schedule and stretching it out would almost surely help in this regard as well. The fact is that if you’re genuinely concerned about the falling vaccine uptake, the very last thing you should support is doubling-down on the public pressure and propaganda approach. It not only isn’t working, it is\nobservably backfiring\n.\nNo amount of propaganda is going to convince anyone who has seen, with their own eyes, an adverse reaction, or had one described to them. And adverse reactions most certainly do happen. That’s a fact, and the sooner the pro-vaccine community accepts it and stops trying to hide it, the sooner a more effective solution can be found.\nNothing creates more fear, uncertainty, and doubt than shaded truths and a blanket refusal to answer obvious questions. Rhetoric is no answer for serious doubts, be they reasonable or unreasonable. And as for increasing the pressure via legal means, it shouldn’t take a vast amount of foresight to anticipate what sort of adverse reactions are going to occur if doctors begin forcibly administering vaccines to children without parental consent and a child subsequently experiences a fatal adverse reaction.\nOne unanticipated outcome of forced vaccinations could well be the complete refusal of medical professionals to administer them.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-08T16:54:00+00:00"
}