{
  "url": "https://voxday.net/2015/02/12/mother-up/",
  "scraped_at": "2025-12-16T12:45:05.308941",
  "title": "Mother up",
  "date_display": "February 12, 2015",
  "date_iso": "2015-02-12T17:00:00+00:00",
  "date_from_url": "2015-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Society doesn’t need you getting a degree in Communications or Business or Peruvian Basket-weaving. It doesn’t need you getting a STEM degree or learning to program so you can compete with cheap H1B imports from India. Society doesn’t need you working at a local/state/federal government job in order to feed your four cats. Society doesn’t need you “finding yourself” by jumping on the ALPHA carousel for ten years, then jumping off and trying to stick the landing with BETA in the three-year fertility window you’ve left yourself. Society doesn’t need you trying to prove you’re just as good as a low-performing, ineffectual man. Society needs you to be a) a woman, b) a wife, and c) a mother.</p><blockquote class=\"tr_bq\"><p> Back in 2004 the never-married rate for 25-29 year old White women was<br> just under 37%, a number which remained roughly the same from<br> 2002-2005.  Now less than half of all White women in their late 20s have<br> ever married.</br></br></br></p><p>When I first <a href=\"https://dalrock.wordpress.com/2010/10/19/marriage-strike/\">started charting this</a><br> the most recent data was from 2009.  At the time, I didn’t see<br> compelling data backing up the notion that men were on a marriage<br> strike.  I’m still <a href=\"https://dalrock.wordpress.com/2014/01/03/more-ominous-than-a-strike/\">not convinced</a><br> that a “marriage strike” describes what we are seeing, but with five<br> years of additional data it is obvious that we are undergoing a<br> significant change in marriage patterns.</br></br></br></br></br></br></p></blockquote><p>That whole shiny secular equalitarian society that the feminists assured you was right around the corner isn’t real; it is less real and less functional than the It’s A Small World ride at Disneyland. You’re not going to be president, you’re not going to be an astronaut, and no one needs you to be a soldier, a fireman, or a policeman.</p><p>Your future family needs you to be what you were created to be. A mother. And <a href=\"http://www.telegraph.co.uk/women/womens-life/11406568/Why-women-feel-so-pressured-to-have-it-all-by-30.html\">women know it</a>, or so many of them wouldn’t be zonked out of their greying gourds on psychotropic drugs in order to mask their dissatisfaction living life as ersatz men. The disease known as “women’s rights” is literally killing women.</p><p>The math simply doesn’t work. I know it’s hard, Barbie, but run the damn numbers if you don’t believe me. How are 0.75 male college graduates going to marry every female college graduate? Considering that men tend to prefer to marry less educated women, there isn’t even one <i>potential </i>husband for every two of you. And if you think those of us who are married and have children are going to tell our children to support your saggy barren asses in old age, well, think again. The world of equalitarian feminism is a nightmare world for women, a world of loneliness, drugs, deprivation, and solitary death.</p><p>It’s time to stop pushing young women into college, stop pushing them into pretending that they’re going to have careers, stop encouraging them to jump on the carousel, and start telling them to mother up.</p></div>",
  "content_text": "Society doesn’t need you getting a degree in Communications or Business or Peruvian Basket-weaving. It doesn’t need you getting a STEM degree or learning to program so you can compete with cheap H1B imports from India. Society doesn’t need you working at a local/state/federal government job in order to feed your four cats. Society doesn’t need you “finding yourself” by jumping on the ALPHA carousel for ten years, then jumping off and trying to stick the landing with BETA in the three-year fertility window you’ve left yourself. Society doesn’t need you trying to prove you’re just as good as a low-performing, ineffectual man. Society needs you to be a) a woman, b) a wife, and c) a mother.\nBack in 2004 the never-married rate for 25-29 year old White women was\njust under 37%, a number which remained roughly the same from\n2002-2005.  Now less than half of all White women in their late 20s have\never married.\nWhen I first\nstarted charting this\nthe most recent data was from 2009.  At the time, I didn’t see\ncompelling data backing up the notion that men were on a marriage\nstrike.  I’m still\nnot convinced\nthat a “marriage strike” describes what we are seeing, but with five\nyears of additional data it is obvious that we are undergoing a\nsignificant change in marriage patterns.\nThat whole shiny secular equalitarian society that the feminists assured you was right around the corner isn’t real; it is less real and less functional than the It’s A Small World ride at Disneyland. You’re not going to be president, you’re not going to be an astronaut, and no one needs you to be a soldier, a fireman, or a policeman.\nYour future family needs you to be what you were created to be. A mother. And\nwomen know it\n, or so many of them wouldn’t be zonked out of their greying gourds on psychotropic drugs in order to mask their dissatisfaction living life as ersatz men. The disease known as “women’s rights” is literally killing women.\nThe math simply doesn’t work. I know it’s hard, Barbie, but run the damn numbers if you don’t believe me. How are 0.75 male college graduates going to marry every female college graduate? Considering that men tend to prefer to marry less educated women, there isn’t even one\npotential\nhusband for every two of you. And if you think those of us who are married and have children are going to tell our children to support your saggy barren asses in old age, well, think again. The world of equalitarian feminism is a nightmare world for women, a world of loneliness, drugs, deprivation, and solitary death.\nIt’s time to stop pushing young women into college, stop pushing them into pretending that they’re going to have careers, stop encouraging them to jump on the carousel, and start telling them to mother up.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-12T17:00:00+00:00"
}