{
  "url": "https://voxday.net/2015/02/20/novella-book-bomb-afterma/",
  "scraped_at": "2025-12-16T12:46:00.999617",
  "title": "Novella Book Bomb: the aftermath",
  "date_display": "February 20, 2015",
  "date_iso": "2015-02-20T09:20:00+00:00",
  "date_from_url": "2015-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Final tally: over 1,500 books sold. Thanks very much to everyone who participated! Final Amazon rankings:</p><p>One Bright Star to Guide Them: #359<br> Big Boys Don’t Cry: #411<br> Other Heads: #883</br></br></p><p>This means that nearly twice as many people bought a Sad Puppies-recommended novella as cast a Hugo nominating ballot in 2014. Larry’s campaign to increase reading is clearly working, as longtime fan figure Mike Glyer of File 770 not only read Tom Kratman’s novella, but <a href=\"http://file770.com/?p=20968\">reviewed it as well</a>:</p><blockquote class=\"tr_bq\"><p> I plunked down $2.99 for Tom Kratman’s novella “Big Boys Don’t Cry” during yesterday’s ”book bomb” pushing novellas on the Sad Puppies slate, because I just can’t stand on the sidewalk when the parade goes by. Sometimes this leads to good things. I bought <i>Redshirts </i>a couple years ago because of the social media campaign and it turned out to be pretty good. Can lightning strike twice?</p><p>Maggie, the protagonist of “Big Boys Don’t Cry,” is a Ratha — a sentient armored weapons platform, the human race’s ultimate ground combat unit. Spoiler warning: She’s not a boy. And apparently she can cry.</p><p>As a big fan of Keith Laumer’s original Bolo stories, as well as Elizabeth Bear’s 2008 Hugo-winning ”Tideline”, I find Kratman’s variation compelling because he asks important questions about intelligent, self-aware tanks the earlier classics never investigated.</p><p>Like: Why do artificial intelligences subject themselves to human command? Why do they sacrifice themselves for human interests?</p></blockquote><p>Stay tuned. There will be more activity on this front.</p></div>",
  "content_text": "Final tally: over 1,500 books sold. Thanks very much to everyone who participated! Final Amazon rankings:\nOne Bright Star to Guide Them: #359\nBig Boys Don’t Cry: #411\nOther Heads: #883\nThis means that nearly twice as many people bought a Sad Puppies-recommended novella as cast a Hugo nominating ballot in 2014. Larry’s campaign to increase reading is clearly working, as longtime fan figure Mike Glyer of File 770 not only read Tom Kratman’s novella, but\nreviewed it as well\n:\nI plunked down $2.99 for Tom Kratman’s novella “Big Boys Don’t Cry” during yesterday’s ”book bomb” pushing novellas on the Sad Puppies slate, because I just can’t stand on the sidewalk when the parade goes by. Sometimes this leads to good things. I bought\nRedshirts\na couple years ago because of the social media campaign and it turned out to be pretty good. Can lightning strike twice?\nMaggie, the protagonist of “Big Boys Don’t Cry,” is a Ratha — a sentient armored weapons platform, the human race’s ultimate ground combat unit. Spoiler warning: She’s not a boy. And apparently she can cry.\nAs a big fan of Keith Laumer’s original Bolo stories, as well as Elizabeth Bear’s 2008 Hugo-winning ”Tideline”, I find Kratman’s variation compelling because he asks important questions about intelligent, self-aware tanks the earlier classics never investigated.\nLike: Why do artificial intelligences subject themselves to human command? Why do they sacrifice themselves for human interests?\nStay tuned. There will be more activity on this front.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-20T09:20:00+00:00"
}