{
  "url": "https://voxday.net/2015/02/26/of-combat-and-philosophy/",
  "scraped_at": "2025-12-16T12:46:41.030496",
  "title": "Of combat and philosophy",
  "date_display": "February 26, 2015",
  "date_iso": "2015-02-26T13:00:00+00:00",
  "date_from_url": "2015-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First off, please do not post OT comments early in a thread. That is implicitly saying “because I don’t care about X, I think everyone should be discussing Y, which is of more interest to me, instead”. You can certainly discuss Y if you like, by all means, but do so on your own blog. If you want to bring something to my attention, then email it to me.</p><p>Now speaking of bringing things to people’s attention that may or may not be of interest, Alpenwolf is in the process of preparing a major kickstarter for <i>First Sword</i>. It will take place in the April-May timeframe, and I hope the Dread Ilk will support it with all their well-renowned and oft-feared staunchness. As I mentioned a few days ago, I’ve expanded the concept of <i>First Sword</i> to encompass a spectrum of gameplay formats for reasons that will eventually become clear. Among the various questions I’ve been wrestling with is the best way to keep everyone informed about its progress, since, as with Alpha Game, the development of a game is a highly specific subject in which not everyone is likely to be equally interested. The options are to post all of the development-related posts on the currently dormant Alpenwolf blog, to post them at Castalia House, or to post them here. Obviously, major announcements will be posted here, but I am aware most readers here are not interested in multiple gamedev-related posts per week here.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/02/FS_orc01.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/02/FS_orc01.jpg\" width=\"215\"/></a></div><p>So, I’m leaning towards doing them at Castalia, since we want to build it up as more of a destination site, we already sell some games there, and we have one game designer, Ken Burnside of Ad Astra, already <a href=\"http://www.castaliahouse.com/book-review-the-visualization-of-quantitative-data/\">blogging there</a>. I’d also like to let those of you who are on the Castalia House New Release newsletter list know about our upcoming Game Development newsletter. Please note that if you are subscribed to the former newsletter, you will NOT be automatically subscribed to the latter. We don’t spam and we don’t cross-mail either. However, we will be accepting subscriptions soon and will also provide a signup link to the new newsletter when we send the next New Release installment out. Anyone who is interested in any type of gaming from tabletop to tablet is going to be extremely interested in what we’re doing with First Sword, because it is not only a game, it is a game engine designed for a high degree of modding capability. As the image of <i>Gragbol Man-killer, Orc Gladiator #1</i> will no doubt inform tabletop players, <i>First Sword</i> is the first example of a game system that will be playable on the physical tabletop, as a Vassal module, on a computer or mobile device, or as an ongoing campaign game.</p><p>This multi-tiered approach has long been a vision of mine, as the original version of <i>Rebel Moon Revolution</i> was designed to be both a 3D tactical shooter and a 2D strategy game. We created two levels of AI for precisely this purpose, dividing them into TacAI and StratAI so that the StratAI could be replaced by a human player moving 2D counters around on a map that was essentially the top-down version of the 3D environment. The movements served as triggers to send orders to the TacAI that replaced the orders otherwise provided by the StatAI. In retrospect, I doubt we would have been able to successfully pull that off even if GT Interactive didn’t go down the drain (taking both Fenris Wolf and <i>Rebel Moon Revolution</i> with it), partly due to time constraints and partly due to the fact that our StratAI programmer contracted cancer and died. But we are going to be able to pull it off here, because after learning from my past tendencies to design more than I could reasonably produce and bringing in some very smart and experienced new development partners, we’re applying the concept in a much simpler, much more easily accomplished fashion.</p><p>While we eventually hope to expand the concept to the full-blown multi-tiered squad-level combat game originally envisioned, in the meantime, we’re going to initially make this multi-tiered combat management gameplay work at the gladiatorial level. We’re putting together the various elements for the Kickstarter now, so if you’ve got any more thoughts concerning rewards you’d like to see, this is the time to throw them out there.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-4/\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.castaliahouse.com/wp-content/uploads/2015/02/SPJ4_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.castaliahouse.com/wp-content/uploads/2015/02/SPJ4_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>And finally, we’re happy to announce that the fourth issue of the <i>Sci Phi Journal</i> is now available in both EPUB and MOBI format <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-4/\">at the Castalia House store</a>. The first three issues have been very good and the fourth one looks like no exception. If you’d like to get caught up, issues <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-1/\">One</a>, <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-2/\">Two</a>, and <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-1/\">Three </a>are also available there. From a review of Issue #3:</p><p><i>“Suffice to say this is a thinking man’s SF magazine and is superbly chosen and edited by Jason Rennie.”</i></p><p>And as long as I’m in info dump mode, I may as well mention that ARTS OF DARK AND LIGHT Book Two is progressing very well, I am ahead of the revised schedule, the cover is being designed, and the 850-page book will likely be published in November rather than December as previously announced. <i></i>I can’t vouch for the quality myself, but I will say that the two early readers have said that it is better than A THRONE OF BONES.</p></div>",
  "content_text": "First off, please do not post OT comments early in a thread. That is implicitly saying “because I don’t care about X, I think everyone should be discussing Y, which is of more interest to me, instead”. You can certainly discuss Y if you like, by all means, but do so on your own blog. If you want to bring something to my attention, then email it to me.\nNow speaking of bringing things to people’s attention that may or may not be of interest, Alpenwolf is in the process of preparing a major kickstarter for\nFirst Sword\n. It will take place in the April-May timeframe, and I hope the Dread Ilk will support it with all their well-renowned and oft-feared staunchness. As I mentioned a few days ago, I’ve expanded the concept of\nFirst Sword\nto encompass a spectrum of gameplay formats for reasons that will eventually become clear. Among the various questions I’ve been wrestling with is the best way to keep everyone informed about its progress, since, as with Alpha Game, the development of a game is a highly specific subject in which not everyone is likely to be equally interested. The options are to post all of the development-related posts on the currently dormant Alpenwolf blog, to post them at Castalia House, or to post them here. Obviously, major announcements will be posted here, but I am aware most readers here are not interested in multiple gamedev-related posts per week here.\nSo, I’m leaning towards doing them at Castalia, since we want to build it up as more of a destination site, we already sell some games there, and we have one game designer, Ken Burnside of Ad Astra, already\nblogging there\n. I’d also like to let those of you who are on the Castalia House New Release newsletter list know about our upcoming Game Development newsletter. Please note that if you are subscribed to the former newsletter, you will NOT be automatically subscribed to the latter. We don’t spam and we don’t cross-mail either. However, we will be accepting subscriptions soon and will also provide a signup link to the new newsletter when we send the next New Release installment out. Anyone who is interested in any type of gaming from tabletop to tablet is going to be extremely interested in what we’re doing with First Sword, because it is not only a game, it is a game engine designed for a high degree of modding capability. As the image of\nGragbol Man-killer, Orc Gladiator #1\nwill no doubt inform tabletop players,\nFirst Sword\nis the first example of a game system that will be playable on the physical tabletop, as a Vassal module, on a computer or mobile device, or as an ongoing campaign game.\nThis multi-tiered approach has long been a vision of mine, as the original version of\nRebel Moon Revolution\nwas designed to be both a 3D tactical shooter and a 2D strategy game. We created two levels of AI for precisely this purpose, dividing them into TacAI and StratAI so that the StratAI could be replaced by a human player moving 2D counters around on a map that was essentially the top-down version of the 3D environment. The movements served as triggers to send orders to the TacAI that replaced the orders otherwise provided by the StatAI. In retrospect, I doubt we would have been able to successfully pull that off even if GT Interactive didn’t go down the drain (taking both Fenris Wolf and\nRebel Moon Revolution\nwith it), partly due to time constraints and partly due to the fact that our StratAI programmer contracted cancer and died. But we are going to be able to pull it off here, because after learning from my past tendencies to design more than I could reasonably produce and bringing in some very smart and experienced new development partners, we’re applying the concept in a much simpler, much more easily accomplished fashion.\nWhile we eventually hope to expand the concept to the full-blown multi-tiered squad-level combat game originally envisioned, in the meantime, we’re going to initially make this multi-tiered combat management gameplay work at the gladiatorial level. We’re putting together the various elements for the Kickstarter now, so if you’ve got any more thoughts concerning rewards you’d like to see, this is the time to throw them out there.\nAnd finally, we’re happy to announce that the fourth issue of the\nSci Phi Journal\nis now available in both EPUB and MOBI format\nat the Castalia House store\n. The first three issues have been very good and the fourth one looks like no exception. If you’d like to get caught up, issues\nOne\n,\nTwo\n, and\nThree\nare also available there. From a review of Issue #3:\n“Suffice to say this is a thinking man’s SF magazine and is superbly chosen and edited by Jason Rennie.”\nAnd as long as I’m in info dump mode, I may as well mention that ARTS OF DARK AND LIGHT Book Two is progressing very well, I am ahead of the revised schedule, the cover is being designed, and the 850-page book will likely be published in November rather than December as previously announced.\nI can’t vouch for the quality myself, but I will say that the two early readers have said that it is better than A THRONE OF BONES.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-26T13:00:00+00:00"
}