{
  "url": "https://voxday.net/2015/02/28/of-deceit-and-discourse/",
  "scraped_at": "2025-12-16T12:46:53.134275",
  "title": "Of deceit and discourse",
  "date_display": "February 28, 2015",
  "date_iso": "2015-02-28T10:02:00+00:00",
  "date_from_url": "2015-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Gerrib made a demonstrably incorrect statement yesterday. He also implied that he had read the entire book, pointing out that he had bought it and talking about details from the first chapter. I called him on his statement and asked him a simple, straightforward yes/no question that would have indicated it to be not only false, but disingenuous and knowingly false.</p><p><i>You made a false and disingenuous claim about what “this SJW shit” is. Do<br> you admit that “this SJW shit” is what “gleefully subverts gender<br> roles” and “the subversion of the dominant white male paradigm”? Yes or no?</br></br></i></p><p>Instead of answering the question as per the clearly posted rules of the blog, Chris then went on to post NINE additional comments evading it. I gave him three opportunities to answer, and when he would not do so, I informed him that he would not be posting any more further comments here until he answered the question. This was his not-entirely-unexpected response:</p><blockquote class=\"tr_bq\"><p> Vox- I’m done talking to you.  If you don’t want me to comment here, get<br> me banned.  Otherwise, fuck off.  If you think that’s conflict<br> avoidance, whatever.  Why I should give a damn about the opinion of a<br> one-name wonder is beyond me.</br></br></br></p></blockquote><p>He is done talking to me. He is done talking to everyone here, now that he is banned and spammed. Furthermore, I note that Chris Gerrib is a liar, a deceiver, an intellectual coward, and a near-textbook example of an insecure, passive-aggressive, conflict-avoidant gamma male, who turns evasive and runs away rather than even take the risk of being publicly forced to admit that he was wrong.</p><p>What was fascinating about his behavior yesterday is that at Alpha Game, we have been discussing precisely this pattern of behavior of men who belong to this socio-sexual demographic for the last two weeks, and helping various gammas try to break the pattern. Gerrib’s behavior fit it to a T; it was so predictable that several of us were discussing it before he even finished <a href=\"http://alphagameplan.blogspot.com/2015/02/alpha-mail-question-and-answer.html\">the customary Gamma routine.</a> As one observer said, it was like watching a textbook example in action.</p><blockquote class=\"tr_bq\"><p> Notice the various elements of the socio-sexual hierarchy at work:</p><ul><li>Alpha: doesn’t mind straightforward conflict, will not tolerate disrespect, is comfortable with direct and physical conflict. The political is not personal.</li><li>Gamma: can’t tolerate disagreement or criticism, bitchy, cowardly, puts himself in situations he is not equipped to handle. The political is personal, the technical is personal, everything is personal. Runs from direct confrontation.</li></ul></blockquote><p> Here are a few of the typical Gamma behaviors <a href=\"http://alphagameplan.blogspot.com/2015/02/are-you-gamma-1-of-2.html\">identified by an ex-Gamma</a> that were obvious throughout the comments.</p><ul><li>In the past year you can’t recall a single serious online discussion you were wrong about anything.</li><li>In the past two years you can’t recall one discussion with any friends or family in which you were wrong about anything.</li><li>When finally shown you are wrong about something it is devastating,<br> you remember it for months or years, avoid that place or people, and<br> consider your time there a failure as a person.</br></br></li><li>You routinely lie about small, personal, matters knowing you can get away with it.</li><li>You think width of knowledge is more important than depth of knowledge.</li><li>If you start to lose at any game you find a way to quit if you can<br> and hope to save face by degrading the game or the other players.</br></li><li>If someone defeats you at a game or competition you can’t look them in the eye afterwards and try to avoid them if possible. </li></ul><p>The two points that I thought was the most telling yesterday were those that concern routinely lying and width of knowledge. From the very start, Gerrib deceitfully struck a pose of being more knowledgeable about the book than he actually was before eventually exposing his own deceit.</p><ol><li>“Well, having bought the book based on the author’s reading of the first chapter at Windycon, I read stuff like this. Chapter 1 was pretty active, ending with a shoot-out and a bad guy trying to use some kind of mind-control device.” </li><li>“if you had gotten as far as the end of chapter 1, you would have found out that the women who cause the first gunfight were both Asian.”</li><li>“I have not read past chapter 1.”</li></ol><p>This behavior makes no sense to the non-gamma male, but to prefer everyone knowing that you’re deceitful to publicly admitting that you’re wrong is the quintessence of gamma. Gammas know no honor because they reject the concept, they consider it foolish. And there is no place in the public discourse here for those who intentionally seek to deceive their fellow commenters.</p><p>This is not the first time Gerrib has behaved in this manner. S1AL noted:</p><blockquote class=\"tr_bq\"><p> That’s a truly amusing statement coming from someone incapable of admitting when he is incorrect about any fact. Really, tell me again how there were no black people in a pirate movie before 2005… or how the Declaration of Independence is the “founding” document of America. But hey, now I know it’s not just me to whom you won’t admit being wrong.</p></blockquote><p>The Rules of the Blog exist for several good reasons, and one of the primary ones is to foster honest, civil, and rational discourse. Those who demonstrate that they either cannot or will not engage in such discourse will not be permitted to continue commenting here.</p></div>",
  "content_text": "Chris Gerrib made a demonstrably incorrect statement yesterday. He also implied that he had read the entire book, pointing out that he had bought it and talking about details from the first chapter. I called him on his statement and asked him a simple, straightforward yes/no question that would have indicated it to be not only false, but disingenuous and knowingly false.\nYou made a false and disingenuous claim about what “this SJW shit” is. Do\nyou admit that “this SJW shit” is what “gleefully subverts gender\nroles” and “the subversion of the dominant white male paradigm”? Yes or no?\nInstead of answering the question as per the clearly posted rules of the blog, Chris then went on to post NINE additional comments evading it. I gave him three opportunities to answer, and when he would not do so, I informed him that he would not be posting any more further comments here until he answered the question. This was his not-entirely-unexpected response:\nVox- I’m done talking to you.  If you don’t want me to comment here, get\nme banned.  Otherwise, fuck off.  If you think that’s conflict\navoidance, whatever.  Why I should give a damn about the opinion of a\none-name wonder is beyond me.\nHe is done talking to me. He is done talking to everyone here, now that he is banned and spammed. Furthermore, I note that Chris Gerrib is a liar, a deceiver, an intellectual coward, and a near-textbook example of an insecure, passive-aggressive, conflict-avoidant gamma male, who turns evasive and runs away rather than even take the risk of being publicly forced to admit that he was wrong.\nWhat was fascinating about his behavior yesterday is that at Alpha Game, we have been discussing precisely this pattern of behavior of men who belong to this socio-sexual demographic for the last two weeks, and helping various gammas try to break the pattern. Gerrib’s behavior fit it to a T; it was so predictable that several of us were discussing it before he even finished\nthe customary Gamma routine.\nAs one observer said, it was like watching a textbook example in action.\nNotice the various elements of the socio-sexual hierarchy at work:\nAlpha: doesn’t mind straightforward conflict, will not tolerate disrespect, is comfortable with direct and physical conflict. The political is not personal.\nGamma: can’t tolerate disagreement or criticism, bitchy, cowardly, puts himself in situations he is not equipped to handle. The political is personal, the technical is personal, everything is personal. Runs from direct confrontation.\nHere are a few of the typical Gamma behaviors\nidentified by an ex-Gamma\nthat were obvious throughout the comments.\nIn the past year you can’t recall a single serious online discussion you were wrong about anything.\nIn the past two years you can’t recall one discussion with any friends or family in which you were wrong about anything.\nWhen finally shown you are wrong about something it is devastating,\nyou remember it for months or years, avoid that place or people, and\nconsider your time there a failure as a person.\nYou routinely lie about small, personal, matters knowing you can get away with it.\nYou think width of knowledge is more important than depth of knowledge.\nIf you start to lose at any game you find a way to quit if you can\nand hope to save face by degrading the game or the other players.\nIf someone defeats you at a game or competition you can’t look them in the eye afterwards and try to avoid them if possible.\nThe two points that I thought was the most telling yesterday were those that concern routinely lying and width of knowledge. From the very start, Gerrib deceitfully struck a pose of being more knowledgeable about the book than he actually was before eventually exposing his own deceit.\n“Well, having bought the book based on the author’s reading of the first chapter at Windycon, I read stuff like this. Chapter 1 was pretty active, ending with a shoot-out and a bad guy trying to use some kind of mind-control device.”\n“if you had gotten as far as the end of chapter 1, you would have found out that the women who cause the first gunfight were both Asian.”\n“I have not read past chapter 1.”\nThis behavior makes no sense to the non-gamma male, but to prefer everyone knowing that you’re deceitful to publicly admitting that you’re wrong is the quintessence of gamma. Gammas know no honor because they reject the concept, they consider it foolish. And there is no place in the public discourse here for those who intentionally seek to deceive their fellow commenters.\nThis is not the first time Gerrib has behaved in this manner. S1AL noted:\nThat’s a truly amusing statement coming from someone incapable of admitting when he is incorrect about any fact. Really, tell me again how there were no black people in a pirate movie before 2005… or how the Declaration of Independence is the “founding” document of America. But hey, now I know it’s not just me to whom you won’t admit being wrong.\nThe Rules of the Blog exist for several good reasons, and one of the primary ones is to foster honest, civil, and rational discourse. Those who demonstrate that they either cannot or will not engage in such discourse will not be permitted to continue commenting here.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-28T10:02:00+00:00"
}