{
  "url": "https://voxday.net/2015/02/17/red-with-blood-of-christians/",
  "scraped_at": "2025-12-16T12:45:39.726047",
  "title": "Red with the blood of Christians",
  "date_display": "February 17, 2015",
  "date_iso": "2015-02-17T13:00:00+00:00",
  "date_from_url": "2015-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.telegraph.co.uk/multimedia/archive/03201/comment-front_3_3201839b.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"187\" src=\"http://i.telegraph.co.uk/multimedia/archive/03201/comment-front_3_3201839b.jpg\" width=\"320\"/></a></div><p><i><b><a href=\"http://www.telegraph.co.uk/news/worldnews/islamic-state/11416779/The-Middle-East-is-red-with-the-blood-of-Christians.html\">The Middle East is red with the blood of Christians.</a> </b>The atrocity by Islamic State sympathisers in Libya highlights the worsening persecution of non-Muslims all over the Middle East – violence that is driving them from their Biblical homelands. The beheading of 21 Coptic Christians in Libya by forces sympathetic to Islamic State over recent days is sadly not an isolated case. On the contrary, it is the latest of countless outrages perpetrated against Christians in or near the Church’s Biblical heartlands over many years. </i></p><p>It is time to end the long and suicidal Western experiment with religious tolerance. Tolerance is evil. Tolerance is <a href=\"http://www.milobookclub.com/2006/04/13/on-virtue-of-tolerance/\">“the sin of Jeroboam”</a>. Tolerance is the death of civilization.</p><p>“As we mourn with the families of those 21 martyrs, we’d better take this warning seriously as these acts of terror will only spread throughout Europe and the United States,” <a href=\"http://cnsnews.com/news/article/michael-w-chapman/rev-graham-imagine-outcry-if-21-muslims-had-been-beheaded-christians\">warned Rev. Graham</a>.</p><p>The 21st century is about to learn that far from being the epitomes of evil, the Crusades, the Reconquista, and the Spanish Inquisition were all right, necessary, and above all <i>self-defensive</i> reactions by Western civilization against aggressive Islamic expansion. The battle for the West will begin within the next two decades, and the Men of the West had better be ready for it.</p><p>The media <a href=\"http://dailycaller.com/2015/02/16/nbcs-today-devotes-10-times-more-coverage-to-snl-40-than-isis-beheadings/\">certainly isn’t</a>:</p><blockquote class=\"tr_bq\"><p> The morning after the much anticipated Saturday Night Live 40th anniversary special, NBC’s “Today” Show gave the SNL special more than 10 times the coverage during its first three hours Monday than the brutal beheadings of Egyptian Christians by ISIS…. “Today” thought the SNL special was of vast importance, covering the<br> humor-filled three and a half hour-long affair for 15 minutes and eight<br> seconds (908 seconds in total). Meanwhile, coverage of the ISIS<br> beheadings totaled a meager one minute and 28 seconds.</br></br></br></p></blockquote></div>",
  "content_text": "The Middle East is red with the blood of Christians.\nThe atrocity by Islamic State sympathisers in Libya highlights the worsening persecution of non-Muslims all over the Middle East – violence that is driving them from their Biblical homelands. The beheading of 21 Coptic Christians in Libya by forces sympathetic to Islamic State over recent days is sadly not an isolated case. On the contrary, it is the latest of countless outrages perpetrated against Christians in or near the Church’s Biblical heartlands over many years.\nIt is time to end the long and suicidal Western experiment with religious tolerance. Tolerance is evil. Tolerance is\n“the sin of Jeroboam”\n. Tolerance is the death of civilization.\n“As we mourn with the families of those 21 martyrs, we’d better take this warning seriously as these acts of terror will only spread throughout Europe and the United States,”\nwarned Rev. Graham\n.\nThe 21st century is about to learn that far from being the epitomes of evil, the Crusades, the Reconquista, and the Spanish Inquisition were all right, necessary, and above all\nself-defensive\nreactions by Western civilization against aggressive Islamic expansion. The battle for the West will begin within the next two decades, and the Men of the West had better be ready for it.\nThe media\ncertainly isn’t\n:\nThe morning after the much anticipated Saturday Night Live 40th anniversary special, NBC’s “Today” Show gave the SNL special more than 10 times the coverage during its first three hours Monday than the brutal beheadings of Egyptian Christians by ISIS…. “Today” thought the SNL special was of vast importance, covering the\nhumor-filled three and a half hour-long affair for 15 minutes and eight\nseconds (908 seconds in total). Meanwhile, coverage of the ISIS\nbeheadings totaled a meager one minute and 28 seconds.",
  "tags": [
    "Christianity",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-17T13:00:00+00:00"
}