{
  "url": "https://voxday.net/2015/02/04/science-and-middle-ages/",
  "scraped_at": "2025-12-16T12:44:14.215941",
  "title": "Science and the Middle Ages",
  "date_display": "February 4, 2015",
  "date_iso": "2015-02-04T13:00:00+00:00",
  "date_from_url": "2015-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tim O’Neill explains why the false view of science coming to a halt during the Middle Ages is not merely incorrect, but is <a href=\"http://www.quora.com/Why-did-science-make-little-real-progress-in-Europe-in-the-Middle-Ages/answer/Tim-ONeill-1?share=1\">the result of anti-Christian Enlightenment propaganda</a>.</p><blockquote class=\"tr_bq\"><p> The<br> standard view of the Middle Ages as a scientific wasteland has<br> persisted for so long and is so entrenched in the popular mind largely<br> because it has deep cultural and sectarian roots, but not because it has<br> any real basis in fact.  It is partly based on anti-Catholic prejudices<br> in the Protestant tradition, that saw the Middle Ages purely as a<br> benighted period of Church oppression.  It was also promulgated by<br> Enlightenment scholars like Voltaire and Condorcet who had an axe to<br> grind with Christianity in their own time and projected this onto the<br> past in their polemical anti-clerical writings. By the later Nineteenth<br> Century the “fact” that the Church suppressed science in the Middle Ages<br> was generally unquestioned even though it had never been properly and<br> objectively examined.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>It was the early historian of science, the<br> French physicist and mathematician Pierre Duhem, who first began to<br> debunk this polemically-driven view of history.  While researching the<br> history of statics and classical mechanics in physics, Duhem looked at<br> the work of the scientists of the Scientific Revolution, such as Newton,<br> Bernoulli and Galileo.  But in reading their work he was surprised to<br> find some references to earlier scholars, ones working in the supposedly<br> science-free zone of the Middle Ages.  When he did what no historian<br> before him had done before and actually read the work of Medieval<br> physicists like Roger Bacon (1214-1294), Jean Buridan (c. 1300- c.<br> 1358), and Nicholas Oresme (c. 1320-1382) he was amazed at their<br> sophistication and he began a systematic study of the until then ignored<br> Medieval scientific flowering of the Twelfth to Fifteenth Centuries.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>What<br> he and later modern historians of early science found is that the<br> Enlightenment myths of the Middle Ages as a scientific dark age<br> suppressed by the dead hand of an oppressive Church were nonsense. <br> Duhem was a meticulous historical researcher and fluent in Latin,<br> meaning he could read Medieval scientific works that had been ignored<br> for centuries.  And as one of the most renowned physicists of his day,<br> he was also in a unique position to assess the sophistication of the<br> works he was rediscovering and of recognising that these Medieval<br> scholars had actually discovered elements in physics and mechanics that<br> had long been attributed to much later scientists like Galileo and<br> Newton.  This did not sit well with anti-clerical elements in the<br> intellectual elite of his time and his publishers were pressured not to<br> publish the later volumes of his <i>Systeme de Monde</i>: <i>Histoire des Doctrines cosmologiques de Platon à Copernic</i><br> – the establishment of the time was not comfortable with the idea of<br> the Middle Ages as a scientific dark age being overturned. </br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>One thing I learned in writing <i>The Irrational Atheist</i> was to never trust “what everybody knows” about history. It’s more than MPAI, it’s more than a general ignorance about history; the fact is that most people who consider themselves to be educated with regards to history are, in demonstrable fact, maleducated. They’ve been given a false narrative that is belied by the actual documentary evidence.</p></div>",
  "content_text": "Tim O’Neill explains why the false view of science coming to a halt during the Middle Ages is not merely incorrect, but is\nthe result of anti-Christian Enlightenment propaganda\n.\nThe\nstandard view of the Middle Ages as a scientific wasteland has\npersisted for so long and is so entrenched in the popular mind largely\nbecause it has deep cultural and sectarian roots, but not because it has\nany real basis in fact.  It is partly based on anti-Catholic prejudices\nin the Protestant tradition, that saw the Middle Ages purely as a\nbenighted period of Church oppression.  It was also promulgated by\nEnlightenment scholars like Voltaire and Condorcet who had an axe to\ngrind with Christianity in their own time and projected this onto the\npast in their polemical anti-clerical writings. By the later Nineteenth\nCentury the “fact” that the Church suppressed science in the Middle Ages\nwas generally unquestioned even though it had never been properly and\nobjectively examined.\nIt was the early historian of science, the\nFrench physicist and mathematician Pierre Duhem, who first began to\ndebunk this polemically-driven view of history.  While researching the\nhistory of statics and classical mechanics in physics, Duhem looked at\nthe work of the scientists of the Scientific Revolution, such as Newton,\nBernoulli and Galileo.  But in reading their work he was surprised to\nfind some references to earlier scholars, ones working in the supposedly\nscience-free zone of the Middle Ages.  When he did what no historian\nbefore him had done before and actually read the work of Medieval\nphysicists like Roger Bacon (1214-1294), Jean Buridan (c. 1300- c.\n1358), and Nicholas Oresme (c. 1320-1382) he was amazed at their\nsophistication and he began a systematic study of the until then ignored\nMedieval scientific flowering of the Twelfth to Fifteenth Centuries.\nWhat\nhe and later modern historians of early science found is that the\nEnlightenment myths of the Middle Ages as a scientific dark age\nsuppressed by the dead hand of an oppressive Church were nonsense.\nDuhem was a meticulous historical researcher and fluent in Latin,\nmeaning he could read Medieval scientific works that had been ignored\nfor centuries.  And as one of the most renowned physicists of his day,\nhe was also in a unique position to assess the sophistication of the\nworks he was rediscovering and of recognising that these Medieval\nscholars had actually discovered elements in physics and mechanics that\nhad long been attributed to much later scientists like Galileo and\nNewton.  This did not sit well with anti-clerical elements in the\nintellectual elite of his time and his publishers were pressured not to\npublish the later volumes of his\nSysteme de Monde\n:\nHistoire des Doctrines cosmologiques de Platon à Copernic\n– the establishment of the time was not comfortable with the idea of\nthe Middle Ages as a scientific dark age being overturned.\nOne thing I learned in writing\nThe Irrational Atheist\nwas to never trust “what everybody knows” about history. It’s more than MPAI, it’s more than a general ignorance about history; the fact is that most people who consider themselves to be educated with regards to history are, in demonstrable fact, maleducated. They’ve been given a false narrative that is belied by the actual documentary evidence.",
  "tags": [
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-04T13:00:00+00:00"
}