{
  "url": "https://voxday.net/2015/02/28/shots-across-bow/",
  "scraped_at": "2025-12-16T12:46:54.952683",
  "title": "Shots across the bow",
  "date_display": "February 28, 2015",
  "date_iso": "2015-02-28T13:00:00+00:00",
  "date_from_url": "2015-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zerohedge notes that China appears to be taking sides in the Ukraine conflict and doing so <a href=\"http://www.zerohedge.com/news/2015-02-27/china-just-sided-russia-over-ukraine-conflict\">in support of Russia</a>:</p><blockquote class=\"tr_bq\"><p> Speaking in very clear and explicit language, something diplomats are<br> not used to doing, the Chinese ambassador said the “nature and root<br> cause” of the crisis was the “game” between Russia and Western powers,<br> including the United States and the European Union.</br></br></br></p><blockquote><p> He said external intervention by different powers accelerated the crisis and <strong>warned that Moscow would feel it was being treated unfairly if the West did not change its approach</strong>.</p><p>“The West should abandon the zero-sum mentality, and take the real<br> security concerns of Russia into consideration,” Qu was quoted as<br> saying.</br></br></p><p><strong>His comments were an unusually public show of understanding from China for the Russian position. </strong>China<br> and Russia see eye-to-eye on many international diplomatic issues but<br> Beijing has generally not been so willing to back Russia over Ukraine.</br></br></p></blockquote><p>As noted above, China has long been very cautious not to be drawn<br> into the struggle between Russia and the West over Ukraine’s future, not<br> wanting to alienate a key ally. And yet, something changed overnight,<br> with this very clear language, warning some could say, that China will<br> no longer tolerate Pax Americana, and even the mere assumption of a<br> unipolar western world, let alone the reality.<br> Qu’s comments take place just as talks between the United States and its European allies over harsher sanctions against Moscow.</br></br></br></br></br></br></p><blockquote><p> On Monday, Russian Foreign Minister Sergei Lavrov accused<br> Western powers of trying to dominate and impose their ideology on the<br> rest of world. The United States and European delegations slammed Moscow<br> for supporting rebels in eastern Ukraine.</br></br></br></p><p><strong>Qu said Washington’s involvement in Ukraine could “become a distraction in its foreign policy”.</strong></p></blockquote><p>And then, Qu’s slap in the face of Obama: <strong>“The United States<br> is unwilling to see its presence in any part of the  world being<br> weakened, but the fact is its resources are limited, and it  will be to<br> some extent hard work to sustain its influence in external  affairs.</br></br></br></strong>“</p></blockquote><p>Very soon after which a prominent critic of Putin was <a href=\"http://www.zerohedge.com/news/2015-02-27/prominent-russian-politician-and-putin-critic-shot-death-center-moscow\">shot dead in a blatant hit</a> that doesn’t resemble the usual Russian method of dealing with their critics. Of course, trying to determine whether it is a Russian act, a CIA act meant to look like a Russian act, or a Russian act meant to look like a CIA act, is futile. But it does look as if we’re back at near-Cold War levels of hostility between the USA and Russia.</p><p>The key difference this time, in my opinion, is that the Russian people will be considerably more united against the USA and its Western allies under a Russian nationalist like Putin than they ever were under the Soviets. If the American strategists are failing to take this into account, their efforts are likely to end in disaster.</p></div>",
  "content_text": "Zerohedge notes that China appears to be taking sides in the Ukraine conflict and doing so\nin support of Russia\n:\nSpeaking in very clear and explicit language, something diplomats are\nnot used to doing, the Chinese ambassador said the “nature and root\ncause” of the crisis was the “game” between Russia and Western powers,\nincluding the United States and the European Union.\nHe said external intervention by different powers accelerated the crisis and\nwarned that Moscow would feel it was being treated unfairly if the West did not change its approach\n.\n“The West should abandon the zero-sum mentality, and take the real\nsecurity concerns of Russia into consideration,” Qu was quoted as\nsaying.\nHis comments were an unusually public show of understanding from China for the Russian position.\nChina\nand Russia see eye-to-eye on many international diplomatic issues but\nBeijing has generally not been so willing to back Russia over Ukraine.\nAs noted above, China has long been very cautious not to be drawn\ninto the struggle between Russia and the West over Ukraine’s future, not\nwanting to alienate a key ally. And yet, something changed overnight,\nwith this very clear language, warning some could say, that China will\nno longer tolerate Pax Americana, and even the mere assumption of a\nunipolar western world, let alone the reality.\nQu’s comments take place just as talks between the United States and its European allies over harsher sanctions against Moscow.\nOn Monday, Russian Foreign Minister Sergei Lavrov accused\nWestern powers of trying to dominate and impose their ideology on the\nrest of world. The United States and European delegations slammed Moscow\nfor supporting rebels in eastern Ukraine.\nQu said Washington’s involvement in Ukraine could “become a distraction in its foreign policy”.\nAnd then, Qu’s slap in the face of Obama:\n“The United States\nis unwilling to see its presence in any part of the  world being\nweakened, but the fact is its resources are limited, and it  will be to\nsome extent hard work to sustain its influence in external  affairs.\n“\nVery soon after which a prominent critic of Putin was\nshot dead in a blatant hit\nthat doesn’t resemble the usual Russian method of dealing with their critics. Of course, trying to determine whether it is a Russian act, a CIA act meant to look like a Russian act, or a Russian act meant to look like a CIA act, is futile. But it does look as if we’re back at near-Cold War levels of hostility between the USA and Russia.\nThe key difference this time, in my opinion, is that the Russian people will be considerably more united against the USA and its Western allies under a Russian nationalist like Putin than they ever were under the Soviets. If the American strategists are failing to take this into account, their efforts are likely to end in disaster.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-28T13:00:00+00:00"
}