{
  "url": "https://voxday.net/2015/02/23/sjws-speak-jabber-whack/",
  "scraped_at": "2025-12-16T12:46:16.452067",
  "title": "SJWs speak jabber whack",
  "date_display": "February 23, 2015",
  "date_iso": "2015-02-23T10:24:00+00:00",
  "date_from_url": "2015-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t matter if they are anti-Sad Puppies or anti-GamerGate, they are the same sort of liars who will say anything in order to try to discredit the other side. One “Cat”, who may or may not be Cat Rambo, the vice-president of SFWA who recently <a href=\"http://www.kittywumpus.net/blog/2015/02/06/sfwa-presidential-platform-statement/\">announced her candidacy</a> to lead the organization, has been running around sites ranging from Larry Correia’s and the Mad Genius Club to Mike Glyer’s File 770, trying to tell everyone she knows what Sad Puppies, and now #GamerGate, <a href=\"http://file770.com/?p=20968\">are really about</a>. She’s actually jabber-whacking about how Larry Correia’s Book Bomb sold nearly 2,000 novellas and pretty much ensured that the Sad Puppies recommendations, if they are nominated, will be the most widely read nominees on the Hugo ballot.</p><blockquote class=\"tr_bq\"><p> To get bestseller status you have to start from somewhere and you are using the book bombs to give that start to certain stories that can’t get it on their own. Thus diddling with the bestseller lists, as I said. Meaning the Sad Puppies themselves know that bestseller is not simply a mark of quality.</p><p>As for the quality of the Sad Puppies noms, I read them all, and they ended up where they deserved, quality-wise. If “Opera Vita Aeterna” was the best the Sad Puppies had to offer, the Hugos have hardly been missing out on “quality” to this point. (Pro-tip: “quality” stories do not name the woman character after her chest. Not even if there is some marine with a similar nickname for deniability’s sake.)</p><p>I see what the Sad Puppies claim they are doing. I just don’t actually care; talk is cheap. Last year’s results make it pretty plain what they’re really doing.</p><p>I know what Gamergate is really about, because I pay attention to what they do and who they attack, and who they don’t. Attach Gamergate to your cause if you like being associated with rape and death threats against women who dare to speak about videogames. But in that case you probably shouldn’t get mad when someone points out what you have done.</p></blockquote><p>(Pro-tip: There are no female characters in “Opera Vita Aeterna”. Nor are there any Marines. As it happens, it is a fantasy novelette about a monastery. This tends to raise some serious doubts about Cat’s ability to read, let alone accurately ascertain the quality of what she has nominally “read”.) There were several responses, one of them mine.</p><p><i>You don’t know a damn thing about it, little Kitty-Cat. Because, if<br> you did, you’d know that I am the Leader of #GamerGate and the link<br> between #GamerGate and Sad Puppies is considerably more direct than you<br> believe it to be. #GamerGate is Sad Puppies on nuclear steroids. Everything is bigger.<br> Literally Who, Literally Who 2, and Literally Wu are scam artists that<br> make John Scalzi look like a paragon of probity. And you don’t even know<br> what the issues are.<br> </br></br></br></br></br></br></br></i><br> <i><br/></i><br> <i>But here is the similarity. GamerGaters declare we will play the<br> games we want to play and make the games we want to make. If you don’t<br> like that, go away and make your own games. Sound familiar?</br></br></i></br></br></p><p><a name=\"more\"></a><br> Ravenshrike added:</br></p><blockquote class=\"tr_bq\"><p> You do realize that both the Goon Squad and the GNAA, the two biggest ‘professional’ troll organizations on the internet, have admitted to being active in q/ggate correct? As well the only death threat traced back to an actual person was traced back to a Brazilian clickbait journalist, basically another professional troll. So attempting to throw around guilt by association when I</p><p>1. am not active on twatter<br> 2. Can process the fact that assholes on the internet lie about who they are and what they believe in on a regular basis<br> 3. am not interested in bringing up similar arguments about MZB and SD</br></br></p></blockquote><p>Being a typical SJW, Cat didn’t have the sense to recant or retreat, but instead doubled-down:</p><blockquote class=\"tr_bq\"><p> Sorry guys, Gamergate got into the regular news.  And now we all know<br> it’s not about ethics in journalism, it’s about targeting women who dare<br> to make games, or talk about games, with rape and death threats. </br></br></p></blockquote><p>Ah, the “regular news”. As in Brian Williams, the hero of Baghdad. I pointed out a few obvious facts, such as that Cat was not only a blatant liar, but her lies didn’t even make sense.<br/></p><ol><li>Most of the “death threats” and “rape threats” were fake. They never happened.</li><li>All of them happened months ago. Last fall. When was the last “rape and death threat”, Cat?</li><li>GamerGate is an active group that consists of tens of thousands of<br> individuals. Many of them are professional game developers like me. What has #GamerGate been doing for the last six months if there have only been a small handful of supposed<br> threats last fall, most of them of dubious legitimacy?</br></br></li><li>A number of game journalists, some of them influential, have lost<br> their jobs. Joystiq closed. Gawker lost over a million dollars in ad<br> revenue and “reassigned’ two of its top people. Do you think this is due<br> to “rape and death threats”? Or serious problems concerning “ethics in<br> journalism”?</br></br></br></br></li><li>Several game journalism sites have adopted ethics guidelines. Do you<br> think this just might have something to do with a little ethical problem<br> in gaming journalism?</br></br></li></ol><p>I was the second nationally syndicated game journalist in the USA. I<br> have written for numerous leading game industry magazines, including Computer Gaming<br> World, Electronic Entertainment, and Develop. And I can tell you, with<br> 100 percent certainty, that in 2014 there was a MASSIVE ethics problem<br> in game journalism. And there still is. Any serious game developer will readily<br> tell you as much.</br></br></br></br></br></p><p>What are your game industry credentials? What are your game<br> journalism credentials? What do you know about it beyond watching <strike>CSI</strike> Law and Order:<br> SVU?</br></br></p></div>",
  "content_text": "It doesn’t matter if they are anti-Sad Puppies or anti-GamerGate, they are the same sort of liars who will say anything in order to try to discredit the other side. One “Cat”, who may or may not be Cat Rambo, the vice-president of SFWA who recently\nannounced her candidacy\nto lead the organization, has been running around sites ranging from Larry Correia’s and the Mad Genius Club to Mike Glyer’s File 770, trying to tell everyone she knows what Sad Puppies, and now #GamerGate,\nare really about\n. She’s actually jabber-whacking about how Larry Correia’s Book Bomb sold nearly 2,000 novellas and pretty much ensured that the Sad Puppies recommendations, if they are nominated, will be the most widely read nominees on the Hugo ballot.\nTo get bestseller status you have to start from somewhere and you are using the book bombs to give that start to certain stories that can’t get it on their own. Thus diddling with the bestseller lists, as I said. Meaning the Sad Puppies themselves know that bestseller is not simply a mark of quality.\nAs for the quality of the Sad Puppies noms, I read them all, and they ended up where they deserved, quality-wise. If “Opera Vita Aeterna” was the best the Sad Puppies had to offer, the Hugos have hardly been missing out on “quality” to this point. (Pro-tip: “quality” stories do not name the woman character after her chest. Not even if there is some marine with a similar nickname for deniability’s sake.)\nI see what the Sad Puppies claim they are doing. I just don’t actually care; talk is cheap. Last year’s results make it pretty plain what they’re really doing.\nI know what Gamergate is really about, because I pay attention to what they do and who they attack, and who they don’t. Attach Gamergate to your cause if you like being associated with rape and death threats against women who dare to speak about videogames. But in that case you probably shouldn’t get mad when someone points out what you have done.\n(Pro-tip: There are no female characters in “Opera Vita Aeterna”. Nor are there any Marines. As it happens, it is a fantasy novelette about a monastery. This tends to raise some serious doubts about Cat’s ability to read, let alone accurately ascertain the quality of what she has nominally “read”.) There were several responses, one of them mine.\nYou don’t know a damn thing about it, little Kitty-Cat. Because, if\nyou did, you’d know that I am the Leader of #GamerGate and the link\nbetween #GamerGate and Sad Puppies is considerably more direct than you\nbelieve it to be. #GamerGate is Sad Puppies on nuclear steroids. Everything is bigger.\nLiterally Who, Literally Who 2, and Literally Wu are scam artists that\nmake John Scalzi look like a paragon of probity. And you don’t even know\nwhat the issues are.\nBut here is the similarity. GamerGaters declare we will play the\ngames we want to play and make the games we want to make. If you don’t\nlike that, go away and make your own games. Sound familiar?\nRavenshrike added:\nYou do realize that both the Goon Squad and the GNAA, the two biggest ‘professional’ troll organizations on the internet, have admitted to being active in q/ggate correct? As well the only death threat traced back to an actual person was traced back to a Brazilian clickbait journalist, basically another professional troll. So attempting to throw around guilt by association when I\n1. am not active on twatter\n2. Can process the fact that assholes on the internet lie about who they are and what they believe in on a regular basis\n3. am not interested in bringing up similar arguments about MZB and SD\nBeing a typical SJW, Cat didn’t have the sense to recant or retreat, but instead doubled-down:\nSorry guys, Gamergate got into the regular news.  And now we all know\nit’s not about ethics in journalism, it’s about targeting women who dare\nto make games, or talk about games, with rape and death threats.\nAh, the “regular news”. As in Brian Williams, the hero of Baghdad. I pointed out a few obvious facts, such as that Cat was not only a blatant liar, but her lies didn’t even make sense.\nMost of the “death threats” and “rape threats” were fake. They never happened.\nAll of them happened months ago. Last fall. When was the last “rape and death threat”, Cat?\nGamerGate is an active group that consists of tens of thousands of\nindividuals. Many of them are professional game developers like me. What has #GamerGate been doing for the last six months if there have only been a small handful of supposed\nthreats last fall, most of them of dubious legitimacy?\nA number of game journalists, some of them influential, have lost\ntheir jobs. Joystiq closed. Gawker lost over a million dollars in ad\nrevenue and “reassigned’ two of its top people. Do you think this is due\nto “rape and death threats”? Or serious problems concerning “ethics in\njournalism”?\nSeveral game journalism sites have adopted ethics guidelines. Do you\nthink this just might have something to do with a little ethical problem\nin gaming journalism?\nI was the second nationally syndicated game journalist in the USA. I\nhave written for numerous leading game industry magazines, including Computer Gaming\nWorld, Electronic Entertainment, and Develop. And I can tell you, with\n100 percent certainty, that in 2014 there was a MASSIVE ethics problem\nin game journalism. And there still is. Any serious game developer will readily\ntell you as much.\nWhat are your game industry credentials? What are your game\njournalism credentials? What do you know about it beyond watching\nCSI\nLaw and Order:\nSVU?",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-23T10:24:00+00:00"
}