{
  "url": "https://voxday.net/2015/02/06/the-invisible-voxemor/",
  "scraped_at": "2025-12-16T12:44:29.290418",
  "title": "The invisible Voxemort",
  "date_display": "February 6, 2015",
  "date_iso": "2015-02-06T17:00:00+00:00",
  "date_from_url": "2015-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>McCreepy repeats his Very Important call for <a href=\"http://www.jimchines.com/2015/02/2015-call-for-guest-posts/\">guest blogs about representation</a> in science fiction and fantasy:</p><blockquote class=\"tr_bq\"><p> Last year, I posted an open call for guest blogs about representation in science fiction and fantasy. The resulting essays were, in my opinion, both important and powerful. I was hopeful when I first put out that call, but the stories people chose to share exceeded my expectations in so many ways.</p><p>So I’m doing it again. Because, to quote from last year’s call, “it’s one thing for me to talk about this stuff. But let’s face it, it’s not exactly difficult for me to find characters like me in books, TV, movies, advertising, video games, etc. And there’s a painful irony when conversations about representation end up spotlighting some guy who’s part of the most overrepresented group in the country.”</p><p>Once again, I’ll be looking for personal, first-hand stories between 400 and 1000 words, talking about what it’s like to not see yourself in stories, or to see yourself misrepresented, or the first time you found a character you could really relate to and what that meant, and so on.</p></blockquote><p>I have to admit, reading those personal first-hand stories did make a real difference to me. I had previously had some respect for Katherine Kerr. But after reading <a href=\"http://www.jimchines.com/2014/02/boys-books-katharine-kerr/\">her stupid self-pity party</a>, I have lost all interest in ever reading any more of her books.<br> <i><br/></i><br> <i>“At 16, confused and vulnerable, I gave it all up. I took no more “hard”<br> science courses. I left the math classes to the boys, just like the boys<br> wanted.”</br></br></i></br></br></p><p>Yes, because as we’ve all learned, the ideal way to make sure people are able to accomplish difficult things is by making it easier for them. That’s why the Navy SEAL program is going to replace 24-weeks of Basic Underwater Demolition/SEAL (BUD/S)<br> school, a parachute course and the 26-week SEAL<br> Qualification Training program.with handing out ice cream cones and lollipops.</br></br></p><p>What I found very hurtful as a Native American was that Jim Hines didn’t feature any stories about my people. I will pen a personal and first-hand story about how terribly hard it was for me growing up Indian (feather, not dot) in a land full of pretty, blonde Scandinavian girls who had settled upon the ancestral lands of my tribal cousins, and I trust Mr. Hines will help the healing begin by including it in <i>Invisible 2</i>.</p><p>Meanwhile, speaking of McCreepy, this was amusing.</p><blockquote class=\"tr_bq\"><p> P.T. Barnumium #1041 ‏@PTBarnumium<br>@voxday are you Voldemort or something? Entire McCreepy thread where they’re contorting like maniacs to not mention you by name</br></p></blockquote></div>",
  "content_text": "McCreepy repeats his Very Important call for\nguest blogs about representation\nin science fiction and fantasy:\nLast year, I posted an open call for guest blogs about representation in science fiction and fantasy. The resulting essays were, in my opinion, both important and powerful. I was hopeful when I first put out that call, but the stories people chose to share exceeded my expectations in so many ways.\nSo I’m doing it again. Because, to quote from last year’s call, “it’s one thing for me to talk about this stuff. But let’s face it, it’s not exactly difficult for me to find characters like me in books, TV, movies, advertising, video games, etc. And there’s a painful irony when conversations about representation end up spotlighting some guy who’s part of the most overrepresented group in the country.”\nOnce again, I’ll be looking for personal, first-hand stories between 400 and 1000 words, talking about what it’s like to not see yourself in stories, or to see yourself misrepresented, or the first time you found a character you could really relate to and what that meant, and so on.\nI have to admit, reading those personal first-hand stories did make a real difference to me. I had previously had some respect for Katherine Kerr. But after reading\nher stupid self-pity party\n, I have lost all interest in ever reading any more of her books.\n“At 16, confused and vulnerable, I gave it all up. I took no more “hard”\nscience courses. I left the math classes to the boys, just like the boys\nwanted.”\nYes, because as we’ve all learned, the ideal way to make sure people are able to accomplish difficult things is by making it easier for them. That’s why the Navy SEAL program is going to replace 24-weeks of Basic Underwater Demolition/SEAL (BUD/S)\nschool, a parachute course and the 26-week SEAL\nQualification Training program.with handing out ice cream cones and lollipops.\nWhat I found very hurtful as a Native American was that Jim Hines didn’t feature any stories about my people. I will pen a personal and first-hand story about how terribly hard it was for me growing up Indian (feather, not dot) in a land full of pretty, blonde Scandinavian girls who had settled upon the ancestral lands of my tribal cousins, and I trust Mr. Hines will help the healing begin by including it in\nInvisible 2\n.\nMeanwhile, speaking of McCreepy, this was amusing.\nP.T. Barnumium #1041 ‏@PTBarnumium\n@voxday are you Voldemort or something? Entire McCreepy thread where they’re contorting like maniacs to not mention you by name",
  "tags": [
    "books",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-06T17:00:00+00:00"
}