{
  "url": "https://voxday.net/2015/02/01/the-divide-by-zero-lef/",
  "scraped_at": "2025-12-16T12:43:50.787139",
  "title": "The Divide-by-Zero Left",
  "date_display": "February 1, 2015",
  "date_iso": "2015-02-01T10:41:00+00:00",
  "date_from_url": "2015-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright observes how <a href=\"http://www.scifiwright.com/2015/02/dinosaur-sized-bigotry\">the other side has transformed</a> over the course of his lifetime:</p><blockquote class=\"tr_bq\"><p> Something rotten, very rotten has happened to the Left just in my lifetime. They used to be champions of free speech; and now they are its most vehement opponents.</p><p>They use to be able to give some sort of argument or logical reason<br> for their position, even if an incorrect argument; now they have no<br> argument, none of them, aside from wild and insincere accusations<br> delivered in a mechanical fashion without any hope of being believed,<br> phony as a three-dollar bill.</br></br></br></br></p><p>They used to be firmly on the side of the workingman; now they hate the workingman as a white racist oppressor.</p><p>They used to be in favor of free love and the sexual liberation; now<br> they object to rocket scientists wearing shirts with cartoon women<br> printed on them, they object to science fiction magazines showing a<br> scantily clad warrior princess slaying a monster, and they call all sex<br> rape, and demand strict segregation of women and men. On the same day as<br> these protests, they appear in front of the Pope, writhing on the<br> ground naked with crosses and crucifixes inserted into their vaginas. So<br> the Puritan rules apply arbitrarily, without sense or order, to anyone<br> or no one.</br></br></br></br></br></br></br></br></p><p>They used to be in favor of Blacks and other minorities; now their<br> disgust for all the impoverished and dispossessed is plain to see. All<br> they want is to keep the Blacks on the plantation, addicted to welfare,<br> addicted to crack, their children aborted, their parents unwed.</br></br></br></p><p>They used to be in favor of the Jews, and other minorities; now they<br> kneel to Islamic Jihad at every opportunity, vowing that those who<br> slander the prophet of Islam will no be in the future, and ergo the Left<br> now curse the Jews, and pray daily for the destruction of Israel, and a<br> new Holocaust in the warhead of a Muslim nuke.</br></br></br></br></p><p>What? You say that his the not what the Left says? That they say they<br> are creatures of purity, goodness, and sweetness, who live only to help<br> others out of the depth of their hearts and the depth of your wallet?<br> No, that was the old Left, back when the Left still had some scraps of<br> sanity and intelligence.</br></br></br></br></p><p>They serve Sauron and have forgotten their own names.</p><p>They do not say what they are, because, if you listen to them, they<br> say that words mean nothing, that truth is relative, that all<br> civilizations are no better than savagery, that no religion is better<br> than another, and that anything which is not illegal is allowed.  So of<br> course they say they are perfect angels: because the word has no meaning<br> to them, no words have meaning, and telling the truth is not correct.<br> Only political correctness is correct.</br></br></br></br></br></br></p><p>Now they have gone fullbore barking moonbat mouthfoaming evil.</p></blockquote><p>To summarize: the answer to the question “is the Left evil or stupid?” is “yes”. The truth is what we always expected: they never held the values they professed. They were charlatans; they never had any intention of fighting for free speech with which they disagreed, they never gave a damn about blacks, Jews, homosexuals, immigrants, or science.</p><p>All those things were to them were tools. All those things were was a means of attacking that which they hate and want to destroy, Christian civilization in the West. They are literally nothing, they stand for nothing, they seek only to destroy and they have absolutely no more conception of what will come after the fall of Western civilization than Karl Marx did the Worker’s Paradise.</p><p>It is not possible to compromise with them because there is no middle ground on which to meet them. It is like trying to divide by zero. It’s not merely undesirable, it can’t be done. Their principles and their objectives are a constantly moving target, always pushing the outer limits, stretching them out further.</p><p>Reject them. Don’t seek their approval or try to reason with them or hope to win them over through dialectic and discourse. Their sickness is not of the mind, but of the soul.</p></div>",
  "content_text": "John C. Wright observes how\nthe other side has transformed\nover the course of his lifetime:\nSomething rotten, very rotten has happened to the Left just in my lifetime. They used to be champions of free speech; and now they are its most vehement opponents.\nThey use to be able to give some sort of argument or logical reason\nfor their position, even if an incorrect argument; now they have no\nargument, none of them, aside from wild and insincere accusations\ndelivered in a mechanical fashion without any hope of being believed,\nphony as a three-dollar bill.\nThey used to be firmly on the side of the workingman; now they hate the workingman as a white racist oppressor.\nThey used to be in favor of free love and the sexual liberation; now\nthey object to rocket scientists wearing shirts with cartoon women\nprinted on them, they object to science fiction magazines showing a\nscantily clad warrior princess slaying a monster, and they call all sex\nrape, and demand strict segregation of women and men. On the same day as\nthese protests, they appear in front of the Pope, writhing on the\nground naked with crosses and crucifixes inserted into their vaginas. So\nthe Puritan rules apply arbitrarily, without sense or order, to anyone\nor no one.\nThey used to be in favor of Blacks and other minorities; now their\ndisgust for all the impoverished and dispossessed is plain to see. All\nthey want is to keep the Blacks on the plantation, addicted to welfare,\naddicted to crack, their children aborted, their parents unwed.\nThey used to be in favor of the Jews, and other minorities; now they\nkneel to Islamic Jihad at every opportunity, vowing that those who\nslander the prophet of Islam will no be in the future, and ergo the Left\nnow curse the Jews, and pray daily for the destruction of Israel, and a\nnew Holocaust in the warhead of a Muslim nuke.\nWhat? You say that his the not what the Left says? That they say they\nare creatures of purity, goodness, and sweetness, who live only to help\nothers out of the depth of their hearts and the depth of your wallet?\nNo, that was the old Left, back when the Left still had some scraps of\nsanity and intelligence.\nThey serve Sauron and have forgotten their own names.\nThey do not say what they are, because, if you listen to them, they\nsay that words mean nothing, that truth is relative, that all\ncivilizations are no better than savagery, that no religion is better\nthan another, and that anything which is not illegal is allowed.  So of\ncourse they say they are perfect angels: because the word has no meaning\nto them, no words have meaning, and telling the truth is not correct.\nOnly political correctness is correct.\nNow they have gone fullbore barking moonbat mouthfoaming evil.\nTo summarize: the answer to the question “is the Left evil or stupid?” is “yes”. The truth is what we always expected: they never held the values they professed. They were charlatans; they never had any intention of fighting for free speech with which they disagreed, they never gave a damn about blacks, Jews, homosexuals, immigrants, or science.\nAll those things were to them were tools. All those things were was a means of attacking that which they hate and want to destroy, Christian civilization in the West. They are literally nothing, they stand for nothing, they seek only to destroy and they have absolutely no more conception of what will come after the fall of Western civilization than Karl Marx did the Worker’s Paradise.\nIt is not possible to compromise with them because there is no middle ground on which to meet them. It is like trying to divide by zero. It’s not merely undesirable, it can’t be done. Their principles and their objectives are a constantly moving target, always pushing the outer limits, stretching them out further.\nReject them. Don’t seek their approval or try to reason with them or hope to win them over through dialectic and discourse. Their sickness is not of the mind, but of the soul.",
  "tags": [
    "Christianity",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-01T10:41:00+00:00"
}