{
  "url": "https://voxday.net/2015/02/20/the-neanderthal-theory-of-intelligence/",
  "scraped_at": "2025-12-16T12:46:04.644394",
  "title": "The Neanderthal theory of intelligence",
  "date_display": "February 20, 2015",
  "date_iso": "2015-02-20T17:00:00+00:00",
  "date_from_url": "2015-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s going to become very, very hard to dismiss the genetic basis for intelligence, or its implications for racial policies, if it is eventually determined that average intelligence is essentially a proxy for a population group’s <a href=\"http://www.nytimes.com/2015/02/20/science/a-new-theory-on-how-neanderthal-dna-spread-in-asia.html?_r=2\">greater or lesser amount of Neanderthal DNA</a>:</p><blockquote class=\"tr_bq\"><p> Researchers also have found a peculiar pattern in non-Africans: People in China, Japan and other East Asian countries have about 20 percent more Neanderthal DNA than do Europeans.</p><p>Last year, Sriram Sankararaman, a postdoctoral researcher at Harvard Medical School, and his colleagues proposed that natural selection was responsible for the difference. Most Neanderthal genes probably had modestly bad effects on the health of our ancestors, Dr. Sankararaman and other researchers have found. People who inherited a Neanderthal version of any given gene would have had fewer children on average than people with the human version.</p><p>As a result, Neanderthal DNA became progressively rarer in living humans. Dr. Sankararaman and his colleagues proposed that it disappeared faster in Europeans than in Asians. The early Asian population was small, the researchers suggested, and natural selection eliminates harmful genes more slowly in small groups than in large populations. Today, smaller ethnic groups, like Ashkenazi Jews and the Amish, can have unusually high rates of certain genetic disorders.</p><p>Joshua M. Akey, a geneticist at the University of Washington, and the graduate student Benjamin Vernot recently set out to test this hypothesis. They took advantage of the fact that only some parts of our genome have a strong influence on health. Other parts — so-called neutral regions — are less important.</p><p>A mutation in a neutral region won’t affect our odds of having children and therefore won’t be eliminated by natural selection. If Dr. Sankararaman’s hypothesis were correct, you would expect Europeans to have lost more harmful Neanderthal DNA than neutral DNA. In fact, the scientists did not find this difference in the DNA of living Europeans.</p><p>Dr. Akey and Mr. Vernot then tested out other possible explanations for the comparative abundance of Neanderthal DNA in Asians. The theory that made the most sense was that Asians inherited additional Neanderthal DNA at a later time.</p><p>In this scenario, the ancestors of Asians and Europeans split, the early Asians migrated east, and there they had a second encounter with Neanderthals. Dr. Akey and Mr. Vernot reported their findings in the American Journal of Human Genetics.</p></blockquote><p>We shouldn’t get too carried away with a scientific hypothesis that merely happens to be in line with some computer modeling; if I was inclined to that sort of thing I’d be deeply concerned about global warming. But it is a little ominous; those who think that the third world invasion of the West is harmless should keep in mind the lesson of the Neanderthals. They may have been smarter, but they’re not around anymore and <i>Homo sapiens sapiens </i>is.</p><p>For all we know, there were once Neanderthals who claimed any Neanderthal who thought those nice Homo Sapiens who moved into the cave next door would be a problem were sub-speciesist, and besides, weren’t their spiced triceratops eggs ever so tasty?</p></div>",
  "content_text": "It’s going to become very, very hard to dismiss the genetic basis for intelligence, or its implications for racial policies, if it is eventually determined that average intelligence is essentially a proxy for a population group’s\ngreater or lesser amount of Neanderthal DNA\n:\nResearchers also have found a peculiar pattern in non-Africans: People in China, Japan and other East Asian countries have about 20 percent more Neanderthal DNA than do Europeans.\nLast year, Sriram Sankararaman, a postdoctoral researcher at Harvard Medical School, and his colleagues proposed that natural selection was responsible for the difference. Most Neanderthal genes probably had modestly bad effects on the health of our ancestors, Dr. Sankararaman and other researchers have found. People who inherited a Neanderthal version of any given gene would have had fewer children on average than people with the human version.\nAs a result, Neanderthal DNA became progressively rarer in living humans. Dr. Sankararaman and his colleagues proposed that it disappeared faster in Europeans than in Asians. The early Asian population was small, the researchers suggested, and natural selection eliminates harmful genes more slowly in small groups than in large populations. Today, smaller ethnic groups, like Ashkenazi Jews and the Amish, can have unusually high rates of certain genetic disorders.\nJoshua M. Akey, a geneticist at the University of Washington, and the graduate student Benjamin Vernot recently set out to test this hypothesis. They took advantage of the fact that only some parts of our genome have a strong influence on health. Other parts — so-called neutral regions — are less important.\nA mutation in a neutral region won’t affect our odds of having children and therefore won’t be eliminated by natural selection. If Dr. Sankararaman’s hypothesis were correct, you would expect Europeans to have lost more harmful Neanderthal DNA than neutral DNA. In fact, the scientists did not find this difference in the DNA of living Europeans.\nDr. Akey and Mr. Vernot then tested out other possible explanations for the comparative abundance of Neanderthal DNA in Asians. The theory that made the most sense was that Asians inherited additional Neanderthal DNA at a later time.\nIn this scenario, the ancestors of Asians and Europeans split, the early Asians migrated east, and there they had a second encounter with Neanderthals. Dr. Akey and Mr. Vernot reported their findings in the American Journal of Human Genetics.\nWe shouldn’t get too carried away with a scientific hypothesis that merely happens to be in line with some computer modeling; if I was inclined to that sort of thing I’d be deeply concerned about global warming. But it is a little ominous; those who think that the third world invasion of the West is harmless should keep in mind the lesson of the Neanderthals. They may have been smarter, but they’re not around anymore and\nHomo sapiens sapiens\nis.\nFor all we know, there were once Neanderthals who claimed any Neanderthal who thought those nice Homo Sapiens who moved into the cave next door would be a problem were sub-speciesist, and besides, weren’t their spiced triceratops eggs ever so tasty?",
  "tags": [
    "immigration",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-20T17:00:00+00:00"
}