{
  "url": "https://voxday.net/2015/02/13/they-really-are-that-arrogan/",
  "scraped_at": "2025-12-16T12:45:14.771150",
  "title": "They really are THAT arrogant",
  "date_display": "February 13, 2015",
  "date_iso": "2015-02-13T21:00:00+00:00",
  "date_from_url": "2015-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think I’ll be working with Hollywood <a href=\"http://fusion.net/story/45449/boy-next-door-screenwriter-that-cringe-y-first-edition-iliad-scene-is-the-producers-fault-not-mine/\">anytime soon</a>:</p><blockquote class=\"tr_bq\"><p> We’re not gonna lie, after watching the cringe-worthy “Iliad” scene from J.Lo’s new movie “The Boy Next Door” we wept for humanity a bit. Then, like the rest of the world we wondered “How the heck did this happen? Is Hollywood really that stupid?”</p><p>In case you missed it, the awful scene shows J.Lo’s hunky love interest / psychotic neighbor giving her a “first edition” copy of Homer’s The Iliad. You know, that epic 3,000-year-old-ish poem he wrote. The one in which the oldest version, called the Venetus A, dates back to the 10th century? Yeah. The “first edition” seen in the movie is clearly not 3,000 years old.</p><p>We just couldn’t let it go (seriously, <i>The Iliad</i>? Pick ANY<br> other book), so we contacted the screenwriter, Barbara Curry, a former<br> Assistant U.S. Attorney, and asked her point blank: “WTF happened?”</br></br></p><p>Turns out <i>writers </i>aren’t that dumb. But Hollywood producers are.</p><p>“Much of my original script was rewritten by the producers and the<br> director.  I was not given the opportunity to participate in the<br> production of this movie,” Curry told Fusion. “As for the first edition<br> ‘Iliad’ reference in the movie, that was not something I wrote in my<br> original script,” she says.</br></br></br></br></p></blockquote><p>As a publisher of other folks novels, I will have a responsibility to be polite if options of those novels are pursued. But if anyone EXCEPT the guys who produce <i>A Game of Thrones</i> contacts me again about my own books, I am going to tell them, as before, the answer is no. And if they make the mistake of asking me why, I I will absolutely tell them that I have zero interest in working with retards with no respect for the Western canon.</p><p>I watched a documentary on a day in the production of <i>A Game of Thrones </i>and it confirmed for me that I prefer the game industry. There is a LOT of carpentry involved, among other things; it is insane how many people and moving parts are required in order to produce a show of that quality. And then to think how readily they will throw all that sort of effort away because some arrogant executive philistine is uneducated really boggles the mind</p></div>",
  "content_text": "I don’t think I’ll be working with Hollywood\nanytime soon\n:\nWe’re not gonna lie, after watching the cringe-worthy “Iliad” scene from J.Lo’s new movie “The Boy Next Door” we wept for humanity a bit. Then, like the rest of the world we wondered “How the heck did this happen? Is Hollywood really that stupid?”\nIn case you missed it, the awful scene shows J.Lo’s hunky love interest / psychotic neighbor giving her a “first edition” copy of Homer’s The Iliad. You know, that epic 3,000-year-old-ish poem he wrote. The one in which the oldest version, called the Venetus A, dates back to the 10th century? Yeah. The “first edition” seen in the movie is clearly not 3,000 years old.\nWe just couldn’t let it go (seriously,\nThe Iliad\n? Pick ANY\nother book), so we contacted the screenwriter, Barbara Curry, a former\nAssistant U.S. Attorney, and asked her point blank: “WTF happened?”\nTurns out\nwriters\naren’t that dumb. But Hollywood producers are.\n“Much of my original script was rewritten by the producers and the\ndirector.  I was not given the opportunity to participate in the\nproduction of this movie,” Curry told Fusion. “As for the first edition\n‘Iliad’ reference in the movie, that was not something I wrote in my\noriginal script,” she says.\nAs a publisher of other folks novels, I will have a responsibility to be polite if options of those novels are pursued. But if anyone EXCEPT the guys who produce\nA Game of Thrones\ncontacts me again about my own books, I am going to tell them, as before, the answer is no. And if they make the mistake of asking me why, I I will absolutely tell them that I have zero interest in working with retards with no respect for the Western canon.\nI watched a documentary on a day in the production of\nA Game of Thrones\nand it confirmed for me that I prefer the game industry. There is a LOT of carpentry involved, among other things; it is insane how many people and moving parts are required in order to produce a show of that quality. And then to think how readily they will throw all that sort of effort away because some arrogant executive philistine is uneducated really boggles the mind",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-13T21:00:00+00:00"
}