{
  "url": "https://voxday.net/2015/02/24/you-had-one-job-2/",
  "scraped_at": "2025-12-16T12:46:28.230673",
  "title": "You had ONE job!",
  "date_display": "February 24, 2015",
  "date_iso": "2015-02-24T17:00:00+00:00",
  "date_from_url": "2015-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Far too many women of my generation were let down by their mothers failing to teach them <a href=\"http://www.pastemagazine.com/articles/2015/02/did-learning-to-cook-make-me-a-bad-feminist.html\">the one basic skill they actually need</a> in life:</p><blockquote class=\"tr_bq\"><p> My mother hadn’t felt the need to give me a recipe—she knew that I<br> had watched her, and before her my Nani, make the same pot of sauce<br> nearly weekly in my previous 17 years. So many times I smelled the meat,<br> browning in olive oil before the garlic and onions were added,<br> intensifying the distinctive aroma of Nani’s kitchen, which lingered<br> even years after her last pot had been simmered. Yet I didn’t know how<br> to cook.</br></br></br></br></br></br></p><p>But what did my mom expect? Both she and my late Nani had always<br> praised and encouraged my good grades and scholarly instincts, and<br> neither had encouraged me to do anything in the kitchen other that set<br> the table. Nani never taught me to forage for burdock or can tomatoes<br> because “you won’t need to,” she said. Cooking was something else the<br> modern young woman wouldn’t have cause to do either, it seemed. So, I<br> focused on my career.</br></br></br></br></br></br></p><p>What had stuck with me from those hours in the kitchen watching my<br> mom and Nani cook weekly Sunday dinners or nightly from-scratch meals<br> was not the recipes for beef bracciole or manicotti, but the<br> conversation. “Go to college,” I was always told, “have your own money<br> and don’t rely on a man.”</br></br></br></br></p></blockquote><p>Let’s not make the same mistake with our daughters and sentence them to a lifetime of bad food, obesity, and <a href=\"https://dalrock.wordpress.com/2015/02/24/culinary-frigidity/\">culinary frigidity</a>. There is nothing more important than for a young girl to be taught how to be a good wife and mother. Nothing. Because nothing less than civilization and the continued existence of the human race depends upon it.</p><p>Don’t raise your daughters to be dead ends.</p></div>",
  "content_text": "Far too many women of my generation were let down by their mothers failing to teach them\nthe one basic skill they actually need\nin life:\nMy mother hadn’t felt the need to give me a recipe—she knew that I\nhad watched her, and before her my Nani, make the same pot of sauce\nnearly weekly in my previous 17 years. So many times I smelled the meat,\nbrowning in olive oil before the garlic and onions were added,\nintensifying the distinctive aroma of Nani’s kitchen, which lingered\neven years after her last pot had been simmered. Yet I didn’t know how\nto cook.\nBut what did my mom expect? Both she and my late Nani had always\npraised and encouraged my good grades and scholarly instincts, and\nneither had encouraged me to do anything in the kitchen other that set\nthe table. Nani never taught me to forage for burdock or can tomatoes\nbecause “you won’t need to,” she said. Cooking was something else the\nmodern young woman wouldn’t have cause to do either, it seemed. So, I\nfocused on my career.\nWhat had stuck with me from those hours in the kitchen watching my\nmom and Nani cook weekly Sunday dinners or nightly from-scratch meals\nwas not the recipes for beef bracciole or manicotti, but the\nconversation. “Go to college,” I was always told, “have your own money\nand don’t rely on a man.”\nLet’s not make the same mistake with our daughters and sentence them to a lifetime of bad food, obesity, and\nculinary frigidity\n. There is nothing more important than for a young girl to be taught how to be a good wife and mother. Nothing. Because nothing less than civilization and the continued existence of the human race depends upon it.\nDon’t raise your daughters to be dead ends.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-02-24T17:00:00+00:00"
}