{
  "url": "https://voxday.net/2015/11/06/book-review-danger-play-essays-on/",
  "scraped_at": "2025-12-17T17:32:46.293294",
  "title": "Book Review: Danger & Play: Essays on Embracing Masculinity",
  "date_display": "November 6, 2015",
  "date_iso": "2015-11-06T16:00:00+00:00",
  "date_from_url": "2015-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://ecx.images-amazon.com/images/I/51UIkY0ZEfL._SX313_BO1,204,203,200_.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://ecx.images-amazon.com/images/I/51UIkY0ZEfL._SX313_BO1,204,203,200_.jpg\" width=\"252\"/></a></div><p>Mike Cernovich is an interesting man. He combines the energy and up-with-people positivity of a perma-smiling pro seminar presenter with a laid-back personality of a California surfer. He’s both a lawyer and ex-military, but it’s hard to detect even the smallest sign of either aspect of his background. I met him for the first time in Paris this summer, as we co-hosted the GGinParis event with Milo, who at the time was the common link between us. (One thing people often don’t realize about Milo is that he excels at putting people in touch with each other.) Mike and I hit it off right away; it didn’t hurt that his fiance Shauna also happened to hit it off well with Spacebunny. And while I was aware of his health-and-fitness thing – the man is not only big, but he is an inveterate walker as well – I hadn’t actually read <a href=\"http://www.dangerandplay.com/\">his blog</a>. And since I never listen to podcasts, I wasn’t familiar with his popular Danger &amp; Play podcast either.</p><p>But after having the chance to hang out with Mike and Shauna again in Spain, then reading Mike’s <i>Gorilla Mindset</i> and discovering the inspirational, if literally bone-chilling magic of the contrast shower, I was looking forward to reading his new book of essays, <a href=\"http://www.amazon.com/Danger-Play-Essays-Embracing-Masculinity-ebook/dp/B016QIBSLE\"><b><i>Danger &amp; Play: Essays on Embracing Masculinity</i></b></a>, which are largely taken from his blog posts. They were entirely new to me, and I was, frankly, surprised to discover that it was in many ways more directly relevant to me and my objectives than <i>Gorilla Mindset</i>. This makes sense, actually, since mindset has never been a problem or a challenge for me, whereas a number of the issues that Mike addresses in the new book have been one or the other.</p><p>In fact, I found myself repeatedly highlighting various passages in the book as I was reading it in the gym, including the following:</p><ul><li><i>If you’re a momentum type, your brashness and boldness creates opportunity but also leads to costly mistakes.</i></li><p><i><br> </br></i></p><li><i>Unless I bow down to the SJWs I will always be under attack. I’ll always be a “bad” person. Only the complete and total surrender of your soul will placate the SJWs who went after Matt Taylor. That’s not going to happen.</i></li><p><i><br> </br></i></p><li><i>Cast aside any aspirations of mainstream acceptance, unless you’re willing to crawl on your knees before Gawker.</i></li><p><i><br> </br></i></p><li><i>Making money ethically is a sure sign that you are delivering value and goodwill to the world.</i></li><p><i><br> </br></i></p><li><i>learn how to focus on vision rather than on what you’re afraid of.</i></li><p><i><br> </br></i></p><li><i>The little people, the flunkies, the peons: they are the ones that want to cut you down. The big guys, they respect the audacity.</i></li><p><i><br> </br></i></p><li><i>Think like no one else thinks by noticing what no one else notices.</i></li></ul><p>Now, one might be tempted to dismiss the book as a collection of cheerleading platitudes, except for the fact that the platitudes are the direct conclusions drawn from the experiences that Mike is recounting. He isn’t blithely quoting someone when he cites “Patton or some Prussian general” in advising audacity; he clearly doesn’t even know where the quote originates! Instead, and more importantly, he is summarizing what he learned from the various experiences recounted and what you can therefore apply to your own life.</p><p>(As it happens, the famous aphorism was coined by Georges Danton, the French revolutionary:<i> De l’audace, encore de l’audace, toujours de l’audace</i>. Mike was fortunate to avoid citing him as an example, however, considering that Danton was eventually beheaded by the Jacobins.)</p><p>Far from being a criticism, though, this is actually an example of the book’s fundamental strength. It is focused on deeds, not words, action, not reflection, practice, not plans. It doesn’t matter in the least who said what when, the point is that the reader needs to learn to be audacious in the way Patton and Rommel and Mike himself succeeded by being audacious. For those who are given to spending all their time planning, wishing, and dreaming instead of doing, this book should act as a direct shot of adrenaline.</p><p>Mike’s literary persona is not an intellectual one. It is, rather, that of a big brother, telling his little brother to stop being such a jackass, stop uselessly spinning his wheels, and do what big brother’s experience suggests will work for him instead. If self-help writers were NFL coaches, Mike Cernovich would be Bill Belichick. Do your job. Don’t worry about the other guy. Just focus and do your fucking job!</p><p>Which leads me to the one weakness of the book: the language. It’s not a book you would necessarily want to give to a young man under the age of 18. The saltiness and worldliness of the book is not inappropriate, nor is it particularly offensive by modern standards, but it does tend to preclude giving it to teenagers or putting it in your local school library. I didn’t hesitate to have my son read <i>Gorilla Mindset</i>, I would probably wait until he was 18 or 19 to have him read <a href=\"http://www.amazon.com/Danger-Play-Essays-Embracing-Masculinity-ebook/dp/B016QIBSLE\"><b><i>Danger &amp; Play: Essays on Embracing Masculinity</i></b></a>.<br> <i><b><br/></b></i><br> Nevertheless, I will definitely have him read it when the time comes because the lessons it contains are that important. I firmly believe that if I had read it at 18, I would have avoided several significant mistakes, including the single biggest one of my life, which was not dropping out of college after my third semester there. Because if there is one lesson the reader learns from the book, it is that doing things simply because everyone else does them that way is the most certain path to mediocrity, frustration, and failure.</br></br></p></div>",
  "content_text": "Mike Cernovich is an interesting man. He combines the energy and up-with-people positivity of a perma-smiling pro seminar presenter with a laid-back personality of a California surfer. He’s both a lawyer and ex-military, but it’s hard to detect even the smallest sign of either aspect of his background. I met him for the first time in Paris this summer, as we co-hosted the GGinParis event with Milo, who at the time was the common link between us. (One thing people often don’t realize about Milo is that he excels at putting people in touch with each other.) Mike and I hit it off right away; it didn’t hurt that his fiance Shauna also happened to hit it off well with Spacebunny. And while I was aware of his health-and-fitness thing – the man is not only big, but he is an inveterate walker as well – I hadn’t actually read\nhis blog\n. And since I never listen to podcasts, I wasn’t familiar with his popular Danger & Play podcast either.\nBut after having the chance to hang out with Mike and Shauna again in Spain, then reading Mike’s\nGorilla Mindset\nand discovering the inspirational, if literally bone-chilling magic of the contrast shower, I was looking forward to reading his new book of essays,\nDanger & Play: Essays on Embracing Masculinity\n, which are largely taken from his blog posts. They were entirely new to me, and I was, frankly, surprised to discover that it was in many ways more directly relevant to me and my objectives than\nGorilla Mindset\n. This makes sense, actually, since mindset has never been a problem or a challenge for me, whereas a number of the issues that Mike addresses in the new book have been one or the other.\nIn fact, I found myself repeatedly highlighting various passages in the book as I was reading it in the gym, including the following:\nIf you’re a momentum type, your brashness and boldness creates opportunity but also leads to costly mistakes.\nUnless I bow down to the SJWs I will always be under attack. I’ll always be a “bad” person. Only the complete and total surrender of your soul will placate the SJWs who went after Matt Taylor. That’s not going to happen.\nCast aside any aspirations of mainstream acceptance, unless you’re willing to crawl on your knees before Gawker.\nMaking money ethically is a sure sign that you are delivering value and goodwill to the world.\nlearn how to focus on vision rather than on what you’re afraid of.\nThe little people, the flunkies, the peons: they are the ones that want to cut you down. The big guys, they respect the audacity.\nThink like no one else thinks by noticing what no one else notices.\nNow, one might be tempted to dismiss the book as a collection of cheerleading platitudes, except for the fact that the platitudes are the direct conclusions drawn from the experiences that Mike is recounting. He isn’t blithely quoting someone when he cites “Patton or some Prussian general” in advising audacity; he clearly doesn’t even know where the quote originates! Instead, and more importantly, he is summarizing what he learned from the various experiences recounted and what you can therefore apply to your own life.\n(As it happens, the famous aphorism was coined by Georges Danton, the French revolutionary:\nDe l’audace, encore de l’audace, toujours de l’audace\n. Mike was fortunate to avoid citing him as an example, however, considering that Danton was eventually beheaded by the Jacobins.)\nFar from being a criticism, though, this is actually an example of the book’s fundamental strength. It is focused on deeds, not words, action, not reflection, practice, not plans. It doesn’t matter in the least who said what when, the point is that the reader needs to learn to be audacious in the way Patton and Rommel and Mike himself succeeded by being audacious. For those who are given to spending all their time planning, wishing, and dreaming instead of doing, this book should act as a direct shot of adrenaline.\nMike’s literary persona is not an intellectual one. It is, rather, that of a big brother, telling his little brother to stop being such a jackass, stop uselessly spinning his wheels, and do what big brother’s experience suggests will work for him instead. If self-help writers were NFL coaches, Mike Cernovich would be Bill Belichick. Do your job. Don’t worry about the other guy. Just focus and do your fucking job!\nWhich leads me to the one weakness of the book: the language. It’s not a book you would necessarily want to give to a young man under the age of 18. The saltiness and worldliness of the book is not inappropriate, nor is it particularly offensive by modern standards, but it does tend to preclude giving it to teenagers or putting it in your local school library. I didn’t hesitate to have my son read\nGorilla Mindset\n, I would probably wait until he was 18 or 19 to have him read\nDanger & Play: Essays on Embracing Masculinity\n.\nNevertheless, I will definitely have him read it when the time comes because the lessons it contains are that important. I firmly believe that if I had read it at 18, I would have avoided several significant mistakes, including the single biggest one of my life, which was not dropping out of college after my third semester there. Because if there is one lesson the reader learns from the book, it is that doing things simply because everyone else does them that way is the most certain path to mediocrity, frustration, and failure.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-06T16:00:00+00:00"
}