{
  "url": "https://voxday.net/2015/11/05/brainstorm-with-derek-smar/",
  "scraped_at": "2025-12-17T17:32:41.776687",
  "title": "Brainstorm with Derek Smart",
  "date_display": "November 5, 2015",
  "date_iso": "2015-11-05T20:56:00+00:00",
  "date_from_url": "2015-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As part of the ongoing efforts to provide this blog community, and the Brainstorm members, with added value, I am hosting an impromptu Brainstorm event featuring Derek Smart, the veteran game developer and <i>Star Citizen</i> skeptic.</p><p>We will be discussing what caused him to go from project backer to public critic, his own development history, including the notorious <i>Battlecruiser 3000 AD</i>, and his latest game, <i>Line of Defense Tactics</i>, on Saturday, November 7th, at 7 PM EST. I’ll also be asking him about some of <a href=\"http://www.dereksmart.org/2015/11/interstellar-pirates/\">the controversial statements he has recently made</a> concerning Chris Robert’s record-setting development project. You can <a href=\"https://attendee.gotowebinar.com/register/1400150363015143170\">register for the event here</a>.</p><p>In addition to being entertaining and informative, this should also provide those interested in the upcoming <a href=\"http://www.castaliahouse.com/downloads/game-development-course/\">DevGame course</a> with some idea of what the guest speaker aspects of the course will entail, as well as the nature of the Q&amp;A sessions.</p></div>",
  "content_text": "As part of the ongoing efforts to provide this blog community, and the Brainstorm members, with added value, I am hosting an impromptu Brainstorm event featuring Derek Smart, the veteran game developer and\nStar Citizen\nskeptic.\nWe will be discussing what caused him to go from project backer to public critic, his own development history, including the notorious\nBattlecruiser 3000 AD\n, and his latest game,\nLine of Defense Tactics\n, on Saturday, November 7th, at 7 PM EST. I’ll also be asking him about some of\nthe controversial statements he has recently made\nconcerning Chris Robert’s record-setting development project. You can\nregister for the event here\n.\nIn addition to being entertaining and informative, this should also provide those interested in the upcoming\nDevGame course\nwith some idea of what the guest speaker aspects of the course will entail, as well as the nature of the Q&A sessions.",
  "tags": [
    "Brainstorm",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-05T20:56:00+00:00"
}