{
  "url": "https://voxday.net/2015/11/27/counter-currents-interview/",
  "scraped_at": "2025-12-17T17:35:28.846590",
  "title": "Counter-Currents interview",
  "date_display": "November 27, 2015",
  "date_iso": "2015-11-27T09:01:00+00:00",
  "date_from_url": "2015-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A transcript of <a href=\"http://www.counter-currents.com/2015/11/greg-johnson-interviews-vox-day-2/\">my interview with Greg Johnson</a> of Counter-Currents:</p><blockquote class=\"tr_bq\"><p> GJ: <i>How would you describe your political philosophy and who are some of the intellectual influences on its formation?</i></p><p>VD: I would describe myself as a Christian Western Civilizationist. I’ve been a libertarian for a long time. I was briefly even a card-carrying libertarian. But I was always more of a small L libertarian rather than a capital L one. Mostly because there were certain amounts of libertarian dogma that didn’t quite work out in the real world. Then as time went on it became readily apparent to me as I traveled around the world, as I lived in different countries, as I learned different languages, it became apparent to me that the abstract ideals that we often tend to follow in America in particular are not really relevant to most of the world.</p><p>I was being interviewed by a reporter from <i>Le Monde</i> in Paris about two months ago and he had absolutely no idea how to even describe the concept of libertarian to his readers. That’s in France, which is at least Western civilization and so forth. Trying to have a conversation about that sort of concept in Japan or China is just totally meaningless. So, that’s when I really became more cognizant of the importance of the nationalist element.</p><p>I think that just as Stalin found it necessary to modify international socialism for the Russians and just as Mao found it necessary to modify international socialism for the Chinese, it’s necessary for every other ideology to also understand that there are nationalistic, tribalistic limits to the abstract application of those ideologies.</p><p>GJ: <i>That’s interesting. I’m an ex-libertarian myself. I was not a card-carrying libertarian, but I subscribed to </i>Reason <i>magazine and read lots of Ayn Rand and Hayek and Mises mostly when I was an undergraduate. There were things that led me away from that.</i></p><p>Two books in particular. First, I read Thomas Sowell’s A Conflict of Visions<i> and the other was Céline’s </i>Journey to the End of the Night<i>, which basically destroyed my liberal optimism about humanity.</i></p><p>What are some of the things that you think don’t work about libertarianism? You said that some of the abstract libertarian dogmas just don’t work, so specifically what are those?</p><p>VD: Well, the most important one, as we are now seeing, is the free movement of peoples. What really changed my thinking and it was a process, you know, it wasn’t an immediate thing, although it was a fairly quick process now that I think about it . . . I grew up on Milton Friedman. My father had me reading <i>Free to Choose</i> when I was fairly young, and so I was a big free trade dogmatist and around the time of NAFTA and all that sort of thing I could recognize some of the problems but I bought into the line that the problem is that it’s not real free trade. It’s a free trade agreement, but it’s not real free trade.</p><p>Then I read a really good book by Ian Fletcher, and he directly addressed the concept of Ricardo’s comparative advantage, and he really destroyed it. I think he had something like seven major problems with it, and that got me interested, so I started looking into it. I’m very fortunate in that I have a pretty active and intelligent blog readership and they really like to engage and they have absolutely no respect for me so they’re quite happy to argue with me.</p><p>Most of them were free-traders as well so we ended up having an on-going two or three week debate about free trade, and it got pretty detailed to the extent that I went through Henry Hazlitt’s entire chapter on free trade just to look at it critically rather than just reading through it and accepting it. Just looking at the arguments. I found that the free trade arguments were just full of holes. Not just Ricardo’s, but also Hazlitt’s. That’s what got me realizing that Ricardo’s argument was totally dependent on the idea that capital could move but labor couldn’t and so what that got me thinking about was the fact that a libertarian society – even if we could convince everyone in the United States that libertarianism was the correct way to approach things – would rapidly be eliminated by the free movement of peoples as people from non-libertarian societies, people from cultures where they have absolutely no ideals that are in common with the Founding Fathers or with libertarian ideals, would rapidly be able to come in and end that libertarian society in much the same way that the Californians have gone into Colorado and completely changed the political climate there.</p><p>So, Ian Fletcher’s book is what really triggered that whole shift in thought process. Now I look at the concept of the free movement of peoples, free trade, and those sorts of concepts with a considerable amount of skepticism. Of course, in Europe we’re seeing some of those problems related to the idea of the free movement of peoples just as you see it in the States with the Central Americans coming across the border.</p></blockquote><p>Read the rest of it <a href=\"http://www.counter-currents.com/2015/11/greg-johnson-interviews-vox-day-2/\">there</a>. One factual update: the landmark Martin van Creveld essay mentioned will not be appearing in <i>Riding the Red Horse Vol. 2</i> since I made the mistake of showing it to Jerry Pournelle, who promptly stole it for <i>There Will Be War Vol. X</i>.</p></div>",
  "content_text": "A transcript of\nmy interview with Greg Johnson\nof Counter-Currents:\nGJ:\nHow would you describe your political philosophy and who are some of the intellectual influences on its formation?\nVD: I would describe myself as a Christian Western Civilizationist. I’ve been a libertarian for a long time. I was briefly even a card-carrying libertarian. But I was always more of a small L libertarian rather than a capital L one. Mostly because there were certain amounts of libertarian dogma that didn’t quite work out in the real world. Then as time went on it became readily apparent to me as I traveled around the world, as I lived in different countries, as I learned different languages, it became apparent to me that the abstract ideals that we often tend to follow in America in particular are not really relevant to most of the world.\nI was being interviewed by a reporter from\nLe Monde\nin Paris about two months ago and he had absolutely no idea how to even describe the concept of libertarian to his readers. That’s in France, which is at least Western civilization and so forth. Trying to have a conversation about that sort of concept in Japan or China is just totally meaningless. So, that’s when I really became more cognizant of the importance of the nationalist element.\nI think that just as Stalin found it necessary to modify international socialism for the Russians and just as Mao found it necessary to modify international socialism for the Chinese, it’s necessary for every other ideology to also understand that there are nationalistic, tribalistic limits to the abstract application of those ideologies.\nGJ:\nThat’s interesting. I’m an ex-libertarian myself. I was not a card-carrying libertarian, but I subscribed to\nReason\nmagazine and read lots of Ayn Rand and Hayek and Mises mostly when I was an undergraduate. There were things that led me away from that.\nTwo books in particular. First, I read Thomas Sowell’s\nA Conflict of Visions\nand the other was Céline’s\nJourney to the End of the Night\n, which basically destroyed my liberal optimism about humanity.\nWhat are some of the things that you think don’t work about libertarianism? You said that some of the abstract libertarian dogmas just don’t work, so specifically what are those?\nVD: Well, the most important one, as we are now seeing, is the free movement of peoples. What really changed my thinking and it was a process, you know, it wasn’t an immediate thing, although it was a fairly quick process now that I think about it . . . I grew up on Milton Friedman. My father had me reading\nFree to Choose\nwhen I was fairly young, and so I was a big free trade dogmatist and around the time of NAFTA and all that sort of thing I could recognize some of the problems but I bought into the line that the problem is that it’s not real free trade. It’s a free trade agreement, but it’s not real free trade.\nThen I read a really good book by Ian Fletcher, and he directly addressed the concept of Ricardo’s comparative advantage, and he really destroyed it. I think he had something like seven major problems with it, and that got me interested, so I started looking into it. I’m very fortunate in that I have a pretty active and intelligent blog readership and they really like to engage and they have absolutely no respect for me so they’re quite happy to argue with me.\nMost of them were free-traders as well so we ended up having an on-going two or three week debate about free trade, and it got pretty detailed to the extent that I went through Henry Hazlitt’s entire chapter on free trade just to look at it critically rather than just reading through it and accepting it. Just looking at the arguments. I found that the free trade arguments were just full of holes. Not just Ricardo’s, but also Hazlitt’s. That’s what got me realizing that Ricardo’s argument was totally dependent on the idea that capital could move but labor couldn’t and so what that got me thinking about was the fact that a libertarian society – even if we could convince everyone in the United States that libertarianism was the correct way to approach things – would rapidly be eliminated by the free movement of peoples as people from non-libertarian societies, people from cultures where they have absolutely no ideals that are in common with the Founding Fathers or with libertarian ideals, would rapidly be able to come in and end that libertarian society in much the same way that the Californians have gone into Colorado and completely changed the political climate there.\nSo, Ian Fletcher’s book is what really triggered that whole shift in thought process. Now I look at the concept of the free movement of peoples, free trade, and those sorts of concepts with a considerable amount of skepticism. Of course, in Europe we’re seeing some of those problems related to the idea of the free movement of peoples just as you see it in the States with the Central Americans coming across the border.\nRead the rest of it\nthere\n. One factual update: the landmark Martin van Creveld essay mentioned will not be appearing in\nRiding the Red Horse Vol. 2\nsince I made the mistake of showing it to Jerry Pournelle, who promptly stole it for\nThere Will Be War Vol. X\n.",
  "tags": [
    "free trade",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-27T09:01:00+00:00"
}