{
  "url": "https://voxday.net/2015/11/13/gop-establishment-prefers-clinton/",
  "scraped_at": "2025-12-17T17:33:35.956617",
  "title": "GOP Establishment prefers Clinton",
  "date_display": "November 13, 2015",
  "date_iso": "2015-11-13T07:24:00+00:00",
  "date_from_url": "2015-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This Washington Post article demonstrates that there is, in truth, but <a href=\"https://www.washingtonpost.com/politics/time-for-gop-panic-establishment-worried-carson-and-trump-might-win/2015/11/12/38ea88a6-895b-11e5-be8b-1ae2e4f50f76_story.html\">one bi-factional ruling party</a>:</p><blockquote class=\"tr_bq\"><p> Less than three months before the kickoff Iowa caucuses, there is growing anxiety bordering on panic among Republican elites about the dominance and durability of Donald Trump and Ben Carson and widespread bewilderment over how to defeat them.</p><p>Party leaders and donors fear that nominating either man would have negative ramifications for the GOP ticket up and down the ballot, virtually ensuring a Hillary Rodham Clinton presidency and increasing the odds that the Senate falls into Democratic hands….</p><p>The apprehension among some party elites goes beyond electability,<br> according to one Republican strategist who spoke on the condition of<br> anonymity to talk candidly about the worries.</br></br></p><p>“We’re potentially<br> careening down this road of nominating somebody who frankly isn’t fit to<br> be president in terms of the basic ability and temperament to do the<br> job,” this strategist said. “It’s not just that it could be somebody<br> Hillary could destroy electorally, but what if Hillary hits a banana<br> peel and this person becomes president?”</br></br></br></br></br></p><p>Angst about Trump<br> intensified this week after he made two comments that could prove<br> damaging in a general election. First, he explained his opposition to<br> raising the minimum wage by saying “wages are too high.”</br></br></br></p><p>Second, he said<br> he would create a federal “deportation force” to remove the more than<br> 11 million immigrants living in the United States illegally. “To<br> have a leading candidate propose a new federal police force that is<br> going to flush out illegal immigrants across the nation? That’s very<br> disturbing and concerning to me about where that leads Republicans,”<br> said Dick Wadhams, a former GOP chairman in Colorado, a swing state<br> where Republicans are trying to pick up a Senate seat next year.</br></br></br></br></br></br></br></p></blockquote><p>And one of the biggest concerns to the ruling party is that Trump will lead a nationalist surge against immigration. But keep this in mind when you hear them re-run the old “Most Important Election Ever” song-and-dance and use the Lizard Queen as a scare tactic. They would rather have Hilary as president than either Trump or Carson.</p></div>",
  "content_text": "This Washington Post article demonstrates that there is, in truth, but\none bi-factional ruling party\n:\nLess than three months before the kickoff Iowa caucuses, there is growing anxiety bordering on panic among Republican elites about the dominance and durability of Donald Trump and Ben Carson and widespread bewilderment over how to defeat them.\nParty leaders and donors fear that nominating either man would have negative ramifications for the GOP ticket up and down the ballot, virtually ensuring a Hillary Rodham Clinton presidency and increasing the odds that the Senate falls into Democratic hands….\nThe apprehension among some party elites goes beyond electability,\naccording to one Republican strategist who spoke on the condition of\nanonymity to talk candidly about the worries.\n“We’re potentially\ncareening down this road of nominating somebody who frankly isn’t fit to\nbe president in terms of the basic ability and temperament to do the\njob,” this strategist said. “It’s not just that it could be somebody\nHillary could destroy electorally, but what if Hillary hits a banana\npeel and this person becomes president?”\nAngst about Trump\nintensified this week after he made two comments that could prove\ndamaging in a general election. First, he explained his opposition to\nraising the minimum wage by saying “wages are too high.”\nSecond, he said\nhe would create a federal “deportation force” to remove the more than\n11 million immigrants living in the United States illegally. “To\nhave a leading candidate propose a new federal police force that is\ngoing to flush out illegal immigrants across the nation? That’s very\ndisturbing and concerning to me about where that leads Republicans,”\nsaid Dick Wadhams, a former GOP chairman in Colorado, a swing state\nwhere Republicans are trying to pick up a Senate seat next year.\nAnd one of the biggest concerns to the ruling party is that Trump will lead a nationalist surge against immigration. But keep this in mind when you hear them re-run the old “Most Important Election Ever” song-and-dance and use the Lizard Queen as a scare tactic. They would rather have Hilary as president than either Trump or Carson.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-13T07:24:00+00:00"
}