{
  "url": "https://voxday.net/2015/11/07/hitlers-125-iq/",
  "scraped_at": "2025-12-17T17:32:51.553304",
  "title": "Hitler’s 125 IQ",
  "date_display": "November 7, 2015",
  "date_iso": "2015-11-07T13:00:00+00:00",
  "date_from_url": "2015-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s rather remarkable to see that the entire Nazi leadership <a href=\"http://www.unz.com/akarlin/hitlers-iq-was-125/\">was nearly a standard deviation more intelligent</a> than the average Ashkenazi Jew, especially when we are so often informed that the reason for Jewish success is their exceedingly high level of intelligence. That being said, I suspect the average IQ of the current Israeli leadership is even higher; the same clearly cannot be said of the current U.S. or German leaderships.</p><blockquote class=\"tr_bq\"><p> As I recall from what I’ve read on Hitler and internal Nazi politics, of the above list, particularly “close associates” of Hitler would include: Goering; Ribbentrop; Speer; and until his “betrayal,” Hess. Their average IQ is 129.</p><p>While there was never much love lost between Hitler and the German military establishment, the closest military connection to Hitler from that list would be Keitel, who was infamous for his toadying behavior towards the Fuhrer. His IQ also happened to be precisely 129.</p><p>(Incidentally, while Jodl is regarded as far more competent than Keitel – he is the guy who actually made OKW command structure run – it’s interesting to note his IQ was actually lower than that of his boss, if marginally so).</p><p>In practice, Goering’s IQ during his time as Nazi bigwig might have actually been lower, due to his morphine addiction. On the other hand, there are suspicions that Speer was in fact considerably cleverer than his test scores indicated, because he was playing the “dumb dreamer architect” type so as to pretend ignorance of the death camps and avoid execution (if so he was successful). So these two factors might cancel out.</p><p>Adjusting for the Flynn effect – but only modestly, since the most useful (not rules-dependent) forms of intelligence haven’t improved all that radically, and we have an IQ of around 125 for Hitler normed to today’s Greenwich standards.</p></blockquote><p>While I was initially skeptical of the idea of estimating Hitler’s IQ by those of his associates, on second thought, the fact that the average IQ in the Digital Ghetto was above 140 forces me to admit that it’s not a completely unreasonable basis for an estimate. It also fits with the available evidence; it’s pretty clear from reading <i>Mein Kampf</i> that Hitler was bright, but not highly intelligent.</p><p>For obvious reasons, the most successful popular leaders tend to be within the 30-point communications window of the norm. I would expect that Stalin was north of 130 IQ, both on the basis of his writing and his erratic, introverted behavior; unlike Hitler and Churchill, he had no need to rely upon personal popularity with the masses.</p></div>",
  "content_text": "It’s rather remarkable to see that the entire Nazi leadership\nwas nearly a standard deviation more intelligent\nthan the average Ashkenazi Jew, especially when we are so often informed that the reason for Jewish success is their exceedingly high level of intelligence. That being said, I suspect the average IQ of the current Israeli leadership is even higher; the same clearly cannot be said of the current U.S. or German leaderships.\nAs I recall from what I’ve read on Hitler and internal Nazi politics, of the above list, particularly “close associates” of Hitler would include: Goering; Ribbentrop; Speer; and until his “betrayal,” Hess. Their average IQ is 129.\nWhile there was never much love lost between Hitler and the German military establishment, the closest military connection to Hitler from that list would be Keitel, who was infamous for his toadying behavior towards the Fuhrer. His IQ also happened to be precisely 129.\n(Incidentally, while Jodl is regarded as far more competent than Keitel – he is the guy who actually made OKW command structure run – it’s interesting to note his IQ was actually lower than that of his boss, if marginally so).\nIn practice, Goering’s IQ during his time as Nazi bigwig might have actually been lower, due to his morphine addiction. On the other hand, there are suspicions that Speer was in fact considerably cleverer than his test scores indicated, because he was playing the “dumb dreamer architect” type so as to pretend ignorance of the death camps and avoid execution (if so he was successful). So these two factors might cancel out.\nAdjusting for the Flynn effect – but only modestly, since the most useful (not rules-dependent) forms of intelligence haven’t improved all that radically, and we have an IQ of around 125 for Hitler normed to today’s Greenwich standards.\nWhile I was initially skeptical of the idea of estimating Hitler’s IQ by those of his associates, on second thought, the fact that the average IQ in the Digital Ghetto was above 140 forces me to admit that it’s not a completely unreasonable basis for an estimate. It also fits with the available evidence; it’s pretty clear from reading\nMein Kampf\nthat Hitler was bright, but not highly intelligent.\nFor obvious reasons, the most successful popular leaders tend to be within the 30-point communications window of the norm. I would expect that Stalin was north of 130 IQ, both on the basis of his writing and his erratic, introverted behavior; unlike Hitler and Churchill, he had no need to rely upon personal popularity with the masses.",
  "tags": [
    "history",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-07T13:00:00+00:00"
}