{
  "url": "https://voxday.net/2015/11/18/i-am-dangerous-iceman/",
  "scraped_at": "2025-12-17T17:34:23.249155",
  "title": "I am dangerous, Ice…man",
  "date_display": "November 18, 2015",
  "date_iso": "2015-11-18T13:00:00+00:00",
  "date_from_url": "2015-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SF-SJWs are still <a href=\"https://bitchmedia.org/rewriting-reality-trans-speculative-fiction-anthology-call-for-submissions\">spinning, spinning, spinning the Narrative</a> in a desperate attempt to reclaim it:</p><blockquote class=\"tr_bq\"><p> On that note, what are your thoughts on the controversy around the Sad Puppies, the group who tried to rig the reader-voted Hugo Awards to favor “traditional” sci-fi works. It was clearly a powerful, angry, and organized reaction against the steady diversification of storytelling in sci-fi and spec-fic. What exactly is happening to this genre that’s so explosive and dangerous?</p><p>CP: White straight cis men are getting very upset because they feel they’re losing something when a more diverse set of stories is represented. On the one hand, they don’t have to worry—the share of representation of white straight cis male characters in sci-fi is maybe dropping from 98 percent to 95. But on the other hand, they’re right—they are losing some measure of dominance, and they should lose this. And I think acknowledging that challenges a fluffy teddy-bear idea of what an ally is—the idea that no one is going to lose anything. Being an ally requires giving shit up, which is what these people are not prepared to do.</p><p>CF: I think the throwing-the-toys-out-of-the-pram thing totally describes Brad Torgersen [sci-fi author and ringleader of the Sad Puppies]. I think Vox Day [another author, who organized an extreme offshoot of the Sad Puppies called the Rabid Puppies] is altogether a more sinister person, with really far-right politics and a desire to upset people to get attention. He’s a serious reactionary, traditionalist, religious, pseudofascist type—he even called leading spec-fic writer N.K. Jemisin an “uneducated half-savage” because she’s Black. And I think he saw Torgersen’s toy-throwing and said, “Here is a tool I can use to hurt people.”</p></blockquote><p>It’s amazing to me how many SJWs simply cannot get the quote correct. Even when they’re attempting to kill-quote me in an article, they don’t quote it!</p><p><i><b>“Being an educated, but ignorant half-savage, with little more<br> understanding of what it took to build a new literature by “a bunch of<br> beardy old middle-class middle-American guys” than an illiterate Igbotu<br> tribesman has of how to build a jet engine, Jemisin clearly does not<br> understand that her dishonest call for “reconciliation” and even more<br> diversity within SF/F is tantamount to a call for its decline into<br> irrelevance.” </br></br></br></br></br></br></b></i></p><p>Granted, I understand the average SJW is not capable of following a sentence that long and complex, but how they go from “educated but ignorant” to “uneducated” is really quite remarkable.</p><p>But more importantly, <i>SJWs always project</i>. I don’t have any desire to upset people, and I certainly don’t seek attention. SF-SJWs always gloss over the fact that I was writing my political columns and participating as a member of SFWA for seven years without incident or undue attention until John Scalzi and Teresa Nielsen-Hayden saw fit to start publicly attacking me. Even after that, it was another eight years before I finally got around to taking the offensive and striking back.</p><p>Nor are those the only factual errors. But never mind those. It is more interesting to see how they have progressed from declaring me a complete nonentity to portraying me in much the way they are portraying Brad Torgersen now, to seeing me as a “sinister person”. To which I can only wonder, “what part of Supreme Dark Lord” did they not understand?</p><p>I suppose they find the fact that my minions are vile, faceless, and many, as well as the fact that I am the author of the book that has been #1 Political Philosophy for 14 straight weeks to be as ominous as it is problematic. It would be amusing indeed if SJWAL stays on top long enough to be dethroned by <i>Cuckservative</i>.</p><p>But if they are concerned now, well, just wait until next year.</p></div>",
  "content_text": "The SF-SJWs are still\nspinning, spinning, spinning the Narrative\nin a desperate attempt to reclaim it:\nOn that note, what are your thoughts on the controversy around the Sad Puppies, the group who tried to rig the reader-voted Hugo Awards to favor “traditional” sci-fi works. It was clearly a powerful, angry, and organized reaction against the steady diversification of storytelling in sci-fi and spec-fic. What exactly is happening to this genre that’s so explosive and dangerous?\nCP: White straight cis men are getting very upset because they feel they’re losing something when a more diverse set of stories is represented. On the one hand, they don’t have to worry—the share of representation of white straight cis male characters in sci-fi is maybe dropping from 98 percent to 95. But on the other hand, they’re right—they are losing some measure of dominance, and they should lose this. And I think acknowledging that challenges a fluffy teddy-bear idea of what an ally is—the idea that no one is going to lose anything. Being an ally requires giving shit up, which is what these people are not prepared to do.\nCF: I think the throwing-the-toys-out-of-the-pram thing totally describes Brad Torgersen [sci-fi author and ringleader of the Sad Puppies]. I think Vox Day [another author, who organized an extreme offshoot of the Sad Puppies called the Rabid Puppies] is altogether a more sinister person, with really far-right politics and a desire to upset people to get attention. He’s a serious reactionary, traditionalist, religious, pseudofascist type—he even called leading spec-fic writer N.K. Jemisin an “uneducated half-savage” because she’s Black. And I think he saw Torgersen’s toy-throwing and said, “Here is a tool I can use to hurt people.”\nIt’s amazing to me how many SJWs simply cannot get the quote correct. Even when they’re attempting to kill-quote me in an article, they don’t quote it!\n“Being an educated, but ignorant half-savage, with little more\nunderstanding of what it took to build a new literature by “a bunch of\nbeardy old middle-class middle-American guys” than an illiterate Igbotu\ntribesman has of how to build a jet engine, Jemisin clearly does not\nunderstand that her dishonest call for “reconciliation” and even more\ndiversity within SF/F is tantamount to a call for its decline into\nirrelevance.”\nGranted, I understand the average SJW is not capable of following a sentence that long and complex, but how they go from “educated but ignorant” to “uneducated” is really quite remarkable.\nBut more importantly,\nSJWs always project\n. I don’t have any desire to upset people, and I certainly don’t seek attention. SF-SJWs always gloss over the fact that I was writing my political columns and participating as a member of SFWA for seven years without incident or undue attention until John Scalzi and Teresa Nielsen-Hayden saw fit to start publicly attacking me. Even after that, it was another eight years before I finally got around to taking the offensive and striking back.\nNor are those the only factual errors. But never mind those. It is more interesting to see how they have progressed from declaring me a complete nonentity to portraying me in much the way they are portraying Brad Torgersen now, to seeing me as a “sinister person”. To which I can only wonder, “what part of Supreme Dark Lord” did they not understand?\nI suppose they find the fact that my minions are vile, faceless, and many, as well as the fact that I am the author of the book that has been #1 Political Philosophy for 14 straight weeks to be as ominous as it is problematic. It would be amusing indeed if SJWAL stays on top long enough to be dethroned by\nCuckservative\n.\nBut if they are concerned now, well, just wait until next year.",
  "tags": [
    "ELoE",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-18T13:00:00+00:00"
}