{
  "url": "https://voxday.net/2015/11/30/its-always-over-there/",
  "scraped_at": "2025-12-17T17:35:54.761210",
  "title": "It’s always Over There",
  "date_display": "November 30, 2015",
  "date_iso": "2015-11-30T17:44:00+00:00",
  "date_from_url": "2015-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not simply discounting the warning in this article <a href=\"https://westernrifleshooters.wordpress.com/2015/11/29/bracken-tet-take-two-islams-2016-european-offensive/\">postulating large-scale Islamic 4GW in Europe</a>. But I am just a little amused by it, as Americans always, always, always fail to understand Europe and tend to underestimate the strong nationalist core underneath the soft modern welfare state:</p><blockquote class=\"tr_bq\"><p> The hard core of the battle-hardened jihadists now fanning out across Europe understands the tried-and-true process of igniting a civil war through terror. They will calculate that the European military and police cannot and will not sustain the battle against an unceasing campaign of terrorism. Brussels cannot remain on virtual lockdown forever without its economy being wrecked. What will happen when a Paris-type attack, or worse, is a daily event in a dozen European cities?</p><p>As I mentioned above, just the other day in northern Italy eight hundred combat-style pistol-grip shotguns were discovered in a truck on their way from Turkey to Belgium. Do the math. The Paris attacks were carried out by approximately eight jihadists armed with Kalashnikovs, shotguns and TATP suicide vests (which can be manufactured anywhere there is a kitchen). Now imagine a “Super Tet Offensive,” with every type of target on the hit list from airports to zoological parks, each being assaulted by an eight-man squad of such killers. Some attacks smaller, some larger, from pairs to platoons in strength.</p><p>Today, perhaps only a few short months prior to Tet 2016, there is no Islamic high command located in Europe or elsewhere in charge of planning specific terror operations. There is no OKW (Oberkommando der Wehrmacht, the supreme command of the German Nazi armed forces) planning an Islamic Operation Barbarossa. Hence, there is no command and control structure for Western intelligence to penetrate and disrupt.</p><p>Instead of a central brain directing many hands, think of a vast swarm of stinging jellyfish, all moving in loose formation, with the same generalized attack plan in their collective hive-mind. At the end of 2015, individual muhajirs may have only a basic awareness that they are heading to Europe to conduct a great jihad. As D-Day draws nearer, coded messages will proliferate with cryptic references to portentous events from Islamic history. “Get ready, and prepare to conduct major operations” will be the thrust of the online chatter and encrypted wireless messages. In each European city, targets will be individually scouted by local mujahirs in anticipation of a general outbreak of jihad terror attacks.</p><p>How many mosques have already received a truckload of shotguns or Kalashnikovs? Run the numbers again: eight jihadists per terror attack, eight hundred weapons per truck, 80,000 Viet Cong fighters in the original Tet Offensive, and an estimated 800,000 muhajirs flooding into Europe. Using radical mosques as clandestine armories is S.O.P in the Middle East, so why would the jihadists not use the same tactics in safe and docile Europe? Out of a sense of fairness and respect for European laws? Please. In the words of Turkish Prime Minister Erdogan, “The mosques are our barracks, the domes our helmets, the minarets our bayonets and the faithful our soldiers…” And bear in mind that anyplace an AK-47 can be smuggled, so too can a few kilos of Semtex.</p><p>Imagine a dozen or even a score of Beslan-type school sieges, all happening at the same time, across that number of European cities. Initially, the first string of major surprise attacks will be coordinated by the most well-organized terror networks using currently unbreakable wireless encryption. Many of the attacks will involve numerous captured hostages, often children, with impossible demands being made to guarantee their safety. Or no demands will be made; just rape and slaughter will ensue, as in the Russian Beslan example. This outbreak of major attacks will be the signal for the general jihad offensive to begin.<br> The Beslan Massacre happened in 2004 at the hands of yet another killer gang of aggrieved Islamists. Two squads of Chechen Muslim terrorists arrived on the first day of school in a Russian town, using false police vans as camouflage. They took a thousand young hostages and held them for three days. The Muslim terrorists murdered over four hundred innocents, often after rape and torture. Now, imagine twenty ongoing European Beslans, with simultaneous infrastructure and “soft-target” (people) attacks happening everywhere in between.</br></p><p>What Hitler’s Nazis accomplished with Stukas and Tigers and motorized divisions, the Islamonazis will attempt to accomplish by a massive “Tet Offensive on steroids,” overwhelming and stunning the European meta-system into immediate paralysis and first psychological, then material defeat. At least, that is the outcome that the Islamonozis will be striving to achieve. The 1968 Tet infiltration and mass-attack strategy didn’t succeed in Vietnam, and maybe it won’t work in Europe, either. It’s more likely that the hoped-for general uprising by all European Muslims against the kafirs will not be triggered, and it may simply stall and sputter out.</p><p>In strategic terms, if nothing else, the 2016 jihad offensive and subsequent civil war in Europe will open up a second major front in the war against the Islamic State, causing NATO and the West to turn their attention inward toward their own survival, and thereby take pressure off the other theaters of war in Iraq and Syria.</p><p>And for the Europeans to win the coming civil war, they will have to be at least half as brutally ugly as their Muslim invaders, and that means pretty damn brutally ugly. But while the jihadists will be operating at maximum brutality from day one, the placid and polite European authorities will be starting from far behind in that department. For example: a standard jihadist tactic is to flee from a terror attack straight back into the embrace of their co-religionists in the Sharia-zone ghettos, and hide behind their women and children. Then what will the authorities do? Go in and try to arrest them? (Just joking.) Wait for their next excursion with more terror bombs? Or gut the entire suspected block with shell fire? This is what I mean by damn ugly. The French reaction to the Paris attacks gives a hint of how this phase will run.</p><p>Best case scenario, and I don’t see this as likely: the 2016 Islamic Tet attackers will be wiped out the way the Viet Cong were in 1968. But if there are enough simultaneous attacks, in total numbers involving anywhere near the 80,000 or so fighters of the Vietnamese Tet, I can’t see how the present European forces can defeat the jihadists in less than a month, if at all. By very simple math, that number of jihadists means ten thousand Paris-level attacks. Think about that. Ten thousand Paris level attacks! All taking place in the same month, the same week, even on the same day, right across Europe. The politically-correct and overly polite European policemen (and even their militaries, at first) won’t be up to mounting successful counterattacks and rescue operations against a score of Beslans happening in schools, hospitals and concert halls. Not while at the same time, airports, train stations, power plants and other targets are being hit by Paris-sized terror squads right across Europe.</p></blockquote><p>What Americans always fail to understand is that Europeans are, by and large, far more ruthless than they are. They, and not the Europeans or the Russians, were the party responsible for preventing the Serbians from ethnically cleansing the Muslims out of Bosnia and Herzogovina.</p><p>When a handful of activists were shot at Kent State, America was wracked with guilt. When the Parisian police handcuffed and drowned dozens of Algerian activists in the Seine, they gave the chief of police a medal.</p><p>Attempting to judge European attitudes by the statements of Hollande and Merkel is like judging Americans by Obama’s sanctimonious platitudes. If there is an uprising of the sort envisioned, there will be an ultraviolent, ultranationalist reaction that will make the Russians in Berlin look calm and reasonable.</p><p>Keep in mind that Europeans are already banning the wearing of burqahs in public. They are erecting barbed-wire borders and openly abrogating treaties in defense of their nations. Political parties with considerable support are talking openly about tearing up residence permits and enacting mass deportations. Nor do Europeans have much regard for religious liberties behind which Muslims can hide in the USA; Scientology is already banned in Germany and they could literally ban Islam tomorrow if the leadership was amenable. And the fact that the Islamic populations tend to be concentrated only makes the strategic issue that much easier to address, if necessary.</p><p>Furthermore, Europeans are far from unarmed. Both France and Germany have more than 30 firearms per 100 population. This is lower than 88.8 per 100 as in the USA, but it is hardly an indication of being defenseless. What Europeans don’t have is handguns; they have the rifles and shotguns that would be more militarily useful.</p><p>But the chief problem with this Tet 2.0 concept is that it is simply not in keeping with everything we know from military history about how Muslims historically wage war. What works for a highly disciplined, patient group of Asians fighting foreigners in their homeland is considerably less likely to be effective for a more aggressive and impetuous collection of teenagers and twenty-somethings from the Middle East.</p><p>And while too much of the European leadership is very nearly as treacherous, and anti-nationalistic as he describes, I very much doubt that any of them are secret Muslims. The fact is that most Europeans look at Muslims the way Americans view Hispanics; they don’t really see them as a serious threat. After all, their forefathers repeatedly defeated them for literally centuries. They may be right to discount the threat, they may be wrong, but they certainly aren’t guided by abject fear of it.</p><p>If anything, I think the problem is that as highly secular societies, they find it difficult to take a threat that involves a religious motivation seriously.</p></div>",
  "content_text": "I’m not simply discounting the warning in this article\npostulating large-scale Islamic 4GW in Europe\n. But I am just a little amused by it, as Americans always, always, always fail to understand Europe and tend to underestimate the strong nationalist core underneath the soft modern welfare state:\nThe hard core of the battle-hardened jihadists now fanning out across Europe understands the tried-and-true process of igniting a civil war through terror. They will calculate that the European military and police cannot and will not sustain the battle against an unceasing campaign of terrorism. Brussels cannot remain on virtual lockdown forever without its economy being wrecked. What will happen when a Paris-type attack, or worse, is a daily event in a dozen European cities?\nAs I mentioned above, just the other day in northern Italy eight hundred combat-style pistol-grip shotguns were discovered in a truck on their way from Turkey to Belgium. Do the math. The Paris attacks were carried out by approximately eight jihadists armed with Kalashnikovs, shotguns and TATP suicide vests (which can be manufactured anywhere there is a kitchen). Now imagine a “Super Tet Offensive,” with every type of target on the hit list from airports to zoological parks, each being assaulted by an eight-man squad of such killers. Some attacks smaller, some larger, from pairs to platoons in strength.\nToday, perhaps only a few short months prior to Tet 2016, there is no Islamic high command located in Europe or elsewhere in charge of planning specific terror operations. There is no OKW (Oberkommando der Wehrmacht, the supreme command of the German Nazi armed forces) planning an Islamic Operation Barbarossa. Hence, there is no command and control structure for Western intelligence to penetrate and disrupt.\nInstead of a central brain directing many hands, think of a vast swarm of stinging jellyfish, all moving in loose formation, with the same generalized attack plan in their collective hive-mind. At the end of 2015, individual muhajirs may have only a basic awareness that they are heading to Europe to conduct a great jihad. As D-Day draws nearer, coded messages will proliferate with cryptic references to portentous events from Islamic history. “Get ready, and prepare to conduct major operations” will be the thrust of the online chatter and encrypted wireless messages. In each European city, targets will be individually scouted by local mujahirs in anticipation of a general outbreak of jihad terror attacks.\nHow many mosques have already received a truckload of shotguns or Kalashnikovs? Run the numbers again: eight jihadists per terror attack, eight hundred weapons per truck, 80,000 Viet Cong fighters in the original Tet Offensive, and an estimated 800,000 muhajirs flooding into Europe. Using radical mosques as clandestine armories is S.O.P in the Middle East, so why would the jihadists not use the same tactics in safe and docile Europe? Out of a sense of fairness and respect for European laws? Please. In the words of Turkish Prime Minister Erdogan, “The mosques are our barracks, the domes our helmets, the minarets our bayonets and the faithful our soldiers…” And bear in mind that anyplace an AK-47 can be smuggled, so too can a few kilos of Semtex.\nImagine a dozen or even a score of Beslan-type school sieges, all happening at the same time, across that number of European cities. Initially, the first string of major surprise attacks will be coordinated by the most well-organized terror networks using currently unbreakable wireless encryption. Many of the attacks will involve numerous captured hostages, often children, with impossible demands being made to guarantee their safety. Or no demands will be made; just rape and slaughter will ensue, as in the Russian Beslan example. This outbreak of major attacks will be the signal for the general jihad offensive to begin.\nThe Beslan Massacre happened in 2004 at the hands of yet another killer gang of aggrieved Islamists. Two squads of Chechen Muslim terrorists arrived on the first day of school in a Russian town, using false police vans as camouflage. They took a thousand young hostages and held them for three days. The Muslim terrorists murdered over four hundred innocents, often after rape and torture. Now, imagine twenty ongoing European Beslans, with simultaneous infrastructure and “soft-target” (people) attacks happening everywhere in between.\nWhat Hitler’s Nazis accomplished with Stukas and Tigers and motorized divisions, the Islamonazis will attempt to accomplish by a massive “Tet Offensive on steroids,” overwhelming and stunning the European meta-system into immediate paralysis and first psychological, then material defeat. At least, that is the outcome that the Islamonozis will be striving to achieve. The 1968 Tet infiltration and mass-attack strategy didn’t succeed in Vietnam, and maybe it won’t work in Europe, either. It’s more likely that the hoped-for general uprising by all European Muslims against the kafirs will not be triggered, and it may simply stall and sputter out.\nIn strategic terms, if nothing else, the 2016 jihad offensive and subsequent civil war in Europe will open up a second major front in the war against the Islamic State, causing NATO and the West to turn their attention inward toward their own survival, and thereby take pressure off the other theaters of war in Iraq and Syria.\nAnd for the Europeans to win the coming civil war, they will have to be at least half as brutally ugly as their Muslim invaders, and that means pretty damn brutally ugly. But while the jihadists will be operating at maximum brutality from day one, the placid and polite European authorities will be starting from far behind in that department. For example: a standard jihadist tactic is to flee from a terror attack straight back into the embrace of their co-religionists in the Sharia-zone ghettos, and hide behind their women and children. Then what will the authorities do? Go in and try to arrest them? (Just joking.) Wait for their next excursion with more terror bombs? Or gut the entire suspected block with shell fire? This is what I mean by damn ugly. The French reaction to the Paris attacks gives a hint of how this phase will run.\nBest case scenario, and I don’t see this as likely: the 2016 Islamic Tet attackers will be wiped out the way the Viet Cong were in 1968. But if there are enough simultaneous attacks, in total numbers involving anywhere near the 80,000 or so fighters of the Vietnamese Tet, I can’t see how the present European forces can defeat the jihadists in less than a month, if at all. By very simple math, that number of jihadists means ten thousand Paris-level attacks. Think about that. Ten thousand Paris level attacks! All taking place in the same month, the same week, even on the same day, right across Europe. The politically-correct and overly polite European policemen (and even their militaries, at first) won’t be up to mounting successful counterattacks and rescue operations against a score of Beslans happening in schools, hospitals and concert halls. Not while at the same time, airports, train stations, power plants and other targets are being hit by Paris-sized terror squads right across Europe.\nWhat Americans always fail to understand is that Europeans are, by and large, far more ruthless than they are. They, and not the Europeans or the Russians, were the party responsible for preventing the Serbians from ethnically cleansing the Muslims out of Bosnia and Herzogovina.\nWhen a handful of activists were shot at Kent State, America was wracked with guilt. When the Parisian police handcuffed and drowned dozens of Algerian activists in the Seine, they gave the chief of police a medal.\nAttempting to judge European attitudes by the statements of Hollande and Merkel is like judging Americans by Obama’s sanctimonious platitudes. If there is an uprising of the sort envisioned, there will be an ultraviolent, ultranationalist reaction that will make the Russians in Berlin look calm and reasonable.\nKeep in mind that Europeans are already banning the wearing of burqahs in public. They are erecting barbed-wire borders and openly abrogating treaties in defense of their nations. Political parties with considerable support are talking openly about tearing up residence permits and enacting mass deportations. Nor do Europeans have much regard for religious liberties behind which Muslims can hide in the USA; Scientology is already banned in Germany and they could literally ban Islam tomorrow if the leadership was amenable. And the fact that the Islamic populations tend to be concentrated only makes the strategic issue that much easier to address, if necessary.\nFurthermore, Europeans are far from unarmed. Both France and Germany have more than 30 firearms per 100 population. This is lower than 88.8 per 100 as in the USA, but it is hardly an indication of being defenseless. What Europeans don’t have is handguns; they have the rifles and shotguns that would be more militarily useful.\nBut the chief problem with this Tet 2.0 concept is that it is simply not in keeping with everything we know from military history about how Muslims historically wage war. What works for a highly disciplined, patient group of Asians fighting foreigners in their homeland is considerably less likely to be effective for a more aggressive and impetuous collection of teenagers and twenty-somethings from the Middle East.\nAnd while too much of the European leadership is very nearly as treacherous, and anti-nationalistic as he describes, I very much doubt that any of them are secret Muslims. The fact is that most Europeans look at Muslims the way Americans view Hispanics; they don’t really see them as a serious threat. After all, their forefathers repeatedly defeated them for literally centuries. They may be right to discount the threat, they may be wrong, but they certainly aren’t guided by abject fear of it.\nIf anything, I think the problem is that as highly secular societies, they find it difficult to take a threat that involves a religious motivation seriously.",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-30T17:44:00+00:00"
}