{
  "url": "https://voxday.net/2015/11/22/lessons-in-rhetoric-atheist-edition/",
  "scraped_at": "2025-12-17T17:34:56.095017",
  "title": "Lessons in Rhetoric: Atheist edition",
  "date_display": "November 22, 2015",
  "date_iso": "2015-11-22T13:00:00+00:00",
  "date_from_url": "2015-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This atheist – sorry, “gnostic atheist” – decided to insert himself into the conversation following my observation that Richard Dawkins demonstrably does not know what “evidence” is:</p><blockquote class=\"tr_bq\"><p> Sapien @VernacularSwag<br> @voxday @RichardDawkins Stop talking. Atheism and agnosticism aren’t mutually exclusive terms. 90% of self-described atheists are agnostic</br></p><p>Vox Day @voxday<br> There is considerable evidence for God. You like definitions: look up “evidence”.</br></p><p>Sapien @VernacularSwag<br> LOL. Name one piece of evidence. You now are taking the affirmative</br></p><p>Vox Day @voxday<br> You’re laughing because you’re stupid. Again, look up “evidence”.</br></p><p>Sapien @VernacularSwag<br> I’m not the one pointing to invisible arguments for my position.</br></p><p>Vox Day @voxday<br> Neither am I. You don’t know what evidence is. Your arguments are hopelessly wrong.</br></p><p>Sapien @VernacularSwag<br> What the actual fuck</br></p><p>Sapien @VernacularSwag<br> You’re refusing to even have the discussion so how do you even know what my argument is</br></p><p>Sapien @VernacularSwag<br> You claim there is evidence for god yet refuse to provide an example and I’m the stupid one</br></p><p>Sapien @VernacularSwag<br> Go look it up for yourself, I’m done arguing against your ignorance</br></p><p>Sapien @VernacularSwag<br> you said considerable amount so surely it should be easy to provide just one</br></p><p>Vox Day @voxday<br> It is. But I know the Atheist Dance. You’re too intellectually short for the ride.</br></p><p>Sapien @VernacularSwag<br> Try me</br></p><p>Vox Day @voxday<br> No. The train is fine. Stop talking.</br></p><p>Sapien @VernacularSwag<br> It’s much easier to win argument that never happens isn’t it</br></p><p>Vox Day @voxday<br> What the actual fuck? Stop talking. The train is still fine.</br></p><p>Sapien @VernacularSwag<br> What the hell is this train you keep talking about lol</br></p><p>Vox Day @voxday<br> The train that is fine.</br></p><p>Sapien @VernacularSwag<br> …are you okay?</br></p><p>Vox Day @voxday<br> Yes. So is the train.</br></p><p>Sapien @VernacularSwag<br> Are you just saying random things to derail the convo now or what?</br></p><p>Vox Day @voxday<br> The train is not derailed. I already told you it is fine. Stop worrying about the train.</br></p></blockquote><p>Needless to say, he’s doing a wonderful job proving my observation about the high degree of correlation between atheists and what used to be called “Asperger’s Syndrome”. I suppose now we could simply call it “atheism”. Or, if they prefer, “gnostic atheism”.</p><p>It’s certainly interesting to see that eight years after the New Atheists burst onto the scene waving the bloody flag of atheism, even Richard Dawkins is now publicly claiming that he is merely an “agnostic” and atheists are insisting that “atheism” merely means “personal disbelief in the existence of God” and certainly not any positive claim that God does not exist.</p><p>NB: as an additional discrediting flourish, directly quote their little rhetorical jabs once they’ve used them. If you don’t overdo it, it serves to underline their disinterest in genuine dialectic.</p></div>",
  "content_text": "This atheist – sorry, “gnostic atheist” – decided to insert himself into the conversation following my observation that Richard Dawkins demonstrably does not know what “evidence” is:\nSapien @VernacularSwag\n@voxday @RichardDawkins Stop talking. Atheism and agnosticism aren’t mutually exclusive terms. 90% of self-described atheists are agnostic\nVox Day @voxday\nThere is considerable evidence for God. You like definitions: look up “evidence”.\nSapien @VernacularSwag\nLOL. Name one piece of evidence. You now are taking the affirmative\nVox Day @voxday\nYou’re laughing because you’re stupid. Again, look up “evidence”.\nSapien @VernacularSwag\nI’m not the one pointing to invisible arguments for my position.\nVox Day @voxday\nNeither am I. You don’t know what evidence is. Your arguments are hopelessly wrong.\nSapien @VernacularSwag\nWhat the actual fuck\nSapien @VernacularSwag\nYou’re refusing to even have the discussion so how do you even know what my argument is\nSapien @VernacularSwag\nYou claim there is evidence for god yet refuse to provide an example and I’m the stupid one\nSapien @VernacularSwag\nGo look it up for yourself, I’m done arguing against your ignorance\nSapien @VernacularSwag\nyou said considerable amount so surely it should be easy to provide just one\nVox Day @voxday\nIt is. But I know the Atheist Dance. You’re too intellectually short for the ride.\nSapien @VernacularSwag\nTry me\nVox Day @voxday\nNo. The train is fine. Stop talking.\nSapien @VernacularSwag\nIt’s much easier to win argument that never happens isn’t it\nVox Day @voxday\nWhat the actual fuck? Stop talking. The train is still fine.\nSapien @VernacularSwag\nWhat the hell is this train you keep talking about lol\nVox Day @voxday\nThe train that is fine.\nSapien @VernacularSwag\n…are you okay?\nVox Day @voxday\nYes. So is the train.\nSapien @VernacularSwag\nAre you just saying random things to derail the convo now or what?\nVox Day @voxday\nThe train is not derailed. I already told you it is fine. Stop worrying about the train.\nNeedless to say, he’s doing a wonderful job proving my observation about the high degree of correlation between atheists and what used to be called “Asperger’s Syndrome”. I suppose now we could simply call it “atheism”. Or, if they prefer, “gnostic atheism”.\nIt’s certainly interesting to see that eight years after the New Atheists burst onto the scene waving the bloody flag of atheism, even Richard Dawkins is now publicly claiming that he is merely an “agnostic” and atheists are insisting that “atheism” merely means “personal disbelief in the existence of God” and certainly not any positive claim that God does not exist.\nNB: as an additional discrediting flourish, directly quote their little rhetorical jabs once they’ve used them. If you don’t overdo it, it serves to underline their disinterest in genuine dialectic.",
  "tags": [
    "atheism",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-22T13:00:00+00:00"
}