{
  "url": "https://voxday.net/2015/11/05/mass-migration-is-war/",
  "scraped_at": "2025-12-17T17:32:39.910622",
  "title": "Mass migration is war",
  "date_display": "November 5, 2015",
  "date_iso": "2015-11-05T16:30:00+00:00",
  "date_from_url": "2015-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mainstream media is finally beginning to recognize that <a href=\"http://www.express.co.uk/comment/columnists/leo-mckinstry/617147/Mass-immigration-verge-destroying-Europe\">perhaps they don’t actually want to live under Sharia</a> or in a third world hellhole after all.</p><blockquote class=\"tr_bq\"><p> Mass immigration is on the verge of DESTROYING Europe.</p><p>SEVERAL millennia were required to build European civilisation but its impending destruction has been the work of just a few years, carried out by a cadre of irresponsible, unpatriotic and deluded politicians led by German Chancellor Angela Merkel.</p><p>Dressing up their vandalism as<br> compassion and their cowardice as moral superiority, these leaders have<br> created an immigration crisis so profound that the very existence of our<br> European culture and heritage is under mortal threat.</br></br></br></p><p>The tragic<br> paradox of the obsession with free movement and the abolition of<br> national identities is that Europe in any meaningful sense will probably<br> cease to exist this century.</br></br></br></p><p>As the social revolution<br> accelerates traditional values of democracy, freedom and solidarity will<br> be replaced by conflict, sectarianism, oppression and intolerance.</br></br></p><p>Increasingly<br> Islamified, barbaric and poverty-stricken, Europe will become<br> indistinguishable from large swathes of North Africa and the Middle<br> East.<br> Even the stupendously high levels of mass immigration over the past<br> two decades are now dwarfed by the colossal flood of new arrivals that<br> has occurred since the early summer when Merkel made her woefully<br> illconceived pledge that ­Germany would welcome anyone claiming to be a<br> refugee.</br></br></br></br></br></br></br></br></p><p>She may have thought that the open-door policy would<br> provide a counter to Germany’s appalling record of aggression since the<br> 1860s but in reality by wrecking Europe’s social fabric she has added to<br> the long catalogue of Teutonic crimes.</br></br></br></p></blockquote><p>Mass migration is war. And enabling mass migration is anti-civilization, societal treason and a war crime.</p></div>",
  "content_text": "The mainstream media is finally beginning to recognize that\nperhaps they don’t actually want to live under Sharia\nor in a third world hellhole after all.\nMass immigration is on the verge of DESTROYING Europe.\nSEVERAL millennia were required to build European civilisation but its impending destruction has been the work of just a few years, carried out by a cadre of irresponsible, unpatriotic and deluded politicians led by German Chancellor Angela Merkel.\nDressing up their vandalism as\ncompassion and their cowardice as moral superiority, these leaders have\ncreated an immigration crisis so profound that the very existence of our\nEuropean culture and heritage is under mortal threat.\nThe tragic\nparadox of the obsession with free movement and the abolition of\nnational identities is that Europe in any meaningful sense will probably\ncease to exist this century.\nAs the social revolution\naccelerates traditional values of democracy, freedom and solidarity will\nbe replaced by conflict, sectarianism, oppression and intolerance.\nIncreasingly\nIslamified, barbaric and poverty-stricken, Europe will become\nindistinguishable from large swathes of North Africa and the Middle\nEast.\nEven the stupendously high levels of mass immigration over the past\ntwo decades are now dwarfed by the colossal flood of new arrivals that\nhas occurred since the early summer when Merkel made her woefully\nillconceived pledge that ­Germany would welcome anyone claiming to be a\nrefugee.\nShe may have thought that the open-door policy would\nprovide a counter to Germany’s appalling record of aggression since the\n1860s but in reality by wrecking Europe’s social fabric she has added to\nthe long catalogue of Teutonic crimes.\nMass migration is war. And enabling mass migration is anti-civilization, societal treason and a war crime.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-05T16:30:00+00:00"
}