{
  "url": "https://voxday.net/2015/11/17/mcrapey-tries-theology/",
  "scraped_at": "2025-12-17T17:34:15.820388",
  "title": "McRapey tries theology",
  "date_display": "November 17, 2015",
  "date_iso": "2015-11-17T17:00:00+00:00",
  "date_from_url": "2015-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://twitter.com/scalzi/status/666426195551088642\">The Bernie Madoff of science fiction</a> is branching out into applied theology. Shall we not all devote our attention to him and sit at his feet that he might shower his exegetical wisdom upon us?</p><blockquote class=\"tr_bq\"><p> Here’s a parable that has relevance today. It features a fellow many profess to love but fewer seem to know.</p><p><i>But he wanted to justify himself, so he asked Jesus, “And who is my neighbor?”</i></p><p>In reply Jesus said: “A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him of his clothes, beat him and went away, leaving him half dead. A priest happened to be going down the same road, and when he saw the man, he passed by on the other side. So too, a Levite, when he came to the place and saw him, passed by on the other side. But a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him. He went to him and bandaged his wounds, pouring on oil and wine. Then he put the man on his own donkey, brought him to an inn and took care of him. The next day he took out two denarii[a] and gave them to the innkeeper. ‘Look after him,’ he said, ‘and when I return, I will reimburse you for any extra expense you may have.’</p><p>“Which of these three do you think was a neighbor to the man who fell into the hands of robbers?”</p><p> The expert in the law replied, “The one who had mercy on him.”</p><p>Jesus told him, “Go and do likewise.”</p></blockquote><p>Johnny Con, you’re not a Christian. You have rejected Jesus Christ and<br> his teachings. You don’t get to misquote his words or claim that the<br> hundreds of millions of Christians, who don’t want the very people who<br> wiped out their faith across the Middle East to be given the opportunity<br> to repeat the process in the West, don’t know him.</br></br></br></br></p><p>First, the Good Samaritan helped the man. He gave him some money. He didn’t move the man into his house, provide him with room and board, then permit the man to have his wife, children, parents, and cousins move in and live off the largesse of the Good Samaritan while raping his children, stealing his cars, and trashing his yard.</p><p>To have mercy on alien people is not to pay for them to literally become your neighbor and live next door to you. One would think that a professional writer would grasp the difference between a metaphor and a literal command.</p><p>The true Christian position on refugees is to be found in Matthew 15:21-28:</p><blockquote class=\"tr_bq\"><p> <i>Leaving that place, Jesus withdrew to the region of Tyre and Sidon. A Canaanite woman from that vicinity came to him, crying out, “Lord, Son of David, have mercy on me! My daughter is demon-possessed and suffering terribly.”<br> </br></i><br> <i>Jesus did not answer a word. So his disciples came to him and urged him, “Send her away, for she keeps crying out after us.”<br> </br></i><br> <i>He answered, “I was sent only to the lost sheep of Israel.”<br> </br></i><br> <i>The woman came and knelt before him. “Lord, help me!” she said.<br> </br></i><br> <i>He replied, “It is not right to take the children’s bread and toss it to the dogs.”</i></br></br></br></br></p></blockquote><p>It is good and right to help those of other nations with “the crumbs that fall from their master’s table”. But that is all. To do more is to deprive our posterity, which Jesus himself said is not right.</p><p>John Scalzi does not know Jesus Christ. He does not know the Bible. He does not know Christian theology. He pretends to, but then, as it is said, <i>SJWs always lie</i>.</p><p>And we all know who their Father is. He misquotes Scripture for his own purposes too.</p></div>",
  "content_text": "The Bernie Madoff of science fiction\nis branching out into applied theology. Shall we not all devote our attention to him and sit at his feet that he might shower his exegetical wisdom upon us?\nHere’s a parable that has relevance today. It features a fellow many profess to love but fewer seem to know.\nBut he wanted to justify himself, so he asked Jesus, “And who is my neighbor?”\nIn reply Jesus said: “A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him of his clothes, beat him and went away, leaving him half dead. A priest happened to be going down the same road, and when he saw the man, he passed by on the other side. So too, a Levite, when he came to the place and saw him, passed by on the other side. But a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him. He went to him and bandaged his wounds, pouring on oil and wine. Then he put the man on his own donkey, brought him to an inn and took care of him. The next day he took out two denarii[a] and gave them to the innkeeper. ‘Look after him,’ he said, ‘and when I return, I will reimburse you for any extra expense you may have.’\n“Which of these three do you think was a neighbor to the man who fell into the hands of robbers?”\nThe expert in the law replied, “The one who had mercy on him.”\nJesus told him, “Go and do likewise.”\nJohnny Con, you’re not a Christian. You have rejected Jesus Christ and\nhis teachings. You don’t get to misquote his words or claim that the\nhundreds of millions of Christians, who don’t want the very people who\nwiped out their faith across the Middle East to be given the opportunity\nto repeat the process in the West, don’t know him.\nFirst, the Good Samaritan helped the man. He gave him some money. He didn’t move the man into his house, provide him with room and board, then permit the man to have his wife, children, parents, and cousins move in and live off the largesse of the Good Samaritan while raping his children, stealing his cars, and trashing his yard.\nTo have mercy on alien people is not to pay for them to literally become your neighbor and live next door to you. One would think that a professional writer would grasp the difference between a metaphor and a literal command.\nThe true Christian position on refugees is to be found in Matthew 15:21-28:\nLeaving that place, Jesus withdrew to the region of Tyre and Sidon. A Canaanite woman from that vicinity came to him, crying out, “Lord, Son of David, have mercy on me! My daughter is demon-possessed and suffering terribly.”\nJesus did not answer a word. So his disciples came to him and urged him, “Send her away, for she keeps crying out after us.”\nHe answered, “I was sent only to the lost sheep of Israel.”\nThe woman came and knelt before him. “Lord, help me!” she said.\nHe replied, “It is not right to take the children’s bread and toss it to the dogs.”\nIt is good and right to help those of other nations with “the crumbs that fall from their master’s table”. But that is all. To do more is to deprive our posterity, which Jesus himself said is not right.\nJohn Scalzi does not know Jesus Christ. He does not know the Bible. He does not know Christian theology. He pretends to, but then, as it is said,\nSJWs always lie\n.\nAnd we all know who their Father is. He misquotes Scripture for his own purposes too.",
  "tags": [
    "Christianity",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-17T17:00:00+00:00"
}