{
  "url": "https://voxday.net/2015/11/15/next-up-mayweather/",
  "scraped_at": "2025-12-17T17:33:53.334564",
  "title": "Next up: Mayweather?",
  "date_display": "November 15, 2015",
  "date_iso": "2015-11-15T09:10:00+00:00",
  "date_from_url": "2015-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>High-Lar-Ee-Us. Absolutely hilarious. <a href=\"http://mashable.com/2015/11/15/ronda-rousey-holly-holm-ufc-mma-bantamweight/\">Delusional big yapper Ronda gets KO’d</a> in two rounds.<br/></p><blockquote class=\"tr_bq\"><p> Holm easily won Round 1, bloodying Rousey’s face with stiff left<br> hands and oblique leg-kicks that slashed through her opponent’s<br> fearsome, furious frontal attacks. Rousey got in one takedown — her<br> signature move that has won her several fights within the first minute —<br> and Holm promptly wriggled out, then caught Rousey with a stinging<br> punch to the face and a left elbow across the right cheekbone.</br></br></br></br></br></p><p>But it was the beginning of Round 2 that was to be the end of<br> Rousey’s perfect 12-0 record. Still woozy and bloodied from the<br> first-round beat-down, Rousey endured a number of stiff punches and<br> kicks — most, again, to the face — as she tried to chase Holm around the<br> ring, hoping to suck the taller fighter into one of her devastating<br> submission holds.</br></br></br></br></br></p><p>That’s when Holm’s swinging left leg strike caught Rousey in the neck and sent her teetering to the mat: Holm<br> fell with Rousey to deliver a flurry of finishing hammer punches to the<br> face, but by then she was beating on an already unconscious Rousey.</br></br></p></blockquote><div style=\"text-align: center;\"> <noscript><img alt=\"UFC 193: Rousey v Holm\" class=\"\" data-caption=\"The kick that ended Ronda Rousey's perfect 12-0 record.\" data-credit-link=\"\" data-credit-name=\"\" data-credit-provider=\"Getty\" data-fragment=\"m!dfe0\" data-image=\"http://rack.3.mshcdn.com/media/ZgkyMDE1LzExLzE1L2YxL2tpY2suMDBhYWMuanBnCnAJdGh1bWIJMTIwMHg5NjAwPg/e323345b/0e1/kick.jpg\" data-micro=\"1\" data-width=\"594\" decoding=\"async\" src=\"http://rack.3.mshcdn.com/media/ZgkyMDE1LzExLzE1L2YxL2tpY2suMDBhYWMuanBnCnAJdGh1bWIJMTIwMHg5NjAwPg/e323345b/0e1/kick.jpg\" title=\"UFC 193: Rousey v Holm\"/></noscript><img alt=\"UFC 193: Rousey v Holm\" class=\"lazyload\" data-caption=\"The kick that ended Ronda Rousey's perfect 12-0 record.\" data-credit-link=\"\" data-credit-name=\"\" data-credit-provider=\"Getty\" data-fragment=\"m!dfe0\" data-image=\"http://rack.3.mshcdn.com/media/ZgkyMDE1LzExLzE1L2YxL2tpY2suMDBhYWMuanBnCnAJdGh1bWIJMTIwMHg5NjAwPg/e323345b/0e1/kick.jpg\" data-micro=\"1\" data-src=\"http://rack.3.mshcdn.com/media/ZgkyMDE1LzExLzE1L2YxL2tpY2suMDBhYWMuanBnCnAJdGh1bWIJMTIwMHg5NjAwPg/e323345b/0e1/kick.jpg\" data-width=\"594\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20594%20396%22%3E%3C/svg%3E\" title=\"UFC 193: Rousey v Holm\"><br> <i>The kick that ended Ronda Rousey’s perfect 12-0 record.</i></br></img></div><p>To paraphrase Rousey herself, I wonder how Ronda feels being beat by a woman for once? Tell us again how you’d beat Floyd Mayweather, Ronda…. I told you the woman was nothing but corporate feminist hype; now even those without any experience fighting know that she’s a fraud.</p><p>I had no respect for Rousey whatsoever because she is a liar, a charlatan, and utterly sans class. She showed no respect for her sport, no respect for far superior fighters, and no respect for her fellow female fighters either. Few athletes who have been so completely humiliated have merited it more.</p><p>On a technical note, these all-offense, no-defense fighters who rely on quickly overwhelming their opponents often surprise everyone with how completely they lose because their offensive dominance usually masks an inability to defend themselves. Once they meet a fighter they can’t simply overwhelm, they don’t tend to have a B option. Counterfighters tend to be the more complete fighters. I’ve bolded the relevant notes below, with my observations in italics.</p><blockquote class=\"tr_bq\"><p> Round 1: Holm offered up a touch of the gloves and Rousey didn’t take her eyes off her, refusing the gesture. Holm standing right in the pocket ready to engage, but it’s Rousey who gets off the first shot. Holm lands with a combo that stops Rousey for a brief moment in her tracks. <b>No full-on blitz by Rousey yet, as she has done lately.</b> [<i>She was afraid of walking into a defensive jab from a superior boxer.</i>] Another stiff left from the challenger finds a home, as does the oblique kick. Rousey with a right that stuns Holm and they clinch. To the fence and Rousey fires off several knees. Holm pushes back and Rousey unloads, but so does Holm. <b>It’s likely Holm has hit Rousey more times through two minutes than she’s been hit in over a year.</b> Rousey takes her down and is working for an armbar, but <b>Holm defends and survives the first ground exchange.</b> [<i>This is likely where Holm won the fight. The grappler was counting on getting the striker to the ground quickly.</i>] Back to the kick goes Holm and she circles away. Another kick finds a home and a straight left by Holm lands. Rousey’s face is starting to turn red from the straight shots, as <b>she’s not moving at all. She’s just eating these shots.</b> [<i>She can’t close and she couldn’t finish when she did. No Plan B.</i>] Holm loses her mouthpiece and we have a break. Holm with the clinch and she takes Rousey down, quickly getting back to her feet. Rousey looks desperate, chasing after her and she’s breathing heavily. Exchange of knees from the two, but <b>Holm is all over her</b>. [<i>By this point, Holm knew she was in control of the fight. She’d figured out that Rousey had no defenses.</i>]</p><p>FightLine scores the round 10-9 for Holm</p><p>Round 2: Rousey eats a shot right off the bat and a combo, as Holm is dominating this fight. Rousey completely whiffs on a strike and falls to her knees. She hurts her with a left and <a href=\"https://www.youtube.com/watch?v=PPzkxk8Z3Ko\">delivers a kick to the face</a> and Rousey is out cold. Rousey was out cold and asking Herb Dean what happened.</p></blockquote><p>Watch the video. It wasn’t even close. After a flailing attack ends up with her on her knees, Rousey exhibits a total lack of basic defense, as she failed to get clear before getting up and turning around. She blindly turned right into the kick, which is why she was KO’d on her feet.</p><p>After watching this, I would not only expect Holm to beat Rousey in a rematch, but I wonder if Rousey will even ask for one. That wasn’t an upset, that was a better fighter cleaning the clock of a tactically limited one.</p></div>",
  "content_text": "High-Lar-Ee-Us. Absolutely hilarious.\nDelusional big yapper Ronda gets KO’d\nin two rounds.\nHolm easily won Round 1, bloodying Rousey’s face with stiff left\nhands and oblique leg-kicks that slashed through her opponent’s\nfearsome, furious frontal attacks. Rousey got in one takedown — her\nsignature move that has won her several fights within the first minute —\nand Holm promptly wriggled out, then caught Rousey with a stinging\npunch to the face and a left elbow across the right cheekbone.\nBut it was the beginning of Round 2 that was to be the end of\nRousey’s perfect 12-0 record. Still woozy and bloodied from the\nfirst-round beat-down, Rousey endured a number of stiff punches and\nkicks — most, again, to the face — as she tried to chase Holm around the\nring, hoping to suck the taller fighter into one of her devastating\nsubmission holds.\nThat’s when Holm’s swinging left leg strike caught Rousey in the neck and sent her teetering to the mat: Holm\nfell with Rousey to deliver a flurry of finishing hammer punches to the\nface, but by then she was beating on an already unconscious Rousey.\nThe kick that ended Ronda Rousey’s perfect 12-0 record.\nTo paraphrase Rousey herself, I wonder how Ronda feels being beat by a woman for once? Tell us again how you’d beat Floyd Mayweather, Ronda…. I told you the woman was nothing but corporate feminist hype; now even those without any experience fighting know that she’s a fraud.\nI had no respect for Rousey whatsoever because she is a liar, a charlatan, and utterly sans class. She showed no respect for her sport, no respect for far superior fighters, and no respect for her fellow female fighters either. Few athletes who have been so completely humiliated have merited it more.\nOn a technical note, these all-offense, no-defense fighters who rely on quickly overwhelming their opponents often surprise everyone with how completely they lose because their offensive dominance usually masks an inability to defend themselves. Once they meet a fighter they can’t simply overwhelm, they don’t tend to have a B option. Counterfighters tend to be the more complete fighters. I’ve bolded the relevant notes below, with my observations in italics.\nRound 1: Holm offered up a touch of the gloves and Rousey didn’t take her eyes off her, refusing the gesture. Holm standing right in the pocket ready to engage, but it’s Rousey who gets off the first shot. Holm lands with a combo that stops Rousey for a brief moment in her tracks.\nNo full-on blitz by Rousey yet, as she has done lately.\n[\nShe was afraid of walking into a defensive jab from a superior boxer.\n] Another stiff left from the challenger finds a home, as does the oblique kick. Rousey with a right that stuns Holm and they clinch. To the fence and Rousey fires off several knees. Holm pushes back and Rousey unloads, but so does Holm.\nIt’s likely Holm has hit Rousey more times through two minutes than she’s been hit in over a year.\nRousey takes her down and is working for an armbar, but\nHolm defends and survives the first ground exchange.\n[\nThis is likely where Holm won the fight. The grappler was counting on getting the striker to the ground quickly.\n] Back to the kick goes Holm and she circles away. Another kick finds a home and a straight left by Holm lands. Rousey’s face is starting to turn red from the straight shots, as\nshe’s not moving at all. She’s just eating these shots.\n[\nShe can’t close and she couldn’t finish when she did. No Plan B.\n] Holm loses her mouthpiece and we have a break. Holm with the clinch and she takes Rousey down, quickly getting back to her feet. Rousey looks desperate, chasing after her and she’s breathing heavily. Exchange of knees from the two, but\nHolm is all over her\n. [\nBy this point, Holm knew she was in control of the fight. She’d figured out that Rousey had no defenses.\n]\nFightLine scores the round 10-9 for Holm\nRound 2: Rousey eats a shot right off the bat and a combo, as Holm is dominating this fight. Rousey completely whiffs on a strike and falls to her knees. She hurts her with a left and\ndelivers a kick to the face\nand Rousey is out cold. Rousey was out cold and asking Herb Dean what happened.\nWatch the video. It wasn’t even close. After a flailing attack ends up with her on her knees, Rousey exhibits a total lack of basic defense, as she failed to get clear before getting up and turning around. She blindly turned right into the kick, which is why she was KO’d on her feet.\nAfter watching this, I would not only expect Holm to beat Rousey in a rematch, but I wonder if Rousey will even ask for one. That wasn’t an upset, that was a better fighter cleaning the clock of a tactically limited one.",
  "tags": [
    "sports",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-15T09:10:00+00:00"
}