{
  "url": "https://voxday.net/2015/11/22/nfl-week-11-2/",
  "scraped_at": "2025-12-17T17:34:57.945249",
  "title": "NFL Week 11",
  "date_display": "November 22, 2015",
  "date_iso": "2015-11-22T17:00:00+00:00",
  "date_from_url": "2015-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vikings (7-2) vs Packers (6-3). Who expected THAT at the beginning of the year, or even after Week 1? This game could settle the NFC North, although the Vikes have a harder schedule going forward. I am dubious that an injured Rodgers behind a weak offensive line can keep the ferocious Vikings pass rush in check for long. Either way, it is the must-see game this week.</p><p>Also, perhaps the Packers fans can help me on this one. For years, even decades, I have heard the national media talk about the big Packers rivalry with the Bears. Recent case in point:</p><blockquote class=\"tr_bq\"><p> While the Packers’ long historic feud with the Chicago Bears commands as much or more attention in Wisconsin’s population centers (Milwaukee, Madison and Green Bay) as the team’s rivalry with the Vikings, there’s no team in Minnesota as reviled as the green and gold.</p></blockquote><p>Now, I lived in Minnesota and so it’s natural that the many Packers fans I met there – including my Packers-owning mother-in-law- consider the Vikings to be their primary rival. But the thing is, I have not met a single Packers fan who considers the Bears to be their primary rival <i>anywhere </i>in my entire life. I’ve met Packer Backers from Florida to Florence, Italy, and the moment they hear you have any connection to Minnesota, it’s on.</p><p>And on the online sites like ProFootballTalk, the Packer Backers are always going after the Vikings and the Vikings fans. They never have much to say about the Bears, not even in the comments on an article about an upcoming Packers-Bears game.</p><p>So, what is the deal? Is this simply the national media assuming that the two old NFL franchises must be rivals while not paying any attention to the real deal? Are there really many Packers fans who wouldn’t mind losing to the Vikings twice this season so long as they beat the Bears again?</p></div>",
  "content_text": "Vikings (7-2) vs Packers (6-3). Who expected THAT at the beginning of the year, or even after Week 1? This game could settle the NFC North, although the Vikes have a harder schedule going forward. I am dubious that an injured Rodgers behind a weak offensive line can keep the ferocious Vikings pass rush in check for long. Either way, it is the must-see game this week.\nAlso, perhaps the Packers fans can help me on this one. For years, even decades, I have heard the national media talk about the big Packers rivalry with the Bears. Recent case in point:\nWhile the Packers’ long historic feud with the Chicago Bears commands as much or more attention in Wisconsin’s population centers (Milwaukee, Madison and Green Bay) as the team’s rivalry with the Vikings, there’s no team in Minnesota as reviled as the green and gold.\nNow, I lived in Minnesota and so it’s natural that the many Packers fans I met there – including my Packers-owning mother-in-law- consider the Vikings to be their primary rival. But the thing is, I have not met a single Packers fan who considers the Bears to be their primary rival\nanywhere\nin my entire life. I’ve met Packer Backers from Florida to Florence, Italy, and the moment they hear you have any connection to Minnesota, it’s on.\nAnd on the online sites like ProFootballTalk, the Packer Backers are always going after the Vikings and the Vikings fans. They never have much to say about the Bears, not even in the comments on an article about an upcoming Packers-Bears game.\nSo, what is the deal? Is this simply the national media assuming that the two old NFL franchises must be rivals while not paying any attention to the real deal? Are there really many Packers fans who wouldn’t mind losing to the Vikings twice this season so long as they beat the Bears again?",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-22T17:00:00+00:00"
}