{
  "url": "https://voxday.net/2015/11/30/oh-humanity/",
  "scraped_at": "2025-12-17T17:35:52.909359",
  "title": "Oh, the humanity",
  "date_display": "November 30, 2015",
  "date_iso": "2015-11-30T13:00:00+00:00",
  "date_from_url": "2015-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating to see the American media <a href=\"http://www.startribune.com/shock-and-fear-spread-in-muslim-community-in-the-wake-of-applebee-s-attack/358476521/\">pushing the Muslim sob stories already</a>. The inevitable reaction that their violent expansion into the West will inspire hasn’t even begun yet:</p><blockquote class=\"tr_bq\"><div class=\"Text_Body\"> Asma Jama had been at the Coon Rapids Applebee’s<br> for just 25 minutes when the beer mug smashed into her face. She was<br> left with 17 stitches, a persistent headache and scars that may be<br> lifelong.</br></br></br></div><div class=\"Text_Body\"> The<br> 38-year-old Minneapolis resident returned to Minnesota last week after<br> fleeing the state for several weeks to be with family in Texas. And while Jama took the actual blow, Muslims throughout the Twin Cities have been wounded by the attack.</br></br></div><div class=\"Text_Body\"> Anti-Muslim<br> and anti-immigrant voices are a loud presence on the American political<br> scene, especially at times of crisis such as the recent terrorist<br> attacks in Paris and the arrests of suspected ISIL recruits from<br> Minnesota.</br></br></br></br></div><div class=\"Text_Body\"> And now, with a woman attacked in a popular family restaurant, Muslims can’t help but wonder: Will I be next?</div><div class=\"Text_Body\"> “It’s<br> appalling,” said Fatima Alnizami, a St. Paul native who now lives in<br> Brooklyn Park. “People are on high alert, and they think anybody wearing<br> a head scarf or a beard is a terrorist.</br></br></br></div><div class=\"Text_Body\"> Alnizami, who works at the Al-Amal School in<br> Fridley, said she hesitates to speak Arabic to her two young children in<br> public. “I have to be worried that I might be making someone angry,”<br> she said.</br></br></br></div><div class=\"Text_Body\"> “We<br> don’t feel safe,” said Ahmad Abu Atieh, director of the Islamic<br> Cultural Community Center in Minneapolis. “I worry that someone will<br> attack me. Every day.”</br></br></br></div></blockquote><div class=\"Text_Body\"> The reason they don’t feel safe is that they’ve brought their permanent war to Minnesota. There will never be peace as long as any of them remain there because they are there to conquer and rule. Anyone with even a modicum of knowledge about military history knows that Muslims <i>always </i>bring war to what they call the House of War (which is territory that has not submitted to Muslim rule); the only way any society has ever avoided this is to keep them on the outside.</div><div class=\"Text_Body\"> The Europeans who fought for centuries to keep their lands free of Muslim invaders would be utterly astonished, and horrified, at the short-sighted idiocy of what passes for the West’s leaders today. The price of Pax Americana will be generations of war and religious cleansing across the West… and that’s the best case scenario.</div><div class=\"Text_Body\"> Remember, it took 700 years for the Spanish to reclaim their homeland from the Ummayads. Sooner or later the West is either going to submit or embark on Reconquista 2.0, and the longer it procrastinates, the more vicious the struggle is going to be. And the more historically aware Muslims <a href=\"http://www.nytimes.com/2015/11/30/opinion/campaign-stops/why-i-miss-george-w-bush.html?_r=0\">know it is coming</a> because they’ve been through the process in dozens of countries before.<blockquote class=\"tr_bq\"><p> Less than a week after the Sept. 11, 2001, attacks that killed 2,996 people, President Bush held a news conference at the Islamic Center of Washington. “The face of terror is not the true faith of Islam,” he said, flanked by imams and community leaders. “Islam is peace.”</p></blockquote><p>That says it all right there. Submission is peace. Resistance is war. Choose. Those are the two options – the only two options – everyone in the West faces. It doesn’t matter whether you like those options or not, submission or resistance is all that there is. That’s the way it plays out <a href=\"https://www.washingtonpost.com/world/africa/tens-of-thousands-of-muslims-flee-christian-militias-in-central-african-republic/2014/02/07/5a1adbb2-9032-11e3-84e1-27626c5ef5fb_story.html\">every single time</a>.</p><blockquote class=\"tr_bq\"><p> Tens of thousands of Muslims are fleeing to neighboring countries by plane and truck as Christian militias stage brutal attacks, shattering the social fabric of this war-ravaged nation.</p><p>In towns and villages as well as here in the capital, Christian vigilantes wielding machetes have killed scores of Muslims, who are a minority here, and burned and looted their houses and mosques in recent days, according to witnesses, aid agencies and peacekeepers. Tens of thousands of Muslims have fled their homes.</p><p>The cycle of chaos is fast becoming one of the worst outbreaks of violence along Muslim-Christian fault lines in recent memory in sub-Saharan Africa, tensions that have also plagued countries such as Nigeria and Sudan.</p></blockquote><p>It is mysterious, is it not, that those same tensions also happen to plague Hindu countries like India and Bangladesh as well, where innocent Muslim minorities who ain’t never done nothing to nobody are also <a href=\"http://www.doctorswithoutborders.org/news-stories/special-report/bangladesh-violent-crackdown-fuels-humanitarian-crisis-unrecognized\">violently oppressed</a>? Well, surely it’s different in America than in India, and Myanmar, and Bangladesh, and Nigeria, and Serbia, and Sudan, and the Philippines, and China, and the Central African Republic….</p></div></div>",
  "content_text": "It’s fascinating to see the American media\npushing the Muslim sob stories already\n. The inevitable reaction that their violent expansion into the West will inspire hasn’t even begun yet:\nAsma Jama had been at the Coon Rapids Applebee’s\nfor just 25 minutes when the beer mug smashed into her face. She was\nleft with 17 stitches, a persistent headache and scars that may be\nlifelong.\nThe\n38-year-old Minneapolis resident returned to Minnesota last week after\nfleeing the state for several weeks to be with family in Texas. And while Jama took the actual blow, Muslims throughout the Twin Cities have been wounded by the attack.\nAnti-Muslim\nand anti-immigrant voices are a loud presence on the American political\nscene, especially at times of crisis such as the recent terrorist\nattacks in Paris and the arrests of suspected ISIL recruits from\nMinnesota.\nAnd now, with a woman attacked in a popular family restaurant, Muslims can’t help but wonder: Will I be next?\n“It’s\nappalling,” said Fatima Alnizami, a St. Paul native who now lives in\nBrooklyn Park. “People are on high alert, and they think anybody wearing\na head scarf or a beard is a terrorist.\nAlnizami, who works at the Al-Amal School in\nFridley, said she hesitates to speak Arabic to her two young children in\npublic. “I have to be worried that I might be making someone angry,”\nshe said.\n“We\ndon’t feel safe,” said Ahmad Abu Atieh, director of the Islamic\nCultural Community Center in Minneapolis. “I worry that someone will\nattack me. Every day.”\nThe reason they don’t feel safe is that they’ve brought their permanent war to Minnesota. There will never be peace as long as any of them remain there because they are there to conquer and rule. Anyone with even a modicum of knowledge about military history knows that Muslims\nalways\nbring war to what they call the House of War (which is territory that has not submitted to Muslim rule); the only way any society has ever avoided this is to keep them on the outside.\nThe Europeans who fought for centuries to keep their lands free of Muslim invaders would be utterly astonished, and horrified, at the short-sighted idiocy of what passes for the West’s leaders today. The price of Pax Americana will be generations of war and religious cleansing across the West… and that’s the best case scenario.\nRemember, it took 700 years for the Spanish to reclaim their homeland from the Ummayads. Sooner or later the West is either going to submit or embark on Reconquista 2.0, and the longer it procrastinates, the more vicious the struggle is going to be. And the more historically aware Muslims\nknow it is coming\nbecause they’ve been through the process in dozens of countries before.\nLess than a week after the Sept. 11, 2001, attacks that killed 2,996 people, President Bush held a news conference at the Islamic Center of Washington. “The face of terror is not the true faith of Islam,” he said, flanked by imams and community leaders. “Islam is peace.”\nThat says it all right there. Submission is peace. Resistance is war. Choose. Those are the two options – the only two options – everyone in the West faces. It doesn’t matter whether you like those options or not, submission or resistance is all that there is. That’s the way it plays out\nevery single time\n.\nTens of thousands of Muslims are fleeing to neighboring countries by plane and truck as Christian militias stage brutal attacks, shattering the social fabric of this war-ravaged nation.\nIn towns and villages as well as here in the capital, Christian vigilantes wielding machetes have killed scores of Muslims, who are a minority here, and burned and looted their houses and mosques in recent days, according to witnesses, aid agencies and peacekeepers. Tens of thousands of Muslims have fled their homes.\nThe cycle of chaos is fast becoming one of the worst outbreaks of violence along Muslim-Christian fault lines in recent memory in sub-Saharan Africa, tensions that have also plagued countries such as Nigeria and Sudan.\nIt is mysterious, is it not, that those same tensions also happen to plague Hindu countries like India and Bangladesh as well, where innocent Muslim minorities who ain’t never done nothing to nobody are also\nviolently oppressed\n? Well, surely it’s different in America than in India, and Myanmar, and Bangladesh, and Nigeria, and Serbia, and Sudan, and the Philippines, and China, and the Central African Republic….",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-30T13:00:00+00:00"
}