{
  "url": "https://voxday.net/2015/11/03/peak-sjw/",
  "scraped_at": "2025-12-17T17:32:18.791107",
  "title": "Peak SJW",
  "date_display": "November 3, 2015",
  "date_iso": "2015-11-03T11:16:00+00:00",
  "date_from_url": "2015-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think David French is perhaps a little optimistic here, but it is interesting to see <a href=\"http://www.nationalreview.com/article/426452/political-correctness-peaks-social-justice-liberals\">National Review lining up <i>against </i>SJWs and political correctness</a> in light of its relatively recent purgings of various contributors for their thought crimes. Perhaps the pendulum actually <i>is </i>swinging back:</p><blockquote class=\"tr_bq\"><p> While it’s always dangerous to predict when any particular cultural trend peaks, I’m pegging October 31, 2015, as peak PC. When <a href=\"http://www.nationalreview.com/article/426260/halloween-colleges-costumes-consultants?target=author&amp;tid=1274245\" rel=\"noopener\" target=\"_self\">universities actually post flow charts</a> to keep your <em>Halloween</em><br> party from being offensive, humorlessness is redefined. When students<br> are so fragile that the very thought of ethnic-themed Halloween costumes<br> leads to much-mocked YouTube “guides,” then political correctness is<br> losing its punch:</br></br></br></br></p><p>If you disagree — if you think that political correctness is gaining<br> momentum — then consider a few facts. First, the top two candidates in<br> the Republican race for president of the United States attained their<br> front-runner status by willfully, gleefully defying political<br> correctness at every turn. Ben Carson shot to the top of the polls when<br> he did the unthinkable — told the truth about guns, about Islam, about<br> resistance to mass shooters, and about abortion — without flinching.<br> It’s old news by now that Donald Trump’s supporters love him for his<br> anti-PC stands.</br></br></br></br></br></br></br></br></p></blockquote><p>Personally, I would like to think that the tide began to turn with the publication of <b><a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i>SJWs Always Lie</i></a></b>, which was published just two months before the date French pegs. But whether it has or not, it is very clear that a long march through the institutions of the West to clean them of SJW intellectual corruption is required and it is not going to be quick or easy.</p><p>And speaking of not being easy, while it’s always nice to see one’s book become a category bestseller, the fact that <a href=\"http://www.amazon.com/The-Return-Great-Depression-Vox-ebook/dp/B004OR1NS8\"><b><i>The Return of the Great Depression</i></b></a>, published in 2009, is presently the #1 bestseller in the following category, is not exactly cause for celebration.</p><ul class=\"zg_hrsr\"><li class=\"zg_hrsr_item\">      #1 in Books &gt; Business &amp; Money &gt; Economics &gt; Unemployment <b><a href=\"http://www.amazon.com/gp/bestsellers/books/1043858/ref=pd_zg_hrsr_b_1_4_last\"></a></b></li></ul></div>",
  "content_text": "I think David French is perhaps a little optimistic here, but it is interesting to see\nNational Review lining up\nagainst\nSJWs and political correctness\nin light of its relatively recent purgings of various contributors for their thought crimes. Perhaps the pendulum actually\nis\nswinging back:\nWhile it’s always dangerous to predict when any particular cultural trend peaks, I’m pegging October 31, 2015, as peak PC. When\nuniversities actually post flow charts\nto keep your\nHalloween\nparty from being offensive, humorlessness is redefined. When students\nare so fragile that the very thought of ethnic-themed Halloween costumes\nleads to much-mocked YouTube “guides,” then political correctness is\nlosing its punch:\nIf you disagree — if you think that political correctness is gaining\nmomentum — then consider a few facts. First, the top two candidates in\nthe Republican race for president of the United States attained their\nfront-runner status by willfully, gleefully defying political\ncorrectness at every turn. Ben Carson shot to the top of the polls when\nhe did the unthinkable — told the truth about guns, about Islam, about\nresistance to mass shooters, and about abortion — without flinching.\nIt’s old news by now that Donald Trump’s supporters love him for his\nanti-PC stands.\nPersonally, I would like to think that the tide began to turn with the publication of\nSJWs Always Lie\n, which was published just two months before the date French pegs. But whether it has or not, it is very clear that a long march through the institutions of the West to clean them of SJW intellectual corruption is required and it is not going to be quick or easy.\nAnd speaking of not being easy, while it’s always nice to see one’s book become a category bestseller, the fact that\nThe Return of the Great Depression\n, published in 2009, is presently the #1 bestseller in the following category, is not exactly cause for celebration.\n#1 in Books > Business & Money > Economics > Unemployment",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-03T11:16:00+00:00"
}