{
  "url": "https://voxday.net/2015/11/15/saladin-tries-little-taqiyya/",
  "scraped_at": "2025-12-17T17:33:57.080470",
  "title": "Saladin’s taqiyya",
  "date_display": "November 15, 2015",
  "date_iso": "2015-11-15T16:00:00+00:00",
  "date_from_url": "2015-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amazing that any Muslim still thinks that the West is collectively dumb enough <a href=\"https://twitter.com/saladinahmed/status/665315257049477124\">to fall for this line</a>:</p><blockquote class=\"tr_bq\"><p> Saladin Ahmed ‏@saladinahmed <br> Hey racist assholes exploiting an atrocity: Refugees from Syria, etc. are looking to *escape* this sort of violence, not to spread it.</br></p><p>Vox Day ‏@voxday <br> Give up on the taqiyya, Saladin the Liar. Refugees from Syria committed the atrocity in Paris.</br></p><p>Leandro Novaes ‏@leahn_novash<br> 3.609 retweets of his lie. It’s worrisome the amount of support the enemies of civilization can muster.</br></p><p>Vox Day ‏@voxday<br> No, Saladin the Liar is one of the SFWA’s affirmative action pets, so he gets inordinate attention.</br></p></blockquote><p>All of SJW virtue-signaling and “I’m so sorry you had to experience that” condolences from the SFWA hugbox should be amusing. It’s also fascinating how the only place those poor refugees “from Syria” could  *escape* that sort of violence was in the West, instead of any of in any of the many countries belonging to their co-religionists.</p><p>In addition to implicitly trying to pass off Islam as a race, Ahmed himself belies his own argument. Look at the books featured on his Twitter header. Are they written about Native American culture? Are they written about Norman Rockwell American culture? About <i>any</i> Western culture? Of course not. Californian immigrants californicate. Islamic immigrants islamify. That’s how mass migration works. That’s how it has <i>always </i>worked.</p><p>Take it from a Native American whose brothers are literally on the reservation today.</p><p>UPDATE: See, this is exactly why they should have been <a href=\"http://www.mirror.co.uk/news/world-news/paris-attacks-terrorist-suspect-ahmed-6836199\">sinking the damn boats</a>:</p><blockquote class=\"tr_bq\"><p> Paris attacks terrorist suspect Ahmed Almuhamed ‘was rescued near Greece after his refugee boat sunk’. According to Serbian media, a Syrian passport belonging to Ahmed Almuhamed was found at the scene of the attack at the Stade de France. Now a Greek newspaper claims to have discovered the 25-year-old and a family member, called Mohammed Almuhmed, were rescued from a wrecked migrant boat that had sunk on the journey from Syria.</p></blockquote></div>",
  "content_text": "It’s amazing that any Muslim still thinks that the West is collectively dumb enough\nto fall for this line\n:\nSaladin Ahmed ‏@saladinahmed\nHey racist assholes exploiting an atrocity: Refugees from Syria, etc. are looking to *escape* this sort of violence, not to spread it.\nVox Day ‏@voxday\nGive up on the taqiyya, Saladin the Liar. Refugees from Syria committed the atrocity in Paris.\nLeandro Novaes ‏@leahn_novash\n3.609 retweets of his lie. It’s worrisome the amount of support the enemies of civilization can muster.\nVox Day ‏@voxday\nNo, Saladin the Liar is one of the SFWA’s affirmative action pets, so he gets inordinate attention.\nAll of SJW virtue-signaling and “I’m so sorry you had to experience that” condolences from the SFWA hugbox should be amusing. It’s also fascinating how the only place those poor refugees “from Syria” could  *escape* that sort of violence was in the West, instead of any of in any of the many countries belonging to their co-religionists.\nIn addition to implicitly trying to pass off Islam as a race, Ahmed himself belies his own argument. Look at the books featured on his Twitter header. Are they written about Native American culture? Are they written about Norman Rockwell American culture? About\nany\nWestern culture? Of course not. Californian immigrants californicate. Islamic immigrants islamify. That’s how mass migration works. That’s how it has\nalways\nworked.\nTake it from a Native American whose brothers are literally on the reservation today.\nUPDATE: See, this is exactly why they should have been\nsinking the damn boats\n:\nParis attacks terrorist suspect Ahmed Almuhamed ‘was rescued near Greece after his refugee boat sunk’. According to Serbian media, a Syrian passport belonging to Ahmed Almuhamed was found at the scene of the attack at the Stade de France. Now a Greek newspaper claims to have discovered the 25-year-old and a family member, called Mohammed Almuhmed, were rescued from a wrecked migrant boat that had sunk on the journey from Syria.",
  "tags": [
    "Clash of Civilizations",
    "immigration",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-15T16:00:00+00:00"
}