{
  "url": "https://voxday.net/2015/11/27/sf-sjws-devouring-themselves/",
  "scraped_at": "2025-12-17T17:35:34.551968",
  "title": "SF-SJWs devouring themselves",
  "date_display": "November 27, 2015",
  "date_iso": "2015-11-27T20:30:00+00:00",
  "date_from_url": "2015-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ST Joshi, who is a leftist, an SF writer, and a respected H.P. Lovecraft scholar, <a href=\"http://stjoshi.org/news.html\">has come under intense SJW fire</a> for standing up for Lovecraft’s literary legacy:</p><blockquote class=\"tr_bq\"><p> 1) The World Fantasy Award is a purely literary award. It is awarded purely for literary excellence in the field of weird fiction. It commemorated Lovecraft because (a) it was created for the First World Fantasy Convention in 1975, held in Providence, R.I., which was essentially a Lovecraft convention, and (b) it acknowledges Lovecraft’s literary greatness, both intrinsically and in terms of his influence. That is all that the award “means.” The award says nothing about Lovecraft as a person (just as other awards in this and related fields say nothing about the person or character of the figures they are named for). The changing of the award is an implicit rejection of Lovecraft’s literary status. It suggests that Lovecraft’s racism is so heinous a character flaw that it negates the entirety of his literary achievement. This is one of many reasons why I find it mystifying how any genuine devotee of Lovecraft can be in favour of changing the WFA bust.</p><p>2) We have no reason to be confident that the current agitators will stop at the WFA bust. Indeed, the prime mover in the matter—Daniel José Older—has made his general contempt for Lovecraft quite clear, as when he called him a “terrible wordsmith.” (I suspect he would say much the same about Poe, Dunsany, Machen, and any other writers who don’t write the kind of slangy, faux-hipster style he favours.) It is quite evident that some of these agitators really don’t like Lovecraft as a writer and resent his fame and influence, and have seized on the one flaw of his racism to cast him out into the literary darkness. Vigilance needs to be maintained that the tarring of Lovecraft’s reputation doesn’t go any further.</p><p>3) The discarding of the WFA bust may in itself be insignificant, but it is troubling for a multitude of reasons. It is, for example, an historical error to pass condign judgment on figures of the past because they are perceived to have departed from the moral, political, and social views to which we adhere. This shows a cultural intolerance and lack of historical understanding that is very discouraging. We have not exactly attained moral and intellectual perfection ourselves, and I daresay we will be judged harshly for all manner of derelictions a hundred years from now. (We now hear of students at Princeton University—where I did graduate work in 1982–84—lobbying to have every vestige of Woodrow Wilson’s name eliminated from the campus merely because he made a few racist comments, as if these comments somehow repudiate all the significant political and diplomatic achievements of his career.)</p></blockquote><p>By the way, this is not the first time I’ve seen Ellen Datlow’s name mentioned with regards to egregious SJW lunacy. She would appear to be nearly as ideologically insane as Patrick Nielsen Hayden.</p><blockquote class=\"tr_bq\"><p> I have been led to believe that the celebrated editor<br> Ellen Datlow was a major force in getting the Lovecraft bust discarded<br> from the World Fantasy Awards. If this is so, it casts a dubious light<br> on Datlow herself. One has to wonder about the moral compass of a person<br> who has materially benefited from Lovecraft’s increasing reputation by<br> opportunistically assembling two volumes of Lovecraft-inspired fiction (Lovecraft Unbound [2009] and Lovecraft’s Monsters [2014]) and who then turns around and kicks Lovecraft figuratively in the posterior.</br></br></br></br></br></p></blockquote><p>This part was particularly amusing to me:</p><blockquote class=\"tr_bq\"><p> My dissociation with Dan Clore was not because he disagreed with me, but because he treated me in an abusive and insulting manner. He in effect stated that I was a right-wing racist bigot, even though he knows that I am a leftist.</p></blockquote><p>You don’t say! What, pray tell, do SJWs do? Ah yes, that’s right.<i> SJWs Always Lie!</i></p></div>",
  "content_text": "ST Joshi, who is a leftist, an SF writer, and a respected H.P. Lovecraft scholar,\nhas come under intense SJW fire\nfor standing up for Lovecraft’s literary legacy:\n1) The World Fantasy Award is a purely literary award. It is awarded purely for literary excellence in the field of weird fiction. It commemorated Lovecraft because (a) it was created for the First World Fantasy Convention in 1975, held in Providence, R.I., which was essentially a Lovecraft convention, and (b) it acknowledges Lovecraft’s literary greatness, both intrinsically and in terms of his influence. That is all that the award “means.” The award says nothing about Lovecraft as a person (just as other awards in this and related fields say nothing about the person or character of the figures they are named for). The changing of the award is an implicit rejection of Lovecraft’s literary status. It suggests that Lovecraft’s racism is so heinous a character flaw that it negates the entirety of his literary achievement. This is one of many reasons why I find it mystifying how any genuine devotee of Lovecraft can be in favour of changing the WFA bust.\n2) We have no reason to be confident that the current agitators will stop at the WFA bust. Indeed, the prime mover in the matter—Daniel José Older—has made his general contempt for Lovecraft quite clear, as when he called him a “terrible wordsmith.” (I suspect he would say much the same about Poe, Dunsany, Machen, and any other writers who don’t write the kind of slangy, faux-hipster style he favours.) It is quite evident that some of these agitators really don’t like Lovecraft as a writer and resent his fame and influence, and have seized on the one flaw of his racism to cast him out into the literary darkness. Vigilance needs to be maintained that the tarring of Lovecraft’s reputation doesn’t go any further.\n3) The discarding of the WFA bust may in itself be insignificant, but it is troubling for a multitude of reasons. It is, for example, an historical error to pass condign judgment on figures of the past because they are perceived to have departed from the moral, political, and social views to which we adhere. This shows a cultural intolerance and lack of historical understanding that is very discouraging. We have not exactly attained moral and intellectual perfection ourselves, and I daresay we will be judged harshly for all manner of derelictions a hundred years from now. (We now hear of students at Princeton University—where I did graduate work in 1982–84—lobbying to have every vestige of Woodrow Wilson’s name eliminated from the campus merely because he made a few racist comments, as if these comments somehow repudiate all the significant political and diplomatic achievements of his career.)\nBy the way, this is not the first time I’ve seen Ellen Datlow’s name mentioned with regards to egregious SJW lunacy. She would appear to be nearly as ideologically insane as Patrick Nielsen Hayden.\nI have been led to believe that the celebrated editor\nEllen Datlow was a major force in getting the Lovecraft bust discarded\nfrom the World Fantasy Awards. If this is so, it casts a dubious light\non Datlow herself. One has to wonder about the moral compass of a person\nwho has materially benefited from Lovecraft’s increasing reputation by\nopportunistically assembling two volumes of Lovecraft-inspired fiction (Lovecraft Unbound [2009] and Lovecraft’s Monsters [2014]) and who then turns around and kicks Lovecraft figuratively in the posterior.\nThis part was particularly amusing to me:\nMy dissociation with Dan Clore was not because he disagreed with me, but because he treated me in an abusive and insulting manner. He in effect stated that I was a right-wing racist bigot, even though he knows that I am a leftist.\nYou don’t say! What, pray tell, do SJWs do? Ah yes, that’s right.\nSJWs Always Lie!",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-27T20:30:00+00:00"
}