{
  "url": "https://voxday.net/2015/11/06/sjws-stalking-stem-figure/",
  "scraped_at": "2025-12-17T17:32:44.814904",
  "title": "SJWs stalking STEM figure",
  "date_display": "November 6, 2015",
  "date_iso": "2015-11-06T10:22:00+00:00",
  "date_from_url": "2015-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div> It’s not just in Open Source Software that SJWs are actively looking to discredit and disemploy individuals they have targeted. I received this just yesterday.</div><blockquote class=\"tr_bq\"><div> SJWs are attempting to railroad another STEM figure out<br> of his job. I can’t divulge how I know this, but I have direct inside<br> information. One individual in particular is gathering support by digging for<br> information and asking for legal advice. They are attempting to<br> circumvent the statute of limitations so<br> they can deprive this man of his job.<p>This is<br> happening, because of the easy success SJWs had ousting Tim Hunt and<br> Geoff Marcy. One SJW actually said, <i>“Now that we’ve brought<br> down one of the biggest men in science, who can we go after next?”</br></i><br> They’re LOOKING for people to go after. It’s just as you said. Every<br> time one of these men apologizes, it just emboldens the SJWs.</br></br></br></br></p></br></br></br></br></br></div></blockquote><p>Someone needs to get that man a copy of SJWAL, stat! And be sure that you provide anyone you know to be under attack with a link to <a href=\"http://www.voxday.net/mart/SJW_Attack_Survival_Guide.pdf\">The SJW Attack Survival Guide (PDF).</a></p><p>Note that apologizing not only make it worse for the target apologizing, but for the subsequent targets as well.</p><p>Do not apologize. Never apologize. Don’t even let the merest glimmer of the notion think about crossing your mind. Own your actions, own your words, and stand by them under fire.</p></div>",
  "content_text": "It’s not just in Open Source Software that SJWs are actively looking to discredit and disemploy individuals they have targeted. I received this just yesterday.\nSJWs are attempting to railroad another STEM figure out\nof his job. I can’t divulge how I know this, but I have direct inside\ninformation. One individual in particular is gathering support by digging for\ninformation and asking for legal advice. They are attempting to\ncircumvent the statute of limitations so\nthey can deprive this man of his job.\nThis is\nhappening, because of the easy success SJWs had ousting Tim Hunt and\nGeoff Marcy. One SJW actually said,\n“Now that we’ve brought\ndown one of the biggest men in science, who can we go after next?”\nThey’re LOOKING for people to go after. It’s just as you said. Every\ntime one of these men apologizes, it just emboldens the SJWs.\nSomeone needs to get that man a copy of SJWAL, stat! And be sure that you provide anyone you know to be under attack with a link to\nThe SJW Attack Survival Guide (PDF).\nNote that apologizing not only make it worse for the target apologizing, but for the subsequent targets as well.\nDo not apologize. Never apologize. Don’t even let the merest glimmer of the notion think about crossing your mind. Own your actions, own your words, and stand by them under fire.",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-06T10:22:00+00:00"
}