{
  "url": "https://voxday.net/2015/11/13/star-wars-worked/",
  "scraped_at": "2025-12-17T17:33:38.081823",
  "title": "Star Wars worked",
  "date_display": "November 13, 2015",
  "date_iso": "2015-11-13T13:00:00+00:00",
  "date_from_url": "2015-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The good news is that the Strategic Defense Initiative appears to have worked well enough to deter potential enemies from planning to launch orbital missiles. The bad news is, there is <a href=\"https://www.rt.com/news/321640-leaked-russian-nuclear-torpedo/\">a developing alternative to space-based attacks</a> that even the U.S. Navy’s superiority at sea can’t do much about.</p><blockquote class=\"tr_bq\"><p> The Kremlin has confirmed “some secret data” was accidentally leaked when Russian TV stations broadcast material apparently showing blueprints from a nuclear torpedo, designed to be used against enemy coastal installations.</p><p>During President Vladimir Putin’s meeting with military officials in Sochi, where the development of Russia’s military capabilities were being discussed, a number of TV crews were able to capture footage of a paper that was certainly not meant for public viewing.</p><p>The presentation slide titled “Ocean Multipurpose System: Status-6” showed some drawings of a new nuclear submarine weapons system. It is apparently designed to bypass NATO radars and any existing missile defense systems, while also causing heavy damage to “important economic facilities” along the enemy’s coastal regions.</p><p>The footnote to the slide stated that Status-6 is intended to cause “assured unacceptable damage” to an adversary force. Its detonation “in the area of the enemy coast” would result in “extensive zones of radioactive contamination” that would ensure that the region would not be used for “military, economic, business or other activity” for a “long time.”</p><p>According to the blurred information provided in the slide, the system represents a massive torpedo, designated as “self-propelled underwater vehicle,” with a range of up to 10 thousand kilometers and capable of operating at a depth of up to 1,000 meters.</p></blockquote><p>“Accidentally leaked.” Right. Anyhow, this is particularly interesting because we had a submission for <i>Riding the Red Horse vol. 2</i> that had to be withdrawn due to the fact that it was still under some sort of embargo by the naval service concerned. The torpedoes it described were not so massive, but they were fast and land-launched, and my impression was that they were designed to be used to deny control of the sea in places like the Persian Gulf, particularly around the Strait of Hormuz.</p><p>4GW isn’t the only challenge facing the U.S. Armed Forces. The naval dominance enjoyed by the U.S. Navy since the dawn of the aircraft carrier is on the verge of ending, as the combination of aircraft-killing lasers and long-distance, land-launched torpedoes looks likely to render them as vulnerable, and therefore outdated, as battleships in WWII.</p><p>And since the United States is a maritime power, the loss of naval superiority necessarily means the loss of its superpower status.</p></div>",
  "content_text": "The good news is that the Strategic Defense Initiative appears to have worked well enough to deter potential enemies from planning to launch orbital missiles. The bad news is, there is\na developing alternative to space-based attacks\nthat even the U.S. Navy’s superiority at sea can’t do much about.\nThe Kremlin has confirmed “some secret data” was accidentally leaked when Russian TV stations broadcast material apparently showing blueprints from a nuclear torpedo, designed to be used against enemy coastal installations.\nDuring President Vladimir Putin’s meeting with military officials in Sochi, where the development of Russia’s military capabilities were being discussed, a number of TV crews were able to capture footage of a paper that was certainly not meant for public viewing.\nThe presentation slide titled “Ocean Multipurpose System: Status-6” showed some drawings of a new nuclear submarine weapons system. It is apparently designed to bypass NATO radars and any existing missile defense systems, while also causing heavy damage to “important economic facilities” along the enemy’s coastal regions.\nThe footnote to the slide stated that Status-6 is intended to cause “assured unacceptable damage” to an adversary force. Its detonation “in the area of the enemy coast” would result in “extensive zones of radioactive contamination” that would ensure that the region would not be used for “military, economic, business or other activity” for a “long time.”\nAccording to the blurred information provided in the slide, the system represents a massive torpedo, designated as “self-propelled underwater vehicle,” with a range of up to 10 thousand kilometers and capable of operating at a depth of up to 1,000 meters.\n“Accidentally leaked.” Right. Anyhow, this is particularly interesting because we had a submission for\nRiding the Red Horse vol. 2\nthat had to be withdrawn due to the fact that it was still under some sort of embargo by the naval service concerned. The torpedoes it described were not so massive, but they were fast and land-launched, and my impression was that they were designed to be used to deny control of the sea in places like the Persian Gulf, particularly around the Strait of Hormuz.\n4GW isn’t the only challenge facing the U.S. Armed Forces. The naval dominance enjoyed by the U.S. Navy since the dawn of the aircraft carrier is on the verge of ending, as the combination of aircraft-killing lasers and long-distance, land-launched torpedoes looks likely to render them as vulnerable, and therefore outdated, as battleships in WWII.\nAnd since the United States is a maritime power, the loss of naval superiority necessarily means the loss of its superpower status.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-13T13:00:00+00:00"
}