{
  "url": "https://voxday.net/2015/11/08/the-essence-of-sjw/",
  "scraped_at": "2025-12-17T17:32:59.366327",
  "title": "The essence of SJW",
  "date_display": "November 8, 2015",
  "date_iso": "2015-11-08T13:00:00+00:00",
  "date_from_url": "2015-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This SJW <a href=\"https://twitter.com/gawkd1/status/663299415071924224\">summed up the core essence of social justice</a> and the reason for social justice convergence beautifully in his response to my tweet about the collapse of North Heights Lutheran:</p><blockquote class=\"tr_bq\"><p> We have no issues here. Backwards thinking congregations look to be the problem. I’m sorry if any religion cannot be progressive then it should die and quickly.</p></blockquote><p>It is very important, it is VITAL, to understand this point. If any religion, or game, or media platform, or chess club, or university, or corporation, or institution, or organization cannot be progressive, <i>then it should die and quickly</i>.</p><p>SJWs envision one of two scenarios when they invade an organization. They will either coopt it and converge it, or they will kill it.</p><p>If you do not understand that, if you do not understand that they would rather destroy the organization than permit it to survive as a bastion of crimethink and badfeelz, you will almost inevitably lose. That is why the SJWs in science fiction were willing to burn down five Hugo categories rather than permit them to be recaptured by anti-progressive forces.</p><p>They were not only willing to do so, they celebrated the fact, because if a Hugo Award category cannot be progressive, then it should die and quickly.</p></div>",
  "content_text": "This SJW\nsummed up the core essence of social justice\nand the reason for social justice convergence beautifully in his response to my tweet about the collapse of North Heights Lutheran:\nWe have no issues here. Backwards thinking congregations look to be the problem. I’m sorry if any religion cannot be progressive then it should die and quickly.\nIt is very important, it is VITAL, to understand this point. If any religion, or game, or media platform, or chess club, or university, or corporation, or institution, or organization cannot be progressive,\nthen it should die and quickly\n.\nSJWs envision one of two scenarios when they invade an organization. They will either coopt it and converge it, or they will kill it.\nIf you do not understand that, if you do not understand that they would rather destroy the organization than permit it to survive as a bastion of crimethink and badfeelz, you will almost inevitably lose. That is why the SJWs in science fiction were willing to burn down five Hugo categories rather than permit them to be recaptured by anti-progressive forces.\nThey were not only willing to do so, they celebrated the fact, because if a Hugo Award category cannot be progressive, then it should die and quickly.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-08T13:00:00+00:00"
}