{
  "url": "https://voxday.net/2015/11/10/the-price-of-free-trade/",
  "scraped_at": "2025-12-17T17:33:12.364842",
  "title": "The price of free trade",
  "date_display": "November 10, 2015",
  "date_iso": "2015-11-10T09:59:00+00:00",
  "date_from_url": "2015-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember when the idea was that offshoring all the manufacturing jobs would lead to better, higher-paying jobs in technology? Yeah, <a href=\"http://www.computerworld.com/article/3002681/it-outsourcing/fury-and-fear-in-ohio-as-it-jobs-go-to-india.html?phint=newt%3Dcomputerworld_dailynews&amp;phint=idg_eid%3D6f5f9ad15cb3fb1b04f61644518f990e#tk.CTWNLE_nlt_dailyam_2015-11-09\">about that….</a></p><blockquote class=\"tr_bq\"><p> The IT workers at Cengage Learning in the company’s Mason, Ohio offices learned of their fates game-show style. First, they were told to gather in a large conference room. There were vague remarks from an IT executive about a “transition.” Slides were shown that listed employee names, directing them to one of three rooms where they would be told specifically what was happening to them. Some employees were cold with worry.</p><p>The biggest group, those getting pink slips, were told to remain in the large conference room. Workers directed to go through what we’ll call Door No. 2, were offered employment with IT offshore outsourcing firm Cognizant. That was the smallest group. And those sent through Door No. 3 remained employed in Cengage’s IT department. This happened in mid-October.</p><p>“I was so furious,” said one of the IT workers over what happened. It seemed “surreal,” said another. There was disbelief, but little surprise. Cengage, a major producer of educational content and services, had outsourced accounting services earlier in the year. The IT workers rightly believed they were next.</p><p>The employees were warned that speaking to the news media meant loss of severance. Despite their fears, they want their story told. They want people to know what’s happening to IT jobs in the heartland. They don’t want the offshoring of their livelihoods to pass in silence.</p><p>The Web-based workers that the Cengage employees are training to take over their jobs are believed to be in India. Cognizant applies for thousands of H-1B visas annually, and is one of<br> the top three users of the visa, according to government data. Cengage<br> employees reached for comment didn’t know what visa, if any, the<br> contract workers in their offices were using.</br></br></br></p></blockquote><p>There are four things you need to keep in mind if you are an ardent free trader:</p><ol><li>The arguments justifying free trade have always been entirely theoretical, not empirical. In this way, they are no different than the incorrect pre-scientific logical conclusions that were subsequently proven to be false by modern science. At the time they were formulated, inexpensive shipping, the free movement of capital, and the mass movement of labor were unknown.</li><li>The USA historically enjoyed its fastest periods of economic growth under protectionist, restricted-immigration periods.</li><li>The post-WWII growth was not the result of any trade or economic policies, but a positive application of Broken Window theory. Every other industrial nation had its industrial capacity smashed, so the US benefited from an intrinsic infrastructural advantage for around 25 years.</li><li>Free trade levels all prices throughout the market. That’s why a cashier in Miami gets paid about the same amount as a cashier in Portland. Even if free trade increases the overall amount of global economic growth, in doing so, it necessarily reduces wages and standards of living in the wealthier nations to bring them more in line with the wages and standards of living in the poorest nations.</li></ol><p>Look, I was an ardent theoretical free trader for decades. I know the pro-free trade arguments better than you do; my father gave me <i>Free to Choose</i> to read when I was ten years old. But the fact is, the theoretical arguments are incorrect; the conclusions their logic predicted have turned out to be observably wrong.</p><p>And perhaps you remember what I wrote about how half of all young Americans will have to leave the country in order to find work under a true global free trade regime?  The stage for that is already being set.</p><blockquote class=\"tr_bq\"><p> Offshore outsourcing is having “a fairly strong impact” on IT employment, said Janulaitis. Students coming out of college are facing trouble starting a career “and a lot of that is driven by jobs that are taken by non-U.S. nationals in our economy, and a lot of that is H-1B [visa holders],” he said.</p></blockquote></div>",
  "content_text": "Remember when the idea was that offshoring all the manufacturing jobs would lead to better, higher-paying jobs in technology? Yeah,\nabout that….\nThe IT workers at Cengage Learning in the company’s Mason, Ohio offices learned of their fates game-show style. First, they were told to gather in a large conference room. There were vague remarks from an IT executive about a “transition.” Slides were shown that listed employee names, directing them to one of three rooms where they would be told specifically what was happening to them. Some employees were cold with worry.\nThe biggest group, those getting pink slips, were told to remain in the large conference room. Workers directed to go through what we’ll call Door No. 2, were offered employment with IT offshore outsourcing firm Cognizant. That was the smallest group. And those sent through Door No. 3 remained employed in Cengage’s IT department. This happened in mid-October.\n“I was so furious,” said one of the IT workers over what happened. It seemed “surreal,” said another. There was disbelief, but little surprise. Cengage, a major producer of educational content and services, had outsourced accounting services earlier in the year. The IT workers rightly believed they were next.\nThe employees were warned that speaking to the news media meant loss of severance. Despite their fears, they want their story told. They want people to know what’s happening to IT jobs in the heartland. They don’t want the offshoring of their livelihoods to pass in silence.\nThe Web-based workers that the Cengage employees are training to take over their jobs are believed to be in India. Cognizant applies for thousands of H-1B visas annually, and is one of\nthe top three users of the visa, according to government data. Cengage\nemployees reached for comment didn’t know what visa, if any, the\ncontract workers in their offices were using.\nThere are four things you need to keep in mind if you are an ardent free trader:\nThe arguments justifying free trade have always been entirely theoretical, not empirical. In this way, they are no different than the incorrect pre-scientific logical conclusions that were subsequently proven to be false by modern science. At the time they were formulated, inexpensive shipping, the free movement of capital, and the mass movement of labor were unknown.\nThe USA historically enjoyed its fastest periods of economic growth under protectionist, restricted-immigration periods.\nThe post-WWII growth was not the result of any trade or economic policies, but a positive application of Broken Window theory. Every other industrial nation had its industrial capacity smashed, so the US benefited from an intrinsic infrastructural advantage for around 25 years.\nFree trade levels all prices throughout the market. That’s why a cashier in Miami gets paid about the same amount as a cashier in Portland. Even if free trade increases the overall amount of global economic growth, in doing so, it necessarily reduces wages and standards of living in the wealthier nations to bring them more in line with the wages and standards of living in the poorest nations.\nLook, I was an ardent theoretical free trader for decades. I know the pro-free trade arguments better than you do; my father gave me\nFree to Choose\nto read when I was ten years old. But the fact is, the theoretical arguments are incorrect; the conclusions their logic predicted have turned out to be observably wrong.\nAnd perhaps you remember what I wrote about how half of all young Americans will have to leave the country in order to find work under a true global free trade regime?  The stage for that is already being set.\nOffshore outsourcing is having “a fairly strong impact” on IT employment, said Janulaitis. Students coming out of college are facing trouble starting a career “and a lot of that is driven by jobs that are taken by non-U.S. nationals in our economy, and a lot of that is H-1B [visa holders],” he said.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-10T09:59:00+00:00"
}