{
  "url": "https://voxday.net/2015/11/21/the-book-is-sophomoric-author-is-inep/",
  "scraped_at": "2025-12-17T17:34:51.328714",
  "title": "The book is sophomoric. The author is inept.",
  "date_display": "November 21, 2015",
  "date_iso": "2015-11-21T20:30:00+00:00",
  "date_from_url": "2015-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The sad thing is, Richard Dawkins doesn’t know it because he resolutely runs from all substantive criticism in favor of hiding in his hug box:</p><blockquote class=\"tr_bq\"><p> Richard Dawkins @RichardDawkins<br> The God Delusion accused of being a “sophomoric” book. Well, is there any evidence for God that an intelligent sophomore couldn’t refute?</br></p><p>Vox Day @voxday<br> Considerable. Your arguments are so inept, some don’t even qualify as arguments.You don’t even know what “evidence” is.</br></p><p>Vox Day @voxday<br> I blew away your “religion causes war” argument once and for all because you simply don’t know history. 6.98%, not 100%.</br></p><p>Vox Day ‏@voxday<br> Your worst “argument” was the appeal to Alfred Hitchcock. That’s a logical fallacy that doesn’t even have a name.</br></p><p>Vox Day @voxday<br> Look, atheists, you’re going to need much better champions than inept rhetoricians in over their heads like @RichardDawkins and @SamHarris.</br></p></blockquote><p></p></div>",
  "content_text": "The sad thing is, Richard Dawkins doesn’t know it because he resolutely runs from all substantive criticism in favor of hiding in his hug box:\nRichard Dawkins @RichardDawkins\nThe God Delusion accused of being a “sophomoric” book. Well, is there any evidence for God that an intelligent sophomore couldn’t refute?\nVox Day @voxday\nConsiderable. Your arguments are so inept, some don’t even qualify as arguments.You don’t even know what “evidence” is.\nVox Day @voxday\nI blew away your “religion causes war” argument once and for all because you simply don’t know history. 6.98%, not 100%.\nVox Day ‏@voxday\nYour worst “argument” was the appeal to Alfred Hitchcock. That’s a logical fallacy that doesn’t even have a name.\nVox Day @voxday\nLook, atheists, you’re going to need much better champions than inept rhetoricians in over their heads like @RichardDawkins and @SamHarris.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-21T20:30:00+00:00"
}