{
  "url": "https://voxday.net/2015/11/17/the-third-collaboration/",
  "scraped_at": "2025-12-17T17:34:13.893056",
  "title": "The third collaboration",
  "date_display": "November 17, 2015",
  "date_iso": "2015-11-17T13:00:00+00:00",
  "date_from_url": "2015-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday <a href=\"http://www.dangerandplay.com/2015/11/16/mike-cernovich-signs-book-deal-with-castalia-house/\">Mike Cernovich announced</a> that he would be publishing his next book, <i>Last Man Standing</i>, with Castalia House. He also announced that he had accepted a position as Editor-at-Large with Castalia House. What he did not mention, at my request, is that he is also working with Castalia House on a third project. I asked him not to mention it because I wanted to tell you myself.</p><p>As dark lords go, I am, as most of you know, unusually civil. Having asked one of my GGinParis co-hosts to write a foreword for one of my books, I thought it would be a grievous breach of etiquette to fail to request the same of the other. So, I am pleased to announce that the aforementioned Editor-at-Large has already written the foreword for my next book, which I have written with a fellow American Indian (albeit one from a different tribe). It is expected to be released before the end of year. It is a hard-hitting book in the vein of SJWAL, but addresses an even more important and controversial subject: the politics of American immigration.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/11/cuck_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/11/cuck_480.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/11/cuck_480.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p><i>The Preamble to the Constitution of the United States of America contains an extremely important phrase that is almost always ignored by those who appeal to it, or to the men who wrote it, in defense of immigration. It states:</i><br> <i><br/></i>We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.<br> <i><br>The key phrase is this: “to ourselves and our posterity.” The blessings of liberty are not to be secured to all the nations of the world, to the tired and huddled masses, or to the wretched refuse of the teeming shores of other lands. They are to be secured to our children, and their children, and their children’s children.</br></i><br> <i><br>To sacrifice their interests to the interests of children in other lands is to betray both past and future America. It is to permit an alien posterity, like the newly hatched cuckoo in another bird’s nest, to eliminate our own, and in doing so, defeat the purpose of the Constitution. It is, like the cuckolded husband, to raise the children of another man instead of one’s sons and daughters. It is, in a word, <b>cuckservative</b>.</br></i></br></br></br></p><p><i>Cuckservative: How “Conservatives” Betrayed America </i>will be published in December by Castalia House.<i> </i></p></div>",
  "content_text": "Yesterday\nMike Cernovich announced\nthat he would be publishing his next book,\nLast Man Standing\n, with Castalia House. He also announced that he had accepted a position as Editor-at-Large with Castalia House. What he did not mention, at my request, is that he is also working with Castalia House on a third project. I asked him not to mention it because I wanted to tell you myself.\nAs dark lords go, I am, as most of you know, unusually civil. Having asked one of my GGinParis co-hosts to write a foreword for one of my books, I thought it would be a grievous breach of etiquette to fail to request the same of the other. So, I am pleased to announce that the aforementioned Editor-at-Large has already written the foreword for my next book, which I have written with a fellow American Indian (albeit one from a different tribe). It is expected to be released before the end of year. It is a hard-hitting book in the vein of SJWAL, but addresses an even more important and controversial subject: the politics of American immigration.\nThe Preamble to the Constitution of the United States of America contains an extremely important phrase that is almost always ignored by those who appeal to it, or to the men who wrote it, in defense of immigration. It states:\nWe the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\nThe key phrase is this: “to ourselves and our posterity.” The blessings of liberty are not to be secured to all the nations of the world, to the tired and huddled masses, or to the wretched refuse of the teeming shores of other lands. They are to be secured to our children, and their children, and their children’s children.\nTo sacrifice their interests to the interests of children in other lands is to betray both past and future America. It is to permit an alien posterity, like the newly hatched cuckoo in another bird’s nest, to eliminate our own, and in doing so, defeat the purpose of the Constitution. It is, like the cuckolded husband, to raise the children of another man instead of one’s sons and daughters. It is, in a word,\ncuckservative\n.\nCuckservative: How “Conservatives” Betrayed America\nwill be published in December by Castalia House.",
  "tags": [
    "books",
    "Castalia House",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-17T13:00:00+00:00"
}