{
  "url": "https://voxday.net/2015/11/04/two-courses-two-prices/",
  "scraped_at": "2025-12-17T17:32:32.574216",
  "title": "Two courses, two prices",
  "date_display": "November 4, 2015",
  "date_iso": "2015-11-04T17:11:00+00:00",
  "date_from_url": "2015-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My partners are about ready to take over the responsibility for the Game Dev course; the animated ad is done, and they’re getting their web site and order processing updated, so if you want to take advantage of <a href=\"http://www.castaliahouse.com/downloads/game-development-course/\">the $150 price for the 20-hour course</a>, this is your final opportunity. The price will go up to $199 next week.</p><p>However, even if you’re interested, you may want to hear about an even better offer, especially if you’re interested in entrepreneurship. My partners, as it happens, are going to be offering a Business Startup course of their own; one of them ran Red Herring in Europe and Asia for years before striking out on his own and he is one of the best-connected people in the fields of technology and technology-funding walking the planet. From Skype to Google, you name it, he knows the people who started them and first funded them.</p><p>I’ve learned a tremendous amount from him over the years, and managed to convince him that there are many people who would benefit from tapping into the knowledge and experience he has picked up over the years. His course will probably run 90 minutes per session rather than two hours, but it will be in the same basic format and will feature even bigger names than my course will. It will also be priced at $199 per seat and will begin sometime in Q1 2016.</p><p>Anyhow, I’ve already made reserved seats in the Game Dev course available for free to the Brainstorm Annual members. After our last closed event, a number of the Brainstormers indicated that they would like to attend the Business Startup course, so I spoke with my partner and he agreed that all Annual Brainstorm members will be permitted to attend his course for free as well. The one difference is that while Annual seats can be given to friends and family for the Game Dev course, only the actual Annual member will be permitted to attend the Business Startup course.</p><p>So, if you were giving any thought to <a href=\"http://www.castaliahouse.com/downloads/brainstorm-annual/\">signing up for Brainstorm</a> and you’re interested in entrepreneurship, this is one more reason to give it a shot. In addition to the two courses worth a combined $400, you’ll also be able to attend the closed Brainstorm events, such as the upcoming one on November 14th with Mike Cernovich, where we’ll be discussing the current state of the publishing industry and how one can best take advantage of its vicissitudes.</p><p>And, of course, I will be looking to continue to add value to a Brainstorm membership as time goes on. Stickwick has gone a little overboard in her proposed presentation on dark matter, as it has transmogrified into a book that Castalia will be publishing next year, so that planned event will be delayed until the spring. On the plus side, however, we will be providing the book to all the members in order to facilitate both a meaningful discussion and informed questions.</p><p>In largely unrelated news, Castalia has launched Wargame Wednesdays today, kicking off with <a href=\"http://www.castaliahouse.com/ye-olyde-school-donald-featherstones-war-games-through-the-ages-series/\">a review of a set of military history books</a> by Donald Featherstone  that I desperately need to get my hands on:</p><blockquote class=\"tr_bq\"><p> Even though the scope of the series precludes in-depth historical background as a young student I found the series useful as a beginning reference for various papers and as a gamer I appreciated the emphasis on playing an army using the tactics and dealing with the limitations faced by the historical commanders or in Donald Featherstone’s own words from the first volume’s introduction: “Each section details the technique and styles of fighting of the various nations and armies and offers suggestions how this can best be simulated on a table-top battlefield.” He goes on to explain that war gamers take great care in researching their armies, paint them as accurately as possible to create the most reasonable simulation then it “…all falls down at one critical point – unable to move under their own volition, the small model soldiers are strategically and tactically directed by the war gamer himself, who maneuvers his armies with a military hindsight denied to their real-life commanders of long ago.” The figures on the table top may be dressed as Romans and Greeks but they are played using tactics “that would have done credit to Wellington in the Peninsula, Jackson in the Shenandoah Valley or Montgomery in Libya”. Featherstone then gives the example of a gamer choosing to collect and fight a Roman army against Britons or Gauls and after reading the relevant sections would “…know that they will advance in a certain formation, that they will hurl their pila and then come to close quarters with the gladius. After a simulated 15 minutes of fighting, they will be withdrawn and a fresh century or cohort thrown in to take their place.” On the other hand their enemies “…will fight in a desperate and ferocious fashion rather resembling the headlong charges of the Dervishes in the Sudan towards the end of the 19th century”.</p><p>Each volume is slightly different in its methodology ways, whereas the first volume covers each army separately the second volume groups the subject matter into wars, while the third volume is organized by campaigns from the French Revolution to Waterloo, though the final chapters cover the War with America, 1812-1815, the U.S. – Mexican War of 1846-1848, the Crimean War and ends with the War of Austria with France and Piedmont in 1859.</p></blockquote></div>",
  "content_text": "My partners are about ready to take over the responsibility for the Game Dev course; the animated ad is done, and they’re getting their web site and order processing updated, so if you want to take advantage of\nthe $150 price for the 20-hour course\n, this is your final opportunity. The price will go up to $199 next week.\nHowever, even if you’re interested, you may want to hear about an even better offer, especially if you’re interested in entrepreneurship. My partners, as it happens, are going to be offering a Business Startup course of their own; one of them ran Red Herring in Europe and Asia for years before striking out on his own and he is one of the best-connected people in the fields of technology and technology-funding walking the planet. From Skype to Google, you name it, he knows the people who started them and first funded them.\nI’ve learned a tremendous amount from him over the years, and managed to convince him that there are many people who would benefit from tapping into the knowledge and experience he has picked up over the years. His course will probably run 90 minutes per session rather than two hours, but it will be in the same basic format and will feature even bigger names than my course will. It will also be priced at $199 per seat and will begin sometime in Q1 2016.\nAnyhow, I’ve already made reserved seats in the Game Dev course available for free to the Brainstorm Annual members. After our last closed event, a number of the Brainstormers indicated that they would like to attend the Business Startup course, so I spoke with my partner and he agreed that all Annual Brainstorm members will be permitted to attend his course for free as well. The one difference is that while Annual seats can be given to friends and family for the Game Dev course, only the actual Annual member will be permitted to attend the Business Startup course.\nSo, if you were giving any thought to\nsigning up for Brainstorm\nand you’re interested in entrepreneurship, this is one more reason to give it a shot. In addition to the two courses worth a combined $400, you’ll also be able to attend the closed Brainstorm events, such as the upcoming one on November 14th with Mike Cernovich, where we’ll be discussing the current state of the publishing industry and how one can best take advantage of its vicissitudes.\nAnd, of course, I will be looking to continue to add value to a Brainstorm membership as time goes on. Stickwick has gone a little overboard in her proposed presentation on dark matter, as it has transmogrified into a book that Castalia will be publishing next year, so that planned event will be delayed until the spring. On the plus side, however, we will be providing the book to all the members in order to facilitate both a meaningful discussion and informed questions.\nIn largely unrelated news, Castalia has launched Wargame Wednesdays today, kicking off with\na review of a set of military history books\nby Donald Featherstone  that I desperately need to get my hands on:\nEven though the scope of the series precludes in-depth historical background as a young student I found the series useful as a beginning reference for various papers and as a gamer I appreciated the emphasis on playing an army using the tactics and dealing with the limitations faced by the historical commanders or in Donald Featherstone’s own words from the first volume’s introduction: “Each section details the technique and styles of fighting of the various nations and armies and offers suggestions how this can best be simulated on a table-top battlefield.” He goes on to explain that war gamers take great care in researching their armies, paint them as accurately as possible to create the most reasonable simulation then it “…all falls down at one critical point – unable to move under their own volition, the small model soldiers are strategically and tactically directed by the war gamer himself, who maneuvers his armies with a military hindsight denied to their real-life commanders of long ago.” The figures on the table top may be dressed as Romans and Greeks but they are played using tactics “that would have done credit to Wellington in the Peninsula, Jackson in the Shenandoah Valley or Montgomery in Libya”. Featherstone then gives the example of a gamer choosing to collect and fight a Roman army against Britons or Gauls and after reading the relevant sections would “…know that they will advance in a certain formation, that they will hurl their pila and then come to close quarters with the gladius. After a simulated 15 minutes of fighting, they will be withdrawn and a fresh century or cohort thrown in to take their place.” On the other hand their enemies “…will fight in a desperate and ferocious fashion rather resembling the headlong charges of the Dervishes in the Sudan towards the end of the 19th century”.\nEach volume is slightly different in its methodology ways, whereas the first volume covers each army separately the second volume groups the subject matter into wars, while the third volume is organized by campaigns from the French Revolution to Waterloo, though the final chapters cover the War with America, 1812-1815, the U.S. – Mexican War of 1846-1848, the Crimean War and ends with the War of Austria with France and Piedmont in 1859.",
  "tags": [
    "Brainstorm"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-04T17:11:00+00:00"
}