{
  "url": "https://voxday.net/2015/11/09/us-military-defeat-expected/",
  "scraped_at": "2025-12-17T17:33:06.811742",
  "title": "US military defeat expected",
  "date_display": "November 9, 2015",
  "date_iso": "2015-11-09T13:00:00+00:00",
  "date_from_url": "2015-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And as they debate <a href=\"http://www.politico.eu/article/inside-the-pentagons-fight-over-russia-us-eastern-europe/\">the best way to prepare to fight the Russians</a>, they’re not even looking at the more serious problem presently facing the U.S. military forces in Europe:</p><blockquote class=\"tr_bq\"><p> Ironically, this Washington war of ideas has pitted against each other two brainy career Army officers who fought together in one of the most famous battles of modern times.</p><p>On one side is Macgregor, an outspoken and controversial advocate for reform of the Army — whose weapons he describes as “obsolescent,” its senior leaders as “self-interested,” and its spending as “wasteful.” Viewed by many of his colleagues as one of the most innovative Army officers of his generation, Macgregor, a West Point graduate with a Ph.D. in international relations (“he can be pretty gruff,” a fellow West Point graduate says, “but he’s brilliant”), led the 2nd Cav’s “Cougar Squadron” in the best-known battle of Operation Desert Storm in February 1991. In 23 minutes, Macgregor’s force destroyed an entire Iraqi Armored Brigade (including nearly 70 Iraqi armored vehicles), while suffering a single American casualty. Speaking at a military “lessons learned” conference one year later, Air Force General Jack Welsh described the Battle of 73 Easting (named for a map coordinate) as “a stunning, overwhelming victory.”</p><p>In the wake of the battle, however, Macgregor calculated that if his unit had fought a highly trained and better armed enemy, like the Russians, the outcome would have been different. So, four years later, he published a book called <i>Breaking The Phalanx</i>, recommending that his service “restructure itself into modularly organized, highly mobile, self-contained combined arms teams.” The advice received the endorsement of then-Army Chief of Staff Dennis Reimer, who ordered that copies of Macgregor’s book be provided to every Army general.</p><p>But Macgregor is still fighting that battle. In early September he circulated a PowerPoint presentation showing that in a head-to-head confrontation pitting the equivalent of a U.S. armored division against a likely Russian adversary, the U.S. division would be defeated. “Defeated isn’t the right word,” Macgregor told me last week. “The right word is annihilated.” The 21-slide presentation features four battle scenarios, all of them against a Russian adversary in the Baltics — what one currently serving war planner on the Joint Chiefs staff calls “the most likely warfighting scenario we will face outside of the Middle East.”</p><p>In two of the scenarios, where the U.S. deploys its current basic formation, called brigade combat teams (BCTs), the U.S. is defeated. In two other scenarios, where Macgregor deploys what he calls Reconnaissance Strike Groups, the U.S. wins. And that’s the crux of Macgregor’s argument: Today the U.S. Army is comprised of BCTs rather than Reconnaissance Strike Groups, or RSGs, which is Macgregor’s innovation. Macgregor’s RSG shears away what he describes as “the top-heavy Army command structure” that would come with any deployment in favor of units that generate more combat power. “Every time we deploy a division we deploy a division headquarters of 1,000 soldiers and officers,” Macgregor explains. “What a waste; those guys will be dead within 72 hours.” Macgregor’s RSG, what he calls “an alternative force design,” does away with this Army command echelon, reporting to a joint force commander — who might or might not be an Army officer. An RSG, Macgregor says, does not need the long supply tail that is required of Brigade Combat Teams — it can be sustained with what it carries from ten days to two weeks without having to be resupplied.</p><p>Though it may sound to outsiders like a disagreement over crossed t’s<br> and dotted i’s, the dispute is fundamental–focusing on whether, in a<br> future conflict, the U.S. military can actually win. Even inside the<br> Pentagon, that is very much in doubt. A recent article by defense writer<br> Julia Ioffe reported the “dispiriting” results of a Pentagon “thought<br> exercise” between a red team (Russia) and a blue team, NATO. The “table<br> top” exercise stipulated a Russian invasion of the Baltics, the same<br> scenario proposed by Macgregor. “After eight hours of gaming out various<br> scenarios,” Ioffe wrote, a blue team member concluded that NATO “would<br> lose.”</br></br></br></br></br></br></br></br></br></p></blockquote><p>What I find more worrisome is the possibility that the U.S. government will decide to throw its weight against the nationalists who have overthrown, either electorally or by other means, a European government, as they did in the case of Serbia. I can envision a situation where U.S. forces step in to create a Ukraine-style puppet government in defense of the poor Muslim refugees, in which case they’ll be faced with European 4GW opponents far more lethal than anything they have seen in the Middle East or in Asia.</p><p>It may seem unthinkable, but there are already serious tensions inside the German government, where the Interior Minister is accused of having mounted a semi-coup against the Chancellor, and his new stricter policy was overruled, not by the Prime Minister, but by her Chief of Staff. It would be surprising, but not entirely unexpected, for Merkel’s government to collapse before the end of the year. And there are tens of thousands of American troops still stationed in Germany; the temptation to use them to dictate German government policy on the migration crisis will be difficult for any U.S. president to resist.</p><p>Whatever happens, there can be little doubt that the rising European nationalist forces will have the backing of Russia, and probably China as well, as both of those countries clearly recognize the threat the globalist U.S. now poses to world order.</p></div>",
  "content_text": "And as they debate\nthe best way to prepare to fight the Russians\n, they’re not even looking at the more serious problem presently facing the U.S. military forces in Europe:\nIronically, this Washington war of ideas has pitted against each other two brainy career Army officers who fought together in one of the most famous battles of modern times.\nOn one side is Macgregor, an outspoken and controversial advocate for reform of the Army — whose weapons he describes as “obsolescent,” its senior leaders as “self-interested,” and its spending as “wasteful.” Viewed by many of his colleagues as one of the most innovative Army officers of his generation, Macgregor, a West Point graduate with a Ph.D. in international relations (“he can be pretty gruff,” a fellow West Point graduate says, “but he’s brilliant”), led the 2nd Cav’s “Cougar Squadron” in the best-known battle of Operation Desert Storm in February 1991. In 23 minutes, Macgregor’s force destroyed an entire Iraqi Armored Brigade (including nearly 70 Iraqi armored vehicles), while suffering a single American casualty. Speaking at a military “lessons learned” conference one year later, Air Force General Jack Welsh described the Battle of 73 Easting (named for a map coordinate) as “a stunning, overwhelming victory.”\nIn the wake of the battle, however, Macgregor calculated that if his unit had fought a highly trained and better armed enemy, like the Russians, the outcome would have been different. So, four years later, he published a book called\nBreaking The Phalanx\n, recommending that his service “restructure itself into modularly organized, highly mobile, self-contained combined arms teams.” The advice received the endorsement of then-Army Chief of Staff Dennis Reimer, who ordered that copies of Macgregor’s book be provided to every Army general.\nBut Macgregor is still fighting that battle. In early September he circulated a PowerPoint presentation showing that in a head-to-head confrontation pitting the equivalent of a U.S. armored division against a likely Russian adversary, the U.S. division would be defeated. “Defeated isn’t the right word,” Macgregor told me last week. “The right word is annihilated.” The 21-slide presentation features four battle scenarios, all of them against a Russian adversary in the Baltics — what one currently serving war planner on the Joint Chiefs staff calls “the most likely warfighting scenario we will face outside of the Middle East.”\nIn two of the scenarios, where the U.S. deploys its current basic formation, called brigade combat teams (BCTs), the U.S. is defeated. In two other scenarios, where Macgregor deploys what he calls Reconnaissance Strike Groups, the U.S. wins. And that’s the crux of Macgregor’s argument: Today the U.S. Army is comprised of BCTs rather than Reconnaissance Strike Groups, or RSGs, which is Macgregor’s innovation. Macgregor’s RSG shears away what he describes as “the top-heavy Army command structure” that would come with any deployment in favor of units that generate more combat power. “Every time we deploy a division we deploy a division headquarters of 1,000 soldiers and officers,” Macgregor explains. “What a waste; those guys will be dead within 72 hours.” Macgregor’s RSG, what he calls “an alternative force design,” does away with this Army command echelon, reporting to a joint force commander — who might or might not be an Army officer. An RSG, Macgregor says, does not need the long supply tail that is required of Brigade Combat Teams — it can be sustained with what it carries from ten days to two weeks without having to be resupplied.\nThough it may sound to outsiders like a disagreement over crossed t’s\nand dotted i’s, the dispute is fundamental–focusing on whether, in a\nfuture conflict, the U.S. military can actually win. Even inside the\nPentagon, that is very much in doubt. A recent article by defense writer\nJulia Ioffe reported the “dispiriting” results of a Pentagon “thought\nexercise” between a red team (Russia) and a blue team, NATO. The “table\ntop” exercise stipulated a Russian invasion of the Baltics, the same\nscenario proposed by Macgregor. “After eight hours of gaming out various\nscenarios,” Ioffe wrote, a blue team member concluded that NATO “would\nlose.”\nWhat I find more worrisome is the possibility that the U.S. government will decide to throw its weight against the nationalists who have overthrown, either electorally or by other means, a European government, as they did in the case of Serbia. I can envision a situation where U.S. forces step in to create a Ukraine-style puppet government in defense of the poor Muslim refugees, in which case they’ll be faced with European 4GW opponents far more lethal than anything they have seen in the Middle East or in Asia.\nIt may seem unthinkable, but there are already serious tensions inside the German government, where the Interior Minister is accused of having mounted a semi-coup against the Chancellor, and his new stricter policy was overruled, not by the Prime Minister, but by her Chief of Staff. It would be surprising, but not entirely unexpected, for Merkel’s government to collapse before the end of the year. And there are tens of thousands of American troops still stationed in Germany; the temptation to use them to dictate German government policy on the migration crisis will be difficult for any U.S. president to resist.\nWhatever happens, there can be little doubt that the rising European nationalist forces will have the backing of Russia, and probably China as well, as both of those countries clearly recognize the threat the globalist U.S. now poses to world order.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-09T13:00:00+00:00"
}