{
  "url": "https://voxday.net/2015/11/28/why-trump-is-winning-2/",
  "scraped_at": "2025-12-17T17:35:40.076055",
  "title": "Why Trump is winning",
  "date_display": "November 28, 2015",
  "date_iso": "2015-11-28T14:49:00+00:00",
  "date_from_url": "2015-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Cernovich explains <a href=\"http://www.dangerandplay.com/2015/11/27/why-donald-trump-is-winning-mindset-energy-momentum-focus/\">one important aspect of Donald Trump’s success</a>, as well as his own:</p><blockquote class=\"tr_bq\"><p> The Trump Mindset: Momentum + Focus + Energy</p><p>It’s clear none of Trump’s haters have read his books (<i>Think Big and Kick Ass</i> and <i>Art of the Deal</i>). If you had you’d know how Trump thinks and moves.</p><p>To understand how someone thinks, look at the language he uses. Kindle makes this simple. You can search for specific keywords in the Kindle version of a book.</p><p>Trump’s books are loaded winning, focus, push, enthusiasm, energy, and momentum.</p><p>Trump is a momentum player. He doesn’t wait for the perfect time to strike. He comes out swinging and he keeps swinging.</p><p>There’s even a chapter in Think Big and Kick Ass called Big Mo!</p><p>What do momentum types never do? We don’t apologize!</p><p>An apology destroys your momentum, as it causes you to stop.</p><p>Scott Adams is also a momentum type. How do I know this?</p><p>Adams talks about “energy” in his great book How to Fail at Almost Everything and Still Win Big. Energy is mentioned 67 times and there is even an entire section on how to increase your personal energy.</p><p>Momentum types are obsessed with energy, as it’s crucial for us to keep moving forward.</p><p>Momentum types believe if we keep putting fire on targets, we will win.</p><p>As long as our energy holds up, this is true.</p></blockquote><p>It’s funny, I don’t really think of myself as either a momentum or a high-energy guy because I am almost extraordinarily lazy. My ability to mentally check out and pay no attention to anything short of an assault team utilizing heavy weaponry is well-known throughout my entire social circle. One of the primary reasons I feed on the hatred for me is that it is about the only thing I find reliably motivating.</p><p>On the other hand, I do possess an unusual amount of what I think of as “focused stamina” which is how I was able to write ATOB in 18 months and turn in a complete 60-page game design document in under a week. I suppose if you consider that I’m on the verge of publishing my second book in four months while having designed two games and edited three books at the same time, it is possible that I am merely using different terminology than Mike is.</p><p>But I dont think so. Two things that I have learned from Mike recently is the importance of a) enthusiasm and b) thinking big. For example, I don’t think I’ve been thinking big enough for Brainstorm; it’s already nearly as well-attended as I imagined it could possibly be. And there is no real reason why my political books should sell any fewer copies than those published by Ann Coulter or Mark Levin, after all, as Mike notes, we’re both already outselling most books published by well-known mainstream conservative writers with substantial media profiles.</p><p>So, I’m working on learning to think bigger. Here is the first baby step: my goal is for <i>Cuckservative </i>to debut in the Amazon top 100 overall. In keeping with this objective, we’re going to modify a few of our usual launch routines in order to help make that happen. We’ve put together a solid New Release offer (don’t forget to get on <a href=\"http://www.castaliahouse.com/subscribe-to-our-newsletter/\">the mailing list</a> if you want to receive them), we’re only going to make the book available on Amazon for the first three days, and for the first time, those who buy through Amazon will be able to take advantage of the offer.</p><p>And yes, if you need the epub and don’t have Calibre installed, you can send us a copy of your Amazon order and we’ll get it to you.</p><p>There are a few other things we’re doing as well, including one moderately exciting one that I cannot talk about quite yet, but I am entirely confident that with your help, we can drive the book, and more importantly, the message, into higher orbit than any of us at Castalia House originally envisioned.</p><p>In terms of Mike’s advice, all I can really add to it is the importance of understanding your own motivations. Once you figure out what it is, use it relentlessly no matter what anyone else might think of it. It doesn’t matter what your own private Carthago is or why you believe it must be destroyed. Stay focused, stay motivated, and keep your momentum going, until one day, its walls are razed and its fields are sown with salt.</p></div>",
  "content_text": "Mike Cernovich explains\none important aspect of Donald Trump’s success\n, as well as his own:\nThe Trump Mindset: Momentum + Focus + Energy\nIt’s clear none of Trump’s haters have read his books (\nThink Big and Kick Ass\nand\nArt of the Deal\n). If you had you’d know how Trump thinks and moves.\nTo understand how someone thinks, look at the language he uses. Kindle makes this simple. You can search for specific keywords in the Kindle version of a book.\nTrump’s books are loaded winning, focus, push, enthusiasm, energy, and momentum.\nTrump is a momentum player. He doesn’t wait for the perfect time to strike. He comes out swinging and he keeps swinging.\nThere’s even a chapter in Think Big and Kick Ass called Big Mo!\nWhat do momentum types never do? We don’t apologize!\nAn apology destroys your momentum, as it causes you to stop.\nScott Adams is also a momentum type. How do I know this?\nAdams talks about “energy” in his great book How to Fail at Almost Everything and Still Win Big. Energy is mentioned 67 times and there is even an entire section on how to increase your personal energy.\nMomentum types are obsessed with energy, as it’s crucial for us to keep moving forward.\nMomentum types believe if we keep putting fire on targets, we will win.\nAs long as our energy holds up, this is true.\nIt’s funny, I don’t really think of myself as either a momentum or a high-energy guy because I am almost extraordinarily lazy. My ability to mentally check out and pay no attention to anything short of an assault team utilizing heavy weaponry is well-known throughout my entire social circle. One of the primary reasons I feed on the hatred for me is that it is about the only thing I find reliably motivating.\nOn the other hand, I do possess an unusual amount of what I think of as “focused stamina” which is how I was able to write ATOB in 18 months and turn in a complete 60-page game design document in under a week. I suppose if you consider that I’m on the verge of publishing my second book in four months while having designed two games and edited three books at the same time, it is possible that I am merely using different terminology than Mike is.\nBut I dont think so. Two things that I have learned from Mike recently is the importance of a) enthusiasm and b) thinking big. For example, I don’t think I’ve been thinking big enough for Brainstorm; it’s already nearly as well-attended as I imagined it could possibly be. And there is no real reason why my political books should sell any fewer copies than those published by Ann Coulter or Mark Levin, after all, as Mike notes, we’re both already outselling most books published by well-known mainstream conservative writers with substantial media profiles.\nSo, I’m working on learning to think bigger. Here is the first baby step: my goal is for\nCuckservative\nto debut in the Amazon top 100 overall. In keeping with this objective, we’re going to modify a few of our usual launch routines in order to help make that happen. We’ve put together a solid New Release offer (don’t forget to get on\nthe mailing list\nif you want to receive them), we’re only going to make the book available on Amazon for the first three days, and for the first time, those who buy through Amazon will be able to take advantage of the offer.\nAnd yes, if you need the epub and don’t have Calibre installed, you can send us a copy of your Amazon order and we’ll get it to you.\nThere are a few other things we’re doing as well, including one moderately exciting one that I cannot talk about quite yet, but I am entirely confident that with your help, we can drive the book, and more importantly, the message, into higher orbit than any of us at Castalia House originally envisioned.\nIn terms of Mike’s advice, all I can really add to it is the importance of understanding your own motivations. Once you figure out what it is, use it relentlessly no matter what anyone else might think of it. It doesn’t matter what your own private Carthago is or why you believe it must be destroyed. Stay focused, stay motivated, and keep your momentum going, until one day, its walls are razed and its fields are sown with salt.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-28T14:49:00+00:00"
}