{
  "url": "https://voxday.net/2015/11/24/wwiii-second-sho/",
  "scraped_at": "2025-12-17T17:35:09.007097",
  "title": "WWIII: the second shot",
  "date_display": "November 24, 2015",
  "date_iso": "2015-11-24T09:35:00+00:00",
  "date_from_url": "2015-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Paris attacks was the first shot being fired. <a href=\"https://www.rt.com/news/323215-warplane-crash-syria-turkey/\">The downing of a Russian SU-24 by NATO</a> is the second. I have no doubt that the USA will frantically protest that Turkey, not NATO, is responsible, but when Putin responds, the USA will be treaty-bound to defend Turkey. This is why the Founding Fathers warned against “entangling alliances”, as they tend to outsource one’s diplomatic and wartime decision-making at the very worst possible times.</p><blockquote class=\"tr_bq\"><p> A Russian Su-24 fighter has been shot down in Syria, Russian Defense Ministry said, adding the plane hadn’t violated Turkish airspace and was at an altitude of 6,000 meters.</p></blockquote><p>If you haven’t read much about the leadup to past world wars, what you should understand is that they never look like anything out of the ordinary at first. However, unlike the previous world wars, this looks like one that will genuinely span the globe, as the jihadists have been permitted to infiltrate every country and nation, from China to Iceland, while China is poised to not only invade Taiwan, but claim the entire South China Sea and spread out across Africa.</p><p>About the only place we can expect to escape the global conflict is South America, as La Raza Cósmica is more vicious and more capable than the mujahideen while simultaneously being devoid of any semblance of white guilt or mercy. The jihadists wouldn’t last five minutes against the cartels.</p><p>As Nicolas Taleb has observed, the one place the immigrants have failed to find any footing in Italy is where the mafias rule.</p><p>This doesn’t mean that Russia and the USA are going to start shooting at each other immediately, it merely means that another domino has fallen.</p><p>UPDATE: All right, this may be more than just another domino falling. I doubt that Putin will fail to respond to <a href=\"http://news.yahoo.com/turkmen-forces-syria-shot-dead-pilots-downed-russian-143818517.html\">this sort of behavior by the Turks</a>:</p><blockquote class=\"tr_bq\"><p> Turkmen forces in Syria shot dead the two pilots of a Russian jet downed by Turkish warplanes near the border with Turkey on Tuesday as they descended with parachutes, a deputy commander of a Turkmen brigade told reporters.</p><p>“Both of the pilots were retrieved dead. Our comrades opened fire into the air and they died in the air,” Alpaslan Celik, a deputy commander in a Syrian Turkmen brigade said near the Syrian village of Yamadi as he held what he said was a piece of a pilot’s parachute. </p></blockquote><p>UPDATE II: The news just keeps getting worse. It looks like we know who is supporting ISIS and who is not.</p><blockquote class=\"tr_bq\"><p> Russian helicopter SHOT DOWN while searching for downed jet</p></blockquote><p>UPDATE III: Putin’s <a href=\"http://cdn.theguardian.tv/webM/2015/11/24/151124Putin_synd_768k_vp8.webm\">response</a>: “A stab in the back by the accomplices of terrorism.”</p><blockquote><p>     “The loss today is a stab in the back, carried out by the accomplices of terrorists. I can’t describe it in any other way.”</p><p>    “Our aircraft was downed over the territory of Syria, using air-to-air missile from a Turkish F-16. It fell on the Syrian territory 4km from Turkey.”</p><p>    “Neither our pilots nor our jet threatened the territory of Turkey.”</p><p>    “Today’s tragic event will have significant consequences, including for Russia-Turkish relations … Instead of immediately getting in contact with us, as far as we know, the Turkish side immediately turned to their partners from Nato to discuss this incident, as if we shot down their plane and not they ours.”</p><p>    “Do they want to make Nato serve ISIS? … We hope that the international community will find the strength to come together and fight against the common evil.”</p></blockquote><p> UPDATE IV: Yeah, I’ll bet Erdogan called an emergency meeting.</p><blockquote class=\"tr_bq\"><p> Turkey’s President Recep Tayyip Erdoğan has called an emergency security meeting involving his top generals, heads of intelligence, Prime Minister Davutoğlu and other senior ministers.</p></blockquote></div>",
  "content_text": "The Paris attacks was the first shot being fired.\nThe downing of a Russian SU-24 by NATO\nis the second. I have no doubt that the USA will frantically protest that Turkey, not NATO, is responsible, but when Putin responds, the USA will be treaty-bound to defend Turkey. This is why the Founding Fathers warned against “entangling alliances”, as they tend to outsource one’s diplomatic and wartime decision-making at the very worst possible times.\nA Russian Su-24 fighter has been shot down in Syria, Russian Defense Ministry said, adding the plane hadn’t violated Turkish airspace and was at an altitude of 6,000 meters.\nIf you haven’t read much about the leadup to past world wars, what you should understand is that they never look like anything out of the ordinary at first. However, unlike the previous world wars, this looks like one that will genuinely span the globe, as the jihadists have been permitted to infiltrate every country and nation, from China to Iceland, while China is poised to not only invade Taiwan, but claim the entire South China Sea and spread out across Africa.\nAbout the only place we can expect to escape the global conflict is South America, as La Raza Cósmica is more vicious and more capable than the mujahideen while simultaneously being devoid of any semblance of white guilt or mercy. The jihadists wouldn’t last five minutes against the cartels.\nAs Nicolas Taleb has observed, the one place the immigrants have failed to find any footing in Italy is where the mafias rule.\nThis doesn’t mean that Russia and the USA are going to start shooting at each other immediately, it merely means that another domino has fallen.\nUPDATE: All right, this may be more than just another domino falling. I doubt that Putin will fail to respond to\nthis sort of behavior by the Turks\n:\nTurkmen forces in Syria shot dead the two pilots of a Russian jet downed by Turkish warplanes near the border with Turkey on Tuesday as they descended with parachutes, a deputy commander of a Turkmen brigade told reporters.\n“Both of the pilots were retrieved dead. Our comrades opened fire into the air and they died in the air,” Alpaslan Celik, a deputy commander in a Syrian Turkmen brigade said near the Syrian village of Yamadi as he held what he said was a piece of a pilot’s parachute.\nUPDATE II: The news just keeps getting worse. It looks like we know who is supporting ISIS and who is not.\nRussian helicopter SHOT DOWN while searching for downed jet\nUPDATE III: Putin’s\nresponse\n: “A stab in the back by the accomplices of terrorism.”\n“The loss today is a stab in the back, carried out by the accomplices of terrorists. I can’t describe it in any other way.”\n“Our aircraft was downed over the territory of Syria, using air-to-air missile from a Turkish F-16. It fell on the Syrian territory 4km from Turkey.”\n“Neither our pilots nor our jet threatened the territory of Turkey.”\n“Today’s tragic event will have significant consequences, including for Russia-Turkish relations … Instead of immediately getting in contact with us, as far as we know, the Turkish side immediately turned to their partners from Nato to discuss this incident, as if we shot down their plane and not they ours.”\n“Do they want to make Nato serve ISIS? … We hope that the international community will find the strength to come together and fight against the common evil.”\nUPDATE IV: Yeah, I’ll bet Erdogan called an emergency meeting.\nTurkey’s President Recep Tayyip Erdoğan has called an emergency security meeting involving his top generals, heads of intelligence, Prime Minister Davutoğlu and other senior ministers.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-11-24T09:35:00+00:00"
}