{
  "url": "https://voxday.net/2013/10/21/ask-yourself-this-question/",
  "scraped_at": "2025-12-15T16:34:22.073334",
  "title": "Ask yourself this question",
  "date_display": "October 21, 2013",
  "date_iso": "2013-10-21T13:00:00+00:00",
  "date_from_url": "2013-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If credit isn’t money and cannot affect prices, then why is managing the growth of credit a specified aspect of the Fed’s monetary policy? From the Federal Reserve charter:</p><blockquote class=\"tr_bq\"><p> The Board of Governors of the Federal Reserve System and the Federal Open Market Committee shall maintain long run growth of the monetary <i>and credit aggregates</i> commensurate with the economy’s long run potential to increase production, so as to promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates.</p></blockquote><p>The reason the Fed tracks the various components of Z1 in the first place is that they know perfectly well that M2+credit is the effective money supply. Which means that they already know their can-kicking can’t possibly work indefinitely. Karl Denninger has more thoughts on this as well as Alan Greenspan’s <a href=\"http://market-ticker.org/akcs-www?post=225229\">Mr. Magoo Problem</a>.</p></div>",
  "content_text": "If credit isn’t money and cannot affect prices, then why is managing the growth of credit a specified aspect of the Fed’s monetary policy? From the Federal Reserve charter:\nThe Board of Governors of the Federal Reserve System and the Federal Open Market Committee shall maintain long run growth of the monetary\nand credit aggregates\ncommensurate with the economy’s long run potential to increase production, so as to promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates.\nThe reason the Fed tracks the various components of Z1 in the first place is that they know perfectly well that M2+credit is the effective money supply. Which means that they already know their can-kicking can’t possibly work indefinitely. Karl Denninger has more thoughts on this as well as Alan Greenspan’s\nMr. Magoo Problem\n.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-21T12:00:00+00:00"
}