{
  "url": "https://voxday.net/2013/10/03/au-contraire-mon-ami/",
  "scraped_at": "2025-12-14T22:44:10.142753",
  "title": "Au contraire, mon ami",
  "date_display": "October 3, 2013",
  "date_iso": "2013-10-03T09:19:00+00:00",
  "date_from_url": "2013-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think Captain Capitalism read a bit too much into yesterday’s post <a href=\"http://captaincapitalism.blogspot.com/2013/10/they-even-got-vox.html\">in concluding the college credentialists got me</a>:</p><blockquote class=\"tr_bq\"><p> A well written and charty-goodness post, but he still considers the education/college degree gap a “real” gap. There are two brief points I shall make as I’m trying to knock out a chapter per 4 days of my book:</p><p>1.  Women earn the majority of EASY DEGREES.  When it comes to engineering and anything that requires significant math <a href=\"http://captaincapitalism.blogspot.com/2006/11/best-of-captain-capitalism-support.html\">men beat them at a ratio of 4:1</a>. <br> When it comes to Masters in Farting Unicorns and Doctorates in Feelings<br> with Minors in Oprah, yes, women dominate.  But for the stuff that<br> matters in the world, men by far outcompete women.</br></br></br></p><p>2.  Women are NOT going to be ahead in the world for this.  It is NOT a<br> good thing for women that they are earning the majority of degrees<br> because they are buying into a bubble.  It’s like having women<br> purchasing 70% of the housing in early 2007 and citing that as an<br> example of some kind of performance gap.</br></br></br></br></p></blockquote><p>The college degree gap is real. The fact that the degrees are worthless is irrelevant. Captain Capitalism appears to have forgotten that I am not a credentialist, and moreover, I was one of the earliest commentators to point out the increasing irrelevance of the college degree. Consider what I wrote <a href=\"http://www.wnd.com/2004/12/27991/\">on the subject</a> in 2004:</p><p><i>“The universities abandoned their Christian roots over a century ago.<br> Beginning in the ’60s, they abandoned their commitment to intellectual<br> development as well.  Having already purged their collective Borg-minds<br> of almost every vestige of religion and non-leftist thought, the tenured<br> faculties that dominate the academic asylums have ensured that the<br> devolution of the academy will continue, until eventually the idea of<br> sending your child to college for intellectual development will seem as<br> absurdly counterproductive as watching ABCNNBCBS to learn what’s really<br> going on in the world.”</br></br></br></br></br></br></br></br></i></p><p>I wrote a few more columns on the subject, and in the 2012 WND column entitled “<a href=\"http://www.wnd.com/2012/05/education-is-not-an-investment/\">Education is not an investment</a>“, I pointed out five flaws in the various “return-on-investment” calculations used to justify college degrees, such as the failure to take student loan debt into account.</p><p><i>“The Payscale study concluded that the average 30-year ROI was $387,501;<br> however, the study did not take into account that the average 2010<br> college graduate owed $25,250 in college loans upon graduation. And<br> since this debt figure does not include the 40 percent of non-graduating<br> students and the rate of defaults on student loans has risen to 8.8<br> percent, it should be readily apparent that the interest owed on that<br> seemingly small amount of debt will tend to considerably reduce average<br> ROI from the estimated $387,000. Note that at the current Plus Loan<br> interest rate of 7.9 percent, the 30-year value of that $25,250 in debt<br> is $247,118.”</br></br></br></br></br></br></br></br></br></i></p><p>Ironically, one could build a solid case for a young man being better off financially by lending his $25,000 college fund to college students while going off and working instead of getting a degree, so long as he is able to earn more than $4,680 per year for the next 30 years in addition to collecting his federally guaranteed debt-tribute.</p><p>What Captain Capitalism failed to realize is that I don’t see the growing preponderance of women in higher education as evidence that women are going to run the world. To the contrary, I see it as evidence that higher education is in the late stages of collapse. Because women ruin everything. The final stage will be reached when Title IX is successfully applied to the STEM degrees, which is <a href=\"http://www.milobookclub.com/2010/06/08/congress-passes-title-ix-science/\">already federal law</a>, and math and the hard sciences are sufficiently dumbed down to permit women to receive what is determined to be an equitable number of those degrees.</p><p>By that point, men will have likely created alternative systems to the university credentials that are as unpalatable to women as the universities once were, and successful businesses will be increasingly prone to utilize those systems. Some sort of online achievement-based system like those popular in the IT world would appear to be the likely candidate, especially as the availability of online degrees from prestigious institutions continues to increase. Once 50,000 Indians and 100,000 Chinese are graduating with degrees from Harvard, its social cachet will plummet.</p></div>",
  "content_text": "I think Captain Capitalism read a bit too much into yesterday’s post\nin concluding the college credentialists got me\n:\nA well written and charty-goodness post, but he still considers the education/college degree gap a “real” gap. There are two brief points I shall make as I’m trying to knock out a chapter per 4 days of my book:\n1.  Women earn the majority of EASY DEGREES.  When it comes to engineering and anything that requires significant math\nmen beat them at a ratio of 4:1\n.\nWhen it comes to Masters in Farting Unicorns and Doctorates in Feelings\nwith Minors in Oprah, yes, women dominate.  But for the stuff that\nmatters in the world, men by far outcompete women.\n2.  Women are NOT going to be ahead in the world for this.  It is NOT a\ngood thing for women that they are earning the majority of degrees\nbecause they are buying into a bubble.  It’s like having women\npurchasing 70% of the housing in early 2007 and citing that as an\nexample of some kind of performance gap.\nThe college degree gap is real. The fact that the degrees are worthless is irrelevant. Captain Capitalism appears to have forgotten that I am not a credentialist, and moreover, I was one of the earliest commentators to point out the increasing irrelevance of the college degree. Consider what I wrote\non the subject\nin 2004:\n“The universities abandoned their Christian roots over a century ago.\nBeginning in the ’60s, they abandoned their commitment to intellectual\ndevelopment as well.  Having already purged their collective Borg-minds\nof almost every vestige of religion and non-leftist thought, the tenured\nfaculties that dominate the academic asylums have ensured that the\ndevolution of the academy will continue, until eventually the idea of\nsending your child to college for intellectual development will seem as\nabsurdly counterproductive as watching ABCNNBCBS to learn what’s really\ngoing on in the world.”\nI wrote a few more columns on the subject, and in the 2012 WND column entitled “\nEducation is not an investment\n“, I pointed out five flaws in the various “return-on-investment” calculations used to justify college degrees, such as the failure to take student loan debt into account.\n“The Payscale study concluded that the average 30-year ROI was $387,501;\nhowever, the study did not take into account that the average 2010\ncollege graduate owed $25,250 in college loans upon graduation. And\nsince this debt figure does not include the 40 percent of non-graduating\nstudents and the rate of defaults on student loans has risen to 8.8\npercent, it should be readily apparent that the interest owed on that\nseemingly small amount of debt will tend to considerably reduce average\nROI from the estimated $387,000. Note that at the current Plus Loan\ninterest rate of 7.9 percent, the 30-year value of that $25,250 in debt\nis $247,118.”\nIronically, one could build a solid case for a young man being better off financially by lending his $25,000 college fund to college students while going off and working instead of getting a degree, so long as he is able to earn more than $4,680 per year for the next 30 years in addition to collecting his federally guaranteed debt-tribute.\nWhat Captain Capitalism failed to realize is that I don’t see the growing preponderance of women in higher education as evidence that women are going to run the world. To the contrary, I see it as evidence that higher education is in the late stages of collapse. Because women ruin everything. The final stage will be reached when Title IX is successfully applied to the STEM degrees, which is\nalready federal law\n, and math and the hard sciences are sufficiently dumbed down to permit women to receive what is determined to be an equitable number of those degrees.\nBy that point, men will have likely created alternative systems to the university credentials that are as unpalatable to women as the universities once were, and successful businesses will be increasingly prone to utilize those systems. Some sort of online achievement-based system like those popular in the IT world would appear to be the likely candidate, especially as the availability of online degrees from prestigious institutions continues to increase. Once 50,000 Indians and 100,000 Chinese are graduating with degrees from Harvard, its social cachet will plummet.",
  "tags": [
    "education",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-03T08:19:00+00:00"
}