{
  "url": "https://voxday.net/2013/10/14/bonfire-of-self-publishers/",
  "scraped_at": "2025-12-14T22:45:09.148351",
  "title": "Bonfire of the self-publishers",
  "date_display": "October 14, 2013",
  "date_iso": "2013-10-14T20:00:00+00:00",
  "date_from_url": "2013-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I can’t say that I’m too concerned about the news that the bushwhackers at the bookstores attempting to clean out the erotic filth <a href=\"http://www.the-digital-reader.com/2013/10/13/amazon-bn-whsmith-now/\">have been cutting too wide a swath</a>. It’s their right to sell what they want, to whom they want, and if the leading digital bookstores won’t carry self-published books, they’ll soon find themselves being replaced by new retailers who do. But what I don’t understand is why <i>50 Shades of Gray</i>, or <i>120 Days of Sodom</i>, for that matter, all considered acceptable simply because a publisher could be found who was willing to sell it.</p><blockquote class=\"tr_bq\"><p> The ebookstores are sweeping a wide broom in the process, with WH Smith even going so far as to shut down their website. They have replaced it with a holder page that explains that:</p><p><i>    Last week we were made aware that a number of unacceptable titles were appearing on our website through the Kobo website that has an automated feed to ours. This is an industry wide issue impacting retailers that sell self published eBooks due to the explosion of self publishing, which in the main is good as it gives new authors the opportunity to get their content published. However we are disgusted by these particular titles, find this unacceptable and we in no way whatsoever condone them.</i></p><p>Their statement ends with the conclusion that the website will be operational again “once all self published eBooks have been removed and we are totally sure that there are no offending titles available.” When that will be, they did not say.</p><p>Update: It appears that WH Smith wasn’t exaggerating when they said that all self-published ebooks were going to go; there are numerous reports that Kobo is removing most if not all of the self-pub titles in their UK ebookstore.</p></blockquote><p>But if you think this is bad, just wait until the bookstores figure out that what passes for YA and Sci-Fi are mostly vampire and werewolf erotica.</p></div>",
  "content_text": "I can’t say that I’m too concerned about the news that the bushwhackers at the bookstores attempting to clean out the erotic filth\nhave been cutting too wide a swath\n. It’s their right to sell what they want, to whom they want, and if the leading digital bookstores won’t carry self-published books, they’ll soon find themselves being replaced by new retailers who do. But what I don’t understand is why\n50 Shades of Gray\n, or\n120 Days of Sodom\n, for that matter, all considered acceptable simply because a publisher could be found who was willing to sell it.\nThe ebookstores are sweeping a wide broom in the process, with WH Smith even going so far as to shut down their website. They have replaced it with a holder page that explains that:\nLast week we were made aware that a number of unacceptable titles were appearing on our website through the Kobo website that has an automated feed to ours. This is an industry wide issue impacting retailers that sell self published eBooks due to the explosion of self publishing, which in the main is good as it gives new authors the opportunity to get their content published. However we are disgusted by these particular titles, find this unacceptable and we in no way whatsoever condone them.\nTheir statement ends with the conclusion that the website will be operational again “once all self published eBooks have been removed and we are totally sure that there are no offending titles available.” When that will be, they did not say.\nUpdate: It appears that WH Smith wasn’t exaggerating when they said that all self-published ebooks were going to go; there are numerous reports that Kobo is removing most if not all of the self-pub titles in their UK ebookstore.\nBut if you think this is bad, just wait until the bookstores figure out that what passes for YA and Sci-Fi are mostly vampire and werewolf erotica.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-14T19:00:00+00:00"
}