{
  "url": "https://voxday.net/2013/10/09/book-review-lights-in-deep/",
  "scraped_at": "2025-12-14T22:44:41.018932",
  "title": "Book review: Lights in the Deep",
  "date_display": "October 9, 2013",
  "date_iso": "2013-10-09T14:00:00+00:00",
  "date_from_url": "2013-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LD provides a second look at Brad Torgersen’s <i>Lights in the Deep</i>:</p><p>I went into this with two disadvantages: I wasn’t at all familiar with<br> the author, and I haven’t regularly read short form science fiction for<br> many, many years. I ended up enjoying this collection nonetheless.</br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.bradrtorgersen.com/store/covers/lights_in_the_deep_medium.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.bradrtorgersen.com/store/covers/lights_in_the_deep_medium.jpg\" width=\"207\"/></a></div><p>Diving into these stories quickly reminded me why I’m not as<br> big a fan of short stories as I used to be–the limitations in form<br> itself. As a young man I would devour short stories, but just about any<br> author, but particularly Larry Niven, Heinlein, Zelazy, Keith Laumer,<br> Robert Sheckley, and other similar authors. Back then, quick dips into<br> short stories appealed to me, but now that I’m an old man, I find my<br> tastes trending toward larger sized (huge) Space Operas from Peter F.<br> Hamilton, Neal Asher, Alastair Reynolds, etc.</br></br></br></br></br></br></br></p><p>The only recent short story collections I had read were by<br> Hamilton, and those were related for the most part to the various novels<br> he’s written, so this was my first dive into a collection like this in<br> years.</br></br></br></p><p>I’ll make quick comments about each entry in the collection and then give my summary.</p><p>The<br> Three Introductions – I read them, but I couldn’t tell you a thing<br> about them now. They were nice, but didn’t contain anything memorable.<br> Neither a plus, nor a minus to the whole.</br></br></br></p><p>Outbound – Quite a good story, one that I would have been<br> happy to see expanded to novel length. For me the downsides were the<br> brevity of this story… I wanted more detail about this setting.</br></br></p><p>Gemini 17 – A nice exploration of a *slightly* alternate history. Fun story with a good, humorous ending.</p><p>Influences: Allan Cole and Chris Bunch – I’m not familiar with<br> either author, but it’s always nice to see the influences in an<br> author’s background.</br></br></p><p>The Bullfrog Radio Astronomy Project –<br> Be careful what you transmit or the Men in Black (or are they) will<br> come for you. It brought back memories of laughing at the Art Bell show.</br></br></p><p>Exiles of Eden – Another nice story. I figured out what was<br> happening before the characters did. It’s an interesting concept that<br> you’ll be familiar with if you’ve read Alastair Reynolds “Revelation<br> Space” novels.</br></br></br></p><p>Writer Dad: Mike Resnick – More background on the author.</p><p>Footprints – A character piece. Perhaps a bit too “literary” for my tastes.</p><p>The<br> Exchange Officers – This excellent story is the polar opposite of most<br> of the previous stories. It has action, combat, technology, and less<br> emphasis on memories, and feelings. Perhaps my second favorite story in<br> the collection.</br></br></br></br></p><p>Essay: On the Growth of Fantasy and the Waning of Science<br> Fiction – An excellent subject to discuss that’s quite relevant to my<br> own thoughts and tastes. I’m NOT a fantasy fan. I’ve read Lord of the<br> Rings once, and that was quite enough for me thank you. I enjoy the Game<br> of Thrones TV show, but my attempt to start reading the first novel<br> resulted in boredom and sleepytime. I’m a HARD SF kinda guy, and this<br> essay covers some of the things that bug me with current SF/Fantasy–I<br> hate Star Wars, especially the second trilogy, I only liked the original<br> Star Trek, anyone who likes Avatar is an Ava-tard in my book. My<br> opinion is that the growth of fantasy reflects the decline of STEM in<br> modern American society. Fantasy is perfect for those with less than a<br> firm grasp on science.</br></br></br></br></br></br></br></br></br></br></br></p><p>The Chaplain’s Assistant – A return to a “character-based”<br> story. Interesting, but ultimately boring to me. I was not enthused to<br> find out that the next long story in this collection was a sequel to<br> this.</br></br></br></p><p>The Chaplain’s Legacy – My lack of enthusiasm for the previous<br> story caused me to put the entire collection down for a few days, but I<br> had volunteered to review this book for Vox, so I did my duty and read<br> the story. The good news is that I liked this much more than the<br> previous short, though in my opinion the size could have been condensed.</br></br></br></br></p><p>The Hero’s Tongue: Larry Niven – Of all of the essays in the<br> book, this one was the most enjoyable for me because of my own fondness<br> for Niven.</br></br></p><p>Exanastasis – Interesting, enjoyable, but ultimately forgettable.</p><p>Ray of Light – The final story of the collection and probably<br> my favorite. There were points in this story where I thought it was<br> going to break badly, but the story didn’t go in the direction I thought<br> it would end up, and I enjoyed it a lot.</br></br></br></p><p>The last story really brought my opinion of the whole<br> collection back up from a low spot. I enjoy Torgerson’s writing style,<br> and I will look up some of his longer work, but probably not the<br> forthcoming “Chaplain” story.</br></br></br></p><p>I’d give this collection a solid 3 out of 5 stars.</p></div>",
  "content_text": "LD provides a second look at Brad Torgersen’s\nLights in the Deep\n:\nI went into this with two disadvantages: I wasn’t at all familiar with\nthe author, and I haven’t regularly read short form science fiction for\nmany, many years. I ended up enjoying this collection nonetheless.\nDiving into these stories quickly reminded me why I’m not as\nbig a fan of short stories as I used to be–the limitations in form\nitself. As a young man I would devour short stories, but just about any\nauthor, but particularly Larry Niven, Heinlein, Zelazy, Keith Laumer,\nRobert Sheckley, and other similar authors. Back then, quick dips into\nshort stories appealed to me, but now that I’m an old man, I find my\ntastes trending toward larger sized (huge) Space Operas from Peter F.\nHamilton, Neal Asher, Alastair Reynolds, etc.\nThe only recent short story collections I had read were by\nHamilton, and those were related for the most part to the various novels\nhe’s written, so this was my first dive into a collection like this in\nyears.\nI’ll make quick comments about each entry in the collection and then give my summary.\nThe\nThree Introductions – I read them, but I couldn’t tell you a thing\nabout them now. They were nice, but didn’t contain anything memorable.\nNeither a plus, nor a minus to the whole.\nOutbound – Quite a good story, one that I would have been\nhappy to see expanded to novel length. For me the downsides were the\nbrevity of this story… I wanted more detail about this setting.\nGemini 17 – A nice exploration of a *slightly* alternate history. Fun story with a good, humorous ending.\nInfluences: Allan Cole and Chris Bunch – I’m not familiar with\neither author, but it’s always nice to see the influences in an\nauthor’s background.\nThe Bullfrog Radio Astronomy Project –\nBe careful what you transmit or the Men in Black (or are they) will\ncome for you. It brought back memories of laughing at the Art Bell show.\nExiles of Eden – Another nice story. I figured out what was\nhappening before the characters did. It’s an interesting concept that\nyou’ll be familiar with if you’ve read Alastair Reynolds “Revelation\nSpace” novels.\nWriter Dad: Mike Resnick – More background on the author.\nFootprints – A character piece. Perhaps a bit too “literary” for my tastes.\nThe\nExchange Officers – This excellent story is the polar opposite of most\nof the previous stories. It has action, combat, technology, and less\nemphasis on memories, and feelings. Perhaps my second favorite story in\nthe collection.\nEssay: On the Growth of Fantasy and the Waning of Science\nFiction – An excellent subject to discuss that’s quite relevant to my\nown thoughts and tastes. I’m NOT a fantasy fan. I’ve read Lord of the\nRings once, and that was quite enough for me thank you. I enjoy the Game\nof Thrones TV show, but my attempt to start reading the first novel\nresulted in boredom and sleepytime. I’m a HARD SF kinda guy, and this\nessay covers some of the things that bug me with current SF/Fantasy–I\nhate Star Wars, especially the second trilogy, I only liked the original\nStar Trek, anyone who likes Avatar is an Ava-tard in my book. My\nopinion is that the growth of fantasy reflects the decline of STEM in\nmodern American society. Fantasy is perfect for those with less than a\nfirm grasp on science.\nThe Chaplain’s Assistant – A return to a “character-based”\nstory. Interesting, but ultimately boring to me. I was not enthused to\nfind out that the next long story in this collection was a sequel to\nthis.\nThe Chaplain’s Legacy – My lack of enthusiasm for the previous\nstory caused me to put the entire collection down for a few days, but I\nhad volunteered to review this book for Vox, so I did my duty and read\nthe story. The good news is that I liked this much more than the\nprevious short, though in my opinion the size could have been condensed.\nThe Hero’s Tongue: Larry Niven – Of all of the essays in the\nbook, this one was the most enjoyable for me because of my own fondness\nfor Niven.\nExanastasis – Interesting, enjoyable, but ultimately forgettable.\nRay of Light – The final story of the collection and probably\nmy favorite. There were points in this story where I thought it was\ngoing to break badly, but the story didn’t go in the direction I thought\nit would end up, and I enjoyed it a lot.\nThe last story really brought my opinion of the whole\ncollection back up from a low spot. I enjoy Torgerson’s writing style,\nand I will look up some of his longer work, but probably not the\nforthcoming “Chaplain” story.\nI’d give this collection a solid 3 out of 5 stars.",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-09T13:00:00+00:00"
}