{
  "url": "https://voxday.net/2013/10/13/cerns-research-director-on-climate/",
  "scraped_at": "2025-12-14T22:45:00.857204",
  "title": "CERN’s Research Director on the climate debate",
  "date_display": "October 13, 2013",
  "date_iso": "2013-10-13T13:30:00+00:00",
  "date_from_url": "2013-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unlike the climate “scientists” and their political defenders, the physicist Pierre Darriulat <a href=\"http://judithcurry.com/2013/10/12/a-physicist-reflects-on-the-climate-debate/\">considers the climate debate</a> and finds there is both reason and justice underlying the charges of scientifically unethical behavior made by the AGW/CC skeptics:</p><blockquote class=\"tr_bq\"><p> A third category of posts found in the climate science blogs is from people interested in the economical and political dimension of the debate and from people interested in its social and human dimension. Those having financial, economical or political interests are among the most passionate and biased participants and their contributions are not very constructive – except in a few instances – and usually do not help much in raising the level of the debate.</p><p>Those who find an interest in the sociological dimension of the debate are much more interesting to me. It is indeed something new, and likely to be of unprecedented importance, to have a public debate on science-related questions that are of major relevance to our future on such a large scale. It seems to me to be overlooked – or at least insufficiently appreciated ­– by the establishment, such as academies of sciences, learned societies, editorial boards of major science journals, mass media, etc. The so-called “skeptics” often claim that they are better scientifically minded, meaning having a better sense of scientific ethic than the so-called “warmists” and I think that any neutral observer must recognize that they have a point there.</p><p>After having sorted the wheat from the chaff – which is relatively easy but obviously considered as criminal by the chaff – one is left with a very respectable and informative set of statements, which simply cannot be ignored. The politization of the debate has undeniably resulted in unscientific practices. The difficulty to publish a case that dissents from orthodoxy is real. I have refereed many articles for several journals and I know that there is always some unconscious subjectivity in our judgement, well-known authors obviously enjoying a favourable prejudice.</p><p>I have also experienced myself, when having changed field from a domain where I was well known to a new one where I was unknown, that it takes time to be accepted by the new community and by the referee who evaluates your article – one to two years. The present machinery of our system of social interactions is not prepared to properly handle the new situation. How to depart from the black and white segregation of clans such as warmists, activists, alarmists, deniers, skeptics, etc, some publishing in Internet, some in traditional scientific journals, some in popular mass media? Sociologists are rightly delighted to witness what is happening and to see there a very rich ground for their investigations….</p><p>Something that strikes me is the parallel between the way the climate<br> debate is received by the general public and the way the nuclear debate<br> has been. I am neither pro- nor anti-nuclear but I understand<br> reasonably well the issues that are at stake. In the nuclear case purely<br> emotional and irrational arguments have been exploited by green<br> activists up to a point where several countries have now banned nuclear<br> energy. In the climate case, the green activists are with the<br> establishement rather than being against, as they were in the nuclear<br> case. But this is almost irrelevant.</br></br></br></br></br></br></br></br></p><p>What I am witnessing is the same arrogance in the establishment, the<br> same irrational and emotional fear in the general public, amplified by a<br> majority of popular media. In both cases, wrong decisions are being<br> taken under the pressure of political and financial interests. What is<br> completely new, however, is the existence, with Internet, of a forum in<br> which the debate is taking place on a very large scale. Obviously, as<br> few people read these blogs as those who read the scientific<br> litterature, the majority relies on newspapers and television for their<br> information. Yet, somehow, it seems to me that the debate that is going<br> on there contains enough popular wisdom to mark a change in our practice<br> of communicating, exerting democracy and taking decisions and deserves<br> serious attention.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>What is most striking to me is the total hypocrisy of the warmists. They religiously apply the genetic fallacy to every anti-warmist site and scientist, while stubbornly proclaiming their faith in the pure devotion to science of well-funded institutions and individuals blithely, and in many cases, nonsensically, proclaiming the IPCC party line.  Either the genetic fallacy applies to both sides equally or it does not; given that it is an identified logical fallacy, I would suggest that it should not be applied to either side and the science, such as it is, should stand or fall on the basis of its own successes and failures.</p><p>Why those who support the IPCC agenda refuse to engage on those grounds, I leave up to the reader. Being an elite member of the scientific establishment, I think Mr. Darriulat is perhaps a little too ready to excuse its observable failings.</p></div>",
  "content_text": "Unlike the climate “scientists” and their political defenders, the physicist Pierre Darriulat\nconsiders the climate debate\nand finds there is both reason and justice underlying the charges of scientifically unethical behavior made by the AGW/CC skeptics:\nA third category of posts found in the climate science blogs is from people interested in the economical and political dimension of the debate and from people interested in its social and human dimension. Those having financial, economical or political interests are among the most passionate and biased participants and their contributions are not very constructive – except in a few instances – and usually do not help much in raising the level of the debate.\nThose who find an interest in the sociological dimension of the debate are much more interesting to me. It is indeed something new, and likely to be of unprecedented importance, to have a public debate on science-related questions that are of major relevance to our future on such a large scale. It seems to me to be overlooked – or at least insufficiently appreciated ­– by the establishment, such as academies of sciences, learned societies, editorial boards of major science journals, mass media, etc. The so-called “skeptics” often claim that they are better scientifically minded, meaning having a better sense of scientific ethic than the so-called “warmists” and I think that any neutral observer must recognize that they have a point there.\nAfter having sorted the wheat from the chaff – which is relatively easy but obviously considered as criminal by the chaff – one is left with a very respectable and informative set of statements, which simply cannot be ignored. The politization of the debate has undeniably resulted in unscientific practices. The difficulty to publish a case that dissents from orthodoxy is real. I have refereed many articles for several journals and I know that there is always some unconscious subjectivity in our judgement, well-known authors obviously enjoying a favourable prejudice.\nI have also experienced myself, when having changed field from a domain where I was well known to a new one where I was unknown, that it takes time to be accepted by the new community and by the referee who evaluates your article – one to two years. The present machinery of our system of social interactions is not prepared to properly handle the new situation. How to depart from the black and white segregation of clans such as warmists, activists, alarmists, deniers, skeptics, etc, some publishing in Internet, some in traditional scientific journals, some in popular mass media? Sociologists are rightly delighted to witness what is happening and to see there a very rich ground for their investigations….\nSomething that strikes me is the parallel between the way the climate\ndebate is received by the general public and the way the nuclear debate\nhas been. I am neither pro- nor anti-nuclear but I understand\nreasonably well the issues that are at stake. In the nuclear case purely\nemotional and irrational arguments have been exploited by green\nactivists up to a point where several countries have now banned nuclear\nenergy. In the climate case, the green activists are with the\nestablishement rather than being against, as they were in the nuclear\ncase. But this is almost irrelevant.\nWhat I am witnessing is the same arrogance in the establishment, the\nsame irrational and emotional fear in the general public, amplified by a\nmajority of popular media. In both cases, wrong decisions are being\ntaken under the pressure of political and financial interests. What is\ncompletely new, however, is the existence, with Internet, of a forum in\nwhich the debate is taking place on a very large scale. Obviously, as\nfew people read these blogs as those who read the scientific\nlitterature, the majority relies on newspapers and television for their\ninformation. Yet, somehow, it seems to me that the debate that is going\non there contains enough popular wisdom to mark a change in our practice\nof communicating, exerting democracy and taking decisions and deserves\nserious attention.\nWhat is most striking to me is the total hypocrisy of the warmists. They religiously apply the genetic fallacy to every anti-warmist site and scientist, while stubbornly proclaiming their faith in the pure devotion to science of well-funded institutions and individuals blithely, and in many cases, nonsensically, proclaiming the IPCC party line.  Either the genetic fallacy applies to both sides equally or it does not; given that it is an identified logical fallacy, I would suggest that it should not be applied to either side and the science, such as it is, should stand or fall on the basis of its own successes and failures.\nWhy those who support the IPCC agenda refuse to engage on those grounds, I leave up to the reader. Being an elite member of the scientific establishment, I think Mr. Darriulat is perhaps a little too ready to excuse its observable failings.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-13T12:30:00+00:00"
}