{
  "url": "https://voxday.net/2013/10/31/dark-matter-is-still-dark-vapor/",
  "scraped_at": "2025-12-15T16:35:21.705842",
  "title": "Dark matter is still dark vapor",
  "date_display": "October 31, 2013",
  "date_iso": "2013-10-31T09:10:00+00:00",
  "date_from_url": "2013-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It proved impossible not to laugh at Bad Astronomy in light of the fact that actual scientific experiments are proving the science skeptic, and not the so-called astronomer, correct.  Back in 2008, <a href=\"http://blogs.discovermagazine.com/badastronomy/2008/03/08/ignorance-is-blitz/\">the intrepid space expert wrote</a>:<i> </i></p><blockquote class=\"tr_bq\"><p> “I happened to notice I was getting some traffic sent my way from Voxday,<br> an ultraconservative blogger who has a history of saying ridiculous<br> things — sometimes so ridiculous it’s indistinguishable from satire.<br> Unfortunately, of course, willful ignorance has quite an audience these<br> days, and just in case it’s not satire, I decided to reply….</br></br></br></br></p><p>“Your conclusions are way off the mark, for two reasons: you<br> misinterpreted/misunderstood what scientists did, and then you<br> misapplied it.</br></br></p><p>“First, 5% of the Universe is normal matter and energy. About 23% or<br> so is dark matter. While we don’t know precisely what it’s made of, its<br> existence has been conclusively proven, and it was using scientific<br> methods that proved it (its existence was speculated due to odd motions<br> of galaxies, its impact on observations predicted and then confirmed).”</br></br></br></br></p></blockquote><p>Needless to say, I was unintimidated by the conventional “you just don’t understand sicence” response to which insecure scientists usually retreat when those they consider to be outside the secular priesthood dare to approach the sacred mysteries they reserve for themselves. How dare anyone point out the lack of evidence for <i>their </i>assumptions! After all, the consensus is <i>settled </i>and the matter is therefore <i>conclusively proven</i>!</p><p><a href=\"http://www.milobookclub.com/2008/03/13/triumph-of-science-skeptic/\">At the time I wrote</a>: “I do so enjoy seeing their unmitigated faith in scientific snapshots<br> landing the stupidly arrogant scientific faithful on their asses yet<br> again.  What passes for science these days is beginning to sound like a<br> Monty Python skit:</br></br></br></p><p><i>“Dark Matter and Dark Energy…Dark Matter<br> and Dark Energy…. Our two explanations are Dark Matter and Dark<br> Energy…and Dark Vapor…. Our three explanations are Dark Matter, and<br> Dark Energy, and Dark Vapor…and an almost fanatical devotion to Karl<br> Popper…. Our four…no… Amongst our explanations are such elements<br> as Dark Matter, Dark Energy…. I’ll come in again.”</br></br></br></br></br></i></p><p>But it gets better, <a href=\"http://www.nature.com/news/no-sign-of-dark-matter-in-underground-experiment-1.14057\">thanks to science</a>:</p><blockquote class=\"tr_bq\"><p> A US team that claims to have built the world’s most sensitive dark matter detector has completed its first data run without seeing any sign of the stuff.</p><p>In a webcast presentation today at the Sanford Underground Laboratory in Lead, South Dakota, physicists working on the Large Underground Xenon (LUX) experiment said they had seen nothing statistically compelling in 110 days of data-taking. “We find absolutely no events consistent with any kind of dark matter,” says LUX co-spokesman Rick Gaitskell, a physicist at Brown University in Providence, Rhode Island.</p><p>Physicists know from astronomical observations that 85% of the Universe’s matter is dark, making itself known only through its gravitational pull on conventional matter. Some think it may also engage in weak but detectable collisions with ordinary matter, and several direct detection experiments have reported tantalizing hints of these candidate dark matter particles, known as WIMPs (Weakly Interacting Massive Particles). Gaitskell says that it is now overwhelmingly likely that earlier sightings were statistical fluctuations.<i><br/></i></p></blockquote><p>Now, with whose hypothesis are the results of this experiment consistent? The astronomer who knows, <i>he just knows</i>, that dark matter exists? Or the skeptic who, while open to the possibility that said material exists, understands the probability is that dark matter is nothing more than a mathematical fudge factor that allows the equations required by the current physics paradigm to balance properly?</p><p>Nor is this the first time the hunt for dark matter has failed since 2008. <i>“In 2011, XENON-100 <a href=\"http://www.nature.com/news/2011/110414/full/news.2011.235.html\">also saw no evidence for dark matter</a>,<br> but had been criticized for not being sensitive enough to very low-mass<br> dark matter particles tentatively reported by other experiments. LUX<br> has five times the sensitivity of XENON-100 in the low-mass realm, which<br> should allay those concerns, says Gaitskell.”</br></br></br></br></i></p><p>Bad Astronomy has made a fundamental logical error that is increasingly common in scientistry, which is to adopt a scientific paradigm, accept a theory that is supported by mathematical models rather than by actual scientody, and then assume that the material evidence will eventually be found to support the model. But there are three potential problems there. If there are any flaws in the paradigm, the theory, or the model, then the evidence will not be found.</p><p>I don’t know if any of those three things are flawed, as I have neither the training nor the level of interest to delve into the matter in sufficient detail. But logic, combined with a knowledge of scientific history, is sufficient to conclude that if the predictive model repeatedly fails, there is, at the very least, a possibility that there is a mistake in the assumptions somewhere between the overall paradigm and the specific predictive model upon which the experiment is based.</p><p>Bad Astronomy’s unseemly scientific arrogance not only invites public humiliation, but indicates an inability to learn from the mistakes of past scientists. After all, it wasn’t all that long ago that scientists were certain about the existence of luminiferous aether. It hardly seems impossible that one day, future Bad Astronomy types will attempt to disavow the notion that real scientists ever believed in anything so obviously nonsensical as “dark matter”.</p><p>A wiser professional cosmologist wrote the following on Slashdot:</p><p><i>“Any of this could be down to a modification of gravity. We know the<br> nature of gravity roughly up to the position of the Voyager craft —<br> call it 300AU to be generous. We are extrapolating that a thousand times<br> to get to galactic scales, a million times to get to cluster scales,<br> and a thousand million times to get to cosmological scales, all without<br> evidence. Of course, without a better theory to replace relativity, it’s<br> the best we can do, so we do it – but don’t try and claim that<br> instruments have detected that it is matter (they haven’t), nor that we<br> are wedded to particulate dark matter.”</br></br></br></br></br></br></br></br></i></p><p> <b>UPDATE: </b>A physicist bitch-slaps Phil Plait aka Bad Astronomy in the comments:</p><p>“Most scientists do not believe the current model of the universe or anything about it is proven.<br> That’s Plait’s opinion, and it’s frankly astonishing that anyone with a<br> PhD from a respectable university would make such a plainly stupid and<br> irresponsible statement. Plait is grossly misstating the situation, and<br> his statements do not represent the views of most particle<br> physicists / cosmologists, who willingly distinguish between that for<br> which there is ample evidence, that for which there are problems, and<br> that for which there is proof (nothing).”</br></br></br></br></br></br></br></p><p>Yeah, that’s what she said….</p></div>",
  "content_text": "It proved impossible not to laugh at Bad Astronomy in light of the fact that actual scientific experiments are proving the science skeptic, and not the so-called astronomer, correct.  Back in 2008,\nthe intrepid space expert wrote\n:\n“I happened to notice I was getting some traffic sent my way from Voxday,\nan ultraconservative blogger who has a history of saying ridiculous\nthings — sometimes so ridiculous it’s indistinguishable from satire.\nUnfortunately, of course, willful ignorance has quite an audience these\ndays, and just in case it’s not satire, I decided to reply….\n“Your conclusions are way off the mark, for two reasons: you\nmisinterpreted/misunderstood what scientists did, and then you\nmisapplied it.\n“First, 5% of the Universe is normal matter and energy. About 23% or\nso is dark matter. While we don’t know precisely what it’s made of, its\nexistence has been conclusively proven, and it was using scientific\nmethods that proved it (its existence was speculated due to odd motions\nof galaxies, its impact on observations predicted and then confirmed).”\nNeedless to say, I was unintimidated by the conventional “you just don’t understand sicence” response to which insecure scientists usually retreat when those they consider to be outside the secular priesthood dare to approach the sacred mysteries they reserve for themselves. How dare anyone point out the lack of evidence for\ntheir\nassumptions! After all, the consensus is\nsettled\nand the matter is therefore\nconclusively proven\n!\nAt the time I wrote\n: “I do so enjoy seeing their unmitigated faith in scientific snapshots\nlanding the stupidly arrogant scientific faithful on their asses yet\nagain.  What passes for science these days is beginning to sound like a\nMonty Python skit:\n“Dark Matter and Dark Energy…Dark Matter\nand Dark Energy…. Our two explanations are Dark Matter and Dark\nEnergy…and Dark Vapor…. Our three explanations are Dark Matter, and\nDark Energy, and Dark Vapor…and an almost fanatical devotion to Karl\nPopper…. Our four…no… Amongst our explanations are such elements\nas Dark Matter, Dark Energy…. I’ll come in again.”\nBut it gets better,\nthanks to science\n:\nA US team that claims to have built the world’s most sensitive dark matter detector has completed its first data run without seeing any sign of the stuff.\nIn a webcast presentation today at the Sanford Underground Laboratory in Lead, South Dakota, physicists working on the Large Underground Xenon (LUX) experiment said they had seen nothing statistically compelling in 110 days of data-taking. “We find absolutely no events consistent with any kind of dark matter,” says LUX co-spokesman Rick Gaitskell, a physicist at Brown University in Providence, Rhode Island.\nPhysicists know from astronomical observations that 85% of the Universe’s matter is dark, making itself known only through its gravitational pull on conventional matter. Some think it may also engage in weak but detectable collisions with ordinary matter, and several direct detection experiments have reported tantalizing hints of these candidate dark matter particles, known as WIMPs (Weakly Interacting Massive Particles). Gaitskell says that it is now overwhelmingly likely that earlier sightings were statistical fluctuations.\nNow, with whose hypothesis are the results of this experiment consistent? The astronomer who knows,\nhe just knows\n, that dark matter exists? Or the skeptic who, while open to the possibility that said material exists, understands the probability is that dark matter is nothing more than a mathematical fudge factor that allows the equations required by the current physics paradigm to balance properly?\nNor is this the first time the hunt for dark matter has failed since 2008.\n“In 2011, XENON-100\nalso saw no evidence for dark matter\n,\nbut had been criticized for not being sensitive enough to very low-mass\ndark matter particles tentatively reported by other experiments. LUX\nhas five times the sensitivity of XENON-100 in the low-mass realm, which\nshould allay those concerns, says Gaitskell.”\nBad Astronomy has made a fundamental logical error that is increasingly common in scientistry, which is to adopt a scientific paradigm, accept a theory that is supported by mathematical models rather than by actual scientody, and then assume that the material evidence will eventually be found to support the model. But there are three potential problems there. If there are any flaws in the paradigm, the theory, or the model, then the evidence will not be found.\nI don’t know if any of those three things are flawed, as I have neither the training nor the level of interest to delve into the matter in sufficient detail. But logic, combined with a knowledge of scientific history, is sufficient to conclude that if the predictive model repeatedly fails, there is, at the very least, a possibility that there is a mistake in the assumptions somewhere between the overall paradigm and the specific predictive model upon which the experiment is based.\nBad Astronomy’s unseemly scientific arrogance not only invites public humiliation, but indicates an inability to learn from the mistakes of past scientists. After all, it wasn’t all that long ago that scientists were certain about the existence of luminiferous aether. It hardly seems impossible that one day, future Bad Astronomy types will attempt to disavow the notion that real scientists ever believed in anything so obviously nonsensical as “dark matter”.\nA wiser professional cosmologist wrote the following on Slashdot:\n“Any of this could be down to a modification of gravity. We know the\nnature of gravity roughly up to the position of the Voyager craft —\ncall it 300AU to be generous. We are extrapolating that a thousand times\nto get to galactic scales, a million times to get to cluster scales,\nand a thousand million times to get to cosmological scales, all without\nevidence. Of course, without a better theory to replace relativity, it’s\nthe best we can do, so we do it – but don’t try and claim that\ninstruments have detected that it is matter (they haven’t), nor that we\nare wedded to particulate dark matter.”\nUPDATE:\nA physicist bitch-slaps Phil Plait aka Bad Astronomy in the comments:\n“Most scientists do not believe the current model of the universe or anything about it is proven.\nThat’s Plait’s opinion, and it’s frankly astonishing that anyone with a\nPhD from a respectable university would make such a plainly stupid and\nirresponsible statement. Plait is grossly misstating the situation, and\nhis statements do not represent the views of most particle\nphysicists / cosmologists, who willingly distinguish between that for\nwhich there is ample evidence, that for which there are problems, and\nthat for which there is proof (nothing).”\nYeah, that’s what she said….",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-31T09:10:00+00:00"
}