{
  "url": "https://voxday.net/2013/10/20/eas-next-debacle/",
  "scraped_at": "2025-12-15T16:34:15.028558",
  "title": "EA’s next debacle and the crash of 2014",
  "date_display": "October 20, 2013",
  "date_iso": "2013-10-20T11:36:00+00:00",
  "date_from_url": "2013-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Having played a considerable amount of Battlefield 2 and 3, I am not at all sanguine about the prospects for success of <a href=\"http://www.nytimes.com/2013/10/20/technology/this-is-war-for-a-game-industrys-soul.html?adxnnl=1&amp;hpw=&amp;adxnnlx=1382268496-jj4f/Nb2n4yTfkIZCbBQaw\">the next version of the franchise</a>:</p><blockquote class=\"tr_bq\"><p> The Swedish Army drafted Patrick Bach in the early 1990s and tried to<br> make a soldier out of him. No such luck. Mr. Bach couldn’t see the point<br> of pretending to protect a country at peace since the Napoleonic wars.<br> The only part he liked was the shooting.</br></br></br></p><p>Twenty years later, Mr. Bach commands a high-tech army that is at war all the time. As the creative force behind the Battlefield series of video games, he must make sure that players come back again and again, no matter how often they get whacked. Which, if you are keeping score, is about seven billion times in the last two years.</p><p>For months, a development team in Stockholm has been frantically preparing a new version of the game. Played out in desolate cityscapes, on the sea and in the skies, Battlefield 4 is a dream of Armageddon without civilian suffering to make things messy. Already, fans are hailing what one early reviewer called “an insane new level of destructibility.”</p><p>Bloody and dramatic as it is, Battlefield 4 is only the opening move of a bigger effort by Mr. Bach and his colleagues at Digital Illusions Creative Entertainment, or DICE, a development studio owned by the Silicon Valley gaming powerhouse Electronic Arts. They are trying to create a new type of military shooting game even as the genre confronts technological, narrative and public relations hurdles. If they fail, video games will be that much closer to extinction.</p><p>Like big-budget movies, newspapers, printed books, DVDs and other once-dominant means of conveying information and entertainment, traditional video games like Battlefield — played at home, with a special console or maybe a souped-up PC and the biggest possible screen — are under digital assault. A handful of programmers in a garage can put together a crude but compulsive smartphone game in a few weeks. These games are designed to be played in snippets, anytime and anywhere, making them ideal for a busy modern life.</p><p>Mobile games are not exactly complicated. Fruit Ninja involves slicing animated fruit in half. ActionPotato is all about trying to catch potatoes. Candy Crush Saga consists of rearranging pieces of candy — and is played 700 million times a day, its creator says.</p><p>Immersive games like Battlefield, on the other hand, require years of intricate work by hundreds of software engineers and artists. They demand an investment by players, too: $60 plus quite a few moments of attention. And they are tied to technology going the way of the rotary phone. PC sales are dropping as users migrate to tablets, while sales of the Microsoft Xbox and Sony PlayStation consoles have wilted 40 percent in the last two years.</p><p>Traditional video games will not disappear tomorrow. It is a multibillion-dollar business, with shooters like Battlefield its most enduring category. The visceral thrill that players get from their virtual guns — the ability to reach into an imaginary world and destroy things — cannot be replicated on a smartphone, at least not yet.</p><p>Electronic Arts is nevertheless trying to extend franchises like Battlefield to devices, because it must. But at the same time, it has to grapple with the threats undermining traditional gaming. Though the classic consoles are getting reboots this fall, there is no guarantee that new models will permanently revive the format’s fortunes. In 2006, Nintendo introduced the Wii to iPhone-type excitement. The latest version had a tepid response. The new Xbox and PlayStation will get more attention but face an undercurrent of doubt.</p><p>“Nintendo, Microsoft and Sony are beyond the point of no return in this industry,” analysts at Asymco warned in a report last month titled “Game Over.”</p><p>Even a relentless optimist like Frank Gibeau, a veteran executive at Electronic Arts, acknowledges that the industry has become much more complicated.</p><p>“When you take technology and entertainment and slam them together for a highly demanding user base, you’re in the deep end of the deepest pool,” he said. “The movie business is tough, but this is really hard.”</p><p>The first-person shooter, which allows a player to be the character instead of just an observer, took off with the demon-slaughterfest Doom in 1993 but had its best run after 2001. The games drew inspiration from the wars in Iraq and Afghanistan and the real-life exploits of the Special Forces. Studios often worked in collaboration with former members of the United States military.</p><p>Danger Close, a Los Angeles studio also owned by EA, released last fall the 14th incarnation of Medal of Honor, a shooter that was promoted as the ultimate in realism. But reviewers disparaged it and gamers rejected it. Don’t look for version 15 anytime soon; EA shuttered the studio.</p><p>Mr. Gibeau explained EA’s new shooter strategy: “We’re doubling down on the DICE team.”</p><p>Which is how it came to pass that a bunch of guys in Sweden whose knowledge of the American military comes from watching “Saving Private Ryan” and “Platoon” is now making EA’s only contemporary military shooter.</p></blockquote><p>Good luck with that one. As one of the first designers of a 3D military FPS, (you can see videos of <a href=\"http://www.youtube.com/watch?v=tlu2WjE8fbA\">the unfinished Rebel Moon Revolution</a> on YouTube that a Russian hacker team put together), I’ve watched the rise and fall of the mil-FPS with equal parts amusement and despair.</p><p>I can’t think of company that has blown more, and better, opportunities than EA. They have acquired, and destroyed, so many excellent game studios. Origin. Bullfrog. Maxis. Westwood. Now PopCap, Playfish, and Firemint. If it weren’t for their valuable sports franchises, Madden and FIFA, they’d have gone out of business years ago.</p><p>One of the startling points of the article is that EA has gone from publishing 67 console and PC games in 2008 to 10. They are doing the exact opposite of what Taleb recommends in <i>Antifragile</i>; they are increasing the fragility of the corporation. By putting so many eggs in so few baskets, a few failures will be all it takes to bring down the corporation once and for all. I have friends who are at the studio head level, and EA has closed down multiple <i>profitable </i>studios because their revenues are not large enough.</p><p>Which means EA is literally strangling in their cradles what would have been their next generation of blockbusters, because very few studios produce massive hits on their first or second attempts. Rovio famously succeeded on what it claims was its fifty-first attempt. Ultima was the successor to Akalabeth, or as it had previously been called, D&amp;D Game #27. Wolfenstein 3D was id’s 14th game.</p><p>The game companies are failing to understand that the games market has not grown so much as bifurcated into games for gamers and games for non-gamers. The problem is first that there are more non-gamers willing to play Angry Birds and Candy Crush than there are gamers, second that the mobile platforms are far more conducive to non-gamer games than gamer games.  (Or use hard core vs casual if you like, it is the concept that is important, not the terminology.) So, in trying to chase both markets simultaneously, they are pursuing intrinsically self-contradictory strategies.</p><p>This is why I think we are well on our way to another 1983-style video game crash. Some in the industry think we’re already in it, but I think 2014 will be the year this becomes clear. It’s not a bad thing, though, as it will destroy the sickly giants and clear the way for a new generation of game companies, which likely will not include the likes of Electronic Arts, Rovio, or Zynga.</p></div>",
  "content_text": "Having played a considerable amount of Battlefield 2 and 3, I am not at all sanguine about the prospects for success of\nthe next version of the franchise\n:\nThe Swedish Army drafted Patrick Bach in the early 1990s and tried to\nmake a soldier out of him. No such luck. Mr. Bach couldn’t see the point\nof pretending to protect a country at peace since the Napoleonic wars.\nThe only part he liked was the shooting.\nTwenty years later, Mr. Bach commands a high-tech army that is at war all the time. As the creative force behind the Battlefield series of video games, he must make sure that players come back again and again, no matter how often they get whacked. Which, if you are keeping score, is about seven billion times in the last two years.\nFor months, a development team in Stockholm has been frantically preparing a new version of the game. Played out in desolate cityscapes, on the sea and in the skies, Battlefield 4 is a dream of Armageddon without civilian suffering to make things messy. Already, fans are hailing what one early reviewer called “an insane new level of destructibility.”\nBloody and dramatic as it is, Battlefield 4 is only the opening move of a bigger effort by Mr. Bach and his colleagues at Digital Illusions Creative Entertainment, or DICE, a development studio owned by the Silicon Valley gaming powerhouse Electronic Arts. They are trying to create a new type of military shooting game even as the genre confronts technological, narrative and public relations hurdles. If they fail, video games will be that much closer to extinction.\nLike big-budget movies, newspapers, printed books, DVDs and other once-dominant means of conveying information and entertainment, traditional video games like Battlefield — played at home, with a special console or maybe a souped-up PC and the biggest possible screen — are under digital assault. A handful of programmers in a garage can put together a crude but compulsive smartphone game in a few weeks. These games are designed to be played in snippets, anytime and anywhere, making them ideal for a busy modern life.\nMobile games are not exactly complicated. Fruit Ninja involves slicing animated fruit in half. ActionPotato is all about trying to catch potatoes. Candy Crush Saga consists of rearranging pieces of candy — and is played 700 million times a day, its creator says.\nImmersive games like Battlefield, on the other hand, require years of intricate work by hundreds of software engineers and artists. They demand an investment by players, too: $60 plus quite a few moments of attention. And they are tied to technology going the way of the rotary phone. PC sales are dropping as users migrate to tablets, while sales of the Microsoft Xbox and Sony PlayStation consoles have wilted 40 percent in the last two years.\nTraditional video games will not disappear tomorrow. It is a multibillion-dollar business, with shooters like Battlefield its most enduring category. The visceral thrill that players get from their virtual guns — the ability to reach into an imaginary world and destroy things — cannot be replicated on a smartphone, at least not yet.\nElectronic Arts is nevertheless trying to extend franchises like Battlefield to devices, because it must. But at the same time, it has to grapple with the threats undermining traditional gaming. Though the classic consoles are getting reboots this fall, there is no guarantee that new models will permanently revive the format’s fortunes. In 2006, Nintendo introduced the Wii to iPhone-type excitement. The latest version had a tepid response. The new Xbox and PlayStation will get more attention but face an undercurrent of doubt.\n“Nintendo, Microsoft and Sony are beyond the point of no return in this industry,” analysts at Asymco warned in a report last month titled “Game Over.”\nEven a relentless optimist like Frank Gibeau, a veteran executive at Electronic Arts, acknowledges that the industry has become much more complicated.\n“When you take technology and entertainment and slam them together for a highly demanding user base, you’re in the deep end of the deepest pool,” he said. “The movie business is tough, but this is really hard.”\nThe first-person shooter, which allows a player to be the character instead of just an observer, took off with the demon-slaughterfest Doom in 1993 but had its best run after 2001. The games drew inspiration from the wars in Iraq and Afghanistan and the real-life exploits of the Special Forces. Studios often worked in collaboration with former members of the United States military.\nDanger Close, a Los Angeles studio also owned by EA, released last fall the 14th incarnation of Medal of Honor, a shooter that was promoted as the ultimate in realism. But reviewers disparaged it and gamers rejected it. Don’t look for version 15 anytime soon; EA shuttered the studio.\nMr. Gibeau explained EA’s new shooter strategy: “We’re doubling down on the DICE team.”\nWhich is how it came to pass that a bunch of guys in Sweden whose knowledge of the American military comes from watching “Saving Private Ryan” and “Platoon” is now making EA’s only contemporary military shooter.\nGood luck with that one. As one of the first designers of a 3D military FPS, (you can see videos of\nthe unfinished Rebel Moon Revolution\non YouTube that a Russian hacker team put together), I’ve watched the rise and fall of the mil-FPS with equal parts amusement and despair.\nI can’t think of company that has blown more, and better, opportunities than EA. They have acquired, and destroyed, so many excellent game studios. Origin. Bullfrog. Maxis. Westwood. Now PopCap, Playfish, and Firemint. If it weren’t for their valuable sports franchises, Madden and FIFA, they’d have gone out of business years ago.\nOne of the startling points of the article is that EA has gone from publishing 67 console and PC games in 2008 to 10. They are doing the exact opposite of what Taleb recommends in\nAntifragile\n; they are increasing the fragility of the corporation. By putting so many eggs in so few baskets, a few failures will be all it takes to bring down the corporation once and for all. I have friends who are at the studio head level, and EA has closed down multiple\nprofitable\nstudios because their revenues are not large enough.\nWhich means EA is literally strangling in their cradles what would have been their next generation of blockbusters, because very few studios produce massive hits on their first or second attempts. Rovio famously succeeded on what it claims was its fifty-first attempt. Ultima was the successor to Akalabeth, or as it had previously been called, D&D Game #27. Wolfenstein 3D was id’s 14th game.\nThe game companies are failing to understand that the games market has not grown so much as bifurcated into games for gamers and games for non-gamers. The problem is first that there are more non-gamers willing to play Angry Birds and Candy Crush than there are gamers, second that the mobile platforms are far more conducive to non-gamer games than gamer games.  (Or use hard core vs casual if you like, it is the concept that is important, not the terminology.) So, in trying to chase both markets simultaneously, they are pursuing intrinsically self-contradictory strategies.\nThis is why I think we are well on our way to another 1983-style video game crash. Some in the industry think we’re already in it, but I think 2014 will be the year this becomes clear. It’s not a bad thing, though, as it will destroy the sickly giants and clear the way for a new generation of game companies, which likely will not include the likes of Electronic Arts, Rovio, or Zynga.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-20T10:36:00+00:00"
}