{
  "url": "https://voxday.net/2013/10/03/enforcing-obamacare_3/",
  "scraped_at": "2025-12-14T22:44:11.973844",
  "title": "Enforcing Obamacare",
  "date_display": "October 3, 2013",
  "date_iso": "2013-10-03T13:00:00+00:00",
  "date_from_url": "2013-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It never occurred to me to imagine that the federal government<br> wouldn’t enforce its fines for failure to engage in required economic<br> activity <a href=\"http://www.infowars.com/obamacare-fines-to-be-seized-from-bank-accounts/\">with its usual bag of tricks</a>, including seizing bank accounts and placing property liens:</br></br></p><blockquote class=\"tr_bq\"><p> If true, the implementation of Obamacare is going to be a whole lot more draconian than Americans have been led to believe.<i> </i></p><p><i>“I actually made it through this morning at 8:00 A.M. I<br> have a preexisting condition (Type 1 Diabetes) and my income base was<br> 45K-55K annually I chose tier 2 “Silver Plan” and my monthly premiums<br> came out to $597.00 with $13,988 yearly deductible!!! There is NO<br> POSSIBLE way that I can afford this so I “opt-out” and chose to continue<br> along with no insurance.</br></br></br></br></br></i></p><p><i>“I received an email tonight at 5:00 P.M. informing me<br> that my fine would be $4,037 and could be attached to my yearly income<br> tax return. Then you make it to the “REPERCUSSIONS PORTION” for<br> “non-payment” of yearly fine. First, your drivers license will be<br> suspended until paid, and if you go 24 consecutive months with<br> “Non-Payment” and you happen to be a home owner, you will have a federal<br> tax lien placed on your home. You can agree to give your bank<br> information so that they can easy “Automatically withdraw” your<br> “penalties” weekly, bi-weekly or monthly! This by no means is “Free” or<br> even “Affordable.””</br></br></br></br></br></br></br></br></br></i></p><p>The federal government has consistently denied that any<br> fines pertaining to Obamacare non-compliance could be seized from bank<br> accounts, despite reports last year that the <a href=\"http://www.infowars.com/thousands-of-new-irs-agents-to-be-hired-to-enforce-obamacare/\">IRS had hired 16,500 new agents</a> to harass citizens who attempt to evade the new law.</br></br></p></blockquote><p>The<br> system is breaking down, and it appears to be breaking down<br> increasingly fast. Once people stop paying their Obamacare fines, how<br> long will it be before they stop paying other taxes? And using the<br> banking system as an enforcement device for the sake of compliance is<br> more likely to break the banking system than it is to allow this<br> expansion of the tax system to function as envisioned.</br></br></br></br></br></br></p></div>",
  "content_text": "It never occurred to me to imagine that the federal government\nwouldn’t enforce its fines for failure to engage in required economic\nactivity\nwith its usual bag of tricks\n, including seizing bank accounts and placing property liens:\nIf true, the implementation of Obamacare is going to be a whole lot more draconian than Americans have been led to believe.\n“I actually made it through this morning at 8:00 A.M. I\nhave a preexisting condition (Type 1 Diabetes) and my income base was\n45K-55K annually I chose tier 2 “Silver Plan” and my monthly premiums\ncame out to $597.00 with $13,988 yearly deductible!!! There is NO\nPOSSIBLE way that I can afford this so I “opt-out” and chose to continue\nalong with no insurance.\n“I received an email tonight at 5:00 P.M. informing me\nthat my fine would be $4,037 and could be attached to my yearly income\ntax return. Then you make it to the “REPERCUSSIONS PORTION” for\n“non-payment” of yearly fine. First, your drivers license will be\nsuspended until paid, and if you go 24 consecutive months with\n“Non-Payment” and you happen to be a home owner, you will have a federal\ntax lien placed on your home. You can agree to give your bank\ninformation so that they can easy “Automatically withdraw” your\n“penalties” weekly, bi-weekly or monthly! This by no means is “Free” or\neven “Affordable.””\nThe federal government has consistently denied that any\nfines pertaining to Obamacare non-compliance could be seized from bank\naccounts, despite reports last year that the\nIRS had hired 16,500 new agents\nto harass citizens who attempt to evade the new law.\nThe\nsystem is breaking down, and it appears to be breaking down\nincreasingly fast. Once people stop paying their Obamacare fines, how\nlong will it be before they stop paying other taxes? And using the\nbanking system as an enforcement device for the sake of compliance is\nmore likely to break the banking system than it is to allow this\nexpansion of the tax system to function as envisioned.",
  "tags": [
    "banks",
    "health care"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-03T12:00:00+00:00"
}