{
  "url": "https://voxday.net/2013/10/04/fight-cancer-feel-up-stranger/",
  "scraped_at": "2025-12-14T22:44:21.191137",
  "title": "Fight cancer, feel up a stranger",
  "date_display": "October 4, 2013",
  "date_iso": "2013-10-04T20:00:00+00:00",
  "date_from_url": "2013-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As the NFL ceaselessly works to remind us, October is Breast Cancer Awareness Month.  So, in the spirit of the month, I’d like to encourage everyone, male or female, to fight breast cancer the next time you are in line at the supermarket or the mall behind a woman.</p><p>Just reach out with both hands and give the woman in front of you a thorough breast exam. You never know, you just might save a life! And while she might seem a little surprised at first, show her your pink ribbon and warn her about the dangers of that terrible, terrible disease. It’s all about awareness, after all.</p><p>She’ll probably be grateful. And even if she isn’t, you’ll have the satisfaction of knowing you did the right thing and raised her awareness. <a href=\"http://www.breakingworldnewstoday.com/2013/07/b1831.html\">It is science</a>.</p><p><i>“Women who like to have their breasts squeezed will now possibly gain a<br> health benefit, according to new research released last week. According to researchers from the University of California at Berkeley<br> and the Lawrence Berkeley National Laboratory, putting mechanical force<br> on malignant breast cells can reverse their irregular growth process and<br> put them back on track for a normal growth pattern.”</br></br></br></br></i></p></div>",
  "content_text": "As the NFL ceaselessly works to remind us, October is Breast Cancer Awareness Month.  So, in the spirit of the month, I’d like to encourage everyone, male or female, to fight breast cancer the next time you are in line at the supermarket or the mall behind a woman.\nJust reach out with both hands and give the woman in front of you a thorough breast exam. You never know, you just might save a life! And while she might seem a little surprised at first, show her your pink ribbon and warn her about the dangers of that terrible, terrible disease. It’s all about awareness, after all.\nShe’ll probably be grateful. And even if she isn’t, you’ll have the satisfaction of knowing you did the right thing and raised her awareness.\nIt is science\n.\n“Women who like to have their breasts squeezed will now possibly gain a\nhealth benefit, according to new research released last week. According to researchers from the University of California at Berkeley\nand the Lawrence Berkeley National Laboratory, putting mechanical force\non malignant breast cells can reverse their irregular growth process and\nput them back on track for a normal growth pattern.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-10-04T19:00:00+00:00"
}