{
  "url": "https://voxday.net/2013/10/15/free-land/",
  "scraped_at": "2025-12-14T22:45:12.306932",
  "title": "“Free the Land”",
  "date_display": "October 15, 2013",
  "date_iso": "2013-10-15T13:00:00+00:00",
  "date_from_url": "2013-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Black separatism <a href=\"http://america.aljazeera.com/articles/2013/9/19/in-mississippi-americaasmostrevolutionarymayor.html\">in America</a>:</p><blockquote class=\"tr_bq\"><p> Lumumba smiled and raised his right hand halfway, just a little above the podium, briefly showing the clenched fist of a Black Power salute.</p><p>“And I want to say, free the land!”</p><p>Applause rang out, bells chimed, wooden staffs rose up and people shouted back, “Free the land!” That’s the motto of the Republic of New Afrika (RNA), the movement formed in 1968 that sought to turn the states of Louisiana, Mississippi, Alabama, Georgia and South Carolina into an independent black nation.</p><p>Jackson’s new mayor is a former vice president of the RNA and a co-founder of the Malcolm X Grassroots Movement (MXGM), a national group born in 1993 that seeks self-determination for African-Americans — whom it calls New Afrikans — “by any means necessary.” Like many shaped by the Black Power era, Lumumba long shunned formal politics, until a successful run for City Council in 2009. Now, as mayor, he is seeking to apply the tenets of the black radical tradition to the duties of running a city.</p><p>“Nowadays you’ve got to call yourself a ‘change agent’ or something, or else you’ll make people scared,” Lumumba told me when I visited Jackson in August. “But I am a revolutionary.”</p></blockquote><p>While I’m skeptical about Jackson’s prospects, I’m all in favor of African-American self-determination and separatism. Regardless of how far along the civilizational scale they happen to be, black Americans have the same essential human right to self-government as everyone else. The natural desire for ethnic, cultural, and ideological segregation on the part of blacks, whites, yellows, and everyone else isn’t racist, it is <i>human</i>. To pretend otherwise requires literally years of brainwashing from an early age as well as rigid intellectual self-supervision to refuse to see and admit the obvious.</p><p>This is why, when white Americans seek exactly the same thing as Lumumba and as the Aztlan activists, they are criticized in a vicious way that the black separatists, the Hispanic separatists, and the Pacific Islander separatists are not.</p><p>History informs us that political separation and ethno-racial segregation will eventually take place, the only question is when. Both the USA and the EU have already reached the state of the many multi-ethnic empires that preceded it; no doubt many in the British and Soviet and Austro-Hungarian Empires couldn’t conceive that one day there would be many sovereign nations where one central government once reigned.</p><p>But the USA is not a single central state, it is a violence-imposed empire that consists of the several States. And, in time, it will go the way of all such empires, riven by the simple human desire to be among one’s own kind rather than those of alien ideologies and different levels of civilization.</p></div>",
  "content_text": "Black separatism\nin America\n:\nLumumba smiled and raised his right hand halfway, just a little above the podium, briefly showing the clenched fist of a Black Power salute.\n“And I want to say, free the land!”\nApplause rang out, bells chimed, wooden staffs rose up and people shouted back, “Free the land!” That’s the motto of the Republic of New Afrika (RNA), the movement formed in 1968 that sought to turn the states of Louisiana, Mississippi, Alabama, Georgia and South Carolina into an independent black nation.\nJackson’s new mayor is a former vice president of the RNA and a co-founder of the Malcolm X Grassroots Movement (MXGM), a national group born in 1993 that seeks self-determination for African-Americans — whom it calls New Afrikans — “by any means necessary.” Like many shaped by the Black Power era, Lumumba long shunned formal politics, until a successful run for City Council in 2009. Now, as mayor, he is seeking to apply the tenets of the black radical tradition to the duties of running a city.\n“Nowadays you’ve got to call yourself a ‘change agent’ or something, or else you’ll make people scared,” Lumumba told me when I visited Jackson in August. “But I am a revolutionary.”\nWhile I’m skeptical about Jackson’s prospects, I’m all in favor of African-American self-determination and separatism. Regardless of how far along the civilizational scale they happen to be, black Americans have the same essential human right to self-government as everyone else. The natural desire for ethnic, cultural, and ideological segregation on the part of blacks, whites, yellows, and everyone else isn’t racist, it is\nhuman\n. To pretend otherwise requires literally years of brainwashing from an early age as well as rigid intellectual self-supervision to refuse to see and admit the obvious.\nThis is why, when white Americans seek exactly the same thing as Lumumba and as the Aztlan activists, they are criticized in a vicious way that the black separatists, the Hispanic separatists, and the Pacific Islander separatists are not.\nHistory informs us that political separation and ethno-racial segregation will eventually take place, the only question is when. Both the USA and the EU have already reached the state of the many multi-ethnic empires that preceded it; no doubt many in the British and Soviet and Austro-Hungarian Empires couldn’t conceive that one day there would be many sovereign nations where one central government once reigned.\nBut the USA is not a single central state, it is a violence-imposed empire that consists of the several States. And, in time, it will go the way of all such empires, riven by the simple human desire to be among one’s own kind rather than those of alien ideologies and different levels of civilization.",
  "tags": [
    "decline and fall",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-15T12:00:00+00:00"
}