{
  "url": "https://voxday.net/2013/10/17/guess-that-race/",
  "scraped_at": "2025-12-14T22:45:24.913542",
  "title": "Guess That Race!",
  "date_display": "October 17, 2013",
  "date_iso": "2013-10-17T13:00:00+00:00",
  "date_from_url": "2013-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What could possibly <a href=\"http://philadelphia.cbslocal.com/2013/10/16/exclusive-15-year-old-girl-attacked-by-group-of-teens-in-delaware-county/\">prompt a pack of strangers to viciously attack a young woman </a>walking home from a football game? It’s a complete mystery! It’s like crop circles or other perplexing conundrums for which there are obviously no answers in science, religion, or history.</p><blockquote class=\"tr_bq\"><p> Speaking exclusively to CBS 3, a 15-year-old high school student,<br> whose identity we are concealing, described a terrifying attack by a<br> gang of at least nine teenage boys as she was leaving an Interboro High<br> School football game Monday night.</br></br></br></p><p>The teenage victim described first being taunted by the attackers,<br> who followed her down a neighborhood street, cursing and spitting at<br> her, before she was repeatedly kicked and punched, at least one of the<br> blows to her head.</br></br></br></p><p>“It was scary, just horrible, just the worst feeling in the world,”<br> she said. “He punched me in my back and then kicked me in the back, and<br> then punched me in the back of my head. I couldn’t breathe, I couldn’t<br> move, I couldn’t talk. I was just straight crying.”</br></br></br></p><p>The victim says as at least two of the teenagers pummeled her, the<br> others cheered them on shouting, “come on, let’s get her.” At one point,<br> the victim says, the gang tried to throw her under the wheels of a<br> passing car, which swerved, narrowly missing her.</br></br></br></p></blockquote><p>My guess? I suspect yet another Eskimo-on-Pacific Islander attack. Those bad boys from the frozen tundra can be seriously hard core and we all know how they feel about Hawaiians.</p></div>",
  "content_text": "What could possibly\nprompt a pack of strangers to viciously attack a young woman\nwalking home from a football game? It’s a complete mystery! It’s like crop circles or other perplexing conundrums for which there are obviously no answers in science, religion, or history.\nSpeaking exclusively to CBS 3, a 15-year-old high school student,\nwhose identity we are concealing, described a terrifying attack by a\ngang of at least nine teenage boys as she was leaving an Interboro High\nSchool football game Monday night.\nThe teenage victim described first being taunted by the attackers,\nwho followed her down a neighborhood street, cursing and spitting at\nher, before she was repeatedly kicked and punched, at least one of the\nblows to her head.\n“It was scary, just horrible, just the worst feeling in the world,”\nshe said. “He punched me in my back and then kicked me in the back, and\nthen punched me in the back of my head. I couldn’t breathe, I couldn’t\nmove, I couldn’t talk. I was just straight crying.”\nThe victim says as at least two of the teenagers pummeled her, the\nothers cheered them on shouting, “come on, let’s get her.” At one point,\nthe victim says, the gang tried to throw her under the wheels of a\npassing car, which swerved, narrowly missing her.\nMy guess? I suspect yet another Eskimo-on-Pacific Islander attack. Those bad boys from the frozen tundra can be seriously hard core and we all know how they feel about Hawaiians.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-17T12:00:00+00:00"
}