{
  "url": "https://voxday.net/2013/10/27/homeschool-nazis/",
  "scraped_at": "2025-12-15T16:34:56.672617",
  "title": "Homeschool Nazis",
  "date_display": "October 27, 2013",
  "date_iso": "2013-10-27T13:00:00+00:00",
  "date_from_url": "2013-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matt Walsh <a href=\"http://themattwalshblog.com/2013/10/23/we-are-going-to-home-school-our-kids-but-thats-only-because-we-hate-education/\">points out the historical reality</a> to anti-homeschoolers:</p><blockquote class=\"tr_bq\"><p> I’d like to treat you to a look at a few snippets of some emails I received yesterday, after a certain “controversial” segment on my show:</p><p>“I never realized you were so anti-education…”</p><p>“It figures that a teabagger would hate education so much…”</p><p>“….so it seems you would rather have a nation full of illiterates…”</p><p>“….I get tired of your anarchist propaganda…”</p><p>“I’m sure Hitler would be very proud of you…”</p><p>That last one — the obligatory “you’re as bad as Hitler!” charge — is especially ironic, considering the subject that prompted these responses: public education. Specifically, my belief that government education is an unmitigated disaster, and can only be remedied by more and more families deciding to remove government from the equation and educate their children themselves. That last emailer is, predictably, a proud product of public school. But you already knew that, in light of his hilarious historical ignorance.</p><p>Contrary to his claims, Hitler would not have been very “proud” of my pro-home school rhetoric. In fact, he would have been quite displeased. In fact, he probably would have expressed that displeasure in a manner which would have left no room for interpretation. That’s because Hitler actually outlawed home schooling (a law that’s still enforced in Germany today, and passionately endorsed by our own Justice Department). The Fuehrer was a huge proponent of public schooling — and that’s not an attempt to compare modern public school proponents to Nazis.</p><p>But, you know, if anyone comes close to mirroring the National Socialist Party on this particular subject, it obviously isn’t the home schooling folks…</p></blockquote><p>The whole article is pretty good, as Matt goes on to explain how the public school system is <a href=\"http://www.wnd.com/2002/01/12463/\">working precisely as designed</a>. The fact is that if you believe in public education, you are every bit as much a Nazi as someone who believes Jews should be oven-baked and every bit as much a Communist as someone who believes in the abolition of private property. Adolf Hitler and Karl Marx were both absolutely avid advocates of public education, in fact, “Free education for all children in government schools” is the tenth plank of the Communist Manifesto.</p><p>Public school is systematic child abuse. It is that simple. Don’t ever be defensive about home schooling. When someone asks you why you homeschool, just tell them “public school is child abuse” and give them the opportunity to explain how and why that statement is incorrect. They will not be able to do so.</p></div>",
  "content_text": "Matt Walsh\npoints out the historical reality\nto anti-homeschoolers:\nI’d like to treat you to a look at a few snippets of some emails I received yesterday, after a certain “controversial” segment on my show:\n“I never realized you were so anti-education…”\n“It figures that a teabagger would hate education so much…”\n“….so it seems you would rather have a nation full of illiterates…”\n“….I get tired of your anarchist propaganda…”\n“I’m sure Hitler would be very proud of you…”\nThat last one — the obligatory “you’re as bad as Hitler!” charge — is especially ironic, considering the subject that prompted these responses: public education. Specifically, my belief that government education is an unmitigated disaster, and can only be remedied by more and more families deciding to remove government from the equation and educate their children themselves. That last emailer is, predictably, a proud product of public school. But you already knew that, in light of his hilarious historical ignorance.\nContrary to his claims, Hitler would not have been very “proud” of my pro-home school rhetoric. In fact, he would have been quite displeased. In fact, he probably would have expressed that displeasure in a manner which would have left no room for interpretation. That’s because Hitler actually outlawed home schooling (a law that’s still enforced in Germany today, and passionately endorsed by our own Justice Department). The Fuehrer was a huge proponent of public schooling — and that’s not an attempt to compare modern public school proponents to Nazis.\nBut, you know, if anyone comes close to mirroring the National Socialist Party on this particular subject, it obviously isn’t the home schooling folks…\nThe whole article is pretty good, as Matt goes on to explain how the public school system is\nworking precisely as designed\n. The fact is that if you believe in public education, you are every bit as much a Nazi as someone who believes Jews should be oven-baked and every bit as much a Communist as someone who believes in the abolition of private property. Adolf Hitler and Karl Marx were both absolutely avid advocates of public education, in fact, “Free education for all children in government schools” is the tenth plank of the Communist Manifesto.\nPublic school is systematic child abuse. It is that simple. Don’t ever be defensive about home schooling. When someone asks you why you homeschool, just tell them “public school is child abuse” and give them the opportunity to explain how and why that statement is incorrect. They will not be able to do so.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-27T13:00:00+00:00"
}