{
  "url": "https://voxday.net/2013/10/05/how-rabit-bat-was-born/",
  "scraped_at": "2025-12-14T22:44:26.667273",
  "title": "How the Rabid Bat was born",
  "date_display": "October 5, 2013",
  "date_iso": "2013-10-05T17:00:00+00:00",
  "date_from_url": "2013-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed tells us of <a href=\"http://www.fredoneverything.net/RabidBat.shtml\">the future history</a> of America’s next generation air superiority fighter:</p><blockquote class=\"tr_bq\"><p> In early 2035, the thirty-fourth year of the war against Al  Qaeda,<br>  the Pentagon issued a White Paper  saying that the F22 Raptor, the<br> front-line fighter plane of the United States,  was nearing the end of<br> its useful life and needed to be replaced. Not everyone  agreed. Various<br> budget-cutting organizations argued that the Raptor had never been used<br> and  thus no one could tell whether it had a useful life. Anyway, the<br> job of the Air  Force, killing third-world peasants and their families,<br> had been co-opted by drones.  America didn´t need a new fighter, said<br> the critics.</br></br></br></br></br></br></br></br></p><p>The Air  Force countered that the new plane would look feral<br> and make loud, exciting  noises. To this, critics could find no<br> rejoinder. Design studies began.</br></br></p><p>An early  question was what to call the new fighter. By<br> tradition, aircraft were named  after aggressive but unintelligent birds<br> (F-15 Eagle, F16 Fighting Falcon),  unpleasant animals (AH-1 Cobra,<br> F-18 Hornet) ghosts (F-4 Phantom, AC-130  Spectre) or Stone Age nomads<br> (AH-64 Apache). However, something with more  pizzazz was needed to get<br> funding through Congress.</br></br></br></br></br></p><p>Discussion ensued. Suggestions  were solicited from The<br> Building, as the Pentagon calls itself. These ran from  “F-40 Screaming<br> Kerblam” to the politically marginal “Horrendous Dyke,” whose  author<br> believed that it would depress enemy fliers. Going with zoological<br> tradition, the Air Force wanted to call it the Rabid Bat. A<br> congressional wag  weary of military price tags  suggested  “Priscilla,”<br> because that no pilot would then go near it and the country would  be<br> spared the expense of wars.  (His idea  of painting it in floral<br> patterns was not taken seriously.)</br></br></br></br></br></br></br></br></p><p>A national  transgender- advocacy  group favored “Susan  B.<br> Anthony,” but this was held to be disrespectful of Ebonics, and in any<br> event  Anthony might be Susan. It was hard to tell about these things.</br></br></p><p>The Air  Force prevailed. The Rabid Bat was born.</p></blockquote><p>Loud exciting noises! You can’t front on that. The sad thing is that it isn’t any sillier than putting female combat troops on the front lines.</p></div>",
  "content_text": "Fred Reed tells us of\nthe future history\nof America’s next generation air superiority fighter:\nIn early 2035, the thirty-fourth year of the war against Al  Qaeda,\nthe Pentagon issued a White Paper  saying that the F22 Raptor, the\nfront-line fighter plane of the United States,  was nearing the end of\nits useful life and needed to be replaced. Not everyone  agreed. Various\nbudget-cutting organizations argued that the Raptor had never been used\nand  thus no one could tell whether it had a useful life. Anyway, the\njob of the Air  Force, killing third-world peasants and their families,\nhad been co-opted by drones.  America didn´t need a new fighter, said\nthe critics.\nThe Air  Force countered that the new plane would look feral\nand make loud, exciting  noises. To this, critics could find no\nrejoinder. Design studies began.\nAn early  question was what to call the new fighter. By\ntradition, aircraft were named  after aggressive but unintelligent birds\n(F-15 Eagle, F16 Fighting Falcon),  unpleasant animals (AH-1 Cobra,\nF-18 Hornet) ghosts (F-4 Phantom, AC-130  Spectre) or Stone Age nomads\n(AH-64 Apache). However, something with more  pizzazz was needed to get\nfunding through Congress.\nDiscussion ensued. Suggestions  were solicited from The\nBuilding, as the Pentagon calls itself. These ran from  “F-40 Screaming\nKerblam” to the politically marginal “Horrendous Dyke,” whose  author\nbelieved that it would depress enemy fliers. Going with zoological\ntradition, the Air Force wanted to call it the Rabid Bat. A\ncongressional wag  weary of military price tags  suggested  “Priscilla,”\nbecause that no pilot would then go near it and the country would  be\nspared the expense of wars.  (His idea  of painting it in floral\npatterns was not taken seriously.)\nA national  transgender- advocacy  group favored “Susan  B.\nAnthony,” but this was held to be disrespectful of Ebonics, and in any\nevent  Anthony might be Susan. It was hard to tell about these things.\nThe Air  Force prevailed. The Rabid Bat was born.\nLoud exciting noises! You can’t front on that. The sad thing is that it isn’t any sillier than putting female combat troops on the front lines.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-05T16:00:00+00:00"
}