{
  "url": "https://voxday.net/2013/10/01/immigration-temporal-comparison/",
  "scraped_at": "2025-12-14T22:44:00.010809",
  "title": "Immigration: a temporal comparison",
  "date_display": "October 1, 2013",
  "date_iso": "2013-10-01T08:52:00+00:00",
  "date_from_url": "2013-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer draws attention to <a href=\"http://isteve.blogspot.com/2013/09/spain-test-case-for-mass-immigration.html\">a failed social experiment</a> in mass immigration.</p><blockquote class=\"tr_bq\"><p> Spain 2007: Imagine what would happen if a prosperous Western nation threw open its borders, allowing immigrants to flood in virtually unchecked. Soaring unemployment, overstretched social services, rising crime, even rioting in the streets? Not in Spain…. Over the past decade, the traditionally homogeneous country has become a sort of open-door laboratory on immigration. Spain has absorbed more than 3 million foreigners from places as diverse as Romania, Morocco, and South America. More than 11% of the country’s 44 million residents are now foreign-born, one of the highest proportions in Europe. With hundreds of thousands more arriving each year, Spain could soon reach the U.S. rate of 12.9%. And it doesn’t seem to have hurt much. Spain is Europe’s best-performing major economy, with growth averaging 3.1% over the past five years.<br> – <a href=\"http://www.businessweek.com/stories/2007-05-20/spain-immigrants-welcome\">Spain: Immigrants Welcome</a>, May 20, 2007</br></p><p>Spain 2013: A strong tourist season helped the unemployment rate dip to 26.3<br> percent from 27.2 percent in the first quarter, the National Statistics<br> Institute said on Thursday. That left 5.98 million people out of work – a far greater proportion<br> of the population that every other euro zone country bar Greece.<br> –  <a href=\"http://www.businessinsider.com/spains-unemployment-rate-falls-to-263-2013-7\">Spain’s Unemployment Rate Falls</a>, July 25, 2013</br></br></br></br></p></blockquote><p> That should suffice to explode the myth that “Immigration is good for the economy”.  That is worse unemployment than Spain suffered during the Great Depression of the 1930s; for that matter, it is worse than the USA experienced during the Great Depression.</p><p>But there is more to it than just the problem of excess immigration. As I have pointed out, the free trade in labor has increasingly driven Spain’s native population out of the country.</p><p><i>“One interpretation of this finding is thus.  Given the quality of its institutions, Spain is due<br> for a lower wage structure, with lower quality jobs, as they might be<br> perceived by the workers themselves.  To some extent, Spain will achieve<br> this new equilibrium by population adjustment and exchange.  Spanish<br> engineers will move to southern Germany and Ecuadorans will move to<br> Spain.”</br></br></br></br></br></i></p><p>Free trade is incompatible with national sovereignty and national identity. It is, intrinsically and quite literally, anti-American, anti-semitic, and anti-everything except big corporations and even bigger governments.  Never forget that Karl Marx was a free trader for precisely that reason. You cannot claim to support either the U.S. Constitution or the American nation and also support free trade.<i></i></p><p>Free trade results in “equilibrium by population adjustment and exchange”.  In practical terms, that means 50 percent of your children will have to live in another country.<i></i></p></div>",
  "content_text": "Steve Sailer draws attention to\na failed social experiment\nin mass immigration.\nSpain 2007: Imagine what would happen if a prosperous Western nation threw open its borders, allowing immigrants to flood in virtually unchecked. Soaring unemployment, overstretched social services, rising crime, even rioting in the streets? Not in Spain…. Over the past decade, the traditionally homogeneous country has become a sort of open-door laboratory on immigration. Spain has absorbed more than 3 million foreigners from places as diverse as Romania, Morocco, and South America. More than 11% of the country’s 44 million residents are now foreign-born, one of the highest proportions in Europe. With hundreds of thousands more arriving each year, Spain could soon reach the U.S. rate of 12.9%. And it doesn’t seem to have hurt much. Spain is Europe’s best-performing major economy, with growth averaging 3.1% over the past five years.\n–\nSpain: Immigrants Welcome\n, May 20, 2007\nSpain 2013: A strong tourist season helped the unemployment rate dip to 26.3\npercent from 27.2 percent in the first quarter, the National Statistics\nInstitute said on Thursday. That left 5.98 million people out of work – a far greater proportion\nof the population that every other euro zone country bar Greece.\n–\nSpain’s Unemployment Rate Falls\n, July 25, 2013\nThat should suffice to explode the myth that “Immigration is good for the economy”.  That is worse unemployment than Spain suffered during the Great Depression of the 1930s; for that matter, it is worse than the USA experienced during the Great Depression.\nBut there is more to it than just the problem of excess immigration. As I have pointed out, the free trade in labor has increasingly driven Spain’s native population out of the country.\n“One interpretation of this finding is thus.  Given the quality of its institutions, Spain is due\nfor a lower wage structure, with lower quality jobs, as they might be\nperceived by the workers themselves.  To some extent, Spain will achieve\nthis new equilibrium by population adjustment and exchange.  Spanish\nengineers will move to southern Germany and Ecuadorans will move to\nSpain.”\nFree trade is incompatible with national sovereignty and national identity. It is, intrinsically and quite literally, anti-American, anti-semitic, and anti-everything except big corporations and even bigger governments.  Never forget that Karl Marx was a free trader for precisely that reason. You cannot claim to support either the U.S. Constitution or the American nation and also support free trade.\nFree trade results in “equilibrium by population adjustment and exchange”.  In practical terms, that means 50 percent of your children will have to live in another country.",
  "tags": [
    "free trade",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-01T07:52:00+00:00"
}