{
  "url": "https://voxday.net/2013/10/29/in-defense-of-intelligent-design/",
  "scraped_at": "2025-12-15T16:35:11.006571",
  "title": "In defense of Intelligent Design",
  "date_display": "October 29, 2013",
  "date_iso": "2013-10-29T17:00:00+00:00",
  "date_from_url": "2013-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I am an evolutionary skeptic rather than an Intelligent Design advocate, (by which I mean that I am skeptical that the Theorum of Evolution by Natural Selection as per the current Neo-Darwinian Synthesis is the correct factual explanation for the way in which one species is transformed into another), one thing that has always struck me as strange about the attempts of evolutionists to criticize the advocates of Intelligent Design as an alternative is that their criticisms were consistently irrelevant.</p><p>The various proposals of ID never struck me as markedly less falsifiable than those of TENS, considering how many tenets of TENS have been historically falsified and subsequently “revised”, to be polite. But not until I read Thomas Kuhn’s <i>The Structure of Scientific Revolutions</i> was I able to articulate what was bothering me about the common evolutionist criticisms of ID, which tend to revolve around ID not being a science because it is untestable and does not involve research, experimentation, and observation.</p><p>For example, the Union of Concerned Scientists explains <a href=\"http://www.ucsusa.org/scientific_integrity/what_you_can_do/why-intelligent-design-is-not.html\">why Intelligent Design is not science</a> and attempts to refute what it describes as ID’s primary claims:</p><blockquote class=\"tr_bq\"><p> <b>There is scientific controversy over evolution:</b> There is no debate about evolution among the vast majority of scientists, and no credible alternative scientific theory exists. Debates within the community are about specific mechanisms within evolution, not whether evolution occurred.</p><p><b>Structures found in nature are too complex to have evolved step-by-step through natural selection [the concept of “irreducible complexity”]:</b>  Natural selection does not require that all structures have the same function or even need to be functional at each step in the development of an organism.</p><p><b>Intelligent design is a scientific theory: </b>A scientific theory is supported by extensive research and repeated experimentation and observation in the natural world. Unlike a true scientific theory, the existence of an “intelligent” agent can not be tested, nor is it falsifiable.</p><p><b>Intelligent design is based on the scientific method:</b> Intelligent design might base its ideas on observations in the natural world, but it does not test them in the natural world, or attempt to develop mechanisms (such as natural selection) to explain their observations.</p></blockquote><p>Setting aside the very arguable point of whether one can reasonably consider TENS a science under these parameters, when one reads how Kuhn describes the way in which one scientific paradigm gives way to another, it should be more than obvious that even if ID is complete and hopelessly incorrect, such criticisms are wholly misplaced and betray a basic failure to understand the philosophical foundations upon which all science rests.</p><p>In XII. The Resolution of Revolutions, Kuhn writes:</p><p>“Any new interpretation of nature, whether a discovery or a theory, emerges first in the mind of one or a few individuals. It is they who first learn to see science and the world differently, and their ability to make the transition is facilitated by two circumstances that are not common to most other members of their profession. Invariably their attention has been intensely concentrated upon the crisis-provoking problems; usually, in addition, they are men so young or so new to the crisis-ridden field that practice has committed them less deeply than most of their contemporaries to the world view and rules determined by the old paradigm. How are they able, what must they do, to convert the entire profession or the relevant professional subgroup to their way of seeing science and the world? What causes the group to abandon one tradition of normal research in favor of another?</p><p>“To see the urgency of those questions, remember that they are the only reconstructions the historian can supply for the philosopher’s inquiry about the testing, verification, or falsification of established scientific theories. In so far as he is engaged in normal science, the research worker is a solver of puzzles, not a tester of paradigms. Though he may, during the search for a particular puzzle’s solution, try out a number of alternative approaches, rejecting those that fail to yield the desired result, he is not testing the paradigm when he does so. Instead he is like the chess player who, with a problem stated and the board physically or mentally before him, tries out various alternative moves in the search for a solution. These trial attempts, whether by the chess player or by the scientist, are trials only of themselves, not of the rules of the game. They are possible only so long as the paradigm itself is taken for granted. Therefore, paradigm-testing occurs only after persistent failure to solve a noteworthy puzzle has given rise to crisis. And even then it occurs only after the sense of crisis has evoked an alternate candidate for paradigm. In the sciences the testing situation never consists, aspuzzle-solving does, simply in the comparison of a single paradigm with nature. Instead, testing occurs as part of the competition between two rival paradigms for the allegiance of the scientific community.”</p><p>As puzzle solvers wholly engrossed in the existing paradigm, biologists and evolutionists are the very last people that we should expect to either have a reasonable perspective on the limits of their consensus paradigm or to be able to appreciate the potential superiority of the new one.</p><p>Intelligent design represents a potential new paradigm, not a better way of solving the existing puzzles under the current paradigm. To expect it to do so is irrational. And while it may be true that biologists are not yet cognizant of the second crisis of Darwin, the fact is that TENS is observably awful at the sort of puzzle-solving that most more reputable sciences reliably deliver.  As per Kuhn, if ID ever begins to show a superior ability to solve the puzzles that TENS can’t, then and only then should we expect to see its advocates begin to abandon the old paradigm in favor of the new one.</p><p>None of this should be taken as a statement that I am an advocate of Intelligent Design. I am not; I have not considered the matter in any significant detail and I see little reason to do so unless and until it can solve some of the problems that TENS cannot. But anyone with even a reasonable amount of intellectual honesty should resist the urge to dismiss a proposed new paradigm for reasons that cannot possibly be considered relevant to the matter.</p></div>",
  "content_text": "While I am an evolutionary skeptic rather than an Intelligent Design advocate, (by which I mean that I am skeptical that the Theorum of Evolution by Natural Selection as per the current Neo-Darwinian Synthesis is the correct factual explanation for the way in which one species is transformed into another), one thing that has always struck me as strange about the attempts of evolutionists to criticize the advocates of Intelligent Design as an alternative is that their criticisms were consistently irrelevant.\nThe various proposals of ID never struck me as markedly less falsifiable than those of TENS, considering how many tenets of TENS have been historically falsified and subsequently “revised”, to be polite. But not until I read Thomas Kuhn’s\nThe Structure of Scientific Revolutions\nwas I able to articulate what was bothering me about the common evolutionist criticisms of ID, which tend to revolve around ID not being a science because it is untestable and does not involve research, experimentation, and observation.\nFor example, the Union of Concerned Scientists explains\nwhy Intelligent Design is not science\nand attempts to refute what it describes as ID’s primary claims:\nThere is scientific controversy over evolution:\nThere is no debate about evolution among the vast majority of scientists, and no credible alternative scientific theory exists. Debates within the community are about specific mechanisms within evolution, not whether evolution occurred.\nStructures found in nature are too complex to have evolved step-by-step through natural selection [the concept of “irreducible complexity”]:\nNatural selection does not require that all structures have the same function or even need to be functional at each step in the development of an organism.\nIntelligent design is a scientific theory:\nA scientific theory is supported by extensive research and repeated experimentation and observation in the natural world. Unlike a true scientific theory, the existence of an “intelligent” agent can not be tested, nor is it falsifiable.\nIntelligent design is based on the scientific method:\nIntelligent design might base its ideas on observations in the natural world, but it does not test them in the natural world, or attempt to develop mechanisms (such as natural selection) to explain their observations.\nSetting aside the very arguable point of whether one can reasonably consider TENS a science under these parameters, when one reads how Kuhn describes the way in which one scientific paradigm gives way to another, it should be more than obvious that even if ID is complete and hopelessly incorrect, such criticisms are wholly misplaced and betray a basic failure to understand the philosophical foundations upon which all science rests.\nIn XII. The Resolution of Revolutions, Kuhn writes:\n“Any new interpretation of nature, whether a discovery or a theory, emerges first in the mind of one or a few individuals. It is they who first learn to see science and the world differently, and their ability to make the transition is facilitated by two circumstances that are not common to most other members of their profession. Invariably their attention has been intensely concentrated upon the crisis-provoking problems; usually, in addition, they are men so young or so new to the crisis-ridden field that practice has committed them less deeply than most of their contemporaries to the world view and rules determined by the old paradigm. How are they able, what must they do, to convert the entire profession or the relevant professional subgroup to their way of seeing science and the world? What causes the group to abandon one tradition of normal research in favor of another?\n“To see the urgency of those questions, remember that they are the only reconstructions the historian can supply for the philosopher’s inquiry about the testing, verification, or falsification of established scientific theories. In so far as he is engaged in normal science, the research worker is a solver of puzzles, not a tester of paradigms. Though he may, during the search for a particular puzzle’s solution, try out a number of alternative approaches, rejecting those that fail to yield the desired result, he is not testing the paradigm when he does so. Instead he is like the chess player who, with a problem stated and the board physically or mentally before him, tries out various alternative moves in the search for a solution. These trial attempts, whether by the chess player or by the scientist, are trials only of themselves, not of the rules of the game. They are possible only so long as the paradigm itself is taken for granted. Therefore, paradigm-testing occurs only after persistent failure to solve a noteworthy puzzle has given rise to crisis. And even then it occurs only after the sense of crisis has evoked an alternate candidate for paradigm. In the sciences the testing situation never consists, aspuzzle-solving does, simply in the comparison of a single paradigm with nature. Instead, testing occurs as part of the competition between two rival paradigms for the allegiance of the scientific community.”\nAs puzzle solvers wholly engrossed in the existing paradigm, biologists and evolutionists are the very last people that we should expect to either have a reasonable perspective on the limits of their consensus paradigm or to be able to appreciate the potential superiority of the new one.\nIntelligent design represents a potential new paradigm, not a better way of solving the existing puzzles under the current paradigm. To expect it to do so is irrational. And while it may be true that biologists are not yet cognizant of the second crisis of Darwin, the fact is that TENS is observably awful at the sort of puzzle-solving that most more reputable sciences reliably deliver.  As per Kuhn, if ID ever begins to show a superior ability to solve the puzzles that TENS can’t, then and only then should we expect to see its advocates begin to abandon the old paradigm in favor of the new one.\nNone of this should be taken as a statement that I am an advocate of Intelligent Design. I am not; I have not considered the matter in any significant detail and I see little reason to do so unless and until it can solve some of the problems that TENS cannot. But anyone with even a reasonable amount of intellectual honesty should resist the urge to dismiss a proposed new paradigm for reasons that cannot possibly be considered relevant to the matter.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-29T17:00:00+00:00"
}