{
  "url": "https://voxday.net/2013/10/09/jews-who-are-not-jews/",
  "scraped_at": "2025-12-14T22:44:42.882631",
  "title": "Jews who are not Jews",
  "date_display": "October 9, 2013",
  "date_iso": "2013-10-09T17:00:00+00:00",
  "date_from_url": "2013-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears neither the Semitic origin theory of the Ashkenazi “Jews” nor the Khazar theory <a href=\"http://www.nature.com/ncomms/2013/131008/ncomms3543/full/ncomms3543.html\">are genetically correct</a>:</p><blockquote class=\"tr_bq\"><p> The origins of Ashkenazi Jews remain highly controversial. Like Judaism, mitochondrial DNA is passed along the maternal line. Its variation in the Ashkenazim is highly distinctive, with four major and numerous minor founders. However, due to their rarity in the general population, these founders have been difficult to trace to a source. Here we show that all four major founders, ~40% of Ashkenazi mtDNA variation, have ancestry in prehistoric Europe, rather than the Near East or Caucasus. Furthermore, most of the remaining minor founders share a similar deep European ancestry. Thus the great majority of Ashkenazi maternal lineages were not brought from the Levant, as commonly supposed, nor recruited in the Caucasus, as sometimes suggested, but assimilated within Europe.</p><p>Overall, we estimate that most (&gt;80%) Ashkenazi mtDNAs were<br> assimilated within Europe. Few derive from a Near Eastern source, and<br> despite the recent revival of the ‘Khazar hypothesis’,<br> virtually none are likely to have ancestry in the North Caucasus.<br> Therefore, whereas on the male side there may have been a significant<br> Near Eastern (and possibly east European/Caucasian) component in<br> Ashkenazi ancestry, the maternal lineages mainly trace back to<br> prehistoric Western Europe. These results emphasize the importance of<br> recruitment of local women and conversion in the formation of Ashkenazi<br> communities, and represent a significant step in the detailed<br> reconstruction of Ashkenazi genealogical history.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I thought it was interesting that Doron Behar, the scientist responsible for the claim that the four most common mitochondrial DNA lineages came from the Near East “said he disagreed with Dr. Richards’ conclusions but declined to explain his reason.”  Notice that even on the male side, the most that can be said is that there “may have been” a Near Eastern connection; that’s a remarkably strong negative statement given the potential sensitivities on the subject.</p><p>The fascinating thing is that instead of being of Israelite descent, the Ashkenazis may actually be Italians, as their closest genetic match appears to be Northern Italians. Which would certainly put an interesting spin on the concept of the Third Rome in Jerusalem. It might also help explain the historical Italian affinity for Ashkenazis during WWII, as 80 percent of Italy’s Ashkenazis survived the Nazi persecution despite the German military occupation.</p></div>",
  "content_text": "It appears neither the Semitic origin theory of the Ashkenazi “Jews” nor the Khazar theory\nare genetically correct\n:\nThe origins of Ashkenazi Jews remain highly controversial. Like Judaism, mitochondrial DNA is passed along the maternal line. Its variation in the Ashkenazim is highly distinctive, with four major and numerous minor founders. However, due to their rarity in the general population, these founders have been difficult to trace to a source. Here we show that all four major founders, ~40% of Ashkenazi mtDNA variation, have ancestry in prehistoric Europe, rather than the Near East or Caucasus. Furthermore, most of the remaining minor founders share a similar deep European ancestry. Thus the great majority of Ashkenazi maternal lineages were not brought from the Levant, as commonly supposed, nor recruited in the Caucasus, as sometimes suggested, but assimilated within Europe.\nOverall, we estimate that most (>80%) Ashkenazi mtDNAs were\nassimilated within Europe. Few derive from a Near Eastern source, and\ndespite the recent revival of the ‘Khazar hypothesis’,\nvirtually none are likely to have ancestry in the North Caucasus.\nTherefore, whereas on the male side there may have been a significant\nNear Eastern (and possibly east European/Caucasian) component in\nAshkenazi ancestry, the maternal lineages mainly trace back to\nprehistoric Western Europe. These results emphasize the importance of\nrecruitment of local women and conversion in the formation of Ashkenazi\ncommunities, and represent a significant step in the detailed\nreconstruction of Ashkenazi genealogical history.\nI thought it was interesting that Doron Behar, the scientist responsible for the claim that the four most common mitochondrial DNA lineages came from the Near East “said he disagreed with Dr. Richards’ conclusions but declined to explain his reason.”  Notice that even on the male side, the most that can be said is that there “may have been” a Near Eastern connection; that’s a remarkably strong negative statement given the potential sensitivities on the subject.\nThe fascinating thing is that instead of being of Israelite descent, the Ashkenazis may actually be Italians, as their closest genetic match appears to be Northern Italians. Which would certainly put an interesting spin on the concept of the Third Rome in Jerusalem. It might also help explain the historical Italian affinity for Ashkenazis during WWII, as 80 percent of Italy’s Ashkenazis survived the Nazi persecution despite the German military occupation.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-09T16:00:00+00:00"
}