{
  "url": "https://voxday.net/2013/10/03/mailvox-alternative-credentials/",
  "scraped_at": "2025-12-14T22:44:13.835266",
  "title": "Mailvox: alternative credentials",
  "date_display": "October 3, 2013",
  "date_iso": "2013-10-03T17:05:00+00:00",
  "date_from_url": "2013-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div> ML’s experiences in computer programming have been similar to mine.<blockquote class=\"tr_bq\"><p>  Your posts regarding the college gender gap have been<br> fascinating.  I graduated in 2001 with a degree in computer science.  At<br> the time, our program had about ten women.  As it happens, two of them<br> happened to end up in a few of my upper division classes.  They were<br> both mediocre programmers at best.  From what I gathered they graduated<br> by hanging out in the lab and “collaborating” with the beta, gamma, and<br> omega males working on their own projects.</br></br></br></br></br></br></p><p>I went on to work at IBM for twelve years as a<br> software engineer.  By that time IBM had long been infected with the<br> diversity cancer and women in technology were vital to IBM’s success in<br> the global economy.  There were hundreds of women in my division and<br> while most of them were on the technical career track they worked mostly<br> as project managers or testers.  The women that started out in actual<br> software development positions did not last long.  They were frequently<br> promoted to management or moved to project management or test positions.</br></br></br></br></br></br></br></p><p>There were two notable exceptions.  In the mid to<br> late 80’s IBM experienced a shortage of software developers.  The<br> universities, typically lagging, had not yet created the programs to<br> educate programmers in sufficient numbers.  IBM decided it would offer<br> it’s semi-skilled workforce the opportunity to attend an in house<br> programming school.  Those that graduated were guaranteed promotions<br> from manufacturing and secretarial jobs to professional careers.  Since<br> IBM had a very large pool of candidates, it didn’t care about the<br> graduation rate.  The goal was to create functional programmers.  In<br> talking to the old timers I gather the program was very challenging.<br>  The only two competent female coders I came into contact with during my<br> time at IBM graduated from that program.  Both of these women were<br> exceptionally good, better than 90% of their male peers.  Even though<br> the program allowed women, graduating them was not mandatory.  In fact<br> women were not expected to graduate so those that did actually achieved<br> something meaningful.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>You discuss alternative credentialing systems much<br> like IBMs old boot camp coming into existence.  How do you foresee these<br> systems withstanding the “need for diversity”.  Certainly no such<br> system would be successful at today’s diverse multicultural IBM.</br></br></br></p></blockquote></div><p>There was one good female programmer at the small tech company of about 100 people where I worked for two years before starting my first game company. She was quite attractive too. But the other one spent years, literally years, finding creative ways to avoid doing anything at all. It was rather impressive in retrospect; I’m not even sure she knew how to program.</p><p>Diversity is a luxury item. The new credential systems spring up because there is a need for them, the old ones having been ruined by diversity, equality, and so forth. Whenever and wherever there is more need for actual performance than the pretense of it, people will find away to utilize them.</p></div>",
  "content_text": "ML’s experiences in computer programming have been similar to mine.\nYour posts regarding the college gender gap have been\nfascinating.  I graduated in 2001 with a degree in computer science.  At\nthe time, our program had about ten women.  As it happens, two of them\nhappened to end up in a few of my upper division classes.  They were\nboth mediocre programmers at best.  From what I gathered they graduated\nby hanging out in the lab and “collaborating” with the beta, gamma, and\nomega males working on their own projects.\nI went on to work at IBM for twelve years as a\nsoftware engineer.  By that time IBM had long been infected with the\ndiversity cancer and women in technology were vital to IBM’s success in\nthe global economy.  There were hundreds of women in my division and\nwhile most of them were on the technical career track they worked mostly\nas project managers or testers.  The women that started out in actual\nsoftware development positions did not last long.  They were frequently\npromoted to management or moved to project management or test positions.\nThere were two notable exceptions.  In the mid to\nlate 80’s IBM experienced a shortage of software developers.  The\nuniversities, typically lagging, had not yet created the programs to\neducate programmers in sufficient numbers.  IBM decided it would offer\nit’s semi-skilled workforce the opportunity to attend an in house\nprogramming school.  Those that graduated were guaranteed promotions\nfrom manufacturing and secretarial jobs to professional careers.  Since\nIBM had a very large pool of candidates, it didn’t care about the\ngraduation rate.  The goal was to create functional programmers.  In\ntalking to the old timers I gather the program was very challenging.\nThe only two competent female coders I came into contact with during my\ntime at IBM graduated from that program.  Both of these women were\nexceptionally good, better than 90% of their male peers.  Even though\nthe program allowed women, graduating them was not mandatory.  In fact\nwomen were not expected to graduate so those that did actually achieved\nsomething meaningful.\nYou discuss alternative credentialing systems much\nlike IBMs old boot camp coming into existence.  How do you foresee these\nsystems withstanding the “need for diversity”.  Certainly no such\nsystem would be successful at today’s diverse multicultural IBM.\nThere was one good female programmer at the small tech company of about 100 people where I worked for two years before starting my first game company. She was quite attractive too. But the other one spent years, literally years, finding creative ways to avoid doing anything at all. It was rather impressive in retrospect; I’m not even sure she knew how to program.\nDiversity is a luxury item. The new credential systems spring up because there is a need for them, the old ones having been ruined by diversity, equality, and so forth. Whenever and wherever there is more need for actual performance than the pretense of it, people will find away to utilize them.",
  "tags": [
    "education",
    "mailvox",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-03T16:05:00+00:00"
}