{
  "url": "https://voxday.net/2013/10/10/mailvox-econo-ignorati/",
  "scraped_at": "2025-12-14T22:44:46.282161",
  "title": "Mailvox: econo-ignorati",
  "date_display": "October 10, 2013",
  "date_iso": "2013-10-10T13:33:00+00:00",
  "date_from_url": "2013-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure which is more impressive, the ability of those who don’t wish to see the obvious to not see it, or the stubborn determination of the inept anklebiter to think that this time, for sure, he’s going to be able to prove me wrong.</p><p>Irish Farmer doesn’t appear to understand what is meant by either “wages” or “consumption”:</p><blockquote class=\"tr_bq\"><p> If women were consumers before they entered the workforce, then who’s money were they consuming with? Mens? Parents’? In that case, those wages were already practically depressed by the fact that men and/or parents were providing women with a sort of salary. </p></blockquote><p>No. Wages are not reduced by consumption. Wages are reduced by increased supply of labor or decreased demand for labor.  Because consumption tends to increase demand for labor, it tends to increase wages. He digs himself deeper by failing to understand that a consumer is a consumer regardless of whether the consumer is in the labor force or not:</p><blockquote class=\"tr_bq\"><p> I think it’s simplistic to say, “Women were still consumers.” I’ll admit I don’t have the answers to these questions, but they still come to mind: Isn’t it possible that women workers created new markets, created increase consumption in some way? Can you really just say, “It was the exact same level of consumption now as it was in the ’50s”?</p></blockquote><p>It is not only not simplistic to point out that women were, and continued to be, consumers before, during, and after they entered the labor force, it is absolutely idiotic to attempt to claim otherwise. None of this is equivalent, in any way, to saying anything about “the exact same level of consumption as in the 1950s”.  In fact, a moment’s thought will make it apparent that an increased number of women entering the work force will tend to reduce consumption in the short term; perhaps the women here can help us out.  Do you do tend to do most of your shopping when you are at work or when you are not at work?</p><p>Moreover, the reduced number of children produced by working women has unquestionably meant less consumption and less demand for labor in the long term as well. The mitigating effect on the labor supply of fewer children will not suffice to counterbalance this, since children are consumers for 18+ years before they enter the labor force.</p><p>And Phony not only reveals that he doesn’t know anything about economics, but he’s a relative newbie here. He’s clearly unaware of the fact that I addressed his objection <a href=\"http://www.milobookclub.com/2006/05/12/m-i-t-spells-my-bitc/\">back in 2006</a> as well as again <a href=\"http://www.milobookclub.com/2013/02/18/economics-and-fate-of-feminis/\">earlier this year</a>.</p><blockquote class=\"tr_bq\"><p> You’re making the implicit assumption, Dipshit, that they don’t produce anything for the wages they get. If they *are* producing more value than they get paid for, as seems reasonable in a capitalist society, then the wages paid will go up but be spent purchasing even more goods.</p><p>By your “logic”, Dipshit, the best America could do would be to have one person working to produce goods for 300 million consumers – after all, if anyone else enters the workforce, it will lower wages…</p><p>You talk about the post-1950 rise in female employment. So tell us, Dipshit, how come real wages continued to rise (in line with productivity) between 1950 and 1975 or so?</p></blockquote><p>First, I am quite obviously not making the implicit assumption that women don’t produce anything for the wages they receive.  Second, if we apply his own logic, then the fact that real wages have not gone up since 1973 forces us to conclude that women are not producing more value than they are paid for. Third, my logic doesn’t suggest anything of the sort.</p><p>And fourth, in answer to his question, I quote myself <a href=\"http://www.milobookclub.com/2006/05/12/m-i-t-spells-my-bitc/\">from seven years ago</a>:</p><p>“In the perfect world of economic modeling, it would make no difference<br> if men or women were working.  And in fact, the deleterious effects on<br> wages of women entering the work force was largely hidden until 1973,<br> when men finally stopped leaving the work force in numbers sufficient to<br> conceal what was happening.  In fact, one could characterize the period<br> from 1950 to 1973 as women working so that men over 60 could play golf.<br> The BLS numbers make this clear.”</br></br></br></br></br></br></p></div>",
  "content_text": "I’m not sure which is more impressive, the ability of those who don’t wish to see the obvious to not see it, or the stubborn determination of the inept anklebiter to think that this time, for sure, he’s going to be able to prove me wrong.\nIrish Farmer doesn’t appear to understand what is meant by either “wages” or “consumption”:\nIf women were consumers before they entered the workforce, then who’s money were they consuming with? Mens? Parents’? In that case, those wages were already practically depressed by the fact that men and/or parents were providing women with a sort of salary.\nNo. Wages are not reduced by consumption. Wages are reduced by increased supply of labor or decreased demand for labor.  Because consumption tends to increase demand for labor, it tends to increase wages. He digs himself deeper by failing to understand that a consumer is a consumer regardless of whether the consumer is in the labor force or not:\nI think it’s simplistic to say, “Women were still consumers.” I’ll admit I don’t have the answers to these questions, but they still come to mind: Isn’t it possible that women workers created new markets, created increase consumption in some way? Can you really just say, “It was the exact same level of consumption now as it was in the ’50s”?\nIt is not only not simplistic to point out that women were, and continued to be, consumers before, during, and after they entered the labor force, it is absolutely idiotic to attempt to claim otherwise. None of this is equivalent, in any way, to saying anything about “the exact same level of consumption as in the 1950s”.  In fact, a moment’s thought will make it apparent that an increased number of women entering the work force will tend to reduce consumption in the short term; perhaps the women here can help us out.  Do you do tend to do most of your shopping when you are at work or when you are not at work?\nMoreover, the reduced number of children produced by working women has unquestionably meant less consumption and less demand for labor in the long term as well. The mitigating effect on the labor supply of fewer children will not suffice to counterbalance this, since children are consumers for 18+ years before they enter the labor force.\nAnd Phony not only reveals that he doesn’t know anything about economics, but he’s a relative newbie here. He’s clearly unaware of the fact that I addressed his objection\nback in 2006\nas well as again\nearlier this year\n.\nYou’re making the implicit assumption, Dipshit, that they don’t produce anything for the wages they get. If they *are* producing more value than they get paid for, as seems reasonable in a capitalist society, then the wages paid will go up but be spent purchasing even more goods.\nBy your “logic”, Dipshit, the best America could do would be to have one person working to produce goods for 300 million consumers – after all, if anyone else enters the workforce, it will lower wages…\nYou talk about the post-1950 rise in female employment. So tell us, Dipshit, how come real wages continued to rise (in line with productivity) between 1950 and 1975 or so?\nFirst, I am quite obviously not making the implicit assumption that women don’t produce anything for the wages they receive.  Second, if we apply his own logic, then the fact that real wages have not gone up since 1973 forces us to conclude that women are not producing more value than they are paid for. Third, my logic doesn’t suggest anything of the sort.\nAnd fourth, in answer to his question, I quote myself\nfrom seven years ago\n:\n“In the perfect world of economic modeling, it would make no difference\nif men or women were working.  And in fact, the deleterious effects on\nwages of women entering the work force was largely hidden until 1973,\nwhen men finally stopped leaving the work force in numbers sufficient to\nconceal what was happening.  In fact, one could characterize the period\nfrom 1950 to 1973 as women working so that men over 60 could play golf.\nThe BLS numbers make this clear.”",
  "tags": [
    "anklebiters",
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-10T12:33:00+00:00"
}