{
  "url": "https://voxday.net/2013/10/13/mailvox-update-requested/",
  "scraped_at": "2025-12-14T22:44:58.978236",
  "title": "Mailvox: update requested",
  "date_display": "October 13, 2013",
  "date_iso": "2013-10-13T11:05:00+00:00",
  "date_from_url": "2013-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CA writes to inquire about QM, progress on Book Two, and other matters:</p><blockquote class=\"tr_bq\"><p> Just wondering how your writing projects have been going. A few weeks back you mentioned that you would talk about Quantum Mortis that you are co-writing with Steve Rzasa (I know about the co-authoring part cause I found the mention of QM on Rzasa’s site before it showed up on yours.) You haven’t yet mentioned anything. When are you going to spill the beans? 😉</p><p>Also wondering how Book 2 of Arts of Dark and Light is coming? How close are you to having a first draft of the book? What’s the page count so far? Any tasty morsels that you can drop for us readers? Looking forward to your writing,</p></blockquote><p>I have to apologize for the light posting last week. I was rather busy with my day job, which involved a technology conference that was truly excellent. I had the distinct privilege of meeting the founder of the Pirate Party, and you can expect to see an interview with him posted here in the reasonably near future. I’m also going to see if I can arrange to do a Lions Den of his tactical manual, <i>Swarmwise</i>.</p><p>I also had the chance to see my better-looking intellectual twin again, which is always a delight. While everyone else was discussing who Yahoo was overpaying for next and the wisdom of staying out of the way of Google in the consumer space, we were talking about the implications of Janet Yellen at the Fed, various gold conspiracy theories, and the possibility of the pseudo-shutdown turning into a real one. Great fun and I learned a lot from a number of different people. It was easily the best conference I’ve been to since the 1996 CGDC in Santa Clara.</p><p>As to Quantum Mortis, it is the result of the realization that TAODAL will prevent me from getting around to any of my other ideas for at least five years. QM is based upon a novella I started about 12 years ago and somehow managed to lose in the transition from one computer to another. When it turned up again, I read it and really liked the idea, but I knew I couldn’t justify taking the time to turn it into a proper novel.</p><p>So, I contacted Steve, handed it over to him, and he turned the beginning into a complete novel. I took 30 days off of Book Two to rewrite certain parts and add some new sections, and finished it last week. Two of the regulars who shall remain nameless for the present have read the draft, and I will take the liberty of quoting one of them concerning it:<br> <i><br/></i><br> <i>“I loved every second of this. I sincerely did. I think it’s more<br> enjoyable than A Throne of Bones… and I think it has broader market appeal. Seriously. Standing fucking ovation.”</br></i></br></br></p><p>That’s all I will say about it for the present, other than to say that the release date of the ebook will be safely before Christmas, with the hardcover to follow.  As before, those who preorder the hardcover will receive the ebook free. With regards to Book Two of TAODAL, I’m not quite as far along as I would like to be, but I do not expect any trouble sticking to my 24-month release schedule.  Also, ACX has released the audiobook of <i>A Magic Broken</i> to Audible, iTunes, and the other retailers, so I expect to be able to post a sample and make an announcement about that being available very soon.</p><p>And no one need worry that I am pulling a Martin. In addition to being considerably younger and healthier, I have no intention of allowing myself to be unduly distracted by other writing projects.  It was refreshing to take a brief break from the war and politics of Selenoth, but I’m quite happy to rejoin Marcus Valerius, newly christened “Cavarus” by the men of his legion, and the other surviving characters again.</p></div>",
  "content_text": "CA writes to inquire about QM, progress on Book Two, and other matters:\nJust wondering how your writing projects have been going. A few weeks back you mentioned that you would talk about Quantum Mortis that you are co-writing with Steve Rzasa (I know about the co-authoring part cause I found the mention of QM on Rzasa’s site before it showed up on yours.) You haven’t yet mentioned anything. When are you going to spill the beans? 😉\nAlso wondering how Book 2 of Arts of Dark and Light is coming? How close are you to having a first draft of the book? What’s the page count so far? Any tasty morsels that you can drop for us readers? Looking forward to your writing,\nI have to apologize for the light posting last week. I was rather busy with my day job, which involved a technology conference that was truly excellent. I had the distinct privilege of meeting the founder of the Pirate Party, and you can expect to see an interview with him posted here in the reasonably near future. I’m also going to see if I can arrange to do a Lions Den of his tactical manual,\nSwarmwise\n.\nI also had the chance to see my better-looking intellectual twin again, which is always a delight. While everyone else was discussing who Yahoo was overpaying for next and the wisdom of staying out of the way of Google in the consumer space, we were talking about the implications of Janet Yellen at the Fed, various gold conspiracy theories, and the possibility of the pseudo-shutdown turning into a real one. Great fun and I learned a lot from a number of different people. It was easily the best conference I’ve been to since the 1996 CGDC in Santa Clara.\nAs to Quantum Mortis, it is the result of the realization that TAODAL will prevent me from getting around to any of my other ideas for at least five years. QM is based upon a novella I started about 12 years ago and somehow managed to lose in the transition from one computer to another. When it turned up again, I read it and really liked the idea, but I knew I couldn’t justify taking the time to turn it into a proper novel.\nSo, I contacted Steve, handed it over to him, and he turned the beginning into a complete novel. I took 30 days off of Book Two to rewrite certain parts and add some new sections, and finished it last week. Two of the regulars who shall remain nameless for the present have read the draft, and I will take the liberty of quoting one of them concerning it:\n“I loved every second of this. I sincerely did. I think it’s more\nenjoyable than A Throne of Bones… and I think it has broader market appeal. Seriously. Standing fucking ovation.”\nThat’s all I will say about it for the present, other than to say that the release date of the ebook will be safely before Christmas, with the hardcover to follow.  As before, those who preorder the hardcover will receive the ebook free. With regards to Book Two of TAODAL, I’m not quite as far along as I would like to be, but I do not expect any trouble sticking to my 24-month release schedule.  Also, ACX has released the audiobook of\nA Magic Broken\nto Audible, iTunes, and the other retailers, so I expect to be able to post a sample and make an announcement about that being available very soon.\nAnd no one need worry that I am pulling a Martin. In addition to being considerably younger and healthier, I have no intention of allowing myself to be unduly distracted by other writing projects.  It was refreshing to take a brief break from the war and politics of Selenoth, but I’m quite happy to rejoin Marcus Valerius, newly christened “Cavarus” by the men of his legion, and the other surviving characters again.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-13T10:05:00+00:00"
}