{
  "url": "https://voxday.net/2013/10/30/mailvox-fed-imbalance/",
  "scraped_at": "2025-12-15T16:35:14.322944",
  "title": "Mailvox: the Fed imbalance",
  "date_display": "October 30, 2013",
  "date_iso": "2013-10-30T09:26:00+00:00",
  "date_from_url": "2013-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD asks about the Fed’s balance sheet:</p><blockquote class=\"tr_bq\"><p> Fed balance sheet may not return to normal until 2019?  What does this mean to lay people?  Would you enlighten The Dread Ilk, please?</p></blockquote><p>The short version is that quantitative easing, which is the Federal Reserve’s euphemism for “printing money” under the current monetary regime, is not working in terms of returning the economy to full employment or stimulating economic growth. However, the Fed doesn’t dare stop QEn because doing so would almost instantly crash the stock market and hurl the global financial system into crisis, if not collapse. So, the program is going to continue indefinitely, which we already know due to the appointment of Janet Yellen, who is even more expansionary-minded than the man named Helicopter Ben.</p><p>Wikipedia has a good definition of quantitative easing: <i>“Quantitative easing (QE) is an unconventional monetary policy used by central banks to prevent the money supply falling when standard monetary policy has become ineffective. A central bank implements quantitative easing by buying specified amounts of financial assets from commercial banks and other private institutions, thus increasing the monetary base. This is distinguished from the more usual policy of buying or selling government bonds in order to keep market interest rates at a specified target value.</i></p><p>“Expansionary monetary policy typically involves the central bank buying short-term government bonds in order to lower short-term market interest rates. However, when short-term interest rates are at or close to zero, normal monetary policy can no longer lower interest rates. Quantitative easing may then be used by monetary authorities to further stimulate the economy by purchasing assets of longer maturity than short-term government bonds, and thereby lowering longer-term interest rates further out on the yield curve. Quantitative easing raises the prices of the financial assets bought, which lowers their yield.”</p><p>This is why the stock market is up considerably since early 2009 and why corporate borrowing is up when the other private borrowing sectors are down. The reason that the QE program has continued for nearly five years now is that it hasn’t had the triggering effect that it was supposed to have in 2009 or any subsequent year. This is exactly what I have been talking about for years, in pointing out that the Fed cannot expand the money supply in the same way that was done in Weimar Germany and in Zimbabwe, because there are material and significant differences in the way the Fed “prints” money and the way past governments have printed money.</p><p>The Fed won’t simply print money in the traditional manner because the coterie of investment institutions they serve can’t profit that way; it is all inflationary downside without a leveraging upside. The US government could certainly do it, of course, and all it would have to do is completely shake off the chains of Wall Street first. So, needless to say, printing trillions of dollars and distributing them to the citizenry is not going to happen.</p><p>Given that they STILL haven’t taken the simple step of forgiving mortgage debt to free up disposable income, it should be obvious that they’re not going to indiscriminately hand out cash to everyone either.</p><p>My case for debt-deflation doesn’t rest on the physical impossibility of money printing, but on the improbability of Wall Street voluntarily giving up the goose that has laid so many dollar-filled eggs for 100 years. I think they will kill the economy before they give up control, especially since widespread bankruptcies and foreclosures taking place under the present regime would put huge swaths of U.S. property in their hands. It is very much a heads they win, tails you lose situation.</p><p>As for 2019, they might as reasonably have given a date of <i>fiver</i>. If you look at L1, it is very clear that all QE has done for the last five years is prevent the bottom from falling out completely while encouraging an astonishing amount of malinvestment via the corporate and federal sectors. So, I anticipate more of the same until the household sector defaults begin, which should set off the third, and more serious, stage of the financial crisis.</p><p>Timing? I don’t do timing. How will the crisis be resolved? I don’t know. These things cannot be known until they happen. All we can know for certain is that the present course of credit disinflation and substitution of private debt for public debt is not going to continue indefinitely, since it would result in the complete socialization of the national economy by 2030.</p></div>",
  "content_text": "JD asks about the Fed’s balance sheet:\nFed balance sheet may not return to normal until 2019?  What does this mean to lay people?  Would you enlighten The Dread Ilk, please?\nThe short version is that quantitative easing, which is the Federal Reserve’s euphemism for “printing money” under the current monetary regime, is not working in terms of returning the economy to full employment or stimulating economic growth. However, the Fed doesn’t dare stop QEn because doing so would almost instantly crash the stock market and hurl the global financial system into crisis, if not collapse. So, the program is going to continue indefinitely, which we already know due to the appointment of Janet Yellen, who is even more expansionary-minded than the man named Helicopter Ben.\nWikipedia has a good definition of quantitative easing:\n“Quantitative easing (QE) is an unconventional monetary policy used by central banks to prevent the money supply falling when standard monetary policy has become ineffective. A central bank implements quantitative easing by buying specified amounts of financial assets from commercial banks and other private institutions, thus increasing the monetary base. This is distinguished from the more usual policy of buying or selling government bonds in order to keep market interest rates at a specified target value.\n“Expansionary monetary policy typically involves the central bank buying short-term government bonds in order to lower short-term market interest rates. However, when short-term interest rates are at or close to zero, normal monetary policy can no longer lower interest rates. Quantitative easing may then be used by monetary authorities to further stimulate the economy by purchasing assets of longer maturity than short-term government bonds, and thereby lowering longer-term interest rates further out on the yield curve. Quantitative easing raises the prices of the financial assets bought, which lowers their yield.”\nThis is why the stock market is up considerably since early 2009 and why corporate borrowing is up when the other private borrowing sectors are down. The reason that the QE program has continued for nearly five years now is that it hasn’t had the triggering effect that it was supposed to have in 2009 or any subsequent year. This is exactly what I have been talking about for years, in pointing out that the Fed cannot expand the money supply in the same way that was done in Weimar Germany and in Zimbabwe, because there are material and significant differences in the way the Fed “prints” money and the way past governments have printed money.\nThe Fed won’t simply print money in the traditional manner because the coterie of investment institutions they serve can’t profit that way; it is all inflationary downside without a leveraging upside. The US government could certainly do it, of course, and all it would have to do is completely shake off the chains of Wall Street first. So, needless to say, printing trillions of dollars and distributing them to the citizenry is not going to happen.\nGiven that they STILL haven’t taken the simple step of forgiving mortgage debt to free up disposable income, it should be obvious that they’re not going to indiscriminately hand out cash to everyone either.\nMy case for debt-deflation doesn’t rest on the physical impossibility of money printing, but on the improbability of Wall Street voluntarily giving up the goose that has laid so many dollar-filled eggs for 100 years. I think they will kill the economy before they give up control, especially since widespread bankruptcies and foreclosures taking place under the present regime would put huge swaths of U.S. property in their hands. It is very much a heads they win, tails you lose situation.\nAs for 2019, they might as reasonably have given a date of\nfiver\n. If you look at L1, it is very clear that all QE has done for the last five years is prevent the bottom from falling out completely while encouraging an astonishing amount of malinvestment via the corporate and federal sectors. So, I anticipate more of the same until the household sector defaults begin, which should set off the third, and more serious, stage of the financial crisis.\nTiming? I don’t do timing. How will the crisis be resolved? I don’t know. These things cannot be known until they happen. All we can know for certain is that the present course of credit disinflation and substitution of private debt for public debt is not going to continue indefinitely, since it would result in the complete socialization of the national economy by 2030.",
  "tags": [
    "banks",
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-30T09:26:00+00:00"
}