{
  "url": "https://voxday.net/2013/10/25/mailvox-unexpected-review/",
  "scraped_at": "2025-12-15T16:34:42.702410",
  "title": "Mailvox: “a fine book”",
  "date_display": "October 25, 2013",
  "date_iso": "2013-10-25T07:00:00+00:00",
  "date_from_url": "2013-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some time ago, I got an email from a bestselling author, who shall remain nameless. Said author informed me that they had picked up two of the Selenoth shorts as free downloads from Amazon and found them to be more entertaining than expected. That was nice to hear, but the following review, which arrived in my email yesterday along with permission to post it here, was<i> </i>remarkably gracious and unexpectedly positive.<i> </i></p><blockquote class=\"tr_bq\"><p> <i>A Throne of Bones</i> by Vox Day is not a novel for just anyone. The scope and ambition of the world and the numerous storylines would probably be overwhelming to the casual reader of fantasy fiction – and perhaps even those who enjoy the novels of George R.R. Martin or similar writers of massive fantasy tomes. At times, <i>A Throne of Bones</i> even forced me to mentally review my Roman and biblical history, and it stretched my vague memories of Latin to the limit.</p><p>I cannot say that I’m surprised that traditional publishing houses passed on this work. I imagine that many editors who looked at it were intimidated by it in terms of content and length. This is not an easy novel, and if one’s only background is a Bachelor’s degree in English, as an editor it would appear to be an impossible mountain to climb in terms of the required knowledge to do it justice. I very much found myself wondering what would have happened had it been published by a large house with a marketing campaign behind it.</p><p>As an editor myself, I would have felt compelled to take a run at it, and no doubt would have advised Vox Day to take a couple of different directions than he did, but the end result of his work cannot be denied: it’s a fine book and one to recommend to people who like their fantasy novels with genuine width and depth. All in all, <i>A Throne of Bones</i> offers an incredibly in-depth story, and a remarkable level of craftsmanship in the world building.</p><p>As an author, I’d suggest that old advice is good advice: don’t try this at home. Not very many writers have the ability to pull off something this ambitious, but Vox Day did. <i>A Throne of Bones</i> would be a career achievement any writer would be proud to call his own.</p></blockquote><p>It’s been a surprisingly exciting ten months since Marcher Lord Hinterlands published <i>A Throne of Bones</i>. I’ve been formally barred from some Christian awards and nominated for others. I’ve been rejected by an international publishing house that loved the book because I’m too personally controversial. And I’m the first writer in history to be kicked out of the SFWA.</p><p>Even so, I can honestly say that I wouldn’t trade my literary career for any living author who isn’t named either a) Neal Stephenson or b) Umberto Eco.</p><p>Now, I’m not unaware of the gentle criticism implicit in the review, notwithstanding the kind words of praise. The book could certainly be better, and I am optimistic that the second book in the series will be, although no book I write is ever likely to be a masterwork of literary style. But the author, editor, and reviewer was dead-on. <i>A Throne of Bones</i> is not a book for everyone and it was never intended to be. I am simply pleased to know that it appears to have reached a few of its ideal readers and is appreciated for what it is.</p></div>",
  "content_text": "Some time ago, I got an email from a bestselling author, who shall remain nameless. Said author informed me that they had picked up two of the Selenoth shorts as free downloads from Amazon and found them to be more entertaining than expected. That was nice to hear, but the following review, which arrived in my email yesterday along with permission to post it here, was\nremarkably gracious and unexpectedly positive.\nA Throne of Bones\nby Vox Day is not a novel for just anyone. The scope and ambition of the world and the numerous storylines would probably be overwhelming to the casual reader of fantasy fiction – and perhaps even those who enjoy the novels of George R.R. Martin or similar writers of massive fantasy tomes. At times,\nA Throne of Bones\neven forced me to mentally review my Roman and biblical history, and it stretched my vague memories of Latin to the limit.\nI cannot say that I’m surprised that traditional publishing houses passed on this work. I imagine that many editors who looked at it were intimidated by it in terms of content and length. This is not an easy novel, and if one’s only background is a Bachelor’s degree in English, as an editor it would appear to be an impossible mountain to climb in terms of the required knowledge to do it justice. I very much found myself wondering what would have happened had it been published by a large house with a marketing campaign behind it.\nAs an editor myself, I would have felt compelled to take a run at it, and no doubt would have advised Vox Day to take a couple of different directions than he did, but the end result of his work cannot be denied: it’s a fine book and one to recommend to people who like their fantasy novels with genuine width and depth. All in all,\nA Throne of Bones\noffers an incredibly in-depth story, and a remarkable level of craftsmanship in the world building.\nAs an author, I’d suggest that old advice is good advice: don’t try this at home. Not very many writers have the ability to pull off something this ambitious, but Vox Day did.\nA Throne of Bones\nwould be a career achievement any writer would be proud to call his own.\nIt’s been a surprisingly exciting ten months since Marcher Lord Hinterlands published\nA Throne of Bones\n. I’ve been formally barred from some Christian awards and nominated for others. I’ve been rejected by an international publishing house that loved the book because I’m too personally controversial. And I’m the first writer in history to be kicked out of the SFWA.\nEven so, I can honestly say that I wouldn’t trade my literary career for any living author who isn’t named either a) Neal Stephenson or b) Umberto Eco.\nNow, I’m not unaware of the gentle criticism implicit in the review, notwithstanding the kind words of praise. The book could certainly be better, and I am optimistic that the second book in the series will be, although no book I write is ever likely to be a masterwork of literary style. But the author, editor, and reviewer was dead-on.\nA Throne of Bones\nis not a book for everyone and it was never intended to be. I am simply pleased to know that it appears to have reached a few of its ideal readers and is appreciated for what it is.",
  "tags": [
    "Book Review",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-25T06:00:00+00:00"
}