{
  "url": "https://voxday.net/2013/10/25/mailvox-of-god-and-games/",
  "scraped_at": "2025-12-15T16:34:44.153021",
  "title": "Mailvox: of God and games",
  "date_display": "October 25, 2013",
  "date_iso": "2013-10-25T13:00:00+00:00",
  "date_from_url": "2013-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Civilservant asks two questions:</p><blockquote class=\"tr_bq\"><p> Are man-made morals more arbitrary than god-made morals?  The original question involved “authority” as if that were<br> synonymous with “legitimate”.  People typically view God’s laws (however<br> conceived) as being “authoritative” and therefore “legitimate”.  But<br> are not God’s laws arbitrary in exactly the same way as Man’s laws may<br> be arbitrary?  As I said earlier anyone may say “My Game, My Rules” with<br> equal legitimacy but the difficulty is in getting others to go along<br> with the Rules.  Witness the war in heaven and Satan’s disobedience.</br></br></br></br></br></br></p></blockquote><p>Man-made morals are no more arbitrary than God-made morals – and note that the capital G is necessary here – but they are considerably less-informed and they lack all legitimacy and authority.</p><p>And as for God’s laws being arbitrary in EXACTLY the same way as Man’s laws, that depends upon the specific sense of “arbitrary” being used.  Let’s consider the four definitions:<i> </i></p><p><i>1.subject to individual will or judgment without restriction; contingent solely upon one’s discretion: an arbitrary decision.</i> </p><p>God’s laws are clearly MORE arbitrary in this sense, because His will is less restricted than Man’s.</p><div class=\"luna-Ent\">  </div><div class=\"luna-Ent\"> <i>2. decided by a judge or arbiter rather than by a law or statute.</i><p>God’s laws are MORE arbitrary than Man’s in this sense; even though the USA, for example, has increasingly become a nation of case law rather than statutory law. God has laid down the laws of the Creation, but in relation to Man, He is more judge than legislator. <i></i></p><p><i>3.having unlimited power; uncontrolled or unrestricted by law; despotic; tyrannical: an arbitrary government.</i> </p><p>Again, God’s laws are MORE arbitrary than Man’s laws, since God’s power is less limited than Man’s.<i> </i></p><p><i>4.capricious; unreasonable; unsupported</i></p></div><p> In this sense, God’s laws are much LESS arbitrary than Man’s. Since we are told the wages of sin are death and that all men sin, the fact that all men die is empirical evidence that God’s laws are neither capricious or unsupported. Furthermore, God’s laws are scientifically falsifiable; all a man interested in testing the validity of God’s laws must do is not sin, then die, and they will be falsified.</p><p>So, the answer is obviously no, God’s laws are not arbitrary in exactly the same way as Man’s laws. Furthermore, it is totally incorrect to say “anyone may say “My Game, My Rules” with<br> equal legitimacy.”  God is the creator and owner of the game. The universe is His game, and no man has any more right to say that his rules take precedence over God’s than Adrian Peterson has the right to declare that the next touchdown he scores will be worth 100 points. Whereas, if the entity called NFL decides that a touchdown is henceforth to be worth 100 points, the next touchdown Mr. Peterson scores will, in fact, be worth 100 points.</br></p></div>",
  "content_text": "Civilservant asks two questions:\nAre man-made morals more arbitrary than god-made morals?  The original question involved “authority” as if that were\nsynonymous with “legitimate”.  People typically view God’s laws (however\nconceived) as being “authoritative” and therefore “legitimate”.  But\nare not God’s laws arbitrary in exactly the same way as Man’s laws may\nbe arbitrary?  As I said earlier anyone may say “My Game, My Rules” with\nequal legitimacy but the difficulty is in getting others to go along\nwith the Rules.  Witness the war in heaven and Satan’s disobedience.\nMan-made morals are no more arbitrary than God-made morals – and note that the capital G is necessary here – but they are considerably less-informed and they lack all legitimacy and authority.\nAnd as for God’s laws being arbitrary in EXACTLY the same way as Man’s laws, that depends upon the specific sense of “arbitrary” being used.  Let’s consider the four definitions:\n1.subject to individual will or judgment without restriction; contingent solely upon one’s discretion: an arbitrary decision.\nGod’s laws are clearly MORE arbitrary in this sense, because His will is less restricted than Man’s.\n2. decided by a judge or arbiter rather than by a law or statute.\nGod’s laws are MORE arbitrary than Man’s in this sense; even though the USA, for example, has increasingly become a nation of case law rather than statutory law. God has laid down the laws of the Creation, but in relation to Man, He is more judge than legislator.\n3.having unlimited power; uncontrolled or unrestricted by law; despotic; tyrannical: an arbitrary government.\nAgain, God’s laws are MORE arbitrary than Man’s laws, since God’s power is less limited than Man’s.\n4.capricious; unreasonable; unsupported\nIn this sense, God’s laws are much LESS arbitrary than Man’s. Since we are told the wages of sin are death and that all men sin, the fact that all men die is empirical evidence that God’s laws are neither capricious or unsupported. Furthermore, God’s laws are scientifically falsifiable; all a man interested in testing the validity of God’s laws must do is not sin, then die, and they will be falsified.\nSo, the answer is obviously no, God’s laws are not arbitrary in exactly the same way as Man’s laws. Furthermore, it is totally incorrect to say “anyone may say “My Game, My Rules” with\nequal legitimacy.”  God is the creator and owner of the game. The universe is His game, and no man has any more right to say that his rules take precedence over God’s than Adrian Peterson has the right to declare that the next touchdown he scores will be worth 100 points. Whereas, if the entity called NFL decides that a touchdown is henceforth to be worth 100 points, the next touchdown Mr. Peterson scores will, in fact, be worth 100 points.",
  "tags": [
    "philosophy",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-25T12:00:00+00:00"
}