{
  "url": "https://voxday.net/2013/10/07/making-it-better-by-ruining-i/",
  "scraped_at": "2025-12-14T22:44:33.969586",
  "title": "Making it better by ruining it",
  "date_display": "October 7, 2013",
  "date_iso": "2013-10-07T07:12:00+00:00",
  "date_from_url": "2013-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tom Hoggins is a harbinger of <a href=\"http://www.telegraph.co.uk/women/womens-life/10355275/Grand-Theft-Auto-V-is-designed-deliberately-to-degrade-women.html\">the scalzification of the game reviewer</a>:</p><blockquote class=\"tr_bq\"><p> GTAV is a sensational video game and a<br> marvellous feat of technical engineering. However, as always with Grand<br> Theft Auto, controversy has not been far behind the adulation.</br></br></p><div class=\"thirdPar\"> The series penchant for carnage and violence is well known, as you may expect<br> from an “open-world” game about criminality that gives players carte blanche<br> to cause havoc in its facsimile of the United States. Set in Los Santos, a<br> twisted vision of Los Angeles, V is Grand Theft Auto at its most barbaric;<br> torture, cannibalism and murder featuring in its nihilistic milieu.</br></br></br></br></div><div class=\"fourthPar\"> There has also been much discussion about how GTAV treats women. That GTAV is<br> misogynistic is a defensible position. Women in the game are either bit-part<br> players or set dressing: strippers to throw money at, prostitutes to pick<br> up.</br></br></br></div><p>There are three lead characters that players can control in the game: all<br> male. The women characters are often leered at or cast as nags. One of the<br> player characters daughters has “skank” tattooed across her back, one<br> mission has you chaperoning a paparazzo as he tries to photograph an aging<br> actress’s “low-hanging muff.”</br></br></br></br></p><p>At one stage during my play-through of the game, I had a barrage of these<br> aspects which made me feel deeply uncomfortable. I commented to a friend<br> that I was concerned about the treatment of women within the game, that<br> there were few female characters drawn with any depth and that it felt a<br> deliberate decision to avoid an attempt to do so.</br></br></br></br></p></blockquote><p>I was the <strike>first </strike>second nationally syndicated game reviewer, and it is a little sad to see how grotesquely standards have fallen since I ended my game review column. There are two ridiculous points here as well as a remarkable failure of observation.</p><ol><li>Torture, cannibalism, murder, and nihilism all get a pass. But the treatment of women, well, that makes gamma boy feel uncomfortable.</li><li>The game has earned over $1 billion already and received a 98/100 critical reception. It is one of the most successful, best-reviewed games in the history of the game industry. Does the reviewer think that removing one of the GTA’s most well-known attributes is actually going to <i>improve </i>either its sales or its critical reviews?</li><li>The reviewer fails to observe that the deliberate attempt to draw female characters with any depth is done so because that it precisely what its young male audience wants. They are sick of women relentlessly trying to control them. They are sick of women drugging them and punishing them because they don’t behave like little girls. And GTA V, like its predecessors, allows them to escape a ruthlessly feminized world in favor of one that, if nothing else, allows them to behave in an unapologetically masculine manner.  </li></ol><p>The success of GTA V is because it is misogynistic. It is what games are supposed to be: it is escapist.  The Telegraph reviewer writes: “Games will not be able to take its much coveted place in<br> mainstream culture while these type of people get to dictate anything. Good<br> riddance to them when they are finally cast off.”</br></br></p><p>And the day that happens, the game industry will begin to die. Instead of great games like Doom and World of Warcraft and GTA 5, it will be Spamville, and Mafia Clicks, and Words with Friends, and 50 Shades of Necrobestial Rape Fantasy until the industry collapses amidst general bewilderment. If the McRapies ever replace the likes of Rockstar and Romero and me in the way that this guy has succeeded me in the mainstream media, (and McRapey has been trying to establish himself in the game industry), that’s exactly what you’re going to get.</p></div>",
  "content_text": "Tom Hoggins is a harbinger of\nthe scalzification of the game reviewer\n:\nGTAV is a sensational video game and a\nmarvellous feat of technical engineering. However, as always with Grand\nTheft Auto, controversy has not been far behind the adulation.\nThe series penchant for carnage and violence is well known, as you may expect\nfrom an “open-world” game about criminality that gives players carte blanche\nto cause havoc in its facsimile of the United States. Set in Los Santos, a\ntwisted vision of Los Angeles, V is Grand Theft Auto at its most barbaric;\ntorture, cannibalism and murder featuring in its nihilistic milieu.\nThere has also been much discussion about how GTAV treats women. That GTAV is\nmisogynistic is a defensible position. Women in the game are either bit-part\nplayers or set dressing: strippers to throw money at, prostitutes to pick\nup.\nThere are three lead characters that players can control in the game: all\nmale. The women characters are often leered at or cast as nags. One of the\nplayer characters daughters has “skank” tattooed across her back, one\nmission has you chaperoning a paparazzo as he tries to photograph an aging\nactress’s “low-hanging muff.”\nAt one stage during my play-through of the game, I had a barrage of these\naspects which made me feel deeply uncomfortable. I commented to a friend\nthat I was concerned about the treatment of women within the game, that\nthere were few female characters drawn with any depth and that it felt a\ndeliberate decision to avoid an attempt to do so.\nI was the\nfirst\nsecond nationally syndicated game reviewer, and it is a little sad to see how grotesquely standards have fallen since I ended my game review column. There are two ridiculous points here as well as a remarkable failure of observation.\nTorture, cannibalism, murder, and nihilism all get a pass. But the treatment of women, well, that makes gamma boy feel uncomfortable.\nThe game has earned over $1 billion already and received a 98/100 critical reception. It is one of the most successful, best-reviewed games in the history of the game industry. Does the reviewer think that removing one of the GTA’s most well-known attributes is actually going to\nimprove\neither its sales or its critical reviews?\nThe reviewer fails to observe that the deliberate attempt to draw female characters with any depth is done so because that it precisely what its young male audience wants. They are sick of women relentlessly trying to control them. They are sick of women drugging them and punishing them because they don’t behave like little girls. And GTA V, like its predecessors, allows them to escape a ruthlessly feminized world in favor of one that, if nothing else, allows them to behave in an unapologetically masculine manner.\nThe success of GTA V is because it is misogynistic. It is what games are supposed to be: it is escapist.  The Telegraph reviewer writes: “Games will not be able to take its much coveted place in\nmainstream culture while these type of people get to dictate anything. Good\nriddance to them when they are finally cast off.”\nAnd the day that happens, the game industry will begin to die. Instead of great games like Doom and World of Warcraft and GTA 5, it will be Spamville, and Mafia Clicks, and Words with Friends, and 50 Shades of Necrobestial Rape Fantasy until the industry collapses amidst general bewilderment. If the McRapies ever replace the likes of Rockstar and Romero and me in the way that this guy has succeeded me in the mainstream media, (and McRapey has been trying to establish himself in the game industry), that’s exactly what you’re going to get.",
  "tags": [
    "games",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-07T06:12:00+00:00"
}