{
  "url": "https://voxday.net/2013/10/31/man-up-and-read-chick-li/",
  "scraped_at": "2025-12-15T16:35:23.834168",
  "title": "Man up and read chick-lit",
  "date_display": "October 31, 2013",
  "date_iso": "2013-10-31T15:36:00+00:00",
  "date_from_url": "2013-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always fascinating to watch a gamma male attempt to utilize female shaming tactics on other men. It’s not only that it can’t possibly work, but that <a href=\"http://flcenterlitarts.wordpress.com/2010/04/27/who-to-blame-if-men-dont-read-why-women-of-course/\">it’s done so ineptly</a>:</p><blockquote class=\"tr_bq\"><p> Last week I suggested it may be time to disband Britain’s Orange Prize, which is restricted to female authors, on the grounds that since only women buy and read books nowadays all literature is by definition “women’s literature” and the need for the prize is therefore obsolete.</p><p>I was kidding (sort of), but my larger point — men do not read — is not disputed by anyone. Study after study proves that men account for less than 20 percent of the book market in England, the U.S. and Canada. This fact no longer in dispute, the only question becomes why don’t men read? Why do they choose to forego Twain’s “advantage?”</p><p>It turns out that the whole problem is — you guessed it! — women’s fault. At least that’s the answer if you ask the few guys who actually do read books, especially if they happen to be writers themselves, or worked at some point in the publishing industry.</p><p>Take Jason Pinter, for example, writing at the Huffington Post. A thriller writer who used to work in publishing, he argues that men actually do read. The notion they don’t is a self-fulfilling prophecy: “[P]ublishers rarely publish for men and don’t market towards men,” he writes.</p><p>“Nobody can deny the fact that most editorial meetings tend to be dominated by women,” Pinder writes. “Saying the ratio is 75/25 is not overstating things. So needless to say when a male editor pitches a book aimed at men, there are perilously few men to read it and give their opinions.”</p><p>Will Weaver, who writes young adult books, goes further, blaming not only publishing but our entire culture. Also at the Huffington Post, his indictment is much the same as Pinder’s, though. He describes going to Manhattan bookstore, where the Teen Section, all flowery and fem, contained 275 books for girls and a handful of fantasy titles for boys.</p><p>“The bias against boy books in publishing has gotten so bad nowadays that my editor now reads manuscripts, he confessed, with an eye toward ‘re-gendering,’” Weaver writes. “That is, ‘I sort of like this novel but what if the main character were a girl instead of a boy?’”</p><p>I’ll grant Weaver has a point about the need for more effort to attract boys to reading, and I’ll give Pinder props for writing respectfully of women in publishing. His critique is institutional.</p><p>Still, these writers (and others before them, like Stephen King or Chris Goldberg), however sensitive and reasonable they may be, come down ultimately to this: Publishing has been feminized, nothing is marketed to men. In other words, it’s no our fault if we don’t read. It’s the women. Again.</p><p>As a man who has read all his life, I find this faintly patronizing and more than a little insulting. I have to be marketed to before I can turn off the TV or the video game and read a book? Geez, Mom, is my bottle warm yet? I’m hungry.</p><p>These arguments ignore that women not only read all the chicklit — female readers dominate the categories I would consider male-centric, like espionage/thriller (69 percent), mystery/detective (86 percent), science fiction (52 percent). That’s according to a 2000 study — the figures may be worse today.</p><p>Given the surprising note of whining in these masculine essays, I’ve come to the conclusion that men don’t read because — well, because they aren’t men. They’re spoiled little crybabies,  and adolescents who refuse to grow up.</p></blockquote><p>How, one wonders, does a disinclination to read what women like to read – which is to say books like The Hunger Games, Twilight, 50 Shades of Grey, and the current NYT bestseller, Dear Life, by Alice Munro, which features stories such as this one: “A young woman ventures to a remote area to assume teaching duties in a<br> TB sanitarium, soon entering into a dismal relationship with the head<br> doctor” – somehow translate into being a spoiled little crybaby or an adolescent?</br></br></p><p>Then again, what Real Man wouldn’t want to read about a young woman having a relationship with the head doctor!  Spicy! As for Just One Evil Act, by Elizabeth George, we are informed that it is a “riveting tale of love, passion, and betrayal” concerning the disappearance of a nine-year-old girl named Hadiyyah. Riveting! Only a child-man could possibly fail to be fascinated by the prospect of such heart-pounding suspense!</p><p>Now, I read a lot more than most men or women do. A few of my favorite authors happen to be women. I think rather well of Murasaki Shikibu, Dorothy Sayers, Susan Cooper, Tanith Lee, and Teresa Edgerton. But the thing is, those female authors don’t write conventional romance crap, and if they do happen to exhibit the female tendency to insert some sort of a romantic angle into everything, at least they don’t permit it to dominate the story.</p><p>I now have zero – ZERO – interest in the vast majority of what presently passes for science fiction and mystery. Not because I dislike the genres, but because I dislike what the women who undeniably dominate the publishing industry insist on publishing as “science fiction” and “mystery”. And as a writer, I can say from direct personal influence that no matter how good the book is, or how significant its potential, if the book doesn’t “speak to me”, as one editor said, it’s simply not going to be published.</p><p>And guess what sort of books don’t speak to the sort of women who work in publishing? The very sort of books that men most prefer to read, which is books that reflect masculine perspectives and honor masculine virtues.</p><p>So who is to blame for the fact that most men have quit reading? The answer is obvious: whoever is responsible for refusing to publish the sort of books that men used to read.</p></div>",
  "content_text": "It’s always fascinating to watch a gamma male attempt to utilize female shaming tactics on other men. It’s not only that it can’t possibly work, but that\nit’s done so ineptly\n:\nLast week I suggested it may be time to disband Britain’s Orange Prize, which is restricted to female authors, on the grounds that since only women buy and read books nowadays all literature is by definition “women’s literature” and the need for the prize is therefore obsolete.\nI was kidding (sort of), but my larger point — men do not read — is not disputed by anyone. Study after study proves that men account for less than 20 percent of the book market in England, the U.S. and Canada. This fact no longer in dispute, the only question becomes why don’t men read? Why do they choose to forego Twain’s “advantage?”\nIt turns out that the whole problem is — you guessed it! — women’s fault. At least that’s the answer if you ask the few guys who actually do read books, especially if they happen to be writers themselves, or worked at some point in the publishing industry.\nTake Jason Pinter, for example, writing at the Huffington Post. A thriller writer who used to work in publishing, he argues that men actually do read. The notion they don’t is a self-fulfilling prophecy: “[P]ublishers rarely publish for men and don’t market towards men,” he writes.\n“Nobody can deny the fact that most editorial meetings tend to be dominated by women,” Pinder writes. “Saying the ratio is 75/25 is not overstating things. So needless to say when a male editor pitches a book aimed at men, there are perilously few men to read it and give their opinions.”\nWill Weaver, who writes young adult books, goes further, blaming not only publishing but our entire culture. Also at the Huffington Post, his indictment is much the same as Pinder’s, though. He describes going to Manhattan bookstore, where the Teen Section, all flowery and fem, contained 275 books for girls and a handful of fantasy titles for boys.\n“The bias against boy books in publishing has gotten so bad nowadays that my editor now reads manuscripts, he confessed, with an eye toward ‘re-gendering,’” Weaver writes. “That is, ‘I sort of like this novel but what if the main character were a girl instead of a boy?’”\nI’ll grant Weaver has a point about the need for more effort to attract boys to reading, and I’ll give Pinder props for writing respectfully of women in publishing. His critique is institutional.\nStill, these writers (and others before them, like Stephen King or Chris Goldberg), however sensitive and reasonable they may be, come down ultimately to this: Publishing has been feminized, nothing is marketed to men. In other words, it’s no our fault if we don’t read. It’s the women. Again.\nAs a man who has read all his life, I find this faintly patronizing and more than a little insulting. I have to be marketed to before I can turn off the TV or the video game and read a book? Geez, Mom, is my bottle warm yet? I’m hungry.\nThese arguments ignore that women not only read all the chicklit — female readers dominate the categories I would consider male-centric, like espionage/thriller (69 percent), mystery/detective (86 percent), science fiction (52 percent). That’s according to a 2000 study — the figures may be worse today.\nGiven the surprising note of whining in these masculine essays, I’ve come to the conclusion that men don’t read because — well, because they aren’t men. They’re spoiled little crybabies,  and adolescents who refuse to grow up.\nHow, one wonders, does a disinclination to read what women like to read – which is to say books like The Hunger Games, Twilight, 50 Shades of Grey, and the current NYT bestseller, Dear Life, by Alice Munro, which features stories such as this one: “A young woman ventures to a remote area to assume teaching duties in a\nTB sanitarium, soon entering into a dismal relationship with the head\ndoctor” – somehow translate into being a spoiled little crybaby or an adolescent?\nThen again, what Real Man wouldn’t want to read about a young woman having a relationship with the head doctor!  Spicy! As for Just One Evil Act, by Elizabeth George, we are informed that it is a “riveting tale of love, passion, and betrayal” concerning the disappearance of a nine-year-old girl named Hadiyyah. Riveting! Only a child-man could possibly fail to be fascinated by the prospect of such heart-pounding suspense!\nNow, I read a lot more than most men or women do. A few of my favorite authors happen to be women. I think rather well of Murasaki Shikibu, Dorothy Sayers, Susan Cooper, Tanith Lee, and Teresa Edgerton. But the thing is, those female authors don’t write conventional romance crap, and if they do happen to exhibit the female tendency to insert some sort of a romantic angle into everything, at least they don’t permit it to dominate the story.\nI now have zero – ZERO – interest in the vast majority of what presently passes for science fiction and mystery. Not because I dislike the genres, but because I dislike what the women who undeniably dominate the publishing industry insist on publishing as “science fiction” and “mystery”. And as a writer, I can say from direct personal influence that no matter how good the book is, or how significant its potential, if the book doesn’t “speak to me”, as one editor said, it’s simply not going to be published.\nAnd guess what sort of books don’t speak to the sort of women who work in publishing? The very sort of books that men most prefer to read, which is books that reflect masculine perspectives and honor masculine virtues.\nSo who is to blame for the fact that most men have quit reading? The answer is obvious: whoever is responsible for refusing to publish the sort of books that men used to read.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-31T15:36:00+00:00"
}