{
  "url": "https://voxday.net/2013/10/25/mastering-monster/",
  "scraped_at": "2025-12-15T16:34:45.620994",
  "title": "Mastering the monster",
  "date_display": "October 25, 2013",
  "date_iso": "2013-10-25T17:00:00+00:00",
  "date_from_url": "2013-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matrix Games announces <a href=\"http://www.matrixgames.com/products/296/details/World.In.Flames\">a quasi-new game</a> that borders upon the breathtaking:</p><blockquote class=\"tr_bq\"><p> World in Flames is Matrix Games’ computer version of Australian Design Group’s classic board game.  Covering both the European and Pacific Theaters of Operations during World War II, World in Flames is global in scope while simulating each branch of service in detail.  Land units are corps and army level, supplemented with specialized divisions.  Naval units include individual counters for every carrier, battleship, cruiser, and light cruiser in the war. Using 1000+ unique bitmapped images, air units represent groups of 250 to 500 airplanes.  With 6000+ unique units, 250+ countries, and a global map of 70,200 hexes, World in Flames is the premier World War II grand strategy game.</p><p>Nine of the eleven scenarios from Australian Design Group’s World in Flames Final Edition are included, and they range from the small 5 turn Barbarossa offensive in Russia and the 5 turn Guadalcanal battle in the Pacific, through to the 36 turn Global War campaign which spans all of Europe, Africa, the Middle East, Asia, the Atlantic, and the Pacific.  You can play either the Axis or the Allied side or take the role of one of the 8 major powers.  Besides solitaire and head-to-head, you can play over the Internet.  The last mode of play is for two players, Axis versus Allies.</p><p>In addition to the full set of rules from World in Flames, Final Edition, there are 58 optional rules.  Australian Design Group’s expansion modules Ships in Flames and Planes in Flames are incorporated into the basic game, but the inclusion of other expansion modules, such as Mech in Flames, Carrier Planes in Flames, and Cruisers in Flames, depends on which optional rules are selected.</p><p>This simulation models national production from conveying raw resources to factories  using rail lines and overseas pipelines for producing infantry, armor, naval, and air combat units.  Because oil was so important during World War II, there are separate optional rules for synthetic oil plants and deployment of oil reserves to the front lines.</p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.slitherinebravo.net/pr/WiF/WiF_Map_Render.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"180\" src=\"http://www.slitherinebravo.net/pr/WiF/WiF_Map_Render.jpg\" width=\"320\"/></a></div><p>This looks like an incredible blend of boardgame and computer game. No AI, but it is in the works, according to the developer. I have the computerized War in Europe, which was a somewhat similar concept, but this looks considerably more advanced and much more adapted for the Internet era. I think those<a href=\"http://www.matrixgames.com/forums/tm.asp?m=3412066\"> hardbound rulebooks</a> will look exceedingly nice next to my ASL folders, although I hope they will also include PDF versions for speedier reference.(1) I expect they will eventually add PBEM as well. I do hope you’ll be able to play over the Internet with a single copy.</p><p>And an interview with the designer, Harry Rowland, <a href=\"http://wargamer.com/article/3457/interview-world-in-flames-exclusive-wargamer.com-interview\">can be found here</a>. It’s amazing to learn that 60,000 copies of the game have been sold over the last 30 years.</p><p> (1) Looks like they anticipated this: <i>“The text from this section of the Players Manual is available during<br> game play as context sensitive help.  During a game you don’t need to<br> leaf through the Players Manual looking for how to use a form, just<br> click on the Help button to bring up the text from the Players Manual<br> that describes the form.” </br></br></br></br></i>That’s smart; it really is an integrated approach.<i><br/></i></p></div>",
  "content_text": "Matrix Games announces\na quasi-new game\nthat borders upon the breathtaking:\nWorld in Flames is Matrix Games’ computer version of Australian Design Group’s classic board game.  Covering both the European and Pacific Theaters of Operations during World War II, World in Flames is global in scope while simulating each branch of service in detail.  Land units are corps and army level, supplemented with specialized divisions.  Naval units include individual counters for every carrier, battleship, cruiser, and light cruiser in the war. Using 1000+ unique bitmapped images, air units represent groups of 250 to 500 airplanes.  With 6000+ unique units, 250+ countries, and a global map of 70,200 hexes, World in Flames is the premier World War II grand strategy game.\nNine of the eleven scenarios from Australian Design Group’s World in Flames Final Edition are included, and they range from the small 5 turn Barbarossa offensive in Russia and the 5 turn Guadalcanal battle in the Pacific, through to the 36 turn Global War campaign which spans all of Europe, Africa, the Middle East, Asia, the Atlantic, and the Pacific.  You can play either the Axis or the Allied side or take the role of one of the 8 major powers.  Besides solitaire and head-to-head, you can play over the Internet.  The last mode of play is for two players, Axis versus Allies.\nIn addition to the full set of rules from World in Flames, Final Edition, there are 58 optional rules.  Australian Design Group’s expansion modules Ships in Flames and Planes in Flames are incorporated into the basic game, but the inclusion of other expansion modules, such as Mech in Flames, Carrier Planes in Flames, and Cruisers in Flames, depends on which optional rules are selected.\nThis simulation models national production from conveying raw resources to factories  using rail lines and overseas pipelines for producing infantry, armor, naval, and air combat units.  Because oil was so important during World War II, there are separate optional rules for synthetic oil plants and deployment of oil reserves to the front lines.\nThis looks like an incredible blend of boardgame and computer game. No AI, but it is in the works, according to the developer. I have the computerized War in Europe, which was a somewhat similar concept, but this looks considerably more advanced and much more adapted for the Internet era. I think those\nhardbound rulebooks\nwill look exceedingly nice next to my ASL folders, although I hope they will also include PDF versions for speedier reference.(1) I expect they will eventually add PBEM as well. I do hope you’ll be able to play over the Internet with a single copy.\nAnd an interview with the designer, Harry Rowland,\ncan be found here\n. It’s amazing to learn that 60,000 copies of the game have been sold over the last 30 years.\n(1) Looks like they anticipated this:\n“The text from this section of the Players Manual is available during\ngame play as context sensitive help.  During a game you don’t need to\nleaf through the Players Manual looking for how to use a form, just\nclick on the Help button to bring up the text from the Players Manual\nthat describes the form.”\nThat’s smart; it really is an integrated approach.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-25T16:00:00+00:00"
}