{
  "url": "https://voxday.net/2013/10/04/peer-review-is-joke/",
  "scraped_at": "2025-12-14T22:44:17.500533",
  "title": "“Peer review is a joke”",
  "date_display": "October 4, 2013",
  "date_iso": "2013-10-04T13:00:00+00:00",
  "date_from_url": "2013-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The non-author of a sting paper peer-reviewed and published by <i>Science </i>points out that the open access sting published by <i>Science </i><a href=\"http://www.michaeleisen.org/blog/?p=1439\">is conclusive proof that so-called peer review is the problem</a>, not open access publication:</p><blockquote class=\"tr_bq\"><p> Although it comes as no surprise to anyone who is bombarded every day by solicitations from new “American” journals of such-and-such seeking papers and offering editorial positions to anyone with an email account, the formal exposure of hucksters out there looking to make a quick buck off of scientists’ desires to get their work published is valuable. It is unacceptable that there are publishers – several owned by big players in the subscription publishing world – who claim that they are carrying out peer review, and charging for it, but no doing it.</p><p>But it’s nuts to construe this as a problem unique to open access publishing, if for no other reason than the study, didn’t do the control of submitting the same paper to subscription-based publishers (UPDATE: The author, Bohannon emailed to say that, while his original intention was to look at all journals, practical constraints limited him to OA journals, and that Science played no role in this decision). We obviously don’t know what subscription journals would have done with this paper, but there is every reason to believe that a large number of them would also have accepted the paper (it has many features in common with the arsenic DNA paper afterall). Like OA journals, a lot of subscription-based journals have businesses based on accepting lots of papers with little regard to their importance or even validity. When Elsevier and other big commercial publishers pitch their “big deal”, the main thing they push is the number of papers they have in their collection. And one look at many of their journals shows that they also will accept almost anything.</p><p>None of this will stop anti-open access campaigners  (hello Scholarly Kitchen) from spinning this as a repudiation for enabling fraud. But the real story is that a fair number of journals who actually carried out peer review still accepted the paper, and the lesson people should take home from this story not that open access is bad, but that peer review is a joke. If a nakedly bogus paper is able to get through journals that actually peer reviewed it, think about how many legitimate, but deeply flawed, papers must also get through. Any scientist can quickly point to dozens of papers – including, and perhaps especially, in high impact journals – that are deeply, deeply flawed – the arsenic DNA story is one of many recent examples. As you probably know there has been a lot of smoke lately about the “reproducibility” problem in biomedical science, in which people have found that a majority of published papers report facts that turn out not to be true. This all adds up to showing that peer review simply doesn’t work.</p></blockquote><p>He’s referring to John Bohannan’s article “<a href=\"http://www.sciencemag.org/content/342/6154/60.full\">Who’s Afraid of Peer Review?</a>“, in which the author submitted an obviously fake paper describing the anticancer properties of a chemical extracted from a lichen that was nominally written by Ocorrafoo Cobange, a fictional biologist at the nonexistent Wassee Institute of Medicine in Asmara, that was accepted by 157 open access journals and rejected by only 98. As Slashdot describes it: “The article reveals a ‘Wild West’ landscape that’s emerging in academic publishing, where journals and their editorial staffs aren’t necessarily who or what they claim to be.”</p><p>This sting highlights the vital difference between scientody and the scientistry which is, <i>most of the time</i>, a fraudulent parody of what non-scientists believe science to be. Not only are scientists mere men rather than the white-coated demigods purely devoted to science they like to believe themselves to be, but due to the extraordinarily perverse incentive system to which they are subject, they are <i>provably less honest </i>in their occupations than the average individual.</p><p>Keep this in mind the next time someone tells you that you cannot take intelligent design seriously because it isn’t peer reviewed or that you can soon expect to cook pasta in the Atlantic because the scientific consensus is 95 percent certain that Man is causing the oceans to boil. The fact is that scientistry has become increasingly disconnected from scientody, peer review is a charade, most published science papers are not reproducible, and what passes for science is simply not what you probably believe it to be.</p><p>The irony is that the <i>Science </i>article is, in itself, bad scientody. Bohannan did not utilize a control group; he did not submit the fake paper to a single conventional subscription journal. He also did not send it to the majority of open access journals on the grounds that they do not require article processing charges.</p><p>Science not only is not the sole arbiter of truth, the assertions of scientists shouldn’t even be taken seriously until the “science” is transformed into something that is actually reliable, which is to say, engineering.</p></div>",
  "content_text": "The non-author of a sting paper peer-reviewed and published by\nScience\npoints out that the open access sting published by\nScience\nis conclusive proof that so-called peer review is the problem\n, not open access publication:\nAlthough it comes as no surprise to anyone who is bombarded every day by solicitations from new “American” journals of such-and-such seeking papers and offering editorial positions to anyone with an email account, the formal exposure of hucksters out there looking to make a quick buck off of scientists’ desires to get their work published is valuable. It is unacceptable that there are publishers – several owned by big players in the subscription publishing world – who claim that they are carrying out peer review, and charging for it, but no doing it.\nBut it’s nuts to construe this as a problem unique to open access publishing, if for no other reason than the study, didn’t do the control of submitting the same paper to subscription-based publishers (UPDATE: The author, Bohannon emailed to say that, while his original intention was to look at all journals, practical constraints limited him to OA journals, and that Science played no role in this decision). We obviously don’t know what subscription journals would have done with this paper, but there is every reason to believe that a large number of them would also have accepted the paper (it has many features in common with the arsenic DNA paper afterall). Like OA journals, a lot of subscription-based journals have businesses based on accepting lots of papers with little regard to their importance or even validity. When Elsevier and other big commercial publishers pitch their “big deal”, the main thing they push is the number of papers they have in their collection. And one look at many of their journals shows that they also will accept almost anything.\nNone of this will stop anti-open access campaigners  (hello Scholarly Kitchen) from spinning this as a repudiation for enabling fraud. But the real story is that a fair number of journals who actually carried out peer review still accepted the paper, and the lesson people should take home from this story not that open access is bad, but that peer review is a joke. If a nakedly bogus paper is able to get through journals that actually peer reviewed it, think about how many legitimate, but deeply flawed, papers must also get through. Any scientist can quickly point to dozens of papers – including, and perhaps especially, in high impact journals – that are deeply, deeply flawed – the arsenic DNA story is one of many recent examples. As you probably know there has been a lot of smoke lately about the “reproducibility” problem in biomedical science, in which people have found that a majority of published papers report facts that turn out not to be true. This all adds up to showing that peer review simply doesn’t work.\nHe’s referring to John Bohannan’s article “\nWho’s Afraid of Peer Review?\n“, in which the author submitted an obviously fake paper describing the anticancer properties of a chemical extracted from a lichen that was nominally written by Ocorrafoo Cobange, a fictional biologist at the nonexistent Wassee Institute of Medicine in Asmara, that was accepted by 157 open access journals and rejected by only 98. As Slashdot describes it: “The article reveals a ‘Wild West’ landscape that’s emerging in academic publishing, where journals and their editorial staffs aren’t necessarily who or what they claim to be.”\nThis sting highlights the vital difference between scientody and the scientistry which is,\nmost of the time\n, a fraudulent parody of what non-scientists believe science to be. Not only are scientists mere men rather than the white-coated demigods purely devoted to science they like to believe themselves to be, but due to the extraordinarily perverse incentive system to which they are subject, they are\nprovably less honest\nin their occupations than the average individual.\nKeep this in mind the next time someone tells you that you cannot take intelligent design seriously because it isn’t peer reviewed or that you can soon expect to cook pasta in the Atlantic because the scientific consensus is 95 percent certain that Man is causing the oceans to boil. The fact is that scientistry has become increasingly disconnected from scientody, peer review is a charade, most published science papers are not reproducible, and what passes for science is simply not what you probably believe it to be.\nThe irony is that the\nScience\narticle is, in itself, bad scientody. Bohannan did not utilize a control group; he did not submit the fake paper to a single conventional subscription journal. He also did not send it to the majority of open access journals on the grounds that they do not require article processing charges.\nScience not only is not the sole arbiter of truth, the assertions of scientists shouldn’t even be taken seriously until the “science” is transformed into something that is actually reliable, which is to say, engineering.",
  "tags": [
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-04T12:00:00+00:00"
}