{
  "url": "https://voxday.net/2013/10/30/published-may-not-mean-printed/",
  "scraped_at": "2025-12-15T16:35:18.052087",
  "title": "Published may not mean printed",
  "date_display": "October 30, 2013",
  "date_iso": "2013-10-30T17:00:00+00:00",
  "date_from_url": "2013-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be fascinating to learn how the forward-thinkers at the SFWA, whose two most recent presidents have staunchly and repeatedly denied that there was any need for authors to be concerned about imminent changes in the publishing industry related to ebooks, deal with the news that the major publishers appear to be moving away from contractually obligating themselves <a href=\"http://www.publishersweekly.com/pw/by-topic/industry-news/publisher-news/article/59721-for-major-pubs-will-print-no-longer-be-the-norm.html\">to release print versions</a> of the books they publish:</p><blockquote class=\"tr_bq\"><p> The idea that any standard deal from a major<br> publisher guarantees a print format release—which was previously a<br> foregone conclusion—is something agents no longer take for granted, with<br> some expressing concern that the big houses are starting to hedge on<br> print editions in contracts.</br></br></br></br></p><p>While e-book-only<br> agreements are nothing new—all large publishers have imprints that are<br> exclusively dedicated to digital titles—a handful of agents, all of whom<br> spoke to PW on the condition of anonymity, said they’re worried that<br> contracts from print-first imprints will increasingly come with clauses<br> indicating that the publisher makes no guarantee on format. The agents<br> say this is a new twist to the standard way of doing business….</br></br></br></br></br></br></p><p>One of the difficulties with reporting on changes<br> to book publishing contracts is that all new contracts, as Applebaum<br> rightly noted, are open to negotiation. However, there are standards of<br> doing business, and the agents speaking out said they feared that if<br> vague language about format begins to crop up on a regular basis, they<br> will need to start advocating for a format they were universally<br> guaranteed in the past.</br></br></br></br></br></br></p><p>Despite their dismay,<br> agents and other insiders who spoke to PW said they were not necessarily<br> surprised by the move, given the current marketplace. There is growing<br> pressure on publishers to release books quickly, and to do so in the<br> formats that will bring in the most revenue. Because so many book deals<br> are made well in advance of the titles’ release dates, publishers have<br> always had to gauge the future relevancy of topics and authors. Now<br> publishers also have to attempt to anticipate the future<br> bricks-and-mortar landscape when signing contracts. As some insiders<br> explained, it’s a very different situation when the question goes from,<br> “How many copies will Barnes &amp; Noble take?” to “Will Barnes &amp;<br> Noble be around?”</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><div class=\"article\"> Considering how McRapey had a complete meltdown when Random House established its digital-only imprints, it should be deeply amusing to see his reaction when this starts happening, to say nothing of the rampant panic amidst the less successful SF/F authors, as they will not only be limited to trivial advances, they won’t even be able to point to their print books to differentiate themselves from the self-published ebook authors anymore.<p>The fact is that print books don’t really make much economic sense anymore. There is too much risk attached to them given the rules of the distribution system. I think this will most affect paperbacks, particularly trade paperbacks. There will always be a small percentage of book lovers who demand hardbacks, but if I’m a publisher who faces the possibility of eating some 5,000 paperback returns, why take that risk?</p><p>Take ATOB, for example. I’ve sold 15x more ebooks than hardcovers, and that is to a group of unusually book-friendly readers who are disproportionately inclined to buy my books. I’ll continue making the hardcovers available, (because, let’s face it, the monsters do look well on the shelf), but they are a sideshow, they are not the primary product.</p><p>Perhaps more importantly, as the authors of the article noted, once Barnes &amp; Noble goes down, there won’t be a large enough retail market to make it worth their while producing print books for it. It may be another year or two before the publishers make the leap, but don’t be surprised if they do so sooner than that, given the growing financial, competitive, and distribution-related pressures on them.</p></div></div>",
  "content_text": "It should be fascinating to learn how the forward-thinkers at the SFWA, whose two most recent presidents have staunchly and repeatedly denied that there was any need for authors to be concerned about imminent changes in the publishing industry related to ebooks, deal with the news that the major publishers appear to be moving away from contractually obligating themselves\nto release print versions\nof the books they publish:\nThe idea that any standard deal from a major\npublisher guarantees a print format release—which was previously a\nforegone conclusion—is something agents no longer take for granted, with\nsome expressing concern that the big houses are starting to hedge on\nprint editions in contracts.\nWhile e-book-only\nagreements are nothing new—all large publishers have imprints that are\nexclusively dedicated to digital titles—a handful of agents, all of whom\nspoke to PW on the condition of anonymity, said they’re worried that\ncontracts from print-first imprints will increasingly come with clauses\nindicating that the publisher makes no guarantee on format. The agents\nsay this is a new twist to the standard way of doing business….\nOne of the difficulties with reporting on changes\nto book publishing contracts is that all new contracts, as Applebaum\nrightly noted, are open to negotiation. However, there are standards of\ndoing business, and the agents speaking out said they feared that if\nvague language about format begins to crop up on a regular basis, they\nwill need to start advocating for a format they were universally\nguaranteed in the past.\nDespite their dismay,\nagents and other insiders who spoke to PW said they were not necessarily\nsurprised by the move, given the current marketplace. There is growing\npressure on publishers to release books quickly, and to do so in the\nformats that will bring in the most revenue. Because so many book deals\nare made well in advance of the titles’ release dates, publishers have\nalways had to gauge the future relevancy of topics and authors. Now\npublishers also have to attempt to anticipate the future\nbricks-and-mortar landscape when signing contracts. As some insiders\nexplained, it’s a very different situation when the question goes from,\n“How many copies will Barnes & Noble take?” to “Will Barnes &\nNoble be around?”\nConsidering how McRapey had a complete meltdown when Random House established its digital-only imprints, it should be deeply amusing to see his reaction when this starts happening, to say nothing of the rampant panic amidst the less successful SF/F authors, as they will not only be limited to trivial advances, they won’t even be able to point to their print books to differentiate themselves from the self-published ebook authors anymore.\nThe fact is that print books don’t really make much economic sense anymore. There is too much risk attached to them given the rules of the distribution system. I think this will most affect paperbacks, particularly trade paperbacks. There will always be a small percentage of book lovers who demand hardbacks, but if I’m a publisher who faces the possibility of eating some 5,000 paperback returns, why take that risk?\nTake ATOB, for example. I’ve sold 15x more ebooks than hardcovers, and that is to a group of unusually book-friendly readers who are disproportionately inclined to buy my books. I’ll continue making the hardcovers available, (because, let’s face it, the monsters do look well on the shelf), but they are a sideshow, they are not the primary product.\nPerhaps more importantly, as the authors of the article noted, once Barnes & Noble goes down, there won’t be a large enough retail market to make it worth their while producing print books for it. It may be another year or two before the publishers make the leap, but don’t be surprised if they do so sooner than that, given the growing financial, competitive, and distribution-related pressures on them.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-30T17:00:00+00:00"
}