{
  "url": "https://voxday.net/2013/10/25/pz-wrestles-with-smv-loses/",
  "scraped_at": "2025-12-15T16:34:47.477853",
  "title": "PZ wrestles with SMV, loses",
  "date_display": "October 25, 2013",
  "date_iso": "2013-10-25T20:30:00+00:00",
  "date_from_url": "2013-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are few things more amusing than watching a Gamma attempt to criticize some aspect of Game. In this case, <a href=\"http://alphagameplan.blogspot.com/2013/10/raging-against-reality.html\">PZ provides a fascinating critique</a> of <a href=\"http://therationalmale.com/2013/10/20/sex-lies-and-statistics/\">Rollo’s SMV graphic</a>:</p><blockquote class=\"tr_bq\"><p> The whole concept of “Sexual Market Value”. What does that even mean? It’s dimensionless. He doesn’t have a way to look at any person and say, “Your market value is X”. It doesn’t even make sense to put this into a chart; my sexual appeal to my wife is huge, but negligible to everyone else. Scarlett Johansen may have a reputation as a very sexy woman, but her sexual “market value” to me is zero, and not only is it offensive to propose that her sex is purchasable for some imaginary sum of a million quatloos or whatever, it probably isn’t even a real commodity.</p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://fabzz.com/wp-content/uploads/celebrities/adriana-lima/and-alessandra-ambrosio-for-victoria-s-secret-photoshoot-2013-in-los-angeles/Adriana-Lima-and-Alessandra-Ambrosio---Victorias-Secret-Photoshoot-2013--21-560x839.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://fabzz.com/wp-content/uploads/celebrities/adriana-lima/and-alessandra-ambrosio-for-victoria-s-secret-photoshoot-2013-in-los-angeles/Adriana-Lima-and-Alessandra-Ambrosio---Victorias-Secret-Photoshoot-2013--21-560x839.jpg\" width=\"213\"/></a></div><p>Read the whole thing, including my response, <a href=\"http://alphagameplan.blogspot.com/2013/10/raging-against-reality.html\">at Alpha Game</a>. But the concept of Sexual Market Value is not a difficult one. The two women on the left are prime examples of women with very high SMVs. They are paid literally millions of dollars every year simply because they happen to represent what most people who are attracted to women find extraordinarily attractive. TL;DR: Brazilian supermodel = high SMV.</p><p>What I found most interesting about PZ’s post is an aspect into which I will delve into here rather than at AG since it is more relevant to economics than Game, is the way in which his post reveals that he genuinely does not grasp even basic principles of economics. Let’s take a look at his example of Scarlett Johansson.</p><p>Even if we take him at his word and accept that he finds her so totally unappealing that she holds no more attraction for him than an infant or an 85 year-old woman, that does not mean everyone else feels the same way. Hence the use of the term “Market”; SMV intrinsically describes the average of <i>everyone’s</i> subjective perspective concerning an individual. It’s not a literal market complete with prices because prostitution is illegal, but that doesn’t change the fact that the same rules of supply and demand that apply to literal markets measured in prices apply to the sexual market.</p><p>So, even though PZ’s sexual appeal to his wife is reportedly huge, because it is negligible to everyone else, his SMV is low. On the other hand, Ms Johansson’s SMV is high despite PZ’s deprecation of her because so many people find her to be exceptionally attractive. I am not one of them myself, but because I no more dictate global SMV than PZ or anyone else, I can recognize her high SMV despite the fact that I, personally, would rate her considerably lower.</p><p>These are simple principles of supply and demand. I place a much higher value, monetary and otherwise, on an Intellivision PAL system, than the vast majority of people on the planet. Many people place no value on console games, many people with an interest in console games place no value on long-outdated consoles, and most people who place value on long-outdated consoles live where NTSC is the standard.</p><p>So I will obtain a PAL Intellivision console for much less than I would be willing to pay for it because so few others value it as highly. In like manner, PZ is fortunate that he has apparently found a woman who happens to overrate his negligible sexual appeal in the converse of the way that PZ underrates Ms Johansson’s. So, it should be readily apparent that the fact value is subjective in no way means that objective observations and determinations cannot be made about the collective average of those individually subjective values, even when they are relative rather than numerically quantified.</p></div>",
  "content_text": "There are few things more amusing than watching a Gamma attempt to criticize some aspect of Game. In this case,\nPZ provides a fascinating critique\nof\nRollo’s SMV graphic\n:\nThe whole concept of “Sexual Market Value”. What does that even mean? It’s dimensionless. He doesn’t have a way to look at any person and say, “Your market value is X”. It doesn’t even make sense to put this into a chart; my sexual appeal to my wife is huge, but negligible to everyone else. Scarlett Johansen may have a reputation as a very sexy woman, but her sexual “market value” to me is zero, and not only is it offensive to propose that her sex is purchasable for some imaginary sum of a million quatloos or whatever, it probably isn’t even a real commodity.\nRead the whole thing, including my response,\nat Alpha Game\n. But the concept of Sexual Market Value is not a difficult one. The two women on the left are prime examples of women with very high SMVs. They are paid literally millions of dollars every year simply because they happen to represent what most people who are attracted to women find extraordinarily attractive. TL;DR: Brazilian supermodel = high SMV.\nWhat I found most interesting about PZ’s post is an aspect into which I will delve into here rather than at AG since it is more relevant to economics than Game, is the way in which his post reveals that he genuinely does not grasp even basic principles of economics. Let’s take a look at his example of Scarlett Johansson.\nEven if we take him at his word and accept that he finds her so totally unappealing that she holds no more attraction for him than an infant or an 85 year-old woman, that does not mean everyone else feels the same way. Hence the use of the term “Market”; SMV intrinsically describes the average of\neveryone’s\nsubjective perspective concerning an individual. It’s not a literal market complete with prices because prostitution is illegal, but that doesn’t change the fact that the same rules of supply and demand that apply to literal markets measured in prices apply to the sexual market.\nSo, even though PZ’s sexual appeal to his wife is reportedly huge, because it is negligible to everyone else, his SMV is low. On the other hand, Ms Johansson’s SMV is high despite PZ’s deprecation of her because so many people find her to be exceptionally attractive. I am not one of them myself, but because I no more dictate global SMV than PZ or anyone else, I can recognize her high SMV despite the fact that I, personally, would rate her considerably lower.\nThese are simple principles of supply and demand. I place a much higher value, monetary and otherwise, on an Intellivision PAL system, than the vast majority of people on the planet. Many people place no value on console games, many people with an interest in console games place no value on long-outdated consoles, and most people who place value on long-outdated consoles live where NTSC is the standard.\nSo I will obtain a PAL Intellivision console for much less than I would be willing to pay for it because so few others value it as highly. In like manner, PZ is fortunate that he has apparently found a woman who happens to overrate his negligible sexual appeal in the converse of the way that PZ underrates Ms Johansson’s. So, it should be readily apparent that the fact value is subjective in no way means that objective observations and determinations cannot be made about the collective average of those individually subjective values, even when they are relative rather than numerically quantified.",
  "tags": [
    "Alpha Game",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-25T19:30:00+00:00"
}