{
  "url": "https://voxday.net/2013/10/02/red-storm-setting/",
  "scraped_at": "2025-12-14T22:44:06.843456",
  "title": "Red Storm Setting",
  "date_display": "October 2, 2013",
  "date_iso": "2013-10-02T14:40:00+00:00",
  "date_from_url": "2013-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> <i>Tom Clancy has died. The best-selling author died in a Baltimore hospital on Tuesday night at the age of 66, according to his publisher.</i></p><p>Sic transit gloria mundi. I wasn’t a huge Clancy fan; I started reading his books with <i>The Hunt for Red October</i> until he lost me with <i>Clear and Present Danger</i>, but I still remember reading<i> Red Storm Rising</i> on the way back to my sophomore year of college and not going out that first night back because I absolutely had to finish the book first.</p><p>And I appreciated the little joke that he put in <i>The Sum of All Fears</i> with the two teams in the Super Bowl being the Denver Broncos and the Minnesota Vikings. It doesn’t work so well post Super Bowl XXXII, but it is still pretty funny. Somebody just HAS to win, right? Yeah, not so much.</p></div>",
  "content_text": "Tom Clancy has died. The best-selling author died in a Baltimore hospital on Tuesday night at the age of 66, according to his publisher.\nSic transit gloria mundi. I wasn’t a huge Clancy fan; I started reading his books with\nThe Hunt for Red October\nuntil he lost me with\nClear and Present Danger\n, but I still remember reading\nRed Storm Rising\non the way back to my sophomore year of college and not going out that first night back because I absolutely had to finish the book first.\nAnd I appreciated the little joke that he put in\nThe Sum of All Fears\nwith the two teams in the Super Bowl being the Denver Broncos and the Minnesota Vikings. It doesn’t work so well post Super Bowl XXXII, but it is still pretty funny. Somebody just HAS to win, right? Yeah, not so much.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-02T13:40:00+00:00"
}