{
  "url": "https://voxday.net/2013/10/28/science-has-lost-its-way/",
  "scraped_at": "2025-12-15T16:35:05.495398",
  "title": "“Science has lost its way”",
  "date_display": "October 28, 2013",
  "date_iso": "2013-10-28T20:00:00+00:00",
  "date_from_url": "2013-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this rate, the science fetishists who lob accusations of “anti-science” at everyone who notices the dishonesty, fraud, and shameless rent-seeking in modern professional science are going to find themselves at war with the entire world. One can hardly describe <a href=\"http://www.latimes.com/business/la-fi-hiltzik-20131027,0,1228881.column#axzz2iyoimL3X\">the Los Angeles Times</a> as an organization of  Bible-thumping Republicans who hate science because they believe humans rode dinosaurs.</p><blockquote class=\"tr_bq\"><p> In today’s world, brimful as it is with opinion and falsehoods masquerading as facts, you’d think the one place you can depend on for verifiable facts is science.</p><p>You’d be wrong. Many billions of dollars’ worth of wrong.</p><p>A few years ago, scientists at the Thousand Oaks biotech firm Amgen set out to double-check the results of 53 landmark papers in their fields of cancer research and blood biology.The idea was to make sure that research on which Amgen was spending<br> millions of development dollars still held up. They figured that a few<br> of the studies would fail the test — that the original results couldn’t<br> be reproduced because the findings were especially novel or described<br> fresh therapeutic approaches.</br></br></br></br></p><p>But what they found was startling: Of the 53 landmark papers, only six could be proved valid.</p><p>Unfortunately, it wasn’t unique. A group at Bayer HealthCare in Germany<br> similarly found that only 25% of published papers on which it was basing<br> R&amp;D projects could be validated, suggesting that projects in which<br> the firm had sunk huge resources should be abandoned. Whole fields of<br> research, including some in which patients were already participating in<br> clinical trials, are based on science that hasn’t been, and possibly<br> can’t be, validated.</br></br></br></br></br></br></p></blockquote><p>Remember this the next time someone tries to claim there is “no evidence” because the evidence isn’t scientific. Because, based on the ACTUAL DOCUMENTARY EVIDENCE presented here, published, peer-reviewed science has between a 75 percent and an 89 percent chance of being FACTUALLY FALSE.</p><p>In addition to making it clear that science is not even a serious contender for being a means of determining the truth, this also explodes what I have repeatedly pointed out concerning the myth of science being self-correcting. The more scientists pout and cry about criticism rather than getting their house in order, the more people will come to understand that they are little more than a professional union attempting to coast on the achievements of their predecessors.</p></div>",
  "content_text": "At this rate, the science fetishists who lob accusations of “anti-science” at everyone who notices the dishonesty, fraud, and shameless rent-seeking in modern professional science are going to find themselves at war with the entire world. One can hardly describe\nthe Los Angeles Times\nas an organization of  Bible-thumping Republicans who hate science because they believe humans rode dinosaurs.\nIn today’s world, brimful as it is with opinion and falsehoods masquerading as facts, you’d think the one place you can depend on for verifiable facts is science.\nYou’d be wrong. Many billions of dollars’ worth of wrong.\nA few years ago, scientists at the Thousand Oaks biotech firm Amgen set out to double-check the results of 53 landmark papers in their fields of cancer research and blood biology.The idea was to make sure that research on which Amgen was spending\nmillions of development dollars still held up. They figured that a few\nof the studies would fail the test — that the original results couldn’t\nbe reproduced because the findings were especially novel or described\nfresh therapeutic approaches.\nBut what they found was startling: Of the 53 landmark papers, only six could be proved valid.\nUnfortunately, it wasn’t unique. A group at Bayer HealthCare in Germany\nsimilarly found that only 25% of published papers on which it was basing\nR&D projects could be validated, suggesting that projects in which\nthe firm had sunk huge resources should be abandoned. Whole fields of\nresearch, including some in which patients were already participating in\nclinical trials, are based on science that hasn’t been, and possibly\ncan’t be, validated.\nRemember this the next time someone tries to claim there is “no evidence” because the evidence isn’t scientific. Because, based on the ACTUAL DOCUMENTARY EVIDENCE presented here, published, peer-reviewed science has between a 75 percent and an 89 percent chance of being FACTUALLY FALSE.\nIn addition to making it clear that science is not even a serious contender for being a means of determining the truth, this also explodes what I have repeatedly pointed out concerning the myth of science being self-correcting. The more scientists pout and cry about criticism rather than getting their house in order, the more people will come to understand that they are little more than a professional union attempting to coast on the achievements of their predecessors.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-28T20:00:00+00:00"
}