{
  "url": "https://voxday.net/2013/10/28/the-min-campaign/",
  "scraped_at": "2025-12-15T16:35:01.812328",
  "title": "The MIN campaign",
  "date_display": "October 28, 2013",
  "date_iso": "2013-10-28T13:00:00+00:00",
  "date_from_url": "2013-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>From Wikipedia circa 2023:</i></p><p>Moar Inflation Now (MIN) was an attempt to spur a grassroots movement to stoke inflation, by encouraging personal borrowing and unrestrained spending habits in combination with expansionary public measures, urged by Fed Chairwoman Janet Yellen and Secretary of the Treasury Paul Krugman. People who supported the mandatory and voluntary measures were encouraged to wear “MIN” buttons, perhaps in hope of evoking in peacetime the kind of solidarity and voluntarism symbolized by the V-campaign during World War II.</p><p>The campaign began in earnest with the establishment by the Federal Reserve, of the National Commission on Inflation, which Yellen closed with an address to the American people at Jackson Hole, asking them to send her a list of ten inflation-increasing ideas. Ten days later, Krugman declared deflation “public enemy number one” before Congress on October 13, 2017, in a speech entitled “Moar Inflation Now”, announcing a series of proposals for public and private steps intended to directly affect supply and demand, in order to increase inflation to the desired rate of 10 percent per annum. “MIN” buttons immediately became objects of ridicule; skeptics wore the buttons upside down, explaining that “NIW” stood for “No I Won’t,” or “Not In Weimar,” or “Need Immediate Wank.”</p><p>In his book <i>What the Fucking Fuck Was I Thinking?</i>, Ben Bernanke admitted that the thought “This is unbelievably stupid” crossed his mind when Moar Inflation Now was first presented to the Clinton administration by his successor at the Federal Reserve. However, according to revisionist self-historian Paul Krugman, increasing the money and credit supplies was never meant to be the centerpiece of the pro-inflation program and the mass corporate bankruptcies, collapse of the US debt markets, and subsequent catastrophic failure of the global financial system only prove how much worse the economic situation would have been without the triumphant success of the MIN campaign.</p></div>",
  "content_text": "From Wikipedia circa 2023:\nMoar Inflation Now (MIN) was an attempt to spur a grassroots movement to stoke inflation, by encouraging personal borrowing and unrestrained spending habits in combination with expansionary public measures, urged by Fed Chairwoman Janet Yellen and Secretary of the Treasury Paul Krugman. People who supported the mandatory and voluntary measures were encouraged to wear “MIN” buttons, perhaps in hope of evoking in peacetime the kind of solidarity and voluntarism symbolized by the V-campaign during World War II.\nThe campaign began in earnest with the establishment by the Federal Reserve, of the National Commission on Inflation, which Yellen closed with an address to the American people at Jackson Hole, asking them to send her a list of ten inflation-increasing ideas. Ten days later, Krugman declared deflation “public enemy number one” before Congress on October 13, 2017, in a speech entitled “Moar Inflation Now”, announcing a series of proposals for public and private steps intended to directly affect supply and demand, in order to increase inflation to the desired rate of 10 percent per annum. “MIN” buttons immediately became objects of ridicule; skeptics wore the buttons upside down, explaining that “NIW” stood for “No I Won’t,” or “Not In Weimar,” or “Need Immediate Wank.”\nIn his book\nWhat the Fucking Fuck Was I Thinking?\n, Ben Bernanke admitted that the thought “This is unbelievably stupid” crossed his mind when Moar Inflation Now was first presented to the Clinton administration by his successor at the Federal Reserve. However, according to revisionist self-historian Paul Krugman, increasing the money and credit supplies was never meant to be the centerpiece of the pro-inflation program and the mass corporate bankruptcies, collapse of the US debt markets, and subsequent catastrophic failure of the global financial system only prove how much worse the economic situation would have been without the triumphant success of the MIN campaign.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-28T13:00:00+00:00"
}