{
  "url": "https://voxday.net/2013/10/18/the-economist-wakes-up-to-bad-science/",
  "scraped_at": "2025-12-15T16:34:02.371165",
  "title": "The Economist notices bad science",
  "date_display": "October 18, 2013",
  "date_iso": "2013-10-18T11:37:00+00:00",
  "date_from_url": "2013-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I look forward to all of the science fetishists who have shrieked with outrage every time I pointed out the uncomfortable fact of the increasing departure of scientistry from scientody finally realizing, with all due horror, that I was correct about modern professional science, all along as the mainstream media <a href=\"http://www.economist.com/news/leaders/21588069-scientific-research-has-changed-world-now-it-needs-change-itself-how-science-goes-wrong\">begins to repeat my previous criticisms</a>. Science has gone wrong, badly wrong. And it has done so by abandoning the method that gave it its reputation.</p><blockquote class=\"tr_bq\"><p> A simple idea underpins science: “trust, but verify”. Results should always be subject to challenge from experiment. That simple but powerful idea has generated a vast body of knowledge. Since its birth in the 17th century, modern science has changed the world beyond recognition, and overwhelmingly for the better.</p><p>But success can breed complacency. Modern scientists are doing too much trusting and not enough verifying—to the detriment of the whole of science, and of humanity.</p><p>Too many of the findings that fill the academic ether are the result of shoddy experiments or poor analysis (see article). A rule of thumb among biotechnology venture-capitalists is that half of published research cannot be replicated. Even that may be optimistic. Last year researchers at one biotech firm, Amgen, found they could reproduce just six of 53 “landmark” studies in cancer research. Earlier, a group at Bayer, a drug company, managed to repeat just a quarter of 67 similarly important papers. A leading computer scientist frets that three-quarters of papers in his subfield are bunk. In 2000-10 roughly 80,000 patients took part in clinical trials based on research that was later retracted because of mistakes or improprieties….</p><p>One reason is the competitiveness of science. In the 1950s, when modern<br> academic research took shape after its successes in the second world<br> war, it was still a rarefied pastime. The entire club of scientists<br> numbered a few hundred thousand. As their ranks have swelled, to 6m-7m<br> active researchers on the latest reckoning, scientists have lost their<br> taste for self-policing and quality control. The obligation to “publish<br> or perish” has come to rule over academic life. Competition for jobs is<br> cut-throat. Full professors in America earned on average $135,000 in<br> 2012—more than judges did. Every year six freshly minted PhDs vie for<br> every academic post. Nowadays verification (the replication of other<br> people’s results) does little to advance a researcher’s career. And<br> without verification, dubious findings live on to mislead.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>As in the case of university degrees, scientistry has been badly diluted. Scientists of a wide variety of disciplines are cashing in on the reputations of physicists from more than sixty years ago.  The science of Bohr and Feynman is simply not the pseudo-science of Richard Dawkins and Daniel Dennett.</p><p>This is not a surprise. I’ve been reading Kuhn’s landmark <i>Structure of Scientific Revolutions</i> and it is eminently clear that we are rapidly approaching a crisis in biology, the sort of crisis that has historically led to new scientific paradigms. It may take a long time for the crisis to resolve itself, but this Second Crisis of Darwin should be sufficient to put the theory of evolution by natural selection in the dustbin of scientific history with phlogiston, heliocentrism, and other erstwhile scientific “facts”. Instead of salvaging Darwinian theory through a synthesis, the continued refinement of Mendelian genetics will destroy it once and for all.</p><p>And it’s not a coincidence that the growing awareness of bad science is occurring as the global warming debacle continues to unravel. Those who attacked the skeptics of global warming and staked science’s reputation on the idea that Man was cooking the earth are directly responsible for the public’s increasing dismissal of scientific authority.</p></div>",
  "content_text": "I look forward to all of the science fetishists who have shrieked with outrage every time I pointed out the uncomfortable fact of the increasing departure of scientistry from scientody finally realizing, with all due horror, that I was correct about modern professional science, all along as the mainstream media\nbegins to repeat my previous criticisms\n. Science has gone wrong, badly wrong. And it has done so by abandoning the method that gave it its reputation.\nA simple idea underpins science: “trust, but verify”. Results should always be subject to challenge from experiment. That simple but powerful idea has generated a vast body of knowledge. Since its birth in the 17th century, modern science has changed the world beyond recognition, and overwhelmingly for the better.\nBut success can breed complacency. Modern scientists are doing too much trusting and not enough verifying—to the detriment of the whole of science, and of humanity.\nToo many of the findings that fill the academic ether are the result of shoddy experiments or poor analysis (see article). A rule of thumb among biotechnology venture-capitalists is that half of published research cannot be replicated. Even that may be optimistic. Last year researchers at one biotech firm, Amgen, found they could reproduce just six of 53 “landmark” studies in cancer research. Earlier, a group at Bayer, a drug company, managed to repeat just a quarter of 67 similarly important papers. A leading computer scientist frets that three-quarters of papers in his subfield are bunk. In 2000-10 roughly 80,000 patients took part in clinical trials based on research that was later retracted because of mistakes or improprieties….\nOne reason is the competitiveness of science. In the 1950s, when modern\nacademic research took shape after its successes in the second world\nwar, it was still a rarefied pastime. The entire club of scientists\nnumbered a few hundred thousand. As their ranks have swelled, to 6m-7m\nactive researchers on the latest reckoning, scientists have lost their\ntaste for self-policing and quality control. The obligation to “publish\nor perish” has come to rule over academic life. Competition for jobs is\ncut-throat. Full professors in America earned on average $135,000 in\n2012—more than judges did. Every year six freshly minted PhDs vie for\nevery academic post. Nowadays verification (the replication of other\npeople’s results) does little to advance a researcher’s career. And\nwithout verification, dubious findings live on to mislead.\nAs in the case of university degrees, scientistry has been badly diluted. Scientists of a wide variety of disciplines are cashing in on the reputations of physicists from more than sixty years ago.  The science of Bohr and Feynman is simply not the pseudo-science of Richard Dawkins and Daniel Dennett.\nThis is not a surprise. I’ve been reading Kuhn’s landmark\nStructure of Scientific Revolutions\nand it is eminently clear that we are rapidly approaching a crisis in biology, the sort of crisis that has historically led to new scientific paradigms. It may take a long time for the crisis to resolve itself, but this Second Crisis of Darwin should be sufficient to put the theory of evolution by natural selection in the dustbin of scientific history with phlogiston, heliocentrism, and other erstwhile scientific “facts”. Instead of salvaging Darwinian theory through a synthesis, the continued refinement of Mendelian genetics will destroy it once and for all.\nAnd it’s not a coincidence that the growing awareness of bad science is occurring as the global warming debacle continues to unravel. Those who attacked the skeptics of global warming and staked science’s reputation on the idea that Man was cooking the earth are directly responsible for the public’s increasing dismissal of scientific authority.",
  "tags": [
    "media",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-18T10:37:00+00:00"
}