{
  "url": "https://voxday.net/2013/10/30/the-nonexistent-magic-of-geographica/",
  "scraped_at": "2025-12-15T16:35:19.868949",
  "title": "The nonexistent magic of geographical relocation",
  "date_display": "October 30, 2013",
  "date_iso": "2013-10-30T20:00:00+00:00",
  "date_from_url": "2013-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Republicans are beginning to wake up to the fact that Karl Rove was an inobservant fool and George Bush the Younger’s “Hispanics are natural conservatives” strategy <a href=\"http://townhall.com/columnists/phyllisschlafly/2013/10/29/amnesty-is-republican-party-suicide-n1732723\">was political suicide from the start</a>:</p><blockquote class=\"tr_bq\"><p> Most of the millions of immigrants we have welcomed came from countries<br> where the only government they knew was one that made all decisions<br> about economic and social policy. The current level of legal immigration<br> to America adds thousands of people every day whose views and<br> experience are contrary to the conservative value of limited government.</br></br></br></br></p><p>The influx of these new voters will reduce or eliminate Republicans’<br> ability to offer an alternative to big government, increased government<br> spending, and favorite liberal policies such as Obamacare and gun<br> control. New voters will lean on our hard-pressed health care system and<br> overcrowded public schools to demand more government services….</br></br></br></br></p><p>An enormous body of survey research shows that large majorities of<br> recent immigrants, who are mostly Hispanic and Asian, hold liberal views<br> on most policy issues and therefore vote Democratic two-to-one.</br></br></p></blockquote><p>Considering that the German, Scandinavian, Irish, Italian, and Jewish immigrants have never quite managed to master the historically unusual concepts of limited government and the sovereign rights of Englishmen, I’ve never understood the idea that Hispanics, Asians, and Africans, whose political traditions are even further from the American revolutionary concepts, could reasonably be expected to adopt them faithfully en masse.</p><p>When one considers that two of the three major political parties in Mexico are both members of the Socialist International, can it really be surprising to anyone that the 30 million+ Mexicans in the USA tend to lean left? Geographical location does not tend to change either ideology or political identities.</p></div>",
  "content_text": "Republicans are beginning to wake up to the fact that Karl Rove was an inobservant fool and George Bush the Younger’s “Hispanics are natural conservatives” strategy\nwas political suicide from the start\n:\nMost of the millions of immigrants we have welcomed came from countries\nwhere the only government they knew was one that made all decisions\nabout economic and social policy. The current level of legal immigration\nto America adds thousands of people every day whose views and\nexperience are contrary to the conservative value of limited government.\nThe influx of these new voters will reduce or eliminate Republicans’\nability to offer an alternative to big government, increased government\nspending, and favorite liberal policies such as Obamacare and gun\ncontrol. New voters will lean on our hard-pressed health care system and\novercrowded public schools to demand more government services….\nAn enormous body of survey research shows that large majorities of\nrecent immigrants, who are mostly Hispanic and Asian, hold liberal views\non most policy issues and therefore vote Democratic two-to-one.\nConsidering that the German, Scandinavian, Irish, Italian, and Jewish immigrants have never quite managed to master the historically unusual concepts of limited government and the sovereign rights of Englishmen, I’ve never understood the idea that Hispanics, Asians, and Africans, whose political traditions are even further from the American revolutionary concepts, could reasonably be expected to adopt them faithfully en masse.\nWhen one considers that two of the three major political parties in Mexico are both members of the Socialist International, can it really be surprising to anyone that the 30 million+ Mexicans in the USA tend to lean left? Geographical location does not tend to change either ideology or political identities.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-30T20:00:00+00:00"
}