{
  "url": "https://voxday.net/2013/10/24/the-philosophical-failure-of-science/",
  "scraped_at": "2025-12-15T16:34:39.315859",
  "title": "The philosophical failure of science",
  "date_display": "October 24, 2013",
  "date_iso": "2013-10-24T13:00:00+00:00",
  "date_from_url": "2013-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If he’s not careful, the Society for the Prevention of Cruelty to Scientists is going to round up James Delingpole for excess public brutality. His demolition of the BBC and its so-called science experts <a href=\"http://www.spectator.co.uk/columnists/james-delingpole/9063201/why-cant-the-bbc-be-impartial-in-the-climate-change-debate/\">borders on pure sadism</a>:</p><blockquote class=\"tr_bq\"><p> The Beeb constantly resorts to ‘experts’ whose arguments are bigoted, feeble, fatuous, fallacious and stupid</p><p><i>‘Well, you’re arguing facts against opinions. OK, I<br> mean, the fact that the amount of carbon dioxide in the air has rocketed<br> up since the Industrial Revolution, and continues to rocket up, is a<br> fact. Now, it’s so much a fact that even the climate change deniers look<br> away from it and don’t deny it.’</br></br></br></br></i><br> — Professor Steve Jones, Feedback, BBC Radio 4, 18 October</br></p><p>Have a look at that last sentence. It represents such a cherishably<br> stupid, rude, fatuous, crabby, bigoted, ignorant, petulant, feeble,<br> fallacious, dishonest and misleading argument that if it turned out the<br> speaker in question was a professor of logic or philosophy you really<br> might want to shoot yourself in despair.</br></br></br></br></p><p>Can you see what the problem is? Let me explain. This angry professor<br> character wants us to believe that there are people called ‘climate<br> change deniers’ who are so far outside the pale of reasonable discourse<br> that even when they are right it’s another sign of just how wrong they<br> are.</br></br></br></br></p><p>Atmospheric CO2 has been rising since the Industrial<br> Revolution, Jones is telling us, but those pesky deniers are so slippery<br> that they refuse to deny this fact. If they did, presumably, it would<br> make Jones’s job a lot easier because then he’d be able to provide a<br> clear example of these wrong ‘opinions’ deniers supposedly hold.<br> Apparently, though, Jones is unable to produce such a clear example. So<br> instead he has to fabricate one and — in the very next breath — to<br> discount it by conceding that actually this is a point on which ‘even’<br> the ‘deniers’ agree.</br></br></br></br></br></br></br></br></p></blockquote><p>It’s a bad sign for the state of science when the average anklebiting blog troll can produce arguments that are more coherent, credible, and convincing than the official mouthpieces of scientific consensus. But then, that’s what happens when scientists show they are more dedicated to scientistry than scientody.</p><p>Appeal to authority are inherently problematic. But appealing to the climatological authority of a biologist whose specialty is snails? It requires years of J-school to produce that quixotic form of genius.</p></div>",
  "content_text": "If he’s not careful, the Society for the Prevention of Cruelty to Scientists is going to round up James Delingpole for excess public brutality. His demolition of the BBC and its so-called science experts\nborders on pure sadism\n:\nThe Beeb constantly resorts to ‘experts’ whose arguments are bigoted, feeble, fatuous, fallacious and stupid\n‘Well, you’re arguing facts against opinions. OK, I\nmean, the fact that the amount of carbon dioxide in the air has rocketed\nup since the Industrial Revolution, and continues to rocket up, is a\nfact. Now, it’s so much a fact that even the climate change deniers look\naway from it and don’t deny it.’\n— Professor Steve Jones, Feedback, BBC Radio 4, 18 October\nHave a look at that last sentence. It represents such a cherishably\nstupid, rude, fatuous, crabby, bigoted, ignorant, petulant, feeble,\nfallacious, dishonest and misleading argument that if it turned out the\nspeaker in question was a professor of logic or philosophy you really\nmight want to shoot yourself in despair.\nCan you see what the problem is? Let me explain. This angry professor\ncharacter wants us to believe that there are people called ‘climate\nchange deniers’ who are so far outside the pale of reasonable discourse\nthat even when they are right it’s another sign of just how wrong they\nare.\nAtmospheric CO2 has been rising since the Industrial\nRevolution, Jones is telling us, but those pesky deniers are so slippery\nthat they refuse to deny this fact. If they did, presumably, it would\nmake Jones’s job a lot easier because then he’d be able to provide a\nclear example of these wrong ‘opinions’ deniers supposedly hold.\nApparently, though, Jones is unable to produce such a clear example. So\ninstead he has to fabricate one and — in the very next breath — to\ndiscount it by conceding that actually this is a point on which ‘even’\nthe ‘deniers’ agree.\nIt’s a bad sign for the state of science when the average anklebiting blog troll can produce arguments that are more coherent, credible, and convincing than the official mouthpieces of scientific consensus. But then, that’s what happens when scientists show they are more dedicated to scientistry than scientody.\nAppeal to authority are inherently problematic. But appealing to the climatological authority of a biologist whose specialty is snails? It requires years of J-school to produce that quixotic form of genius.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-24T12:00:00+00:00"
}