{
  "url": "https://voxday.net/2013/10/19/the-end-of-liberal-arts-major/",
  "scraped_at": "2025-12-15T16:34:11.284801",
  "title": "The end of the liberal arts major",
  "date_display": "October 19, 2013",
  "date_iso": "2013-10-19T14:07:00+00:00",
  "date_from_url": "2013-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bottom is dropping out of their <a href=\"http://qz.com/134661/briggo-coffee-army-of-robot-baristas-could-mean-the-end-of-starbucks-as-we-know-it/\">employment-of-last-resort</a>:</p><blockquote class=\"tr_bq\"><p> Starbucks’ 95,000 baristas have a competitor. It doesn’t need sleep. It’s precise in a way that a human could never be. It requires no training. It can’t quit. It has memorized every one of its customers’ orders. There’s never a line for its perfectly turned-out drinks.</p><p>It doesn’t require health insurance.</p><p>Don’t think of it as the enemy of baristas, insists Kevin Nater, CEO of the company that has produced this technological marvel. Think of it as an instrument people can use to create their ideal coffee experience. Think of it as a cure for “out-of-home coffee drinkers”—Nater’s phrase—sick of an “inconsistent experience.”</p><p>Think of it as the future. Think of it as empowerment. Your coffee, your way, flawlessly, every time, no judgments. Four pumps of sugar-free vanilla syrup in a 16 oz. half-caff soy latte? Here it is, delivered to you precisely when your smartphone app said it would arrive, hot and fresh and indistinguishable from the last one you ordered.</p><p>In a common area at the University of Texas at Austin, the Briggo<br> coffee kiosk, covered in fake wood paneling and a touch screen and not<br> much else, takes up about as much space as a pair of phone booths. Its<br> external appearance was designed by award-winning industrial designer <a href=\"http://en.wikipedia.org/wiki/Yves_B%C3%A9har\">Yves Behar</a>,<br> with the intention that it radiate authenticity and what Briggo says is<br> its commitment to making coffee that is the equal of what comes out of<br> any high-end coffee shop.</br></br></br></br></br></br></p><p>The kiosk at the university is the second version, the one that will<br> be rolling out across the country in locations that are still secret. It<br> needs just 50 square feet (4.6 sq m) of floor space, and it can be<br> dropped anywhere—an airport, a hospital, a company campus, a cafe with<br> tables and chairs and WiFi just like Starbucks. It’s manufactured in<br> Austin.</br></br></br></br></br></p><p>Inside, protected by stainless steel walls and a thicket of patents,<br> there is a secret, proprietary viscera of pipes, storage vessels,<br> heating instruments, robot arms and 250 or so sensors that together do<br> everything a human barista would do if only she had something like<br> perfect self-knowledge.</br></br></br></br></p></blockquote><p> Robo-baristas may be what finally pops the higher education bubble.</p></div>",
  "content_text": "The bottom is dropping out of their\nemployment-of-last-resort\n:\nStarbucks’ 95,000 baristas have a competitor. It doesn’t need sleep. It’s precise in a way that a human could never be. It requires no training. It can’t quit. It has memorized every one of its customers’ orders. There’s never a line for its perfectly turned-out drinks.\nIt doesn’t require health insurance.\nDon’t think of it as the enemy of baristas, insists Kevin Nater, CEO of the company that has produced this technological marvel. Think of it as an instrument people can use to create their ideal coffee experience. Think of it as a cure for “out-of-home coffee drinkers”—Nater’s phrase—sick of an “inconsistent experience.”\nThink of it as the future. Think of it as empowerment. Your coffee, your way, flawlessly, every time, no judgments. Four pumps of sugar-free vanilla syrup in a 16 oz. half-caff soy latte? Here it is, delivered to you precisely when your smartphone app said it would arrive, hot and fresh and indistinguishable from the last one you ordered.\nIn a common area at the University of Texas at Austin, the Briggo\ncoffee kiosk, covered in fake wood paneling and a touch screen and not\nmuch else, takes up about as much space as a pair of phone booths. Its\nexternal appearance was designed by award-winning industrial designer\nYves Behar\n,\nwith the intention that it radiate authenticity and what Briggo says is\nits commitment to making coffee that is the equal of what comes out of\nany high-end coffee shop.\nThe kiosk at the university is the second version, the one that will\nbe rolling out across the country in locations that are still secret. It\nneeds just 50 square feet (4.6 sq m) of floor space, and it can be\ndropped anywhere—an airport, a hospital, a company campus, a cafe with\ntables and chairs and WiFi just like Starbucks. It’s manufactured in\nAustin.\nInside, protected by stainless steel walls and a thicket of patents,\nthere is a secret, proprietary viscera of pipes, storage vessels,\nheating instruments, robot arms and 250 or so sensors that together do\neverything a human barista would do if only she had something like\nperfect self-knowledge.\nRobo-baristas may be what finally pops the higher education bubble.",
  "tags": [
    "education",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-19T13:07:00+00:00"
}