{
  "url": "https://voxday.net/2013/10/05/this-guy-isnt-disabled/",
  "scraped_at": "2025-12-14T22:44:24.848286",
  "title": "This guy isn’t disabled",
  "date_display": "October 5, 2013",
  "date_iso": "2013-10-05T13:00:00+00:00",
  "date_from_url": "2013-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I used to go to Gopher football games back when Tony Dungy was the quarterback. I still remember when they upset Michigan. I couldn’t believe it when they moved their games to that ridiculous Dome. And they haven’t won the Big 10 since before I was born. But if they do, in my lifetime, it wouldn’t surprise me if it was due to the toughness and determination of <a href=\"http://www.nytimes.com/2013/10/05/sports/ncaafootball/for-coach-jerry-kill-seizures-are-mere-distractions.html?pagewanted=1&amp;_r=0&amp;hpw\">their epileptic coach</a>:</p><blockquote class=\"tr_bq\"><p> Immediately after Jerry Kill has a seizure on the sideline, one longtime assistant takes over the headset and communicates with officials. The defensive coordinator handles the postgame news conference and splits the remaining news media obligations with the offensive coordinator. Should Kill miss practice, they revert to their schedule from a week earlier, with adjustments based on their next opponent.</p><div itemprop=\"articleBody\"> Always, Kill returns soon after to his office at the <a class=\"meta-org\" href=\"http://topics.nytimes.com/top/reference/timestopics/organizations/u/university_of_minnesota/index.html?inline=nyt-org\" title=\"More articles about University of Minnesota\">University of Minnesota</a>. The assistants come to work and see him at his desk and nod and head to their own offices, not a word exchanged. </div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Kill, 52, is a reconstruction specialist, an expert in taking over<br> feeble programs and turning them into something better. He is probably<br> also the only college football coach in the country who has a seizure<br> protocol. There is no three-ring binder or written list of step-by-step<br> instructions, only the calm and routine borne from years spent side by<br> side with his trusted assistants, as they climbed from the lower levels<br> of college football to the Big Ten. </br></br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Three times in the last three seasons, Kill could not finish games<br> because of epileptic seizures. Each time, thousands witnessed him<br> splayed on the ground, as spasms shot through his limbs and his body<br> shook uncontrollably and some of his players cried.</br></br></br></div></blockquote><p>Talk about the courage of being willing to get up again after being knocked down; this man epitomizes it. The life lesson he is teaching his players, however upsetting it is to them, is much more valuable than the Xs and Os.</p></div>",
  "content_text": "I used to go to Gopher football games back when Tony Dungy was the quarterback. I still remember when they upset Michigan. I couldn’t believe it when they moved their games to that ridiculous Dome. And they haven’t won the Big 10 since before I was born. But if they do, in my lifetime, it wouldn’t surprise me if it was due to the toughness and determination of\ntheir epileptic coach\n:\nImmediately after Jerry Kill has a seizure on the sideline, one longtime assistant takes over the headset and communicates with officials. The defensive coordinator handles the postgame news conference and splits the remaining news media obligations with the offensive coordinator. Should Kill miss practice, they revert to their schedule from a week earlier, with adjustments based on their next opponent.\nAlways, Kill returns soon after to his office at the\nUniversity of Minnesota\n. The assistants come to work and see him at his desk and nod and head to their own offices, not a word exchanged.\nKill, 52, is a reconstruction specialist, an expert in taking over\nfeeble programs and turning them into something better. He is probably\nalso the only college football coach in the country who has a seizure\nprotocol. There is no three-ring binder or written list of step-by-step\ninstructions, only the calm and routine borne from years spent side by\nside with his trusted assistants, as they climbed from the lower levels\nof college football to the Big Ten.\nThree times in the last three seasons, Kill could not finish games\nbecause of epileptic seizures. Each time, thousands witnessed him\nsplayed on the ground, as spasms shot through his limbs and his body\nshook uncontrollably and some of his players cried.\nTalk about the courage of being willing to get up again after being knocked down; this man epitomizes it. The life lesson he is teaching his players, however upsetting it is to them, is much more valuable than the Xs and Os.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-05T12:00:00+00:00"
}