{
  "url": "https://voxday.net/2013/10/02/to-wereseals-and-beyond/",
  "scraped_at": "2025-12-14T22:44:08.675928",
  "title": "To wereseals and beyond",
  "date_display": "October 2, 2013",
  "date_iso": "2013-10-02T17:00:00+00:00",
  "date_from_url": "2013-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I give you <a href=\"http://www.dailymail.co.uk/femail/article-2441470/Taken-T-Rex-ravished-raptor--Is-world-ready-Dinosaur-erotica.html\">the obvious frontrunner</a> for the 2014 Hugo Award!</p><blockquote class=\"tr_bq\"><p> Dinosaur erotica looks set to be the latest niche craze in the world of sexy fiction as a trio of books on the topic is released to buy for the Kindle. The naughty novels, with titles such as <i>Running From The Raptor</i> and <i>Taken by the T-Rex</i> focus on the fantasy of helpless young women being attacked and seduced by dinosaurs.</p><p>The dinosaur porn imagines a world where humans and dinosaurs existed together. For the tale of <i>In the Velociraptor’s Nest</i> the protagonist Azog is a cavewoman, under appreciated in her tribe.</p><p>The synopsis says: ‘The cavemen treat her like a piece a meat. Azog cannot resist unless she proves herself as a hunter. When she goes out in search of fresh meat, she discovers a clutch of baby velociraptors and decides to kill them and triumphantly bring them back to her tribe. That is, until their father shows up and blocks Azog’s way out of the cave. Azog must use all of her womanly wiles to get out of the cave, which includes doing things she had never dreamed of.’</p></blockquote><p>You might think <i>Taken by the T-Rex</i> is unlikely to catch on, let alone win awards. And then, it occurs to you that these are the sort of people who gave an award to McRapey for <i>Redshirts</i>.</p><p>Equality is the reason you can’t have good books.</p></div>",
  "content_text": "I give you\nthe obvious frontrunner\nfor the 2014 Hugo Award!\nDinosaur erotica looks set to be the latest niche craze in the world of sexy fiction as a trio of books on the topic is released to buy for the Kindle. The naughty novels, with titles such as\nRunning From The Raptor\nand\nTaken by the T-Rex\nfocus on the fantasy of helpless young women being attacked and seduced by dinosaurs.\nThe dinosaur porn imagines a world where humans and dinosaurs existed together. For the tale of\nIn the Velociraptor’s Nest\nthe protagonist Azog is a cavewoman, under appreciated in her tribe.\nThe synopsis says: ‘The cavemen treat her like a piece a meat. Azog cannot resist unless she proves herself as a hunter. When she goes out in search of fresh meat, she discovers a clutch of baby velociraptors and decides to kill them and triumphantly bring them back to her tribe. That is, until their father shows up and blocks Azog’s way out of the cave. Azog must use all of her womanly wiles to get out of the cave, which includes doing things she had never dreamed of.’\nYou might think\nTaken by the T-Rex\nis unlikely to catch on, let alone win awards. And then, it occurs to you that these are the sort of people who gave an award to McRapey for\nRedshirts\n.\nEquality is the reason you can’t have good books.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-02T16:00:00+00:00"
}