{
  "url": "https://voxday.net/2013/10/05/tom-clancys-legacy/",
  "scraped_at": "2025-12-14T22:44:23.000771",
  "title": "Tom Clancy’s legacy",
  "date_display": "October 5, 2013",
  "date_iso": "2013-10-05T05:25:00+00:00",
  "date_from_url": "2013-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, this is rather cool. Number two and Number three of the writers named as <a href=\"http://www.toptenz.net/top-10-living-authors-carry-tom-clancys-writing-legacy.php#comments\">the Top 10 Living Authors</a> to cary on Tom Clancy’s legacy of military technothriller happen to be our own Standout Authors Tom Kratman and Larry Corriea:</p><blockquote class=\"tr_bq\"><p> (3) In the world of <a href=\"http://en.wikipedia.org/wiki/Larry_Correia\">Larry Correia</a>,<br> there are werewolves, vampires, and monsters of every shape and size.<br> Why on Earth would Correia’s writing rank so high on a list about<br> spiritual successors to Tom Clancy? The reason is that in Correia’s<br> novels (especially the Monster Hunters series), there is an accuracy<br> demanded in everything that has a human element. The places are real.<br> The guns down to the make, model, and ammunition are real. If there ever<br> was a <a href=\"http://www.toptenz.net/top-10-zombie-costume-ideas.php\" title=\"Top 10 Zombie Costume Ideas\">Zombie Apocalypse</a>,<br> the novels of Larry Correia should be required reading as a field<br> guide. It is that type of accuracy in the real world leading to a<br> confrontation with a fantastic situation that are really the best part<br> of the Tom Clancy experience in novels. In Clancy’s work, there may not<br> necessarily be a renegade sub, but the information about the sub had<br> absolutely better be technically correct. In that aspect, Correia<br> absolutely gets the detail right.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>(2) <a href=\"http://en.wikipedia.org/wiki/Tom_Kratman\">Tom Kratman</a> was a<br> native of Massachusetts. Kratman served with the 101st Airborne<br> division in Panama. Kratman also served with the 5th Special Forces<br> group during the Iraq War. Kratman is also a <a href=\"http://www.toptenz.net/top-10-unusual-lawsuits.php\" title=\"Top 10 Unusual Lawsuits\">lawyer</a><br> in addition to being a militaristic science fiction writer. Kratman<br> often writes in a type of futuristic universe of war based on real<br> principles. If Tom Kratman had written about the Space Marines in the<br> movie <a href=\"http://www.toptenz.net/top-10-worst-movie-monsters.php\" title=\"Top 10 Worst Movie Monsters\">Aliens</a>,<br> he would have probably written a training manual and put the actors<br> through basic training. Kratman will often use futuristic settings to<br> address issues of the day. The difference is that Kratman will often use<br> it to espouse conservative views such as in his Polseen War sidestories<br> of the Legacy of Aldenata series by John Ringo. Try to think of Tom<br> Kratman as kind of an anti-Gene Roddenberry. If Tom Clancy had been born<br> in about 200 years, he would be Tom Kratman.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>  Big shoes? Perhaps. But the feet are pretty big too.</p></div>",
  "content_text": "Now, this is rather cool. Number two and Number three of the writers named as\nthe Top 10 Living Authors\nto cary on Tom Clancy’s legacy of military technothriller happen to be our own Standout Authors Tom Kratman and Larry Corriea:\n(3) In the world of\nLarry Correia\n,\nthere are werewolves, vampires, and monsters of every shape and size.\nWhy on Earth would Correia’s writing rank so high on a list about\nspiritual successors to Tom Clancy? The reason is that in Correia’s\nnovels (especially the Monster Hunters series), there is an accuracy\ndemanded in everything that has a human element. The places are real.\nThe guns down to the make, model, and ammunition are real. If there ever\nwas a\nZombie Apocalypse\n,\nthe novels of Larry Correia should be required reading as a field\nguide. It is that type of accuracy in the real world leading to a\nconfrontation with a fantastic situation that are really the best part\nof the Tom Clancy experience in novels. In Clancy’s work, there may not\nnecessarily be a renegade sub, but the information about the sub had\nabsolutely better be technically correct. In that aspect, Correia\nabsolutely gets the detail right.\n(2)\nTom Kratman\nwas a\nnative of Massachusetts. Kratman served with the 101st Airborne\ndivision in Panama. Kratman also served with the 5th Special Forces\ngroup during the Iraq War. Kratman is also a\nlawyer\nin addition to being a militaristic science fiction writer. Kratman\noften writes in a type of futuristic universe of war based on real\nprinciples. If Tom Kratman had written about the Space Marines in the\nmovie\nAliens\n,\nhe would have probably written a training manual and put the actors\nthrough basic training. Kratman will often use futuristic settings to\naddress issues of the day. The difference is that Kratman will often use\nit to espouse conservative views such as in his Polseen War sidestories\nof the Legacy of Aldenata series by John Ringo. Try to think of Tom\nKratman as kind of an anti-Gene Roddenberry. If Tom Clancy had been born\nin about 200 years, he would be Tom Kratman.\nBig shoes? Perhaps. But the feet are pretty big too.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-05T04:25:00+00:00"
}