{
  "url": "https://voxday.net/2013/10/16/top-10-novels-lis/",
  "scraped_at": "2025-12-15T16:33:54.680772",
  "title": "Top 10 novels list",
  "date_display": "October 16, 2013",
  "date_iso": "2013-10-16T13:00:00+00:00",
  "date_from_url": "2013-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard to distinguish between great novels and great novelists. There are those who are great due to their ability to consistently deliver very good novels, but never write a truly great novel. And then there are those who wrote one great novel and never again approached such heights.  Regardless, in this list, I’m again applying the one book per author rule.</p><p>There are almost certainly books that belong on this list that are not there, but because this is my personal list, only novels that I have read are included.</p><ol><li><i>War and Peace</i>, Leo Tolstoy</li><li><i>Foucault’s Pendulum</i>, Umberto Eco</li><li><i>Crime and Punishment</i>, Fyodor Dostoyevsky</li><li><i>The Tale of Genji</i>, Murasaki Shikibu</li><li><i>The Lord of the Rings</i>, JRR Tolkien</li><li><i>The Glass Bead Game</i>, Herman Hesse</li><li><i>If On a Winter’s Night A Traveler</i>, Italo Calvino</li><li><i>Watership Down</i>, Richard Adams</li><li><i>Brideshead Revisited</i>, Evelyn Waugh</li><li><i>The Code of the Woosters</i>, P.G. Wodehouse</li></ol><p>I understand it is customary to put James Joyce first and I have read three of his books. <i>Ulysses</i>, in particular, is a grand achievement, but it fails in the primary purpose of the novel, which is to entertain. In my opinion, it is a work of great technical virtuosity rather than great literature; to give it pride of place here would be akin to declaring that an extended guitar solo was the greatest rock song.  In contrast, the literary pyrotechnics of Calvino do not substitute for the entertainment aspect, they have the effect of enhancing the reader’s pleasure.</p><p><i>The Tale of Genji</i> is massively underrated in the West, both as entertainment and as a historic literary achievement. It is quite possibly the first true novel and it is the most alien fiction you can possibly read, given the temporal and cultural distance between the reader and the author, an imperial lady-in-waiting of the Heian court circa 995.</p><p>Umberto Eco is fantastic in English, and he’s even more spectacular in Italian. In fact, one of the reasons I learned Italian was so that I could read him in the original. (Always intended to read Hesse in German as well, but I never got to quite that level.) Perhaps my subscription to the conspiracy theory of history is one reason I rate <i>Foucault’s Pendulum</i> so highly, but I stand firmly by my high regard for Eco. Everything he writes is excellent, even the nostalgic, self-indulgent <i>The Mysterious Flame of Queen Loana</i>.</p><p>If there is a theme concerning what I consider greatness in literature, it is the novel’s depth of commentary on the human condition. I value substantive thoughts on this matter much more highly than mere technical prose mastery. Others may disagree, and some will no doubt find my preferences indicative of my own limitations, but of the books on the list, only Calvino, and to a lesser extent, Wodehouse, can be reasonably described as a true masters of style.</p><p>The inclusion of <i>The Code of the Woosters</i> is perhaps the most dubious proposition on the list. I’m including it because Wodehouse delved much more deeply into human psychology than a superficial glance at his light-hearted, endlessly amusing work would indicate, because it is one of the few Wodehouse novels that has some political bite to it, and because humor is far and away the most difficult kind of fiction to pull off. I admit, however, that one could reasonably cite Wodehouse as an example of the great novelist sans a truly great novel. But in my opinion, his only serious rival as the greatest humorous writer in history is Douglas Adams.</p></div>",
  "content_text": "It’s hard to distinguish between great novels and great novelists. There are those who are great due to their ability to consistently deliver very good novels, but never write a truly great novel. And then there are those who wrote one great novel and never again approached such heights.  Regardless, in this list, I’m again applying the one book per author rule.\nThere are almost certainly books that belong on this list that are not there, but because this is my personal list, only novels that I have read are included.\nWar and Peace\n, Leo Tolstoy\nFoucault’s Pendulum\n, Umberto Eco\nCrime and Punishment\n, Fyodor Dostoyevsky\nThe Tale of Genji\n, Murasaki Shikibu\nThe Lord of the Rings\n, JRR Tolkien\nThe Glass Bead Game\n, Herman Hesse\nIf On a Winter’s Night A Traveler\n, Italo Calvino\nWatership Down\n, Richard Adams\nBrideshead Revisited\n, Evelyn Waugh\nThe Code of the Woosters\n, P.G. Wodehouse\nI understand it is customary to put James Joyce first and I have read three of his books.\nUlysses\n, in particular, is a grand achievement, but it fails in the primary purpose of the novel, which is to entertain. In my opinion, it is a work of great technical virtuosity rather than great literature; to give it pride of place here would be akin to declaring that an extended guitar solo was the greatest rock song.  In contrast, the literary pyrotechnics of Calvino do not substitute for the entertainment aspect, they have the effect of enhancing the reader’s pleasure.\nThe Tale of Genji\nis massively underrated in the West, both as entertainment and as a historic literary achievement. It is quite possibly the first true novel and it is the most alien fiction you can possibly read, given the temporal and cultural distance between the reader and the author, an imperial lady-in-waiting of the Heian court circa 995.\nUmberto Eco is fantastic in English, and he’s even more spectacular in Italian. In fact, one of the reasons I learned Italian was so that I could read him in the original. (Always intended to read Hesse in German as well, but I never got to quite that level.) Perhaps my subscription to the conspiracy theory of history is one reason I rate\nFoucault’s Pendulum\nso highly, but I stand firmly by my high regard for Eco. Everything he writes is excellent, even the nostalgic, self-indulgent\nThe Mysterious Flame of Queen Loana\n.\nIf there is a theme concerning what I consider greatness in literature, it is the novel’s depth of commentary on the human condition. I value substantive thoughts on this matter much more highly than mere technical prose mastery. Others may disagree, and some will no doubt find my preferences indicative of my own limitations, but of the books on the list, only Calvino, and to a lesser extent, Wodehouse, can be reasonably described as a true masters of style.\nThe inclusion of\nThe Code of the Woosters\nis perhaps the most dubious proposition on the list. I’m including it because Wodehouse delved much more deeply into human psychology than a superficial glance at his light-hearted, endlessly amusing work would indicate, because it is one of the few Wodehouse novels that has some political bite to it, and because humor is far and away the most difficult kind of fiction to pull off. I admit, however, that one could reasonably cite Wodehouse as an example of the great novelist sans a truly great novel. But in my opinion, his only serious rival as the greatest humorous writer in history is Douglas Adams.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-16T12:00:00+00:00"
}