{
  "url": "https://voxday.net/2013/10/15/top-ten-book-lists/",
  "scraped_at": "2025-12-14T22:45:10.835789",
  "title": "Top 10 SF/F lists",
  "date_display": "October 15, 2013",
  "date_iso": "2013-10-15T10:03:00+00:00",
  "date_from_url": "2013-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ryan and a few others requested lists of my favorite books. You can read <a href=\"http://www.blackgate.com/2011/08/14/the-50-best-sff/\">a top 50 list</a> I put together a few years ago on Black Gate, although it’s limited to SF/F.   But I thought about it a little, and upon further review, I don’t think it makes sense to put science fiction and fantasy on the same list; one might as reasonably compare romance and mystery.  So, here are two top ten lists, one science fiction, one fantasy. I’m limiting myself to one book, not an entire series, and one book per author.</p><p><b>Top 10 Science Fiction novels</b></p><ol><li><i>Dune</i>, Frank Herbert</li><li><i>The Glass Bead Game</i>, Herman Hesse</li><li><i>The Illustrated Man</i>, Ray Bradbury </li><li><i>Count Zero</i>, William Gibson</li><li><i>Anathem</i>, Neal Stephenson </li><li><i>A Canticle for Leibowitz</i>, Walter Miller</li><li><i>Robots of Dawn</i>, Isaac Asimov</li><li><i>Embassytown</i>, China Mieville</li><li><i>Tunnel in the Sky</i>, Robert Heinlein</li><li><i>VALIS</i>, Philip K. Dick</li></ol><p>I suppose can quibble with whether <i>Das Glaspernspiel</i> is truly a science fiction novel or not, but it fits much more comfortably in the SF subgenre than in fantasy or anywhere else. I consider it to be a better and more important book than <i>Dune</i>, but <i>Dune </i>is the best pure science fiction novel and thereby merited the top spot. In the same way, <i>Dandelion Wine</i> is the better book, but <i>The Martin Chronicles</i> are more purely science fiction. As for Heinlein, one could just as easily have put three or four other novels there, from <i>Starship Troopers</i> to <i>Stranger in a Strange Land</i>, but <i>Tunnel in the Sky</i> is the most purely Heinlein at his best, in my opinion. (Although I regard either “The Man Who Sold the Moon” or “The Menace from Earth” as the pinnacles of his fiction.) And while <i>Foundation </i>is Asimov’s best series, I think <i>Robots of Dawn</i> is the best single novel.</p><p><b>Top 10 Fantasy novels</b></p><ol><li><i>The Two Towers</i>, JRR Tolkien</li><li><i>The Lion, The Witch, and the Wardrobe</i>, CS Lewis</li><li><i>Watership Down</i>, Richard Adams</li><li><i>The Dark is Rising</i>, Susan Cooper</li><li><i>A Game of Thrones</i>, George RR Martin</li><li><i>The Book of the Damned</i>, Tanith Lee</li><li><i>The Black Cauldron</i>, Lloyd Alexander</li><li><i>Lord of Light</i>, Roger Zelazny</li><li><i>Night Watch</i>, Terry Pratchett</li><li><i>Interview with the Vampire</i>, Anne Rice</li></ol><p><i>The Two Towers</i> was actually my first exposure to Tolkien, at the age of 10 at a Boy Scout slumber party. While everyone else was running around, I picked up a book belonging to one of the other Scouts and was instantly transfixed. Even after several re-readings, it remains my favorite volume of the trilogy; Gondor and Rohan have always interested me more than Mordor, Rivendell, or the Shire.  Again, <i>Watership Down</i> is a book that many might not consider fantasy proper, but it is an astonishingly great book that is in a class of its own. And the greatness of <i>A Game of Thrones</i> only underlines the disappointment of the way in which the series has plodded steadily downhill. There are a plethora of books I would have preferred to put in the place of <i>Interview with the Vampire</i>, but both the concept and the execution were excellent and only Tolkien has proven more influential over time.</p><p>Not everyone is going to agree with everything on these lists, but if you’re at all interested in the genre, I think you are unlikely to regret reading any of them.  There are obvious omissions too. For example, many writers adore Jack Vance; Tanith Lee’s <i>Tales from the Flat Earth</i> are clearly inspired by Vance’s <i>Tales from the Dying Earth</i>, but despite his inimitable style and enormous influence on the genre, I find that his stories tend to leave me a little bored. I had <i>The Fountains of Paradise</i> by Arthur C. Clarke on the list, but I couldn’t possibly leave off PKD and <i>VALIS </i>is the best of his vast contribution to the field.</p><p>Later this week, I’ll post two more lists, one of the best non-SF/F novels, and one of the books that have most influenced my writing. Needless to say, a number of these books will be on the latter list.</p><p>UPDATE: Speaking of fiction, I belatedly noticed that Amazon is giving away free copies of <a href=\"http://www.amazon.com/The-Last-Witchking-Vox-Day-ebook/dp/B00CLTSKZU\">The Last Witchking</a> today.</p></div>",
  "content_text": "Ryan and a few others requested lists of my favorite books. You can read\na top 50 list\nI put together a few years ago on Black Gate, although it’s limited to SF/F.   But I thought about it a little, and upon further review, I don’t think it makes sense to put science fiction and fantasy on the same list; one might as reasonably compare romance and mystery.  So, here are two top ten lists, one science fiction, one fantasy. I’m limiting myself to one book, not an entire series, and one book per author.\nTop 10 Science Fiction novels\nDune\n, Frank Herbert\nThe Glass Bead Game\n, Herman Hesse\nThe Illustrated Man\n, Ray Bradbury\nCount Zero\n, William Gibson\nAnathem\n, Neal Stephenson\nA Canticle for Leibowitz\n, Walter Miller\nRobots of Dawn\n, Isaac Asimov\nEmbassytown\n, China Mieville\nTunnel in the Sky\n, Robert Heinlein\nVALIS\n, Philip K. Dick\nI suppose can quibble with whether\nDas Glaspernspiel\nis truly a science fiction novel or not, but it fits much more comfortably in the SF subgenre than in fantasy or anywhere else. I consider it to be a better and more important book than\nDune\n, but\nDune\nis the best pure science fiction novel and thereby merited the top spot. In the same way,\nDandelion Wine\nis the better book, but\nThe Martin Chronicles\nare more purely science fiction. As for Heinlein, one could just as easily have put three or four other novels there, from\nStarship Troopers\nto\nStranger in a Strange Land\n, but\nTunnel in the Sky\nis the most purely Heinlein at his best, in my opinion. (Although I regard either “The Man Who Sold the Moon” or “The Menace from Earth” as the pinnacles of his fiction.) And while\nFoundation\nis Asimov’s best series, I think\nRobots of Dawn\nis the best single novel.\nTop 10 Fantasy novels\nThe Two Towers\n, JRR Tolkien\nThe Lion, The Witch, and the Wardrobe\n, CS Lewis\nWatership Down\n, Richard Adams\nThe Dark is Rising\n, Susan Cooper\nA Game of Thrones\n, George RR Martin\nThe Book of the Damned\n, Tanith Lee\nThe Black Cauldron\n, Lloyd Alexander\nLord of Light\n, Roger Zelazny\nNight Watch\n, Terry Pratchett\nInterview with the Vampire\n, Anne Rice\nThe Two Towers\nwas actually my first exposure to Tolkien, at the age of 10 at a Boy Scout slumber party. While everyone else was running around, I picked up a book belonging to one of the other Scouts and was instantly transfixed. Even after several re-readings, it remains my favorite volume of the trilogy; Gondor and Rohan have always interested me more than Mordor, Rivendell, or the Shire.  Again,\nWatership Down\nis a book that many might not consider fantasy proper, but it is an astonishingly great book that is in a class of its own. And the greatness of\nA Game of Thrones\nonly underlines the disappointment of the way in which the series has plodded steadily downhill. There are a plethora of books I would have preferred to put in the place of\nInterview with the Vampire\n, but both the concept and the execution were excellent and only Tolkien has proven more influential over time.\nNot everyone is going to agree with everything on these lists, but if you’re at all interested in the genre, I think you are unlikely to regret reading any of them.  There are obvious omissions too. For example, many writers adore Jack Vance; Tanith Lee’s\nTales from the Flat Earth\nare clearly inspired by Vance’s\nTales from the Dying Earth\n, but despite his inimitable style and enormous influence on the genre, I find that his stories tend to leave me a little bored. I had\nThe Fountains of Paradise\nby Arthur C. Clarke on the list, but I couldn’t possibly leave off PKD and\nVALIS\nis the best of his vast contribution to the field.\nLater this week, I’ll post two more lists, one of the best non-SF/F novels, and one of the books that have most influenced my writing. Needless to say, a number of these books will be on the latter list.\nUPDATE: Speaking of fiction, I belatedly noticed that Amazon is giving away free copies of\nThe Last Witchking\ntoday.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-15T09:03:00+00:00"
}