{
  "url": "https://voxday.net/2013/10/16/what-not-to-do-when-girl-hits-you/",
  "scraped_at": "2025-12-14T22:45:21.184930",
  "title": "What not to do when a girl hits you",
  "date_display": "October 16, 2013",
  "date_iso": "2013-10-16T17:00:00+00:00",
  "date_from_url": "2013-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One Marine provides a very good example of where sweet reason and physical passivity in the face of female force <a href=\"http://goodmenproject.com/featured-content/brand-what-do-you-do-when-a-girl-hits-you/\">will lead a man</a>:</p><blockquote class=\"tr_bq\"><p> She<br> kicked my head into the solid wood base. I blacked out, came to, stood<br> up, bleeding. My daughter was screaming, “Stop hurting daddy!”</br></br></p><p>It<br> was over. We were over. I headed out the door to the police and then<br> the hospital. My daughter stopped me. “Daddy, you need to go to a<br> doctor, here take this,” she handed me a bandage. “I love you” was the<br> last thing I said to her. It’s been almost a month….</br></br></br></br></p><p>An hour later I was handcuffed to a hospital bed waiting for CAT scan<br> results to know if my head was bleeding.</br></p></blockquote><p>I’ve shared my thoughts on a more effective strategy <a href=\"http://alphagameplan.blogspot.com/2013/10/what-to-do-when-girl-hits-you.html\">at Alpha Game</a>. When faced with repeated and abject failure, apply The Theory of Game. What do the naturals do? And in cases such as these, exactly who are the naturals?</p></div>",
  "content_text": "One Marine provides a very good example of where sweet reason and physical passivity in the face of female force\nwill lead a man\n:\nShe\nkicked my head into the solid wood base. I blacked out, came to, stood\nup, bleeding. My daughter was screaming, “Stop hurting daddy!”\nIt\nwas over. We were over. I headed out the door to the police and then\nthe hospital. My daughter stopped me. “Daddy, you need to go to a\ndoctor, here take this,” she handed me a bandage. “I love you” was the\nlast thing I said to her. It’s been almost a month….\nAn hour later I was handcuffed to a hospital bed waiting for CAT scan\nresults to know if my head was bleeding.\nI’ve shared my thoughts on a more effective strategy\nat Alpha Game\n. When faced with repeated and abject failure, apply The Theory of Game. What do the naturals do? And in cases such as these, exactly who are the naturals?",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-10-16T16:00:00+00:00"
}