{
  "url": "https://voxday.net/2005/12/06/blogfodder-of-pagan-antiquity/",
  "scraped_at": "2026-01-08T20:52:04.152582",
  "title": "Blogfodder: of pagan antiquity",
  "date_display": "December 6, 2005",
  "date_iso": "2005-12-06T09:34:00+00:00",
  "date_from_url": "2005-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wild Hunt <a href=\"http://www.wildhunt.org/2005/12/pro-rape-pagans-worldnetdaily-has-just.html\">goes off on a strange hunt</a> indeed:</p><blockquote><p>The strange thing about his thesis (besides the sheer ignorant asinine horror of it all) is that he displays absolutely no understanding of how myth and stories work in culture, and how that differs from texts of law or religious doctrine. Since a Roman founding story features rape, and since Greek gods raped in myth it must mean that people from that time found no moral quandary with actual rape. This immense lack in understanding allows the author to make sweeping judgments about thousands of years of history and culture….</p><p>No ancient culture has their hands clean in this matter, and to single out Christianity for special moral praise is to blur and confuse the actual history of Christianity and rape in ancient societies. Morality didn’t spring whole-cloth from the Bible and anyone versed in history would know that. Rape is a horror and all right-thinking modern religions and cultures condemn it, to try and twist history and facts to suit your religious moralistic viewpoint and to in turn damn all other religious cultures is petty and small-minded.</p></blockquote><p>I’m curious to know how Wildhunt thinks I’ve tried to “twist history and facts”.  First, a column is not an academic treatise; as it stood, I more than doubled the usual column length in order to present more than naked assertions.  The fact that the column is not an encyclopedia does not mean that there is not a plethora of evidence supporting my case, however.</p><p>Another blogger mentioned another Roman founding myth, <a href=\"http://www.wsu.edu:8080/~dee/ROME/RAPE.HTM\">the Rape of Lucretia</a> by Lucius Tarquinius Superbus, the last King, as evidence that rape was morally condemned by Romans, the celebrated Rape of the Sabine Women notwithstanding.  Of course, the response was violent, not jurisprudent, the myth centers around a political power struggle, and Lucretia, despite her rape, killed herself as a future example to unchaste women.  And the mythomoralists complain that I’m prone blaming the victim?</p><p>(I should perhaps note that I was not unfamiliar with Livy prior to writing this week’s column, indeed, Big Chilly’s bird I accidentally killed at the Digital Ghetto was named Lucretia, although we tended to view it more as an homage to the Borgia.)</p><p>As for Wildhunt’s suggestion with regards to legal, as mythical resources, rape is primarily conspicuous by its absence from the Roman legal system.  Despite a vast panoply of laws which govern everything from divorce to women’s adornment, the only law specifically dedicated to rape I’ve seen is from the Codex Justinian, which is three hundred years post-Republic and says:</p><p><em>Foedissimam earum nequitiam, quae pudorem suum alienis libidinibus prosternunt, non etiam earum, quae per vim stupro comprehensae sunt, inreprehensam voluntatem leges ulciscuntur, quando etiam inviolatae existimationis esse nec nuptiis earum aliis interdici merito placuit.</em> – <a href=\"http://www.gmu.edu/departments/fld/CLASSICS/codex9.html\">CJ.9.9.20</a>: Imperatores Diocletianus, Maximianus</p><p>Translated: “The laws punish the detestable wickedness of women who prostitute their chastity to the lusts of others, but do not hold those liable who are violated by force and against their will. And, moreover, it has very properly been decided that their reputations are not lost, and that their marriage with others should not be prohibited on this account.”</p><p>In other words, Imperial Roman law did not state that rape was a crime, only that being raped was not a crime.  As for another famous legal system, the Code of Hammurabi, it echoes the Republican <em>lex Plautia de vi</em> and the Caesarian <em> lex Julia de vi publica</em> in focusing on the damage to the father/husband’s property.</p><p><em>If a man violate the wife (betrothed or child-wife) of another man, who has never known a man, and still lives in her father’s house, and sleep with her and be surprised, this man shall be put to death, but the wife is blameless.</em> –  Hammurabi 130.</p><p><em>If a man betroth a girl to his son, but his son has not known her, and if then he defile her, he shall pay her half a gold mina, and compensate her for all that she brought out of her father’s house. She may marry the man of her heart.</em> – Hammurabi 156.</p><p>Stealing a woman’s virginity was therefore illegal, but Hammurabi’s law says nothing about forcing an unwilling, unchaste woman.  As for the Celtic example cited, one has to question the application of a single legal code to define the morality of a people as broadly scattered as the Celts, particularly a people with sacred myths described by Wildhunt’s source in this way: <em>goddesses in [Celtic] literature were often raped, died in childbirth and their status was destroyed by the symbolism of the rape. The goddesses, however, gave birth to great men who would in turn become great warriors.</em></p><p>That does not strike me as an anti-rape culture, particularly when Wildhunt’s source adds: <em>” Evidence also points to the cruel treatment of women during this particularly violent time. They were often raped by course warriors, starved, and basically used as bait.”</em></p><p>To argue, as Wildhunt does, that rape was a serious violation of ancient moral codes appears to be manifestly absurd based on much of the very evidence he claims was missing from Monday’s column.  And I have not even begun to elucidate the pagan systems of temple prostitution, to which every woman was forced to submit in some ancient cities, or some of the more notorious religious rites of Cybella and other pagan gods.</p><p>Finally, I note that <a href=\"http://www.nytimes.com/2005/12/06/international/asia/06highway.html?hp&amp;ex=1133931600&amp;en=7c2766eb1e1a3d7a&amp;ei=5094&amp;partner=homepage\">today’s New York Times offers a glimpse</a> into a modern pagan view of the need for sexual consent: <em>Devadasis – poor, lower-caste women consecrated to gods as young girls and then consigned to prostitution – live in the south.</em></p></div>",
  "content_text": "Wild Hunt\ngoes off on a strange hunt\nindeed:\nThe strange thing about his thesis (besides the sheer ignorant asinine horror of it all) is that he displays absolutely no understanding of how myth and stories work in culture, and how that differs from texts of law or religious doctrine. Since a Roman founding story features rape, and since Greek gods raped in myth it must mean that people from that time found no moral quandary with actual rape. This immense lack in understanding allows the author to make sweeping judgments about thousands of years of history and culture….\nNo ancient culture has their hands clean in this matter, and to single out Christianity for special moral praise is to blur and confuse the actual history of Christianity and rape in ancient societies. Morality didn’t spring whole-cloth from the Bible and anyone versed in history would know that. Rape is a horror and all right-thinking modern religions and cultures condemn it, to try and twist history and facts to suit your religious moralistic viewpoint and to in turn damn all other religious cultures is petty and small-minded.\nI’m curious to know how Wildhunt thinks I’ve tried to “twist history and facts”.  First, a column is not an academic treatise; as it stood, I more than doubled the usual column length in order to present more than naked assertions.  The fact that the column is not an encyclopedia does not mean that there is not a plethora of evidence supporting my case, however.\nAnother blogger mentioned another Roman founding myth,\nthe Rape of Lucretia\nby Lucius Tarquinius Superbus, the last King, as evidence that rape was morally condemned by Romans, the celebrated Rape of the Sabine Women notwithstanding.  Of course, the response was violent, not jurisprudent, the myth centers around a political power struggle, and Lucretia, despite her rape, killed herself as a future example to unchaste women.  And the mythomoralists complain that I’m prone blaming the victim?\n(I should perhaps note that I was not unfamiliar with Livy prior to writing this week’s column, indeed, Big Chilly’s bird I accidentally killed at the Digital Ghetto was named Lucretia, although we tended to view it more as an homage to the Borgia.)\nAs for Wildhunt’s suggestion with regards to legal, as mythical resources, rape is primarily conspicuous by its absence from the Roman legal system.  Despite a vast panoply of laws which govern everything from divorce to women’s adornment, the only law specifically dedicated to rape I’ve seen is from the Codex Justinian, which is three hundred years post-Republic and says:\nFoedissimam earum nequitiam, quae pudorem suum alienis libidinibus prosternunt, non etiam earum, quae per vim stupro comprehensae sunt, inreprehensam voluntatem leges ulciscuntur, quando etiam inviolatae existimationis esse nec nuptiis earum aliis interdici merito placuit.\n–\nCJ.9.9.20\n: Imperatores Diocletianus, Maximianus\nTranslated: “The laws punish the detestable wickedness of women who prostitute their chastity to the lusts of others, but do not hold those liable who are violated by force and against their will. And, moreover, it has very properly been decided that their reputations are not lost, and that their marriage with others should not be prohibited on this account.”\nIn other words, Imperial Roman law did not state that rape was a crime, only that being raped was not a crime.  As for another famous legal system, the Code of Hammurabi, it echoes the Republican\nlex Plautia de vi\nand the Caesarian\nlex Julia de vi publica\nin focusing on the damage to the father/husband’s property.\nIf a man violate the wife (betrothed or child-wife) of another man, who has never known a man, and still lives in her father’s house, and sleep with her and be surprised, this man shall be put to death, but the wife is blameless.\n–  Hammurabi 130.\nIf a man betroth a girl to his son, but his son has not known her, and if then he defile her, he shall pay her half a gold mina, and compensate her for all that she brought out of her father’s house. She may marry the man of her heart.\n– Hammurabi 156.\nStealing a woman’s virginity was therefore illegal, but Hammurabi’s law says nothing about forcing an unwilling, unchaste woman.  As for the Celtic example cited, one has to question the application of a single legal code to define the morality of a people as broadly scattered as the Celts, particularly a people with sacred myths described by Wildhunt’s source in this way:\ngoddesses in [Celtic] literature were often raped, died in childbirth and their status was destroyed by the symbolism of the rape. The goddesses, however, gave birth to great men who would in turn become great warriors.\nThat does not strike me as an anti-rape culture, particularly when Wildhunt’s source adds:\n” Evidence also points to the cruel treatment of women during this particularly violent time. They were often raped by course warriors, starved, and basically used as bait.”\nTo argue, as Wildhunt does, that rape was a serious violation of ancient moral codes appears to be manifestly absurd based on much of the very evidence he claims was missing from Monday’s column.  And I have not even begun to elucidate the pagan systems of temple prostitution, to which every woman was forced to submit in some ancient cities, or some of the more notorious religious rites of Cybella and other pagan gods.\nFinally, I note that\ntoday’s New York Times offers a glimpse\ninto a modern pagan view of the need for sexual consent:\nDevadasis – poor, lower-caste women consecrated to gods as young girls and then consigned to prostitution – live in the south.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-06T09:34:00+00:00"
}