{
  "url": "https://voxday.net/2005/12/14/broken-clock-rule/",
  "scraped_at": "2026-01-08T20:52:56.534787",
  "title": "The broken-clock rule",
  "date_display": "December 14, 2005",
  "date_iso": "2005-12-14T12:18:00+00:00",
  "date_from_url": "2005-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mahmoud Ahmadinejad <a href=\"http://www.breitbart.com/news/2005/12/14/051214075349.kfyauqdq.html\">proves it</a>:</p><blockquote><p>“If somebody in their country questions God, nobody says anything, but if somebody criticises the myth of the massacre of Jew, the Zionist loudspeakers and the governments in the pay of Zionism will start to scream,” he said.</p></blockquote><p>It’s difficult to argue with the Iranian President on that one, especially considering how you will find yourself in jail in many European countries should you dare to even question the Worstest, Mostest Terriblest Evil Past, Present or Future.  Can you even imagine how the world media would go completely and utterly frothing-at-the-mouth insane if the Belgians started jailing people for denying the existence of God or questioning the Resurrection of Jesus Christ?</p><p>The Holocaust is no myth; that the Endloesung was enacted and that Jews were slaughtered en masse by the National Socialists and their puppet governments, I have no doubt.  But I have to admit, I’ve never seen a single piece of evidence for the 6 million figure, which seems strange to me given the German predilection for copious record-keeping.  According to Robert Wistrich’s <em>Hitler and the Holocaust</em>, France had the largest Jewish population in Western Europe, 195,000; this would seem to conflict with his earlier statement that there were 500,000 Jews in pre-war Germany.  Wistrich reports enough Jews to make up the difference in Poland and the Soviet Union, 6.5 million in all according to him, but one would think that the German death camp records would be much more trustworthy than those belonging to the fragmented and twice-conquered Poles or the secretive Soviets.  Perhaps the death camp records do show this; I don’t know, never having reviewed them or having read anyone who has.</p><p>Given that the National Socialists had killed 90,000 ethnic Germans with disabilities as a warmup to the 1941 Final Solution, the Judeocentric Holocaust version that is generally taught seems to somewhat miss the point of National Socialist evil, and even could be seen to excuse aspects of it while simultaneously lessening by comparison the evil of other, more lethal historical butchers.</p><p>To argue that the Holocaust was particularly evil because it targeted Jews is to argue that human beings are of variable worth; this notion is ironically harmonious with the National Socialist concept of Aryan supremacy, one is merely quibbling over the appropriate values to assign the variables.  The Holocaust was not the first attempt to exterminate an ethnic group – see the Arminians in Turkey – nor the first attempt to exterminate a religion – see Nero.</p><p>All that being said, it can’t be a good sign that this gentleman is likely to have nuclear-tipped missiles at his command in the near future.  The problem with his relocation idea, of course, is that with French and Dutch Muslims doing their best to set up a Parisian caliphate, moving Israel to Europe is simply recreating the original problem.</p></div>",
  "content_text": "Mahmoud Ahmadinejad\nproves it\n:\n“If somebody in their country questions God, nobody says anything, but if somebody criticises the myth of the massacre of Jew, the Zionist loudspeakers and the governments in the pay of Zionism will start to scream,” he said.\nIt’s difficult to argue with the Iranian President on that one, especially considering how you will find yourself in jail in many European countries should you dare to even question the Worstest, Mostest Terriblest Evil Past, Present or Future.  Can you even imagine how the world media would go completely and utterly frothing-at-the-mouth insane if the Belgians started jailing people for denying the existence of God or questioning the Resurrection of Jesus Christ?\nThe Holocaust is no myth; that the Endloesung was enacted and that Jews were slaughtered en masse by the National Socialists and their puppet governments, I have no doubt.  But I have to admit, I’ve never seen a single piece of evidence for the 6 million figure, which seems strange to me given the German predilection for copious record-keeping.  According to Robert Wistrich’s\nHitler and the Holocaust\n, France had the largest Jewish population in Western Europe, 195,000; this would seem to conflict with his earlier statement that there were 500,000 Jews in pre-war Germany.  Wistrich reports enough Jews to make up the difference in Poland and the Soviet Union, 6.5 million in all according to him, but one would think that the German death camp records would be much more trustworthy than those belonging to the fragmented and twice-conquered Poles or the secretive Soviets.  Perhaps the death camp records do show this; I don’t know, never having reviewed them or having read anyone who has.\nGiven that the National Socialists had killed 90,000 ethnic Germans with disabilities as a warmup to the 1941 Final Solution, the Judeocentric Holocaust version that is generally taught seems to somewhat miss the point of National Socialist evil, and even could be seen to excuse aspects of it while simultaneously lessening by comparison the evil of other, more lethal historical butchers.\nTo argue that the Holocaust was particularly evil because it targeted Jews is to argue that human beings are of variable worth; this notion is ironically harmonious with the National Socialist concept of Aryan supremacy, one is merely quibbling over the appropriate values to assign the variables.  The Holocaust was not the first attempt to exterminate an ethnic group – see the Arminians in Turkey – nor the first attempt to exterminate a religion – see Nero.\nAll that being said, it can’t be a good sign that this gentleman is likely to have nuclear-tipped missiles at his command in the near future.  The problem with his relocation idea, of course, is that with French and Dutch Muslims doing their best to set up a Parisian caliphate, moving Israel to Europe is simply recreating the original problem.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-14T12:18:00+00:00"
}