{
  "url": "https://voxday.net/2005/12/04/equalitarian-wave-begins-to-subside/",
  "scraped_at": "2026-01-08T20:51:42.810009",
  "title": "The Equalitarian wave begins to subside",
  "date_display": "December 4, 2005",
  "date_iso": "2005-12-04T08:12:00+00:00",
  "date_from_url": "2005-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>In baby-strapped Italy, politicians are <a href=\"http://newpaper.asia1.com.sg/news/story/0,4136,98309,00.html\">proposing that women be paid not to have abortions</a>.  The scheme – put forward by the left – comes at a time when the Roman Catholic church is urging a rethink of the country’s 1978 abortion law, reported The Guardian. It allows abortion on demand in the first 12 weeks of pregnancy.</p><p>Last year a majority of MPs from across all parties succeeded in bringing in a law on assisted fertilisation that gave embryos full rights from the point of conception. This could affect the abortion law.</p><p>With a general election due in four months, both sides are keen to woo the decisive Catholic vote.  Under the scheme, women with financial problems would get between 250 euro ($495) and 350 euro a month for up to six months before giving birth.</p><p>The plan is outlined in a proposed amendment to next year’s budget, which is sponsored by a group of MPs that includes two women ex-ministers.  This move is the latest development in a rising controversy over abortion in Italy.</p><p>The language issuing from the Vatican has grown stronger in recent weeks with one cardinal describing abortion as ‘the worst kind of murder’.</p><p>On Wednesday, a parliamentary committee gave the go-ahead for a commission of inquiry into the law, which was passed at a time when the feminist lobby in Italy was stronger and more active than today.   One reason for the latest initiative gathering support is that it addresses Italy’s failure to produce enough children.</p></blockquote><p>Feminism has been a complete disaster for Italy.  You have only to walk through the ghost towns, or through the piazzas of the surviving villages to see the preponderance of old people and the haunting absence of children.  Feminism still threatens to accomplish what waves of Islamic invasion, Byzantine power struggles, Viking conquest, internecine war on the peninsula and French dynastic pretensions could not do, namely, eliminate one of this planet’s great cultures.</p><p>I don’t normally look approvingly on government intervention, but the concept of limited government in Italy is simply outside the range of the political discussion there.  If they want to restore their birth rate, they’d do better to lower taxes – Italians only have one child because they have to dress it in <em>un modo bello</em> – put restrictions on birth control and ban abortion entirely.</p><p>Some might suggest attempting to keep women out of the workforce, (actually, they could keep most of the men out too, it’s not like most of them are spending much time doing what an American would call working), because then you wouldn’t have the requisite four or five women in short black skirts collectively serving as what passes for a receptionist.</p><p>Don’t get me wrong, I very much enjoy the Italian approach to business, it just drives me up the wall sometimes.  I once met a friend for a coffee at 11; I didn’t get back until almost five.  Lunch itself lasted more than two hours and two bottles of wine; on the way back to the office, we ran into the Milanese with whom my friend was meeting who insisted that hitting a bar for drinks were the first order of the day.  As the friend of a friend, I was naturally greeted as a friend and was expected to accompany them all… hey, when in Rome….</p></div>",
  "content_text": "In baby-strapped Italy, politicians are\nproposing that women be paid not to have abortions\n.  The scheme – put forward by the left – comes at a time when the Roman Catholic church is urging a rethink of the country’s 1978 abortion law, reported The Guardian. It allows abortion on demand in the first 12 weeks of pregnancy.\nLast year a majority of MPs from across all parties succeeded in bringing in a law on assisted fertilisation that gave embryos full rights from the point of conception. This could affect the abortion law.\nWith a general election due in four months, both sides are keen to woo the decisive Catholic vote.  Under the scheme, women with financial problems would get between 250 euro ($495) and 350 euro a month for up to six months before giving birth.\nThe plan is outlined in a proposed amendment to next year’s budget, which is sponsored by a group of MPs that includes two women ex-ministers.  This move is the latest development in a rising controversy over abortion in Italy.\nThe language issuing from the Vatican has grown stronger in recent weeks with one cardinal describing abortion as ‘the worst kind of murder’.\nOn Wednesday, a parliamentary committee gave the go-ahead for a commission of inquiry into the law, which was passed at a time when the feminist lobby in Italy was stronger and more active than today.   One reason for the latest initiative gathering support is that it addresses Italy’s failure to produce enough children.\nFeminism has been a complete disaster for Italy.  You have only to walk through the ghost towns, or through the piazzas of the surviving villages to see the preponderance of old people and the haunting absence of children.  Feminism still threatens to accomplish what waves of Islamic invasion, Byzantine power struggles, Viking conquest, internecine war on the peninsula and French dynastic pretensions could not do, namely, eliminate one of this planet’s great cultures.\nI don’t normally look approvingly on government intervention, but the concept of limited government in Italy is simply outside the range of the political discussion there.  If they want to restore their birth rate, they’d do better to lower taxes – Italians only have one child because they have to dress it in\nun modo bello\n– put restrictions on birth control and ban abortion entirely.\nSome might suggest attempting to keep women out of the workforce, (actually, they could keep most of the men out too, it’s not like most of them are spending much time doing what an American would call working), because then you wouldn’t have the requisite four or five women in short black skirts collectively serving as what passes for a receptionist.\nDon’t get me wrong, I very much enjoy the Italian approach to business, it just drives me up the wall sometimes.  I once met a friend for a coffee at 11; I didn’t get back until almost five.  Lunch itself lasted more than two hours and two bottles of wine; on the way back to the office, we ran into the Milanese with whom my friend was meeting who insisted that hitting a bar for drinks were the first order of the day.  As the friend of a friend, I was naturally greeted as a friend and was expected to accompany them all… hey, when in Rome….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-04T08:12:00+00:00"
}