{
  "url": "https://voxday.net/2005/12/04/good-theater/",
  "scraped_at": "2026-01-08T20:51:45.850580",
  "title": "Good theater",
  "date_display": "December 4, 2005",
  "date_iso": "2005-12-04T13:31:00+00:00",
  "date_from_url": "2005-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>She’ll probably be appalled that I linked to her, but Bellatrys <a href=\"http://www.livejournal.com/users/bellatrys/196021.html#cutid1\">has some interesting commentary on a relatively obscure play</a> by Thomas Ortway called “Venice Preserv’d”.  As I’m a great fan of Venice and used to be somewhat of a theater buff before it went All Gay All The Time – back when I had season tickets, the Guthrie had a fantastic season that I still remember fondly – I found her post to be well worth the reading:</p><blockquote><p>This obscure Restoration play by the tragic Thomas Otway (who just about embodies every cliche of the Great Romantic Artist you can think of, no less than the Byron-Shelley-Keats crew of a hundred-plus years later) is something I’d never encountered until I dowsed up a book of Restoration Drama at the secondhand store and found it there.</p><p>Whereupon I could instantly see why it was both a) obscure, and b) popular whenever it was put on. It’s a strange play, and you can see why – if it’s typical of Otway’s work – that he never attained the role of guys like Congreve or Dryden in the Canon of English lit. He’s just too bloody weird. It’s not exactly realism that he’s doing, any more than Puccini’s Tosca or La Boheme are “realistic” – but it’s a damn sight closer to naturalism-in-art than the highly ritualized and poetry-for-poetry’s sake Tragedy of Dryden’s All For Love, the classic neoclassical Shakespeare fanfic rewrite of Antony and Cleopatra.</p></blockquote></div>",
  "content_text": "She’ll probably be appalled that I linked to her, but Bellatrys\nhas some interesting commentary on a relatively obscure play\nby Thomas Ortway called “Venice Preserv’d”.  As I’m a great fan of Venice and used to be somewhat of a theater buff before it went All Gay All The Time – back when I had season tickets, the Guthrie had a fantastic season that I still remember fondly – I found her post to be well worth the reading:\nThis obscure Restoration play by the tragic Thomas Otway (who just about embodies every cliche of the Great Romantic Artist you can think of, no less than the Byron-Shelley-Keats crew of a hundred-plus years later) is something I’d never encountered until I dowsed up a book of Restoration Drama at the secondhand store and found it there.\nWhereupon I could instantly see why it was both a) obscure, and b) popular whenever it was put on. It’s a strange play, and you can see why – if it’s typical of Otway’s work – that he never attained the role of guys like Congreve or Dryden in the Canon of English lit. He’s just too bloody weird. It’s not exactly realism that he’s doing, any more than Puccini’s Tosca or La Boheme are “realistic” – but it’s a damn sight closer to naturalism-in-art than the highly ritualized and poetry-for-poetry’s sake Tragedy of Dryden’s All For Love, the classic neoclassical Shakespeare fanfic rewrite of Antony and Cleopatra.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-04T13:31:00+00:00"
}