{
  "url": "https://voxday.net/2005/12/02/istanbul-to-constantinople/",
  "scraped_at": "2026-01-08T20:51:33.856569",
  "title": "Istanbul to Constantinople",
  "date_display": "December 2, 2005",
  "date_iso": "2005-12-02T11:16:00+00:00",
  "date_from_url": "2005-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gaultslue <a href=\"http://gaultslue.blogspot.com/2005/11/jane-stephanie-you-ignorant-slut.html\">confesses to listening to Stephanie Miller</a>:</p><blockquote><p>“… And I think Donald Rumsfeld is inventing new words. When he said, “I was thinking about it this weekend and there’s no reason they should be called “insurgents”, I mean it’s not like their trying to create a Caliphate over there.” Caliphate, Don? What’ s exactly is a Caliph or Caliphate?”</p></blockquote><p>When I read this, my second thought after cracking up was: who in the world is Stephanie Miller and why does that name ring a bell?  And then I remembered, she was the woman from Air America who was reading “dating tips from a skinhead” a few months back and theorizing that I live in my parent’s basement.  This sort of thing never ceases to amaze me; despite all the copious evidence to the contrary, the Stephanie Millers of the world truly believe themselves to be more intelligent and more educated than those they criticize, while simultaneously referring to themselves “the reality based community”.</p><p>Fraters, by all means set up that undercard!</p><p>And as long as we’re on the topic of left-wing historical ignorance, here’s <a href=\"http://phoenixwoman.blogspot.com/2005/11/manliness.html\">a nice example from Mecury Rising</a>:</p><blockquote><p>Now, [“Vox Day”]isn’t just a sexist dork. He’s also an anti-Semitic dork. He used to be employed as a techie/gaming columnist for the St. Paul Pioneer Press until he got booted for being an anti-Semitic pig in print. His daddy, who is one of the guys behind the vile right-wing electronic hate crime known as World Net Daily, is apparently rich enough for [Vox] to never have to learn from his mistakes. He’s a Pretend Man.</p></blockquote><p>As I am not anti-semitic, it should surprise no one that I have never been “booted” from any newspaper, much less for being an “anti-Semitic pig in print”.  But don’t take my word for it; readers are certainly welcome to <a href=\"http://www.voxday.net/archive/2002/073002.html\">peruse my virulent <em>Judenhassend</em> prose</a> in my column archive.  After all, who but a Jew-hater would dare to title a column <a href=\"http://www.voxday.net/archive/2005/082205.html\">“Throw the Jew Down the Well”?</a> It is true, however, that Dad doesn’t do so bad for a farm boy.  His basement is not only bigger than Stephanie Miller’s entire house, but I’m reasonably sure it has more jacuzzis.</p><p>In keeping with the strange cognitive incapacity of my critics, I find myself curious about Newshog’s reasoning here:</p><blockquote><p>Feministe has a post on what she describes as the most disgusting thing she has ever read. Conservative blogger Vox Day gets into her comments with the opinion that “Being raped doesn’t confer some mystical moral superiority on a woman, it just makes her a victim. And unfortunately, in all too many cases, it just makes her a stupid one.” Honest, that’s what he said! Talk about sociopathic.</p></blockquote><p>So, is Newshog saying that being raped doesn’t make a women a victim?  Or is he arguing that being raped does confer mystical moral superiority on a woman?  Is it possible that he possesses statistical information of which I have hitherto been unaware regarding the little-known correlation between Mensa status and rape victimhood?  I’m more than a little curious here.</p></div>",
  "content_text": "Gaultslue\nconfesses to listening to Stephanie Miller\n:\n“… And I think Donald Rumsfeld is inventing new words. When he said, “I was thinking about it this weekend and there’s no reason they should be called “insurgents”, I mean it’s not like their trying to create a Caliphate over there.” Caliphate, Don? What’ s exactly is a Caliph or Caliphate?”\nWhen I read this, my second thought after cracking up was: who in the world is Stephanie Miller and why does that name ring a bell?  And then I remembered, she was the woman from Air America who was reading “dating tips from a skinhead” a few months back and theorizing that I live in my parent’s basement.  This sort of thing never ceases to amaze me; despite all the copious evidence to the contrary, the Stephanie Millers of the world truly believe themselves to be more intelligent and more educated than those they criticize, while simultaneously referring to themselves “the reality based community”.\nFraters, by all means set up that undercard!\nAnd as long as we’re on the topic of left-wing historical ignorance, here’s\na nice example from Mecury Rising\n:\nNow, [“Vox Day”]isn’t just a sexist dork. He’s also an anti-Semitic dork. He used to be employed as a techie/gaming columnist for the St. Paul Pioneer Press until he got booted for being an anti-Semitic pig in print. His daddy, who is one of the guys behind the vile right-wing electronic hate crime known as World Net Daily, is apparently rich enough for [Vox] to never have to learn from his mistakes. He’s a Pretend Man.\nAs I am not anti-semitic, it should surprise no one that I have never been “booted” from any newspaper, much less for being an “anti-Semitic pig in print”.  But don’t take my word for it; readers are certainly welcome to\nperuse my virulent\nJudenhassend\nprose\nin my column archive.  After all, who but a Jew-hater would dare to title a column\n“Throw the Jew Down the Well”?\nIt is true, however, that Dad doesn’t do so bad for a farm boy.  His basement is not only bigger than Stephanie Miller’s entire house, but I’m reasonably sure it has more jacuzzis.\nIn keeping with the strange cognitive incapacity of my critics, I find myself curious about Newshog’s reasoning here:\nFeministe has a post on what she describes as the most disgusting thing she has ever read. Conservative blogger Vox Day gets into her comments with the opinion that “Being raped doesn’t confer some mystical moral superiority on a woman, it just makes her a victim. And unfortunately, in all too many cases, it just makes her a stupid one.” Honest, that’s what he said! Talk about sociopathic.\nSo, is Newshog saying that being raped doesn’t make a women a victim?  Or is he arguing that being raped does confer mystical moral superiority on a woman?  Is it possible that he possesses statistical information of which I have hitherto been unaware regarding the little-known correlation between Mensa status and rape victimhood?  I’m more than a little curious here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-02T11:16:00+00:00"
}