{
  "url": "https://voxday.net/2005/12/12/minor-edi/",
  "scraped_at": "2026-01-08T20:52:36.237100",
  "title": "A minor edit",
  "date_display": "December 12, 2005",
  "date_iso": "2005-12-12T10:00:00+00:00",
  "date_from_url": "2005-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of you have wondered how WND edits my column.  Generally speaking, they leave it alone, but I thought you might be interested in seeing an example of how it gets watered down from time to time.  I don’t object to this in the slightest, I mean, how can I be upset with the people who let me get away with that Ron Mexico stunt?</p><p>Anyhow, here’s the column as it appears today:</p><blockquote><p><b>Myth of the electable moderate</b><br>Exclusive: <em>Vox Day thinks Republicans getting burned by Schwarzenegger</em></br></p><p>EIGHTH PARAGRAPH <em>In Schwarzenegger’s action movies, he often left his opponents bloodied and burned. It is not difficult to imagine that California Republicans will soon be wondering if Arnold is handling them the same way.</em></p></blockquote><p>And here’s the original:</p><blockquote><p><b>The One Man Gang-Bang</b><br>Exclusive: <em>Vox Day wonders if Arnold will leave Republicans sore</em></br></p><p>EIGHTH PARAGRAPH <em>In Governor Schwarzenegger’s famous interview with Oui, he fondly recalled participating in a gang bang at the gym.  It is not difficult to imagine that California Republicans will soon be wondering if they were similarly had.</em></p></blockquote><p>I leave the verdict regarding which version is better to you, gentle reader.</p></div>",
  "content_text": "Some of you have wondered how WND edits my column.  Generally speaking, they leave it alone, but I thought you might be interested in seeing an example of how it gets watered down from time to time.  I don’t object to this in the slightest, I mean, how can I be upset with the people who let me get away with that Ron Mexico stunt?\nAnyhow, here’s the column as it appears today:\nMyth of the electable moderate\nExclusive:\nVox Day thinks Republicans getting burned by Schwarzenegger\nEIGHTH PARAGRAPH\nIn Schwarzenegger’s action movies, he often left his opponents bloodied and burned. It is not difficult to imagine that California Republicans will soon be wondering if Arnold is handling them the same way.\nAnd here’s the original:\nThe One Man Gang-Bang\nExclusive:\nVox Day wonders if Arnold will leave Republicans sore\nEIGHTH PARAGRAPH\nIn Governor Schwarzenegger’s famous interview with Oui, he fondly recalled participating in a gang bang at the gym.  It is not difficult to imagine that California Republicans will soon be wondering if they were similarly had.\nI leave the verdict regarding which version is better to you, gentle reader.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-12T10:00:00+00:00"
}