{
  "url": "https://voxday.net/2005/12/24/on-dark-of-christmas/",
  "scraped_at": "2026-01-08T20:54:04.691131",
  "title": "On The Dark of Christmas",
  "date_display": "December 24, 2005",
  "date_iso": "2005-12-24T14:26:00+00:00",
  "date_from_url": "2005-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am reading this Christmas season, as my wont nearly every year, <em>The Dark is Rising</em> by Susan Cooper.  It’s a part of my personal Christmas tradition, and while I don’t know why I started doing this, I think I know why I continue.  It’s something related to this lovely turn of phrase by NRO’s Amy Wellborn:</p><blockquote><p>Look at it closely, with clear eyes. At every turn in this story of this baby there is threat and fear and powers circling, attempting to strike at the light.  We might forget, we might wrap up Christmas in good cheer, but Christian tradition doesn’t.</p></blockquote><p>It makes no intellectual sense, but I suspect CS Lewis’s instincts were neverthless correct when he separated Father Christmas from Aslan in <em>The Lion, The Witch and The Wardrobe</em>.  One cannot understand the depth and significance of Christianity if one does not stare into the darkness it stands against.  Nietzsche was right, the abyss does stare back, but when faced with the Light of the World, it blinks and retreats.</p><p>“None shall stop the Dark from rising,” shouts the Black Rider in the book.  And in that book, which is as near to perfect as a children’s book can be, the three from the circle and the three from the track suffice to turn it back.</p><p>For Christians, however, Christmas is more than a celebration, it is a reminder of a fulfilled vow, that in time, one shall stop the Dark from rising.</p><p>Merry Christmas, everyone.</p></div>",
  "content_text": "I am reading this Christmas season, as my wont nearly every year,\nThe Dark is Rising\nby Susan Cooper.  It’s a part of my personal Christmas tradition, and while I don’t know why I started doing this, I think I know why I continue.  It’s something related to this lovely turn of phrase by NRO’s Amy Wellborn:\nLook at it closely, with clear eyes. At every turn in this story of this baby there is threat and fear and powers circling, attempting to strike at the light.  We might forget, we might wrap up Christmas in good cheer, but Christian tradition doesn’t.\nIt makes no intellectual sense, but I suspect CS Lewis’s instincts were neverthless correct when he separated Father Christmas from Aslan in\nThe Lion, The Witch and The Wardrobe\n.  One cannot understand the depth and significance of Christianity if one does not stare into the darkness it stands against.  Nietzsche was right, the abyss does stare back, but when faced with the Light of the World, it blinks and retreats.\n“None shall stop the Dark from rising,” shouts the Black Rider in the book.  And in that book, which is as near to perfect as a children’s book can be, the three from the circle and the three from the track suffice to turn it back.\nFor Christians, however, Christmas is more than a celebration, it is a reminder of a fulfilled vow, that in time, one shall stop the Dark from rising.\nMerry Christmas, everyone.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-24T14:26:00+00:00"
}