{
  "url": "https://voxday.net/2005/12/04/perhaps-it-was-inappropriate-gang/",
  "scraped_at": "2026-01-08T20:51:44.269511",
  "title": "Perhaps it was inappropriate gang innuendo",
  "date_display": "December 4, 2005",
  "date_iso": "2005-12-04T13:05:00+00:00",
  "date_from_url": "2005-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amandagon and company are up in arms about <a href=\"http://www.pandagon.net/archives/2005/12/victim_found_gu.html\">a rape accuser being convicted</a>:</p><blockquote><p><b>Victim found guilty…..</b></p><p>What a fucking nightmare. A 17-year-old girl is allegedly gang raped, and instead of prosecuting the men she said raped her, the girl is prosecuted for filing a false report.</p></blockquote><p>While this could be taken as a good sign that rape will eventually be treated like any other crime, with burden of proof being on the accuser and normal standards of evidence applying, this particular case appears to be troublesome.  If nothing else, the girl responsible for making the accusation should have been given the jury trial that is her right.</p><p>As the woman has apparently not recanted or withdrawn her accusation, she does not meet the standard of a false accuser used by the Purdue, Air Force and Washington Post studies that have shown how accusations made and later admitted to be false by the accuser herself <a href=\"http://www.americandaily.com/article/5075\">have ranged from 25 to 60 percent</a> of all rape accusations made.  And of course, it’s always possible that the accuser was genuinely confused about what does and does not constitute rape, which: <em>“spans a spectrum of incidents and behaviors, ranging from crimes legally defined as rape to verbal harassment and inappropriate innuendo.”</em> – Swarthmore College training pamphlet</p><p>Not having been privy either to the incident itself or the subsequent trial, I have no idea if justice was served or not.  As justice must be impartial, I don’t see how one can rightly convict a woman on nothing more than he said vs she said evidence anymore than one can convict a man.  Yes, in this case it’s the word of three against one, but as all three men have an obvious interest in the matter, that’s just not relevant here.</p><p>It is probably too optimistic to hope that the “all accused men are guilty” crowd will come away from this with an understanding of how relaxing the standards required for a conviction is dangerous for everyone, not just the hated rapists, but we can always hope.</p><p>In any event, there is no question that the “justice” system in this country is corrupted far beyond what most people would believe.  Having been firsthand witness to a judge “deciding” a case by a literal coin flip – a case wherein I was the only person on either side who had been there and knew exactly what had happened – I can attest that an American courtroom is one of the last places to look for justice.  And that’s not sour grapes, either, we actually won that case but I remain entirely disgusted by the process with victory was granted.</p></div>",
  "content_text": "Amandagon and company are up in arms about\na rape accuser being convicted\n:\nVictim found guilty…..\nWhat a fucking nightmare. A 17-year-old girl is allegedly gang raped, and instead of prosecuting the men she said raped her, the girl is prosecuted for filing a false report.\nWhile this could be taken as a good sign that rape will eventually be treated like any other crime, with burden of proof being on the accuser and normal standards of evidence applying, this particular case appears to be troublesome.  If nothing else, the girl responsible for making the accusation should have been given the jury trial that is her right.\nAs the woman has apparently not recanted or withdrawn her accusation, she does not meet the standard of a false accuser used by the Purdue, Air Force and Washington Post studies that have shown how accusations made and later admitted to be false by the accuser herself\nhave ranged from 25 to 60 percent\nof all rape accusations made.  And of course, it’s always possible that the accuser was genuinely confused about what does and does not constitute rape, which:\n“spans a spectrum of incidents and behaviors, ranging from crimes legally defined as rape to verbal harassment and inappropriate innuendo.”\n– Swarthmore College training pamphlet\nNot having been privy either to the incident itself or the subsequent trial, I have no idea if justice was served or not.  As justice must be impartial, I don’t see how one can rightly convict a woman on nothing more than he said vs she said evidence anymore than one can convict a man.  Yes, in this case it’s the word of three against one, but as all three men have an obvious interest in the matter, that’s just not relevant here.\nIt is probably too optimistic to hope that the “all accused men are guilty” crowd will come away from this with an understanding of how relaxing the standards required for a conviction is dangerous for everyone, not just the hated rapists, but we can always hope.\nIn any event, there is no question that the “justice” system in this country is corrupted far beyond what most people would believe.  Having been firsthand witness to a judge “deciding” a case by a literal coin flip – a case wherein I was the only person on either side who had been there and knew exactly what had happened – I can attest that an American courtroom is one of the last places to look for justice.  And that’s not sour grapes, either, we actually won that case but I remain entirely disgusted by the process with victory was granted.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-04T13:05:00+00:00"
}