{
  "url": "https://voxday.net/2005/12/07/roll-them-bones/",
  "scraped_at": "2026-01-08T20:52:08.737280",
  "title": "Roll them bones",
  "date_display": "December 7, 2005",
  "date_iso": "2005-12-07T08:52:00+00:00",
  "date_from_url": "2005-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Further investigating the legalities of rape in the pagan ancient world, <a href=\"http://www.fordham.edu/halsall/india/manu-full.html\">the Laws of Manu</a>, circa 1500 BC India, are illuminating.  Unlike Roman law, there is unmistakable evidence that the rape of an unwilling woman was a crime, with a conconmitant punishment.</p><p><em>364. He who violates an unwilling maiden shall instantly suffer corporal punishment; but a man who enjoys a willing maiden shall not suffer corporal punishment, if (his caste be) the same (as hers)….</em></p><p>367. But if any man through insolence forcibly contaminates a maiden, two of his fingers shall be instantly cut off, and he shall pay a fine of six hundred (panas).</p><p>368. A man (of) equal (caste) who defiles a willing maiden shall not suffer the amputation of his fingers, but shall pay a fine of two hundred (panas) in order to deter him from a repetition (of the offence).</p><p>Of course, the seriousness with which this criminal offense was regarded is leavened somewhat when one realizes that the same punishment is applied to gambling, whereas thieves found in possession of stolen goods are to be executed, as are those who feed them or give them shelter, and burglars are to have their hands cut off prior to being impaled.</p><p>The <a href=\"http://www.fordham.edu/halsall/ancient/450-gortyn.html\">Cretan law code of Gortyn</a> may shed some light on the Greek outlook, here it is interesting to note that rape is considered to be an offense on the same level as adultery; consent of the woman being all but irrelevant here:</p><p><em>If one commit rape on a free man or woman, he shall pay 100 staters, and if on the son or daughter of an apetairos ten, and if a slave on a free man or woman, he shall pay double, and if a free man on a male or female serf five drachmas, and if a serf on a male or female serf, five staters. If one debauch a female house-slave by force he shall pay two staters, but if one already debauched, in the daytime, an obol, but if at night, two obols. If one tries to seduce a free woman, he shall pay ten staters, if a witness testify. . .</em></p><p>III. If one be taken in adultery with a free woman in her fathers, brothers, or husbands house, he shall pay 100 staters, but if in anothers house, fifty; and with the wife of an apetairos, ten. But if a slave with a free woman, he shall pay double, but if a slave with a slave=s wife, five. . .</p><p>In any event, this should illustrate that Wildhunt’s assertion, like Paglia’s, about there being little difference between pagan and Christian morality with regards to rape is almost entirely spurious.  And it should further underline my point about the way in which the abandonment of the Christian moral tradition is likely to prove disastrous, even in the eyes of those who reject the source of that tradition.</p></div>",
  "content_text": "Further investigating the legalities of rape in the pagan ancient world,\nthe Laws of Manu\n, circa 1500 BC India, are illuminating.  Unlike Roman law, there is unmistakable evidence that the rape of an unwilling woman was a crime, with a conconmitant punishment.\n364. He who violates an unwilling maiden shall instantly suffer corporal punishment; but a man who enjoys a willing maiden shall not suffer corporal punishment, if (his caste be) the same (as hers)….\n367. But if any man through insolence forcibly contaminates a maiden, two of his fingers shall be instantly cut off, and he shall pay a fine of six hundred (panas).\n368. A man (of) equal (caste) who defiles a willing maiden shall not suffer the amputation of his fingers, but shall pay a fine of two hundred (panas) in order to deter him from a repetition (of the offence).\nOf course, the seriousness with which this criminal offense was regarded is leavened somewhat when one realizes that the same punishment is applied to gambling, whereas thieves found in possession of stolen goods are to be executed, as are those who feed them or give them shelter, and burglars are to have their hands cut off prior to being impaled.\nThe\nCretan law code of Gortyn\nmay shed some light on the Greek outlook, here it is interesting to note that rape is considered to be an offense on the same level as adultery; consent of the woman being all but irrelevant here:\nIf one commit rape on a free man or woman, he shall pay 100 staters, and if on the son or daughter of an apetairos ten, and if a slave on a free man or woman, he shall pay double, and if a free man on a male or female serf five drachmas, and if a serf on a male or female serf, five staters. If one debauch a female house-slave by force he shall pay two staters, but if one already debauched, in the daytime, an obol, but if at night, two obols. If one tries to seduce a free woman, he shall pay ten staters, if a witness testify. . .\nIII. If one be taken in adultery with a free woman in her fathers, brothers, or husbands house, he shall pay 100 staters, but if in anothers house, fifty; and with the wife of an apetairos, ten. But if a slave with a free woman, he shall pay double, but if a slave with a slave=s wife, five. . .\nIn any event, this should illustrate that Wildhunt’s assertion, like Paglia’s, about there being little difference between pagan and Christian morality with regards to rape is almost entirely spurious.  And it should further underline my point about the way in which the abandonment of the Christian moral tradition is likely to prove disastrous, even in the eyes of those who reject the source of that tradition.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-07T08:52:00+00:00"
}