{
  "url": "https://voxday.net/2005/12/31/throw-her-to-dogs/",
  "scraped_at": "2026-01-08T20:54:32.909202",
  "title": "Throw her to the dogs",
  "date_display": "December 31, 2005",
  "date_iso": "2005-12-31T11:56:00+00:00",
  "date_from_url": "2005-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unrepentant Jezebel can’t admit an obvious mistake:</p><blockquote><p>Vox admits he’s more partial to the Republicans than to the Democrats, and then speaks from the other side of his mouth. Tricky tricky.</p></blockquote><p>Yes, here’s that Republican-supporting statement I made: <em>I’ll admit to generally preferring Republicans to Democrats, but that’s like choosing between Helen Thomas and the rotting corpse of Eleanor Roosevelt. I’d no sooner vote for a member of the bi-factional ruling party than I’d take Helen or Eleanor out on a date.</em></p><p>I prefer National Socialists to the Khmer Rouge too; that isn’t an indication of support, it merely demonstrates an ability to discern the lesser of two evils.  It does not equate to supporting either one.  Who is being tricky here?</p><p>As <a href=\"http://www.bradspangler.com/blog/archives/237\">Brad Spangler noted</a>, Jezebel’s interpretation is so out-of-whack that it led him to believe I had become a supporter of the Dear Leader himself, Mr. George Delano Bush.  While Jezebel may be fully satisfied with her notion that Christian Libertarians are secret theocrats, but that doesn’t make her any less incorrect.</p><p>And by the way, what is with various blogs chortling about how a link I have provided has given them more traffic than normal?  Is that supposed to be some sort of retort?  I don’t care about the size of my own readership, I certainly couldn’t care less about the size of yours.</p><p>But in Jezebel’s case, I did find this to be an interesting comment:  “<em>I don’t think I’ve ever seen so many .mil and .gov IP addresses surf through my site in one year, let alone one day.</em>”  If you’re a soldier reading this, thank you for your service to the country and remember that your oath is to the Constitution, not the administrative bureaucracy.  And if you’re working for the Neu Stasi Amerika, you might considering reading the Constitution again and revisiting the question of just what color hat you’re wearing.</p><p>As for my panties, they remain unbunched.</p></div>",
  "content_text": "Unrepentant Jezebel can’t admit an obvious mistake:\nVox admits he’s more partial to the Republicans than to the Democrats, and then speaks from the other side of his mouth. Tricky tricky.\nYes, here’s that Republican-supporting statement I made:\nI’ll admit to generally preferring Republicans to Democrats, but that’s like choosing between Helen Thomas and the rotting corpse of Eleanor Roosevelt. I’d no sooner vote for a member of the bi-factional ruling party than I’d take Helen or Eleanor out on a date.\nI prefer National Socialists to the Khmer Rouge too; that isn’t an indication of support, it merely demonstrates an ability to discern the lesser of two evils.  It does not equate to supporting either one.  Who is being tricky here?\nAs\nBrad Spangler noted\n, Jezebel’s interpretation is so out-of-whack that it led him to believe I had become a supporter of the Dear Leader himself, Mr. George Delano Bush.  While Jezebel may be fully satisfied with her notion that Christian Libertarians are secret theocrats, but that doesn’t make her any less incorrect.\nAnd by the way, what is with various blogs chortling about how a link I have provided has given them more traffic than normal?  Is that supposed to be some sort of retort?  I don’t care about the size of my own readership, I certainly couldn’t care less about the size of yours.\nBut in Jezebel’s case, I did find this to be an interesting comment:  “\nI don’t think I’ve ever seen so many .mil and .gov IP addresses surf through my site in one year, let alone one day.\n”  If you’re a soldier reading this, thank you for your service to the country and remember that your oath is to the Constitution, not the administrative bureaucracy.  And if you’re working for the Neu Stasi Amerika, you might considering reading the Constitution again and revisiting the question of just what color hat you’re wearing.\nAs for my panties, they remain unbunched.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-31T11:56:00+00:00"
}