{
  "url": "https://voxday.net/2005/12/20/weasel-words/",
  "scraped_at": "2026-01-08T20:53:39.022475",
  "title": "Weasel words",
  "date_display": "December 20, 2005",
  "date_iso": "2005-12-20T18:06:00+00:00",
  "date_from_url": "2005-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Orac again demonstrates that he doesn’t know very much:</p><blockquote><p>Vox <b>seemed</b> to be making excuses for the Nazis….Even Orac, who normally cared little for the affairs of humans and was interested in finding the Hitler Zombie more as an intellectual exercise to understand how historical analogies could be twisted beyond recognition and how a sense of proportion could be utterly lost than because of the horror that it caused, couldn’t help but be repulsed by such “reasoning” that equated a struggle to attain equal rights with the activities of a bloodthirsty tyrant and the genocidal regime that he spawned. Vox <b>seemed</b> to be making excuses for the Nazis on the basis that they sincerely believed the Jews were undermining Germany and that most of the Jews the Nazis murdered were adults who apparently in his mind could have defended themselves. (Had he never heard of the bravely suicidal Warsaw Ghetto uprising of 1943 and what the result was?) But that wasn’t all….  He definitely <b>seems</b> to admire the Nazis.</p></blockquote><p>Yes, most ASL players and Leon Uris readers are completely unfamiliar with the Warsaw Ghetto.  It’s also to amusing to note Orac’s inability to apply logic, as he cites the bravely suicidal Jews of the Warsaw Ghetto while rejecting my similar characterization of National Socialist Germany (population 80 million) taking on the United Kingdom (48 million), France (41 million), Poland (35 million), the Soviet Union (195 million) and the United States (130 million).  If he’s arguing that the Germans had a better chance of defeating the Allies than the Warsaw Jews had of defeating the SS, he knows nothing about military history.  Indeed, the numerical German advantage over European Jewry (6.6x) is not dissimilar to the numerical enjoyed by Germany’s enemies (5.6x).  Call it nuts, call it bravely suicidal, but either way, it was never going to work even if the National Socialists tried it one bite at a time.</p><p>Furthermore, Orac’s citation of the 1943 uprising supports my earlier point.  The Endlosung began in 1941.  Jews didn’t begin trying to defend themselves for 18 months, at which point it was unfortunately much too late.</p><p>Orac’s use of weasel words indicates that he knows perfectly well that as a libertarian extremist, I am far less sympathetic to historical National Socialist policies than he is.  I don’t support public schools, social security, national parks, central state authority or laws taking race into account, whereas most liberals and Democrats, like their National Socialist intellectual kindred, do.  This is just a particularly feeble attempt to tar an ideological opponent with the dread “Nazi” label.</p><p>It’s simply a tremendously silly point.  I admire Lenin’s ability to completely turn Marx’s explanation of communist inevitability on its head and somehow get away with it, but I’m not a Leninist.  I admire the Soviet T-34 tank and the resilience of the Red Army, but I’m not a Soviet apologist.  I have neither patience nor respect for those who demand a Two-Minute Hate of others.  Just as one can find evil in the best of things, one can find a silver lining even in the darkest, most evil cloud.</p><p>So, I stand by my words.  To call a feminist a feminazi is an insult to the German National Socialist Worker’s Party.  It’s a very low bar, true, but at least murdering children was not a definitive aspect of their self-identity.</p><p>UPDATE: Orac is apparently upset that I didn’t link to him when I quoted a small part of his long and meandering post.  Okay, <a href=\"http://oracknows.blogspot.com/\">here’s</a> <a href=\"http://oracknows.blogspot.com/\">some</a> <a href=\"http://oracknows.blogspot.com/\">links</a>.  Happy now?  FYI: if what I’m quoting is only a small part of someone’s post, I’m not going to bother making anyone else wade through irrelevant material to find that which is related to mine.</p></div>",
  "content_text": "Orac again demonstrates that he doesn’t know very much:\nVox\nseemed\nto be making excuses for the Nazis….Even Orac, who normally cared little for the affairs of humans and was interested in finding the Hitler Zombie more as an intellectual exercise to understand how historical analogies could be twisted beyond recognition and how a sense of proportion could be utterly lost than because of the horror that it caused, couldn’t help but be repulsed by such “reasoning” that equated a struggle to attain equal rights with the activities of a bloodthirsty tyrant and the genocidal regime that he spawned. Vox\nseemed\nto be making excuses for the Nazis on the basis that they sincerely believed the Jews were undermining Germany and that most of the Jews the Nazis murdered were adults who apparently in his mind could have defended themselves. (Had he never heard of the bravely suicidal Warsaw Ghetto uprising of 1943 and what the result was?) But that wasn’t all….  He definitely\nseems\nto admire the Nazis.\nYes, most ASL players and Leon Uris readers are completely unfamiliar with the Warsaw Ghetto.  It’s also to amusing to note Orac’s inability to apply logic, as he cites the bravely suicidal Jews of the Warsaw Ghetto while rejecting my similar characterization of National Socialist Germany (population 80 million) taking on the United Kingdom (48 million), France (41 million), Poland (35 million), the Soviet Union (195 million) and the United States (130 million).  If he’s arguing that the Germans had a better chance of defeating the Allies than the Warsaw Jews had of defeating the SS, he knows nothing about military history.  Indeed, the numerical German advantage over European Jewry (6.6x) is not dissimilar to the numerical enjoyed by Germany’s enemies (5.6x).  Call it nuts, call it bravely suicidal, but either way, it was never going to work even if the National Socialists tried it one bite at a time.\nFurthermore, Orac’s citation of the 1943 uprising supports my earlier point.  The Endlosung began in 1941.  Jews didn’t begin trying to defend themselves for 18 months, at which point it was unfortunately much too late.\nOrac’s use of weasel words indicates that he knows perfectly well that as a libertarian extremist, I am far less sympathetic to historical National Socialist policies than he is.  I don’t support public schools, social security, national parks, central state authority or laws taking race into account, whereas most liberals and Democrats, like their National Socialist intellectual kindred, do.  This is just a particularly feeble attempt to tar an ideological opponent with the dread “Nazi” label.\nIt’s simply a tremendously silly point.  I admire Lenin’s ability to completely turn Marx’s explanation of communist inevitability on its head and somehow get away with it, but I’m not a Leninist.  I admire the Soviet T-34 tank and the resilience of the Red Army, but I’m not a Soviet apologist.  I have neither patience nor respect for those who demand a Two-Minute Hate of others.  Just as one can find evil in the best of things, one can find a silver lining even in the darkest, most evil cloud.\nSo, I stand by my words.  To call a feminist a feminazi is an insult to the German National Socialist Worker’s Party.  It’s a very low bar, true, but at least murdering children was not a definitive aspect of their self-identity.\nUPDATE: Orac is apparently upset that I didn’t link to him when I quoted a small part of his long and meandering post.  Okay,\nhere’s\nsome\nlinks\n.  Happy now?  FYI: if what I’m quoting is only a small part of someone’s post, I’m not going to bother making anyone else wade through irrelevant material to find that which is related to mine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-12-20T18:06:00+00:00"
}