{
  "url": "https://voxday.net/2025/09/15/nato-is-at-war-with-russia/",
  "scraped_at": "2026-01-08T20:31:27.042029",
  "title": "“NATO is at war with Russia”",
  "date_display": "September 15, 2025",
  "date_iso": "2025-09-15T15:53:12+00:00",
  "date_from_url": "2025-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt <a href=\"https://halturnerradioshow.com/\">this official observation</a> will spark all sorts of denials from the various neocons and Eurocrats. And none of them will matter, because in the end, the only opinion that matters is Russia’s.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For the very first time, the official spokesman for the Kremlin in Moscow, Dmitry Peskov has said publicly “NATO is at war with Russia.” This statement is a harbinger of dramatic and horrifying developments soon to come.</p><p>It is vital to point out that for three and a half years, Peskov has NOT said this. The fact that he uttered these words over this past weekend, is no accident.</p><p>Peskov is the official Spokesman for the Kremlin. He says exactly, precisely, what the Russian government wants said. He doesn’t embellish. He doesn’t take liberties with what he says. Never once in history has the Kremlin had to “walk-back” anything Peskov has said. The words that come out of his mouth are exactly, precisely what the Russian government intends to express.</p><p>The fact that the Russian government is now openly saying “NATO is at war with Russia” holds all the severe implications any rational person would think, could stem from such a statement.</p></blockquote><p>And in truth, this is nothing more than a statement of the obvious. NATO is, and has been, at war with Russia since at least mid-2023. Russia’s patience in simply absorbing the economic and military attacks has been tremendous. But now that NATO’s proxy has been defeated, NATO isn’t doing what it should be doing and laying down its weapons, instead, it is doubling down and making preparations to fight Russia directly.</p><p>Russia, it is now clear, will behave accordingly. And it is very unlikely that more than a few of the current European regimes are going to survive the experience, however tangential it might prove to be.</p><p>And the European leaders know NATO is responsible for starting the NATO-Russian war. They’ve even <a href=\"https://www.rt.com/russia/624687-sachs-macron-nato-ukraine/\">admitted as much</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>French President Emmanuel Macron has privately admitted that NATO is the driving force behind the Ukraine conflict, prominent American economist Jeffrey Sachs has said. Macron, along with other Western leaders, has repeatedly claimed that Russia launched its military operation against Ukraine in 2022 without provocation and has insisted that Moscow is solely responsible for the conflict.</p><p>However, speaking during a foreign policy debate with the Italian daily <em>il Fatto Quotidiano</em>, Sachs recalled that when Macron awarded him the Legion of Honor in May 2022, the French leader privately told him “exactly the opposite of what he says publicly” and admitted that “NATO was causing this war.”</p></blockquote><p><em><a href=\"https://socialgalactic.com/micropost/2426fc75-4f4b-45cf-b1fb-8efcb1e2156a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "No doubt\nthis official observation\nwill spark all sorts of denials from the various neocons and Eurocrats. And none of them will matter, because in the end, the only opinion that matters is Russia’s.\nFor the very first time, the official spokesman for the Kremlin in Moscow, Dmitry Peskov has said publicly “NATO is at war with Russia.” This statement is a harbinger of dramatic and horrifying developments soon to come.\nIt is vital to point out that for three and a half years, Peskov has NOT said this. The fact that he uttered these words over this past weekend, is no accident.\nPeskov is the official Spokesman for the Kremlin. He says exactly, precisely, what the Russian government wants said. He doesn’t embellish. He doesn’t take liberties with what he says. Never once in history has the Kremlin had to “walk-back” anything Peskov has said. The words that come out of his mouth are exactly, precisely what the Russian government intends to express.\nThe fact that the Russian government is now openly saying “NATO is at war with Russia” holds all the severe implications any rational person would think, could stem from such a statement.\nAnd in truth, this is nothing more than a statement of the obvious. NATO is, and has been, at war with Russia since at least mid-2023. Russia’s patience in simply absorbing the economic and military attacks has been tremendous. But now that NATO’s proxy has been defeated, NATO isn’t doing what it should be doing and laying down its weapons, instead, it is doubling down and making preparations to fight Russia directly.\nRussia, it is now clear, will behave accordingly. And it is very unlikely that more than a few of the current European regimes are going to survive the experience, however tangential it might prove to be.\nAnd the European leaders know NATO is responsible for starting the NATO-Russian war. They’ve even\nadmitted as much\n.\nFrench President Emmanuel Macron has privately admitted that NATO is the driving force behind the Ukraine conflict, prominent American economist Jeffrey Sachs has said. Macron, along with other Western leaders, has repeatedly claimed that Russia launched its military operation against Ukraine in 2022 without provocation and has insisted that Moscow is solely responsible for the conflict.\nHowever, speaking during a foreign policy debate with the Italian daily\nil Fatto Quotidiano\n, Sachs recalled that when Macron awarded him the Legion of Honor in May 2022, the French leader privately told him “exactly the opposite of what he says publicly” and admitted that “NATO was causing this war.”\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-15T15:53:13+00:00"
}