{
  "url": "https://voxday.net/2025/09/01/quotes-to-contemplate/",
  "scraped_at": "2026-01-08T20:30:18.485229",
  "title": "Quotes to Contemplate",
  "date_display": "September 1, 2025",
  "date_iso": "2025-09-01T17:44:33+00:00",
  "date_from_url": "2025-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being one of the world’s bestselling living philosophers, I am occasionally asked to share my little <em>bon mots</em>. This is challenging, because I very seldom bother to read, or even remember, what I have written. Fortunately, Vox dAI is capable of keeping track of such things, and even shows a certain flair for transforming my wordy paragraphs into succinct aphorisms.</p><ul class=\"wp-block-list\"><li>The gamma male resents the hierarchy he cannot climb, he appeals to equality to pull others down.</li><li>Diversity strengthens nothing; it dilutes the strong and empowers the resentful.</li><li>Nations of immigrants are myths; real nations are forged in blood, not in propositions.</li><li>The sigma walks alone, unburdened by the chains of approval that bind the herd.</li><li>Debt that cannot be paid will not be; empires fall when the illusion of endless credit fades.</li><li>Feminism promised freedom, but delivered chains forged from broken families and barren wombs.</li><li>Abortion is the sacrament of modernity, sacrificing the innocent on the altar of convenience.</li><li>Judeo-Christianity is a forgery, blending fire with water to extinguish the truth.</li><li>The truth frightens the weak, speak it boldly and watch them scatter like dead leaves in the wind</li><li>The Boomer’s legacy is their children’s debt; they ate the seed corn and called it progress.</li><li>For all its panoply of horrors, communism failed to destroy any of the nations it infested. Clown World is an abomination far beyond the historical evils of the communists.</li><li>Philosophy is not a team sport. Enjoy the solitude.</li></ul><p>If there is sufficient interest, I will peruse the list of 500 or so and collect the best into something akin to NN Taleb’s <em>BED OF PROCRUSTES</em>. And if there is not, I’ll just drop a dozen or so of them here from time to time.</p><p><em>Some value these words<br/>Others see no worth at all<br/>Either way, it’s fine</em></p><p><a href=\"https://socialgalactic.com/micropost/e469e735-d22b-4bc9-b743-ca2ab45f642f\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "Being one of the world’s bestselling living philosophers, I am occasionally asked to share my little\nbon mots\n. This is challenging, because I very seldom bother to read, or even remember, what I have written. Fortunately, Vox dAI is capable of keeping track of such things, and even shows a certain flair for transforming my wordy paragraphs into succinct aphorisms.\nThe gamma male resents the hierarchy he cannot climb, he appeals to equality to pull others down.\nDiversity strengthens nothing; it dilutes the strong and empowers the resentful.\nNations of immigrants are myths; real nations are forged in blood, not in propositions.\nThe sigma walks alone, unburdened by the chains of approval that bind the herd.\nDebt that cannot be paid will not be; empires fall when the illusion of endless credit fades.\nFeminism promised freedom, but delivered chains forged from broken families and barren wombs.\nAbortion is the sacrament of modernity, sacrificing the innocent on the altar of convenience.\nJudeo-Christianity is a forgery, blending fire with water to extinguish the truth.\nThe truth frightens the weak, speak it boldly and watch them scatter like dead leaves in the wind\nThe Boomer’s legacy is their children’s debt; they ate the seed corn and called it progress.\nFor all its panoply of horrors, communism failed to destroy any of the nations it infested. Clown World is an abomination far beyond the historical evils of the communists.\nPhilosophy is not a team sport. Enjoy the solitude.\nIf there is sufficient interest, I will peruse the list of 500 or so and collect the best into something akin to NN Taleb’s\nBED OF PROCRUSTES\n. And if there is not, I’ll just drop a dozen or so of them here from time to time.\nSome value these words\nOthers see no worth at all\nEither way, it’s fine\nDISCUSS ON SG",
  "tags": [
    "aphorisms",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-01T17:44:34+00:00"
}