{
  "url": "https://voxday.net/2025/09/22/the-theranos-fraud/",
  "scraped_at": "2026-01-08T20:31:57.602706",
  "title": "The Theranos Fraud",
  "date_display": "September 22, 2025",
  "date_iso": "2025-09-22T18:04:17+00:00",
  "date_from_url": "2025-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>A former hedge fund venture capitalist <a href=\"https://thenakedhedgie.com/2021/10/02/the-theranos-scandal-the-real-story-1-3/\">observes some of the more peculiar aspects</a> of the Theranos story.</em></p><p>Over the last 20 years, part of my own work has been raising money from wealthy investors. Based on that experience, I find the Elizabeth Holmes story completely impossible to believe. Now, my experience was different in that I wasn’t raising money for a tech startup and I never worked in Silicon Valley. Rather, I sought funding for hedge fund ventures. But in essence, the process is the same: you go to wealthy investors, pitch your project and hope to raise funds. Your counterparts are shopping for investments that can give them a high return on capital.</p><p>The experience gave me a good sense of the way wealthy individuals make their investment decisions. For starters, they are not stupid; they are usually quite rigorous and don’t easily fall for cosmetics or charm. It’s true that some investors spray money on startup ventures less discriminately with the rationale that some projects will succeed. Typically they’ll look at your team, business plan, demand some proof of concept, and if they’re half-convinced that you have a shot at succeeding, they might give you some money. But in such cases we’re normally talking about relatively smaller sums – say, a few hundred thousand bucks or something in that ballpark.</p><p>But when it comes to large sums of money, investors tend to be very demanding. Venture capital funds tend to specialize in a limited number of industries and they use domain experts to vet prospective investments. Their job is to conduct thorough due diligence on potential investments and distill the most likely future success stories out of many, many applicants. This process is itself costly and time-consuming, and I would expect that in Silicon Valley, which attracts top notch creative talent from all over the world, the process is quick to eliminate candidates that fail to convince that they have a sound concept, competent management team and a compelling business strategy.</p><p>The cosmetics alone – the stories, visions, displays of confidence or personal charm – they won’t even get you past the gatekeepers if the stuff behind the façade doesn’t convince. In Elizabeth Holmes’s case, even minimal due diligence should have eliminated her: she set out to revolutionize health care but had no qualifications or experience in medicine and only rudimentary training in biochemistry. In almost all cases, her patents specified design of future solutions but not the functionality. She published no white papers or technical specifications, and could not demonstrate that her supposed inventions even worked. Any specialist in the field of medicine or biochemistry would have easily disqualified her claims and determined that there was no substance to her story.</p><h3 class=\"wp-block-heading\">Holmes’ fakery was obvious from the start</h3><p>For example, Holmes was twice introduced to Stanford clinical pharmacologist and professor of medicine <strong>Dr. Phyllis Gardner</strong> with the recommendation that she was brilliant and had a revolutionary investment idea. But professor Gardner saw right through her: “<em>she had no knowledge of medicine and rudimentary knowledge of engineering… And she really didn’t want any expertise, she thought she knew it all!</em>” Another qualified longtime observer of the Theranos saga was also skeptical. <strong>Dr. Darren Saunders</strong> worked as an associate professor of medicine at the University of New South Wales where he ran the Ubiquitin Signaling Lab. He knew that Holmes could never do what she claimed. In an interview for the 60 minutes Australia program, he said that “<em>it takes years and years to develop any one of those tests and make sure that it’s accurate.</em>”</p><p>Indeed, what was glaringly obvious to Dr. Gardner and Dr. Saunders should have been just as obvious to any specialist in the field. In fact, Holmes also failed to convince the US military to adopt Theranos technology. In spite of wholehearted help from General Mattis, she was unable to pass the vetting process at the Pentagon. A few years later, in May 2015, University of Toronto professor <strong>Eleftherios Diamandis</strong> analyzed Theranos technology and also politely concluded that “most of the company’s claims are exaggerated.” Diamandis expressed that opinion at the time when the hype about Theranos and Holmes were at their peak.</p><p>For some reason however, Elizabeth Holmes’ ascent was not obstructed by any scrutiny of her fantastic claims. Early on, not only was she able to get a face-to-face meeting with <strong>Don Lucas Sr</strong>., one of the most prominent venture capitalists in Silicon Valley, she also managed to persuade him to make a large investment in Theranos. Lucas explained his rationale for that decision in <a href=\"https://www.youtube.com/watch?v=kG_F118ruOM&amp;list=PLQOa26lW-uI84JAhO1qY4Fal9IE16wBvK&amp;index=1\">a 2009 interview</a>: “<em>Her great-grandfather was an entrepreneur, very successful. And it turned out later that the hospital [near] where [her family] lives is named after her great-uncle.</em>”</p><p>Apparently, her great uncle’s and great-grandfather’s success was enough for Lucas to invest in her project. I wonder if that same qualification was equally convincing to all other investors? Or was it her passion and charm? Whatever the case, big fish investors gave her more than $750 million, unconcerned about her qualifications or the functioning of her technology.</p><p>This is all very strange, to put it politely. The media narrative has meanwhile contrived plausible-sounding explanation for this: you see, the big investors gave Holmes a ton of cash because they were just so afraid of missing the next facebook or google. But this explanation is just as unlikely as the rest of the story. Neither do such silly rationalizations explain the massive allocations from a group of top-notch power players, nor the terms of investment that prohibited verification of Theranos technology, nor share prices that valued the fraudulent venture at $9 billion.</p><p><em>Read the whole thing, because it wasn’t just about making money. It appears to have been some sort of dry run for Covid.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/8ba6bed8-a0cc-4c21-9198-2108b27c601e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A former hedge fund venture capitalist\nobserves some of the more peculiar aspects\nof the Theranos story.\nOver the last 20 years, part of my own work has been raising money from wealthy investors. Based on that experience, I find the Elizabeth Holmes story completely impossible to believe. Now, my experience was different in that I wasn’t raising money for a tech startup and I never worked in Silicon Valley. Rather, I sought funding for hedge fund ventures. But in essence, the process is the same: you go to wealthy investors, pitch your project and hope to raise funds. Your counterparts are shopping for investments that can give them a high return on capital.\nThe experience gave me a good sense of the way wealthy individuals make their investment decisions. For starters, they are not stupid; they are usually quite rigorous and don’t easily fall for cosmetics or charm. It’s true that some investors spray money on startup ventures less discriminately with the rationale that some projects will succeed. Typically they’ll look at your team, business plan, demand some proof of concept, and if they’re half-convinced that you have a shot at succeeding, they might give you some money. But in such cases we’re normally talking about relatively smaller sums – say, a few hundred thousand bucks or something in that ballpark.\nBut when it comes to large sums of money, investors tend to be very demanding. Venture capital funds tend to specialize in a limited number of industries and they use domain experts to vet prospective investments. Their job is to conduct thorough due diligence on potential investments and distill the most likely future success stories out of many, many applicants. This process is itself costly and time-consuming, and I would expect that in Silicon Valley, which attracts top notch creative talent from all over the world, the process is quick to eliminate candidates that fail to convince that they have a sound concept, competent management team and a compelling business strategy.\nThe cosmetics alone – the stories, visions, displays of confidence or personal charm – they won’t even get you past the gatekeepers if the stuff behind the façade doesn’t convince. In Elizabeth Holmes’s case, even minimal due diligence should have eliminated her: she set out to revolutionize health care but had no qualifications or experience in medicine and only rudimentary training in biochemistry. In almost all cases, her patents specified design of future solutions but not the functionality. She published no white papers or technical specifications, and could not demonstrate that her supposed inventions even worked. Any specialist in the field of medicine or biochemistry would have easily disqualified her claims and determined that there was no substance to her story.\nHolmes’ fakery was obvious from the start\nFor example, Holmes was twice introduced to Stanford clinical pharmacologist and professor of medicine\nDr. Phyllis Gardner\nwith the recommendation that she was brilliant and had a revolutionary investment idea. But professor Gardner saw right through her: “\nshe had no knowledge of medicine and rudimentary knowledge of engineering… And she really didn’t want any expertise, she thought she knew it all!\n” Another qualified longtime observer of the Theranos saga was also skeptical.\nDr. Darren Saunders\nworked as an associate professor of medicine at the University of New South Wales where he ran the Ubiquitin Signaling Lab. He knew that Holmes could never do what she claimed. In an interview for the 60 minutes Australia program, he said that “\nit takes years and years to develop any one of those tests and make sure that it’s accurate.\n”\nIndeed, what was glaringly obvious to Dr. Gardner and Dr. Saunders should have been just as obvious to any specialist in the field. In fact, Holmes also failed to convince the US military to adopt Theranos technology. In spite of wholehearted help from General Mattis, she was unable to pass the vetting process at the Pentagon. A few years later, in May 2015, University of Toronto professor\nEleftherios Diamandis\nanalyzed Theranos technology and also politely concluded that “most of the company’s claims are exaggerated.” Diamandis expressed that opinion at the time when the hype about Theranos and Holmes were at their peak.\nFor some reason however, Elizabeth Holmes’ ascent was not obstructed by any scrutiny of her fantastic claims. Early on, not only was she able to get a face-to-face meeting with\nDon Lucas Sr\n., one of the most prominent venture capitalists in Silicon Valley, she also managed to persuade him to make a large investment in Theranos. Lucas explained his rationale for that decision in\na 2009 interview\n: “\nHer great-grandfather was an entrepreneur, very successful. And it turned out later that the hospital [near] where [her family] lives is named after her great-uncle.\n”\nApparently, her great uncle’s and great-grandfather’s success was enough for Lucas to invest in her project. I wonder if that same qualification was equally convincing to all other investors? Or was it her passion and charm? Whatever the case, big fish investors gave her more than $750 million, unconcerned about her qualifications or the functioning of her technology.\nThis is all very strange, to put it politely. The media narrative has meanwhile contrived plausible-sounding explanation for this: you see, the big investors gave Holmes a ton of cash because they were just so afraid of missing the next facebook or google. But this explanation is just as unlikely as the rest of the story. Neither do such silly rationalizations explain the massive allocations from a group of top-notch power players, nor the terms of investment that prohibited verification of Theranos technology, nor share prices that valued the fraudulent venture at $9 billion.\nRead the whole thing, because it wasn’t just about making money. It appears to have been some sort of dry run for Covid.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "healthcare",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-22T18:04:20+00:00"
}