{
  "url": "https://voxday.net/2025/09/27/the-selling-of-burrito-mussolini/",
  "scraped_at": "2026-01-08T20:32:25.263401",
  "title": "The Selling of Burrito Mussolini",
  "date_display": "September 27, 2025",
  "date_iso": "2025-09-27T07:43:41+00:00",
  "date_from_url": "2025-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://outgoingmisanthrope.substack.com/p/fuentes-syndrome-and-the-dynamics\">an astute and well-informed analysis</a> of the objectives of the Little Nicky show, with one very important omission:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There are scores of unique ideolectual movements that can be accurately categorized as “rightward,” and each of them has their own set of elites, which in turn have their own leaders who themselves have a retinue of commoner followers. To the outsider and/or normie, these distinctions and competing hierarchies may seem inconsequential, but to the denizens of the Sphere, knowing who stands where, what for, and with who, is requisite to participation. More work needs to be done to catalog, analyze, and understand this ideolectual ecosystem, and I hope someone eventually does put in the time and effort. For our purposes, we are only going to look at one specifically: Fuentes and his “America First” gang. Like Mao, he is a jilted elite, deprived of status and station he feels he deserves. This deprivation is one of the drivers of both his behavior and the rhetorical viscera, by which I mean the connective tissue that between the consolidated memes<a href=\"https://outgoingmisanthrope.substack.com/p/fuentes-syndrome-and-the-dynamics?#footnote-5-168565366\">5</a>. Like Chinese communism prior to the 1950s, his gang may seem powerful regionally, but it is dwarfed by Greater Liberalism, the collection of liberals, progressives, leftists, and their thralls that compose the status quo in the academy, industry, commerce, and society.</p><p>I have to assume some part of Fuentes thought about taking on Greater Liberalism, at some point at least, but that’s a real battle against a dangerous enemy. Fuentes, like Mao, found far more success in attacking fellow travelers who differ in outlook by mere degrees. Like Mao’s battles against the various disparate and similar factions, these tiny and largely inconsequential victories serve to drive expansion of the gang and feed the bloodlust of its members. It must be said that it’s not a waste, it isn’t really counterproductive, because the ostensible Right Wing thought &amp; principles of America First are little more than window dressing for the real goal: <strong>expanding the Fuentes gang</strong>. Everything is about recruitment; use the principles when they serve the purpose of bringing in more gang members, and abandon them when they stand in the way of bringing in more gang members.</p><p>So, Fuentes is pro Trump when it is getting him more adherents, and he is pro Harris when it gets him more adherents. He criticizes blacks when it drives engagement, then plays slap ass with negroes when it drives engagement. <em>Take this lens, “recruitment as the only principle,” and apply it to the history of his “movement,” and the whole thing makes a lot more sense.</em> He’s not a hypocrite, he’s not a traitor, he’s not a fair weather friend; <strong>he’s a gang leader existing in an ecosystem where quantity is the only quality that matters</strong>.</p><p>For the principled Right Winger, this behavior is despicable. It reeks of selfishness, greed, and shortsightedness. But it’s inaccurate to say it is unique to Fuentes. It is, in fact, the rule and not the exception. True, it would be more honest for the gang to be called “Fuentes First,” but honesty in the postmodern media market is the fastest path to irrelevancy.</p></blockquote><p>What is the important omission? What is left out is that none of it is real. Fuentes is no more seeking power than he is interested in any of the various contradictory principles that he has, at one time or another, espoused. What he’s been doing is simply an audition, putting on a test show in order to establish a baseline price for his next gig, which is the replacement for Jordan Peterson as the Voice of the Disaffected Young Men in order to serve as their gatekeeper, keeping them away from Christianity, Nationalism, Family, and the Good, the Beautiful, and the True.</p><p>He’s just the latest in a long line of Men With a Secret, beginning with William F. Buckley, who has been hired to play a role and protect Clown World from its natural enemies.</p><p><em><a href=\"https://socialgalactic.com/micropost/b9187b77-c092-4299-9d5a-d7b6c562334c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\nan astute and well-informed analysis\nof the objectives of the Little Nicky show, with one very important omission:\nThere are scores of unique ideolectual movements that can be accurately categorized as “rightward,” and each of them has their own set of elites, which in turn have their own leaders who themselves have a retinue of commoner followers. To the outsider and/or normie, these distinctions and competing hierarchies may seem inconsequential, but to the denizens of the Sphere, knowing who stands where, what for, and with who, is requisite to participation. More work needs to be done to catalog, analyze, and understand this ideolectual ecosystem, and I hope someone eventually does put in the time and effort. For our purposes, we are only going to look at one specifically: Fuentes and his “America First” gang. Like Mao, he is a jilted elite, deprived of status and station he feels he deserves. This deprivation is one of the drivers of both his behavior and the rhetorical viscera, by which I mean the connective tissue that between the consolidated memes\n5\n. Like Chinese communism prior to the 1950s, his gang may seem powerful regionally, but it is dwarfed by Greater Liberalism, the collection of liberals, progressives, leftists, and their thralls that compose the status quo in the academy, industry, commerce, and society.\nI have to assume some part of Fuentes thought about taking on Greater Liberalism, at some point at least, but that’s a real battle against a dangerous enemy. Fuentes, like Mao, found far more success in attacking fellow travelers who differ in outlook by mere degrees. Like Mao’s battles against the various disparate and similar factions, these tiny and largely inconsequential victories serve to drive expansion of the gang and feed the bloodlust of its members. It must be said that it’s not a waste, it isn’t really counterproductive, because the ostensible Right Wing thought & principles of America First are little more than window dressing for the real goal:\nexpanding the Fuentes gang\n. Everything is about recruitment; use the principles when they serve the purpose of bringing in more gang members, and abandon them when they stand in the way of bringing in more gang members.\nSo, Fuentes is pro Trump when it is getting him more adherents, and he is pro Harris when it gets him more adherents. He criticizes blacks when it drives engagement, then plays slap ass with negroes when it drives engagement.\nTake this lens, “recruitment as the only principle,” and apply it to the history of his “movement,” and the whole thing makes a lot more sense.\nHe’s not a hypocrite, he’s not a traitor, he’s not a fair weather friend;\nhe’s a gang leader existing in an ecosystem where quantity is the only quality that matters\n.\nFor the principled Right Winger, this behavior is despicable. It reeks of selfishness, greed, and shortsightedness. But it’s inaccurate to say it is unique to Fuentes. It is, in fact, the rule and not the exception. True, it would be more honest for the gang to be called “Fuentes First,” but honesty in the postmodern media market is the fastest path to irrelevancy.\nWhat is the important omission? What is left out is that none of it is real. Fuentes is no more seeking power than he is interested in any of the various contradictory principles that he has, at one time or another, espoused. What he’s been doing is simply an audition, putting on a test show in order to establish a baseline price for his next gig, which is the replacement for Jordan Peterson as the Voice of the Disaffected Young Men in order to serve as their gatekeeper, keeping them away from Christianity, Nationalism, Family, and the Good, the Beautiful, and the True.\nHe’s just the latest in a long line of Men With a Secret, beginning with William F. Buckley, who has been hired to play a role and protect Clown World from its natural enemies.\nDISCUSS ON SG",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-27T08:27:57+00:00"
}