{
  "url": "https://voxday.net/2025/09/27/the-schools-arent-magic/",
  "scraped_at": "2026-01-08T20:32:21.487359",
  "title": "The Schools Aren’t Magic",
  "date_display": "September 27, 2025",
  "date_iso": "2025-09-27T14:46:00+00:00",
  "date_from_url": "2025-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Immigrants <a href=\"https://page-one.springer.com/pdf/preview/10.1007/978-94-6091-740-0_14\">are proving literally uneducable</a>(PDF) by the schools in the countries they have invaded:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In spite of the many criticisms to which PISA can and should be legitimately subjected, it is difficult to deny that this large and highly successful OECD project is a blessing for research in Comparative Education, as it provides strictly comparable data on inputs, processes and results for most educational systems in the world. The outcomes of analyzing these enormous data sets are rather disappointing for those who had expected from it quick and solid adjudications among rival theories. First the PISA reports, and then the many reanalyses carried out on the PISA data, have found only very weak relations between students’ outcomes and characteristics of educational systems which are usually thought of<br/>paramount importance (Carabaña, 2008).</p><p>It is from these tenuous links that multilevel regressions extract cross-country coefficients that, when statistically significant, are quite hard to interpret even by the best willed officials and scholars. I will here address the question of the effects that schools in the destination countries have on the academic results of immigrant’s children. Immigration countries have generally better schools and better results than countries of emigration. It is therefore easy to imagine how the desire to improve the schooling conditions of their children might be one important pulling factor for emigrants. However, against all expectations of subjects and observers, immigrant students score in the PISA tests rather like students in their countries of origin than like native students in the countries of destination.</p><p>In spite of the allegedly better schools of the host countries, the learning of the newcomers remains at the level of their origin countries not only in the first generation, but also in the second and even later on.</p></blockquote><p>This is because the differences across humanity are not merely “skin-deep”. The contents of one’s character do matter, but so too do the contents of one’s culture, and even more importantly, one’s genes. An 80-IQ Somali immigrant who attends a good public school in Minneapolis is still going to be an 80-IQ Somali after being given a piece of paper that declares he is educated. So too will his son, and his grandson, and his great-grandson.</p><p>This should be entirely obvious, as the British colonists did not gradually turn into American Indians after four generations in the New World. And the descendants of the African slaves imported into the Americas are still observably distinct in appearance, behavior, and educational outcome after many generations of education in the USA.</p><p><em><a href=\"https://socialgalactic.com/micropost/fc9f902b-3c95-43da-bdda-8c2fb975dbd5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Immigrants\nare proving literally uneducable\n(PDF) by the schools in the countries they have invaded:\nIn spite of the many criticisms to which PISA can and should be legitimately subjected, it is difficult to deny that this large and highly successful OECD project is a blessing for research in Comparative Education, as it provides strictly comparable data on inputs, processes and results for most educational systems in the world. The outcomes of analyzing these enormous data sets are rather disappointing for those who had expected from it quick and solid adjudications among rival theories. First the PISA reports, and then the many reanalyses carried out on the PISA data, have found only very weak relations between students’ outcomes and characteristics of educational systems which are usually thought of\nparamount importance (Carabaña, 2008).\nIt is from these tenuous links that multilevel regressions extract cross-country coefficients that, when statistically significant, are quite hard to interpret even by the best willed officials and scholars. I will here address the question of the effects that schools in the destination countries have on the academic results of immigrant’s children. Immigration countries have generally better schools and better results than countries of emigration. It is therefore easy to imagine how the desire to improve the schooling conditions of their children might be one important pulling factor for emigrants. However, against all expectations of subjects and observers, immigrant students score in the PISA tests rather like students in their countries of origin than like native students in the countries of destination.\nIn spite of the allegedly better schools of the host countries, the learning of the newcomers remains at the level of their origin countries not only in the first generation, but also in the second and even later on.\nThis is because the differences across humanity are not merely “skin-deep”. The contents of one’s character do matter, but so too do the contents of one’s culture, and even more importantly, one’s genes. An 80-IQ Somali immigrant who attends a good public school in Minneapolis is still going to be an 80-IQ Somali after being given a piece of paper that declares he is educated. So too will his son, and his grandson, and his great-grandson.\nThis should be entirely obvious, as the British colonists did not gradually turn into American Indians after four generations in the New World. And the descendants of the African slaves imported into the Americas are still observably distinct in appearance, behavior, and educational outcome after many generations of education in the USA.\nDISCUSS ON SG",
  "tags": [
    "education",
    "immigration",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-27T14:46:00+00:00"
}