{
  "url": "https://voxday.net/2025/09/21/the-coming-brain-drain/",
  "scraped_at": "2026-01-08T20:31:55.738113",
  "title": "Draining the Western Brains",
  "date_display": "September 21, 2025",
  "date_iso": "2025-09-21T15:20:39+00:00",
  "date_from_url": "2025-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>High-level thinkers don’t communicate with the masses because we quite literally can’t. The problem with Western civilization is not that its high-level thinkers are unable to communicate with the masses, because high-level thinkers have never been able to effectively communicate with the masses. It’s a little ironic that one of the better popularizers <a href=\"https://x.com/ItIsHoeMath/status/1969564310310699512\">fails to understand the importance of the popularizer’s role</a> in translating and transmitting the original thinker’s ideas to a public that is more than two standard deviations below him.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I deal with it by showing high-level thinkers how to communicate with the masses.</p><p>Like Wilber and Spiral Dynamics… they CREATED the models that I apply in my work, but they didn’t communicate them in a way that made the average person care. I did. I was like “ARENT BITCHES CRAZY? HERE’S WHY” and showed them.</p><p>High-level thinkers have to use their abilities to appeal to the masses more than everyone else. NO ONE IS COMING TO HELP.</p></blockquote><p>But this isn’t really the issue anyhow. The issue is that the current rulers of Western Civilization hate it and every element of it, and would like nothing better than to destroy it if they could only figure out how to kill the golden goose and yet keep its golden eggs.</p><p>Most high-level thinkers are banished and deprived of platforms and popularizers due to their inability to accept the satanic, anti-Western, anti-Christian, anti-American Narrative that has been required of any public intellectual for the last fifty years.</p><p>As one reader here has noted, China responded to Wang Hunin by promoting him to the Chief Ideologue of the Chinese Communist Party despite the fact that he didn’t even belong to the Party, whereas the USA responded to me by deplatforming me and systematically depriving me of opportunities and resources.</p><p>This isn’t a complaint. It’s merely an observation. One of the benefits of being a high-level thinker is far less interest in the prizes and fancy pants with which the status-obsessed midwits are obsessed. But imagine the amount of scientific resources now being wasted across the West on finding useless results “consistent with the theory of evolution by natural selection” that could be more profitably spent on actual science if I had even a fraction of the respect and institutional support that Mr. Hunin enjoys in China. And that’s just one topic…</p><p>One of the reasons that China has already far surpassed the West, and that Russia inevitably will as well, is that both societies genuinely value their intellectual elites. The West, despite its pretensions to being “an open society” is in an increasingly fragile state of intellectual sclerosis, where even the most obvious truths must go unspoken, and better yet, unobserved. This is why I anticipate that the most promising young Western intellectuals will be officially incentivized to move to China and to Russia over the next three decades, a policy that will eventually be followed by entrepreneurial and technological booms there.</p><p><em><a href=\"https://socialgalactic.com/micropost/4d0eed94-d696-4657-ab06-33578f621041\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "High-level thinkers don’t communicate with the masses because we quite literally can’t. The problem with Western civilization is not that its high-level thinkers are unable to communicate with the masses, because high-level thinkers have never been able to effectively communicate with the masses. It’s a little ironic that one of the better popularizers\nfails to understand the importance of the popularizer’s role\nin translating and transmitting the original thinker’s ideas to a public that is more than two standard deviations below him.\nI deal with it by showing high-level thinkers how to communicate with the masses.\nLike Wilber and Spiral Dynamics… they CREATED the models that I apply in my work, but they didn’t communicate them in a way that made the average person care. I did. I was like “ARENT BITCHES CRAZY? HERE’S WHY” and showed them.\nHigh-level thinkers have to use their abilities to appeal to the masses more than everyone else. NO ONE IS COMING TO HELP.\nBut this isn’t really the issue anyhow. The issue is that the current rulers of Western Civilization hate it and every element of it, and would like nothing better than to destroy it if they could only figure out how to kill the golden goose and yet keep its golden eggs.\nMost high-level thinkers are banished and deprived of platforms and popularizers due to their inability to accept the satanic, anti-Western, anti-Christian, anti-American Narrative that has been required of any public intellectual for the last fifty years.\nAs one reader here has noted, China responded to Wang Hunin by promoting him to the Chief Ideologue of the Chinese Communist Party despite the fact that he didn’t even belong to the Party, whereas the USA responded to me by deplatforming me and systematically depriving me of opportunities and resources.\nThis isn’t a complaint. It’s merely an observation. One of the benefits of being a high-level thinker is far less interest in the prizes and fancy pants with which the status-obsessed midwits are obsessed. But imagine the amount of scientific resources now being wasted across the West on finding useless results “consistent with the theory of evolution by natural selection” that could be more profitably spent on actual science if I had even a fraction of the respect and institutional support that Mr. Hunin enjoys in China. And that’s just one topic…\nOne of the reasons that China has already far surpassed the West, and that Russia inevitably will as well, is that both societies genuinely value their intellectual elites. The West, despite its pretensions to being “an open society” is in an increasingly fragile state of intellectual sclerosis, where even the most obvious truths must go unspoken, and better yet, unobserved. This is why I anticipate that the most promising young Western intellectuals will be officially incentivized to move to China and to Russia over the next three decades, a policy that will eventually be followed by entrepreneurial and technological booms there.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-21T15:23:27+00:00"
}