{
  "url": "https://voxday.net/2025/09/09/we-never-went-to-the-moon/",
  "scraped_at": "2026-01-08T20:31:00.122055",
  "title": "We Never Went to the Moon",
  "date_display": "September 9, 2025",
  "date_iso": "2025-09-09T11:58:57+00:00",
  "date_from_url": "2025-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As the Boomers die out, <a href=\"https://www.unz.com/article/the-moon-landing-a-giant-hoax-for-mankind/\">so too does the belief</a> that the Apollo Moon landings were real.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The moon hoax theory was almost unheard of before the spread of Internet, and gained momentum with the development of YouTube, which allowed close inspection of the Apollo footage by anyone interested. Before that, individuals who had serious doubts had little means to share them and make their case convincing. One pioneer was Bill Kaysing, who broke the subject in 1976 with his self-published book <em>We Never Went to the Moon: America’s Thirty Billion Dollar Swindle</em>. He may be called a whistleblower, since he had been working for Rocketdyne, the company that designed and built the Apollo rockets. Then came Ralph René with his <em>NASA Mooned America!</em>, also self published.</p><p>Research gained depth and scope, and disbelief became epidemic around the 30th anniversary of Apollo 11, thanks in great part to British cinematographer David Percy, who co-authored the book <em>Dark Moon</em> with Mary Bennett, and directed the 3-hour documentary<em> What Happened on the Moon? An Investigation into Apollo</em> (2000), presented by Ronnie Stronge. It remains to this day greatly valuable for anyone willing to make an informed opinion.</p><p>Then there was the much shorter <em>A Funny Thing Happened on the way to the Moon</em> (2001), directed by Bart Sibrel, which brings in valuable insight into the historical context. Sibrel also went around challenging NASA astronauts to swear on the Bible, in front of the camera, that they did walk on the moon, and he compiled these sequences in <em>Astronauts Gone Wild</em>, together with more useful footages of embarrassingly awkward statements made by NASA astronauts who are supposed to have walked on the moon but sound hardly competent and consistent; Alan Bean from Apollo 12 learning from Sibrel that he went through the Van Allen radiation belt is a must-see.</p><p>Then, using materials from those films and other sources, came the groundbreaking TV documentary <em>Did we land on the moon?</em> (2001), directed by John Moffet for Fox TV. To my knowledge and judgment, this is still the best introduction to the arguments of the “moon hoax theorists”.</p></blockquote><p>I don’t believe for one second that the Apollo missions went to the Moon and landed on it. It has all of the characteristics of a government-funded fraud, right down to the equivalent of the “training exercise” of the films made by Stanley Kubrick. There are obviously a whole host of flaws in the Official Story, but the one that finally converted me to a Moon Landing Denier was the “oh, we recorded over the telemetry tapes and then we lost them” excuse that was belatedly produced when skeptics wanted to analyze them.</p><p>It’s worth noting the background of NASA’s first administrator, T. Keith Glennan.</p><p><em>Born in Enderlin, North Dakota, the son of Richard and Margaret Glennan, he attended the University of Wisconsin–Eau Claire and then earned a degree in electrical engineering from the Sheffield Scientific School of Yale University in 1927, where he was a member of Chi Phi fraternity. Following graduation, he became associated with the newly developed sound motion picture industry, and later became assistant general service superintendent for Electrical Research Products Company, a subsidiary of Western Electric Company. During his career he was studio manager of Paramount Pictures, and Samuel Goldwyn Studios.</em></p><p>NASA was a Hollywood operation all along, from the very beginning. And while Ockham’s Razor is not perfectly reliable, it is a reasonable metric that tends to point toward the truth.</p><p>The reason Man has not been back to the Moon is because he never went in the first place.</p><p><em><a href=\"https://socialgalactic.com/micropost/cbc6c469-09a8-44d3-a7cf-97c72d4e5324\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As the Boomers die out,\nso too does the belief\nthat the Apollo Moon landings were real.\nThe moon hoax theory was almost unheard of before the spread of Internet, and gained momentum with the development of YouTube, which allowed close inspection of the Apollo footage by anyone interested. Before that, individuals who had serious doubts had little means to share them and make their case convincing. One pioneer was Bill Kaysing, who broke the subject in 1976 with his self-published book\nWe Never Went to the Moon: America’s Thirty Billion Dollar Swindle\n. He may be called a whistleblower, since he had been working for Rocketdyne, the company that designed and built the Apollo rockets. Then came Ralph René with his\nNASA Mooned America!\n, also self published.\nResearch gained depth and scope, and disbelief became epidemic around the 30th anniversary of Apollo 11, thanks in great part to British cinematographer David Percy, who co-authored the book\nDark Moon\nwith Mary Bennett, and directed the 3-hour documentary\nWhat Happened on the Moon? An Investigation into Apollo\n(2000), presented by Ronnie Stronge. It remains to this day greatly valuable for anyone willing to make an informed opinion.\nThen there was the much shorter\nA Funny Thing Happened on the way to the Moon\n(2001), directed by Bart Sibrel, which brings in valuable insight into the historical context. Sibrel also went around challenging NASA astronauts to swear on the Bible, in front of the camera, that they did walk on the moon, and he compiled these sequences in\nAstronauts Gone Wild\n, together with more useful footages of embarrassingly awkward statements made by NASA astronauts who are supposed to have walked on the moon but sound hardly competent and consistent; Alan Bean from Apollo 12 learning from Sibrel that he went through the Van Allen radiation belt is a must-see.\nThen, using materials from those films and other sources, came the groundbreaking TV documentary\nDid we land on the moon?\n(2001), directed by John Moffet for Fox TV. To my knowledge and judgment, this is still the best introduction to the arguments of the “moon hoax theorists”.\nI don’t believe for one second that the Apollo missions went to the Moon and landed on it. It has all of the characteristics of a government-funded fraud, right down to the equivalent of the “training exercise” of the films made by Stanley Kubrick. There are obviously a whole host of flaws in the Official Story, but the one that finally converted me to a Moon Landing Denier was the “oh, we recorded over the telemetry tapes and then we lost them” excuse that was belatedly produced when skeptics wanted to analyze them.\nIt’s worth noting the background of NASA’s first administrator, T. Keith Glennan.\nBorn in Enderlin, North Dakota, the son of Richard and Margaret Glennan, he attended the University of Wisconsin–Eau Claire and then earned a degree in electrical engineering from the Sheffield Scientific School of Yale University in 1927, where he was a member of Chi Phi fraternity. Following graduation, he became associated with the newly developed sound motion picture industry, and later became assistant general service superintendent for Electrical Research Products Company, a subsidiary of Western Electric Company. During his career he was studio manager of Paramount Pictures, and Samuel Goldwyn Studios.\nNASA was a Hollywood operation all along, from the very beginning. And while Ockham’s Razor is not perfectly reliable, it is a reasonable metric that tends to point toward the truth.\nThe reason Man has not been back to the Moon is because he never went in the first place.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "ONS"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-09-09T12:05:53+00:00"
}