{
  "url": "https://voxday.net/2016/01/20/an-avalanche-of-defaults/",
  "scraped_at": "2025-12-17T17:42:34.579375",
  "title": "An avalanche of defaults",
  "date_display": "January 20, 2016",
  "date_iso": "2016-01-20T13:00:00+00:00",
  "date_from_url": "2016-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mainstream economists are just beginning to catch up with <a href=\"http://amzn.to/1Ow7rI9\"><b><i>The Return of the Great Depression</i></b></a>, published in 2009.</p><blockquote class=\"tr_bq\"><p> The global financial system has become dangerously unstable and faces an avalanche of bankruptcies that will test social and political stability, a leading monetary theorist has warned.</p><p>“The situation is worse than it was in 2007. Our macroeconomic ammunition to fight downturns is essentially all used up,” said William White, the Swiss-based chairman of the OECD’s review committee and former chief economist of the Bank for International Settlements (BIS).</p><p>“Emerging markets were part of the solution after the Lehman crisis. Now they are part of the problem, too. Debts have continued to build up over the last eight years and they have reached such levels in every part of the world that they have become a potent cause for mischief,” he said.</p><p>“It will become obvious in the next recession that many of these debts will never be serviced or repaid, and this will be uncomfortable for a lot of people who think they own assets that are worth something,” he told <i>The Telegraph</i> on the eve of the World Economic Forum in Davos.</p><p>“The only question is whether we are able to look reality in the eye and face what is coming in an orderly fashion, or whether it will be disorderly. Debt jubilees have been going on for 5,000 years, as far back as the Sumerians.”</p><p>The next task awaiting the global authorities is how to manage debt<br> write-offs – and therefore a massive reordering of winners and losers in<br> society – without setting off a political storm.</br></br></p></blockquote><p>What is interesting to consider is if there is a connection between the nonsensical climate change propaganda and the coming avalanche of debt-defaults. If I were a member of the global elite who a) genuinely believed that resources like fossil fuels are limited, b) was in a position to decide how society’s winners and losers would be reordered, and c) did not subscribe to Christian morality and lacked a moral conscience, I would use the financial apocalypse and subsequent reordering to make sure that I, and my allies, held all the title to the resources necessary to ensure our control of them.</p><p>This would permit the construction of a global feudalism and extend the time in which the dwindling resources could be utilized, and would permit aristocratic resource-holders to retain a small First World technological society while the resourceless commoners are reduced to Third World technostasis.</p><p>That doesn’t even rise to the level of science fiction, of course, economics being a science only in the ancient sense of a field of knowledge, but even as pure economic imagination, it’s coherent and perhaps even worrisome in light of the present circumstances.</p></div>",
  "content_text": "The mainstream economists are just beginning to catch up with\nThe Return of the Great Depression\n, published in 2009.\nThe global financial system has become dangerously unstable and faces an avalanche of bankruptcies that will test social and political stability, a leading monetary theorist has warned.\n“The situation is worse than it was in 2007. Our macroeconomic ammunition to fight downturns is essentially all used up,” said William White, the Swiss-based chairman of the OECD’s review committee and former chief economist of the Bank for International Settlements (BIS).\n“Emerging markets were part of the solution after the Lehman crisis. Now they are part of the problem, too. Debts have continued to build up over the last eight years and they have reached such levels in every part of the world that they have become a potent cause for mischief,” he said.\n“It will become obvious in the next recession that many of these debts will never be serviced or repaid, and this will be uncomfortable for a lot of people who think they own assets that are worth something,” he told\nThe Telegraph\non the eve of the World Economic Forum in Davos.\n“The only question is whether we are able to look reality in the eye and face what is coming in an orderly fashion, or whether it will be disorderly. Debt jubilees have been going on for 5,000 years, as far back as the Sumerians.”\nThe next task awaiting the global authorities is how to manage debt\nwrite-offs – and therefore a massive reordering of winners and losers in\nsociety – without setting off a political storm.\nWhat is interesting to consider is if there is a connection between the nonsensical climate change propaganda and the coming avalanche of debt-defaults. If I were a member of the global elite who a) genuinely believed that resources like fossil fuels are limited, b) was in a position to decide how society’s winners and losers would be reordered, and c) did not subscribe to Christian morality and lacked a moral conscience, I would use the financial apocalypse and subsequent reordering to make sure that I, and my allies, held all the title to the resources necessary to ensure our control of them.\nThis would permit the construction of a global feudalism and extend the time in which the dwindling resources could be utilized, and would permit aristocratic resource-holders to retain a small First World technological society while the resourceless commoners are reduced to Third World technostasis.\nThat doesn’t even rise to the level of science fiction, of course, economics being a science only in the ancient sense of a field of knowledge, but even as pure economic imagination, it’s coherent and perhaps even worrisome in light of the present circumstances.",
  "tags": [
    "conspiracy",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-20T13:00:00+00:00"
}