{
  "url": "https://voxday.net/2016/01/11/another-coverup-in-sweden/",
  "scraped_at": "2025-12-17T17:41:15.542957",
  "title": "Another coverup in Sweden",
  "date_display": "January 11, 2016",
  "date_iso": "2016-01-11T10:46:00+00:00",
  "date_from_url": "2016-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A mass sexual assault by immigrants similar to the one in Cologne took place in Stockholm at a concert this summer, but <a href=\"http://nyheteridag.se/exposing-major-pc-cover-up-in-sweden-leading-daily-dagens-nyheter-refused-to-write-about-cologne-like-sex-crimes-in-central-stockholm/\">it was covered up</a> by the Swedish police and media:</p><blockquote class=\"tr_bq\"><p> The Cologne sex assault on New Year’s Eve, where groups of Arab and North African men groped more than a hundred German women, has shocked Europe this last week. But a very similar incident, with a large number of perpetrators and victims, took place in the Swedish capital last summer. That incident however was silenced by large Swedish newspapers and media companies, despite repeated attempts from police officers to contact journalists. This is how leading Swedish newspaper Dagens Nyheter tried to cover up a politically inconvenient sex assault story.</p><p>Nyheter Idag is now able to disclose in detail how major Swedish newspaper Dagens Nyheter deliberately covered up stories about widespread sexual abuse in central Stockholm in connection with a concert in the Kungsträdgården public square this August. “The mere suspicion that the abuse has been considered as difficult to describe involves a betrayal of the victims”,the newspaper writes about the event, almost six months later.</p><p>On Saturday August 15th, the nationally acclaimed and outspoken feminist artist Zara Larsson headlined the youth festival ‘We Are Sthlm” with a crowded concert in Kungsträdgården in central Stockholm. Thousands of young people were in attendance to take part in the event during the last summer nights of the year.</p><p>But for an unknown number of young girls the festival soon became a nightmare. Hordes of young men pressed against young girls, fondled and tried to cop a feel over and under skirts, pants and shirts. There were severe sexual assaults happening right in front of the stage, where artists such as Larsson and rapper OIAM performed.</p><p>During a single night police and security guards had to intervene against around 90 younger males, but even adult men took part in the abuse, says an eye witness to Nyheter Idag. The eye witness has professional experience from working at the Stockholm Police Department as a psychologist.</p><p>The police officer tried to contact Dagens Nyheter several times: “They never called again”</p><p>The psychologist who knew of what had happened in Kungsträdgården contacted journalist Hanne Kjöller at Dagens Nyheter, by, among other things, e-mail on August 17. The psychologist says he specifically turned to Kjöller because he knew that she had previously written about controversial topics.</p><p>“She was very interested and listened until I told her that all the boys and men that were apprehended were young asylants (unaccompanied is the terminology used by Swedish authorities) from Afghanistan and Syria. I sensed that she changed the tone (of her voice).</p></blockquote><p>This is a good example of why you cannot believe ANYTHING that the mainstream media is reporting out of Europe, whether it is about Merkel’s continued “popularity” or the way in which the populations are reacting to the government-enabled invasions of third-world savages.</p><p>The European media is only reporting what it cannot cover up. For example, there is massive resistance to the immivasion across Western Europe, far more than in the USA, as <i>thousands </i>of refugee centers were burned or otherwise attacked across the continent in 2015, but the only images that are shown on the media are idiotic virtue-signalers holding welcome signs.</p><p>The civil war is already being fought, it simply hasn’t turned violent yet. Once the police turn on the governments, or the government uses lethal violence on an anti-invasion activist, or a politician is assassinated, the situation is going to change very rapidly. For better or for worse, I do not know, but to describe the situation as “unstable” would be putting it mildly. The original Saxon has begun to hate, he simply has not yet begun to act.</p><p>As for the Scandinavians, I cannot say, but as I mentioned before, the Vikings would be spinning in their graves at the cowardly acquiescence of their descendants if they had any.</p><p>Allow me to revise my prediction of a few years ago. In light of the scale of the sexual assaults on young European women in England, Sweden, and Germany, it is apparent that Anders Breivik will not be regarded as a Norwegian hero in the future, but as a <i>European </i>hero.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2016/01/rapeculture3-1.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/01/rapeculture3-1.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2016/01/rapeculture3-1.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> <i>“The more of this that people in authority over there do, the more this<br> will end in tears. You can’t last long as an elite at war with your own<br> people.  At some point people have had enough and it becomes “Aristo,<br> aristo a la lanterne.””</br></br></br></i><br> – Sarah Hoyt</br></p></div>",
  "content_text": "A mass sexual assault by immigrants similar to the one in Cologne took place in Stockholm at a concert this summer, but\nit was covered up\nby the Swedish police and media:\nThe Cologne sex assault on New Year’s Eve, where groups of Arab and North African men groped more than a hundred German women, has shocked Europe this last week. But a very similar incident, with a large number of perpetrators and victims, took place in the Swedish capital last summer. That incident however was silenced by large Swedish newspapers and media companies, despite repeated attempts from police officers to contact journalists. This is how leading Swedish newspaper Dagens Nyheter tried to cover up a politically inconvenient sex assault story.\nNyheter Idag is now able to disclose in detail how major Swedish newspaper Dagens Nyheter deliberately covered up stories about widespread sexual abuse in central Stockholm in connection with a concert in the Kungsträdgården public square this August. “The mere suspicion that the abuse has been considered as difficult to describe involves a betrayal of the victims”,the newspaper writes about the event, almost six months later.\nOn Saturday August 15th, the nationally acclaimed and outspoken feminist artist Zara Larsson headlined the youth festival ‘We Are Sthlm” with a crowded concert in Kungsträdgården in central Stockholm. Thousands of young people were in attendance to take part in the event during the last summer nights of the year.\nBut for an unknown number of young girls the festival soon became a nightmare. Hordes of young men pressed against young girls, fondled and tried to cop a feel over and under skirts, pants and shirts. There were severe sexual assaults happening right in front of the stage, where artists such as Larsson and rapper OIAM performed.\nDuring a single night police and security guards had to intervene against around 90 younger males, but even adult men took part in the abuse, says an eye witness to Nyheter Idag. The eye witness has professional experience from working at the Stockholm Police Department as a psychologist.\nThe police officer tried to contact Dagens Nyheter several times: “They never called again”\nThe psychologist who knew of what had happened in Kungsträdgården contacted journalist Hanne Kjöller at Dagens Nyheter, by, among other things, e-mail on August 17. The psychologist says he specifically turned to Kjöller because he knew that she had previously written about controversial topics.\n“She was very interested and listened until I told her that all the boys and men that were apprehended were young asylants (unaccompanied is the terminology used by Swedish authorities) from Afghanistan and Syria. I sensed that she changed the tone (of her voice).\nThis is a good example of why you cannot believe ANYTHING that the mainstream media is reporting out of Europe, whether it is about Merkel’s continued “popularity” or the way in which the populations are reacting to the government-enabled invasions of third-world savages.\nThe European media is only reporting what it cannot cover up. For example, there is massive resistance to the immivasion across Western Europe, far more than in the USA, as\nthousands\nof refugee centers were burned or otherwise attacked across the continent in 2015, but the only images that are shown on the media are idiotic virtue-signalers holding welcome signs.\nThe civil war is already being fought, it simply hasn’t turned violent yet. Once the police turn on the governments, or the government uses lethal violence on an anti-invasion activist, or a politician is assassinated, the situation is going to change very rapidly. For better or for worse, I do not know, but to describe the situation as “unstable” would be putting it mildly. The original Saxon has begun to hate, he simply has not yet begun to act.\nAs for the Scandinavians, I cannot say, but as I mentioned before, the Vikings would be spinning in their graves at the cowardly acquiescence of their descendants if they had any.\nAllow me to revise my prediction of a few years ago. In light of the scale of the sexual assaults on young European women in England, Sweden, and Germany, it is apparent that Anders Breivik will not be regarded as a Norwegian hero in the future, but as a\nEuropean\nhero.\n“The more of this that people in authority over there do, the more this\nwill end in tears. You can’t last long as an elite at war with your own\npeople.  At some point people have had enough and it becomes “Aristo,\naristo a la lanterne.””\n– Sarah Hoyt",
  "tags": [
    "immigration",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-11T10:46:00+00:00"
}