{
  "url": "https://voxday.net/2016/01/01/are-you-ready-for-2016/",
  "scraped_at": "2025-12-17T17:39:54.013712",
  "title": "Are you ready for 2016?",
  "date_display": "January 1, 2016",
  "date_iso": "2016-01-01T13:43:00+00:00",
  "date_from_url": "2016-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Rabid Puppies are stirring in their kennels beneath the Dark Tower, straining at the chains that bind them. The Vile Faceless Minions are being starved, the better to whet their appetites. The Dread Ilk are gearing up and sharpening their blades. The Ilk are oiling their guns and adding to their ammo stores.</p><p>And we’re not alone. Because in 2016, <a href=\"http://www.breitbart.com/tech/2015/12/31/coming-2016-all-out-war-on-so-called-social-justice/\">an all-out war on social justice</a> has been declared.</p><blockquote class=\"tr_bq\"><p> In 2016, battle lines will be drawn. On one side, people of all colours, genders and orientations are rallying around the flag of freedom of speech. On the other, a nasty set of authoritarians are rallying around a flag that identifies as a flag only on Mondays, uses they/them pronouns and will try to get you fired or expelled from school if you forget it.</p><p>Let me explain. In 2015, I saw the seeds of a movement begin to sprout. Across the internet, and even in fear-gripped halls on campuses, young people began to stand up and challenge the humourless, divisive, identity-obsessed elites that have taken over our cultural discourse. People of seemingly disparate interests and politics — gamers, pundits, metalheads, comic book and science fiction fans, atheists, Catholics, conservatives, libertarians and even many disaffected liberals — came together to agree on only one thing: art and culture should be left alone….</p><div class=\"p1\"> Had progressives wanted to stem the tide<br> of cultural libertarianism, the time to do it was a year ago. They could<br> have edged back, been reasonable and won us all over. But instead they<br> doubled down. Fine: now they get to lose. Let’s defend culture and free<br> expression and push these odious halfwits back into their dreary studio<br> apartments filled with cat-piss and alt rock-records and let them know<br> that we’ve decided to opt out of the soft bigotry of San Francisco-style<br> hand-wringing nonsense. We possess a working sense of humour and we’re<br> going to use it — whether they like it or not.</br></br></br></br></br></br></br></br></div><div class=\"p1\">  </div><p>If you take their crybully pronouncements at face value, social justice warriors believe,<br> with all the fervor of a paranoiac, that they are helpless, fragile<br> things, buffeted by sinister structural forces they are powerless to<br> resist. They believe that their opponents possess power that, if used<br> ruthlessly enough, could eradicate them. What do you say we prove them<br> right?</br></br></br></br></br></p></blockquote></div>",
  "content_text": "The Rabid Puppies are stirring in their kennels beneath the Dark Tower, straining at the chains that bind them. The Vile Faceless Minions are being starved, the better to whet their appetites. The Dread Ilk are gearing up and sharpening their blades. The Ilk are oiling their guns and adding to their ammo stores.\nAnd we’re not alone. Because in 2016,\nan all-out war on social justice\nhas been declared.\nIn 2016, battle lines will be drawn. On one side, people of all colours, genders and orientations are rallying around the flag of freedom of speech. On the other, a nasty set of authoritarians are rallying around a flag that identifies as a flag only on Mondays, uses they/them pronouns and will try to get you fired or expelled from school if you forget it.\nLet me explain. In 2015, I saw the seeds of a movement begin to sprout. Across the internet, and even in fear-gripped halls on campuses, young people began to stand up and challenge the humourless, divisive, identity-obsessed elites that have taken over our cultural discourse. People of seemingly disparate interests and politics — gamers, pundits, metalheads, comic book and science fiction fans, atheists, Catholics, conservatives, libertarians and even many disaffected liberals — came together to agree on only one thing: art and culture should be left alone….\nHad progressives wanted to stem the tide\nof cultural libertarianism, the time to do it was a year ago. They could\nhave edged back, been reasonable and won us all over. But instead they\ndoubled down. Fine: now they get to lose. Let’s defend culture and free\nexpression and push these odious halfwits back into their dreary studio\napartments filled with cat-piss and alt rock-records and let them know\nthat we’ve decided to opt out of the soft bigotry of San Francisco-style\nhand-wringing nonsense. We possess a working sense of humour and we’re\ngoing to use it — whether they like it or not.\nIf you take their crybully pronouncements at face value, social justice warriors believe,\nwith all the fervor of a paranoiac, that they are helpless, fragile\nthings, buffeted by sinister structural forces they are powerless to\nresist. They believe that their opponents possess power that, if used\nruthlessly enough, could eradicate them. What do you say we prove them\nright?",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-01T13:43:00+00:00"
}