{
  "url": "https://voxday.net/2016/01/06/better-than-story/",
  "scraped_at": "2025-12-17T17:40:32.364874",
  "title": "Better than the story",
  "date_display": "January 6, 2016",
  "date_iso": "2016-01-06T00:54:00+00:00",
  "date_from_url": "2016-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Quite possibly longer as well. This is an <i>epic </i>review of <a href=\"http://www.goodreads.com/book/show/23522129-if-you-were-a-dinosaur-my-love\">“If You Were a Dinosaur, My Love”</a>:</p><blockquote class=\"tr_bq\"><p> I thought it was cool that the girl narrator loves dinosaurs so much. I<br> mean, really, who doesn’t love dinosaurs? Especially the T-Rex. The<br> Biggest, Meanest Big Bad of the Big Bads. Awesome. Well, ok, a five foot<br> ten inch T-Rex. So not the biggest, but at least the meanest right? And<br> she feeds it live meat and it’s gory, so still cool, right?</br></br></br></br></p><p>Then<br> the T-Rex starts singing lullabies, and performing musical theater.<br> Then it gets married. Whoa. What happened? That’s not the Biggest,<br> Meanest Big Bad of the Big Bads – that’s Hugh Jackman! Which would still<br> be cool if it was Wolverine Hugh Jackman, but it’s not. It’s <em>The Boy from Oz</em><br> Hugh Jackman. The gay Hugh Jackman. Not that there’s anything wrong<br> with being gay. I love gay men. Well, I mean, not like that, I enjoy gay<br> – yes, people, gay people. They’re wonderful.</br></br></br></br></br></br></br></p><p>So just as my<br> attention starts to wander and I’m thinking about Hugh in all his tight<br> glitter clothes and sparkley man glory, well, then suddenly the story<br> twists into this awesome piece of violent dinosaur revenge porn! Just<br> like <em>Man on Fire</em> with Denzel, but toothier!</br></br></br></br></p><p>Now it’s<br> got me again, Hugo award for sure! Men soaked in gin and malice? Oh,<br> yeah, baby, bring me some of that! Ah, I mean, what a beautiful word<br> picture. Men, gin, malice… mmmm… beautiful. So now there is blood<br> everywhere, evil cackling laughter, widows and orphans – wooo! I’m out<br> of my seat cheering on the five foot ten inch T-Rex – and then she’s<br> back talking about a wedding again for gosh sakes. And it’s not even a<br> blood soaked <em>Carrie</em> kinda wedding, but a green chiffon wedding – does Hugh have green eyes? I guess I’ve never looked at his eyes.</br></br></br></br></br></br></br></p><p>Then<br> we find out that the narrator actually hates her fiance because he’s a<br> pussy who can’t win a bar fight! In her imagination she loved this<br> awesome man mincing T-Rex that waded through pools of revenge blood but<br> in real life he was just… a disappointment. He wasn’t the bar fight<br> winning, beer drinking, tattooed, six foot six inch, 300 pound Hells<br> Angel alpha male she wanted, just some New York hipster in skinny jeans<br> who couldn’t take a pool cue across the face.</br></br></br></br></br></br></br></p><p>She wrote this<br> whole story to rip away the tiny bit of masculinity her fiance still<br> possessed. A masculinity wax job. That. Is. Cold. I mean, not every man<br> can be Wolverine Hugh Jackman, but please, why does she hate gay Hugh<br> Jackman so much?</br></br></br></br></p><p>5 Stars for awesome dinosaur revenge porn – minus 4 stars for the homophobia.</p></blockquote></div>",
  "content_text": "Quite possibly longer as well. This is an\nepic\nreview of\n“If You Were a Dinosaur, My Love”\n:\nI thought it was cool that the girl narrator loves dinosaurs so much. I\nmean, really, who doesn’t love dinosaurs? Especially the T-Rex. The\nBiggest, Meanest Big Bad of the Big Bads. Awesome. Well, ok, a five foot\nten inch T-Rex. So not the biggest, but at least the meanest right? And\nshe feeds it live meat and it’s gory, so still cool, right?\nThen\nthe T-Rex starts singing lullabies, and performing musical theater.\nThen it gets married. Whoa. What happened? That’s not the Biggest,\nMeanest Big Bad of the Big Bads – that’s Hugh Jackman! Which would still\nbe cool if it was Wolverine Hugh Jackman, but it’s not. It’s\nThe Boy from Oz\nHugh Jackman. The gay Hugh Jackman. Not that there’s anything wrong\nwith being gay. I love gay men. Well, I mean, not like that, I enjoy gay\n– yes, people, gay people. They’re wonderful.\nSo just as my\nattention starts to wander and I’m thinking about Hugh in all his tight\nglitter clothes and sparkley man glory, well, then suddenly the story\ntwists into this awesome piece of violent dinosaur revenge porn! Just\nlike\nMan on Fire\nwith Denzel, but toothier!\nNow it’s\ngot me again, Hugo award for sure! Men soaked in gin and malice? Oh,\nyeah, baby, bring me some of that! Ah, I mean, what a beautiful word\npicture. Men, gin, malice… mmmm… beautiful. So now there is blood\neverywhere, evil cackling laughter, widows and orphans – wooo! I’m out\nof my seat cheering on the five foot ten inch T-Rex – and then she’s\nback talking about a wedding again for gosh sakes. And it’s not even a\nblood soaked\nCarrie\nkinda wedding, but a green chiffon wedding – does Hugh have green eyes? I guess I’ve never looked at his eyes.\nThen\nwe find out that the narrator actually hates her fiance because he’s a\npussy who can’t win a bar fight! In her imagination she loved this\nawesome man mincing T-Rex that waded through pools of revenge blood but\nin real life he was just… a disappointment. He wasn’t the bar fight\nwinning, beer drinking, tattooed, six foot six inch, 300 pound Hells\nAngel alpha male she wanted, just some New York hipster in skinny jeans\nwho couldn’t take a pool cue across the face.\nShe wrote this\nwhole story to rip away the tiny bit of masculinity her fiance still\npossessed. A masculinity wax job. That. Is. Cold. I mean, not every man\ncan be Wolverine Hugh Jackman, but please, why does she hate gay Hugh\nJackman so much?\n5 Stars for awesome dinosaur revenge porn – minus 4 stars for the homophobia.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-06T00:54:00+00:00"
}