{
  "url": "https://voxday.net/2016/01/30/bolsheviks-always-devour-mensheviks/",
  "scraped_at": "2025-12-17T17:43:56.577036",
  "title": "Bolsheviks always devour the Mensheviks",
  "date_display": "January 30, 2016",
  "date_iso": "2016-01-30T21:59:00+00:00",
  "date_from_url": "2016-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which <a href=\"http://www.independent.co.uk/news/people/richard-dawkins-vdeo-twitter-necss-event-feminism-a6841161.html\">Richard Dawkins is disinvited</a> by a Science and Skepticism conference:</p><blockquote class=\"tr_bq\"><p> Professor Richard Dawkins has had an invitation to speak at a science event withdrawn by organisers for sharing a “highly offensive” video mocking feminists on Twitter.</p><p>Dawkins was scheduled to speak at the Northeast Conference on Science and Skepticism which will take place in New York City in May, but on Thursday organisers issued a statement concerning his participation.</p><p>“The NECSS has withdrawn its invitation to Richard Dawkins to participate at NECSS 2016. We have taken this action in response to Dr. Dawkins’ approving re-tweet of a highly offensive video. We believe strongly in freedom of speech and freedom to express<br> unpopular, and even offensive, views. However, unnecessarily divisive,<br> counterproductive, and even hateful speech runs contrary to our mission<br> and the environment we wish to foster at NECSS. The sentiments expressed<br> in the video do not represent the values of NECSS or its sponsoring<br> organisations.”</br></br></br></br></br></p></blockquote><p>Please. They believe in freedom of speech and the freedom to express offensive views about as strongly as they believe in God, the Resurrection, and the Holy Virgin.</p></div>",
  "content_text": "In which\nRichard Dawkins is disinvited\nby a Science and Skepticism conference:\nProfessor Richard Dawkins has had an invitation to speak at a science event withdrawn by organisers for sharing a “highly offensive” video mocking feminists on Twitter.\nDawkins was scheduled to speak at the Northeast Conference on Science and Skepticism which will take place in New York City in May, but on Thursday organisers issued a statement concerning his participation.\n“The NECSS has withdrawn its invitation to Richard Dawkins to participate at NECSS 2016. We have taken this action in response to Dr. Dawkins’ approving re-tweet of a highly offensive video. We believe strongly in freedom of speech and freedom to express\nunpopular, and even offensive, views. However, unnecessarily divisive,\ncounterproductive, and even hateful speech runs contrary to our mission\nand the environment we wish to foster at NECSS. The sentiments expressed\nin the video do not represent the values of NECSS or its sponsoring\norganisations.”\nPlease. They believe in freedom of speech and the freedom to express offensive views about as strongly as they believe in God, the Resurrection, and the Holy Virgin.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-01-30T21:59:00+00:00"
}