{
  "url": "https://voxday.net/2016/01/09/flying-in-face-of-reality/",
  "scraped_at": "2025-12-17T17:41:00.454276",
  "title": "Flying in the face of reality",
  "date_display": "January 9, 2016",
  "date_iso": "2016-01-09T11:02:00+00:00",
  "date_from_url": "2016-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no doubt that the Germans are going to go full-Nazi as soon as they overthrow their traitorous political class and <a href=\"http://www.dailymail.co.uk/news/article-3391075/Why-Germany-t-face-truth-migrant-sex-attacks-SUE-REID-finds-nation-denial-wave-horrific-attacks-reported-Europe.html\">their corporate PC lobby</a>.</p><blockquote class=\"tr_bq\"><p> The involvement by foreigners flies in the face of Germany’s PC lobby which has ruthlessly called critics of Merkel’s migration programme ‘Nazi’ or ‘racist’.</p><p>Take 59-year-old Akif Pirincci, an outspoken Right-winger and German writer of Turkish origin, who has warned that Christian Germany is becoming Islamic. His books, one of which is called <i>Germany Gone Mad</i>, were best-sellers until last autumn, when big publishers and bookshops chose not to distribute them any more. It is the first time since the Nazi era that such censorship has occurred.</p><p>In another controversy, Catholic journalist Matthias Matussek lost his job at the respected German newspaper Die Welt after he posted his views on November’s massacre in Paris on his personal Facebook page, saying mildly: ‘I think that the terror in Paris will move our (German) debate about open borders and … young Muslim men in our country in an entirely new and fresh direction.’</p><p>Despite the censorship, unpalatable truths have still slipped out. Last month, the interior ministry in the large south-west state of Baden-Wurttemberg published figures on criminal offences committed by asylum seekers between January and November 2015.</p><p>They made alarming reading. Asylum seekers represent one per cent of the population of the state but were involved in five per cent (27,255) of all registered crimes, among them 1,000 cases of grievous bodily harm, 22 of attempted murder, and 700 of domestic burglary. The highest number of offenders were Syrians, committing 5,576 of the offences.</p><p>Andre Schulz, head of Germany’s criminal police association, said recently that in his experience 10 per cent of the migrants would turn to criminality, including theft, sexual assault or drug dealing.</p><p>‘The policy has been to leave the German population in the dark …ordinary citizens are being played for fools,’ he declared.</p></blockquote><p>The same process is at work in the USA. It’s a quantitative difference, not a qualitative one; Germany is getting hit harder and faster. This is why establishing new, Alt Right institutions is an urgent necessity. And they are being developed; I have spoken to three separate groups that are in the process of doing this, so be ready to support them and use them and police them as they begin to appear this year.</p><p>Because, like the snakes they are, the SJWs are going to throw everything they have into trying to strangle them in their cradles.</p></div>",
  "content_text": "I have no doubt that the Germans are going to go full-Nazi as soon as they overthrow their traitorous political class and\ntheir corporate PC lobby\n.\nThe involvement by foreigners flies in the face of Germany’s PC lobby which has ruthlessly called critics of Merkel’s migration programme ‘Nazi’ or ‘racist’.\nTake 59-year-old Akif Pirincci, an outspoken Right-winger and German writer of Turkish origin, who has warned that Christian Germany is becoming Islamic. His books, one of which is called\nGermany Gone Mad\n, were best-sellers until last autumn, when big publishers and bookshops chose not to distribute them any more. It is the first time since the Nazi era that such censorship has occurred.\nIn another controversy, Catholic journalist Matthias Matussek lost his job at the respected German newspaper Die Welt after he posted his views on November’s massacre in Paris on his personal Facebook page, saying mildly: ‘I think that the terror in Paris will move our (German) debate about open borders and … young Muslim men in our country in an entirely new and fresh direction.’\nDespite the censorship, unpalatable truths have still slipped out. Last month, the interior ministry in the large south-west state of Baden-Wurttemberg published figures on criminal offences committed by asylum seekers between January and November 2015.\nThey made alarming reading. Asylum seekers represent one per cent of the population of the state but were involved in five per cent (27,255) of all registered crimes, among them 1,000 cases of grievous bodily harm, 22 of attempted murder, and 700 of domestic burglary. The highest number of offenders were Syrians, committing 5,576 of the offences.\nAndre Schulz, head of Germany’s criminal police association, said recently that in his experience 10 per cent of the migrants would turn to criminality, including theft, sexual assault or drug dealing.\n‘The policy has been to leave the German population in the dark …ordinary citizens are being played for fools,’ he declared.\nThe same process is at work in the USA. It’s a quantitative difference, not a qualitative one; Germany is getting hit harder and faster. This is why establishing new, Alt Right institutions is an urgent necessity. And they are being developed; I have spoken to three separate groups that are in the process of doing this, so be ready to support them and use them and police them as they begin to appear this year.\nBecause, like the snakes they are, the SJWs are going to throw everything they have into trying to strangle them in their cradles.",
  "tags": [
    "Clash of Civilizations",
    "conspiracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-09T11:02:00+00:00"
}