{
  "url": "https://voxday.net/2016/01/08/for-grognards-only/",
  "scraped_at": "2025-12-17T17:40:50.470714",
  "title": "For grognards only",
  "date_display": "January 8, 2016",
  "date_iso": "2016-01-08T00:19:00+00:00",
  "date_from_url": "2016-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to say, I, for one, am really enjoying what Task Force Wargames has been doing over at Castalia. Reading Alex’s post on the old Avalon Hill game, <a href=\"http://www.castaliahouse.com/air-assault-on-crete/\"><i>Air Assault on Crete</i></a>, is the first time I have ever wanted to play that game. The unusual zone control rules sound fascinating, and frankly, superior to the norm.</p><blockquote class=\"tr_bq\"><p> This game is hard. Very hard. Part of why it is hard is because it is rules heavy even for a wargame, but it is doubly so because it is so different from most war games I’ve played. This difficulty is a bit asymmetrical, as many of the special rules apply only to the German player (such as conveys, paratrooper drift and air power) but you’ll find in the options of the advanced game plenty of fiddly bits to keep the Allied player scratching their head and checking the rulebook. You also can’t bring with you any mechanical assumptions you may have based on other similar wargames because so many of those assumptions would be wrong in the case of Air Assault on Crete.</p><p>In several games, fog of war rules may be limited or optional, but I can’t imagine the Allies having a chance in this without the facedown setup. The Germans have to land, take and hold at least one of the three air bases at Maleme, Heraklion and Retimo. In the basic game, the Allies win by preventing this (an almost impossible task). In the advanced game, the Allied player wins by putting up a decent fight and successfully evacuating a sizable portion of their forces. The fog of war effect is continuous throughout the game, in that any Allied units that are not adjacent to German forces or actively being targeted by German bombardment are kept face down. This allows the Allied player to mask his strength and shuffle non-combat units to evac points, but can sometimes be a bit of a hassle, as one will constantly be checking their piles for AA units and defensive artillery anytime anything happens.</p></blockquote><p>This sort of thing isn’t for everyone, or even very many gamers, let alone normal readers, but it is illustrate of the depth to which we intend the Castalia posts to increasingly go. If Wargame Wednesdays aren’t your cup of tea, one of the other days will be. And the newly discovered HP Lovecraft letter <a href=\"http://www.castaliahouse.com/lovecraft-on-culture-the-classics-and-a-merritt/\">that Jeffro posted</a> which mentions A. Merritt’s work is intriguing for any fan of the writer.</p><p>In barely tangential news, I am having a great time reading through the <a href=\"http://www.drivethrurpg.com/product/130926/ACKS-Domains-at-War--Campaigns\"><i>Domains of War</i></a> rules that I acquired as part of the <i>Sinister Stone of Sakkara</i> kickstarter that I backed last year. If they’d been around when I was in junior high, I probably would have played a lot more RPGs. Forget role-playing as an adventurer wandering through caves and dungeons, it’s a lot more interesting to role-play military campaigns and battles.</p></div>",
  "content_text": "I have to say, I, for one, am really enjoying what Task Force Wargames has been doing over at Castalia. Reading Alex’s post on the old Avalon Hill game,\nAir Assault on Crete\n, is the first time I have ever wanted to play that game. The unusual zone control rules sound fascinating, and frankly, superior to the norm.\nThis game is hard. Very hard. Part of why it is hard is because it is rules heavy even for a wargame, but it is doubly so because it is so different from most war games I’ve played. This difficulty is a bit asymmetrical, as many of the special rules apply only to the German player (such as conveys, paratrooper drift and air power) but you’ll find in the options of the advanced game plenty of fiddly bits to keep the Allied player scratching their head and checking the rulebook. You also can’t bring with you any mechanical assumptions you may have based on other similar wargames because so many of those assumptions would be wrong in the case of Air Assault on Crete.\nIn several games, fog of war rules may be limited or optional, but I can’t imagine the Allies having a chance in this without the facedown setup. The Germans have to land, take and hold at least one of the three air bases at Maleme, Heraklion and Retimo. In the basic game, the Allies win by preventing this (an almost impossible task). In the advanced game, the Allied player wins by putting up a decent fight and successfully evacuating a sizable portion of their forces. The fog of war effect is continuous throughout the game, in that any Allied units that are not adjacent to German forces or actively being targeted by German bombardment are kept face down. This allows the Allied player to mask his strength and shuffle non-combat units to evac points, but can sometimes be a bit of a hassle, as one will constantly be checking their piles for AA units and defensive artillery anytime anything happens.\nThis sort of thing isn’t for everyone, or even very many gamers, let alone normal readers, but it is illustrate of the depth to which we intend the Castalia posts to increasingly go. If Wargame Wednesdays aren’t your cup of tea, one of the other days will be. And the newly discovered HP Lovecraft letter\nthat Jeffro posted\nwhich mentions A. Merritt’s work is intriguing for any fan of the writer.\nIn barely tangential news, I am having a great time reading through the\nDomains of War\nrules that I acquired as part of the\nSinister Stone of Sakkara\nkickstarter that I backed last year. If they’d been around when I was in junior high, I probably would have played a lot more RPGs. Forget role-playing as an adventurer wandering through caves and dungeons, it’s a lot more interesting to role-play military campaigns and battles.",
  "tags": [
    "Castalia",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-08T00:19:00+00:00"
}