{
  "url": "https://voxday.net/2016/01/12/kristallnacht-zwei/",
  "scraped_at": "2025-12-17T17:41:26.846984",
  "title": "Kristallnacht Zwei",
  "date_display": "January 12, 2016",
  "date_iso": "2016-01-12T13:00:00+00:00",
  "date_from_url": "2016-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we all know what comes next. The Germans <a href=\"http://www.dailymail.co.uk/news/article-3395246/Hundreds-far-right-protesters-rampage-German-town-Leipzig-destroying-ethnic-restaurants-takeaways-latest-anti-migrant-demonstrations.html\">are beginning to fight back</a> against the invaders of their country:</p><blockquote class=\"tr_bq\"><p> Hundreds of anti-refugee rioters have gone on the rampage in the German city of Leipzig after a demonstration where they called for asylum seekers to be deported and their nation’s borders closed.</p><p>The attacks come just hours after Chancellor Angela Merkel admitted that Europe had lost control of the crisis. The right-wingers broke away from a largely peaceful march in the eastern city to trash the suburb of Connewitz.</p><p>Doner kebab fast food stalls were destroyed, cars set ablaze and shop windows smashed by around 250 hooligans of LEGIDA – the local branch of PEGIDA, the anti-migrant, anti-EU organization which marched against the refugees earlier in the evening.At one point the demonstrators, who threw fireworks at police, attempted to build a barricade in a main street with signs and torn up paving stones before they were dispersed.</p><p>Firemen had to tackle a blaze in the attic of one building set alight by a wayward rocket fired by the rioters. A bus carrying leftist pro-asylum demonstrators was also attacked and seriously damaged.</p><p>Police said they have identified and arrested 211 of the crowd of right-wing hooligans, many of them with criminal records for violence.</p><p>‘This was a serious breach of the peace,’ said a police spokesman, confirming that several police officers were injured in the clashes triggered by simmering anger over the New Year’s Eve mass sex attacks against women in Cologne and several other German cities.</p><p>‘Rape Refugees stay away’ was one of the banners carried during the march, the wording above a silhouette of women running from knife-wielding attackers, one of whom resembled a caricature from Aladdin…. German police say the number of criminal complaints filed after the events on New Year’s Eve in Cologne has risen to 516 – 40 per cent relating to allegations of sexual assault.</p><p>Germany’s FBI, the Federal Criminal Office, said it had information that the surrounding and sexual molestation of women was a ‘familiar phenomenon in some Arab countries.’ Now it is liaising with police in all 16 states of Germany to formulate a strategy on how to combat it in future on German streets. The minister for North Rhine-Westphalia, the German state where Cologne is located, admitted that people of foreign descent were responsible for virtually all of the violence on New Year’s Eve in the city.</p></blockquote><p>One wonders how many of those 516 criminal orcs were arrested, considering how one was shot dead attacking French police last week.</p><p>Revolution is a process. It doesn’t come about overnight, and it is fueled by actions and counteractions alike. The anti-German “authorities”, who are clearly no longer regarded as legitimate by a significant portion of the German people, can arrest as many nationalists as they like. Not only will their actions be regarded as shamefully hypocritical in light of their refusal to arrest the orcs raping and sexually assaulting young German women, but similar tactics didn’t suffice to stop the rise of the National Socialists; you may recall where Hitler wrote the newly legalized <i>Mein Kampf</i>.</p><p>They can’t arrest the entire German population, and the minute the “authorities” shed any German blood, they will become the targets of an enraged nation. This was not “a serious breach of the peace”, it was the first real evidence of the crisis of the German state.</p><p>This is the <i>inevitable </i>result of multiculturalism and a feckless leadership that refuses to govern in the interests of its people.There are now two, and only two, options remaining: peaceful and democratic nationalism or violent and authoritarian ultra-nationalism.</p><p>I pray that the multiculturalists, equalitarians, and anti-nationalists will submit and acquiesce to the former. But I expect them to stubbornly and pridefully resist, and thereby ensure the latter.</p></div>",
  "content_text": "I think we all know what comes next. The Germans\nare beginning to fight back\nagainst the invaders of their country:\nHundreds of anti-refugee rioters have gone on the rampage in the German city of Leipzig after a demonstration where they called for asylum seekers to be deported and their nation’s borders closed.\nThe attacks come just hours after Chancellor Angela Merkel admitted that Europe had lost control of the crisis. The right-wingers broke away from a largely peaceful march in the eastern city to trash the suburb of Connewitz.\nDoner kebab fast food stalls were destroyed, cars set ablaze and shop windows smashed by around 250 hooligans of LEGIDA – the local branch of PEGIDA, the anti-migrant, anti-EU organization which marched against the refugees earlier in the evening.At one point the demonstrators, who threw fireworks at police, attempted to build a barricade in a main street with signs and torn up paving stones before they were dispersed.\nFiremen had to tackle a blaze in the attic of one building set alight by a wayward rocket fired by the rioters. A bus carrying leftist pro-asylum demonstrators was also attacked and seriously damaged.\nPolice said they have identified and arrested 211 of the crowd of right-wing hooligans, many of them with criminal records for violence.\n‘This was a serious breach of the peace,’ said a police spokesman, confirming that several police officers were injured in the clashes triggered by simmering anger over the New Year’s Eve mass sex attacks against women in Cologne and several other German cities.\n‘Rape Refugees stay away’ was one of the banners carried during the march, the wording above a silhouette of women running from knife-wielding attackers, one of whom resembled a caricature from Aladdin…. German police say the number of criminal complaints filed after the events on New Year’s Eve in Cologne has risen to 516 – 40 per cent relating to allegations of sexual assault.\nGermany’s FBI, the Federal Criminal Office, said it had information that the surrounding and sexual molestation of women was a ‘familiar phenomenon in some Arab countries.’ Now it is liaising with police in all 16 states of Germany to formulate a strategy on how to combat it in future on German streets. The minister for North Rhine-Westphalia, the German state where Cologne is located, admitted that people of foreign descent were responsible for virtually all of the violence on New Year’s Eve in the city.\nOne wonders how many of those 516 criminal orcs were arrested, considering how one was shot dead attacking French police last week.\nRevolution is a process. It doesn’t come about overnight, and it is fueled by actions and counteractions alike. The anti-German “authorities”, who are clearly no longer regarded as legitimate by a significant portion of the German people, can arrest as many nationalists as they like. Not only will their actions be regarded as shamefully hypocritical in light of their refusal to arrest the orcs raping and sexually assaulting young German women, but similar tactics didn’t suffice to stop the rise of the National Socialists; you may recall where Hitler wrote the newly legalized\nMein Kampf\n.\nThey can’t arrest the entire German population, and the minute the “authorities” shed any German blood, they will become the targets of an enraged nation. This was not “a serious breach of the peace”, it was the first real evidence of the crisis of the German state.\nThis is the\ninevitable\nresult of multiculturalism and a feckless leadership that refuses to govern in the interests of its people.There are now two, and only two, options remaining: peaceful and democratic nationalism or violent and authoritarian ultra-nationalism.\nI pray that the multiculturalists, equalitarians, and anti-nationalists will submit and acquiesce to the former. But I expect them to stubbornly and pridefully resist, and thereby ensure the latter.",
  "tags": [
    "Clash of Civilizations",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-12T13:00:00+00:00"
}