{
  "url": "https://voxday.net/2016/01/26/lies-about-alt-rig/",
  "scraped_at": "2025-12-17T17:43:17.775241",
  "title": "Lies about the Alt Right",
  "date_display": "January 26, 2016",
  "date_iso": "2016-01-26T13:00:00+00:00",
  "date_from_url": "2016-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cathy Young <a href=\"http://www.newsday.com/opinion/columnists/cathy-young/donald-trump-s-rant-against-political-correctness-is-comfort-food-to-racists-1.11391400\">blatantly lies about the etymology</a> of the term “cuckservative”. And that’s just the start:</p><blockquote class=\"tr_bq\"><p> A few months ago, Trump supporters on the Internet started mocking his<br> conservative detractors with the bizarre slur “cuckservative.” The word<br> is an amalgam of “cuckold” and “conservative,” derived from a<br> pornographic genre in which a man is forced to watch while his wife has<br> sex with another man (who is often black, while the “cuckold” is white).<br> To the white nationalist alt-right, the “cuckservative” is a<br> conservative race traitor who does not prioritize the interests of<br> whites — who, most important, does not seek to restrict nonwhite<br> immigration.</br></br></br></br></br></br></br></br></p></blockquote><p>As those who have read Cuckservative: How “Conservatives” Betrayed America know, the term does not derive from either pornography or race. That is a lie repeatedly bruited about by cuckservatives and others who fear the rise of the Alt Right.</p><p>This is just another attempt by fearful conservatives, who have conserved nothing, to discredit and disqualify. Their cry of “racist, anti-semite, impolite” is their hapless imitation of the SJWs’ “racist, sexist, homophobic, bigot”.</p><p>Conservatives are not our allies. They never were. They are surrender monkeys, and as such they are the subservient allies and handmaidens of the Left.</p><p>And if they are afraid of the Alt Right, just wait until they encounter the Mil Right….</p></div>",
  "content_text": "Cathy Young\nblatantly lies about the etymology\nof the term “cuckservative”. And that’s just the start:\nA few months ago, Trump supporters on the Internet started mocking his\nconservative detractors with the bizarre slur “cuckservative.” The word\nis an amalgam of “cuckold” and “conservative,” derived from a\npornographic genre in which a man is forced to watch while his wife has\nsex with another man (who is often black, while the “cuckold” is white).\nTo the white nationalist alt-right, the “cuckservative” is a\nconservative race traitor who does not prioritize the interests of\nwhites — who, most important, does not seek to restrict nonwhite\nimmigration.\nAs those who have read Cuckservative: How “Conservatives” Betrayed America know, the term does not derive from either pornography or race. That is a lie repeatedly bruited about by cuckservatives and others who fear the rise of the Alt Right.\nThis is just another attempt by fearful conservatives, who have conserved nothing, to discredit and disqualify. Their cry of “racist, anti-semite, impolite” is their hapless imitation of the SJWs’ “racist, sexist, homophobic, bigot”.\nConservatives are not our allies. They never were. They are surrender monkeys, and as such they are the subservient allies and handmaidens of the Left.\nAnd if they are afraid of the Alt Right, just wait until they encounter the Mil Right….",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-26T13:00:00+00:00"
}