{
  "url": "https://voxday.net/2016/01/11/mailvox-cold-consolation/",
  "scraped_at": "2025-12-17T17:41:21.125228",
  "title": "Mailvox: cold consolation",
  "date_display": "January 11, 2016",
  "date_iso": "2016-01-11T17:00:00+00:00",
  "date_from_url": "2016-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This one is for all the Minnesotans:</i></p><p>Ole and Sven die in a snowmobiling accident, drunker than skunks, and go<br> to Hell.</br></p><p>The Devil observes that they are really enjoying themselves. He says to them “Doesn’t the heat and smoke bother you?</p><p>Ole replies, “Vell, ya know, ve’re from nordern Minnesnoowta, da land of<br> snow an ice, an ve’re yust happy fer a chance at varm up a little bit,<br> ya know.”</br></br></p><p>The devil decides that these two aren’t miserable enough and turns up<br> the heat even more. When he returns to the room of the two guys from<br> Minnesota , the devil finds them in light jackets and hats, grilling walleye and drinking beer.</br></br></p><p>The devil is astonished and exclaims, “Everyone down here is in abject<br> misery, and you two seem to be enjoying yourselves?”</br></p><p>Sven replies, “Vell, ya know, ve don’t git too much varm veather up dere<br> at da Falls, so ve’ve yust got at haff a fish fry vhen da veather’s dis<br> nice.”</br></br></p><p>The devil is absolutely furious. He can hardly see straight. Finally he<br> comes up with the answer. The two guys love the heat because they have<br> been cold all their lives. The devil decides to turn all the heat off in<br> Hell. The next morning, the temperature is 60 below zero, icicles are<br> hanging everywhere, and people are shivering so bad that they are unable<br> to wail, moan or gnash their teeth.</br></br></br></br></br></p><p>The devil smiles and heads for the room with Ole and Sven. He gets there<br> and finds them back in their parkas, bomber hats, and mittens. They are<br> jumping up and down, cheering, yelling and screaming like mad men.</br></br></p><p>The devil is dumbfounded, “I don’t understand; when I turn up the heat,<br> you’re happy. Now its freezing cold and you’re still happy. What is<br> wrong with you two?”</br></br></p><p>They both look at the devil in surprise and say, “Vell, don’t ya know,<br> If hell iss froze over, dat must mean da Vikings von da Super Bowl.”</br></p><p><i>It occurs to me that one of the many casualties of the cultural rape of the West is Sven and Ole jokes. Sans a familiarity with Christian culture, there is no joke there. </i></p></div>",
  "content_text": "This one is for all the Minnesotans:\nOle and Sven die in a snowmobiling accident, drunker than skunks, and go\nto Hell.\nThe Devil observes that they are really enjoying themselves. He says to them “Doesn’t the heat and smoke bother you?\nOle replies, “Vell, ya know, ve’re from nordern Minnesnoowta, da land of\nsnow an ice, an ve’re yust happy fer a chance at varm up a little bit,\nya know.”\nThe devil decides that these two aren’t miserable enough and turns up\nthe heat even more. When he returns to the room of the two guys from\nMinnesota , the devil finds them in light jackets and hats, grilling walleye and drinking beer.\nThe devil is astonished and exclaims, “Everyone down here is in abject\nmisery, and you two seem to be enjoying yourselves?”\nSven replies, “Vell, ya know, ve don’t git too much varm veather up dere\nat da Falls, so ve’ve yust got at haff a fish fry vhen da veather’s dis\nnice.”\nThe devil is absolutely furious. He can hardly see straight. Finally he\ncomes up with the answer. The two guys love the heat because they have\nbeen cold all their lives. The devil decides to turn all the heat off in\nHell. The next morning, the temperature is 60 below zero, icicles are\nhanging everywhere, and people are shivering so bad that they are unable\nto wail, moan or gnash their teeth.\nThe devil smiles and heads for the room with Ole and Sven. He gets there\nand finds them back in their parkas, bomber hats, and mittens. They are\njumping up and down, cheering, yelling and screaming like mad men.\nThe devil is dumbfounded, “I don’t understand; when I turn up the heat,\nyou’re happy. Now its freezing cold and you’re still happy. What is\nwrong with you two?”\nThey both look at the devil in surprise and say, “Vell, don’t ya know,\nIf hell iss froze over, dat must mean da Vikings von da Super Bowl.”\nIt occurs to me that one of the many casualties of the cultural rape of the West is Sven and Ole jokes. Sans a familiarity with Christian culture, there is no joke there.",
  "tags": [
    "mailvox",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-11T17:00:00+00:00"
}