{
  "url": "https://voxday.net/2016/01/18/mailvox-leadership-is-socio-sexua/",
  "scraped_at": "2025-12-17T17:42:14.338362",
  "title": "Mailvox: leadership is socio-sexual",
  "date_display": "January 18, 2016",
  "date_iso": "2016-01-18T13:23:00+00:00",
  "date_from_url": "2016-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CD wonders about how socio-sexuality relates to politics:</p><blockquote class=\"tr_bq\"><p> I read <a href=\"http://www.politico.com/magazine/story/2016/01/donald-trump-2016-authoritarian-213533\">an interesting article</a> recently. It was in Politico, but the basis seems sound)</p><p>Putting that together with the various “game” categories you use, it looks to me like there may be a built-in dynamic for people.  When things get really bad, the deltas naturally turn to an alpha who seems to have the right ideas.  It looks like that may have been triggered in the US.</p><p>On a slightly different topic, I have been trying to determine the relative percentages of deltas, betas, and alphas.  By gender, since I think the percentages differ.  (I ignore sigmas, since the percentage is so low, and gammas since — who cares?)  I have some rough numbers from personal experience, but I haven’t been able to find any research which sheds light on this.  Are you aware of any?</p></blockquote><p>There is no way that socio-sexuality doesn’t affect politics. It affects every aspect of human endeavor, and it is a much more reliable predictive model than nearly any form of psychology I’ve ever encountered.</p><p>But you can’t ignore Gammas, in fact, I have constructed a literary theory of socio-sexuality which Delta Man’s has applied to the Gammas that explains a considerable amount of how science fiction has devolved over the years.</p><p>As for research, considering that I expanded the concept and articulated some of the various socio-sexual ranks, I can say with certainty that absolutely zero academic research on the topic has been done. But there will be, because it actually works, not only to explain, but predict.</p><p>I’ll be posting it at Alpha Game later this week, but it was remarkable how much Delta Man’s Gamma model correctly anticipated Naomi Novik’s book <i>Uprooted</i>, which is one of the leading contenders for this year’s Hugo Best Novel. Now, Novik is a woman, not a Gamma, but either what applies to Gammas can be applied to women or Novik is following the Gamma lead in her books.</p><p>Of course, she’s also married to a writer, so… regardless, it is really remarkable how the model can be used to correctly predict not only the behavior, but even the <i>hair color</i>, of the women encountered by the male protagonist.</p></div>",
  "content_text": "CD wonders about how socio-sexuality relates to politics:\nI read\nan interesting article\nrecently. It was in Politico, but the basis seems sound)\nPutting that together with the various “game” categories you use, it looks to me like there may be a built-in dynamic for people.  When things get really bad, the deltas naturally turn to an alpha who seems to have the right ideas.  It looks like that may have been triggered in the US.\nOn a slightly different topic, I have been trying to determine the relative percentages of deltas, betas, and alphas.  By gender, since I think the percentages differ.  (I ignore sigmas, since the percentage is so low, and gammas since — who cares?)  I have some rough numbers from personal experience, but I haven’t been able to find any research which sheds light on this.  Are you aware of any?\nThere is no way that socio-sexuality doesn’t affect politics. It affects every aspect of human endeavor, and it is a much more reliable predictive model than nearly any form of psychology I’ve ever encountered.\nBut you can’t ignore Gammas, in fact, I have constructed a literary theory of socio-sexuality which Delta Man’s has applied to the Gammas that explains a considerable amount of how science fiction has devolved over the years.\nAs for research, considering that I expanded the concept and articulated some of the various socio-sexual ranks, I can say with certainty that absolutely zero academic research on the topic has been done. But there will be, because it actually works, not only to explain, but predict.\nI’ll be posting it at Alpha Game later this week, but it was remarkable how much Delta Man’s Gamma model correctly anticipated Naomi Novik’s book\nUprooted\n, which is one of the leading contenders for this year’s Hugo Best Novel. Now, Novik is a woman, not a Gamma, but either what applies to Gammas can be applied to women or Novik is following the Gamma lead in her books.\nOf course, she’s also married to a writer, so… regardless, it is really remarkable how the model can be used to correctly predict not only the behavior, but even the\nhair color\n, of the women encountered by the male protagonist.",
  "tags": [
    "Alpha Game",
    "politics",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-18T13:23:00+00:00"
}