{
  "url": "https://voxday.net/2016/01/19/memento-mori/",
  "scraped_at": "2025-12-17T17:42:21.360483",
  "title": "Memento mori",
  "date_display": "January 19, 2016",
  "date_iso": "2016-01-19T09:50:00+00:00",
  "date_from_url": "2016-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For me, the best thing about all these Baby Boomer icons beginning to die off is the way that the godless narcissists who made a quasi-religion of them are in total despair about what it says about something they have denied for decades, namely, their own mortality. I don’t think Ed Driscoll is GenX, but he sounds as if he is in <a href=\"https://pjmedia.com/eddriscoll/2015/3/30/eagles-zero-keating-five/\">this take on the Eagles’ breakup</a>:</p><blockquote class=\"tr_bq\"><p> So let me get this straight: throughout the documentary, a running leitmotif is that the band was <i>desperate</i><br> to add some decent rock under their soaring harmony vocals. The band<br> fires British superstar engineer-producer Glyn Johns (whose previous<br> resume included the Stones, the Who, the Beatles, and Led Zeppelin’s<br> first album) because he emphasized their harmonies and country sound. In<br> response, they bring in Joe Walsh to rock out. And finally, when their<br> other guitarist does something <i>that’s actually rock and roll</i> and utters a punk rock-style sneer to corrupt power, the entire band implodes?</br></br></br></br></br></br></p><p>Perfect.</p></blockquote><p>But I’m glad for the many fans of the Eagles that they got one last chance to see the band on tour last year. I’m told it was an excellent concert; while I wasn’t a fan myself, I had a lot of respect for them as songwriters.</p><p>Still, the Baby Boomers are dying, and soon we will have a chance to remake the civilized world they spent fifty years doing their damndest to destroy. Let’s learn from their mistakes, shall we?</p><p>We have certainly learned that nothing good ever comes of believing yourself to be eternally young and cool. And wisdom and experience should always be respected, not dismissed out of hand.</p></div>",
  "content_text": "For me, the best thing about all these Baby Boomer icons beginning to die off is the way that the godless narcissists who made a quasi-religion of them are in total despair about what it says about something they have denied for decades, namely, their own mortality. I don’t think Ed Driscoll is GenX, but he sounds as if he is in\nthis take on the Eagles’ breakup\n:\nSo let me get this straight: throughout the documentary, a running leitmotif is that the band was\ndesperate\nto add some decent rock under their soaring harmony vocals. The band\nfires British superstar engineer-producer Glyn Johns (whose previous\nresume included the Stones, the Who, the Beatles, and Led Zeppelin’s\nfirst album) because he emphasized their harmonies and country sound. In\nresponse, they bring in Joe Walsh to rock out. And finally, when their\nother guitarist does something\nthat’s actually rock and roll\nand utters a punk rock-style sneer to corrupt power, the entire band implodes?\nPerfect.\nBut I’m glad for the many fans of the Eagles that they got one last chance to see the band on tour last year. I’m told it was an excellent concert; while I wasn’t a fan myself, I had a lot of respect for them as songwriters.\nStill, the Baby Boomers are dying, and soon we will have a chance to remake the civilized world they spent fifty years doing their damndest to destroy. Let’s learn from their mistakes, shall we?\nWe have certainly learned that nothing good ever comes of believing yourself to be eternally young and cool. And wisdom and experience should always be respected, not dismissed out of hand.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-19T09:50:00+00:00"
}