{
  "url": "https://voxday.net/2016/01/20/more-sjw-attacks-in-tec/",
  "scraped_at": "2025-12-17T17:42:40.154562",
  "title": "More SJW attacks in tech",
  "date_display": "January 20, 2016",
  "date_iso": "2016-01-20T21:31:00+00:00",
  "date_from_url": "2016-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An SJW entryist <a href=\"https://bugs.ruby-lang.org/issues/12004#change-56140\">attacks Ruby</a>. Note the appeals to “everyone’s doing it” as well as how quickly SJWs line up to endorse it in an attempt to create momentum for the Code of Conduct that will allow them to take over the project:</p><blockquote class=\"tr_bq\"><p> Code of Conduct<br> Added by Coraline Ada Ehmke 2 days ago.</br></p><p>I am the creator of the Contributor Covenant, a code of conduct for Open Source projects. At last count there are over 13,000 projects on Github that have adopted it. This past year saw adoption of Contributor Covenant by a lot of very large, very visible projects, including Rails, Github’s Atom text editor, Angular JS, bundler, curl, diaspora, discourse, Eclipse, rspec, shoes, and rvm. The bundler team made code of conduct integration an option in the gem creation workflow, putting it on par with license selection. Many open source language communities have already adopted the code of conduct, including Elixir, Mono, the .NET foundation, F#, and Apple’s Swift. RubyTogether also adopted a policy to only fund Ruby projects that had a solid code of conduct in place.</p><p>Right now in the PHP community there is a healthy debate about adopting the Contributor Covenant. Since it came from and has been so widely adopted by the Ruby community at large, I think it’s time that we consider adopting it for the core Ruby language as well.</p><p>Our community prides itself on niceness. What a code of conduct does is define what we mean by nice. It states clearly that we value openness, courtesy, and compassion. That we care about and want contributions from people who may be different from us. That we pledge to respect all contributors regardless of their race, gender, sexual orientation, or other factors. And it makes it clear that we are prepared to follow through on these values with action when and if an incident arises.</p><p>I’m asking that we join with the larger Ruby community in supporting the adoption of the Contributor Covenant for the Ruby language. I think that this will be an important step forward and will ensure the continued welcoming and supportive environment around Ruby. You can read the full text of the Contributor Covenant at http://contributor-covenant.org/version/1/3/0/ and learn more at http://contributor-covenant.org/.</p><p>Thanks for your consideration and I look forward to hearing your thoughts.</p></blockquote><p>I also enjoyed the false claims about a community to which he doesn’t even belong. I’ve seen this cookie-cutter approach being used in various projects. The problem is that most of the respondents don’t understand what is going on and are taking the entryist at face value. This guy, however, does:</p><blockquote class=\"tr_bq\"><p> Yes, we know who you are. To everyone reading this thread, please take time to read the following by ESR (Eric Raymond). http://esr.ibiblio.org/?p=6918 (Why Hackers Must Eject the SJWs)</p><p>You now have the basic information behind why people are attempting to wedge in CoCs…. If any sort of CoC is adopted, let’s adopt one like the <a href=\"https://github.com/rosarior/Code-of-Merit\">“Code of Merit”</a> where people who do great work are the ones working up the chain with the purpose of being a leader in the community.</p></blockquote><p>However, even this response makes the mistake of nodding to equality and so forth. They prey on that sort of niceness and tolerance. <i>“What’s important in this process however is that people who might<br> otherwise feel excluded from certain open source communities be involved<br> in shaping the final code of conduct.”</br></br></i> Reject it. Reject ALL of it. Let those hypothetical people feel excluded. Give them no ground whatsoever.</p></div>",
  "content_text": "An SJW entryist\nattacks Ruby\n. Note the appeals to “everyone’s doing it” as well as how quickly SJWs line up to endorse it in an attempt to create momentum for the Code of Conduct that will allow them to take over the project:\nCode of Conduct\nAdded by Coraline Ada Ehmke 2 days ago.\nI am the creator of the Contributor Covenant, a code of conduct for Open Source projects. At last count there are over 13,000 projects on Github that have adopted it. This past year saw adoption of Contributor Covenant by a lot of very large, very visible projects, including Rails, Github’s Atom text editor, Angular JS, bundler, curl, diaspora, discourse, Eclipse, rspec, shoes, and rvm. The bundler team made code of conduct integration an option in the gem creation workflow, putting it on par with license selection. Many open source language communities have already adopted the code of conduct, including Elixir, Mono, the .NET foundation, F#, and Apple’s Swift. RubyTogether also adopted a policy to only fund Ruby projects that had a solid code of conduct in place.\nRight now in the PHP community there is a healthy debate about adopting the Contributor Covenant. Since it came from and has been so widely adopted by the Ruby community at large, I think it’s time that we consider adopting it for the core Ruby language as well.\nOur community prides itself on niceness. What a code of conduct does is define what we mean by nice. It states clearly that we value openness, courtesy, and compassion. That we care about and want contributions from people who may be different from us. That we pledge to respect all contributors regardless of their race, gender, sexual orientation, or other factors. And it makes it clear that we are prepared to follow through on these values with action when and if an incident arises.\nI’m asking that we join with the larger Ruby community in supporting the adoption of the Contributor Covenant for the Ruby language. I think that this will be an important step forward and will ensure the continued welcoming and supportive environment around Ruby. You can read the full text of the Contributor Covenant at http://contributor-covenant.org/version/1/3/0/ and learn more at http://contributor-covenant.org/.\nThanks for your consideration and I look forward to hearing your thoughts.\nI also enjoyed the false claims about a community to which he doesn’t even belong. I’ve seen this cookie-cutter approach being used in various projects. The problem is that most of the respondents don’t understand what is going on and are taking the entryist at face value. This guy, however, does:\nYes, we know who you are. To everyone reading this thread, please take time to read the following by ESR (Eric Raymond). http://esr.ibiblio.org/?p=6918 (Why Hackers Must Eject the SJWs)\nYou now have the basic information behind why people are attempting to wedge in CoCs…. If any sort of CoC is adopted, let’s adopt one like the\n“Code of Merit”\nwhere people who do great work are the ones working up the chain with the purpose of being a leader in the community.\nHowever, even this response makes the mistake of nodding to equality and so forth. They prey on that sort of niceness and tolerance.\n“What’s important in this process however is that people who might\notherwise feel excluded from certain open source communities be involved\nin shaping the final code of conduct.”\nReject it. Reject ALL of it. Let those hypothetical people feel excluded. Give them no ground whatsoever.",
  "tags": [
    "CoC",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-20T21:31:00+00:00"
}