{
  "url": "https://voxday.net/2016/01/13/musings-on-immigration-part-i/",
  "scraped_at": "2025-12-17T17:41:36.759844",
  "title": "Musings on Immigration, Part I",
  "date_display": "January 13, 2016",
  "date_iso": "2016-01-13T09:15:00+00:00",
  "date_from_url": "2016-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is a guest post from an acquaintance of mine with an interest in history. While I don’t agree with all of it, I thought his perspective was interesting and worth sharing here. – Vox </i></p><p>The mass sexual assaults that blighted Cologne – and the despicable response of Cologne mayor Henriette Reker – has highlighted, once again, the danger facing Europe.  Indeed, Europe has not faced a danger like this since the final days of the Roman Empire, when the once-proud society could no longer muster the will to marshal its still quite-considerable resources and fight the barbarian incursion.  Rome committed suicide a very long time before Rome itself was stormed.</p><p>Committed suicide?  Yes, it did; very few Romans truly believed that it was worth trying to fight to save Rome.  The elites cared nothing for the suffering of their people, who found the barbarians potential allies in the face of crushing taxation and heavy oppression; the civil bureaucracy was bloated and corrupt; the army too weak to crush the barbarians … Rome decayed from within long before the end finally came. And that, alas, may be the fate of Western Europe, unless we take steps now.</p><p>Let me see if I can place the current danger in historical context.</p><p>The Second World War did immense physical and psychological damage to Europe.  Physically, the continent lay in ruins; France, Denmark, the Netherlands and Norway had been invaded and occupied, Germany had been crushed and then split in two, Britain had escaped occupation, but had exhausted itself trying to win the war.  Psychologically, the continent’s self-confidence had been destroyed.  Nationalism and militarism had been thoroughly discredited.  Worse, perhaps, Europe was no longer a power in the world.  Power had passed firmly to the USA and the USSR.</p><p>If this wasn’t bad enough, the Cold War created a whole series of additional problems.  Western Europe needed the United States, as the US was the only hope of a conventional defence against the USSR.  But Europe was (rightly) terrified of a Third World War.  The USSR might not be able to do more than limited damage to the USA, yet there was no doubt that the USSR could turn Western Europe into a radioactive wasteland.  Victory would be a meaningless phrase.  This spurred a Europe-wide policy that, on one hand, fought to keep the US engaged and, on the other hand, restrain the US from picking a fight with the USSR.</p><p>The European nightmare was a flashpoint in East Asia – a second Korean War, perhaps – that turned into a general war.  Much of the anti-Americanism that pervades European thought owes its origins to the concern that America would trigger an unwinnable (for Europe) war.</p><p>Meanwhile, there was also a serious need to curb the appeal of communism.    Post-war Europeans were desperate.  The USSR might not need to invade to take over.  European elites countered this by creating both a social welfare system – intent on reducing human misery, which fed radicalism – and working desperately to build up Europe’s economy, while relying on the US to guarantee security and keep the Germans in their place.</p><p>It was into this poisoned environment that the first waves of mass migration arrived.</p><p>There are, I should note before I go any further, two different types of immigration.  The first is the single person or handful of people who move to a new country and adapt to their new environment.  They speak the language, they marry natives and generally they repay their hosts for welcoming them.  Such immigrants are a blessing and very few people would argue otherwise.  They may look different, but they’re largely culturally identical to the natives.  Their children don’t think of themselves as anything else.</p><p>This isn’t a comfortable process.  Moving from Britain to America, two nations that are practically cousins, can cause no end of culture shock.  The immigrant may feel overwhelmed, or out of place, and unsure if he truly wants to belong.  But the single immigrant, the isolated case, is surrounded by people from the new country.  He has no choice, but to learn to become like them – or at least to learn how to get along.</p><p>The second type, by contrast, occurs when a large number of migrants arrives at roughly the same time.  They may have decent motives, like the first type, but they have a tendency to clump together with their own kind.  That’s human nature.  That’s why you see expatriate settlements of Westerners in many countries; they prefer the company of their fellow Westerners to the natives.  They have no strong incentive to go native.  Indeed, they may have a strong disincentive to go native, because the familiarity of home is all around them.  Being with people who think like you is comforting, particularly when you are surrounded by a much larger community that doesn’t.</p><p>But it is this form of immigration that has caused many of our problems.  To paraphrase a line from SM Stirling, flavouring the stew is one thing, but making a whole new stew pot is quite another.</p><p>Europe’s first wave of migrants were mainly the products of decolonisation.  For example, A large number of Indians arrived in Britain from Uganda after they were evicted by Idi Amin.  France took in a vast number of Arabs from North Africa after losing a war in Algeria and its colony there.  Their arrival was not warmly welcomed by many of the locals, which caused major problems for the elites.  A rise in nationalism would doom the planned confederation of European states (which eventually would become the European Union) and potentially reawaken dangers that had nearly ripped the continent apart twice.  Their response was to slander everyone who objected as fascists, and to draw links between them and the Nazis (it helped that some of the objectors were genuine fascists).  There was considerable grassroots opposition to immigration, but very little <i>political </i>opposition.</p><p>The increasing numbers of migrants, however, started to produce a whole new stew pot of ethnic minority communities.  Their existence as potential voters, combined with concessions by politicians, allowed them to bring in even more immigrants.  Why should a family not be allowed to live in the West, they asked, when the head of the household already has permission to reside there?  Boys and girls raised in Britain, for example,  were pushed into marrying boys and girls back home, who would then apply for immigration rights as spouses of British citizens.  Instead of assimilating, the constant arrival of newcomers ensured that the communities remained isolated.</p><p>This probably requires some explanation.  If you grow up in a minority community, much of your identity is drawn from the fact that you are not part of the majority.   You will be surrounded by people who are like you, by a tribe united against the outside world, a tribe that has strong ties to the homeland.  Doing something without being noticed by someone who will report back to your parents is extremely difficult, particularly if you are a young girl.  Many of the older folks don’t speak the native tongue.  A dissident trapped within such a community, like a girl who doesn’t want to be forced into marriage, has very little hope of leaving it. And if she does, she is cut off from the community forever.</p><p>Indeed, one explanation for the spread of radical Islam to the young is that it has an appeal to children who are otherwise tightly controlled by their parents. They find that they can embrace the religion and use it to shame their parents who are not practicing Muslims.</p><p>The larger the community, the less truck it has with outsiders.  It doesn’t care for outside interference, nor for outside law.  Attempts to impose even the basics of Western law in minority communities meet with heavy resistance: Western law, after all, does not run in non-Western countries.  Customs ranging from female circumcision to arranged and forced marriages were traditional, after all.</p><p>Europe blinked. The societies that had once said:<i> “this burning of widows is your custom; prepare the funeral pile. But my nation has also a custom.  When men burn women alive we hang them, and confiscate all their property.  My carpenters shall therefore erect gibbets on which to hang all concerned when the widow is consumed.  Let us all act according to national customs”</i> no longer had the self-confidence to impose its will on the outsiders.  The elites were still nervous about the resurgence of nationalism, so they did their best to smooth over the problem.</p><p>Their solution to this problem was to promote the doctrine of multiculturalism, the belief that all societies – at base – were equal.  This was based on an insultingly obvious lie and a cringingly unavoidable contradiction.  The lie was the claim that all societies were equal – a society that believes in equal rights for women is far superior to one that believes that women are second-class at best, chattel at worst – and the contradiction was that everyone believed in the doctrine of multiculturalism.  Multiculturalism, in short, was based on a premise that all cultures were of one mind on the matter of multiculturalism.  By its very nature, multiculturalism proved that multiculturalism did not work – and never could.</p><p>And yet, those who disagreed with the premise were attacked as racists.  There was no attempt to study the problem logically – there could be no such attempt, as far as the elites were concerned – and so the problem continued to fester.  Or, put another way, European law largely surrendered control over the territories.  As native power and authority receded, elements that wanted autonomy gained in power.</p><p>This was disastrous.  Young men raised within the communities, for example, were not taught to accept that women were equal.  Women did not have control over their own bodies.  A girl might be defended by her family, but she could not defend herself.  Young men, raised on something that might well be called rape culture and imbued with barbaric views on women, knowing better than to touch a girl with a family that might avenge her (but also might insist she married her rapist to restore the family honour), caused no end of trouble with ‘white sluts.’  This problem is hardly unique, either.  Serious sexual assaults are alarmingly common in countries where women are regarded as second-class citizens.</p><p>There was a second effect that was not noticed at the time, although it should have been predictable.  Dissidents within the communities were either driven out or silenced.  The problem with looking for moderate Muslims is not that they don’t exist, but that any moderate Muslim with half a brain knows that if he sticks his head up he’ll lose it.  A combination of the unwillingness of the native law to defend free speech and the absolute willingness of the extremists to crush it has silenced most of the moderates.  Those who are not silent live in fear for their lives.</p><p>The problems facing Europe now – after 9/11, after Paris, after Cologne – are twofold.  First, there is the presence of large communities that are disconnected from the native culture, that do not share its views, that are dominated by aggressive and forceful leaders intent on stamping their values on everyone else.  Attacks on natives, Jews, women and everyone who dares support Israel or speak out against Islam are increasing rapidly.  A climate of fear is spreading its wings over Europe.</p><p>The vast majority of those communities may not be violent, but it doesn’t matter.  A relative handful of insurgents, as the British discovered in Northern Ireland, can make life difficult for the authorities for years.  Ordinary Irish citizens either supported the insurgents, even if they weren’t actual fighters themselves, or were intimidated into silence.  It is far too easy to imagine community leaders in the no-go zones refusing to hand over suspects to the police, because they would probably lose their positions – and their heads – if they did.</p><p>The second problem, however, is the feckless behaviour of the European elites, particularly Germany.  Opening up the borders and allowing uncounted numbers of migrants, mainly young men, to enter was utterly insane.  It was preposterous to believe that they would automatically embrace European values, when they were neither raised in them nor given a strong reason to assimilate.  Instead, raised in societies where trusting someone outside your family is stupid, they represent a major danger to European society.  The European elites were willing to sacrifice the peace and safety of European citizens so they could feel good about themselves.  And the attacks on New Year’s Eve have blown their desperate attempts to cover up the scale of the problem right out of the water.</p><p>I rather doubt the next five years are going to be peaceful.</p><p>The question now is simple; can European governments, and Europeans themselves, muster the strength to tackle the problem before it becomes any worse?</p><p>Frankly, there are only a handful of possible outcomes.  Resolute steps now may stem the crisis without mass slaughter and effective genocide.  This requires European governments to work up the nerve to take action and swallow the criticism they will receive from their fellow-travellers on the left.  Alternatively, strong right-wing governments may be elected, which will have a brief to crush the threat using all necessary measures.  The problem with electing a strong man, as many countries have found out to their cost, is that getting rid of him after he has served his purpose is incredibly difficult.</p><p>But those are the cheerful options.  The others include mass flight from Europe, civil war, balkanisation and a descent into the darkness currently enwrapping the Middle East in its shroud.</p><p>I will address the steps European Governments can take, now, to deal with the crisis in the next article.</p></div>",
  "content_text": "This is a guest post from an acquaintance of mine with an interest in history. While I don’t agree with all of it, I thought his perspective was interesting and worth sharing here. – Vox\nThe mass sexual assaults that blighted Cologne – and the despicable response of Cologne mayor Henriette Reker – has highlighted, once again, the danger facing Europe.  Indeed, Europe has not faced a danger like this since the final days of the Roman Empire, when the once-proud society could no longer muster the will to marshal its still quite-considerable resources and fight the barbarian incursion.  Rome committed suicide a very long time before Rome itself was stormed.\nCommitted suicide?  Yes, it did; very few Romans truly believed that it was worth trying to fight to save Rome.  The elites cared nothing for the suffering of their people, who found the barbarians potential allies in the face of crushing taxation and heavy oppression; the civil bureaucracy was bloated and corrupt; the army too weak to crush the barbarians … Rome decayed from within long before the end finally came. And that, alas, may be the fate of Western Europe, unless we take steps now.\nLet me see if I can place the current danger in historical context.\nThe Second World War did immense physical and psychological damage to Europe.  Physically, the continent lay in ruins; France, Denmark, the Netherlands and Norway had been invaded and occupied, Germany had been crushed and then split in two, Britain had escaped occupation, but had exhausted itself trying to win the war.  Psychologically, the continent’s self-confidence had been destroyed.  Nationalism and militarism had been thoroughly discredited.  Worse, perhaps, Europe was no longer a power in the world.  Power had passed firmly to the USA and the USSR.\nIf this wasn’t bad enough, the Cold War created a whole series of additional problems.  Western Europe needed the United States, as the US was the only hope of a conventional defence against the USSR.  But Europe was (rightly) terrified of a Third World War.  The USSR might not be able to do more than limited damage to the USA, yet there was no doubt that the USSR could turn Western Europe into a radioactive wasteland.  Victory would be a meaningless phrase.  This spurred a Europe-wide policy that, on one hand, fought to keep the US engaged and, on the other hand, restrain the US from picking a fight with the USSR.\nThe European nightmare was a flashpoint in East Asia – a second Korean War, perhaps – that turned into a general war.  Much of the anti-Americanism that pervades European thought owes its origins to the concern that America would trigger an unwinnable (for Europe) war.\nMeanwhile, there was also a serious need to curb the appeal of communism.    Post-war Europeans were desperate.  The USSR might not need to invade to take over.  European elites countered this by creating both a social welfare system – intent on reducing human misery, which fed radicalism – and working desperately to build up Europe’s economy, while relying on the US to guarantee security and keep the Germans in their place.\nIt was into this poisoned environment that the first waves of mass migration arrived.\nThere are, I should note before I go any further, two different types of immigration.  The first is the single person or handful of people who move to a new country and adapt to their new environment.  They speak the language, they marry natives and generally they repay their hosts for welcoming them.  Such immigrants are a blessing and very few people would argue otherwise.  They may look different, but they’re largely culturally identical to the natives.  Their children don’t think of themselves as anything else.\nThis isn’t a comfortable process.  Moving from Britain to America, two nations that are practically cousins, can cause no end of culture shock.  The immigrant may feel overwhelmed, or out of place, and unsure if he truly wants to belong.  But the single immigrant, the isolated case, is surrounded by people from the new country.  He has no choice, but to learn to become like them – or at least to learn how to get along.\nThe second type, by contrast, occurs when a large number of migrants arrives at roughly the same time.  They may have decent motives, like the first type, but they have a tendency to clump together with their own kind.  That’s human nature.  That’s why you see expatriate settlements of Westerners in many countries; they prefer the company of their fellow Westerners to the natives.  They have no strong incentive to go native.  Indeed, they may have a strong disincentive to go native, because the familiarity of home is all around them.  Being with people who think like you is comforting, particularly when you are surrounded by a much larger community that doesn’t.\nBut it is this form of immigration that has caused many of our problems.  To paraphrase a line from SM Stirling, flavouring the stew is one thing, but making a whole new stew pot is quite another.\nEurope’s first wave of migrants were mainly the products of decolonisation.  For example, A large number of Indians arrived in Britain from Uganda after they were evicted by Idi Amin.  France took in a vast number of Arabs from North Africa after losing a war in Algeria and its colony there.  Their arrival was not warmly welcomed by many of the locals, which caused major problems for the elites.  A rise in nationalism would doom the planned confederation of European states (which eventually would become the European Union) and potentially reawaken dangers that had nearly ripped the continent apart twice.  Their response was to slander everyone who objected as fascists, and to draw links between them and the Nazis (it helped that some of the objectors were genuine fascists).  There was considerable grassroots opposition to immigration, but very little\npolitical\nopposition.\nThe increasing numbers of migrants, however, started to produce a whole new stew pot of ethnic minority communities.  Their existence as potential voters, combined with concessions by politicians, allowed them to bring in even more immigrants.  Why should a family not be allowed to live in the West, they asked, when the head of the household already has permission to reside there?  Boys and girls raised in Britain, for example,  were pushed into marrying boys and girls back home, who would then apply for immigration rights as spouses of British citizens.  Instead of assimilating, the constant arrival of newcomers ensured that the communities remained isolated.\nThis probably requires some explanation.  If you grow up in a minority community, much of your identity is drawn from the fact that you are not part of the majority.   You will be surrounded by people who are like you, by a tribe united against the outside world, a tribe that has strong ties to the homeland.  Doing something without being noticed by someone who will report back to your parents is extremely difficult, particularly if you are a young girl.  Many of the older folks don’t speak the native tongue.  A dissident trapped within such a community, like a girl who doesn’t want to be forced into marriage, has very little hope of leaving it. And if she does, she is cut off from the community forever.\nIndeed, one explanation for the spread of radical Islam to the young is that it has an appeal to children who are otherwise tightly controlled by their parents. They find that they can embrace the religion and use it to shame their parents who are not practicing Muslims.\nThe larger the community, the less truck it has with outsiders.  It doesn’t care for outside interference, nor for outside law.  Attempts to impose even the basics of Western law in minority communities meet with heavy resistance: Western law, after all, does not run in non-Western countries.  Customs ranging from female circumcision to arranged and forced marriages were traditional, after all.\nEurope blinked. The societies that had once said:\n“this burning of widows is your custom; prepare the funeral pile. But my nation has also a custom.  When men burn women alive we hang them, and confiscate all their property.  My carpenters shall therefore erect gibbets on which to hang all concerned when the widow is consumed.  Let us all act according to national customs”\nno longer had the self-confidence to impose its will on the outsiders.  The elites were still nervous about the resurgence of nationalism, so they did their best to smooth over the problem.\nTheir solution to this problem was to promote the doctrine of multiculturalism, the belief that all societies – at base – were equal.  This was based on an insultingly obvious lie and a cringingly unavoidable contradiction.  The lie was the claim that all societies were equal – a society that believes in equal rights for women is far superior to one that believes that women are second-class at best, chattel at worst – and the contradiction was that everyone believed in the doctrine of multiculturalism.  Multiculturalism, in short, was based on a premise that all cultures were of one mind on the matter of multiculturalism.  By its very nature, multiculturalism proved that multiculturalism did not work – and never could.\nAnd yet, those who disagreed with the premise were attacked as racists.  There was no attempt to study the problem logically – there could be no such attempt, as far as the elites were concerned – and so the problem continued to fester.  Or, put another way, European law largely surrendered control over the territories.  As native power and authority receded, elements that wanted autonomy gained in power.\nThis was disastrous.  Young men raised within the communities, for example, were not taught to accept that women were equal.  Women did not have control over their own bodies.  A girl might be defended by her family, but she could not defend herself.  Young men, raised on something that might well be called rape culture and imbued with barbaric views on women, knowing better than to touch a girl with a family that might avenge her (but also might insist she married her rapist to restore the family honour), caused no end of trouble with ‘white sluts.’  This problem is hardly unique, either.  Serious sexual assaults are alarmingly common in countries where women are regarded as second-class citizens.\nThere was a second effect that was not noticed at the time, although it should have been predictable.  Dissidents within the communities were either driven out or silenced.  The problem with looking for moderate Muslims is not that they don’t exist, but that any moderate Muslim with half a brain knows that if he sticks his head up he’ll lose it.  A combination of the unwillingness of the native law to defend free speech and the absolute willingness of the extremists to crush it has silenced most of the moderates.  Those who are not silent live in fear for their lives.\nThe problems facing Europe now – after 9/11, after Paris, after Cologne – are twofold.  First, there is the presence of large communities that are disconnected from the native culture, that do not share its views, that are dominated by aggressive and forceful leaders intent on stamping their values on everyone else.  Attacks on natives, Jews, women and everyone who dares support Israel or speak out against Islam are increasing rapidly.  A climate of fear is spreading its wings over Europe.\nThe vast majority of those communities may not be violent, but it doesn’t matter.  A relative handful of insurgents, as the British discovered in Northern Ireland, can make life difficult for the authorities for years.  Ordinary Irish citizens either supported the insurgents, even if they weren’t actual fighters themselves, or were intimidated into silence.  It is far too easy to imagine community leaders in the no-go zones refusing to hand over suspects to the police, because they would probably lose their positions – and their heads – if they did.\nThe second problem, however, is the feckless behaviour of the European elites, particularly Germany.  Opening up the borders and allowing uncounted numbers of migrants, mainly young men, to enter was utterly insane.  It was preposterous to believe that they would automatically embrace European values, when they were neither raised in them nor given a strong reason to assimilate.  Instead, raised in societies where trusting someone outside your family is stupid, they represent a major danger to European society.  The European elites were willing to sacrifice the peace and safety of European citizens so they could feel good about themselves.  And the attacks on New Year’s Eve have blown their desperate attempts to cover up the scale of the problem right out of the water.\nI rather doubt the next five years are going to be peaceful.\nThe question now is simple; can European governments, and Europeans themselves, muster the strength to tackle the problem before it becomes any worse?\nFrankly, there are only a handful of possible outcomes.  Resolute steps now may stem the crisis without mass slaughter and effective genocide.  This requires European governments to work up the nerve to take action and swallow the criticism they will receive from their fellow-travellers on the left.  Alternatively, strong right-wing governments may be elected, which will have a brief to crush the threat using all necessary measures.  The problem with electing a strong man, as many countries have found out to their cost, is that getting rid of him after he has served his purpose is incredibly difficult.\nBut those are the cheerful options.  The others include mass flight from Europe, civil war, balkanisation and a descent into the darkness currently enwrapping the Middle East in its shroud.\nI will address the steps European Governments can take, now, to deal with the crisis in the next article.",
  "tags": [
    "EU",
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-13T09:15:00+00:00"
}