{
  "url": "https://voxday.net/2016/01/13/not-even-cuckservative/",
  "scraped_at": "2025-12-17T17:41:42.277500",
  "title": "Not even a cuckservative",
  "date_display": "January 13, 2016",
  "date_iso": "2016-01-13T21:31:00+00:00",
  "date_from_url": "2016-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This officially blows the lid off the Republican Party. Nimrata Randhawa Haley is an open Invader-American; <a href=\"http://theconservativetreehouse.com/2016/01/13/busted-republican-state-of-union-response-carried-amnesty-pledge-in-spanish-version/\">the Spanish version of her State of the Union response is pro-amnesty</a>.</p><blockquote class=\"tr_bq\"><p> Governor Nikki Haley is trying to get out ahead of the building expose’.  Haley just gave a DC press conference claiming she does not support “amnesty”; however, against her earlier admission of Speaker Ryan and Leader McConnell approving the script – the Spanish version must have held similar approvals.</p><p>Governor Haley gave the English version, Miami Representative and party-insider Mario Diaz-Barlat delivered it in Spanish.  Here’s a (paragraph by paragraph) comparison as translated by the Miami Herald:</p><p>♦ English (Via Haley): No one who is willing to work hard, abide by our laws, and love our traditions should ever feel unwelcome in this country.</p><p>Spanish (Via Diaz-Barlat): <i>No one who is willing to work hard, abide by our laws, and love the United States should ever feel unwelcome in this country. It’s not who we are.</i></p><p>♦ English: At the same time, that does not mean we just flat out open our borders. We can’t do that. We cannot continue to allow immigrants to come here illegally. And in this age of terrorism, we must not let in refugees whose intentions cannot be determined.</p><p>Spanish: <i>At the same time, it’s obvious that our immigration system needs to be reformed. The current system puts our national security at risk and is an obstacle for our economy.</i></p><p>♦ English: We must fix our broken immigration system. That means stopping illegal immigration. And it means welcoming properly vetted legal immigrants, regardless of their race or religion. Just like we have for centuries.</p><p>Spanish:<i>  It’s essential that we find a legislative solution to protect our nation, defend our borders, offer a permanent and human solution to those who live in the shadows, respect the rule of law, modernize the visa system and push the economy forward.</i></p><p>♦ English: I have no doubt that if we act with proper focus, we can protect our borders, our sovereignty and our citizens, all while remaining true to America’s noblest legacies.</p><p>Spanish: <i>I have no doubt that if we work together, we can achieve this and continue to be faithful to the noblest legacies of the United States.</i></p></blockquote><p>If you still think any good Republican is pro-America, you’re being played. BOTH factions of the bi-factional ruling party are anti-America. Break out your battle flag and wave it high in the certain knowledge that Nimrata and the Republicans are on the other side.</p><p>Of course, at this point, it should no longer surprise anyone that an Invader-American would side with the invaders who raised her and not the Americans among whom she was raised. The dirt is not magic. Someone should write a book about it. Oh, wait, <a href=\"http://www.amazon.com/gp/product/B018ZHHA52/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B018ZHHA52&amp;linkCode=as2&amp;tag=voxpop06-20&amp;linkId=YTRHJZ6OYITPVAPN\">someone already did</a>.</p></div>",
  "content_text": "This officially blows the lid off the Republican Party. Nimrata Randhawa Haley is an open Invader-American;\nthe Spanish version of her State of the Union response is pro-amnesty\n.\nGovernor Nikki Haley is trying to get out ahead of the building expose’.  Haley just gave a DC press conference claiming she does not support “amnesty”; however, against her earlier admission of Speaker Ryan and Leader McConnell approving the script – the Spanish version must have held similar approvals.\nGovernor Haley gave the English version, Miami Representative and party-insider Mario Diaz-Barlat delivered it in Spanish.  Here’s a (paragraph by paragraph) comparison as translated by the Miami Herald:\n♦ English (Via Haley): No one who is willing to work hard, abide by our laws, and love our traditions should ever feel unwelcome in this country.\nSpanish (Via Diaz-Barlat):\nNo one who is willing to work hard, abide by our laws, and love the United States should ever feel unwelcome in this country. It’s not who we are.\n♦ English: At the same time, that does not mean we just flat out open our borders. We can’t do that. We cannot continue to allow immigrants to come here illegally. And in this age of terrorism, we must not let in refugees whose intentions cannot be determined.\nSpanish:\nAt the same time, it’s obvious that our immigration system needs to be reformed. The current system puts our national security at risk and is an obstacle for our economy.\n♦ English: We must fix our broken immigration system. That means stopping illegal immigration. And it means welcoming properly vetted legal immigrants, regardless of their race or religion. Just like we have for centuries.\nSpanish:\nIt’s essential that we find a legislative solution to protect our nation, defend our borders, offer a permanent and human solution to those who live in the shadows, respect the rule of law, modernize the visa system and push the economy forward.\n♦ English: I have no doubt that if we act with proper focus, we can protect our borders, our sovereignty and our citizens, all while remaining true to America’s noblest legacies.\nSpanish:\nI have no doubt that if we work together, we can achieve this and continue to be faithful to the noblest legacies of the United States.\nIf you still think any good Republican is pro-America, you’re being played. BOTH factions of the bi-factional ruling party are anti-America. Break out your battle flag and wave it high in the certain knowledge that Nimrata and the Republicans are on the other side.\nOf course, at this point, it should no longer surprise anyone that an Invader-American would side with the invaders who raised her and not the Americans among whom she was raised. The dirt is not magic. Someone should write a book about it. Oh, wait,\nsomeone already did\n.",
  "tags": [
    "cuckservative",
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-13T21:31:00+00:00"
}