{
  "url": "https://voxday.net/2016/01/02/pnhs-attack-dog/",
  "scraped_at": "2025-12-17T17:40:04.398386",
  "title": "PNH’s assault parakeet",
  "date_display": "January 2, 2016",
  "date_iso": "2016-01-02T19:44:00+00:00",
  "date_from_url": "2016-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Lynch, whose lips have been firmly attached to Patrick Nielsen Hayden’s posterior <a href=\"http://nielsenhayden.com/electrolite/archives/006122.html#75512\">for over a decade now</a>, is speaking out for the Macmillan-silenced Tor Books senior editor in <a href=\"https://archive.is/giNlI\">falsely accusing John C. Wright</a>.</p><blockquote class=\"tr_bq\"><p> This was especially frustrating in the wake of the 2015 World Science Fiction Convention, after which the ponderously self-important blowhard John C. Wright publicly accused veteran editor and lifelong fan Patrick Nielsen Hayden of both assaulting Wright’s wife and masterminding the long-term “corruption” of the Hugo Awards, to which the SF/F field largely replied: “Meh.” Now, some of that is certainly due to Wright’s tireless self-marginalization and frothing bigotry, but regardless, I think Patrick deserved better of his friends and colleagues. He deserved to have someone stand up and state plainly what he could not– that John C. Wright talks a big game about truth and courage, but that he is demonstrably full of shit. </p></blockquote><p>The only individual here who is completely full of shit is the habitually vulgar Scott Lynch. Wright was telling the truth about Patrick Nielsen Hayden’s unprofessional and inappropriate verbal attack on Mr. Wright’s wife, and he is also telling the truth about PNH’s involvement in corrupting the Hugo Awards. No one stood up and defended PNH because they knew that Wright was telling the truth: PNH is a hot-tempered, unprofessional, and literally uneducated awards whore.</p><p>I know it too. I have had direct, personal conversations with a senior executive at an SF publishing house who confirmed that Patrick Nielsen Hayden is a shameless award-chaser who was finally persuaded to finally step back and recuse himself one year so that a perennial second-placer could have a chance to win an award, before promptly putting himself forward again in order to chase more awards.</p><p>I don’t know if PNH’s awards-whoring is due to his shame at being one of the very few without a high school degree in a highly literate field; perhaps he thinks collecting awards will somehow compensate for his inferiority complex or perhaps he simply requires external approval for his efforts. Whatever the reason, the simple fact is that PNH and the little coterie of authors around him have connived, pimped, and collaborated to manipulate the Hugo Awards process on their own behalf for well over a decade. This isn’t up for debate. It’s the recent history of the Hugo Awards.</p><p>In fact, the ONLY reason that two different Best Editor awards exist in the first place is because PNH was whining and crying to anyone who would listen about the fact that he kept losing out to short form editors like Gardner Dozois. And no sooner did the Puppies knock him out of contention in 2015 than his site became the center of efforts to change the rules so that PNH would be able to reliably nominate himself for Best Editor (Long Form) again.</p><blockquote class=\"tr_bq\"><p> Wright makes these points clear over and over again on his own time, and the fact that he’s a bigoted goofball is hardly a state secret. What is important is that nothing he’s tried to push about the Hugo Awards or about Patrick Nielsen Hayden has any scintilla of truth to it, and anyone who tries to tell you differently in the coming months is either a liar or a water carrier for a depressingly stupid conspiracy theory spun by liars.</p></blockquote><p>It’s amusing to see Lynch talk about what isn’t a state secret, considering what he obviously doesn’t know about PNH. Scott Lynch clearly doesn’t know a damn thing about any of this. He wasn’t there at the time that Patrick Nielsen Hayden verbally attacked Mrs. Wright and he isn’t sufficiently well connected in publishing circles to know the truth about what <a href=\"http://nielsenhayden.com/makinglight/archives/007354.html#007354\">an insecure little awards whore</a> PNH is.</p><blockquote class=\"tr_bq\"><p> In a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess.</p></blockquote><p>How generous of John indeed! Fortunately, PNH was able to repay that generosity at Macmillan’s expense. Notice that PNH doesn’t see fit to mention mention that <a href=\"http://file770.com/?p=24450\">he was the co-sponsor of the new award</a>.</p><blockquote class=\"tr_bq\"><p> <i>I sought out Patrick Nielsen Hayden’s support for the Editor’s split and brought him into the fold; I needed a prominent editor to co-sponsor the amendment or it would never have been taken seriously by the Business Meeting.</i><br> – Chris Barkley</br></p></blockquote><p>Both Mr. and Mrs. Wright were published by Tor Books, and they know the same thing I do as a result of my conversations with the publishing executive. PNH was colluding and conspiring and campaigning for awards long before the Sad Puppies entered the picture, and long-time industry professionals know it.</p><p>In any event, the fact that Macmillan still hasn’t responded to the complaints about PNH’s Code of Conduct violation means that it is time to start requesting responses from them again. And if they don’t respond to his unprovoked and unprofessional attack on a woman of Jewish descent, then the matter will be brought to the employment authorities.</p><p>McRapey’s take: <i>“What it looks like when one writer calls another writer onto the carpet, and then sets the carpet on fire…. Seriously, I think I’m just gonna spend my day eating ice cream and<br> figuring out what part of science fiction I’m totes ruining next.”</br></i></p><p>Well, we already knew he’s not going to spend it writing….</p></div>",
  "content_text": "Scott Lynch, whose lips have been firmly attached to Patrick Nielsen Hayden’s posterior\nfor over a decade now\n, is speaking out for the Macmillan-silenced Tor Books senior editor in\nfalsely accusing John C. Wright\n.\nThis was especially frustrating in the wake of the 2015 World Science Fiction Convention, after which the ponderously self-important blowhard John C. Wright publicly accused veteran editor and lifelong fan Patrick Nielsen Hayden of both assaulting Wright’s wife and masterminding the long-term “corruption” of the Hugo Awards, to which the SF/F field largely replied: “Meh.” Now, some of that is certainly due to Wright’s tireless self-marginalization and frothing bigotry, but regardless, I think Patrick deserved better of his friends and colleagues. He deserved to have someone stand up and state plainly what he could not– that John C. Wright talks a big game about truth and courage, but that he is demonstrably full of shit.\nThe only individual here who is completely full of shit is the habitually vulgar Scott Lynch. Wright was telling the truth about Patrick Nielsen Hayden’s unprofessional and inappropriate verbal attack on Mr. Wright’s wife, and he is also telling the truth about PNH’s involvement in corrupting the Hugo Awards. No one stood up and defended PNH because they knew that Wright was telling the truth: PNH is a hot-tempered, unprofessional, and literally uneducated awards whore.\nI know it too. I have had direct, personal conversations with a senior executive at an SF publishing house who confirmed that Patrick Nielsen Hayden is a shameless award-chaser who was finally persuaded to finally step back and recuse himself one year so that a perennial second-placer could have a chance to win an award, before promptly putting himself forward again in order to chase more awards.\nI don’t know if PNH’s awards-whoring is due to his shame at being one of the very few without a high school degree in a highly literate field; perhaps he thinks collecting awards will somehow compensate for his inferiority complex or perhaps he simply requires external approval for his efforts. Whatever the reason, the simple fact is that PNH and the little coterie of authors around him have connived, pimped, and collaborated to manipulate the Hugo Awards process on their own behalf for well over a decade. This isn’t up for debate. It’s the recent history of the Hugo Awards.\nIn fact, the ONLY reason that two different Best Editor awards exist in the first place is because PNH was whining and crying to anyone who would listen about the fact that he kept losing out to short form editors like Gardner Dozois. And no sooner did the Puppies knock him out of contention in 2015 than his site became the center of efforts to change the rules so that PNH would be able to reliably nominate himself for Best Editor (Long Form) again.\nWright makes these points clear over and over again on his own time, and the fact that he’s a bigoted goofball is hardly a state secret. What is important is that nothing he’s tried to push about the Hugo Awards or about Patrick Nielsen Hayden has any scintilla of truth to it, and anyone who tries to tell you differently in the coming months is either a liar or a water carrier for a depressingly stupid conspiracy theory spun by liars.\nIt’s amusing to see Lynch talk about what isn’t a state secret, considering what he obviously doesn’t know about PNH. Scott Lynch clearly doesn’t know a damn thing about any of this. He wasn’t there at the time that Patrick Nielsen Hayden verbally attacked Mrs. Wright and he isn’t sufficiently well connected in publishing circles to know the truth about what\nan insecure little awards whore\nPNH is.\nIn a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess.\nHow generous of John indeed! Fortunately, PNH was able to repay that generosity at Macmillan’s expense. Notice that PNH doesn’t see fit to mention mention that\nhe was the co-sponsor of the new award\n.\nI sought out Patrick Nielsen Hayden’s support for the Editor’s split and brought him into the fold; I needed a prominent editor to co-sponsor the amendment or it would never have been taken seriously by the Business Meeting.\n– Chris Barkley\nBoth Mr. and Mrs. Wright were published by Tor Books, and they know the same thing I do as a result of my conversations with the publishing executive. PNH was colluding and conspiring and campaigning for awards long before the Sad Puppies entered the picture, and long-time industry professionals know it.\nIn any event, the fact that Macmillan still hasn’t responded to the complaints about PNH’s Code of Conduct violation means that it is time to start requesting responses from them again. And if they don’t respond to his unprovoked and unprofessional attack on a woman of Jewish descent, then the matter will be brought to the employment authorities.\nMcRapey’s take:\n“What it looks like when one writer calls another writer onto the carpet, and then sets the carpet on fire…. Seriously, I think I’m just gonna spend my day eating ice cream and\nfiguring out what part of science fiction I’m totes ruining next.”\nWell, we already knew he’s not going to spend it writing….",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-02T19:44:00+00:00"
}