{
  "url": "https://voxday.net/2016/01/31/quit-facebook/",
  "scraped_at": "2025-12-17T17:44:01.380055",
  "title": "Quit Facebook",
  "date_display": "January 31, 2016",
  "date_iso": "2016-01-31T14:00:00+00:00",
  "date_from_url": "2016-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never been enthusiastic about Facebook. I hated the clunky interface from the start, saw little point in endlessly exchanging pictures and updates with acquaintances, and only set up an account there because it was required as part of a design job I had to do. I never used it – although since I linked my Twitter account to it, many thought I did – and I was content to leave it after Andrew Marston brought it to the attention of the Facebook police and got it deleted under the “real names” policy.</p><p>That being said, if I was on Facebook today, I would delete my account due to the way <a href=\"http://www.nytimes.com/2016/01/30/technology/facebook-gun-sales-ban.html\">it is now waging open war</a> against nationalists and American gun rights.</p><blockquote class=\"tr_bq\"><p> Facebook is banning private sales of guns on its flagship social network and its Instagram photo-sharing service, a move meant to clamp down on unlicensed gun transactions.</p><p>Facebook already prohibits people from offering marijuana, pharmaceuticals and illegal drugs for sale, and the company said on Friday that it was updating its policy to include guns. The ban applies to private, person-to-person sales of guns. Licensed gun dealers and gun clubs can still maintain Facebook pages and post on Instagram.</p></blockquote><p>The time to choose your social media side is coming. Don’t support the enemy. Delete your account. It’s obvious that all the big social media companies are, at the very least, SJW-friendly, but some like Amazon and Google, and even Twitter, are still playing reasonably fair. Remember, Milo was only unverified by Twitter; he wasn’t banned. Amazon took down <em>John Scalzi Is A Rapist: Why SJWs Always Lie In Bed Waiting For His<br> Gentle Touch; A Pretty, Pretty Girl Dreams of Her Beloved One While<br> Pondering Gender Identity, Social Justice, and Body Dysmorphia.</br></br></em>due to the legally-questionable title but the same book is still for sale on Amazon under its new name<em>, John Scalzi Banned This Book But He Can Never Ban My Burning Love.</em></p><p>Others, like Facebook, Goodreads, and Wikipedia, are not so much tilting the playing field as refusing to let the Right even enter it. So don’t support them. You don’t have to. You really don’t.</p></div>",
  "content_text": "I’ve never been enthusiastic about Facebook. I hated the clunky interface from the start, saw little point in endlessly exchanging pictures and updates with acquaintances, and only set up an account there because it was required as part of a design job I had to do. I never used it – although since I linked my Twitter account to it, many thought I did – and I was content to leave it after Andrew Marston brought it to the attention of the Facebook police and got it deleted under the “real names” policy.\nThat being said, if I was on Facebook today, I would delete my account due to the way\nit is now waging open war\nagainst nationalists and American gun rights.\nFacebook is banning private sales of guns on its flagship social network and its Instagram photo-sharing service, a move meant to clamp down on unlicensed gun transactions.\nFacebook already prohibits people from offering marijuana, pharmaceuticals and illegal drugs for sale, and the company said on Friday that it was updating its policy to include guns. The ban applies to private, person-to-person sales of guns. Licensed gun dealers and gun clubs can still maintain Facebook pages and post on Instagram.\nThe time to choose your social media side is coming. Don’t support the enemy. Delete your account. It’s obvious that all the big social media companies are, at the very least, SJW-friendly, but some like Amazon and Google, and even Twitter, are still playing reasonably fair. Remember, Milo was only unverified by Twitter; he wasn’t banned. Amazon took down\nJohn Scalzi Is A Rapist: Why SJWs Always Lie In Bed Waiting For His\nGentle Touch; A Pretty, Pretty Girl Dreams of Her Beloved One While\nPondering Gender Identity, Social Justice, and Body Dysmorphia.\ndue to the legally-questionable title but the same book is still for sale on Amazon under its new name\n, John Scalzi Banned This Book But He Can Never Ban My Burning Love.\nOthers, like Facebook, Goodreads, and Wikipedia, are not so much tilting the playing field as refusing to let the Right even enter it. So don’t support them. You don’t have to. You really don’t.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-31T14:00:00+00:00"
}