{
  "url": "https://voxday.net/2016/01/13/six-rules-of-strategic-reshuffle/",
  "scraped_at": "2025-12-17T17:41:38.571156",
  "title": "Six rules of strategic reshuffle",
  "date_display": "January 13, 2016",
  "date_iso": "2016-01-13T13:00:00+00:00",
  "date_from_url": "2016-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William Hague <a href=\"http://www.telegraph.co.uk/news/politics/Jeremy_Corbyn/12095793/There-six-rules-for-a-good-reshuffle.-Jeremy-Corbyn-broke-every-one-of-them.html\">provides some rare insi</a>ght into the backdoor dealings of a parliamentary system in his critique of Labour leader Jeremy Corbyn’s recent Shadow Cabinet reshuffle:</p><blockquote class=\"tr_bq\"><p> The first rule, for a leader whose authority is anything short of total, is that it should come as a complete surprise, preferably a bolt from the bluest of skies. This is to prevent your colleagues from seeking to negotiate or combining to frustrate you. The date should be concealed even from some of the leader’s closest aides, with fake or easily cancelled engagements in the diary.</p><p>The second rule is that if any test of strength develops between you the leader and a subordinate, you have to win. If a colleague is immovable don’t try to move them. But once you say they’re moving, they have to go, whatever the cost. This is true even if it brings you down, because otherwise your weakness will make future shuffles impossible and bring you down anyway. In other words, you either pretend to be happy with Hilary Benn or you move him, but you certainly don’t show unhappiness and fail to move him.</p><p>The third rule is never to explain in public why you have dismissed any individual. Politicians don’t like being sacked, but on the whole they get over it. They still have hope for the future, and can sometimes be brought back with some gratitude on their part.</p><p>The fourth rule is that your new appointments should accentuate the divisions among your enemies. Promote some people from a different wing of the party who are proving technically able, so that they then have a vested interest in your success. Corbyn benefits enormously from Labour’s moderates being divided between those willing to serve with him and those who are sitting things out. But a shuffle is a chance to make their divisions worse, not push them together.</p><p>Here we have to come to the fifth rule, which takes us away from the<br> politics of personalities to how policy on major issues is made. This<br> rule states that a reshuffle, while not breaking any of the first four<br> rules, should make it easier for a party to unite in the future on an<br> issue it finds difficult.</br></br></br></br></p><p>The sixth rule states that, however much you’ve messed up with rules two<br> to five, never forget the first rule. A leader without the capacity to<br> surprise is without the power of tactical initiative.</br></br></p></blockquote><p>Politics is a very dirty and intrinsically dishonest business. I’m glad I decided to stay out of it, although sometimes I wonder how things might have turned out if I’d gone with the program and aimed at Congress.</p><p>Regardless, Hague’s comments are a fascinating glimpse into a world we seldom see.</p></div>",
  "content_text": "William Hague\nprovides some rare insi\nght into the backdoor dealings of a parliamentary system in his critique of Labour leader Jeremy Corbyn’s recent Shadow Cabinet reshuffle:\nThe first rule, for a leader whose authority is anything short of total, is that it should come as a complete surprise, preferably a bolt from the bluest of skies. This is to prevent your colleagues from seeking to negotiate or combining to frustrate you. The date should be concealed even from some of the leader’s closest aides, with fake or easily cancelled engagements in the diary.\nThe second rule is that if any test of strength develops between you the leader and a subordinate, you have to win. If a colleague is immovable don’t try to move them. But once you say they’re moving, they have to go, whatever the cost. This is true even if it brings you down, because otherwise your weakness will make future shuffles impossible and bring you down anyway. In other words, you either pretend to be happy with Hilary Benn or you move him, but you certainly don’t show unhappiness and fail to move him.\nThe third rule is never to explain in public why you have dismissed any individual. Politicians don’t like being sacked, but on the whole they get over it. They still have hope for the future, and can sometimes be brought back with some gratitude on their part.\nThe fourth rule is that your new appointments should accentuate the divisions among your enemies. Promote some people from a different wing of the party who are proving technically able, so that they then have a vested interest in your success. Corbyn benefits enormously from Labour’s moderates being divided between those willing to serve with him and those who are sitting things out. But a shuffle is a chance to make their divisions worse, not push them together.\nHere we have to come to the fifth rule, which takes us away from the\npolitics of personalities to how policy on major issues is made. This\nrule states that a reshuffle, while not breaking any of the first four\nrules, should make it easier for a party to unite in the future on an\nissue it finds difficult.\nThe sixth rule states that, however much you’ve messed up with rules two\nto five, never forget the first rule. A leader without the capacity to\nsurprise is without the power of tactical initiative.\nPolitics is a very dirty and intrinsically dishonest business. I’m glad I decided to stay out of it, although sometimes I wonder how things might have turned out if I’d gone with the program and aimed at Congress.\nRegardless, Hague’s comments are a fascinating glimpse into a world we seldom see.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-13T13:00:00+00:00"
}