{
  "url": "https://voxday.net/2016/01/06/sjws-exposed/",
  "scraped_at": "2025-12-17T17:40:37.164848",
  "title": "SJWs, exposed",
  "date_display": "January 6, 2016",
  "date_iso": "2016-01-06T10:47:00+00:00",
  "date_from_url": "2016-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJW calling himself Hawk S. Rabidus made a risibly false claim.</p><blockquote class=\"tr_bq\"><p> Nobody else is organizing or manipulating things on Goodreads (or the Hugos) using concerted action. There is no cabal.</p></blockquote><p>There most certainly is, as in both cases, the emergent behavior of the various individuals who share an interest in pushing social justice is observably manifest. In the case of the Hugos, the editors at Tor Books have been engaging in concerted action for decades. They have, by their own admission, decided when new awards will be created, when they will win those awards, and when they will step back and permit others to win them. In the case of Goodreads, it is a group of petty SJWs and SJW librarians who have collectively sought to lower the ratings of right wing authors. Thanks to <a href=\"https://www.goodreads.com/review/list/3390556-sean-o-hara?sort=review&amp;view=reviews\">Sean O’Hara</a>, we were able to put together the list of all 100 or so, including moderators like rivka, and librarians like banillah, Bryan Young, davidofterra, and <a href=\"http://www.goodreads.com/user/show/20830588-getty-hesse\">Getty Hesse</a>.</p><blockquote class=\"tr_bq\"><p>  SJWs Always Lie: Taking Down the Thought Police<br> by Vox Day, Milo Yiannopoulos (Foreword)<br> <a href=\"https://archive.is/OFJMk\">Getty Hesse’s review</a><br> Jan 04, 16</br></br></br></p><p>did not like it</p><p>I’m putting this review up because the book desperately needs a lower rating. One does not need to read this book. The very blurb is resplendent with contradictions.</p><p>SJWs subject the world to “their intolerant thought and speech policing,” and yet the VERY NEXT SENTENCE speaks of “the SJW agenda of diversity, tolerance, inclusiveness, and equality.” Tolerance cannot be intolerant. Vox Day is saying here that something is not itself. And he doesn’t even suggest that their “agenda” is something else masquerading as “diversity,tolerance, inclusiveness, and equality,” oh no, rather these things contradict “both science and observable reality.” I’m not even going to bother to explain why that statement is incredibly idiotic. Anyone with half a brain cell should be able to figure it out.</p><p>And, for the record, Vox Day is not “the most hated man in science fiction.” He’s the most laughed at.</p></blockquote><p>If SJWs could do logic, they wouldn’t be SJWs. Forgive the digression, but Getty Hesse’s pseudo-dialectic makes my teeth itch. It’s true that X cannot be Not X, but Y most certainly can be. In much the same way Tom Brady is not the New England Patriots playbook, SJWs are not the professed SJW agenda. As usual, both Vox’s First Law and the First Law of SJW can be seen here.</p><p>What is interesting about Goodreads is that it provides an excellent way of publicly identifying where people stand on the socio-political spectrum. Aside from the amusement that this latest showdown has provided, it has sparked some very interesting discussions in our tech circle, including some things we’re going to discuss in our next Brainstorm, where we will talk about the planned fork of Wikipedia and the shape of its eventual replacement.</p><p>More importantly, this has finally allowed me to answer the core question with which I have been wrestling: do we create something that is a right-wing alternative to Wikipedia or do we shoot to replace it entirely with something better that the left can be safely permitted to use without converging it like they always do?</p><p>Speaking of things that provoke laughter, Rolf Nelson received an email from The Goodreads Team explaining why they would not be removing an obviously fake review in which it was apparent that the reviewer could not possibly have read the book.</p><p><i>Goodreads policy allows users to rate a book as soon as it is listed on the site. We do not dictate on what basis Goodreads members form their personal opinions about a book, so we have no rules about reading the full text of a book before rating and reviewing it. We recognize that not everyone will agree with this policy, but it is one that has worked well for the Goodreads community over time.</i></p><p><i>Users are entitled to express their honest opinions about the book,<br> even if others feel them to be misguided or wrong.  We don’t evaluate a<br> reader’s opinions based on how, when, or why they made a judgement about<br> the work that they read.  Given the subjective nature of reviews, it’s<br> hard to designate one review as “wrong” and another “right.”  Even if we<br> could, it would be impractical to manually verify the authenticity of<br> every statement made in a Goodreads review, and we have to be consistent<br> in how we apply our policies.  </br></br></br></br></br></br></br></i></p><p>That would explain why they were able to ban me in good conscience: they have no need to be consistent about how they apply their unviolated non-policies.</p><p>But we shouldn’t be surprised that Goodreads’ policy permits the review of books one hasn’t read, as it even permits the review of books <i>that don’t exist</i>. Two Goodreads librarians have one-starred a book that I supposedly wrote for Ben Bella that was never signed to a contract, that I never wrote, and Ben Bella never published. It’s nice that ignoring reality has worked well for the Goodreads community over time, but history is quite clear on the way that reality tends to impose itself in the end.</p><p>One more tangent, if you don’t mind. Ben Bella graciously returned to me the audiobook rights to<i> The Irrational Atheist </i>and we expect it to be available on Audible from Castalia House sometime in the February-March timeframe.<i> </i></p></div>",
  "content_text": "The SJW calling himself Hawk S. Rabidus made a risibly false claim.\nNobody else is organizing or manipulating things on Goodreads (or the Hugos) using concerted action. There is no cabal.\nThere most certainly is, as in both cases, the emergent behavior of the various individuals who share an interest in pushing social justice is observably manifest. In the case of the Hugos, the editors at Tor Books have been engaging in concerted action for decades. They have, by their own admission, decided when new awards will be created, when they will win those awards, and when they will step back and permit others to win them. In the case of Goodreads, it is a group of petty SJWs and SJW librarians who have collectively sought to lower the ratings of right wing authors. Thanks to\nSean O’Hara\n, we were able to put together the list of all 100 or so, including moderators like rivka, and librarians like banillah, Bryan Young, davidofterra, and\nGetty Hesse\n.\nSJWs Always Lie: Taking Down the Thought Police\nby Vox Day, Milo Yiannopoulos (Foreword)\nGetty Hesse’s review\nJan 04, 16\ndid not like it\nI’m putting this review up because the book desperately needs a lower rating. One does not need to read this book. The very blurb is resplendent with contradictions.\nSJWs subject the world to “their intolerant thought and speech policing,” and yet the VERY NEXT SENTENCE speaks of “the SJW agenda of diversity, tolerance, inclusiveness, and equality.” Tolerance cannot be intolerant. Vox Day is saying here that something is not itself. And he doesn’t even suggest that their “agenda” is something else masquerading as “diversity,tolerance, inclusiveness, and equality,” oh no, rather these things contradict “both science and observable reality.” I’m not even going to bother to explain why that statement is incredibly idiotic. Anyone with half a brain cell should be able to figure it out.\nAnd, for the record, Vox Day is not “the most hated man in science fiction.” He’s the most laughed at.\nIf SJWs could do logic, they wouldn’t be SJWs. Forgive the digression, but Getty Hesse’s pseudo-dialectic makes my teeth itch. It’s true that X cannot be Not X, but Y most certainly can be. In much the same way Tom Brady is not the New England Patriots playbook, SJWs are not the professed SJW agenda. As usual, both Vox’s First Law and the First Law of SJW can be seen here.\nWhat is interesting about Goodreads is that it provides an excellent way of publicly identifying where people stand on the socio-political spectrum. Aside from the amusement that this latest showdown has provided, it has sparked some very interesting discussions in our tech circle, including some things we’re going to discuss in our next Brainstorm, where we will talk about the planned fork of Wikipedia and the shape of its eventual replacement.\nMore importantly, this has finally allowed me to answer the core question with which I have been wrestling: do we create something that is a right-wing alternative to Wikipedia or do we shoot to replace it entirely with something better that the left can be safely permitted to use without converging it like they always do?\nSpeaking of things that provoke laughter, Rolf Nelson received an email from The Goodreads Team explaining why they would not be removing an obviously fake review in which it was apparent that the reviewer could not possibly have read the book.\nGoodreads policy allows users to rate a book as soon as it is listed on the site. We do not dictate on what basis Goodreads members form their personal opinions about a book, so we have no rules about reading the full text of a book before rating and reviewing it. We recognize that not everyone will agree with this policy, but it is one that has worked well for the Goodreads community over time.\nUsers are entitled to express their honest opinions about the book,\neven if others feel them to be misguided or wrong.  We don’t evaluate a\nreader’s opinions based on how, when, or why they made a judgement about\nthe work that they read.  Given the subjective nature of reviews, it’s\nhard to designate one review as “wrong” and another “right.”  Even if we\ncould, it would be impractical to manually verify the authenticity of\nevery statement made in a Goodreads review, and we have to be consistent\nin how we apply our policies.\nThat would explain why they were able to ban me in good conscience: they have no need to be consistent about how they apply their unviolated non-policies.\nBut we shouldn’t be surprised that Goodreads’ policy permits the review of books one hasn’t read, as it even permits the review of books\nthat don’t exist\n. Two Goodreads librarians have one-starred a book that I supposedly wrote for Ben Bella that was never signed to a contract, that I never wrote, and Ben Bella never published. It’s nice that ignoring reality has worked well for the Goodreads community over time, but history is quite clear on the way that reality tends to impose itself in the end.\nOne more tangent, if you don’t mind. Ben Bella graciously returned to me the audiobook rights to\nThe Irrational Atheist\nand we expect it to be available on Audible from Castalia House sometime in the February-March timeframe.",
  "tags": [
    "conspiracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-06T10:47:00+00:00"
}