{
  "url": "https://voxday.net/2016/01/23/sjws-in-tec/",
  "scraped_at": "2025-12-17T17:43:01.778984",
  "title": "SJWs in tech",
  "date_display": "January 23, 2016",
  "date_iso": "2016-01-23T13:00:00+00:00",
  "date_from_url": "2016-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Women in Tech” is not only code for “SJWs in Tech”, but it is a massive waste of resources and it is extremely harmful to the women who are coerced and encouraged to waste their lives doing something for which they have neither the interest nor the commitment:</p><blockquote class=\"tr_bq\"><p> Supreme Dark Lord ‏@voxday<br> No individual with a useful skill set capable of delivering needs to be babied or coerced into working.</br></p><p>Supreme Dark Lord ‏@voxday<br> You do women a terrible disservice by trying to convince those who are not seriously interested in the field to enter it.</br></p><p>Jennifer Medina ‏@JenniferJMedina<br> You do everyone a terrible disservice by discouraging every human being from being introduced to more of what life has to offer.</br></p><p>Supreme Dark Lord ‏@voxday<br> You’re wrong. I save those people years of their lives and thousands of dollars by showing them what it ACTUALLY involves.</br></p><p>Jennifer Medina ‏@JenniferJMedina<br> I don’t give a flying fuck about your anecdotal evidence. Your personal views and life are not on the table of discussion here.</br></p><p>Wrongfan ‏@Badthincks<br> I am a STEM woman (mathematics) and he is right.  In fact I spent years trying to push girls into STEM.</br></p><p>Wrongfan ‏@Badthincks<br> It’s a waste of time to try and push ANYONE into something they have no genuine inclination for.</br></p></blockquote><p>Considering how there are already far too many PhDs for the number of positions available, and that there are already <a href=\"http://www.develop-online.net/analysis/game-grads-in-crisis-why-the-industry-is-letting-down-new-talent/0210912\">1,000 people applying for 12 game development positions,</a> it should be obvious that encouraging uninterested women to go into a field where they are almost guaranteed to go unemployed is reprehensible.</p><blockquote class=\"tr_bq\"><p> Stats provided by Creative Skillset show that in 2014, 60 universities and colleges offered 215 undergraduate and 40 master video game courses. The most recent stats available, courtesy of the Higher Education Statistics Agency for the 2012/2013 academic year, show that 3,125 students were taking games as a subject of study.</p><p>Compare this with the 620 studios in the UK, according to TIGA, and you can see the difficulties studios face when lending experience in such a highly competitive field. Lenton says a local studio in  Leamington Spa, which houses around up to 300 staff, recently had over 1,000 applications for a dozen places.</p></blockquote><p>What are the chances that a girl who required hand-holding and cheerleading just to get her to pay any attention to the industry in the first place is going to be talented and driven enough to beat out the 98.8 percent of highly competitive young men and women who want nothing more than to make games?</p><p>That’s not career advice. That’s a fantasy novel.</p></div>",
  "content_text": "“Women in Tech” is not only code for “SJWs in Tech”, but it is a massive waste of resources and it is extremely harmful to the women who are coerced and encouraged to waste their lives doing something for which they have neither the interest nor the commitment:\nSupreme Dark Lord ‏@voxday\nNo individual with a useful skill set capable of delivering needs to be babied or coerced into working.\nSupreme Dark Lord ‏@voxday\nYou do women a terrible disservice by trying to convince those who are not seriously interested in the field to enter it.\nJennifer Medina ‏@JenniferJMedina\nYou do everyone a terrible disservice by discouraging every human being from being introduced to more of what life has to offer.\nSupreme Dark Lord ‏@voxday\nYou’re wrong. I save those people years of their lives and thousands of dollars by showing them what it ACTUALLY involves.\nJennifer Medina ‏@JenniferJMedina\nI don’t give a flying fuck about your anecdotal evidence. Your personal views and life are not on the table of discussion here.\nWrongfan ‏@Badthincks\nI am a STEM woman (mathematics) and he is right.  In fact I spent years trying to push girls into STEM.\nWrongfan ‏@Badthincks\nIt’s a waste of time to try and push ANYONE into something they have no genuine inclination for.\nConsidering how there are already far too many PhDs for the number of positions available, and that there are already\n1,000 people applying for 12 game development positions,\nit should be obvious that encouraging uninterested women to go into a field where they are almost guaranteed to go unemployed is reprehensible.\nStats provided by Creative Skillset show that in 2014, 60 universities and colleges offered 215 undergraduate and 40 master video game courses. The most recent stats available, courtesy of the Higher Education Statistics Agency for the 2012/2013 academic year, show that 3,125 students were taking games as a subject of study.\nCompare this with the 620 studios in the UK, according to TIGA, and you can see the difficulties studios face when lending experience in such a highly competitive field. Lenton says a local studio in  Leamington Spa, which houses around up to 300 staff, recently had over 1,000 applications for a dozen places.\nWhat are the chances that a girl who required hand-holding and cheerleading just to get her to pay any attention to the industry in the first place is going to be talented and driven enough to beat out the 98.8 percent of highly competitive young men and women who want nothing more than to make games?\nThat’s not career advice. That’s a fantasy novel.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-23T13:00:00+00:00"
}