{
  "url": "https://voxday.net/2016/01/15/so-much-for-republican-loyalty/",
  "scraped_at": "2025-12-17T17:41:56.045980",
  "title": "So much for Republican loyalty",
  "date_display": "January 15, 2016",
  "date_iso": "2016-01-15T16:30:00+00:00",
  "date_from_url": "2016-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Republican Establishment always demands loyalty from its base, but <a href=\"http://www.nytimes.com/2016/01/14/opinion/campaign-stops/why-i-will-never-vote-for-donald-trump.html?_r=0\">never offers any of its own</a>:</p><blockquote class=\"tr_bq\"><p> I have voted Republican in every presidential election since I first became eligible to vote in 1980. I worked in the Reagan and George H. W. Bush administrations and in the White House for George W. Bush as a speechwriter and adviser. I have also worked for Republican presidential campaigns, although not this time around. Despite this history, and in important ways because of it, I will not vote for Donald Trump if he wins the Republican nomination….</p><p>No<br> major presidential candidate has ever been quite as disdainful of<br> knowledge, as indifferent to facts, as untroubled by his benightedness. It<br> is little surprise, then, that many of Mr. Trump’s most celebrated<br> pronouncements and promises — to quickly and “humanely” expel 11 million<br> illegal immigrants, to force Mexico to pay for the wall he will build<br> on our southern border, to defeat the Islamic State “very quickly” while<br> as a bonus taking its oil, to bar Muslims from immigrating to the<br> United States — are nativistic pipe dreams and public relations stunts.</br></br></br></br></br></br></br></br></p></blockquote><p>No wonder people have increasingly little use for Republicans. They stand for nothing but the status quo. They promise nothing but the status quo. They offer nothing but the status quo. They are, quite literally, hopeless.</p><blockquote class=\"tr_bq\"><p> For Republicans, there is an additional reason not to vote for Mr. Trump. His nomination would pose a profound threat to the Republican Party and conservatism, in ways that Hillary Clinton never could. For while Mrs. Clinton could inflict a defeat on the Republican Party, she could not redefine it. But Mr. Trump, if he were the Republican nominee, would.</p><p>Mr. Trump’s presence in the 2016 race has already had pernicious effects, but they’re nothing compared with what would happen if he were the Republican standard-bearer. The nominee, after all, is the leader of the party; he gives it shape and definition. If Mr. Trump heads the Republican Party, it will no longer be a conservative party; it will be an angry, bigoted, populist one. Mr. Trump would represent a dramatic break with and a fundamental assault on the party’s best traditions.</p></blockquote><p>An angry, bigoted, populist party sounds a lot more appropriate and viable in the last days of a failing multicultural empire than a go-along-to-get-along Wile E. Coyote party. And a dramatic break with the Republican party’s best traditions, which are stabbing its base in the back and caving into Democrats, is long overdue.</p><p>The most certain way to know that Trump is doing well is to observe the way in which the liberal mainstream media is affording these cuckservatives a national platform to take these futile shots at him.</p></div>",
  "content_text": "The Republican Establishment always demands loyalty from its base, but\nnever offers any of its own\n:\nI have voted Republican in every presidential election since I first became eligible to vote in 1980. I worked in the Reagan and George H. W. Bush administrations and in the White House for George W. Bush as a speechwriter and adviser. I have also worked for Republican presidential campaigns, although not this time around. Despite this history, and in important ways because of it, I will not vote for Donald Trump if he wins the Republican nomination….\nNo\nmajor presidential candidate has ever been quite as disdainful of\nknowledge, as indifferent to facts, as untroubled by his benightedness. It\nis little surprise, then, that many of Mr. Trump’s most celebrated\npronouncements and promises — to quickly and “humanely” expel 11 million\nillegal immigrants, to force Mexico to pay for the wall he will build\non our southern border, to defeat the Islamic State “very quickly” while\nas a bonus taking its oil, to bar Muslims from immigrating to the\nUnited States — are nativistic pipe dreams and public relations stunts.\nNo wonder people have increasingly little use for Republicans. They stand for nothing but the status quo. They promise nothing but the status quo. They offer nothing but the status quo. They are, quite literally, hopeless.\nFor Republicans, there is an additional reason not to vote for Mr. Trump. His nomination would pose a profound threat to the Republican Party and conservatism, in ways that Hillary Clinton never could. For while Mrs. Clinton could inflict a defeat on the Republican Party, she could not redefine it. But Mr. Trump, if he were the Republican nominee, would.\nMr. Trump’s presence in the 2016 race has already had pernicious effects, but they’re nothing compared with what would happen if he were the Republican standard-bearer. The nominee, after all, is the leader of the party; he gives it shape and definition. If Mr. Trump heads the Republican Party, it will no longer be a conservative party; it will be an angry, bigoted, populist one. Mr. Trump would represent a dramatic break with and a fundamental assault on the party’s best traditions.\nAn angry, bigoted, populist party sounds a lot more appropriate and viable in the last days of a failing multicultural empire than a go-along-to-get-along Wile E. Coyote party. And a dramatic break with the Republican party’s best traditions, which are stabbing its base in the back and caving into Democrats, is long overdue.\nThe most certain way to know that Trump is doing well is to observe the way in which the liberal mainstream media is affording these cuckservatives a national platform to take these futile shots at him.",
  "tags": [
    "cuckservative",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-15T16:30:00+00:00"
}