{
  "url": "https://voxday.net/2016/01/31/the-chrishanger-reviews-cuckservative/",
  "scraped_at": "2025-12-17T17:44:02.852309",
  "title": "The Chrishanger reviews Cuckservative",
  "date_display": "January 31, 2016",
  "date_iso": "2016-01-31T17:00:00+00:00",
  "date_from_url": "2016-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Nuttall, the bestselling SF author, reviews<i> <a href=\"https://chrishanger.wordpress.com/2016/01/30/cuckservative-how-conservatives-betrayed-america/#comments\">Cuckservative: How “Conservatives” betrayed America</a></i>:</p><blockquote class=\"tr_bq\"><p> If there is nothing else that can be said about Vox Day – and a great deal of nonsense has been written about him – it is that his mere existence is a testament to the damage done to free speech and common sense by the politically-correct. To try to avoid giving unnecessary offense is a laudable goal, but to declare whole fields of study verboten because of the potential for offense is just plain stupid. Worse, perhaps, when the difference between words and reality becomes impossible to avoid, it undermines faith, the faith we need to keep our society running. Reality does not change on command.</p><p>After the runaway bestseller<i> SJWs Always Lie</i> (<a href=\"https://chrishanger.wordpress.com/2015/08/30/sjws-always-lie/\">reviewed here</a>), Vox Day tackles two subjects that don’t, on first glance, seem to go together. On one hand, there is the tidal wave of immigration pouring into America (and Europe) and, on the other hand, there is the supine surrender of American Conservatives to liberal thoughts and ideals that have very little relationship to reality. These people have become known as ‘Cuckservatives’ – a combination of ‘cuckoo’ and ‘conservative’ and the fact that the word itself has been declared offensive tells you a great deal about its power.</p></blockquote><p>While <i>Cuckservative </i>has sold well, it hasn’t taken off the way <i>SJWAL </i>did, despite the fact that immigration is the only serious issue in the presidential campaign and the European migrant crisis has been the primary news item for the last six months.</p><p>I think this tends to indicate that many people are still holding out hope that the immigration issue will somehow sort itself out, that it’s not something with which they actually have to come to terms. This is unlike the situation with SJWs, who cannot be avoided in the media, at school, at work, or even, in too many cases, in the family.</p></div>",
  "content_text": "Chris Nuttall, the bestselling SF author, reviews\nCuckservative: How “Conservatives” betrayed America\n:\nIf there is nothing else that can be said about Vox Day – and a great deal of nonsense has been written about him – it is that his mere existence is a testament to the damage done to free speech and common sense by the politically-correct. To try to avoid giving unnecessary offense is a laudable goal, but to declare whole fields of study verboten because of the potential for offense is just plain stupid. Worse, perhaps, when the difference between words and reality becomes impossible to avoid, it undermines faith, the faith we need to keep our society running. Reality does not change on command.\nAfter the runaway bestseller\nSJWs Always Lie\n(\nreviewed here\n), Vox Day tackles two subjects that don’t, on first glance, seem to go together. On one hand, there is the tidal wave of immigration pouring into America (and Europe) and, on the other hand, there is the supine surrender of American Conservatives to liberal thoughts and ideals that have very little relationship to reality. These people have become known as ‘Cuckservatives’ – a combination of ‘cuckoo’ and ‘conservative’ and the fact that the word itself has been declared offensive tells you a great deal about its power.\nWhile\nCuckservative\nhas sold well, it hasn’t taken off the way\nSJWAL\ndid, despite the fact that immigration is the only serious issue in the presidential campaign and the European migrant crisis has been the primary news item for the last six months.\nI think this tends to indicate that many people are still holding out hope that the immigration issue will somehow sort itself out, that it’s not something with which they actually have to come to terms. This is unlike the situation with SJWs, who cannot be avoided in the media, at school, at work, or even, in too many cases, in the family.",
  "tags": [
    "Book Review",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-31T17:00:00+00:00"
}