{
  "url": "https://voxday.net/2016/01/14/the-most-important-book-of-2015/",
  "scraped_at": "2025-12-17T17:41:47.141942",
  "title": "“The Most Important Book of 2015”",
  "date_display": "January 14, 2016",
  "date_iso": "2016-01-14T13:00:00+00:00",
  "date_from_url": "2016-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Most Important Book Of 2015: <a href=\"http://www.returnofkings.com/76526/the-most-important-book-of-2015-sjws-always-lie\"><b><i>SJWs Always Lie </i></b></a></p><blockquote class=\"tr_bq\"><p> As someone who has been the target of SJW attacks for years, and who has helped bring awareness to their totalitarian interpretation of “justice,” I began reading Vox Day’<i>s SJWs Always Lie</i> with enthusiasm. Not only does it go into depth about what SJW’s think and how they behave, it also gives you a strategy for fighting back when they come after you or your organization.</p><p>SJW’s have so infected Western institutions and corporations that it<br> is inevitable you will come face-to-face with an SJW who hopes to harm<br> you and your livelihood. For that reason, <em><a href=\"http://www.amazon.com/gp/product/9527065682/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=9527065682&amp;linkCode=as2&amp;tag=rok0f-20&amp;linkId=3WFKAUFYQ2FTVE3X\">SJWs Always Lie</a></em> amounts to essential reading for all men. It’s the most important book I read in 2015.</br></br></p><blockquote><p> <i>In the universities, in the churches, in the<br> corporations, in the professional associations, in the editorial<br> offices, in the game studios, and just about everywhere else you can<br> imagine, free speech and free thought are under siege by a group of<br> fanatics as self-righteous as Savonarola, as ruthless as Stalin, as<br> ambitious as Napoleon, and as crazy as Caligula. They are the Social<br> Justice Warriors, the SJWs, the self-appointed thought police who have<br> been running amok throughout the West since the dawn of the politically<br> correct era in the 1990s.</br></br></br></br></br></br></br></br></i></p></blockquote><p>Vox methodically breaks down the enemy that we have been fighting for<br> years, including their strengths, weaknesses, and modes of attack.<br> While information on fighting SJWs are available on various sites and<br> forums, this is the first time it has been assembled in one cohesive<br> work.</br></br></br></br></p></blockquote><p>I very much appreciate the distinction. Regardless of what you might think of him, Roosh has been on the front lines of the cultural war and he has fearlessly continued to stand up for men, even men who disdain and disavow him.</p><p>Roosh knows, much better than most of us, the lengths to which SJWs are willing to go to disqualify, discredit, and destroy a man. That is why his praise for the book is so meaningful, and so significant.</p></div>",
  "content_text": "The Most Important Book Of 2015:\nSJWs Always Lie\nAs someone who has been the target of SJW attacks for years, and who has helped bring awareness to their totalitarian interpretation of “justice,” I began reading Vox Day’\ns SJWs Always Lie\nwith enthusiasm. Not only does it go into depth about what SJW’s think and how they behave, it also gives you a strategy for fighting back when they come after you or your organization.\nSJW’s have so infected Western institutions and corporations that it\nis inevitable you will come face-to-face with an SJW who hopes to harm\nyou and your livelihood. For that reason,\nSJWs Always Lie\namounts to essential reading for all men. It’s the most important book I read in 2015.\nIn the universities, in the churches, in the\ncorporations, in the professional associations, in the editorial\noffices, in the game studios, and just about everywhere else you can\nimagine, free speech and free thought are under siege by a group of\nfanatics as self-righteous as Savonarola, as ruthless as Stalin, as\nambitious as Napoleon, and as crazy as Caligula. They are the Social\nJustice Warriors, the SJWs, the self-appointed thought police who have\nbeen running amok throughout the West since the dawn of the politically\ncorrect era in the 1990s.\nVox methodically breaks down the enemy that we have been fighting for\nyears, including their strengths, weaknesses, and modes of attack.\nWhile information on fighting SJWs are available on various sites and\nforums, this is the first time it has been assembled in one cohesive\nwork.\nI very much appreciate the distinction. Regardless of what you might think of him, Roosh has been on the front lines of the cultural war and he has fearlessly continued to stand up for men, even men who disdain and disavow him.\nRoosh knows, much better than most of us, the lengths to which SJWs are willing to go to disqualify, discredit, and destroy a man. That is why his praise for the book is so meaningful, and so significant.",
  "tags": [
    "Book Review",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-14T13:00:00+00:00"
}