{
  "url": "https://voxday.net/2016/01/09/the-denial-strategy/",
  "scraped_at": "2025-12-17T17:41:05.624654",
  "title": "The lies of lunatics",
  "date_display": "January 9, 2016",
  "date_iso": "2016-01-09T23:38:00+00:00",
  "date_from_url": "2016-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Who are the Germans going to believe, the police <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/germany/12090750/German-law-should-be-toughened-to-ease-deportation-of-migrants-says-Angela-Merkel.html\">or their lying eyes</a>?</p><blockquote class=\"tr_bq\"><p> Bild quoted a senior police officer in Frankfurt as saying it was standard policy to keep offences by asylum-seekers from the media.</p><p>“There are strict orders from the chiefs not to report offences by refugees,” the unnamed officer said. “We are only allowed to answer if journalists ask specifically about such incidents.”</p><p>The Frankfurt authorities said police spokesmen had been told to be careful when speaking about asylum-seekers.</p><p>“Press spokesmen were warned the far-Right could exploit cases involving refugees to stoke sentiment against those seeking protection,” Michael Shaykh, a spokesman for the Hesse state interior ministry, said….</p><p> More than 170 women have now come forward to file criminal complaints about that night,120 of them for sexual assault. But in the days that followed, most of Germany had no idea what had<br> happened in the heart of one of its biggest cities, as the events went<br> almost completely unreported.</br></br></p><p>In fact the truth began to emerge<br> on social media within hours. One of the first accounts was posted on<br> the Facebook page of Nett-Werk Köln, a group of around 140,000 members<br> who more usually share tips on party venues and advertise missing cats.</br></br></br></p><p>More information emerged on Twitter, and the local Cologne newspapers<br> began to report the story, but still the national media stayed away.<br> Hans-Peter Freidrich, a former interior minister, has accused the media<br> of imposing a “news blackout” and operating a “code of silence” over<br> negative news about immigrants.</br></br></br></br></p><p>Editors have replied that they<br> were following the official account of the Cologne police that the night<br> had been “peaceful”. But it has also emerged that even after the story<br> hit the national media, guests on public service television were asked<br> not to mention asylum-seekers in interviews about the Cologne assaults.</br></br></br></br></p><p>A week after the incidents, government ministers and the Cologne<br> authorities were still insisting there was no evidence refugees were<br> involved. On Friday, suspicions against then were confirmed for the<br> first time, when the federal police said asylum-seekers are among 31<br> people it is seeking in connection with events inside the station that<br> night. They are wanted for physical violence and theft, but not for<br> sexual assault.</br></br></br></br></br></br></p><p>Now, however, the taboo has been broken, and Mrs<br> Merkel’s critics have seized on the suspected involvement of<br> asylum-seekers as evidence of the failure of her “open-door” refugee<br> policy.</br></br></br></p></blockquote><p>This is disastrous. Those who claim to care about the refugees should be clamoring to send them back, because the mood is turning openly murderous now. I very much doubt the German government is going to survive the year unscathed.</p><p>They have no respect for the German people. And the German people are rapidly losing respect for all authority. There is very little the police could do that will fuel the fire more than telling these stupid lies about their obvious failure to maintain order.</p><p>The Merkel government is more feckless than the Weimar Republic.</p></div>",
  "content_text": "Who are the Germans going to believe, the police\nor their lying eyes\n?\nBild quoted a senior police officer in Frankfurt as saying it was standard policy to keep offences by asylum-seekers from the media.\n“There are strict orders from the chiefs not to report offences by refugees,” the unnamed officer said. “We are only allowed to answer if journalists ask specifically about such incidents.”\nThe Frankfurt authorities said police spokesmen had been told to be careful when speaking about asylum-seekers.\n“Press spokesmen were warned the far-Right could exploit cases involving refugees to stoke sentiment against those seeking protection,” Michael Shaykh, a spokesman for the Hesse state interior ministry, said….\nMore than 170 women have now come forward to file criminal complaints about that night,120 of them for sexual assault. But in the days that followed, most of Germany had no idea what had\nhappened in the heart of one of its biggest cities, as the events went\nalmost completely unreported.\nIn fact the truth began to emerge\non social media within hours. One of the first accounts was posted on\nthe Facebook page of Nett-Werk Köln, a group of around 140,000 members\nwho more usually share tips on party venues and advertise missing cats.\nMore information emerged on Twitter, and the local Cologne newspapers\nbegan to report the story, but still the national media stayed away.\nHans-Peter Freidrich, a former interior minister, has accused the media\nof imposing a “news blackout” and operating a “code of silence” over\nnegative news about immigrants.\nEditors have replied that they\nwere following the official account of the Cologne police that the night\nhad been “peaceful”. But it has also emerged that even after the story\nhit the national media, guests on public service television were asked\nnot to mention asylum-seekers in interviews about the Cologne assaults.\nA week after the incidents, government ministers and the Cologne\nauthorities were still insisting there was no evidence refugees were\ninvolved. On Friday, suspicions against then were confirmed for the\nfirst time, when the federal police said asylum-seekers are among 31\npeople it is seeking in connection with events inside the station that\nnight. They are wanted for physical violence and theft, but not for\nsexual assault.\nNow, however, the taboo has been broken, and Mrs\nMerkel’s critics have seized on the suspected involvement of\nasylum-seekers as evidence of the failure of her “open-door” refugee\npolicy.\nThis is disastrous. Those who claim to care about the refugees should be clamoring to send them back, because the mood is turning openly murderous now. I very much doubt the German government is going to survive the year unscathed.\nThey have no respect for the German people. And the German people are rapidly losing respect for all authority. There is very little the police could do that will fuel the fire more than telling these stupid lies about their obvious failure to maintain order.\nThe Merkel government is more feckless than the Weimar Republic.",
  "tags": [
    "EU",
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-09T23:38:00+00:00"
}