{
  "url": "https://voxday.net/2016/01/02/the-new-battleground/",
  "scraped_at": "2025-12-17T17:39:59.247289",
  "title": "The new battleground",
  "date_display": "January 2, 2016",
  "date_iso": "2016-01-02T11:27:00+00:00",
  "date_from_url": "2016-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Kirby throws down a gauntlet.</p><blockquote class=\"tr_bq\"><p> Look – you will be represented in accordance with your numbers. It’s just that you have really small numbers. That’s why you got your ass handed to you during the vote. And its going to get smaller. Once EPH goes into effect people will stop forking over $40 just because Bard/Larry/Vox tells them them TOR is controlling the Hugos. Again – look at the Goodreads Choice Awards. How are the pups doing? Why don’t you freep that? Because you can’t. Your numbers are tiny.</p></blockquote><p>It’s remarkable how SJWs keep doing the same thing over and over again. I seem to recall when John Scalzi told us that instead of complaining about the increasingly poor quality of the fiction that was winning Hugo awards, we should get involved, nominate, and vote. And instead of being praised for that, we were attacked, vilified, and abused by the deviants of Fandom.</p><p>In the event that we follow Mr. Kirby’s suggestion and are successful in 2016, does anyone think he will congratulate us? Or will we meet with more vilification? I think we can guess given this pair of mind-boggling assertions on his part.</p><p><i>“Scalzi writes good stuff and doesn’t call you anything.” </i></p><p>In any event, there is really only one way to find out. I created my Goodreads account yesterday, as it is clear that with Amazon increasingly policing their reviews, Goodreads has become a primary locus of effort for SJWs. It’s time to for us to start contesting that territory; create an account there and friend me. If you’ve already got a Goodreads account, friend me. You can also follow <a href=\"https://www.goodreads.com/voxday\">my author page there</a>. And then start rating. Don’t worry about writing reviews for now, just hit the ratings for the time being.</p><p>You can also join the new Goodreads group: <a href=\"https://www.goodreads.com/group/show/179469-rabid-puppies\">Rabid Puppies</a>.</p><p>The other thing to do is to flag all of the attack reviews. For example, an SJW named Aaah <a href=\"https://www.goodreads.com/review/show/1375564527?book_show_action=true\">tried to pass this off</a> as a one-star review of SJWAL:</p><blockquote class=\"tr_bq\"><p> Ah, Vox Day. This gif reflects how I feel whenever I hear/read him argue about something, which I’ve been doing since reading A Throne of Bones (a fantasy novel by Vox Day so bad it may cause indelible fits of laughter).</p><p>Unlike with A Throne of Bones, I didn’t actually read SJWs Always Lie.</p><p>I didn’t have to. It’s all in the title.</p><p>1. Because Vox Day’s horde – and I swear to god, they’re a “horde” he calls “the Dread Ilk” – have given the book 5 star ratings across the board on Amazon. They actually gather online to discuss “tactics”, as they’re now doing for the 2016 Hugo Awards. I am not making this up. Day, who failed at destroying the 2015 Hugo Awards, is actually happily sneering at liberal speculative fiction writers, using fandom’s post-Hugo celebratory time to (I swear) try and plan a sneak attack. His own words.</p><p>“Sneak attack.” No fucking irony.</p><p>2. Vox Day’s inability to grasp irony makes its way to the book title. Because Vox Day is, I’ve decided in the time since reading A Throne of Bones (somehow not explicitly subtitled Jesus is the Light of the World and Also Women Are Timid, Frail, Innocent Creatures Which Ought to Be Ruled By Men) an actual idiot….</p><p>It takes a real toilet-clogger to earn 1-star based on title alone, but Day did it.</p><p>Congratulations, Einstein.</p></blockquote><p>Of course, because SJWs Always Lie, it’s apparent that he didn’t read ATOB either. Goodreads is already aware it has a problem with SJWs posting DISQUALIFY reviews like this; some of them still complain about the great review Purge that began in 2013 after it announced a policy that banned reviews like the one quoted above.</p><blockquote class=\"tr_bq\"><p> **<b>Delete content focused on author behavior.</b> We have<br> had a policy of removing reviews that were created primarily to talk<br> about author behavior from the community book page. Once removed, these<br> reviews would remain on the member’s profile. Starting today, we will<br> now delete these entirely from the site. We will also delete shelves and<br> lists of books on Goodreads that are focused on author behavior.</br></br></br></br></br></p></blockquote><p>With that in mind, in addition to rating whatever books you’ve read, those participating should go through the various reviews of the books of the Castalia House authors and flag every review that contains content focused on author behavior rather than on the book itself.</p></div>",
  "content_text": "George Kirby throws down a gauntlet.\nLook – you will be represented in accordance with your numbers. It’s just that you have really small numbers. That’s why you got your ass handed to you during the vote. And its going to get smaller. Once EPH goes into effect people will stop forking over $40 just because Bard/Larry/Vox tells them them TOR is controlling the Hugos. Again – look at the Goodreads Choice Awards. How are the pups doing? Why don’t you freep that? Because you can’t. Your numbers are tiny.\nIt’s remarkable how SJWs keep doing the same thing over and over again. I seem to recall when John Scalzi told us that instead of complaining about the increasingly poor quality of the fiction that was winning Hugo awards, we should get involved, nominate, and vote. And instead of being praised for that, we were attacked, vilified, and abused by the deviants of Fandom.\nIn the event that we follow Mr. Kirby’s suggestion and are successful in 2016, does anyone think he will congratulate us? Or will we meet with more vilification? I think we can guess given this pair of mind-boggling assertions on his part.\n“Scalzi writes good stuff and doesn’t call you anything.”\nIn any event, there is really only one way to find out. I created my Goodreads account yesterday, as it is clear that with Amazon increasingly policing their reviews, Goodreads has become a primary locus of effort for SJWs. It’s time to for us to start contesting that territory; create an account there and friend me. If you’ve already got a Goodreads account, friend me. You can also follow\nmy author page there\n. And then start rating. Don’t worry about writing reviews for now, just hit the ratings for the time being.\nYou can also join the new Goodreads group:\nRabid Puppies\n.\nThe other thing to do is to flag all of the attack reviews. For example, an SJW named Aaah\ntried to pass this off\nas a one-star review of SJWAL:\nAh, Vox Day. This gif reflects how I feel whenever I hear/read him argue about something, which I’ve been doing since reading A Throne of Bones (a fantasy novel by Vox Day so bad it may cause indelible fits of laughter).\nUnlike with A Throne of Bones, I didn’t actually read SJWs Always Lie.\nI didn’t have to. It’s all in the title.\n1. Because Vox Day’s horde – and I swear to god, they’re a “horde” he calls “the Dread Ilk” – have given the book 5 star ratings across the board on Amazon. They actually gather online to discuss “tactics”, as they’re now doing for the 2016 Hugo Awards. I am not making this up. Day, who failed at destroying the 2015 Hugo Awards, is actually happily sneering at liberal speculative fiction writers, using fandom’s post-Hugo celebratory time to (I swear) try and plan a sneak attack. His own words.\n“Sneak attack.” No fucking irony.\n2. Vox Day’s inability to grasp irony makes its way to the book title. Because Vox Day is, I’ve decided in the time since reading A Throne of Bones (somehow not explicitly subtitled Jesus is the Light of the World and Also Women Are Timid, Frail, Innocent Creatures Which Ought to Be Ruled By Men) an actual idiot….\nIt takes a real toilet-clogger to earn 1-star based on title alone, but Day did it.\nCongratulations, Einstein.\nOf course, because SJWs Always Lie, it’s apparent that he didn’t read ATOB either. Goodreads is already aware it has a problem with SJWs posting DISQUALIFY reviews like this; some of them still complain about the great review Purge that began in 2013 after it announced a policy that banned reviews like the one quoted above.\n**\nDelete content focused on author behavior.\nWe have\nhad a policy of removing reviews that were created primarily to talk\nabout author behavior from the community book page. Once removed, these\nreviews would remain on the member’s profile. Starting today, we will\nnow delete these entirely from the site. We will also delete shelves and\nlists of books on Goodreads that are focused on author behavior.\nWith that in mind, in addition to rating whatever books you’ve read, those participating should go through the various reviews of the books of the Castalia House authors and flag every review that contains content focused on author behavior rather than on the book itself.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-02T11:27:00+00:00"
}