{
  "url": "https://voxday.net/2016/01/25/the-silencing-of-tech-lambs/",
  "scraped_at": "2025-12-17T17:43:12.778643",
  "title": "The silencing of the tech lambs",
  "date_display": "January 25, 2016",
  "date_iso": "2016-01-25T16:54:00+00:00",
  "date_from_url": "2016-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An anonymous developer explains <a href=\"https://4fa6134ddde55ae0092b69e1eb287d2840301d0a.googledrive.com/host/0B6kjFNJtv3yzUjY4M21QenJzdGc/\">why he has to remain anonymous</a>:</p><blockquote class=\"tr_bq\"><p> Religious wars in software used to be about a fat bearded man named He-macs wrestling a pencil-neck named Vimmy over what text editor to use, but now FOSS devs are concerned about making sure marginalized human beings feel “welcome,” as if someone was trying to physically block newcomers. That opens the door to social justice and other buzzwords that prigs use to feel better about themselves, and utopian visions documented in “Codes of Conduct,” or CoC.</p><p>The sentiment behind a CoC is that there is no excuse for being an ass, which sounds great until you realize that only a select few people get to decide who’s an ass. So when open source leaders want to stop you from doing free work they can pretend that its your fault for violating their code instead of admitting they never really wanted to include just anybody. They’ve managed to make exclusivity look inclusive, and it makes me crazy that so few people see that….</p><p>They exempt themselves from their own standards and announce their<br> willingness to proxy dox anyone if persuaded to do so on subjective<br> grounds. There is no privacy for you: If you look privileged and someone<br> makes up a story about you, you might get a concerned email from HR<br> about something making the rounds on Twitter and causing a PR nightmare<br> for your employer. Whether or not you actually did anything wrong won’t<br> matter.</br></br></br></br></br></br></p><p>Hacker Eric S. Raymond <a href=\"http://esr.ibiblio.org/?p=6918\">noticed the manipulation at work</a> and indicated that women at tech conferences were <a href=\"http://esr.ibiblio.org/?p=6907\">targeting male open source leaders</a> with false allegations. Accusations have power, and the <a href=\"http://arstechnica.com/tech-policy/2013/03/how-dongle-jokes-got-two-people-fired-and-led-to-ddos-attacks/\">2013 PyCon incident with Adria Richards</a> proved that beyond a shadow of a doubt.</p><p>We need to acknowledge the problem. If you are not considered worthy<br> of protection by ideological CoCs, then there are people out there that<br> want you to at the very least lose your job. If they see you<br> demonstrating even the most innocuous affection or humor, they will<br> likely assume malice and retaliate, especially if you are the wrong<br> color or sex. These are the same people who humiliated a scientist for<br> landing on a comet <a href=\"https://www.rt.com/news/208003-taylor-rosetta-comet-shirtstorm/\">because of a shirt he wore</a>.</br></br></br></br></br></br></p></blockquote><p>If you think it’s bad now, just wait. The next step is going to be taking open source projects and closing them so that they cannot be forked. After all, what is the point of going to all this trouble to take over OSS if the productive people can simply render all their efforts irrelevant by a fork?</p><p>They don’t want a seat at the table, they want control. And what good is control if you can’t control everything?</p><p>As for those who say it’s not possible because the rules of open source don’t permit it, remember, they don’t only exempt themselves from their own standards, they exempt themselves from anything that limits their ability to pursue their objectives.</p><p>I was hoping to do the Open Brainstorm tonight, but we’ll do it tomorrow at 7 PM EST instead. I’ll send out the invites to the VFM tonight, and post the link publicly tomorrow afternoon.</p></div>",
  "content_text": "An anonymous developer explains\nwhy he has to remain anonymous\n:\nReligious wars in software used to be about a fat bearded man named He-macs wrestling a pencil-neck named Vimmy over what text editor to use, but now FOSS devs are concerned about making sure marginalized human beings feel “welcome,” as if someone was trying to physically block newcomers. That opens the door to social justice and other buzzwords that prigs use to feel better about themselves, and utopian visions documented in “Codes of Conduct,” or CoC.\nThe sentiment behind a CoC is that there is no excuse for being an ass, which sounds great until you realize that only a select few people get to decide who’s an ass. So when open source leaders want to stop you from doing free work they can pretend that its your fault for violating their code instead of admitting they never really wanted to include just anybody. They’ve managed to make exclusivity look inclusive, and it makes me crazy that so few people see that….\nThey exempt themselves from their own standards and announce their\nwillingness to proxy dox anyone if persuaded to do so on subjective\ngrounds. There is no privacy for you: If you look privileged and someone\nmakes up a story about you, you might get a concerned email from HR\nabout something making the rounds on Twitter and causing a PR nightmare\nfor your employer. Whether or not you actually did anything wrong won’t\nmatter.\nHacker Eric S. Raymond\nnoticed the manipulation at work\nand indicated that women at tech conferences were\ntargeting male open source leaders\nwith false allegations. Accusations have power, and the\n2013 PyCon incident with Adria Richards\nproved that beyond a shadow of a doubt.\nWe need to acknowledge the problem. If you are not considered worthy\nof protection by ideological CoCs, then there are people out there that\nwant you to at the very least lose your job. If they see you\ndemonstrating even the most innocuous affection or humor, they will\nlikely assume malice and retaliate, especially if you are the wrong\ncolor or sex. These are the same people who humiliated a scientist for\nlanding on a comet\nbecause of a shirt he wore\n.\nIf you think it’s bad now, just wait. The next step is going to be taking open source projects and closing them so that they cannot be forked. After all, what is the point of going to all this trouble to take over OSS if the productive people can simply render all their efforts irrelevant by a fork?\nThey don’t want a seat at the table, they want control. And what good is control if you can’t control everything?\nAs for those who say it’s not possible because the rules of open source don’t permit it, remember, they don’t only exempt themselves from their own standards, they exempt themselves from anything that limits their ability to pursue their objectives.\nI was hoping to do the Open Brainstorm tonight, but we’ll do it tomorrow at 7 PM EST instead. I’ll send out the invites to the VFM tonight, and post the link publicly tomorrow afternoon.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-25T16:54:00+00:00"
}