{
  "url": "https://voxday.net/2016/01/11/the-audio-empire-expands/",
  "scraped_at": "2025-12-17T17:41:17.410144",
  "title": "Expanding the audio front",
  "date_display": "January 11, 2016",
  "date_iso": "2016-01-11T12:51:00+00:00",
  "date_from_url": "2016-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <b><a href=\"http://ecx.images-amazon.com/images/I/51Bb6HBA2YL._AA300_.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://ecx.images-amazon.com/images/I/51Bb6HBA2YL._AA300_.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://ecx.images-amazon.com/images/I/51Bb6HBA2YL._AA300_.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></b></div><p><a href=\"http://amzn.to/1Pnvzuh\"><b><i>A History of Strategy: From Sun Tzu to William S. Lind</i></b></a> Audible – Unabridged. Martin van Creveld (Author), Jon Mollison (Narrator).</p><p><i>There are few better suited to write the history of strategy and<br> military thought than Dr. Martin van Creveld, who has been a significant<br> contributor to the literature of war. A professor emeritus at the<br> Hebrew University, Jerusalem, Dr. van Creveld is one of the world’s<br> leading writers on military history and strategy, with a special<br> interest in the future of war. He is fluent in Hebrew, German, Dutch,<br> and English and has authored more than 20 books, including the<br> influential Technology and War: 2000 BC to the Present (1988), The Transformation of War (1991), and The Culture of War<br> (2010). He is known for his development of the concept of<br> “nontrinitarian” warfare as well as contributing two books to the 4GW<br> canon.</br></br></br></br></br></br></br></br></br></br></i><br> <i><br/></i><br> <i>Featuring a foreword by Dr. Jerrry Pournelle, A History of Strategy: From Sun Tzu to William S. Lind<br> begins with the Chinese military literature, then reviews the Greek,<br> Roman, and Byzantine works before proceeding to the Middle Ages. From<br> Machiavelli and Montecuccoli to Guibert and Frederick the Great, van<br> Creveld chronicles the gradual transition from medieval to Napoleonic<br> warfare and onward into the nuclear age and the rise of ISIS.</br></br></br></br></br></i></br></br></p><p>We’re very pleased to announce our second audio book, <a href=\"http://amzn.to/1Pnvzuh\"><b><i>A History of Strategy: From Sun Tzu to William S. Lind</i></b></a>, and to be able to let you know that many more are on the way, including <i>Awake in the Night Land</i>, <i>SJWs Always Lie</i>, and <i>There Will Be War Vol. X</i>. And if you haven’t heard it yet, you’ll likely want to check out the audio sample of <a href=\"http://amzn.to/1RwFLa5\"><b><i>Cuckservative: How “Conservatives” Betrayed America</i></b></a> as well.</p><p>Our goal is to have all Castalia House books available in audio by the end of 2016. I know most of the readers of this text-heavy blog prefer ebooks to audio, but if you’ve got friends who prefer the latter, do us a favor and let them know about our audiobook line.</p></div>",
  "content_text": "A History of Strategy: From Sun Tzu to William S. Lind\nAudible – Unabridged. Martin van Creveld (Author), Jon Mollison (Narrator).\nThere are few better suited to write the history of strategy and\nmilitary thought than Dr. Martin van Creveld, who has been a significant\ncontributor to the literature of war. A professor emeritus at the\nHebrew University, Jerusalem, Dr. van Creveld is one of the world’s\nleading writers on military history and strategy, with a special\ninterest in the future of war. He is fluent in Hebrew, German, Dutch,\nand English and has authored more than 20 books, including the\ninfluential Technology and War: 2000 BC to the Present (1988), The Transformation of War (1991), and The Culture of War\n(2010). He is known for his development of the concept of\n“nontrinitarian” warfare as well as contributing two books to the 4GW\ncanon.\nFeaturing a foreword by Dr. Jerrry Pournelle, A History of Strategy: From Sun Tzu to William S. Lind\nbegins with the Chinese military literature, then reviews the Greek,\nRoman, and Byzantine works before proceeding to the Middle Ages. From\nMachiavelli and Montecuccoli to Guibert and Frederick the Great, van\nCreveld chronicles the gradual transition from medieval to Napoleonic\nwarfare and onward into the nuclear age and the rise of ISIS.\nWe’re very pleased to announce our second audio book,\nA History of Strategy: From Sun Tzu to William S. Lind\n, and to be able to let you know that many more are on the way, including\nAwake in the Night Land\n,\nSJWs Always Lie\n, and\nThere Will Be War Vol. X\n. And if you haven’t heard it yet, you’ll likely want to check out the audio sample of\nCuckservative: How “Conservatives” Betrayed America\nas well.\nOur goal is to have all Castalia House books available in audio by the end of 2016. I know most of the readers of this text-heavy blog prefer ebooks to audio, but if you’ve got friends who prefer the latter, do us a favor and let them know about our audiobook line.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-11T12:51:00+00:00"
}