{
  "url": "https://voxday.net/2016/01/02/the-least-of-three/",
  "scraped_at": "2025-12-17T17:40:02.558039",
  "title": "The least of the three",
  "date_display": "January 2, 2016",
  "date_iso": "2016-01-02T17:53:00+00:00",
  "date_from_url": "2016-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was rating books on Goodreads today, when it occurred to me why I have never liked <i>The Return of the King</i> as much as either of the two books that preceded it. It is a very good work of fantasy, and it is a satisfactory ending to the trilogy – which was written as a single book – but as one of the three volumes, it is the weakest link.</p><p>I read <i>The Lord of the Rings</i> in a somewhat unusual manner. I was at an overnight church lock-in, and I read about thirty pages of a book that someone else had brought. It was fascinated and really leaped right into the action, with someone named Boromir bravely battling some orcs as he defended two little guys with weird names.</p><p>Sadly, I couldn’t convince my friend to let me take the book with me the next day, but I begged my mother to take me to the library first thing after school. She went one better and picked up the books from there while I was at school, and after I sorted out my confusion concerning which book actually came first, I devoured <i>The Fellowship of the Ring</i> that afternoon and evening, and the rest of the trilogy, followed by <i>The Hobbit</i>, that week.</p><p>It was already December, and that Christmas I received a gold boxed set of white paperbacks that I read and re-read until they fell apart. I now have a beautiful red leather set with a matching green leather Hobbit that Big Chilly and the White Buffalo gave me for my birthday one year.</p><p>But as much as I loved the books, I noticed that when I re-read them, I seldom read <i>The Return of the King</i> cover-to-cover. I usually skipped ahead once Frodo and Sam reached the swamps. And what I realized today is that in addition to the drudgery of trudging through Mordor as a reader, I’ve never felt that the Scouring of the Shire ever made any sense, at least not in the form it appeared.</p><p>The idea that Saruman and Wormtongue had time to not only travel to the Shire, but take it over and institute a repressive, very anti-Hobbit regime simply overstretched the bounds of my credulity. It simply didn’t make any sense to me, then or now. The various endings were otherwise very satisfactory, which makes me think that this was perhaps a very early example of message fiction – in this case, Tolkien’s rural anti-industrialism – leading an author astray.</p><p>It’s a minor flaw, but it is a flaw nevertheless. For all that Peter Jackson has been rightly criticized for permitting the tomfoolery of his fellow writers in <i>The Lord of the Rings</i>, and for the ridiculous metastasized cancer of the second trilogy he produced afterwards, he did well in excising that particular ending from the story.</p></div>",
  "content_text": "I was rating books on Goodreads today, when it occurred to me why I have never liked\nThe Return of the King\nas much as either of the two books that preceded it. It is a very good work of fantasy, and it is a satisfactory ending to the trilogy – which was written as a single book – but as one of the three volumes, it is the weakest link.\nI read\nThe Lord of the Rings\nin a somewhat unusual manner. I was at an overnight church lock-in, and I read about thirty pages of a book that someone else had brought. It was fascinated and really leaped right into the action, with someone named Boromir bravely battling some orcs as he defended two little guys with weird names.\nSadly, I couldn’t convince my friend to let me take the book with me the next day, but I begged my mother to take me to the library first thing after school. She went one better and picked up the books from there while I was at school, and after I sorted out my confusion concerning which book actually came first, I devoured\nThe Fellowship of the Ring\nthat afternoon and evening, and the rest of the trilogy, followed by\nThe Hobbit\n, that week.\nIt was already December, and that Christmas I received a gold boxed set of white paperbacks that I read and re-read until they fell apart. I now have a beautiful red leather set with a matching green leather Hobbit that Big Chilly and the White Buffalo gave me for my birthday one year.\nBut as much as I loved the books, I noticed that when I re-read them, I seldom read\nThe Return of the King\ncover-to-cover. I usually skipped ahead once Frodo and Sam reached the swamps. And what I realized today is that in addition to the drudgery of trudging through Mordor as a reader, I’ve never felt that the Scouring of the Shire ever made any sense, at least not in the form it appeared.\nThe idea that Saruman and Wormtongue had time to not only travel to the Shire, but take it over and institute a repressive, very anti-Hobbit regime simply overstretched the bounds of my credulity. It simply didn’t make any sense to me, then or now. The various endings were otherwise very satisfactory, which makes me think that this was perhaps a very early example of message fiction – in this case, Tolkien’s rural anti-industrialism – leading an author astray.\nIt’s a minor flaw, but it is a flaw nevertheless. For all that Peter Jackson has been rightly criticized for permitting the tomfoolery of his fellow writers in\nThe Lord of the Rings\n, and for the ridiculous metastasized cancer of the second trilogy he produced afterwards, he did well in excising that particular ending from the story.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-02T17:53:00+00:00"
}