{
  "url": "https://voxday.net/2016/01/05/they-owe-hi/",
  "scraped_at": "2025-12-17T17:40:26.636270",
  "title": "They owe him",
  "date_display": "January 5, 2016",
  "date_iso": "2016-01-05T13:00:00+00:00",
  "date_from_url": "2016-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to see how SJWs continually vacillate between claiming that I am totally insignificant and can’t possibly achieve anything and asserting that I am a dire threat to SJW convergence who must be stopped at all costs.</p><blockquote class=\"tr_bq\"><p> <a href=\"https://archive.is/YXSLC\">You All Owe Me</a></p><p>So, you may be familiar with Vox Day, the neofascist scumbag who tried to game the Hugos last year because the award always goes to so-called “social justice warrior” authors. Well recently, after people pointed out that the Goodreads Choice Awards have a wide, wide user base and still award the same type of books as the Hugos and Nebulas, he decided to take action. Over New Years weekend he announced the formation of a Goodreads group with the purpose of gaming the site. Of course the group was set to private so the evil SJWs wouldn’t be able to see what he was up to.</p><p>Too bad for him the only thing keeping out the SJWs was a challenge question that could be answered with a simple Google search. By Saturday night I had access to the group. I didn’t know what to do — undermine him from the inside, play Serpico and leak screenshots on a piecemeal basis, or save them up for a big reveal. The last one seemed the best way not to get caught until I had a good collection of dirt, and I was strongly leaning in that direction.</p><p>But after reading File770’s news roundup yesterday, which included a story about someone being ganged up on by Day and his goons, I decided it might be better to give warning where I could…. Since Vlad so kindly left a link to this evil librarian who had cut off<br> his privileges, I decided to contact him with a warning. Within eight<br> hours Vox Day’s group was gone and VD’s over on his blog whining about<br> being banned here.</br></br></br></p></blockquote><p>It doesn’t seem to have occurred to Sean O’Hara, the SJW infiltrator par excellence, that I made no effort to keep out SJW entryists; I literally wrote the book on SJW entrysm, after all. And Castalia House has been under nonstop cracking attempts since last April. The supersecret question that Sean managed to puzzle out was: “What is the name of the spokesmanatee”.</p><p>The goal had absolutely nothing to do with committing any vandalism on the site. The goal was to see to what extent the SJWs were running amok on Goodreads and smoke them out. I also wanted to learn the system in the build-up to the next Reader’s Choice award, which is not something to which I had hitherto paid any attention, but at least superficially looked less corrupt than the Hugo Awards. We discovered how converged the site is much faster than I had anticipated, thanks to Sean and Rivka, who is not only a librarian, but a moderator.</p><p>It should be obvious that if I had any desire to wreak havoc, I would not have formed a public group of around 200 people and permitted anyone to join it. I would have simply unleashed the 466 Vile Faceless Minions sworn to mindless obedience of the Supreme Dark Lord.</p><p>In any event, this isn’t over. If you want to weigh in, make a Goodreads account, follow my author page, and rate a few books that you’ve read. It only takes a few seconds, and obviously, it is something the SJWs there greatly fear or they would not have reacted as they did. Once more, we see that whatever they have read, it isn’t Sun Tzu.</p><p>Here is an example of <a href=\"https://archive.is/WhxmQ\">a one-star review</a> that Goodreads still deems appropriate and features on its site:</p><blockquote class=\"tr_bq\"><p> Rhea rated it did not like it<br> Shelves: 0-stars-not-even-literature, never-ever-read</br></p><p>The author is a bag of shit, a brainless cockroach, a demented baboon. He (or should I call him “it”?) is racist and sexist and writes poorly-conceived, cookie-cutter, Tolkein-clone, wish-fulfillment fantasy to fill its empty life. Fuck you and fuck your mother for not having her priorities straight nine months before you were born.</p><p>Also, if you read one or two of its blog posts you will see that it has absolutely no sense of logic. I skimmed over one and apperently Vox says that because women are suffering from sex abuse at workplaces, they shouldn’t work at all because their presence is causing “smart capable men” to “turn into rapists.” What the honest fuck?!? WHAT KIND OF ACID DO YOU HAVE TO BE ON TO ARRIVE AT THAT CONCLUSION!?!? Is he drunk??? Is he a troll??? Is he even human??? My theory is that his father had sex with a horse…</p></blockquote><p>Here is an example of a one-star review that Goodreads deemed worthy of a permanent ban and removed from their site, in addition to a four-star review of Banks’s <i>The Business</i> and a five-star review of Haruki Murakami’s <i>A Wild Sheep Chase</i>.</p><blockquote class=\"tr_bq\"><p> Vox Day rated it did not like it<br> Shelves: fiction</br></p><p>THE WASP FACTORY, by Iain Banks, was declared to be one of the top 100 novels of the 20th century by The Independent. That being the case, one can only presume that the Unabomber’s Manifesto, a collection of the Best of The Penthouse Forum Letters, and a recipe for recycling human waste finished in the top 10.</p><p>The Wasp Factory is grotesque in almost every possible way. It is a horror story that is carefully calculated to shock and appall the senses in much the same way, and for much the same reason, that a performance artist would defecate on stage and then roll around in his own excrement. If one reads this book without feeling at least a little disgusted with the author and inclined to wonder what his problem is, there is almost certainly something psychologically wrong with you. The fact that the author succeeds in his obvious authorial intent is not an indication of “exceptional quality”, but merely demonstrates the depths to which the author intended to descend.</p><p>Iain Banks is not a bad writer. Quite the opposite, and I have read and enjoyed a number of his books. But The Wasp Factory is about as egregious a misuse, as irresponsible an abuse, of an author’s literary talent as one can imagine. The plot is absurd, the characters are paper-thin and completely lacking in any credibility whatsoever, and their bizarre sadism is surpassed only by that of the author in subjecting the reader to this novel.</p><p>The fact that it was highly praised is a severe indictment of the terrible state of modern literary criticism.</p></blockquote></div>",
  "content_text": "It’s always interesting to see how SJWs continually vacillate between claiming that I am totally insignificant and can’t possibly achieve anything and asserting that I am a dire threat to SJW convergence who must be stopped at all costs.\nYou All Owe Me\nSo, you may be familiar with Vox Day, the neofascist scumbag who tried to game the Hugos last year because the award always goes to so-called “social justice warrior” authors. Well recently, after people pointed out that the Goodreads Choice Awards have a wide, wide user base and still award the same type of books as the Hugos and Nebulas, he decided to take action. Over New Years weekend he announced the formation of a Goodreads group with the purpose of gaming the site. Of course the group was set to private so the evil SJWs wouldn’t be able to see what he was up to.\nToo bad for him the only thing keeping out the SJWs was a challenge question that could be answered with a simple Google search. By Saturday night I had access to the group. I didn’t know what to do — undermine him from the inside, play Serpico and leak screenshots on a piecemeal basis, or save them up for a big reveal. The last one seemed the best way not to get caught until I had a good collection of dirt, and I was strongly leaning in that direction.\nBut after reading File770’s news roundup yesterday, which included a story about someone being ganged up on by Day and his goons, I decided it might be better to give warning where I could…. Since Vlad so kindly left a link to this evil librarian who had cut off\nhis privileges, I decided to contact him with a warning. Within eight\nhours Vox Day’s group was gone and VD’s over on his blog whining about\nbeing banned here.\nIt doesn’t seem to have occurred to Sean O’Hara, the SJW infiltrator par excellence, that I made no effort to keep out SJW entryists; I literally wrote the book on SJW entrysm, after all. And Castalia House has been under nonstop cracking attempts since last April. The supersecret question that Sean managed to puzzle out was: “What is the name of the spokesmanatee”.\nThe goal had absolutely nothing to do with committing any vandalism on the site. The goal was to see to what extent the SJWs were running amok on Goodreads and smoke them out. I also wanted to learn the system in the build-up to the next Reader’s Choice award, which is not something to which I had hitherto paid any attention, but at least superficially looked less corrupt than the Hugo Awards. We discovered how converged the site is much faster than I had anticipated, thanks to Sean and Rivka, who is not only a librarian, but a moderator.\nIt should be obvious that if I had any desire to wreak havoc, I would not have formed a public group of around 200 people and permitted anyone to join it. I would have simply unleashed the 466 Vile Faceless Minions sworn to mindless obedience of the Supreme Dark Lord.\nIn any event, this isn’t over. If you want to weigh in, make a Goodreads account, follow my author page, and rate a few books that you’ve read. It only takes a few seconds, and obviously, it is something the SJWs there greatly fear or they would not have reacted as they did. Once more, we see that whatever they have read, it isn’t Sun Tzu.\nHere is an example of\na one-star review\nthat Goodreads still deems appropriate and features on its site:\nRhea rated it did not like it\nShelves: 0-stars-not-even-literature, never-ever-read\nThe author is a bag of shit, a brainless cockroach, a demented baboon. He (or should I call him “it”?) is racist and sexist and writes poorly-conceived, cookie-cutter, Tolkein-clone, wish-fulfillment fantasy to fill its empty life. Fuck you and fuck your mother for not having her priorities straight nine months before you were born.\nAlso, if you read one or two of its blog posts you will see that it has absolutely no sense of logic. I skimmed over one and apperently Vox says that because women are suffering from sex abuse at workplaces, they shouldn’t work at all because their presence is causing “smart capable men” to “turn into rapists.” What the honest fuck?!? WHAT KIND OF ACID DO YOU HAVE TO BE ON TO ARRIVE AT THAT CONCLUSION!?!? Is he drunk??? Is he a troll??? Is he even human??? My theory is that his father had sex with a horse…\nHere is an example of a one-star review that Goodreads deemed worthy of a permanent ban and removed from their site, in addition to a four-star review of Banks’s\nThe Business\nand a five-star review of Haruki Murakami’s\nA Wild Sheep Chase\n.\nVox Day rated it did not like it\nShelves: fiction\nTHE WASP FACTORY, by Iain Banks, was declared to be one of the top 100 novels of the 20th century by The Independent. That being the case, one can only presume that the Unabomber’s Manifesto, a collection of the Best of The Penthouse Forum Letters, and a recipe for recycling human waste finished in the top 10.\nThe Wasp Factory is grotesque in almost every possible way. It is a horror story that is carefully calculated to shock and appall the senses in much the same way, and for much the same reason, that a performance artist would defecate on stage and then roll around in his own excrement. If one reads this book without feeling at least a little disgusted with the author and inclined to wonder what his problem is, there is almost certainly something psychologically wrong with you. The fact that the author succeeds in his obvious authorial intent is not an indication of “exceptional quality”, but merely demonstrates the depths to which the author intended to descend.\nIain Banks is not a bad writer. Quite the opposite, and I have read and enjoyed a number of his books. But The Wasp Factory is about as egregious a misuse, as irresponsible an abuse, of an author’s literary talent as one can imagine. The plot is absurd, the characters are paper-thin and completely lacking in any credibility whatsoever, and their bizarre sadism is surpassed only by that of the author in subjecting the reader to this novel.\nThe fact that it was highly praised is a severe indictment of the terrible state of modern literary criticism.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-05T13:00:00+00:00"
}