{
  "url": "https://voxday.net/2016/01/01/traffic-report-2015/",
  "scraped_at": "2025-12-17T17:39:52.196946",
  "title": "Traffic report 2015",
  "date_display": "January 1, 2016",
  "date_iso": "2016-01-01T11:22:00+00:00",
  "date_from_url": "2016-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The growth in site traffic this year was more than expected, as a surprising number of people initially stopped by to see what was going on with the Hugo Awards in August and then stuck around for the remainder of the year. Last year we saw a single 1.5-million pageview month; this year we had 10 in a row. All of the growth was at VP, as AG was pretty flat due to my sporadic posting there. But as was the case last year, 2015 finished very strong; December was not only up 30 percent over last December, but was the second-most-highly-trafficked month of the year.</p><p>In 2015, Vox Popoli had 16,211,875 pageviews and Alpha Game 4,565,094 for a total of 20,776,969 Google pageviews. The blogs are now running at a average rate of 56,923 daily pageviews. And yes, I do find it amusing that the blogs are now seeing considerably more genuine traffic than the “extraordinary amount” a certain SF blogger once lied about having. As for the running annual totals, they are as follows:</p><p>2008: 3,496,757<br> 2009: 4,414,801<br> 2010: 4,827,183<br> 2011: 5,969,066<br> 2012: 7,774,074<br> 2013: 13,111,695<br> 2014: 15,693,622<br> 2015: 20,776,969</br></br></br></br></br></br></br></p><p>Thank you all for the part you have played in making that happen. However, there are some more important numbers that merit mention. 2015 ended with 465 Vile Faceless Minions pledging their mindless obedience to the Supreme Dark Lord and preparing for battle in 2016. Expect heavier use this year, VFM, as the SJWs react to our media offensive in a variety of means both fair and foul.</p><p>On Twitter, I ended the year with 6,230 followers and 14.628 million impressions for 2015. Not bad, but I can clearly put in a little more effort on that front.</p><p>Castalia House grew from 21 books published to 37, including 5 in print and 1 in audiobook. Book sales increased 145 percent and no less than six category bestsellers were published. We also added three editors, an Editor-at-Large, an Audio Editor, and a Blog Editor; see the Castalia blog later today for more details there. Speaking of the Audio Editor, <a href=\"http://amzn.to/1YQw0Yn\">the audiobook for <b><i>Cuckservative</i></b> is now available</a> on Audible and Amazon, and is already one of the top 50 Philosophy audiobooks. We expect even faster growth for Castalia in 2016 with the release of upcoming books such as <i>Riding the Red Horse Vol. 2</i> by Tom Kratman and Vox Day, <i>Iron Chamber of Memory</i> by John C. Wright, <i>Clio and Me</i> by Martin van Creveld, <i>Do Buddhas Dream of Enlightened Sheep</i> by Josh Young, and <i>There Will Be War Vol. XI</i> by Jerry Pournelle, among others.</p><p>And yes, one of those others will be <i>A Sea of Skulls</i>.</p><p>Thank you for your interest, even if it is no more than morbid<br> curiosity, thank you for your support, and while 2015 was certainly intriguing, I believe 2016 is going to be absolutely extraordinary.</br></p></div>",
  "content_text": "The growth in site traffic this year was more than expected, as a surprising number of people initially stopped by to see what was going on with the Hugo Awards in August and then stuck around for the remainder of the year. Last year we saw a single 1.5-million pageview month; this year we had 10 in a row. All of the growth was at VP, as AG was pretty flat due to my sporadic posting there. But as was the case last year, 2015 finished very strong; December was not only up 30 percent over last December, but was the second-most-highly-trafficked month of the year.\nIn 2015, Vox Popoli had 16,211,875 pageviews and Alpha Game 4,565,094 for a total of 20,776,969 Google pageviews. The blogs are now running at a average rate of 56,923 daily pageviews. And yes, I do find it amusing that the blogs are now seeing considerably more genuine traffic than the “extraordinary amount” a certain SF blogger once lied about having. As for the running annual totals, they are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,969,066\n2012: 7,774,074\n2013: 13,111,695\n2014: 15,693,622\n2015: 20,776,969\nThank you all for the part you have played in making that happen. However, there are some more important numbers that merit mention. 2015 ended with 465 Vile Faceless Minions pledging their mindless obedience to the Supreme Dark Lord and preparing for battle in 2016. Expect heavier use this year, VFM, as the SJWs react to our media offensive in a variety of means both fair and foul.\nOn Twitter, I ended the year with 6,230 followers and 14.628 million impressions for 2015. Not bad, but I can clearly put in a little more effort on that front.\nCastalia House grew from 21 books published to 37, including 5 in print and 1 in audiobook. Book sales increased 145 percent and no less than six category bestsellers were published. We also added three editors, an Editor-at-Large, an Audio Editor, and a Blog Editor; see the Castalia blog later today for more details there. Speaking of the Audio Editor,\nthe audiobook for\nCuckservative\nis now available\non Audible and Amazon, and is already one of the top 50 Philosophy audiobooks. We expect even faster growth for Castalia in 2016 with the release of upcoming books such as\nRiding the Red Horse Vol. 2\nby Tom Kratman and Vox Day,\nIron Chamber of Memory\nby John C. Wright,\nClio and Me\nby Martin van Creveld,\nDo Buddhas Dream of Enlightened Sheep\nby Josh Young, and\nThere Will Be War Vol. XI\nby Jerry Pournelle, among others.\nAnd yes, one of those others will be\nA Sea of Skulls\n.\nThank you for your interest, even if it is no more than morbid\ncuriosity, thank you for your support, and while 2015 was certainly intriguing, I believe 2016 is going to be absolutely extraordinary.",
  "tags": [
    "Castalia House",
    "history",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-01T11:22:00+00:00"
}