{
  "url": "https://voxday.net/2016/01/27/trump-takes-on-fox/",
  "scraped_at": "2025-12-17T17:43:24.399187",
  "title": "Trump takes on Fox",
  "date_display": "January 27, 2016",
  "date_iso": "2016-01-27T13:00:00+00:00",
  "date_from_url": "2016-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Naturally, all of the talking heads who feed at the breasts of Mother Media will angrily denounce <a href=\"https://www.washingtonpost.com/politics/trump-says-he-wont-participate-in-gop-debate-on-fox-news/2016/01/26/58fa0b2e-c490-11e5-a4aa-f25866ba0dc6_story.html\">Trump’s decision not to play along with the enemy</a> and declare his campaign to be self-torpedoed and dead. But it’s foolish to use conventional measures to judge the effectiveness of a distinctly non-conventional campaign:</p><blockquote class=\"tr_bq\"><p> Republican presidential front-runner Donald Trump abruptly announced here Tuesday that he would not participate in Thursday’s scheduled debate, escalating his off-and-on feud with Fox News Channel and throwing the GOP campaign into turmoil.</p><p>Trump’s assertion, which his campaign manager insisted was irreversible, came less than one week before the kickoff Iowa caucuses. He once again defied the conventional rules of politics, and used his power and prominence to shape the campaign agenda and conversation.</p><p>So far, Trump’s untraditional moves have only expanded his support, but his threatened boycott leaves him open to criticism that for all his tough talk he is ducking face-to-face confrontations with his opponents and scrutiny from the Fox moderators.</p><p>Given Trump’s past flirtations with boycotting Fox, many will doubt his declaration until they see the other candidates take the debate stage on Thursday night without him.</p><p>The Republican debates have become must-see television, in part because of the allure of Trump’s star power and unpredictable candidacy. But he said Tuesday that he thinks Fox and other television networks have been taking advantage of him by selling advertisements for their debates at a high premium…</p><p>The debate is scheduled to be in Des Moines on Thursday, and Trump said he would instead host a competing event in the state designed to raise money for wounded veterans.</p><p>It would be an unprecedented move if Trump withdrew from the debate at such a consequential moment on the primary calendar.</p></blockquote><p>The media narrative is already stupid; the idea that this is a cowardly move is almost blitheringly out-of-touch; taking on the media directly in this way is far more bold and confrontational than simply showing up on stage again and subjecting oneself to the ridiculous posturing of the moderators.</p><p>Trump is actively breaking the power of the institutions and showing them to be paper tigers. Regardless of what his real intentions are, Trump’s high-risk, high-reward actions are marvelous theater and serve as an inspiring example. <i>De l’audace, encore de l’audace, toujours de l’audace</i>….</p><p>Who but Donald Trump can win a debate by refusing to show up for it?</p></div>",
  "content_text": "Naturally, all of the talking heads who feed at the breasts of Mother Media will angrily denounce\nTrump’s decision not to play along with the enemy\nand declare his campaign to be self-torpedoed and dead. But it’s foolish to use conventional measures to judge the effectiveness of a distinctly non-conventional campaign:\nRepublican presidential front-runner Donald Trump abruptly announced here Tuesday that he would not participate in Thursday’s scheduled debate, escalating his off-and-on feud with Fox News Channel and throwing the GOP campaign into turmoil.\nTrump’s assertion, which his campaign manager insisted was irreversible, came less than one week before the kickoff Iowa caucuses. He once again defied the conventional rules of politics, and used his power and prominence to shape the campaign agenda and conversation.\nSo far, Trump’s untraditional moves have only expanded his support, but his threatened boycott leaves him open to criticism that for all his tough talk he is ducking face-to-face confrontations with his opponents and scrutiny from the Fox moderators.\nGiven Trump’s past flirtations with boycotting Fox, many will doubt his declaration until they see the other candidates take the debate stage on Thursday night without him.\nThe Republican debates have become must-see television, in part because of the allure of Trump’s star power and unpredictable candidacy. But he said Tuesday that he thinks Fox and other television networks have been taking advantage of him by selling advertisements for their debates at a high premium…\nThe debate is scheduled to be in Des Moines on Thursday, and Trump said he would instead host a competing event in the state designed to raise money for wounded veterans.\nIt would be an unprecedented move if Trump withdrew from the debate at such a consequential moment on the primary calendar.\nThe media narrative is already stupid; the idea that this is a cowardly move is almost blitheringly out-of-touch; taking on the media directly in this way is far more bold and confrontational than simply showing up on stage again and subjecting oneself to the ridiculous posturing of the moderators.\nTrump is actively breaking the power of the institutions and showing them to be paper tigers. Regardless of what his real intentions are, Trump’s high-risk, high-reward actions are marvelous theater and serve as an inspiring example.\nDe l’audace, encore de l’audace, toujours de l’audace\n….\nWho but Donald Trump can win a debate by refusing to show up for it?",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-27T13:00:00+00:00"
}