{
  "url": "https://voxday.net/2016/01/30/vaccine-safety-and-ovarian-failure/",
  "scraped_at": "2025-12-17T17:43:49.260417",
  "title": "Vaccine safety and “ovarian failure”",
  "date_display": "January 30, 2016",
  "date_iso": "2016-01-30T02:22:00+00:00",
  "date_from_url": "2016-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once more, we see that those oh-so-trustworthy scientists <a href=\"http://truthkings.com/2016/01/28/pediatricians-association-formally-admits-hpv-vaccine-causes-ovarian-cancer/#\">appear to have carefully buried the risks</a> in the name of not allowing parents to make informed decisions about what they inject into their children:</p><blockquote class=\"tr_bq\"><p> The HPV vaccine is heavily pushed to both teen girls and boys. Even though countries such as Japan won’t formally have stated that they don’t want to support it, the United States continues to massively push this vaccine despite all the push back world-wide. The HPV money grab by pharmaceutical companies is blatant and unchecked. Well, now things just got a whole lot worse: The American College Of Pediatricians has announced that the HPV vaccine is “possibly” associated with ovarian cancer. You can view the document <a href=\"https://archive.is/lh92v\">here</a>.</p><p><i>     It has recently come to the attention of the College that one of the recommended vaccines could possibly be associated with the very rare but serious condition of premature ovarian failure (POF), also known as premature menopause.</i></p><p>The rest of the press release is a defensive mess, claiming that the studies aren’t proof positive. But here’s the thing, if the ACP is admitting this small amount, imagine how large the actual issue likely is? They are always in a mode of protection when it comes to this vaccine, it creates a lot of revenue, so for them to admit this is a really big deal.</p><p>Pharmaceutical companies do not want any negative publications regarding Gardasil. And certainly, they’ve coerced and influenced this organization into not putting out negative claims over the matter. This tells me that this new discovery is huge and creates potential liability for them. It is so big that they actually fear not disclosing it.</p></blockquote><p>It’s amazing that so many scientists insist on continuing to do the one thing that is ABSOLUTELY GUARANTEED to destroy all trust in them, which is point-and-shriek at those who do nothing more than dare to notice all the little anomalies and ask questions about the doubts that are quite naturally raised by their behavior.</p><p>Go ahead, shriek some more about Jenny McCarthy killing people. That’s ever-so-convincing to everyone who wonders about your integrity.</p></div>",
  "content_text": "Once more, we see that those oh-so-trustworthy scientists\nappear to have carefully buried the risks\nin the name of not allowing parents to make informed decisions about what they inject into their children:\nThe HPV vaccine is heavily pushed to both teen girls and boys. Even though countries such as Japan won’t formally have stated that they don’t want to support it, the United States continues to massively push this vaccine despite all the push back world-wide. The HPV money grab by pharmaceutical companies is blatant and unchecked. Well, now things just got a whole lot worse: The American College Of Pediatricians has announced that the HPV vaccine is “possibly” associated with ovarian cancer. You can view the document\nhere\n.\nIt has recently come to the attention of the College that one of the recommended vaccines could possibly be associated with the very rare but serious condition of premature ovarian failure (POF), also known as premature menopause.\nThe rest of the press release is a defensive mess, claiming that the studies aren’t proof positive. But here’s the thing, if the ACP is admitting this small amount, imagine how large the actual issue likely is? They are always in a mode of protection when it comes to this vaccine, it creates a lot of revenue, so for them to admit this is a really big deal.\nPharmaceutical companies do not want any negative publications regarding Gardasil. And certainly, they’ve coerced and influenced this organization into not putting out negative claims over the matter. This tells me that this new discovery is huge and creates potential liability for them. It is so big that they actually fear not disclosing it.\nIt’s amazing that so many scientists insist on continuing to do the one thing that is ABSOLUTELY GUARANTEED to destroy all trust in them, which is point-and-shriek at those who do nothing more than dare to notice all the little anomalies and ask questions about the doubts that are quite naturally raised by their behavior.\nGo ahead, shriek some more about Jenny McCarthy killing people. That’s ever-so-convincing to everyone who wonders about your integrity.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-30T02:22:00+00:00"
}