{
  "url": "https://voxday.net/2016/01/06/viktor-orban-was-rig/",
  "scraped_at": "2025-12-17T17:40:35.669924",
  "title": "Viktor Orban was right",
  "date_display": "January 6, 2016",
  "date_iso": "2016-01-06T09:46:00+00:00",
  "date_from_url": "2016-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What a pity that the British didn’t come around as quickly <a href=\"http://www.nytimes.com/2015/12/21/world/europe/hungary-viktor-orban-migrant-crisis.html?_r=2\">when they were warned by Enoch Powel</a>l:</p><blockquote class=\"tr_bq\"><p> Like most members of Hungary’s liberal intellectual elite, George Konrad, a distinguished novelist, loathes his country’s stridently illiberal prime minister, Viktor Orban.</p><p>“He is not a good democrat and I don’t believe he is a good person,” said Mr. Konrad, a veteran of communist-era struggles against dictatorship.</p><p>All the same, he thinks Mr. Orban, the self-declared scourge of mainstream elites across Europe, was right and Chancellor Angela Merkel of Germany was wrong about how to respond to the chaotic flood of migrants seeking refuge from war and poverty — perhaps Europe’s most serious crisis since World War II.</p><p>“It hurts to admit it, but on this point Orban was right,” Mr. Konrad, 82, said, lamenting that in the absence of a joint European effort to control the flow, Hungary was wise to seal its borders and sound the alarm over the perils of allowing hundreds of thousands of migrants, mostly Muslims, to enter Europe willy-nilly.</p><p>Quietly, and often with similar misgivings, a growing number of people in Hungary and beyond are wondering whether, despite his shrill and often bigoted message, Mr. Orban had a clearer view of the scale of the migration crisis and its potential hazards than technocrats in Brussels and leaders in Berlin and other European capitals….</p><p>In a recent interview with European newspapers, Donald Tusk, president of the European Council, the body that presides over <a class=\"meta-org\" href=\"http://topics.nytimes.com/top/reference/timestopics/organizations/e/european_union/index.html?inline=nyt-org\" title=\"More articles about the European Union.\">European Union</a> summit meetings, described Ms. Merkel’s welcoming approach to migrants as “<a href=\"http://www.theguardian.com/world/2015/dec/02/detain-refugees-arriving--europe-18-months-donald-tusk\" title=\"Guardian article\">dangerous</a>”<br> and endorsed the view long promoted by Mr. Orban — that most of the<br> asylum seekers entering Europe were not Syrians fleeing war but economic<br> migrants seeking jobs.</br></br></br></p></blockquote><p>If Europeans are forced to choose between Muslims and nationalists, they will choose nationalists. If they are forced to choose between Muslims and fascists, they will choose fascists. And if they are forced to choose between Muslims and neo-nazis, they will choose neo-nazis.</p><p>The secular elites who have welcomed this invasion should rethink their attempt to cling to power and manage the situation they themselves created. They are the problem, not the solution. And all that trying to prevent those who warned them of the consequences of their actions from addressing the situation will accomplish is ensure that more extreme measures are taken.</p><p>Very nearly everyone with whom I have spoken is <i>furiously </i>angry. The situation is extremely unstable, and I suspect there will be more than a few newsworthy events in 2016. The mass sexual assault at the Cologne train station is merely the first of many to come.</p><p><i>“There is a shift to the extreme right because the left, or what is left<br> of the left, and the moderate center right were offering answers that<br> were wrong,” said Mr. Gyarmati, who heads the International Center for<br> Democratic Transition, a group that promotes democracy. “Now we are in a<br> situation where the answers are unpleasant to say the least.”</br></br></br></br></i></p><p>Sooner or later, reality always imposes itself, no matter how many people insist that 2+2 equals 37.</p></div>",
  "content_text": "What a pity that the British didn’t come around as quickly\nwhen they were warned by Enoch Powel\nl:\nLike most members of Hungary’s liberal intellectual elite, George Konrad, a distinguished novelist, loathes his country’s stridently illiberal prime minister, Viktor Orban.\n“He is not a good democrat and I don’t believe he is a good person,” said Mr. Konrad, a veteran of communist-era struggles against dictatorship.\nAll the same, he thinks Mr. Orban, the self-declared scourge of mainstream elites across Europe, was right and Chancellor Angela Merkel of Germany was wrong about how to respond to the chaotic flood of migrants seeking refuge from war and poverty — perhaps Europe’s most serious crisis since World War II.\n“It hurts to admit it, but on this point Orban was right,” Mr. Konrad, 82, said, lamenting that in the absence of a joint European effort to control the flow, Hungary was wise to seal its borders and sound the alarm over the perils of allowing hundreds of thousands of migrants, mostly Muslims, to enter Europe willy-nilly.\nQuietly, and often with similar misgivings, a growing number of people in Hungary and beyond are wondering whether, despite his shrill and often bigoted message, Mr. Orban had a clearer view of the scale of the migration crisis and its potential hazards than technocrats in Brussels and leaders in Berlin and other European capitals….\nIn a recent interview with European newspapers, Donald Tusk, president of the European Council, the body that presides over\nEuropean Union\nsummit meetings, described Ms. Merkel’s welcoming approach to migrants as “\ndangerous\n”\nand endorsed the view long promoted by Mr. Orban — that most of the\nasylum seekers entering Europe were not Syrians fleeing war but economic\nmigrants seeking jobs.\nIf Europeans are forced to choose between Muslims and nationalists, they will choose nationalists. If they are forced to choose between Muslims and fascists, they will choose fascists. And if they are forced to choose between Muslims and neo-nazis, they will choose neo-nazis.\nThe secular elites who have welcomed this invasion should rethink their attempt to cling to power and manage the situation they themselves created. They are the problem, not the solution. And all that trying to prevent those who warned them of the consequences of their actions from addressing the situation will accomplish is ensure that more extreme measures are taken.\nVery nearly everyone with whom I have spoken is\nfuriously\nangry. The situation is extremely unstable, and I suspect there will be more than a few newsworthy events in 2016. The mass sexual assault at the Cologne train station is merely the first of many to come.\n“There is a shift to the extreme right because the left, or what is left\nof the left, and the moderate center right were offering answers that\nwere wrong,” said Mr. Gyarmati, who heads the International Center for\nDemocratic Transition, a group that promotes democracy. “Now we are in a\nsituation where the answers are unpleasant to say the least.”\nSooner or later, reality always imposes itself, no matter how many people insist that 2+2 equals 37.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-06T09:46:00+00:00"
}