{
  "url": "https://voxday.net/2016/01/09/when-coverup-fails/",
  "scraped_at": "2025-12-17T17:41:02.309269",
  "title": "When the coverup fails",
  "date_display": "January 9, 2016",
  "date_iso": "2016-01-09T13:00:00+00:00",
  "date_from_url": "2016-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJWs of science fiction fandom have done their level best <a href=\"http://www.castaliahouse.com/supplement-ii-the-enablers-in-fandom-respond-to-safe-space-as-rape-room/\">to denigrate, discredit and disqualify Daniel’s historic five-part expose</a> on predatory child abuse in science fiction over the last five decades. They want to bury their sordid past, and hide their filthy present, because they know that their embrace of criminal deviancy will cause even the liberal mainstream to turn against them if it ever comes to light.</p><ul><li><i>“[Day] is just writing stuff to fill his slate and then cackle both evilly and ineffectively.</i>” – Chris S.</li><li><i>“RE: Castalia House’s new thing. It’s a reactionary tactic called Amplification, where they use the language of progressive politics to either accuse progressives of doing something horrible, or to claim that the horrible thing they do must be accepted by progressives or they’re being discriminatory.”</i> – Lorcan Nagle</li><li><i>I haven’t stopped laughing at the weaksauce effort there yet. Even if I ignore the clearly incredibly out of context quotes as well as the utterly inaccurate paraphrasing of what people said, there’s still a great deal of it that seems to have come from an alternate universe.</i><i>”</i> – snowcrash </li><li><i>“I hate to give Castalia House credit for anything, but their usage of Search Engine Optimization tactics ain’t bad. Using science fiction and the Clarke miniseries as a traffic driver, there may be new eyeballs that are exposed to his words. Of course, there could also end up being lots of traffic driven to CH for the words “rape” and “pedophilia“. I’ll bet he thinks of that as a victory condition, too, right up to the point where the authorities start asking questions.</i><i>”</i> – Glenn Hauman</li><li><i>“This blatant attempt to play “gotcha” with SF’s history of dealing with sexual abuse committed within its own community is a particularly vile and disgusting example of hypocrisy.”</i> – McJulie</li><li><i>“That’s kind of wild misreading of what Delany said.”</i> – Aaron</li></ul><p><a href=\"http://www.castaliahouse.com/supplement-ii-the-enablers-in-fandom-respond-to-safe-space-as-rape-room/\">As Daniel noted</a>, these responses are not atypical, they represent the longtime position of the SF fandom community to protect the predators in its midst.</p><blockquote class=\"tr_bq\"><p> Of all 200+ comments in the threads at File770, not one fan raised the question of what should be done about the problem. If the “Safe Space as Rape Room” series hasn’t demonstrated that there is a code of silence regarding pedophilia in science fiction, the feral reaction of the fans to this “old news” certainly does.</p><p>Notably, of the above selections, three of the pedo-apologists comprise File 770’s Top 5 “most prolific” commenters of 2015: JJ, Peace Is My Middle Name, Aaron.</p><p>So if you had any doubts that these are the thoughts of core fans, those doubts should now be gone.</p></blockquote><p>And, as we know, SJWs always lie. They cannot hide the truth, especially not <a href=\"http://www.castaliahouse.com/protecting-your-child-from-the-pedophiles-of-science-fiction-fandom/\">while there are still witnesses</a> able to call them out and expose their attempts to retroactively spin their Narrative.</p><blockquote class=\"tr_bq\"><p> Excellent, if emetic article: I am Breen’s daughter Moira Greyland, and I am glad to answer questions, though I cannot promise they will be less emetic than the article itself.</p><p>Seriously, this is very upsetting subject matter. I cried when I read your article, though I’ve been steeped in this material for awhile. Reading my father’s words is most upsetting.</p><p>I wish I knew a little less.</p></blockquote><p>Another survivor <a href=\"http://www.castaliahouse.com/safe-space-as-rape-room-science-fiction-culture-and-childhoods-end-part-5-of-5/#comment-209386\">is equally forthright</a>:</p><blockquote class=\"tr_bq\"><p> Speak up:</p><p>For all the rape culture stuff that gets tossed around you can really reduce it to one word and that is: <i>Silence</i>.</p><p>People who rape count on you being too shocked, too thrown off, and feeling too guilty and complicit for not doing something right away to speak up. Don’t let them get away with that. Speak up. Find help. Do whatever it takes to snap back to reality. I don’t care who you are or how you vote, that’s the single best thing you can do for yourself or anyone else.</p></blockquote><p>They are speaking up. We are willing to stand up, speak out, and support them, those individuals who have survived far worse from SF fandom than anything we have ever experienced at their nasty little hands.</p><p>For those who wish to question our motivations, we have but one response: <i>“The enemy of my enemy is my friend.” </i></p><p>And there is no friend more loyal than a Rabid Puppy.</p></div>",
  "content_text": "The SJWs of science fiction fandom have done their level best\nto denigrate, discredit and disqualify Daniel’s historic five-part expose\non predatory child abuse in science fiction over the last five decades. They want to bury their sordid past, and hide their filthy present, because they know that their embrace of criminal deviancy will cause even the liberal mainstream to turn against them if it ever comes to light.\n“[Day] is just writing stuff to fill his slate and then cackle both evilly and ineffectively.\n” – Chris S.\n“RE: Castalia House’s new thing. It’s a reactionary tactic called Amplification, where they use the language of progressive politics to either accuse progressives of doing something horrible, or to claim that the horrible thing they do must be accepted by progressives or they’re being discriminatory.”\n– Lorcan Nagle\nI haven’t stopped laughing at the weaksauce effort there yet. Even if I ignore the clearly incredibly out of context quotes as well as the utterly inaccurate paraphrasing of what people said, there’s still a great deal of it that seems to have come from an alternate universe.\n”\n– snowcrash\n“I hate to give Castalia House credit for anything, but their usage of Search Engine Optimization tactics ain’t bad. Using science fiction and the Clarke miniseries as a traffic driver, there may be new eyeballs that are exposed to his words. Of course, there could also end up being lots of traffic driven to CH for the words “rape” and “pedophilia“. I’ll bet he thinks of that as a victory condition, too, right up to the point where the authorities start asking questions.\n”\n– Glenn Hauman\n“This blatant attempt to play “gotcha” with SF’s history of dealing with sexual abuse committed within its own community is a particularly vile and disgusting example of hypocrisy.”\n– McJulie\n“That’s kind of wild misreading of what Delany said.”\n– Aaron\nAs Daniel noted\n, these responses are not atypical, they represent the longtime position of the SF fandom community to protect the predators in its midst.\nOf all 200+ comments in the threads at File770, not one fan raised the question of what should be done about the problem. If the “Safe Space as Rape Room” series hasn’t demonstrated that there is a code of silence regarding pedophilia in science fiction, the feral reaction of the fans to this “old news” certainly does.\nNotably, of the above selections, three of the pedo-apologists comprise File 770’s Top 5 “most prolific” commenters of 2015: JJ, Peace Is My Middle Name, Aaron.\nSo if you had any doubts that these are the thoughts of core fans, those doubts should now be gone.\nAnd, as we know, SJWs always lie. They cannot hide the truth, especially not\nwhile there are still witnesses\nable to call them out and expose their attempts to retroactively spin their Narrative.\nExcellent, if emetic article: I am Breen’s daughter Moira Greyland, and I am glad to answer questions, though I cannot promise they will be less emetic than the article itself.\nSeriously, this is very upsetting subject matter. I cried when I read your article, though I’ve been steeped in this material for awhile. Reading my father’s words is most upsetting.\nI wish I knew a little less.\nAnother survivor\nis equally forthright\n:\nSpeak up:\nFor all the rape culture stuff that gets tossed around you can really reduce it to one word and that is:\nSilence\n.\nPeople who rape count on you being too shocked, too thrown off, and feeling too guilty and complicit for not doing something right away to speak up. Don’t let them get away with that. Speak up. Find help. Do whatever it takes to snap back to reality. I don’t care who you are or how you vote, that’s the single best thing you can do for yourself or anyone else.\nThey are speaking up. We are willing to stand up, speak out, and support them, those individuals who have survived far worse from SF fandom than anything we have ever experienced at their nasty little hands.\nFor those who wish to question our motivations, we have but one response:\n“The enemy of my enemy is my friend.”\nAnd there is no friend more loyal than a Rabid Puppy.",
  "tags": [
    "conspiracy",
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-01-09T13:00:00+00:00"
}