{
  "url": "https://voxday.net/2009/12/01/addio-albion/",
  "scraped_at": "2026-01-08T23:13:39.105708",
  "title": "Addio Albion",
  "date_display": "December 1, 2009",
  "date_iso": "2009-12-01T23:30:00+00:00",
  "date_from_url": "2009-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bankers and bureaucrats of Brussels have accomplished what <a href=\"http://eureferendum.blogspot.com/2009/12/dispatch-from-occupied-country.html\">Julius Caesar, Philip II, Napoleon, and Adolf Hitler could not do</a>:</p><blockquote><p>From today, as the Lisbon treaty comes into force, we are no longer masters in our own house. Our prime minister, as a member of the European Council, is obligated under this new treaty to promote the aims and objectives of the European Union, over and above those of the UK, and is bound by the rules of the Union.</p><p>Of course, this will make no immediate difference. It simply renders de jure what has been de facto for several decades, but the coming into force of the treaty marks an important symbolic turning point. We are no longer an independent country, de jure. Our prime minister and his government are now working for an alien government, based in Brussels.</p></blockquote><p>Not only is the empire on which the sun never set long gone, Britain itself is no more than a conquered island and a subject people.  This time, no Nelson, no Wellington, no Churchill arose to defend the British people.  It is a tragic moment in history, and one that will cause more tragedy in the future.  James Higham explains why even a belated version of <a href=\"http://nourishingobscurity.com/2009/12/01/there-wont-be-a-britain-next-year/#more-4454\">the once-promised referendum</a> is unlikely to accomplish anything.</p></div>",
  "content_text": "The bankers and bureaucrats of Brussels have accomplished what\nJulius Caesar, Philip II, Napoleon, and Adolf Hitler could not do\n:\nFrom today, as the Lisbon treaty comes into force, we are no longer masters in our own house. Our prime minister, as a member of the European Council, is obligated under this new treaty to promote the aims and objectives of the European Union, over and above those of the UK, and is bound by the rules of the Union.\nOf course, this will make no immediate difference. It simply renders de jure what has been de facto for several decades, but the coming into force of the treaty marks an important symbolic turning point. We are no longer an independent country, de jure. Our prime minister and his government are now working for an alien government, based in Brussels.\nNot only is the empire on which the sun never set long gone, Britain itself is no more than a conquered island and a subject people.  This time, no Nelson, no Wellington, no Churchill arose to defend the British people.  It is a tragic moment in history, and one that will cause more tragedy in the future.  James Higham explains why even a belated version of\nthe once-promised referendum\nis unlikely to accomplish anything.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-01T23:30:00+00:00"
}