{
  "url": "https://voxday.net/2009/12/12/addressing-rgd-review/",
  "scraped_at": "2026-01-08T23:14:25.406209",
  "title": "Addressing an RGD “review”",
  "date_display": "December 12, 2009",
  "date_iso": "2009-12-12T15:23:00+00:00",
  "date_from_url": "2009-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Birge commits several errors in what he attempts to pass off as a “review” of <a href=\"http://www.amazon.com/gp/product/1935071181/ref=cm_rdp_product/175-9512425-1613704\">The Return of the Great Depression</a>, but they all stem from a single source.  This is his inability to understand Paul Krugman’s purpose in writing the “Hangover” essay or connect that purpose to Krugman’s statement that total income is equal to total spending.  This failure is the foundation of his bizarre attack on both my character and RGD; as he writes: <i>“I’m simply pointing out that if Vox can’t even understand what Krugman is talking about, on simple matters like this, how can one trust his dismissal of Krugman? One can be right for the wrong reasons, and if Vox is right about Krugman being an idiot, it’s certainly not because Vox grasps what Krugman is trying to say.”</i></p><p>So, Jonathan’s “review” can be summarized as three basic claims:</p><p>1. Paul Krugman had no substantive reason to declare that total spending equals total income.<br> 2. I misread what Krugman had written when he declared total spending equals total income.<br> 3. This single “misreading” justifies the complete dismissal of RGD.</br></br></p><p>I will now proceed to demonstrate the falsity of all three of these claims.  When I read his review, it was immediately obvious to me that Jonathan did not understand what Krugman was saying about income and spending, much less why he said it, but Jonathan helpfully proceeded to admit as much in his subsequent comments. <i>“Krugman wasn’t making a big point: he was saying that whenever you get a dollar, some other entity gave it to you and had to consider that spending…. Why the hell Krugman brings it up is beyond me.”</i> And yet, even when his erroneous assumptions were pointed out to him, Jonathan insisted that this supposedly inexplicable statement of Krugman’s was not merely true, but a downright tautology <i>“because it’s simply a statement that when money changes hands, it’s a debit for somebody and a credit for someone else. Debt doesn’t change this, and time-preference isn’t even germane to the debate. The fact that Vox brings up time-preference proves he had no idea what Krugman was trying to say.”</i></p><p>This is incorrect on several levels.  Unlike Jonathan, I not only understand what Krugman was saying, I also understand why he was saying it.  Far from being an irrelevant tautology, Krugman’s statement that total spending necessarily equals total income is the basis of his erroneous argument against the Austrian concept of the business cycle.  It is so important, in fact, that it was the only part of the essay that I deemed necessary to quote directly and in full.  Although Krugman has since modified the position he took in his 1998 essay and admitted that perhaps investment bubbles do lead to economic contractions after all, the entire point of the essay was to prove that the Austrian school theory is wrong and that recessions are not a consequence of economic booms.  Hence the title “The Hangover Theory”.</p><p>But before I explain why the assertion that total spending equals total income was both a) integral to Krugman’s case and b) incorrect, it’s worth pointing out that Krugman doesn’t even believe that the assertion is intrinsically true, let alone tautologically obvious as Jonathan insists.  When asked in October if the dichotomy between statistical reports of rising consumer spending and higher unemployment numbers contradicted “the economic maxim that expenditures are equal to income” Krugman <a href=\"”http://krugman.blogs.nytimes.com/2009/10/06/krugman-responds-readers-questions/”\">replied</a>: <b>“That ‘economic maxim’ is deeply misleading. Consumers can and do spend either more or less than their income. And even for the economy as a whole, in the short run income adjusts to match spending, not the other way around.”</b></p><p>Krugman admits what I originally stated: total spending does NOT necessarily equal total income.  It cannot, obviously, since income has to adjust in order to match spending.  Now, why does income have to adjust to spending and why doesn’t it work the other way around?  We can only surmise that there must be some additional factor that would allow spending to take place without income… whatever could that be?  Finally, why would Krugman declare something that he later states to be misleading?  In this case, it is not an example of his occasional inconsistency or because he changed his mind since 1998, but because he needed to make the income-spending equivalence in order to attack a specific point of Austrian business cycle theory.  While Krugman doesn’t know much about Austrian theory and mistakes malinvestment for “overinvestment” in “investment goods” (capital goods is the Austrian term), he knows just enough about it to understand that the Austrians place great theoretical importance on the shift from investment in the production of consumer goods to investment in the production of capital goods.  However, because he has not actually read much, if any, Austrian theory, he does not understand the mechanism of that shift, which in its conventional formulation is the result of expanded bank credit producing false signals that encourage businesses to invest in producing higher-order capital goods rather than lower-order consumer goods.  Since he doesn’t understand the mechanism, he wrongly concludes that a converse shift in investment from consumer goods to capital goods will have an equal but inverse effect as the shift from capital goods to consumer goods.  If the former can cause a recession, he decides, then the latter should too.</p><p>This is why he wrote: <b>“So if people decide to spend less on investment goods, doesn’t that mean that they must be deciding to spend more on consumption goods—implying that an investment slump should always be accompanied by a corresponding consumption boom?”</b> This is a major sticking point for Krugman; <a href=\"http://krugman.blogs.nytimes.com/2009/10/05/reinventing-1934-macro/\">earlier this year he wrote</a>: <b>“you ask why, say, a housing boom — which requires shifting resources into housing — doesn’t produce the same kind of unemployment as a housing bust that shifts resources out of housing.”</b> He derives this false equivalence from the very statement for which Jonathan sees no point, the statement that is the foundation of his argument against Austrian business cycle theory.</p><p><b>“Here’s the problem: As a matter of simple arithmetic, total spending in the economy is necessarily equal to total income (every sale is also a purchase, and vice versa).  So if people decide to spend less on investment goods….”</b></p><p>It should now be clear that Jonathan is incorrect, that Krugman’s statement is not a tautology and that Krugman was using it to make a big point, the central point of his argument.  It should also be clear that I understand what Krugman is saying and why he is saying it.  But, even if I didn’t misread Krugman, did I make a mistake in referring to individual decisions about equities and cars?  Was it an error to highlight the facts that not every dollar of income must be spent today, and not every dollar that is spent today is earned?  No, of course not.  Here is why.</p><p>Let’s start with Jonathan’s assertion about the first point. <i>“In no case would the actions of a single person possibly illuminate or refute the point Krugman was making (which is that each transaction requires two parties where each take the opposite side of the trade).”</i> But, as I’ve already demonstrated, Jonathan failed to understand the point Krugman was using that statement to make.  The actions of single person serve very well to illuminate the fact a failure to invest in capital goods does not require an investment in consumer goods, for the obvious reason that what is being considered is the sum total of all the actions of individuals.  Krugman himself refers to precisely such individual actions when he writes that “if people decide to spend less on investment goods, doesn’t that mean that they must be deciding to spend more on consumption goods…?”  These are individual decisions, nor can Jonathan claim they are not thanks to Krugman’s more recent distinction between “consumers” who can and do spend either more or less than their income and “the economy as a whole.”  While there are a few areas that Keynesian theory insists on making a distinction between that which benefits an individual and that which benefits the aggregate, such as Keynes’s Paradox of Thrift, that does not apply to this example where the individual’s investment decisions will have a directly quantifiable effect on the aggregate.</p><p>Now to my two statements about the observable facts that puncture Krugman’s dilemma.  Because Jonathan did not read the book, he is unaware that a great deal of attention is given to the nature of money, central banking and the fractional-reserve system.  By his own admission, he does not understand how a modern monetary system works; he says: “I don’t know how the accounting works for things like Fed operations….”  More importantly, his subsequent comments reveal that he doesn’t even know what money in a modern economy actually is, as after being given a hint of the magnitude of his error by Steveo, he attempts to equivocate by creating a false distinction between bank-created debt and money.</p><p><i>that makes it sound like banks can print money, which they can’t. they issue debt that, in our system of fractional reserve banking, is legally declared equivalent to money. when a bank issues a loan, the bank is not spending money any more than you’re getting income when using your credit card.</i></p><p>Had Jonathan actually read RGD, he would know that in the U.S. and most modern financial systems, money <i>is</i> debt, which is why the politicians around the world are so desperate to force the banks to increase their lending.  This is the heart of the very important debate over inflation vs debt-deflation that has been going on for the past five years between economists who foresaw the crisis and actually understand what is taking place right now.  But for the purposes of this explanation, it is sufficient to point out that when a bank issues a loan, it is not spending money, it is <i>creating</i> money.  In fact, this fractional reserve-created money is <a href=\"http://en.wikipedia.org/wiki/File:Components_of_the_United_States_money_supply.svg\">by far the larger portion of the money supply</a>; Jonathan’s knowledge doesn’t even rise to the level of Wikipedia, which states: <b>“The different forms of money in government money supply statistics arise from the practice of fractional-reserve banking. Whenever a bank gives out a loan in a fractional-reserve banking system, a new sum of money is created. This new type of money is what makes up the non-M0 components in the M1-M3 statistics… central bank money is M0 while the commercial bank money is divided up into the M1-M3 components”</b></p><p>Now, where does M1-M3 come from?  From savings deposited in the banks, or in other words, “every dollar of income that is not spent today.”  So, far from being equal to income, spending in a fractional-reserve system is always a <i>multiple</i> of income, the process which Paul Samuelson laid out in detail in the table entitled <i>Multiple Expansion of Bank Deposits through the Banking System</i> in his influential textbook.  Jonathan’s mistake here is to assume that the mere fact of money changing hands causes it to be regarded as both income and spending.  He writes: <i>“You don’t need to know much about economics to grasp the simple idea that every buy involves a sell. It’s as simple as that. Your income is somebody else’s expenditure.”</i></p><p>Therein lies his fundamental mistake.  Every buy does involve a sell and your income may be somebody else’s expenditure, but that does not mean your income is somebody else’s expenditure <i>derived from their own income</i>.  In claiming that spending equals income, Jonathan has erroneously assumed a closed loop.  If a company borrows money from a bank in order to pay me for my services, its expenditure was not derived from its income and only a fraction of it was derived from anyone else’s income. Spending can come from income, but it does not have to do so.  And, as I have shown in past posts, the larger part of the growth in aggregate spending has <a href=\"http://www.returnofthegreatdepression.com/2009/10/debt-funded-growth/\">come from this very bank-created non-income</a> that Jonathan claims does not exist.</p><p>Perhaps it might have been easier on economic novices like Jonathan had I troubled to go into detail explaining that the existence of savings in a fractional-reserve banking system is sufficient to explode the false equivalency of spending and income.  Perhaps it was too much to expect that the average reader would be able to correctly grasp the consequential implications of a failure to spend 100 percent of one’s income. Nevertheless, my failure to spell things out for the reader does not change the accuracy of my observation that unless every dollar of income is spent rather than saved, deposited, and loaned out, total spending will never equal total income in a modern economy with fractional-reserve banking.  Nor would additional explanation alter in the slightest the correctness of my statement that not every dollar that is spent today has been earned.  Because debt is not income and some spending is funded by debt, total spending does not equal total income, but rather, exceeds it.  This is, of course, the very first thing I pointed out in addressing Krugman’s fallacious attack on the business cycle.</p><p>So, Jonathan’s first two points fail, which thereby causes his third point to fail as well.  It makes no sense to dismiss a book for a nonexistent error and the only misreading of Krugman that took place was Jonathan’s.  These were not his only errors, but this demonstration of the falsehood of his three primary claims will suffice to prove that his “review” of RGD is flawed to the point of utter irrelevance.  And I will also take strong exception to his assertion that an error, even an egregious error, renders the entirety of a book useless.  For example, if we were to accept Jonathan’s specious logic, we would have to conclude that Paul Krugman’s most recent book, <i>The Return of Depression Economics</i>, should be junked due to Krugman’s statement that “about half the banks in the United States failed” in 1931.  The correct number was about 11 percent.  Contra Jonathan, I assert that ignoring Krugman’s book would be a mistake and that despite his failure to account for debt or time preferences, Krugman is not an idiot, but is merely crippled by his past success, his stubborn dedication to an erroneous and outmoded economic model, and his willful refusal to consider other, more reliable economic theories.</p><p>As to the questions, credit yourself if you spotted Jonathan’s errors:</p><p>5 points: I did not interpret Krugman’s income-spending equivalence “to mean that every dollar of one’s income one must spend.”</p><p>10 points: Krugman’s income-spending equivalence was not an obvious tautology.  Nor was it a pointless statement.</p><p>25 points: Fractional-reserve banking.</p><p>It is not my habit to copy and paste complete texts from other sites, but since Jonathan elected to question my “balls” for merely quoting the most relevant part and providing a direct link to it, here it is in its entirety:</p><blockquote><p>Vox Day, for those who don’t know, is a libertarian Christian blogger, known more for his penchant for hyperbole than reasoned argument. However, he’s intelligent and well-read enough that it takes a little while to realize that he’s all bluster and little substance, and this, coupled with his supreme confidence in his own intelligence, has resulted in him attracting a moderately large legion of sycophantic followers to his website. No doubt it is such people who have given glowing reviews to this book.</p><p>However, anybody with a capacity for independent thought ned only peruse a few sample pages from this book to see what a charlatan Vox is, at least when it comes to economics. His prose is so self-consciously academic, that it almost lulls one into complacently following along. But where he is right, he is regurgitating the work of others. Where he strays from this, however, close inspection reveals profound mistakes. Styling himself an Austrian economist, a reading of his criticism against Krugman makes it clear that Vox is well out of his depth, so embarrassingly so that one need read no further. On pages 163-164, he make an ludicrous strawman rebuttal of an argument of Krugman’s. To be specific, he misreads Krugman’s statement that all income is spending (and vice versa) to mean that every dollar of one’s income one must spend. He then spends the next several paragraphs ackwardly informing us of the obvious, such as that when one doesn’t buy a factory, that doesn’t mean they must buy something else. I almost feel bad for Vox, as he gloats in his victory over an argument nobody would ever be dumb enough to make. (And I would think nobody would be dumb enough to think somebody with a Nobel Prize would make it, either.) He accuses Krugman of not understanding simple things like time-preference or the effects of debt, of essentially being a base moron.</p><p>Of course, what Krugman means is that one person’s income must come from somebody else’s spending, an obvious tautology. Sadly, I don’t think Vox was trying to pull anything. I think Vox really believes he understands this stuff enough to write about it, when it’s seems all he knows how to do is reference other works in a pseudo-academic tone and parrot the names of concepts he’s read.</p><p>It takes some serious guts to write a book insulting a Nobel Prize winning economist when you never worked a day as an economist, but if this book makes one thing clear (and it would be the only accomplishment of this book) it would be that Vox Day is a pathological narcissist. In fact, I’m sure if Vox ever comes across this review, he’ll make equally shoddy strawman arguments against it, skewer it to the front page of his website, and sooth his ego with the reassurances of those who are greater fools than he.</p><p>(For the record, I’m not defending Krugman or Keynesian economics. I’m a libertarian myself, and subscribe to Austrian economics to the limited extent I understand it. I actually came to this book thinking I’d like it and learn a lot from it. Unfortunately, I’m compelled to review it poorly. I’ve never written a review on a book I didn’t read completely, but sometimes it’s justified when the author makes such egregious errors in the first chapter one peruses. You don’t need to finish an entire turd sandwich to know the last bite is going to taste as bad as the first.)</p></blockquote></div>",
  "content_text": "Jonathan Birge commits several errors in what he attempts to pass off as a “review” of\nThe Return of the Great Depression\n, but they all stem from a single source.  This is his inability to understand Paul Krugman’s purpose in writing the “Hangover” essay or connect that purpose to Krugman’s statement that total income is equal to total spending.  This failure is the foundation of his bizarre attack on both my character and RGD; as he writes:\n“I’m simply pointing out that if Vox can’t even understand what Krugman is talking about, on simple matters like this, how can one trust his dismissal of Krugman? One can be right for the wrong reasons, and if Vox is right about Krugman being an idiot, it’s certainly not because Vox grasps what Krugman is trying to say.”\nSo, Jonathan’s “review” can be summarized as three basic claims:\n1. Paul Krugman had no substantive reason to declare that total spending equals total income.\n2. I misread what Krugman had written when he declared total spending equals total income.\n3. This single “misreading” justifies the complete dismissal of RGD.\nI will now proceed to demonstrate the falsity of all three of these claims.  When I read his review, it was immediately obvious to me that Jonathan did not understand what Krugman was saying about income and spending, much less why he said it, but Jonathan helpfully proceeded to admit as much in his subsequent comments.\n“Krugman wasn’t making a big point: he was saying that whenever you get a dollar, some other entity gave it to you and had to consider that spending…. Why the hell Krugman brings it up is beyond me.”\nAnd yet, even when his erroneous assumptions were pointed out to him, Jonathan insisted that this supposedly inexplicable statement of Krugman’s was not merely true, but a downright tautology\n“because it’s simply a statement that when money changes hands, it’s a debit for somebody and a credit for someone else. Debt doesn’t change this, and time-preference isn’t even germane to the debate. The fact that Vox brings up time-preference proves he had no idea what Krugman was trying to say.”\nThis is incorrect on several levels.  Unlike Jonathan, I not only understand what Krugman was saying, I also understand why he was saying it.  Far from being an irrelevant tautology, Krugman’s statement that total spending necessarily equals total income is the basis of his erroneous argument against the Austrian concept of the business cycle.  It is so important, in fact, that it was the only part of the essay that I deemed necessary to quote directly and in full.  Although Krugman has since modified the position he took in his 1998 essay and admitted that perhaps investment bubbles do lead to economic contractions after all, the entire point of the essay was to prove that the Austrian school theory is wrong and that recessions are not a consequence of economic booms.  Hence the title “The Hangover Theory”.\nBut before I explain why the assertion that total spending equals total income was both a) integral to Krugman’s case and b) incorrect, it’s worth pointing out that Krugman doesn’t even believe that the assertion is intrinsically true, let alone tautologically obvious as Jonathan insists.  When asked in October if the dichotomy between statistical reports of rising consumer spending and higher unemployment numbers contradicted “the economic maxim that expenditures are equal to income” Krugman\nreplied\n:\n“That ‘economic maxim’ is deeply misleading. Consumers can and do spend either more or less than their income. And even for the economy as a whole, in the short run income adjusts to match spending, not the other way around.”\nKrugman admits what I originally stated: total spending does NOT necessarily equal total income.  It cannot, obviously, since income has to adjust in order to match spending.  Now, why does income have to adjust to spending and why doesn’t it work the other way around?  We can only surmise that there must be some additional factor that would allow spending to take place without income… whatever could that be?  Finally, why would Krugman declare something that he later states to be misleading?  In this case, it is not an example of his occasional inconsistency or because he changed his mind since 1998, but because he needed to make the income-spending equivalence in order to attack a specific point of Austrian business cycle theory.  While Krugman doesn’t know much about Austrian theory and mistakes malinvestment for “overinvestment” in “investment goods” (capital goods is the Austrian term), he knows just enough about it to understand that the Austrians place great theoretical importance on the shift from investment in the production of consumer goods to investment in the production of capital goods.  However, because he has not actually read much, if any, Austrian theory, he does not understand the mechanism of that shift, which in its conventional formulation is the result of expanded bank credit producing false signals that encourage businesses to invest in producing higher-order capital goods rather than lower-order consumer goods.  Since he doesn’t understand the mechanism, he wrongly concludes that a converse shift in investment from consumer goods to capital goods will have an equal but inverse effect as the shift from capital goods to consumer goods.  If the former can cause a recession, he decides, then the latter should too.\nThis is why he wrote:\n“So if people decide to spend less on investment goods, doesn’t that mean that they must be deciding to spend more on consumption goods—implying that an investment slump should always be accompanied by a corresponding consumption boom?”\nThis is a major sticking point for Krugman;\nearlier this year he wrote\n:\n“you ask why, say, a housing boom — which requires shifting resources into housing — doesn’t produce the same kind of unemployment as a housing bust that shifts resources out of housing.”\nHe derives this false equivalence from the very statement for which Jonathan sees no point, the statement that is the foundation of his argument against Austrian business cycle theory.\n“Here’s the problem: As a matter of simple arithmetic, total spending in the economy is necessarily equal to total income (every sale is also a purchase, and vice versa).  So if people decide to spend less on investment goods….”\nIt should now be clear that Jonathan is incorrect, that Krugman’s statement is not a tautology and that Krugman was using it to make a big point, the central point of his argument.  It should also be clear that I understand what Krugman is saying and why he is saying it.  But, even if I didn’t misread Krugman, did I make a mistake in referring to individual decisions about equities and cars?  Was it an error to highlight the facts that not every dollar of income must be spent today, and not every dollar that is spent today is earned?  No, of course not.  Here is why.\nLet’s start with Jonathan’s assertion about the first point.\n“In no case would the actions of a single person possibly illuminate or refute the point Krugman was making (which is that each transaction requires two parties where each take the opposite side of the trade).”\nBut, as I’ve already demonstrated, Jonathan failed to understand the point Krugman was using that statement to make.  The actions of single person serve very well to illuminate the fact a failure to invest in capital goods does not require an investment in consumer goods, for the obvious reason that what is being considered is the sum total of all the actions of individuals.  Krugman himself refers to precisely such individual actions when he writes that “if people decide to spend less on investment goods, doesn’t that mean that they must be deciding to spend more on consumption goods…?”  These are individual decisions, nor can Jonathan claim they are not thanks to Krugman’s more recent distinction between “consumers” who can and do spend either more or less than their income and “the economy as a whole.”  While there are a few areas that Keynesian theory insists on making a distinction between that which benefits an individual and that which benefits the aggregate, such as Keynes’s Paradox of Thrift, that does not apply to this example where the individual’s investment decisions will have a directly quantifiable effect on the aggregate.\nNow to my two statements about the observable facts that puncture Krugman’s dilemma.  Because Jonathan did not read the book, he is unaware that a great deal of attention is given to the nature of money, central banking and the fractional-reserve system.  By his own admission, he does not understand how a modern monetary system works; he says: “I don’t know how the accounting works for things like Fed operations….”  More importantly, his subsequent comments reveal that he doesn’t even know what money in a modern economy actually is, as after being given a hint of the magnitude of his error by Steveo, he attempts to equivocate by creating a false distinction between bank-created debt and money.\nthat makes it sound like banks can print money, which they can’t. they issue debt that, in our system of fractional reserve banking, is legally declared equivalent to money. when a bank issues a loan, the bank is not spending money any more than you’re getting income when using your credit card.\nHad Jonathan actually read RGD, he would know that in the U.S. and most modern financial systems, money\nis\ndebt, which is why the politicians around the world are so desperate to force the banks to increase their lending.  This is the heart of the very important debate over inflation vs debt-deflation that has been going on for the past five years between economists who foresaw the crisis and actually understand what is taking place right now.  But for the purposes of this explanation, it is sufficient to point out that when a bank issues a loan, it is not spending money, it is\ncreating\nmoney.  In fact, this fractional reserve-created money is\nby far the larger portion of the money supply\n; Jonathan’s knowledge doesn’t even rise to the level of Wikipedia, which states:\n“The different forms of money in government money supply statistics arise from the practice of fractional-reserve banking. Whenever a bank gives out a loan in a fractional-reserve banking system, a new sum of money is created. This new type of money is what makes up the non-M0 components in the M1-M3 statistics… central bank money is M0 while the commercial bank money is divided up into the M1-M3 components”\nNow, where does M1-M3 come from?  From savings deposited in the banks, or in other words, “every dollar of income that is not spent today.”  So, far from being equal to income, spending in a fractional-reserve system is always a\nmultiple\nof income, the process which Paul Samuelson laid out in detail in the table entitled\nMultiple Expansion of Bank Deposits through the Banking System\nin his influential textbook.  Jonathan’s mistake here is to assume that the mere fact of money changing hands causes it to be regarded as both income and spending.  He writes:\n“You don’t need to know much about economics to grasp the simple idea that every buy involves a sell. It’s as simple as that. Your income is somebody else’s expenditure.”\nTherein lies his fundamental mistake.  Every buy does involve a sell and your income may be somebody else’s expenditure, but that does not mean your income is somebody else’s expenditure\nderived from their own income\n.  In claiming that spending equals income, Jonathan has erroneously assumed a closed loop.  If a company borrows money from a bank in order to pay me for my services, its expenditure was not derived from its income and only a fraction of it was derived from anyone else’s income. Spending can come from income, but it does not have to do so.  And, as I have shown in past posts, the larger part of the growth in aggregate spending has\ncome from this very bank-created non-income\nthat Jonathan claims does not exist.\nPerhaps it might have been easier on economic novices like Jonathan had I troubled to go into detail explaining that the existence of savings in a fractional-reserve banking system is sufficient to explode the false equivalency of spending and income.  Perhaps it was too much to expect that the average reader would be able to correctly grasp the consequential implications of a failure to spend 100 percent of one’s income. Nevertheless, my failure to spell things out for the reader does not change the accuracy of my observation that unless every dollar of income is spent rather than saved, deposited, and loaned out, total spending will never equal total income in a modern economy with fractional-reserve banking.  Nor would additional explanation alter in the slightest the correctness of my statement that not every dollar that is spent today has been earned.  Because debt is not income and some spending is funded by debt, total spending does not equal total income, but rather, exceeds it.  This is, of course, the very first thing I pointed out in addressing Krugman’s fallacious attack on the business cycle.\nSo, Jonathan’s first two points fail, which thereby causes his third point to fail as well.  It makes no sense to dismiss a book for a nonexistent error and the only misreading of Krugman that took place was Jonathan’s.  These were not his only errors, but this demonstration of the falsehood of his three primary claims will suffice to prove that his “review” of RGD is flawed to the point of utter irrelevance.  And I will also take strong exception to his assertion that an error, even an egregious error, renders the entirety of a book useless.  For example, if we were to accept Jonathan’s specious logic, we would have to conclude that Paul Krugman’s most recent book,\nThe Return of Depression Economics\n, should be junked due to Krugman’s statement that “about half the banks in the United States failed” in 1931.  The correct number was about 11 percent.  Contra Jonathan, I assert that ignoring Krugman’s book would be a mistake and that despite his failure to account for debt or time preferences, Krugman is not an idiot, but is merely crippled by his past success, his stubborn dedication to an erroneous and outmoded economic model, and his willful refusal to consider other, more reliable economic theories.\nAs to the questions, credit yourself if you spotted Jonathan’s errors:\n5 points: I did not interpret Krugman’s income-spending equivalence “to mean that every dollar of one’s income one must spend.”\n10 points: Krugman’s income-spending equivalence was not an obvious tautology.  Nor was it a pointless statement.\n25 points: Fractional-reserve banking.\nIt is not my habit to copy and paste complete texts from other sites, but since Jonathan elected to question my “balls” for merely quoting the most relevant part and providing a direct link to it, here it is in its entirety:\nVox Day, for those who don’t know, is a libertarian Christian blogger, known more for his penchant for hyperbole than reasoned argument. However, he’s intelligent and well-read enough that it takes a little while to realize that he’s all bluster and little substance, and this, coupled with his supreme confidence in his own intelligence, has resulted in him attracting a moderately large legion of sycophantic followers to his website. No doubt it is such people who have given glowing reviews to this book.\nHowever, anybody with a capacity for independent thought ned only peruse a few sample pages from this book to see what a charlatan Vox is, at least when it comes to economics. His prose is so self-consciously academic, that it almost lulls one into complacently following along. But where he is right, he is regurgitating the work of others. Where he strays from this, however, close inspection reveals profound mistakes. Styling himself an Austrian economist, a reading of his criticism against Krugman makes it clear that Vox is well out of his depth, so embarrassingly so that one need read no further. On pages 163-164, he make an ludicrous strawman rebuttal of an argument of Krugman’s. To be specific, he misreads Krugman’s statement that all income is spending (and vice versa) to mean that every dollar of one’s income one must spend. He then spends the next several paragraphs ackwardly informing us of the obvious, such as that when one doesn’t buy a factory, that doesn’t mean they must buy something else. I almost feel bad for Vox, as he gloats in his victory over an argument nobody would ever be dumb enough to make. (And I would think nobody would be dumb enough to think somebody with a Nobel Prize would make it, either.) He accuses Krugman of not understanding simple things like time-preference or the effects of debt, of essentially being a base moron.\nOf course, what Krugman means is that one person’s income must come from somebody else’s spending, an obvious tautology. Sadly, I don’t think Vox was trying to pull anything. I think Vox really believes he understands this stuff enough to write about it, when it’s seems all he knows how to do is reference other works in a pseudo-academic tone and parrot the names of concepts he’s read.\nIt takes some serious guts to write a book insulting a Nobel Prize winning economist when you never worked a day as an economist, but if this book makes one thing clear (and it would be the only accomplishment of this book) it would be that Vox Day is a pathological narcissist. In fact, I’m sure if Vox ever comes across this review, he’ll make equally shoddy strawman arguments against it, skewer it to the front page of his website, and sooth his ego with the reassurances of those who are greater fools than he.\n(For the record, I’m not defending Krugman or Keynesian economics. I’m a libertarian myself, and subscribe to Austrian economics to the limited extent I understand it. I actually came to this book thinking I’d like it and learn a lot from it. Unfortunately, I’m compelled to review it poorly. I’ve never written a review on a book I didn’t read completely, but sometimes it’s justified when the author makes such egregious errors in the first chapter one peruses. You don’t need to finish an entire turd sandwich to know the last bite is going to taste as bad as the first.)",
  "tags": [
    "economics",
    "freakshow",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-12T15:23:00+00:00"
}