{
  "url": "https://voxday.net/2009/12/01/anti-peanuts-presiden/",
  "scraped_at": "2026-01-08T23:13:36.731039",
  "title": "The anti-Peanuts president",
  "date_display": "December 1, 2009",
  "date_iso": "2009-12-01T19:32:00+00:00",
  "date_from_url": "2009-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama doesn’t want to be president anymore.  I don’t see how you can possibly interpret <a href=\"http://blogs.mcall.com/capitol_ideas/2009/11/the.html\">his decision to embark upon his own Vietnam</a> any other way:</p><blockquote><p>The address before the United States Military Academy at West Point on Tuesday night will not only be used to announce the immediate order to deploy roughly 30,000 more troops, but the administration will also use the occasion to convey how it intends to turn the fight over to the Kabul government, the New York Times reported.</p></blockquote><p>And with their reliably impeccable judgment, his PR handlers actually scheduled the speech to preempt <i>A Charlie Brown Christmas</i>.  Whether you see this as accidental or part of the Left’s ongoing War on Christmas, it’s just blatantly stupid.  It’s bad enough to Vietnam your presidency, but allowing yourself to be identified as the anti-Peanuts president takes it to a whole new level.  This guy is going to have non-black approval ratings in the single digits by the time 2012 rolls around.</p><p>If you’d like sophisticated military analysis of the decision to put an additional 30,000 troops in pointless peril, here it is in three words: never reinforce failure.</p></div>",
  "content_text": "Obama doesn’t want to be president anymore.  I don’t see how you can possibly interpret\nhis decision to embark upon his own Vietnam\nany other way:\nThe address before the United States Military Academy at West Point on Tuesday night will not only be used to announce the immediate order to deploy roughly 30,000 more troops, but the administration will also use the occasion to convey how it intends to turn the fight over to the Kabul government, the New York Times reported.\nAnd with their reliably impeccable judgment, his PR handlers actually scheduled the speech to preempt\nA Charlie Brown Christmas\n.  Whether you see this as accidental or part of the Left’s ongoing War on Christmas, it’s just blatantly stupid.  It’s bad enough to Vietnam your presidency, but allowing yourself to be identified as the anti-Peanuts president takes it to a whole new level.  This guy is going to have non-black approval ratings in the single digits by the time 2012 rolls around.\nIf you’d like sophisticated military analysis of the decision to put an additional 30,000 troops in pointless peril, here it is in three words: never reinforce failure.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-01T19:32:00+00:00"
}