{
  "url": "https://voxday.net/2009/12/23/atheist-on-indoctrination/",
  "scraped_at": "2026-01-08T23:15:13.549212",
  "title": "An atheist on indoctrination",
  "date_display": "December 23, 2009",
  "date_iso": "2009-12-23T15:15:00+00:00",
  "date_from_url": "2009-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know if the ostrich-like indoctrination approach that John Loftus describes is normal for most Bible colleges and seminaries or not, but <a href=\"http://debunkingchristianity.blogspot.com/2009/12/what-is-difference-between-education.html\">it certainly applies to almost every university in the world</a> with regards to economics:</p><blockquote><p>When I went to Bible College I was not educated. I was indoctrinated. While other believers will protest that their Christian college was different, I wonder if that’s true. In order to test this let me explain my experience, compare it with what a good education is, and see what you think. Okay?</p><p>Yesterday I had lunch with my friend Dr. Dan Lambert of the Evangelical school John Brown University. He is using my book, WIBA, in several different teaching venues, including college/master’s level classes, and even at an adult study group for a church. I had written about this before. He’s not the only one. My friend Dr. Richard Knopp is using my book in his college/master’s level apologetics classes. I had written about this before too.</p><p>There are others, so I’m told. I would like to applaud them all for doing their very best to educate rather than indoctrinate their students. Some skeptics may claim they’re indoctrinating their students anyway, but this is the best we can expect of them. I don’t think the word “indoctrinate” can apply to doing what they’re doing, even if they are arguing against me in their classes.</p></blockquote><p>I very much agree with Loftus on the difference between education and indoctrination; I am not only a strong advocate of reading the material from opposing points of view, but of <i>learning it and knowing it better</i> than the advocates of that point of view.  For example, the average Richard Dawkins fan does not realize that when Dawkins makes the superficially straightforward statement that “evolution is a fact” he is actually committing typical Dawkinsian sleight of hand and only commits himself to having inferred the facthood of evolution.  This inference, of course, is not at all the same thing as an actual fact, let alone an “inescapable” one.  In like manner, few Marxians understand how thoroughly robotics and the information society have destroyed the entire foundation of not only Marxian economics, but historical materialism, simply because they do not know their Marx well enough.</p><p>I have as little patience for Christians who think it is unnecessary to know what non-Christians are saying as I do for atheists who plead that cretinous Courtier’s Reply while simultaneously attempting to criticize religion in general or Christianity in particular.  The fact that one might happen to be correct about something should never be confused for the knowledge of why one is correct, the probability that one is correct, or the ability to explain why someone else is incorrect.  The best minds constantly embrace challenges to their thinking, they do not run and hide from them.  I can only commend the likes of Dr. Lambart who do not shirk from doing what every good teacher should do and expose their students to the arguments and ideologies they will be expected to face in the future.</p><p>Since the question will undoubtedly arise, I should point out that I haven’t read Loftus’s books, and I have no idea if his critiques of Christianity are any more serious or intellectually legitimate than those presented by the Circle Jerk of the Militant Godless.</p></div>",
  "content_text": "I don’t know if the ostrich-like indoctrination approach that John Loftus describes is normal for most Bible colleges and seminaries or not, but\nit certainly applies to almost every university in the world\nwith regards to economics:\nWhen I went to Bible College I was not educated. I was indoctrinated. While other believers will protest that their Christian college was different, I wonder if that’s true. In order to test this let me explain my experience, compare it with what a good education is, and see what you think. Okay?\nYesterday I had lunch with my friend Dr. Dan Lambert of the Evangelical school John Brown University. He is using my book, WIBA, in several different teaching venues, including college/master’s level classes, and even at an adult study group for a church. I had written about this before. He’s not the only one. My friend Dr. Richard Knopp is using my book in his college/master’s level apologetics classes. I had written about this before too.\nThere are others, so I’m told. I would like to applaud them all for doing their very best to educate rather than indoctrinate their students. Some skeptics may claim they’re indoctrinating their students anyway, but this is the best we can expect of them. I don’t think the word “indoctrinate” can apply to doing what they’re doing, even if they are arguing against me in their classes.\nI very much agree with Loftus on the difference between education and indoctrination; I am not only a strong advocate of reading the material from opposing points of view, but of\nlearning it and knowing it better\nthan the advocates of that point of view.  For example, the average Richard Dawkins fan does not realize that when Dawkins makes the superficially straightforward statement that “evolution is a fact” he is actually committing typical Dawkinsian sleight of hand and only commits himself to having inferred the facthood of evolution.  This inference, of course, is not at all the same thing as an actual fact, let alone an “inescapable” one.  In like manner, few Marxians understand how thoroughly robotics and the information society have destroyed the entire foundation of not only Marxian economics, but historical materialism, simply because they do not know their Marx well enough.\nI have as little patience for Christians who think it is unnecessary to know what non-Christians are saying as I do for atheists who plead that cretinous Courtier’s Reply while simultaneously attempting to criticize religion in general or Christianity in particular.  The fact that one might happen to be correct about something should never be confused for the knowledge of why one is correct, the probability that one is correct, or the ability to explain why someone else is incorrect.  The best minds constantly embrace challenges to their thinking, they do not run and hide from them.  I can only commend the likes of Dr. Lambart who do not shirk from doing what every good teacher should do and expose their students to the arguments and ideologies they will be expected to face in the future.\nSince the question will undoubtedly arise, I should point out that I haven’t read Loftus’s books, and I have no idea if his critiques of Christianity are any more serious or intellectually legitimate than those presented by the Circle Jerk of the Militant Godless.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-23T15:15:00+00:00"
}