{
  "url": "https://voxday.net/2009/12/30/beautiful-dessication/",
  "scraped_at": "2026-01-08T23:15:40.972483",
  "title": "Beautiful dessication",
  "date_display": "December 30, 2009",
  "date_iso": "2009-12-30T01:18:00+00:00",
  "date_from_url": "2009-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given his penchant for discord and experimentation, I never, ever thought David Sylvian would again approach the music of Gone To Earth or the lyrics of Secrets of the Beehive.  Rain Tree Crow was good, but it wasn’t the same.  And yet, he somehow managed to combine elements of my two favorite albums in <a href=\"http://www.youtube.com/watch?v=mCYr2T01ibk\">Atom and Cell</a> on Snow Borne Sorrow.</p><p><i>Her skin was darker than ashes<br> And she had something to say<br> About being naked to the elements<br> At the end of yet another day<br> And the rain on her back that continued to fall<br> From the bruise of her lips<br> Swollen, fragile, and small</br></br></br></br></br></br></i></p><p>And the bills that you paid with were worth nothing at all<br> A lost foreign currency<br> Multi-coloured, barely reputable<br> Like the grasses that blew in the warm summer breeze<br> Well she offered you this to do as you pleased</br></br></br></br></p><p>And where is the poetry?<br> Didn’t she promise us poetry?</br></p><p>It’s simultaneously beautiful and harsh.  I appreciate a reasonably wide range of music, but I don’t know that I really require anything these days but David Sylvian and Disturbed… and I’d do without Disturbed before Sylvian. <a href=\"http://www.youtube.com/watch?v=zq0GAkZp5AA\">The Banality of Evil</a> is nearly as good, although it’s more sinister and smoothly superficial.  I love the way he delivers the ominous-sounding “hello neighbor” line.</p><p><i>And the lives that you hold in the palm of your hand<br> You toss them aside small and damn near unbreakable<br> You drank all the water and you pissed yourself dry<br> Then you fell to your knees and proceeded to cry</br></br></br></i></p><p>And who could feel sorry for a drunkard like this<br> In a democracy of dunces with a parasite’s kiss?</br></p><p>And where are the stars?<br> Didn’t she promise us stars?</br></p></div>",
  "content_text": "Given his penchant for discord and experimentation, I never, ever thought David Sylvian would again approach the music of Gone To Earth or the lyrics of Secrets of the Beehive.  Rain Tree Crow was good, but it wasn’t the same.  And yet, he somehow managed to combine elements of my two favorite albums in\nAtom and Cell\non Snow Borne Sorrow.\nHer skin was darker than ashes\nAnd she had something to say\nAbout being naked to the elements\nAt the end of yet another day\nAnd the rain on her back that continued to fall\nFrom the bruise of her lips\nSwollen, fragile, and small\nAnd the bills that you paid with were worth nothing at all\nA lost foreign currency\nMulti-coloured, barely reputable\nLike the grasses that blew in the warm summer breeze\nWell she offered you this to do as you pleased\nAnd where is the poetry?\nDidn’t she promise us poetry?\nIt’s simultaneously beautiful and harsh.  I appreciate a reasonably wide range of music, but I don’t know that I really require anything these days but David Sylvian and Disturbed… and I’d do without Disturbed before Sylvian.\nThe Banality of Evil\nis nearly as good, although it’s more sinister and smoothly superficial.  I love the way he delivers the ominous-sounding “hello neighbor” line.\nAnd the lives that you hold in the palm of your hand\nYou toss them aside small and damn near unbreakable\nYou drank all the water and you pissed yourself dry\nThen you fell to your knees and proceeded to cry\nAnd who could feel sorry for a drunkard like this\nIn a democracy of dunces with a parasite’s kiss?\nAnd where are the stars?\nDidn’t she promise us stars?",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-30T01:18:00+00:00"
}