{
  "url": "https://voxday.net/2009/12/02/betraying-betrayers/",
  "scraped_at": "2026-01-08T23:13:40.991571",
  "title": "Betraying the betrayers",
  "date_display": "December 2, 2009",
  "date_iso": "2009-12-02T09:54:00+00:00",
  "date_from_url": "2009-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The City belatedly realizes that when they sold out the British people, they sold themselves too.  Chancellor Darling’s <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/guest_contributors/article6939781.ece\">desperate plea for Brussels</a> to leave London’s financial sector alone has a distinct “please don’t hit me” tone to it and is certain to fall on stone-deaf Franco-German ears:</p><blockquote><p>It is too simplistic to argue that financial centres in Europe are just competing among themselves. The reality is the real competition to Europe’s financial centres comes from outside our borders. And that London, whether others like it or not, is New York’s only rival as a truly global financial centre. No other centre in Europe offers the same range of services: banking, insurance, fund management, law and accountancy. It is in all of Europe’s interests that they prosper alongside their close European partners.</p></blockquote><p>Oh, it is <i>too simplistic</i>?  Yes, surely that sophisticated argument will convince the unelected EU ruling class, who are openly drooling at the thought of taking their cut of great river of money flowing through the City, to leave London’s financial firms untouched.  Meanwhile, French President Nicolas Sarkozy lost no time in declaring what the end of British sovereignty yesterday would mean for the City: <i>“Do you know what it means for me to see for the first time in 50 years a French European commissioner in charge of the internal market, including financial services, including the City [of London]?  I want the world to see the victory of the European model, which has nothing to do with the excesses of financial capitalism.”</i></p><p>In every revolution and betrayal, there is that intriguing moment when the now-useless revolutionary or traitor suddenly realizes that he’s been used and is about to be discarded.  I think there are more than a few staunchly Europhilic politicians and bankers who are astonished today at the realization that they are not to be included among the masters of Eutopia.</p></div>",
  "content_text": "The City belatedly realizes that when they sold out the British people, they sold themselves too.  Chancellor Darling’s\ndesperate plea for Brussels\nto leave London’s financial sector alone has a distinct “please don’t hit me” tone to it and is certain to fall on stone-deaf Franco-German ears:\nIt is too simplistic to argue that financial centres in Europe are just competing among themselves. The reality is the real competition to Europe’s financial centres comes from outside our borders. And that London, whether others like it or not, is New York’s only rival as a truly global financial centre. No other centre in Europe offers the same range of services: banking, insurance, fund management, law and accountancy. It is in all of Europe’s interests that they prosper alongside their close European partners.\nOh, it is\ntoo simplistic\n?  Yes, surely that sophisticated argument will convince the unelected EU ruling class, who are openly drooling at the thought of taking their cut of great river of money flowing through the City, to leave London’s financial firms untouched.  Meanwhile, French President Nicolas Sarkozy lost no time in declaring what the end of British sovereignty yesterday would mean for the City:\n“Do you know what it means for me to see for the first time in 50 years a French European commissioner in charge of the internal market, including financial services, including the City [of London]?  I want the world to see the victory of the European model, which has nothing to do with the excesses of financial capitalism.”\nIn every revolution and betrayal, there is that intriguing moment when the now-useless revolutionary or traitor suddenly realizes that he’s been used and is about to be discarded.  I think there are more than a few staunchly Europhilic politicians and bankers who are astonished today at the realization that they are not to be included among the masters of Eutopia.",
  "tags": [
    "banks",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-02T09:54:00+00:00"
}