{
  "url": "https://voxday.net/2009/12/23/christmas-surprise/",
  "scraped_at": "2026-01-08T23:15:11.707154",
  "title": "A Christmas surprise!",
  "date_display": "December 23, 2009",
  "date_iso": "2009-12-23T09:48:00+00:00",
  "date_from_url": "2009-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, it’s about as surprising as seeing Santa at the mall.  I suppose you can imagine how shocked I am <a href=\"http://blogs.wsj.com/economics/2009/12/22/economists-react-gdp-revision-surprisingly-large/\">to be proven correct</a> – <a href=\"http://www.milobookclub.com/2009/11/24/am-i-that-good/\">again </a>–  about downward revisions to the Q309 GDP report that has been keeping the markets afloat for the time being:</p><blockquote><p><b>Economists React: GDP Revision “Surprisingly Large”</b><br> Economists react to the larger-than-expected downward revision to third quarter gross domestic product (GDP), to 2.2% annualized growth from 2.8% previously and 3.5% originally reported.</br></p></blockquote><p>This isn’t really a surprise, obviously, or I could not have predicted it.  And even though this is supposed to be the second and final revision to the third quarter GDP number, (at least until the next comprehensive National Income and Product Accounts revision in 2014), I fully expect that it will be revised downward again in a “surprise” unscheduled revision sometime in 2010.  Notice that despite being revised downward itself, the Cash for Clunkers debt-creation program now accounts for 66 percent of the remaining GDP “growth”, up from 47 percent in the initial report.</p><p>This is an error of $185 billion, which you will note is both a) larger than the $152 billion Bush stimulus package of 2008 and b) smaller than the average $245 billion variance in quarterly reports.  Of course, that latter average takes into account two additional revisions, so as subsequent unscheduled revisions are quietly made, we can expect the Q309 variance to increase.  If the first two revisions are a correct indication, it will surpass the average.</p><p><b>There is no growth.  There is only debt.</b></p><p>UPDATE: It’s always a little startling to come across references like this when you’re making your daily reading rounds: <i>I sure as heck get more data, which I can view an analyze myself, on individual websites like this one, Mish, Zero Hedge, Vox Popoli, and discussion boards, than I find in the mainstream media. I’ve come to the conclusion that many journalists are not even capable of analyzing the subjects they are meant to be covering. And if they are, they will not be allowed to present their analysis if it conflicts with the agenda of their overlords.</i></p><p>Speaking of that data, here’s a link to <a href=\"http://www.returnofthegreatdepression.com/2009/12/gdp-variance-q309-3rd-update/\">the 2007-2009 GDP Variance Chart</a> updated with the most recent revisions.</p></div>",
  "content_text": "Actually, it’s about as surprising as seeing Santa at the mall.  I suppose you can imagine how shocked I am\nto be proven correct\n–\nagain\n–  about downward revisions to the Q309 GDP report that has been keeping the markets afloat for the time being:\nEconomists React: GDP Revision “Surprisingly Large”\nEconomists react to the larger-than-expected downward revision to third quarter gross domestic product (GDP), to 2.2% annualized growth from 2.8% previously and 3.5% originally reported.\nThis isn’t really a surprise, obviously, or I could not have predicted it.  And even though this is supposed to be the second and final revision to the third quarter GDP number, (at least until the next comprehensive National Income and Product Accounts revision in 2014), I fully expect that it will be revised downward again in a “surprise” unscheduled revision sometime in 2010.  Notice that despite being revised downward itself, the Cash for Clunkers debt-creation program now accounts for 66 percent of the remaining GDP “growth”, up from 47 percent in the initial report.\nThis is an error of $185 billion, which you will note is both a) larger than the $152 billion Bush stimulus package of 2008 and b) smaller than the average $245 billion variance in quarterly reports.  Of course, that latter average takes into account two additional revisions, so as subsequent unscheduled revisions are quietly made, we can expect the Q309 variance to increase.  If the first two revisions are a correct indication, it will surpass the average.\nThere is no growth.  There is only debt.\nUPDATE: It’s always a little startling to come across references like this when you’re making your daily reading rounds:\nI sure as heck get more data, which I can view an analyze myself, on individual websites like this one, Mish, Zero Hedge, Vox Popoli, and discussion boards, than I find in the mainstream media. I’ve come to the conclusion that many journalists are not even capable of analyzing the subjects they are meant to be covering. And if they are, they will not be allowed to present their analysis if it conflicts with the agenda of their overlords.\nSpeaking of that data, here’s a link to\nthe 2007-2009 GDP Variance Chart\nupdated with the most recent revisions.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-23T09:48:00+00:00"
}