{
  "url": "https://voxday.net/2009/12/17/climategate-expands/",
  "scraped_at": "2026-01-08T23:14:45.927400",
  "title": "Climategate keeps growing",
  "date_display": "December 17, 2009",
  "date_iso": "2009-12-17T09:50:00+00:00",
  "date_from_url": "2009-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Skeptical economists and statisticians are simply <a href=\"http://blogs.telegraph.co.uk/news/jamesdelingpole/100020126/climategate-goes-serial-now-the-russians-confirm-that-uk-climate-scientists-manipulated-data-to-exaggerate-global-warming/\">killing the climate change charlatans</a>:</p><blockquote><p>Climategate just got much, much bigger. And all thanks to the Russians who, with perfect timing, dropped this bombshell just as the world’s leaders are gathering in Copenhagen to discuss ways of carbon-taxing us all back to the dark ages.</p><p><i>On Tuesday, the Moscow-based Institute of Economic Analysis (IEA) issued a report claiming that the Hadley Center for Climate Change based at the headquarters of the British Meteorological Office in Exeter (Devon, England) had probably tampered with Russian-climate data.</i></p><p>The IEA believes that Russian meteorological-station data did not substantiate the anthropogenic global-warming theory. Analysts say Russian meteorological stations cover most of the country’s territory, and that the Hadley Center had used data submitted by only 25% of such stations in its reports. Over 40% of Russian territory was not included in global-temperature calculations for some other reasons, rather than the lack of meteorological stations and observations.</p></blockquote><p>No wonder the climate “scientists” are so protective of their data.  The more people look at it, the more it becomes obvious that they’ve been cherry-picking the data in order to “prove” what they’ve already decided will be reported.   I don’t read Russian, but as far as I can tell, in order to calculate global land temperatures the CRU used only 121 of 476 Russian stations, 73 of which were among the 78 stations that had been moved, presumably because of proximity to heat-producing urban expansion.  This would explain why the purported increase in temperatures that could not be observed in the United States, Asia, or the rest of Europe was appearing in Siberia, which accounts for about 12.5 percent of the global land mass.  The upshot is that this would eliminate 31.1 percent of the reported global warming.  So there is not only no statistically significant global warming <a href=\"http://planetgore.nationalreview.com/post/?q=NzY4YzVmNWEyMjY1MmZjNDlhMzc5MWFlODc4N2JmM2M=\">from the long-term perspective</a>.  There has been a lot less of it in the short term than was previously claimed.</p><p>As for the reported consensus, it is now obvious that scientific consensus should be given no more credence than real estate consensus, economic consensus, or stockbroker consensus.  Intriguingly, it is now clear that the climate scammers have at least known that the Russian data possibly incomplete for <i>five years</i>.  Phil Jones, the suspended director of the CRU, incriminated himself in an email to to Michael Mann of “hockey stick” fame  in March 2004:</p><p><i>“Recently rejected two papers (one for JGR and for GRL) from people saying CRU has it wrong over Siberia. Went to town in both reviews, hopefully successfully. If either appears I will be very surprised, but you never know with GRL.”</i></p><p>Ah yes, and here we also see the way in which <i>peer review</i> is so conducive to good science.</p></div>",
  "content_text": "Skeptical economists and statisticians are simply\nkilling the climate change charlatans\n:\nClimategate just got much, much bigger. And all thanks to the Russians who, with perfect timing, dropped this bombshell just as the world’s leaders are gathering in Copenhagen to discuss ways of carbon-taxing us all back to the dark ages.\nOn Tuesday, the Moscow-based Institute of Economic Analysis (IEA) issued a report claiming that the Hadley Center for Climate Change based at the headquarters of the British Meteorological Office in Exeter (Devon, England) had probably tampered with Russian-climate data.\nThe IEA believes that Russian meteorological-station data did not substantiate the anthropogenic global-warming theory. Analysts say Russian meteorological stations cover most of the country’s territory, and that the Hadley Center had used data submitted by only 25% of such stations in its reports. Over 40% of Russian territory was not included in global-temperature calculations for some other reasons, rather than the lack of meteorological stations and observations.\nNo wonder the climate “scientists” are so protective of their data.  The more people look at it, the more it becomes obvious that they’ve been cherry-picking the data in order to “prove” what they’ve already decided will be reported.   I don’t read Russian, but as far as I can tell, in order to calculate global land temperatures the CRU used only 121 of 476 Russian stations, 73 of which were among the 78 stations that had been moved, presumably because of proximity to heat-producing urban expansion.  This would explain why the purported increase in temperatures that could not be observed in the United States, Asia, or the rest of Europe was appearing in Siberia, which accounts for about 12.5 percent of the global land mass.  The upshot is that this would eliminate 31.1 percent of the reported global warming.  So there is not only no statistically significant global warming\nfrom the long-term perspective\n.  There has been a lot less of it in the short term than was previously claimed.\nAs for the reported consensus, it is now obvious that scientific consensus should be given no more credence than real estate consensus, economic consensus, or stockbroker consensus.  Intriguingly, it is now clear that the climate scammers have at least known that the Russian data possibly incomplete for\nfive years\n.  Phil Jones, the suspended director of the CRU, incriminated himself in an email to to Michael Mann of “hockey stick” fame  in March 2004:\n“Recently rejected two papers (one for JGR and for GRL) from people saying CRU has it wrong over Siberia. Went to town in both reviews, hopefully successfully. If either appears I will be very surprised, but you never know with GRL.”\nAh yes, and here we also see the way in which\npeer review\nis so conducive to good science.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-17T09:50:00+00:00"
}