{
  "url": "https://voxday.net/2009/12/02/climategate-grows/",
  "scraped_at": "2026-01-08T23:13:42.839529",
  "title": "Climategate grows",
  "date_display": "December 2, 2009",
  "date_iso": "2009-12-02T17:27:00+00:00",
  "date_from_url": "2009-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that Jon Stewart has weighed in, all hopes for a media stonewall on Climategate have disappeared. <a href=\"http://www.thedailyshow.com/watch/tue-december-1-2009/scientists-hide-global-warming-data\">Scientists Hide Global Warming Data</a>.  I won’t be surprised if we see some so-called scientists going to jail over this; they have certainly stolen enough taxpayer money under false pretenses to justify long sentences.</p><p>Also, Copenhagen should be all the more interesting now that it has been reported that <a href=\"http://talk.baltimoresun.com/showthread.php?t=227469\">Denmark is the center of a carbon-trading tax scam</a>. <i>Denmark is the centre of a comprehensive tax scam involving CO2 quotas, in which the cheats exploit a so-called ‘VAT carrousel’, reports Ekstra Bladet newspaper.  Police and authorities in several European countries are investigating scams worth billions of kroner, which all originate in the Danish quota register. The CO2 quotas are traded in other EU countries. And the fraud may be of massive proportions.</i></p><p>That shouldn’t be a big surprise considering that it was apparently my old friends at Enron who originally came up with the idea of cap-and-trade.  Of course, this scam is still several orders of magnitude smaller than the scam that is the AGW/CC/GG industry.  The fact that <a href=\"http://www.abc.net.au/news/stories/2009/12/02/2759595.htm?section=business\">Australia voted down a proposed carbon trading scheme</a> is the first indication that the charlatans are on the defensive.</p></div>",
  "content_text": "Now that Jon Stewart has weighed in, all hopes for a media stonewall on Climategate have disappeared.\nScientists Hide Global Warming Data\n.  I won’t be surprised if we see some so-called scientists going to jail over this; they have certainly stolen enough taxpayer money under false pretenses to justify long sentences.\nAlso, Copenhagen should be all the more interesting now that it has been reported that\nDenmark is the center of a carbon-trading tax scam\n.\nDenmark is the centre of a comprehensive tax scam involving CO2 quotas, in which the cheats exploit a so-called ‘VAT carrousel’, reports Ekstra Bladet newspaper.  Police and authorities in several European countries are investigating scams worth billions of kroner, which all originate in the Danish quota register. The CO2 quotas are traded in other EU countries. And the fraud may be of massive proportions.\nThat shouldn’t be a big surprise considering that it was apparently my old friends at Enron who originally came up with the idea of cap-and-trade.  Of course, this scam is still several orders of magnitude smaller than the scam that is the AGW/CC/GG industry.  The fact that\nAustralia voted down a proposed carbon trading scheme\nis the first indication that the charlatans are on the defensive.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-02T17:27:00+00:00"
}