{
  "url": "https://voxday.net/2009/12/17/correcting-krugman/",
  "scraped_at": "2026-01-08T23:14:47.788787",
  "title": "Correcting Krugman",
  "date_display": "December 17, 2009",
  "date_iso": "2009-12-17T16:15:00+00:00",
  "date_from_url": "2009-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I completely understand if some people think I’m attacking strawmen rather than <a href=\"http://krugman.blogs.nytimes.com/2009/12/16/would-cutting-the-minimum-wage-raise-employment/\">Krugman’s actual arguments</a>.  Except I’d create more convincing strawmen:</p><blockquote><p>It seems that more and more Serious People (and Fox News) are rallying around the idea that if Obama really wants to create jobs, he should cut the minimum wage.</p><p>So let me repeat a point I made a number of times back when the usual suspects were declaring that FDR prolonged the Depression by raising wages: the belief that lower wages would raise overall employment rests on a fallacy of composition. In reality, reducing wages would at best do nothing for employment; more likely it would actually be contractionary.</p><p>Here’s how the fallacy works: if some subset of the work force accepts lower wages, it can gain jobs. If workers in the widget industry take a pay cut, this will lead to lower prices of widgets relative to other things, so people will buy more widgets, hence more employment.</p><p>But if everyone takes a pay cut, that logic no longer applies. The only way a general cut in wages can increase employment is if it leads people to buy more across the board. And why should it do that?</p></blockquote><p>First, a reduction in the minimum wage doesn’t mean that EVERYONE’S PAY is going to get cut.  There aren’t a lot of surgeons and computer programmers who are suddenly going to face competition from those whose labor is worth less than 7.25 per hour.  Second, there are two ways that a general cut in wages could lead people to buy more in the aggregate.  If labor costs are reduced, then the price of consumer goods are reduced.  The Law of Supply and Demand states that there will be more demand for those lower-priced consumer goods… as well as more demand for the lower-priced labor.  Also, it is an established fact that higher-income people save a greater portion of their income and spend less of it than lower-income people.  Therefore, creating a larger pool of people making less money on average is going to cause people to buy more across the board.</p><p>Please note that I do not agree with the Keynesian aggregate perspective nor do I believe it is the responsibility of government to micromanage the economy, I am merely showing that Krugman is incorrect even from his chosen perspective.</p><p>Now, Krugman attempts to evade the obvious criticism <a href=\"http://krugman.blogs.nytimes.com/2009/12/16/minimum-wages-a-few-clarifications/#comments\">in his subsequent post</a> by stating: “the whole point is that reducing all money wages doesn’t necessarily reduce real wages. And for what it’s worth, the little AS-AD analysis I linked to is Econ 101, at least if you use a good textbook.”</p><p>This argument against reducing the minimum wage boils down to the possibility that cutting the minimum wage will cause interest rates to rise.  That is simply not credible in the current monetary policy environment, as the 20-year example of Japan should suffice to demonstrate.  Krugman rests his case on asking us to “<a href=\"http://www.princeton.edu/%7Epkrugman/nominal_wage.pdf\">suppose that the AD curve is vertical</a>“, but a request for a supposition is a very long way from demonstrating that the AD curve actually is vertical.  And even if Krugman’s simplified model had been correct, once one considers the fact that the U.S. Treasury auctioned 3-month bills at 0.005 percent in December 2008, it becomes obvious that America was not liquidity trapped at 0.14 percent in the mid-1930s as Krugman imagines, but actually had room for expansion by an order of magnitude… 28x to be precise.</p></div>",
  "content_text": "I completely understand if some people think I’m attacking strawmen rather than\nKrugman’s actual arguments\n.  Except I’d create more convincing strawmen:\nIt seems that more and more Serious People (and Fox News) are rallying around the idea that if Obama really wants to create jobs, he should cut the minimum wage.\nSo let me repeat a point I made a number of times back when the usual suspects were declaring that FDR prolonged the Depression by raising wages: the belief that lower wages would raise overall employment rests on a fallacy of composition. In reality, reducing wages would at best do nothing for employment; more likely it would actually be contractionary.\nHere’s how the fallacy works: if some subset of the work force accepts lower wages, it can gain jobs. If workers in the widget industry take a pay cut, this will lead to lower prices of widgets relative to other things, so people will buy more widgets, hence more employment.\nBut if everyone takes a pay cut, that logic no longer applies. The only way a general cut in wages can increase employment is if it leads people to buy more across the board. And why should it do that?\nFirst, a reduction in the minimum wage doesn’t mean that EVERYONE’S PAY is going to get cut.  There aren’t a lot of surgeons and computer programmers who are suddenly going to face competition from those whose labor is worth less than 7.25 per hour.  Second, there are two ways that a general cut in wages could lead people to buy more in the aggregate.  If labor costs are reduced, then the price of consumer goods are reduced.  The Law of Supply and Demand states that there will be more demand for those lower-priced consumer goods… as well as more demand for the lower-priced labor.  Also, it is an established fact that higher-income people save a greater portion of their income and spend less of it than lower-income people.  Therefore, creating a larger pool of people making less money on average is going to cause people to buy more across the board.\nPlease note that I do not agree with the Keynesian aggregate perspective nor do I believe it is the responsibility of government to micromanage the economy, I am merely showing that Krugman is incorrect even from his chosen perspective.\nNow, Krugman attempts to evade the obvious criticism\nin his subsequent post\nby stating: “the whole point is that reducing all money wages doesn’t necessarily reduce real wages. And for what it’s worth, the little AS-AD analysis I linked to is Econ 101, at least if you use a good textbook.”\nThis argument against reducing the minimum wage boils down to the possibility that cutting the minimum wage will cause interest rates to rise.  That is simply not credible in the current monetary policy environment, as the 20-year example of Japan should suffice to demonstrate.  Krugman rests his case on asking us to “\nsuppose that the AD curve is vertical\n“, but a request for a supposition is a very long way from demonstrating that the AD curve actually is vertical.  And even if Krugman’s simplified model had been correct, once one considers the fact that the U.S. Treasury auctioned 3-month bills at 0.005 percent in December 2008, it becomes obvious that America was not liquidity trapped at 0.14 percent in the mid-1930s as Krugman imagines, but actually had room for expansion by an order of magnitude… 28x to be precise.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-17T16:15:00+00:00"
}