{
  "url": "https://voxday.net/2009/12/30/dinosaur-science/",
  "scraped_at": "2026-01-08T23:15:42.813612",
  "title": "Dinosaur science",
  "date_display": "December 30, 2009",
  "date_iso": "2009-12-30T09:37:00+00:00",
  "date_from_url": "2009-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC suggests a new theory that explains <a href=\"http://www.theregister.co.uk/2009/12/22/titan_glint_krakens/\">the disappearance of the dinosaurs</a>.  “I wonder how all those dinosaurs managed to get to Titan in order to die and leave those vast oceans of volatile liquid hydrocarbons?”  But the answer is so obvious.  Rockets.  It’s dinosaur science and the global consensus of astrosaurinauticists is totally settled.</p><blockquote><p>The bracing -180°C temperatures prevalent on Titan mean that water ice acts more the way rock does here on Earth, and the liquids filling the seas and lakes are hydrocarbons which would be gaseous here – methane, ethane and such – though of course we humans like to liquefy and store them under pressure to run our barbecues, patio heaters etc. Just as water does here, however, the patio-gas seas evaporate when conditions are favourable to form clouds and fog, which subsequently rain down as LPG elsewhere. Earth and Titan are thus the only bodies in the solar system with surface geology moulded by movements of liquid.</p></blockquote><p>And clearly, Earth and Titan are the only bodies in the solar system to have been colonized by spacefaring dinosaurs; the Sea of Krakens must have been their sacred burial ground.  But this discovery of dinosaur space travel is even more significant than the OC imagines, since it could have incredible ramifications for biology as well… my hypothesis is that Man was not only bred, but <i>uplifted</i> by these spacefaring dinosaurs as well, hence the sudden increase in cranial size that paleontologists find so puzzling.  Because artificial selection is known to be so much faster than natural selection, the Dinosaur Science hypothesis offers the perfect solution for Young Earth Creationists, Evolutionists, UFOlogists and Pan-Spermians alike.  As for the Chicxulub and Barringer sites, it is now apparent that those were the dinosaur equivalents of Cape Canaveral and Volograd.</p><p>And now we have finally have the answer to the nature of God.  Saurian.</p><p>Now I’m just wondering if the Nobel Committee is going to have to hold off another year on awarding me the Physics prize for the discovery of Dark Vapor, since obviously establishing such a ground-breaking scientific theory of this multidisciplinary significance will have to take precedence.</p></div>",
  "content_text": "The OC suggests a new theory that explains\nthe disappearance of the dinosaurs\n.  “I wonder how all those dinosaurs managed to get to Titan in order to die and leave those vast oceans of volatile liquid hydrocarbons?”  But the answer is so obvious.  Rockets.  It’s dinosaur science and the global consensus of astrosaurinauticists is totally settled.\nThe bracing -180°C temperatures prevalent on Titan mean that water ice acts more the way rock does here on Earth, and the liquids filling the seas and lakes are hydrocarbons which would be gaseous here – methane, ethane and such – though of course we humans like to liquefy and store them under pressure to run our barbecues, patio heaters etc. Just as water does here, however, the patio-gas seas evaporate when conditions are favourable to form clouds and fog, which subsequently rain down as LPG elsewhere. Earth and Titan are thus the only bodies in the solar system with surface geology moulded by movements of liquid.\nAnd clearly, Earth and Titan are the only bodies in the solar system to have been colonized by spacefaring dinosaurs; the Sea of Krakens must have been their sacred burial ground.  But this discovery of dinosaur space travel is even more significant than the OC imagines, since it could have incredible ramifications for biology as well… my hypothesis is that Man was not only bred, but\nuplifted\nby these spacefaring dinosaurs as well, hence the sudden increase in cranial size that paleontologists find so puzzling.  Because artificial selection is known to be so much faster than natural selection, the Dinosaur Science hypothesis offers the perfect solution for Young Earth Creationists, Evolutionists, UFOlogists and Pan-Spermians alike.  As for the Chicxulub and Barringer sites, it is now apparent that those were the dinosaur equivalents of Cape Canaveral and Volograd.\nAnd now we have finally have the answer to the nature of God.  Saurian.\nNow I’m just wondering if the Nobel Committee is going to have to hold off another year on awarding me the Physics prize for the discovery of Dark Vapor, since obviously establishing such a ground-breaking scientific theory of this multidisciplinary significance will have to take precedence.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-30T09:37:00+00:00"
}