{
  "url": "https://voxday.net/2009/12/10/doubts-moun/",
  "scraped_at": "2026-01-08T23:14:14.103491",
  "title": "The doubts mount",
  "date_display": "December 10, 2009",
  "date_iso": "2009-12-10T10:38:00+00:00",
  "date_from_url": "2009-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even the warm-mongering faithful <a href=\"http://meganmcardle.theatlantic.com/archives/2009/12/climategate_was_data_faked.php\">are beginning to experience doubts</a>:</p><blockquote><p>I can imagine a sort of selection bias in the grant process.  I cannot imagine hundreds of scientists thinking, well, I put ten years into getting my PhD–time to spend the rest of my life faking data in order to get some grant money!  One, yes.  All of them, no….</p><p>To me, the worry is the subtler kind of bias that we indisputably know has led to scientific errors in the past.That is the actual worrying question about CRU, and GISS, and the other scientists working on paleoclimate reconstruction:  that they may all be calibrating their findings to each other.  That when you get a number that looks like CRU, you don’t look so hard to figure out whether it’s incorrect as you do when you get a number that doesn’t look like CRU–and maybe you adjust the numbers you have to look more like the other “known” datasets.  There is always a way to find what you’re expecting to find if you look hard enough.</p></blockquote><p>While I lack the sort of naive faith in human nature possessed by this so-called libertarian who voted for Obama because she believed his hype, I do think that in the majority of cases outside the CRU and company’s little circle of fraud, the bad science is most likely the result of the Millekanian process she cites Richard Feynman explaining combined with an insufficient understanding of physics, chemistry, and statistics on the part of climate scientists.</p><p>As an economics writer, I witness the complete ineptitude of scientists opining outside their field on a regular basis; indeed, I recently published a book that chronicles the astonishing amount of ineptitude of scientists opining <i>inside</i> their field.  Given that so many scientists still refuse to accept the law of supply and demand, which has been around for more than 230 years, or the economic calculation problem, which dates back to 1920, it should come as no surprise that it will take more than 10 years of colder temperatures to convince them that they are incorrect about anthropogenic global warming/climate change.</p><p>The amusing thing is that the dear little muddle-headed white coats still think that <a href=\" http://www.timesonline.co.uk/tol/news/environment/article6951029.ece\">appealing to their own authority</a> is going to convince anyone of anything any more.  They have clearly failed to understand that their corruption and fraud has cost them the larger part of their credibility in the eyes of the public.  If the scientific community wants to begin working to regain the public’s respect, then it needs to return to a) using the scientific method, b) showing their work, and c) making all of the relevant information, especially the raw data, available to the public.</p><p>As it stands, the arm-twisting and politics behind the signed statement only makes the division between professional scientist and actual science appear even greater.</p><blockquote><p>The Met Office has embarked on an urgent exercise to bolster the reputation of climate-change science after the furore over stolen e-mails.  More than 1,700 scientists have agreed to sign a statement defending the “professional integrity” of global warming research. They were responding to a round-robin request from the Met Office, which has spent four days collecting signatures. The initiative is a sign of how worried it is that e-mails stolen from the University of East Anglia are fuelling scepticism about man-made global warming at a critical moment in talks on carbon emissions.</p><p>One scientist said that he felt under pressure to sign the circular or risk losing work. The Met Office admitted that many of the signatories did not work on climate change.</p></blockquote><p>Who does public relations for these blithering blunderers?  And why do they think that the opinion of government-funded scientists who are obviously not in any position to discern the integrity or lack of integrity of other government-funded scientists is of any significance to anyone anyhow?</p></div>",
  "content_text": "Even the warm-mongering faithful\nare beginning to experience doubts\n:\nI can imagine a sort of selection bias in the grant process.  I cannot imagine hundreds of scientists thinking, well, I put ten years into getting my PhD–time to spend the rest of my life faking data in order to get some grant money!  One, yes.  All of them, no….\nTo me, the worry is the subtler kind of bias that we indisputably know has led to scientific errors in the past.That is the actual worrying question about CRU, and GISS, and the other scientists working on paleoclimate reconstruction:  that they may all be calibrating their findings to each other.  That when you get a number that looks like CRU, you don’t look so hard to figure out whether it’s incorrect as you do when you get a number that doesn’t look like CRU–and maybe you adjust the numbers you have to look more like the other “known” datasets.  There is always a way to find what you’re expecting to find if you look hard enough.\nWhile I lack the sort of naive faith in human nature possessed by this so-called libertarian who voted for Obama because she believed his hype, I do think that in the majority of cases outside the CRU and company’s little circle of fraud, the bad science is most likely the result of the Millekanian process she cites Richard Feynman explaining combined with an insufficient understanding of physics, chemistry, and statistics on the part of climate scientists.\nAs an economics writer, I witness the complete ineptitude of scientists opining outside their field on a regular basis; indeed, I recently published a book that chronicles the astonishing amount of ineptitude of scientists opining\ninside\ntheir field.  Given that so many scientists still refuse to accept the law of supply and demand, which has been around for more than 230 years, or the economic calculation problem, which dates back to 1920, it should come as no surprise that it will take more than 10 years of colder temperatures to convince them that they are incorrect about anthropogenic global warming/climate change.\nThe amusing thing is that the dear little muddle-headed white coats still think that\nappealing to their own authority\nis going to convince anyone of anything any more.  They have clearly failed to understand that their corruption and fraud has cost them the larger part of their credibility in the eyes of the public.  If the scientific community wants to begin working to regain the public’s respect, then it needs to return to a) using the scientific method, b) showing their work, and c) making all of the relevant information, especially the raw data, available to the public.\nAs it stands, the arm-twisting and politics behind the signed statement only makes the division between professional scientist and actual science appear even greater.\nThe Met Office has embarked on an urgent exercise to bolster the reputation of climate-change science after the furore over stolen e-mails.  More than 1,700 scientists have agreed to sign a statement defending the “professional integrity” of global warming research. They were responding to a round-robin request from the Met Office, which has spent four days collecting signatures. The initiative is a sign of how worried it is that e-mails stolen from the University of East Anglia are fuelling scepticism about man-made global warming at a critical moment in talks on carbon emissions.\nOne scientist said that he felt under pressure to sign the circular or risk losing work. The Met Office admitted that many of the signatories did not work on climate change.\nWho does public relations for these blithering blunderers?  And why do they think that the opinion of government-funded scientists who are obviously not in any position to discern the integrity or lack of integrity of other government-funded scientists is of any significance to anyone anyhow?",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-10T10:38:00+00:00"
}