{
  "url": "https://voxday.net/2009/12/01/dubai-to-default-on-dubai-world/",
  "scraped_at": "2026-01-08T23:13:33.055461",
  "title": "Dubai cuts loose Dubai World",
  "date_display": "December 1, 2009",
  "date_iso": "2009-12-01T09:03:00+00:00",
  "date_from_url": "2009-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since Dubai has announced <a href=\"http://business.timesonline.co.uk/tol/business/industry_sectors/banking_and_finance/article6938208.ece\">it is going to blow off the Dubai World debt</a>, it would seem rather obvious that Abu Dhabi isn’t about to volunteer to pay it either.</p><blockquote><p>Dubai revealed last week that it would seek a standstill on debt repayments for Dubai World, a sprawling company that includes property developers, investment funds and a ports operation. Dubai had previously included Dubai World’s debts within its own total sovereign debt of $80 billion but it has said it has no obligation to the company’s lenders….</p><p>Abdulrahman al-Saleh, director-general of Dubai’s Department of Finance, said: “Creditors need to take part of the responsibility for their decision to lend to the companies. They think Dubai World is part of the Government, which is not true.”</p><p>That has sparked anger among some creditors, who believe that Dubai had given an implicit guarantee that its companies were state-backed.</p></blockquote><p>But… but creditors are never supposed to take responsibility for <i>anything</i>!  Don’t those backward sheikhs understand how a modern financial system works?  It’s heads the banks win, tails the taxpayers lose!  I imagine there are many people facing foreclosure that can recall promises and implicit guarantees they were made by their real estate agents and mortgage bankers too.  Isn’t it interesting how banks always insist that it’s only the fine print on the contract that matters, right up until that fine print doesn’t serve their interests anymore.  Dubai’s actions are particularly interesting in light of how the Federal Reserve and the U.S. Treasury have repeatedly covered the non-guaranteed debt of Fannie Mae and Freddie Mac at the expense of the U.S. taxpayer.</p></div>",
  "content_text": "Since Dubai has announced\nit is going to blow off the Dubai World debt\n, it would seem rather obvious that Abu Dhabi isn’t about to volunteer to pay it either.\nDubai revealed last week that it would seek a standstill on debt repayments for Dubai World, a sprawling company that includes property developers, investment funds and a ports operation. Dubai had previously included Dubai World’s debts within its own total sovereign debt of $80 billion but it has said it has no obligation to the company’s lenders….\nAbdulrahman al-Saleh, director-general of Dubai’s Department of Finance, said: “Creditors need to take part of the responsibility for their decision to lend to the companies. They think Dubai World is part of the Government, which is not true.”\nThat has sparked anger among some creditors, who believe that Dubai had given an implicit guarantee that its companies were state-backed.\nBut… but creditors are never supposed to take responsibility for\nanything\n!  Don’t those backward sheikhs understand how a modern financial system works?  It’s heads the banks win, tails the taxpayers lose!  I imagine there are many people facing foreclosure that can recall promises and implicit guarantees they were made by their real estate agents and mortgage bankers too.  Isn’t it interesting how banks always insist that it’s only the fine print on the contract that matters, right up until that fine print doesn’t serve their interests anymore.  Dubai’s actions are particularly interesting in light of how the Federal Reserve and the U.S. Treasury have repeatedly covered the non-guaranteed debt of Fannie Mae and Freddie Mac at the expense of the U.S. taxpayer.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-01T09:03:00+00:00"
}