{
  "url": "https://voxday.net/2009/12/21/explaining-debt-deflation/",
  "scraped_at": "2026-01-08T23:15:04.304129",
  "title": "Explaining debt-deflation",
  "date_display": "December 21, 2009",
  "date_iso": "2009-12-21T15:49:00+00:00",
  "date_from_url": "2009-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.321gold.com/editorials/saville/saville110309.html\">This article</a> should help explain why “printing” money is not <i>necessarily</i> inflationary in a monetary system where most of the money is created through fractional-reserve lending:</p><blockquote><p>The following chart shows that bank reserves held at the Fed have increased 100-fold over the past 14 months — from around $10B in August of 2008 to around $1000B ($1T) today. It is important to understand that while this explosion in the reserves of US depository institutions has rightfully prompted much discussion and consternation, it hasn’t directly added to the total supply of US dollars (bank reserves are not counted in monetary aggregates such as M1, M2, M3, MZM and TMS). The reason that bank reserves aren’t added to the money supply is that they do not constitute money available to be spent within the economy; rather, they constitute money that could be loaned into the economy or used to support additional bank lending in the future.</p></blockquote><p>If even bank reserves can’t be counted as money, it should be obvious that mere Federal Reserve printed notes can’t be counted either.  The money has to go into the system before it can be spent; this is why increased bank reserves are considered to be deflationary.  This does not mean, however, that the Fed can simply force the banks to force lending, as some have suggested.  Mike Shedlock <a href=\"http://globaleconomicanalysis.blogspot.com/2009/12/fictional-reserve-lending-and-myth-of.html\">explains why</a>:</p><p><i>1) Lending comes first and what little reserves there are (if any) come later.<br> 2) There really are no excess reserves.<br> 3) Not only are there no excess reserves, there are essentially no reserves to speak of at all. Indeed, bank reserves are completely “fictional”.<br> 4) Banks are capital constrained not reserve constrained.<br> 5) Banks aren’t lending because there are few credit worthy borrowers worth the risk.</br></br></br></br></i></p></div>",
  "content_text": "This article\nshould help explain why “printing” money is not\nnecessarily\ninflationary in a monetary system where most of the money is created through fractional-reserve lending:\nThe following chart shows that bank reserves held at the Fed have increased 100-fold over the past 14 months — from around $10B in August of 2008 to around $1000B ($1T) today. It is important to understand that while this explosion in the reserves of US depository institutions has rightfully prompted much discussion and consternation, it hasn’t directly added to the total supply of US dollars (bank reserves are not counted in monetary aggregates such as M1, M2, M3, MZM and TMS). The reason that bank reserves aren’t added to the money supply is that they do not constitute money available to be spent within the economy; rather, they constitute money that could be loaned into the economy or used to support additional bank lending in the future.\nIf even bank reserves can’t be counted as money, it should be obvious that mere Federal Reserve printed notes can’t be counted either.  The money has to go into the system before it can be spent; this is why increased bank reserves are considered to be deflationary.  This does not mean, however, that the Fed can simply force the banks to force lending, as some have suggested.  Mike Shedlock\nexplains why\n:\n1) Lending comes first and what little reserves there are (if any) come later.\n2) There really are no excess reserves.\n3) Not only are there no excess reserves, there are essentially no reserves to speak of at all. Indeed, bank reserves are completely “fictional”.\n4) Banks are capital constrained not reserve constrained.\n5) Banks aren’t lending because there are few credit worthy borrowers worth the risk.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-21T15:49:00+00:00"
}