{
  "url": "https://voxday.net/2009/12/28/for-record-4/",
  "scraped_at": "2026-01-08T23:15:33.663270",
  "title": "For the record",
  "date_display": "December 28, 2009",
  "date_iso": "2009-12-28T15:15:00+00:00",
  "date_from_url": "2009-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>“There is no eternal standard of right and wrong.”</b><br> – PZ Myers</br></p><p>I thought that was a quotation worth noting.  Read <a href=\"http://scienceblogs.com/pharyngula/2009/12/im_so_sorry_for_you_indiana.php\">the whole thing</a> so you can appreciate the context; it is an object lesson in why biologists teaching community college students would do well to avoid attempting both logic and philosophy.  Of course, the Fowl Atheist’s stated belief in the absence of any eternal standard of right and wrong and his implied belief in the absence of any <i>objective</i> standard of right and wrong doesn’t prevent him from constantly labeling various actions and individuals as being either right or wrong.  I don’t think PZ is demonstrating hypocrisy here, however, so much as simple incoherence.  One has to be aware of one’s inconsistency before one attempt to maintain a pretense, after all.</p><p>It is both hilarious and deeply ironic that someone whose ability to reason correctly is so demonstrably nonexistent should nevertheless see fit to declare: “We should build our morality on reason.”  The thought is neither original nor tenable.</p></div>",
  "content_text": "“There is no eternal standard of right and wrong.”\n– PZ Myers\nI thought that was a quotation worth noting.  Read\nthe whole thing\nso you can appreciate the context; it is an object lesson in why biologists teaching community college students would do well to avoid attempting both logic and philosophy.  Of course, the Fowl Atheist’s stated belief in the absence of any eternal standard of right and wrong and his implied belief in the absence of any\nobjective\nstandard of right and wrong doesn’t prevent him from constantly labeling various actions and individuals as being either right or wrong.  I don’t think PZ is demonstrating hypocrisy here, however, so much as simple incoherence.  One has to be aware of one’s inconsistency before one attempt to maintain a pretense, after all.\nIt is both hilarious and deeply ironic that someone whose ability to reason correctly is so demonstrably nonexistent should nevertheless see fit to declare: “We should build our morality on reason.”  The thought is neither original nor tenable.",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-28T15:15:00+00:00"
}