{
  "url": "https://voxday.net/2009/12/04/give-man-his-flag/",
  "scraped_at": "2026-01-08T23:13:48.390494",
  "title": "Give the man his flag",
  "date_display": "December 4, 2009",
  "date_iso": "2009-12-04T11:54:00+00:00",
  "date_from_url": "2009-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I like John Scalzi, I simply don’t happen to agree with him very often.  But give him his due.  Every now and then, he simply <a href=\"http://whatever.scalzi.com/2009/12/02/a-high-water-mark-in-the-annals-of-clueless-homeowners-associations/\">knocks one out of the park</a>:</p><blockquote><p>Dear homeowners association: When a Medal of Honor recipient wants to have a flagpole in his front yard, you say “Yes, sir. By all means. Thank you, sir.” Because you know what? Dude’s earned that damn flagpole, and you all look like officious pricks for telling him he can’t have it because it messes with your neighborhood’s feng shui.</p></blockquote><p>I think Heinlein may have taken things a bit far with suggesting that only veterans should vote, although it increasingly appears that his idea would almost certainly work better than the current concept of the universal 18+ franchise sans felons.  But Scalzi is right.  A Medal of Honor winner’s opinion about the suitability of a flag display absolutely trumps those of the persnickety sort of individuals who invariably fill the ranks of the homeowners associations of America.</p><p>Forget his flagpole.  If a 90 year-old Medal of Honor winner tells <i>you</i> to put up a flag on your own house, the correct response is: “Yes sir, right away sir.”  Combat service doesn’t make a man right, but it means he merits proper respect even when he’s wrong.</p></div>",
  "content_text": "I like John Scalzi, I simply don’t happen to agree with him very often.  But give him his due.  Every now and then, he simply\nknocks one out of the park\n:\nDear homeowners association: When a Medal of Honor recipient wants to have a flagpole in his front yard, you say “Yes, sir. By all means. Thank you, sir.” Because you know what? Dude’s earned that damn flagpole, and you all look like officious pricks for telling him he can’t have it because it messes with your neighborhood’s feng shui.\nI think Heinlein may have taken things a bit far with suggesting that only veterans should vote, although it increasingly appears that his idea would almost certainly work better than the current concept of the universal 18+ franchise sans felons.  But Scalzi is right.  A Medal of Honor winner’s opinion about the suitability of a flag display absolutely trumps those of the persnickety sort of individuals who invariably fill the ranks of the homeowners associations of America.\nForget his flagpole.  If a 90 year-old Medal of Honor winner tells\nyou\nto put up a flag on your own house, the correct response is: “Yes sir, right away sir.”  Combat service doesn’t make a man right, but it means he merits proper respect even when he’s wrong.",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-04T11:54:00+00:00"
}