{
  "url": "https://voxday.net/2009/12/15/hoover-lives/",
  "scraped_at": "2026-01-08T23:14:38.126873",
  "title": "Hoover lives!",
  "date_display": "December 15, 2009",
  "date_iso": "2009-12-15T19:04:00+00:00",
  "date_from_url": "2009-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“The banks also received their share of Hoover’s ire for their unwillingness to expand in those troubled times. The New York Times reported on May 20 that Hoover was “disturbed at the apparent lack of cooperation of the commercial banks of the country in the credit expansion drive.” In short, the “banks have not passed the benefits of these relief measures on to their customers.” The anger of the inflationist authorities at the caution of the banks was typified by the arrogant statement of RFC chairman, Atlee Pomerene: “Now . . . and I measure my words, the bank that is 75 percent liquid or more and refuses to make loans when proper security is offered, under present circumstances, is a parasite on the community.”<br> – Murray Rothbard, <a href=\"http://mises.org/rothbard/AGD/chapter11.asp\">America’s Great Depression, Chapter 11</a></br></p><p>“My main message in today’s meeting was very simple: that America’s banks received extraordinary assistance from American taxpayers to rebuild their industry and now that they’re back on their feet, we expect an extraordinary commitment from them to help rebuild our economy.”<br> – Barack Obama, 2009</br></p><p>Plus ca change…. Credit <a href=\"http://blog.mises.org/archives/011252.asp\">Doug French of the Mises Institute</a> for noticing this play from a 1930s playbook.</p></div>",
  "content_text": "“The banks also received their share of Hoover’s ire for their unwillingness to expand in those troubled times. The New York Times reported on May 20 that Hoover was “disturbed at the apparent lack of cooperation of the commercial banks of the country in the credit expansion drive.” In short, the “banks have not passed the benefits of these relief measures on to their customers.” The anger of the inflationist authorities at the caution of the banks was typified by the arrogant statement of RFC chairman, Atlee Pomerene: “Now . . . and I measure my words, the bank that is 75 percent liquid or more and refuses to make loans when proper security is offered, under present circumstances, is a parasite on the community.”\n– Murray Rothbard,\nAmerica’s Great Depression, Chapter 11\n“My main message in today’s meeting was very simple: that America’s banks received extraordinary assistance from American taxpayers to rebuild their industry and now that they’re back on their feet, we expect an extraordinary commitment from them to help rebuild our economy.”\n– Barack Obama, 2009\nPlus ca change…. Credit\nDoug French of the Mises Institute\nfor noticing this play from a 1930s playbook.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-15T19:04:00+00:00"
}