{
  "url": "https://voxday.net/2009/12/05/i-cant-wai/",
  "scraped_at": "2026-01-08T23:13:50.324937",
  "title": "I can’t wait",
  "date_display": "December 5, 2009",
  "date_iso": "2009-12-05T01:11:00+00:00",
  "date_from_url": "2009-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To see what the Sports Guy has to say about this column arguing for <a href=\"http://sportsillustrated.cnn.com/2009/writers/ian_thomsen/12/04/countdown/index.html?eref=sircrc\">women playing in the NBA </a>one day:</p><blockquote><p>5 reasons to believe a woman will play in the NBA</p><p>• David Stern thinks it will happen. On Tuesday in the conference room outside his NBA office in Manhattan, I asked the commissioner whether we’ll see a woman playing in his league someday.</p><p>“Sure,” he said matter-of-factly. “I think that’s well within the range of probability.”</p></blockquote><p>Speaking as a former NCAA D1 sprinter and martial artist, my opinion is that the Chicago Bears will start five women on the offensive line at the same time a woman wins a spot in the regular rotation of an NBA team.  People understand that women are weaker, but they never seem to grasp that women are incredibly slow compared to men.  And it’s not top speed where the difference is greatest, but quickness and acceleration.</p><p>Throw in the lack of durability, especially related to the female ACL, and there is no chance of this happening.  One can’t rule out a woman making an NBA roster; if the Basketball Godfather elects to go a particularly stupid marketing route then I wouldn’t be surprised to see <i>mandated</i> female players.  The truly interesting aspect to this article is the way it reveals the asinine extent to which male public figures are willing to go in order to be politically correct.</p></div>",
  "content_text": "To see what the Sports Guy has to say about this column arguing for\nwomen playing in the NBA\none day:\n5 reasons to believe a woman will play in the NBA\n• David Stern thinks it will happen. On Tuesday in the conference room outside his NBA office in Manhattan, I asked the commissioner whether we’ll see a woman playing in his league someday.\n“Sure,” he said matter-of-factly. “I think that’s well within the range of probability.”\nSpeaking as a former NCAA D1 sprinter and martial artist, my opinion is that the Chicago Bears will start five women on the offensive line at the same time a woman wins a spot in the regular rotation of an NBA team.  People understand that women are weaker, but they never seem to grasp that women are incredibly slow compared to men.  And it’s not top speed where the difference is greatest, but quickness and acceleration.\nThrow in the lack of durability, especially related to the female ACL, and there is no chance of this happening.  One can’t rule out a woman making an NBA roster; if the Basketball Godfather elects to go a particularly stupid marketing route then I wouldn’t be surprised to see\nmandated\nfemale players.  The truly interesting aspect to this article is the way it reveals the asinine extent to which male public figures are willing to go in order to be politically correct.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-05T01:11:00+00:00"
}