{
  "url": "https://voxday.net/2009/12/06/letter-to-common-sense-atheism-vi/",
  "scraped_at": "2026-01-08T23:13:53.951149",
  "title": "Letter to Common Sense Atheism VI",
  "date_display": "December 6, 2009",
  "date_iso": "2009-12-06T00:04:00+00:00",
  "date_from_url": "2009-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Luke,</p><p>I am sorry it took me so long to respond to your previous letter.  As you know, I recently published a book and have been more than a little occupied with the various interviews that were requested as a result.  And, to be honest, the release of <i>Call of Duty: Modern Warfare 2</i> hasn’t exactly helped my daily productivity although I’m sure you’ll be pleased to know that I’ve mastered both the UMP-45 and the SCAR-H.  However, I also found myself at a bit of a loss regarding the best way to respond to your most recent letter, because I was not entirely sure which aspects of your previous letters remain operable and which have been negated by the “reboot”.  But, I will attempt to make some reasonable assumptions and I have no doubt you will be willing to correct me if I prove to be mistaken.</p><p>Now, you noted yourself the inherent contradiction between your original willingness to postulate that the theistic case is true and your subsequent return to a defense of metaphysical naturalism in order to assert that the theistic case is false.  This is not any sort of problem in itself, since we both understood that you were merely postulating the truth of the theistic case for the sake of argument.  Well and good.  But, if you are “ill-prepared to defend the explanatory virtues of supernatural worldviews” you do not actually defend, as you stated in your most recent letter, this raises the question of whether you are capable of ascertaining which of the competing theistic explanations of (S) “Humans often take pleasure in the involuntary and undeserved suffering of others” is the one best supported by the observable evidence.  Are you conceding the other theistic explanations now in a willingness to stand or fall on the relative merits of the case for metaphysical naturalism vis-a-vis Christianity?  That is, after all, what you appear to be implying here.</p><p>One of the problems that has appeared during your continuing pursuit of clarification is that in this process, you appear to have inadvertently conceded the legitimacy of the basis for my personal belief in the truth of Christianity despite your rejection of the concept of objective evil upon which it is founded.  I realize that was far from your intent, of course, and your post facto rejection of the theistic case negates it, but let me point out what has developed in order to prevent it from happening again as we consider whether Christianity, metaphysical naturalism, or some other religion best explains the existence of (S), which for me is simply one of many of the various forms of observable, objective evil.</p><p>1.You postulated that the theistic arguments succeed and the atheistic arguments fail.</p><p>2.I explained that my belief in Christianity is based primarily on observing objective evil that I find to be best predicted and explained by the Christian worldview as expressed in the Bible and mainstream Christian theology.</p><p>3.You pointed out that there are a wide variety of competing theistic explanations for evil.</p><p>4.I agreed and noted that due to my academic background in history and East Asian Studies, I have even studied a few of those competing religions.  In fact, familiarity with those religions was one of the things that led me to believe the Christian explanation for the observable existence of evil was the correct one.</p><p>5.You asserted that you are not prepared to defend the explanatory virtues of the various supernatural worldviews, implying that you are not sufficiently prepared to adjudicate between them either.</p><p>6.  Ergo, there is no competition for the foundation of my belief in the truth of Christianity.</p><p>This doesn’t prove that my beliefs are correct, of course, merely that you had no rational basis for questioning the legitimacy of my belief in the truth of Christianity without reopening the matter of metaphysical naturalism.  Which you have now done.  So, unless you would like to reopen the matter of competing theistic explanations, I shall focus on addressing only the competing explanations of Christianity and metaphysical naturalism.</p><p>The metaphysical naturalism perspective dictates that Man is merely an animal, possessed of almost exactly the same substance as any other highly evolved mammal, constituted of DNA that is more similar to the great apes than the apes are to the monkeys, let alone dogs or cats.  Since we are so little different from other mammals, we cannot possess any attributes that are materially and substantively different from those possessed by them, we can only possess quantitative differences.  A man may pilot a fighter jet over enemy territory while a chimpanzee only hits a rival with a stick, but both mammals are doing essentially the same thing in using a tool for the purposes of harming another.  A woman may become the president of a world-reknowned university while a female gorilla may only become the dominant female in its troop, but again, both mammals are doing essentially the same thing in jockeying for primate primacy.  And what blogger can be unaware of the human proclivity for flinging metaphorical feces in the electronic form of ritual primate combat?</p><p>However, I think there is a definite substantive and non-quantitative distinction between the human and the animal when it comes to (S).  While the animal is capable of distinguishing between pleasure and pain, is able to experience pleasure, inflict pain, and can perceive the existence of pain in others, in my experience, I have never seen an animal derive direct personal pleasure solely from the pain of another animal.  Any pain that is involved in the interaction, whether it is a dog asserting its alpha status in the local neighborhood or a cat tormenting a mouse, appears to be nothing more than a consequence of the animal’s primary purpose rather than the purpose itself.  Unfortunately, humans, all too often inflict pain primarily for the sake of the pleasure it brings them.  This can be observed at a very early age; young children learn the pleasure of cruelty long before they are capable of understanding how to use the infliction of emotional and physical pain as a means of protecting and enhancing their social status.  This is the first hurdle that metaphysical naturalism must surmount.</p><p>The second hurdle that the naturalistic perspective must address is the divided nature of the human mind.  Leaving the larger question of the nature of human consciousness aside for the mystery it remains for priests and scientists alike, it is an observable and experiential fact as well as longstanding theory that the human mind does not function in the same unified way in which we understand animal minds to operate, driven solely by instinct, experience, and desire.  I am no great fan of Sigmund Freud’s or what I believe to be the profoundly unscientific pseudoscience of psychology that he created, but even I am willing to recognize that his development of the tripartite concept of the id, the ego, and the superego was driven by observational exigencies; it was his attempt to articulate and explain what he was observing in his patients.</p><p>Why do we wish to do what we are absolutely determined not to do?  Why do we refuse to do what we are absolutely convinced that we must do?  From where do these competing desires stem?  The Christian explanation is an elegant one; even those who do not believe in it will readily admit that the explanation of the continuous competition of a man’s unregenerate fallen nature and his redeemable spiritual nature provides a rational and reasonable explanation for the rival forces that exist within a single human mind.</p><p>This leads to the third hurdle that metaphysical naturalism must eventually address, which is why (S) should be viewed any differently from any other sort of pleasure.  The Disturbed song <i>Divide</i> asks the question in a characteristically confrontational manner:</p><p><i>I am a little more provocative than you might be,<br> It’s your shock and then your horror on which I feed<br> So can you tell me what exactly does freedom mean,<br> If I’m not free to be as twisted as I wanna be?</br></br></br></i></p><p>This is not an argument from consequence here, merely an observation that (S) is almost uninformly considered to be undesirable even by those who happen to be inclined towards it from time to time, so the strength and ubiquity of what must be logically be considered a nonsensical view from a naturalistic perspective requires explaining. Obviously the Christian worldview has little problem in explaining its declaration of (S) being unequivocally evil; contra the fevered visions of the Christian God as a deity with a torture fetish that one occasionally encounters among atheists and Christians alike, there is no evidence that God takes any particular pleasure in the destruction of the wicked except in that the necessary justice is done.  Actually, the various parables of the wheat and the chaff and the sheep and the goats tend to indicate that God has no more sadistic interest in the Hellbound soul than the average human does in the trash he is taking out to await the weekly garbage pickup.</p><p>As for the latter part of your letter, I have no objection to your suggestions regarding “explanation”, “hypothesis” and “theory”, I will await your response to these three (S)-related hurdles with interest.</p><p>Best regards,<br> Vox</br></p><p><i>This was written in response to <a href=\"http://commonsenseatheism.com/?p=4392\">the 6th Letter to Vox Day</a></i></p></div>",
  "content_text": "Dear Luke,\nI am sorry it took me so long to respond to your previous letter.  As you know, I recently published a book and have been more than a little occupied with the various interviews that were requested as a result.  And, to be honest, the release of\nCall of Duty: Modern Warfare 2\nhasn’t exactly helped my daily productivity although I’m sure you’ll be pleased to know that I’ve mastered both the UMP-45 and the SCAR-H.  However, I also found myself at a bit of a loss regarding the best way to respond to your most recent letter, because I was not entirely sure which aspects of your previous letters remain operable and which have been negated by the “reboot”.  But, I will attempt to make some reasonable assumptions and I have no doubt you will be willing to correct me if I prove to be mistaken.\nNow, you noted yourself the inherent contradiction between your original willingness to postulate that the theistic case is true and your subsequent return to a defense of metaphysical naturalism in order to assert that the theistic case is false.  This is not any sort of problem in itself, since we both understood that you were merely postulating the truth of the theistic case for the sake of argument.  Well and good.  But, if you are “ill-prepared to defend the explanatory virtues of supernatural worldviews” you do not actually defend, as you stated in your most recent letter, this raises the question of whether you are capable of ascertaining which of the competing theistic explanations of (S) “Humans often take pleasure in the involuntary and undeserved suffering of others” is the one best supported by the observable evidence.  Are you conceding the other theistic explanations now in a willingness to stand or fall on the relative merits of the case for metaphysical naturalism vis-a-vis Christianity?  That is, after all, what you appear to be implying here.\nOne of the problems that has appeared during your continuing pursuit of clarification is that in this process, you appear to have inadvertently conceded the legitimacy of the basis for my personal belief in the truth of Christianity despite your rejection of the concept of objective evil upon which it is founded.  I realize that was far from your intent, of course, and your post facto rejection of the theistic case negates it, but let me point out what has developed in order to prevent it from happening again as we consider whether Christianity, metaphysical naturalism, or some other religion best explains the existence of (S), which for me is simply one of many of the various forms of observable, objective evil.\n1.You postulated that the theistic arguments succeed and the atheistic arguments fail.\n2.I explained that my belief in Christianity is based primarily on observing objective evil that I find to be best predicted and explained by the Christian worldview as expressed in the Bible and mainstream Christian theology.\n3.You pointed out that there are a wide variety of competing theistic explanations for evil.\n4.I agreed and noted that due to my academic background in history and East Asian Studies, I have even studied a few of those competing religions.  In fact, familiarity with those religions was one of the things that led me to believe the Christian explanation for the observable existence of evil was the correct one.\n5.You asserted that you are not prepared to defend the explanatory virtues of the various supernatural worldviews, implying that you are not sufficiently prepared to adjudicate between them either.\n6.  Ergo, there is no competition for the foundation of my belief in the truth of Christianity.\nThis doesn’t prove that my beliefs are correct, of course, merely that you had no rational basis for questioning the legitimacy of my belief in the truth of Christianity without reopening the matter of metaphysical naturalism.  Which you have now done.  So, unless you would like to reopen the matter of competing theistic explanations, I shall focus on addressing only the competing explanations of Christianity and metaphysical naturalism.\nThe metaphysical naturalism perspective dictates that Man is merely an animal, possessed of almost exactly the same substance as any other highly evolved mammal, constituted of DNA that is more similar to the great apes than the apes are to the monkeys, let alone dogs or cats.  Since we are so little different from other mammals, we cannot possess any attributes that are materially and substantively different from those possessed by them, we can only possess quantitative differences.  A man may pilot a fighter jet over enemy territory while a chimpanzee only hits a rival with a stick, but both mammals are doing essentially the same thing in using a tool for the purposes of harming another.  A woman may become the president of a world-reknowned university while a female gorilla may only become the dominant female in its troop, but again, both mammals are doing essentially the same thing in jockeying for primate primacy.  And what blogger can be unaware of the human proclivity for flinging metaphorical feces in the electronic form of ritual primate combat?\nHowever, I think there is a definite substantive and non-quantitative distinction between the human and the animal when it comes to (S).  While the animal is capable of distinguishing between pleasure and pain, is able to experience pleasure, inflict pain, and can perceive the existence of pain in others, in my experience, I have never seen an animal derive direct personal pleasure solely from the pain of another animal.  Any pain that is involved in the interaction, whether it is a dog asserting its alpha status in the local neighborhood or a cat tormenting a mouse, appears to be nothing more than a consequence of the animal’s primary purpose rather than the purpose itself.  Unfortunately, humans, all too often inflict pain primarily for the sake of the pleasure it brings them.  This can be observed at a very early age; young children learn the pleasure of cruelty long before they are capable of understanding how to use the infliction of emotional and physical pain as a means of protecting and enhancing their social status.  This is the first hurdle that metaphysical naturalism must surmount.\nThe second hurdle that the naturalistic perspective must address is the divided nature of the human mind.  Leaving the larger question of the nature of human consciousness aside for the mystery it remains for priests and scientists alike, it is an observable and experiential fact as well as longstanding theory that the human mind does not function in the same unified way in which we understand animal minds to operate, driven solely by instinct, experience, and desire.  I am no great fan of Sigmund Freud’s or what I believe to be the profoundly unscientific pseudoscience of psychology that he created, but even I am willing to recognize that his development of the tripartite concept of the id, the ego, and the superego was driven by observational exigencies; it was his attempt to articulate and explain what he was observing in his patients.\nWhy do we wish to do what we are absolutely determined not to do?  Why do we refuse to do what we are absolutely convinced that we must do?  From where do these competing desires stem?  The Christian explanation is an elegant one; even those who do not believe in it will readily admit that the explanation of the continuous competition of a man’s unregenerate fallen nature and his redeemable spiritual nature provides a rational and reasonable explanation for the rival forces that exist within a single human mind.\nThis leads to the third hurdle that metaphysical naturalism must eventually address, which is why (S) should be viewed any differently from any other sort of pleasure.  The Disturbed song\nDivide\nasks the question in a characteristically confrontational manner:\nI am a little more provocative than you might be,\nIt’s your shock and then your horror on which I feed\nSo can you tell me what exactly does freedom mean,\nIf I’m not free to be as twisted as I wanna be?\nThis is not an argument from consequence here, merely an observation that (S) is almost uninformly considered to be undesirable even by those who happen to be inclined towards it from time to time, so the strength and ubiquity of what must be logically be considered a nonsensical view from a naturalistic perspective requires explaining. Obviously the Christian worldview has little problem in explaining its declaration of (S) being unequivocally evil; contra the fevered visions of the Christian God as a deity with a torture fetish that one occasionally encounters among atheists and Christians alike, there is no evidence that God takes any particular pleasure in the destruction of the wicked except in that the necessary justice is done.  Actually, the various parables of the wheat and the chaff and the sheep and the goats tend to indicate that God has no more sadistic interest in the Hellbound soul than the average human does in the trash he is taking out to await the weekly garbage pickup.\nAs for the latter part of your letter, I have no objection to your suggestions regarding “explanation”, “hypothesis” and “theory”, I will await your response to these three (S)-related hurdles with interest.\nBest regards,\nVox\nThis was written in response to\nthe 6th Letter to Vox Day",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-06T00:04:00+00:00"
}