{
  "url": "https://voxday.net/2009/12/08/recovery/",
  "scraped_at": "2026-01-08T23:14:03.154064",
  "title": "Recovery!",
  "date_display": "December 8, 2009",
  "date_iso": "2009-12-08T12:20:00+00:00",
  "date_from_url": "2009-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The 0.2% decline in U3 unemployment <a href=\"http://news.yahoo.com/s/ap/20091207/ap_on_bi_ge/us_unemployment_holiday_jobs\">isn’t necessarily the good thing</a> it is commonly assumed to be:</p><blockquote><p>Mara Proctor used to design limestone hearths and columns for luxury homes near Kansas City, drawing on her college education and six years of training. These days, she’s leading customers around a store that sells sculptured snowmen and Santa figurines.  It isn’t by choice. Until a few weeks ago, Proctor was among the record 5.9 million Americans who have been jobless for at least six months. Now she belongs to a subset of that group: Out-of-work professionals and managers, engineers and teachers who have turned, in desperation, to holiday-season jobs as sales clerks.</p><p>Retailers report a surge in applications this year from professionals who had never applied for such jobs before.</p></blockquote><p>As Pat Buchanan <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=118308\">points out</a>, it is insane to import 1.5 million immigrants when tens of millions of citizens are already out of work.  Or rather, it is insane to do so if you have any interest at all in the well-being of the citizenry.  On the other hand, since education is deemed to be so important, it’s obviously beneficial to the buyers of sculptured snowmen to have such a highly trained saleswoman at their service.</p><p>This is also the result of the higher education bubble.  I don’t remember who said it, but he was correct in pointing out that expanding higher education to the masses doesn’t mean that you won’t have sales clerks any more, it simply means that you’ll have sales clerks with PhDs.  As always, it’s about the supply and demand, and impoverished immigrants will always win out over middle class Americans for the simple reason that they will accept a lower wage.  One thing the Ricardians always fail to recognize is that the benefit to the overall economic system from free trade does NOT accrue to those parties who were previously at an overwhelming advantage.</p></div>",
  "content_text": "The 0.2% decline in U3 unemployment\nisn’t necessarily the good thing\nit is commonly assumed to be:\nMara Proctor used to design limestone hearths and columns for luxury homes near Kansas City, drawing on her college education and six years of training. These days, she’s leading customers around a store that sells sculptured snowmen and Santa figurines.  It isn’t by choice. Until a few weeks ago, Proctor was among the record 5.9 million Americans who have been jobless for at least six months. Now she belongs to a subset of that group: Out-of-work professionals and managers, engineers and teachers who have turned, in desperation, to holiday-season jobs as sales clerks.\nRetailers report a surge in applications this year from professionals who had never applied for such jobs before.\nAs Pat Buchanan\npoints out\n, it is insane to import 1.5 million immigrants when tens of millions of citizens are already out of work.  Or rather, it is insane to do so if you have any interest at all in the well-being of the citizenry.  On the other hand, since education is deemed to be so important, it’s obviously beneficial to the buyers of sculptured snowmen to have such a highly trained saleswoman at their service.\nThis is also the result of the higher education bubble.  I don’t remember who said it, but he was correct in pointing out that expanding higher education to the masses doesn’t mean that you won’t have sales clerks any more, it simply means that you’ll have sales clerks with PhDs.  As always, it’s about the supply and demand, and impoverished immigrants will always win out over middle class Americans for the simple reason that they will accept a lower wage.  One thing the Ricardians always fail to recognize is that the benefit to the overall economic system from free trade does NOT accrue to those parties who were previously at an overwhelming advantage.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-08T12:20:00+00:00"
}