{
  "url": "https://voxday.net/2009/12/05/tiger-and-foxy-knoxy-explosive-tru/",
  "scraped_at": "2026-01-08T23:13:52.142684",
  "title": "Tiger and Foxy Knoxy: the explosive truth!",
  "date_display": "December 5, 2009",
  "date_iso": "2009-12-05T12:39:00+00:00",
  "date_from_url": "2009-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a more explosive story than Climategate!  Why did Elin Woods go after her husband’s car with “a golf club”?  Look, the Official Story is ludicrous.  The former Swedish model obviously knew about her husband’s various women from the start; it’s not as if Scandinavians even bother with marriage anymore.  By the time the final count of Tiger’s affairs is complete, he’ll probably be confirmed to have more mistresses than major tropies.  More importantly, the photos of the car showed unmistakable signs of residue from an outdated chemical compound manufactured only in Germany from 1936 to 1944.</p><p>What really happened is that Elin discovered text messages between Tiger and Amanda Knox proving that he had been involved with Knox, who killed Kercher in a fit of jealousy over Kercher’s parallel affair with Woods.  Tiger’s secret plan to pay off the judge with a $1 million bribe, thus securing Knox’s silence, had failed because Knox made the mistake of bringing in Sollecito, a well-known knifeman of the Napolese Gomorra, instead of lending Kercher the Buick Enclave with the sabotaged brakes which Tiger gave her for that purpose.  Sollecito’s involvement backfired on Knox after the judge declined the bribe due to the assassination of his brother, a Mafia prosecutor for the city of Salerno, during the <i>Mani Pulite</i> affair of the mid-1990s.</p><p>But now that Knox has been convicted she has no reason to keep quiet any longer, which is why Tiger’s lawyers are presently waging a desperate battle to prevent him from being extradited to Italy.  And the failure of the judicial bribe was the real reason why Tiger was attempting to flee his house and seek asylum in Cuba; Elin, knowing that his arrest and conviction would provide her with a more favorable divorce settlement, prevented his escape by using a “golf club” that was actually a functioning Panzerfaust borrowed from the collection of their nearby neighbor, World War II enthusiast Curt Schilling.</p><p>In other, much less important news, six more U.S. banks with $13.5 billion in assets were seized yesterday as the world’s leaders prepare to gather in Copenhagen in order to decide what percentage of the global serfdom will be permitted to continue exhaling carbon dioxide.</p></div>",
  "content_text": "It’s a more explosive story than Climategate!  Why did Elin Woods go after her husband’s car with “a golf club”?  Look, the Official Story is ludicrous.  The former Swedish model obviously knew about her husband’s various women from the start; it’s not as if Scandinavians even bother with marriage anymore.  By the time the final count of Tiger’s affairs is complete, he’ll probably be confirmed to have more mistresses than major tropies.  More importantly, the photos of the car showed unmistakable signs of residue from an outdated chemical compound manufactured only in Germany from 1936 to 1944.\nWhat really happened is that Elin discovered text messages between Tiger and Amanda Knox proving that he had been involved with Knox, who killed Kercher in a fit of jealousy over Kercher’s parallel affair with Woods.  Tiger’s secret plan to pay off the judge with a $1 million bribe, thus securing Knox’s silence, had failed because Knox made the mistake of bringing in Sollecito, a well-known knifeman of the Napolese Gomorra, instead of lending Kercher the Buick Enclave with the sabotaged brakes which Tiger gave her for that purpose.  Sollecito’s involvement backfired on Knox after the judge declined the bribe due to the assassination of his brother, a Mafia prosecutor for the city of Salerno, during the\nMani Pulite\naffair of the mid-1990s.\nBut now that Knox has been convicted she has no reason to keep quiet any longer, which is why Tiger’s lawyers are presently waging a desperate battle to prevent him from being extradited to Italy.  And the failure of the judicial bribe was the real reason why Tiger was attempting to flee his house and seek asylum in Cuba; Elin, knowing that his arrest and conviction would provide her with a more favorable divorce settlement, prevented his escape by using a “golf club” that was actually a functioning Panzerfaust borrowed from the collection of their nearby neighbor, World War II enthusiast Curt Schilling.\nIn other, much less important news, six more U.S. banks with $13.5 billion in assets were seized yesterday as the world’s leaders prepare to gather in Copenhagen in order to decide what percentage of the global serfdom will be permitted to continue exhaling carbon dioxide.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-05T12:39:00+00:00"
}