{
  "url": "https://voxday.net/2009/12/31/whining-women-writers/",
  "scraped_at": "2026-01-08T23:15:47.659509",
  "title": "Creating a literary ghetto",
  "date_display": "December 31, 2009",
  "date_iso": "2009-12-31T14:34:00+00:00",
  "date_from_url": "2009-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To everyone’s surprise, Julianna Baggott blames sexism for the fact that <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/12/29/AR2009122902292.html\">women seldom write great or award-winning books</a>:</p><blockquote><p>I could understand Publishers Weekly’s phallocratic list if women were writing only a third of the books published or if women didn’t float the industry as book buyers or if the list were an anomaly. In fact, Publishers Weekly is in sync with Pulitzer Prize statistics. In the past 30 years, only 11 prizes have gone to women. Amazon recently announced its 100 best books of 2009 — in the top 10, there are two women. Top 20? Four….</p><p>What are the stereotypes that drive these biases? Over the years, I’ve developed many theories. Let me offer one here.</p><p>I often hear people exclaiming that they’re astonished that a particular book was written by a man. They seem stunned by the notion that a man could write with emotional intelligence and honesty about our human frailties.  Women, on the other hand, are supposed to be experts on emotion. I’ve never heard anyone remark that they were surprised that a book of psychological depth was written by a woman.</p></blockquote><p>That last sentence summarizes the writer’s problem; psychological depth != literary greatness.  That being said, one wonders who she would propose as the female equivalent of Dostoevsky, or even Poe.  Now, it’s worth pointing out that female writers often win awards in SF/F, but that’s partly because there are some very good authoresses such as Lois McMaster Bujold, Theresa Edgerton, and Tanith Lee active in the genre, and partly because the SFWA’s Nebula Award has a propensity to devolve into a popularity contest, (see Catharine Asaro, 2001).  But I suspect the main reason women write fewer great books is because they simply don’t make the effort to do so.</p><p>There’s nothing wrong with rewriting Tom Brown in a fantasy setting, but greatness does not lie that way even if massive sales success does.  There’s nothing wrong with writing silly vampire pre-porn for silly teenage girls either – although it would be illegal on aesthetic grounds and punishable by death by sugar overdose if I were ruling the universe – but it’s readily apparent that literary greatness is not on your list of objectives if you’re writing about sexy dead and/or furry things.</p><p>The problem isn’t that women don’t write “write with emotional intelligence and honesty about our human frailties”, it is that they don’t tend to write about much else.  While there are an increasing number of 40-something male writers who are making a career of doing this sort of narcissistic writing – Dave Eggers and stunt writer A.J. Jacobs spring to mind – the fact is that great literature requires more than navel-gazing, sexual daydreaming and gossip, no matter how well written that navel-gazing, daydreaming and gossip might be.</p><p>In any event, the only award that truly matters is the one that time conveys upon an author.  No amount of awards or sales are going to turn <i>Harry Potter and the Banquet of Boredom</i>, <i>The Picasso Crossword</i> into works of literary greatness.  If you try to accomplish something original, you will probably fail to reach the heights, but if you don’t even try then you definitely will. <i>Summa Elvetica</i> probably hasn’t sold one-tenth as many copies as the worst-selling novel published by Tor last year; it didn’t win a single award or even receive a single review in any literary publication.  Given the limitations of the author, it may not even be as good a novel as any of those published by Tor.  On the other hand, can anyone argue with a straight face that any of those books attempted to do even half of what was accomplished, let alone attempted, in SE?</p><p>Now, note that I’m not complaining in the slightest.  As evidence, I will point out that one can’t give a book a title like “A Casuistry of the Elvish Controversy” without knowing that practically no one is going to want to read it, to say nothing of throwing in all the untranslated Latin.  I could not possibly care less what a literary world of readers who consider Dan Brown to have produced the best of the year’s best happens to think.  I am simply observing the industry realities, not arguing that anything should be changed in order to accomodate my idiosyncratic preferences.  The industry has already changed enough over the last three decades, as its increasing bias towards various elements preferred by female editors and readers continues to drive young men away from books and towards computer games that still respect the heroic tropes.</p><p>Baggott’s article indicates that we should expect to see the same pattern at work in literary awards that we are presently seeing in the awarding of university degrees.  Female writers will eventually get their statistical due and make up the majority of literary award winners in time, but no one outside what will have then become a female-dominated literary ghetto will give a damn because the substantive value of the awards will have been destroyed by the very process of the desired transformation.  As I predicted back in 1995 (<a href=\"http://www.milobookclub.com/2007/04/16/total-ar/\">this 2007 Ben Bella piece</a> was simply a reworking of a proposed article for CGW that editor Chris Lombardi described as the most insane piece he’d ever read for the magazine), the next great art will not come from academia, Hollywood, or literature, but from the game industry.  Imagine, for example, if Rob Pardo had been a genuine intellectual in the Tolkein mode and harbored ambitions of doing more than Warhammer Fantasy Battle meets Everquest.</p><p>I still like fantasy.  I still write fantasy.  In fact, SE fans may be pleased to learn that I’m presently working on a map for the next book.  But I read very little of it these days because so much of it is derivative, predictable, trivial, and boring.  There is more astonishment and daring in a single Call of Duty mission – and every MW2 player knows to which mission I’m referring – than there is in any twenty SF/F books published today.</p></div>",
  "content_text": "To everyone’s surprise, Julianna Baggott blames sexism for the fact that\nwomen seldom write great or award-winning books\n:\nI could understand Publishers Weekly’s phallocratic list if women were writing only a third of the books published or if women didn’t float the industry as book buyers or if the list were an anomaly. In fact, Publishers Weekly is in sync with Pulitzer Prize statistics. In the past 30 years, only 11 prizes have gone to women. Amazon recently announced its 100 best books of 2009 — in the top 10, there are two women. Top 20? Four….\nWhat are the stereotypes that drive these biases? Over the years, I’ve developed many theories. Let me offer one here.\nI often hear people exclaiming that they’re astonished that a particular book was written by a man. They seem stunned by the notion that a man could write with emotional intelligence and honesty about our human frailties.  Women, on the other hand, are supposed to be experts on emotion. I’ve never heard anyone remark that they were surprised that a book of psychological depth was written by a woman.\nThat last sentence summarizes the writer’s problem; psychological depth != literary greatness.  That being said, one wonders who she would propose as the female equivalent of Dostoevsky, or even Poe.  Now, it’s worth pointing out that female writers often win awards in SF/F, but that’s partly because there are some very good authoresses such as Lois McMaster Bujold, Theresa Edgerton, and Tanith Lee active in the genre, and partly because the SFWA’s Nebula Award has a propensity to devolve into a popularity contest, (see Catharine Asaro, 2001).  But I suspect the main reason women write fewer great books is because they simply don’t make the effort to do so.\nThere’s nothing wrong with rewriting Tom Brown in a fantasy setting, but greatness does not lie that way even if massive sales success does.  There’s nothing wrong with writing silly vampire pre-porn for silly teenage girls either – although it would be illegal on aesthetic grounds and punishable by death by sugar overdose if I were ruling the universe – but it’s readily apparent that literary greatness is not on your list of objectives if you’re writing about sexy dead and/or furry things.\nThe problem isn’t that women don’t write “write with emotional intelligence and honesty about our human frailties”, it is that they don’t tend to write about much else.  While there are an increasing number of 40-something male writers who are making a career of doing this sort of narcissistic writing – Dave Eggers and stunt writer A.J. Jacobs spring to mind – the fact is that great literature requires more than navel-gazing, sexual daydreaming and gossip, no matter how well written that navel-gazing, daydreaming and gossip might be.\nIn any event, the only award that truly matters is the one that time conveys upon an author.  No amount of awards or sales are going to turn\nHarry Potter and the Banquet of Boredom\n,\nThe Picasso Crossword\ninto works of literary greatness.  If you try to accomplish something original, you will probably fail to reach the heights, but if you don’t even try then you definitely will.\nSumma Elvetica\nprobably hasn’t sold one-tenth as many copies as the worst-selling novel published by Tor last year; it didn’t win a single award or even receive a single review in any literary publication.  Given the limitations of the author, it may not even be as good a novel as any of those published by Tor.  On the other hand, can anyone argue with a straight face that any of those books attempted to do even half of what was accomplished, let alone attempted, in SE?\nNow, note that I’m not complaining in the slightest.  As evidence, I will point out that one can’t give a book a title like “A Casuistry of the Elvish Controversy” without knowing that practically no one is going to want to read it, to say nothing of throwing in all the untranslated Latin.  I could not possibly care less what a literary world of readers who consider Dan Brown to have produced the best of the year’s best happens to think.  I am simply observing the industry realities, not arguing that anything should be changed in order to accomodate my idiosyncratic preferences.  The industry has already changed enough over the last three decades, as its increasing bias towards various elements preferred by female editors and readers continues to drive young men away from books and towards computer games that still respect the heroic tropes.\nBaggott’s article indicates that we should expect to see the same pattern at work in literary awards that we are presently seeing in the awarding of university degrees.  Female writers will eventually get their statistical due and make up the majority of literary award winners in time, but no one outside what will have then become a female-dominated literary ghetto will give a damn because the substantive value of the awards will have been destroyed by the very process of the desired transformation.  As I predicted back in 1995 (\nthis 2007 Ben Bella piece\nwas simply a reworking of a proposed article for CGW that editor Chris Lombardi described as the most insane piece he’d ever read for the magazine), the next great art will not come from academia, Hollywood, or literature, but from the game industry.  Imagine, for example, if Rob Pardo had been a genuine intellectual in the Tolkein mode and harbored ambitions of doing more than Warhammer Fantasy Battle meets Everquest.\nI still like fantasy.  I still write fantasy.  In fact, SE fans may be pleased to learn that I’m presently working on a map for the next book.  But I read very little of it these days because so much of it is derivative, predictable, trivial, and boring.  There is more astonishment and daring in a single Call of Duty mission – and every MW2 player knows to which mission I’m referring – than there is in any twenty SF/F books published today.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-31T14:34:00+00:00"
}