{
  "url": "https://voxday.net/2009/12/28/wnd-column_28-6/",
  "scraped_at": "2026-01-08T23:15:31.829042",
  "title": "WND column",
  "date_display": "December 28, 2009",
  "date_iso": "2009-12-28T08:33:00+00:00",
  "date_from_url": "2009-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=120228\">2010: The Year Ahead</a></p><p>While the Great Depression is considered to have begun with the great stock market crash of 1929, the first mention of the words “great depression” was in a speech given by Herbert Hoover in late 1931. The first specific and titular reference did not occur until 1934, when British economist Lionel Robbins published a book titled “The Great Depression.” This would neither be the first nor the last time economists influenced by the Austrian School would be the first to identify a major economic downturn in the making or to point out that the policies of the fiscal and monetary authorities were guaranteed to exacerbate it.</p><div style=\"padding-left: 30px;\"><i>What then, are the prospects of enduring recovery? It is clear that they are not bright. It is quite probable, if there is no immediate outbreak of war on a large scale, that the next few months may see a substantial revival of business. If the exchanges are stabilised and the competition in depreciation ceases, there is a strong probability that the upward movement, which began in the summer of 1932, will continue. If the stabilisation were made permanent and some progress were made with the removal of the grosser obstacles to trade, it is not out of the question that a boom would develop. There are many things which might upset this development. The basis of recovery in the United States is gravely jeopardised by the policy of the Government.</i></div><div style=\"padding-left: 30px;\">– Lionel Robbins, “The Great Depression,” Page 195</div><p>UPDATE I – In the column, I neglected to specifically point out that if the present situation follows the historical precedent, public figures should first begin to recognize the existence of the Great Depression 2.0 two years after it began.  This would indicate the fourth quarter of 2010.</p><p>UPDATE II – We are amused.  Yesterday, I wrote this: <i>“While some of the wiser economists are hedging their bets by stating that they expect growth to be “sluggish” with “downside risks,” there are no more expectations of market crashes, financial collapse or widespread economic contraction than there were at the beginning of 2008.”</i> At the same time, <a href=\"http://www.calculatedriskblog.com/2009/12/krugman-another-contraction-possible.html\">Paul Krugman was anticipating</a> his need to engage in the customary CYA of the mainstream economist: “Yeah, its a reasonably high chance [of economic contraction in the second half of 2010] – it’s less than 50/50 odds – but we have now a recovery that … is being driven by fiscal stimulus which is going to fade out in the 2nd half of next year….”</p><p>Reasonably high.  Less than 50/50.  Remember, that’s the finest that mainstream economics has to offer.  Now, I don’t believe in feigning accuracy by assigning meaningless numbers that hint at nonexistent probability calculations, so I will simply say that 100 &gt; 50/50. <b>So speak up now, every doubter, anklebiter, and would-be critic.</b> How many of you dare to publicly declare that all the mainstream economists are correct about the prospects for continued “economic recovery” in 2010 and that I am therefore wrong?  Is anyone actually willing to go on the record and state that my rejection of the expert consensus is incorrect or not?</p><p>I’ll even provide some hard metrics and predict that by the end of 2010:</p><p>1. The BLS will report U-3 unemployment to be in excess of 11 percent.  The actual number of unemployed workers will be much higher.<br> 2.  The BEA will report at least one quarter of negative GDP growth.  The GDP figures for Q309 and Q409 will be revised downward.  Again.<br> 3.  The Federal budget deficit for 2010 will exceed the projected $1.17 trillion.<br> 4.  More than 200 banks will be seized by the FDIC.  Their deposits will represent more than two percent of all U.S. bank deposits.<br> 5.  Commercial bank loans and leases (TOTLL) will fall below $6.3 trillion. <br> 6.  All sectors credit market instruments excluding corporate equities and mutual fund shares liability, which is published in the Fed’s quarterly Z1 Flow of Funds Accounts, will fall below $52 trillion.<br> 7.  The national median existing-home price will not rise four percent from $172,600 to $179,500 as predicted by NAR’s lead economist Lawrence Yun.  It will fall instead to a level I will attempt to estimate before the next NAR release.</br></br></br></br></br></br></p><p>These seven specific predictions are all directly contrary to what almost all mainstream economists are presently predicting for 2010; I am presently compiling a selection of economic predictions from all the usual suspects for future comparison.</p></div>",
  "content_text": "2010: The Year Ahead\nWhile the Great Depression is considered to have begun with the great stock market crash of 1929, the first mention of the words “great depression” was in a speech given by Herbert Hoover in late 1931. The first specific and titular reference did not occur until 1934, when British economist Lionel Robbins published a book titled “The Great Depression.” This would neither be the first nor the last time economists influenced by the Austrian School would be the first to identify a major economic downturn in the making or to point out that the policies of the fiscal and monetary authorities were guaranteed to exacerbate it.\nWhat then, are the prospects of enduring recovery? It is clear that they are not bright. It is quite probable, if there is no immediate outbreak of war on a large scale, that the next few months may see a substantial revival of business. If the exchanges are stabilised and the competition in depreciation ceases, there is a strong probability that the upward movement, which began in the summer of 1932, will continue. If the stabilisation were made permanent and some progress were made with the removal of the grosser obstacles to trade, it is not out of the question that a boom would develop. There are many things which might upset this development. The basis of recovery in the United States is gravely jeopardised by the policy of the Government.\n– Lionel Robbins, “The Great Depression,” Page 195\nUPDATE I – In the column, I neglected to specifically point out that if the present situation follows the historical precedent, public figures should first begin to recognize the existence of the Great Depression 2.0 two years after it began.  This would indicate the fourth quarter of 2010.\nUPDATE II – We are amused.  Yesterday, I wrote this:\n“While some of the wiser economists are hedging their bets by stating that they expect growth to be “sluggish” with “downside risks,” there are no more expectations of market crashes, financial collapse or widespread economic contraction than there were at the beginning of 2008.”\nAt the same time,\nPaul Krugman was anticipating\nhis need to engage in the customary CYA of the mainstream economist: “Yeah, its a reasonably high chance [of economic contraction in the second half of 2010] – it’s less than 50/50 odds – but we have now a recovery that … is being driven by fiscal stimulus which is going to fade out in the 2nd half of next year….”\nReasonably high.  Less than 50/50.  Remember, that’s the finest that mainstream economics has to offer.  Now, I don’t believe in feigning accuracy by assigning meaningless numbers that hint at nonexistent probability calculations, so I will simply say that 100 > 50/50.\nSo speak up now, every doubter, anklebiter, and would-be critic.\nHow many of you dare to publicly declare that all the mainstream economists are correct about the prospects for continued “economic recovery” in 2010 and that I am therefore wrong?  Is anyone actually willing to go on the record and state that my rejection of the expert consensus is incorrect or not?\nI’ll even provide some hard metrics and predict that by the end of 2010:\n1. The BLS will report U-3 unemployment to be in excess of 11 percent.  The actual number of unemployed workers will be much higher.\n2.  The BEA will report at least one quarter of negative GDP growth.  The GDP figures for Q309 and Q409 will be revised downward.  Again.\n3.  The Federal budget deficit for 2010 will exceed the projected $1.17 trillion.\n4.  More than 200 banks will be seized by the FDIC.  Their deposits will represent more than two percent of all U.S. bank deposits.\n5.  Commercial bank loans and leases (TOTLL) will fall below $6.3 trillion.\n6.  All sectors credit market instruments excluding corporate equities and mutual fund shares liability, which is published in the Fed’s quarterly Z1 Flow of Funds Accounts, will fall below $52 trillion.\n7.  The national median existing-home price will not rise four percent from $172,600 to $179,500 as predicted by NAR’s lead economist Lawrence Yun.  It will fall instead to a level I will attempt to estimate before the next NAR release.\nThese seven specific predictions are all directly contrary to what almost all mainstream economists are presently predicting for 2010; I am presently compiling a selection of economic predictions from all the usual suspects for future comparison.",
  "tags": [
    "economics",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-12-28T08:33:00+00:00"
}