{
  "url": "https://voxday.net/2018/03/11/a-new-blog-policy/",
  "scraped_at": "2025-12-19T10:46:34.925230",
  "title": "A new blog policy",
  "date_display": "March 11, 2018",
  "date_iso": "2018-03-11T16:56:25+00:00",
  "date_from_url": "2018-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As most of you are aware, I don’t have a lot of free time these days. To say that I am “busy” doesn’t really quite do the concept justice. I’m behind on practically everything with the exception of  Alt★Hero, Avalon, Jeeves, and Quantum Mortis. So, let’s just say my ability to tolerate idiocy is not at its peak right now.</p><p>Now, my tolerance for Gamma behavior is never high. But in the last few weeks, my understanding of a specific Gamma tactic deepened a little when I noticed something: no matter what the subject is, from immigration to free trade to free speech, certain critical commenters ALWAYS attempt to somehow make the debate about ME. I had never previously stopped to think about why they do this. But this time, when I finally took the time to think the matter through, I realized what their game was: trying to win an argument through an appeal to the genetic fallacy. It’s a passive-aggressive variant of the classic SJW discredit and disqualify game.</p><p>This is a stupid and futile approach. But then, these are stupid and futile people. Consider this incredible protest of my actions:</p><blockquote><p><i>“I refuse to tolerate critics who insist, every single fucking time, attempting to personalize these topics and make them about me, any longer.”</i></p><p>Vox, you personalized the topic first when you refused to answer my questions on the ground that they were “stupid,” and that I “ask lots of stupid questions.” You didn’t even bother to explain what was stupid about these supposedly stupid questions. You just declared them stupid, and that was that.</p><p>You’re delusional if you think that isn’t getting aggressively personal. And, ok, you can do that. I don’t really mind. But of course if you behave that way toward me, then I’m going to behave that way toward you. And you’re in no moral position at all to complain about it, because you started it–*you* set the personal tone. I was only responding to the tone that you set.</p></blockquote><p>Oh, did I? <a href=\"http://voxday.blogspot.com/2018/03/conservative-free-speech-activists.html#c7415005097119665164\">Read the questions</a>. Notice who, rather than what, is the subject of most of them.</p><p>Anyhow, let me make this new policy perfectly clear for everyone. If your argument is about me rather than the topic, if you attempt to address a macro topic by referring to me as a micro counterexample, or if you attempt to bring me up in any way as the basis, relevant or irrelevant, of your argument, I am going to delete your comment. If you do it more than once, I will spam you.</p><p>Example: <i>Vox emigrated from the United States, therefore all immigration, past and present, is necessarily beneficial and desirable. Futhermore, any observation of problems that may be caused by the mass migration of tens of millions of people is automatically negated by the fact that Vox himself does not presently reside in his city of birth.</i></p><p>Such arguments are stupid, irrelevant, and illogical. And I am simply not going to continue to waste any more time spelling out, again and again, why this form of argument is a complete non-starter that can never even <i>possibly </i>prove anything.</p><p>There is absolutely nothing that I do or say that bears any significance whatsoever with regards to the intrinsic morality, justice, or legitimacy of an action, a policy, a regulation, a law, a historical pattern, or a probability. I am not the measure of all things. So stop trying to present arguments on that basis!</p></div>",
  "content_text": "As most of you are aware, I don’t have a lot of free time these days. To say that I am “busy” doesn’t really quite do the concept justice. I’m behind on practically everything with the exception of  Alt★Hero, Avalon, Jeeves, and Quantum Mortis. So, let’s just say my ability to tolerate idiocy is not at its peak right now.\nNow, my tolerance for Gamma behavior is never high. But in the last few weeks, my understanding of a specific Gamma tactic deepened a little when I noticed something: no matter what the subject is, from immigration to free trade to free speech, certain critical commenters ALWAYS attempt to somehow make the debate about ME. I had never previously stopped to think about why they do this. But this time, when I finally took the time to think the matter through, I realized what their game was: trying to win an argument through an appeal to the genetic fallacy. It’s a passive-aggressive variant of the classic SJW discredit and disqualify game.\nThis is a stupid and futile approach. But then, these are stupid and futile people. Consider this incredible protest of my actions:\n“I refuse to tolerate critics who insist, every single fucking time, attempting to personalize these topics and make them about me, any longer.”\nVox, you personalized the topic first when you refused to answer my questions on the ground that they were “stupid,” and that I “ask lots of stupid questions.” You didn’t even bother to explain what was stupid about these supposedly stupid questions. You just declared them stupid, and that was that.\nYou’re delusional if you think that isn’t getting aggressively personal. And, ok, you can do that. I don’t really mind. But of course if you behave that way toward me, then I’m going to behave that way toward you. And you’re in no moral position at all to complain about it, because you started it–*you* set the personal tone. I was only responding to the tone that you set.\nOh, did I?\nRead the questions\n. Notice who, rather than what, is the subject of most of them.\nAnyhow, let me make this new policy perfectly clear for everyone. If your argument is about me rather than the topic, if you attempt to address a macro topic by referring to me as a micro counterexample, or if you attempt to bring me up in any way as the basis, relevant or irrelevant, of your argument, I am going to delete your comment. If you do it more than once, I will spam you.\nExample:\nVox emigrated from the United States, therefore all immigration, past and present, is necessarily beneficial and desirable. Futhermore, any observation of problems that may be caused by the mass migration of tens of millions of people is automatically negated by the fact that Vox himself does not presently reside in his city of birth.\nSuch arguments are stupid, irrelevant, and illogical. And I am simply not going to continue to waste any more time spelling out, again and again, why this form of argument is a complete non-starter that can never even\npossibly\nprove anything.\nThere is absolutely nothing that I do or say that bears any significance whatsoever with regards to the intrinsic morality, justice, or legitimacy of an action, a policy, a regulation, a law, a historical pattern, or a probability. I am not the measure of all things. So stop trying to present arguments on that basis!",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-11T16:56:25+00:00"
}