{
  "url": "https://voxday.net/2018/03/27/and-we-are-supposed-to-care/",
  "scraped_at": "2025-12-19T20:54:43.776522",
  "title": "And we are supposed to care?",
  "date_display": "March 27, 2018",
  "date_iso": "2018-03-27T13:43:30+00:00",
  "date_from_url": "2018-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps the old (((French))) woman should have cried Holocaust while <a href=\"http://www.unz.com/isteve/reading-the-new-york-times-upside-down/\">her fellow !Frenchmen! were stabbing her to death</a>. Surely the magic words would have saved her from the inchoate evils of anti-Semitism!</p><blockquote><p>An 85-year-old woman who as a child narrowly escaped France’s most notorious wartime roundup of Jews has been murdered in Paris, and the authorities are calling it a hate crime.</p><p>The body of the woman, Mireille Knoll, was found on Friday in her apartment in the city’s working-class 11th arrondissement. She had been stabbed to death, and her body was partly burned after her attackers apparently tried to set fire to the apartment.</p><p>The Paris prosecutor’s office said on Monday that Ms. Knoll had been killed because of the “membership, real or supposed, of the victim of a particular religion” — a roundabout way of saying she was killed because she was Jewish….</p><p>Francis Kalifat, the head of the Representative Council of Jewish Institutions of France, said, “This makes one feel something absolutely terrible. She escaped the anti-Semitism of the Nazis, but in the end her destiny followed her because she was killed because of anti-Semitism.”</p></blockquote><p>No, she was killed because her fellow Jews have been aggressively pushing open immigration into the West for nearly 100 years. There is certainly an amount of irony involved, but it isn’t the irony that the media wishes to perpetrate.</p><p><i>“Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies [sic] that they once were in the last century. Jews are going to be at the center of that. It’s a huge transformation for Europe to make. They are now going into a multicultural mode, and Jews will be resented because of our leading role. But without that leading role, and without that transformation, Europe will not survive.”</i><br>– Barbara Lerner Spectre</br></p><p>Apparently Ms Spectre and Mr. Soros didn’t think through what “the throes of that transformation” would necessarily involve. Or perhaps they simply didn’t care about their lesser co-nationals. Because the “rise of anti-Semitism” across Europe and in the USA is nothing more than a massive Jewish own goal of historic proportions with nightmarish potential. And none of the Western nations being adulterated and devastated by the policies advocated by these (((diasporans))) are going to shed any tears for them this time.</p><p>For example, I tend to doubt this woman, <a href=\"https://www.bitchute.com/video/McKibXlevmtV/\">who fled Sweden</a> as a result of the very immigration championed by Ms Spectre and Mr. Soros, is going to be particularly amenable to the usual sob stories. Watch the whole interview. She makes it very clear that the situation in Sweden is considerably worse than the media is reporting and I do not imagine that she appreciates those who have taken a leading role in making it happen.</p><p>This is why a strong and stable Israel is absolutely vital if the omni-destructive anti-Semitic cycle is ever to be shut down for good. Israel is skin in the game, as NN Taleb would put it. That is something that rootless (((nomads))) like (((Simon Schama))) and (((Jonathan Weisman))) observably lack.</p><blockquote class=\"tr_bq\"><p>There is nothing wrong, as Weisman counsels, with Jews standing shoulder to shoulder with those most damaged and threatened by tribalist populism, as Jews like Abraham Joshua Heschel did in the heyday of the civil rights movement. Ultimately, though, what is needed is an aggressive defense of those things that not so long ago could be taken for granted in America, and under which Jewish life has prospered to a degree unique in the world: the integrity of the democratic process, the protections of the Constitution and the preservation of the ideal of a “nation of immigrants,” a phrase just deleted from the Immigration Service’s mission statement.</p></blockquote><p>Yes, there is something absolutely wrong with it, (((Mr. Schama))). There is something more than wrong with it, as it is literal <i>treachery </i>if we are to take your pretenses to citizenship at face value. And speaking as an American Indian, I can testify with authority that the USA was never a “nation of immigrants”. That is self-serving 20th-century (((immigrant))) propaganda. So, shed no tears for the deceivers who sow the seeds of their own destruction.</p><p>As Buzz Mohawk wrote at Steve Sailer’s site: <i>We are not a nation of immigrants. We are a nation of Citizens descended from pioneers who wrote the Constitution to secure the blessings of Liberty for themselves and for their Posterity, for us.</i><br><i><br/></i>To paraphrase one commenter here, you may recall that the Jews did not become Egyptians despite having lived in Egypt for 300 years. They did not become Canaanites after invading Canaan, and they did not become Palestinians after immigrating to Palestine. So, why would you ever imagine that a mere generation or three of residence in the United States would make them real Americans?</br></p></div>",
  "content_text": "Perhaps the old (((French))) woman should have cried Holocaust while\nher fellow !Frenchmen! were stabbing her to death\n. Surely the magic words would have saved her from the inchoate evils of anti-Semitism!\nAn 85-year-old woman who as a child narrowly escaped France’s most notorious wartime roundup of Jews has been murdered in Paris, and the authorities are calling it a hate crime.\nThe body of the woman, Mireille Knoll, was found on Friday in her apartment in the city’s working-class 11th arrondissement. She had been stabbed to death, and her body was partly burned after her attackers apparently tried to set fire to the apartment.\nThe Paris prosecutor’s office said on Monday that Ms. Knoll had been killed because of the “membership, real or supposed, of the victim of a particular religion” — a roundabout way of saying she was killed because she was Jewish….\nFrancis Kalifat, the head of the Representative Council of Jewish Institutions of France, said, “This makes one feel something absolutely terrible. She escaped the anti-Semitism of the Nazis, but in the end her destiny followed her because she was killed because of anti-Semitism.”\nNo, she was killed because her fellow Jews have been aggressively pushing open immigration into the West for nearly 100 years. There is certainly an amount of irony involved, but it isn’t the irony that the media wishes to perpetrate.\n“Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies [sic] that they once were in the last century. Jews are going to be at the center of that. It’s a huge transformation for Europe to make. They are now going into a multicultural mode, and Jews will be resented because of our leading role. But without that leading role, and without that transformation, Europe will not survive.”\n– Barbara Lerner Spectre\nApparently Ms Spectre and Mr. Soros didn’t think through what “the throes of that transformation” would necessarily involve. Or perhaps they simply didn’t care about their lesser co-nationals. Because the “rise of anti-Semitism” across Europe and in the USA is nothing more than a massive Jewish own goal of historic proportions with nightmarish potential. And none of the Western nations being adulterated and devastated by the policies advocated by these (((diasporans))) are going to shed any tears for them this time.\nFor example, I tend to doubt this woman,\nwho fled Sweden\nas a result of the very immigration championed by Ms Spectre and Mr. Soros, is going to be particularly amenable to the usual sob stories. Watch the whole interview. She makes it very clear that the situation in Sweden is considerably worse than the media is reporting and I do not imagine that she appreciates those who have taken a leading role in making it happen.\nThis is why a strong and stable Israel is absolutely vital if the omni-destructive anti-Semitic cycle is ever to be shut down for good. Israel is skin in the game, as NN Taleb would put it. That is something that rootless (((nomads))) like (((Simon Schama))) and (((Jonathan Weisman))) observably lack.\nThere is nothing wrong, as Weisman counsels, with Jews standing shoulder to shoulder with those most damaged and threatened by tribalist populism, as Jews like Abraham Joshua Heschel did in the heyday of the civil rights movement. Ultimately, though, what is needed is an aggressive defense of those things that not so long ago could be taken for granted in America, and under which Jewish life has prospered to a degree unique in the world: the integrity of the democratic process, the protections of the Constitution and the preservation of the ideal of a “nation of immigrants,” a phrase just deleted from the Immigration Service’s mission statement.\nYes, there is something absolutely wrong with it, (((Mr. Schama))). There is something more than wrong with it, as it is literal\ntreachery\nif we are to take your pretenses to citizenship at face value. And speaking as an American Indian, I can testify with authority that the USA was never a “nation of immigrants”. That is self-serving 20th-century (((immigrant))) propaganda. So, shed no tears for the deceivers who sow the seeds of their own destruction.\nAs Buzz Mohawk wrote at Steve Sailer’s site:\nWe are not a nation of immigrants. We are a nation of Citizens descended from pioneers who wrote the Constitution to secure the blessings of Liberty for themselves and for their Posterity, for us.\nTo paraphrase one commenter here, you may recall that the Jews did not become Egyptians despite having lived in Egypt for 300 years. They did not become Canaanites after invading Canaan, and they did not become Palestinians after immigrating to Palestine. So, why would you ever imagine that a mere generation or three of residence in the United States would make them real Americans?",
  "tags": [
    "ClashofCivilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-27T12:43:30+00:00"
}