{
  "url": "https://voxday.net/2018/03/11/anti-democratic-democracy/",
  "scraped_at": "2025-12-19T10:46:31.986726",
  "title": "Anti-democratic democracy",
  "date_display": "March 11, 2018",
  "date_iso": "2018-03-11T14:14:36+00:00",
  "date_from_url": "2018-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Robert Kagan <a href=\"https://www.youtube.com/watch?v=zqz5XmryeEo&amp;list=PLRlpW88SeBSP8kjYf6ZIM4BVFlxOWZSC-\">explains </a>that the principle of democracy requires that NATO bring the hammer down upon countries whose anti-democratic voters have anti-democratically elected themselves governments that he, personally, doesn’t like.</i><br>– Steve Sailer</br></p><p><i>Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies that they once were in the last century. Jews are going to be at the center of that. It’s a huge transformation for Europe to make. They are now going into a multicultural mode, and Jews will be resented because of our leading role. But without that leading role, and without that transformation, Europe will not survive.</i><br>– Barbara Lerner Spectre</br></p><p><i>We Jews, we, the destroyers, will remain the destroyers for ever. Nothing that you do will meet our needs and demands. We will destroy because we need a world of our own, a God-world, which it is not in your nature to build. Beyond all temporary alliances with this or that action lies the ultimate split in nature and destiny, the enmity between the Game and God.</i><br>– Maurice Samuels</br></p><p><i>The thing that makes Judaism dangerous to everybody, to every race, to every nation, to every idea, is that we smash things that aren’t true, we don’t believe in the boundaries of nation-state, we don’t believe in the ideas of these individual gods that protect individual groups of people; these are all artificial constructions and Judaism really teaches us how to see that. In a sense our detractors have us right, in that we are a corrosive force, we’re breaking down the false gods of all nations and all people because they’re not real and that’s very upsetting to people.</i><br>– Douglas Rushkoff</br></p><p>So, we are informed that Judaism means trying to redefine things to mean their opposite, attacking everyone else’s faith, and actively trying to destroy every race and nation in order to build a new world that is contrary to human nature. I don’t know about you, but that sounds literally Satanic with a capital S to me. I wonder if that might be a better explanation for all those historical expulsions from Christian nations than universal envy of their good looks and success. Regardless, it should suffice to make it abundantly clear that while Christians and Jews may share the Pentateuch, they do <u>not</u> worship the same God.</p><p><i>Ye shall know them by their fruits. Do men gather grapes of thorns, or figs of thistles? Even so every good tree bringeth forth good fruit; but a corrupt tree bringeth forth evil fruit. A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good fruit. Every tree that bringeth not forth good fruit is hewn down, and cast into the fire. Wherefore by their fruits ye shall know them.</i><br>– Jesus Christ</br></p><p>Remember, Jesus Christ is the Way, the <b><i>TRUTH</i></b>, and the Life. And he has said that <u>no one</u> will come to the Father except by him.</p></div>",
  "content_text": "Robert Kagan\nexplains\nthat the principle of democracy requires that NATO bring the hammer down upon countries whose anti-democratic voters have anti-democratically elected themselves governments that he, personally, doesn’t like.\n– Steve Sailer\nEurope has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies that they once were in the last century. Jews are going to be at the center of that. It’s a huge transformation for Europe to make. They are now going into a multicultural mode, and Jews will be resented because of our leading role. But without that leading role, and without that transformation, Europe will not survive.\n– Barbara Lerner Spectre\nWe Jews, we, the destroyers, will remain the destroyers for ever. Nothing that you do will meet our needs and demands. We will destroy because we need a world of our own, a God-world, which it is not in your nature to build. Beyond all temporary alliances with this or that action lies the ultimate split in nature and destiny, the enmity between the Game and God.\n– Maurice Samuels\nThe thing that makes Judaism dangerous to everybody, to every race, to every nation, to every idea, is that we smash things that aren’t true, we don’t believe in the boundaries of nation-state, we don’t believe in the ideas of these individual gods that protect individual groups of people; these are all artificial constructions and Judaism really teaches us how to see that. In a sense our detractors have us right, in that we are a corrosive force, we’re breaking down the false gods of all nations and all people because they’re not real and that’s very upsetting to people.\n– Douglas Rushkoff\nSo, we are informed that Judaism means trying to redefine things to mean their opposite, attacking everyone else’s faith, and actively trying to destroy every race and nation in order to build a new world that is contrary to human nature. I don’t know about you, but that sounds literally Satanic with a capital S to me. I wonder if that might be a better explanation for all those historical expulsions from Christian nations than universal envy of their good looks and success. Regardless, it should suffice to make it abundantly clear that while Christians and Jews may share the Pentateuch, they do\nnot\nworship the same God.\nYe shall know them by their fruits. Do men gather grapes of thorns, or figs of thistles? Even so every good tree bringeth forth good fruit; but a corrupt tree bringeth forth evil fruit. A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good fruit. Every tree that bringeth not forth good fruit is hewn down, and cast into the fire. Wherefore by their fruits ye shall know them.\n– Jesus Christ\nRemember, Jesus Christ is the Way, the\nTRUTH\n, and the Life. And he has said that\nno one\nwill come to the Father except by him.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-11T14:14:36+00:00"
}