{
  "url": "https://voxday.net/2018/03/16/ben-shapiro-defends-free-trade/",
  "scraped_at": "2025-12-19T20:52:55.051639",
  "title": "Ben Shapiro defends free trade",
  "date_display": "March 16, 2018",
  "date_iso": "2018-03-16T12:57:44+00:00",
  "date_from_url": "2018-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I demonstrate why Ben Shapiro has been running non-stop from a debate with me, particularly one concerning economics. First, this is a link to his piece entitled <a href=\"https://www.dailywire.com/news/28302/yes-tariffs-are-still-stupid-heres-why-ben-shapiro\">“Yes, Tariffs Are Still Stupid. Here’s Why”</a>. Go and read it first, in its totality, so you will understand that I am not making any of this up and I am fairly representing his positions that I am criticizing.</p><blockquote><p>Yes, free trade is good.</p><p>On Thursday, The Journal of American Greatness, an outlet devoted to President Trump’s purported philosophy, printed an article by Spencer Morrison, a law student and editor-in-chief of the National Economics Editorial. The article is an attempt to rebut the chief conceits of free trade, and in particular, knock down my objections to President Trump’s fondness for tariffs. It’s titled “Why Ben Shapiro is Wrong on Free Trade.”</p><p>The reality is that my arguments on free trade have been supported by every major free market economist in history, but I do appreciate the central billing.</p></blockquote><p>This is a little sleight of hand, as Benny presents a tautology as if it means something. Friedrich List is a major non-socialist economist who strongly favored tariffs, but is he a “free market economist”? What does “free market economist”, a phrase that is meaningless in economics terms, mean?  It means an economist who supports free trade. So, the reality is that Benny is cribbing “his” arguments from economists who support free trade. Which is not news.</p><blockquote class=\"tr_bq\"><p>Morrison’s argument in favor of tariffs begins with an analysis of a three-minute segment of video from my daily podcast in which I talk about the flaws in tariff-based economics. As I’ve actually done full episodes on tariffs, and written extensively about them, I wouldn’t say that the video is my fulsome argument against them, but it’s sufficient for purposes of discussion. Morrison first misrepresents my argument in the video: he says that I’m pro-trade deficit, when in reality, I merely explain in the video that trade deficits are an irrelevant economic statistic (neither good per se nor bad per se) and that some countries that run trade deficits do just fine, while some that run trade surpluses don’t. Morrison takes that to be me stumping for the beauty of trade deficits — which, again, I don’t do, since I think that statistic is irrelevant. </p></blockquote><p>It’s fair for him to criticize Morrison’s misrepresentation, since Benny is not pro-free trade deficit, he merely thinks they are irrelevant. But Benny is totally wrong, since a trade deficit is not even remotely irrelevant, as it literally shrinks the economy. To grow the economy and increase GDP, export. To shrink the economy and reduce GDP, import. What this reveals is that Benny clearly does not know how GDP is calculated, nor is he aware of how the trade deficit is a part of the basic GDP formula: C+I+G+(x-m).</p><p>As it happens, I address this in the next Voxiversity video, but those of you who understand addition and subtraction should be able to grasp that when (x-m) is negative, there is a trade deficit and GDP is lower. Without the trade deficit, the USA would have a $20.3 trillion economy rather than a $19.7 trillion economy, so it’s hardly “irrelevant” considering that 3 percent growth is cause for celebration these days.</p><blockquote><p>Finally, Morrison gets to his central argument: comparative advantage doesn’t work when capital is mobile. Here’s Morrison:</p><p><i>Comparative advantage is an elegant theory, but it too is domain-specific—it only works when certain preconditions are met. For example, capital must be immobile for the theory to apply. Shapiro ignores this crucial limiting factor, and applies comparative advantage to just about everything. This is his root error. … For example, comparative advantage suggests that the key to getting rich is to specialize production, regardless of what you produce. That is, a country with a comparative advantage in growing soybeans should focus on growing more soybeans, while a country with a comparative advantage in manufacturing semiconductors should focus on manufacturing more semiconductors. In either case, this supposes, their relative wealth will correlate with the degree of specialization, as opposed to the complexity of their production. This is objectively wrong.</i></p><p>To support the contention that it is objectively wrong to embrace comparative advantage, Morrison cites two studies. First, he cites a paper from economists Ricardo Hausmann, Jason Hwang, and Dani Rodrik, claiming that countries that manufacture automobiles develop faster than those that grow bananas, and another from Stephen Redding of the London School of Economics stating that economic growth is path-dependent — that if you develop a particular industry that is more sophisticated, other industries grow up around that industry, making for a more powerful economy. The result, Morrison claims, is that the United States should enforce tariffs on behalf of its most technologically advanced/important industries, to prevent other countries from undercutting those industries and reducing us to comparative advantage in nail-clipper manufacturing.</p></blockquote><p>First, literally every economist knows that comparative advantage doesn’t work when capital is mobile. The immobility of capital is only one of David Ricardo’s false assumptions that are required for comparative advantage to logically hold up. Shapiro doesn’t understand that the papers Morrison is citing are not relevant to the capital argument, or that Morrison is simply trying to keep it simple for economics illiterates like him. The immobility of capital is merely the fifth of the seven false Ricardian assumptions intrinsic to the theory of comparative advantage listed by Ian Fletcher, which are as follows:</p><ol><li>    The comparative advantage is sustainable.</li><li>    No externalities.</li><li>    Production factors move between industries without cost</li><li>    No change in the ratio of income inequality.</li><li>    Immobile international capital</li><li>    Short-term efficiency causes long-term growth</li><li>    Foreign productivity does not improve</li></ol><div>There is, of course, an eighth and more important false assumption, the immobility of international labor, that I have identified, but that is well beyond Shapiro’s level, so we will simply mention it in passing and leave it at that.</div><blockquote class=\"tr_bq\"><p>There are several points to be made here. The first is the most important: the argument Morrison makes is for total state control of the economy. If we can simply pick the best industries and subsidize them, we should obviously do that. Why not just embrace mercantilism?</p></blockquote><p>That is a blatant and shameless misrepresentation of Morrison’s argument. His argument for tariffs is clearly not an argument for “total state control of the economy”. Shapiro is simply being dishonest there.</p><blockquote><p>First, of course countries that develop higher-profit sectors will have higher growth rates than those that rely on low-profit sectors. And of course the decisions you make now have impact on the future development of industry. But this has nothing to do with tariffs. The Hausmann, Hwang, and Rodrick paper doesn’t mention tariffs once. Neither does the London School of Economics paper.</p><p>Again, there’s a reason for that. There are two problems with tariffs: first, you cannot tell which sectors will be the most profitable, because you cannot tell the future, which means that government is far more likely to “lock-in” particular pathways than to spur future growth; second, most market “lock-in” is self-correcting — we develop new products on a routine basis that are different in kind than the products that preceded them. Horses and buggies dominated the market, and we built roads in a certain way to accommodate them, and we built houses near those roads. Then cars came along and blew all of that out of the water.</p><p>If we could see the future, we could have simply picked which industry upon which to focus. We couldn’t. And in 1947, the smart money would have been in using government to tax all other industries to dump money into manufacturing, for example. That would have been totally wrong. In 1947, according to the Bureau of Economic Analysis, manufacturing represented 25.4{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP production in the United States; finance represented 10.3{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}; agriculture 8{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}. If we had been creating tariffs to protect the “most important” industries, we’d have put our money on manufacturing, finance, and agriculture. But we’d have been wrong. By 2016, manufacturing represented 11.7{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP; finance represented 20.9{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}; agriculture represented 1.0{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}.</p></blockquote><p>The papers may not mention tariffs, but tariffs are the primary way those sectors are defended, when imports in those sectors are not simply banned altogether. I hope Shapiro is being dishonest there too, because his claim that tariffs have nothing to do with how countries develop industries is simply wrong.</p><p>And more often than not, you can tell which sectors are going to be more profitable than others. The fact that you cannot predict these things with absolute 100 percent accuracy does not mean that you cannot do so at all, or to a worthwhile extent. Despite some famous blunders, MITI did so very successfully in Japan from 1949 to 2001. Germany still does so today, to such an extent that exports make up 46.1 percent of its economy. Ben completely fails to understand both the way tariffs work as well as the fact that he is begging the question; if we’d put our money on protecting the manufacturing sector, then that sector <i>almost certainly</i> <i>would not have fallen</i> from 25.4{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} to 11.7{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP. Preventing such declines is the primary point of using tariffs to defend a particular sector!</p><blockquote class=\"tr_bq\"><p>And this is the point. Impoverishing your profit sectors through tariffs in order to dump money into non-competitive industries impoverishes your country as a whole. Economic flexibility requires that the government not impede the free flow of capital within industries. That’s true when capital is mobile as well — if we invest our money in Chinese tech because it’s cheaper and better (even if they’re subsidizing that industry!), that money comes back to the United States in the form of capital account surplus.</p></blockquote><p>First, it’s both statistically and historically false to claim that tariffs impoverish countries. Second, money does not necessarily come back to the United States, as the existence of foreign-held eurodollars, the $3.1 trillion held overseas by US corporations since 1986, and the recent decision of Apple and other tech companies to repatriate over $400 billion being will suffice to demonstrate. And third, Ben clearly has not thought through the intrinsic costs of economic flexibility, which when taken to their free trade extreme are absolutely and inevitably lethal to any nation.</p><p>I could go into considerably more detail, but at this point, it should be obvious to the informed reader that Ben is doing little more than spouting off free trade rhetoric that he has learned by rote; he does not understand the theory of comparative advantage, its justifications, its assumptions, its flaws, or its inescapable consequences. With regards to free trade and economics, Benny is an ignorant and uninformed fraud, and his position on free trade is completely and utterly incorrect. Tariffs are not stupid, but Ben Shapiro certainly is.</p></div>",
  "content_text": "In which I demonstrate why Ben Shapiro has been running non-stop from a debate with me, particularly one concerning economics. First, this is a link to his piece entitled\n“Yes, Tariffs Are Still Stupid. Here’s Why”\n. Go and read it first, in its totality, so you will understand that I am not making any of this up and I am fairly representing his positions that I am criticizing.\nYes, free trade is good.\nOn Thursday, The Journal of American Greatness, an outlet devoted to President Trump’s purported philosophy, printed an article by Spencer Morrison, a law student and editor-in-chief of the National Economics Editorial. The article is an attempt to rebut the chief conceits of free trade, and in particular, knock down my objections to President Trump’s fondness for tariffs. It’s titled “Why Ben Shapiro is Wrong on Free Trade.”\nThe reality is that my arguments on free trade have been supported by every major free market economist in history, but I do appreciate the central billing.\nThis is a little sleight of hand, as Benny presents a tautology as if it means something. Friedrich List is a major non-socialist economist who strongly favored tariffs, but is he a “free market economist”? What does “free market economist”, a phrase that is meaningless in economics terms, mean?  It means an economist who supports free trade. So, the reality is that Benny is cribbing “his” arguments from economists who support free trade. Which is not news.\nMorrison’s argument in favor of tariffs begins with an analysis of a three-minute segment of video from my daily podcast in which I talk about the flaws in tariff-based economics. As I’ve actually done full episodes on tariffs, and written extensively about them, I wouldn’t say that the video is my fulsome argument against them, but it’s sufficient for purposes of discussion. Morrison first misrepresents my argument in the video: he says that I’m pro-trade deficit, when in reality, I merely explain in the video that trade deficits are an irrelevant economic statistic (neither good per se nor bad per se) and that some countries that run trade deficits do just fine, while some that run trade surpluses don’t. Morrison takes that to be me stumping for the beauty of trade deficits — which, again, I don’t do, since I think that statistic is irrelevant.\nIt’s fair for him to criticize Morrison’s misrepresentation, since Benny is not pro-free trade deficit, he merely thinks they are irrelevant. But Benny is totally wrong, since a trade deficit is not even remotely irrelevant, as it literally shrinks the economy. To grow the economy and increase GDP, export. To shrink the economy and reduce GDP, import. What this reveals is that Benny clearly does not know how GDP is calculated, nor is he aware of how the trade deficit is a part of the basic GDP formula: C+I+G+(x-m).\nAs it happens, I address this in the next Voxiversity video, but those of you who understand addition and subtraction should be able to grasp that when (x-m) is negative, there is a trade deficit and GDP is lower. Without the trade deficit, the USA would have a $20.3 trillion economy rather than a $19.7 trillion economy, so it’s hardly “irrelevant” considering that 3 percent growth is cause for celebration these days.\nFinally, Morrison gets to his central argument: comparative advantage doesn’t work when capital is mobile. Here’s Morrison:\nComparative advantage is an elegant theory, but it too is domain-specific—it only works when certain preconditions are met. For example, capital must be immobile for the theory to apply. Shapiro ignores this crucial limiting factor, and applies comparative advantage to just about everything. This is his root error. … For example, comparative advantage suggests that the key to getting rich is to specialize production, regardless of what you produce. That is, a country with a comparative advantage in growing soybeans should focus on growing more soybeans, while a country with a comparative advantage in manufacturing semiconductors should focus on manufacturing more semiconductors. In either case, this supposes, their relative wealth will correlate with the degree of specialization, as opposed to the complexity of their production. This is objectively wrong.\nTo support the contention that it is objectively wrong to embrace comparative advantage, Morrison cites two studies. First, he cites a paper from economists Ricardo Hausmann, Jason Hwang, and Dani Rodrik, claiming that countries that manufacture automobiles develop faster than those that grow bananas, and another from Stephen Redding of the London School of Economics stating that economic growth is path-dependent — that if you develop a particular industry that is more sophisticated, other industries grow up around that industry, making for a more powerful economy. The result, Morrison claims, is that the United States should enforce tariffs on behalf of its most technologically advanced/important industries, to prevent other countries from undercutting those industries and reducing us to comparative advantage in nail-clipper manufacturing.\nFirst, literally every economist knows that comparative advantage doesn’t work when capital is mobile. The immobility of capital is only one of David Ricardo’s false assumptions that are required for comparative advantage to logically hold up. Shapiro doesn’t understand that the papers Morrison is citing are not relevant to the capital argument, or that Morrison is simply trying to keep it simple for economics illiterates like him. The immobility of capital is merely the fifth of the seven false Ricardian assumptions intrinsic to the theory of comparative advantage listed by Ian Fletcher, which are as follows:\nThe comparative advantage is sustainable.\nNo externalities.\nProduction factors move between industries without cost\nNo change in the ratio of income inequality.\nImmobile international capital\nShort-term efficiency causes long-term growth\nForeign productivity does not improve\nThere is, of course, an eighth and more important false assumption, the immobility of international labor, that I have identified, but that is well beyond Shapiro’s level, so we will simply mention it in passing and leave it at that.\nThere are several points to be made here. The first is the most important: the argument Morrison makes is for total state control of the economy. If we can simply pick the best industries and subsidize them, we should obviously do that. Why not just embrace mercantilism?\nThat is a blatant and shameless misrepresentation of Morrison’s argument. His argument for tariffs is clearly not an argument for “total state control of the economy”. Shapiro is simply being dishonest there.\nFirst, of course countries that develop higher-profit sectors will have higher growth rates than those that rely on low-profit sectors. And of course the decisions you make now have impact on the future development of industry. But this has nothing to do with tariffs. The Hausmann, Hwang, and Rodrick paper doesn’t mention tariffs once. Neither does the London School of Economics paper.\nAgain, there’s a reason for that. There are two problems with tariffs: first, you cannot tell which sectors will be the most profitable, because you cannot tell the future, which means that government is far more likely to “lock-in” particular pathways than to spur future growth; second, most market “lock-in” is self-correcting — we develop new products on a routine basis that are different in kind than the products that preceded them. Horses and buggies dominated the market, and we built roads in a certain way to accommodate them, and we built houses near those roads. Then cars came along and blew all of that out of the water.\nIf we could see the future, we could have simply picked which industry upon which to focus. We couldn’t. And in 1947, the smart money would have been in using government to tax all other industries to dump money into manufacturing, for example. That would have been totally wrong. In 1947, according to the Bureau of Economic Analysis, manufacturing represented 25.4{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP production in the United States; finance represented 10.3{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}; agriculture 8{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}. If we had been creating tariffs to protect the “most important” industries, we’d have put our money on manufacturing, finance, and agriculture. But we’d have been wrong. By 2016, manufacturing represented 11.7{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP; finance represented 20.9{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}; agriculture represented 1.0{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320}.\nThe papers may not mention tariffs, but tariffs are the primary way those sectors are defended, when imports in those sectors are not simply banned altogether. I hope Shapiro is being dishonest there too, because his claim that tariffs have nothing to do with how countries develop industries is simply wrong.\nAnd more often than not, you can tell which sectors are going to be more profitable than others. The fact that you cannot predict these things with absolute 100 percent accuracy does not mean that you cannot do so at all, or to a worthwhile extent. Despite some famous blunders, MITI did so very successfully in Japan from 1949 to 2001. Germany still does so today, to such an extent that exports make up 46.1 percent of its economy. Ben completely fails to understand both the way tariffs work as well as the fact that he is begging the question; if we’d put our money on protecting the manufacturing sector, then that sector\nalmost certainly\nwould not have fallen\nfrom 25.4{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} to 11.7{8f3a20e95123fc761e5b6545cdcf28fe932999778b1965cb4dd78a3d9b063320} of GDP. Preventing such declines is the primary point of using tariffs to defend a particular sector!\nAnd this is the point. Impoverishing your profit sectors through tariffs in order to dump money into non-competitive industries impoverishes your country as a whole. Economic flexibility requires that the government not impede the free flow of capital within industries. That’s true when capital is mobile as well — if we invest our money in Chinese tech because it’s cheaper and better (even if they’re subsidizing that industry!), that money comes back to the United States in the form of capital account surplus.\nFirst, it’s both statistically and historically false to claim that tariffs impoverish countries. Second, money does not necessarily come back to the United States, as the existence of foreign-held eurodollars, the $3.1 trillion held overseas by US corporations since 1986, and the recent decision of Apple and other tech companies to repatriate over $400 billion being will suffice to demonstrate. And third, Ben clearly has not thought through the intrinsic costs of economic flexibility, which when taken to their free trade extreme are absolutely and inevitably lethal to any nation.\nI could go into considerably more detail, but at this point, it should be obvious to the informed reader that Ben is doing little more than spouting off free trade rhetoric that he has learned by rote; he does not understand the theory of comparative advantage, its justifications, its assumptions, its flaws, or its inescapable consequences. With regards to free trade and economics, Benny is an ignorant and uninformed fraud, and his position on free trade is completely and utterly incorrect. Tariffs are not stupid, but Ben Shapiro certainly is.",
  "tags": [
    "freetrade"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-16T12:57:44+00:00"
}