{
  "url": "https://voxday.net/2018/03/22/benny-gets-bitch-slapped/",
  "scraped_at": "2025-12-19T20:53:54.142704",
  "title": "Benny gets bitch-slapped",
  "date_display": "March 22, 2018",
  "date_iso": "2018-03-22T15:12:39+00:00",
  "date_from_url": "2018-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no secret to the readers here that Ben Shapiro has absolutely no idea what he’s talking about when it comes to economics. That’s why it’s amusing to see Spencer Morrison kicking him around so easily. The Littlest Chickenhawk knows he’s not in my league, which is why he ran away from debates with me twice, but he clearly didn’t realize the full extent of his ignorance or he would have kept his mouth shut rather than getting steamrolled on the issue of trade and tariffs.</p><p>Morrison addresses Shapiro’s inept response to him <a href=\"https://amgreatness.com/2018/03/19/yes-ben-shapiro-is-still-wrong-on-tariffs-heres-why/\">in a second article</a> that really needs to be read in its entirety to appreciate its contemptuous nature:</p><blockquote><p>Shapiro begins with two rather embarrassing mistakes. First, he misstates the name of this publication. Second, he commits a call to authority fallacy—precisely the error I accused him of last week. Shapiro writes:</p><p><i>The reality is that my arguments on free trade have been supported by every major free market economist in history . . .</i></p><p>This is a tautology: of course most “free market” (read: Austrian School) economists support free trade—just as most American School economists support tariffs, or most labor economists support unions. Does the fact that most Marxist economists support socialism prove that socialism works? No. This is sophistry.</p><p>Shapiro is also a hypocrite: did he not make his name by ignoring the so-called “97 percent of climate scientists” who believe climate change is anthropogenic, or the (I imagine) 100 percent of gender studies professors who think biological sex and gender identity are different? Why is Shapiro so willing to ignore “experts” on climate change or feminism, yet treat them like (false) gods when it comes to economics? Shapiro would be wise to remain ever-skeptical, and heed the aphorism: Take not the merchant at his word, but trust only by the skin of his fruit.</p><p>Finally, Shapiro says the articles I cited “do not mention tariffs,” and they are therefore irrelevant. This is like saying a paper on Elizabethan England, that never mentions Shakespeare, is irrelevant to studying Shakespeare—really? This is the difference between scholarship and parroting: my sources lend support to a novel conclusion, while Shapiro clearly googled “path-dependency” and cited the first book he could find—a case study of Microsoft.</p><p>While the book does discuss path-dependency, it does so explicitly within the context of a single industry, and makes no claim that the findings should be applied between industries. There is a big difference between supporting Microsoft relative to Apple or Google, and supporting America’s entire IT industry relative to foreign competitors. These are different debates, and the nuance is clearly lost on Shapiro….</p><p>Shapiro acknowledges that not all industries are of equal value when it comes to economic growth; economic growth depends upon technological development; growth is non-linear in that certain individuals (or industries) generate most of it.</p><p>Wait a minute! Shapiro just said that we “cannot tell which sectors will be the most profitable.” Which Ben do we believe? This is a perfect example of domain-specific knowledge in action. When Ben Shapiro has his “businessman” thinking-cap on, he acknowledges that you can tell which industries are most likely to generate economic growth—he even gives us an example. Yet when he has his “economist” thinking-cap on, he denies this categorically. This is what happens when you parrot sources without evaluating them for yourself.</p></blockquote><p>Now that last sentence looks a little familiar, <a href=\"http://voxday.blogspot.com/2018/03/ben-shapiro-defends-free-trade.html\">does it not?</a> Perhaps it is merely a coincidence, two parallel observations. Or perhaps not….</p><p>Anyhow, it’s obvious that Benny was too busy playing the violin and copying <i>Human Events</i> for his weekly WND column to ever play computer games, or he would understand the basic concept of path dependency that every turn-based Civ or RTS player has had to master. The little guy somehow managed to graduate <i>cum laude</i> from Harvard Law School without ever reaching the level of knowledge possessed by the average computer gamer.</p></div>",
  "content_text": "It’s no secret to the readers here that Ben Shapiro has absolutely no idea what he’s talking about when it comes to economics. That’s why it’s amusing to see Spencer Morrison kicking him around so easily. The Littlest Chickenhawk knows he’s not in my league, which is why he ran away from debates with me twice, but he clearly didn’t realize the full extent of his ignorance or he would have kept his mouth shut rather than getting steamrolled on the issue of trade and tariffs.\nMorrison addresses Shapiro’s inept response to him\nin a second article\nthat really needs to be read in its entirety to appreciate its contemptuous nature:\nShapiro begins with two rather embarrassing mistakes. First, he misstates the name of this publication. Second, he commits a call to authority fallacy—precisely the error I accused him of last week. Shapiro writes:\nThe reality is that my arguments on free trade have been supported by every major free market economist in history . . .\nThis is a tautology: of course most “free market” (read: Austrian School) economists support free trade—just as most American School economists support tariffs, or most labor economists support unions. Does the fact that most Marxist economists support socialism prove that socialism works? No. This is sophistry.\nShapiro is also a hypocrite: did he not make his name by ignoring the so-called “97 percent of climate scientists” who believe climate change is anthropogenic, or the (I imagine) 100 percent of gender studies professors who think biological sex and gender identity are different? Why is Shapiro so willing to ignore “experts” on climate change or feminism, yet treat them like (false) gods when it comes to economics? Shapiro would be wise to remain ever-skeptical, and heed the aphorism: Take not the merchant at his word, but trust only by the skin of his fruit.\nFinally, Shapiro says the articles I cited “do not mention tariffs,” and they are therefore irrelevant. This is like saying a paper on Elizabethan England, that never mentions Shakespeare, is irrelevant to studying Shakespeare—really? This is the difference between scholarship and parroting: my sources lend support to a novel conclusion, while Shapiro clearly googled “path-dependency” and cited the first book he could find—a case study of Microsoft.\nWhile the book does discuss path-dependency, it does so explicitly within the context of a single industry, and makes no claim that the findings should be applied between industries. There is a big difference between supporting Microsoft relative to Apple or Google, and supporting America’s entire IT industry relative to foreign competitors. These are different debates, and the nuance is clearly lost on Shapiro….\nShapiro acknowledges that not all industries are of equal value when it comes to economic growth; economic growth depends upon technological development; growth is non-linear in that certain individuals (or industries) generate most of it.\nWait a minute! Shapiro just said that we “cannot tell which sectors will be the most profitable.” Which Ben do we believe? This is a perfect example of domain-specific knowledge in action. When Ben Shapiro has his “businessman” thinking-cap on, he acknowledges that you can tell which industries are most likely to generate economic growth—he even gives us an example. Yet when he has his “economist” thinking-cap on, he denies this categorically. This is what happens when you parrot sources without evaluating them for yourself.\nNow that last sentence looks a little familiar,\ndoes it not?\nPerhaps it is merely a coincidence, two parallel observations. Or perhaps not….\nAnyhow, it’s obvious that Benny was too busy playing the violin and copying\nHuman Events\nfor his weekly WND column to ever play computer games, or he would understand the basic concept of path dependency that every turn-based Civ or RTS player has had to master. The little guy somehow managed to graduate\ncum laude\nfrom Harvard Law School without ever reaching the level of knowledge possessed by the average computer gamer.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-22T15:12:39+00:00"
}