{
  "url": "https://voxday.net/2018/03/12/buddhism-is-not-a-religion-of-peace/",
  "scraped_at": "2025-12-19T10:46:42.508395",
  "title": "Buddhism is not a religion of peace",
  "date_display": "March 12, 2018",
  "date_iso": "2018-03-12T18:45:22+00:00",
  "date_from_url": "2018-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As a student of Japanese history, I have always been totally mystified by the common American misconception that there is anything peaceful about Buddhism in general, or Buddhist monks in particular. I suspect it is simply the result of non-Christians in the West desperately casting about for something, anything, in which they can believe is superior to Christianity. Nevertheless, the media is belatedly <a href=\"https://www.yahoo.com/news/rise-violent-buddhist-rhetoric-asia-defies-stereotypes-021356063.html\">beginning to notice</a> that perhaps Buddhism is not quite as gentle as they have generally portrayed it to be.</p><blockquote><p>Buddhism may be touted in the West as an inherently peaceful philosophy, but a surge in violent rhetoric from small but increasingly influential groups of hardline monks in parts of Asia is upending the religion’s tolerant image.</p><p>Buddhist mobs in Sri Lanka last week led anti-Muslim riots that left at least three dead and more than 200 Muslim-owned establishments in ruins, just the latest bout of communal violence there stoked by Buddhist nationalists.</p><p>In Myanmar, ultra-nationalist monks led by firebrand preacher Wirathu have poured vitriol on the country’s small Muslim population, cheering a military crackdown forcing nearly 700,000 Rohingya into Bangladesh.</p><p>And in neighbouring Thailand, a prominent monk found himself in hot water for calling on followers to burn down mosques.</p><p>What has prompted this surge in aggressive rhetoric from followers of a faith that is so often equated, rightly or wrongly, with non-violence?</p></blockquote><p>What has prompted it is the resurgence of Islam, of course. Buddhists in Asia have considerably more, and considerably more recent experience with Islamic violence than Christians do, and so they are naturally less tolerant of Muslims in their midst. As for the peaceful nature of Buddhism, <i>The Tale of Genji</i>, written in the eighth century by Murasaki Shikibu, is rife with incidents of the much-feared Buddhist monks descending from their mountain monasteries to raid and pillage the villages below. And <i>The Tale of the Heike</i>, compiled some 400 years later, tells of a massive battle between the imperial army and an army of Buddhist warrior monks.</p><p><i>The Heike split their forty thousand horsemen into two parties and swooped down on the fortifications at the two roads, uttering mighty war whoops. The monks were all unmounted men with forged weapons, but the court’s warriors were horsemen with bows and arrows, and they galloped after the monks in all directions, hitting every one of them with fast and furious barrages of arrow’s. The battle began with an arrow exchange during the hour of the hare and raged all day long. After nightfall, the positions on the two roads both went down in defeat.</i><br><i><br/></i><i>One of the routed monks was Saka no Shiro Yokaku, a brave warrior who surpassed everyone in the seven great temples and fifteen great temples in swordsmanship, archery, and physical strength. He wore armor with black lacing over a corselet with green lacing, and his five-plated helmet was fitted over a metal cap. Holding in one hand a long, unlacquered spear, curved like cogon grass, and in the other a great sword with a lacquered hilt, he slashed his way out of the Tegai Gate at the Todaiji, surrounded by a dozen monks from his cloister. He held his ground for a time, scything horses’ legs and felling many opponents. But the waves of attacks from the court’s huge army cut down all his companions, leaving him alone with his back unprotected, and he fled toward the south, brave though he was.</i></br></p><p><i>Now the battle was being fought in the dark. “Make a fire!” Shigchira ordered, standing in front of the gate at the Hannyaji Temple. One of the Heike warriors was a man named Tomokata, a functionary from the Fukui estate in Harima Province. This Tomokata promptly set a commoner’s house on fire, using a torch made from a broken shield. There was a strong wind blowing, as was usual enough for the season—it was late in the twelfth month, the night of the twenty-eighth—and the gusts spread the fire from the initial location to many different buildings in the temple precincts.</i><br><i><br/></i><i>The battles at the Narazaka and Hannya roads had claimed the life of every monk who had feared disgrace and prized honor; and the others who could walk had fled toward Yoshino and Totsukawa. Aged monks unable to walk, eminent scholar-monks, pages, women, and children had fled helter-skelter into the Kofukuji, and also into the Great Buddha Hall, where more than a thousand had sought refuge on the second floor, with the ladders removed to save them from the pursuing enemy.  When the raging flames bore down on them, they uttered shrieks that seemingly could not have been surpassed by the sinners in the flames of the Tapana, Paritapana, and Avici hells….</i><br><i><br/></i><i>When the scribes made a careful record of those who had burned to death in the flames, the total amounted to more than three thousand five hundred people: more than seventeen hundred on the second floor of the Great Buddha Hall, more than eight hundred at the Kofukuji, more than five hundred in this temple building, more than three hundred in that. More than a thousand monks had been killed in battle. The victors hung a few heads in front of the gate at the Hannyaji and carried a few others back to the capital.</i><br><i><br/></i><i>On the twenty-ninth, Shigehira returned to the capital, leaving Nara in ruins. Kiyomori greeted the outcome of the expedition with vindictive glee, but the empress, the two retired emperors, the regent, and everyone else lamented. “It might have been all right to get rid of the soldier-monks, but it was a terrible mistake to destroy the temples,” people said.</i><br><i><br/></i><i>The original plan had been to parade the monks’ heads through the avenues, and to hang them on the trees in front of the jail, but the court refused to issue the necessary orders, appalled by the destruction of the Todaiji and the Kofu-kuji. The heads were discarded in gutters and ditches.</i></br></br></br></br></p></div>",
  "content_text": "As a student of Japanese history, I have always been totally mystified by the common American misconception that there is anything peaceful about Buddhism in general, or Buddhist monks in particular. I suspect it is simply the result of non-Christians in the West desperately casting about for something, anything, in which they can believe is superior to Christianity. Nevertheless, the media is belatedly\nbeginning to notice\nthat perhaps Buddhism is not quite as gentle as they have generally portrayed it to be.\nBuddhism may be touted in the West as an inherently peaceful philosophy, but a surge in violent rhetoric from small but increasingly influential groups of hardline monks in parts of Asia is upending the religion’s tolerant image.\nBuddhist mobs in Sri Lanka last week led anti-Muslim riots that left at least three dead and more than 200 Muslim-owned establishments in ruins, just the latest bout of communal violence there stoked by Buddhist nationalists.\nIn Myanmar, ultra-nationalist monks led by firebrand preacher Wirathu have poured vitriol on the country’s small Muslim population, cheering a military crackdown forcing nearly 700,000 Rohingya into Bangladesh.\nAnd in neighbouring Thailand, a prominent monk found himself in hot water for calling on followers to burn down mosques.\nWhat has prompted this surge in aggressive rhetoric from followers of a faith that is so often equated, rightly or wrongly, with non-violence?\nWhat has prompted it is the resurgence of Islam, of course. Buddhists in Asia have considerably more, and considerably more recent experience with Islamic violence than Christians do, and so they are naturally less tolerant of Muslims in their midst. As for the peaceful nature of Buddhism,\nThe Tale of Genji\n, written in the eighth century by Murasaki Shikibu, is rife with incidents of the much-feared Buddhist monks descending from their mountain monasteries to raid and pillage the villages below. And\nThe Tale of the Heike\n, compiled some 400 years later, tells of a massive battle between the imperial army and an army of Buddhist warrior monks.\nThe Heike split their forty thousand horsemen into two parties and swooped down on the fortifications at the two roads, uttering mighty war whoops. The monks were all unmounted men with forged weapons, but the court’s warriors were horsemen with bows and arrows, and they galloped after the monks in all directions, hitting every one of them with fast and furious barrages of arrow’s. The battle began with an arrow exchange during the hour of the hare and raged all day long. After nightfall, the positions on the two roads both went down in defeat.\nOne of the routed monks was Saka no Shiro Yokaku, a brave warrior who surpassed everyone in the seven great temples and fifteen great temples in swordsmanship, archery, and physical strength. He wore armor with black lacing over a corselet with green lacing, and his five-plated helmet was fitted over a metal cap. Holding in one hand a long, unlacquered spear, curved like cogon grass, and in the other a great sword with a lacquered hilt, he slashed his way out of the Tegai Gate at the Todaiji, surrounded by a dozen monks from his cloister. He held his ground for a time, scything horses’ legs and felling many opponents. But the waves of attacks from the court’s huge army cut down all his companions, leaving him alone with his back unprotected, and he fled toward the south, brave though he was.\nNow the battle was being fought in the dark. “Make a fire!” Shigchira ordered, standing in front of the gate at the Hannyaji Temple. One of the Heike warriors was a man named Tomokata, a functionary from the Fukui estate in Harima Province. This Tomokata promptly set a commoner’s house on fire, using a torch made from a broken shield. There was a strong wind blowing, as was usual enough for the season—it was late in the twelfth month, the night of the twenty-eighth—and the gusts spread the fire from the initial location to many different buildings in the temple precincts.\nThe battles at the Narazaka and Hannya roads had claimed the life of every monk who had feared disgrace and prized honor; and the others who could walk had fled toward Yoshino and Totsukawa. Aged monks unable to walk, eminent scholar-monks, pages, women, and children had fled helter-skelter into the Kofukuji, and also into the Great Buddha Hall, where more than a thousand had sought refuge on the second floor, with the ladders removed to save them from the pursuing enemy.  When the raging flames bore down on them, they uttered shrieks that seemingly could not have been surpassed by the sinners in the flames of the Tapana, Paritapana, and Avici hells….\nWhen the scribes made a careful record of those who had burned to death in the flames, the total amounted to more than three thousand five hundred people: more than seventeen hundred on the second floor of the Great Buddha Hall, more than eight hundred at the Kofukuji, more than five hundred in this temple building, more than three hundred in that. More than a thousand monks had been killed in battle. The victors hung a few heads in front of the gate at the Hannyaji and carried a few others back to the capital.\nOn the twenty-ninth, Shigehira returned to the capital, leaving Nara in ruins. Kiyomori greeted the outcome of the expedition with vindictive glee, but the empress, the two retired emperors, the regent, and everyone else lamented. “It might have been all right to get rid of the soldier-monks, but it was a terrible mistake to destroy the temples,” people said.\nThe original plan had been to parade the monks’ heads through the avenues, and to hang them on the trees in front of the jail, but the court refused to issue the necessary orders, appalled by the destruction of the Todaiji and the Kofu-kuji. The heads were discarded in gutters and ditches.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-12T18:45:22+00:00"
}