{
  "url": "https://voxday.net/2018/03/23/conservatives-have-had-it/",
  "scraped_at": "2025-12-19T20:54:04.326147",
  "title": "Conservatives have HAD IT",
  "date_display": "March 23, 2018",
  "date_iso": "2018-03-23T13:17:23+00:00",
  "date_from_url": "2018-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always so cute when conservatives discover the existence of the bi-factional ruling party and threaten to stop voting for Republicans. Jesse Kelly is <i>very </i>upset about the passage of the omnibus spending bill on Twitter:</p><blockquote><p>This is the first time I’ve thought the GOP will lose the House in the midterms. If Trump signs this #omnibus bill, we’re through. I suspect Trump does not realize how many people have tolerated his antics solely because he was doing conservative things.</p><p>Think about this: Obama gets elected in 08. Embarrasses himself and scares the American public into going HEAVY Republican for 6 straight years. We own everything.</p><p>Annnnnnd the GOP responds by doing all the same things Obama did. There is one party in DC. It’s the “screw the peasants” party. And I’ve had about enough of it. That’s all.</p></blockquote><p>First, who cares? Since Republicans are part of the bifactional ruling party, <a href=\"http://www.wnd.com/2007/10/44137/\">as I repeatedly observed </a>more than 10 years ago, why be at all concerned about them retaining power? I’m not. They are part of the problem, not the solution.</p><p>Second, perhaps Trump will veto the bill. He certainly should, although he may have more pressing concerns on his agenda at the moment.</p><p>Third, this is a conventional political analysis. It doesn’t even begin to account for the possible fallout from the God-Emperor’s ongoing war against the Deep State, which is the most significant factor by far. Due to the potential for tremendous and unexpected consequences from that, don’t put too much credence in the conventional analyses of the midterm elections.</p><p>Stay cool, stay calm, have confidence in the God-Emperor, and wait to see what happens. <a href=\"http://www.wnd.com/2018/03/will-the-deep-state-break-trump/\">The Deep State is trying to break him</a>. They may, but at this point, I think it is more likely that he will break them.</p><blockquote><p>Consider. To cut through the Russophobia rampant here, Trump decided to make a direct phone call to Vladimir Putin. And in that call, Trump, like Angela Merkel, congratulated Putin on his re-election victory.</p><p>Instantly, the briefing paper for the president’s call was leaked to the Post. In bold letters it read, “DO NOT CONGRATULATE.”</p><p>Whereupon, the Beltway went ballistic.</p><p>How could Trump congratulate Putin, whose election was a sham? Why did he not charge Putin with the Salisbury poisoning? Why did Trump not denounce Putin for interfering with “our democracy”?</p><p>Amazing. A disloyal White House staffer betrays his trust and leaks a confidential paper to sabotage the foreign policy of a duly elected president, and he is celebrated in this capital city.</p><p>If you wish to see the deep state at work, this is it: anti-Trump journalists using First Amendment immunities to collude with and cover up the identities of bureaucratic snakes out to damage or destroy a president they despise.</p></blockquote><p>UPDATE: There we go. Don’t consider, DO IT! This is not that hard. Build the Wall and Drain the Swamp. If it doesn’t do either of those things, veto it.</p><p><i>I am considering a VETO of the Omnibus Spending Bill based on the fact that the 800,000 plus DACA recipients have been totally abandoned by the Democrats (not even mentioned in Bill) and the BORDER WALL, which is desperately needed for our National Defense, is not fully funded. </i><br>– Donald J. Trump@realDonaldTrump</br></p></div>",
  "content_text": "It’s always so cute when conservatives discover the existence of the bi-factional ruling party and threaten to stop voting for Republicans. Jesse Kelly is\nvery\nupset about the passage of the omnibus spending bill on Twitter:\nThis is the first time I’ve thought the GOP will lose the House in the midterms. If Trump signs this #omnibus bill, we’re through. I suspect Trump does not realize how many people have tolerated his antics solely because he was doing conservative things.\nThink about this: Obama gets elected in 08. Embarrasses himself and scares the American public into going HEAVY Republican for 6 straight years. We own everything.\nAnnnnnnd the GOP responds by doing all the same things Obama did. There is one party in DC. It’s the “screw the peasants” party. And I’ve had about enough of it. That’s all.\nFirst, who cares? Since Republicans are part of the bifactional ruling party,\nas I repeatedly observed\nmore than 10 years ago, why be at all concerned about them retaining power? I’m not. They are part of the problem, not the solution.\nSecond, perhaps Trump will veto the bill. He certainly should, although he may have more pressing concerns on his agenda at the moment.\nThird, this is a conventional political analysis. It doesn’t even begin to account for the possible fallout from the God-Emperor’s ongoing war against the Deep State, which is the most significant factor by far. Due to the potential for tremendous and unexpected consequences from that, don’t put too much credence in the conventional analyses of the midterm elections.\nStay cool, stay calm, have confidence in the God-Emperor, and wait to see what happens.\nThe Deep State is trying to break him\n. They may, but at this point, I think it is more likely that he will break them.\nConsider. To cut through the Russophobia rampant here, Trump decided to make a direct phone call to Vladimir Putin. And in that call, Trump, like Angela Merkel, congratulated Putin on his re-election victory.\nInstantly, the briefing paper for the president’s call was leaked to the Post. In bold letters it read, “DO NOT CONGRATULATE.”\nWhereupon, the Beltway went ballistic.\nHow could Trump congratulate Putin, whose election was a sham? Why did he not charge Putin with the Salisbury poisoning? Why did Trump not denounce Putin for interfering with “our democracy”?\nAmazing. A disloyal White House staffer betrays his trust and leaks a confidential paper to sabotage the foreign policy of a duly elected president, and he is celebrated in this capital city.\nIf you wish to see the deep state at work, this is it: anti-Trump journalists using First Amendment immunities to collude with and cover up the identities of bureaucratic snakes out to damage or destroy a president they despise.\nUPDATE: There we go. Don’t consider, DO IT! This is not that hard. Build the Wall and Drain the Swamp. If it doesn’t do either of those things, veto it.\nI am considering a VETO of the Omnibus Spending Bill based on the fact that the 800,000 plus DACA recipients have been totally abandoned by the Democrats (not even mentioned in Bill) and the BORDER WALL, which is desperately needed for our National Defense, is not fully funded.\n– Donald J. Trump@realDonaldTrump",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-23T13:17:23+00:00"
}