{
  "url": "https://voxday.net/2018/03/09/corception/",
  "scraped_at": "2025-12-19T10:46:18.703900",
  "title": "Corception",
  "date_display": "March 9, 2018",
  "date_iso": "2018-03-09T09:52:29+00:00",
  "date_from_url": "2018-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last night at the Voxiversity Q&amp;A event, the discussion about a prospective Voxiversity on rhetoric and dialect revealed the need for a word to express the concept of something that is technically false but rhetorically true that tends to guide one towards the truth.</p><p>If you think about it, we use the term deception to indicate the opposite, when one expresses that which is technically true, but leads others into a false understanding. And to the extent we express the concept at all, we would probably resort to the oxymoronic and awkward construction “deceived into the truth.”</p><p>My first thought was to describe the concept as <i>inceit</i>, but the problem is that “inception” already has a fairly well-understood and unrelated meaning due to the popular movie. So, I landed upon the construction <i>corceit</i>, as it fits rather nicely with the etymology of the term “correct”.</p><p><i>1300-50; (v.) Middle English correcten (&lt; Anglo-French correcter) &lt; Latin corrēctus past participle of corrigere to make straight, equivalent to cor- cor- + reg- (stem of regere to direct ) + -tus past participle suffix; (adj.) (&lt; French correct) &lt; Latin, as above</i><br><i><br/></i>The reason the term is needed is because none of the similar terms accurately describe the concept.</br></p><blockquote class=\"tr_bq\"><p>A <i>correct </i>statement is one free from error, mistakes, or faults. An <i>accurate </i>statement is one that shows careful conformity to fact, truth, or spirit. A <i>precise </i>statement shows scrupulously strict and detailed conformity to fact.</p></blockquote><p>None of that is true in the case of what can be described as a <i>corceptive </i>statement or story, such as the parables told by Jesus Christ. That pointed to another possible approach to the concept with a term such as <i>parabole</i>, (which, interestingly enough, is a little closer to the concept in French than “parable” is in English) but again, “parabolic” has already been utilized for “having the form or outline of a parabola.”</p><p>Now, I am aware that many, if not most of you will completely fail to appreciate the point of this sort of thought exercise, but that’s fine. I happen to find it very useful to be able to identify and articulate specific concepts like this, even if it is only for my internal use. It helps me clarify my thoughts when I am contemplating questions like the morality of corceptive rhetoric vs deceptive dialectic. If it happens to be useful to anyone else, so much the better, but rest assured, I don’t expect anyone else to utilize my idiosyncratic constructions.</p></div>",
  "content_text": "Last night at the Voxiversity Q&A event, the discussion about a prospective Voxiversity on rhetoric and dialect revealed the need for a word to express the concept of something that is technically false but rhetorically true that tends to guide one towards the truth.\nIf you think about it, we use the term deception to indicate the opposite, when one expresses that which is technically true, but leads others into a false understanding. And to the extent we express the concept at all, we would probably resort to the oxymoronic and awkward construction “deceived into the truth.”\nMy first thought was to describe the concept as\ninceit\n, but the problem is that “inception” already has a fairly well-understood and unrelated meaning due to the popular movie. So, I landed upon the construction\ncorceit\n, as it fits rather nicely with the etymology of the term “correct”.\n1300-50; (v.) Middle English correcten (< Anglo-French correcter) < Latin corrēctus past participle of corrigere to make straight, equivalent to cor- cor- + reg- (stem of regere to direct ) + -tus past participle suffix; (adj.) (< French correct) < Latin, as above\nThe reason the term is needed is because none of the similar terms accurately describe the concept.\nA\ncorrect\nstatement is one free from error, mistakes, or faults. An\naccurate\nstatement is one that shows careful conformity to fact, truth, or spirit. A\nprecise\nstatement shows scrupulously strict and detailed conformity to fact.\nNone of that is true in the case of what can be described as a\ncorceptive\nstatement or story, such as the parables told by Jesus Christ. That pointed to another possible approach to the concept with a term such as\nparabole\n, (which, interestingly enough, is a little closer to the concept in French than “parable” is in English) but again, “parabolic” has already been utilized for “having the form or outline of a parabola.”\nNow, I am aware that many, if not most of you will completely fail to appreciate the point of this sort of thought exercise, but that’s fine. I happen to find it very useful to be able to identify and articulate specific concepts like this, even if it is only for my internal use. It helps me clarify my thoughts when I am contemplating questions like the morality of corceptive rhetoric vs deceptive dialectic. If it happens to be useful to anyone else, so much the better, but rest assured, I don’t expect anyone else to utilize my idiosyncratic constructions.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-09T09:52:29+00:00"
}