{
  "url": "https://voxday.net/2018/03/27/david-hogg-crisis-actor-forgets-his-lines-2/",
  "scraped_at": "2025-12-19T20:54:41.952631",
  "title": "David Hogg, Crisis Actor, forgets his lines",
  "date_display": "March 27, 2018",
  "date_iso": "2018-03-27T10:04:55+00:00",
  "date_from_url": "2018-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That sound you heard was the sound of the media’s narrative balloon popping. It turns out that David “Camera” Hogg, who totally is not a crisis actor and absolutely does not play <a href=\"https://silenceisconsent.net/cbs-news-bombshell-marjory-douglas-student-leader-wasnt-at-school-on-day-of-the-mass-shooting-video/\">a student who survived a mass shooting at his school</a> in Florida:</p><p><b><a href=\"https://archive.fo/PJ4z5\">First take:</a> </b><i>On the day of the shooting, I got my camera and got on my bike and rode as fast as I could three miles from my house to the school to get as much video and to get as many interviews as I could because I knew that this could not be another mass shooting.</i></p><p><b><a href=\"https://archive.fo/epjyv\">Second take:</a> </b><i>When Hogg heard a “pop” while sitting in an AP environmental science class around 2:30 p.m. Wednesday, he told his teacher it sounded strangely like a gunshot. But there had been a fire drill that very morning and talk of a “Code Red” exercise to prepare for an active shooter. This must just be a surprise drill, he reasoned. And then the fire alarm sounded. Dutifully acting on it, Hogg and other students tried to exit the building. A janitor—Hogg doesn’t know his name but calls him an angel—knew where the shots were coming from and sent the students back. Then a culinary arts teacher, Ashley Kurth, pulled Hogg and others inside, locked the door, and made them hide in a closet. Checking Twitter and Instagram, Hogg—who’s an editor at the school’s TV station—found the news that the shooting was real and ongoing.</i><br><i><br/></i>When Camera Hogg says that he isn’t a crisis actor, it’s entirely possible that he’s telling the truth. Because he is so haplessly bad at it that it wouldn’t surprise me if he’s been fired from the job.</br></p><p>Face it, the whole thing is fake. Again. The Parkland drama was just another obvious false flag meant to drum up public support for gun control, complete with fake survivors who weren’t even on the scene at the time. That’s why Big Social and the mainstream media reacted so strongly to the correct observations that these kids are fakes and crisis actors, because they are desperate to retain their ability to create a false narrative.</p><p>UPDATE: <a href=\"https://pbs.twimg.com/media/DZQW1fUVQAMxlAq.jpg\">The full transcript</a> has Hogg claiming to have been at the school, going home, then going back again in order to film and perform for the cameras. Of course, we have not actually been presented with any evidence of his actually having been there earlier. And more importantly, if Hogg went home and got his camera AFTER the shooting, then how did he have it in the closet DURING the shooting.</p><p>As I always point out after these staged TV dramas, the one thing we absolutely know did not happen is whatever the media’s current Official Story is. If you’re dubious about this, if you actually take their reports at face value, allow me to direct your attention to the recent news that the father of the Pulse shooter was <a href=\"http://voxday.blogspot.com/2018/03/pol-is-always-right.html\">an FBI informant for 11 years</a>. Are you noticing the pattern yet?</p></div>",
  "content_text": "That sound you heard was the sound of the media’s narrative balloon popping. It turns out that David “Camera” Hogg, who totally is not a crisis actor and absolutely does not play\na student who survived a mass shooting at his school\nin Florida:\nFirst take:\nOn the day of the shooting, I got my camera and got on my bike and rode as fast as I could three miles from my house to the school to get as much video and to get as many interviews as I could because I knew that this could not be another mass shooting.\nSecond take:\nWhen Hogg heard a “pop” while sitting in an AP environmental science class around 2:30 p.m. Wednesday, he told his teacher it sounded strangely like a gunshot. But there had been a fire drill that very morning and talk of a “Code Red” exercise to prepare for an active shooter. This must just be a surprise drill, he reasoned. And then the fire alarm sounded. Dutifully acting on it, Hogg and other students tried to exit the building. A janitor—Hogg doesn’t know his name but calls him an angel—knew where the shots were coming from and sent the students back. Then a culinary arts teacher, Ashley Kurth, pulled Hogg and others inside, locked the door, and made them hide in a closet. Checking Twitter and Instagram, Hogg—who’s an editor at the school’s TV station—found the news that the shooting was real and ongoing.\nWhen Camera Hogg says that he isn’t a crisis actor, it’s entirely possible that he’s telling the truth. Because he is so haplessly bad at it that it wouldn’t surprise me if he’s been fired from the job.\nFace it, the whole thing is fake. Again. The Parkland drama was just another obvious false flag meant to drum up public support for gun control, complete with fake survivors who weren’t even on the scene at the time. That’s why Big Social and the mainstream media reacted so strongly to the correct observations that these kids are fakes and crisis actors, because they are desperate to retain their ability to create a false narrative.\nUPDATE:\nThe full transcript\nhas Hogg claiming to have been at the school, going home, then going back again in order to film and perform for the cameras. Of course, we have not actually been presented with any evidence of his actually having been there earlier. And more importantly, if Hogg went home and got his camera AFTER the shooting, then how did he have it in the closet DURING the shooting.\nAs I always point out after these staged TV dramas, the one thing we absolutely know did not happen is whatever the media’s current Official Story is. If you’re dubious about this, if you actually take their reports at face value, allow me to direct your attention to the recent news that the father of the Pulse shooter was\nan FBI informant for 11 years\n. Are you noticing the pattern yet?",
  "tags": [
    "guncontrol"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-27T09:04:55+00:00"
}