{
  "url": "https://voxday.net/2018/03/19/facebook-failure-or-fraud/",
  "scraped_at": "2025-12-19T20:53:15.433881",
  "title": "Facebook: failure or fraud?",
  "date_display": "March 19, 2018",
  "date_iso": "2018-03-19T13:55:03+00:00",
  "date_from_url": "2018-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating to see that after all the ways that Big Social is spying on everyone, what has the media in an uproar is the belated realization that a sword can always cut two ways. They didn’t mind when they knew it was the Obama, Hillary, and the SJW-converged corporations that were data-mining, but now that they realize the Right – and in particular, Steve Bannon and Donald Trump – can and have done exactly the same thing, <a href=\"https://www.cnbc.com/2018/03/18/facebook-failing-zuckerberg-and-sandberg-absent-commentary.html\">they suddenly have reservations</a> about the wisdom of letting organizations have access to that level of data.</p><blockquote><p>Facebook is facing an existential test, and its leadership is failing to address it.</p><p>Good leaders admit mistakes, apologize quickly, show up where they’re needed and show their belief in the company by keeping skin in the game.</p><p>Facebook executives, in contrast, react to negative news with spin and attempts to bury it. Throughout the last year, every time bad news has broken, executives have downplayed its significance. Look at its public statements last year about how many people had seen Russian-bought election ads — first it was 10 million, then it was 126 million.</p><p>Top execs dodged Congress when it was asking questions about Russian interference. They are selling their shares at a record clip.</p><p>The actions of Facebook execs now recall how execs at Nokia and Blackberry reacted after the iPhone emerged. Their revenues kept growing for a couple years — and they dismissed the threats. By the time users started leaving in droves, it was too late.</p><p>There’s no outside attacker bringing Facebook down. It’s a circular firing squad that stems from the company’s fundamental business model of collecting data from users, and using that data to sell targeted ads. For years, users went along with the bargain. But after almost a year of constant negative publicity, their patience may be waning.</p><p>Facebook did not initially respond to questions or a request for comment from CNBC.</p></blockquote><p>Here is a less generous theory. We know that Facebook was being propped up by the CIA from the start. But the CIA is now under the control of the God-Emperor. Which means that a) Facebook’s dirty laundry is more likely to come out, and, b) Facebook is not going to be financially propped up the way it has been from the very beginning.</p><p>Which, of course, raises the interesting question about whether it ever was a viable business at all. Or even a legal one.</p><blockquote><p>Facebook may face more legal trouble than you might think in the wake of Cambridge Analytica’s large-scale data harvesting. Former US officials David Vladeck and Jessica Rich have told the Washington Post that Facebook’s data sharing may violate the FTC consent decree requiring that it both ask for permission before sharing data and report any authorized access. The “Thisisyourdigitallife” app at the heart of the affair asked for permission from those who directly used it, but not the millions of Facebook friends whose data was taken in the process.</p><p>If the FTC did find violations, Facebook could be on the hook for some very hefty fines — albeit fines that aren’t likely to be as hefty as possible. The decree asks for fines as large as $40,000 per person, but that would amount to roughly $2 trillion. Regulators like the FTC historically push for fines they know companies can pay, which would suggest fines that are ‘just’ in the billion-dollar range. Given that there are already multiple American and European investigations underway, any financial penalty would be just one piece of a larger puzzle.</p></blockquote><p>Would you not just <i>love </i>to see Facebook hit with a $2 trillion fine?</p></div>",
  "content_text": "It’s fascinating to see that after all the ways that Big Social is spying on everyone, what has the media in an uproar is the belated realization that a sword can always cut two ways. They didn’t mind when they knew it was the Obama, Hillary, and the SJW-converged corporations that were data-mining, but now that they realize the Right – and in particular, Steve Bannon and Donald Trump – can and have done exactly the same thing,\nthey suddenly have reservations\nabout the wisdom of letting organizations have access to that level of data.\nFacebook is facing an existential test, and its leadership is failing to address it.\nGood leaders admit mistakes, apologize quickly, show up where they’re needed and show their belief in the company by keeping skin in the game.\nFacebook executives, in contrast, react to negative news with spin and attempts to bury it. Throughout the last year, every time bad news has broken, executives have downplayed its significance. Look at its public statements last year about how many people had seen Russian-bought election ads — first it was 10 million, then it was 126 million.\nTop execs dodged Congress when it was asking questions about Russian interference. They are selling their shares at a record clip.\nThe actions of Facebook execs now recall how execs at Nokia and Blackberry reacted after the iPhone emerged. Their revenues kept growing for a couple years — and they dismissed the threats. By the time users started leaving in droves, it was too late.\nThere’s no outside attacker bringing Facebook down. It’s a circular firing squad that stems from the company’s fundamental business model of collecting data from users, and using that data to sell targeted ads. For years, users went along with the bargain. But after almost a year of constant negative publicity, their patience may be waning.\nFacebook did not initially respond to questions or a request for comment from CNBC.\nHere is a less generous theory. We know that Facebook was being propped up by the CIA from the start. But the CIA is now under the control of the God-Emperor. Which means that a) Facebook’s dirty laundry is more likely to come out, and, b) Facebook is not going to be financially propped up the way it has been from the very beginning.\nWhich, of course, raises the interesting question about whether it ever was a viable business at all. Or even a legal one.\nFacebook may face more legal trouble than you might think in the wake of Cambridge Analytica’s large-scale data harvesting. Former US officials David Vladeck and Jessica Rich have told the Washington Post that Facebook’s data sharing may violate the FTC consent decree requiring that it both ask for permission before sharing data and report any authorized access. The “Thisisyourdigitallife” app at the heart of the affair asked for permission from those who directly used it, but not the millions of Facebook friends whose data was taken in the process.\nIf the FTC did find violations, Facebook could be on the hook for some very hefty fines — albeit fines that aren’t likely to be as hefty as possible. The decree asks for fines as large as $40,000 per person, but that would amount to roughly $2 trillion. Regulators like the FTC historically push for fines they know companies can pay, which would suggest fines that are ‘just’ in the billion-dollar range. Given that there are already multiple American and European investigations underway, any financial penalty would be just one piece of a larger puzzle.\nWould you not just\nlove\nto see Facebook hit with a $2 trillion fine?",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-19T13:55:03+00:00"
}