{
  "url": "https://voxday.net/2018/03/05/hes-no-jack-ward/",
  "scraped_at": "2025-12-19T10:45:54.805805",
  "title": "He’s no Jack Ward",
  "date_display": "March 5, 2018",
  "date_iso": "2018-03-05T19:22:23+00:00",
  "date_from_url": "2018-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I do not stand with Jack Burroughs, <a href=\"http://voxday.blogspot.ch/2018/03/stop-fighting-on-their-ground.html#c8826660500527028572\">whose thinking demonstrates</a> why conservatives reliably lose:</p><blockquote><p>The Left’s assault on Free Speech in the US–outside of the Universities–has really only just begun. Most of the public recoils from these repressive excesses. At present, the Right has the considerable political virtue of being pro-free speech. That is a powerful moral and political weapon against the Left. It is an important reason why the ranks of the Right are growing.</p><p>But if you try to fight fire with fire by arguing that since the Left does censors speech, we should do it, too, then you have sacrificed the moral high ground in the eyes of the broad public. The Right will then be no better on this defining issue than the Left, and will have given up one of the main reasons why fast growing numbers of people prefer the Right to the Left.</p><p>If the Right becomes hostile to free speech, then it will drastically weaken its moral standing in the eyes of the broad public, thereby diminishing its political appeal.</p></blockquote><p>Every bad argument has its roots in false foundations. Can you identify the false foundations here?</p><p>It’s amusing that he thinks “moral standing” is relevant in a political environment in which basic, fundamental concepts such as “male” and “illegal” are treated as variable, and traditional definitions are designated as outdated and immoral. It’s understandable, though just as incorrect, to claim that free speech is a moral issue. It is not. In fact, the pro-blasphemy position is actually the observably <i>immoral </i>position.</p><p>But his biggest mistake is to claim that “the moral high ground” is why one side wins. This is simply more conservative posturing that reliably leads them into disaster. The center is not abandoning the Left because the Left has abandoned a moral high ground that it never held, it is being abandoned by a Left that moves ever deeper into madness.</p><p>Those who believe in a path to victory through “the moral high ground” inevitably find themselves outflanked by those who are willing to surrender even more nobly. That is why no successful strategist in history has ever designed a strategy that relies upon moral posturing. And appealing to the moral sense of an immoral people whose morality is constantly in flux is neither a rational strategy nor a winning one.</p><p>Listening to a conservative <a href=\"http://voxday.blogspot.ch/2018/03/stop-fighting-on-their-ground.html#c662318122740981899\">talk about strategy</a> is like listening to a blind man’s advice on how to drive a Formula One race car. They are reliable counter indicators.</p><blockquote><p><i>“In terms of speech, the Left would reword it: “Say what thou wilt.” And to preserve their natural right to expression–whether it’s pornography, vulgarity, blatant or tongue-in-cheek anti-Christian propaganda–the Left has enacted the Strange Doctrine, happily bludgeoning their enemies on the Right, and this has been going on for quite some time.”</i></p><p>Hey, let’s just censor them, then. Why the hell not?</p><p>It’s only going to make the Right much less popular, because it will needlessly sacrifice one of the main positive values that increasingly differentiates the Right from the Left in the public mind.</p><p>But when you have people out there who are saying whatever they want–including many mean things about the Right, and even about Christians–it’s obviously far more important to shut them down than it is to prevail politically over the long term.</p><p>Let’s just do to them what they do to us, without any consideration of the strategic consequences at all.</p></blockquote><p>We already know what the strategic consequences of relying on the moral high ground are, which is decades of consistent defeat. Not only have we considered the strategic consequences, we have done so and we have found the conservative strategy of “hold the moral high ground and win” to be entirely wanting.</p></div>",
  "content_text": "I do not stand with Jack Burroughs,\nwhose thinking demonstrates\nwhy conservatives reliably lose:\nThe Left’s assault on Free Speech in the US–outside of the Universities–has really only just begun. Most of the public recoils from these repressive excesses. At present, the Right has the considerable political virtue of being pro-free speech. That is a powerful moral and political weapon against the Left. It is an important reason why the ranks of the Right are growing.\nBut if you try to fight fire with fire by arguing that since the Left does censors speech, we should do it, too, then you have sacrificed the moral high ground in the eyes of the broad public. The Right will then be no better on this defining issue than the Left, and will have given up one of the main reasons why fast growing numbers of people prefer the Right to the Left.\nIf the Right becomes hostile to free speech, then it will drastically weaken its moral standing in the eyes of the broad public, thereby diminishing its political appeal.\nEvery bad argument has its roots in false foundations. Can you identify the false foundations here?\nIt’s amusing that he thinks “moral standing” is relevant in a political environment in which basic, fundamental concepts such as “male” and “illegal” are treated as variable, and traditional definitions are designated as outdated and immoral. It’s understandable, though just as incorrect, to claim that free speech is a moral issue. It is not. In fact, the pro-blasphemy position is actually the observably\nimmoral\nposition.\nBut his biggest mistake is to claim that “the moral high ground” is why one side wins. This is simply more conservative posturing that reliably leads them into disaster. The center is not abandoning the Left because the Left has abandoned a moral high ground that it never held, it is being abandoned by a Left that moves ever deeper into madness.\nThose who believe in a path to victory through “the moral high ground” inevitably find themselves outflanked by those who are willing to surrender even more nobly. That is why no successful strategist in history has ever designed a strategy that relies upon moral posturing. And appealing to the moral sense of an immoral people whose morality is constantly in flux is neither a rational strategy nor a winning one.\nListening to a conservative\ntalk about strategy\nis like listening to a blind man’s advice on how to drive a Formula One race car. They are reliable counter indicators.\n“In terms of speech, the Left would reword it: “Say what thou wilt.” And to preserve their natural right to expression–whether it’s pornography, vulgarity, blatant or tongue-in-cheek anti-Christian propaganda–the Left has enacted the Strange Doctrine, happily bludgeoning their enemies on the Right, and this has been going on for quite some time.”\nHey, let’s just censor them, then. Why the hell not?\nIt’s only going to make the Right much less popular, because it will needlessly sacrifice one of the main positive values that increasingly differentiates the Right from the Left in the public mind.\nBut when you have people out there who are saying whatever they want–including many mean things about the Right, and even about Christians–it’s obviously far more important to shut them down than it is to prevail politically over the long term.\nLet’s just do to them what they do to us, without any consideration of the strategic consequences at all.\nWe already know what the strategic consequences of relying on the moral high ground are, which is decades of consistent defeat. Not only have we considered the strategic consequences, we have done so and we have found the conservative strategy of “hold the moral high ground and win” to be entirely wanting.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-05T19:22:23+00:00"
}