{
  "url": "https://voxday.net/2018/03/14/how-the-big-three-ruined-comics/",
  "scraped_at": "2025-12-19T20:52:40.365543",
  "title": "How the Big Three ruined comics",
  "date_display": "March 14, 2018",
  "date_iso": "2018-03-14T16:27:04+00:00",
  "date_from_url": "2018-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My observation is that the combination of a) a distribution monopoly and b) SJW editors and content are the primary culprits for the ongoing collapse of the comics industry, which is on track to decline as much as 20 PERCENT in units this year. In corporate terms, that’s practically free fall.</p><p>However, Arkhaven writer Jon Del Arroz declares at Castalia House <a href=\"http://www.castaliahouse.com/guest-post-how-alan-moore-neil-gaiman-and-frank-miller-ruined-comics-by-jon-del-arroz/\">there are other content-related problems</a> that merit mention, and lays the blame at the feet of three of the more influential comics writers of the last 30 years.</p><blockquote><p>The industry has three major problems in its storytelling, which each one of these works exemplifies in three ways:</p><p><b>A focus on realism in a medium that by definition is absurd.</b> Alan Moore’s Watchmen is what brought this on. The whole point of the book was to show real heroes growing old, having problems, being corrupt and dealing with real world issues and relationships – and by “real world” of course we mean a debaucherous romp of sex, drugs and violence, which no one relates to. Modern writers want to switch all their characters to this realism feel, which makes no sense when you have Asgardian gods who magically transform at the picking up of a hammer, or a nerd clinging to walls and swinging from rooftops. Realism has no place in such stories, and it’s painful to read boring stories about The Visions sitting at home pretending to eat meals even though they’re robots.</p><p><b>An obsession with rebooting mythology. </b>This is Neil Gaiman’s hallmark. He’s made an entire career out of rebooting. If you look at Sandman, he takes classic mythological figures, imports them into a punk rock/goth 80s world and turns it into a weird horror story. When he worked for Marvel briefly, he rebooted Marvel as if the heroes had been born in the 1600s. American Gods, his novel, is about rebooting mythology again. His formula is obvious. It’s all he does, and it’s all DC and Marvel do now. It’s not selling? Let’s reboot Superman again with an all new #1. That’ll sell for the gimmick collector for a minute, but then when you degrade into the same, tired, unoriginal realism in storytelling, the sales plummet again. No one wants to read the revamped origin story for the umpteenth time, this time it’s the definitive, real version! The original worked just fine and remain in our memories, not the reboots.</p><p><b>Striving to be darker for shock value. </b>This is where Frank Miller changed the game, and for the worse. Everything is gore. Everything is awful, dark, terrible. Characters are dying, whether it be from street thugs or from AIDS, everyone’s life is in the pits and sucks. The streets of New York or Gotham are pure cesspools of no hope, and pure grit. He paved the way for writers like Garth Ennis or Mark Millar to try to one up that grittiness, or Ed Brubaker to turn an optimistic character Captain America into some depressing, dark story with his Winter Soldier storyline. Guess what? You’ve just made sure every parent in America doesn’t buy these books because they know they’re not appropriate images for their kids to see, thereby turning off an entire generation of customers from getting attached to these works.</p><p>The three points above all are dangerous paths for lesser writers to tread, and do lead to even greater problems when EVERY story becomes a combination of these tropes, which is what we have in modern comics.</p></blockquote><p>Jon isn’t just a critic, though. He’s putting his pen where his mouth is by translating Richard Fox’s popular <i>Ember War</i> series into comics that will be published later this year by Arkhaven. Check out <a href=\"http://forum.altherocomics.com/viewtopic.php?f=28&amp;t=46&amp;sid=bd1b4463b61e830c93a894ab6c77dbad\">the first two preview pages</a> at the Arkhaven forums.</p></div>",
  "content_text": "My observation is that the combination of a) a distribution monopoly and b) SJW editors and content are the primary culprits for the ongoing collapse of the comics industry, which is on track to decline as much as 20 PERCENT in units this year. In corporate terms, that’s practically free fall.\nHowever, Arkhaven writer Jon Del Arroz declares at Castalia House\nthere are other content-related problems\nthat merit mention, and lays the blame at the feet of three of the more influential comics writers of the last 30 years.\nThe industry has three major problems in its storytelling, which each one of these works exemplifies in three ways:\nA focus on realism in a medium that by definition is absurd.\nAlan Moore’s Watchmen is what brought this on. The whole point of the book was to show real heroes growing old, having problems, being corrupt and dealing with real world issues and relationships – and by “real world” of course we mean a debaucherous romp of sex, drugs and violence, which no one relates to. Modern writers want to switch all their characters to this realism feel, which makes no sense when you have Asgardian gods who magically transform at the picking up of a hammer, or a nerd clinging to walls and swinging from rooftops. Realism has no place in such stories, and it’s painful to read boring stories about The Visions sitting at home pretending to eat meals even though they’re robots.\nAn obsession with rebooting mythology.\nThis is Neil Gaiman’s hallmark. He’s made an entire career out of rebooting. If you look at Sandman, he takes classic mythological figures, imports them into a punk rock/goth 80s world and turns it into a weird horror story. When he worked for Marvel briefly, he rebooted Marvel as if the heroes had been born in the 1600s. American Gods, his novel, is about rebooting mythology again. His formula is obvious. It’s all he does, and it’s all DC and Marvel do now. It’s not selling? Let’s reboot Superman again with an all new #1. That’ll sell for the gimmick collector for a minute, but then when you degrade into the same, tired, unoriginal realism in storytelling, the sales plummet again. No one wants to read the revamped origin story for the umpteenth time, this time it’s the definitive, real version! The original worked just fine and remain in our memories, not the reboots.\nStriving to be darker for shock value.\nThis is where Frank Miller changed the game, and for the worse. Everything is gore. Everything is awful, dark, terrible. Characters are dying, whether it be from street thugs or from AIDS, everyone’s life is in the pits and sucks. The streets of New York or Gotham are pure cesspools of no hope, and pure grit. He paved the way for writers like Garth Ennis or Mark Millar to try to one up that grittiness, or Ed Brubaker to turn an optimistic character Captain America into some depressing, dark story with his Winter Soldier storyline. Guess what? You’ve just made sure every parent in America doesn’t buy these books because they know they’re not appropriate images for their kids to see, thereby turning off an entire generation of customers from getting attached to these works.\nThe three points above all are dangerous paths for lesser writers to tread, and do lead to even greater problems when EVERY story becomes a combination of these tropes, which is what we have in modern comics.\nJon isn’t just a critic, though. He’s putting his pen where his mouth is by translating Richard Fox’s popular\nEmber War\nseries into comics that will be published later this year by Arkhaven. Check out\nthe first two preview pages\nat the Arkhaven forums.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-14T16:27:04+00:00"
}