{
  "url": "https://voxday.net/2018/03/04/i-seldom-agree-with-socialists/",
  "scraped_at": "2025-12-19T10:45:42.966346",
  "title": "I seldom agree with socialists",
  "date_display": "March 4, 2018",
  "date_iso": "2018-03-04T00:23:03+00:00",
  "date_from_url": "2018-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But I agree with this one, <a href=\"https://archive.fo/XMQEq\">on this one issue</a>:</p><blockquote><p>Mr. Kühnert, who at 28 runs the youth wing of Germany’s center-left Social Democratic Party, has been touring the country to convince fellow party members to vote down a coalition deal that would keep Ms. Merkel in power for another four years — and his own party in place as the junior partner to her Christian Democrats.</p><p>Three months ago, few people had heard of Mr. Kühnert. Now, his boyish face with its rebellious cowlick is ubiquitous. He is a regular on prime time talk shows and routinely described as a rising star of German politics.</p><p>But he is also an enfant terrible for Europe’s political elites, who breathed a sigh of relief when Ms. Merkel announced last month that she had secured a governing deal, seemingly ending five months of political limbo in Europe’s most important capital.</p><p>But that left one major obstacle, and partly because of Mr. Kühnert’s spirited campaign it has been growing taller by the day: The grass roots of the Social Democracts still need to approve the deal.</p><p>The result of the vote will be announced Sunday. If the 463,000 members reject the coalition, Germany faces the prospect of an unstable minority government or new elections or both. In any case, it would likely spell the end of the Merkel era.</p></blockquote><p><i>Merkel müss weg</i>, as they say in Germany. At this point, she’s only the second-worst Reichskanzler the Germans have ever known. But give her more time, and she might manage to accomplish what even Caesar, Stalin, and Hitler failed to do.</p><p>No matter what your ideology is, no matter what your political instincts are, stopping a politician who is hell-bent on destroying your nation by turning the country over to immigrants should always be the first political priority.</p><p>It was interesting to watch <i>The Godfather II</i> recently, given the way it can be not unreasonably viewed as an extended lesson in the way immigrants, even intelligent, hard-working immigrants who bravely serve their new country’s military, can corrupt a nation from the bottom to the very top.</p></div>",
  "content_text": "But I agree with this one,\non this one issue\n:\nMr. Kühnert, who at 28 runs the youth wing of Germany’s center-left Social Democratic Party, has been touring the country to convince fellow party members to vote down a coalition deal that would keep Ms. Merkel in power for another four years — and his own party in place as the junior partner to her Christian Democrats.\nThree months ago, few people had heard of Mr. Kühnert. Now, his boyish face with its rebellious cowlick is ubiquitous. He is a regular on prime time talk shows and routinely described as a rising star of German politics.\nBut he is also an enfant terrible for Europe’s political elites, who breathed a sigh of relief when Ms. Merkel announced last month that she had secured a governing deal, seemingly ending five months of political limbo in Europe’s most important capital.\nBut that left one major obstacle, and partly because of Mr. Kühnert’s spirited campaign it has been growing taller by the day: The grass roots of the Social Democracts still need to approve the deal.\nThe result of the vote will be announced Sunday. If the 463,000 members reject the coalition, Germany faces the prospect of an unstable minority government or new elections or both. In any case, it would likely spell the end of the Merkel era.\nMerkel müss weg\n, as they say in Germany. At this point, she’s only the second-worst Reichskanzler the Germans have ever known. But give her more time, and she might manage to accomplish what even Caesar, Stalin, and Hitler failed to do.\nNo matter what your ideology is, no matter what your political instincts are, stopping a politician who is hell-bent on destroying your nation by turning the country over to immigrants should always be the first political priority.\nIt was interesting to watch\nThe Godfather II\nrecently, given the way it can be not unreasonably viewed as an extended lesson in the way immigrants, even intelligent, hard-working immigrants who bravely serve their new country’s military, can corrupt a nation from the bottom to the very top.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-04T00:23:03+00:00"
}