{
  "url": "https://voxday.net/2018/03/20/no-travel-for-sjws/",
  "scraped_at": "2025-12-19T20:53:28.422417",
  "title": "No travel for SJWs",
  "date_display": "March 20, 2018",
  "date_iso": "2018-03-20T10:13:35+00:00",
  "date_from_url": "2018-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>China unveils <a href=\"https://www.independent.co.uk/news/world/asia/china-social-credit-barred-flights-trains-president-xi-jinping-national-development-reform-a8260941.html\">the next step in Big Social</a>:</p><blockquote><p>China said it will begin applying its so-called social credit system to flights and trains and stop people who have committed misdeeds from taking such transport for up to a year.</p><p>People who would be put on the restricted lists included those found to have committed acts like spreading false information about terrorism and causing trouble on flights, as well as those who used expired tickets or smoked on trains, according to two statements issued on the National Development and Reform Commission’s website on Friday.</p><p>Those found to have committed financial wrongdoings, such as employers who failed to pay social insurance or people who have failed to pay fines, would also face these restrictions, said the statements which were dated 2 March.</p><p>The move is in line with President’s Xi Jinping’s plan to construct a social credit system based on the principle of “once untrustworthy, always restricted,” said one of the notices which was signed by eight ministries, including the country’s aviation regulator and the Supreme People’s Court.</p><p>China has flagged plans to roll out a system that will allow government bodies to share information on its citizens’ trustworthiness and issue penalties based on a so-called social credit score.</p></blockquote><p>This is a brilliant application of what Big Social is doing, only instead of allowing the hand-picked SJWs of the Twitter Trust and Safety Council or the Facebook-endorsed SPLC to do the restricting, the Chinese government will do it. And why not? The basic principle has been established and broadly accepted, from Twitter to the Her Majesty’s Government. As Q said, “why are trips allowed?”</p><p>Imagine if the God-Emperor and his Grand Inquisitor were to launch a similar program in the United States. After all, who has proven themselves more untrustworthy than Facebook? How could the SJWs legitimately complain if Mark Zuckerberg and his executives found themselves placed under permanent restriction? This principle of “once untrustworthy, always restricted” is merely an adaptation of Facebook’s own approach to banning thoughtcrime and legally controlling the public discourse, and it represents a welcome return to pre-Enlightenment philosophy on the part of a people who were always rightly dubious about it being genuine. There can be no “freedom of speech” in any non-Western, non-Christian, non-American society, because the concept <i>doesn’t even make sense</i> in any other context.</p><p>If you wanted to keep what passed for free speech in America, then you shouldn’t have permitted entry to Catholics and Jews, followed by wave after wave of various peoples whose beliefs and cultural traditions are entirely antithetical to the concept. And given those waves of immigration, you can’t be surprised that it’s no longer even possible to publicly state that a man is not a woman without negative legal and social and employment and financial consequences.</p><p>The devil, of course, is in the definitions. But the devil is out. Let’s not shed too many tears for the SJWs once they discover the difference between “influence” and “power”, for as another Chinese leader once said, “power comes from the barrel of a gun”.  It does not come from control of a momentarily popular software application.</p></div>",
  "content_text": "China unveils\nthe next step in Big Social\n:\nChina said it will begin applying its so-called social credit system to flights and trains and stop people who have committed misdeeds from taking such transport for up to a year.\nPeople who would be put on the restricted lists included those found to have committed acts like spreading false information about terrorism and causing trouble on flights, as well as those who used expired tickets or smoked on trains, according to two statements issued on the National Development and Reform Commission’s website on Friday.\nThose found to have committed financial wrongdoings, such as employers who failed to pay social insurance or people who have failed to pay fines, would also face these restrictions, said the statements which were dated 2 March.\nThe move is in line with President’s Xi Jinping’s plan to construct a social credit system based on the principle of “once untrustworthy, always restricted,” said one of the notices which was signed by eight ministries, including the country’s aviation regulator and the Supreme People’s Court.\nChina has flagged plans to roll out a system that will allow government bodies to share information on its citizens’ trustworthiness and issue penalties based on a so-called social credit score.\nThis is a brilliant application of what Big Social is doing, only instead of allowing the hand-picked SJWs of the Twitter Trust and Safety Council or the Facebook-endorsed SPLC to do the restricting, the Chinese government will do it. And why not? The basic principle has been established and broadly accepted, from Twitter to the Her Majesty’s Government. As Q said, “why are trips allowed?”\nImagine if the God-Emperor and his Grand Inquisitor were to launch a similar program in the United States. After all, who has proven themselves more untrustworthy than Facebook? How could the SJWs legitimately complain if Mark Zuckerberg and his executives found themselves placed under permanent restriction? This principle of “once untrustworthy, always restricted” is merely an adaptation of Facebook’s own approach to banning thoughtcrime and legally controlling the public discourse, and it represents a welcome return to pre-Enlightenment philosophy on the part of a people who were always rightly dubious about it being genuine. There can be no “freedom of speech” in any non-Western, non-Christian, non-American society, because the concept\ndoesn’t even make sense\nin any other context.\nIf you wanted to keep what passed for free speech in America, then you shouldn’t have permitted entry to Catholics and Jews, followed by wave after wave of various peoples whose beliefs and cultural traditions are entirely antithetical to the concept. And given those waves of immigration, you can’t be surprised that it’s no longer even possible to publicly state that a man is not a woman without negative legal and social and employment and financial consequences.\nThe devil, of course, is in the definitions. But the devil is out. Let’s not shed too many tears for the SJWs once they discover the difference between “influence” and “power”, for as another Chinese leader once said, “power comes from the barrel of a gun”.  It does not come from control of a momentarily popular software application.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-20T10:13:35+00:00"
}