{
  "url": "https://voxday.net/2018/03/11/ostracized-together/",
  "scraped_at": "2025-12-19T10:46:29.049599",
  "title": "Ostracized together",
  "date_display": "March 11, 2018",
  "date_iso": "2018-03-11T01:51:18+00:00",
  "date_from_url": "2018-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Taleb’s <i>Skin in the Game</i> is one of the best books I have read in some time. I’ll be doing a Voxiversity review of it in the future, but in the meantime, I thought that this observation from <i>Fooled by Randomness</i> was apt, in light of the participative legion of evil we have operating here. Some call it a fan club, others call it a cult, but I think “school of thought” is probably the most accurate description.</p><blockquote class=\"tr_bq\"><p>It may be a banality that we need others for many things, but we need them far more than we realize, particularly for dignity and respect. Indeed, we have very few historical records of people who have achieved anything extraordinary without such peer validation—but we have the freedom to choose our peers. If we look at the history of ideas, we see schools of thought occasionally forming, producing unusual work unpopular outside the school. You hear about the Stoics, the Academic Skeptics, the Cynics, the Pyrrhonian Skeptics, the Essenes, the Surrealists, the Dadaists, the anarchists, the hippies, the fundamentalists. A school allows someone with unusual ideas with the remote possibility of a payoff to find company and create a microcosm insulated from others. The members of the group can be ostracized together—which is better than being ostracized alone. If you engage in a Black Swan–dependent activity, it is better to be part of a group.</p></blockquote><p>As I was reading this, it occurred to me that an easy way for people who would like to get involved  somehow but don’t have much time to do so in a very time-efficient manner is <a href=\"http://forum.altherocomics.com/viewtopic.php?f=34&amp;t=42&amp;sid=d3efeee9223323b306c37f05a53c12df#p203\">the translation of the comics</a>. Translating the books is a labor-intensive bear, but the comics are much shorter and feature minimal text in comparison. If you’re native in German, French, or <strike>Italian</strike>, this would be a useful way to help us rapidly extend Arkhaven’s reach to the larger foreign markets now that we have global print distribution.</p><p>UPDATE: We have Italian. Now looking for German and French.</p></div>",
  "content_text": "Taleb’s\nSkin in the Game\nis one of the best books I have read in some time. I’ll be doing a Voxiversity review of it in the future, but in the meantime, I thought that this observation from\nFooled by Randomness\nwas apt, in light of the participative legion of evil we have operating here. Some call it a fan club, others call it a cult, but I think “school of thought” is probably the most accurate description.\nIt may be a banality that we need others for many things, but we need them far more than we realize, particularly for dignity and respect. Indeed, we have very few historical records of people who have achieved anything extraordinary without such peer validation—but we have the freedom to choose our peers. If we look at the history of ideas, we see schools of thought occasionally forming, producing unusual work unpopular outside the school. You hear about the Stoics, the Academic Skeptics, the Cynics, the Pyrrhonian Skeptics, the Essenes, the Surrealists, the Dadaists, the anarchists, the hippies, the fundamentalists. A school allows someone with unusual ideas with the remote possibility of a payoff to find company and create a microcosm insulated from others. The members of the group can be ostracized together—which is better than being ostracized alone. If you engage in a Black Swan–dependent activity, it is better to be part of a group.\nAs I was reading this, it occurred to me that an easy way for people who would like to get involved  somehow but don’t have much time to do so in a very time-efficient manner is\nthe translation of the comics\n. Translating the books is a labor-intensive bear, but the comics are much shorter and feature minimal text in comparison. If you’re native in German, French, or\nItalian\n, this would be a useful way to help us rapidly extend Arkhaven’s reach to the larger foreign markets now that we have global print distribution.\nUPDATE: We have Italian. Now looking for German and French.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-11T01:51:18+00:00"
}