{
  "url": "https://voxday.net/2018/03/30/pity-the-poor-refugees/",
  "scraped_at": "2025-12-19T20:55:14.633076",
  "title": "Pity the poor refugees",
  "date_display": "March 30, 2018",
  "date_iso": "2018-03-30T22:14:54+00:00",
  "date_from_url": "2018-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Netanyahu, <a href=\"https://www.timesofisrael.com/liveblog_entry/hamas-leader-well-use-all-means-to-ensure-right-of-return/\">tear down that wall!</a></p><blockquote><p>Friday’s demonstrations mark the beginning of the Palestinians’ return to all “Palestine,” Hamas leader Ismail Haniyeh said in a speech at the scene of the mass protests in the Gaza Strip.</p><p>“We are here to declare today that our people will not agree to keep the right of return only as a slogan,” he said. Haniyeh said that the March of Return was also aimed at sending a message to US President Donald Trump that the Palestinians will not give up their right to Jerusalem and “Palestine.” There is no solution without the right of return, he added.</p><p>The Palestinians “will never recognize the Zionist entity and will never give up on Palestinian land, and on Jerusalem; [the city] is ours and there is no solution [to the Israeli-Palestinian conflict] without the ‘right of return,’” Haniyeh said, according to a Hebrew translation by the Walla news site.</p><p>Haniyeh was speaking during a mass demonstration along the Gaza security fence with Israel, ahead of a planned six-week tent protest. Dubbed the “March of Return,” it coincides with Land Day, when Palestinians commemorate the Israeli government’s expropriation of Arab-owned land in the Galilee on March 30, 1976, and ensuing demonstrations in which six Arab Israelis were killed.</p><p>At previous peace talks, the Palestinians have always demanded, along with sovereignty in the West Bank, Gaza, East Jerusalem and the Old City, a “right of return” to Israel for Palestinian refugees who left or were forced out of Israel when it was established. The Palestinians demand this right not only for those of the hundreds of thousands of refugees who are still alive — a figure estimated in the low tens of thousands — but also for their descendants, who number in the millions.</p></blockquote><p>How can Israel possibly deny itself the manifold benefits of these millions of New Israelis, who are every bit as Jewish and Israeli as every current inhabitant of Israel? All they are seeking is a better life for themselves and their children, after all.</p><p>Don’t the Israelis understand that their economy will benefit incredibly from all these potential immigrants? Don’t they realize that they have a moral duty, under Jewish law, to tikkun the olam by providing a safe home for all of these poor, desperate refugees? <i>Have they forgotten the sacred lesson of Ellis Island?</i> Have they forgotten that once they were visitors in Egypt?</p><p>I understand there are also more than a few refugees from Syria who desperately need a safe haven as well. Perhaps they could become New Israelis by immigrating to the Golan Heights.</p><blockquote class=\"tr_bq\"><p>The ‘Great March of Return,’ orchestrated by Hamas, draws thousands of Palestinians to the Gaza-Israel border; riots ensue, prompting IDF snipers to shoot at main instigators; Defense Minister Lieberman warns anyone who approaches security fence is putting his life in jeopardy.</p></blockquote><p>For shame! The Israeli border guards have killed <strike>12</strike>16 New Israelis already. That is not who we are! Those are not Israeli values! What is Israel, after all, if not a nation of immigrants?</p></div>",
  "content_text": "Mr. Netanyahu,\ntear down that wall!\nFriday’s demonstrations mark the beginning of the Palestinians’ return to all “Palestine,” Hamas leader Ismail Haniyeh said in a speech at the scene of the mass protests in the Gaza Strip.\n“We are here to declare today that our people will not agree to keep the right of return only as a slogan,” he said. Haniyeh said that the March of Return was also aimed at sending a message to US President Donald Trump that the Palestinians will not give up their right to Jerusalem and “Palestine.” There is no solution without the right of return, he added.\nThe Palestinians “will never recognize the Zionist entity and will never give up on Palestinian land, and on Jerusalem; [the city] is ours and there is no solution [to the Israeli-Palestinian conflict] without the ‘right of return,’” Haniyeh said, according to a Hebrew translation by the Walla news site.\nHaniyeh was speaking during a mass demonstration along the Gaza security fence with Israel, ahead of a planned six-week tent protest. Dubbed the “March of Return,” it coincides with Land Day, when Palestinians commemorate the Israeli government’s expropriation of Arab-owned land in the Galilee on March 30, 1976, and ensuing demonstrations in which six Arab Israelis were killed.\nAt previous peace talks, the Palestinians have always demanded, along with sovereignty in the West Bank, Gaza, East Jerusalem and the Old City, a “right of return” to Israel for Palestinian refugees who left or were forced out of Israel when it was established. The Palestinians demand this right not only for those of the hundreds of thousands of refugees who are still alive — a figure estimated in the low tens of thousands — but also for their descendants, who number in the millions.\nHow can Israel possibly deny itself the manifold benefits of these millions of New Israelis, who are every bit as Jewish and Israeli as every current inhabitant of Israel? All they are seeking is a better life for themselves and their children, after all.\nDon’t the Israelis understand that their economy will benefit incredibly from all these potential immigrants? Don’t they realize that they have a moral duty, under Jewish law, to tikkun the olam by providing a safe home for all of these poor, desperate refugees?\nHave they forgotten the sacred lesson of Ellis Island?\nHave they forgotten that once they were visitors in Egypt?\nI understand there are also more than a few refugees from Syria who desperately need a safe haven as well. Perhaps they could become New Israelis by immigrating to the Golan Heights.\nThe ‘Great March of Return,’ orchestrated by Hamas, draws thousands of Palestinians to the Gaza-Israel border; riots ensue, prompting IDF snipers to shoot at main instigators; Defense Minister Lieberman warns anyone who approaches security fence is putting his life in jeopardy.\nFor shame! The Israeli border guards have killed\n12\n16 New Israelis already. That is not who we are! Those are not Israeli values! What is Israel, after all, if not a nation of immigrants?",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-30T21:14:54+00:00"
}