{
  "url": "https://voxday.net/2018/03/12/ruining-a-wrinkle-in-time/",
  "scraped_at": "2025-12-19T10:46:37.850258",
  "title": "Ruining A Wrinkle in Time",
  "date_display": "March 12, 2018",
  "date_iso": "2018-03-12T11:12:56+00:00",
  "date_from_url": "2018-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I tend to doubt anyone at all was surprised by the fact that Hollywood diversitied, de-Christianized, and generally despoiled Madeleine L’Engle’s classic <i>A Wrinkle in Time</i>. But as a longtime fan of the book – and an especial fan of <i>A Swiftly Tilting Planet</i> – I nevertheless find myself feeling a bit angry at <a href=\"http://thefederalist.com/2018/03/07/a-wrinkle-in-time-is-a-disastrous-adaptation-of-lengles-book/\">the intentional destruction of a long-cherished tale</a>.</p><blockquote><p>Madeleine L’Engle’s classic young adult novel “A Wrinkle in Time” is the latest victim of diversity-deranged stunt casting in which no respect is paid to the race or sex of existing literary characters. But that’s only one reason why this frustrating fiasco is such an embarrassing failure. Director Ava DuVernay (“Selma”), who has no feel at all for the material, seems more interested in promoting colorblind multi-culturalism than producing an entertaining adaptation that is worthy of its much-beloved source.</p><p>Although movies featuring original characters whose physical attributes have been unspecified elsewhere are legitimate equal-opportunity roles for any actors, deviating from already established characters turns a project into either a sort of alternative-reality racelifted remake (the black-cast versions of “Annie” and “Steel Magnolias”), a re-imagined novelty (“The Wiz”), comic exploitation (“Blacula”) or a display of randomly colorblind inclusiveness (a black Human Torch in the most recent “Fantastic Four”). All of those swaps are distracting enough to seem like gimmicks, even if an appearance-miscast actor gives an otherwise adequate performance.</p><p>Teenage Meg Murry and her mother, both white like the rest of their family in the 1962 “A Wrinkle in Time” novel, are portrayed in this film version by black actresses Storm Reid and Gugu Mbatha-Raw. Dad is played by Caucasian Chris Pine. Because Meg’s precocious younger brother Charles Wallace is played by Filipino-American Deric McCabe, this results in the absurdity of the character now being identified as adopted, presumably because it would be hard to believe he could be the product of Mbatha-Raw and Pine’s union. Twin brothers from the book are missing entirely from the movie, which may be a blessing, considering that political correctness probably would have dictated they be played by a Native American dwarf and a disabled transsexual.</p><p>The irony of making changes like these to a book in which Meg herself states that “like and equal are not the same thing at all” apparently was lost on those responsible. (Then again, the line does not appear in the movie, possibly because the filmmakers knew they had sabotaged said theme.) Also, it’s unfortunate that the film eliminates the novel’s references to Christianity that resulted in it being banned from some libraries. Inclusion apparently has its limits.</p></blockquote><p>I still have not forgotten how Hollywood sucked all the story and the soul out of Susan Cooper’s <i>The Dark is Risin</i>g and turned it into a pointless nothing of a movie. Seeing the soulless vampires do the same thing to Madeleine L’Engle only confirms my decision to stay very far away from the entertainment Ecthroi.</p><p>When the time comes, we will make our own movies and we will tell our own stories. We will not sell them to the soul-destroyers to be transformed into mocking parodies of what they were created to be. If you are an author, do not sell or option your rights to these creatures. It is not worth it.</p></div>",
  "content_text": "I tend to doubt anyone at all was surprised by the fact that Hollywood diversitied, de-Christianized, and generally despoiled Madeleine L’Engle’s classic\nA Wrinkle in Time\n. But as a longtime fan of the book – and an especial fan of\nA Swiftly Tilting Planet\n– I nevertheless find myself feeling a bit angry at\nthe intentional destruction of a long-cherished tale\n.\nMadeleine L’Engle’s classic young adult novel “A Wrinkle in Time” is the latest victim of diversity-deranged stunt casting in which no respect is paid to the race or sex of existing literary characters. But that’s only one reason why this frustrating fiasco is such an embarrassing failure. Director Ava DuVernay (“Selma”), who has no feel at all for the material, seems more interested in promoting colorblind multi-culturalism than producing an entertaining adaptation that is worthy of its much-beloved source.\nAlthough movies featuring original characters whose physical attributes have been unspecified elsewhere are legitimate equal-opportunity roles for any actors, deviating from already established characters turns a project into either a sort of alternative-reality racelifted remake (the black-cast versions of “Annie” and “Steel Magnolias”), a re-imagined novelty (“The Wiz”), comic exploitation (“Blacula”) or a display of randomly colorblind inclusiveness (a black Human Torch in the most recent “Fantastic Four”). All of those swaps are distracting enough to seem like gimmicks, even if an appearance-miscast actor gives an otherwise adequate performance.\nTeenage Meg Murry and her mother, both white like the rest of their family in the 1962 “A Wrinkle in Time” novel, are portrayed in this film version by black actresses Storm Reid and Gugu Mbatha-Raw. Dad is played by Caucasian Chris Pine. Because Meg’s precocious younger brother Charles Wallace is played by Filipino-American Deric McCabe, this results in the absurdity of the character now being identified as adopted, presumably because it would be hard to believe he could be the product of Mbatha-Raw and Pine’s union. Twin brothers from the book are missing entirely from the movie, which may be a blessing, considering that political correctness probably would have dictated they be played by a Native American dwarf and a disabled transsexual.\nThe irony of making changes like these to a book in which Meg herself states that “like and equal are not the same thing at all” apparently was lost on those responsible. (Then again, the line does not appear in the movie, possibly because the filmmakers knew they had sabotaged said theme.) Also, it’s unfortunate that the film eliminates the novel’s references to Christianity that resulted in it being banned from some libraries. Inclusion apparently has its limits.\nI still have not forgotten how Hollywood sucked all the story and the soul out of Susan Cooper’s\nThe Dark is Risin\ng and turned it into a pointless nothing of a movie. Seeing the soulless vampires do the same thing to Madeleine L’Engle only confirms my decision to stay very far away from the entertainment Ecthroi.\nWhen the time comes, we will make our own movies and we will tell our own stories. We will not sell them to the soul-destroyers to be transformed into mocking parodies of what they were created to be. If you are an author, do not sell or option your rights to these creatures. It is not worth it.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-12T11:12:56+00:00"
}