{
  "url": "https://voxday.net/2018/03/15/russia-is-the-reason-a-wrinkle-in-time-flopped/",
  "scraped_at": "2025-12-19T20:52:42.200814",
  "title": "Russia is the reason A Wrinkle in Time flopped",
  "date_display": "March 15, 2018",
  "date_iso": "2018-03-15T00:19:23+00:00",
  "date_from_url": "2018-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wait, did I say RUSSIA? Oh, sorry, I meant to say that <a href=\"https://pjmedia.com/lifestyle/a-wrinkle-in-time-director-ava-duvernay-uses-racism-to-explain-away-bad-reviews/\">RACISM is the reason</a> that it flopped.</p><blockquote><p>‘A Wrinkle in Time’ Director Ava DuVernay Uses Racism to Explain Away Bad Reviews….</p><p>In an interview with Screen Rant, writer Jennifer Lee explained why she took out the Christian themes and Bible references from the book. “It wasn’t removed, it was just opened up in language that wasn’t exclusive, guardian angels versus stars, are they the same thing? Maybe,” Lee said. She emphasized “inclusivity,” saying, “Since we’re not limiting, we’re not picking some religion, but we’re saying we all feel, we can feel that you’re a part of something extraordinary and the messages are the same.”</p><p>This helps explain why the film ditched the book’s explicit Christian themes, trading them for vague New Age spirituality that failed to deliver the depth of the original story. Furthermore, it is the exact opposite of “inclusive” to excise all Christian historical references, even to Jesus, Copernicus, or Michelangelo.</p><p>As The Federalist’s Ellie Bufkin noted, non-Christian and liberal reviewers agreed that the removal of Christianity from “A Wrinkle in Time” severely weakened the movie.</p></blockquote><p>Sure, it’s not the anti-Christian bigotry, the urinating all over a cherished childhood classic, or the Wakandawashing of the white characters, it’s <i>Vladimir Putin</i>!</p><p>I mean, of course, to say that it was RACISM. Specifically, the racism of straight white Christians.</p><p>It is absolutely no surprise at all that A Wrinkle in Time flopped. Padre Pio knew that it would flop. Nostradamus knew that it would flop. There is probably a stone buried deep in a South American jungle carved with ancient Mayan hieroglyphics predicting it would flop. Even journalists who are under the vague impression that a tesseract deals with financial regulations knew <i>eight years before it even came out</i> that it was going to flop, because the Hollywood Values crowd hates hates hates Christianity, Christian morality, Christian values, Christians, Jesus Christ, the Bible, and God. There was never any chance that they could produce a movie that would be consistent with the core themes of the book.</p><p>What is more interesting is to ponder why Black Panther was successful whereas A Wrinkle in Time was not, given their superficially similar approaches. So, what were the salient differences?</p><ul><li>Black Panther was competently told.</li><li>Black Panther respected the original characters.</li><li>Black Panther was aimed at its core market.</li><li>Black Panther’s production team actually appears to have liked its source material.</li><li>Black Panther had competent set and costume design.</li></ul><div>I suspect that Black Panther also sucked all the available “black power” enthusiasm out of the market, which probably added insult to injury to the shoddy A Wrinkle in Time performance.</div></div>",
  "content_text": "Wait, did I say RUSSIA? Oh, sorry, I meant to say that\nRACISM is the reason\nthat it flopped.\n‘A Wrinkle in Time’ Director Ava DuVernay Uses Racism to Explain Away Bad Reviews….\nIn an interview with Screen Rant, writer Jennifer Lee explained why she took out the Christian themes and Bible references from the book. “It wasn’t removed, it was just opened up in language that wasn’t exclusive, guardian angels versus stars, are they the same thing? Maybe,” Lee said. She emphasized “inclusivity,” saying, “Since we’re not limiting, we’re not picking some religion, but we’re saying we all feel, we can feel that you’re a part of something extraordinary and the messages are the same.”\nThis helps explain why the film ditched the book’s explicit Christian themes, trading them for vague New Age spirituality that failed to deliver the depth of the original story. Furthermore, it is the exact opposite of “inclusive” to excise all Christian historical references, even to Jesus, Copernicus, or Michelangelo.\nAs The Federalist’s Ellie Bufkin noted, non-Christian and liberal reviewers agreed that the removal of Christianity from “A Wrinkle in Time” severely weakened the movie.\nSure, it’s not the anti-Christian bigotry, the urinating all over a cherished childhood classic, or the Wakandawashing of the white characters, it’s\nVladimir Putin\n!\nI mean, of course, to say that it was RACISM. Specifically, the racism of straight white Christians.\nIt is absolutely no surprise at all that A Wrinkle in Time flopped. Padre Pio knew that it would flop. Nostradamus knew that it would flop. There is probably a stone buried deep in a South American jungle carved with ancient Mayan hieroglyphics predicting it would flop. Even journalists who are under the vague impression that a tesseract deals with financial regulations knew\neight years before it even came out\nthat it was going to flop, because the Hollywood Values crowd hates hates hates Christianity, Christian morality, Christian values, Christians, Jesus Christ, the Bible, and God. There was never any chance that they could produce a movie that would be consistent with the core themes of the book.\nWhat is more interesting is to ponder why Black Panther was successful whereas A Wrinkle in Time was not, given their superficially similar approaches. So, what were the salient differences?\nBlack Panther was competently told.\nBlack Panther respected the original characters.\nBlack Panther was aimed at its core market.\nBlack Panther’s production team actually appears to have liked its source material.\nBlack Panther had competent set and costume design.\nI suspect that Black Panther also sucked all the available “black power” enthusiasm out of the market, which probably added insult to injury to the shoddy A Wrinkle in Time performance.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-15T00:19:23+00:00"
}