{
  "url": "https://voxday.net/2018/03/30/she-should-have-read-sjwal/",
  "scraped_at": "2025-12-19T20:55:12.671817",
  "title": "She should have read SJWAL",
  "date_display": "March 30, 2018",
  "date_iso": "2018-03-30T15:00:08+00:00",
  "date_from_url": "2018-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ML is not exactly surprised by David Hogg’s rejection of Laura Ingraham’s apology:</p><blockquote class=\"tr_bq\"><p>David Hogg is predictably still calling for boycotts of Ingraham’s advertisers, calling her apology inadequate. It’s a shame she didn’t read your book.</p></blockquote><p>At this point I can safely state, without any sense of exaggeration or modesty, that if you have anything to do with the media or politics and you do not read SJWAL, you will fully merit the treatment that you’re going to get from SJWs sooner or later. Conservative commentators continue to demonstrate that they never learn <i>anything </i>from the various defenestrations that preceded their own, as they insist on demonstrating every single time one of them comes in for targeted public criticism.</p><p>Laura Ingraham rightly made fun of David “Totally Not a Crisis Actor” Hogg because he’s been getting rejected from various universities, then promptly backed down and apologized when the media’s little darling affected to have gotten his feelings hurt. As you can imagine, <a href=\"https://www.cnbc.com/2018/03/29/tripadvisor-drops-laura-ingraham-after-she-attacked-parkland-activist.html\">her apology completely resolved the situation</a>, because SJWs always refrain from taking advantage of an apologetic conservative rolling over and showing his yellow belly.</p><blockquote><p>Advertisers – including TripAdvisor, Nestle, Wayfair and Hulu – are dumping Laura Ingraham after she slammed Parkland survivor</p><p>TripAdvisor will pull its advertisements from right-wing television host Laura Ingraham’s Fox News program.</p><p>In a tweet, Ingraham mocked a survivor of the Parkland, Florida, high school shooting in February that left 17 students and adults dead. The survivor-turned-activist, David Hogg, responded on Twitter by calling on his followers to contact Ingraham’s top advertisers. Ingraham later tweeted her apologies “for any upset or hurt my tweet caused him or any of the brave victims of Parkland.”</p><p><i>Any student should be proud of a 4.2 GPA —incl. @DavidHogg111.  On reflection, in the spirit of Holy Week, I apologize for any upset or hurt my tweet caused him or any of the brave victims of Parkland. For the record, I believe my show was the first to feature David immediately after that horrific shooting and even noted how “poised” he was given the tragedy. As always, he’s welcome to return to the show anytime for a productive discussion. </i><br><i><br/></i>What a brave opinion leader! The complete spinelessness and stupidity demonstrated by the hapless Ingraham aside, this episode demonstrates how fragile the Right is when it relies upon the Left’s infrastructure. Even a not-very-bright high school student can effectively take down a major conservative media figure with nothing more than a well-targeted tweet.</br></p></blockquote><p>But there is a more important point here than the obvious question of “what part of ‘never apologize’ did you fail to understand?” If you live by advertising from converged corporations, then you can safely expect them to cut you off the moment someone complains that you are violating the current Narrative.</p><p>Ingraham’s cringing self-implosion demonstrates why it is so terminally short-sighted for conservatives to insist on continually maximizing their short-term interests in exposure over their long-term interests in a solid non-converged infrastructure. This is why I wouldn’t accept a television show on Fox News or CNN even if one was offered to me on a silver platter, as while such a show would be of significant benefit in the short term, it would vastly increase my fragility, whereas continuing to build up Infogalactic, Voxiversity, and other platforms will likely prove more beneficial to me and many others in the long run.</p><p>I have no sympathy for the talking heads who are shut down by their advertisers or the self-published authors who are shut down by Amazon. These are known risks and they cannot come as a surprise to anyone who has been conscious for the last four years. While you’re not necessarily part of the problem if you’re not helping build alternative platforms, you also are not part of the solution, and can’t expect much in the way of support or sympathy if you find yourself being deplatformed in the future.</p></div>",
  "content_text": "ML is not exactly surprised by David Hogg’s rejection of Laura Ingraham’s apology:\nDavid Hogg is predictably still calling for boycotts of Ingraham’s advertisers, calling her apology inadequate. It’s a shame she didn’t read your book.\nAt this point I can safely state, without any sense of exaggeration or modesty, that if you have anything to do with the media or politics and you do not read SJWAL, you will fully merit the treatment that you’re going to get from SJWs sooner or later. Conservative commentators continue to demonstrate that they never learn\nanything\nfrom the various defenestrations that preceded their own, as they insist on demonstrating every single time one of them comes in for targeted public criticism.\nLaura Ingraham rightly made fun of David “Totally Not a Crisis Actor” Hogg because he’s been getting rejected from various universities, then promptly backed down and apologized when the media’s little darling affected to have gotten his feelings hurt. As you can imagine,\nher apology completely resolved the situation\n, because SJWs always refrain from taking advantage of an apologetic conservative rolling over and showing his yellow belly.\nAdvertisers – including TripAdvisor, Nestle, Wayfair and Hulu – are dumping Laura Ingraham after she slammed Parkland survivor\nTripAdvisor will pull its advertisements from right-wing television host Laura Ingraham’s Fox News program.\nIn a tweet, Ingraham mocked a survivor of the Parkland, Florida, high school shooting in February that left 17 students and adults dead. The survivor-turned-activist, David Hogg, responded on Twitter by calling on his followers to contact Ingraham’s top advertisers. Ingraham later tweeted her apologies “for any upset or hurt my tweet caused him or any of the brave victims of Parkland.”\nAny student should be proud of a 4.2 GPA —incl. @DavidHogg111.  On reflection, in the spirit of Holy Week, I apologize for any upset or hurt my tweet caused him or any of the brave victims of Parkland. For the record, I believe my show was the first to feature David immediately after that horrific shooting and even noted how “poised” he was given the tragedy. As always, he’s welcome to return to the show anytime for a productive discussion.\nWhat a brave opinion leader! The complete spinelessness and stupidity demonstrated by the hapless Ingraham aside, this episode demonstrates how fragile the Right is when it relies upon the Left’s infrastructure. Even a not-very-bright high school student can effectively take down a major conservative media figure with nothing more than a well-targeted tweet.\nBut there is a more important point here than the obvious question of “what part of ‘never apologize’ did you fail to understand?” If you live by advertising from converged corporations, then you can safely expect them to cut you off the moment someone complains that you are violating the current Narrative.\nIngraham’s cringing self-implosion demonstrates why it is so terminally short-sighted for conservatives to insist on continually maximizing their short-term interests in exposure over their long-term interests in a solid non-converged infrastructure. This is why I wouldn’t accept a television show on Fox News or CNN even if one was offered to me on a silver platter, as while such a show would be of significant benefit in the short term, it would vastly increase my fragility, whereas continuing to build up Infogalactic, Voxiversity, and other platforms will likely prove more beneficial to me and many others in the long run.\nI have no sympathy for the talking heads who are shut down by their advertisers or the self-published authors who are shut down by Amazon. These are known risks and they cannot come as a surprise to anyone who has been conscious for the last four years. While you’re not necessarily part of the problem if you’re not helping build alternative platforms, you also are not part of the solution, and can’t expect much in the way of support or sympathy if you find yourself being deplatformed in the future.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-30T14:00:08+00:00"
}