{
  "url": "https://voxday.net/2018/03/01/smart-trump-dumb-trump-sneaky-trump/",
  "scraped_at": "2025-12-19T10:45:23.301762",
  "title": "Smart Trump, Dumb Trump, Sneaky Trump",
  "date_display": "March 1, 2018",
  "date_iso": "2018-03-01T16:40:12+00:00",
  "date_from_url": "2018-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes the God-Emperor <a href=\"https://pjmedia.com/blog/liveblogevent/thursdays-hot-mic-47/entry-225142/\">can’t seem to get out of the way of his own emotions</a>. On the other hand, it is always dangerous to assume that you know which Trump Mode happens to be operative in any given situation.</p><blockquote><p>Yesterday, the President held a bipartisan meeting on school safety and gun control. It was a nightmare. Trump taunted lawmakers by telling them “you’re afraid of the NRA.” He’ll soon find out why politicians are afraid of the NRA during the 2018 elections if he doesn’t walk balk some of the insanity he was tossing about in that meeting.</p><p>Some of the ridiculous changes to firearm laws Trump seemed amenable to include outlawing private guns sales, raising the age to 21 to buy a long gun, and taking people’s guns without due process. Like I said, what a dumpster fire. Not one of those things will stop criminal maniacs from getting a firearm.</p><p>Dick’s Sporting Goods, which is a crappy, over priced place to buy anything a firearm will not sell “assault-style” weapons. Quick question: what is the difference between an “assault-style” long gun and a long gun that is not “assault-style”? Let me know in the comments. Sadly, Walmart, where I occasionally purchase Federal 12ga 8 shot but will not do so any longer, says it will not sell firearms to consumers who are under the age of 21.</p><p>President Trump mentioned in his gun control conclave that he was going to issue an executive order banning bump stocks. And in a mind-blowing move, Trump dismissed Rep. Steve Scalise when he suggested national reciprocity be included in any gun legislation.</p></blockquote><p>Dumpster fire barely begins to describe it. However, as always, I counsel patience when attempting to analyze and understand Donald Trump’s words and actions. First, <i>what has actually changed? </i>Nothing. At the very least, wait and see whether this is strategic posturing, tactical maneuver, or simple emoting.</p><p>If nothing else, Trump is an astute observer and a fast learner. He’s not a complete idiot, and it’s hardly going to escape him that all the parties and people who are most implacably opposed to him are literally rubbing their hands over his latest outburst. And possibly Trump’s greatest political skill is his ability to a) realize he has made a mistake and b) walk it back without hesitation, regret, or apology.</p><p>The other thing to remember is that Trump is neither a savior nor is he Alt-Right. He is absolutely going to get things wrong from time to time. On those occasions, we should oppose him as steadfastly as if he were Hillary Clinton or Judeo Christ himself. But we should do so with the awareness that he can change his mind and the hope that he will do so, and the understanding that he is mistaken rather than the enemy.</p><p>The lesson, as always, is never count the God-Emperor out. That’s not an expression of loyalty, merely one of experience.</p><p>Donald J. Trump@realDonaldTrump<br><i>Many ideas, some good &amp; some not so good, emerged from our bipartisan meeting on school safety yesterday at the White House. Background Checks a big part of conversation. Gun free zones are proven targets of killers. After many years, a Bill should emerge. Respect 2nd Amendment!</i></br></p></div>",
  "content_text": "Sometimes the God-Emperor\ncan’t seem to get out of the way of his own emotions\n. On the other hand, it is always dangerous to assume that you know which Trump Mode happens to be operative in any given situation.\nYesterday, the President held a bipartisan meeting on school safety and gun control. It was a nightmare. Trump taunted lawmakers by telling them “you’re afraid of the NRA.” He’ll soon find out why politicians are afraid of the NRA during the 2018 elections if he doesn’t walk balk some of the insanity he was tossing about in that meeting.\nSome of the ridiculous changes to firearm laws Trump seemed amenable to include outlawing private guns sales, raising the age to 21 to buy a long gun, and taking people’s guns without due process. Like I said, what a dumpster fire. Not one of those things will stop criminal maniacs from getting a firearm.\nDick’s Sporting Goods, which is a crappy, over priced place to buy anything a firearm will not sell “assault-style” weapons. Quick question: what is the difference between an “assault-style” long gun and a long gun that is not “assault-style”? Let me know in the comments. Sadly, Walmart, where I occasionally purchase Federal 12ga 8 shot but will not do so any longer, says it will not sell firearms to consumers who are under the age of 21.\nPresident Trump mentioned in his gun control conclave that he was going to issue an executive order banning bump stocks. And in a mind-blowing move, Trump dismissed Rep. Steve Scalise when he suggested national reciprocity be included in any gun legislation.\nDumpster fire barely begins to describe it. However, as always, I counsel patience when attempting to analyze and understand Donald Trump’s words and actions. First,\nwhat has actually changed?\nNothing. At the very least, wait and see whether this is strategic posturing, tactical maneuver, or simple emoting.\nIf nothing else, Trump is an astute observer and a fast learner. He’s not a complete idiot, and it’s hardly going to escape him that all the parties and people who are most implacably opposed to him are literally rubbing their hands over his latest outburst. And possibly Trump’s greatest political skill is his ability to a) realize he has made a mistake and b) walk it back without hesitation, regret, or apology.\nThe other thing to remember is that Trump is neither a savior nor is he Alt-Right. He is absolutely going to get things wrong from time to time. On those occasions, we should oppose him as steadfastly as if he were Hillary Clinton or Judeo Christ himself. But we should do so with the awareness that he can change his mind and the hope that he will do so, and the understanding that he is mistaken rather than the enemy.\nThe lesson, as always, is never count the God-Emperor out. That’s not an expression of loyalty, merely one of experience.\nDonald J. Trump@realDonaldTrump\nMany ideas, some good & some not so good, emerged from our bipartisan meeting on school safety yesterday at the White House. Background Checks a big part of conversation. Gun free zones are proven targets of killers. After many years, a Bill should emerge. Respect 2nd Amendment!",
  "tags": [
    "guncontrol"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-01T16:40:12+00:00"
}