{
  "url": "https://voxday.net/2018/03/04/stop-fighting-on-their-ground/",
  "scraped_at": "2025-12-19T10:45:45.885441",
  "title": "Stop fighting on their ground",
  "date_display": "March 4, 2018",
  "date_iso": "2018-03-04T20:23:51+00:00",
  "date_from_url": "2018-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>YouTube <a href=\"https://www.infowars.com/the-truth-behind-youtubes-purge-of-conservatives/\">hits Infowars with a third strike</a> preparatory to deleting Alex Jones’s channel:</p><blockquote><p>After one strike was removed earlier in the week, YouTube hit the Alex Jones Channel with a third strike for a video that had already been appealed and restored.</p><p>In the video, Jones clearly explains how the victims of the Parkland shooting were not “crisis actors”.</p><p>YouTube’s flagging system is clearly being abused in a flagrant effort to shut down Infowars following a public campaign by CNN.</p><p>This sets a horrific precedent for free expression and the First Amendment and YouTube is in direct violation of the Communications Decency Act in adopting this approach.</p></blockquote><p>Protest! Shock! Horror! Unfair! Come on, now. The inevitability of these deplatforming actions is why I have been repeatedly and relentlessly advising people to <i>build their own platforms</i>. There is little point in building up a highly fragile operation on your enemy’s turf that they can literally take out at will without warning.</p><p>The high-profile men and women of the Right absolutely need to stop thinking about maximizing their short-term benefit and start looking to support the platforms that are not going to a) silence them, b) sell them out, or, c) leave them completely exposed to their enemies. And they also need to stop “fighting for free speech”. Free speech is little more than <a href=\"https://www.amazon.com/History-Freedom-Thought-J-Bury/dp/1596055979\">anti-Christian Enlightenment propaganda</a>, which very few of its self-appointed defenders seem to know.</p><p>In case you haven’t noticed, it is utterly useless to appeal to the ideological purists who run these Big Social platforms. No amount of reason is going to sway them. So stop relying upon them! If you notice, I used Freestartr instead of Kickstarter and Bitchute instead of Youtube for Voxiversity. If even 10 percent of the Right would stop bitching and wailing and whining about their inevitable ill-treatment at the hands of the Left and publicly support the alternative platforms instead, we would have a fully functional Alt-Tech ecosystem before the end of 2018.</p><p>Stefan Molyneux clearly <a href=\"https://www.bitchute.com/video/Vrq6LQvqjSY/\">gets it</a>. One hopes that others will before it’s already too late.</p><p>UPDATE: This again. I had a feeling someone was going to leap in to “call me out” for “hypocrisy” sooner or later. At least this was friendly concern.</p><blockquote class=\"tr_bq\"><p>This post being made on a Google-owned property, is at best hypocritical (which is fucking horrible to your credibility). Please take a look at platforms like Steemit, Minds, etc. because Goolag can bring the ban-hammer down on Vox Populi in a nanosecond. You’re a sonofabitch, but you’re an excellent sonofabitch, and I do not want to see you banned or discredited.</p></blockquote><p>First, I was reliably informed that my credibility was destroyed back in 2001. So, who cares about that. Second, do you really think I am not prepared for Google to take down the blog without warning for no reason, or that Google does not know that? And third, Blogger is not a critical platform. It is merely a delivery vehicle for text on a screen and literally no one is dependent upon it.</p></div>",
  "content_text": "YouTube\nhits Infowars with a third strike\npreparatory to deleting Alex Jones’s channel:\nAfter one strike was removed earlier in the week, YouTube hit the Alex Jones Channel with a third strike for a video that had already been appealed and restored.\nIn the video, Jones clearly explains how the victims of the Parkland shooting were not “crisis actors”.\nYouTube’s flagging system is clearly being abused in a flagrant effort to shut down Infowars following a public campaign by CNN.\nThis sets a horrific precedent for free expression and the First Amendment and YouTube is in direct violation of the Communications Decency Act in adopting this approach.\nProtest! Shock! Horror! Unfair! Come on, now. The inevitability of these deplatforming actions is why I have been repeatedly and relentlessly advising people to\nbuild their own platforms\n. There is little point in building up a highly fragile operation on your enemy’s turf that they can literally take out at will without warning.\nThe high-profile men and women of the Right absolutely need to stop thinking about maximizing their short-term benefit and start looking to support the platforms that are not going to a) silence them, b) sell them out, or, c) leave them completely exposed to their enemies. And they also need to stop “fighting for free speech”. Free speech is little more than\nanti-Christian Enlightenment propaganda\n, which very few of its self-appointed defenders seem to know.\nIn case you haven’t noticed, it is utterly useless to appeal to the ideological purists who run these Big Social platforms. No amount of reason is going to sway them. So stop relying upon them! If you notice, I used Freestartr instead of Kickstarter and Bitchute instead of Youtube for Voxiversity. If even 10 percent of the Right would stop bitching and wailing and whining about their inevitable ill-treatment at the hands of the Left and publicly support the alternative platforms instead, we would have a fully functional Alt-Tech ecosystem before the end of 2018.\nStefan Molyneux clearly\ngets it\n. One hopes that others will before it’s already too late.\nUPDATE: This again. I had a feeling someone was going to leap in to “call me out” for “hypocrisy” sooner or later. At least this was friendly concern.\nThis post being made on a Google-owned property, is at best hypocritical (which is fucking horrible to your credibility). Please take a look at platforms like Steemit, Minds, etc. because Goolag can bring the ban-hammer down on Vox Populi in a nanosecond. You’re a sonofabitch, but you’re an excellent sonofabitch, and I do not want to see you banned or discredited.\nFirst, I was reliably informed that my credibility was destroyed back in 2001. So, who cares about that. Second, do you really think I am not prepared for Google to take down the blog without warning for no reason, or that Google does not know that? And third, Blogger is not a critical platform. It is merely a delivery vehicle for text on a screen and literally no one is dependent upon it.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-04T20:23:51+00:00"
}