{
  "url": "https://voxday.net/2018/03/27/texas/",
  "scraped_at": "2025-12-19T20:54:47.405491",
  "title": "!Texas!",
  "date_display": "March 27, 2018",
  "date_iso": "2018-03-27T17:00:32+00:00",
  "date_from_url": "2018-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more I contemplate the universe, the more I am convinced that the fundamental core of Man’s philosophy must revolve around a single question: to pretend or not to pretend. So much human evil stems from the fact that we deceive ourselves, we deceive each other, and we seek to deceive God. And one of the primary locuses of deception is <a href=\"http://www.foxnews.com/us/2018/03/25/texas-teen-was-beaten-had-hot-cooking-oil-poured-on-her-after-refusing-arranged-marriage-police.html\">the language we choose to employ</a>.</p><blockquote><p>Parents of a Texas high school student who was reported missing in late January had abused their daughter after she refused an arranged marriage, leading her to run away from home until she was found in mid-March, police said.</p><p>Maarib Al Hishmawi, 16, was reported missing on Jan. 30 after she was last seen leaving Taft High School in Bexar County. She was located in mid-March when she was taken in by an organization that cared for her after she ran away, KSAT reported.</p><p>Authorities on Friday said Al Hishmawi’s parents — Abdulah Fahmi Al Hishmawi, 34, and Hamdiyah Saha Al Hishmawi, 33 — had allegedly beaten their daughter with a broomstick and poured hot cooking oil on her when she refused to marry a man in another city.</p></blockquote><p>“Texas teen.” Sure. What happened to Miss Al Hishmawi sounds like something that might have just as easily happened to any other true blue Texas family from the Lone Star State, does it not? What an unfortunate and unexpected fate for a Southern belle!</p><p>Words have meaning. We can pretend otherwise, but reality will shine through sooner or later.</p></div>",
  "content_text": "The more I contemplate the universe, the more I am convinced that the fundamental core of Man’s philosophy must revolve around a single question: to pretend or not to pretend. So much human evil stems from the fact that we deceive ourselves, we deceive each other, and we seek to deceive God. And one of the primary locuses of deception is\nthe language we choose to employ\n.\nParents of a Texas high school student who was reported missing in late January had abused their daughter after she refused an arranged marriage, leading her to run away from home until she was found in mid-March, police said.\nMaarib Al Hishmawi, 16, was reported missing on Jan. 30 after she was last seen leaving Taft High School in Bexar County. She was located in mid-March when she was taken in by an organization that cared for her after she ran away, KSAT reported.\nAuthorities on Friday said Al Hishmawi’s parents — Abdulah Fahmi Al Hishmawi, 34, and Hamdiyah Saha Al Hishmawi, 33 — had allegedly beaten their daughter with a broomstick and poured hot cooking oil on her when she refused to marry a man in another city.\n“Texas teen.” Sure. What happened to Miss Al Hishmawi sounds like something that might have just as easily happened to any other true blue Texas family from the Lone Star State, does it not? What an unfortunate and unexpected fate for a Southern belle!\nWords have meaning. We can pretend otherwise, but reality will shine through sooner or later.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-27T16:00:32+00:00"
}