{
  "url": "https://voxday.net/2018/03/31/the-death-of-a-thousand-leaks/",
  "scraped_at": "2025-12-19T20:55:16.492137",
  "title": "The death of a thousand leaks",
  "date_display": "March 31, 2018",
  "date_iso": "2018-03-31T00:34:15+00:00",
  "date_from_url": "2018-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Facebook <a href=\"https://www.nytimes.com/2018/03/30/technology/facebook-leaked-memo.html\">is now facing the same problem</a> that Google has been dealing with for the last year, which is whistleblowing employees who are willing to expose the problematic behavior of their colleagues and superiors. Perhaps the loyalists should get in touch with <i>Wired</i>, so they can complain about how terrible it is that their threats and other misdeeds are being exposed to the public.</p><blockquote class=\"tr_bq\"><p>According to two Facebook employees, workers have been calling on internal message boards for a hunt to find those who leak to the media. Some have questioned whether Facebook has been transparent enough with its users and with journalists, said the employees, who asked not to be identified for fear of retaliation. Many are also concerned over what might leak next and are deleting old comments or messages that might come across as controversial or newsworthy, they said.</p></blockquote><p>I have no doubt that the so-called “Ugly Memo” is neither the last nor the worst thing we’re going to see coming out of the Facebook internal messaging boards.</p></div>",
  "content_text": "Facebook\nis now facing the same problem\nthat Google has been dealing with for the last year, which is whistleblowing employees who are willing to expose the problematic behavior of their colleagues and superiors. Perhaps the loyalists should get in touch with\nWired\n, so they can complain about how terrible it is that their threats and other misdeeds are being exposed to the public.\nAccording to two Facebook employees, workers have been calling on internal message boards for a hunt to find those who leak to the media. Some have questioned whether Facebook has been transparent enough with its users and with journalists, said the employees, who asked not to be identified for fear of retaliation. Many are also concerned over what might leak next and are deleting old comments or messages that might come across as controversial or newsworthy, they said.\nI have no doubt that the so-called “Ugly Memo” is neither the last nor the worst thing we’re going to see coming out of the Facebook internal messaging boards.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-30T23:34:15+00:00"
}