{
  "url": "https://voxday.net/2018/03/17/the-clue-may-be-in-the-name/",
  "scraped_at": "2025-12-19T20:53:04.331348",
  "title": "The clue may be in the name",
  "date_display": "March 17, 2018",
  "date_iso": "2018-03-17T15:10:26+00:00",
  "date_from_url": "2018-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Conservative Libertarian Fiction Alliance is alarmed over <a href=\"https://pjmedia.com/trending/amazon-deletes-reviews-conservative-authors-no-explanation/\">a recent mass deletion</a> of Amazon book reviews:</p><blockquote><p>Amazon frightened many conservative authors this week in a mass deletion of reviews. Some authors lost almost 100 reviews on their published works. Others lost all the reviews they had ever written on Amazon. Some lost both. Information about the purge began to trickle out in the closed Conservative Libertarian Fiction Alliance (CLFA) Facebook group. Member after member began reporting the losses at the same time. Marina Fontaine, whose credits include the dystopian Chasing Freedom, the pro-Trump fiction anthology MAGA 2020, and moderating the CLFA page reported many members experiencing losses. A coordinated effort was launched to contact Amazon for explanation. Jon Del Arroz, a science fiction author who was banned from Worldcon earlier this year, contacted Amazon directly asking for his reviews to be reinstated. Amazon responded:</p><p><i>At this time, we’ve reviewed your feedback and ensured that appropriate action is taken.  There may be times that reviews must be removed from the site.  Unfortunately, we won’t be able to discuss the specifics about why the reviews were removed as we’ll only be able to discuss that with the individuals who posted the reviews.  They’re welcome to contact us if they’d like additional information.</i></p><p>Del Arroz’s reviews were reinstated but the corporate response is less than satisfying to conservatives who know their freedom of speech is under constant attack from SJWs in a big tech industry that rules the socials and platforms writers need to connect with their audience.</p></blockquote><p>Of course, the mere fact that there is a closed alliance of authors with personal relationships who pay very close attention to reviews may explain at least a reasonable percentage of these deletions, given the terms of service. I checked out my reviews and it looks like ten or fewer reviews were deleted across all my various book listings. Not only that, but several of the reviews were one-star fake reviews, so two of my average ratings actually increased. This made me suspect that the deleted reviews were likely in open violation of Amazon’s terms of service, which <a href=\"https://madgeniusclub.com/2018/03/13/on-reviews/\">Amanda Green’s investigation</a> appears to have generally confirmed.</p><blockquote><p>Checking reviews is part of my monthly “business” I take care of along with paying bills, etc. That’s why seeing so many folks up in arms on Facebook and elsewhere about it brought me up short. It also had me thinking about who the people were, what their relationships with one another might be and then it sent me scurrying to the Amazon TOS for authors and for reviews.</p><p>In this case, all my questions were answered in the “Customer Reviews Guidelines Frequently Asked Questions from Authors“. If you haven’t read these FAQs recently, I recommend you do so. Amazon makes it clear what their rules are. Below are a few of the most important ones.</p><p><i><b>2. Are authors allowed to review other authors’ books?</b></i><br><i>Yes. Authors are welcome to submit Customer Reviews, unless the reviewing author has a personal relationship with the author of the book being reviewed, or was involved in the book’s creation process (i.e. as a co-author, editor, illustrator, etc.). If so, that author isn’t eligible to write a Customer Review for that book. </i></br></p><p><i><b>3. Can I ask my family to write a Customer Review for my book?</b></i><br><i>We don’t allow individuals who share a household with the author or close friends to write Customer Reviews for that author’s book. Customer Reviews provide unbiased product feedback from fellow shoppers and aren’t to be used as a promotional tool.</i></br></p></blockquote><p>However, the fact that Jon Del Arroz’s reviews were restored upon review by an Amazon manager, as were some of the reviews of Declan Finn’s books, indicates that there was probably more going on than just legitimate TOS policing. My guess is that a rogue Amazon employee took it upon himself to take advantage of the opening being given to him by TOS-violating reviewers, but got carried away and ended up deleting a number of reviews that were not in violation of the terms of service as well.</p><p>This leads me to two conclusions. First, reviews are considered very important by SJWs. Therefore, culture warriors should be diligent about posting Amazon reviews of books that they read. Even if it’s only a short, one-paragraph review that only takes a minute to post, it will help build up the total number of reviews as well as bolster the book’s average rating against fake reviews meant to lower it.</p><p>Second, when you are dealing with an SJW-amenable authority, or even just an authority that happens to employ an SJW, <i>you must keep your nose clean</i>. Don’t push the envelope with regards to the posted rules and regulations. Don’t give them an excuse to crack down, because when they do, they may not stop with your infractions, but cross the line themselves.</p></div>",
  "content_text": "The Conservative Libertarian Fiction Alliance is alarmed over\na recent mass deletion\nof Amazon book reviews:\nAmazon frightened many conservative authors this week in a mass deletion of reviews. Some authors lost almost 100 reviews on their published works. Others lost all the reviews they had ever written on Amazon. Some lost both. Information about the purge began to trickle out in the closed Conservative Libertarian Fiction Alliance (CLFA) Facebook group. Member after member began reporting the losses at the same time. Marina Fontaine, whose credits include the dystopian Chasing Freedom, the pro-Trump fiction anthology MAGA 2020, and moderating the CLFA page reported many members experiencing losses. A coordinated effort was launched to contact Amazon for explanation. Jon Del Arroz, a science fiction author who was banned from Worldcon earlier this year, contacted Amazon directly asking for his reviews to be reinstated. Amazon responded:\nAt this time, we’ve reviewed your feedback and ensured that appropriate action is taken.  There may be times that reviews must be removed from the site.  Unfortunately, we won’t be able to discuss the specifics about why the reviews were removed as we’ll only be able to discuss that with the individuals who posted the reviews.  They’re welcome to contact us if they’d like additional information.\nDel Arroz’s reviews were reinstated but the corporate response is less than satisfying to conservatives who know their freedom of speech is under constant attack from SJWs in a big tech industry that rules the socials and platforms writers need to connect with their audience.\nOf course, the mere fact that there is a closed alliance of authors with personal relationships who pay very close attention to reviews may explain at least a reasonable percentage of these deletions, given the terms of service. I checked out my reviews and it looks like ten or fewer reviews were deleted across all my various book listings. Not only that, but several of the reviews were one-star fake reviews, so two of my average ratings actually increased. This made me suspect that the deleted reviews were likely in open violation of Amazon’s terms of service, which\nAmanda Green’s investigation\nappears to have generally confirmed.\nChecking reviews is part of my monthly “business” I take care of along with paying bills, etc. That’s why seeing so many folks up in arms on Facebook and elsewhere about it brought me up short. It also had me thinking about who the people were, what their relationships with one another might be and then it sent me scurrying to the Amazon TOS for authors and for reviews.\nIn this case, all my questions were answered in the “Customer Reviews Guidelines Frequently Asked Questions from Authors“. If you haven’t read these FAQs recently, I recommend you do so. Amazon makes it clear what their rules are. Below are a few of the most important ones.\n2. Are authors allowed to review other authors’ books?\nYes. Authors are welcome to submit Customer Reviews, unless the reviewing author has a personal relationship with the author of the book being reviewed, or was involved in the book’s creation process (i.e. as a co-author, editor, illustrator, etc.). If so, that author isn’t eligible to write a Customer Review for that book.\n3. Can I ask my family to write a Customer Review for my book?\nWe don’t allow individuals who share a household with the author or close friends to write Customer Reviews for that author’s book. Customer Reviews provide unbiased product feedback from fellow shoppers and aren’t to be used as a promotional tool.\nHowever, the fact that Jon Del Arroz’s reviews were restored upon review by an Amazon manager, as were some of the reviews of Declan Finn’s books, indicates that there was probably more going on than just legitimate TOS policing. My guess is that a rogue Amazon employee took it upon himself to take advantage of the opening being given to him by TOS-violating reviewers, but got carried away and ended up deleting a number of reviews that were not in violation of the terms of service as well.\nThis leads me to two conclusions. First, reviews are considered very important by SJWs. Therefore, culture warriors should be diligent about posting Amazon reviews of books that they read. Even if it’s only a short, one-paragraph review that only takes a minute to post, it will help build up the total number of reviews as well as bolster the book’s average rating against fake reviews meant to lower it.\nSecond, when you are dealing with an SJW-amenable authority, or even just an authority that happens to employ an SJW,\nyou must keep your nose clean\n. Don’t push the envelope with regards to the posted rules and regulations. Don’t give them an excuse to crack down, because when they do, they may not stop with your infractions, but cross the line themselves.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-17T15:10:26+00:00"
}