{
  "url": "https://voxday.net/2018/03/13/the-print-editions-arrive/",
  "scraped_at": "2025-12-19T10:46:46.948362",
  "title": "The print editions arrive",
  "date_display": "March 13, 2018",
  "date_iso": "2018-03-13T13:41:39+00:00",
  "date_from_url": "2018-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh from the new forums, Vulcha reports <a href=\"http://forum.altherocomics.com/viewtopic.php?f=15&amp;t=24&amp;sid=f46fbb6e6f7b236b64661211cc44fdac#p232\">the arrival of the first print editions</a> of <i>QUANTUM MORTIS A Man Disrupted #1</i>:</p><blockquote class=\"tr_bq\"><p>Looky looky what I got today. I was very surprised at the quality. The covers are super sturdy and the interior is superb. Much better than I anticipated. Not sure why I expected otherwise. I’ll be keeping a few and distributing the rest. </p></blockquote><p>He might want to hang on to a few of those issues marked $2.99 because they will serve much the same purpose as the gold logos. Due to the vagaries of Ingram’s discount structure, we have had to change the retail price to $3.00, which is why future issues, and future editions of the first issue, will not feature a price marked on the cover.</p><p>That discount issue is, in part, what has caused the delay of orders made through Amazon, although I have been informed that it’s also connected to a much bigger Amazon problem that has nothing to do with us or Ingram. So, at least until they get that straightened out, I would recommend ordering Arkhaven comics through the <a href=\"https://aerbook.com/maker/productcard-3684040-1875.html\">Castalia Books Direct</a> store.</p><p>They certainly look good, though! As for the sturdiness of the covers, they are not the flimsy coated gloss paper used for normal comics, but are the same rigid construction of a normal trade paperback. If you’ve received your print editions already, please feel free to share your thoughts on the manufacturing and print quality here. I’m still waiting for mine.</p></div>",
  "content_text": "Fresh from the new forums, Vulcha reports\nthe arrival of the first print editions\nof\nQUANTUM MORTIS A Man Disrupted #1\n:\nLooky looky what I got today. I was very surprised at the quality. The covers are super sturdy and the interior is superb. Much better than I anticipated. Not sure why I expected otherwise. I’ll be keeping a few and distributing the rest.\nHe might want to hang on to a few of those issues marked $2.99 because they will serve much the same purpose as the gold logos. Due to the vagaries of Ingram’s discount structure, we have had to change the retail price to $3.00, which is why future issues, and future editions of the first issue, will not feature a price marked on the cover.\nThat discount issue is, in part, what has caused the delay of orders made through Amazon, although I have been informed that it’s also connected to a much bigger Amazon problem that has nothing to do with us or Ingram. So, at least until they get that straightened out, I would recommend ordering Arkhaven comics through the\nCastalia Books Direct\nstore.\nThey certainly look good, though! As for the sturdiness of the covers, they are not the flimsy coated gloss paper used for normal comics, but are the same rigid construction of a normal trade paperback. If you’ve received your print editions already, please feel free to share your thoughts on the manufacturing and print quality here. I’m still waiting for mine.",
  "tags": [
    "Arkhaven"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-13T13:41:39+00:00"
}