{
  "url": "https://voxday.net/2018/03/03/the-emotional-continence-of-little-girls/",
  "scraped_at": "2025-12-19T10:45:41.451483",
  "title": "The emotional continence of little girls",
  "date_display": "March 3, 2018",
  "date_iso": "2018-03-03T18:12:49+00:00",
  "date_from_url": "2018-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you ever wonder why I’m still around while the various bloggers of yesteryears past have mostly gone by the wayside over time, <a href=\"http://thezman.com/wordpress/?p=13049\">this shrieking overreaction by the Z-Man</a> to the God-Emperor’s latest apparent blunder should serve as a reasonable explanation.</p><blockquote><p>This jackass has undone generations of hard work by the very people who put him in office. Not even that feckless nitwit George Bush did something this egregiously stupid. Even Barak Obama was unwilling to go this far. This idiocy is right up there with Poppy Bush breaking his tax promise in order to get the Democrats in Washington to like him. It worked. They loved him, which was why he was a one term president. Trump is now setting himself up to follow Bush into the void of stupidity.</p><p>Now, the counter argument you will hear is that Trump is just playing more 4-D chess and this will amount to nothing. Well, a smart politicians would know enough to not do that with this issue. This is not a parlor game. The pro-gun voter has no sense of humor on this stuff and they have zero tolerance for limp-wristed politicians too afraid of the girls to do the right thing. Speaking only for myself, I’d vote for a gay black Muslim over Trump right now. That’s right. I’d vote for Obama over Trump, just to send the 2A message.</p><p>I think everyone who voted for Trump understood they were getting a guy who would be long on bullshit and short of tangible accomplishments. The point of voting for him was to send a message, but also legitimize populist issues. Trump was the guy who would flip over the tables and discredit the status quo, opening the door for ambitious politicians to run on patriotic issues like immigration reform. Trump would build his wall, end some of the egregious immigration abuses, but the real work would be up to those who come next.</p><p>So far, Trump is looking like he is not going to deliver anything other than blowing his own horn every day and maybe dodging prison in the Mueller probe. Worse yet, the trade-off for his vanity will be the undermining of the one cause that truly defines what’s left of old stock America. By legitimizing gun-grabbing and executive fiat, he has just made it possible for the next President Obama to DACA the gun issue, by issuing new gun laws via executive order. Trump is proving to be one step forward and ten steps backward.</p><p>The one lesson of the Trump era is to not put too much stock in what Trump says. He is, after all, a bullshitter. He’s also a guy who will wheel on a dime if he senses he is on the wrong side. He is rather shameless in that regard. Still, the damage he has done to the cause of gun rights is incalculable and it will not be forgotten. Unless he eventually signs off on some bold pro-gun laws, lots of his voters will choose to spend the election day at the range come 2020, rather than cast a vote for a duplicitous gun grabber.</p></blockquote><p>And Trump can never break 35 percent, never win the nomination, blah freaking blah. Didn’t we literally just go through this with DACA and the Dreamers? Do the shrieking little girls of the Right never learn that politicians sometimes say things that are not true?</p><p>Now, I don’t like Trump’s response to the post-Parkland media campaign either. And I can assure you that the response that I recommend would have been considerably more forthright than anything I’ve seen the Z-man or anyone else advise, which is apparently to do nothing and trust the states.</p><p><i>On an issue like guns, doing nothing is usually the best course. Most states are sensible on guns, so letting the states handle it is good for us.</i><br><i><br/></i><a href=\"http://www.alloutdoor.com/2018/03/01/incredible-anti-gun-bill-introduced-mn/?utm_source=Newsletter&amp;utm_medium=Email&amp;utm_content=2018-03-03&amp;utm_campaign=Weekly+Newsletter\">Not necessarily</a>. In any event, this is what I would advise instead of doing nothing and trusting the states to be sensible.</br></p><ol><li>Arrest Dan Israel, take Nikolas Cruz into custody, stop the demolition of the school, and order an investigation into the Broward County Sheriff’s Office, the Secret Service, and every other federal, state, local agency that had any contact with that school in the last six months. Then publish the results of the investigation and have the DOJ prosecute the various guilty parties.</li><li>Criminalize the public advocacy of gun control, using the anti-BDS template. Any television or radio station advocating gun control would lose its broadcasting license. Any corporation advocating gun control would lose its federal contracts.</li><li>Announce mandatory carry reciprocity between states on pain of losing federal highway funds.</li><li>Stop all federal funding to all universities, colleges, and schools that ban guns on campus.</li><li>Announce an executive order suspending all state and local gun control laws.</li></ol><div>So, let’s not pretend that I’m not as hard core and absolutist about gun rights as anyone else. That being said, <a href=\"http://www.unz.com/jderbyshire/im-not-giving-up-my-guns-time-to-dump-trump/\">John Derbyshire is right</a>. Who else do we have besides Trump? There is no point in taking your ball and going home, because unless you are actually going to go out and take action to shut down the gun control advocates by yourself, the God-Emperor is literally all we have on the political front.<p>I’m not saying that we should support him in even speaking soothing words to the insane people who want to kill him and impose a violent dictatorship on a disarmed American people. I’m not saying that I think his actions are wise, well-advised, or even sensible. I’m not saying that one shouldn’t feel discouraged, annoyed, or even angry about what looks very much like a foolish and unnecessarily damaging political blunder.</p><p>But I am saying that it accomplishes nothing to throw a tantrum and very publicly withdraw your support from the God-Emperor, especially when we all know that you’re going to be slinking back and hoping that no one notices when you try to quietly clamber back aboard the Trump Train rather than be left behind with Ben Shapiro, Bill Kristol, Mona Charen, Rick Wilson, and all the rest of the Never-Trump losers.</p><p>At the very least, wait until Trump <i>actually does something</i> rather than merely makes another of his self-contradictory public statements before you reach any firm conclusions about his actual intentions or the probable consequences.</p></div></div>",
  "content_text": "If you ever wonder why I’m still around while the various bloggers of yesteryears past have mostly gone by the wayside over time,\nthis shrieking overreaction by the Z-Man\nto the God-Emperor’s latest apparent blunder should serve as a reasonable explanation.\nThis jackass has undone generations of hard work by the very people who put him in office. Not even that feckless nitwit George Bush did something this egregiously stupid. Even Barak Obama was unwilling to go this far. This idiocy is right up there with Poppy Bush breaking his tax promise in order to get the Democrats in Washington to like him. It worked. They loved him, which was why he was a one term president. Trump is now setting himself up to follow Bush into the void of stupidity.\nNow, the counter argument you will hear is that Trump is just playing more 4-D chess and this will amount to nothing. Well, a smart politicians would know enough to not do that with this issue. This is not a parlor game. The pro-gun voter has no sense of humor on this stuff and they have zero tolerance for limp-wristed politicians too afraid of the girls to do the right thing. Speaking only for myself, I’d vote for a gay black Muslim over Trump right now. That’s right. I’d vote for Obama over Trump, just to send the 2A message.\nI think everyone who voted for Trump understood they were getting a guy who would be long on bullshit and short of tangible accomplishments. The point of voting for him was to send a message, but also legitimize populist issues. Trump was the guy who would flip over the tables and discredit the status quo, opening the door for ambitious politicians to run on patriotic issues like immigration reform. Trump would build his wall, end some of the egregious immigration abuses, but the real work would be up to those who come next.\nSo far, Trump is looking like he is not going to deliver anything other than blowing his own horn every day and maybe dodging prison in the Mueller probe. Worse yet, the trade-off for his vanity will be the undermining of the one cause that truly defines what’s left of old stock America. By legitimizing gun-grabbing and executive fiat, he has just made it possible for the next President Obama to DACA the gun issue, by issuing new gun laws via executive order. Trump is proving to be one step forward and ten steps backward.\nThe one lesson of the Trump era is to not put too much stock in what Trump says. He is, after all, a bullshitter. He’s also a guy who will wheel on a dime if he senses he is on the wrong side. He is rather shameless in that regard. Still, the damage he has done to the cause of gun rights is incalculable and it will not be forgotten. Unless he eventually signs off on some bold pro-gun laws, lots of his voters will choose to spend the election day at the range come 2020, rather than cast a vote for a duplicitous gun grabber.\nAnd Trump can never break 35 percent, never win the nomination, blah freaking blah. Didn’t we literally just go through this with DACA and the Dreamers? Do the shrieking little girls of the Right never learn that politicians sometimes say things that are not true?\nNow, I don’t like Trump’s response to the post-Parkland media campaign either. And I can assure you that the response that I recommend would have been considerably more forthright than anything I’ve seen the Z-man or anyone else advise, which is apparently to do nothing and trust the states.\nOn an issue like guns, doing nothing is usually the best course. Most states are sensible on guns, so letting the states handle it is good for us.\nNot necessarily\n. In any event, this is what I would advise instead of doing nothing and trusting the states to be sensible.\nArrest Dan Israel, take Nikolas Cruz into custody, stop the demolition of the school, and order an investigation into the Broward County Sheriff’s Office, the Secret Service, and every other federal, state, local agency that had any contact with that school in the last six months. Then publish the results of the investigation and have the DOJ prosecute the various guilty parties.\nCriminalize the public advocacy of gun control, using the anti-BDS template. Any television or radio station advocating gun control would lose its broadcasting license. Any corporation advocating gun control would lose its federal contracts.\nAnnounce mandatory carry reciprocity between states on pain of losing federal highway funds.\nStop all federal funding to all universities, colleges, and schools that ban guns on campus.\nAnnounce an executive order suspending all state and local gun control laws.\nSo, let’s not pretend that I’m not as hard core and absolutist about gun rights as anyone else. That being said,\nJohn Derbyshire is right\n. Who else do we have besides Trump? There is no point in taking your ball and going home, because unless you are actually going to go out and take action to shut down the gun control advocates by yourself, the God-Emperor is literally all we have on the political front.\nI’m not saying that we should support him in even speaking soothing words to the insane people who want to kill him and impose a violent dictatorship on a disarmed American people. I’m not saying that I think his actions are wise, well-advised, or even sensible. I’m not saying that one shouldn’t feel discouraged, annoyed, or even angry about what looks very much like a foolish and unnecessarily damaging political blunder.\nBut I am saying that it accomplishes nothing to throw a tantrum and very publicly withdraw your support from the God-Emperor, especially when we all know that you’re going to be slinking back and hoping that no one notices when you try to quietly clamber back aboard the Trump Train rather than be left behind with Ben Shapiro, Bill Kristol, Mona Charen, Rick Wilson, and all the rest of the Never-Trump losers.\nAt the very least, wait until Trump\nactually does something\nrather than merely makes another of his self-contradictory public statements before you reach any firm conclusions about his actual intentions or the probable consequences.",
  "tags": [
    "guncontrol"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-03T18:12:49+00:00"
}