{
  "url": "https://voxday.net/2018/03/12/they-wish/",
  "scraped_at": "2025-12-19T10:46:40.996493",
  "title": "They wish",
  "date_display": "March 12, 2018",
  "date_iso": "2018-03-12T15:15:01+00:00",
  "date_from_url": "2018-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is precisely why the media <a href=\"https://forward.com/news/national/396027/does-richard-spencers-disastrous-college-tour-mean-the-alt-right-is-fizzlin/\">anoints opposition leaders</a>. To pronounce the undesirable ideas dead as soon as an individual’s popularity inevitably fades.</p><blockquote><p>Does Richard Spencer’s Disastrous College Tour Mean The ‘Alt-Right’ Is Fizzling Out?</p><p>Less than a year ago, Richard Spencer led hundreds of angry white nationalists through the streets of Charlottesville, Virginia. This week, he spoke in a barn to only a few dozen people. And that was only after he tried to give away tickets outside a local Macy’s.</p><p>Spencer’s planned college speaking tour, which he hyped as a force multiplier for his message among the young men who are most receptive to it, has disappointed him. Its failure is a sign that Spencer might have hit a roadblock in his quest for more mainstream acceptance.</p></blockquote><p>It’s rather amusing to witness such wishful thinking, considering that the Alt-Right in its true nationalist, post-conservative form has not even peaked in terms of its global popularity. Spencer was never of the Right from the start. The fact that he has been largely abandoned by the Right doesn’t mean that the post-conservative Right is fizzling out, it means that the Fake Right has been figured out.</p><p>As I have said many times,<i> the labels are irrelevant</i>. It doesn’t matter if we are called Alt Right, alternative Right, New Right, post-conservative Right, Real Right, Neo-Nationalists, or whatever else can be concocted by someone’s imagination. Just like it doesn’t matter if the other side is known as liberals, progressives, socialists, leftists, Trotskyites, neocons, globalists, futurians, or whatever else they are calling themselves today. It is the <i>ideas </i>that matter, not the labels, not the symbols, and not the people.</p><p>Does it matter whether one refers to the law of excluded middle, the principle of excluded middle, the law of the excluded third, the principium tertii exclusi, the tertium non datur, or X!=Not X? Not at all. Does it matter if one learned it from Aristotle, Bertrand Russell, or Winnie the Pooh? Again, no.</p><p>Who is the leader of capitalism? Who is the leader of progressivism? Who is the leader of stoicism, or socialism, or rational empiricism? To even ask the question is to commit a category error. And remember, even something as simple as <i>the party colors</i> of red for Democrats and blue for Republicans <a href=\"https://www.smithsonianmag.com/history/when-republicans-were-blue-and-democrats-were-red-104176297/\">were switched on us</a> by the media in the 2000s.</p><p>The only thing that matters is the heart of the philosophy, which is post-conservative, pro-West Christian nationalism. It is not new and it will remain relevant, no matter what it is called and no matter who supports it.</p></div>",
  "content_text": "This is precisely why the media\nanoints opposition leaders\n. To pronounce the undesirable ideas dead as soon as an individual’s popularity inevitably fades.\nDoes Richard Spencer’s Disastrous College Tour Mean The ‘Alt-Right’ Is Fizzling Out?\nLess than a year ago, Richard Spencer led hundreds of angry white nationalists through the streets of Charlottesville, Virginia. This week, he spoke in a barn to only a few dozen people. And that was only after he tried to give away tickets outside a local Macy’s.\nSpencer’s planned college speaking tour, which he hyped as a force multiplier for his message among the young men who are most receptive to it, has disappointed him. Its failure is a sign that Spencer might have hit a roadblock in his quest for more mainstream acceptance.\nIt’s rather amusing to witness such wishful thinking, considering that the Alt-Right in its true nationalist, post-conservative form has not even peaked in terms of its global popularity. Spencer was never of the Right from the start. The fact that he has been largely abandoned by the Right doesn’t mean that the post-conservative Right is fizzling out, it means that the Fake Right has been figured out.\nAs I have said many times,\nthe labels are irrelevant\n. It doesn’t matter if we are called Alt Right, alternative Right, New Right, post-conservative Right, Real Right, Neo-Nationalists, or whatever else can be concocted by someone’s imagination. Just like it doesn’t matter if the other side is known as liberals, progressives, socialists, leftists, Trotskyites, neocons, globalists, futurians, or whatever else they are calling themselves today. It is the\nideas\nthat matter, not the labels, not the symbols, and not the people.\nDoes it matter whether one refers to the law of excluded middle, the principle of excluded middle, the law of the excluded third, the principium tertii exclusi, the tertium non datur, or X!=Not X? Not at all. Does it matter if one learned it from Aristotle, Bertrand Russell, or Winnie the Pooh? Again, no.\nWho is the leader of capitalism? Who is the leader of progressivism? Who is the leader of stoicism, or socialism, or rational empiricism? To even ask the question is to commit a category error. And remember, even something as simple as\nthe party colors\nof red for Democrats and blue for Republicans\nwere switched on us\nby the media in the 2000s.\nThe only thing that matters is the heart of the philosophy, which is post-conservative, pro-West Christian nationalism. It is not new and it will remain relevant, no matter what it is called and no matter who supports it.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-12T15:15:01+00:00"
}