{
  "url": "https://voxday.net/2018/03/21/trump-leaves-may-hanging-out-to-dry/",
  "scraped_at": "2025-12-19T20:53:39.462812",
  "title": "Trump leaves May hanging out to dry",
  "date_display": "March 21, 2018",
  "date_iso": "2018-03-21T12:00:20+00:00",
  "date_from_url": "2018-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m getting a little tired of people who are dumb enough to keep lunging at the first word that comes out of Trump’s mouth when he is confronted by the media about some new development. OF COURSE HE DOESN’T TELL THEM THE TRUTH! If the God-Emperor was in the habit of practicing perfect honesty when speaking to a group of people who are out to destroy him, he wouldn’t have been nominated, let alone elected. FFS, he’s been President for over a year now, have you learned nothing about how the man operates?</p><p>Meanwhile, the British media is freaking out because despite whatever he is supposed to have told Theresa May, President Trump has made it eminently clear that he has no intention whatsoever <a href=\"http://www.dailymail.co.uk/news/article-5526151/Trump-defies-aides-congratulate-Putin-election-victory.html\">of backing Britain in their idiotic neocon-inspired war on Russia</a>:</p><blockquote><p>Trump defies aides to congratulate Putin on election ‘victory’ in phone call and fails to challenge him over Salisbury nerve agent outrage. Donald Trump congratulated Vladimir Putin on reelection in telephone call. Overture will fuel fears that allies’ support for Britain is less than full-hearted.</p><p>Donald Trump has risked a split with Britain by congratulating Vladimir Putin on his re-election – and failing to mention the Salisbury nerve agent scandal. The US president seemingly defied the advice of aides to praise Mr Putin in a phone call despite UK fury at Russia’s involvement in the poisoning of a former spy. Mr Trump did not challenge his counterpart over the outrage on British soil, and said afterwards that they had a ‘very good call’.</p><p>The news will raise fresh concerns about the commitment of the UK’s allies to hold Russia to account over the use of military-grade Novichok poison against Sergei Skripal and his daughter Yulia.</p></blockquote><p>Translation: the president knows perfectly well that Russia was not responsible and that it was a false flag. Now, here is a heuristic that I have found very useful in understanding the words and actions of Donald Trump. If he has said two contradictory things, and one of them is to his base and the other is to the media, <i>the thing that will be false is what he is telling the media.  </i>Because unlike Clinton and Obama, the media is not on his side. Unlike Bush and Bush, he knows that the media is not on his side.</p><p>Meanwhile, the God-Emperor would do well to fire those treacherous aides who are seeking to push war with Russia Russia Russia. It won’t surprise me if he does, or to learn that he used the episode to smoke out more Deep Staters in his employ.</p></div>",
  "content_text": "I’m getting a little tired of people who are dumb enough to keep lunging at the first word that comes out of Trump’s mouth when he is confronted by the media about some new development. OF COURSE HE DOESN’T TELL THEM THE TRUTH! If the God-Emperor was in the habit of practicing perfect honesty when speaking to a group of people who are out to destroy him, he wouldn’t have been nominated, let alone elected. FFS, he’s been President for over a year now, have you learned nothing about how the man operates?\nMeanwhile, the British media is freaking out because despite whatever he is supposed to have told Theresa May, President Trump has made it eminently clear that he has no intention whatsoever\nof backing Britain in their idiotic neocon-inspired war on Russia\n:\nTrump defies aides to congratulate Putin on election ‘victory’ in phone call and fails to challenge him over Salisbury nerve agent outrage. Donald Trump congratulated Vladimir Putin on reelection in telephone call. Overture will fuel fears that allies’ support for Britain is less than full-hearted.\nDonald Trump has risked a split with Britain by congratulating Vladimir Putin on his re-election – and failing to mention the Salisbury nerve agent scandal. The US president seemingly defied the advice of aides to praise Mr Putin in a phone call despite UK fury at Russia’s involvement in the poisoning of a former spy. Mr Trump did not challenge his counterpart over the outrage on British soil, and said afterwards that they had a ‘very good call’.\nThe news will raise fresh concerns about the commitment of the UK’s allies to hold Russia to account over the use of military-grade Novichok poison against Sergei Skripal and his daughter Yulia.\nTranslation: the president knows perfectly well that Russia was not responsible and that it was a false flag. Now, here is a heuristic that I have found very useful in understanding the words and actions of Donald Trump. If he has said two contradictory things, and one of them is to his base and the other is to the media,\nthe thing that will be false is what he is telling the media.\nBecause unlike Clinton and Obama, the media is not on his side. Unlike Bush and Bush, he knows that the media is not on his side.\nMeanwhile, the God-Emperor would do well to fire those treacherous aides who are seeking to push war with Russia Russia Russia. It won’t surprise me if he does, or to learn that he used the episode to smoke out more Deep Staters in his employ.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-21T12:00:20+00:00"
}