{
  "url": "https://voxday.net/2018/03/14/who-owns-the-future/",
  "scraped_at": "2025-12-19T10:46:51.599394",
  "title": "Who owns the future?",
  "date_display": "March 14, 2018",
  "date_iso": "2018-03-14T00:06:04+00:00",
  "date_from_url": "2018-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan observes that the central struggle for the future of the West <a href=\"http://www.unz.com/pbuchanan/globalists-nationalists-who-owns-the-future/\">is now between globalists and nationalists</a>:</p><blockquote><p>Robert Bartley, the late editorial page editor of The Wall Street Journal, was a free trade zealot who for decades championed a five-word amendment to the Constitution: “There shall be open borders.”</p><p>Bartley accepted what the erasure of America’s borders and an endless influx or foreign peoples and goods would mean for his country.</p><p>Said Bartley, “I think the nation-state is finished.”</p><p>His vision and ideology had a long pedigree.</p><p>This free trade, open borders cult first flowered in 18th-century Britain. The St. Paul of this post-Christian faith was Richard Cobden, who mesmerized elites with the grandeur of his vision and the power of his rhetoric.</p><p>In Free Trade Hall in Manchester, Jan. 15, 1846, the crowd was so immense the seats had to be removed. There, Cobden thundered:</p><p>“I look farther; I see in the Free Trade principle that which shall act on the moral world as the principle of gravitation in the universe — drawing men together, thrusting aside the antagonisms of race, and creed, and language, and uniting us in the bonds of eternal peace.”</p><p>Britain converted to this utopian faith and threw open her markets to the world. Across the Atlantic, however, another system, that would be known as the “American System,” had been embraced.</p><p>The second bill signed by President Washington was the Tariff Act of 1789. Said the Founding Father of his country in his first address to Congress: “A free people … should promote such manufactures as tend to make them independent on others for essential, particularly military supplies.”</p></blockquote><p>What is disturbing to me is how fundamentally <i>dishonest </i>the advocates of free trade are. The more intelligent and insightful of them know that what they are advocating necessarily means the end of the nation-state and the end of the nations, but they are intent on hiding that reality because they know how unpopular it is with the vast majority of the population in every nation.</p><p>Sure, if you press them hard enough they will admit that national borders are just “a line on a map” and that they don’t care at all about their fellow citizens, but they certainly aren’t going to publicly own up to the destruction that is inherent in their economic vision.</p><p>But the globalists will fail for the same reason that the communists failed and the feminists are failing. Eventually, the weight of the contradictions and the falsehoods will cause their system to collapse.</p><p>The future belongs to the nations. Deus le vult.</p></div>",
  "content_text": "Pat Buchanan observes that the central struggle for the future of the West\nis now between globalists and nationalists\n:\nRobert Bartley, the late editorial page editor of The Wall Street Journal, was a free trade zealot who for decades championed a five-word amendment to the Constitution: “There shall be open borders.”\nBartley accepted what the erasure of America’s borders and an endless influx or foreign peoples and goods would mean for his country.\nSaid Bartley, “I think the nation-state is finished.”\nHis vision and ideology had a long pedigree.\nThis free trade, open borders cult first flowered in 18th-century Britain. The St. Paul of this post-Christian faith was Richard Cobden, who mesmerized elites with the grandeur of his vision and the power of his rhetoric.\nIn Free Trade Hall in Manchester, Jan. 15, 1846, the crowd was so immense the seats had to be removed. There, Cobden thundered:\n“I look farther; I see in the Free Trade principle that which shall act on the moral world as the principle of gravitation in the universe — drawing men together, thrusting aside the antagonisms of race, and creed, and language, and uniting us in the bonds of eternal peace.”\nBritain converted to this utopian faith and threw open her markets to the world. Across the Atlantic, however, another system, that would be known as the “American System,” had been embraced.\nThe second bill signed by President Washington was the Tariff Act of 1789. Said the Founding Father of his country in his first address to Congress: “A free people … should promote such manufactures as tend to make them independent on others for essential, particularly military supplies.”\nWhat is disturbing to me is how fundamentally\ndishonest\nthe advocates of free trade are. The more intelligent and insightful of them know that what they are advocating necessarily means the end of the nation-state and the end of the nations, but they are intent on hiding that reality because they know how unpopular it is with the vast majority of the population in every nation.\nSure, if you press them hard enough they will admit that national borders are just “a line on a map” and that they don’t care at all about their fellow citizens, but they certainly aren’t going to publicly own up to the destruction that is inherent in their economic vision.\nBut the globalists will fail for the same reason that the communists failed and the feminists are failing. Eventually, the weight of the contradictions and the falsehoods will cause their system to collapse.\nThe future belongs to the nations. Deus le vult.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-14T00:06:04+00:00"
}