{
  "url": "https://voxday.net/2018/03/04/zero-cultural-power/",
  "scraped_at": "2025-12-19T10:45:47.356580",
  "title": "Zero cultural power",
  "date_display": "March 4, 2018",
  "date_iso": "2018-03-04T20:40:54+00:00",
  "date_from_url": "2018-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><i><a href=\"https://aerbook.com/maker/productcard-3339756-1875.html\">Appendix N</a></i></b> author Jeffro Johnson takes David Brooks to task for a shockingly ignorant statement about <a href=\"https://jeffro.wordpress.com/2018/03/03/why-conservatives-have-zero-cultural-power/\">the cultural power of conservatives</a>:</p><blockquote><p>Writing in the pages of <i>The New York Times</i>, conservative commentator David Brooks closes out a column with this striking kicker:</p><p><i>Conservatives have zero cultural power, but they have immense political power. Even today, voters trust Republicans on the gun issue more than Democrats. If you exile 40 percent of the country from respectable society they will mount a political backlash that will make Donald Trump look like Adlai Stevenson.</i></p><p>It’s audacious, really. I mean sure, non-leftists have been steadily filtered out of education, academia, journalism, publishing, Hollywood, and the arts for so long that most people can’t even imagine it being any different. But zero? Really?</p><p>It takes a special sort of ignorance to embrace such a position. Even the residual power of Tarzan, Cthulhu, Middle Earth, and Conan remains a potent force, even in a marketplace flooded with both bastardized derivatives and hostile critiques. Smarmy elites dismissed the staunchly Catholic Tolkien in his lifetime and declared heroic fantasy bad for us from every platform they could manage to subdue. And yet he outlasted all of his detractors to become Author of the Century. And right at this very moment, Jordan Peterson’s number one international bestselling book is a sensation precisely because it is making the timeless wisdom that infuses the Bible accessible to a generation that is starving for answers and common sense.</p></blockquote><p>The reason the ideological Right has limited cultural power these days is because the Left, with (((David Brooks))) and his nation in the vanguard, have worked very hard for at least four generations at attempting to eradicate everything from the culture that betrays any sign of Christian influence or Western tradition.</p><p>And the reason that they are failing despite their near-complete control of the cultural high ground is because they have literally <i>nothing </i>to offer in its place. All they ever had to offer was reaction, negation, ugliness, filth, and snark. Sure, you can adulterate Christmas, and you can substitute Silver Bells, shopping, Santa, and Seasons Greetings for Silent Night, Hark the Herald Angels Sing, Scrooge, and We Wish You a Merry Christmas, but at the end of the day, either you come up with a substitute or your efforts will eventually prove futile.</p><p>What did they come up with in over a century of frantic effort? Festivus, the Hannukah Aardvark, and horrible movies that are bad even by Seth Rogen’s standards. Hardly an attractive exchange for even the most godless pagan.</p><p>We not only can win this cultural war, <i>we cannot lose it </i>so long as we continue to create things that are good, beautiful, and true, and continue to refuse entrance to the infiltrating wormtongues who are always there with their helpful blandishments and seductive offers to sell your creative soul to Mammon.</p><p>So let them turn Elsa of the Crowleyesque anthem into a lesbian. Let them transform Superman into an SJW superhero fighting for global migration, one-world government, and AIPAC. Let them continue to preen and posture and sneer and snark in futility. It will avail them nothing. Like their Father the Devil, <i>they cannot create</i>, they can only corrupt. And that is why the greatness of Tolkien, of Howard, of Lovecraft, and of Wright will continue to be recognized over time despite the Left’s best efforts to denigrate and diminish it.</p><p>Here are <a href=\"https://www.aerbook.com/store/castalia/Arkhaven_Comics/7135\">three more shots</a> in the cultural war for the West. Another will be fired tomorrow.</p><p>UPDATE: Jeffro <a href=\"https://jeffro.wordpress.com/2018/03/04/the-other-reason-conservatives-have-zero-cultural-power/\">responds to a defeatist gamma</a> who took exception to his post, then showed up here to lie about him.</p></div>",
  "content_text": "Appendix N\nauthor Jeffro Johnson takes David Brooks to task for a shockingly ignorant statement about\nthe cultural power of conservatives\n:\nWriting in the pages of\nThe New York Times\n, conservative commentator David Brooks closes out a column with this striking kicker:\nConservatives have zero cultural power, but they have immense political power. Even today, voters trust Republicans on the gun issue more than Democrats. If you exile 40 percent of the country from respectable society they will mount a political backlash that will make Donald Trump look like Adlai Stevenson.\nIt’s audacious, really. I mean sure, non-leftists have been steadily filtered out of education, academia, journalism, publishing, Hollywood, and the arts for so long that most people can’t even imagine it being any different. But zero? Really?\nIt takes a special sort of ignorance to embrace such a position. Even the residual power of Tarzan, Cthulhu, Middle Earth, and Conan remains a potent force, even in a marketplace flooded with both bastardized derivatives and hostile critiques. Smarmy elites dismissed the staunchly Catholic Tolkien in his lifetime and declared heroic fantasy bad for us from every platform they could manage to subdue. And yet he outlasted all of his detractors to become Author of the Century. And right at this very moment, Jordan Peterson’s number one international bestselling book is a sensation precisely because it is making the timeless wisdom that infuses the Bible accessible to a generation that is starving for answers and common sense.\nThe reason the ideological Right has limited cultural power these days is because the Left, with (((David Brooks))) and his nation in the vanguard, have worked very hard for at least four generations at attempting to eradicate everything from the culture that betrays any sign of Christian influence or Western tradition.\nAnd the reason that they are failing despite their near-complete control of the cultural high ground is because they have literally\nnothing\nto offer in its place. All they ever had to offer was reaction, negation, ugliness, filth, and snark. Sure, you can adulterate Christmas, and you can substitute Silver Bells, shopping, Santa, and Seasons Greetings for Silent Night, Hark the Herald Angels Sing, Scrooge, and We Wish You a Merry Christmas, but at the end of the day, either you come up with a substitute or your efforts will eventually prove futile.\nWhat did they come up with in over a century of frantic effort? Festivus, the Hannukah Aardvark, and horrible movies that are bad even by Seth Rogen’s standards. Hardly an attractive exchange for even the most godless pagan.\nWe not only can win this cultural war,\nwe cannot lose it\nso long as we continue to create things that are good, beautiful, and true, and continue to refuse entrance to the infiltrating wormtongues who are always there with their helpful blandishments and seductive offers to sell your creative soul to Mammon.\nSo let them turn Elsa of the Crowleyesque anthem into a lesbian. Let them transform Superman into an SJW superhero fighting for global migration, one-world government, and AIPAC. Let them continue to preen and posture and sneer and snark in futility. It will avail them nothing. Like their Father the Devil,\nthey cannot create\n, they can only corrupt. And that is why the greatness of Tolkien, of Howard, of Lovecraft, and of Wright will continue to be recognized over time despite the Left’s best efforts to denigrate and diminish it.\nHere are\nthree more shots\nin the cultural war for the West. Another will be fired tomorrow.\nUPDATE: Jeffro\nresponds to a defeatist gamma\nwho took exception to his post, then showed up here to lie about him.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-03-04T20:40:54+00:00"
}