{
  "url": "https://voxday.net/2005/07/06/cool-breeze/",
  "scraped_at": "2026-01-08T20:08:06.273468",
  "title": "A cool breeze",
  "date_display": "July 6, 2005",
  "date_iso": "2005-07-06T05:07:00+00:00",
  "date_from_url": "2005-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Old news, but I was both pleased and honored to be quoted by the infamous Mogambo Guru last week.  I have to confess that I was a little disturbed at how aptly the feudal system can be used to describe the modern American situation, but once you get your head past the substitution of multi-headed organizations for aristocratic individuals, it’s pretty obvious.</p><p>Mogambo was particularly astute with this particular observation: <em>“The Bank of England is shocked and aghast at the sudden rise in bankruptcies, and they are taking steps, so they say, to tighten lending standards to try and prevent more of them! Hahaha!  Too late!   At this stage of the game, or at any stage of any game, the only thing that the stupidity known as modern mainstream economics prescribes is more credit, not less! Hahaha!</em></p><p>The soothing and hollow words of the Bank of England notwithstanding, central banks always create more and more money and credit to keep the over-indebted economy from collapsing.”</p><p>This reminds me of what the Original Cyberpunk mentioned in an email last week: <em>“Top officials at the Federal Deposit Insurance Corp., which regulates national banks, on Monday dismissed fears that rising home prices nationwide reflect a speculative bubble ready to burst.”</em></p><p>What is that saying?  “Never believe anything until it’s been officially denied?</p></div>",
  "content_text": "Old news, but I was both pleased and honored to be quoted by the infamous Mogambo Guru last week.  I have to confess that I was a little disturbed at how aptly the feudal system can be used to describe the modern American situation, but once you get your head past the substitution of multi-headed organizations for aristocratic individuals, it’s pretty obvious.\nMogambo was particularly astute with this particular observation:\n“The Bank of England is shocked and aghast at the sudden rise in bankruptcies, and they are taking steps, so they say, to tighten lending standards to try and prevent more of them! Hahaha!  Too late!   At this stage of the game, or at any stage of any game, the only thing that the stupidity known as modern mainstream economics prescribes is more credit, not less! Hahaha!\nThe soothing and hollow words of the Bank of England notwithstanding, central banks always create more and more money and credit to keep the over-indebted economy from collapsing.”\nThis reminds me of what the Original Cyberpunk mentioned in an email last week:\n“Top officials at the Federal Deposit Insurance Corp., which regulates national banks, on Monday dismissed fears that rising home prices nationwide reflect a speculative bubble ready to burst.”\nWhat is that saying?  “Never believe anything until it’s been officially denied?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-06T04:07:00+00:00"
}