{
  "url": "https://voxday.net/2005/07/24/devil-in-seattle/",
  "scraped_at": "2026-01-08T20:09:20.468523",
  "title": "The devil in Seattle",
  "date_display": "July 24, 2005",
  "date_iso": "2005-07-24T09:39:00+00:00",
  "date_from_url": "2005-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Various organisations have criticised Microsoft <a href=\"http://news.zdnet.co.uk/business/0%2C39020645%2C39210396%2C00.htm\">for attempting to patent the creation of custom emoticons</a>.  The patent, which was published by the US patent office on Thursday, covers selecting pixels to create an emoticon image, assigning a character sequence to these pixels and reconstructing the emoticon after transmission.</p><p>Mark Taylor, the executive director of the Open Source Consortium, said on Friday said this is such a basic concept that he would not have been surprised to see it posted as a fictional patent on a technology site.</p><p>“I would have expected to see something like this suggested by one of our more immature community members as a joke on Slashdot, and probably would have chuckled at the absurdity of the notion. We now appear to be living in a world where even the most laughable paranoid fantasies about commercially controlling simple social concepts are being outdone in the real world by well-funded armies of lawyers on behalf of some of the most powerful companies on the planet,” said Taylor.</p></blockquote><p>Microsoft SOP:</p><p>1.  Discover something computer-related, usually several years late<br>2.  Copy it.<br>3.  Claim you invented and use lawyers to prevent others from using what you ripped off.</br></br></p><p>I was pleased to note that more than 50 percent of you are now using non-Microsoft browsers.  Let’s get that up to 100 percent!  If you’re still using Explorer – and I don’t know how you can stand it – I encourage you to switch to Opera or Firefox.</p><p>Microsoft isn’t a capitalist organization, it is a socialist-led technobureaucracy wrapped in a capitalist shroud.  Corporations are not capitalism.</p></div>",
  "content_text": "Various organisations have criticised Microsoft\nfor attempting to patent the creation of custom emoticons\n.  The patent, which was published by the US patent office on Thursday, covers selecting pixels to create an emoticon image, assigning a character sequence to these pixels and reconstructing the emoticon after transmission.\nMark Taylor, the executive director of the Open Source Consortium, said on Friday said this is such a basic concept that he would not have been surprised to see it posted as a fictional patent on a technology site.\n“I would have expected to see something like this suggested by one of our more immature community members as a joke on Slashdot, and probably would have chuckled at the absurdity of the notion. We now appear to be living in a world where even the most laughable paranoid fantasies about commercially controlling simple social concepts are being outdone in the real world by well-funded armies of lawyers on behalf of some of the most powerful companies on the planet,” said Taylor.\nMicrosoft SOP:\n1.  Discover something computer-related, usually several years late\n2.  Copy it.\n3.  Claim you invented and use lawyers to prevent others from using what you ripped off.\nI was pleased to note that more than 50 percent of you are now using non-Microsoft browsers.  Let’s get that up to 100 percent!  If you’re still using Explorer – and I don’t know how you can stand it – I encourage you to switch to Opera or Firefox.\nMicrosoft isn’t a capitalist organization, it is a socialist-led technobureaucracy wrapped in a capitalist shroud.  Corporations are not capitalism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-24T08:39:00+00:00"
}