{
  "url": "https://voxday.net/2005/07/13/dont-write-this/",
  "scraped_at": "2026-01-08T20:08:38.154745",
  "title": "Don’t write this",
  "date_display": "July 13, 2005",
  "date_iso": "2005-07-13T17:03:00+00:00",
  "date_from_url": "2005-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk points us to what Strange Horizons <a href=\"http://www.strangehorizons.com/guidelines/fiction-common.shtml\">sees all too often</a>:</p><blockquote><p>Person is (metaphorically) at point A, wants to be at point B. Looks at point B, says “I want to be at point B.” Walks to point B, encountering no meaningful obstacles or difficulties. The end. (A.k.a. the linear plot.)</p><p>Creative person is having trouble creating. <br> – Writer has writer’s block.<br> – Painter can’t seem to paint anything good.<br> – Sculptor can’t seem to sculpt anything good.<br> – Creative person’s work is reviled by critics who don’t understand how brilliant it is.<br> – Creative person meets a muse (either one of the nine classical Muses or a more individual muse) and interacts with them, usually by keeping them captive.</br></br></br></br></br></p><p>Visitor to alien planet ignores information about local rules, inadvertantly violates them, is punished. <br> – New diplomat arrives on alien planet, ignores anthropologist’s attempts to explain local rules, is punished.</br></p><p>Weird things happen, but it turns out they’re not real. <br> – In the end, it turns out it was all a dream. <br> – In the end, it turns out it was all in virtual reality.<br> – In the end, it turns out the protagonist is insane.<br> – In the end, it turns out the protagonist is writing a novel and the events we’ve seen are part of the novel.</br></br></br></br></p></blockquote><p>And then, there’s this homage to Joel Rosenberg: <em>A group of real-world humans who like roleplaying find themselves transported to D&amp;D world.</em> Considering that both he and Guy Gavriel Kay have covered that one, best you leave it alone.</p></div>",
  "content_text": "The Original Cyberpunk points us to what Strange Horizons\nsees all too often\n:\nPerson is (metaphorically) at point A, wants to be at point B. Looks at point B, says “I want to be at point B.” Walks to point B, encountering no meaningful obstacles or difficulties. The end. (A.k.a. the linear plot.)\nCreative person is having trouble creating.\n– Writer has writer’s block.\n– Painter can’t seem to paint anything good.\n– Sculptor can’t seem to sculpt anything good.\n– Creative person’s work is reviled by critics who don’t understand how brilliant it is.\n– Creative person meets a muse (either one of the nine classical Muses or a more individual muse) and interacts with them, usually by keeping them captive.\nVisitor to alien planet ignores information about local rules, inadvertantly violates them, is punished.\n– New diplomat arrives on alien planet, ignores anthropologist’s attempts to explain local rules, is punished.\nWeird things happen, but it turns out they’re not real.\n– In the end, it turns out it was all a dream.\n– In the end, it turns out it was all in virtual reality.\n– In the end, it turns out the protagonist is insane.\n– In the end, it turns out the protagonist is writing a novel and the events we’ve seen are part of the novel.\nAnd then, there’s this homage to Joel Rosenberg:\nA group of real-world humans who like roleplaying find themselves transported to D&D world.\nConsidering that both he and Guy Gavriel Kay have covered that one, best you leave it alone.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-13T16:03:00+00:00"
}