{
  "url": "https://voxday.net/2005/07/27/drive-by-reading-disorder/",
  "scraped_at": "2026-01-08T20:09:44.665174",
  "title": "Drive-by reading disorder",
  "date_display": "July 27, 2005",
  "date_iso": "2005-07-27T04:40:00+00:00",
  "date_from_url": "2005-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate delineates a few facts about Southron history, including the following: “Do I think the South was Right to buy and sell people like cattle… hrm…  You actually just mean buy don’t you? Since it was the Yankees that did all the collecting and selling?  We bought the slaves the yankees sold us.”</p><p>Which, naturally, sparked the following response from what would appear to be a dyslexic anonymous visitor:  “LIES, LIES, LIES, LIES. History revisionist bulls_hit. Pure and simple. Rewrite history anyway you like. Tell yourself a lie long enough and you will believe.  The Yankees sold us slaves. The South didn’t buy any slaves. Uh-huh, suuuuuuuuuuure. Moron.”</p><p>This is a clear case of projection combined with a complete reading comprehension failure.  I’m not sure how Anonymous managed to confuse “We bought the slaves” with “The South didn’t buy any slaves”, but he did.</p><p>Of course, he also reveals a certain absence of logic as well as ignorance of the basic facts of the Civil War.  Consider the following:</p><p>1.  Black slaves were imported from Africa by ship.<br>2.  Throughout the war, the North imposed a naval blockade on the South.</br></p><p>Given the above, now see if you can answer the following questions:</p><p>1.  Which side possessed an abundance of naval power, the North or the South?<br>2.  Which side therefore was likely to have imported the vast majority of slaves, the North or the South?</br></p><p>Confirming our logic, the historians record that Newport, Rhode Island was the slave trade’s primary North American port.  “The principal port in North America for ships engaged in the Atlantic slave trade, Newport sent over 900 voyages to the African coast.  Between 1725 and 1808 Newport ships took about 100,000 people to slavery in the West Indies and North America.”</p><p>From <a href=\"http://www.slavenorth.com/profits.htm\">another source</a>: “Boston and Newport were the chief slave ports, but nearly all the New England towns — Salem, Providence, Middletown, New London – had a hand in it. In 1740, slaving interests in Newport owned or managed 150 vessels engaged in all manner of trading. In Rhode Island colony, as much as two-thirds of the merchant fleet and a similar fraction of sailors were engaged in slave traffic.”</p><p>UPDATE: jccclimber fails to grok the fullness:</p><blockquote><p>Once importing slaves was outlawed in 1808, the Northern ports were pretty much closed to new slaves. So where did the (now illegal) slaves come into the US? In the North?”</p></blockquote><p><em>“Even after slave trading was banned in 1808, Northern slave traders continued to smuggle 40,000 slaves a year to America; saying little for the U.S. Government’s laws and policing of the problem. A New York City slave ship, in 1858, was discovered to have landed some 420 African slaves on the coast of Georgia; avoiding northern scrutiny. As late as 1861, five vessels were seized and destroyed that were being outfitted specifically for slave trading transports.”</em></p><p>It seems that the northern slavers simply continued their operations but on a less open basis.  The South didn’t have the ships for the trans-oceanic trade, even when it was banned in Northern ports after 1808.  To use a modern analogy, the Northerners were the drug dealers, the Southerners were the drug users.</p><p>From another source: <em>“Attempts to outlaw the slave trade in the north only increased the profits of smuggling. In 1858, only two years prior to the birth of the Confederacy, Stephen Douglas noted that over 15,000 slaves had been smuggled into New York alone, with over 85 vessels sailing from New York in 1859 to smuggle even more slaves”</em></p></div>",
  "content_text": "Nate delineates a few facts about Southron history, including the following: “Do I think the South was Right to buy and sell people like cattle… hrm…  You actually just mean buy don’t you? Since it was the Yankees that did all the collecting and selling?  We bought the slaves the yankees sold us.”\nWhich, naturally, sparked the following response from what would appear to be a dyslexic anonymous visitor:  “LIES, LIES, LIES, LIES. History revisionist bulls_hit. Pure and simple. Rewrite history anyway you like. Tell yourself a lie long enough and you will believe.  The Yankees sold us slaves. The South didn’t buy any slaves. Uh-huh, suuuuuuuuuuure. Moron.”\nThis is a clear case of projection combined with a complete reading comprehension failure.  I’m not sure how Anonymous managed to confuse “We bought the slaves” with “The South didn’t buy any slaves”, but he did.\nOf course, he also reveals a certain absence of logic as well as ignorance of the basic facts of the Civil War.  Consider the following:\n1.  Black slaves were imported from Africa by ship.\n2.  Throughout the war, the North imposed a naval blockade on the South.\nGiven the above, now see if you can answer the following questions:\n1.  Which side possessed an abundance of naval power, the North or the South?\n2.  Which side therefore was likely to have imported the vast majority of slaves, the North or the South?\nConfirming our logic, the historians record that Newport, Rhode Island was the slave trade’s primary North American port.  “The principal port in North America for ships engaged in the Atlantic slave trade, Newport sent over 900 voyages to the African coast.  Between 1725 and 1808 Newport ships took about 100,000 people to slavery in the West Indies and North America.”\nFrom\nanother source\n: “Boston and Newport were the chief slave ports, but nearly all the New England towns — Salem, Providence, Middletown, New London – had a hand in it. In 1740, slaving interests in Newport owned or managed 150 vessels engaged in all manner of trading. In Rhode Island colony, as much as two-thirds of the merchant fleet and a similar fraction of sailors were engaged in slave traffic.”\nUPDATE: jccclimber fails to grok the fullness:\nOnce importing slaves was outlawed in 1808, the Northern ports were pretty much closed to new slaves. So where did the (now illegal) slaves come into the US? In the North?”\n“Even after slave trading was banned in 1808, Northern slave traders continued to smuggle 40,000 slaves a year to America; saying little for the U.S. Government’s laws and policing of the problem. A New York City slave ship, in 1858, was discovered to have landed some 420 African slaves on the coast of Georgia; avoiding northern scrutiny. As late as 1861, five vessels were seized and destroyed that were being outfitted specifically for slave trading transports.”\nIt seems that the northern slavers simply continued their operations but on a less open basis.  The South didn’t have the ships for the trans-oceanic trade, even when it was banned in Northern ports after 1808.  To use a modern analogy, the Northerners were the drug dealers, the Southerners were the drug users.\nFrom another source:\n“Attempts to outlaw the slave trade in the north only increased the profits of smuggling. In 1858, only two years prior to the birth of the Confederacy, Stephen Douglas noted that over 15,000 slaves had been smuggled into New York alone, with over 85 vessels sailing from New York in 1859 to smuggle even more slaves”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-27T03:40:00+00:00"
}