{
  "url": "https://voxday.net/2005/07/24/mailvox-on-ro/",
  "scraped_at": "2026-01-08T20:09:22.298203",
  "title": "Mailvox: On a roll",
  "date_display": "July 24, 2005",
  "date_iso": "2005-07-24T10:10:00+00:00",
  "date_from_url": "2005-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LW has a few thoughts:</p><blockquote><p>You really are on a roll.  Though we often differ, I cannot argue with your train of thought lately.  So much so that I have abandoned the Republican party, or more to the point, have realized that train never was headed for, never will arrive at, and does not even have tracks laid; to the train station I’ve been calling it from.  Ok, so you were more correct than I had thought about Bush.  Still, voting Democrat, Libertarian, or Constitutional party would have been no better and potentially worse.  Anyway, I have left that train station and now wander the political wastelands of America.</p><p>You ask a lot of interesting  questions in your recent articles.  If you are anything like me, you have probably answers to those questions.  Those answers are just too ugly to look at, do dangerous to publicly state.  For example, why use the new expanded federal powers on US citizens while having open borders?  Well, that is simple if perhaps cynical; it’s a government power grab based on a set of events that will only strengthen based on future and similar events.  The powers are the <br>pry bar that will open the US vault of personal and state powers that had been locked away.  Once opened, the precious commodities are slowly removed, more quickly if another attack occurs.  Leaving the borders open ensures that the vault will remain unsealed and that the valuables  may be looted more swiftly….</br></p><p>Anyway, perhaps I am wrong and you have no such scenario’s worked up in your mind.  Perhaps I am delusional, hysterical, or at odds with what is happening so much so that I am blind to reality, but then if I am even near the answer we are in trouble.</p><p>If nothing else, you seem to see that last quite plainly.  Out of curiosity, what practical solutions do you see?  The only one I see would be a massive ground swell of Libertarian or Constitutional Party membership.  Alas, I do not see that occurring.  Then again, in some ways we all seem to be slightly blind to the overall picture of what is really happening.  The internet and blogs only seem to offer more <br>questions than answers and the news is either blatantly pro or con.</br></p><p>Well, I am sure you are too busy to respond to a typical conservative email.  I’ll continue to follow your articles, the news, and whatnot.  More out of curiosity than anything now.  Is there a pool for when the US becomes a totally socialist nation?  If so, I want in.</p></blockquote><p>I do, indeed, have many theories about various aspects of the current situation that I do not choose to share.  Not because they are dangerous – I harbor no illusions about my own importance in a media pond that lends great credence to what passes for the thinking of Rich, Dowd, Malkin and so forth – but because they are only half-formed, at times contradictory and lack sufficient foundations in irrefutable proof.</p><p>Also, I prefer to ask questions because I’ve found, as have many individuals since Socrates, that asking the sort of questions that cause others to think is far more productive than telling them what to think.  I believe the ability to doubt and think for yourself is far more useful than the simple transference of blind faith from one authority to another.</p><p>It is obvious, of course, that the behavior of the current administration, and of the governments of Europe, defy logic, if not belief.  The US government is at war with the hitherto unalienable rights of its citizens at and peace with a “religion of peace” while the UK government has responded to eight Muslim bomb attacks by investigating anti-Islamic English football hooligans and murdering a Brazilian.</p><p>Where are we headed?  Not towards a purely socialist construction, which, by most economic measures has already largely been installed.  In my opinion, George Orwell appears to have understood the ultimate direction better than most, and not only in the metaphorical sense that most people read his work.  Perhaps Nate is correct about the insidious evils of soccer.</p></div>",
  "content_text": "LW has a few thoughts:\nYou really are on a roll.  Though we often differ, I cannot argue with your train of thought lately.  So much so that I have abandoned the Republican party, or more to the point, have realized that train never was headed for, never will arrive at, and does not even have tracks laid; to the train station I’ve been calling it from.  Ok, so you were more correct than I had thought about Bush.  Still, voting Democrat, Libertarian, or Constitutional party would have been no better and potentially worse.  Anyway, I have left that train station and now wander the political wastelands of America.\nYou ask a lot of interesting  questions in your recent articles.  If you are anything like me, you have probably answers to those questions.  Those answers are just too ugly to look at, do dangerous to publicly state.  For example, why use the new expanded federal powers on US citizens while having open borders?  Well, that is simple if perhaps cynical; it’s a government power grab based on a set of events that will only strengthen based on future and similar events.  The powers are the\npry bar that will open the US vault of personal and state powers that had been locked away.  Once opened, the precious commodities are slowly removed, more quickly if another attack occurs.  Leaving the borders open ensures that the vault will remain unsealed and that the valuables  may be looted more swiftly….\nAnyway, perhaps I am wrong and you have no such scenario’s worked up in your mind.  Perhaps I am delusional, hysterical, or at odds with what is happening so much so that I am blind to reality, but then if I am even near the answer we are in trouble.\nIf nothing else, you seem to see that last quite plainly.  Out of curiosity, what practical solutions do you see?  The only one I see would be a massive ground swell of Libertarian or Constitutional Party membership.  Alas, I do not see that occurring.  Then again, in some ways we all seem to be slightly blind to the overall picture of what is really happening.  The internet and blogs only seem to offer more\nquestions than answers and the news is either blatantly pro or con.\nWell, I am sure you are too busy to respond to a typical conservative email.  I’ll continue to follow your articles, the news, and whatnot.  More out of curiosity than anything now.  Is there a pool for when the US becomes a totally socialist nation?  If so, I want in.\nI do, indeed, have many theories about various aspects of the current situation that I do not choose to share.  Not because they are dangerous – I harbor no illusions about my own importance in a media pond that lends great credence to what passes for the thinking of Rich, Dowd, Malkin and so forth – but because they are only half-formed, at times contradictory and lack sufficient foundations in irrefutable proof.\nAlso, I prefer to ask questions because I’ve found, as have many individuals since Socrates, that asking the sort of questions that cause others to think is far more productive than telling them what to think.  I believe the ability to doubt and think for yourself is far more useful than the simple transference of blind faith from one authority to another.\nIt is obvious, of course, that the behavior of the current administration, and of the governments of Europe, defy logic, if not belief.  The US government is at war with the hitherto unalienable rights of its citizens at and peace with a “religion of peace” while the UK government has responded to eight Muslim bomb attacks by investigating anti-Islamic English football hooligans and murdering a Brazilian.\nWhere are we headed?  Not towards a purely socialist construction, which, by most economic measures has already largely been installed.  In my opinion, George Orwell appears to have understood the ultimate direction better than most, and not only in the metaphorical sense that most people read his work.  Perhaps Nate is correct about the insidious evils of soccer.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-24T09:10:00+00:00"
}