{
  "url": "https://voxday.net/2005/07/26/mailvox-good-guys-and-bad-guys/",
  "scraped_at": "2026-01-08T20:09:40.895473",
  "title": "Mailvox: good guys and bad guys",
  "date_display": "July 26, 2005",
  "date_iso": "2005-07-26T13:55:00+00:00",
  "date_from_url": "2005-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John sounds vaguely offended:</p><blockquote><p>Vox, you’re painting in brushstrokes that are way too broad. Over the last three days, you’ve impugned the professionalism and integrity of every law enforcement agency in two countries.</p><p>Answer me this: The guy that responds to a domestic violence call or liquor store robbery is a part of some government plot to take your liberties and is merely looking to shoot you for the hell of it?</p></blockquote><p>Absolutely I have and I do.  Like many other people, I have some very serious doubts as to whose side the police and the federal criminal agencies are on these days.  It is interesting to note that 15 years ago, “Fuck the Police” was the battle cry of a few black gangbangers in Los Angeles.  Now, I hear those same sentiments from wealthy 50-something white suburbanites who wouldn’t listen to rap if you physically threatened them.</p><p>But professionalism is not the answer, indeed, it is part of the problem.  The Wehrmacht and the Luftwaffe were filled with precisely the sort of professional warriors that currently make up much of our armed forces and police.  They were good men, family men, men who believed that they were doing the right thing by obeying the law and their government.  Their problem was not that they were bad people, the problem was that they were good people acting in obedience to evil men.</p><p>The people of the United States are not serfs, they have no masters and they do not need protection, which, by the way, they are clearly not receiving anyhow.  In any event, I will always favor taking the risks that exist on the side of freedom, mostly because the historical bodycount on that side is significantly smaller.</p><p>Lest you think I am avoiding your question, the policeman became a part of a government plot to eliminate American liberties the moment he accepted the notion that he had the right to act as judge, jury and executioner on the basis of his own feelings.  Most policemen, being decent individuals, will not abuse that illegitimate power.  The hundreds of annual killings by police indicate that too many, however, will, either intentionally or unintentionally.</p><p><em><a href=\"http://www.commondreams.org/headlines01/0429-02.htm\">The International Chiefs of Police, a police organization, tried in the 1980’s to collect such information</a>, but “the figures were very embarrassing to a lot of police departments,” said James Fyfe, a professor of criminal justice at Temple University who is a former New York City police lieutenant. The results, he said, varied wildly. New Orleans had 10 times as many shootings per 100 officers as Newark. Long Beach had twice as many as neighboring Los Angeles, which in turn had three times more than New York….</em></p><p>On its cover, for example, the report refers to all the victims of police shootings as “felons justifiably killed by police,” a categorization that Samuel Walker, a professor of criminal justice at the University of Nebraska at Omaha, termed “deeply offensive and legally incorrect.” In fact, a Justice Department official said the bureau was so embarrassed by the term, and the lack of distinction between justifiable police shootings and murders, that it did not send out its usual promotional material announcing the report.</p></div>",
  "content_text": "John sounds vaguely offended:\nVox, you’re painting in brushstrokes that are way too broad. Over the last three days, you’ve impugned the professionalism and integrity of every law enforcement agency in two countries.\nAnswer me this: The guy that responds to a domestic violence call or liquor store robbery is a part of some government plot to take your liberties and is merely looking to shoot you for the hell of it?\nAbsolutely I have and I do.  Like many other people, I have some very serious doubts as to whose side the police and the federal criminal agencies are on these days.  It is interesting to note that 15 years ago, “Fuck the Police” was the battle cry of a few black gangbangers in Los Angeles.  Now, I hear those same sentiments from wealthy 50-something white suburbanites who wouldn’t listen to rap if you physically threatened them.\nBut professionalism is not the answer, indeed, it is part of the problem.  The Wehrmacht and the Luftwaffe were filled with precisely the sort of professional warriors that currently make up much of our armed forces and police.  They were good men, family men, men who believed that they were doing the right thing by obeying the law and their government.  Their problem was not that they were bad people, the problem was that they were good people acting in obedience to evil men.\nThe people of the United States are not serfs, they have no masters and they do not need protection, which, by the way, they are clearly not receiving anyhow.  In any event, I will always favor taking the risks that exist on the side of freedom, mostly because the historical bodycount on that side is significantly smaller.\nLest you think I am avoiding your question, the policeman became a part of a government plot to eliminate American liberties the moment he accepted the notion that he had the right to act as judge, jury and executioner on the basis of his own feelings.  Most policemen, being decent individuals, will not abuse that illegitimate power.  The hundreds of annual killings by police indicate that too many, however, will, either intentionally or unintentionally.\nThe International Chiefs of Police, a police organization, tried in the 1980’s to collect such information\n, but “the figures were very embarrassing to a lot of police departments,” said James Fyfe, a professor of criminal justice at Temple University who is a former New York City police lieutenant. The results, he said, varied wildly. New Orleans had 10 times as many shootings per 100 officers as Newark. Long Beach had twice as many as neighboring Los Angeles, which in turn had three times more than New York….\nOn its cover, for example, the report refers to all the victims of police shootings as “felons justifiably killed by police,” a categorization that Samuel Walker, a professor of criminal justice at the University of Nebraska at Omaha, termed “deeply offensive and legally incorrect.” In fact, a Justice Department official said the bureau was so embarrassed by the term, and the lack of distinction between justifiable police shootings and murders, that it did not send out its usual promotional material announcing the report.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-26T12:55:00+00:00"
}