{
  "url": "https://voxday.net/2005/07/27/mailvox-concentration-expectations/",
  "scraped_at": "2026-01-08T20:09:46.488226",
  "title": "Mailvox: concentration expectations",
  "date_display": "July 27, 2005",
  "date_iso": "2005-07-27T11:10:00+00:00",
  "date_from_url": "2005-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gregg writes:</p><blockquote><p>If a nuke goes off in a America I think the mass psychology will run the Muslims into concentration camps.  It will be a horrible thing for Muslims, but it would happen.  I believe Malkin and Coulter would write in favor of it. Would you?</p></blockquote><p>No, I would not.  I would continue to write in favor of returning all non-citizens from Islamic countries to their countries of origin – for the terminally obtuse that is defined as <a href=\"http://en.wikipedia.org/wiki/Islam_by_country\">countries where more than 50 percent of the population is Muslim</a> or where Sharia is incorporated into the legal system – and I would fervently defend the rights and liberties of all American citizens who happen to be Muslim.  In no case should the Constitution be violated nor should innocent individuals be deprived of their property and liberty en masse on the basis of their race or religion.</p><p>In the event of a nuclear attack, I think it is likely that concentration camps would be established, but they would not necessarily be filled with Muslims.  First, it’s pretty clear that martial law would be declared, and the immediate priority for the federal government, (or, depending on where the nuke went off, its FEMA-established replacement), would be to round up those acting in opposition to martial law, regardless of their creed.</p><p>Suffice it to say that I am opposed to the historical violation of American rights and liberties that occurred during WWII, (including the draft), and I am opposed to any future violation of American rights and liberties, regardless of the excuse or the identity of the particular group being targeted by the federal government and/or public opinion.</p><p>As for the girlish doyennes of the right-wing commentariat, I have to confess that I’m not sure what Miss Coulter would say.  Considering her interest in constitutional law, I don’t think she’d be inclined to embrace the Constitution-shredding actions required, but she’s inconsistent enough that it is possible, if unlikely.  Mrs. Malkin, despite her unconvincing protestations, has indicated a level of support for interning Muslims already; if one were to make the mistake of taking her most recent book seriously, it makes a much stronger case for a current internment on the basis of national security than it did for what would be its historical predecessor.</p><p>The important thing to remember is that while 50 simultaneous nuclear explosions could not destroy America, the government’s reaction to a single nuclear dud could.  I believe it may have been the historian Toynbee who first pointed out that civilizations are not murdered, they commit suicide.  And martial law is almost inevitably a major step in that process.</p></div>",
  "content_text": "Gregg writes:\nIf a nuke goes off in a America I think the mass psychology will run the Muslims into concentration camps.  It will be a horrible thing for Muslims, but it would happen.  I believe Malkin and Coulter would write in favor of it. Would you?\nNo, I would not.  I would continue to write in favor of returning all non-citizens from Islamic countries to their countries of origin – for the terminally obtuse that is defined as\ncountries where more than 50 percent of the population is Muslim\nor where Sharia is incorporated into the legal system – and I would fervently defend the rights and liberties of all American citizens who happen to be Muslim.  In no case should the Constitution be violated nor should innocent individuals be deprived of their property and liberty en masse on the basis of their race or religion.\nIn the event of a nuclear attack, I think it is likely that concentration camps would be established, but they would not necessarily be filled with Muslims.  First, it’s pretty clear that martial law would be declared, and the immediate priority for the federal government, (or, depending on where the nuke went off, its FEMA-established replacement), would be to round up those acting in opposition to martial law, regardless of their creed.\nSuffice it to say that I am opposed to the historical violation of American rights and liberties that occurred during WWII, (including the draft), and I am opposed to any future violation of American rights and liberties, regardless of the excuse or the identity of the particular group being targeted by the federal government and/or public opinion.\nAs for the girlish doyennes of the right-wing commentariat, I have to confess that I’m not sure what Miss Coulter would say.  Considering her interest in constitutional law, I don’t think she’d be inclined to embrace the Constitution-shredding actions required, but she’s inconsistent enough that it is possible, if unlikely.  Mrs. Malkin, despite her unconvincing protestations, has indicated a level of support for interning Muslims already; if one were to make the mistake of taking her most recent book seriously, it makes a much stronger case for a current internment on the basis of national security than it did for what would be its historical predecessor.\nThe important thing to remember is that while 50 simultaneous nuclear explosions could not destroy America, the government’s reaction to a single nuclear dud could.  I believe it may have been the historian Toynbee who first pointed out that civilizations are not murdered, they commit suicide.  And martial law is almost inevitably a major step in that process.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-27T10:10:00+00:00"
}