{
  "url": "https://voxday.net/2005/07/23/oopsy/",
  "scraped_at": "2026-01-08T20:09:16.840745",
  "title": "Oopsy",
  "date_display": "July 23, 2005",
  "date_iso": "2005-07-23T20:30:00+00:00",
  "date_from_url": "2005-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Scotland Yard admitted Saturday that a man police officers chased and shot to death at point-blank range in front of horrified subway passengers on Friday <a href=\"http://www.nytimes.com/2005/07/24/international/24london.html?ei=5065&amp;en=b04575c1815189bb&amp;ex=1122782400&amp;partner=MYWAY&amp;pagewanted=print\">had nothing to do with the investigation into the bombing attacks here</a>. Senior investigators and officials of the Metropolitan Police said the man was believed to be South American; it was not known whether he was Muslim. No explosives or weapons were found on the man’s body after the shooting, police officials said.</p></blockquote><p>It’s important to remember that the police are government employees.  This does not meant that they will always foul things up, only that they can be reliably depended upon to do so.</p><p>So, while Scotland Yard may not have any idea where those responsible for the bombings are, at least they managed to kill one innocent man.  And, as usual, they’ll be doing their best to cover their respective asses.</p><p>“After the shooting, Sir Ian Blair, the commissioner of the Metropolitan Police, said, “The information I have available is that this shooting is directly linked to the ongoing and expanding anti-terrorist operation.”</p><p>Or not….</p></div>",
  "content_text": "Scotland Yard admitted Saturday that a man police officers chased and shot to death at point-blank range in front of horrified subway passengers on Friday\nhad nothing to do with the investigation into the bombing attacks here\n. Senior investigators and officials of the Metropolitan Police said the man was believed to be South American; it was not known whether he was Muslim. No explosives or weapons were found on the man’s body after the shooting, police officials said.\nIt’s important to remember that the police are government employees.  This does not meant that they will always foul things up, only that they can be reliably depended upon to do so.\nSo, while Scotland Yard may not have any idea where those responsible for the bombings are, at least they managed to kill one innocent man.  And, as usual, they’ll be doing their best to cover their respective asses.\n“After the shooting, Sir Ian Blair, the commissioner of the Metropolitan Police, said, “The information I have available is that this shooting is directly linked to the ongoing and expanding anti-terrorist operation.”\nOr not….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-23T19:30:00+00:00"
}