{
  "url": "https://voxday.net/2005/07/19/that-was-quick-3/",
  "scraped_at": "2026-01-08T20:09:00.203792",
  "title": "That was quick",
  "date_display": "July 19, 2005",
  "date_iso": "2005-07-19T18:55:00+00:00",
  "date_from_url": "2005-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fighting the copyright war is utterly useless.  The S/D curve varies depending upon price.  People will buy what they value and want to buy, not the pigs in a poke that copyright holders try to force them to buy, and the success of Harry Potter proves this in spades.</p><p>It seems to be selling just fine, despite the fact that the full text is already floating around the Internet in at least three formats that I’ve seen.</p><p>Once a Swashbuckler, always a pirate….</p><p>UPDATE: Perhaps I should mention that I have put my copyright where my mouth is. <a href=\"http://www.accelerando.org/2005/06/16/\">As does Charles Stross</a>, who actually has his publisher’s approval to give out free downloads of the full text in seven different formats.  Although I cannot do the same thanks to my publisher’s archaic views, you may wish to know that there are electronic versions of my novels floating around the Internet and not only does this not disturb me, it pleases me immensely.  I only wish more people were interested in passing them around, as I contend that people will always support those products and artists that they like enough to support financially.</p><p>It is, as I mentioned before, yet another example of the S/D curve in action.  A downloaded ebook is very seldom a lost sale, as a willingness to pay $0.00 is not the same as a willingness to pay $12.95.  In any event, it is lack of market awareness is the author’s enemy, not free ebooks, which actually help combat the primary problem.</p><p>One should note that it is the best-selling books that are most frequently seen on the pirate ebook sites.  As for the idea that copying an ebook or an mp3 is “stealing”, one must first accept the idea that one can steal something that doesn’t exist and leaves the producer with exactly what he had before.  I find this to be an interesting demonstration of post-scarcity economics at work and given the human creative impulse, I reject the notion that it will have any deleterious effect on art of any kind.</p><p>Indeed, an elimination of the need to appeal to the lowest common denominator might well improve the general level of art being produced.</p></div>",
  "content_text": "Fighting the copyright war is utterly useless.  The S/D curve varies depending upon price.  People will buy what they value and want to buy, not the pigs in a poke that copyright holders try to force them to buy, and the success of Harry Potter proves this in spades.\nIt seems to be selling just fine, despite the fact that the full text is already floating around the Internet in at least three formats that I’ve seen.\nOnce a Swashbuckler, always a pirate….\nUPDATE: Perhaps I should mention that I have put my copyright where my mouth is.\nAs does Charles Stross\n, who actually has his publisher’s approval to give out free downloads of the full text in seven different formats.  Although I cannot do the same thanks to my publisher’s archaic views, you may wish to know that there are electronic versions of my novels floating around the Internet and not only does this not disturb me, it pleases me immensely.  I only wish more people were interested in passing them around, as I contend that people will always support those products and artists that they like enough to support financially.\nIt is, as I mentioned before, yet another example of the S/D curve in action.  A downloaded ebook is very seldom a lost sale, as a willingness to pay $0.00 is not the same as a willingness to pay $12.95.  In any event, it is lack of market awareness is the author’s enemy, not free ebooks, which actually help combat the primary problem.\nOne should note that it is the best-selling books that are most frequently seen on the pirate ebook sites.  As for the idea that copying an ebook or an mp3 is “stealing”, one must first accept the idea that one can steal something that doesn’t exist and leaves the producer with exactly what he had before.  I find this to be an interesting demonstration of post-scarcity economics at work and given the human creative impulse, I reject the notion that it will have any deleterious effect on art of any kind.\nIndeed, an elimination of the need to appeal to the lowest common denominator might well improve the general level of art being produced.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-07-19T17:55:00+00:00"
}