{
  "url": "https://voxday.net/2007/03/08/agreeing-with-godless/",
  "scraped_at": "2026-01-08T21:34:28.521644",
  "title": "Agreeing with the godless",
  "date_display": "March 8, 2007",
  "date_iso": "2007-03-08T16:33:00+00:00",
  "date_from_url": "2007-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It may surprise you, but I don’t approve of <a href=\"http://scienceblogs.com/pharyngula/2007/03/christianism_summed_up_in_one.php\">this sort of thing</a> any more than the Pharyngulans do.  Quite likely less, in fact.  I don’t understand people who fetishize the 10 Commandments, who pray loudly before meals at restaurants and especially those who clearly view public prayer as a political stunt.</p><p>Now, obviously these people aren’t bowing down and worshipping the commandments, and while it’s a funny suggestion, a more effective tactic on Prof. PZ Myers part would be to ask what part of Jesus Christ’s commands these people do not understand?</p><p><em>“And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by men. I tell you the truth, they have received their reward in full.  But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. And when you pray, do not keep on babbling like pagans, for they think they will be heard because of their many words. Do not be like them, for your Father knows what you need before you ask him.</em></p></div>",
  "content_text": "It may surprise you, but I don’t approve of\nthis sort of thing\nany more than the Pharyngulans do.  Quite likely less, in fact.  I don’t understand people who fetishize the 10 Commandments, who pray loudly before meals at restaurants and especially those who clearly view public prayer as a political stunt.\nNow, obviously these people aren’t bowing down and worshipping the commandments, and while it’s a funny suggestion, a more effective tactic on Prof. PZ Myers part would be to ask what part of Jesus Christ’s commands these people do not understand?\n“And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by men. I tell you the truth, they have received their reward in full.  But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. And when you pray, do not keep on babbling like pagans, for they think they will be heard because of their many words. Do not be like them, for your Father knows what you need before you ask him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-08T16:33:00+00:00"
}