{
  "url": "https://voxday.net/2007/03/01/amynda-defends-herself/",
  "scraped_at": "2026-01-08T21:33:23.301551",
  "title": "Amynda offers a defense",
  "date_display": "March 1, 2007",
  "date_iso": "2007-03-01T12:15:00+00:00",
  "date_from_url": "2007-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amynda addresses <a href=\"http://pandagon.net/2007/02/28/al-gore-is-entitled-to-his-extra-farts/#comments\">the gap between personal behavior and public advocacy</a>:</p><blockquote><p>Okay, I’ve been busy unpacking and trying to release my apartment, so I’ve been a bit behind on the blogging. That said, I can’t help but hear that the wingnuts are attacking me for being a “antisemite” for attacking Jews, as if that means anything in terms of society. <a href=\"http://battlepanda.blogspot.com/2007/02/gore-energy-hog.html\">Battlepanda has got a pretty good take on how silly all this is</a>.</p><p><em>However, the problem of anti-semitism is wayyy beyond the capability of personal virtue to solve.</em></p><p>For instance, there is no doubt in my mind anti-semitism is a real phenomenon, but I still use the word kike, quote from the Protocols of the Learned Elders of Zion, burn synagogues etc. etc. Why? Because I am not a sucker. Why should I deny myself my comforts when everybody else is acting anti-semitic anyhow?</p><p>However, I am in favor of the Middle East peace process. Sure, I’ll be paying more for military aid to Israel and other stuff, but so will everyone else. So, unlike unilaterally changing my own behavior, my sacrifice might count for something in terms of society’s future well-being.</p><p>What I’ve seen Amynda do very effectively is raising awareness about the issue of anti-semitism and arguing that we should do something about it collectivelly. Not because we liberals are all secretly commies and love to do things collectively but because it is the only fair and effective way to end racism.</p><p>The very notion that I am a hypocrite when the issue is something that has nothing to do with personal virtue and everything to do with collective action just goes to show how badly it fucks people up when religion and politics get intertwined. This also shows the profound difference between the right and the left’s version of when government interference is justified.</p></blockquote><p>Oh dear, I just noticed a few typos there.  Did I write “anti-semitism”?  I meant, of course, to write”global warming”  And by “Amynda”, I meant “Al Gore”.</p><p>It is nice to see that even the most rabid left-wingers have given up on that “think globally, act locally” notion, however.  Or perhaps this is merely a variant on Gloria Steinem’s “one free grope” rule.</p></div>",
  "content_text": "Amynda addresses\nthe gap between personal behavior and public advocacy\n:\nOkay, I’ve been busy unpacking and trying to release my apartment, so I’ve been a bit behind on the blogging. That said, I can’t help but hear that the wingnuts are attacking me for being a “antisemite” for attacking Jews, as if that means anything in terms of society.\nBattlepanda has got a pretty good take on how silly all this is\n.\nHowever, the problem of anti-semitism is wayyy beyond the capability of personal virtue to solve.\nFor instance, there is no doubt in my mind anti-semitism is a real phenomenon, but I still use the word kike, quote from the Protocols of the Learned Elders of Zion, burn synagogues etc. etc. Why? Because I am not a sucker. Why should I deny myself my comforts when everybody else is acting anti-semitic anyhow?\nHowever, I am in favor of the Middle East peace process. Sure, I’ll be paying more for military aid to Israel and other stuff, but so will everyone else. So, unlike unilaterally changing my own behavior, my sacrifice might count for something in terms of society’s future well-being.\nWhat I’ve seen Amynda do very effectively is raising awareness about the issue of anti-semitism and arguing that we should do something about it collectivelly. Not because we liberals are all secretly commies and love to do things collectively but because it is the only fair and effective way to end racism.\nThe very notion that I am a hypocrite when the issue is something that has nothing to do with personal virtue and everything to do with collective action just goes to show how badly it fucks people up when religion and politics get intertwined. This also shows the profound difference between the right and the left’s version of when government interference is justified.\nOh dear, I just noticed a few typos there.  Did I write “anti-semitism”?  I meant, of course, to write”global warming”  And by “Amynda”, I meant “Al Gore”.\nIt is nice to see that even the most rabid left-wingers have given up on that “think globally, act locally” notion, however.  Or perhaps this is merely a variant on Gloria Steinem’s “one free grope” rule.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-01T12:15:00+00:00"
}