{
  "url": "https://voxday.net/2007/03/12/dotty-defense-of-science/",
  "scraped_at": "2026-01-08T21:34:52.862789",
  "title": "A dotty defense of science",
  "date_display": "March 12, 2007",
  "date_iso": "2007-03-12T12:21:00+00:00",
  "date_from_url": "2007-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kunshalini is a self-proclaimed ‘atheistic evolutionist missionary’ who thinks of herself as a voice of rationality in a dark, gloomy world.  She also <a href=\"http://scientianatura.blogspot.com/2007/03/case-against-science-is-baseless.html\">thinks she can match wits with a real scientist</a>:</p><blockquote><p>Vox phrases his claim in a way that suggests that scientists claim that scientific facts are exactly like how religious goons claim that their god specifically said that the earth is 6,000 years old. This is his misrepresentation of science and has no bearing on reality.</p></blockquote><p>Vox does nothing of the sort.  Vox has never asserted nor suggested that science’s claim to truth via the scientific method is identical to religion’s claim to the truth via Divine fiat, nor does anyone religious, not even a Young Earth Creationist, claim that God specifically said that the earth is 6,000 years old.  Implication by extrapolation and addition != “specifically said”.</p><p>The claim of science to be truthful based on its self-correcting nature has been made by Richard Dawkins, among many, many others.  This not only has a bearing on reality, it is an empirical and easily verified fact.  Kunshalini would know this if she had ever read <i>Unweaving the Rainbow</i> wherein Richard Dawkins praises science because it “progresses by correcting its mistakes” and relates an anecdote about him and his fellow students “clapping their hands red” in praise of an elderly scientist who gracefully announced that his life’s work had been based on error.</p><p>Neither I, nor anyone else, has ever claimed that truth by divine revelation is self-correcting.  I would dispute the idea that it even COULD be self-correcting.</p><blockquote><p>He conveniently forgets to mention that all the ‘honest mistakes, not-so-honest mistakes and outright lies’ were exposed by scientists themselves. When was the last time we heard of religious frauds being exposed by someone in the fold? It’s usually the skeptics who point out the ever-spreading rot in religion..</p></blockquote><p>This is not true, regarding either Science or Religion.  The Chicago Tribune, not the National Institute of Health, was responsible for exposing Robert Gallo’s discovery of the AIDS virus.  Journalists also exposed the fake Stone Age Tasaday tribe in the Phillippines.  Meanwhile, Jim Bakker’s downfall was the result of investigators and auditors hired by Jerry Falwell.</p><p>As with everything else, it’s those who are closest to the frauds who are in the best position to expose them.  To the credit of scientists and the religious faithful alike, someone usually does.  Science does, of course, have the advantage of a system that is theoretically conceived to aid in such fraud-detection, religion usually doesn’t… and yet when it has attempted to do precisely that, people like Kunshalini have tended to disapprove of such Inquisitions.</p><blockquote><p>So why exactly has he not moved into a cave and lived a primitive existence? You secretly love science, don’t you, Vox?</p></blockquote><p>Because science =| technology.  Ironically, for all her missionary atheist zeal, it’s apparent that Shalini harbors an open fascination with Kali.  Furthermore, I note that there are many people who would like to live in one form of “primitive existence” or another.  Unfortunately, the advocates of science will not permit them to do so in peace.</p><blockquote><p>What is the definition of ‘superior’? Who makes the distinction? Vox simply expects an answer without an actual question in the first place. He just shows that he doesn’t understand science at all.</p></blockquote><p>Kunshalini apparently does not understand the difference between a general question relating to what is an entire field of scientific research and a specific hypothesis.  She just shows that she doesn’t understand the English language.  She might as meaningfully quibble with the definition of “is” to demonstrate how I don’t understand science.</p><blockquote><p>Scientists came up with the technology to build weapons, but were nations bombed ‘in the name of science’ as opposed to ‘in the name of god’? Was it the scientists, in an attempt to convert other people to scientific thought, the ones who dropped the bombs? I don’t think so.</p><p>We are all familiar with religious terrorism, but who on earth has heard of scientific terrorism? Vox is again not making any sense.</p></blockquote><p>Again, the “in the name of” nonsense.  First, every evil of socialism has been performed in “the name of science”, namely, “scientific socialism”.  Don’t even think of trying to run a No True Scotsman evasion here.  And yes, a scientist did indeed drop the bomb, William Parsons of the Manhattan Project, to be precise.  It doesn’t matter if you kill someone in the name of science, God or for the contents of their wallet, you are still responsible for killing them.</p><p>This oft-repeated “defense” of science confuses action with motive.  The two are not the same.  But then, as we’ve already demonstrated, Kunshalini’s grasp of the language is sub-optimal.</p><blockquote><p>Is Vox really claiming that accidental deaths during moral procedures are equivalent to intentional killing in the name of an imaginary god? As he previously stated that it’s perfectly moral and good to kill babies if ‘god said so’, I may accept that he’s genuinely muddled up.</p><p>[Sarcasm] Scientists must be so evil! Because of them, there are antibiotics and vaccinations! How immoral! Faith healing is the god-approved way!</p></blockquote><p>One death is an accident, 783,000 deaths per year smack of carelessness.  Again, the sciencyst logic is bizarre; because of scientists there are chemical weapons and nuclear missiles, but that’s not their fault because they (usually) don’t personally use them on anyone “in the name of science”.  But antibiotics and vaccines are cited as supposed proof of the goodness of scientists, even though they don’t give them to anyone “in the name of science”.</p><blockquote><p>Man has been ready to move beyond religion for ages. It’s the utter stupidity of people like Vox Day that’s hindering humans from moving on. The ‘eternal damnation’ fear-mongers take no less credit for the blame.</p></blockquote><p>Yes, I murdered six scientists just yesterday, and tomorrow I’m planning to steal all of the funding for research into women’s breast cancer.  I’m kind of a criminal savant.  And “for ages”, really?  Was it during the Bronze Age or the Iron Age that Man demonstrated his readiness to move beyond religion?</p><blockquote><p>This is another insight into the lunatic religious mind. To them, knowledge is bad just because awareness kills childish fantasies and progress shatters the very foundations of their faith. He trumpets ignorance over knowledge, superstition over science, and claims that humans would fare better. He actually thinks that it’s a good thing to slide back 2000 years; back to the time where people actually believed that the earth was flat. It’s a good thing that Vox is not the supreme dictator of the earth, or I might have to kill myself just to die in dignity.</p></blockquote><p>Actually, Kunshalini’s post indicates that it’s a bit late for her to die in dignity now.  But I’m sure we’re all eagerly awaiting the publication of her patent on long distance mind-reading, even if I am enraged by her untimely revelation of my secret intentions of returning the Purple Faction to its destined place of sporting primacy through the Empire.</p><p><i>Ave!  Ostrinum aeternitas!  Ave!</i></p></div>",
  "content_text": "Kunshalini is a self-proclaimed ‘atheistic evolutionist missionary’ who thinks of herself as a voice of rationality in a dark, gloomy world.  She also\nthinks she can match wits with a real scientist\n:\nVox phrases his claim in a way that suggests that scientists claim that scientific facts are exactly like how religious goons claim that their god specifically said that the earth is 6,000 years old. This is his misrepresentation of science and has no bearing on reality.\nVox does nothing of the sort.  Vox has never asserted nor suggested that science’s claim to truth via the scientific method is identical to religion’s claim to the truth via Divine fiat, nor does anyone religious, not even a Young Earth Creationist, claim that God specifically said that the earth is 6,000 years old.  Implication by extrapolation and addition != “specifically said”.\nThe claim of science to be truthful based on its self-correcting nature has been made by Richard Dawkins, among many, many others.  This not only has a bearing on reality, it is an empirical and easily verified fact.  Kunshalini would know this if she had ever read\nUnweaving the Rainbow\nwherein Richard Dawkins praises science because it “progresses by correcting its mistakes” and relates an anecdote about him and his fellow students “clapping their hands red” in praise of an elderly scientist who gracefully announced that his life’s work had been based on error.\nNeither I, nor anyone else, has ever claimed that truth by divine revelation is self-correcting.  I would dispute the idea that it even COULD be self-correcting.\nHe conveniently forgets to mention that all the ‘honest mistakes, not-so-honest mistakes and outright lies’ were exposed by scientists themselves. When was the last time we heard of religious frauds being exposed by someone in the fold? It’s usually the skeptics who point out the ever-spreading rot in religion..\nThis is not true, regarding either Science or Religion.  The Chicago Tribune, not the National Institute of Health, was responsible for exposing Robert Gallo’s discovery of the AIDS virus.  Journalists also exposed the fake Stone Age Tasaday tribe in the Phillippines.  Meanwhile, Jim Bakker’s downfall was the result of investigators and auditors hired by Jerry Falwell.\nAs with everything else, it’s those who are closest to the frauds who are in the best position to expose them.  To the credit of scientists and the religious faithful alike, someone usually does.  Science does, of course, have the advantage of a system that is theoretically conceived to aid in such fraud-detection, religion usually doesn’t… and yet when it has attempted to do precisely that, people like Kunshalini have tended to disapprove of such Inquisitions.\nSo why exactly has he not moved into a cave and lived a primitive existence? You secretly love science, don’t you, Vox?\nBecause science =| technology.  Ironically, for all her missionary atheist zeal, it’s apparent that Shalini harbors an open fascination with Kali.  Furthermore, I note that there are many people who would like to live in one form of “primitive existence” or another.  Unfortunately, the advocates of science will not permit them to do so in peace.\nWhat is the definition of ‘superior’? Who makes the distinction? Vox simply expects an answer without an actual question in the first place. He just shows that he doesn’t understand science at all.\nKunshalini apparently does not understand the difference between a general question relating to what is an entire field of scientific research and a specific hypothesis.  She just shows that she doesn’t understand the English language.  She might as meaningfully quibble with the definition of “is” to demonstrate how I don’t understand science.\nScientists came up with the technology to build weapons, but were nations bombed ‘in the name of science’ as opposed to ‘in the name of god’? Was it the scientists, in an attempt to convert other people to scientific thought, the ones who dropped the bombs? I don’t think so.\nWe are all familiar with religious terrorism, but who on earth has heard of scientific terrorism? Vox is again not making any sense.\nAgain, the “in the name of” nonsense.  First, every evil of socialism has been performed in “the name of science”, namely, “scientific socialism”.  Don’t even think of trying to run a No True Scotsman evasion here.  And yes, a scientist did indeed drop the bomb, William Parsons of the Manhattan Project, to be precise.  It doesn’t matter if you kill someone in the name of science, God or for the contents of their wallet, you are still responsible for killing them.\nThis oft-repeated “defense” of science confuses action with motive.  The two are not the same.  But then, as we’ve already demonstrated, Kunshalini’s grasp of the language is sub-optimal.\nIs Vox really claiming that accidental deaths during moral procedures are equivalent to intentional killing in the name of an imaginary god? As he previously stated that it’s perfectly moral and good to kill babies if ‘god said so’, I may accept that he’s genuinely muddled up.\n[Sarcasm] Scientists must be so evil! Because of them, there are antibiotics and vaccinations! How immoral! Faith healing is the god-approved way!\nOne death is an accident, 783,000 deaths per year smack of carelessness.  Again, the sciencyst logic is bizarre; because of scientists there are chemical weapons and nuclear missiles, but that’s not their fault because they (usually) don’t personally use them on anyone “in the name of science”.  But antibiotics and vaccines are cited as supposed proof of the goodness of scientists, even though they don’t give them to anyone “in the name of science”.\nMan has been ready to move beyond religion for ages. It’s the utter stupidity of people like Vox Day that’s hindering humans from moving on. The ‘eternal damnation’ fear-mongers take no less credit for the blame.\nYes, I murdered six scientists just yesterday, and tomorrow I’m planning to steal all of the funding for research into women’s breast cancer.  I’m kind of a criminal savant.  And “for ages”, really?  Was it during the Bronze Age or the Iron Age that Man demonstrated his readiness to move beyond religion?\nThis is another insight into the lunatic religious mind. To them, knowledge is bad just because awareness kills childish fantasies and progress shatters the very foundations of their faith. He trumpets ignorance over knowledge, superstition over science, and claims that humans would fare better. He actually thinks that it’s a good thing to slide back 2000 years; back to the time where people actually believed that the earth was flat. It’s a good thing that Vox is not the supreme dictator of the earth, or I might have to kill myself just to die in dignity.\nActually, Kunshalini’s post indicates that it’s a bit late for her to die in dignity now.  But I’m sure we’re all eagerly awaiting the publication of her patent on long distance mind-reading, even if I am enraged by her untimely revelation of my secret intentions of returning the Purple Faction to its destined place of sporting primacy through the Empire.\nAve!  Ostrinum aeternitas!  Ave!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-12T12:21:00+00:00"
}