{
  "url": "https://voxday.net/2007/03/04/freedom-limited/",
  "scraped_at": "2026-01-08T21:33:45.118193",
  "title": "Freedom, Limited",
  "date_display": "March 4, 2007",
  "date_iso": "2007-03-04T13:28:00+00:00",
  "date_from_url": "2007-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One notes certain similarities in the language:</p><p><em>“None of the freedoms which are recognized for citizens can be exercised contrary to the existence and objectives of the socialist state, or contrary to the decision of the Cuban people to build socialism and communism. Violations of this principle can be punished by law.”</em> – Constitution of the Republic of Cuba, Article 62</p><p><em>“(1) Everyone has duties to the community in which alone the free and full development of his personality is possible.</em></p><p> (2) In the exercise of his rights and freedoms, everyone shall be subject only to such limitations as are determined by law solely for the purpose of securing due recognition and respect for the rights and freedoms of others and of meeting the just requirements of morality, public order and the general welfare in a democratic society.</p><p> (3) These rights and freedoms may in no case be exercised contrary to the purposes and principles of the United Nations.”<br>– The United Nations’ Universal Declaration of Human Rights, Article 29</br></p></div>",
  "content_text": "One notes certain similarities in the language:\n“None of the freedoms which are recognized for citizens can be exercised contrary to the existence and objectives of the socialist state, or contrary to the decision of the Cuban people to build socialism and communism. Violations of this principle can be punished by law.”\n– Constitution of the Republic of Cuba, Article 62\n“(1) Everyone has duties to the community in which alone the free and full development of his personality is possible.\n(2) In the exercise of his rights and freedoms, everyone shall be subject only to such limitations as are determined by law solely for the purpose of securing due recognition and respect for the rights and freedoms of others and of meeting the just requirements of morality, public order and the general welfare in a democratic society.\n(3) These rights and freedoms may in no case be exercised contrary to the purposes and principles of the United Nations.”\n– The United Nations’ Universal Declaration of Human Rights, Article 29",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-04T13:28:00+00:00"
}