{
  "url": "https://voxday.net/2007/03/20/i-am-tempted-2/",
  "scraped_at": "2026-01-08T21:35:50.014928",
  "title": "I am tempted",
  "date_display": "March 20, 2007",
  "date_iso": "2007-03-20T15:02:00+00:00",
  "date_from_url": "2007-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To play evolutionist and avoid these questions with a simple “if weren’t such a hopelessly ignorant and uneducated god-botherer, you would have read the study on mutating cockroaches that is kept in a locked gun safe bolted to the floor of the broom closet in the Harvard sociology department which answers your incredibly simplistic question that I am nevertheless not going to bother to answer in any meaningful way.”</p><p>But I can’t really do that and continue to rag on the dog-botherers for not answering questions, so I’ll have a whack at Raker’s inquisition here:</p><blockquote><p>#1: When a preborn child is developing, if there is an interuption in the process, like something stressful happening to the mother, or a drug overdose, the development isn’t delayed, the particular stage is passed. This is why people are born handicapped or deformed. I’m trying to transpose that idea over onto a child born healthy, only in this case, the child was never encouraged to develope very far mentally.</p><p>Do you suppose this child in his teen or adult years could develope a vastly improved IQ, or is chilhood the optimum time?</p></blockquote><p>Childhood appears to be the optimum time.  However, most adults still fall very far short of their adult potential.  Myself included.</p><blockquote><p>#2: Do you recall any unique methods your parents used to provoke mental advancement in your early years? (Things few, if any other people use)</p></blockquote><p>All I remember was that I never had a shortage of books.  As fast as I’d read them, as many as 70 per month at times, my mother would keep them coming.  I was the neighborhood’s MS Readathon nightmare.  My parents bought me two particularly good classics library; I wish I could remember the names.  One was these very tall books with the extended stories of Robin Hood, the Jungle Book and Paul Bunyan, the other had abridged versions of Greek classics and the original Harry Potter, Tom Brown.  Elementary school teachers were always astounded when I was familiar with Plato and Demosthenes, but it was simply a matter of having read those books.  I even tried putting pebbles in my mouth once just to see what it was like… never could figure out how that helped him.</p><blockquote><p>#3: If you had children, what would you do to the wee little tykes to stimulate their minds?</p></blockquote><p>Homeschool them.  Teach them their phonics at three and then let them advance at their own rate.  Give them histories, kids love history and they don’t realize it’s supposed to be boring.  I still love history, my current dilemma is whether to upgrade to the New Cambridge Medieval History series or stick with JW Bury, editor.</p><blockquote><p>#4: If there are things that strain your cognitive abilities, are you immediately aware of it (man am I groggy) or do you first notice it in performance?</p></blockquote><p>Yes.  I find math to be tedious in the extreme.  I always do well on tests, but I simply loathe it.  I used to keep Isaac Asimov’s Guide to Physics by my bedside, that could knock me out in two pages.  I’m also not very good with languages, I waste too much effort trying to understand a nonexistent logic rather than simply going with it.</p><blockquote><p>#5: Have you ever tried herbal (or other) suppliments like ginko-gilboa (sp?) that alledgedly improve the mind, and if so, did you notice a benefit?</p></blockquote><p>It’s called caffeine.  I’m not so much addicted as enamoured.</p><blockquote><p>#6: You’ve no doubt heard the numbers that say most people only use a portion of their brain, say 20%. Do you have any thoughts regarding this? For example -I’m making this up- It’s like the difference between ram and hard drive, the unused portion being the hard drive, storage. Having great reserves of storage won’t help with problem solving, because ram and hard drive usually remain separate.  Like I said, that’s totally made up, but do you have any speculations or observations about this vast unused mind business?</p></blockquote><p>I have no idea what they’re talking about.</p><blockquote><p>#7: What is the biggest mistake you see people make regarding how they use or train their minds?</p></blockquote><p>They don’t use it.  It’s amazing how easy it is to accept assumptions.  I believed the crust was “the best part of the bread” until I was 27, eating it reluctantly because my mother had told me that when I was young and I simply never gave the matter a moment’s thought.  The best part was when Spacebunny, knowing this, asked my brother about it… after she quizzed him regarding his answer, he paused for a long moment, then shouted “MOM!”</p><blockquote><p>#8: On a daily basis, are your mental abilities much affected by things like: sleep, sugar, overeating, undereating, water consumption and exersize?</p></blockquote><p>Not much.  I usually do my most creative thinking when I’m half out of it from staying up too late.  Which, in my case, means the sun is coming up.  I don’t know if it’s a cause or a result, but I find that I tend to eat and sleep less when I’m going through a creative phase.  I also look like a zombie on crack, but hey, that’s sexy, right?</p><blockquote><p>#9: What place has curiosity? For example, I long held reading as the most important thing I could teach a child, as it is the key to unlock other knowledge. Now though, I’m thinking that healthy curiosity is a priority. Are the people you regard highly people with an active curiosity?</p></blockquote><p>Almost every highly intelligent person I know is incredibly curious.  This tends to get them into trouble, of course, and tends to lead to bizarre stories that you’d never believe if you weren’t there, as well as great lines such as “I thought your father was in Peru!” and “Dude, you can’t wrestle with those pigs, they’ll eat you.”</p><blockquote><p>#10: If a person had a limited IQ, it was obvious they would never be much more, what subject do you think would be most beneficial for them to study? That is, is there one subject (math, logic, reading, etc) that would have the most all around practicality in everyday life?</p></blockquote><p>Everyone’s IQ is limited.  But I understand… I would say basic logic and attempting to instill a general love of reading would be the most helpful, since history and things that require pattern-recognition is not going to be a strong point, to say nothing of math.  Helping them recognize patterns of behavior in others would probably be most beneficial.</p><blockquote><p>#11: When I was much younger, I started in on this experiment if you will. I would simultaneously read a book and listen to a talk show at the same time, and be able to repeat each. I have since been through very heavy drug abuse, and while I doubt I could do the same now, I wouldn’t want to for this reason: The thing got away from me. I would be standing in a group of people, and while conversing with one person, I would be following some else’s conversation, or, when tired, and wanting to concentrate on one topic, my mind would launch into two. Beleive me, I’ve gotten over it, one topic is hard enough now, even wide awake.</p></blockquote><p>What?  As Spacebunny knows, being 50 percent there tends to run on the high side for me.  However, I’ve been able to listen and read as long as I can remember, after third grade my teachers permitted me to do so openly after I demonstrated that I could follow along with the class while having my nose in a book.</p><blockquote><p>Anyway-y-y, have you ever engaged in any mind experiments that were benificial or regretful?</p></blockquote><p>I plead the Fifth Amendment.</p><blockquote><p>#12: I read that Albert Einstein wouldn’t memorize things like phone numbers or addresses, because he didn’t want trivial information taking up space in his mind. Any thoughts on this?</p></blockquote><p>I’m skeptical.  That sounds like a clever excuse not to waste time and effort on people that don’t interest him to me.  It’s also straight ou<br> t of Arthur Conan Doyle.  While I don’t think Einstein was a fraud or anything, I do think he had more than a little Andy Warhol in him.  I think his reputation will fade significantly with  time.</br></p><blockquote><p>#13: Speaking of Einstein, he became aware of previously unknown forces and formulas. If you could go back in time and try to explain to people what electricity was, or steam power, you could at least point to lightning or a kettle and attempt an explanation. But this relativity, this mass equals energy, was so new, I’m amazed that he saw it so boldly.  Anyway, do you suppose there will be other discoveries as dramatic, or might we be leveling off in that regard?</p></blockquote><p>We’ll see how it holds up over time, won’t we.  I think there will be discoveries that will be more dramatic than we are imagining, that will rock science to its very core.</p><blockquote><p>#14: Do you have any ideas regarding man’s intellect in past ages? This would include Adam and Eve, stories one hears about lost civilizations, ancient technology used by the Egyptians and others. Also any overall chronological observations, as in scenarios where the intellect of the masses declines, and higher IQ is a commodity that would be scarce, with increased efforts to silence or hire said ability.</p></blockquote><p>Anyone who is sufficiently well read in history is aware that ancient man was just as intelligent, and just as capable of doing stupid things with that intelligence, as we are.  This is one reason I loathe the idea of Progress, the notion that we are somehow superior to the medieval scholastics or the Athenian Greeks on the basis of possessing superior metallurgy and satellite television.</p><p>The intelligence of the masses is not declining, but their level of education is.  This is ironic, given that more people believe they possess a solid education than ever before, since they’ve been physically present in a building owned by a university for a sufficient period of time.  Of course, they are completely wrong.</p><p>If you want to learn, then read.  Books are simply stored knowledge, but you have to open them to get at it.</p></div>",
  "content_text": "To play evolutionist and avoid these questions with a simple “if weren’t such a hopelessly ignorant and uneducated god-botherer, you would have read the study on mutating cockroaches that is kept in a locked gun safe bolted to the floor of the broom closet in the Harvard sociology department which answers your incredibly simplistic question that I am nevertheless not going to bother to answer in any meaningful way.”\nBut I can’t really do that and continue to rag on the dog-botherers for not answering questions, so I’ll have a whack at Raker’s inquisition here:\n#1: When a preborn child is developing, if there is an interuption in the process, like something stressful happening to the mother, or a drug overdose, the development isn’t delayed, the particular stage is passed. This is why people are born handicapped or deformed. I’m trying to transpose that idea over onto a child born healthy, only in this case, the child was never encouraged to develope very far mentally.\nDo you suppose this child in his teen or adult years could develope a vastly improved IQ, or is chilhood the optimum time?\nChildhood appears to be the optimum time.  However, most adults still fall very far short of their adult potential.  Myself included.\n#2: Do you recall any unique methods your parents used to provoke mental advancement in your early years? (Things few, if any other people use)\nAll I remember was that I never had a shortage of books.  As fast as I’d read them, as many as 70 per month at times, my mother would keep them coming.  I was the neighborhood’s MS Readathon nightmare.  My parents bought me two particularly good classics library; I wish I could remember the names.  One was these very tall books with the extended stories of Robin Hood, the Jungle Book and Paul Bunyan, the other had abridged versions of Greek classics and the original Harry Potter, Tom Brown.  Elementary school teachers were always astounded when I was familiar with Plato and Demosthenes, but it was simply a matter of having read those books.  I even tried putting pebbles in my mouth once just to see what it was like… never could figure out how that helped him.\n#3: If you had children, what would you do to the wee little tykes to stimulate their minds?\nHomeschool them.  Teach them their phonics at three and then let them advance at their own rate.  Give them histories, kids love history and they don’t realize it’s supposed to be boring.  I still love history, my current dilemma is whether to upgrade to the New Cambridge Medieval History series or stick with JW Bury, editor.\n#4: If there are things that strain your cognitive abilities, are you immediately aware of it (man am I groggy) or do you first notice it in performance?\nYes.  I find math to be tedious in the extreme.  I always do well on tests, but I simply loathe it.  I used to keep Isaac Asimov’s Guide to Physics by my bedside, that could knock me out in two pages.  I’m also not very good with languages, I waste too much effort trying to understand a nonexistent logic rather than simply going with it.\n#5: Have you ever tried herbal (or other) suppliments like ginko-gilboa (sp?) that alledgedly improve the mind, and if so, did you notice a benefit?\nIt’s called caffeine.  I’m not so much addicted as enamoured.\n#6: You’ve no doubt heard the numbers that say most people only use a portion of their brain, say 20%. Do you have any thoughts regarding this? For example -I’m making this up- It’s like the difference between ram and hard drive, the unused portion being the hard drive, storage. Having great reserves of storage won’t help with problem solving, because ram and hard drive usually remain separate.  Like I said, that’s totally made up, but do you have any speculations or observations about this vast unused mind business?\nI have no idea what they’re talking about.\n#7: What is the biggest mistake you see people make regarding how they use or train their minds?\nThey don’t use it.  It’s amazing how easy it is to accept assumptions.  I believed the crust was “the best part of the bread” until I was 27, eating it reluctantly because my mother had told me that when I was young and I simply never gave the matter a moment’s thought.  The best part was when Spacebunny, knowing this, asked my brother about it… after she quizzed him regarding his answer, he paused for a long moment, then shouted “MOM!”\n#8: On a daily basis, are your mental abilities much affected by things like: sleep, sugar, overeating, undereating, water consumption and exersize?\nNot much.  I usually do my most creative thinking when I’m half out of it from staying up too late.  Which, in my case, means the sun is coming up.  I don’t know if it’s a cause or a result, but I find that I tend to eat and sleep less when I’m going through a creative phase.  I also look like a zombie on crack, but hey, that’s sexy, right?\n#9: What place has curiosity? For example, I long held reading as the most important thing I could teach a child, as it is the key to unlock other knowledge. Now though, I’m thinking that healthy curiosity is a priority. Are the people you regard highly people with an active curiosity?\nAlmost every highly intelligent person I know is incredibly curious.  This tends to get them into trouble, of course, and tends to lead to bizarre stories that you’d never believe if you weren’t there, as well as great lines such as “I thought your father was in Peru!” and “Dude, you can’t wrestle with those pigs, they’ll eat you.”\n#10: If a person had a limited IQ, it was obvious they would never be much more, what subject do you think would be most beneficial for them to study? That is, is there one subject (math, logic, reading, etc) that would have the most all around practicality in everyday life?\nEveryone’s IQ is limited.  But I understand… I would say basic logic and attempting to instill a general love of reading would be the most helpful, since history and things that require pattern-recognition is not going to be a strong point, to say nothing of math.  Helping them recognize patterns of behavior in others would probably be most beneficial.\n#11: When I was much younger, I started in on this experiment if you will. I would simultaneously read a book and listen to a talk show at the same time, and be able to repeat each. I have since been through very heavy drug abuse, and while I doubt I could do the same now, I wouldn’t want to for this reason: The thing got away from me. I would be standing in a group of people, and while conversing with one person, I would be following some else’s conversation, or, when tired, and wanting to concentrate on one topic, my mind would launch into two. Beleive me, I’ve gotten over it, one topic is hard enough now, even wide awake.\nWhat?  As Spacebunny knows, being 50 percent there tends to run on the high side for me.  However, I’ve been able to listen and read as long as I can remember, after third grade my teachers permitted me to do so openly after I demonstrated that I could follow along with the class while having my nose in a book.\nAnyway-y-y, have you ever engaged in any mind experiments that were benificial or regretful?\nI plead the Fifth Amendment.\n#12: I read that Albert Einstein wouldn’t memorize things like phone numbers or addresses, because he didn’t want trivial information taking up space in his mind. Any thoughts on this?\nI’m skeptical.  That sounds like a clever excuse not to waste time and effort on people that don’t interest him to me.  It’s also straight ou\nt of Arthur Conan Doyle.  While I don’t think Einstein was a fraud or anything, I do think he had more than a little Andy Warhol in him.  I think his reputation will fade significantly with  time.\n#13: Speaking of Einstein, he became aware of previously unknown forces and formulas. If you could go back in time and try to explain to people what electricity was, or steam power, you could at least point to lightning or a kettle and attempt an explanation. But this relativity, this mass equals energy, was so new, I’m amazed that he saw it so boldly.  Anyway, do you suppose there will be other discoveries as dramatic, or might we be leveling off in that regard?\nWe’ll see how it holds up over time, won’t we.  I think there will be discoveries that will be more dramatic than we are imagining, that will rock science to its very core.\n#14: Do you have any ideas regarding man’s intellect in past ages? This would include Adam and Eve, stories one hears about lost civilizations, ancient technology used by the Egyptians and others. Also any overall chronological observations, as in scenarios where the intellect of the masses declines, and higher IQ is a commodity that would be scarce, with increased efforts to silence or hire said ability.\nAnyone who is sufficiently well read in history is aware that ancient man was just as intelligent, and just as capable of doing stupid things with that intelligence, as we are.  This is one reason I loathe the idea of Progress, the notion that we are somehow superior to the medieval scholastics or the Athenian Greeks on the basis of possessing superior metallurgy and satellite television.\nThe intelligence of the masses is not declining, but their level of education is.  This is ironic, given that more people believe they possess a solid education than ever before, since they’ve been physically present in a building owned by a university for a sufficient period of time.  Of course, they are completely wrong.\nIf you want to learn, then read.  Books are simply stored knowledge, but you have to open them to get at it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-20T15:02:00+00:00"
}