{
  "url": "https://voxday.net/2007/03/19/neal-stephenson-groks-supremely/",
  "scraped_at": "2026-01-08T21:35:40.789500",
  "title": "Neal Stephenson groks supremely",
  "date_display": "March 19, 2007",
  "date_iso": "2007-03-19T10:29:00+00:00",
  "date_from_url": "2007-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nytimes.com/2007/03/18/opinion/18stephenson.html?ex=1331870400&amp;en=8868294e84af9bd9&amp;ei=5124&amp;partner=permalink&amp;exprod=permalink\">As always</a>.  How strange that neither the Republican Party nor the SFWA do:</p><blockquote><p>Our so-called conservatives, <b>who have cut all ties to their own intellectual moorings</b>, now espouse policies and personalities that would get them laughed out of Periclean Athens. The few conservatives still able to hold up one end of a Socratic dialogue are those in the ostracized libertarian wing — interestingly enough, a group with a disproportionately high representation among fans of speculative fiction….</p><p><b>Lack of critical respect means nothing</b> to sci-fi’s creators and fans….</p><p>The growing popularity of science fiction, the rise of graphic novels, anime and video games, and the fact that geeks can make lots of money now, have given creators and fans of this kind of art a confidence, even a swagger, that — hard as it is for some of us to believe — is kind of cool now.</p></blockquote><p>Stephenson, the American writer whose intelligence I regard most highly, nails it on several levels here.  My personal experience tracks what he’s describing on a more general level; people have always laughed at my devotion to electronic games as well as the level of my interest in the martial arts.</p><p>I never cared, I had no interest in whatever stupid television shows they were all watching either, much less in reading the meandering, yawn-inducing, self-preoccupied, tree-murdering tedium produced by the self-proclaimed literati.  I’ve never seen any show ending in “Idol” or “90210” or beginning with “The”, (with the exception of “The X-Files” and “The Dresden Files”) nor do I have any clue who won any writing award except for the Nebula for the last decade plus.</p><p>(And after looking at this year’s Nebula ballot, I don’t find myself terribly inclined to do that anymore either.  Which is ironic, seeing as how I’m on the 2007 jury and everything.)</p><p>It is, however, somewhat amusing how the laughter suddenly dies down when your little game happens to sell a few million units.</p></div>",
  "content_text": "As always\n.  How strange that neither the Republican Party nor the SFWA do:\nOur so-called conservatives,\nwho have cut all ties to their own intellectual moorings\n, now espouse policies and personalities that would get them laughed out of Periclean Athens. The few conservatives still able to hold up one end of a Socratic dialogue are those in the ostracized libertarian wing — interestingly enough, a group with a disproportionately high representation among fans of speculative fiction….\nLack of critical respect means nothing\nto sci-fi’s creators and fans….\nThe growing popularity of science fiction, the rise of graphic novels, anime and video games, and the fact that geeks can make lots of money now, have given creators and fans of this kind of art a confidence, even a swagger, that — hard as it is for some of us to believe — is kind of cool now.\nStephenson, the American writer whose intelligence I regard most highly, nails it on several levels here.  My personal experience tracks what he’s describing on a more general level; people have always laughed at my devotion to electronic games as well as the level of my interest in the martial arts.\nI never cared, I had no interest in whatever stupid television shows they were all watching either, much less in reading the meandering, yawn-inducing, self-preoccupied, tree-murdering tedium produced by the self-proclaimed literati.  I’ve never seen any show ending in “Idol” or “90210” or beginning with “The”, (with the exception of “The X-Files” and “The Dresden Files”) nor do I have any clue who won any writing award except for the Nebula for the last decade plus.\n(And after looking at this year’s Nebula ballot, I don’t find myself terribly inclined to do that anymore either.  Which is ironic, seeing as how I’m on the 2007 jury and everything.)\nIt is, however, somewhat amusing how the laughter suddenly dies down when your little game happens to sell a few million units.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-19T10:29:00+00:00"
}