{
  "url": "https://voxday.net/2007/03/12/proving-definition/",
  "scraped_at": "2026-01-08T21:34:58.375619",
  "title": "Proving the definition",
  "date_display": "March 12, 2007",
  "date_iso": "2007-03-12T20:52:00+00:00",
  "date_from_url": "2007-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins <a href=\"http://richarddawkins.net/article,303,Reading-of-The-God-Delusion-in-Lynchburg-VA,Richard-Dawkins--C-SPAN2\">demonstrates the accuracy</a> of my definition of the distinction between agnostic and atheist:</p><blockquote><p>“Many of the questioners announced themselves as either students or faculty from Liberty, rather than from Randolph Macon which was my host institution. One by one they tried to trip me up, and one by one their failure to do so was applauded by the audience. Finally, I said that my advice to all Liberty students was to resign immediately and apply to a proper university instead. That received thunderous applause, so that I almost began to feel slightly sorry for the Liberty people.</p></blockquote><p>If anyone is feeling ambitious, I’d appreciate a transcript of the Q&amp;A.  I can’t quite stomach sitting through it myself, after a steady diet of the supercilious jerk’s books over the last two weeks.  He’s not entirely unlikable as an author, and can be downright charming when he’s writing about something that he enjoys as in <em>Unweaving the Rainbow</em> but the smugness starts to get a bit irritating after a while, especially when he is adroitly avoiding all of the tough questions and skillfully evading any inaccurate assertions that will prove too embarrassing while writing little passive-aggressive implications to serve as a substitute.</p><p>(This is in contrast to Sam Harris, of course, who gleefully jams his foot all the way down into his lower intestine.  Dawkins greatest weakness may be his ghastly foolishness in trusting Harris’s research enough to quote him.  I’m looking forward to reading some of his excuses… “It’s not my fault, I’m British after all, how would I know?”)</p><p>So I am looking forward to the day when his questioners will be rather better armed.  And it would be interesting, of course, to learn if he actually dealt with the questions asked or was merely playing to the crowd.</p><p>What’s downright unlikeable is his self-congratulatory tone in hailing his stunning accomplishment in effectively dealing with questions from <em>college students</em>.  I can’t help but contrast the way he describes his treatment of them with the gentle and helpful way in which I once saw Umberto Eco deal with an incredibly dumb question from a college girl.  You could see the man was a born teacher… Dawkins appears to be more of an instinctive propagandist.</p><p>I think I’d like both an oral debate and a written debate with Dawkins.   But with Harris, I want both plus a cage match.  Best two of three wins… and I’ll throw one of the debates just to make sure we get to the cage.</p></div>",
  "content_text": "Richard Dawkins\ndemonstrates the accuracy\nof my definition of the distinction between agnostic and atheist:\n“Many of the questioners announced themselves as either students or faculty from Liberty, rather than from Randolph Macon which was my host institution. One by one they tried to trip me up, and one by one their failure to do so was applauded by the audience. Finally, I said that my advice to all Liberty students was to resign immediately and apply to a proper university instead. That received thunderous applause, so that I almost began to feel slightly sorry for the Liberty people.\nIf anyone is feeling ambitious, I’d appreciate a transcript of the Q&A.  I can’t quite stomach sitting through it myself, after a steady diet of the supercilious jerk’s books over the last two weeks.  He’s not entirely unlikable as an author, and can be downright charming when he’s writing about something that he enjoys as in\nUnweaving the Rainbow\nbut the smugness starts to get a bit irritating after a while, especially when he is adroitly avoiding all of the tough questions and skillfully evading any inaccurate assertions that will prove too embarrassing while writing little passive-aggressive implications to serve as a substitute.\n(This is in contrast to Sam Harris, of course, who gleefully jams his foot all the way down into his lower intestine.  Dawkins greatest weakness may be his ghastly foolishness in trusting Harris’s research enough to quote him.  I’m looking forward to reading some of his excuses… “It’s not my fault, I’m British after all, how would I know?”)\nSo I am looking forward to the day when his questioners will be rather better armed.  And it would be interesting, of course, to learn if he actually dealt with the questions asked or was merely playing to the crowd.\nWhat’s downright unlikeable is his self-congratulatory tone in hailing his stunning accomplishment in effectively dealing with questions from\ncollege students\n.  I can’t help but contrast the way he describes his treatment of them with the gentle and helpful way in which I once saw Umberto Eco deal with an incredibly dumb question from a college girl.  You could see the man was a born teacher… Dawkins appears to be more of an instinctive propagandist.\nI think I’d like both an oral debate and a written debate with Dawkins.   But with Harris, I want both plus a cage match.  Best two of three wins… and I’ll throw one of the debates just to make sure we get to the cage.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-12T20:52:00+00:00"
}