{
  "url": "https://voxday.net/2007/03/13/science-last-redoub/",
  "scraped_at": "2026-01-08T21:35:03.897258",
  "title": "Science: the last redoubt",
  "date_display": "March 13, 2007",
  "date_iso": "2007-03-13T09:25:00+00:00",
  "date_from_url": "2007-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have successfully demonstrated that religion does not, as atheists claim, cause war.  I have successfully demonstrated that if science is not held responsible for various evils it makes possible, it cannot be held responsible for various goods it likewise makes possible.  And I have successfully demonstrated that IF one rejects religion’s right to a respected place in modern society, THEN one has an even greater reason to reject science’s right to one.</p><p>The truth of these assertions can be seen in the most common response, which shows the position to which the sciencists have been forced to retreat.  Shalini <a href=\"http://scientianatura.blogspot.com/2007/03/case-against-science-is-still-baseless.html\">offers a typical such defense</a>, so I shall quote her as being representative of the bunch:</p><blockquote><p>I don’t blame religion itself responsible; instead, I blame the people responsible. What Vox Day refuses to understand is that science itself does not lead to bombings and wars. It is the fault of the people who use science for their own personal and evil goals.</p><p>What I find wrong about religion is that it claims to provide humanity with a hard-and-fast ethical guide, but it fails to do so in the real world. On the other hand, science does not claim to provide an ethical or a moral worldview. Therefore, Vox’s gripe that science does not provide ethical guidelines is a invalid as science never claimed to provide any ethical guidelines whatsoever.</p></blockquote><p>The reader will no doubt note that this is a massive retreat from the aggressive atheist position maintained by Harris and Dawkins.  But it is still an indefensible one, as I shall demonstrate. and religion does provide Man with a hard-and-fast ethical guide in the real world, in fact, it provides Man with several competing guides.    Shalini’s statement is in error.</p><p>It is true that Science, the body of knowledge, does not claim to provide an ethical or moral worldview in itself.  It cannot, any more than a catalog can tell you exactly what to buy.  Nor can science as process, except in that its focus on materialism could be interpreted as the beginnings of a Nietzschean existential ethic, but we shall ignore that tangent since the process does not directly claim one.</p><p>However, science as profession ABSOLUTELY claims to provide not only ethical guidelines, but ethical imperatives.  By way of example, I cite the recent Global Warming study wherein 9 out of 10 scientists surveyed recommended Dentyne… or rather, that 90 percent of global warming caused by Man.</p><p>Now, if scientists were content to leave it at that, the sciencists might have a genuine defense.  But they don’t.  Because scientists not only advocate certain actions, they claim them as a ethical necessity.  After all, a warmer Earth is simply a warmer Earth, there is no ideal planetary temperature in any ethical system of which I have ever heard.</p><p>Moreover, the body of knowledge can contain elements which provide the justification for certain actions, as directly or in some cases even more directly than the Bible does.  After all, belief in the possibility that God could speak to you and order you to kill Canaanites is not tantamount to the belief that God IS talking to you and ordering you to kill Canaanites, much less that God will be happy if you hunt down Canaanites and kill them on your own initiative.</p><p>And the fact that evils committed by individuals not only take place through the applied use of science, but are often committed expressly in the name of science condemns science as thoroughly as anyone could possibly condemn religion.  Hitler was inspired to breed his perfect Aryans by St. Darwin and Science, just as Margaret Sanger sought to eliminate the darkies and mental defectives.  And scientific theories have certainly lead directly to war, for example, the <em>Lebensraum</em> concept that sparked World War II was not merely a political slogan, it was a hypothesis that “was adapted from Darwinian and other scientific ideas of the day about how ecological niches are filled.”</p><p>The fact that scientists today reject <em>Lebensraum</em> as properly belonging to the body of knowledge does not change the fact that some of them once believed it was rightful part of it, or that the German invasions were based and justified on the imperative posed by this scientific priniciple.</p></div>",
  "content_text": "I have successfully demonstrated that religion does not, as atheists claim, cause war.  I have successfully demonstrated that if science is not held responsible for various evils it makes possible, it cannot be held responsible for various goods it likewise makes possible.  And I have successfully demonstrated that IF one rejects religion’s right to a respected place in modern society, THEN one has an even greater reason to reject science’s right to one.\nThe truth of these assertions can be seen in the most common response, which shows the position to which the sciencists have been forced to retreat.  Shalini\noffers a typical such defense\n, so I shall quote her as being representative of the bunch:\nI don’t blame religion itself responsible; instead, I blame the people responsible. What Vox Day refuses to understand is that science itself does not lead to bombings and wars. It is the fault of the people who use science for their own personal and evil goals.\nWhat I find wrong about religion is that it claims to provide humanity with a hard-and-fast ethical guide, but it fails to do so in the real world. On the other hand, science does not claim to provide an ethical or a moral worldview. Therefore, Vox’s gripe that science does not provide ethical guidelines is a invalid as science never claimed to provide any ethical guidelines whatsoever.\nThe reader will no doubt note that this is a massive retreat from the aggressive atheist position maintained by Harris and Dawkins.  But it is still an indefensible one, as I shall demonstrate. and religion does provide Man with a hard-and-fast ethical guide in the real world, in fact, it provides Man with several competing guides.    Shalini’s statement is in error.\nIt is true that Science, the body of knowledge, does not claim to provide an ethical or moral worldview in itself.  It cannot, any more than a catalog can tell you exactly what to buy.  Nor can science as process, except in that its focus on materialism could be interpreted as the beginnings of a Nietzschean existential ethic, but we shall ignore that tangent since the process does not directly claim one.\nHowever, science as profession ABSOLUTELY claims to provide not only ethical guidelines, but ethical imperatives.  By way of example, I cite the recent Global Warming study wherein 9 out of 10 scientists surveyed recommended Dentyne… or rather, that 90 percent of global warming caused by Man.\nNow, if scientists were content to leave it at that, the sciencists might have a genuine defense.  But they don’t.  Because scientists not only advocate certain actions, they claim them as a ethical necessity.  After all, a warmer Earth is simply a warmer Earth, there is no ideal planetary temperature in any ethical system of which I have ever heard.\nMoreover, the body of knowledge can contain elements which provide the justification for certain actions, as directly or in some cases even more directly than the Bible does.  After all, belief in the possibility that God could speak to you and order you to kill Canaanites is not tantamount to the belief that God IS talking to you and ordering you to kill Canaanites, much less that God will be happy if you hunt down Canaanites and kill them on your own initiative.\nAnd the fact that evils committed by individuals not only take place through the applied use of science, but are often committed expressly in the name of science condemns science as thoroughly as anyone could possibly condemn religion.  Hitler was inspired to breed his perfect Aryans by St. Darwin and Science, just as Margaret Sanger sought to eliminate the darkies and mental defectives.  And scientific theories have certainly lead directly to war, for example, the\nLebensraum\nconcept that sparked World War II was not merely a political slogan, it was a hypothesis that “was adapted from Darwinian and other scientific ideas of the day about how ecological niches are filled.”\nThe fact that scientists today reject\nLebensraum\nas properly belonging to the body of knowledge does not change the fact that some of them once believed it was rightful part of it, or that the German invasions were based and justified on the imperative posed by this scientific priniciple.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-13T09:25:00+00:00"
}