{
  "url": "https://voxday.net/2007/03/09/well-i-do-have-gay-fan-club/",
  "scraped_at": "2026-01-08T21:34:41.845785",
  "title": "Well, I do have a gay fan club",
  "date_display": "March 9, 2007",
  "date_iso": "2007-03-09T16:43:00+00:00",
  "date_from_url": "2007-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Twinkletoes <a href=\"http://www.hogonice.com/2007/03/vox_day_is_gay_possibly.html\">obviously doesn’t read this blog</a>:</p><blockquote><p>I’m just guessing here, but I’m starting to suspect that Vox Day is as gay as riding a girl’s bike while holding your mom’s purse and wearing a pink shirt.</p><p>Here is a comment Aaron left: “When your hair is your trademark, you join John ‘Breck Girl’ Edwards and it becomes clear that Vox protesteth too much.”</p><p>I don’t know why I didn’t see this before. Think about it.</p><p>1. He mentions is Mensa membership on his blog. Mensa is full of single men who make a good living. What better place for a young guy who needs a ride through life to cruise?</p><p>2. He says he plays Madden, which is a video game. Remember how Michael Jackson used video games to lure his conquests? It’s brilliant. You spend hours on the couch with another guy…maybe beer is present…one thing can lead to another.</p><p>3. He says he belongs to SWFA. I’m not sure, but I think that may be “Soft-Wristed Flamers Association.”</p></blockquote><p>1.  No, I don’t.  Column bio |= blog.<br>2.  Word ’em up.  Since 1992.  I am frighteningly good at Maddens.  Not just good, frighteningly good.<br>3.  That’s SFWA, Twinkletoes.  SFWA.  Although actually, that’s not terribly far from the truth.  Still, Seriously Fat Women Authors would arguably be closer.</br></br></p><p>Sadly, Twinkletoes doesn’t rate when it comes to the Insult rating.  I imagine it’s due to his strong anti-slur beliefs; he just doesn’t have the practice.  While he did nail the homosexual and Mensa references and implied a hairstyle reference – we’ll give credit for the picture – he left out a) the assertion that no women will ever have sex with me, b) that I live in my parent’s basement, c) that he will never have sex with me, d) no LOL, ROTFL or ROTFLMAO e) that I am a mysogynist, f) that I am a fascist / Nazi/ totalitarian / authoritarian / etc and g) that Daddy got me my job.</p><p>I’ve seen better.  Although he does demonstrate his skills as a humorist when he writes: <em>“I don’t care about hurting Vox Day’s feelings. It’s not my problem if he has a glass chin, or his fans have one on his behalf. And what’s sauce for the goose is sauce for the gander. It was perfectly appropriate for me to insult him personally, and in case no one noticed, I also ripped his sophomoric writing and half-baked beliefs, which is the farthest thing from a personal attack. The guy has NOTHING, at least compared to the image he tries to project. His thinking is as thin as the margin by which he made it into Mensa.”</em></p><p>Yep, glass chin and sophmoric writing, that’s me.  One absent-minded slur and he’s posting away like a madman, he was up to seven posts based on one “Twinkletoes” before I’d even heard about it… now who’s got that glass chin, exactly?  I don’t think the gentleman understands that it’s not possible for him to hurt my feelings, as it would be like fretting about being pinned by a gnat.  What’s funny about this is that I didn’t even intend to insult Mr. Sensitivity nor know anything about him, I was merely staking my stated position as being pro-slur.</p><p>But obviously, I’m pleased that my rhetorical kung fu is so strong, it managed to convince Steve to abandon his public anti-slur stance.  Twinkletoes, my dear child, if you’re anti-slur, <em>you shouldn’t use them regardless of the target’s attitude towards them.</em> I realize, of course, that this sort of basic logic might be difficult for a lawyer to grasp, lacking as it is in any emanations or penumbras.</p><p>But as long as we’re at it, let’s get this straight.  Steve <a href=\"http://www.hogonice.com/2007/03/faggot_science.html\">asserts that Electrical Engineers are scientists</a>.  Fantastic!  I had no idea that I am not only a scientist myself, but I am now the son of a scientist!  An elite scientist, no less!</p><p>So, I must ask him this: are only electrical engineers scientists, or is this true of all other engineers as well?</p><p>UPDATE – Upon further review, it seems I must rethink the way in which I addressed Hog on Ice: <em>I am starting to attract skinheads from the right and moonbats from the left. Comments closed.<br>Steve H. | Homepage | 03.03.07 – 5:20 pm | # </br></em></p><p>Did I say “Twinkletoes”?  I obviously should have said “chickenshit”.</p></div>",
  "content_text": "Twinkletoes\nobviously doesn’t read this blog\n:\nI’m just guessing here, but I’m starting to suspect that Vox Day is as gay as riding a girl’s bike while holding your mom’s purse and wearing a pink shirt.\nHere is a comment Aaron left: “When your hair is your trademark, you join John ‘Breck Girl’ Edwards and it becomes clear that Vox protesteth too much.”\nI don’t know why I didn’t see this before. Think about it.\n1. He mentions is Mensa membership on his blog. Mensa is full of single men who make a good living. What better place for a young guy who needs a ride through life to cruise?\n2. He says he plays Madden, which is a video game. Remember how Michael Jackson used video games to lure his conquests? It’s brilliant. You spend hours on the couch with another guy…maybe beer is present…one thing can lead to another.\n3. He says he belongs to SWFA. I’m not sure, but I think that may be “Soft-Wristed Flamers Association.”\n1.  No, I don’t.  Column bio |= blog.\n2.  Word ’em up.  Since 1992.  I am frighteningly good at Maddens.  Not just good, frighteningly good.\n3.  That’s SFWA, Twinkletoes.  SFWA.  Although actually, that’s not terribly far from the truth.  Still, Seriously Fat Women Authors would arguably be closer.\nSadly, Twinkletoes doesn’t rate when it comes to the Insult rating.  I imagine it’s due to his strong anti-slur beliefs; he just doesn’t have the practice.  While he did nail the homosexual and Mensa references and implied a hairstyle reference – we’ll give credit for the picture – he left out a) the assertion that no women will ever have sex with me, b) that I live in my parent’s basement, c) that he will never have sex with me, d) no LOL, ROTFL or ROTFLMAO e) that I am a mysogynist, f) that I am a fascist / Nazi/ totalitarian / authoritarian / etc and g) that Daddy got me my job.\nI’ve seen better.  Although he does demonstrate his skills as a humorist when he writes:\n“I don’t care about hurting Vox Day’s feelings. It’s not my problem if he has a glass chin, or his fans have one on his behalf. And what’s sauce for the goose is sauce for the gander. It was perfectly appropriate for me to insult him personally, and in case no one noticed, I also ripped his sophomoric writing and half-baked beliefs, which is the farthest thing from a personal attack. The guy has NOTHING, at least compared to the image he tries to project. His thinking is as thin as the margin by which he made it into Mensa.”\nYep, glass chin and sophmoric writing, that’s me.  One absent-minded slur and he’s posting away like a madman, he was up to seven posts based on one “Twinkletoes” before I’d even heard about it… now who’s got that glass chin, exactly?  I don’t think the gentleman understands that it’s not possible for him to hurt my feelings, as it would be like fretting about being pinned by a gnat.  What’s funny about this is that I didn’t even intend to insult Mr. Sensitivity nor know anything about him, I was merely staking my stated position as being pro-slur.\nBut obviously, I’m pleased that my rhetorical kung fu is so strong, it managed to convince Steve to abandon his public anti-slur stance.  Twinkletoes, my dear child, if you’re anti-slur,\nyou shouldn’t use them regardless of the target’s attitude towards them.\nI realize, of course, that this sort of basic logic might be difficult for a lawyer to grasp, lacking as it is in any emanations or penumbras.\nBut as long as we’re at it, let’s get this straight.  Steve\nasserts that Electrical Engineers are scientists\n.  Fantastic!  I had no idea that I am not only a scientist myself, but I am now the son of a scientist!  An elite scientist, no less!\nSo, I must ask him this: are only electrical engineers scientists, or is this true of all other engineers as well?\nUPDATE – Upon further review, it seems I must rethink the way in which I addressed Hog on Ice:\nI am starting to attract skinheads from the right and moonbats from the left. Comments closed.\nSteve H. | Homepage | 03.03.07 – 5:20 pm | #\nDid I say “Twinkletoes”?  I obviously should have said “chickenshit”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-09T16:43:00+00:00"
}