{
  "url": "https://voxday.net/2007/03/09/whoosh-factor/",
  "scraped_at": "2026-01-08T21:34:30.366809",
  "title": "The whoosh factor",
  "date_display": "March 9, 2007",
  "date_iso": "2007-03-09T08:41:00+00:00",
  "date_from_url": "2007-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Blog of Very Moderate Logic <a href=\"http://moderateleft.com/?p=3193\">struggles with what little it possesses</a>.  Most of it is irrelevant “PZ says” blather, in fact, he even quotes PZ’s lack of basic reading comprehension at one point, but there were a few funny bits:</p><blockquote><p>I mean, first off, inquisitions and jihads are, ex vi termini, religious in nature. It’s like saying that people call both the World Series and the World Cup “sporting events”–they are.</p></blockquote><p>They may be religious in nature.  But that’s not the point.  The point is that if religion is responsible for their evils, then science is equally if not more responsible for other evils.</p><blockquote><p>As for the military attacks[on Hiroshima and Nagasaki]? Yes, science facilitated them, from gas attacks to the atom bomb. But it was not scientists who made the decision to fund the weapons, nor scientists who made the decision to use them.</p></blockquote><p>At least BotML is willing to admit that science facilitated them, that’s more than most cowardly science defenders can manage.  But in the Inquisition, the Church didn’t decide to kill anyone, it merely found the individual guilty of heresy.  In both the case of the Spanish Inquisition (the “deadly” one) and the dropping of the atomic bombs, it was the government involved that made the decision and executed it.</p><p>Therefore, either “religion” is not responsible for the deaths of the Spanish Inquisition or “science” is responsible for the deaths at Hiroshima and Nagasaki, in addition to many, many other science-facilitated deaths in war.</p><p>His particular wording here is interesting, as he carefully avoids stating something simpler.  For example, in defending the Church with regards to the Spanish Inquisition, I would have said that it was no the Church that set fire to anyone.  Of course, he can’t say that, because a scientist did indeed drop the bomb, given Navy Capt. William “Deak” Parsons, Manhattan Project Scientist, <a href=\"http://www.nasm.si.edu/exhibitions/gal103/EG_crew.html\">and his place on the crew of the Enola Gay</a>.</p><p>As for the iatrogenic deaths, I never wrote that they were “on the rise”, I merely wrote that they existed, so that was simply a weird and meaningless critique of nothing.  There are two competing statistics provided by Google, I note that BotML happened to skip over <a href=\"http://www.ourcivilisation.com/medicine/usamed.htm\">this one</a> in favor of <a href=\"http://en.wikipedia.org/wiki/Iatrogenesis\">this one</a>, perhaps because it would have confirmed the number cited in my column.  In any case, a more astute reader would have noted that the latter is a subset of the former.</p><p>The larger point, which clearly sailed right over BotML’s head, is that the case against science is stronger than the case against religion <em>when made on the basis of the New Atheist’s case against religion</em>.  BotML doesn’t even realize that his argument is not with me, but rather with the ludicrous and fallacious arguments presented by Richard Dawkins and Sam Harris.</p></div>",
  "content_text": "The Blog of Very Moderate Logic\nstruggles with what little it possesses\n.  Most of it is irrelevant “PZ says” blather, in fact, he even quotes PZ’s lack of basic reading comprehension at one point, but there were a few funny bits:\nI mean, first off, inquisitions and jihads are, ex vi termini, religious in nature. It’s like saying that people call both the World Series and the World Cup “sporting events”–they are.\nThey may be religious in nature.  But that’s not the point.  The point is that if religion is responsible for their evils, then science is equally if not more responsible for other evils.\nAs for the military attacks[on Hiroshima and Nagasaki]? Yes, science facilitated them, from gas attacks to the atom bomb. But it was not scientists who made the decision to fund the weapons, nor scientists who made the decision to use them.\nAt least BotML is willing to admit that science facilitated them, that’s more than most cowardly science defenders can manage.  But in the Inquisition, the Church didn’t decide to kill anyone, it merely found the individual guilty of heresy.  In both the case of the Spanish Inquisition (the “deadly” one) and the dropping of the atomic bombs, it was the government involved that made the decision and executed it.\nTherefore, either “religion” is not responsible for the deaths of the Spanish Inquisition or “science” is responsible for the deaths at Hiroshima and Nagasaki, in addition to many, many other science-facilitated deaths in war.\nHis particular wording here is interesting, as he carefully avoids stating something simpler.  For example, in defending the Church with regards to the Spanish Inquisition, I would have said that it was no the Church that set fire to anyone.  Of course, he can’t say that, because a scientist did indeed drop the bomb, given Navy Capt. William “Deak” Parsons, Manhattan Project Scientist,\nand his place on the crew of the Enola Gay\n.\nAs for the iatrogenic deaths, I never wrote that they were “on the rise”, I merely wrote that they existed, so that was simply a weird and meaningless critique of nothing.  There are two competing statistics provided by Google, I note that BotML happened to skip over\nthis one\nin favor of\nthis one\n, perhaps because it would have confirmed the number cited in my column.  In any case, a more astute reader would have noted that the latter is a subset of the former.\nThe larger point, which clearly sailed right over BotML’s head, is that the case against science is stronger than the case against religion\nwhen made on the basis of the New Atheist’s case against religion\n.  BotML doesn’t even realize that his argument is not with me, but rather with the ludicrous and fallacious arguments presented by Richard Dawkins and Sam Harris.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-03-09T08:41:00+00:00"
}