{
  "url": "https://voxday.net/2014/11/13/3gw-at-sea/",
  "scraped_at": "2025-12-16T12:34:42.972982",
  "title": "3GW at sea?",
  "date_display": "November 13, 2014",
  "date_iso": "2014-11-13T10:07:00+00:00",
  "date_from_url": "2014-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US military <a href=\"http://www.voltairenet.org/article185860.html\">may be beginning to learn</a> the hard way that high-tech warfare is powerful, but fragile:</p><blockquote class=\"tr_bq\"><p> On 10 April 2014, the USS Donald Cook entered the waters of the Black Sea and on 12 April a Russian <i>Su-24</i> tactical bomber flew over the vessel triggering an incident that,<br> according to several media reports, completely demoralized its crew, so<br> much so that the Pentagon issued a protest.</br></br></p><p>The <i>USS Donald Cook</i> (DDG-75) is a 4th generation guided missile destroyer whose key weapons are <i>Tomahawk</i> cruise missiles with a range of up to 2,500 kilometers, and capable of carrying nuclear explosives. This ship carries 56 <i>Tomahawk</i> missiles in standard mode, and 96 missiles in attack mode.</p><p>The US destroyer is equipped with the most recent <i>Aegis Combat System</i>.<br> It is an integrated naval weapons systems which can link together the<br> missile defense systems of all vessels embedded within the same network,<br> so as to ensure the detection, tracking and destruction of hundreds of<br> targets at the same time. In addition, the <i>USS Donald Cook</i> is<br> equipped with 4 large radars, whose power is comparable to that of<br> several stations. For protection, it carries more than fifty<br> anti-aircraft missiles of various types.</br></br></br></br></br></br></br></p><p>Meanwhile, the Russian <i>Su-24</i> that buzzed the <i>USS Donald Cook</i> carried neither bombs nor missiles but only a basket mounted under the fuselage, which, according to the Russian newspaper <i>Rossiyskaya Gazeta</i>, contained a Russian electronic warfare device called <i>Khibiny</i>.</p><p>As the Russian jet approached the US vessel, the electronic device<br> disabled all radars, control circuits, systems, information<br> transmission, etc. on board the US destroyer. In other words, the<br> all-powerful <i>Aegis</i> system, now hooked up – or about to be – with<br> the defense systems installed on NATO’s most modern ships was shut down,<br> as turning off the TV set with the remote control.</br></br></br></br></br></p><p>The Russian <i>Su-24</i> then simulated a missile attack against the <i>USS Donald Cook</i>,<br> which was left literally deaf and blind. As if carrying out a training<br> exercise, the Russian aircraft – unarmed – repeated the same maneuver 12<br> times before flying away.</br></br></br></p><p>After that, the 4th generation destroyer immediately set sail towards a port in Romania. Since that incident, which the Atlanticist media have carefully<br> covered up despite the widespread reactions sparked among defense<br> industry experts, no US ship has ever approached Russian territorial<br> waters again.  According to some specialized media, 27 sailors from the <i>USS Donald Cook</i> requested to be relieved from active service.</br></br></br></p></blockquote><p>This has been going around, but while the SU-24 is confirmed <a href=\"http://www.washingtonpost.com/politics/obama-and-putin-discuss-ukraine-crisis/2014/04/14/b96f85da-c404-11e3-bcec-b71ee10e9bc3_story.html\">to have successfully buzzed the destroyer</a>, some of the details <a href=\"http://www.stopfake.org/en/lies-the-crew-of-the-us-destroyer-ship-got-scared-by-the-russian-fighter-aircraft/\">are being disputed</a>.</p><blockquote class=\"tr_bq\"><p> In truth the Russian fighter did fly 12 times provocatively close to the US destroyer, and Col. Warren did report the incident to Reuters. However, this is where the truth ends.</p><p>In reality Warren told the following to the agency: “This provocative and unprofessional Russian action is inconsistent with international protocols and previous agreements on the professional interaction between our militaries.”</p><p>The plane appeared to be unarmed, according to Warren. The pilot did not respond to multiple queries from the Cook. Warren also added that another Russian fighter was also flying in the area, but not as close to the ship as the other one.</p><p>Warren said the vessel was not in any serious danger. The Pentagon website cited the Colonel’s words: “The Donald Cook is more than capable of defending herself against two SU-24s.</p></blockquote><p>I think that the only way we can know the truth is by observing if US Navy ships continue to enter the Black Sea or not. One thing American readers may not know is that Russian warplanes have tested NATO air defenses <a href=\"https://www.google.com/maps/d/viewer?mid=zuYQQjbk2yqY.keUJQxu7jKGY&amp;authuser=0\">more than 40 times</a> in the last nine months. So it’s far from implausible that they are sending a similar “back off” message to the US naval forces as well in light of the Obama administration’s foolish, if not downright insane, decision to interfere in Ukraine.</p><p>However, the specific details appear to be closer to a Tom Clancy novel than anything that happened in 2014. It’s much more likely that 27 pregnant sailors were quietly relieved from active duty than 27 sailors quit from sheer terror of Russian ECW capabilities.</p></div>",
  "content_text": "The US military\nmay be beginning to learn\nthe hard way that high-tech warfare is powerful, but fragile:\nOn 10 April 2014, the USS Donald Cook entered the waters of the Black Sea and on 12 April a Russian\nSu-24\ntactical bomber flew over the vessel triggering an incident that,\naccording to several media reports, completely demoralized its crew, so\nmuch so that the Pentagon issued a protest.\nThe\nUSS Donald Cook\n(DDG-75) is a 4th generation guided missile destroyer whose key weapons are\nTomahawk\ncruise missiles with a range of up to 2,500 kilometers, and capable of carrying nuclear explosives. This ship carries 56\nTomahawk\nmissiles in standard mode, and 96 missiles in attack mode.\nThe US destroyer is equipped with the most recent\nAegis Combat System\n.\nIt is an integrated naval weapons systems which can link together the\nmissile defense systems of all vessels embedded within the same network,\nso as to ensure the detection, tracking and destruction of hundreds of\ntargets at the same time. In addition, the\nUSS Donald Cook\nis\nequipped with 4 large radars, whose power is comparable to that of\nseveral stations. For protection, it carries more than fifty\nanti-aircraft missiles of various types.\nMeanwhile, the Russian\nSu-24\nthat buzzed the\nUSS Donald Cook\ncarried neither bombs nor missiles but only a basket mounted under the fuselage, which, according to the Russian newspaper\nRossiyskaya Gazeta\n, contained a Russian electronic warfare device called\nKhibiny\n.\nAs the Russian jet approached the US vessel, the electronic device\ndisabled all radars, control circuits, systems, information\ntransmission, etc. on board the US destroyer. In other words, the\nall-powerful\nAegis\nsystem, now hooked up – or about to be – with\nthe defense systems installed on NATO’s most modern ships was shut down,\nas turning off the TV set with the remote control.\nThe Russian\nSu-24\nthen simulated a missile attack against the\nUSS Donald Cook\n,\nwhich was left literally deaf and blind. As if carrying out a training\nexercise, the Russian aircraft – unarmed – repeated the same maneuver 12\ntimes before flying away.\nAfter that, the 4th generation destroyer immediately set sail towards a port in Romania. Since that incident, which the Atlanticist media have carefully\ncovered up despite the widespread reactions sparked among defense\nindustry experts, no US ship has ever approached Russian territorial\nwaters again.  According to some specialized media, 27 sailors from the\nUSS Donald Cook\nrequested to be relieved from active service.\nThis has been going around, but while the SU-24 is confirmed\nto have successfully buzzed the destroyer\n, some of the details\nare being disputed\n.\nIn truth the Russian fighter did fly 12 times provocatively close to the US destroyer, and Col. Warren did report the incident to Reuters. However, this is where the truth ends.\nIn reality Warren told the following to the agency: “This provocative and unprofessional Russian action is inconsistent with international protocols and previous agreements on the professional interaction between our militaries.”\nThe plane appeared to be unarmed, according to Warren. The pilot did not respond to multiple queries from the Cook. Warren also added that another Russian fighter was also flying in the area, but not as close to the ship as the other one.\nWarren said the vessel was not in any serious danger. The Pentagon website cited the Colonel’s words: “The Donald Cook is more than capable of defending herself against two SU-24s.\nI think that the only way we can know the truth is by observing if US Navy ships continue to enter the Black Sea or not. One thing American readers may not know is that Russian warplanes have tested NATO air defenses\nmore than 40 times\nin the last nine months. So it’s far from implausible that they are sending a similar “back off” message to the US naval forces as well in light of the Obama administration’s foolish, if not downright insane, decision to interfere in Ukraine.\nHowever, the specific details appear to be closer to a Tom Clancy novel than anything that happened in 2014. It’s much more likely that 27 pregnant sailors were quietly relieved from active duty than 27 sailors quit from sheer terror of Russian ECW capabilities.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-13T10:07:00+00:00"
}