{
  "url": "https://voxday.net/2014/11/02/50000-readers-day/",
  "scraped_at": "2025-12-16T12:33:31.150052",
  "title": "50,000 readers a day",
  "date_display": "November 2, 2014",
  "date_iso": "2014-11-02T21:00:00+00:00",
  "date_from_url": "2014-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the 2012 <a href=\"http://www.nytimes.com/2012/07/07/books/in-redshirts-john-scalzi-gives-expendables-a-life.html\">New York Times</a>:</p><blockquote class=\"tr_bq\"><p> Handily demolishing the burger that he had chosen over a Midtown restaurant’s fancier Mediterranean fare, Mr. Scalzi was anything but grim; he smiled readily and giggled heartily. He is comfortable with the business of promotion: An affable speaker, he is familiar with the patois of fandom and is adept at generating buzz through the nerd mafia of like-minded collaborators. He already reaches up to 50,000 readers a day through his popular blog, “Whatever.”</p></blockquote><p>So with the end of October, the three-month daily traffic average, in direct apples-to-apples terms of WordPress pageviews, has now reached 50,504. In other words, for the last three months, I’ve been genuinely averaging the sort of traffic that McRapey used to lie about having. The fact is that in July 2012, Whatever averaged 21,102 pageviews per day, up from 16,356 the month before.</p><p>As it happens, I could claim “up to 65,000 readers a day” on the same basis, but I don’t, because that would be ludicrously untruthful. First, pageviews are not readers. Second, there is no reasonable justification for using an extreme outlier when an accurate average is available. It is knowingly deceptive, even if it is common in “the busines of promotion”.</p><p>SJWs <i>always lie</i>. Never forget that. Never take anything they say about anyone, especially themselves, for granted. They deceive, exaggerate, and spin. They will say anything they think will make themselves look better and make their rivals and enemies look worse. They are the sort of people who habitually pretend “everybody thinks” is synonymous with “I think” and try to influence others through nonexistent peer pressure. They repeatedly appeal to nonexistent consensuses. Even when they tell the literal truth, it is usually presented in a manner intended to deceive in some way.</p><p>But they are very comfortable with the business of promotion. It’s not hard to be, when you are equally comfortable with saying things that are misleading, deceptive, and outright false. So always – always – run their numbers.</p><p>The truth is that Whatever has actually reached over <i>100,000</i> pageviews in a single day thanks to some helpful external links on three or four occasions, but McRapey did not dare tell the New York Times “up to 100,000 pageviews per day” even though he could have truthfully done so because it would have sounded ridiculous considering his actual daily traffic. But he thought, correctly, that he could get away with the misleading “up to 50,000” claim. It’s worth noting that within five months, he dropped the true, but deceptive “up to” part of the claim and was directly lying about his traffic again. Just as <a href=\"http://www.milobookclub.com/2014/08/19/fraud-and-douchebaggery/\">he had previously done in 2010</a>, when he was interviewed by Lightspeed. <i> </i></p><p><i>“Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”   </i></p><p>Two million monthly? That’s a claim of more than 64,516 average daily pageviews… and at a time when he was actually seeing 12,860 per day.</p></div>",
  "content_text": "From the 2012\nNew York Times\n:\nHandily demolishing the burger that he had chosen over a Midtown restaurant’s fancier Mediterranean fare, Mr. Scalzi was anything but grim; he smiled readily and giggled heartily. He is comfortable with the business of promotion: An affable speaker, he is familiar with the patois of fandom and is adept at generating buzz through the nerd mafia of like-minded collaborators. He already reaches up to 50,000 readers a day through his popular blog, “Whatever.”\nSo with the end of October, the three-month daily traffic average, in direct apples-to-apples terms of WordPress pageviews, has now reached 50,504. In other words, for the last three months, I’ve been genuinely averaging the sort of traffic that McRapey used to lie about having. The fact is that in July 2012, Whatever averaged 21,102 pageviews per day, up from 16,356 the month before.\nAs it happens, I could claim “up to 65,000 readers a day” on the same basis, but I don’t, because that would be ludicrously untruthful. First, pageviews are not readers. Second, there is no reasonable justification for using an extreme outlier when an accurate average is available. It is knowingly deceptive, even if it is common in “the busines of promotion”.\nSJWs\nalways lie\n. Never forget that. Never take anything they say about anyone, especially themselves, for granted. They deceive, exaggerate, and spin. They will say anything they think will make themselves look better and make their rivals and enemies look worse. They are the sort of people who habitually pretend “everybody thinks” is synonymous with “I think” and try to influence others through nonexistent peer pressure. They repeatedly appeal to nonexistent consensuses. Even when they tell the literal truth, it is usually presented in a manner intended to deceive in some way.\nBut they are very comfortable with the business of promotion. It’s not hard to be, when you are equally comfortable with saying things that are misleading, deceptive, and outright false. So always – always – run their numbers.\nThe truth is that Whatever has actually reached over\n100,000\npageviews in a single day thanks to some helpful external links on three or four occasions, but McRapey did not dare tell the New York Times “up to 100,000 pageviews per day” even though he could have truthfully done so because it would have sounded ridiculous considering his actual daily traffic. But he thought, correctly, that he could get away with the misleading “up to 50,000” claim. It’s worth noting that within five months, he dropped the true, but deceptive “up to” part of the claim and was directly lying about his traffic again. Just as\nhe had previously done in 2010\n, when he was interviewed by Lightspeed.\n“Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”\nTwo million monthly? That’s a claim of more than 64,516 average daily pageviews… and at a time when he was actually seeing 12,860 per day.",
  "tags": [
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-02T21:00:00+00:00"
}