{
  "url": "https://voxday.net/2014/11/04/8-women-accuse-jian-ghomeshi/",
  "scraped_at": "2025-12-16T12:33:39.227252",
  "title": "8 women accuse Jian Ghomeshi",
  "date_display": "November 4, 2014",
  "date_iso": "2014-11-04T08:34:00+00:00",
  "date_from_url": "2014-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>More women come forward <a href=\"http://www.thestar.com/news/gta/2014/10/29/jian_ghomeshi_8_women_accuse_former_cbc_host_of_violence_sexual_abuse_or_harassment.html\">to accuse CBC radio host Jian Gomeshi</a> of violence, sexual abuse, and harassment:</p><blockquote class=\"tr_bq\"><div class=\"text combinedtext parbase section\"> Eight women from across Canada now accuse former CBC host Jian<br> Ghomeshi of abusive behaviour ranging from allegations of beating and<br> choking without consent, to workplace sexual harassment. The allegations the Star is probing range from 2002 to the present. One of the women, popular Canadian television actor Lucy DeCoutere, has agreed to be identified. DeCoutere, who plays Lucy on<br> <i><br> Trailer Park Boys<br> </br></br></i><br> , recalls an incident in 2003 when she alleges Ghomeshi, without<br> warning or consent, choked her to the point she could not breathe and<br> then slapped her hard three times on the side of her head.</br></br></br></br></br></br></div></blockquote><p>Make it nine now. In the meantime, this is what McRapey, who voluntarily appeared on Gomeshi’s show last year and while on it claimed to have fairly characterized me as a “sexist” and “misogynist”, among other things, had to say about the man <a href=\"http://www.voxday.net/tox/GrooveKittens.mp3\">with whom he was so chummy</a> on the show:</p><blockquote class=\"tr_bq\"><p> Some thoughts on Jian Ghomeshi, about whom I feel entitled to opine because I was once a guest on his show — talking about the little fundraising thing I did last year which included RAINN, an interview which now in retrospect is sadly ironic….</p><p>I think it’s possible that Mr. Ghomeshi deluded himself into thinking<br> these attacks equated to consensual sexual play, which is both not an<br> excuse at all, and a good argument for availing one’s self of educators<br> in that particular field who can teach one how to do one’s play safely<br> and to know what “consensual” actually means. However, I think it’s<br> rather more likely that Mr. Ghomeshi, who is a full-fledged adult and<br> someone with some evident facility for words, was in fact quite aware<br> that what he was doing was not in the least consensual and relied on his<br> position at the top of the Canadian cultural heap to protect him from<br> the consequences of his actions, as indeed it appears to have done for a<br> very long time….</br></br></br></br></br></br></br></br></br></br></p><p>I don’t know Mr. Ghomeshi other than through a very brief professional encounter. I don’t envy the people who <i>do</i><br> know him who are now learning about the allegations and who suspect<br> that they are true. What do you do with a friend like that? Do you<br> drop him? Do you maintain he is your friend but acknowledge what he’s<br> done is wrong? Do you fight for your friend, right or wrong? <a href=\"https://www.facebook.com/owenpalletteternal/posts/1491910081073780?fref=nf\">One of Mr. Ghomeshi’s friends addressed this in a post of his own</a>,<br> which is worth reading. I don’t have any answers for this one. I know<br> what I think I would want to do; I don’t know if it’s what I <i>would</i> do because I’ve never had to be in this situation. What I can say is that I hope I never am in this situation.</br></br></br></br></br></br></p></blockquote><p>McRapey is careful to say that he believes the women – of course he does – and that Gomeshi merits punishment if he is proven guilty and so forth. Which is all well and fine. But isn’t it fascinating that he still attempts to excuse Gomeshi as one who possibly “deluded himself”? And it is also informative to observe that even after NINE public accusations by women who claim to have been physically attacked by him, McRapey STILL hasn’t accused Gomeshi of being sexist or a misogynist, accusations he has flung at me many times over the years despite the fact that in all that time, no woman has ever come forward to claim that I have abused her, harassed her, or harmed her in any way (outside the dojo, anyway). Nor is there anyone to come forward, because I simply don’t harm, harass, or abuse women.</p><p>And so we see that to the pinkshirts, words are primarily seen as weapons meant to be utilized against the ideological foe. They are not actually viewed as literal descriptors in the way that normal people see them to be.</p><p>Pinkshirt thinking is so twisted and corrupt that they consider the nonexistent actions that could potentially be derived from an idea held by an individual they deem to be evil worse than the actual actions of the individual deemed to be on their side.</p><div class=\"text combinedtext parbase section\"></div></div>",
  "content_text": "More women come forward\nto accuse CBC radio host Jian Gomeshi\nof violence, sexual abuse, and harassment:\nEight women from across Canada now accuse former CBC host Jian\nGhomeshi of abusive behaviour ranging from allegations of beating and\nchoking without consent, to workplace sexual harassment. The allegations the Star is probing range from 2002 to the present. One of the women, popular Canadian television actor Lucy DeCoutere, has agreed to be identified. DeCoutere, who plays Lucy on\nTrailer Park Boys\n, recalls an incident in 2003 when she alleges Ghomeshi, without\nwarning or consent, choked her to the point she could not breathe and\nthen slapped her hard three times on the side of her head.\nMake it nine now. In the meantime, this is what McRapey, who voluntarily appeared on Gomeshi’s show last year and while on it claimed to have fairly characterized me as a “sexist” and “misogynist”, among other things, had to say about the man\nwith whom he was so chummy\non the show:\nSome thoughts on Jian Ghomeshi, about whom I feel entitled to opine because I was once a guest on his show — talking about the little fundraising thing I did last year which included RAINN, an interview which now in retrospect is sadly ironic….\nI think it’s possible that Mr. Ghomeshi deluded himself into thinking\nthese attacks equated to consensual sexual play, which is both not an\nexcuse at all, and a good argument for availing one’s self of educators\nin that particular field who can teach one how to do one’s play safely\nand to know what “consensual” actually means. However, I think it’s\nrather more likely that Mr. Ghomeshi, who is a full-fledged adult and\nsomeone with some evident facility for words, was in fact quite aware\nthat what he was doing was not in the least consensual and relied on his\nposition at the top of the Canadian cultural heap to protect him from\nthe consequences of his actions, as indeed it appears to have done for a\nvery long time….\nI don’t know Mr. Ghomeshi other than through a very brief professional encounter. I don’t envy the people who\ndo\nknow him who are now learning about the allegations and who suspect\nthat they are true. What do you do with a friend like that? Do you\ndrop him? Do you maintain he is your friend but acknowledge what he’s\ndone is wrong? Do you fight for your friend, right or wrong?\nOne of Mr. Ghomeshi’s friends addressed this in a post of his own\n,\nwhich is worth reading. I don’t have any answers for this one. I know\nwhat I think I would want to do; I don’t know if it’s what I\nwould\ndo because I’ve never had to be in this situation. What I can say is that I hope I never am in this situation.\nMcRapey is careful to say that he believes the women – of course he does – and that Gomeshi merits punishment if he is proven guilty and so forth. Which is all well and fine. But isn’t it fascinating that he still attempts to excuse Gomeshi as one who possibly “deluded himself”? And it is also informative to observe that even after NINE public accusations by women who claim to have been physically attacked by him, McRapey STILL hasn’t accused Gomeshi of being sexist or a misogynist, accusations he has flung at me many times over the years despite the fact that in all that time, no woman has ever come forward to claim that I have abused her, harassed her, or harmed her in any way (outside the dojo, anyway). Nor is there anyone to come forward, because I simply don’t harm, harass, or abuse women.\nAnd so we see that to the pinkshirts, words are primarily seen as weapons meant to be utilized against the ideological foe. They are not actually viewed as literal descriptors in the way that normal people see them to be.\nPinkshirt thinking is so twisted and corrupt that they consider the nonexistent actions that could potentially be derived from an idea held by an individual they deem to be evil worse than the actual actions of the individual deemed to be on their side.",
  "tags": [
    "McRapey",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-04T08:34:00+00:00"
}