{
  "url": "https://voxday.net/2014/11/04/a-game-developer-on-gamergate/",
  "scraped_at": "2025-12-16T12:33:43.677266",
  "title": "A game developer on #GamerGate",
  "date_display": "November 4, 2014",
  "date_iso": "2014-11-04T21:00:00+00:00",
  "date_from_url": "2014-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Earlier this month, The Escapist featured <a href=\"http://www.escapistmagazine.com/articles/view/video-games/gamergate-interviews/12400-Daniel-Vavra-GamerGate-Interview\">a very good interview </a>with developer Daniel Vavra concerning #GamerGate. Vavra is a co-founder of Warhorse Studios:</p><blockquote class=\"tr_bq\"><p> <b>What is your definition of “gamer”?</b></p><p>According Encyclopedia Britannica it’s “a person who regularly plays<br> games and especially video or computer games.” I am ok with that. But<br> while I am not saying that match-three games are bad, playing them over<br> breakfast doesn’t make anyone a gamer. It’s silly that the same<br> journalists who insist on calling people playing such casual games<br> ‘gamers’ are not reviewing those games in their gaming magazines. The<br> line between a “true” game and “casual” game is thin, but I guess that<br> everyone can see the difference between somebody who owns several<br> consoles and plays very often and somebody who plays <i>Bejeweled</i> on his way to work. Those people aren’t the same and the games for them are produced by different industries.</br></br></br></br></br></br></br></br></p><p><b>What is the root cause of GamerGate? Do you see it as part of a larger “culture war”? </b></p><p>Over the last decade, media were taken over by people who think that<br> their ideals, opinions and way of life are superior to others and so<br> they have the mission to tell others how to live, what to think and what<br> to do. Those people have learned that there is a very easy way of<br> manipulating others with guilt and fake goodwill. They will tell you<br> that you should be ashamed, because you are privileged. You are white,<br> you are healthy, you are rich and it’s your fault that there are others<br> who are not as lucky as you. So you must redeem those crimes by doing<br> what those social justice warriors think will please those who are not<br> privileged enough. And if you don’t, they will jump on you and give you a<br> hard time…. And that is the root cause<br> of Gamer Gate. People had enough of those hypocrites that started to<br> inject their ideology everywhere while they do exactly the opposite of<br> what they preach to others.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Read the whole thing. The total contempt he feels for the SJWs attempting to stick the camel’s nose into the game dev tent is palpable, and he is very, very far from alone in the game industry. The key phrase is: “the games for them are produced by different industries”.</p><p>For some reason, none of the SJWs are concerned that there aren’t enough men playing Kim Kardashian Hollywood. Why are there no articles demanding that the developers of Kim Kardashian Hollywood add elements to the game that will make it more appealing for white male players? We all know that these demands for “inclusivity” in the hardcore market are nothing more than another SJW entryist attack.</p></div>",
  "content_text": "Earlier this month, The Escapist featured\na very good interview\nwith developer Daniel Vavra concerning #GamerGate. Vavra is a co-founder of Warhorse Studios:\nWhat is your definition of “gamer”?\nAccording Encyclopedia Britannica it’s “a person who regularly plays\ngames and especially video or computer games.” I am ok with that. But\nwhile I am not saying that match-three games are bad, playing them over\nbreakfast doesn’t make anyone a gamer. It’s silly that the same\njournalists who insist on calling people playing such casual games\n‘gamers’ are not reviewing those games in their gaming magazines. The\nline between a “true” game and “casual” game is thin, but I guess that\neveryone can see the difference between somebody who owns several\nconsoles and plays very often and somebody who plays\nBejeweled\non his way to work. Those people aren’t the same and the games for them are produced by different industries.\nWhat is the root cause of GamerGate? Do you see it as part of a larger “culture war”?\nOver the last decade, media were taken over by people who think that\ntheir ideals, opinions and way of life are superior to others and so\nthey have the mission to tell others how to live, what to think and what\nto do. Those people have learned that there is a very easy way of\nmanipulating others with guilt and fake goodwill. They will tell you\nthat you should be ashamed, because you are privileged. You are white,\nyou are healthy, you are rich and it’s your fault that there are others\nwho are not as lucky as you. So you must redeem those crimes by doing\nwhat those social justice warriors think will please those who are not\nprivileged enough. And if you don’t, they will jump on you and give you a\nhard time…. And that is the root cause\nof Gamer Gate. People had enough of those hypocrites that started to\ninject their ideology everywhere while they do exactly the opposite of\nwhat they preach to others.\nRead the whole thing. The total contempt he feels for the SJWs attempting to stick the camel’s nose into the game dev tent is palpable, and he is very, very far from alone in the game industry. The key phrase is: “the games for them are produced by different industries”.\nFor some reason, none of the SJWs are concerned that there aren’t enough men playing Kim Kardashian Hollywood. Why are there no articles demanding that the developers of Kim Kardashian Hollywood add elements to the game that will make it more appealing for white male players? We all know that these demands for “inclusivity” in the hardcore market are nothing more than another SJW entryist attack.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-04T21:00:00+00:00"
}