{
  "url": "https://voxday.net/2014/11/19/a-refusal-to-learn/",
  "scraped_at": "2025-12-16T12:35:23.752230",
  "title": "A refusal to learn",
  "date_display": "November 19, 2014",
  "date_iso": "2014-11-19T09:42:00+00:00",
  "date_from_url": "2014-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We have learned nothing from history and so <a href=\"http://www.zerohedge.com/news/2014-11-18/crisis-was-foreseeable-%E2%80%A6-thousands-years-ago\">we are bound to repeat it</a>:</p><blockquote class=\"tr_bq\"><p> We’ve known for 5,000 years that mass spying on one’s own people is always aimed at grabbing power and crushing dissent, not protecting us from bad guys.</p><p>We’ve known for 4,000 years that debts need to be periodically written down, or the entire economy will collapse. And see this.</p><p>We’ve known for 2,500 years that prolonged war bankrupts an economy.</p><p>We’ve known for 2,000 years that wars are based on lies.</p><p>We’ve known for 1,900 years that runaway inequality destroys societies.</p><p>We’ve known for thousands of years that debasing currencies leads to economic collapse.</p><p>We’ve known for millennia that torture is a form of terrorism.</p><p>We’ve known for thousands of years that – when criminals are not punished – crime spreads.</p><p>We’ve known for hundreds of years that the failure to punish financial fraud destroys economies, as it destroys all trust in the financial system.</p><p>We’ve known for centuries that monopolies and the political influence which accompanies too much power in too few hands are dangerous for free markets.</p><p>We’ve known for hundreds of years that companies will try to pawn their debts off on governments, and that it is a huge mistake for governments to allow corporate debt to be backstopped by government.</p><p>We’ve known for centuries that powerful people – unless held to account – will get together and steal from everyone else.</p></blockquote><p>It’s not different this time. There will be ethnic cleansing and probably several incidents of mass slaughter, although whether it will be the immigrants or the native people on the short end is yet to be determined.</p><p>There will be series of economic crashes and the ongoing depression will deepen and widen, because the incipient credit busts in 1987 and 2001 and 2008 were all papered over with more central bank “money” created ex nihilo.</p><p>There will be wars, both due to the great clash of civilizations and pro-globalist elites clinging to government power in the face of furiously nationalistic people denied their will through the limitations and legalistic perversions of representative democracy.</p><p>These things are all inevitable. Not likely, inevitable. There is no force on Earth that can stop them, because in our arrogance and foolishness, we have again decided <i>this time it’s different</i>. But it’s not. It never is. And if you’re still a Republican defending income inequality because communism or a Democrat defending big government because poor people or a Libertarian defending open borders and free trade because individual, your entire political perspective is outdated and irrelevant. That world doesn’t exist anymore.</p></div>",
  "content_text": "We have learned nothing from history and so\nwe are bound to repeat it\n:\nWe’ve known for 5,000 years that mass spying on one’s own people is always aimed at grabbing power and crushing dissent, not protecting us from bad guys.\nWe’ve known for 4,000 years that debts need to be periodically written down, or the entire economy will collapse. And see this.\nWe’ve known for 2,500 years that prolonged war bankrupts an economy.\nWe’ve known for 2,000 years that wars are based on lies.\nWe’ve known for 1,900 years that runaway inequality destroys societies.\nWe’ve known for thousands of years that debasing currencies leads to economic collapse.\nWe’ve known for millennia that torture is a form of terrorism.\nWe’ve known for thousands of years that – when criminals are not punished – crime spreads.\nWe’ve known for hundreds of years that the failure to punish financial fraud destroys economies, as it destroys all trust in the financial system.\nWe’ve known for centuries that monopolies and the political influence which accompanies too much power in too few hands are dangerous for free markets.\nWe’ve known for hundreds of years that companies will try to pawn their debts off on governments, and that it is a huge mistake for governments to allow corporate debt to be backstopped by government.\nWe’ve known for centuries that powerful people – unless held to account – will get together and steal from everyone else.\nIt’s not different this time. There will be ethnic cleansing and probably several incidents of mass slaughter, although whether it will be the immigrants or the native people on the short end is yet to be determined.\nThere will be series of economic crashes and the ongoing depression will deepen and widen, because the incipient credit busts in 1987 and 2001 and 2008 were all papered over with more central bank “money” created ex nihilo.\nThere will be wars, both due to the great clash of civilizations and pro-globalist elites clinging to government power in the face of furiously nationalistic people denied their will through the limitations and legalistic perversions of representative democracy.\nThese things are all inevitable. Not likely, inevitable. There is no force on Earth that can stop them, because in our arrogance and foolishness, we have again decided\nthis time it’s different\n. But it’s not. It never is. And if you’re still a Republican defending income inequality because communism or a Democrat defending big government because poor people or a Libertarian defending open borders and free trade because individual, your entire political perspective is outdated and irrelevant. That world doesn’t exist anymore.",
  "tags": [
    "corpocracy",
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-19T09:42:00+00:00"
}