{
  "url": "https://voxday.net/2014/11/09/a-soldiers-review-of-on-war/",
  "scraped_at": "2025-12-16T12:34:16.221937",
  "title": "A soldier’s review of ON WAR",
  "date_display": "November 9, 2014",
  "date_iso": "2014-11-09T12:25:00+00:00",
  "date_from_url": "2014-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derek Thornton, a 20-year veteran of the Mississippi National Guard, <a href=\"http://derekthornton71.blogspot.ch/2014/11/review-of-on-war-collected-columns-of.html\">reviews William S. Lind’s <i><b>ON WAR</b></i></a>:</p><blockquote class=\"tr_bq\"><p> Having<br> been deployed to Iraq twice, I naturally retain much interest in<br> events in the Middle East, especially Iraq. Before my first<br> deployment, I was a true believer in “nation building”, the<br> ascendancy of democracy and the superiority of the U.S. military.<br> Such is no longer the case. By my second deployment, the first two<br> were at the back of any priority list and I concentrated on training<br> my fellow soldiers so that we could all just come back alive. I still<br> thought the U.S. military was the best, but had niggling doubts due<br> to our inability to truly defeat our foe. With recent events and ISIS<br> rolling over the sham of a nation we left behind in Iraq and the<br> constant destabilization of states in the region by our own<br> governments backing, I was coming to a lot of conclusions. This book<br> showed me that those conclusions had already been reached long before<br> they started crystallizing in my mind….</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p> I<br> cannot stress [enough] the importance of reading this book. We continue to<br> repeat the mistakes of the past again and again. We need a new way<br> forward to meet the coming challenges.</br></br></br></p></blockquote><p>I think it is very important to observe that while the politicians and the military-industrial complex may be dubious about the 4GW framework (about which more later today), the soldiers and Marines who have been deployed and possess actual combat experience tend to intuitively grasp its relevance. For those who are particularly interested in gaining a more complete understanding of 4GW and its implication for the 21st century, you may wish to obtain a copy of the lecture that started it all in 1988, prior to the famous article that was simultaneously published in the <i>Marine Corps Gazette</i> and <i>Military Review</i>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.castaliahouse.com/downloads/the-four-generations-of-modern-war/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/11/FourGenerationsofModernWarAudioCover512.jpg\" width=\"320\"/></a></div><p>Fortunately, then-Major Greg Thiele, USMC, had the foresight to video a subsequent repeat of that first lecture, called <a href=\"http://www.castaliahouse.com/downloads/the-four-generations-of-modern-war/\"><b><i>The Four Generations of Modern War</i></b></a>, given extemporaneously at Quantico to a group of USMC officers, which he graciously sent me a few weeks ago. I transcribed the lecture, edited it to correct a minor historical infelicity or two – it was indeed General Weygand, and not Gamelin, with whom Churchill was meeting in June 1940 – and we are now making the combined audio/ebook available exclusively from the Castalia House store for $3.99.<i><b> </b></i>This, and other forthcoming audiobooks will not be available on Audible for the time being because we intend to keep our audiobook prices considerably lower than Audible insists on charging.</p><p>However, please keep in mind two things. First, the audio quality is not what you’d get in a studio. Thanks to Vidad cleaning it up, you will have no problem understanding any of it, but it is a live speech and not a studio-recorded narration. Second, if you are a newsletter subscriber, you will have the opportunity to obtain it free in the future as part of our New Release program, so you may want to keep that in mind.</p></div>",
  "content_text": "Derek Thornton, a 20-year veteran of the Mississippi National Guard,\nreviews William S. Lind’s\nON WAR\n:\nHaving\nbeen deployed to Iraq twice, I naturally retain much interest in\nevents in the Middle East, especially Iraq. Before my first\ndeployment, I was a true believer in “nation building”, the\nascendancy of democracy and the superiority of the U.S. military.\nSuch is no longer the case. By my second deployment, the first two\nwere at the back of any priority list and I concentrated on training\nmy fellow soldiers so that we could all just come back alive. I still\nthought the U.S. military was the best, but had niggling doubts due\nto our inability to truly defeat our foe. With recent events and ISIS\nrolling over the sham of a nation we left behind in Iraq and the\nconstant destabilization of states in the region by our own\ngovernments backing, I was coming to a lot of conclusions. This book\nshowed me that those conclusions had already been reached long before\nthey started crystallizing in my mind….\nI\ncannot stress [enough] the importance of reading this book. We continue to\nrepeat the mistakes of the past again and again. We need a new way\nforward to meet the coming challenges.\nI think it is very important to observe that while the politicians and the military-industrial complex may be dubious about the 4GW framework (about which more later today), the soldiers and Marines who have been deployed and possess actual combat experience tend to intuitively grasp its relevance. For those who are particularly interested in gaining a more complete understanding of 4GW and its implication for the 21st century, you may wish to obtain a copy of the lecture that started it all in 1988, prior to the famous article that was simultaneously published in the\nMarine Corps Gazette\nand\nMilitary Review\n.\nFortunately, then-Major Greg Thiele, USMC, had the foresight to video a subsequent repeat of that first lecture, called\nThe Four Generations of Modern War\n, given extemporaneously at Quantico to a group of USMC officers, which he graciously sent me a few weeks ago. I transcribed the lecture, edited it to correct a minor historical infelicity or two – it was indeed General Weygand, and not Gamelin, with whom Churchill was meeting in June 1940 – and we are now making the combined audio/ebook available exclusively from the Castalia House store for $3.99.\nThis, and other forthcoming audiobooks will not be available on Audible for the time being because we intend to keep our audiobook prices considerably lower than Audible insists on charging.\nHowever, please keep in mind two things. First, the audio quality is not what you’d get in a studio. Thanks to Vidad cleaning it up, you will have no problem understanding any of it, but it is a live speech and not a studio-recorded narration. Second, if you are a newsletter subscriber, you will have the opportunity to obtain it free in the future as part of our New Release program, so you may want to keep that in mind.",
  "tags": [
    "Book Review",
    "Castalia House",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-09T12:25:00+00:00"
}