{
  "url": "https://voxday.net/2014/11/04/election-day/",
  "scraped_at": "2025-12-16T12:33:40.685531",
  "title": "Election Day",
  "date_display": "November 4, 2014",
  "date_iso": "2014-11-04T13:00:00+00:00",
  "date_from_url": "2014-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I trust by now that anyone reading this blog has been sufficiently disabused of the notion that freedom has any causal relationship with voting. As the New York Times made clear today to even the slowest midwits, voting is not, and has never been, a Constitutional or human right. Women, like men, can be denied the <i>privilege</i>, it merely cannot be denied by “by the United States or by any State” on the sole basis of sex.</p><p>The 19th Amendment states “The right of citizens of the United States to vote shall not be denied<br> or abridged by the United States or by any State on account of sex.”</br></p><p>Which raises the question, what right of the citizens of the United States to vote? It is not numbered amongst the unalienable rights listed by Thomas Jefferson in the Declaration of Independence. It does not appear in the Bill of Rights. The Constitution “left the boundaries of suffrage undefined” and the only directly elected body specified was the House of Representatives, for which “voter qualifications were explicitly delegated to the individual states.”</p><p>In any event, as millions of voters exercise their privilege across the USA today, it is very, very unlikely that the replacement of a Democratic majority in the Senate with a Republican one, and the strengthening of the Republican majority in the House is going to signify much in the grand scheme of things. The federal government will continue its deficit spending, the banks will continue to loan out credit money they create ex nihilo, Wall Street will continue to dictate policy to Washington, the U.S. military will continue to intervene in the affairs of sovereign nations around the world, and the flow of diverse and semicivilized immigrants will continue unabated.</p><p>So enjoy the show, but understand it is merely rote and ritual, a piece of kabuki theater to which we all know the steps and the lines.</p><p><a href=\"http://en.wikipedia.org/wiki/Nineteenth_Amendment_to_the_United_States_Constitution#cite_note-1\"></a></p></div>",
  "content_text": "I trust by now that anyone reading this blog has been sufficiently disabused of the notion that freedom has any causal relationship with voting. As the New York Times made clear today to even the slowest midwits, voting is not, and has never been, a Constitutional or human right. Women, like men, can be denied the\nprivilege\n, it merely cannot be denied by “by the United States or by any State” on the sole basis of sex.\nThe 19th Amendment states “The right of citizens of the United States to vote shall not be denied\nor abridged by the United States or by any State on account of sex.”\nWhich raises the question, what right of the citizens of the United States to vote? It is not numbered amongst the unalienable rights listed by Thomas Jefferson in the Declaration of Independence. It does not appear in the Bill of Rights. The Constitution “left the boundaries of suffrage undefined” and the only directly elected body specified was the House of Representatives, for which “voter qualifications were explicitly delegated to the individual states.”\nIn any event, as millions of voters exercise their privilege across the USA today, it is very, very unlikely that the replacement of a Democratic majority in the Senate with a Republican one, and the strengthening of the Republican majority in the House is going to signify much in the grand scheme of things. The federal government will continue its deficit spending, the banks will continue to loan out credit money they create ex nihilo, Wall Street will continue to dictate policy to Washington, the U.S. military will continue to intervene in the affairs of sovereign nations around the world, and the flow of diverse and semicivilized immigrants will continue unabated.\nSo enjoy the show, but understand it is merely rote and ritual, a piece of kabuki theater to which we all know the steps and the lines.",
  "tags": [
    "decline and fall",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-04T13:00:00+00:00"
}