{
  "url": "https://voxday.net/2014/11/04/gamergate-is-doomed-again/",
  "scraped_at": "2025-12-16T12:33:42.199645",
  "title": "#GamerGate is doomed… again",
  "date_display": "November 4, 2014",
  "date_iso": "2014-11-04T17:00:00+00:00",
  "date_from_url": "2014-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may or may not be genuine, but it is supposed to be a note from Gawker Media’s Nick Denton. [UPDATE: despite the overly dramatic language, <a href=\"https://twitter.com/Reyeko_/status/529843486611505152/photo/1\">it is confirmed to be real</a>.] I’m a little skeptical, but it is in line with SJW entryist tactics as well as some of the recent attempts at “tone-policing” we’ve seen – and ignored – within #GamerGate. And then there is this:</p><p>8chan.co @infinitechan<br> <i>#GamerGate has no leaders, so you don’t have to trust me. I don’t confirm things lightly: what @Kingofpol has is 100% true.</i></br></p><p>In any event, this was <strike>supposedly </strike>leaked directly from a source at Gawker:</p><blockquote class=\"tr_bq\"><p> First and foremost I would like to say “Thank You!” to myself and for those who are more than willing to accept a bit of ﬁnancial compensation in exchange for causing a disruption. I couldn’t have done it without you and I appreciate all your hard work.</p><p>For those of you that might be quite puzzled at the moment I will clarify. As you may have noticed over the last couple months. there has been a<br> group of individuals eager to ruin my business endeavors at every turn for the sake of “ethics”. I would go as far as to use their preferred banner name. but aﬂer the work of my new colleagues. I don’t see it continuing on much longer. Yes. the circus will ﬁnally be leaving town and business will continue as usual.</br></p><p>Over the past few weeks I had tasked my employees for ﬁnding a means to destroy that which has been rather resilient. You cannot simply “attack” their leader when they have none. nor could you shun the group as a whole without them using their rainbow coalition to mitigate any claims. Fortunately for myself. I ﬁgured it out. I found a way to, as they would put it, “Kill the Batman”.</p><p>It was there all along and oh so very simple. inﬁltrate the group and kill<br> them from the inside. The media parade that has been going on for weeks<br> now hasn’t done anything worth a damn. Time and effort thrown out the<br> window with needless articles over this shit show. None of it has made a damn bit of difference until now. Everyone is eager to throw themselves at mainstream outlets. but none of them are eager to spend the money they are already using to ﬁx this problem the right way. So I had someone send out feelers looking for people to work on a “special project” for me. Those that made it through screening have been taking part in an effort to police the group from the inside, causing a wedge to be driven amongst them. Today serves as evidence of money well spent. they have begun to crack and their influential people are beginning to part ways with the group.</br></br></br></p><p>Eventually there will be such a small minority that it will just blow over and nobody will care.</p><p>It feels good and I am proud of myself. I am slaying a giant and there is<br> nothing they can do about it. How does one separate themselves from<br> people claiming to be “doing what is right for the group” by tone policing? You can’t and it will continue to be the dagger that kills this silly group of entitled brats.<br> -N. Denton</br></br></br></p></blockquote><p>I’m sort of curious who are supposed to be these “influential people” who are beginning to part ways with #GamerGate. From what I’ve seen, more people than ever are lining up behind it as it becomes increasingly obvious that #GamerGate is not about harassing women given the fact that there hasn’t been any harassment beyond that supposedly directed at LW1, LW2, and LWu back in August.</p><p>#GamerGate concerns one thing and one thing only. People designing, developing, and playing the games they want to design, develop, and play. Everything else flows from that.</p><p>The thing is, it doesn’t actually matter if this is fake, real, or a real plant meant to sow discord. The lesson for #GamerGate is the same. Ignore the moderates, ignore the placators, ignore the tone-police, and keep doing what you’re doing. The only thing a 4GW organization has to do in order to keep succeeding is a) don’t stop, and, b) don’t centralize.</p></div>",
  "content_text": "This may or may not be genuine, but it is supposed to be a note from Gawker Media’s Nick Denton. [UPDATE: despite the overly dramatic language,\nit is confirmed to be real\n.] I’m a little skeptical, but it is in line with SJW entryist tactics as well as some of the recent attempts at “tone-policing” we’ve seen – and ignored – within #GamerGate. And then there is this:\n8chan.co @infinitechan\n#GamerGate has no leaders, so you don’t have to trust me. I don’t confirm things lightly: what @Kingofpol has is 100% true.\nIn any event, this was\nsupposedly\nleaked directly from a source at Gawker:\nFirst and foremost I would like to say “Thank You!” to myself and for those who are more than willing to accept a bit of ﬁnancial compensation in exchange for causing a disruption. I couldn’t have done it without you and I appreciate all your hard work.\nFor those of you that might be quite puzzled at the moment I will clarify. As you may have noticed over the last couple months. there has been a\ngroup of individuals eager to ruin my business endeavors at every turn for the sake of “ethics”. I would go as far as to use their preferred banner name. but aﬂer the work of my new colleagues. I don’t see it continuing on much longer. Yes. the circus will ﬁnally be leaving town and business will continue as usual.\nOver the past few weeks I had tasked my employees for ﬁnding a means to destroy that which has been rather resilient. You cannot simply “attack” their leader when they have none. nor could you shun the group as a whole without them using their rainbow coalition to mitigate any claims. Fortunately for myself. I ﬁgured it out. I found a way to, as they would put it, “Kill the Batman”.\nIt was there all along and oh so very simple. inﬁltrate the group and kill\nthem from the inside. The media parade that has been going on for weeks\nnow hasn’t done anything worth a damn. Time and effort thrown out the\nwindow with needless articles over this shit show. None of it has made a damn bit of difference until now. Everyone is eager to throw themselves at mainstream outlets. but none of them are eager to spend the money they are already using to ﬁx this problem the right way. So I had someone send out feelers looking for people to work on a “special project” for me. Those that made it through screening have been taking part in an effort to police the group from the inside, causing a wedge to be driven amongst them. Today serves as evidence of money well spent. they have begun to crack and their influential people are beginning to part ways with the group.\nEventually there will be such a small minority that it will just blow over and nobody will care.\nIt feels good and I am proud of myself. I am slaying a giant and there is\nnothing they can do about it. How does one separate themselves from\npeople claiming to be “doing what is right for the group” by tone policing? You can’t and it will continue to be the dagger that kills this silly group of entitled brats.\n-N. Denton\nI’m sort of curious who are supposed to be these “influential people” who are beginning to part ways with #GamerGate. From what I’ve seen, more people than ever are lining up behind it as it becomes increasingly obvious that #GamerGate is not about harassing women given the fact that there hasn’t been any harassment beyond that supposedly directed at LW1, LW2, and LWu back in August.\n#GamerGate concerns one thing and one thing only. People designing, developing, and playing the games they want to design, develop, and play. Everything else flows from that.\nThe thing is, it doesn’t actually matter if this is fake, real, or a real plant meant to sow discord. The lesson for #GamerGate is the same. Ignore the moderates, ignore the placators, ignore the tone-police, and keep doing what you’re doing. The only thing a 4GW organization has to do in order to keep succeeding is a) don’t stop, and, b) don’t centralize.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-04T17:00:00+00:00"
}