{
  "url": "https://voxday.net/2014/11/05/gridlock-is-not-proble/",
  "scraped_at": "2025-12-16T12:33:50.646311",
  "title": "Gridlock is not the problem",
  "date_display": "November 5, 2014",
  "date_iso": "2014-11-05T23:52:00+00:00",
  "date_from_url": "2014-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rush is concerned, rightly, at the noises that are coming out of the Republican hierarchy concerning the need to “work with the President”. <a href=\"http://www.rushlimbaugh.com/daily/2014/11/05/the_mandate_republicans_were_elected_to_stop_barack_obama_not_to_work_with_him\">That’s not what they were elected to do</a>:</p><blockquote class=\"tr_bq\"><p> What I want to do here is cut to the chase. The result yesterday is exactly what I said it would be. The Republican Party now has one of the most important and unquestionable mandates a political party has ever had at its junction with American history, especially a political party which did not run on a national agenda. The Republican Party purposely stood mute nationally.</p><p>Now, if you go into the races, the House and Senate raises all over the country, you will find that many Republican candidates ran specifically against Obamacare, and that is an important note to make and an important thing for you to remember. Individual Republican candidates won, and they won big. They won in a wave landslide running against Obamacare. The national Republican brand or image didn’t say a word, which makes the mandate that they have all the more incredible.</p><p>It is rare that a political party running for office in a midterm election not standing for anything ends up with a mandate, and they have one, and it is the biggest and perhaps the most important mandate a political party has had in the recent era, and it is very simple what that mandate is. It is to stop Barack Obama. It is to stop the Democrats. There is no other reason why Republicans were elected yesterday. Republicans were not elected to govern.</p></blockquote><p>If the Republicans go along with amnesty for supposed fear of gridlock, they will throw away everything they have gained here. Which is why it would probably be the safe bet that the Republican leadership will try to do it, thereby sparking a revolt among House Republicans. We’re already hearing a lot of “the adults are in charge now” talk, which in Washington terms means “go along to get along”.</p><p>Rush added: “As I listen to the wizards of smart — all the analysts of both parties,<br> all movements on TV last night and today — the thing I’m hearing from<br> everybody is that what the voters want is for Washington to compromise<br> and people to work together.”</br></br></br></p><p>That is nothing more than an attempt to spin the narrative, to rewrite history and recreate reality. Don’t put ANY credence in anyone, left or right, you hear saying it.</p></div>",
  "content_text": "Rush is concerned, rightly, at the noises that are coming out of the Republican hierarchy concerning the need to “work with the President”.\nThat’s not what they were elected to do\n:\nWhat I want to do here is cut to the chase. The result yesterday is exactly what I said it would be. The Republican Party now has one of the most important and unquestionable mandates a political party has ever had at its junction with American history, especially a political party which did not run on a national agenda. The Republican Party purposely stood mute nationally.\nNow, if you go into the races, the House and Senate raises all over the country, you will find that many Republican candidates ran specifically against Obamacare, and that is an important note to make and an important thing for you to remember. Individual Republican candidates won, and they won big. They won in a wave landslide running against Obamacare. The national Republican brand or image didn’t say a word, which makes the mandate that they have all the more incredible.\nIt is rare that a political party running for office in a midterm election not standing for anything ends up with a mandate, and they have one, and it is the biggest and perhaps the most important mandate a political party has had in the recent era, and it is very simple what that mandate is. It is to stop Barack Obama. It is to stop the Democrats. There is no other reason why Republicans were elected yesterday. Republicans were not elected to govern.\nIf the Republicans go along with amnesty for supposed fear of gridlock, they will throw away everything they have gained here. Which is why it would probably be the safe bet that the Republican leadership will try to do it, thereby sparking a revolt among House Republicans. We’re already hearing a lot of “the adults are in charge now” talk, which in Washington terms means “go along to get along”.\nRush added: “As I listen to the wizards of smart — all the analysts of both parties,\nall movements on TV last night and today — the thing I’m hearing from\neverybody is that what the voters want is for Washington to compromise\nand people to work together.”\nThat is nothing more than an attempt to spin the narrative, to rewrite history and recreate reality. Don’t put ANY credence in anyone, left or right, you hear saying it.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-05T23:52:00+00:00"
}