{
  "url": "https://voxday.net/2014/11/27/happy-thanksgiving-2/",
  "scraped_at": "2025-12-16T12:36:26.503314",
  "title": "Happy Thanksgiving",
  "date_display": "November 27, 2014",
  "date_iso": "2014-11-27T13:00:00+00:00",
  "date_from_url": "2014-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unlike the Left, we of the Right don’t despise our families <a href=\"http://www.washingtonpost.com/lifestyle/style/friendsgiving-a-new-tradition-to-be-thankful-for/2014/11/25/66aab37a-74b6-11e4-a755-e32227229e7b_story.html\">and prefer the company of drunken strangers to them</a>. But that doesn’t meant there is never an amount of tension involved in a day of unusually close proximity with a group of people to whom we are related, but with whom we don’t necessarily have all that much otherwise in common. So, it may be helpful to review last year’s <a href=\"http://www.milobookclub.com/2013/12/24/holiday-survival-guide/\">Holiday Survival guide</a>:</p><blockquote class=\"tr_bq\"><p> If you are a man:</p><ul><li>Remember that the women are putting in a lot of work and are feeling a lot of stress. This is not the time to remember things at the last minute or lament how things were done differently when you were a child. Avoid throwing curve balls.</li><li> Don’t tell her to relax. She’s not going to do so anymore than you are during a hard-fought basketball game. Holiday-hosting can perhaps be best understood as a competitive sport for women, even if the only competitors are in her mind.</li><li> Ask her if there is anything you can do twice per day, once in the morning and once in the afternoon. Simply having someone willing to run out to the store once or twice, if necessary, can save her considerable time and reduce tensions.</li><li> Pour yourself a glass of wine as soon as it gets dark. Offer her one. She’ll probably need it.</li><li> Don’t let her get away with snapping at you or anyone else. The objective is to be helpful and considerate, not a doormat.</li></ul><p>If you are a woman:</p><ul><li>Try to remember that it’s a celebration, not a competition, and the world will not end if a particular dish is not served or something doesn’t go exactly the way you planned it.</li><li>The only person who can ruin the holiday for yourself is you. In fact, the only person who is likely to ruin the holiday for everyone else is you. Don’t be that woman.</li><li>If someone is taking pictures or video, just smile. Drawing additional attention to yourself by complaining and protesting looks far more ridiculous than any bedhead or lack of makeup does.</li></ul></blockquote><p>And don’t miss the opportunity to be the hero. During the holiday season, I always reflect upon the wisdom of my grandfather, arguably the most awesome man who ever strode the planet. I once told him, as he was washing the dishes in the kitchen while everyone else was in the dining room listening to the women attempt to maximize their rare opportunity to talk in front of a captive male audience, that as the senior male member of the family, it wasn’t his responsibility to clean up.</p><p>He looked at me, scotch in hand, then raised an eyebrow and indicated the football game that was on the television in the corner of the kitchen. “Responsibility?” the Lacedaemonian said.</p><p>Have a very happy and <i>grateful </i>Thanksgiving, everyone. We all have much for which to give thanks to the Almighty God, if only for giving us the strength to endure and surmount the challenges life presents us. And speaking of challenges, Spacebunny has followed up the main course with pumpkin pie, pecan pie, and chocolate fudge. Where to start? And more importantly, when to stop?</p></div>",
  "content_text": "Unlike the Left, we of the Right don’t despise our families\nand prefer the company of drunken strangers to them\n. But that doesn’t meant there is never an amount of tension involved in a day of unusually close proximity with a group of people to whom we are related, but with whom we don’t necessarily have all that much otherwise in common. So, it may be helpful to review last year’s\nHoliday Survival guide\n:\nIf you are a man:\nRemember that the women are putting in a lot of work and are feeling a lot of stress. This is not the time to remember things at the last minute or lament how things were done differently when you were a child. Avoid throwing curve balls.\nDon’t tell her to relax. She’s not going to do so anymore than you are during a hard-fought basketball game. Holiday-hosting can perhaps be best understood as a competitive sport for women, even if the only competitors are in her mind.\nAsk her if there is anything you can do twice per day, once in the morning and once in the afternoon. Simply having someone willing to run out to the store once or twice, if necessary, can save her considerable time and reduce tensions.\nPour yourself a glass of wine as soon as it gets dark. Offer her one. She’ll probably need it.\nDon’t let her get away with snapping at you or anyone else. The objective is to be helpful and considerate, not a doormat.\nIf you are a woman:\nTry to remember that it’s a celebration, not a competition, and the world will not end if a particular dish is not served or something doesn’t go exactly the way you planned it.\nThe only person who can ruin the holiday for yourself is you. In fact, the only person who is likely to ruin the holiday for everyone else is you. Don’t be that woman.\nIf someone is taking pictures or video, just smile. Drawing additional attention to yourself by complaining and protesting looks far more ridiculous than any bedhead or lack of makeup does.\nAnd don’t miss the opportunity to be the hero. During the holiday season, I always reflect upon the wisdom of my grandfather, arguably the most awesome man who ever strode the planet. I once told him, as he was washing the dishes in the kitchen while everyone else was in the dining room listening to the women attempt to maximize their rare opportunity to talk in front of a captive male audience, that as the senior male member of the family, it wasn’t his responsibility to clean up.\nHe looked at me, scotch in hand, then raised an eyebrow and indicated the football game that was on the television in the corner of the kitchen. “Responsibility?” the Lacedaemonian said.\nHave a very happy and\ngrateful\nThanksgiving, everyone. We all have much for which to give thanks to the Almighty God, if only for giving us the strength to endure and surmount the challenges life presents us. And speaking of challenges, Spacebunny has followed up the main course with pumpkin pie, pecan pie, and chocolate fudge. Where to start? And more importantly, when to stop?",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-27T13:00:00+00:00"
}