{
  "url": "https://voxday.net/2014/11/15/how-to-make-monster/",
  "scraped_at": "2025-12-16T12:35:00.253019",
  "title": "How to make a monster",
  "date_display": "November 15, 2014",
  "date_iso": "2014-11-15T18:00:00+00:00",
  "date_from_url": "2014-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Very Important Lesson from <a href=\"https://twitter.com/scalzi/status/533636873814822912\">John Scalzi and the SJWs</a>:</p><blockquote class=\"tr_bq\"><p> John Scalzi@scalzi<br> Kid called me out on Twitter last night for something she considered sexist. Proud of her; happy to have raised her so she knew she could.</br></p><p>Josh Neff ‏@joshuamneff<br> You’re doing parenting right.</br></p><p>The Inner Babysitter ‏@PSMHopkins<br> I literally cheered when I saw that last night.</br></p><p>Ben Emery ‏@JamesBenEmery<br> As a parent, that’s when you sit back and go, “I know I’ve made mistakes, but overall I haven’t completely failed.”</br></p><p>ChaosNexus ‏@ChaosNexus<br> I can’t imagine there would be any wilting flowers in the Scalzi household.</br></p><p>John Scalzi ‏@scalzi<br> @ChaosNexus There really aren’t.</br></p></blockquote><p>Well, there is observably one wilting flower there, at any rate. Notice how the male SJW openly revels in his failure; he asserts pride in his own degradation. Now, where have I heard this sort of thing before? Ah, yes, now I recollect, in Isaiah, when the prophet speaks of the judgment of the wicked of Judah.</p><p><i>“</i><i>O My people! Their oppressors are children, And<br> women rule over them. O My people! Those who guide you lead you astray and confuse the direction of your paths.”</br></i><br> – Isaiah 3:12.</br></p><p>And then, of course, there is this:</p><p><i>“The sex impulse was dangerous to the Party, and the Party had turned it<br> to account. They had played a similar trick with the instinct of<br> parenthood. The family could not actually be abolished, and, indeed,<br> people were encouraged to be fond of their children, in almost the<br> old-fashioned way. The children, on the other hand, were systematically<br> turned against their parents and taught to spy on them and report their<br> deviations. The family had become in effect an extension of the Thought<br> Police. It was a device by means of which everyone could be surrounded<br> night and day by informers who knew him intimately.”</br></br></br></br></br></br></br></br></i><br> – George Orwell, <i>1984 </i></br></p><p>There is nothing new about the SJW. He is the harbinger of evil and the symptom of a decadent society in the process of collapse. But to return to this specific SJW, there is, as you might expect on Twitter, a punchline.</p><blockquote class=\"tr_bq\"><p> <a class=\"account-group js-account-group js-action-profile js-user-profile-link js-nav\" data-user-id=\"2408255442\" href=\"https://twitter.com/TruthNSausages\"><b class=\"fullname js-action-profile-name show-popup-with-id\" data-aria-label-part=\"\">Dave Injustice</b><br> ‏<s>@</s><b>TruthNSausages</b></br></a><br/></p><div class=\"js-tweet-text tweet-text\" data-aria-label-part=\"0\" lang=\"en\"> @scalzi <i>“Kid called me out on Twitter last night for something she considered sexist”</i><br> So you muted her?</br></div></blockquote><p>High-larious.</p></div>",
  "content_text": "A Very Important Lesson from\nJohn Scalzi and the SJWs\n:\nJohn Scalzi@scalzi\nKid called me out on Twitter last night for something she considered sexist. Proud of her; happy to have raised her so she knew she could.\nJosh Neff ‏@joshuamneff\nYou’re doing parenting right.\nThe Inner Babysitter ‏@PSMHopkins\nI literally cheered when I saw that last night.\nBen Emery ‏@JamesBenEmery\nAs a parent, that’s when you sit back and go, “I know I’ve made mistakes, but overall I haven’t completely failed.”\nChaosNexus ‏@ChaosNexus\nI can’t imagine there would be any wilting flowers in the Scalzi household.\nJohn Scalzi ‏@scalzi\n@ChaosNexus There really aren’t.\nWell, there is observably one wilting flower there, at any rate. Notice how the male SJW openly revels in his failure; he asserts pride in his own degradation. Now, where have I heard this sort of thing before? Ah, yes, now I recollect, in Isaiah, when the prophet speaks of the judgment of the wicked of Judah.\n“\nO My people! Their oppressors are children, And\nwomen rule over them. O My people! Those who guide you lead you astray and confuse the direction of your paths.”\n– Isaiah 3:12.\nAnd then, of course, there is this:\n“The sex impulse was dangerous to the Party, and the Party had turned it\nto account. They had played a similar trick with the instinct of\nparenthood. The family could not actually be abolished, and, indeed,\npeople were encouraged to be fond of their children, in almost the\nold-fashioned way. The children, on the other hand, were systematically\nturned against their parents and taught to spy on them and report their\ndeviations. The family had become in effect an extension of the Thought\nPolice. It was a device by means of which everyone could be surrounded\nnight and day by informers who knew him intimately.”\n– George Orwell,\n1984\nThere is nothing new about the SJW. He is the harbinger of evil and the symptom of a decadent society in the process of collapse. But to return to this specific SJW, there is, as you might expect on Twitter, a punchline.\nDave Injustice\n‏\n@\nTruthNSausages\n@scalzi\n“Kid called me out on Twitter last night for something she considered sexist”\nSo you muted her?\nHigh-larious.",
  "tags": [
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-15T18:00:00+00:00"
}