{
  "url": "https://voxday.net/2014/11/03/i-may-have-misread-that-one/",
  "scraped_at": "2025-12-16T12:33:34.447498",
  "title": "I may have misread that one",
  "date_display": "November 3, 2014",
  "date_iso": "2014-11-03T13:30:00+00:00",
  "date_from_url": "2014-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anonymous Conservative explains how I didn’t correctly grasp the message that some pinkshirts <a href=\"http://www.milobookclub.com/2014/10/31/probing-for-weakness/\">were attempting to send me</a> the other day regarding their concerns that I be informed about Roosh’s supposed shenanigans. According to him, they were not merely probing for weakness in the pro-#GamerGate ranks by dangling an approval carrot, but were actually attempting to frighten me by threatening a stick. Which intention, I have to admit, escaped me entirely. He explains in <a href=\"http://www.anonymousconservative.com/blog/on-rabbits-and-disqualifcation/\">On Rabbits and Disqualification</a>:</p><blockquote class=\"tr_bq\"><p> What those leftists are saying is not, <i>“Roosh is disqualified because his reputation is not respected due to a (supposedly) factual assertion by me.”</i> They aren’t even saying that, <i>“Roosh’s opinion doesn’t count because I am smearing him.”</i> What the rabbits are saying is, <i>“Roosh is about to have the group turn upon him, so anyone who stands with him is in physical danger themselves. Do you want to be there with him when he’s attacked?”</i> That is the dogwhistle which any rabbit will hear blaring in their ear.</p><p>Vox’s expected response is to flee the rhetorical vicinity of Roosh, because that is how a rabbit is programmed, and rabbits base all their assumptions about the behavior of others on how they themselves would react. You can see what happens when you have no in-group loyalty. You know you are alone, because you would eagerly betray yourself if the circumstances were reversed.</p><p>What is funny is that Vox is so totally lacking in such fear and conflict-avoidance circuitry that he seems unaware that anyone would ever even experience a fear of danger from such a trigger. Yet the fear (and desperate desire for conflict-avoidance) is so ever present in the rabbit, he just assumes Vox will flee from Roosh immediately, both sacrificing Roosh’s support for Vox’s position, and casting Roosh adrift alone. This is how rabbits gain social status, when people aren’t actively killing off the weak. They use rabbit fear and selfishness to foster betrayal among other rabbits.</p><p>Vox’s response is dead on. In tightening ranks with Roosh offensively, and casting rabbits as the enemy, Vox releases a signal that things are getting aggressive, and the leftist’s best course to follow for conflict-avoidance would be complete capitulation and supplication. Of course the leftist response will be to flee. The defense has become most offensive indeed.</p></blockquote><p>AC knows considerably more about the psychological mechanics of the cultural war between the r/selected and the K/selected than I do, so I will defer to his interpretation with a mild degree of astonishment that anyone is seriously supposed to be intimidated into modifying his behavior by what he describes as “dogwhistling”.</p><p>The enemy of my enemy is my friend. And the SJWs are my enemy. I will stand firmly by anyone against them simply because there is no question that they are the sons and daughters of the Devil himself, they are the apostles of pure and undistilled evil. Whatever the moral failings of the broad spectrum of individuals who stand against them, those failings are nothing compared to the relentless, all-devouring monstrosity of the Social Justice Warriors. They are the Nothing Oecumene.</p><p>Give them an inch and they will take it with a smile, then come back for another inch tomorrow. There can be no compromise with them. They accept no moderates; to them a moderate is merely tomorrow’s target. Better to stand fast, stand by everyone who rejects them, and shoot back twice as hard.</p></div>",
  "content_text": "Anonymous Conservative explains how I didn’t correctly grasp the message that some pinkshirts\nwere attempting to send me\nthe other day regarding their concerns that I be informed about Roosh’s supposed shenanigans. According to him, they were not merely probing for weakness in the pro-#GamerGate ranks by dangling an approval carrot, but were actually attempting to frighten me by threatening a stick. Which intention, I have to admit, escaped me entirely. He explains in\nOn Rabbits and Disqualification\n:\nWhat those leftists are saying is not,\n“Roosh is disqualified because his reputation is not respected due to a (supposedly) factual assertion by me.”\nThey aren’t even saying that,\n“Roosh’s opinion doesn’t count because I am smearing him.”\nWhat the rabbits are saying is,\n“Roosh is about to have the group turn upon him, so anyone who stands with him is in physical danger themselves. Do you want to be there with him when he’s attacked?”\nThat is the dogwhistle which any rabbit will hear blaring in their ear.\nVox’s expected response is to flee the rhetorical vicinity of Roosh, because that is how a rabbit is programmed, and rabbits base all their assumptions about the behavior of others on how they themselves would react. You can see what happens when you have no in-group loyalty. You know you are alone, because you would eagerly betray yourself if the circumstances were reversed.\nWhat is funny is that Vox is so totally lacking in such fear and conflict-avoidance circuitry that he seems unaware that anyone would ever even experience a fear of danger from such a trigger. Yet the fear (and desperate desire for conflict-avoidance) is so ever present in the rabbit, he just assumes Vox will flee from Roosh immediately, both sacrificing Roosh’s support for Vox’s position, and casting Roosh adrift alone. This is how rabbits gain social status, when people aren’t actively killing off the weak. They use rabbit fear and selfishness to foster betrayal among other rabbits.\nVox’s response is dead on. In tightening ranks with Roosh offensively, and casting rabbits as the enemy, Vox releases a signal that things are getting aggressive, and the leftist’s best course to follow for conflict-avoidance would be complete capitulation and supplication. Of course the leftist response will be to flee. The defense has become most offensive indeed.\nAC knows considerably more about the psychological mechanics of the cultural war between the r/selected and the K/selected than I do, so I will defer to his interpretation with a mild degree of astonishment that anyone is seriously supposed to be intimidated into modifying his behavior by what he describes as “dogwhistling”.\nThe enemy of my enemy is my friend. And the SJWs are my enemy. I will stand firmly by anyone against them simply because there is no question that they are the sons and daughters of the Devil himself, they are the apostles of pure and undistilled evil. Whatever the moral failings of the broad spectrum of individuals who stand against them, those failings are nothing compared to the relentless, all-devouring monstrosity of the Social Justice Warriors. They are the Nothing Oecumene.\nGive them an inch and they will take it with a smile, then come back for another inch tomorrow. There can be no compromise with them. They accept no moderates; to them a moderate is merely tomorrow’s target. Better to stand fast, stand by everyone who rejects them, and shoot back twice as hard.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-03T13:30:00+00:00"
}