{
  "url": "https://voxday.net/2014/11/23/in-which-mr-wright-addresses-gossip/",
  "scraped_at": "2025-12-16T12:35:58.214312",
  "title": "In which Mr. Wright addresses a Gossip",
  "date_display": "November 23, 2014",
  "date_iso": "2014-11-23T13:30:00+00:00",
  "date_from_url": "2014-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And proceeds <a href=\"http://www.scifiwright.com/2014/11/gossip-of-the-day/\">to flay him, slowly,</a> in his inimitable style, before rolling him gently in finely ground sea salt.</p><blockquote class=\"tr_bq\"><p> A yahoo who does not give his name but calls himself Vunderguy is asking a Houyhnhnm named John C Wright what is my emotional reaction to a man who calls himself Vox Day but whose real name is Theodore Beale.</p><p> <i>   “Speaking of flights and fancy, what’s your take on your publisher, Vox Day?”</i><br>Despite the bouncing gaiety of the question, I answered it soberly, saying this: I think he has too high an opinion of me and my work, frankly. This is based on private communications with him, where he grants me more praise than I think just. While it is right and proper, as a matter of professional courtesy, for an editor to flatter a writer he publishes, I am afraid in this case he overestimates my talent, albeit I am grateful for the flattery, because I am quite vain.</br></p><p>Vunderguy answers with this indirect comment:</p><p>    <i>“While that insight is a bit humanizing of him, I meant in regards to his more… ‘fringe’ views.</i>“</p><p>I was not aware that Mr. Beale needed ‘humanizing’ whatever that word means. As a Houyhnhnm, the process sounds painful and dangerous and much to be avoided.</p><p>Growing mildly impatient, in my unemotional way, I remarked: “Fringe views? Is this a guessing game where you act like a coy schoolgirl and do not say what you mean, while I act like a man and speak in complete sentences?” And I mentioned some of Mr Beale’s unusual views, for example on drug legalization and other libertarian issues, which are not mainstream.</p><p>After that, Mr. Guy (as I shall hereafter call the anonymous accuser) finally agreed to speak plainly and ask his question, or, rather, his accusation disguised as a question.</p><p>I say ‘his’ because in English, when the sex of the antecedent is unknown or undetermined, this is the proper pronoun. The delicate indirectness with which Mr. Guy asks his questions, however, is more typically seen in women, or was, back in the day when women practiced feminine delicacy.</p><p>Since it is an accusation and not a question, in a properly lawyerly fashion, let me answer point by point:</p></blockquote><p>Mr. Wright also asked the Gossip why he was so strangely incurious about his other editors, including Messrs. George R.R. Martin, Gordon van Gelder, David Brin, Gardner Dozois, and Glenn Yeffeth. My question to those who would attack Castalia’s authors on the basis of their editor is this: Tor editor Patrick Nielsen Hayden is, unlike me, a <i>self-admitted</i> racist. Do you similarly inquire all of his authors their “take” on his hurtful and offensive statement: <i>“I’m a racist. Or some kind of bad guy, at any rate. I’ll live. Worse things happen to the victims of actual racism.”</i></p><p>Like having their land stolen and being put on reservations, just to name one, for no particular reason at all.<i></i><br> <i><br/></i><br> I find it rather amusing that people think they know my “fringe views”. I mean, the stuff they think is fringe is merely what I’m willing to openly state and defend in public. That is hardly the outer limit of my thinking.</br></br></p></div>",
  "content_text": "And proceeds\nto flay him, slowly,\nin his inimitable style, before rolling him gently in finely ground sea salt.\nA yahoo who does not give his name but calls himself Vunderguy is asking a Houyhnhnm named John C Wright what is my emotional reaction to a man who calls himself Vox Day but whose real name is Theodore Beale.\n“Speaking of flights and fancy, what’s your take on your publisher, Vox Day?”\nDespite the bouncing gaiety of the question, I answered it soberly, saying this: I think he has too high an opinion of me and my work, frankly. This is based on private communications with him, where he grants me more praise than I think just. While it is right and proper, as a matter of professional courtesy, for an editor to flatter a writer he publishes, I am afraid in this case he overestimates my talent, albeit I am grateful for the flattery, because I am quite vain.\nVunderguy answers with this indirect comment:\n“While that insight is a bit humanizing of him, I meant in regards to his more… ‘fringe’ views.\n“\nI was not aware that Mr. Beale needed ‘humanizing’ whatever that word means. As a Houyhnhnm, the process sounds painful and dangerous and much to be avoided.\nGrowing mildly impatient, in my unemotional way, I remarked: “Fringe views? Is this a guessing game where you act like a coy schoolgirl and do not say what you mean, while I act like a man and speak in complete sentences?” And I mentioned some of Mr Beale’s unusual views, for example on drug legalization and other libertarian issues, which are not mainstream.\nAfter that, Mr. Guy (as I shall hereafter call the anonymous accuser) finally agreed to speak plainly and ask his question, or, rather, his accusation disguised as a question.\nI say ‘his’ because in English, when the sex of the antecedent is unknown or undetermined, this is the proper pronoun. The delicate indirectness with which Mr. Guy asks his questions, however, is more typically seen in women, or was, back in the day when women practiced feminine delicacy.\nSince it is an accusation and not a question, in a properly lawyerly fashion, let me answer point by point:\nMr. Wright also asked the Gossip why he was so strangely incurious about his other editors, including Messrs. George R.R. Martin, Gordon van Gelder, David Brin, Gardner Dozois, and Glenn Yeffeth. My question to those who would attack Castalia’s authors on the basis of their editor is this: Tor editor Patrick Nielsen Hayden is, unlike me, a\nself-admitted\nracist. Do you similarly inquire all of his authors their “take” on his hurtful and offensive statement:\n“I’m a racist. Or some kind of bad guy, at any rate. I’ll live. Worse things happen to the victims of actual racism.”\nLike having their land stolen and being put on reservations, just to name one, for no particular reason at all.\nI find it rather amusing that people think they know my “fringe views”. I mean, the stuff they think is fringe is merely what I’m willing to openly state and defend in public. That is hardly the outer limit of my thinking.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-23T13:30:00+00:00"
}