{
  "url": "https://voxday.net/2014/11/28/irony-sweet-irony/",
  "scraped_at": "2025-12-16T12:36:29.821882",
  "title": "Is this a satire too?",
  "date_display": "November 28, 2014",
  "date_iso": "2014-11-28T09:36:00+00:00",
  "date_from_url": "2014-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I invite the reader to compare the difference in the amount of effort McRapey has put in over the years in repeatedly denouncing me for what he imagines to be my White Supremacy, Dudebroism, Racism, Sexism, Homophobia, and general Dipshittery with his observed reluctance to similarly denounce his friend Jian Gomeshi, <a href=\"http://www.voxday.net/tox/GrooveKittens.mp3\">upon whose Canadian radio show he appeared</a> to discuss my imaginary crimes:</p><p>The Toronto Police Sex Crimes Unit <a href=\"http://www.torontopolice.on.ca/newsreleases/30572\">was rather less reticent</a>:</p><blockquote class=\"tr_bq\"><p> On Friday, October 31, 2014, Toronto Police Service Sex Crimes started an investigation into several allegations of sexual assault. On Wednesday, November 26, 2014, Jian Ghomeshi, 47, of Toronto, surrendered to police. He was charged with:</p><p>1) four counts of Sexual Assault</p><p>2) Overcome Resistance – Choking</p><p>He is scheduled to appear in court early this afternoon. We will notify the media of the court location well in advance of the appearance. </p></blockquote><p>Now, John Scalzi is a self-admitted rapist (<i>“I’m a rapist. I’m one of those men who likes to force myself on women<br> without their consent or desire and then batter them sexually.”</br></i>) so perhaps that might explain his reluctance to repeatedly and vociferously denounce an actual sex assailant. Again. One can observe that the list of sex criminals with whom he is known to be associated has grown rapidly in the last year:</p><ul><li>Samuel Delany, SFWA Grand Master</li><li>Marion Zimmer Bradley, SFWA</li><li>Ed Kramer, SFWA</li><li>Jian Gomeshi</li></ul><p>There will almost surely be more in the months and years to come. My money would be on a Jim Hines-related scandal, as he not only looks creepy, but has a passion for rape-counseling that strikes me as suspiciously akin to the single, forty-something Assistant Scoutmaster who loves nothing more than to take young boys camping. Perhaps it is merely a case of <a href=\"http://www.jimchines.com/wp/wp-content/uploads/2014/03/Jim-WFC-Full.jpg\">infelicitous physiognomy</a>, but you have to admit, Hines looks like Central Casting’s idea of a sexual offender. (Seriously, McCreepy, you absolutely need a new PR shot. About the only thing that would make it more damning would be books by Nabokov, Breen, and MZB on the bookshelf behind you.)  Nor can one excuse McRapey on the grounds of “guilt by association” because guilt by association with me is something to which he has repeatedly appealed in attempting to tar Larry Correia and others.</p><p>So, is this “satire” again or simply sweet irony?</p></div>",
  "content_text": "I invite the reader to compare the difference in the amount of effort McRapey has put in over the years in repeatedly denouncing me for what he imagines to be my White Supremacy, Dudebroism, Racism, Sexism, Homophobia, and general Dipshittery with his observed reluctance to similarly denounce his friend Jian Gomeshi,\nupon whose Canadian radio show he appeared\nto discuss my imaginary crimes:\nThe Toronto Police Sex Crimes Unit\nwas rather less reticent\n:\nOn Friday, October 31, 2014, Toronto Police Service Sex Crimes started an investigation into several allegations of sexual assault. On Wednesday, November 26, 2014, Jian Ghomeshi, 47, of Toronto, surrendered to police. He was charged with:\n1) four counts of Sexual Assault\n2) Overcome Resistance – Choking\nHe is scheduled to appear in court early this afternoon. We will notify the media of the court location well in advance of the appearance.\nNow, John Scalzi is a self-admitted rapist (\n“I’m a rapist. I’m one of those men who likes to force myself on women\nwithout their consent or desire and then batter them sexually.”\n) so perhaps that might explain his reluctance to repeatedly and vociferously denounce an actual sex assailant. Again. One can observe that the list of sex criminals with whom he is known to be associated has grown rapidly in the last year:\nSamuel Delany, SFWA Grand Master\nMarion Zimmer Bradley, SFWA\nEd Kramer, SFWA\nJian Gomeshi\nThere will almost surely be more in the months and years to come. My money would be on a Jim Hines-related scandal, as he not only looks creepy, but has a passion for rape-counseling that strikes me as suspiciously akin to the single, forty-something Assistant Scoutmaster who loves nothing more than to take young boys camping. Perhaps it is merely a case of\ninfelicitous physiognomy\n, but you have to admit, Hines looks like Central Casting’s idea of a sexual offender. (Seriously, McCreepy, you absolutely need a new PR shot. About the only thing that would make it more damning would be books by Nabokov, Breen, and MZB on the bookshelf behind you.)  Nor can one excuse McRapey on the grounds of “guilt by association” because guilt by association with me is something to which he has repeatedly appealed in attempting to tar Larry Correia and others.\nSo, is this “satire” again or simply sweet irony?",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-28T09:36:00+00:00"
}