{
  "url": "https://voxday.net/2014/11/01/is-lena-dunham-eligible-for-sfwa/",
  "scraped_at": "2025-12-16T12:33:23.795167",
  "title": "Is Lena Dunham eligible for the SFWA?",
  "date_display": "November 1, 2014",
  "date_iso": "2014-11-01T20:13:00+00:00",
  "date_from_url": "2014-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears <a href=\"http://www.nationalreview.com/article/391348/pathetic-privilege-kevin-d-williamson\">she’ll fit right in</a> with the SJWs, pedophiles, and child molesters there:</p><blockquote class=\"tr_bq\"><p> If there is such a thing as actually <i>abusing</i> a child through<br> excessive generosity and overindulgence, then Lena Dunham’s parents are<br> child abusers. Her father, Carroll Dunham, is a painter noted for his<br> primitive brand of highbrow pornography, his canvases anchored by puffy<br> neon-pink labia; her photographer mother filled the family home with<br> nude pictures of herself, “legs spread defiantly.” Self-styled radicals from old money, they were not the sort of people inclined to enforce even the most lax of boundaries. And they were, in their daughter’s telling, enablers of some very disturbing behavior that would be considered child abuse in many jurisdictions — Lena Dunham’s sexual abuse, specifically, of her younger sister, Grace, the sort of thing that gets children taken away from non-millionaire families without Andover pedigrees and Manhattanite social connections. Dunham writes of casually masturbating while in bed next to her younger sister, of bribing her with “three pieces of candy if I could kiss her on the lips for five seconds . . . anything a sexual predator might do to woo a small suburban girl I was trying.” At one point, when her sister is a toddler, Lena Dunham pries open her vagina — “my curiosity got the best of me,” she offers, as though that were an explanation. “This was within the spectrum of things I did.”</br></br></br></br></br></p></blockquote><p>YERGGHH! I’ve always thought Dunham looked like a Daughter of Innsmouth straight out of Lovecraft. It turns out that she’s even uglier and more freakish on the inside than her appalling exterior would suggest. She’s not the voice of her generation, she’s not a voice of a generation, by her own account she is an incestuous child molester.</p></div>",
  "content_text": "It appears\nshe’ll fit right in\nwith the SJWs, pedophiles, and child molesters there:\nIf there is such a thing as actually\nabusing\na child through\nexcessive generosity and overindulgence, then Lena Dunham’s parents are\nchild abusers. Her father, Carroll Dunham, is a painter noted for his\nprimitive brand of highbrow pornography, his canvases anchored by puffy\nneon-pink labia; her photographer mother filled the family home with\nnude pictures of herself, “legs spread defiantly.” Self-styled radicals from old money, they were not the sort of people inclined to enforce even the most lax of boundaries. And they were, in their daughter’s telling, enablers of some very disturbing behavior that would be considered child abuse in many jurisdictions — Lena Dunham’s sexual abuse, specifically, of her younger sister, Grace, the sort of thing that gets children taken away from non-millionaire families without Andover pedigrees and Manhattanite social connections. Dunham writes of casually masturbating while in bed next to her younger sister, of bribing her with “three pieces of candy if I could kiss her on the lips for five seconds . . . anything a sexual predator might do to woo a small suburban girl I was trying.” At one point, when her sister is a toddler, Lena Dunham pries open her vagina — “my curiosity got the best of me,” she offers, as though that were an explanation. “This was within the spectrum of things I did.”\nYERGGHH! I’ve always thought Dunham looked like a Daughter of Innsmouth straight out of Lovecraft. It turns out that she’s even uglier and more freakish on the inside than her appalling exterior would suggest. She’s not the voice of her generation, she’s not a voice of a generation, by her own account she is an incestuous child molester.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-01T20:13:00+00:00"
}