{
  "url": "https://voxday.net/2014/11/21/isolati/",
  "scraped_at": "2025-12-16T12:35:41.320390",
  "title": "Isolati!",
  "date_display": "November 21, 2014",
  "date_iso": "2014-11-21T09:22:00+00:00",
  "date_from_url": "2014-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Several people asked me to address what superficially looks like yet another SJW isolation attempt, as Vunderguy asked John C. Wright for <a href=\"http://www.scifiwright.com/2014/11/the-wright-perspective-talking-past-each-other/#comments\">his “take” on me</a>:</p><blockquote class=\"tr_bq\"><p> I’ll just up and say it then. He seems to me to be something of a white supremacist, even though he’s about as white as I am, or at least, draw those kinds of people towards him.</p><p>Now, I like Vox in a lot of ways. He’s even more non-PC than Matt Stone, Trey Parker’s, Larry Correra’s, and Andrew Klavan’s gay managa-whatever-the-frenchy-word-for-four-is’ love child and the ways he can get under the enemy’s skin is admirable… but he seems to have trouble separating the culture a people group has from the people group themselves and seems to equate the genetics of that people group too closely with the behaviors of that people group… even though, as an admitted minority, he’s one pretty smart cookie. I mean, you’d have to be to be able to be such an isolationist that you give up on America and move to Italy with a family to support… even though that’s even closer to where the first bangs of destruction will begin, but whatever.</p><p>To top it all off, like I said, a lot of the people that tend to comment on his site are nowhere near as awesome as the people that comment on yours, and by that I mean that a lot of the commenters on his site seem to be what Alfonzo Rachel would call, ‘Noe-Confederate Libertarians’ and/or the kind of people who believe we had no good reasons to intervene in Vietnam, Iraq, and probably WW II (I.E., the kind of absolutist pacifists that find no use for Just War Theory).</p><p>Furthermore, Vox supported Ted Cruz’s plan to get a bill passed that would enable congress to strip the citizenship of people who went to go join ISIS… even though anyone with any knowledge of history, like he’s SUPPOSED TO BE, would know that such a bill would just erode our republic faster like the laws put in place by ‘that RINO Neo-Con George W’ that every self-professed Libertarian likes to bash, and enhanced by Obama.</p><p>Furthermore, Vox supports #NotYourShield for the whole gamergate thing, and that hashtag is pretty darned racist, and I mean LEGITIMATELY racist, and not in the faux-racism that Vox’s ‘Magic Negro’ statements about Obama and Ben Carson were.</p><p>He also thinks that the west started the current crises in the Middle-East, even though he admits that it was Muslim aggression that started started the crises on a more macrocosmic scale in the middle-ages, which strikes me as double-think despite any empty rhetoric of, ‘War is Peace,’ that might be hurled at me.</p></blockquote><p>First, let me point out that my opinion of Mr. Wright as a science fiction writer may be high, but it is an informed and soundly grounded one. Second, I am not a “white supremacist”, I am a civilizationist. Many people seem to forget that in addition to my BS in economics I also picked up a BA in East Asian Studies, studied in Japan, and in fact still speak some Japanese. I am a fan of higher civilization in its various forms, but the fact is that European civilization was, and is, the height of Man’s accomplishment. The main reason I live in Europe and not Japan is the timing of the post-Heisei boom bust.</p><p>The reason I “have trouble separating the culture a people group has from the people group themselves” is because the two cannot be separated. They are not the same, but they are intertwined. Americans often find this difficult to understand because their culture is very young and shallow, and because they ceased to be a people, to the extent they ever were, over a century ago. Genetics affects culture, which in turn affects genetics, in an ongoing process that no one is even close to being able to successfully divide and analyze. One of the benefits of being multi-ethnic, multi-lingual, and familiar with multiple cultures is the ability to see what aspects are easily transmitted and which are not. There are still aspects of Japanese culture, hell, there are still aspects of <i>Italian </i>culture which I do not grasp despite my intimate familiarity with them.</p><p>As for anyone still trying to defend the failed military interventions in Vietnam and Iraq, well, that speaks for itself. Whether one looks at them from a moral or a military perspective, they were catastrophes.</p><p>I do support Ted Cruz’s plan to strip citizenship of ISIS members, just as I will support the eventual plans to strip citizenship from those who hold other citizenships. Such acts will not “destroy the Republic”, to the contrary, they will make the possibility of an undivided nation possible. The Republic was destroyed when it became an occupying Empire established by force under Lincoln; the South was, and is, a conquered nation which is no more a voluntary part of the Union than the West Bank is a voluntary part of Israel.</p><p>#NotYourShield is not the least bit “racist”, but is rather the refusal of Native Americans like me or other ethnic minorities, to permit SJW white people to speak for us <i>using our name</i>. We will speak for ourselves, they do not speak for us. The only thing that is racist is the SJW’s attempts to silence us and turn us into ventriloquist puppets. I am astonished at Vunderguy’s implicit assertion that white SJWs have any right to tell Native Americans what their permitted opinions are and at what they are to take offense or not.</p><p>There is no question that Western interference in the Middle East sparked this third great wave of Islamic expansion. Vunderguy earlier tried to question my knowledge of history, and yet here shows his own. There is absolutely no double-think here, merely observable cause and effect. Just as Islamic aggression sparked the Crusades, Western interference sparked the current global jihad. The expansionary jihadist spirit was always there, but it was quiescent until it was disturbed by the West.</p><p>People are often trying to get Larry and John to disown me in much the same way they have tried to get me to disown Roosh and Roissy. One might ask oneself the important question: why? It is, I think, a testimony to our collective effectiveness and impact we have on how people are thinking that so many attempts are repeatedly made to isolate and DISQUALIFY us.</p><p>But why do I so often, as another commenter observed, “get singled out”? I suspect that is because unlike Larry and to a lesser extent John, I annoy and embarrass the conventional Right almost as much as I infuriate the Left. I simply have no loyalty to any ideology except the truth as I perceive it to be and I don’t respect the Right’s pieties on race and other controversies any more than I respect the Left’s. But you don’t have to like the truth in order to accept it is legitimate when presented with correct logic and relevant science.</p></div>",
  "content_text": "Several people asked me to address what superficially looks like yet another SJW isolation attempt, as Vunderguy asked John C. Wright for\nhis “take” on me\n:\nI’ll just up and say it then. He seems to me to be something of a white supremacist, even though he’s about as white as I am, or at least, draw those kinds of people towards him.\nNow, I like Vox in a lot of ways. He’s even more non-PC than Matt Stone, Trey Parker’s, Larry Correra’s, and Andrew Klavan’s gay managa-whatever-the-frenchy-word-for-four-is’ love child and the ways he can get under the enemy’s skin is admirable… but he seems to have trouble separating the culture a people group has from the people group themselves and seems to equate the genetics of that people group too closely with the behaviors of that people group… even though, as an admitted minority, he’s one pretty smart cookie. I mean, you’d have to be to be able to be such an isolationist that you give up on America and move to Italy with a family to support… even though that’s even closer to where the first bangs of destruction will begin, but whatever.\nTo top it all off, like I said, a lot of the people that tend to comment on his site are nowhere near as awesome as the people that comment on yours, and by that I mean that a lot of the commenters on his site seem to be what Alfonzo Rachel would call, ‘Noe-Confederate Libertarians’ and/or the kind of people who believe we had no good reasons to intervene in Vietnam, Iraq, and probably WW II (I.E., the kind of absolutist pacifists that find no use for Just War Theory).\nFurthermore, Vox supported Ted Cruz’s plan to get a bill passed that would enable congress to strip the citizenship of people who went to go join ISIS… even though anyone with any knowledge of history, like he’s SUPPOSED TO BE, would know that such a bill would just erode our republic faster like the laws put in place by ‘that RINO Neo-Con George W’ that every self-professed Libertarian likes to bash, and enhanced by Obama.\nFurthermore, Vox supports #NotYourShield for the whole gamergate thing, and that hashtag is pretty darned racist, and I mean LEGITIMATELY racist, and not in the faux-racism that Vox’s ‘Magic Negro’ statements about Obama and Ben Carson were.\nHe also thinks that the west started the current crises in the Middle-East, even though he admits that it was Muslim aggression that started started the crises on a more macrocosmic scale in the middle-ages, which strikes me as double-think despite any empty rhetoric of, ‘War is Peace,’ that might be hurled at me.\nFirst, let me point out that my opinion of Mr. Wright as a science fiction writer may be high, but it is an informed and soundly grounded one. Second, I am not a “white supremacist”, I am a civilizationist. Many people seem to forget that in addition to my BS in economics I also picked up a BA in East Asian Studies, studied in Japan, and in fact still speak some Japanese. I am a fan of higher civilization in its various forms, but the fact is that European civilization was, and is, the height of Man’s accomplishment. The main reason I live in Europe and not Japan is the timing of the post-Heisei boom bust.\nThe reason I “have trouble separating the culture a people group has from the people group themselves” is because the two cannot be separated. They are not the same, but they are intertwined. Americans often find this difficult to understand because their culture is very young and shallow, and because they ceased to be a people, to the extent they ever were, over a century ago. Genetics affects culture, which in turn affects genetics, in an ongoing process that no one is even close to being able to successfully divide and analyze. One of the benefits of being multi-ethnic, multi-lingual, and familiar with multiple cultures is the ability to see what aspects are easily transmitted and which are not. There are still aspects of Japanese culture, hell, there are still aspects of\nItalian\nculture which I do not grasp despite my intimate familiarity with them.\nAs for anyone still trying to defend the failed military interventions in Vietnam and Iraq, well, that speaks for itself. Whether one looks at them from a moral or a military perspective, they were catastrophes.\nI do support Ted Cruz’s plan to strip citizenship of ISIS members, just as I will support the eventual plans to strip citizenship from those who hold other citizenships. Such acts will not “destroy the Republic”, to the contrary, they will make the possibility of an undivided nation possible. The Republic was destroyed when it became an occupying Empire established by force under Lincoln; the South was, and is, a conquered nation which is no more a voluntary part of the Union than the West Bank is a voluntary part of Israel.\n#NotYourShield is not the least bit “racist”, but is rather the refusal of Native Americans like me or other ethnic minorities, to permit SJW white people to speak for us\nusing our name\n. We will speak for ourselves, they do not speak for us. The only thing that is racist is the SJW’s attempts to silence us and turn us into ventriloquist puppets. I am astonished at Vunderguy’s implicit assertion that white SJWs have any right to tell Native Americans what their permitted opinions are and at what they are to take offense or not.\nThere is no question that Western interference in the Middle East sparked this third great wave of Islamic expansion. Vunderguy earlier tried to question my knowledge of history, and yet here shows his own. There is absolutely no double-think here, merely observable cause and effect. Just as Islamic aggression sparked the Crusades, Western interference sparked the current global jihad. The expansionary jihadist spirit was always there, but it was quiescent until it was disturbed by the West.\nPeople are often trying to get Larry and John to disown me in much the same way they have tried to get me to disown Roosh and Roissy. One might ask oneself the important question: why? It is, I think, a testimony to our collective effectiveness and impact we have on how people are thinking that so many attempts are repeatedly made to isolate and DISQUALIFY us.\nBut why do I so often, as another commenter observed, “get singled out”? I suspect that is because unlike Larry and to a lesser extent John, I annoy and embarrass the conventional Right almost as much as I infuriate the Left. I simply have no loyalty to any ideology except the truth as I perceive it to be and I don’t respect the Right’s pieties on race and other controversies any more than I respect the Left’s. But you don’t have to like the truth in order to accept it is legitimate when presented with correct logic and relevant science.",
  "tags": [
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-21T09:22:00+00:00"
}