{
  "url": "https://voxday.net/2014/11/06/lives-of-horror/",
  "scraped_at": "2025-12-16T12:33:56.073001",
  "title": "Lives of horror",
  "date_display": "November 6, 2014",
  "date_iso": "2014-11-06T13:30:00+00:00",
  "date_from_url": "2014-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Anonymous Conservative <a href=\"http://www.anonymousconservative.com/blog/lena-dunham-and-amygdala-hijacks/\">explains The Dunham Horror</a>:</p><blockquote class=\"tr_bq\"><p> The Lena Dunham saga is a good example of how amygdala development,<br> or lack of it, can produce a human’s nature. In it, you see a woman who<br> growing up had few if any instances of amygdala-developing stress, and<br> whose parents themselves seemed predisposed to amygdala atrophy. As a<br> result, she never developed boundaries on her behavior, because her<br> amygdala was never taught through adversity, “don’t do that.” Now, as an<br> adult, she will always seek the easiest, least stressful path, and will<br> lack the ability to map out the long term consequences of her actions.<br> Because she lacks the hardware, her brain actually sees a world without<br> any consequences, and because she isn’t adapted to hardship, any<br> hardship she walks into is traumatic beyond belief.</br></br></br></br></br></br></br></br></br></br></p><p>In many ways, her story is directly analogous to the broader issue of<br> leftism in America. She freely wrote a disturbing account of her<br> behavior with her little sister, one which could easily destroy the most<br> vital thing for a rabbit – her reputation and status. Yet her amygdala<br> could not map out the consequences of her actions, and now she is in a<br> perpetual amygdala hijack that she cannot escape.</br></br></br></br></br></p><p>Leftists are identical. They cannot map out the long-term<br> consequences of their actions. The amygdala hardware is just not there.<br> So they seek the pleasure of the moment, avoid any hardships – even<br> those which might yield benefit later if endured now. Eventually they<br> collapse the very governing structures they need to hide behind, to<br> shield themselves from reality. It is no surprise Dunham is a leftist<br> rabbit.</br></br></br></br></br></br></p></blockquote><p>Although one can reasonably be skeptical about AC’s r/K psychological model, it is both rhetorically useful and practically testable. It will be certainly be interesting to see how the theory plays out in terms of the Dunham molestation scandal.</p></div>",
  "content_text": "The Anonymous Conservative\nexplains The Dunham Horror\n:\nThe Lena Dunham saga is a good example of how amygdala development,\nor lack of it, can produce a human’s nature. In it, you see a woman who\ngrowing up had few if any instances of amygdala-developing stress, and\nwhose parents themselves seemed predisposed to amygdala atrophy. As a\nresult, she never developed boundaries on her behavior, because her\namygdala was never taught through adversity, “don’t do that.” Now, as an\nadult, she will always seek the easiest, least stressful path, and will\nlack the ability to map out the long term consequences of her actions.\nBecause she lacks the hardware, her brain actually sees a world without\nany consequences, and because she isn’t adapted to hardship, any\nhardship she walks into is traumatic beyond belief.\nIn many ways, her story is directly analogous to the broader issue of\nleftism in America. She freely wrote a disturbing account of her\nbehavior with her little sister, one which could easily destroy the most\nvital thing for a rabbit – her reputation and status. Yet her amygdala\ncould not map out the consequences of her actions, and now she is in a\nperpetual amygdala hijack that she cannot escape.\nLeftists are identical. They cannot map out the long-term\nconsequences of their actions. The amygdala hardware is just not there.\nSo they seek the pleasure of the moment, avoid any hardships – even\nthose which might yield benefit later if endured now. Eventually they\ncollapse the very governing structures they need to hide behind, to\nshield themselves from reality. It is no surprise Dunham is a leftist\nrabbit.\nAlthough one can reasonably be skeptical about AC’s r/K psychological model, it is both rhetorically useful and practically testable. It will be certainly be interesting to see how the theory plays out in terms of the Dunham molestation scandal.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-06T13:30:00+00:00"
}