{
  "url": "https://voxday.net/2014/11/01/mailvox-rts-are-not-strategy-games/",
  "scraped_at": "2025-12-16T12:33:21.891316",
  "title": "Mailvox: why C&C isn’t strategy",
  "date_display": "November 1, 2014",
  "date_iso": "2014-11-01T09:29:00+00:00",
  "date_from_url": "2014-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RD asks about strategy vs tactics:</p><blockquote class=\"tr_bq\"><p> I was browsing through some of your old columns on WND and came across<br> <a href=\"http://www.wnd.com/2008/06/67719/\">an article</a> where you mentioned that one of the premiere, defining games<br> of the RTS genre, Command &amp; Conquer, could could not actually be<br> described as a “strategy” game. You wrote:</br></br></br></p><p>“Like those video game<br> reviewers who insist on describing RTS games like Warcraft and Command<br> &amp; Conquer as “strategy” games, the media consistently confuses<br> tactics with strategy.”</br></br></br></p><p>Would<br> you care to elaborate on this point? As a long-time fan of the C&amp;C<br> series and the RTS genre, I am most curious to hear your justification<br> for distinguishing between tactics and strategy with respect to<br> describing RTS games. Also, what in your opinion is the best example of<br> an actual “strategy” RTS game?</br></br></br></br></br></p></blockquote><p>The difference between strategy and tactics is pretty clear. If you’re trying to win a war, it’s strategy. If you’re trying to win a battle, it’s tactics. Even Wikipedia is useful in this regard:</p><p><b>Strategy </b>(from Greek στρατηγία stratēgia, “art of troop leader; office of general, command, generalship”) is a high level plan to achieve one or more goals under conditions of uncertainty. In the sense of the “art of the general”, which included several subsets of skills including “tactics”, siegecraft, logistics etc., the term came into use in the 6th century C.E. in East Roman terminology, and was translated into Western vernacular languages only in the 18th century. From then until the 20th century, the word “strategy” came to denote “a comprehensive way to try to pursue political ends, including the threat or actual use of force, in a dialectic of wills” in a military conflict, in which both adversaries interact. The father of Western modern strategic study, Carl von Clausewitz, defined military strategy as “the employment of battles to gain the end of war.” B. H. Liddell Hart’s definition put less emphasis on battles, defining strategy as “the art of distributing and applying military means to fulfill the ends of policy”. Hence, both gave the pre-eminence to political aims over military goals.</p><p><b>Military tactics</b> are the science and art of organizing a military force, and the techniques for combining and using weapons and military units to engage and defeat an enemy in battle. Changes in philosophy and technology have been reflected in changes to military tactics; in contemporary military science tactics are the lowest of three planning levels: (i) strategic, (ii) operational, and (iii) tactical. The highest level of planning is strategy, how force is translated into political objectives, by bridging the means and ends of war. The intermediate level, operational level, the conversion of strategy into tactics deals with formations of units. In the vernacular, tactical decisions are those made to achieve the greatest, immediate value, and strategic decisions are those made to achieve the greatest, overall value, irrespective of the immediate results of a tactical decision.</p><p>That’s the formal distinction, and it should be fairly obvious that most RTS are intrinsically tactical in nature. But there is also another way of looking at it, which is the one I actually had in mind, which is that strategy implies thinking and planning, whereas tactics implies acting and responding. Most RTS games such as Warcraft and C&amp;C, involve considerably more of the latter than the former. Indeed, even if we disregard the fact of the old “grunt rush” tactic or the fact that success often boiled down to superior click speed, thanks to the “technology tree”, most RTS involve virtually no thinking or anything that can reasonably be described as strategy.</p><p>My old friend Chris, who has designed a few notable RTS games, is even quoted in the RTS article: “[My first attempt at visualizing RTSs in a fresh and interesting new way] was my realizing that although we call this genre ‘Real-Time Strategy,’ it should have been called ‘Real-Time Tactics’ with a dash of strategy thrown in.”</p><p>So, for both reasons, I don’t think it is possible for an RTS to be a proper strategy game. I actually designed an RTS, as it happens; the original WAR IN HEAVEN game was supposed to be an RTS. It would have been a lot better if we had gone that route too, but Valu-Soft wanted to chase Walmart with a DEER HUNTER-style game, which, as I have related in the past, backfired rather spectacularly when they foolishly hired the buyer who wanted it before the game was finished.</p></div>",
  "content_text": "RD asks about strategy vs tactics:\nI was browsing through some of your old columns on WND and came across\nan article\nwhere you mentioned that one of the premiere, defining games\nof the RTS genre, Command & Conquer, could could not actually be\ndescribed as a “strategy” game. You wrote:\n“Like those video game\nreviewers who insist on describing RTS games like Warcraft and Command\n& Conquer as “strategy” games, the media consistently confuses\ntactics with strategy.”\nWould\nyou care to elaborate on this point? As a long-time fan of the C&C\nseries and the RTS genre, I am most curious to hear your justification\nfor distinguishing between tactics and strategy with respect to\ndescribing RTS games. Also, what in your opinion is the best example of\nan actual “strategy” RTS game?\nThe difference between strategy and tactics is pretty clear. If you’re trying to win a war, it’s strategy. If you’re trying to win a battle, it’s tactics. Even Wikipedia is useful in this regard:\nStrategy\n(from Greek στρατηγία stratēgia, “art of troop leader; office of general, command, generalship”) is a high level plan to achieve one or more goals under conditions of uncertainty. In the sense of the “art of the general”, which included several subsets of skills including “tactics”, siegecraft, logistics etc., the term came into use in the 6th century C.E. in East Roman terminology, and was translated into Western vernacular languages only in the 18th century. From then until the 20th century, the word “strategy” came to denote “a comprehensive way to try to pursue political ends, including the threat or actual use of force, in a dialectic of wills” in a military conflict, in which both adversaries interact. The father of Western modern strategic study, Carl von Clausewitz, defined military strategy as “the employment of battles to gain the end of war.” B. H. Liddell Hart’s definition put less emphasis on battles, defining strategy as “the art of distributing and applying military means to fulfill the ends of policy”. Hence, both gave the pre-eminence to political aims over military goals.\nMilitary tactics\nare the science and art of organizing a military force, and the techniques for combining and using weapons and military units to engage and defeat an enemy in battle. Changes in philosophy and technology have been reflected in changes to military tactics; in contemporary military science tactics are the lowest of three planning levels: (i) strategic, (ii) operational, and (iii) tactical. The highest level of planning is strategy, how force is translated into political objectives, by bridging the means and ends of war. The intermediate level, operational level, the conversion of strategy into tactics deals with formations of units. In the vernacular, tactical decisions are those made to achieve the greatest, immediate value, and strategic decisions are those made to achieve the greatest, overall value, irrespective of the immediate results of a tactical decision.\nThat’s the formal distinction, and it should be fairly obvious that most RTS are intrinsically tactical in nature. But there is also another way of looking at it, which is the one I actually had in mind, which is that strategy implies thinking and planning, whereas tactics implies acting and responding. Most RTS games such as Warcraft and C&C, involve considerably more of the latter than the former. Indeed, even if we disregard the fact of the old “grunt rush” tactic or the fact that success often boiled down to superior click speed, thanks to the “technology tree”, most RTS involve virtually no thinking or anything that can reasonably be described as strategy.\nMy old friend Chris, who has designed a few notable RTS games, is even quoted in the RTS article: “[My first attempt at visualizing RTSs in a fresh and interesting new way] was my realizing that although we call this genre ‘Real-Time Strategy,’ it should have been called ‘Real-Time Tactics’ with a dash of strategy thrown in.”\nSo, for both reasons, I don’t think it is possible for an RTS to be a proper strategy game. I actually designed an RTS, as it happens; the original WAR IN HEAVEN game was supposed to be an RTS. It would have been a lot better if we had gone that route too, but Valu-Soft wanted to chase Walmart with a DEER HUNTER-style game, which, as I have related in the past, backfired rather spectacularly when they foolishly hired the buyer who wanted it before the game was finished.",
  "tags": [
    "games",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-01T09:29:00+00:00"
}