{
  "url": "https://voxday.net/2014/11/13/mozilla-slashes-its-own-throa/",
  "scraped_at": "2025-12-16T12:34:46.265961",
  "title": "Mozilla slashes its own throat",
  "date_display": "November 13, 2014",
  "date_iso": "2014-11-13T17:40:00+00:00",
  "date_from_url": "2014-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you haven’t migrated to Pale Moon yet, you’re going to want <a href=\"http://www.cnet.com/news/mozilla-officially-kicks-off-ads-in-firefox/\">to do so soon</a>:</p><blockquote class=\"tr_bq\"><p> The Firefox browser, lagging its well-heeled rivals, will soon be serving up an array of ads to one and all. Mozilla, the nonprofit group that develops and updates the popular Internet browser, said Thursday that it will begin placing ads where thumbnails of your frequently visited websites would normally be found when you open a new tab. While many of those thumbnails, which Firefox calls “Enhanced Tiles,” will remain as quick links to your favorite sites, some will feature sponsored logos or other promoted images.</p><p>The decision comes after a year-long experiment testing the receptivity of the ads among a small group of users.</p><p>The ads are a way for Mountain View, Calif.-based Mozilla to stay relevant at a time when more people are making use of Microsoft’s Internet Explorer and Google’s Chrome when browsing the Web. Mozilla hopes the sponsored tiles will help influence powerful advertising groups while not compromising its nonprofit values. The ads also represent a potential new revenue stream for Mozilla, which gets most of its funding from Google through a deal in which it is the default search engine.</p><p>“We see this as a meaningful contributor to Mozilla’s revenue,” Darren Herman, vice president of content services for Mozilla and the man behind the tile ads, said in an interview. “We’re using ourselves to demonstrate that it’s possible to advertise at a scale nobody else can.”</p><p>The initiative comes as Firefox continues to lose ground to its<br> rivals. According  to Net Applications, which measures individual users’<br> daily  Internet activity, IE is the top PC browser, with a 58 percent<br> share,  followed by Chrome at 21 percent and Firefox at 14 percent. Mozilla<br> plans to ramp up the ads over time, but even once that’s in full swing,<br> Herman said Mozilla will tread carefully with how it places those ads…. Among the first ads shown will be anti-tobacco messages and promotions for the new Edward Snowden biopic, “Citizenfour.”</br></br></br></br></br></p></blockquote><p>Once you go full SJW, there is no going back. It’s not going to be long before Firefox is below 10 percent. And once that happens, they may as well shut it down.</p></div>",
  "content_text": "If you haven’t migrated to Pale Moon yet, you’re going to want\nto do so soon\n:\nThe Firefox browser, lagging its well-heeled rivals, will soon be serving up an array of ads to one and all. Mozilla, the nonprofit group that develops and updates the popular Internet browser, said Thursday that it will begin placing ads where thumbnails of your frequently visited websites would normally be found when you open a new tab. While many of those thumbnails, which Firefox calls “Enhanced Tiles,” will remain as quick links to your favorite sites, some will feature sponsored logos or other promoted images.\nThe decision comes after a year-long experiment testing the receptivity of the ads among a small group of users.\nThe ads are a way for Mountain View, Calif.-based Mozilla to stay relevant at a time when more people are making use of Microsoft’s Internet Explorer and Google’s Chrome when browsing the Web. Mozilla hopes the sponsored tiles will help influence powerful advertising groups while not compromising its nonprofit values. The ads also represent a potential new revenue stream for Mozilla, which gets most of its funding from Google through a deal in which it is the default search engine.\n“We see this as a meaningful contributor to Mozilla’s revenue,” Darren Herman, vice president of content services for Mozilla and the man behind the tile ads, said in an interview. “We’re using ourselves to demonstrate that it’s possible to advertise at a scale nobody else can.”\nThe initiative comes as Firefox continues to lose ground to its\nrivals. According  to Net Applications, which measures individual users’\ndaily  Internet activity, IE is the top PC browser, with a 58 percent\nshare,  followed by Chrome at 21 percent and Firefox at 14 percent. Mozilla\nplans to ramp up the ads over time, but even once that’s in full swing,\nHerman said Mozilla will tread carefully with how it places those ads…. Among the first ads shown will be anti-tobacco messages and promotions for the new Edward Snowden biopic, “Citizenfour.”\nOnce you go full SJW, there is no going back. It’s not going to be long before Firefox is below 10 percent. And once that happens, they may as well shut it down.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-13T17:40:00+00:00"
}