{
  "url": "https://voxday.net/2014/11/13/of-sjws-and-echo-chambers/",
  "scraped_at": "2025-12-16T12:34:44.443484",
  "title": "Of SJWs and echo chambers",
  "date_display": "November 13, 2014",
  "date_iso": "2014-11-13T13:30:00+00:00",
  "date_from_url": "2014-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I’m a little surprised. Only #423 on <a href=\"http://www.theblockbot.com/?page_id=2\">the Level 2 SJW blocklist</a>? How can this be? DON’T THEY KNOW WHO I AM?</p><blockquote class=\"tr_bq\"><p> Who will be added to the block list? The short answer is anyone that a blocker defines as block list worthy. The general rule is if you are the type that would find yourself banned on a blog on Freethoughtblogs.com, Skepchick.org or from the A+ forum then you will likely end up in the list…</p></blockquote><p>And as I’ve noted, they operate solely at the rhetorical level. Their assertions and posturing are almost entirely devoid of any meaning beyond “me good, them bad”.</p><blockquote class=\"tr_bq\"><p> John Scalzi‏@scalzi<br> Oh, the transcendent irony of being accused by a GamerGater of living in an echo chamber.</br></p><p>John Scalzi‏@scalzi<br> Happy to say my Twitter feeds are full of brilliant, clever people, and that’s only partially because I mute the stupid, annoying jerks.</br></p></blockquote><p>Apparently John “I am a rapist” Scalzi not only doesn’t know what satire is, he doesn’t know what irony is either. Keep this typical SJW behavior in mind when they begin with their entryist tactics and start babbling about the importance of inclusivity, diversity, discourse and dialogue. Words don’t have any objective meaning to them, they merely mean whatever the SJW needs it to mean in order to achieve whatever goal he is pursuing.</p><p>It will do you no good to point out to the likes of Scalzi that he observably lives in an echo chamber of his active making. “Echo chamber” is merely a bad word, and being a bad word, therefore cannot be applied to the SJW and must be applied to his bad opponent, regardless of what it actually means. If you agree with them, you are by definition “brilliant and clever”, and if you disagree with them, or even worse, <i>criticize </i>them, you are intrinsically “stupid, annoying jerks”.</p><p>This is why they don’t dare to compete in any venue that is not “heads I win, tails you lose.”  And this is how they can attack a libertarian as being a “fascist’ or a black man for being a “white supremacist” without even a hint of intellectual embarrassment. Because, for them, neither words nor truth have any genuine meaning.</p></div>",
  "content_text": "I have to admit, I’m a little surprised. Only #423 on\nthe Level 2 SJW blocklist\n? How can this be? DON’T THEY KNOW WHO I AM?\nWho will be added to the block list? The short answer is anyone that a blocker defines as block list worthy. The general rule is if you are the type that would find yourself banned on a blog on Freethoughtblogs.com, Skepchick.org or from the A+ forum then you will likely end up in the list…\nAnd as I’ve noted, they operate solely at the rhetorical level. Their assertions and posturing are almost entirely devoid of any meaning beyond “me good, them bad”.\nJohn Scalzi‏@scalzi\nOh, the transcendent irony of being accused by a GamerGater of living in an echo chamber.\nJohn Scalzi‏@scalzi\nHappy to say my Twitter feeds are full of brilliant, clever people, and that’s only partially because I mute the stupid, annoying jerks.\nApparently John “I am a rapist” Scalzi not only doesn’t know what satire is, he doesn’t know what irony is either. Keep this typical SJW behavior in mind when they begin with their entryist tactics and start babbling about the importance of inclusivity, diversity, discourse and dialogue. Words don’t have any objective meaning to them, they merely mean whatever the SJW needs it to mean in order to achieve whatever goal he is pursuing.\nIt will do you no good to point out to the likes of Scalzi that he observably lives in an echo chamber of his active making. “Echo chamber” is merely a bad word, and being a bad word, therefore cannot be applied to the SJW and must be applied to his bad opponent, regardless of what it actually means. If you agree with them, you are by definition “brilliant and clever”, and if you disagree with them, or even worse,\ncriticize\nthem, you are intrinsically “stupid, annoying jerks”.\nThis is why they don’t dare to compete in any venue that is not “heads I win, tails you lose.”  And this is how they can attack a libertarian as being a “fascist’ or a black man for being a “white supremacist” without even a hint of intellectual embarrassment. Because, for them, neither words nor truth have any genuine meaning.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-13T13:30:00+00:00"
}