{
  "url": "https://voxday.net/2014/11/11/prophecy-has-its-privileges/",
  "scraped_at": "2025-12-16T12:34:31.999250",
  "title": "Prophecy has its privileges",
  "date_display": "November 11, 2014",
  "date_iso": "2014-11-11T18:45:00+00:00",
  "date_from_url": "2014-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I didn’t even know <a href=\"http://www.telegraph.co.uk/news/worldnews/northamerica/usa/11223347/Mormon-church-finally-admits-founder-Joseph-Smith-was-polygamist-with-40-wives.html\">this was an issue</a>:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> The Mormon founder Joseph Smith married as many as 40 women, including a<br> 14-year-old girl, church leaders have acknowledged for the first time in a<br> surprising revelation about their most important prophet. Although the Mormon church was closely associated with polygamy during its<br> first decades, its teachings had previously portrayed Smith as happily<br> married to one woman. The reality was apparently very different from that monogamous picture. And<br> with increasing speculation circulating on the internet about his marital<br> history, the Church hierarchy has revealed Smith as a prolific polygamist<br> via an essay posted on its website.</br></br></br></br></br></br></br></div></blockquote><p>Anyhow, congratulations to the church hierarchy for deciding that truth is better than falsehoods and propaganda. Better late than never.</p></div>",
  "content_text": "I have to admit, I didn’t even know\nthis was an issue\n:\nThe Mormon founder Joseph Smith married as many as 40 women, including a\n14-year-old girl, church leaders have acknowledged for the first time in a\nsurprising revelation about their most important prophet. Although the Mormon church was closely associated with polygamy during its\nfirst decades, its teachings had previously portrayed Smith as happily\nmarried to one woman. The reality was apparently very different from that monogamous picture. And\nwith increasing speculation circulating on the internet about his marital\nhistory, the Church hierarchy has revealed Smith as a prolific polygamist\nvia an essay posted on its website.\nAnyhow, congratulations to the church hierarchy for deciding that truth is better than falsehoods and propaganda. Better late than never.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-11T18:45:00+00:00"
}