{
  "url": "https://voxday.net/2014/11/24/pz-myers-changes-his-story/",
  "scraped_at": "2025-12-16T12:36:01.877389",
  "title": "PZ Myers sabotaged an investigation",
  "date_display": "November 24, 2014",
  "date_iso": "2014-11-24T09:14:00+00:00",
  "date_from_url": "2014-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s vastly amusing to see how the alleged sexual harasser/adulterer/rapist PZ Myers responds <a href=\"http://www.michaelnugent.com/2014/11/24/pz-myers-updates-story-threatened-false-rape-allegation/\">when he is treated the way he frequently treats others</a>. And it is also worth noting that he has ignored five of the six examples cited that show him, by his own standards, to be a sexist. Not only has his story about being falsely accused of rape, among other things, changed multiple times, but it amounts to a public confession that, in the words of one commenter, he “deliberately sabotaged any chance of any investigation being conducted in line with official university policy.”</p><blockquote class=\"tr_bq\"><p> PZ Myers has responded to part of my recent post about what would happen if he judged others’ sexism as he judges himself. He responded in a comment on his blog, complete with his now familiar personal abuse (he calls me a fuckhead, an asshole and a demented fuckwit) and misrepresentations of what I have written (he mistakenly says that my report of his own words on his own blog were “straight from the slymepit”, and he mistakenly says that I claimed what he did was sexist).</p><p>In his response, PZ ignored five of the six examples that I gave of behaviour by him that other people might consider sexist if they used PZ’s own standards — telling a conference host to do her belly dance and to get off his stage as he has work to do, linking to pornography involving women and octopuses, writing about a dream in which he turned his students into mermaids, publicly joking about rape, and endorsing a pornographic book that includes rape fantasies.</p><p>Instead he has focused only on my report of his own story about a student threatening to make a false rape allegation against him. He has written several times about this since 2010, and I am assuming that everything that he has written about it is true. He has now made two new assertions about the incident.</p><p>Firstly, PZ now says that he went to the chair “to invite an open investigation”, not to prevent one. Previously he had written that he “had to work fast” because “it could get dragged out into an investigation that would easily destroy my career,” and also that the woman had not gone to the authorities because he had brought in witnesses “to make her effort futile.”</p><p>Secondly, PZ now describes the investigation and says that he followed proper procedure. Previously he had written that this involved only the student, and not PZ himself, being questioned for only ten minutes about the severity of her accusation. I compare this below with the University of Minnesota’s official procedures for dealing with incidents of sexual assault and sexual harassment.</p></blockquote><p>The inconsistencies in the various accounts are telling, although not necessarily damning of anything but shameless hypocrisy. As I have repeatedly observed, PZ Myers is simply not very intelligent. You may recall how he did not know that not all human beings are equally <i>Homo sapiens sapiens</i> despite his PhD in biology, now he can’t even recognize when his own words are being directly quoted back to him. No wonder his readership has been consistently falling; he has nothing intelligent to say, he can’t take the heat of criticism, he has a confirmed inability to engage in discourse at the dialectical level, and he lined up behind the SJWs of Atheism+ against most of his fellow atheists.</p><p>It is, of course, not at all surprising to see PZ misrepresenting what someone else has written, although I no longer think it is safe to assume that he is doing so intentionally. These days, it is more logical to conclude that he’s simply not smart enough to correctly understand and summarize what someone else has written.</p><p>One former Pharyngulan has an interesting theory:</p><blockquote class=\"tr_bq\"><p> I remember how he’s described his father and grandfather and how<br> behaves very much the same.   Different core values.  But the behavior<br> is extremely similar to the behavior of those two role-models he has<br> castigated in the past. In any case, I washed my hands of him and his blog years ago.   I’m<br> not interested in being part of a toxic ‘in-group’ that has abandoned<br> skepticism, rationality, manners and the ability to think for oneself.</br></br></br></br></br></p></blockquote><p>One would think an evolutionary biologist, of all people, would recognize the limits of one’s willpower to surmount the limits of one’s genetics and upbringing. And finally, just to observer the Fowl Atheist’s shameless hypocrisy, consider the following statements:</p><p><i>“asshole Nugent is happily embracing slymepit lies and distortions to claim that what I did was sexist? Disgusting. He’s become a demented fuckwit.”</i><br> – PZ Myers</br></p><p><i>“Actually, I hate the word ‘moron’ used as an insult, thank you very much…. I don’t like the word “moron” and wish we would all use something else<br> non-ableist to express our disbelief at a person’s sheer wrongness.”</br></i><br> – PZ Myers</br></p><p>So, “demented fuckwit” is non-ableist?</p></div>",
  "content_text": "It’s vastly amusing to see how the alleged sexual harasser/adulterer/rapist PZ Myers responds\nwhen he is treated the way he frequently treats others\n. And it is also worth noting that he has ignored five of the six examples cited that show him, by his own standards, to be a sexist. Not only has his story about being falsely accused of rape, among other things, changed multiple times, but it amounts to a public confession that, in the words of one commenter, he “deliberately sabotaged any chance of any investigation being conducted in line with official university policy.”\nPZ Myers has responded to part of my recent post about what would happen if he judged others’ sexism as he judges himself. He responded in a comment on his blog, complete with his now familiar personal abuse (he calls me a fuckhead, an asshole and a demented fuckwit) and misrepresentations of what I have written (he mistakenly says that my report of his own words on his own blog were “straight from the slymepit”, and he mistakenly says that I claimed what he did was sexist).\nIn his response, PZ ignored five of the six examples that I gave of behaviour by him that other people might consider sexist if they used PZ’s own standards — telling a conference host to do her belly dance and to get off his stage as he has work to do, linking to pornography involving women and octopuses, writing about a dream in which he turned his students into mermaids, publicly joking about rape, and endorsing a pornographic book that includes rape fantasies.\nInstead he has focused only on my report of his own story about a student threatening to make a false rape allegation against him. He has written several times about this since 2010, and I am assuming that everything that he has written about it is true. He has now made two new assertions about the incident.\nFirstly, PZ now says that he went to the chair “to invite an open investigation”, not to prevent one. Previously he had written that he “had to work fast” because “it could get dragged out into an investigation that would easily destroy my career,” and also that the woman had not gone to the authorities because he had brought in witnesses “to make her effort futile.”\nSecondly, PZ now describes the investigation and says that he followed proper procedure. Previously he had written that this involved only the student, and not PZ himself, being questioned for only ten minutes about the severity of her accusation. I compare this below with the University of Minnesota’s official procedures for dealing with incidents of sexual assault and sexual harassment.\nThe inconsistencies in the various accounts are telling, although not necessarily damning of anything but shameless hypocrisy. As I have repeatedly observed, PZ Myers is simply not very intelligent. You may recall how he did not know that not all human beings are equally\nHomo sapiens sapiens\ndespite his PhD in biology, now he can’t even recognize when his own words are being directly quoted back to him. No wonder his readership has been consistently falling; he has nothing intelligent to say, he can’t take the heat of criticism, he has a confirmed inability to engage in discourse at the dialectical level, and he lined up behind the SJWs of Atheism+ against most of his fellow atheists.\nIt is, of course, not at all surprising to see PZ misrepresenting what someone else has written, although I no longer think it is safe to assume that he is doing so intentionally. These days, it is more logical to conclude that he’s simply not smart enough to correctly understand and summarize what someone else has written.\nOne former Pharyngulan has an interesting theory:\nI remember how he’s described his father and grandfather and how\nbehaves very much the same.   Different core values.  But the behavior\nis extremely similar to the behavior of those two role-models he has\ncastigated in the past. In any case, I washed my hands of him and his blog years ago.   I’m\nnot interested in being part of a toxic ‘in-group’ that has abandoned\nskepticism, rationality, manners and the ability to think for oneself.\nOne would think an evolutionary biologist, of all people, would recognize the limits of one’s willpower to surmount the limits of one’s genetics and upbringing. And finally, just to observer the Fowl Atheist’s shameless hypocrisy, consider the following statements:\n“asshole Nugent is happily embracing slymepit lies and distortions to claim that what I did was sexist? Disgusting. He’s become a demented fuckwit.”\n– PZ Myers\n“Actually, I hate the word ‘moron’ used as an insult, thank you very much…. I don’t like the word “moron” and wish we would all use something else\nnon-ableist to express our disbelief at a person’s sheer wrongness.”\n– PZ Myers\nSo, “demented fuckwit” is non-ableist?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-24T09:14:00+00:00"
}