{
  "url": "https://voxday.net/2014/11/05/republican-house-republican-senate/",
  "scraped_at": "2025-12-16T12:33:45.536827",
  "title": "Republican House, Republican Senate",
  "date_display": "November 5, 2014",
  "date_iso": "2014-11-05T09:09:00+00:00",
  "date_from_url": "2014-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would be nice if the Republicans would attempt to do more with their newly won Congressional power than they did the last time they held both House and Senate, but given their objectives, I have no expectation whatsoever that they’ll even do something as trivial as overturn Obamacare. Indeed, I rather expect them to dig the hole deeper. <a href=\"http://news.yahoo.com/us-republicans-eye-senate-control-close-midterm-vote-203204347.html\">Consider the words</a> of the new Senate Majority Leader, Mitch McConnell:</p><blockquote class=\"tr_bq\"><p> “This experiment in big government has lasted long enough. It’s time to go in a new direction,” McConnell boomed to supporters in his victory speech. But he sounded a conciliatory note as well, adding that while he and the president rarely see eye to eye, “we do have an obligation to work together on issues where we can agree.”</p><p>“It’s time for government to start getting results and implementing<br> solutions to the challenges facing our country, starting with our<br> still-struggling economy,” [House Majority Leader] Boehner added.</br></br></p></blockquote><p>Translation: immigration amnesty and free trade. From the same article:</p><blockquote class=\"tr_bq\"><p> While Republicans are likely to cooperate on issues like tax reform, the<br> party will seek to breathe life into their stalled jobs bills, to gain<br> approval of the delayed Keystone XL pipeline, roll back some carbon<br> emission regulations and tweak Obamacare.</br></br></br></p></blockquote><p>Well, that’s certainly an ambitious program that is all but guaranteed to completely turn things around, isn’t it? It’s fascinating how they’ve managed to completely evade addressing every single aspect of American decline.</p><p>And on a blog note, I can only observe that we need some saner trolls. It appears Ann Morgan is even less connected to objective reality than one would have assumed: <i>“Hahahaha. Total democrat victory tonight proves my point is correct.”</i></p><p>Yeah, so, about that…. The constant laughter of the SJW isn’t, as they think it to be, the confident amusement of the superior being at the antics of his lessers. It’s the cackling of unhinged madness.</p></div>",
  "content_text": "It would be nice if the Republicans would attempt to do more with their newly won Congressional power than they did the last time they held both House and Senate, but given their objectives, I have no expectation whatsoever that they’ll even do something as trivial as overturn Obamacare. Indeed, I rather expect them to dig the hole deeper.\nConsider the words\nof the new Senate Majority Leader, Mitch McConnell:\n“This experiment in big government has lasted long enough. It’s time to go in a new direction,” McConnell boomed to supporters in his victory speech. But he sounded a conciliatory note as well, adding that while he and the president rarely see eye to eye, “we do have an obligation to work together on issues where we can agree.”\n“It’s time for government to start getting results and implementing\nsolutions to the challenges facing our country, starting with our\nstill-struggling economy,” [House Majority Leader] Boehner added.\nTranslation: immigration amnesty and free trade. From the same article:\nWhile Republicans are likely to cooperate on issues like tax reform, the\nparty will seek to breathe life into their stalled jobs bills, to gain\napproval of the delayed Keystone XL pipeline, roll back some carbon\nemission regulations and tweak Obamacare.\nWell, that’s certainly an ambitious program that is all but guaranteed to completely turn things around, isn’t it? It’s fascinating how they’ve managed to completely evade addressing every single aspect of American decline.\nAnd on a blog note, I can only observe that we need some saner trolls. It appears Ann Morgan is even less connected to objective reality than one would have assumed:\n“Hahahaha. Total democrat victory tonight proves my point is correct.”\nYeah, so, about that…. The constant laughter of the SJW isn’t, as they think it to be, the confident amusement of the superior being at the antics of his lessers. It’s the cackling of unhinged madness.",
  "tags": [
    "decline and fall",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-05T09:09:00+00:00"
}