{
  "url": "https://voxday.net/2014/11/22/sff-before-coup/",
  "scraped_at": "2025-12-16T12:35:52.682861",
  "title": "SF/F before the coup",
  "date_display": "November 22, 2014",
  "date_iso": "2014-11-22T17:00:00+00:00",
  "date_from_url": "2014-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel wrote an interesting post about <a href=\"http://www.castaliahouse.com/chatter-before-the-coup-1991-and-the-future-state-of-science-fiction/\">the pre-pinkshirt state of science fiction</a> at Castalia:</p><blockquote class=\"tr_bq\"><p> By 1995 or so, it had become fairly evident that the science fiction market had begun to experience a significant shift, one that I have been struggling to put my finger on for quite some time now.</p><p>The genre, of course, has always been one for whom change at a certain level should be something of a constant. The Romance genre (not the chivalric or ancient. I mean the “girl picks one of two boys” sort.) has remained the same since 1921’s The Black Moth, but Science Fiction (not the current “girl picks one of two boys” sort, but the traditional “having something to do with phenomena”) necessarily must adapt to any new knowledge….</p><p>In October of 1991, SF editor and reviewer, and senior editor at Omni, Robert J. Kilheffer did the world a favor by attempting a fairly comprehensive “State of the Genre” report in Publisher’s Weekly, titled Science Fiction: Expanding, Experimenting.</p></blockquote><p>It’s interesting to see some of the comments from familiar names that we now know to have been responsible, in part, for the ongoing decline into necrobestiality and wereseal romance. I didn’t consciously notice the change until the award of the 2002 Nebula to Catharine Asaro’s ridiculous <i>The Quantum Rose</i> made me notice it, but looking back at the old Nebula winners, there is a definite point in 1988, when a nobody with a nothing novel that no one remembers beat Greg Bear, Gene Wolfe, David Brin, Avram Davidson, and George Alec Effinger, followed by Lois McMaster Bujold beating Gibson, Card, and Wolfe in 1989 (a less ludicrous result, but unjustifiable nevertheless), shows that the rot had set in.</p><p>Just for amusement’s sake, here is the description of the 1988 Nebula Award winner for Best Novel.</p><p><i>Elizabeth Butler is an archaeologist, and the author of several popular books that challenge her colleagues’ ideas about Mayan civilization. Elizabeth has a strange gift, connected to a suicide attempt as a young woman, which allows her to see the spirits of ancient people while she walks at dusk and dawn. The story opens with Elizabeth in the middle of an eight-week field study at Dzibilchaltún. Her team hopes to find dramatic artifacts that will spark interest and increased funding for future field studies at the site.</i></p><p>In the middle of the field study, Elizabeth’s estranged adult daughter Diane arrives unannounced. After the death of her father, Elizabeth’s ex-husband, Diane suddenly abandoned her life in the United States, and flew to Mexico to see her mother. It’s revealed that Diane has seen Elizabeth for only a few brief visits since Elizabeth left her as a young child to be raised by her father. Neither is sure what Diane wants from Elizabeth.</p><p>As the two struggle to connect, Elizabeth has a new experience: one of her spirit visions, a Mayan priestess named Zuhuy-kak, can see and speak with Elizabeth. Zuhuy-kak provides unprecedented knowledge about the Mayans’ departure from Dzibilchaltún, and leads Elizabeth to the major archaeological find her team needs, but demands a sacrifice to the goddess Ix Chebel Yax. As the dig progresses, haunted by bad luck and tragedy, Zuhuy-kak makes it clear that Elizabeth must sacrifice her daughter. </p><p>Of course, were this novel written today, Elizabeth would sacrifice her daughter without thinking twice about it and the plot would instead revolve around which of her two lesbian lovers Elizabeth would choose to marry in a civil ceremony in Mexico City, Zuhuy-kak or Ix Chebel Yax. It is perhaps worth observing that this “fantasy masterwork”, published in 1986,  presently has 28 reviews averaging 4.0, is out of print, and is ranked 1,640,443 on Amazon.</p><p>Interestingly enough, one reviewer observed back in 2005: <i>“This Novel is NOT Science Fiction and is a mundane novel as well. This novel should NOT have won the award for what was called the best science fiction novel. 1987, the year of this novel, is thus the start of the Feminist takeover of the Science Fiction Writers of America (SFWA), now called the Science fiction and FANTASY Writers of America.”</i></p></div>",
  "content_text": "Daniel wrote an interesting post about\nthe pre-pinkshirt state of science fiction\nat Castalia:\nBy 1995 or so, it had become fairly evident that the science fiction market had begun to experience a significant shift, one that I have been struggling to put my finger on for quite some time now.\nThe genre, of course, has always been one for whom change at a certain level should be something of a constant. The Romance genre (not the chivalric or ancient. I mean the “girl picks one of two boys” sort.) has remained the same since 1921’s The Black Moth, but Science Fiction (not the current “girl picks one of two boys” sort, but the traditional “having something to do with phenomena”) necessarily must adapt to any new knowledge….\nIn October of 1991, SF editor and reviewer, and senior editor at Omni, Robert J. Kilheffer did the world a favor by attempting a fairly comprehensive “State of the Genre” report in Publisher’s Weekly, titled Science Fiction: Expanding, Experimenting.\nIt’s interesting to see some of the comments from familiar names that we now know to have been responsible, in part, for the ongoing decline into necrobestiality and wereseal romance. I didn’t consciously notice the change until the award of the 2002 Nebula to Catharine Asaro’s ridiculous\nThe Quantum Rose\nmade me notice it, but looking back at the old Nebula winners, there is a definite point in 1988, when a nobody with a nothing novel that no one remembers beat Greg Bear, Gene Wolfe, David Brin, Avram Davidson, and George Alec Effinger, followed by Lois McMaster Bujold beating Gibson, Card, and Wolfe in 1989 (a less ludicrous result, but unjustifiable nevertheless), shows that the rot had set in.\nJust for amusement’s sake, here is the description of the 1988 Nebula Award winner for Best Novel.\nElizabeth Butler is an archaeologist, and the author of several popular books that challenge her colleagues’ ideas about Mayan civilization. Elizabeth has a strange gift, connected to a suicide attempt as a young woman, which allows her to see the spirits of ancient people while she walks at dusk and dawn. The story opens with Elizabeth in the middle of an eight-week field study at Dzibilchaltún. Her team hopes to find dramatic artifacts that will spark interest and increased funding for future field studies at the site.\nIn the middle of the field study, Elizabeth’s estranged adult daughter Diane arrives unannounced. After the death of her father, Elizabeth’s ex-husband, Diane suddenly abandoned her life in the United States, and flew to Mexico to see her mother. It’s revealed that Diane has seen Elizabeth for only a few brief visits since Elizabeth left her as a young child to be raised by her father. Neither is sure what Diane wants from Elizabeth.\nAs the two struggle to connect, Elizabeth has a new experience: one of her spirit visions, a Mayan priestess named Zuhuy-kak, can see and speak with Elizabeth. Zuhuy-kak provides unprecedented knowledge about the Mayans’ departure from Dzibilchaltún, and leads Elizabeth to the major archaeological find her team needs, but demands a sacrifice to the goddess Ix Chebel Yax. As the dig progresses, haunted by bad luck and tragedy, Zuhuy-kak makes it clear that Elizabeth must sacrifice her daughter.\nOf course, were this novel written today, Elizabeth would sacrifice her daughter without thinking twice about it and the plot would instead revolve around which of her two lesbian lovers Elizabeth would choose to marry in a civil ceremony in Mexico City, Zuhuy-kak or Ix Chebel Yax. It is perhaps worth observing that this “fantasy masterwork”, published in 1986,  presently has 28 reviews averaging 4.0, is out of print, and is ranked 1,640,443 on Amazon.\nInterestingly enough, one reviewer observed back in 2005:\n“This Novel is NOT Science Fiction and is a mundane novel as well. This novel should NOT have won the award for what was called the best science fiction novel. 1987, the year of this novel, is thus the start of the Feminist takeover of the Science Fiction Writers of America (SFWA), now called the Science fiction and FANTASY Writers of America.”",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-22T17:00:00+00:00"
}