{
  "url": "https://voxday.net/2014/11/10/sjws-devour-themselves/",
  "scraped_at": "2025-12-16T12:34:24.699403",
  "title": "SJWs devour themselves",
  "date_display": "November 10, 2014",
  "date_iso": "2014-11-10T18:18:00+00:00",
  "date_from_url": "2014-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia is vastly amused by <a href=\"http://monsterhunternation.com/2014/11/10/sjw-cannibal-feeding-frenzy/\">the spectacle of SFWA turning on an Campbell Award-nominated Asian lesbian</a>:</p><blockquote class=\"tr_bq\"><p> Apparently a member of the literati SJW army—and super prestigious Campbell nominee for BEST NEW WRITER—has turned out to be a huge internet troll, with a bunch of aliases, attacking and tormenting people. Of course, those of you who read this blog or followed Sad Puppies are like, duh… They attack and torment Larry, and anybody who agrees with him nonstop, but not my friends… Benjanun Sriduangkaew did the unthinkable and used their regular SJW tactics of threats, insults, intimidation, and career sabotage against fellow SJWs, and that is super badthink!</p><p>Now, when you threaten, intimidate, troll, and try to sabotage the career of anybody who disagrees with the Social Justice narrative, then that is doubleplus good!</p><p>The SJWs are perfectly aware of their hypocrisy. They talk about how<br> Sriduangkaew was praised for “punching up”, meaning that it was okay for<br> her to use these tactics against non-members. Threaten somebody of the<br> correct sex and race, cool. Threaten somebody of the wrong sex and race,<br> bad. If you have a brain, you will find that sexist or racist, but you<br> are not thinking like a proper SJW. Anything they say isn’t sexist or<br> racist, but anything we do is. Simple.</br></br></br></br></br></br></p></blockquote><p>As I’ve repeatedly warned, pointing out SJW hypocrisy is meaningless to any SJW. They aren’t dialectic. They aren’t rational or coherent. And deprived of any non-rabbits to attack, they naturally turn on each other. The funniest thing is, of course, that Benjanun Sriduangkaew was entirely correct to be cruelly dismissive of the likes of Jemisin and Rothfuss. At her best, Jemisin is mediocre; Rothfuss is painfully unreadable. He’s the Britney Spears of SF/F. I tried reading <i>The Name of My Rose-Scented Wind</i> or whatever it is called once when I was on the road and found myself turning to an Avalon Hill rulebook I’d previously read because it was more interesting. Rothfuss’s achievement is creating the only protagonist you would murder if forced to choose between him and Rand al’Thor. Larry also addressed #GamerGate:</p><blockquote class=\"tr_bq\"><p> This is one reason I’ve been enjoying the hell out of GamerGate. First,<br> it has been awesome having a great big group of people witness the same<br> bullshit that my industry has been dealing with for years. Second, SF/F<br> people tend to be squishy and polite, with a handful of outspoken<br> outliers like me and the rest of the Evil League of Evil, so SJWs have<br> run roughshod over my industry… But gamers? Holy shit. You really think<br> you can pick a fight with people whose brains are programmed to win?<br> Gamers will outlast, outthink, and outfight the SJWs. Tell a Gamer that<br> there is loot or XP in it, and he’ll grind SJWs to the grave.</br></br></br></br></br></br></br></br></p></blockquote><p>That’s what SFWA never understood about me when they couldn’t figure out why I didn’t humbly lower my head and slink off the way a good rabbit who has been rejected by the warren is supposed to vanish. I’ve always been a gamer and a game developer first and foremost. It was more likely that I would go methodically through the entire SFWA directory like Michael Myers with literary taste than to even think about submitting to those ghastly little creatures. The thought literally never crossed my mind. The anti-GamerGate SJWs are making exactly the same mistake.</p></div>",
  "content_text": "Larry Correia is vastly amused by\nthe spectacle of SFWA turning on an Campbell Award-nominated Asian lesbian\n:\nApparently a member of the literati SJW army—and super prestigious Campbell nominee for BEST NEW WRITER—has turned out to be a huge internet troll, with a bunch of aliases, attacking and tormenting people. Of course, those of you who read this blog or followed Sad Puppies are like, duh… They attack and torment Larry, and anybody who agrees with him nonstop, but not my friends… Benjanun Sriduangkaew did the unthinkable and used their regular SJW tactics of threats, insults, intimidation, and career sabotage against fellow SJWs, and that is super badthink!\nNow, when you threaten, intimidate, troll, and try to sabotage the career of anybody who disagrees with the Social Justice narrative, then that is doubleplus good!\nThe SJWs are perfectly aware of their hypocrisy. They talk about how\nSriduangkaew was praised for “punching up”, meaning that it was okay for\nher to use these tactics against non-members. Threaten somebody of the\ncorrect sex and race, cool. Threaten somebody of the wrong sex and race,\nbad. If you have a brain, you will find that sexist or racist, but you\nare not thinking like a proper SJW. Anything they say isn’t sexist or\nracist, but anything we do is. Simple.\nAs I’ve repeatedly warned, pointing out SJW hypocrisy is meaningless to any SJW. They aren’t dialectic. They aren’t rational or coherent. And deprived of any non-rabbits to attack, they naturally turn on each other. The funniest thing is, of course, that Benjanun Sriduangkaew was entirely correct to be cruelly dismissive of the likes of Jemisin and Rothfuss. At her best, Jemisin is mediocre; Rothfuss is painfully unreadable. He’s the Britney Spears of SF/F. I tried reading\nThe Name of My Rose-Scented Wind\nor whatever it is called once when I was on the road and found myself turning to an Avalon Hill rulebook I’d previously read because it was more interesting. Rothfuss’s achievement is creating the only protagonist you would murder if forced to choose between him and Rand al’Thor. Larry also addressed #GamerGate:\nThis is one reason I’ve been enjoying the hell out of GamerGate. First,\nit has been awesome having a great big group of people witness the same\nbullshit that my industry has been dealing with for years. Second, SF/F\npeople tend to be squishy and polite, with a handful of outspoken\noutliers like me and the rest of the Evil League of Evil, so SJWs have\nrun roughshod over my industry… But gamers? Holy shit. You really think\nyou can pick a fight with people whose brains are programmed to win?\nGamers will outlast, outthink, and outfight the SJWs. Tell a Gamer that\nthere is loot or XP in it, and he’ll grind SJWs to the grave.\nThat’s what SFWA never understood about me when they couldn’t figure out why I didn’t humbly lower my head and slink off the way a good rabbit who has been rejected by the warren is supposed to vanish. I’ve always been a gamer and a game developer first and foremost. It was more likely that I would go methodically through the entire SFWA directory like Michael Myers with literary taste than to even think about submitting to those ghastly little creatures. The thought literally never crossed my mind. The anti-GamerGate SJWs are making exactly the same mistake.",
  "tags": [
    "books",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-10T18:18:00+00:00"
}