{
  "url": "https://voxday.net/2014/11/12/sjws-are-gramscian-culture-warriors/",
  "scraped_at": "2025-12-16T12:34:39.289960",
  "title": "SJWs are Gramscian culture warriors",
  "date_display": "November 12, 2014",
  "date_iso": "2014-11-12T17:00:00+00:00",
  "date_from_url": "2014-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which esr points out that<a href=\"http://esr.ibiblio.org/?p=260\"> SJW tactics are the same</a> as those utilized by the Nazis and the Communists before them:</p><blockquote class=\"tr_bq\"><p> Americans have never really understood ideological warfare. Our gut-level assumption is that everybody in the world really wants the same comfortable material success we have. We use “extremist” as a negative epithet. Even the few fanatics and revolutionary idealists we have, whatever their political flavor, expect everybody else to behave like a bourgeois.</p><p>We don’t expect ideas to matter — or, when they do, we expect them to matter only because people have been flipped into a vulnerable mode by repression or poverty. Thus all our divagation about the “root causes” of Islamic terrorism, as if the terrorists’ very clear and very ideological account of their own theory and motivations is somehow not to be believed.</p><p>By contrast, ideological and memetic warfare has been a favored tactic for all of America’s three great adversaries of the last hundred years — Nazis, Communists, and Islamists….</p><p>I think there is still an excellent chance that the West can recover<br> from suicidalism without going through a fevered fascist episode and<br> waging a genocidal war. But to do so, we have to do more than recognize<br> Stalin’s memes; we have to reject them.  We have to eject postmodern<br> leftism from our universities, transnational progressivism from our<br> politics, and volk-Marxism from our media.</br></br></br></br></br></p><p>The process won’t be pretty.  But I fear that if the rest of us don’t<br> hound the po-mo Left and its useful idiots out of public life with<br> attack and ridicule and shunning, the hard Right will sooner or later<br> get the power to do it by means that include a lot of killing. I don’t<br> want to live in that future, and I don’t think any of my readers do,<br> either.  If we want to save a liberal, tolerant civilization for our<br> children, we’d better get to work.</br></br></br></br></br></br></p></blockquote><p>Esr is addressing the danger posed by Islam here, not SJWs, and he’s talking about the entire West rather than the assault on the game industry but he’s describing the same tactics derived from the same playbook as part of the same anti-Western cultural war.</p><p>I have little doubt that he is right. Many, if not most, #GamerGaters would rather drink the blood of every single SJW than submit to them. In the same vein, many Americans would rather see a ruthless pro-white, pro-Western government led by the hard-eyed likes of Vladimir Putin than watch their nation continue to vanish in a swarm of third world immigration. The Left, for all their drama queen antics, doesn’t realize how many Men of the West are never, ever going to submit to them.</p><p>And if the sweet reason of the esr’s prove impotent, the Breiviks will rise. Esr thought, back in 2006, that there was an excellent chance the West can recover from the intellectual disease without violence. Eight years later, in 2014, I am considerably less sanguine about those odds.</p></div>",
  "content_text": "In which esr points out that\nSJW tactics are the same\nas those utilized by the Nazis and the Communists before them:\nAmericans have never really understood ideological warfare. Our gut-level assumption is that everybody in the world really wants the same comfortable material success we have. We use “extremist” as a negative epithet. Even the few fanatics and revolutionary idealists we have, whatever their political flavor, expect everybody else to behave like a bourgeois.\nWe don’t expect ideas to matter — or, when they do, we expect them to matter only because people have been flipped into a vulnerable mode by repression or poverty. Thus all our divagation about the “root causes” of Islamic terrorism, as if the terrorists’ very clear and very ideological account of their own theory and motivations is somehow not to be believed.\nBy contrast, ideological and memetic warfare has been a favored tactic for all of America’s three great adversaries of the last hundred years — Nazis, Communists, and Islamists….\nI think there is still an excellent chance that the West can recover\nfrom suicidalism without going through a fevered fascist episode and\nwaging a genocidal war. But to do so, we have to do more than recognize\nStalin’s memes; we have to reject them.  We have to eject postmodern\nleftism from our universities, transnational progressivism from our\npolitics, and volk-Marxism from our media.\nThe process won’t be pretty.  But I fear that if the rest of us don’t\nhound the po-mo Left and its useful idiots out of public life with\nattack and ridicule and shunning, the hard Right will sooner or later\nget the power to do it by means that include a lot of killing. I don’t\nwant to live in that future, and I don’t think any of my readers do,\neither.  If we want to save a liberal, tolerant civilization for our\nchildren, we’d better get to work.\nEsr is addressing the danger posed by Islam here, not SJWs, and he’s talking about the entire West rather than the assault on the game industry but he’s describing the same tactics derived from the same playbook as part of the same anti-Western cultural war.\nI have little doubt that he is right. Many, if not most, #GamerGaters would rather drink the blood of every single SJW than submit to them. In the same vein, many Americans would rather see a ruthless pro-white, pro-Western government led by the hard-eyed likes of Vladimir Putin than watch their nation continue to vanish in a swarm of third world immigration. The Left, for all their drama queen antics, doesn’t realize how many Men of the West are never, ever going to submit to them.\nAnd if the sweet reason of the esr’s prove impotent, the Breiviks will rise. Esr thought, back in 2006, that there was an excellent chance the West can recover from the intellectual disease without violence. Eight years later, in 2014, I am considerably less sanguine about those odds.",
  "tags": [
    "politics",
    "society",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-12T17:00:00+00:00"
}