{
  "url": "https://voxday.net/2014/11/09/sjws-plotting-entry-points-into-games/",
  "scraped_at": "2025-12-16T12:34:18.034691",
  "title": "SJWs plotting entry points into games",
  "date_display": "November 9, 2014",
  "date_iso": "2014-11-09T14:00:00+00:00",
  "date_from_url": "2014-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SB discovered this excerpt from <a href=\"http://www.mattiebrice.com/dispatch-from-the-queerness-and-games-conference/\">the Dispatch from the Queerness and Games Conference</a>:</p><blockquote class=\"tr_bq\"><p> The first keynote of the conference was by <a href=\"http://lisanakamura.net/\">Lisa Nakamura</a><br> on Social Justice Warriors in video game culture. She broke down what<br> seemed to be the ‘taxonomy’ of an SJW to better understand how people,<br> usually those actively against social justice movements, both see<br> themselves and what they want to get rid of. Some qualities Lisa listed<br> out: SJW framed as opposite to SWM or straight white male, a common term<br> used for a projected most privileged identity; fundamentally insincere<br> in their motives and use of ideology, while at the same time too sincere<br> and unable to take jokes or fit in; not native to the community,<br> foreigners from Twitter and Tumblr trying to immigrate to video games.<br> This helps identify not only how gaters treat people they assign as SJW,<br> but also how they see themselves: person vs ideologue; genuine vs<br> manipulative; native vs the opportunistic.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Wrapped up in this is how to<br> be a minoritized person that is a ‘true’ force for change, aka not a<br> fake feminist or gamer that wants social good, by the way of practicing<br> ‘cruel optimism.’ Cruel optimism is that common response to inequality<br> that’s a mix of positivist individualism and ‘harsh reality,’ like for<br> more minoritized people to create games and THEN media will get better,<br> just sit back and wait and it’ll take care of itself. I feel like we see<br> this with the overabundance of girls in STEM initiatives and no<br> resources for those right now fighting against marginalization. Lisa<br> used the term ‘procedural meritocracy,’ that in order to earn respect in<br> gaming, you have to display exceptional skill. Basically the idea is if<br> men who spout sexist stuff online are beat in a video game fair and<br> square by a woman, they will include her based on meritocracy and<br> proving she’s not a fake geek girl.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>This attitude doesn’t address that<br> the barriers to gaining skill are still very high for minoritized<br> people, and that this process ultimately turns the bullied into a new<br> bully; you climb the ranks so you can police the behavior of others,<br> essentially giving permission to those already at the top. The true<br> warrior looks like other gamers, talks like other gamers, and plays like<br> other gamers. The SJW doesn’t play by the same rules, or even worse,<br> doesn’t play the same games. This is hyperbolized by the codification of<br> certain games as worthy of getting paid for playing and not, and how<br> that is gendered, raced, etc. I think this is a pretty useful<br> perspective to have because it helps people frame how they talk to those<br> projecting the image of the SJW and better yet work to counteract the<br> qualities of being conniving interlopers by referencing their<br> credibility in the community.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is classic SJW entryism in action. It’s not conspiracy theory, it is an actual, ongoing conspiracy on the part of SJW radicals to enter the game industry and prevent people from designing, developing, and playing the games they wish to design, develop, and play. This is why they have to be identified, confronted, and called out. They are actively planning to take over the game industry, just as they have nearly taken over SF/F and the sports media with their hyperpoliticization of it.</p><p>Do not tolerate them. Do not compromise with them. Do not seek to find a balance with them or meet them halfway. That is the core of their strategy, which they then rinse-and-repeat. They have repeatedly said that we are not fit for public discourse; very well, then do not engage in any discourse with them or permit them entry to anywhere we are.</p><p>If there is no place for us where they are, then there can be no place for them where we are.</p></div>",
  "content_text": "SB discovered this excerpt from\nthe Dispatch from the Queerness and Games Conference\n:\nThe first keynote of the conference was by\nLisa Nakamura\non Social Justice Warriors in video game culture. She broke down what\nseemed to be the ‘taxonomy’ of an SJW to better understand how people,\nusually those actively against social justice movements, both see\nthemselves and what they want to get rid of. Some qualities Lisa listed\nout: SJW framed as opposite to SWM or straight white male, a common term\nused for a projected most privileged identity; fundamentally insincere\nin their motives and use of ideology, while at the same time too sincere\nand unable to take jokes or fit in; not native to the community,\nforeigners from Twitter and Tumblr trying to immigrate to video games.\nThis helps identify not only how gaters treat people they assign as SJW,\nbut also how they see themselves: person vs ideologue; genuine vs\nmanipulative; native vs the opportunistic.\nWrapped up in this is how to\nbe a minoritized person that is a ‘true’ force for change, aka not a\nfake feminist or gamer that wants social good, by the way of practicing\n‘cruel optimism.’ Cruel optimism is that common response to inequality\nthat’s a mix of positivist individualism and ‘harsh reality,’ like for\nmore minoritized people to create games and THEN media will get better,\njust sit back and wait and it’ll take care of itself. I feel like we see\nthis with the overabundance of girls in STEM initiatives and no\nresources for those right now fighting against marginalization. Lisa\nused the term ‘procedural meritocracy,’ that in order to earn respect in\ngaming, you have to display exceptional skill. Basically the idea is if\nmen who spout sexist stuff online are beat in a video game fair and\nsquare by a woman, they will include her based on meritocracy and\nproving she’s not a fake geek girl.\nThis attitude doesn’t address that\nthe barriers to gaining skill are still very high for minoritized\npeople, and that this process ultimately turns the bullied into a new\nbully; you climb the ranks so you can police the behavior of others,\nessentially giving permission to those already at the top. The true\nwarrior looks like other gamers, talks like other gamers, and plays like\nother gamers. The SJW doesn’t play by the same rules, or even worse,\ndoesn’t play the same games. This is hyperbolized by the codification of\ncertain games as worthy of getting paid for playing and not, and how\nthat is gendered, raced, etc. I think this is a pretty useful\nperspective to have because it helps people frame how they talk to those\nprojecting the image of the SJW and better yet work to counteract the\nqualities of being conniving interlopers by referencing their\ncredibility in the community.\nThis is classic SJW entryism in action. It’s not conspiracy theory, it is an actual, ongoing conspiracy on the part of SJW radicals to enter the game industry and prevent people from designing, developing, and playing the games they wish to design, develop, and play. This is why they have to be identified, confronted, and called out. They are actively planning to take over the game industry, just as they have nearly taken over SF/F and the sports media with their hyperpoliticization of it.\nDo not tolerate them. Do not compromise with them. Do not seek to find a balance with them or meet them halfway. That is the core of their strategy, which they then rinse-and-repeat. They have repeatedly said that we are not fit for public discourse; very well, then do not engage in any discourse with them or permit them entry to anywhere we are.\nIf there is no place for us where they are, then there can be no place for them where we are.",
  "tags": [
    "conspiracy",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-09T14:00:00+00:00"
}