{
  "url": "https://voxday.net/2014/11/18/some-thoughts-on-reading-israeli-history/",
  "scraped_at": "2025-12-16T12:35:16.327068",
  "title": "Some thoughts on reading Israeli history",
  "date_display": "November 18, 2014",
  "date_iso": "2014-11-18T12:07:00+00:00",
  "date_from_url": "2014-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been reading an intriguing history, <i>The Land of Blood and Honey</i> by Israeli military historian Martin van Creveld, and a thought occurred to me. One thing that comes across very, very clearly throughout the book is that contra American and European assumptions, the Israelis are not a farsighted people. In fact, by European standards, they are unstable, prone to oscillating between overconfidence and despair, deeply paranoid, and arrogant. They are also brave, creative, hard-working, and intelligent, and their military strategists are competent, if not necessarily as brilliant as their public relations would have it.</p><p>(On that note, I was particularly amused to run across Israel’s finest general, Moshe Dayan, making precisely the same observation I have made concerning the IDF’s military accomplishments. As he observed in a manner obviously intended to deflate some of the more overly excitable cheerleaders after the Six-Day War, while the IDF was massively victorious, it was Arab divisions they defeated, not German ones.)</p><p>It’s not just van Creveld’s observations that led me to these conclusions either, as I read a piece about Israeli marketing that pointed in precisely the same direction. But it is also apparent that at the highest levels, the Israelis feel they cannot do anything without at least the tacit permission of the USA, and, to a lesser extent, the European nations. This is every bit as true today as it was when they were ordered back from the Suez Canal by President Eisenhower.</p><p>So here is the thought. Many Americans and Europeans have long regarded the Jewish support for flooding their nations with third worlders, particularly Africans and Arabs, to be fundamentally aimed at destroying the white nations. And there is some evidence for that on the basis of various statements that have been made by American Jews. But after reading more about Israel, I’m not so sure that is the true target. The Chinese are probably a more dangerous long-term competitor than the Europeans and there are no similar anti-Chinese campaigns on that front. Keep in mind that Israelis are not American Jews, in fact, they often appear to be mildly contemptuous of them, as they have been tested, and continue to be tested, in ways the American Jews have not. They tend to view American Jews in much the same way front-line troops regard support troops, as REMFs whose opinions are ignorant, misguided, and irrelevant.</p><p>And on that basis, my hypothesis is simultaneously less sinister and considerably more cynical. Ever since the first intifada, a majority of the Israeli people have wanted to push the Palestinians out of Gaza and the West Bank and claim the entirety of what they call “the Land”. The religious hardliners have demanded that from the start, or at least since the 1967 war. However, Israelis know very well they can’t seriously hope to do anything of the sort without at least tacit approval from the West.</p><p>So, what better way to get approval from the West for ethno-religious cleansing than for the West to be engaged in precisely the same activity on an even larger scale? Is it not possible that Israel (and therefore AIPAC, and therefore American Jewry) has been pushing for third world invasion of the West, particularly Muslim mass immigration, in order to spark the very reconquista that more and more Westerners are beginning to demand?</p><p>If this hypothesis is correct, then we should see American Jewry gradually shifting from a pro-immigration position to a pro-deportation one. I am not, of course, saying this is correct, nor am I privy to any information on the matter one way or the other. It’s just a thought. But the more I learn about the Middle East, the more it seems to me that if Israel is ever going to successfully claim and colonize the entire Land, it is going to have to do so under the political cover of a second Western reconquista.</p></div>",
  "content_text": "I’ve been reading an intriguing history,\nThe Land of Blood and Honey\nby Israeli military historian Martin van Creveld, and a thought occurred to me. One thing that comes across very, very clearly throughout the book is that contra American and European assumptions, the Israelis are not a farsighted people. In fact, by European standards, they are unstable, prone to oscillating between overconfidence and despair, deeply paranoid, and arrogant. They are also brave, creative, hard-working, and intelligent, and their military strategists are competent, if not necessarily as brilliant as their public relations would have it.\n(On that note, I was particularly amused to run across Israel’s finest general, Moshe Dayan, making precisely the same observation I have made concerning the IDF’s military accomplishments. As he observed in a manner obviously intended to deflate some of the more overly excitable cheerleaders after the Six-Day War, while the IDF was massively victorious, it was Arab divisions they defeated, not German ones.)\nIt’s not just van Creveld’s observations that led me to these conclusions either, as I read a piece about Israeli marketing that pointed in precisely the same direction. But it is also apparent that at the highest levels, the Israelis feel they cannot do anything without at least the tacit permission of the USA, and, to a lesser extent, the European nations. This is every bit as true today as it was when they were ordered back from the Suez Canal by President Eisenhower.\nSo here is the thought. Many Americans and Europeans have long regarded the Jewish support for flooding their nations with third worlders, particularly Africans and Arabs, to be fundamentally aimed at destroying the white nations. And there is some evidence for that on the basis of various statements that have been made by American Jews. But after reading more about Israel, I’m not so sure that is the true target. The Chinese are probably a more dangerous long-term competitor than the Europeans and there are no similar anti-Chinese campaigns on that front. Keep in mind that Israelis are not American Jews, in fact, they often appear to be mildly contemptuous of them, as they have been tested, and continue to be tested, in ways the American Jews have not. They tend to view American Jews in much the same way front-line troops regard support troops, as REMFs whose opinions are ignorant, misguided, and irrelevant.\nAnd on that basis, my hypothesis is simultaneously less sinister and considerably more cynical. Ever since the first intifada, a majority of the Israeli people have wanted to push the Palestinians out of Gaza and the West Bank and claim the entirety of what they call “the Land”. The religious hardliners have demanded that from the start, or at least since the 1967 war. However, Israelis know very well they can’t seriously hope to do anything of the sort without at least tacit approval from the West.\nSo, what better way to get approval from the West for ethno-religious cleansing than for the West to be engaged in precisely the same activity on an even larger scale? Is it not possible that Israel (and therefore AIPAC, and therefore American Jewry) has been pushing for third world invasion of the West, particularly Muslim mass immigration, in order to spark the very reconquista that more and more Westerners are beginning to demand?\nIf this hypothesis is correct, then we should see American Jewry gradually shifting from a pro-immigration position to a pro-deportation one. I am not, of course, saying this is correct, nor am I privy to any information on the matter one way or the other. It’s just a thought. But the more I learn about the Middle East, the more it seems to me that if Israel is ever going to successfully claim and colonize the entire Land, it is going to have to do so under the political cover of a second Western reconquista.",
  "tags": [
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-18T12:07:00+00:00"
}