{
  "url": "https://voxday.net/2014/11/08/the-exit-sign/",
  "scraped_at": "2025-12-16T12:34:14.392834",
  "title": "The exit sign",
  "date_display": "November 8, 2014",
  "date_iso": "2014-11-08T14:57:00+00:00",
  "date_from_url": "2014-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>More and more of these <a href=\"http://www.nytimes.com/2014/11/07/world/asia/rohingya-myanmar-rakhine-state-thailand-malaysia.html?_r=1\">will be going up around the world</a>:</p><blockquote class=\"tr_bq\"><p> Myanmar Policy’s Message to Muslims: Get Out</p><p>The Myanmar government has given the estimated one million Rohingya people in this coastal region of the country a dispiriting choice: Prove your family has lived here for more than 60 years and qualify for second-class citizenship, or be placed in camps and face deportation.</p><p>The policy, accompanied by a wave of decrees and legislation, has made life for the Rohingya, a long-persecuted Muslim minority, ever more desperate, spurring the biggest flow of Rohingya refugees since a major exodus two years ago. In the last three weeks alone, 14,500 Rohingya have sailed from the beaches of Rakhine State to Thailand, with the ultimate goal of reaching Malaysia, according to the Arakan Project, a group that monitors Rohingya refugees.</p></blockquote><p>The West will eventually follow suit or the West will be incorporated into the Dar al-Islam. It’s not going to happen today. It’s not going to happen tomorrow. But one, or the other, is going to happen. And since I very much doubt the people of the West are going to convert en masse, or be conquered, I expect that the Myanmar Policy will become increasingly adopted by countries outside the Dar al-Islam, just as Islamic countries are increasingly expelling – or eliminating – Christians.</p><p>Never forget that from start to finish, the Reconquista began with the Battle of Covadonga in 718, when “a small army, led by the nobleman Pelagius, defeated an Umayyad army in the mountains of northern Iberia and established a small Christian principality in Asturias.” It ended in 1526, when King Charles V ordered the Moors to convert to Christianity or leave the Kingdom of Aragon.</p><p>The Left wrings its hands about Islamaphobia and anti-Semitism while the fact is that it is Christians who are now <a href=\"http://www.independent.co.uk/voices/comment/christians-the-worlds-most-persecuted-people-9630774.html\">the most persecuted people in the world</a>.</p><ul><li>According to the International Society for Human Rights, a secular group with members in 38 states worldwide, 80 per cent of all acts of religious discrimination in the world today are directed at Christians. </li><li>The former chief rabbi Jonathan Sacks told the House of Lords recently<br> that the suffering of Middle East Christians is “one of the crimes<br> against humanity of our time”. He compared it with Jewish pogroms in<br> Europe and said he was “appalled at the lack of protest it has evoked”.</br></br></br></li></ul><p>This is not the first great clash of civilizations and it will almost surely not be the last. But the sooner people understand that they are in a war, whether they want to be or not, the sooner that war can be won. Nor is the West innocent in this regard; the global jihad is a <i>response </i>to Western interference in the Middle East during the early part of the 20th century.</p></div>",
  "content_text": "More and more of these\nwill be going up around the world\n:\nMyanmar Policy’s Message to Muslims: Get Out\nThe Myanmar government has given the estimated one million Rohingya people in this coastal region of the country a dispiriting choice: Prove your family has lived here for more than 60 years and qualify for second-class citizenship, or be placed in camps and face deportation.\nThe policy, accompanied by a wave of decrees and legislation, has made life for the Rohingya, a long-persecuted Muslim minority, ever more desperate, spurring the biggest flow of Rohingya refugees since a major exodus two years ago. In the last three weeks alone, 14,500 Rohingya have sailed from the beaches of Rakhine State to Thailand, with the ultimate goal of reaching Malaysia, according to the Arakan Project, a group that monitors Rohingya refugees.\nThe West will eventually follow suit or the West will be incorporated into the Dar al-Islam. It’s not going to happen today. It’s not going to happen tomorrow. But one, or the other, is going to happen. And since I very much doubt the people of the West are going to convert en masse, or be conquered, I expect that the Myanmar Policy will become increasingly adopted by countries outside the Dar al-Islam, just as Islamic countries are increasingly expelling – or eliminating – Christians.\nNever forget that from start to finish, the Reconquista began with the Battle of Covadonga in 718, when “a small army, led by the nobleman Pelagius, defeated an Umayyad army in the mountains of northern Iberia and established a small Christian principality in Asturias.” It ended in 1526, when King Charles V ordered the Moors to convert to Christianity or leave the Kingdom of Aragon.\nThe Left wrings its hands about Islamaphobia and anti-Semitism while the fact is that it is Christians who are now\nthe most persecuted people in the world\n.\nAccording to the International Society for Human Rights, a secular group with members in 38 states worldwide, 80 per cent of all acts of religious discrimination in the world today are directed at Christians.\nThe former chief rabbi Jonathan Sacks told the House of Lords recently\nthat the suffering of Middle East Christians is “one of the crimes\nagainst humanity of our time”. He compared it with Jewish pogroms in\nEurope and said he was “appalled at the lack of protest it has evoked”.\nThis is not the first great clash of civilizations and it will almost surely not be the last. But the sooner people understand that they are in a war, whether they want to be or not, the sooner that war can be won. Nor is the West innocent in this regard; the global jihad is a\nresponse\nto Western interference in the Middle East during the early part of the 20th century.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-08T14:57:00+00:00"
}