{
  "url": "https://voxday.net/2014/11/28/thieves-with-badges/",
  "scraped_at": "2025-12-16T12:36:31.291723",
  "title": "Thieves with badges",
  "date_display": "November 28, 2014",
  "date_iso": "2014-11-28T13:16:00+00:00",
  "date_from_url": "2014-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The U.S. police are not longer entitled to absolutely any respect or presumption of innocence anymore. They are, quite literally, <a href=\"http://www.washingtonpost.com/investigations/highway-seizure-in-iowa-fuels-debate-about-asset-forfeiture-laws/2014/11/10/10f725fc-5ec3-11e4-8b9e-2ccdac31a031_story.html\">trained highwaymen</a>:</p><blockquote class=\"tr_bq\"><p> The stop of the gamblers in Iowa on April 15, 2013, illustrates some of the highway interdiction methods in use nationwide. Earlier<br> that morning, an officer in Illinois alerted an Iowa trooper to a<br> suspicious red car with Nevada license plates driving west, court<br> records show. When the Altima appeared in Iowa, Trooper Simmons followed<br> it for several miles before pulling it over. He told the motorists that<br> they had been stopped for failing to signal when they passed a black<br> SUV.</br></br></br></br></br></br></p><p>Simmons said he was issuing a warning for the failure to<br> signal. After handing over the paperwork, he said the stop was over.<br> Then he asked the driver, Newmerzhycky, if he had “time for just a<br> couple quick questions.”</br></br></br></p><p> Police who specialize in highway<br> interdiction use casual conversations to avoid triggering legal<br> questions about the length of stops. If the conversations are<br> consensual, courts consider the added delay to be legal.</br></br></br></p><p> Highway<br> police are trained to use the chats as an opportunity to take stock of<br> alleged “indicators” of criminal activity, including nervous speech<br> patterns, a pulsing carotid artery and inconsistencies in stories. They<br> are also trained to seek permission for warrantless searches.</br></br></br></br></p></blockquote><p>Notice that the video proved that Trooper Simmons was lying when he told them why he pulled the two gamblers over. They were correct to doubt his veracity and lie to him in return. Never answer a policeman’s questions. Always ask him if you are arrested, and if not, if you are free to go. If you can, video every interaction with them. They are not the good guys. They are, at best, thieves who prey upon the public.</p></div>",
  "content_text": "The U.S. police are not longer entitled to absolutely any respect or presumption of innocence anymore. They are, quite literally,\ntrained highwaymen\n:\nThe stop of the gamblers in Iowa on April 15, 2013, illustrates some of the highway interdiction methods in use nationwide. Earlier\nthat morning, an officer in Illinois alerted an Iowa trooper to a\nsuspicious red car with Nevada license plates driving west, court\nrecords show. When the Altima appeared in Iowa, Trooper Simmons followed\nit for several miles before pulling it over. He told the motorists that\nthey had been stopped for failing to signal when they passed a black\nSUV.\nSimmons said he was issuing a warning for the failure to\nsignal. After handing over the paperwork, he said the stop was over.\nThen he asked the driver, Newmerzhycky, if he had “time for just a\ncouple quick questions.”\nPolice who specialize in highway\ninterdiction use casual conversations to avoid triggering legal\nquestions about the length of stops. If the conversations are\nconsensual, courts consider the added delay to be legal.\nHighway\npolice are trained to use the chats as an opportunity to take stock of\nalleged “indicators” of criminal activity, including nervous speech\npatterns, a pulsing carotid artery and inconsistencies in stories. They\nare also trained to seek permission for warrantless searches.\nNotice that the video proved that Trooper Simmons was lying when he told them why he pulled the two gamblers over. They were correct to doubt his veracity and lie to him in return. Never answer a policeman’s questions. Always ask him if you are arrested, and if not, if you are free to go. If you can, video every interaction with them. They are not the good guys. They are, at best, thieves who prey upon the public.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-28T13:16:00+00:00"
}