{
  "url": "https://voxday.net/2014/11/12/two-failed-wars/",
  "scraped_at": "2025-12-16T12:34:41.119944",
  "title": "Two failed wars",
  "date_display": "November 12, 2014",
  "date_iso": "2014-11-12T20:30:00+00:00",
  "date_from_url": "2014-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A lieutenant general <a href=\"http://www.nytimes.com/2014/11/11/opinion/the-truth-about-the-wars-in-iraq-and-afghanistan.html?_r=0\">regrets the wasted lives of his soldiers</a>, thrown away for nothing in Iraq and Afghanistan:</p><blockquote class=\"tr_bq\"><p> As a senior commander in Iraq and Afghanistan, I lost 80 soldiers.<br> Despite their sacrifices, and those of thousands more, all we have to<br> show for it are two failed wars. This fact eats at me every day, and <a class=\"meta-classifier\" href=\"http://topics.nytimes.com/top/reference/timestopics/subjects/v/veterans_day/index.html?inline=nyt-classifier\" title=\"More articles about Veterans Day.\">Veterans Day</a> is tougher than most…. We can convince ourselves that we did our part, and a few more diplomats or civilian leaders should have done theirs. Similar myths no doubt comforted Americans who fought under the command of Robert E. Lee in the Civil War or William C. Westmoreland in Vietnam. But as a three-star general who spent four years trying to win this thing — and failing — I now know better.</br></br></p><p>We did not understand the enemy, a guerrilla network embedded in a quarrelsome, suspicious civilian population. We didn’t understand our own forces, which are built for rapid, decisive conventional operations, not lingering, ill-defined counterinsurgencies. We’re made for Desert Storm, not Vietnam. As a general, I got it wrong. Like my peers, I argued to stay the course, to persist and persist, to “clear/hold/build” even as the “hold” stage stretched for months, and then years, with decades beckoning. We backed ourselves season by season into a long-term counterinsurgency in Iraq, then compounded it by doing likewise in Afghanistan.</p><p>What went wrong in Iraq and in Afghanistan isn’t the stuff of legend. It won’t bring people into the recruiting office, or make for good speeches on Veterans Day. Reserve those honors for the brave men and women who bear the burdens of combat.</p><p>That said, those who served deserve an accounting from the generals. What happened? How? And, especially, why? It has to be a public assessment, nonpartisan and not left to the military. (We tend to grade ourselves on the curve.) Something along the lines of the 9/11 Commission is in order. We owe that to our veterans and our fellow citizens.</p><p>Such an accounting couldn’t be more timely. Today we are hearing some, including those in uniform, argue for a robust ground offensive against the Islamic State in Iraq. Air attacks aren’t enough, we’re told. Our Kurdish and Iraqi Army allies are weak and incompetent. Only another surge can win the fight against this dire threat. Really? If insanity is defined as doing the same thing over and over and expecting different results, I think we’re there.</p><p>As a veteran, and a general who learned hard lessons in two lost campaigns, I’d like to suggest an alternative. Maybe an incomplete and imperfect effort to contain the Islamic State is as good as it gets. Perhaps the best we can or should do is to keep it busy, “degrade” its forces, harry them or kill them, and seek the long game at the lowest possible cost. It’s not a solution that is likely to spawn a legend. But in the real world, it just may well give us something better than another defeat.</p></blockquote><p>Clearly the general should have read ON WAR. William S. Lind could have told him – in fact, did tell him – that the US military could not defeat the Pashtun in Afghanistan or rebuild the state it shattered in Iraq.</p></div>",
  "content_text": "A lieutenant general\nregrets the wasted lives of his soldiers\n, thrown away for nothing in Iraq and Afghanistan:\nAs a senior commander in Iraq and Afghanistan, I lost 80 soldiers.\nDespite their sacrifices, and those of thousands more, all we have to\nshow for it are two failed wars. This fact eats at me every day, and\nVeterans Day\nis tougher than most…. We can convince ourselves that we did our part, and a few more diplomats or civilian leaders should have done theirs. Similar myths no doubt comforted Americans who fought under the command of Robert E. Lee in the Civil War or William C. Westmoreland in Vietnam. But as a three-star general who spent four years trying to win this thing — and failing — I now know better.\nWe did not understand the enemy, a guerrilla network embedded in a quarrelsome, suspicious civilian population. We didn’t understand our own forces, which are built for rapid, decisive conventional operations, not lingering, ill-defined counterinsurgencies. We’re made for Desert Storm, not Vietnam. As a general, I got it wrong. Like my peers, I argued to stay the course, to persist and persist, to “clear/hold/build” even as the “hold” stage stretched for months, and then years, with decades beckoning. We backed ourselves season by season into a long-term counterinsurgency in Iraq, then compounded it by doing likewise in Afghanistan.\nWhat went wrong in Iraq and in Afghanistan isn’t the stuff of legend. It won’t bring people into the recruiting office, or make for good speeches on Veterans Day. Reserve those honors for the brave men and women who bear the burdens of combat.\nThat said, those who served deserve an accounting from the generals. What happened? How? And, especially, why? It has to be a public assessment, nonpartisan and not left to the military. (We tend to grade ourselves on the curve.) Something along the lines of the 9/11 Commission is in order. We owe that to our veterans and our fellow citizens.\nSuch an accounting couldn’t be more timely. Today we are hearing some, including those in uniform, argue for a robust ground offensive against the Islamic State in Iraq. Air attacks aren’t enough, we’re told. Our Kurdish and Iraqi Army allies are weak and incompetent. Only another surge can win the fight against this dire threat. Really? If insanity is defined as doing the same thing over and over and expecting different results, I think we’re there.\nAs a veteran, and a general who learned hard lessons in two lost campaigns, I’d like to suggest an alternative. Maybe an incomplete and imperfect effort to contain the Islamic State is as good as it gets. Perhaps the best we can or should do is to keep it busy, “degrade” its forces, harry them or kill them, and seek the long game at the lowest possible cost. It’s not a solution that is likely to spawn a legend. But in the real world, it just may well give us something better than another defeat.\nClearly the general should have read ON WAR. William S. Lind could have told him – in fact, did tell him – that the US military could not defeat the Pashtun in Afghanistan or rebuild the state it shattered in Iraq.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-12T20:30:00+00:00"
}