{
  "url": "https://voxday.net/2014/11/24/unrest-across-europe/",
  "scraped_at": "2025-12-16T12:36:03.710241",
  "title": "Unrest across Europe",
  "date_display": "November 24, 2014",
  "date_iso": "2014-11-24T13:00:00+00:00",
  "date_from_url": "2014-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mass migration and third world invasion is being violently protested by Europeans everywhere <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/italy/11231773/Italy-protests-erupt-across-the-country.html\">from the south</a>:</p><blockquote class=\"tr_bq\"><p> On the gritty, long-neglected outskirts of Rome there was continuing tension outside a centre for refugees, which was repeatedly attacked by local residents during the week. A group of 36 teenage migrants had to be evacuated from the centre in Tor Sapienza, a working-class suburb, on Thursday night after the authorities said the area was no longer safe for them.</p><p>Locals had hurled stones, flares and other missiles at the migrant centre, smashing windows, setting fire to dumpster rubbish bins and fighting running battles with riot police during several nights of violence. They demanded that the facility be closed down and claimed that the refugees from Africa and Asia were dirty, anti-social and violent.</p></blockquote><p><a href=\"http://swedenreport.org/2014/10/29/swedish-police-55-official-no-go-zones/\">To the north</a> of the continent:</p><blockquote class=\"tr_bq\"><p> The Swedish police recently released a map of 55 areas where they publicly admit to having surrendered control to the criminal gangs. These areas have long had problems with mailmen, fire trucks and ambulances being attacked when trying to enter, which has led to them routinely requesting police escort. Now it’s the police being attacked outright.</p><p>These no-go zones are primarily so-called “exclusion areas” which is the politically correct term for the 186 ghettos that have sprung up around Sweden in the past two decades. These areas are predominantly populated by immigrants from muslim countries with low education and even lower employment rates. The exception being the enthusiastic entrepreneurs in the fields of drug dealing, protection rackets and robberies…. This development would have been inconceivable only 20 years ago, and one would think this official surrender by the police would have made big headlines. This is not the case; the most attention it seems to have received in mainstream media is an opinion piece in national paper <i>Svenska Dagbladet</i>.</p><p>It can be speculated that this is due to the fact that any reporting on this could be seen as “support” for nationalist party SD that wants to restrict the vast inflow to these ghettos, which is an absolute no-no amongst the journalists and could cost them their jobs.</p></blockquote><p>It’s not going to be long before the Swedish Democrats are the ruling party in Sweden. And it’s not going to be long before the Swedish military is going to be entering those ghettos with tanks and machine guns. That’s why the current left-wing Swedish government is trying to increase immigration even up to the end, this is the equivalent of the pre-WWI governments setting their mobilization plans in motion. The anti-Western European Left wants to fight a civil war by proxy, but as Anders Breivik demonstrated, the European Right knows perfectly well who its real enemies are.</p><p>I suspect that the younger generation of Native Europeans is going to make the Nazi-era Germans look moderate by comparison. Europe belongs to them. And they know they are going to have to fight for it if they don’t want to go the way of the Native American.</p></div>",
  "content_text": "Mass migration and third world invasion is being violently protested by Europeans everywhere\nfrom the south\n:\nOn the gritty, long-neglected outskirts of Rome there was continuing tension outside a centre for refugees, which was repeatedly attacked by local residents during the week. A group of 36 teenage migrants had to be evacuated from the centre in Tor Sapienza, a working-class suburb, on Thursday night after the authorities said the area was no longer safe for them.\nLocals had hurled stones, flares and other missiles at the migrant centre, smashing windows, setting fire to dumpster rubbish bins and fighting running battles with riot police during several nights of violence. They demanded that the facility be closed down and claimed that the refugees from Africa and Asia were dirty, anti-social and violent.\nTo the north\nof the continent:\nThe Swedish police recently released a map of 55 areas where they publicly admit to having surrendered control to the criminal gangs. These areas have long had problems with mailmen, fire trucks and ambulances being attacked when trying to enter, which has led to them routinely requesting police escort. Now it’s the police being attacked outright.\nThese no-go zones are primarily so-called “exclusion areas” which is the politically correct term for the 186 ghettos that have sprung up around Sweden in the past two decades. These areas are predominantly populated by immigrants from muslim countries with low education and even lower employment rates. The exception being the enthusiastic entrepreneurs in the fields of drug dealing, protection rackets and robberies…. This development would have been inconceivable only 20 years ago, and one would think this official surrender by the police would have made big headlines. This is not the case; the most attention it seems to have received in mainstream media is an opinion piece in national paper\nSvenska Dagbladet\n.\nIt can be speculated that this is due to the fact that any reporting on this could be seen as “support” for nationalist party SD that wants to restrict the vast inflow to these ghettos, which is an absolute no-no amongst the journalists and could cost them their jobs.\nIt’s not going to be long before the Swedish Democrats are the ruling party in Sweden. And it’s not going to be long before the Swedish military is going to be entering those ghettos with tanks and machine guns. That’s why the current left-wing Swedish government is trying to increase immigration even up to the end, this is the equivalent of the pre-WWI governments setting their mobilization plans in motion. The anti-Western European Left wants to fight a civil war by proxy, but as Anders Breivik demonstrated, the European Right knows perfectly well who its real enemies are.\nI suspect that the younger generation of Native Europeans is going to make the Nazi-era Germans look moderate by comparison. Europe belongs to them. And they know they are going to have to fight for it if they don’t want to go the way of the Native American.",
  "tags": [
    "Clash of Civilizations",
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-24T13:00:00+00:00"
}