{
  "url": "https://voxday.net/2014/11/07/vibrant-pr/",
  "scraped_at": "2025-12-16T12:34:08.866028",
  "title": "Vibrant PR",
  "date_display": "November 7, 2014",
  "date_iso": "2014-11-07T17:00:00+00:00",
  "date_from_url": "2014-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For all that the hip-hop impresarios are masters of self-marketing, it seems that some of their less-wealthy kindred are yet to master <a href=\"http://www.thegatewaypundit.com/2014/11/ferguson-mob-turns-on-umsl-student-beat-him-chase-him-down-chambers-street-screaming/\">the concept of public relations</a>:</p><blockquote class=\"tr_bq\"><p> The meeting we had earlier at the church at 9950 Glen Owen Dr, St Louis, MO, alot of us attended the meeting but what happened with the attack on a peaceful protester was wrong and should have been handled a different way. Some of us already know that no live-streaming is allowed at the meeting and but when they told him to stop live streaming he probably didn’t hear or understand and when everbody just rushed him and told to stop live streaming and get the F××k out and then all of sudden he gets jumped and attacked. He is a student at UMSL college and he has been out there with us protesting on regular nights. Some of us know who he is, his name is Chris Schaefer, and NO, he’s not working with the police, he is on our side. But like I said again, for some of yall to just attack him having him, running down Chambers St towards West Florissant to the Walgreens scared for his life and he steady screaming crying and flagging down cars asking for help, but he only gets help when he runs inside the Walgreens, that was wrong and F××ked up it really was he was they took him to the hospital by ambulance to be treated for injuries. That’s making us look bad, the ones that come out to protest peacefully, smh, and he is white but that don’t mean to attack him like that! We have supporters of all races!</p></blockquote><p>Which reminds me of a famous song <a href=\"http://www.youtube.com/watch?v=5zON0o_d51E\">by Tyrone Green</a>:</p><blockquote class=\"tr_bq\"><p> <i>We sing of freedom and for equality<br> But we really don’t care, we just want money money money<br> We want to drive in a big black limousine<br> Get so high off ganja a-we can’t even see<br> But soon we kill de white people, oh<br> </br></br></br></br></br></i><br> <i><br> We gonna make them hurt<br> Kill de white people, yeah<br> whoa, but buy my record first</br></br></br></i></br></p><p>When they go to the record store<br> <br> We gonna wait outside<br> We gonna hit ’em in de head wit’ a bat and make them cry</br></br></br></p></blockquote><p>That was funny when it was on SNL. It’s not quite as funny when it is the President of South Africa president <a href=\"http://www.youtube.com/watch?v=QCILT7NhmIk\">singing “Kill the Boer”</a>. Although the signer is hilarious. Nor is it is nearly as funny as this:<br> <i> </i></br></p><blockquote class=\"tr_bq\"><p> Live-streamer Chris Schaefer posted a video from his hospital bed in the<br> emergency room. Schaefer said he got hit “pretty badly” in his head,<br> hands, and sides. He’s asking for donations to pay for his CAT Scan.</br></br></p></blockquote><p>Why don’t you have your vibrant brothers in protest pay for it, Mr. Schaefer? Oh, wait, that’s right, they’re the ones who put you in the hospital in the first place. One wonders how many similar messages will be required before whites accord blacks the respect inherent in taking what they say seriously.</p></div>",
  "content_text": "For all that the hip-hop impresarios are masters of self-marketing, it seems that some of their less-wealthy kindred are yet to master\nthe concept of public relations\n:\nThe meeting we had earlier at the church at 9950 Glen Owen Dr, St Louis, MO, alot of us attended the meeting but what happened with the attack on a peaceful protester was wrong and should have been handled a different way. Some of us already know that no live-streaming is allowed at the meeting and but when they told him to stop live streaming he probably didn’t hear or understand and when everbody just rushed him and told to stop live streaming and get the F××k out and then all of sudden he gets jumped and attacked. He is a student at UMSL college and he has been out there with us protesting on regular nights. Some of us know who he is, his name is Chris Schaefer, and NO, he’s not working with the police, he is on our side. But like I said again, for some of yall to just attack him having him, running down Chambers St towards West Florissant to the Walgreens scared for his life and he steady screaming crying and flagging down cars asking for help, but he only gets help when he runs inside the Walgreens, that was wrong and F××ked up it really was he was they took him to the hospital by ambulance to be treated for injuries. That’s making us look bad, the ones that come out to protest peacefully, smh, and he is white but that don’t mean to attack him like that! We have supporters of all races!\nWhich reminds me of a famous song\nby Tyrone Green\n:\nWe sing of freedom and for equality\nBut we really don’t care, we just want money money money\nWe want to drive in a big black limousine\nGet so high off ganja a-we can’t even see\nBut soon we kill de white people, oh\nWe gonna make them hurt\nKill de white people, yeah\nwhoa, but buy my record first\nWhen they go to the record store\nWe gonna wait outside\nWe gonna hit ’em in de head wit’ a bat and make them cry\nThat was funny when it was on SNL. It’s not quite as funny when it is the President of South Africa president\nsinging “Kill the Boer”\n. Although the signer is hilarious. Nor is it is nearly as funny as this:\nLive-streamer Chris Schaefer posted a video from his hospital bed in the\nemergency room. Schaefer said he got hit “pretty badly” in his head,\nhands, and sides. He’s asking for donations to pay for his CAT Scan.\nWhy don’t you have your vibrant brothers in protest pay for it, Mr. Schaefer? Oh, wait, that’s right, they’re the ones who put you in the hospital in the first place. One wonders how many similar messages will be required before whites accord blacks the respect inherent in taking what they say seriously.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-07T17:00:00+00:00"
}