{
  "url": "https://voxday.net/2014/11/12/what-you-can-do-part-2/",
  "scraped_at": "2025-12-16T12:34:37.476627",
  "title": "What you can do, part 2",
  "date_display": "November 12, 2014",
  "date_iso": "2014-11-12T13:18:00+00:00",
  "date_from_url": "2014-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the second part of my response to someone who asked what they could do to help fight the SJWs. A few days ago, a #GamerGater named @Ignideus with less than 500 followers came up with the idea for <a href=\"https://twitter.com/search?f=realtime&amp;q=%23OpSKYNET&amp;src=tyah\">#OpSkyNet</a> as a prospective solution for the tendency of e-celebs to dominate the public discourse on Twitter. Today, it is the #3-trending hashtag on Twitter and #GamerGate has been re-energized as the leaderless, decentralized force that it is.</p><p>Larry Correia did little more than mention a few SF/F writers he felt had produced work that merited award consideration, and in the process, exposed the corruption and hyperpoliticization of the SF Awards process.</p><p>Yesterday, a non-gamer named RooshV <a href=\"http://www.reaxxion.com/1287/welcome-to-reaxxion\">announced the creation of Reaxxion</a>, a pro-#GamerGate game review site for men. He writes:</p><blockquote class=\"tr_bq\"><p> My younger brother, who considers himself a gamer, gave me the<br> definitive push into starting Reaxxion. He plays Xbox, PC games on<br> Steam, and also some mobile games. He particularly likes games with long<br> and intricate story lines, telling me that gaming is just not about<br> pushing buttons to advance a level but to be affected on some level by a<br> compelling story, but now those stories are being perverted by people<br> who truly believe that men are evil and holding women down just because<br> they may want to enjoy a traditional story line with attractive women.</br></br></br></br></br></br></br></p><p>The infiltration of SJW’s into gaming may mean that my brother will<br> have to put up with their narrative in his games. It may mean that his<br> entertainment options become more limited because a developer was subtly<br> threatened unless he inserted another “empowered female” in a game<br> where such a character simply doesn’t fit. I’ve learned that unless you<br> fight back against these people, unless you spread awareness and develop<br> a megaphone as big as them, they will surely get what they want and<br> impact the culture in a way that hurts normal men who don’t subscribe to<br> their strange worldview.</br></br></br></br></br></br></br></br></p></blockquote><p>Roosh isn’t a gamer, but he understands the importance of #GamerGate as the current <i>Schwerpunkt</i>, or focal point, of the SJWs. That’s why he’s stepped in with the sort of material assistance that only someone of his stature on the Internet can; the very name of the new game site is a gesture of contempt for those who consider themselves progressives.</p><p>Ingnideus was an unknown. Larry is a New York Times bestselling author. Roosh is Internet-famous, or if you prefer, infamous. But all three of them are taking what action they can take and all three of them are having a real impact.  What you can do entirely depends upon your capabilities, resources, and inclinations, but all of it is, at the very least, capable of mattering.</p><p>Most people who want to get involved are more akin to Ingnideus than Roosh. What that means is finding someone who is already leading the way by doing something and lending support to their efforts. Find a <i>Schwerpunkt </i>of interest to you and throw your weigh behind it. Many of you are already doing this with Castalia House, by buying our books, subscribing to our New Release newsletter, or in some cases, proofreading, formatting, narrating, and slush-reading. A few are assisting Alpenwolf, Joe and Kirk have been helping with the First Sword art. But we can always use more and we are far from the only independent writer, developer, publisher, site or blog that can use the help.</p><p><b>General</b></p><ul><li>Support the good. Don’t support the SJWs in any of their flavors.</li><li>Get on Twitter. Tweet once with #OpSkyNet. Retweet and favorite one #GamerGate tweet per day.</li><li>Email one Gawker (or other #GamerGate target) advertiser per week.</li><li>Join <a href=\"http://re.co/\">Recommend</a>. Write one Game- or Book-related reco, good or bad, per week and I’ll add it to the appropriate list. Be sure to follow me first so I will see it.</li><li>Try an indy game from <a href=\"http://i.imgbox.com/vWlvAXDy.png\">a #GamerGate developer</a>.</li><li>Submit an article to Reaxxion. </li><li>Speak out. Do a blog post. Tell a friend.</li><li>Stand by those under attack, <i>especially </i>if you don’t agree with them. The primary SJW tactic is 3rd Generation. They cut off, isolate, then swarm. They can’t do that if you refuse to permit them to separate you from their target.</li></ul><p><b>Castalia House</b></p><ul><li>I’m ridiculously behind on submissions. We need new slushreaders and probably someone to manage the process.<b> </b></li><li>PR. We haven’t sent out a single press release to anyone yet even though we have a pretty good story to tell. We’re too busy producing to talk about it.</li><li>Bloggers for Castalia House. Mascaro is too busy now and Jeffro has needed to take a few weeks off due to burnout. It’s difficult doing one quality blog post per week; many people can manage one or two, but consistency is the key.</li><li>PDF Layout. LL is getting up to speed on this, but we have a pretty big backlog already and we are contractually obligated to get some of our newly signed books out in print.</li></ul><p><b>Alpenwolf</b></p><ul><li> Art. We’re doing all right for code, I think. (Markku, correct me if I’m wrong) but we could use additional art help. </li><li>PR. We don’t need it yet, but we will.</li><li>There is probably something else I’m missing.</li></ul><p>Why bother? Who cares about random guys living in their mother’s basements fighting for large pixellated breasts sporting chainmail bikinis in their games? <a href=\"http://www.breitbart.com/Breitbart-London/2014/11/12/The-authoritarian-Left-was-on-course-to-win-the-culture-wars-then-along-came-GamerGate\">Nero explains why</a> he, a non-gamer, is following the battle:</p><blockquote class=\"tr_bq\"><p> GamerGate is remarkable—and attracts the interest of people like me—because it represents perhaps the first time in the last decade or more that a significant incursion has been made in the culture wars against guilt-mongerers, nannies, authoritarians and far-Left agitators.</p></blockquote><p>Games are merely the current battleground. TV is already lost to the SJWs. Movies are lost. Literature is largely lost. Genre literature is all but lost. Remember, this is <a href=\"http://www.washingtonpost.com/politics/ferguson-protest-organizers-i-sleep-eat-and-breathe-this/2014/11/11/a404fcc2-6457-11e4-836c-83bc4f26eb67_story.html\">the mentality we’re up against</a>:</p><blockquote class=\"tr_bq\"><p> Humphrey, the former Subway worker, had been living with her uncle before she lost her job. She now bounces from couch to couch in her circle of protester friends — a sacrifice she said is worthwhile, because what is the point of working when she says she could be killed any day because of the color of her skin? Now, she said, standing at the Rowan Community Center on a run-down block in the Hamilton Heights neighborhood of St. Louis, “I sleep, eat and breathe this.”</p></blockquote><p>Sure, that sort of commitment easy for someone with no talent, job, or responsibilities, who has literally nothing else to do to throw themselves into something 24-7. But we’re not talking about that level of commitment, but rather a small and spare-time, but persistent one. My perception, and I could be wrong, is that far too many people on the Right are overly concerned that someone, somewhere, might profit from their assistance whereas there are no shortage of volunteers on the Left who don’t care at all about that. (This may, admittedly, be due to their general failure to grasp the concept in the first place.) Did Joe Farah benefit from my contribution of more than 500 columns to WND? I should bloody well hope so! What would be the point if he didn’t? I didn’t give him money, I gave him 30 minutes per week, and I remain pleased to see what effective use he made of it.</p><p>The Catch-22 is that there is never any money involved in getting something started from nothing, which is why it is hard to start anything without the approval of the SJW gatekeepers who have successfully infiltrated the foundations and the large corporations. There is only one way around this, which is for the talent of the right to be willing to follow the example provided by the Free and Open Source crowd.</p><p>This sort of thing should never be seen as a job, but a contribution to the cause given out of a positive spirit. It might turn into a job one day, but it probably won’t. And if you’re worried that Castalia, or Roosh, or the guys at Recommend, or might one day end up making a buck due in part to some of the time you’ve put in, consider this: Would you be here in the first place, reading this, if I has been unwilling to write columns or blog posts without being paid for my time?</p><p>Anyhow, those are my thoughts. Some of you will have additional ideas, and feel free to throw them out here. This is an open discussion, so brainstorm, don’t critique. And above all, one thing is clear. Don’t wait for permission. Don’t expect direction and management. Adopt a Fourth Generation mentality. Ignideus is the Leader of #GamerGate, Roosh is the Leader of #GamerGate, I am the Leader of #GamerGate, and so can you.</p></div>",
  "content_text": "This is the second part of my response to someone who asked what they could do to help fight the SJWs. A few days ago, a #GamerGater named @Ignideus with less than 500 followers came up with the idea for\n#OpSkyNet\nas a prospective solution for the tendency of e-celebs to dominate the public discourse on Twitter. Today, it is the #3-trending hashtag on Twitter and #GamerGate has been re-energized as the leaderless, decentralized force that it is.\nLarry Correia did little more than mention a few SF/F writers he felt had produced work that merited award consideration, and in the process, exposed the corruption and hyperpoliticization of the SF Awards process.\nYesterday, a non-gamer named RooshV\nannounced the creation of Reaxxion\n, a pro-#GamerGate game review site for men. He writes:\nMy younger brother, who considers himself a gamer, gave me the\ndefinitive push into starting Reaxxion. He plays Xbox, PC games on\nSteam, and also some mobile games. He particularly likes games with long\nand intricate story lines, telling me that gaming is just not about\npushing buttons to advance a level but to be affected on some level by a\ncompelling story, but now those stories are being perverted by people\nwho truly believe that men are evil and holding women down just because\nthey may want to enjoy a traditional story line with attractive women.\nThe infiltration of SJW’s into gaming may mean that my brother will\nhave to put up with their narrative in his games. It may mean that his\nentertainment options become more limited because a developer was subtly\nthreatened unless he inserted another “empowered female” in a game\nwhere such a character simply doesn’t fit. I’ve learned that unless you\nfight back against these people, unless you spread awareness and develop\na megaphone as big as them, they will surely get what they want and\nimpact the culture in a way that hurts normal men who don’t subscribe to\ntheir strange worldview.\nRoosh isn’t a gamer, but he understands the importance of #GamerGate as the current\nSchwerpunkt\n, or focal point, of the SJWs. That’s why he’s stepped in with the sort of material assistance that only someone of his stature on the Internet can; the very name of the new game site is a gesture of contempt for those who consider themselves progressives.\nIngnideus was an unknown. Larry is a New York Times bestselling author. Roosh is Internet-famous, or if you prefer, infamous. But all three of them are taking what action they can take and all three of them are having a real impact.  What you can do entirely depends upon your capabilities, resources, and inclinations, but all of it is, at the very least, capable of mattering.\nMost people who want to get involved are more akin to Ingnideus than Roosh. What that means is finding someone who is already leading the way by doing something and lending support to their efforts. Find a\nSchwerpunkt\nof interest to you and throw your weigh behind it. Many of you are already doing this with Castalia House, by buying our books, subscribing to our New Release newsletter, or in some cases, proofreading, formatting, narrating, and slush-reading. A few are assisting Alpenwolf, Joe and Kirk have been helping with the First Sword art. But we can always use more and we are far from the only independent writer, developer, publisher, site or blog that can use the help.\nGeneral\nSupport the good. Don’t support the SJWs in any of their flavors.\nGet on Twitter. Tweet once with #OpSkyNet. Retweet and favorite one #GamerGate tweet per day.\nEmail one Gawker (or other #GamerGate target) advertiser per week.\nJoin\nRecommend\n. Write one Game- or Book-related reco, good or bad, per week and I’ll add it to the appropriate list. Be sure to follow me first so I will see it.\nTry an indy game from\na #GamerGate developer\n.\nSubmit an article to Reaxxion.\nSpeak out. Do a blog post. Tell a friend.\nStand by those under attack,\nespecially\nif you don’t agree with them. The primary SJW tactic is 3rd Generation. They cut off, isolate, then swarm. They can’t do that if you refuse to permit them to separate you from their target.\nCastalia House\nI’m ridiculously behind on submissions. We need new slushreaders and probably someone to manage the process.\nPR. We haven’t sent out a single press release to anyone yet even though we have a pretty good story to tell. We’re too busy producing to talk about it.\nBloggers for Castalia House. Mascaro is too busy now and Jeffro has needed to take a few weeks off due to burnout. It’s difficult doing one quality blog post per week; many people can manage one or two, but consistency is the key.\nPDF Layout. LL is getting up to speed on this, but we have a pretty big backlog already and we are contractually obligated to get some of our newly signed books out in print.\nAlpenwolf\nArt. We’re doing all right for code, I think. (Markku, correct me if I’m wrong) but we could use additional art help.\nPR. We don’t need it yet, but we will.\nThere is probably something else I’m missing.\nWhy bother? Who cares about random guys living in their mother’s basements fighting for large pixellated breasts sporting chainmail bikinis in their games?\nNero explains why\nhe, a non-gamer, is following the battle:\nGamerGate is remarkable—and attracts the interest of people like me—because it represents perhaps the first time in the last decade or more that a significant incursion has been made in the culture wars against guilt-mongerers, nannies, authoritarians and far-Left agitators.\nGames are merely the current battleground. TV is already lost to the SJWs. Movies are lost. Literature is largely lost. Genre literature is all but lost. Remember, this is\nthe mentality we’re up against\n:\nHumphrey, the former Subway worker, had been living with her uncle before she lost her job. She now bounces from couch to couch in her circle of protester friends — a sacrifice she said is worthwhile, because what is the point of working when she says she could be killed any day because of the color of her skin? Now, she said, standing at the Rowan Community Center on a run-down block in the Hamilton Heights neighborhood of St. Louis, “I sleep, eat and breathe this.”\nSure, that sort of commitment easy for someone with no talent, job, or responsibilities, who has literally nothing else to do to throw themselves into something 24-7. But we’re not talking about that level of commitment, but rather a small and spare-time, but persistent one. My perception, and I could be wrong, is that far too many people on the Right are overly concerned that someone, somewhere, might profit from their assistance whereas there are no shortage of volunteers on the Left who don’t care at all about that. (This may, admittedly, be due to their general failure to grasp the concept in the first place.) Did Joe Farah benefit from my contribution of more than 500 columns to WND? I should bloody well hope so! What would be the point if he didn’t? I didn’t give him money, I gave him 30 minutes per week, and I remain pleased to see what effective use he made of it.\nThe Catch-22 is that there is never any money involved in getting something started from nothing, which is why it is hard to start anything without the approval of the SJW gatekeepers who have successfully infiltrated the foundations and the large corporations. There is only one way around this, which is for the talent of the right to be willing to follow the example provided by the Free and Open Source crowd.\nThis sort of thing should never be seen as a job, but a contribution to the cause given out of a positive spirit. It might turn into a job one day, but it probably won’t. And if you’re worried that Castalia, or Roosh, or the guys at Recommend, or might one day end up making a buck due in part to some of the time you’ve put in, consider this: Would you be here in the first place, reading this, if I has been unwilling to write columns or blog posts without being paid for my time?\nAnyhow, those are my thoughts. Some of you will have additional ideas, and feel free to throw them out here. This is an open discussion, so brainstorm, don’t critique. And above all, one thing is clear. Don’t wait for permission. Don’t expect direction and management. Adopt a Fourth Generation mentality. Ignideus is the Leader of #GamerGate, Roosh is the Leader of #GamerGate, I am the Leader of #GamerGate, and so can you.",
  "tags": [
    "games",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-11-12T13:18:00+00:00"
}