{
  "url": "https://voxday.net/2007/04/06/democracy-in-action/",
  "scraped_at": "2026-01-08T21:36:55.605550",
  "title": "Democracy in action",
  "date_display": "April 6, 2007",
  "date_iso": "2007-04-06T09:04:00+00:00",
  "date_from_url": "2007-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some people will <a href=\"http://www.timesonline.co.uk/tol/news/world/asia/article1620554.ece\">incorrectly point to Islamic radicals</a> as the problem.  But they are only the proximate cause, it’s not the root of the problem.  It could just as easily be atheist Maoists or environmental activists enforcing their will on those around them, what provides these radicals with the political cover to act in such a bullying manner is the political influence of those who sympathize with them in a modern quasi-democracy.</p><blockquote><p>Shiraz Ahmed was tending his music store in Islamabad, the capital of Pakistan, when a group of 15 bearded young men walked in bearing bamboo poles and a chilling message.</p><p>Politely but firmly, they instructed him to take down the colourful array of Bollywood and bhangradance tunes on display and to restrict his business to Islamic music.</p><p>“They told me I had to change my business,” said Mr Ahmed, 25, whose family has run the store for 15 years. “I am so confused. I don’t know what to do.”</p><p>Until last week he might not have worried about these men from Islamabad’s Lal Masjid (Red Mosque). After all, his shop is legal and within walking distance of Pervez Musharraf’s presidential palace….</p><p>Analysts say President Musharraf is worried about losing the support of Islamist parties in the presidential and parliamentary elections over the next year. He is already in the midst of a showdown with the country’s lawyers after suspending Pakistan’s independent-minded Chief Justice.</p></blockquote><p>It is ironic, of course, that American secularists spend so much time worrying about the dictatorial behavior of the only religion with enough national power to enforce a theocracy, despite the fact that Christians have shown no interest in establishing one in more than 200 years of national dominance.</p><p>We have no reason to, of course, given the fundamental belief that a true theocracy will be eventually established regardless of what anyone, including us, thinks, says or does.</p></div>",
  "content_text": "Some people will\nincorrectly point to Islamic radicals\nas the problem.  But they are only the proximate cause, it’s not the root of the problem.  It could just as easily be atheist Maoists or environmental activists enforcing their will on those around them, what provides these radicals with the political cover to act in such a bullying manner is the political influence of those who sympathize with them in a modern quasi-democracy.\nShiraz Ahmed was tending his music store in Islamabad, the capital of Pakistan, when a group of 15 bearded young men walked in bearing bamboo poles and a chilling message.\nPolitely but firmly, they instructed him to take down the colourful array of Bollywood and bhangradance tunes on display and to restrict his business to Islamic music.\n“They told me I had to change my business,” said Mr Ahmed, 25, whose family has run the store for 15 years. “I am so confused. I don’t know what to do.”\nUntil last week he might not have worried about these men from Islamabad’s Lal Masjid (Red Mosque). After all, his shop is legal and within walking distance of Pervez Musharraf’s presidential palace….\nAnalysts say President Musharraf is worried about losing the support of Islamist parties in the presidential and parliamentary elections over the next year. He is already in the midst of a showdown with the country’s lawyers after suspending Pakistan’s independent-minded Chief Justice.\nIt is ironic, of course, that American secularists spend so much time worrying about the dictatorial behavior of the only religion with enough national power to enforce a theocracy, despite the fact that Christians have shown no interest in establishing one in more than 200 years of national dominance.\nWe have no reason to, of course, given the fundamental belief that a true theocracy will be eventually established regardless of what anyone, including us, thinks, says or does.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-06T08:04:00+00:00"
}