{
  "url": "https://voxday.net/2007/04/11/feminist-myth-demolished/",
  "scraped_at": "2026-01-08T21:37:16.154034",
  "title": "A feminist myth assaulted",
  "date_display": "April 11, 2007",
  "date_iso": "2007-04-11T07:25:00+00:00",
  "date_from_url": "2007-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems Mary Shelley <a href=\"http://www.salon.com/opinion/paglia/2007/03/14/coulter/index3.html\">may not have written “Frankenstein”</a> after all:</p><blockquote><p>Finally, I read a fabulous book last week — John Lauritsen’s “The Man Who Wrote Frankenstein,” which will be published in May by the gay-themed Pagan Press, based in Dorchester, Mass. Lauritsen, who is known for his work in gay history and for his heterodox views of the AIDS epidemic, sent me an advance copy, which arrived as I was on my way to midterm exams. Its thesis is that the poet Percy Bysshe Shelley, and not his wife, the feminist idol, Mary Shelley, wrote “Frankenstein” and that the hidden theme of that book is male love….</p><p>Lauritsen assembles an overwhelming case that Mary Shelley, as a badly educated teenager, could not possibly have written the soaring prose of “Frankenstein” (which has her husband’s intensity of tone and headlong cadences all over it) and that the so-called manuscript in her hand is simply one example of the clerical work she did for many writers as a copyist. I was stunned to learn about the destruction of records undertaken by Mary for years after Percy’s death in 1822 in a boating accident in Italy. Crucial pages covering the weeks when “Frankenstein” was composed were ripped out of a journal. And Percy Shelley’s identity as the author seems to have been known in British literary circles, as illustrated by a Knights Quarterly review published in 1824 that Lauritsen reprints in the appendix.</p></blockquote><p>I don’t recall enough of the book to speak about its underlying theme, but I’ve always been skeptical about the apocryphal tale of book being written due to a ghost story-telling session among the artistic Bohemians.  Then, too, there’s the conceptual link between Percy Shelley’s <em>Prometheus Unbound</em> and the subtitle of <em>Frankenstein</em>, “the Modern Prometheus”.  Now, imagine the firestorm of hysteria if it was discovered that there was any possibility that a male “author” had taken credit for his wife’s famous work this way.</p><p>I can’t say that I’ve ever anticipated a gay-themed work of literary non-fiction before, but I really think I’ll have to check out this one.</p></div>",
  "content_text": "It seems Mary Shelley\nmay not have written “Frankenstein”\nafter all:\nFinally, I read a fabulous book last week — John Lauritsen’s “The Man Who Wrote Frankenstein,” which will be published in May by the gay-themed Pagan Press, based in Dorchester, Mass. Lauritsen, who is known for his work in gay history and for his heterodox views of the AIDS epidemic, sent me an advance copy, which arrived as I was on my way to midterm exams. Its thesis is that the poet Percy Bysshe Shelley, and not his wife, the feminist idol, Mary Shelley, wrote “Frankenstein” and that the hidden theme of that book is male love….\nLauritsen assembles an overwhelming case that Mary Shelley, as a badly educated teenager, could not possibly have written the soaring prose of “Frankenstein” (which has her husband’s intensity of tone and headlong cadences all over it) and that the so-called manuscript in her hand is simply one example of the clerical work she did for many writers as a copyist. I was stunned to learn about the destruction of records undertaken by Mary for years after Percy’s death in 1822 in a boating accident in Italy. Crucial pages covering the weeks when “Frankenstein” was composed were ripped out of a journal. And Percy Shelley’s identity as the author seems to have been known in British literary circles, as illustrated by a Knights Quarterly review published in 1824 that Lauritsen reprints in the appendix.\nI don’t recall enough of the book to speak about its underlying theme, but I’ve always been skeptical about the apocryphal tale of book being written due to a ghost story-telling session among the artistic Bohemians.  Then, too, there’s the conceptual link between Percy Shelley’s\nPrometheus Unbound\nand the subtitle of\nFrankenstein\n, “the Modern Prometheus”.  Now, imagine the firestorm of hysteria if it was discovered that there was any possibility that a male “author” had taken credit for his wife’s famous work this way.\nI can’t say that I’ve ever anticipated a gay-themed work of literary non-fiction before, but I really think I’ll have to check out this one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-11T06:25:00+00:00"
}