{
  "url": "https://voxday.net/2007/04/14/good-riddance-4/",
  "scraped_at": "2026-01-08T21:37:38.320848",
  "title": "Good riddance",
  "date_display": "April 14, 2007",
  "date_iso": "2007-04-14T07:02:00+00:00",
  "date_from_url": "2007-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To <a href=\"http://www.foxnews.com/story/0%2C2933%2C266024%2C00.html\">both of these prime examples of modern American society</a>:</p><blockquote><p>Grant said he and his wife were arguing in the upstairs of their suburban Detroit house Feb. 9 over what he said were her frequent work trips.  She walked away, he said, and he grabbed her wrist. Tara Grant then slapped him in the face, causing a scratch to his nose. Stephen Grant, 37, told police he then hit his wife hard in the head and she fell to the floor.</p><p>Tara Grant, 34, told her husband that she would call the police, and he would go to jail for striking her, according to the account. The end result, he claims she said, would be that he would lose custody of the couple’s two young children.</p><p>Stephen Grant told police that he then began to choke his wife.</p></blockquote><p>If you’re going to try to send a man to prison and take his children away <em>for hitting you back</em>, then you deserve to die.  The fact that you’re using the fraudulent “family courts” as accomplices – they’re not actually part of the judiciary, you should know, but merely executive branch bureaucrats – makes it no more right than hiring a pair of Russian mobsters to grab the kids and taking them to Australia.</p><p>That being said, strangling and dismembering the woman on the mere basis of a threat, however credible, is a pretty extreme overreaction.  One cannot excuse the behavior of either party here.</p><p>Still, it should be noted that women have no more carte blanche to start physical fights with men without risking the natural consequences than smaller men do.  I have zero pity for a woman who strikes a man and then gets beaten up; it’s exactly what she or anyone else who starts a physical confrontation deserves.  Yes, some men make a habit of attacking women and they should absolutely be punished accordingly.  And yet, for every one such man, there are likely five women who make a habit of initiating violence.</p><p>Start nothing, finish everything.</p></div>",
  "content_text": "To\nboth of these prime examples of modern American society\n:\nGrant said he and his wife were arguing in the upstairs of their suburban Detroit house Feb. 9 over what he said were her frequent work trips.  She walked away, he said, and he grabbed her wrist. Tara Grant then slapped him in the face, causing a scratch to his nose. Stephen Grant, 37, told police he then hit his wife hard in the head and she fell to the floor.\nTara Grant, 34, told her husband that she would call the police, and he would go to jail for striking her, according to the account. The end result, he claims she said, would be that he would lose custody of the couple’s two young children.\nStephen Grant told police that he then began to choke his wife.\nIf you’re going to try to send a man to prison and take his children away\nfor hitting you back\n, then you deserve to die.  The fact that you’re using the fraudulent “family courts” as accomplices – they’re not actually part of the judiciary, you should know, but merely executive branch bureaucrats – makes it no more right than hiring a pair of Russian mobsters to grab the kids and taking them to Australia.\nThat being said, strangling and dismembering the woman on the mere basis of a threat, however credible, is a pretty extreme overreaction.  One cannot excuse the behavior of either party here.\nStill, it should be noted that women have no more carte blanche to start physical fights with men without risking the natural consequences than smaller men do.  I have zero pity for a woman who strikes a man and then gets beaten up; it’s exactly what she or anyone else who starts a physical confrontation deserves.  Yes, some men make a habit of attacking women and they should absolutely be punished accordingly.  And yet, for every one such man, there are likely five women who make a habit of initiating violence.\nStart nothing, finish everything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-14T06:02:00+00:00"
}