{
  "url": "https://voxday.net/2007/04/28/not-your-kid-not-your-proble/",
  "scraped_at": "2026-01-08T21:39:19.809142",
  "title": "Not your kid, not your problem",
  "date_display": "April 28, 2007",
  "date_iso": "2007-04-28T10:27:00+00:00",
  "date_from_url": "2007-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And if you have any doubts, <a href=\"http://men.msn.com/articlemh.aspx?cp-documentid=4725722&amp;page=1\">you’d better check them out</a>.  I rather admire the calm way the young guy is handling the news that he’s not actually a father.  There’s no need to stone adulterous wives, much better to leave them to sink into poverty and misery.</p><blockquote><p>I’m on the phone with Owen Williams (not his real name), who just found out yesterday that the tired child I hear crying in the background, the child he’s been rocking to sleep every night, the child who carries his name, belongs to some other man. For a person who’s just had his life turned upside down, he seems surprisingly calm.</p><p>Williams is a level-headed guy. He’s 24 years old and working toward a degree in network engineering. He has clear professional goals. He knows what he wants out of life. And this definitely isn’t it.</p><p>The child’s mother comes home from work in another 6 1/2 hours. She doesn’t realize that Williams knows the truth, and he has no plans to tell her. As soon as he finds a new place to live, within a day or two, he hopes, he’s going to leave, and that’s it. “In fact, when I move out, I’m not saying anything, because there’s nothing to be said. For over 15 months, over a year, she deceived me. Every doctor visit I’ve been to, every cookout I’ve been to, every reunion I’ve been to—with her, on her account—I’ve been deceived.”</p><p>Yesterday’s discovery changed things for Williams. “Knowing that I’m not his father is the part that I’m having trouble with,” he explains. “He has nothing to do with what happened between me and her. So I treat him just like any other kid.”</p></blockquote><p>Most women don’t give a damn about the connection between fathers and their real children whenever it stands in the way of a woman’s “happiness” and pursuit of a divorce, so the argument that men shouldn’t be allowed to abandon children that aren’t theirs because “love transcends blood” or whatever is not only spurious, it’s downright disingenuous.</p><p>Not only should they be allowed to, but the women committing such fraud should be forced to reimburse the man for all child-rearing expenses, just as those who commit any other financial fraud must.</p><p>While I very much respect those men who are willing to stand by their not-children and believe that would be my choice, no one has the right to make such a decision for another man one way or the other.  But it’s also worth noting that even if a man chooses to stand by his not-children initially, there’s not a chance in Hell that his lack of paternity won’t be used against him if the marriage falls apart later.</p><p>UPDATE: 94 pages of comments <a href=\"http://boards.msn.com/MensLifestyleboards/thread.aspx?threadid=269432\">are here</a>, and some of the differnt perspectives are quite interesting.  This, however, was probably the funniest remark: <i>OMG I am so embarrassed to be a bearer of the XX chromosome at this moment.  The women justifying this and defending it are the examples of why so many women are single and on anti-depressants- is it any wonder so many viable men of marrying age want to have nothing to do with us.</i></p></div>",
  "content_text": "And if you have any doubts,\nyou’d better check them out\n.  I rather admire the calm way the young guy is handling the news that he’s not actually a father.  There’s no need to stone adulterous wives, much better to leave them to sink into poverty and misery.\nI’m on the phone with Owen Williams (not his real name), who just found out yesterday that the tired child I hear crying in the background, the child he’s been rocking to sleep every night, the child who carries his name, belongs to some other man. For a person who’s just had his life turned upside down, he seems surprisingly calm.\nWilliams is a level-headed guy. He’s 24 years old and working toward a degree in network engineering. He has clear professional goals. He knows what he wants out of life. And this definitely isn’t it.\nThe child’s mother comes home from work in another 6 1/2 hours. She doesn’t realize that Williams knows the truth, and he has no plans to tell her. As soon as he finds a new place to live, within a day or two, he hopes, he’s going to leave, and that’s it. “In fact, when I move out, I’m not saying anything, because there’s nothing to be said. For over 15 months, over a year, she deceived me. Every doctor visit I’ve been to, every cookout I’ve been to, every reunion I’ve been to—with her, on her account—I’ve been deceived.”\nYesterday’s discovery changed things for Williams. “Knowing that I’m not his father is the part that I’m having trouble with,” he explains. “He has nothing to do with what happened between me and her. So I treat him just like any other kid.”\nMost women don’t give a damn about the connection between fathers and their real children whenever it stands in the way of a woman’s “happiness” and pursuit of a divorce, so the argument that men shouldn’t be allowed to abandon children that aren’t theirs because “love transcends blood” or whatever is not only spurious, it’s downright disingenuous.\nNot only should they be allowed to, but the women committing such fraud should be forced to reimburse the man for all child-rearing expenses, just as those who commit any other financial fraud must.\nWhile I very much respect those men who are willing to stand by their not-children and believe that would be my choice, no one has the right to make such a decision for another man one way or the other.  But it’s also worth noting that even if a man chooses to stand by his not-children initially, there’s not a chance in Hell that his lack of paternity won’t be used against him if the marriage falls apart later.\nUPDATE: 94 pages of comments\nare here\n, and some of the differnt perspectives are quite interesting.  This, however, was probably the funniest remark:\nOMG I am so embarrassed to be a bearer of the XX chromosome at this moment.  The women justifying this and defending it are the examples of why so many women are single and on anti-depressants- is it any wonder so many viable men of marrying age want to have nothing to do with us.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-28T09:27:00+00:00"
}