{
  "url": "https://voxday.net/2007/04/11/people-are-unpredictable/",
  "scraped_at": "2026-01-08T21:37:18.047891",
  "title": "People are unpredictable",
  "date_display": "April 11, 2007",
  "date_iso": "2007-04-11T09:36:00+00:00",
  "date_from_url": "2007-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I noticed that my Technorati rank was rising recently, in part because some fake porn sites have apparently decided that their strange business model required linking to VP.  I’m neither upset nor offended by this, only confused… I know these sites make money from enough accidental visits, but I don’t really understand how.</p><p>Anyhow, among the fake cites was a link from a self-described black feminist single mother named Jamila; I naturally assumed that I’d offended her in one way or another.  So, I <a href=\"http://jamilaakil.blogspot.com/2007/04/hypocrites.html#links\">was more than a little surprised to read this</a>:</p><blockquote><p><b>Hypocrites</b></p><p>Exhibit #1: Amanda Marcotte, a liberal, calls Kathleen Parker, a conservative columnist, a Class A Uncle Tom.</p><p>Exhibit #2: Echidne, another liberal, titles a post about Parker “Aunt Thomasina”–an obvious play on the racist label “Uncle Tom.” Also, see this post where Echidne calls Kathleen an Uncle Tom but runs a line through it.</p><p>Kathleen Parker is a white woman.</p></blockquote><p>I wonder if being condemned for being a racist hypocrite by a black feminist single-mother will cause Amynda to slow down and actually consider the fundamental intellectual weakness of her ideology for the first time in her life?  I assume not, but as Jamila demonstrates, people can be less predictable than one tends to assume.</p><p>Jamila is actually has a pretty interesting mind, as evidenced by this unusually self-aware statement: <em>“Obviously, my sexuality was based on false braggadocio. I perceived myself to be confident and aware when in reality I was anything but.”</em></p><p>It’s amazing how most male predators know about this tendency and prey upon it, while many young women not only don’t realize that it exists, but actually tend to mistake that false braggadacio for genuine self-confidence and seek to emulate it.</p><p>I don’t often do this, but I will offer Jamila one piece of unsolicited advice, mostly because it’s the same advice I gave a corporate attorney who found himself out of a job a few years ago due to his commendable unwillingness to generate fraudulent billable hours.  Initially, he didn’t want to take a job that was beneath him and his status as an officer of the court, so he spent more than a year unemployed.</p><p>I told him to take a job, any job, that would keep him in employment shape.  (He was getting a bit too obviously accustomed to his unemployed status.)  He finally agreed and began working in sales at CompUSA for less than one-thirtieth of what he made in his previous job, and over the course of the next year, he turned himself from a computer neophyte into a near-expert while continuing his fruitless round of interviews.</p><p>When he finally got a job as the corporate attorney for a technology company, it his computer expertise that separated him from the hundreds of other lawyers applying.  That company was acquired, then the acquirer was acquired, and within two years of being hired, my friend was made a director of a multi-billion dollar technology multinational.</p><p>I’ve worked “dead-end” jobs, including construction and pizza delivery, and I’m from a fairly comfortable family.  I would say that the expectation of employment and performance has arguably been more helpful to the success I’ve had than the familial wealth.  Perhaps more importantly, nearly every self-made man I know, from the artists to the business billionaires, has held similar jobs, often for extended periods of time.</p><p>The key is this: it is always easier to get a job if you have a job, <em>no matter what that job is.</em> Most employers care far more impressed with a demonstrated willingness to do whatever it takes than they are with a degree from Prestigious Paper Mill University.</p><p>Take the job, any job.  Then excel in it, even as you look for a better one.  Speaking as someone who just signed off on an expensive new engineer last week, there’s nothing a prospective employer checking references likes hearing better than “dammit, I really wish we could keep her, but I understand she can’t afford to turn down the opportunity.”</p></div>",
  "content_text": "I noticed that my Technorati rank was rising recently, in part because some fake porn sites have apparently decided that their strange business model required linking to VP.  I’m neither upset nor offended by this, only confused… I know these sites make money from enough accidental visits, but I don’t really understand how.\nAnyhow, among the fake cites was a link from a self-described black feminist single mother named Jamila; I naturally assumed that I’d offended her in one way or another.  So, I\nwas more than a little surprised to read this\n:\nHypocrites\nExhibit #1: Amanda Marcotte, a liberal, calls Kathleen Parker, a conservative columnist, a Class A Uncle Tom.\nExhibit #2: Echidne, another liberal, titles a post about Parker “Aunt Thomasina”–an obvious play on the racist label “Uncle Tom.” Also, see this post where Echidne calls Kathleen an Uncle Tom but runs a line through it.\nKathleen Parker is a white woman.\nI wonder if being condemned for being a racist hypocrite by a black feminist single-mother will cause Amynda to slow down and actually consider the fundamental intellectual weakness of her ideology for the first time in her life?  I assume not, but as Jamila demonstrates, people can be less predictable than one tends to assume.\nJamila is actually has a pretty interesting mind, as evidenced by this unusually self-aware statement:\n“Obviously, my sexuality was based on false braggadocio. I perceived myself to be confident and aware when in reality I was anything but.”\nIt’s amazing how most male predators know about this tendency and prey upon it, while many young women not only don’t realize that it exists, but actually tend to mistake that false braggadacio for genuine self-confidence and seek to emulate it.\nI don’t often do this, but I will offer Jamila one piece of unsolicited advice, mostly because it’s the same advice I gave a corporate attorney who found himself out of a job a few years ago due to his commendable unwillingness to generate fraudulent billable hours.  Initially, he didn’t want to take a job that was beneath him and his status as an officer of the court, so he spent more than a year unemployed.\nI told him to take a job, any job, that would keep him in employment shape.  (He was getting a bit too obviously accustomed to his unemployed status.)  He finally agreed and began working in sales at CompUSA for less than one-thirtieth of what he made in his previous job, and over the course of the next year, he turned himself from a computer neophyte into a near-expert while continuing his fruitless round of interviews.\nWhen he finally got a job as the corporate attorney for a technology company, it his computer expertise that separated him from the hundreds of other lawyers applying.  That company was acquired, then the acquirer was acquired, and within two years of being hired, my friend was made a director of a multi-billion dollar technology multinational.\nI’ve worked “dead-end” jobs, including construction and pizza delivery, and I’m from a fairly comfortable family.  I would say that the expectation of employment and performance has arguably been more helpful to the success I’ve had than the familial wealth.  Perhaps more importantly, nearly every self-made man I know, from the artists to the business billionaires, has held similar jobs, often for extended periods of time.\nThe key is this: it is always easier to get a job if you have a job,\nno matter what that job is.\nMost employers care far more impressed with a demonstrated willingness to do whatever it takes than they are with a degree from Prestigious Paper Mill University.\nTake the job, any job.  Then excel in it, even as you look for a better one.  Speaking as someone who just signed off on an expensive new engineer last week, there’s nothing a prospective employer checking references likes hearing better than “dammit, I really wish we could keep her, but I understand she can’t afford to turn down the opportunity.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-11T08:36:00+00:00"
}