{
  "url": "https://voxday.net/2007/04/04/sports-gals-debu/",
  "scraped_at": "2026-01-08T21:36:42.748397",
  "title": "The Sports Gal’s debut",
  "date_display": "April 4, 2007",
  "date_iso": "2007-04-04T16:35:00+00:00",
  "date_from_url": "2007-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One often finds it hard to decide if one should pity the Sports Guy or consider him lucky.  Needless to say, I <a href=\"http://sports.espn.go.com/espn/page2/story?page=bachelor/review1\">don’t think she’s likely to join my fan club</a> anytime soon:</p><blockquote><p>Of course, Bill (my husband) was suspicious as soon as we learned Andy’s alma mater was Duke — he kept saying, “You watch, you watch, he’s going to end up being a [bad word].”</p><p>Not even 30 seconds later, we watched Andy get into his fancy sports car, which looked like a DeLorean (do they still make those?) and had those dorky doors that open straight up. I hate when Bill’s right. You should know that my friend Terera and I have a list of things that instantly bother us about guys — like guys who wear man sandals (those leather ones that look like the ones girls would wear, only they’re for guys, I call them “mandals”); guys who wear black jeans <em>check</em> or black tennis shoes <em>check</em>; guys who wear Speedos at the beach; guys who drink daiquiris or frozen mudslides <em>check, assuming Blue Hawaiians count</em>; guys who tuck their sweaters into their pants; and especially, guys who drive weird sports cars (like Miatas or Corvettes).<em>check, although the new Porsche is arguably less weird than the Lamborghini</em></p></blockquote><p>A strong debut, all told.  This sort of column on ESPN doesn’t bother me one one-hundredth as much as women pretending, and failing, to be interested in men’s sports.</p></div>",
  "content_text": "One often finds it hard to decide if one should pity the Sports Guy or consider him lucky.  Needless to say, I\ndon’t think she’s likely to join my fan club\nanytime soon:\nOf course, Bill (my husband) was suspicious as soon as we learned Andy’s alma mater was Duke — he kept saying, “You watch, you watch, he’s going to end up being a [bad word].”\nNot even 30 seconds later, we watched Andy get into his fancy sports car, which looked like a DeLorean (do they still make those?) and had those dorky doors that open straight up. I hate when Bill’s right. You should know that my friend Terera and I have a list of things that instantly bother us about guys — like guys who wear man sandals (those leather ones that look like the ones girls would wear, only they’re for guys, I call them “mandals”); guys who wear black jeans\ncheck\nor black tennis shoes\ncheck\n; guys who wear Speedos at the beach; guys who drink daiquiris or frozen mudslides\ncheck, assuming Blue Hawaiians count\n; guys who tuck their sweaters into their pants; and especially, guys who drive weird sports cars (like Miatas or Corvettes).\ncheck, although the new Porsche is arguably less weird than the Lamborghini\nA strong debut, all told.  This sort of column on ESPN doesn’t bother me one one-hundredth as much as women pretending, and failing, to be interested in men’s sports.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-04T15:35:00+00:00"
}