{
  "url": "https://voxday.net/2007/04/20/sympathy-for-devi/",
  "scraped_at": "2026-01-08T21:38:27.892046",
  "title": "Sympathy for the devil",
  "date_display": "April 20, 2007",
  "date_iso": "2007-04-20T09:15:00+00:00",
  "date_from_url": "2007-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As might have been predicted, it appears that <a href=\"http://apnews.myway.com/article/20070419/D8OJTJD02.html\">one of the primary motivations for the VTU killings</a> was not religion, the lack of religion, Sudden Jihad Syndrome or anything else, merely the sociopathology of modern mass schooling:</p><blockquote><p>Once, in English class, the teacher had the students read aloud, and when it was Cho’s turn, he just looked down in silence, Davids recalled. Finally, after the teacher threatened him with an F for participation, Cho started to read in a strange, deep voice that sounded “like he had something in his mouth,” Davids said.</p><p>“As soon as he started reading, the whole class started laughing and pointing and saying, ‘Go back to China,'” Davids said….</p><p>“There were just some people who were really mean to him and they would push him down and laugh at him,” Roberts said. “He didn’t speak English really well and they would really make fun of him.”</p></blockquote><p>While it’s extremely unjust that Cho chose to unleash his revenge on those who didn’t mistreat him, it’s not hard to understand that source of inner rage that years of constant abuse at school produces.</p><p>Being nearly a year younger than most of the people in my school class and too socially clueless to hide my intelligence, I was unlucky enough to be one of those on the bottom of the social totem pole for most of elementary school and junior high.  It was a combination of three things that changed my social fortunes and my subsequent outlook:</p><p>1.  Because I developed open contempt for my teachers before anyone else did, I was somehow classified with the rebels and budding criminals instead of the complete losers.  When the bad boys and delinquents divided themselves into two “gangs”, I was supremely mystified to find myself invited to join one of them.  It’s hard to remember everything that long ago, but it may have been the first time I was invited to join anything at school.</p><p>2.  Scoring six goals in one game against our archrivals earned the respect of the jocks, who afterwards refused to pick on me, with two notable exceptions.*</p><p>3.  The kindness of one of the most popular guys in our class, who not only came over to my house one weekend in eighth grade but also mentioned it to others the next week.  (It also helped me realize that I had absolutely nothing in common with any of the popular people in my class, but even at that age I recognized it was an extraordinarily decent gesture on his part.)</p><p>It’s almost embarrassing, in retrospect, that such a small thing could make such a big difference, but what it gave me to understand was that my social isolation was not intentional on anyone’s part, it was simply the natural and inevitable result of inherent differences between me and the normal kids.  From then on, I viewed each point of friendly contact as a small victory for foreign relations and each social setback as a minor border skirmish.  My hatred began to rapidly fade until by the latter half of high school the only remainders were a) a distaste for dating girls from my school, and, b) a complete lack of any need for social approval.</p><p>This background is the reason for one of the more important points of The World in Shadow, which is how we are often given the opportunity to make a difference in the lives of others who are at a crucial nexus, and how our inability to see this usually causes us to miss the opportunity.  I don’t know if anyone ever had this opportunity with Cho, perhaps he was simply too screwed up or too narcissistic for anyone to make a positive impact on him, but if they did, we can be sure that they missed it.</p><p>The connection between being victimized at school and unleashing violence isn’t imaginary, in fact, it is so strong that I recently read how police in some states are beginning to ask administrators who the bullies are <em>so that they can keep track of their victims!</em> Now, if that is not sufficient indictment of the public schools for you, then I’d be very curious to know what, if anything, would be.</p><p>Cho’s words seem to echo that point from Shadow, which was written after Columbine: <em>“You had a hundred billion chances and ways to have avoided today.  But you decided to spill my blood. You forced me into a corner and gave me only one option. The decision was yours. Now you have blood on your hands that will never wash off….  You have vandalized my heart, raped my soul and torched my conscience. You thought it was one pathetic boy’s life you were extinguishing. Thanks to you, I died, like Jesus Christ, to inspire generations of the weak and the defenseless people.”</em></p><p>Unfortunately, Cho is likely correct and he surely will serve as an inspiration for the victimized and the bullied, just as Harris and Klebold of Columbine fame have.  And this isn’t necessarily an entirely bad thing, because there’s absolutely no need or excuse for the abuse of the weak by the strong or the victimization of the unpopular by the popular.</p><p><em>* For those of you who’ve read Shadow, Kent Peterson was real.  Although in real life his name was Clark and it was a junior high problem, not a high school one.  By 9th grade, we’d reached an accomodation of sorts.</em></p></div>",
  "content_text": "As might have been predicted, it appears that\none of the primary motivations for the VTU killings\nwas not religion, the lack of religion, Sudden Jihad Syndrome or anything else, merely the sociopathology of modern mass schooling:\nOnce, in English class, the teacher had the students read aloud, and when it was Cho’s turn, he just looked down in silence, Davids recalled. Finally, after the teacher threatened him with an F for participation, Cho started to read in a strange, deep voice that sounded “like he had something in his mouth,” Davids said.\n“As soon as he started reading, the whole class started laughing and pointing and saying, ‘Go back to China,'” Davids said….\n“There were just some people who were really mean to him and they would push him down and laugh at him,” Roberts said. “He didn’t speak English really well and they would really make fun of him.”\nWhile it’s extremely unjust that Cho chose to unleash his revenge on those who didn’t mistreat him, it’s not hard to understand that source of inner rage that years of constant abuse at school produces.\nBeing nearly a year younger than most of the people in my school class and too socially clueless to hide my intelligence, I was unlucky enough to be one of those on the bottom of the social totem pole for most of elementary school and junior high.  It was a combination of three things that changed my social fortunes and my subsequent outlook:\n1.  Because I developed open contempt for my teachers before anyone else did, I was somehow classified with the rebels and budding criminals instead of the complete losers.  When the bad boys and delinquents divided themselves into two “gangs”, I was supremely mystified to find myself invited to join one of them.  It’s hard to remember everything that long ago, but it may have been the first time I was invited to join anything at school.\n2.  Scoring six goals in one game against our archrivals earned the respect of the jocks, who afterwards refused to pick on me, with two notable exceptions.*\n3.  The kindness of one of the most popular guys in our class, who not only came over to my house one weekend in eighth grade but also mentioned it to others the next week.  (It also helped me realize that I had absolutely nothing in common with any of the popular people in my class, but even at that age I recognized it was an extraordinarily decent gesture on his part.)\nIt’s almost embarrassing, in retrospect, that such a small thing could make such a big difference, but what it gave me to understand was that my social isolation was not intentional on anyone’s part, it was simply the natural and inevitable result of inherent differences between me and the normal kids.  From then on, I viewed each point of friendly contact as a small victory for foreign relations and each social setback as a minor border skirmish.  My hatred began to rapidly fade until by the latter half of high school the only remainders were a) a distaste for dating girls from my school, and, b) a complete lack of any need for social approval.\nThis background is the reason for one of the more important points of The World in Shadow, which is how we are often given the opportunity to make a difference in the lives of others who are at a crucial nexus, and how our inability to see this usually causes us to miss the opportunity.  I don’t know if anyone ever had this opportunity with Cho, perhaps he was simply too screwed up or too narcissistic for anyone to make a positive impact on him, but if they did, we can be sure that they missed it.\nThe connection between being victimized at school and unleashing violence isn’t imaginary, in fact, it is so strong that I recently read how police in some states are beginning to ask administrators who the bullies are\nso that they can keep track of their victims!\nNow, if that is not sufficient indictment of the public schools for you, then I’d be very curious to know what, if anything, would be.\nCho’s words seem to echo that point from Shadow, which was written after Columbine:\n“You had a hundred billion chances and ways to have avoided today.  But you decided to spill my blood. You forced me into a corner and gave me only one option. The decision was yours. Now you have blood on your hands that will never wash off….  You have vandalized my heart, raped my soul and torched my conscience. You thought it was one pathetic boy’s life you were extinguishing. Thanks to you, I died, like Jesus Christ, to inspire generations of the weak and the defenseless people.”\nUnfortunately, Cho is likely correct and he surely will serve as an inspiration for the victimized and the bullied, just as Harris and Klebold of Columbine fame have.  And this isn’t necessarily an entirely bad thing, because there’s absolutely no need or excuse for the abuse of the weak by the strong or the victimization of the unpopular by the popular.\n* For those of you who’ve read Shadow, Kent Peterson was real.  Although in real life his name was Clark and it was a junior high problem, not a high school one.  By 9th grade, we’d reached an accomodation of sorts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-20T08:15:00+00:00"
}