{
  "url": "https://voxday.net/2007/04/16/total-ar/",
  "scraped_at": "2026-01-08T21:37:52.941821",
  "title": "The High Art of Games + Romero interview",
  "date_display": "April 16, 2007",
  "date_iso": "2007-04-16T08:05:00+00:00",
  "date_from_url": "2007-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>HALO and the High Art of Games: a history of the First Person Shooter</b><br> From <a href=\"http://www.amazon.com/Halo-Effect-Unauthorized-Successful-Video/dp/1933771119/ref=pd_bbs_sr_3/102-9331982-9775369?ie=UTF8&amp;s=books&amp;qid=1176709259&amp;sr=8-3\">The HALO Effect</a><br> BenBella Books, April 2007</br></br></p><p>In 1849, the great composer Richard Wagner described what he considered to be the ideal artwork of the future, a holistic unification of the high arts he christened Gesamtkunstwerk.  Wagner proposed this artistic vision as a “fire cure” for mankind, which would accomplish its miraculous effect by altering human sensibilities in the future from understanding to feeling.  Gestamtkunstwerk was to be created by merging the distinct arts of music, poetry and dance with architecture, sculpture and painting, resulting in a revolutionary new form that would provide the audience with a sublime, purely emotional experience.</p><p>143 years later, Wagner’s vision of Total Art saw what may have been its first partial realization by four young men working together in Texas.  Inspired by a classic Apple II game about a prisoner attempting to escape from a Nazi prison, John Carmack, John Romero, Tom Hall and Adrian Carmack started id Software and produced Wolfenstein 3D, which was not intended as art but pure entertainment for adrenaline junkies.  While it might be stretching metaphor too far to assert that Wolfenstein 3D incorporated poetry into the visceral violence it offered, the game definitely combined discernable elements of music, architecture, sculpture and painting in creating a sensual, emotional experience that was undeniably sublime.</p><p>And few who witnessed another individual attempting to escape from the dread Nazi stronghold’s ten levels would attempt to argue that the art of dance was entirely absent.  The non-stop, arrhythmic side-to-side motion of the player as he involuntarily mimicked the evasive motions of his on-screen avatar was a striking aspect of the game, one that bears testimony to the complete immersion of the player’s consciousness in the virtual experience.</p><p>The power of that immersion is all the more impressive when one considers the crudity of the five Wagnerian elements involved in Wolfenstein 3D.  While Bobby Prince’s award-winning music was rivaled only by The Fat Man’s within the game industry at the time, it consisted of nothing but 22 kilohertz synthesized electronics piped through an 8-bit Soundblaster.  The architecture was a simplistic Bauhaus interpretation of a lab rat’s maze, the sculpture was not only cartoonish but was not even truly three-dimensional and the painting was limited by the low-resolution VGA graphics and a palette of only 256 colors.</p><p>Neither the storyline nor the characters were exactly what one would describe as complex.  If BJ Blazkowicz’s motivation in escaping from a Nazi prison was not hard to understand, those of his antagonists, Hans Grosse, the evil Dr. Schabbs and robo-Hitler, remain a mystery.  And yet, the whole was greater than the sum of the parts, for if the emotions inspired by the game were rather less lofty than those invoked by the Ring Cycle, they were arguably more powerful.  While I have seen men and women cry at the opera, I have never heard more piercing screams than from an audience of one caught up in watching a session of Wolfenstein 3D.</p><p>But although it was the first great step towards Gesamtkunstwerk and brought the now-popular genre of the 3D action game into the public consciousness, Wolfenstein 3D was not the original first-person shooter.  That honor belongs to a game called Spasim, which dates back to 1974 and is remarkable not only for its early use of a first-person perspective and 3D wireframe graphics, but also due to its incorporation of worldwide online multiplayer action.  Like Maze War, a rival claimant for the title of first first-person shooter, Spasim ran on mainframe computers and was mostly played at universities.</p><p>Star Raiders, which ran on the Atari 400 computer, appeared in 1979 and was the first of many space combat games.  Its use of wireframe graphics and true 3D makes it worthy of note, but of far more ultimate importance to the genre was Richard Garriott’s Akalabeth: World of Doom, which was written for the Apple II in BASIC and distributed in plastic bags by Garriott himself in 1980 prior to California Pacific’s decision to pick up the publishing rights.</p><p>Akalabeth was the first computer game I remember playing, and although its black-and-white graphics were primitive stick figures and its screen refreshes were measured in seconds per frame instead of frames per second, it was nevertheless as absorbing and as exciting in its own way as the Dungeons &amp; Dragons role-playing game it was designed to mimic.  Despite its first-person perspective and its obvious visual relationship to Wolfenstein 3D and subsequent first-person shooters, though, Akalabeth is not often cited as a genre precursor, mostly because of its massive role in another gaming genre, namely, that of the role-playing game.</p><p>For if its graphics foreshadowed the shooter, the game itself was the direct ancestor of one of the great game series of all time, namely, Ultima.  In fact, Akalabeth is unofficially known as Ultima 0 and Richard Garriott may be better known as the persona in which he appears in the Ultima games, Lord British.  While the first-person perspective remained in the dungeon-crawling portions of many subsequent Ultima games and in every later RPG from Wizardry series to the Daggerfall line, the focus of the gameplay never revolved around the perspective, which is why the genre to which Wolfenstein 3D and HALO belong requires being delineated as a first-person “shooter” or a 3D “action” game.</p><p>But the importance of Akalabeth to the first-person shooter genre does not end with its graphical perspective.  For in 1987, Origin Systems, the very successful company that Richard Garriott founded to produce Ultimas III through IX, (to say nothing of Autoduel, the Ultima Underworlds, and the Wing Commander series), hired a twenty-year old programmer named John Romero to port Apple II games to the Commodore 64.</p><p>But if Wolfenstein made id’s two Johns, Romero and Carmack, successful, it was Doom that made them notorious and confirmed that the first-person shooter was a bona fide gaming genre in its own right.  Whereas the incorporation of fear had been largely incidental to the design in Wolf, it was an overt and intentional element of Doom from its moment of conception.  From its ominous strings to the elements of madness in the storyline, from the terrifying appearance of the oversized monsters to the ghastly chainsaw-and-bazooka butchery in which the player is forced to engage, Doom was an awesome and overwhelming experience that didn’t so much leave an emotional impression on the player as an intense psychic beating.</p><p>Doom inspired a host of imitators based on similar 2.5D technology, collectively known as Doom-clones.  Unfortunately, too many publishers and game designers failed to understand that what made Doom such a visceral and absorbing experience was the way in which it provoked an emotional reaction from the player.  The abrupt shift from silence and darkness, interrupted only by eerie strings and guttural breathing, to the roar of a saw carving through hordes of shrieking, flame-throwing demons could leave a player fired up and unable to sleep for hours after turning off the computer.  These lesser game makers failed to see the art, they saw only the blood.</p><p>These Doom-clones ranged from the good (Heretic and Star Wars: Dark Forces) to the bad (Chex Quest, Witchhaven, TekWar), the ugly (Rise of the Triad, Redneck Rampage), and the obscure (CyClones, Rebel Moon, Powerslave).  GT Interactive, which acquired the publishing rights to Doom II and published more Doom-clones than one can count on both hands, even went so far as to publish a game entitled, quite simply, Blood.</p><p>Each clone attempted to add something new to the basic game concept or at least put a different shine to it in order to capture a share of Doom’s massive market.  Heretic, HeXen and Witchhaven made use of fantasy settings, Dark Forces allowed the player to enter the Star Wars universe, Rise of the Triad introduced environmental modification and jump pads, Rebel Moon Rising experimented with speech recognition and TekWar paid testimony to the fact that William Shatner’s name did not sell games as effectively as books.</p><p>The two most successful clones were Duke Nukem 3D and Deer Hunter.  Duke Nukem combined humor with excellent gameplay and caused more gamers to quote the movie “They Live” than have ever seen it or even heard of it.  It was also controversial for its inclusion of gyrating strippers and generally more adult themes than had been seen before in computer games not designed primarily as pixellated soft porn.  But for all of Duke Nukem’s success, Deer Hunter was arguably the more important game as despite its outdated technology and simplistic gameplay, it created the sub-genre of the hunting game and introduced millions of non-gamers to computer gaming while simultaneously opening up a new software distribution channel through mainstream retailers such as Walmart, Target and even Cabelas.</p><p>While the rest of the industry was moving to catch up to id Software, however, id was raising the bar even higher.  In 1996, Carmack and Romero introduced Quake, which was rather dark, ugly and muddy in comparison with the brightly colored Doom and its clones, but introduced true 3D graphics to the genre.  The move to 3D was not as revolutionary as it appears since a number of 3D games outside the first-person shooter genre had already been produced, but it was significant since it drove the hardware manufacturers to supply the 3D acceleration hardware needed for the tremendous amount of mathematical computations required by the new 3D gaming engines.</p><p>Few development houses and even fewer publishers were prepared to blow off nearly every computer in existence by setting minimum system requirements higher than that being shipped by the computer manufacturers, but John Carmack was, and is, a performance junkie and with three massive hits under id’s belt, no one was about to tell him that what he wanted to do was unreasonable.  Indeed, even mainstream giants such as Intel and Microsoft were willing to cater to Carmack, knowing that in feeding the voracious appetite of performance-hungry gamers, they were generating the need for a new generation of hardware.</p><p>And Quake was a huge success, although not primarily due to its disturbing 3D environments or its Internet gameplay, but because of Carmack’s brilliant decision to open up significant aspects of the game to would-be designers.  This allowed players to not only modify their characters and create their own 3D environments, but to actually create different games within the game, such as team capture the flag.  If Quake did not offer much in the way of single-player innovation, it nevertheless represents an important point of departure in the first-person shooter between games designed in the traditional manner for a single human player and those designed with multiplayer action in mind.  Indeed, Quake III: Arena, Starsiege: Tribes, Unreal Tournament and Wolfenstein: Enemy Territory, don’t even offer an option for solo play.</p><p>The game industry, like many industries, is remarkably small when seen from the inside.  Although it has grown dramatically over the last decade, there are those who still remember when Chris Crawford held the first Computer Game Developer’s Conference in his living room in 1987.  One result, presumably unforseen by John Carmack or anyone else, was the way in which Quake’s open architecture would open the way for new talent to enter the industry.</p><p>The ability to experiment with Quake inspired many would-be game designers.  In one case of particular note, two Microsoft employees who had worked there long enough to amass the resources necessary to acquire a license to the Quake engine.  Unlike the many Doom-licensees of a generation before, however, Gabe Newell and Mike Harrington were not content to simply churn out another Quake clone, but instead made clever use of scripted sequences and in-game cinematics, thus turning what had previously been a series of distinct levels into a continuous, plot-driven narrative.</p><p>Half-Life was hugely successful.  But it was not the only popular post-Quake first-person shooter.  The gaming world had been waiting for Unreal for years, ever since Epic announced it by showing off an extremely misleading series of beautiful screenshots that could never possibly have run on the unaccelerated computer system it claimed was the minimum system required.  But after a delay of almost two years, Unreal was finally completed in time for the E3 show in 1998 and unlike most long-delayed games, it proved worthy of the wait.</p><p>Bad and belated translations of the most popular games to consoles notwithstanding, first-person shooters were almost exclusively developed for PCs due to their greater video memory and ability to make use of special 3D acceleration cards.  But finally, with the release of the sixth-generation of video consoles which contained the same sort of 3D acceleration chips around which the PC cards were built, it became possible for video gamers to enjoy the fast first-person shooter action which had hitherto required a much more expensive computer.</p><p>While the Sega Dreamcast was more known for fighting games such as Soul Calibur and strange translations of unusual Japanese games, GoldenEye 007 became a major hit on the Nintendo 64.  Although it preceded both Half-Life and Thief: The Dark Project, GoldenEye made use of its James Bond storyline and stealthy tactics in a manner remniscent of both popular PC games.  It also offered surprisingly good multiplayer action.  Although a sequel was produced, GoldenEye: Rogue Agent, another first-person shooter from the same development team, Perfect Dark, saw more success.</p><p>Sony’s PS/2, being the most popular of the three systems, naturally saw a plethora of first-person shooters produced for it or ported to it.  However, the games most popular on the PlayStation have been military-related shooters, especially those dealing with World War II.  While GT Interactive’s Nam was an early, PC-based military shooter, the sub-genre really took off with Tom Clancy’s Ghost Recon series.  That modern combat game was followed by other shooters such as Medal of Honor, Battlefield 1942, and Call of Duty, all of which are set in various WWII theatres.  These military shooters tend to be even more heavily scripted than Half-Life and feature fewer puzzles and a much more realistic appearance than most first-person shooters.</p><p>At this point, it is perhaps worth noting that despite its importance in the early days of gaming, the name of Apple has hardly appeared since the early 1980s.  Despite the sigificance of the Apple II to many of the game industry’s most important figures, Apple ceased to be relevant once VGA and 320×200, 256 color graphics became available on the IBM PC.  Despite the Macintosh’s graphical operating system and technological superiority, Apple’s problematic relationship with third-party vendors and its relative lack of mass popularity meant that game developers had little incentive to write software for the Macintosh.  Thus, most Mac games were either amateurish ripoffs of more popular PC games or outdated ports of games that had been popular some years before.</p><p>But every niche finds someone to fill it in the end.  A little company got its start in the game industry by producing a freeware Pong-clone called Gnop!, then, in 1993, produced the first Macintosh FPS called Pathways Into Darkness, which was a rather unattractive little game that looked rather like a cross between Ultima Underworld  and Mitch Albom’s “Five People You Meet In Heaven”.  Bungie followed that up with Marathon, which was known as “Doom for the Mac” and, as is customary in Macintosh cult circles, was widely asserted to be much better than Doom despite the fact that neither it nor its sequel, Durendal, even featured modem network play, nor any gameplay elements that approached id’s ghastly genius.</p><p>Bungie publicly announced Halo: Combat Evolved at the 1999 Macworld Expo, but the acquisition of the company by Microsoft less than a year later meant that the game would be released on Microsoft’s new Xbox console instead of for the Mac OS.  This was a major coup for Microsoft and may have even saved the Xbox from an embarrassing failure, as with the exception of Dead or Alive 3, a fighting game franchise most notable for lavish attention paid to the large and wobbly breasts of its female characters, there were no significant games that required an Xbox to play them.</p><p>Every new console needs its killer game in order to survive, and fortunately for Microsoft, Halo proved to be that game.  Halo followed Half-Life’s lead in moving away from the concept of static, puzzle-based levels, which tended to reduce gameplay to a simple matter of finding a key to unlock the final door, as its use of more realistic sci-fi environments allowed the gamer to enter more fully into the game’s universe.  In this, Bungie was likely aided by its experience in developing strategy games, as the 3D outside environments of Myth inspired its designers to think beyond the dungeon-crawl mentality that had been a feature of the genre since Akalabeth.</p><p>The ability to climb into vehicles and make use of them only made the experience richer and more compelling, but perhaps even more impressive was Halo’s ability to overcome the limitations of the Xbox controller.  Prior to Halo, the ports of first-person shooters from PCs to video game consoles had been very disappointing and the lack of a mouse made the situation even more problematic.  Compounding this was the Xbox’s dreadful game controller, which was almost completely unsuited for human hands.</p><p>Nevertheless, Halo’s designers managed to overcome this triple challenge and triggered an onslaught of console-based first-person shooters that shows no signs of stopping anytime soon.  And yet, despite its success both in terms of gameplay innovation and market success, its most lasting legacy may well be an artistic one.  For in 2003, a small group of inebriated game reviewers in Texas created what was intended to be a little parody movie using Halo’s ability to record gameplay as a cinematic sequence. This eventually turned into Red vs. Blue: The Blood Gulch Chronicles, an ongoing machinima series which now has four seasons available on DVD.</p><p>And while games and their machinimatic offspring are still currently well below the radar of the arts community, it is worth noting that there is no other medium which is so well suited for the expression of Wagner’s Gesamtkunstwerk.  There is no shortage of music in the genre, Halo even won a “best original soundtrack” from Rolling Stone magazine and award-winning composers such as John Williams have been writing music for computer games for more than a decade now.</p><p>3D environments are no longer limited to first-person shooters, of course, the popularity of the games has driven computer manufacturers to build 3D acceleration right onto the motherboard of most machines sold today and one can visit real cities from Chicago to Rome in various games, to say nothing of fictional places such as Vice City.  These environments not only incorporate architecture, but many of them are actually built by trained architects, using the same software used to design buildings in the real world.</p><p>The same technology is used for the characters who inhabit these worlds, a virtual sculpture that shapes true three-dimensional objects from pixels that can then be used for solid freeform fabrication to create actual physical sculptures.  Painting, being a mere two-dimensional art, is simple and has been an integral part of gaming since programmers realized that machines were fast enough to push more than their blocky, home-made pixel-art and began hiring genuine artists.</p><p>It is true that neither poetry nor dance figure prominently in any games yet produced, but the technology is already there to support both.  The development of synthetic speech technology means that even the longest poem need not be pre-recorded as canned wave samples, and even allows for the use of poems generated by in-game artificial intelligences.  The possibilities for dance are even more obvious, as motion capture technology is now sophisticated enough to record and replay the most challenging ballet movements; it is only the fact that the gaming world is almost completely divorced from the world of the cultural arts that has prevented these possibilities from hitherto being realized.</p><p>The imaginative observer may even ascertain unique aspects of Gesamtkunstwerk in HALO proper.  At the very beginning of the game, the player is drawn to participate in a ballet of sorts, as the militarily improbable firefight on the beach owes as much to dance as it does to modern projectile combat.  The open environment with its mountain-ringed bowl open to the sky takes on an aspect of a stage, albeit one without an audience, as the player alternately bounds forward and leaps from side to side as he attempts to keep pace with the rest of his troupe.</p><p>And HALO’s use of reusable environments in the place of idiosyncratic puzzle-driven levels brings architecture to the fore, as it is used to for three purposes: to establish a sense of place, to tell a piece of the storyline in a visual format and to provide a physical platform for the gameplay experience.  In this, the game’s architecture is asked to fulfill a role similar to that played by the cathedrals of the medieval period, buildings which were expected to tell a story as well as serving a purpose.  That the architecture of HALO is more ethereal than that of the cathedral and that it serves more mundane ends does not lesson the similarity of the usage.  Indeed, there are devotees of pure materialism who might reasonably insist that the game’s ultimate object of temporal amusement is more concrete than the cathedral’s purposeful glorification of a trans-temporal sky deity.</p><p>It is only in its attempt to provide a richer storyline that HALO’s designers consciously attempt to fulfill an important artistic aspect of Total Art that is nevertheless not one of the six primary Gesamtkunstwerkgrundheiten.   In this, I would argue that they were not entirely successful, but unlike Doom, Quake or Half-Life, they were successful enough to create what promises to be an ongoing story, and one that will, like the Ring Cycle, surely spawn offshoots providing a wide variety of experiences.</p><p>While the world may pray it never sees abominations such as Quake: Swan Lake or Nutcracker 3D: Triumph of the Mouse King, the fact remains that first-person shooters such as HALO prove that Wagner’s vision of Total Art is technologically feasible at last.  It is impossible to say who will be the first genius to identify himself as a Total Artist and create a holistic work worthy of being proclaimed a Gesamtkunstwerk, but his appearance is all but inevitable now that the technological groundwork has been completed.  The palm leaves are strewn, the ass awaits, only the identity of this first New Wagnerian and the nature of his creation remains to be revealed to Mankind.</p><p><em>Vox Day is a novelist and game designer.  As to the inevitable question of what he was drinking when he wrote this, the answer is Amaretto.</em></p><p><b>AN INTERVIEW WITH JOHN ROMERO</b></p><p><em>John Romero is the co-founder of legendary game developer id Software and the designer of genre-defining 3D action games Wolfenstein 3D, Doom, Heretic and Quake.  He is currently designing a Massive Multiplayer Online Game with his new game development house, Slipgate Ironworks.</em></p><p>VD:  Was Wolfenstein 3D one of the first games to incorporate emotion into gaming?</p><p>JR: Emotion?</p><p>VD: Fear is an emotion.</p><p>JR: With Wolf, the fear came out of the way the game was being designed.  We weren’t trying to elicit fear at first, the motivation was to make the player feel successful and powerful, we wanted him to have a great time.  But as we were developing the game, the way we made the AI technology work, we designed kind of an interesting way of helping the AI by using sound zones.  We made use of that in Doom and other games use it now, but prior to that most games used the monster’s point-of-view.</p><p>In Wolf we wanted to not only have that point-of-view reaction, but we wanted to activate enemy AI with sound.  Every room had a fill zone, so if you were looking at the map you’d see it marked with different colors indicating different zones.  A room would have a different color than the adjacent hallway, so when you opened the door, it would flood fill the colors together into one sound zone.</p><p>That made things start getting scarier, you had to start thinking about the consequences of your actions and anticipate the reactions to them.  We were doing things to make the AI cooler, but this also started to make the game scarier.</p><p>In looking back, what happened in the process of making the game was that we ended up modeling it after the original game18.  One of the coolest things was that the original was scary, especially when the SS were following you from room to room.  When the SS came in after you and there was this digitized sound sample –</p><p>VD: Schweinhund!</p><p>JR: Yeah, we wanted that.  We weren’t trying to focus on fear, but it became scary when we tried to recreate that sense of being a prisoner trying to escape.</p><p>VD: So in Wolf, the inclusion of emotion was somewhat accidental and stemmed mostly from the technology, but in Doom you were playing upon the player’s fear.  That was obviously intentional.</p><p>JR: I think we took it to another level with Doom.  If we modeled Wolf after the original, which inspired some fear, then Doom was modeled after Aliens, which of course was very scary.  By the time we got to doing Quake, we had basically come to understand that fear was a great component of our games.  And with Quake, we tried to pull the horror from a different direction, we were using a more psychological, Lovecraftian kind of fear in that one.  That was more disturbing and visceral than the fear inspired by Doom.</p><p>We took that concept right down to the graphic level.  If you look at games nowadays, even compared to Quake running at 640, it looks and feels very different than all the new and shiny 3D stuff.  It looks dirty, even the environment creeps you out.</p><p>VD: How will game designers inspire emotional reactions from players in the future?</p><p>JR: Fear is really primal.  More complex emotions require higher brain functions and it takes more design support to trigger that sort of thing.  Love, for example, takes a lot more character development.  So really, triggering the base instinct stuff is what we can do now.  Messing with more complex emotions is easier in other mediums because they’re more limited than games, you know, movies and books aren’t interactive.  To do it in an interactive medium, you’d have to focus on it.  It would be difficult.  A studio that’s been around for a long time with a set team, a designer with a clear path and serious resources would be the one of the few that could go forward with something like that.  You know, with goals like: “I want the player to fall in love.” Or “I want the player to cry when this character gets wiped out.”</p><p>VD: I’m afraid your terminology betrays your orientation towards the base instinct stuff.</p><p>JR: (laughs)  It was so sad when his skull got fucking vaporized!</p><p>VD: Does scripted gameplay of the sort seen in Half-Life and HALO offer the possibility for more emotional involvement on the part of the player?</p><p>JR: Scripting definitely offers a way towards that kind of thing.  But second-by-second gameplay is really important.  You shouldn’t just try to stretch the gameplay with cinematics because the non-player characters are traveling with you and their fate is wrapped up with yours.  What happens to them should have a greater effect on you.  You should have to care for them.  Actually, that was one thing I was trying to do with Daikatana, you had to work with the secondary characters to keep them in the game and if they died the game was over.  Unfortunately, the code wasn’t supportive of that level of involvement.</p></div>",
  "content_text": "HALO and the High Art of Games: a history of the First Person Shooter\nFrom\nThe HALO Effect\nBenBella Books, April 2007\nIn 1849, the great composer Richard Wagner described what he considered to be the ideal artwork of the future, a holistic unification of the high arts he christened Gesamtkunstwerk.  Wagner proposed this artistic vision as a “fire cure” for mankind, which would accomplish its miraculous effect by altering human sensibilities in the future from understanding to feeling.  Gestamtkunstwerk was to be created by merging the distinct arts of music, poetry and dance with architecture, sculpture and painting, resulting in a revolutionary new form that would provide the audience with a sublime, purely emotional experience.\n143 years later, Wagner’s vision of Total Art saw what may have been its first partial realization by four young men working together in Texas.  Inspired by a classic Apple II game about a prisoner attempting to escape from a Nazi prison, John Carmack, John Romero, Tom Hall and Adrian Carmack started id Software and produced Wolfenstein 3D, which was not intended as art but pure entertainment for adrenaline junkies.  While it might be stretching metaphor too far to assert that Wolfenstein 3D incorporated poetry into the visceral violence it offered, the game definitely combined discernable elements of music, architecture, sculpture and painting in creating a sensual, emotional experience that was undeniably sublime.\nAnd few who witnessed another individual attempting to escape from the dread Nazi stronghold’s ten levels would attempt to argue that the art of dance was entirely absent.  The non-stop, arrhythmic side-to-side motion of the player as he involuntarily mimicked the evasive motions of his on-screen avatar was a striking aspect of the game, one that bears testimony to the complete immersion of the player’s consciousness in the virtual experience.\nThe power of that immersion is all the more impressive when one considers the crudity of the five Wagnerian elements involved in Wolfenstein 3D.  While Bobby Prince’s award-winning music was rivaled only by The Fat Man’s within the game industry at the time, it consisted of nothing but 22 kilohertz synthesized electronics piped through an 8-bit Soundblaster.  The architecture was a simplistic Bauhaus interpretation of a lab rat’s maze, the sculpture was not only cartoonish but was not even truly three-dimensional and the painting was limited by the low-resolution VGA graphics and a palette of only 256 colors.\nNeither the storyline nor the characters were exactly what one would describe as complex.  If BJ Blazkowicz’s motivation in escaping from a Nazi prison was not hard to understand, those of his antagonists, Hans Grosse, the evil Dr. Schabbs and robo-Hitler, remain a mystery.  And yet, the whole was greater than the sum of the parts, for if the emotions inspired by the game were rather less lofty than those invoked by the Ring Cycle, they were arguably more powerful.  While I have seen men and women cry at the opera, I have never heard more piercing screams than from an audience of one caught up in watching a session of Wolfenstein 3D.\nBut although it was the first great step towards Gesamtkunstwerk and brought the now-popular genre of the 3D action game into the public consciousness, Wolfenstein 3D was not the original first-person shooter.  That honor belongs to a game called Spasim, which dates back to 1974 and is remarkable not only for its early use of a first-person perspective and 3D wireframe graphics, but also due to its incorporation of worldwide online multiplayer action.  Like Maze War, a rival claimant for the title of first first-person shooter, Spasim ran on mainframe computers and was mostly played at universities.\nStar Raiders, which ran on the Atari 400 computer, appeared in 1979 and was the first of many space combat games.  Its use of wireframe graphics and true 3D makes it worthy of note, but of far more ultimate importance to the genre was Richard Garriott’s Akalabeth: World of Doom, which was written for the Apple II in BASIC and distributed in plastic bags by Garriott himself in 1980 prior to California Pacific’s decision to pick up the publishing rights.\nAkalabeth was the first computer game I remember playing, and although its black-and-white graphics were primitive stick figures and its screen refreshes were measured in seconds per frame instead of frames per second, it was nevertheless as absorbing and as exciting in its own way as the Dungeons & Dragons role-playing game it was designed to mimic.  Despite its first-person perspective and its obvious visual relationship to Wolfenstein 3D and subsequent first-person shooters, though, Akalabeth is not often cited as a genre precursor, mostly because of its massive role in another gaming genre, namely, that of the role-playing game.\nFor if its graphics foreshadowed the shooter, the game itself was the direct ancestor of one of the great game series of all time, namely, Ultima.  In fact, Akalabeth is unofficially known as Ultima 0 and Richard Garriott may be better known as the persona in which he appears in the Ultima games, Lord British.  While the first-person perspective remained in the dungeon-crawling portions of many subsequent Ultima games and in every later RPG from Wizardry series to the Daggerfall line, the focus of the gameplay never revolved around the perspective, which is why the genre to which Wolfenstein 3D and HALO belong requires being delineated as a first-person “shooter” or a 3D “action” game.\nBut the importance of Akalabeth to the first-person shooter genre does not end with its graphical perspective.  For in 1987, Origin Systems, the very successful company that Richard Garriott founded to produce Ultimas III through IX, (to say nothing of Autoduel, the Ultima Underworlds, and the Wing Commander series), hired a twenty-year old programmer named John Romero to port Apple II games to the Commodore 64.\nBut if Wolfenstein made id’s two Johns, Romero and Carmack, successful, it was Doom that made them notorious and confirmed that the first-person shooter was a bona fide gaming genre in its own right.  Whereas the incorporation of fear had been largely incidental to the design in Wolf, it was an overt and intentional element of Doom from its moment of conception.  From its ominous strings to the elements of madness in the storyline, from the terrifying appearance of the oversized monsters to the ghastly chainsaw-and-bazooka butchery in which the player is forced to engage, Doom was an awesome and overwhelming experience that didn’t so much leave an emotional impression on the player as an intense psychic beating.\nDoom inspired a host of imitators based on similar 2.5D technology, collectively known as Doom-clones.  Unfortunately, too many publishers and game designers failed to understand that what made Doom such a visceral and absorbing experience was the way in which it provoked an emotional reaction from the player.  The abrupt shift from silence and darkness, interrupted only by eerie strings and guttural breathing, to the roar of a saw carving through hordes of shrieking, flame-throwing demons could leave a player fired up and unable to sleep for hours after turning off the computer.  These lesser game makers failed to see the art, they saw only the blood.\nThese Doom-clones ranged from the good (Heretic and Star Wars: Dark Forces) to the bad (Chex Quest, Witchhaven, TekWar), the ugly (Rise of the Triad, Redneck Rampage), and the obscure (CyClones, Rebel Moon, Powerslave).  GT Interactive, which acquired the publishing rights to Doom II and published more Doom-clones than one can count on both hands, even went so far as to publish a game entitled, quite simply, Blood.\nEach clone attempted to add something new to the basic game concept or at least put a different shine to it in order to capture a share of Doom’s massive market.  Heretic, HeXen and Witchhaven made use of fantasy settings, Dark Forces allowed the player to enter the Star Wars universe, Rise of the Triad introduced environmental modification and jump pads, Rebel Moon Rising experimented with speech recognition and TekWar paid testimony to the fact that William Shatner’s name did not sell games as effectively as books.\nThe two most successful clones were Duke Nukem 3D and Deer Hunter.  Duke Nukem combined humor with excellent gameplay and caused more gamers to quote the movie “They Live” than have ever seen it or even heard of it.  It was also controversial for its inclusion of gyrating strippers and generally more adult themes than had been seen before in computer games not designed primarily as pixellated soft porn.  But for all of Duke Nukem’s success, Deer Hunter was arguably the more important game as despite its outdated technology and simplistic gameplay, it created the sub-genre of the hunting game and introduced millions of non-gamers to computer gaming while simultaneously opening up a new software distribution channel through mainstream retailers such as Walmart, Target and even Cabelas.\nWhile the rest of the industry was moving to catch up to id Software, however, id was raising the bar even higher.  In 1996, Carmack and Romero introduced Quake, which was rather dark, ugly and muddy in comparison with the brightly colored Doom and its clones, but introduced true 3D graphics to the genre.  The move to 3D was not as revolutionary as it appears since a number of 3D games outside the first-person shooter genre had already been produced, but it was significant since it drove the hardware manufacturers to supply the 3D acceleration hardware needed for the tremendous amount of mathematical computations required by the new 3D gaming engines.\nFew development houses and even fewer publishers were prepared to blow off nearly every computer in existence by setting minimum system requirements higher than that being shipped by the computer manufacturers, but John Carmack was, and is, a performance junkie and with three massive hits under id’s belt, no one was about to tell him that what he wanted to do was unreasonable.  Indeed, even mainstream giants such as Intel and Microsoft were willing to cater to Carmack, knowing that in feeding the voracious appetite of performance-hungry gamers, they were generating the need for a new generation of hardware.\nAnd Quake was a huge success, although not primarily due to its disturbing 3D environments or its Internet gameplay, but because of Carmack’s brilliant decision to open up significant aspects of the game to would-be designers.  This allowed players to not only modify their characters and create their own 3D environments, but to actually create different games within the game, such as team capture the flag.  If Quake did not offer much in the way of single-player innovation, it nevertheless represents an important point of departure in the first-person shooter between games designed in the traditional manner for a single human player and those designed with multiplayer action in mind.  Indeed, Quake III: Arena, Starsiege: Tribes, Unreal Tournament and Wolfenstein: Enemy Territory, don’t even offer an option for solo play.\nThe game industry, like many industries, is remarkably small when seen from the inside.  Although it has grown dramatically over the last decade, there are those who still remember when Chris Crawford held the first Computer Game Developer’s Conference in his living room in 1987.  One result, presumably unforseen by John Carmack or anyone else, was the way in which Quake’s open architecture would open the way for new talent to enter the industry.\nThe ability to experiment with Quake inspired many would-be game designers.  In one case of particular note, two Microsoft employees who had worked there long enough to amass the resources necessary to acquire a license to the Quake engine.  Unlike the many Doom-licensees of a generation before, however, Gabe Newell and Mike Harrington were not content to simply churn out another Quake clone, but instead made clever use of scripted sequences and in-game cinematics, thus turning what had previously been a series of distinct levels into a continuous, plot-driven narrative.\nHalf-Life was hugely successful.  But it was not the only popular post-Quake first-person shooter.  The gaming world had been waiting for Unreal for years, ever since Epic announced it by showing off an extremely misleading series of beautiful screenshots that could never possibly have run on the unaccelerated computer system it claimed was the minimum system required.  But after a delay of almost two years, Unreal was finally completed in time for the E3 show in 1998 and unlike most long-delayed games, it proved worthy of the wait.\nBad and belated translations of the most popular games to consoles notwithstanding, first-person shooters were almost exclusively developed for PCs due to their greater video memory and ability to make use of special 3D acceleration cards.  But finally, with the release of the sixth-generation of video consoles which contained the same sort of 3D acceleration chips around which the PC cards were built, it became possible for video gamers to enjoy the fast first-person shooter action which had hitherto required a much more expensive computer.\nWhile the Sega Dreamcast was more known for fighting games such as Soul Calibur and strange translations of unusual Japanese games, GoldenEye 007 became a major hit on the Nintendo 64.  Although it preceded both Half-Life and Thief: The Dark Project, GoldenEye made use of its James Bond storyline and stealthy tactics in a manner remniscent of both popular PC games.  It also offered surprisingly good multiplayer action.  Although a sequel was produced, GoldenEye: Rogue Agent, another first-person shooter from the same development team, Perfect Dark, saw more success.\nSony’s PS/2, being the most popular of the three systems, naturally saw a plethora of first-person shooters produced for it or ported to it.  However, the games most popular on the PlayStation have been military-related shooters, especially those dealing with World War II.  While GT Interactive’s Nam was an early, PC-based military shooter, the sub-genre really took off with Tom Clancy’s Ghost Recon series.  That modern combat game was followed by other shooters such as Medal of Honor, Battlefield 1942, and Call of Duty, all of which are set in various WWII theatres.  These military shooters tend to be even more heavily scripted than Half-Life and feature fewer puzzles and a much more realistic appearance than most first-person shooters.\nAt this point, it is perhaps worth noting that despite its importance in the early days of gaming, the name of Apple has hardly appeared since the early 1980s.  Despite the sigificance of the Apple II to many of the game industry’s most important figures, Apple ceased to be relevant once VGA and 320×200, 256 color graphics became available on the IBM PC.  Despite the Macintosh’s graphical operating system and technological superiority, Apple’s problematic relationship with third-party vendors and its relative lack of mass popularity meant that game developers had little incentive to write software for the Macintosh.  Thus, most Mac games were either amateurish ripoffs of more popular PC games or outdated ports of games that had been popular some years before.\nBut every niche finds someone to fill it in the end.  A little company got its start in the game industry by producing a freeware Pong-clone called Gnop!, then, in 1993, produced the first Macintosh FPS called Pathways Into Darkness, which was a rather unattractive little game that looked rather like a cross between Ultima Underworld  and Mitch Albom’s “Five People You Meet In Heaven”.  Bungie followed that up with Marathon, which was known as “Doom for the Mac” and, as is customary in Macintosh cult circles, was widely asserted to be much better than Doom despite the fact that neither it nor its sequel, Durendal, even featured modem network play, nor any gameplay elements that approached id’s ghastly genius.\nBungie publicly announced Halo: Combat Evolved at the 1999 Macworld Expo, but the acquisition of the company by Microsoft less than a year later meant that the game would be released on Microsoft’s new Xbox console instead of for the Mac OS.  This was a major coup for Microsoft and may have even saved the Xbox from an embarrassing failure, as with the exception of Dead or Alive 3, a fighting game franchise most notable for lavish attention paid to the large and wobbly breasts of its female characters, there were no significant games that required an Xbox to play them.\nEvery new console needs its killer game in order to survive, and fortunately for Microsoft, Halo proved to be that game.  Halo followed Half-Life’s lead in moving away from the concept of static, puzzle-based levels, which tended to reduce gameplay to a simple matter of finding a key to unlock the final door, as its use of more realistic sci-fi environments allowed the gamer to enter more fully into the game’s universe.  In this, Bungie was likely aided by its experience in developing strategy games, as the 3D outside environments of Myth inspired its designers to think beyond the dungeon-crawl mentality that had been a feature of the genre since Akalabeth.\nThe ability to climb into vehicles and make use of them only made the experience richer and more compelling, but perhaps even more impressive was Halo’s ability to overcome the limitations of the Xbox controller.  Prior to Halo, the ports of first-person shooters from PCs to video game consoles had been very disappointing and the lack of a mouse made the situation even more problematic.  Compounding this was the Xbox’s dreadful game controller, which was almost completely unsuited for human hands.\nNevertheless, Halo’s designers managed to overcome this triple challenge and triggered an onslaught of console-based first-person shooters that shows no signs of stopping anytime soon.  And yet, despite its success both in terms of gameplay innovation and market success, its most lasting legacy may well be an artistic one.  For in 2003, a small group of inebriated game reviewers in Texas created what was intended to be a little parody movie using Halo’s ability to record gameplay as a cinematic sequence. This eventually turned into Red vs. Blue: The Blood Gulch Chronicles, an ongoing machinima series which now has four seasons available on DVD.\nAnd while games and their machinimatic offspring are still currently well below the radar of the arts community, it is worth noting that there is no other medium which is so well suited for the expression of Wagner’s Gesamtkunstwerk.  There is no shortage of music in the genre, Halo even won a “best original soundtrack” from Rolling Stone magazine and award-winning composers such as John Williams have been writing music for computer games for more than a decade now.\n3D environments are no longer limited to first-person shooters, of course, the popularity of the games has driven computer manufacturers to build 3D acceleration right onto the motherboard of most machines sold today and one can visit real cities from Chicago to Rome in various games, to say nothing of fictional places such as Vice City.  These environments not only incorporate architecture, but many of them are actually built by trained architects, using the same software used to design buildings in the real world.\nThe same technology is used for the characters who inhabit these worlds, a virtual sculpture that shapes true three-dimensional objects from pixels that can then be used for solid freeform fabrication to create actual physical sculptures.  Painting, being a mere two-dimensional art, is simple and has been an integral part of gaming since programmers realized that machines were fast enough to push more than their blocky, home-made pixel-art and began hiring genuine artists.\nIt is true that neither poetry nor dance figure prominently in any games yet produced, but the technology is already there to support both.  The development of synthetic speech technology means that even the longest poem need not be pre-recorded as canned wave samples, and even allows for the use of poems generated by in-game artificial intelligences.  The possibilities for dance are even more obvious, as motion capture technology is now sophisticated enough to record and replay the most challenging ballet movements; it is only the fact that the gaming world is almost completely divorced from the world of the cultural arts that has prevented these possibilities from hitherto being realized.\nThe imaginative observer may even ascertain unique aspects of Gesamtkunstwerk in HALO proper.  At the very beginning of the game, the player is drawn to participate in a ballet of sorts, as the militarily improbable firefight on the beach owes as much to dance as it does to modern projectile combat.  The open environment with its mountain-ringed bowl open to the sky takes on an aspect of a stage, albeit one without an audience, as the player alternately bounds forward and leaps from side to side as he attempts to keep pace with the rest of his troupe.\nAnd HALO’s use of reusable environments in the place of idiosyncratic puzzle-driven levels brings architecture to the fore, as it is used to for three purposes: to establish a sense of place, to tell a piece of the storyline in a visual format and to provide a physical platform for the gameplay experience.  In this, the game’s architecture is asked to fulfill a role similar to that played by the cathedrals of the medieval period, buildings which were expected to tell a story as well as serving a purpose.  That the architecture of HALO is more ethereal than that of the cathedral and that it serves more mundane ends does not lesson the similarity of the usage.  Indeed, there are devotees of pure materialism who might reasonably insist that the game’s ultimate object of temporal amusement is more concrete than the cathedral’s purposeful glorification of a trans-temporal sky deity.\nIt is only in its attempt to provide a richer storyline that HALO’s designers consciously attempt to fulfill an important artistic aspect of Total Art that is nevertheless not one of the six primary Gesamtkunstwerkgrundheiten.   In this, I would argue that they were not entirely successful, but unlike Doom, Quake or Half-Life, they were successful enough to create what promises to be an ongoing story, and one that will, like the Ring Cycle, surely spawn offshoots providing a wide variety of experiences.\nWhile the world may pray it never sees abominations such as Quake: Swan Lake or Nutcracker 3D: Triumph of the Mouse King, the fact remains that first-person shooters such as HALO prove that Wagner’s vision of Total Art is technologically feasible at last.  It is impossible to say who will be the first genius to identify himself as a Total Artist and create a holistic work worthy of being proclaimed a Gesamtkunstwerk, but his appearance is all but inevitable now that the technological groundwork has been completed.  The palm leaves are strewn, the ass awaits, only the identity of this first New Wagnerian and the nature of his creation remains to be revealed to Mankind.\nVox Day is a novelist and game designer.  As to the inevitable question of what he was drinking when he wrote this, the answer is Amaretto.\nAN INTERVIEW WITH JOHN ROMERO\nJohn Romero is the co-founder of legendary game developer id Software and the designer of genre-defining 3D action games Wolfenstein 3D, Doom, Heretic and Quake.  He is currently designing a Massive Multiplayer Online Game with his new game development house, Slipgate Ironworks.\nVD:  Was Wolfenstein 3D one of the first games to incorporate emotion into gaming?\nJR: Emotion?\nVD: Fear is an emotion.\nJR: With Wolf, the fear came out of the way the game was being designed.  We weren’t trying to elicit fear at first, the motivation was to make the player feel successful and powerful, we wanted him to have a great time.  But as we were developing the game, the way we made the AI technology work, we designed kind of an interesting way of helping the AI by using sound zones.  We made use of that in Doom and other games use it now, but prior to that most games used the monster’s point-of-view.\nIn Wolf we wanted to not only have that point-of-view reaction, but we wanted to activate enemy AI with sound.  Every room had a fill zone, so if you were looking at the map you’d see it marked with different colors indicating different zones.  A room would have a different color than the adjacent hallway, so when you opened the door, it would flood fill the colors together into one sound zone.\nThat made things start getting scarier, you had to start thinking about the consequences of your actions and anticipate the reactions to them.  We were doing things to make the AI cooler, but this also started to make the game scarier.\nIn looking back, what happened in the process of making the game was that we ended up modeling it after the original game18.  One of the coolest things was that the original was scary, especially when the SS were following you from room to room.  When the SS came in after you and there was this digitized sound sample –\nVD: Schweinhund!\nJR: Yeah, we wanted that.  We weren’t trying to focus on fear, but it became scary when we tried to recreate that sense of being a prisoner trying to escape.\nVD: So in Wolf, the inclusion of emotion was somewhat accidental and stemmed mostly from the technology, but in Doom you were playing upon the player’s fear.  That was obviously intentional.\nJR: I think we took it to another level with Doom.  If we modeled Wolf after the original, which inspired some fear, then Doom was modeled after Aliens, which of course was very scary.  By the time we got to doing Quake, we had basically come to understand that fear was a great component of our games.  And with Quake, we tried to pull the horror from a different direction, we were using a more psychological, Lovecraftian kind of fear in that one.  That was more disturbing and visceral than the fear inspired by Doom.\nWe took that concept right down to the graphic level.  If you look at games nowadays, even compared to Quake running at 640, it looks and feels very different than all the new and shiny 3D stuff.  It looks dirty, even the environment creeps you out.\nVD: How will game designers inspire emotional reactions from players in the future?\nJR: Fear is really primal.  More complex emotions require higher brain functions and it takes more design support to trigger that sort of thing.  Love, for example, takes a lot more character development.  So really, triggering the base instinct stuff is what we can do now.  Messing with more complex emotions is easier in other mediums because they’re more limited than games, you know, movies and books aren’t interactive.  To do it in an interactive medium, you’d have to focus on it.  It would be difficult.  A studio that’s been around for a long time with a set team, a designer with a clear path and serious resources would be the one of the few that could go forward with something like that.  You know, with goals like: “I want the player to fall in love.” Or “I want the player to cry when this character gets wiped out.”\nVD: I’m afraid your terminology betrays your orientation towards the base instinct stuff.\nJR: (laughs)  It was so sad when his skull got fucking vaporized!\nVD: Does scripted gameplay of the sort seen in Half-Life and HALO offer the possibility for more emotional involvement on the part of the player?\nJR: Scripting definitely offers a way towards that kind of thing.  But second-by-second gameplay is really important.  You shouldn’t just try to stretch the gameplay with cinematics because the non-player characters are traveling with you and their fate is wrapped up with yours.  What happens to them should have a greater effect on you.  You should have to care for them.  Actually, that was one thing I was trying to do with Daikatana, you had to work with the secondary characters to keep them in the game and if they died the game was over.  Unfortunately, the code wasn’t supportive of that level of involvement.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2007-04-16T07:05:00+00:00"
}