{
  "url": "https://voxday.net/2007/04/24/what-morality-would-that-be/",
  "scraped_at": "2026-01-08T21:38:54.187972",
  "title": "What morality would that be?",
  "date_display": "April 24, 2007",
  "date_iso": "2007-04-24T17:47:00+00:00",
  "date_from_url": "2007-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting how American liberals are always happy to bandy moral imperatives about, so long as they are <a href=\"http://www.nytimes.com/2007/04/24/opinion/24tue1.html\">in direct opposition to traditional Judeo-Christian morality</a>:</p><blockquote><p>The news that Gov. Eliot Spitzer will soon introduce a bill to legalize same-sex marriage — what he calls “a simple moral imperative” — is welcome and could give new national momentum to this important cause….</p><p>It should be clear that these religious institutions have the right to refuse to marry anyone within their own religious houses. But they should not be allowed to dictate who can and cannot be married by the state.</p></blockquote><p>What is the basis for this so-called “simple moral imperative” and why, exactly, is it imperative?  Why is this morality any more acceptable than the morality which demands honor killings for promiscuous young women?  And given that no such institution has ever existed in the history of Mankind, why is it an “important cause”.</p><p>In any case, calling the legal union of two men a “marriage” doesn’t make it one no matter how many laws declaring this to be so are passed; Spitzer might as well pass a law declaring that any collection of six fish are henceforth to be known as a “marriage”.</p><p>This, conservatives, is the inevitable result of attempting to use state power to define social standards.  Live by the state, die by the state.  If you don’t bring the state into it in the first place, its power can’t be turned and used against you.</p><p>The answer to my first question, of course, can be found in the following sentence.  Emphasis added:</p><blockquote><p>The majority leader, Joseph Bruno, has made it clear that he is against same-sex marriage, but he is also a pragmatist whose views on these issues have evolved and become <b>more humane</b> over the years.</p></blockquote><p>I note that once again, we see that pragmatism is merely another word for an absence of principle.</p></div>",
  "content_text": "It’s interesting how American liberals are always happy to bandy moral imperatives about, so long as they are\nin direct opposition to traditional Judeo-Christian morality\n:\nThe news that Gov. Eliot Spitzer will soon introduce a bill to legalize same-sex marriage — what he calls “a simple moral imperative” — is welcome and could give new national momentum to this important cause….\nIt should be clear that these religious institutions have the right to refuse to marry anyone within their own religious houses. But they should not be allowed to dictate who can and cannot be married by the state.\nWhat is the basis for this so-called “simple moral imperative” and why, exactly, is it imperative?  Why is this morality any more acceptable than the morality which demands honor killings for promiscuous young women?  And given that no such institution has ever existed in the history of Mankind, why is it an “important cause”.\nIn any case, calling the legal union of two men a “marriage” doesn’t make it one no matter how many laws declaring this to be so are passed; Spitzer might as well pass a law declaring that any collection of six fish are henceforth to be known as a “marriage”.\nThis, conservatives, is the inevitable result of attempting to use state power to define social standards.  Live by the state, die by the state.  If you don’t bring the state into it in the first place, its power can’t be turned and used against you.\nThe answer to my first question, of course, can be found in the following sentence.  Emphasis added:\nThe majority leader, Joseph Bruno, has made it clear that he is against same-sex marriage, but he is also a pragmatist whose views on these issues have evolved and become\nmore humane\nover the years.\nI note that once again, we see that pragmatism is merely another word for an absence of principle.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-24T16:47:00+00:00"
}