{
  "url": "https://voxday.net/2007/04/18/yellow-line/",
  "scraped_at": "2026-01-08T21:38:13.087395",
  "title": "The yellow line",
  "date_display": "April 18, 2007",
  "date_iso": "2007-04-18T14:58:00+00:00",
  "date_from_url": "2007-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve had a few thoughts about the general cowardice of the thin blue line before, but Crispy <a href=\"http://crispy23.blogspot.com/2007/04/thoughts-of-wild-man-late-at-night.html\">clarifies the reality</a> rather nicely:</p><blockquote><p>When I watch TV with some of my friends, we are amazed with how fearful “SWAT” teams react to situations. Let’s put this in perspective. These guys are wearing more body armor than American soldiers who are down range, they have bullet proof shields &amp; a greater array of weapon systems than most Army infantry platoons. They are only facing one person, in most situations, and how do they react?</p><p>They don’t. They wait for hours upon hours and fearfully stand behind trees and become distraught when they find out the suspect has a bow &amp; arrow with hunting tips inside the house because “that sort of thing can tear straight through our body armor”.</p></blockquote><p>Now, in fairness, the very last thing you want is a gung ho police force.  There’s a reason that police historically make very bad soldiers and soldiers make even worse police.  So this, shall we say, <em>reluctance</em> to engage and put themselves at risk is not entirely bad.</p><p>But the complete inability of the overrated SWAT teams – who despite their faux militarization are apparently good for little more than scaring crack whores and killing innocent and unarmed people in bed late at night – to even begin responding substantively to situations when there’s nothing but a crazy kid with a pair of pop guns, really borders on the absurd.</p><p>And these are the very people you hope are going to defend you because you can’t bother to defend yourself?  Good luck with that.</p></div>",
  "content_text": "I’ve had a few thoughts about the general cowardice of the thin blue line before, but Crispy\nclarifies the reality\nrather nicely:\nWhen I watch TV with some of my friends, we are amazed with how fearful “SWAT” teams react to situations. Let’s put this in perspective. These guys are wearing more body armor than American soldiers who are down range, they have bullet proof shields & a greater array of weapon systems than most Army infantry platoons. They are only facing one person, in most situations, and how do they react?\nThey don’t. They wait for hours upon hours and fearfully stand behind trees and become distraught when they find out the suspect has a bow & arrow with hunting tips inside the house because “that sort of thing can tear straight through our body armor”.\nNow, in fairness, the very last thing you want is a gung ho police force.  There’s a reason that police historically make very bad soldiers and soldiers make even worse police.  So this, shall we say,\nreluctance\nto engage and put themselves at risk is not entirely bad.\nBut the complete inability of the overrated SWAT teams – who despite their faux militarization are apparently good for little more than scaring crack whores and killing innocent and unarmed people in bed late at night – to even begin responding substantively to situations when there’s nothing but a crazy kid with a pair of pop guns, really borders on the absurd.\nAnd these are the very people you hope are going to defend you because you can’t bother to defend yourself?  Good luck with that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-04-18T13:58:00+00:00"
}