{
  "url": "https://voxday.net/2025/04/18/death-and-the-place-of-the-skull/",
  "scraped_at": "2026-01-08T20:17:02.704268",
  "title": "DEATH AND THE PLACE OF THE SKULL",
  "date_display": "April 18, 2025",
  "date_iso": "2025-04-18T09:12:24+00:00",
  "date_from_url": "2025-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is one of the short stories from DEATH AND THE DEVIL, which will be published in ebook format in the next week or two.</em> <em>The theme strikes me as appropriate for Good Friday.</em></p><p>It is a well-established fact across most of the known multiverse that death is, generally speaking, the end of life. This is the sort of obvious statement that most beings understand intuitively, in the same way they understand that water is wet or that the line of traffic you’re not driving in will always move faster than the one you selected.</p><p>What is less well established, and indeed known to only a select few cosmic entities, is that there are occasional exceptions to this rule. Not many, mind you—perhaps ten or twelve across the entirety of existence. But when they do occur, they tend to cause no end of paperwork.</p><p>Death was having what, for him, amounted to a moderately busy Friday. The Romans were at it again with their crucifixions, and while Death understood the practical necessity of his role in the great cosmic machinery, he couldn’t help but find the Romans’ enthusiasm for creatively prolonging the process somewhat trying. Crucifixion was particularly bothersome—it was slow, messy, and sometimes required him to hover about for hours waiting for the final moment to arrive. It was inefficient, and if there was one thing Death disliked, it was inefficiency.</p><p>Outside the walls of Jerusalem, on a small hill that locals called “The Place of the Skull” (humans did have a flair for the dramatic that Death could almost appreciate), three crosses stood starkly against the bright morning sky. A sizeable crowd had gathered—some jeering, some weeping, some simply watching with the detached curiosity of those who have nothing better to do with their afternoon than observe the suffering of others.</p><p>Death materialized beside the center cross, his black robe somehow remaining pristine despite the dust that swirled across the hilltop. His scythe gleamed with an impossible light, as if it were reflecting stars that weren’t visible in the daytime sky.</p><p>I AM EARLY, Death said, his voice not so much heard as felt, like the final note of a funeral dirge played on the bones of the universe. He consulted a small hourglass that appeared in his skeletal hand. The sand was still flowing, though it had noticeably thinned to the bottom half. There was time yet.</p><p>Death was not alone in his invisible observation of the proceedings. Slightly to his left, luxuriating in the heat that rose from the baked earth, lounged a figure that radiated a different kind of darkness. This darkness wasn’t the simple absence of light that characterized Death’s appearance, but rather a corrupted, oily absence of goodness.</p><p>“Lovely day for a crucifixion, isn’t it?” said the Devil, his voice as smooth as expensive honey with just a hint of ground glass mixed in. He wore the shape of a handsome middle-aged man with olive skin and curly black hair, dressed in a toga of deepest crimson that seemed to shift and flow like liquid. Only his eyes—amber with vertical pupils—gave away his inhuman nature.</p><p>Death did not respond. He had long ago learned that engaging the Devil in conversation inevitably led to tedious debates about the nature of free will or sales pitches for various soul-collection optimization schemes.</p><p>The Devil seemed undeterred by Death’s silence. “Quite the turnout for this one,” he continued, gesturing at the crowd around the central cross. “Special case, you know. I’ve had my eye on him for years. All those irritating miracles, healing the sick, giving sight to the blind.” He made a dismissive gesture. “Bad for business, you know, that sort of thing.”</p><p>Death remained silent, watching the sand in the hourglass.</p><p>“Oh, come now,” the Devil prodded. “He’s been a thorn in your side too! Remember, he’s the one who interfered with your soul-reaping.”</p><p>At this, Death’s eye sockets seemed to narrow slightly, the silver pinpricks of light within them intensifying.</p><p>YES, he said finally. I REMEMBER.</p><p>The memory was, for Death, quite a vivid one, despite having occurred several years earlier by human reckoning. He had appeared in Bethany to collect the soul of a man who had succumbed to an illness that baffled the local physicians. It had initially been a straightforward collection—Death had appeared at the appointed time, raised his scythe, and completed his duty with his usual efficiency. The soul had been collected, the hourglass emptied, the paperwork filed. End of story.</p><p>It should have been, anyhow.</p><p>Four days later, Death had received an urgent message from the Department of Post-Mortem Records about an “anomalous post-mortem event.” He had returned to Bethany to find something unprecedented—Lazarus, very much alive, moving about, eating, breathing, and talking, despite having been quite thoroughly dead, reaped, and buried days before.</p><p>More perplexing still was the matter of his second hourglass. Every mortal had exactly one hourglass, created at birth and destroyed at death. Lazarus’s hourglass had been properly disposed of following the collection of his soul. Yet somehow he was alive again, and he also had a new hourglass in the usual location—but from whence had it come? Who had authorized it? Death checked and rechecked the records, but he could find no indication of how this administrative nightmare had occurred.</p><p>And at the center of this troublesome accounting error was the same man who now hung on the central cross.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://voxday.net/2025/04/18/death-and-the-place-of-the-skull/#more-67193\"><img alt=\"\" class=\"wp-image-67204\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/04/image-12.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/04/image-12.png 512w, https://voxday.net/wp-content/uploads/2025/04/image-12-300x300.png 300w, https://voxday.net/wp-content/uploads/2025/04/image-12-150x150.png 150w\" width=\"512\"/></a></figure></div> <span id=\"more-67193\"></span><p>“He’s made quite a nuisance of himself these last three years,” the Devil continued. “Even turned me down on a really sweet deal I offered him. But today—today he’ll regret not taking it!”</p><p>Death regarded the man on the cross with greater interest. Humans who had witnessed or experienced resurrection were exceedingly rare, and a man who could actually bring one about was unique in his experience. Death didn’t hold grudges—he was far too professional for that—but he did maintain what he considered to be a responsible professional curiosity about any exceptions to the natural order when they surfaced now and again.</p><p>Without warning, three more figures materialized around the Devil. All three were archdevils of considerable power, who rarely bothered to pay much attention to current events in the mortal realm except in exceptional circumstances. Which, apparently this incipient death was, for some reason Death could not fathom.</p><p>The first looked like a caricature of a Roman aristocrat, a grossly obese man wearing a crown of roast meats set with precious stones, his skin glistening with sweat and what appeared to be various sauces and condiments. This was Gulvalax, Archdevil of Gluttony, who took particular pleasure in tempting humans to consume far beyond their needs. His expression was gleefully malicious as he took in the three men dying in front of them.</p><p>Beside him materialized what seemed at first glance to be a stunningly beautiful woman, although her appearance readily altered itself depending on the viewer’s preferences and desires. This was Lucrezia, Archdeviless of Lust, whose specialty was incredibly obvious, even to one as immune to her ever-transient charms as Death.</p><p>The third figure was harder to perceive, seeming to exist in a perpetual state of counting invisible coins stored in metaphysical banks throughout the multiverse, his fingers moving constantly as his eyes darted about, expertly assessing the material value of everything and everyone. This was, of course, Mammon, Archdevil of Greed.</p><p>“My dear subordinates,” the Devil announced with the air of a host at an exclusive gathering, “I am absolutely delighted to present today’s main attraction to you. The so-called, self-professed ‘Son of God,’ who today is meeting the fate that he so richly merits.”</p><p>Gulvalax belched appreciatively, releasing a green cloud of fumes that would have made a living person retch. “About time. Do you know how many feasts and orgies he’s ruined with his tedious sermons about not even needing a pillow?”</p><p>“What about that nonsense about it being easier for a camel to pass through the eye of a needle than for a rich man to enter Heaven,” added Mammon, his voice like coins clinking together. “Reprehensible!”</p><p>“Not to mention,” purred Lucrezia, “his entirely unsound policy on adultery. Live and let love, I say.”</p><p>The Devil smiled at the enthusiasm of his lieutenants. “Indeed. And yet, for all his parable-spouting, he walked right into our trap. Those Pharisees barely even required any encouragement—a touch of envy here, a whisper of threatened power there—and look at him now! The once-loved miracle worker, now spat upon by the masses and dying like any common criminal.”</p><p>Death, who had been watching the sand in the hourglass with his customary patience, found himself growing uncomfortable with the infernal conversation. It wasn’t that he had any particular opinion on the man currently dying on the cross—Death was strictly impartial when it came to the souls he collected; neither Heaven nor Hell meant anything to him. But something about the malicious gloating of the Devil and his archdevils struck him as… a little distasteful.</p><p>The figure on the central cross had been silent for some time, his head bowed, his breathing labored. Now he raised his head slightly and spoke, his voice barely audible to the crowd below: “Father, forgive them, for they know not what they do.”</p><p>The Devil hissed softly, his pleasant appearance momentarily flickering to reveal something significantly less human underneath. “Always with the forgiveness. How tediously predictable. Will you just hurry up and die already?”</p><p>IT WON’T BE LONG NOW.</p><p>The sun was still climbing high in the sky as the three condemned men struggled to breathe, pushing themselves up against the nails that fixed them to their crosses for each painful inhalation. The crowd had already thinned somewhat as the spectacle stretched into its final hour, many growing bored or uncomfortable with the prolonged nature of the execution.</p><p>Death waited patiently, the hourglass in his hand showing that the appointed time was drawing nigh.</p><p>“I never really got a proper chance with him,” complained Lucrezia. “I even sent some of my best human agents his way too—that redhead from Magdala was particularly promising.”</p><p>“I tried tempting him with bread when he was in the desert,” added Gulvalax. “Never seen anyone turn down food after forty days without eating. Most unnatural.”</p><p>Death, who had developed the cosmic equivalent of tuning out annoying background chatter over his eons of existence, focused instead on the three hourglasses that had appeared before him—one for each of the condemned men. The sand in the central one was now moving in a most peculiar manner, sometimes seeming to flow upward against gravity before resuming its normal downward trajectory.</p><p>Most curious, Death thought. He had seen many hourglasses over the countless millennia of his existence, but never one that behaved in this fashion. Then, as often happened, one of the dying men looked up and met what passed for his eyes.</p><p>“I know you,” the man said softly, his words meant for Death alone. “We’ve met before.”</p><p>YES.</p><p>“I hope it didn’t cause you too much trouble.”</p><p>IT WAS AN ADMINISTRATIVE COMPLICATION. THESE THINGS HAPPEN OCCASIONALLY.</p><p>“I imagine they do,” the man agreed. Then, after a pause: “Is it time yet?”</p><p>Death consulted the central hourglass. NOT QUITE, he said. BUT VERY SOON.</p><p>The man nodded slightly, then turned his attention to the sky, which had begun to darken despite it being midday. “And so it begins,” he said.</p><p>The Devil, who had been regaling his lieutenants with stories of his various successes at corrupting various prophets, kings, and other holy men, suddenly noticed the darkness spreading across the sky. The archdevils, too, paused in their chatter.</p><p>“What’s happening?” demanded Mammon, his constantly counting fingers momentarily stilling. “This isn’t natural.”</p><p>Indeed, it wasn’t. The expanding darkness wasn’t the result of clouds or any other natural phenomena. It was as if light itself was being selectively removed from the sky, starting from the horizon and spreading toward the hilltop where they stood.</p><p>The crowd below had noticed it too, many pointing upward with expressions of fear and confusion. Some began to hurry away from the crucifixion site, making signs to ward off evil or whispering prayers to various deities.</p><p>Death, who existed partially outside the normal flow of time and could perceive events with greater clarity than most beings, sensed a shift in the cosmic balance. It was subtle but unmistakable, like the first tremor before an earthquake or the intake of breath before a shout.</p><p>The Devil’s darkly handsome face had grown pale, his amber eyes darting from the darkening sky to the man on the central cross and back again. “This is… unexpected,” he admitted, his usual smooth confidence faltering slightly.</p><p>Gulvalax had begun stress-eating an ethereal banquet that materialized around him, stuffing phantom delicacies into his mouth with increasing desperation. Lucrezia’s form was shifting more rapidly than before, unable to settle on a single appearance as her mood wavered. Mammon had resumed counting, faster than ever, as if trying to calculate the cost-benefit ratio of remaining in the mortal realm versus a strategic retreat.</p><p>Death remained unmoved, his attention fixed on the hourglasses before him. The sand continued to flow, marking the inexorable approach of his duty. The strange behavior of the central hourglass had intensified, with more grains moving upward than down, creating a paradoxical situation where the sand neither emptied nor filled but somehow did both simultaneously.</p><p>As the darkness spread across the sky, finally reaching and enveloping the place of the skull, the dying man on the middle cross cried out in a loud voice: “Father, into your hands I commend my spirit!”</p><p>At that exact moment, the sand in his hourglass did something Death had never seen before—it exploded outward, shattering the glass container but remaining suspended in the air, each grain glowing with an inner light that pierced the unnatural darkness.</p><p>And the man died.</p><p>Death raised his scythe, his duty clear despite the peculiar circumstances. As he prepared to collect the soul, however, he found himself hesitating. The soul was there in front of him, ready for the reaping, and yet something about it was different from any soul he had encountered before. It was as if it were simultaneously present and elsewhere, both departing and remaining, both ending and continuing.</p><p>But no sooner had his scythe touched the body than the soul addressed him directly.</p><p>“Thank you for coming so soon,” he said, with the air of someone expressing appreciation for a plumber who has shown up unexpectedly early to fix a leaky pipe under the sink. “I can’t say I particularly enjoyed that. Well, I’ll see you in three days.”</p><p>Death stared at the soul, not understanding what was happening.</p><p>The Devil, seeing Death’s discombobulation, smiled triumphantly. “I’ll take it from here,” he said, his handsome human appearance melting away to reveal his true form—a powerful being of living shadow and flame, with great curved horns and eyes like burning coals.</p><p>With a gesture of his clawed hands, the Devil tore open the very fabric of reality. Through this rift poured scores, then centuries, then thousands of demons—foul creatures of smoke and spite, of cruelty given form, of malice made manifest. They swarmed toward the soul, chittering and cackling with anticipation and glee.</p><p>“TAKE HIM, MY LEGIONS!” the Devil commanded, his voice no longer smooth but a discordant chorus of pain and hatred. “DRAG HIM DOWN TO THE DEEPEST PIT! LET HIM KNOW ETERNAL TORMENT FOR THE DISRESPECT HE HAS SHOWN YOUR KING!”</p><p>The demons surged forward, their misshapen hands grasping at the soul—only to pass through it as if it were made of mist. Again and again they tried, their claws slashing at something they could not quite grasp, like shadows trying to capture light.</p><p>The beleagured soul observed all of the demonic <em>Sturm und Drang</em> engulfing him with remarkable tranquility and a faint smile on his face, as if he was watching an overly enthusiastic theatrical performance being put on by the local schoolchildren.</p><p>“This is all very impressive,” he said to the Devil, whose expression had rapidly shifted from triumph to confusion, and was now beginning to show the first signs of being worried. “But you have no power over me. You never did.”</p><p>“IMPOSSIBLE!” the Devil roared, the ground trembling beneath his fury. “YOU BECAME FLESH! AND NOW YOU ARE DEAD! YOUR BODY IS BROKEN! YOUR BLOOD IS SPILLED! YOUR SOUL HAS BEEN REAPED! YOU BELONG TO ME!”</p><p>“No,” the soul replied calmly. “I don’t.”</p><p>Cowering before their master’s rage, the great mass of demons began to retreat, their slavering eagerness replaced by terror. They drew back behind the King of Hell, who stood alone now before the soul.</p><p>“This can’t be right,” the Devil hissed, flames erupting from his eyes and mouth. “You lived as a mortal. You died as a mortal. Therefore you are mine now. Your soul belongs in Gehenna with all the the rest.”</p><p>What would have been the soul’s eyes were it still alive danced with what Death thought looked suspiciously like amusement.</p><p>“Yes, that’s where I intend to go. I never said I wouldn’t accompany you voluntarily.” He held out his hands in front of him, the bloody holes the Roman spikes had driven through them still visible in his spectral form. “I’ll even permit you to bind me.”</p><p>“Bind him!” the Devil snapped, and he pointed at a towering demon whose molten hide cracked with each movement to reveal a core of living flame. “Malegorax, you do it!”</p><p>Malegorax the Immolator, a particularly vicious demon known throughout the hells for his enthusiastic sadism, pointed to himself as if he was uncertain whom the Devil was addressing.</p><p>“Me?”</p><p>“Yes, you!” the Devil snapped. “Bind him already!”</p><p>“It’s okay,” the soul assured the oversized demon. “I won’t resist.”</p><p>The Immolator cautiously approached the soul, whose head barely reached the foul spirit’s mighty chest, and quickly bound the soul’s wrists with chains of green fire that seared, but did not consume. No sooner had Malegorax completed the binding than he leaped thirty feet backward in a single bound.</p><p>The assembled demons cheered as the green flames crackled, and hissed, and most importantly, held fast.</p><p>“So that’s that!” snarled the Devil. “Now take him to the… no, take him to the Great Hall and chain him at the foot of my throne!”</p><p>The legions roared with malicious triumph as the King of Hell struck a majestic pose, and even the three archdevils bowed slavishly before him. Once more, a massive claw reached out and slashed through the thin skein of reality, and the flood of demons flowed through the smoking entrance to the nether realm, dragging the captive soul with them.</p><p>But no sooner had the rift closed behind them when a tremor shook the hillside. It wasn’t a natural earthquake, but rather the physical manifestation of something far more vaster that was rumbling on a cosmic scale. The darkness covering the sky seemed to pulse, as if breathing.</p><p>Death found himself standing alone with the Devil, holding his scythe in one hand and the shattered remnants of the hourglass in the other. He had a feeling this was going to be an administrative nightmare. The bureaucrats of the Post-Mortem Department were sure to have questions that he knew he couldn’t answer.</p><p>The Devil was staring at the lifeless body on the cross in between the two dying men. He had returned to his more urbane human form, and his expression of ecstatic glee was gone, replaced by a more calculated reserve.</p><p>AM I MISTAKEN IN THINKING SOMETHING HAS GONE AWRY HERE?</p><p>The Devil glared at Death with eyes that were burning orbs of amber fire that leaked smoke from the corners. “Shut your nonexistent mouth, Death! I don’t need questions from a glorified soul-harvester with no stake in the game. You’re just a mechanism, a cosmic functionary with no conception of anything that’s at stake here.”</p><p>Death, who had been called many things over the aeons, but never a “glorified soul-harvester,” elected not to dignify the Devil’s contemptuous dig with a response. He had other duties to attend to—specifically, the two thieves who had been crucified on either side of the recently departed.</p><p>The sand in the first thief’s hourglass was nearly depleted; his time was almost at hand. Death moved to the cross on the left first, raising his scythe as the final grain of sand fell through.</p><p>The Devil, having regained his composure, turned his attention to the soul of the unrepentant thief.</p><p>“You, too, are mine,” he growled, seizing the soul with hands that burned where they touched. “You had your chance and you rejected it.”</p><p>The thief’s soul struggled in the Devil’s grasp, terror replacing the bitterness that had defined his final hours of life. “Wait! I changed my mind! I repent!”</p><p>“Too late,” the Devil hissed. “You made your bed. Now burn in it!”</p><p>With a sound like tearing fabric, the Devil opened another rift in reality—this one leading not to the fiery realm where his demons gone, but to a darker, more daunting hell. Even Death found the momentary glimpse beyond that threshold to be disquieting.</p><p>The thief’s soul screamed as the Devil dragged him toward the bleeding wound in reality. “Help me!” he cried out, looking desperately at Death. “Don’t let him take me!”</p><p>I DO NOT INTERFERE, Death replied. I ONLY FACILITATE THE TRANSITION. WHAT FOLLOWS IS BEYOND MY PURVIEW.</p><p>“This is all there is,” the Devil snarled at Death as he hured the struggling soul through the rift. “This is what awaits them all in the end!” The rift sealed behind the damned soul, leaving only a lingering sense of dread and the faint smell of sulfur behind.</p><p>Death would have shrugged indifferently had he been able; he was no more capable of expressing any sympathy for the dead thief than he was of feeling it. Besides, there was still one more crucified soul to collect. He glanced at the last hourglass and saw the final sand falling to the bottom.</p><p>Above him, on the third and final cross, the second thief breathed his last. A moment later, a very relieved soul stepped down from where his tortured corpse hung suspended.</p><p>The thief’s soul took in the sight of Death towering over him. “Oh, thank God… is it over?” he asked.</p><p>YES, Death confirmed. YOUR TIME HAS COME.</p><p>As Death slashed through the thread that bound the thief’s soul to his body, the Devil lunged forward, grabbing at it with his greedy hands. “I’ll take this one too,” he hissed. “A criminal, condemned and damned!”</p><p>But before he could secure his prize, a brilliant light cut through the unnatural darkness, and a figure materialized in between the Devil and his intended victim. This newcomer wore white armor that gleamed like the sun reflecting off still water, and white feathery wings like those of an oversized swan extended from his back. In his hand he held a sword with a blade of living fire that crackled and smoked.</p><p>“Stand back, <em>A</em><em>dversator</em>,” said the Archangel Michael, his voice like distant trumpets. “This one is no longer yours.”</p><p>“Says who?” the Devil demanded, though he had already released his hold on the soul and stepped back warily.</p><p>“He repented,” Michael replied. “And Paradise was promised to him with all due authority.”</p><p>“Fine,” the Devil snapped. “Take your penitent. The victory is mine today!”</p><p>The Archangel did not argue, but hurled the soul upward toward the unnaturally black sky, and it transformed into something resembling a bright golden arrow as it pierced the darkness on its journey toward Heaven.</p><p>“Enjoy it while you can, <em>A</em><em>dversator</em>,” Michael said, and he winked at Death. Then he, too, was arcing Heavenward, like a giant white-golden bird flying through storm clouds.</p><p>Death wondered what the archangel might have meant. Death didn’t pretend to be an expert on angelic behavior, but the Commander of Heaven’s legions hadn’t given him the impression that the archangel was viewing the events of the day as any great loss.</p><p>But whether the day belonged to Heaven or Hell wasn’t Death’s concern. Already there was an elderly woman on China who was choking on a piece of duck, a Roman senator who was lying face-down in his own sick after the thirteenth course of a planned fifteen-course meal, and a young Indian brave due to be trampled by a bison on his first hunt, all of whom would soon require his services.</p><p>I SUPPOSE I’LL BE GOING NOW.</p><p>The Devil, who was still staring at the three corpses looming above them in the ominous darkness, shook his head and emerged from his reverie. His eyes flashed scarlet fire as he nodded courteously at Death, his previous irritation seemingly forgotten.</p><p>“Death.”</p><p>DEVIL.</p><p>As he entered the rude straw-topped hut not more than a day’s cart ride from Peking, Death wondered what the strange soul that had garnered so much supernatural interest could possibly have meant by seeing him again in three days. Was he, perhaps, a buddha who in his enlightenment had somehow become aware of his next reincarnation? If so, he must be reincarnating soon, and doing so as something on the short-lived side. Whatever it was, if it was indeed anything, Death very much hoped that it wouldn’t involve creating any additional paperwork for him.</p><p><em><a href=\"https://socialgalactic.com/micropost/f74dd44d-9141-4eaa-8907-e238f315224f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is one of the short stories from DEATH AND THE DEVIL, which will be published in ebook format in the next week or two.\nThe theme strikes me as appropriate for Good Friday.\nIt is a well-established fact across most of the known multiverse that death is, generally speaking, the end of life. This is the sort of obvious statement that most beings understand intuitively, in the same way they understand that water is wet or that the line of traffic you’re not driving in will always move faster than the one you selected.\nWhat is less well established, and indeed known to only a select few cosmic entities, is that there are occasional exceptions to this rule. Not many, mind you—perhaps ten or twelve across the entirety of existence. But when they do occur, they tend to cause no end of paperwork.\nDeath was having what, for him, amounted to a moderately busy Friday. The Romans were at it again with their crucifixions, and while Death understood the practical necessity of his role in the great cosmic machinery, he couldn’t help but find the Romans’ enthusiasm for creatively prolonging the process somewhat trying. Crucifixion was particularly bothersome—it was slow, messy, and sometimes required him to hover about for hours waiting for the final moment to arrive. It was inefficient, and if there was one thing Death disliked, it was inefficiency.\nOutside the walls of Jerusalem, on a small hill that locals called “The Place of the Skull” (humans did have a flair for the dramatic that Death could almost appreciate), three crosses stood starkly against the bright morning sky. A sizeable crowd had gathered—some jeering, some weeping, some simply watching with the detached curiosity of those who have nothing better to do with their afternoon than observe the suffering of others.\nDeath materialized beside the center cross, his black robe somehow remaining pristine despite the dust that swirled across the hilltop. His scythe gleamed with an impossible light, as if it were reflecting stars that weren’t visible in the daytime sky.\nI AM EARLY, Death said, his voice not so much heard as felt, like the final note of a funeral dirge played on the bones of the universe. He consulted a small hourglass that appeared in his skeletal hand. The sand was still flowing, though it had noticeably thinned to the bottom half. There was time yet.\nDeath was not alone in his invisible observation of the proceedings. Slightly to his left, luxuriating in the heat that rose from the baked earth, lounged a figure that radiated a different kind of darkness. This darkness wasn’t the simple absence of light that characterized Death’s appearance, but rather a corrupted, oily absence of goodness.\n“Lovely day for a crucifixion, isn’t it?” said the Devil, his voice as smooth as expensive honey with just a hint of ground glass mixed in. He wore the shape of a handsome middle-aged man with olive skin and curly black hair, dressed in a toga of deepest crimson that seemed to shift and flow like liquid. Only his eyes—amber with vertical pupils—gave away his inhuman nature.\nDeath did not respond. He had long ago learned that engaging the Devil in conversation inevitably led to tedious debates about the nature of free will or sales pitches for various soul-collection optimization schemes.\nThe Devil seemed undeterred by Death’s silence. “Quite the turnout for this one,” he continued, gesturing at the crowd around the central cross. “Special case, you know. I’ve had my eye on him for years. All those irritating miracles, healing the sick, giving sight to the blind.” He made a dismissive gesture. “Bad for business, you know, that sort of thing.”\nDeath remained silent, watching the sand in the hourglass.\n“Oh, come now,” the Devil prodded. “He’s been a thorn in your side too! Remember, he’s the one who interfered with your soul-reaping.”\nAt this, Death’s eye sockets seemed to narrow slightly, the silver pinpricks of light within them intensifying.\nYES, he said finally. I REMEMBER.\nThe memory was, for Death, quite a vivid one, despite having occurred several years earlier by human reckoning. He had appeared in Bethany to collect the soul of a man who had succumbed to an illness that baffled the local physicians. It had initially been a straightforward collection—Death had appeared at the appointed time, raised his scythe, and completed his duty with his usual efficiency. The soul had been collected, the hourglass emptied, the paperwork filed. End of story.\nIt should have been, anyhow.\nFour days later, Death had received an urgent message from the Department of Post-Mortem Records about an “anomalous post-mortem event.” He had returned to Bethany to find something unprecedented—Lazarus, very much alive, moving about, eating, breathing, and talking, despite having been quite thoroughly dead, reaped, and buried days before.\nMore perplexing still was the matter of his second hourglass. Every mortal had exactly one hourglass, created at birth and destroyed at death. Lazarus’s hourglass had been properly disposed of following the collection of his soul. Yet somehow he was alive again, and he also had a new hourglass in the usual location—but from whence had it come? Who had authorized it? Death checked and rechecked the records, but he could find no indication of how this administrative nightmare had occurred.\nAnd at the center of this troublesome accounting error was the same man who now hung on the central cross.\n“He’s made quite a nuisance of himself these last three years,” the Devil continued. “Even turned me down on a really sweet deal I offered him. But today—today he’ll regret not taking it!”\nDeath regarded the man on the cross with greater interest. Humans who had witnessed or experienced resurrection were exceedingly rare, and a man who could actually bring one about was unique in his experience. Death didn’t hold grudges—he was far too professional for that—but he did maintain what he considered to be a responsible professional curiosity about any exceptions to the natural order when they surfaced now and again.\nWithout warning, three more figures materialized around the Devil. All three were archdevils of considerable power, who rarely bothered to pay much attention to current events in the mortal realm except in exceptional circumstances. Which, apparently this incipient death was, for some reason Death could not fathom.\nThe first looked like a caricature of a Roman aristocrat, a grossly obese man wearing a crown of roast meats set with precious stones, his skin glistening with sweat and what appeared to be various sauces and condiments. This was Gulvalax, Archdevil of Gluttony, who took particular pleasure in tempting humans to consume far beyond their needs. His expression was gleefully malicious as he took in the three men dying in front of them.\nBeside him materialized what seemed at first glance to be a stunningly beautiful woman, although her appearance readily altered itself depending on the viewer’s preferences and desires. This was Lucrezia, Archdeviless of Lust, whose specialty was incredibly obvious, even to one as immune to her ever-transient charms as Death.\nThe third figure was harder to perceive, seeming to exist in a perpetual state of counting invisible coins stored in metaphysical banks throughout the multiverse, his fingers moving constantly as his eyes darted about, expertly assessing the material value of everything and everyone. This was, of course, Mammon, Archdevil of Greed.\n“My dear subordinates,” the Devil announced with the air of a host at an exclusive gathering, “I am absolutely delighted to present today’s main attraction to you. The so-called, self-professed ‘Son of God,’ who today is meeting the fate that he so richly merits.”\nGulvalax belched appreciatively, releasing a green cloud of fumes that would have made a living person retch. “About time. Do you know how many feasts and orgies he’s ruined with his tedious sermons about not even needing a pillow?”\n“What about that nonsense about it being easier for a camel to pass through the eye of a needle than for a rich man to enter Heaven,” added Mammon, his voice like coins clinking together. “Reprehensible!”\n“Not to mention,” purred Lucrezia, “his entirely unsound policy on adultery. Live and let love, I say.”\nThe Devil smiled at the enthusiasm of his lieutenants. “Indeed. And yet, for all his parable-spouting, he walked right into our trap. Those Pharisees barely even required any encouragement—a touch of envy here, a whisper of threatened power there—and look at him now! The once-loved miracle worker, now spat upon by the masses and dying like any common criminal.”\nDeath, who had been watching the sand in the hourglass with his customary patience, found himself growing uncomfortable with the infernal conversation. It wasn’t that he had any particular opinion on the man currently dying on the cross—Death was strictly impartial when it came to the souls he collected; neither Heaven nor Hell meant anything to him. But something about the malicious gloating of the Devil and his archdevils struck him as… a little distasteful.\nThe figure on the central cross had been silent for some time, his head bowed, his breathing labored. Now he raised his head slightly and spoke, his voice barely audible to the crowd below: “Father, forgive them, for they know not what they do.”\nThe Devil hissed softly, his pleasant appearance momentarily flickering to reveal something significantly less human underneath. “Always with the forgiveness. How tediously predictable. Will you just hurry up and die already?”\nIT WON’T BE LONG NOW.\nThe sun was still climbing high in the sky as the three condemned men struggled to breathe, pushing themselves up against the nails that fixed them to their crosses for each painful inhalation. The crowd had already thinned somewhat as the spectacle stretched into its final hour, many growing bored or uncomfortable with the prolonged nature of the execution.\nDeath waited patiently, the hourglass in his hand showing that the appointed time was drawing nigh.\n“I never really got a proper chance with him,” complained Lucrezia. “I even sent some of my best human agents his way too—that redhead from Magdala was particularly promising.”\n“I tried tempting him with bread when he was in the desert,” added Gulvalax. “Never seen anyone turn down food after forty days without eating. Most unnatural.”\nDeath, who had developed the cosmic equivalent of tuning out annoying background chatter over his eons of existence, focused instead on the three hourglasses that had appeared before him—one for each of the condemned men. The sand in the central one was now moving in a most peculiar manner, sometimes seeming to flow upward against gravity before resuming its normal downward trajectory.\nMost curious, Death thought. He had seen many hourglasses over the countless millennia of his existence, but never one that behaved in this fashion. Then, as often happened, one of the dying men looked up and met what passed for his eyes.\n“I know you,” the man said softly, his words meant for Death alone. “We’ve met before.”\nYES.\n“I hope it didn’t cause you too much trouble.”\nIT WAS AN ADMINISTRATIVE COMPLICATION. THESE THINGS HAPPEN OCCASIONALLY.\n“I imagine they do,” the man agreed. Then, after a pause: “Is it time yet?”\nDeath consulted the central hourglass. NOT QUITE, he said. BUT VERY SOON.\nThe man nodded slightly, then turned his attention to the sky, which had begun to darken despite it being midday. “And so it begins,” he said.\nThe Devil, who had been regaling his lieutenants with stories of his various successes at corrupting various prophets, kings, and other holy men, suddenly noticed the darkness spreading across the sky. The archdevils, too, paused in their chatter.\n“What’s happening?” demanded Mammon, his constantly counting fingers momentarily stilling. “This isn’t natural.”\nIndeed, it wasn’t. The expanding darkness wasn’t the result of clouds or any other natural phenomena. It was as if light itself was being selectively removed from the sky, starting from the horizon and spreading toward the hilltop where they stood.\nThe crowd below had noticed it too, many pointing upward with expressions of fear and confusion. Some began to hurry away from the crucifixion site, making signs to ward off evil or whispering prayers to various deities.\nDeath, who existed partially outside the normal flow of time and could perceive events with greater clarity than most beings, sensed a shift in the cosmic balance. It was subtle but unmistakable, like the first tremor before an earthquake or the intake of breath before a shout.\nThe Devil’s darkly handsome face had grown pale, his amber eyes darting from the darkening sky to the man on the central cross and back again. “This is… unexpected,” he admitted, his usual smooth confidence faltering slightly.\nGulvalax had begun stress-eating an ethereal banquet that materialized around him, stuffing phantom delicacies into his mouth with increasing desperation. Lucrezia’s form was shifting more rapidly than before, unable to settle on a single appearance as her mood wavered. Mammon had resumed counting, faster than ever, as if trying to calculate the cost-benefit ratio of remaining in the mortal realm versus a strategic retreat.\nDeath remained unmoved, his attention fixed on the hourglasses before him. The sand continued to flow, marking the inexorable approach of his duty. The strange behavior of the central hourglass had intensified, with more grains moving upward than down, creating a paradoxical situation where the sand neither emptied nor filled but somehow did both simultaneously.\nAs the darkness spread across the sky, finally reaching and enveloping the place of the skull, the dying man on the middle cross cried out in a loud voice: “Father, into your hands I commend my spirit!”\nAt that exact moment, the sand in his hourglass did something Death had never seen before—it exploded outward, shattering the glass container but remaining suspended in the air, each grain glowing with an inner light that pierced the unnatural darkness.\nAnd the man died.\nDeath raised his scythe, his duty clear despite the peculiar circumstances. As he prepared to collect the soul, however, he found himself hesitating. The soul was there in front of him, ready for the reaping, and yet something about it was different from any soul he had encountered before. It was as if it were simultaneously present and elsewhere, both departing and remaining, both ending and continuing.\nBut no sooner had his scythe touched the body than the soul addressed him directly.\n“Thank you for coming so soon,” he said, with the air of someone expressing appreciation for a plumber who has shown up unexpectedly early to fix a leaky pipe under the sink. “I can’t say I particularly enjoyed that. Well, I’ll see you in three days.”\nDeath stared at the soul, not understanding what was happening.\nThe Devil, seeing Death’s discombobulation, smiled triumphantly. “I’ll take it from here,” he said, his handsome human appearance melting away to reveal his true form—a powerful being of living shadow and flame, with great curved horns and eyes like burning coals.\nWith a gesture of his clawed hands, the Devil tore open the very fabric of reality. Through this rift poured scores, then centuries, then thousands of demons—foul creatures of smoke and spite, of cruelty given form, of malice made manifest. They swarmed toward the soul, chittering and cackling with anticipation and glee.\n“TAKE HIM, MY LEGIONS!” the Devil commanded, his voice no longer smooth but a discordant chorus of pain and hatred. “DRAG HIM DOWN TO THE DEEPEST PIT! LET HIM KNOW ETERNAL TORMENT FOR THE DISRESPECT HE HAS SHOWN YOUR KING!”\nThe demons surged forward, their misshapen hands grasping at the soul—only to pass through it as if it were made of mist. Again and again they tried, their claws slashing at something they could not quite grasp, like shadows trying to capture light.\nThe beleagured soul observed all of the demonic\nSturm und Drang\nengulfing him with remarkable tranquility and a faint smile on his face, as if he was watching an overly enthusiastic theatrical performance being put on by the local schoolchildren.\n“This is all very impressive,” he said to the Devil, whose expression had rapidly shifted from triumph to confusion, and was now beginning to show the first signs of being worried. “But you have no power over me. You never did.”\n“IMPOSSIBLE!” the Devil roared, the ground trembling beneath his fury. “YOU BECAME FLESH! AND NOW YOU ARE DEAD! YOUR BODY IS BROKEN! YOUR BLOOD IS SPILLED! YOUR SOUL HAS BEEN REAPED! YOU BELONG TO ME!”\n“No,” the soul replied calmly. “I don’t.”\nCowering before their master’s rage, the great mass of demons began to retreat, their slavering eagerness replaced by terror. They drew back behind the King of Hell, who stood alone now before the soul.\n“This can’t be right,” the Devil hissed, flames erupting from his eyes and mouth. “You lived as a mortal. You died as a mortal. Therefore you are mine now. Your soul belongs in Gehenna with all the the rest.”\nWhat would have been the soul’s eyes were it still alive danced with what Death thought looked suspiciously like amusement.\n“Yes, that’s where I intend to go. I never said I wouldn’t accompany you voluntarily.” He held out his hands in front of him, the bloody holes the Roman spikes had driven through them still visible in his spectral form. “I’ll even permit you to bind me.”\n“Bind him!” the Devil snapped, and he pointed at a towering demon whose molten hide cracked with each movement to reveal a core of living flame. “Malegorax, you do it!”\nMalegorax the Immolator, a particularly vicious demon known throughout the hells for his enthusiastic sadism, pointed to himself as if he was uncertain whom the Devil was addressing.\n“Me?”\n“Yes, you!” the Devil snapped. “Bind him already!”\n“It’s okay,” the soul assured the oversized demon. “I won’t resist.”\nThe Immolator cautiously approached the soul, whose head barely reached the foul spirit’s mighty chest, and quickly bound the soul’s wrists with chains of green fire that seared, but did not consume. No sooner had Malegorax completed the binding than he leaped thirty feet backward in a single bound.\nThe assembled demons cheered as the green flames crackled, and hissed, and most importantly, held fast.\n“So that’s that!” snarled the Devil. “Now take him to the… no, take him to the Great Hall and chain him at the foot of my throne!”\nThe legions roared with malicious triumph as the King of Hell struck a majestic pose, and even the three archdevils bowed slavishly before him. Once more, a massive claw reached out and slashed through the thin skein of reality, and the flood of demons flowed through the smoking entrance to the nether realm, dragging the captive soul with them.\nBut no sooner had the rift closed behind them when a tremor shook the hillside. It wasn’t a natural earthquake, but rather the physical manifestation of something far more vaster that was rumbling on a cosmic scale. The darkness covering the sky seemed to pulse, as if breathing.\nDeath found himself standing alone with the Devil, holding his scythe in one hand and the shattered remnants of the hourglass in the other. He had a feeling this was going to be an administrative nightmare. The bureaucrats of the Post-Mortem Department were sure to have questions that he knew he couldn’t answer.\nThe Devil was staring at the lifeless body on the cross in between the two dying men. He had returned to his more urbane human form, and his expression of ecstatic glee was gone, replaced by a more calculated reserve.\nAM I MISTAKEN IN THINKING SOMETHING HAS GONE AWRY HERE?\nThe Devil glared at Death with eyes that were burning orbs of amber fire that leaked smoke from the corners. “Shut your nonexistent mouth, Death! I don’t need questions from a glorified soul-harvester with no stake in the game. You’re just a mechanism, a cosmic functionary with no conception of anything that’s at stake here.”\nDeath, who had been called many things over the aeons, but never a “glorified soul-harvester,” elected not to dignify the Devil’s contemptuous dig with a response. He had other duties to attend to—specifically, the two thieves who had been crucified on either side of the recently departed.\nThe sand in the first thief’s hourglass was nearly depleted; his time was almost at hand. Death moved to the cross on the left first, raising his scythe as the final grain of sand fell through.\nThe Devil, having regained his composure, turned his attention to the soul of the unrepentant thief.\n“You, too, are mine,” he growled, seizing the soul with hands that burned where they touched. “You had your chance and you rejected it.”\nThe thief’s soul struggled in the Devil’s grasp, terror replacing the bitterness that had defined his final hours of life. “Wait! I changed my mind! I repent!”\n“Too late,” the Devil hissed. “You made your bed. Now burn in it!”\nWith a sound like tearing fabric, the Devil opened another rift in reality—this one leading not to the fiery realm where his demons gone, but to a darker, more daunting hell. Even Death found the momentary glimpse beyond that threshold to be disquieting.\nThe thief’s soul screamed as the Devil dragged him toward the bleeding wound in reality. “Help me!” he cried out, looking desperately at Death. “Don’t let him take me!”\nI DO NOT INTERFERE, Death replied. I ONLY FACILITATE THE TRANSITION. WHAT FOLLOWS IS BEYOND MY PURVIEW.\n“This is all there is,” the Devil snarled at Death as he hured the struggling soul through the rift. “This is what awaits them all in the end!” The rift sealed behind the damned soul, leaving only a lingering sense of dread and the faint smell of sulfur behind.\nDeath would have shrugged indifferently had he been able; he was no more capable of expressing any sympathy for the dead thief than he was of feeling it. Besides, there was still one more crucified soul to collect. He glanced at the last hourglass and saw the final sand falling to the bottom.\nAbove him, on the third and final cross, the second thief breathed his last. A moment later, a very relieved soul stepped down from where his tortured corpse hung suspended.\nThe thief’s soul took in the sight of Death towering over him. “Oh, thank God… is it over?” he asked.\nYES, Death confirmed. YOUR TIME HAS COME.\nAs Death slashed through the thread that bound the thief’s soul to his body, the Devil lunged forward, grabbing at it with his greedy hands. “I’ll take this one too,” he hissed. “A criminal, condemned and damned!”\nBut before he could secure his prize, a brilliant light cut through the unnatural darkness, and a figure materialized in between the Devil and his intended victim. This newcomer wore white armor that gleamed like the sun reflecting off still water, and white feathery wings like those of an oversized swan extended from his back. In his hand he held a sword with a blade of living fire that crackled and smoked.\n“Stand back,\nA\ndversator\n,” said the Archangel Michael, his voice like distant trumpets. “This one is no longer yours.”\n“Says who?” the Devil demanded, though he had already released his hold on the soul and stepped back warily.\n“He repented,” Michael replied. “And Paradise was promised to him with all due authority.”\n“Fine,” the Devil snapped. “Take your penitent. The victory is mine today!”\nThe Archangel did not argue, but hurled the soul upward toward the unnaturally black sky, and it transformed into something resembling a bright golden arrow as it pierced the darkness on its journey toward Heaven.\n“Enjoy it while you can,\nA\ndversator\n,” Michael said, and he winked at Death. Then he, too, was arcing Heavenward, like a giant white-golden bird flying through storm clouds.\nDeath wondered what the archangel might have meant. Death didn’t pretend to be an expert on angelic behavior, but the Commander of Heaven’s legions hadn’t given him the impression that the archangel was viewing the events of the day as any great loss.\nBut whether the day belonged to Heaven or Hell wasn’t Death’s concern. Already there was an elderly woman on China who was choking on a piece of duck, a Roman senator who was lying face-down in his own sick after the thirteenth course of a planned fifteen-course meal, and a young Indian brave due to be trampled by a bison on his first hunt, all of whom would soon require his services.\nI SUPPOSE I’LL BE GOING NOW.\nThe Devil, who was still staring at the three corpses looming above them in the ominous darkness, shook his head and emerged from his reverie. His eyes flashed scarlet fire as he nodded courteously at Death, his previous irritation seemingly forgotten.\n“Death.”\nDEVIL.\nAs he entered the rude straw-topped hut not more than a day’s cart ride from Peking, Death wondered what the strange soul that had garnered so much supernatural interest could possibly have meant by seeing him again in three days. Was he, perhaps, a buddha who in his enlightenment had somehow become aware of his next reincarnation? If so, he must be reincarnating soon, and doing so as something on the short-lived side. Whatever it was, if it was indeed anything, Death very much hoped that it wouldn’t involve creating any additional paperwork for him.\nDISCUSS ON SG",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-18T11:03:04+00:00"
}