{
  "url": "https://voxday.net/2025/04/21/fake-pope-dies/",
  "scraped_at": "2026-01-08T20:17:15.643204",
  "title": "Fake Pope Dies",
  "date_display": "April 21, 2025",
  "date_iso": "2025-04-21T09:51:02+00:00",
  "date_from_url": "2025-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fake Pope Francis went to what one can only presume was his infernal reward this morning, thereby presenting the genuine Christians in the Catholic Church another chance to clean their house of the post-Vatican II <em>diableristes</em>. I’m not optimistic in this regard; neither am I judgmental as the Southern Baptists and most of the Protestant denominations are just as converged and very nearly as bad, if not worse.</p><p>Perhaps only now can we truly understand the wisdom of Jesus Christ declaring that he is wherever two or three are gathered together in his name. Because it is now obvious that there is no human organization on this Earth that is immune to corruption and convergence.</p><p>I understand all the various theological arguments in defense of this particular organization or that particular organization as the One True Church. But regardless of how convincing, or unconvincing I might find them, I just haven’t seen any sign that any of the various Christian organizations have successfully policed themselves to remain uncompromised and true to its own foundational principles, let alone the basic principles set down by Jesus Christ.</p><p><em><a href=\"https://socialgalactic.com/micropost/f443693f-0430-4761-bbc9-d6d8b1af27be\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fake Pope Francis went to what one can only presume was his infernal reward this morning, thereby presenting the genuine Christians in the Catholic Church another chance to clean their house of the post-Vatican II\ndiableristes\n. I’m not optimistic in this regard; neither am I judgmental as the Southern Baptists and most of the Protestant denominations are just as converged and very nearly as bad, if not worse.\nPerhaps only now can we truly understand the wisdom of Jesus Christ declaring that he is wherever two or three are gathered together in his name. Because it is now obvious that there is no human organization on this Earth that is immune to corruption and convergence.\nI understand all the various theological arguments in defense of this particular organization or that particular organization as the One True Church. But regardless of how convincing, or unconvincing I might find them, I just haven’t seen any sign that any of the various Christian organizations have successfully policed themselves to remain uncompromised and true to its own foundational principles, let alone the basic principles set down by Jesus Christ.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-21T09:51:06+00:00"
}