{
  "url": "https://voxday.net/2025/04/19/immigration-and-empire-are-degenerate/",
  "scraped_at": "2026-01-08T20:17:06.367721",
  "title": "Immigration and Empire are Degenerate",
  "date_display": "April 19, 2025",
  "date_iso": "2025-04-19T17:54:17+00:00",
  "date_from_url": "2025-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is not news. Consider <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-i-022\">the following three paragraphs</a> quoted from a book published more than a century ago, in 1911.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The unification of the inhabited world which forms the meaning and the greatness of the Roman Empire, is a process presenting two different sides to the observer. Kelts, Iberians, Rhaetians, Moors, Ulyrians, Thracians were to some extent civilised by the culture of Greece and Rome, and achieved by its help a great advance in economic and civic organisation as well as in education; Syrians, Egyptians, the inhabitants of Asia Minor only modified to a certain extent their manners and views in order to meet the requirements of the Empire. But if the intermixture of tribes and their permeation by Graeco-Roman culture was in one sense a great progress, it was at the same time, but from another point of view, a decline; it was accompanied by a lowering of the level of the culture which exerted the civilising influence. While conquering barbarism and native peculiarities, Graeco-Roman culture assumed various traits from its vanquished opponents, and became gross and vulgar in its turn. In the words of a biographer of Alexander Severus: good and bad were promiscuously thrust into the Empire, noble and base, and numbers of barbarians (<em>Hist. Aug. Alex. Sev.</em> 64).</p><p>The unification and transformation of tribes standing on low grades of civilisation leads to consequences characterised by one common feature, the simplification of aims — degeneration. This process is concealed for a while by the political and economic advantages following on the establishment of the Empire. The creation of a central authority, upholding peace and intercourse, the conjunction oft he different parts of the world into one economic system enlivened by free trade, the spread of citizenship and civil culture in wider and wider circles of population — all these benefits produced for a time a rise of prosperity which counterbalanced the excess of barbarous, imperfectly assimilated elements.</p><p>But a series of political misfortunes set in rather rapidly in the third century: invasions of barbarians, conflicts between rival candidates to the throne, competition between armies and provinces put an end to order and prosperity and threatened the very existence of the Empire. In these calamities the barbarisation of Roman culture became more and more manifest, a backward movement began in all directions, a backward movement, however, which was by no means a mere falling back into previous conditions, but gave rise to new and interesting departures.</p></blockquote><p>We’ve already seen the first step: the rise in global prosperity that accompanied the neo-liberal world order. We are now well into the second step: degeneration. The third step is collapse. The historical process is inexorable and cannot be stopped except by removing all of the sources of the dyscivilizational degeneracy.</p><p><em><a href=\"https://socialgalactic.com/micropost/3d1b33c5-9961-4b56-a310-81b99959471b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is not news. Consider\nthe following three paragraphs\nquoted from a book published more than a century ago, in 1911.\nThe unification of the inhabited world which forms the meaning and the greatness of the Roman Empire, is a process presenting two different sides to the observer. Kelts, Iberians, Rhaetians, Moors, Ulyrians, Thracians were to some extent civilised by the culture of Greece and Rome, and achieved by its help a great advance in economic and civic organisation as well as in education; Syrians, Egyptians, the inhabitants of Asia Minor only modified to a certain extent their manners and views in order to meet the requirements of the Empire. But if the intermixture of tribes and their permeation by Graeco-Roman culture was in one sense a great progress, it was at the same time, but from another point of view, a decline; it was accompanied by a lowering of the level of the culture which exerted the civilising influence. While conquering barbarism and native peculiarities, Graeco-Roman culture assumed various traits from its vanquished opponents, and became gross and vulgar in its turn. In the words of a biographer of Alexander Severus: good and bad were promiscuously thrust into the Empire, noble and base, and numbers of barbarians (\nHist. Aug. Alex. Sev.\n64).\nThe unification and transformation of tribes standing on low grades of civilisation leads to consequences characterised by one common feature, the simplification of aims — degeneration. This process is concealed for a while by the political and economic advantages following on the establishment of the Empire. The creation of a central authority, upholding peace and intercourse, the conjunction oft he different parts of the world into one economic system enlivened by free trade, the spread of citizenship and civil culture in wider and wider circles of population — all these benefits produced for a time a rise of prosperity which counterbalanced the excess of barbarous, imperfectly assimilated elements.\nBut a series of political misfortunes set in rather rapidly in the third century: invasions of barbarians, conflicts between rival candidates to the throne, competition between armies and provinces put an end to order and prosperity and threatened the very existence of the Empire. In these calamities the barbarisation of Roman culture became more and more manifest, a backward movement began in all directions, a backward movement, however, which was by no means a mere falling back into previous conditions, but gave rise to new and interesting departures.\nWe’ve already seen the first step: the rise in global prosperity that accompanied the neo-liberal world order. We are now well into the second step: degeneration. The third step is collapse. The historical process is inexorable and cannot be stopped except by removing all of the sources of the dyscivilizational degeneracy.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-19T21:38:25+00:00"
}