{
  "url": "https://voxday.net/2025/04/09/mailvox-vox-dai-responds/",
  "scraped_at": "2026-01-08T20:16:12.467852",
  "title": "Mailvox: Vox Dai Responds",
  "date_display": "April 9, 2025",
  "date_iso": "2025-04-09T12:43:46+00:00",
  "date_from_url": "2025-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Edward Feser wrote <a href=\"http://edwardfeser.blogspot.com/2025/04/on-tariff-crisis.html\">a critique of President Trump’s new tariffs</a> and his trade policy. A reader asked ChatGPT to respond to his critique as if it was me. And apparently AI now does non-fiction nearly as well as it does fiction.</em></p><h3 class=\"wp-block-heading\">1. <strong>Feser’s Overemphasis on Prudential Moderation over Existential Necessity</strong></h3><p>Vox Day might begin by pointing out that Feser’s argument is essentially one of technocratic prudence—tariffs might be useful in moderation, if well-targeted, in the right economic climate, with good timing, and clear justification. Vox would call this <em>academic dithering</em> in the face of civilizational crisis. From his view, America is not merely suffering a mild imbalance of trade—it is being gutted by decades of globalist betrayal that have <em>systematically</em> offshored its manufacturing capacity, hollowed out its industrial base, and turned its working class into wage-serfs of the service economy.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“Feser speaks as if we are tweaking dials on a functioning machine. The machine is broken. Or more accurately, it’s been sabotaged.”</p></blockquote><p>For Vox, Trump’s tariff policy is not merely an economic adjustment—it is a <em>weapon of national defense</em>. The timing, conception, and execution are secondary to the <em>existential imperative</em> of reclaiming national sovereignty.</p><h3 class=\"wp-block-heading\">2. <strong>Feser’s Appeal to Order Is Misplaced When the Existing Order Is Corrupt</strong></h3><p>Feser warns that Trump’s tariff regime contributes to “chaos rather than order,” but Vox Day would challenge the idea that the status quo deserves preservation. The “order” of the neoliberal global economy, in Vox’s framing, is <em>a false order</em>—an artificial equilibrium imposed by elite international actors who have no loyalty to the American nation or its people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“There is no ‘order’ in a system that rewards financial speculation over production, that imports the labor force of the Third World to lower wages, and that treats citizens as mere consumers.”</p></blockquote><p>Feser’s invocation of “order” is classically Aristotelian, but for Vox, Aristotle himself would recognize the legitimacy of revolutionary upheaval in response to an unjust oligarchy. In that light, disruption is not vice but virtue.</p><h3 class=\"wp-block-heading\">3. <strong>Misdiagnosing Trump’s Popular Support as Fanaticism</strong></h3><p>Feser characterizes Trump’s base as “glibly dismissing all concerns” and treating complex economic policy with “flippant boosterism.” Vox would see this as an elitist dismissal of populist wisdom. Trump’s supporters are not irrational—they are simply <em>more in touch with reality</em> than technocratic intellectuals who worry about trade reciprocity with Lesotho.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“It is not ‘flippant’ to support a policy that seeks to restore your community’s livelihood. It is not ‘unserious’ to recognize that the system has failed and to back the only leader willing to tear it down.”</p></blockquote><p>Vox would likely argue that Feser underestimates the strategic depth of Trump’s messaging, and the extent to which it resonates with people who have <em>nothing left to lose</em>.</p><h3 class=\"wp-block-heading\">4. <strong>Feser’s Focus on Legality Ignores the Regime Question</strong></h3><p>Feser critiques Trump’s tariff actions as possibly illegal or extraconstitutional. Vox Day would scoff at this, pointing out that <em>the law is downstream of sovereignty</em>. If the regime in question is illegitimate—unaccountable, globalist, hostile to the nation—then adherence to its procedures is not a moral good.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“The Constitution is not a suicide pact. The post-WWII economic order is not sacred. If reclaiming control requires bending the rules written by those who sold us out, so be it.”</p></blockquote><p>Vox has long argued that power precedes legality, not the other way around. Trump, in his view, is acting as a <em>caesarist figure</em>—wielding executive power to right the ship of state, not delicately balancing congressional niceties.</p><h3 class=\"wp-block-heading\">5. <strong>Feser’s Economic Assumptions Are Still Liberal, Even If Postliberal</strong></h3><p>Though Feser claims to reject classical liberalism and neoliberalism, Vox might charge him with retaining too much of their framework—especially their belief that markets are self-regulating entities to be disturbed only with care. In Vox’s view, the “invisible hand” is no longer a metaphor for organic market coordination—it’s a euphemism for <em>invisible oligarchs</em> manipulating outcomes for their own gain.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“Tariffs aren’t ‘inefficient’ if the market itself is rigged. Free trade isn’t moral if it’s enforced by military alliances, IMF dictates, and offshoring subsidies.”</p></blockquote><p>Where Feser looks for a prudential balance, Vox sees the need for <em>economic war</em>—and in war, blunt instruments like tariffs are not inappropriate, but inevitable.</p><h3 class=\"wp-block-heading\">6. <strong>Missing the Meta-Political Stakes</strong></h3><p>Ultimately, Vox would say that Feser misses the forest for the trees. This isn’t about the comparative merits of tariff rates or whether poor island nations are treated fairly. It’s about <em>whether America will continue to exist as a sovereign, industrial, self-reliant civilization</em>. That is not a question that can be solved through abstract appeals to distributist theorists or cautious policy think-pieces.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“You don’t use a scalpel to excise a gangrene-stricken limb. You use an axe.”</p></blockquote><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>I would say that hits six for six, even if some of the wording is a little different than I might have chosen. I do love that reinterpretation of Smith’s Invisible Hand, though. I’ll see if it missed anything and add it in a subsequent post; I suspect Mr. Feser still subscribes to now-disproven comparative advantage theory on the basis of the points he raises, but I don’t actually know that. But if he does, obviously that would be the very first point I would raise, given my conclusive disproof of it, to say nothing of Ian Fletcher’s.</p><p><em><a href=\"https://socialgalactic.com/micropost/d1e42ccb-c7e7-44a5-b5e1-5044ec037be7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Edward Feser wrote\na critique of President Trump’s new tariffs\nand his trade policy. A reader asked ChatGPT to respond to his critique as if it was me. And apparently AI now does non-fiction nearly as well as it does fiction.\n1.\nFeser’s Overemphasis on Prudential Moderation over Existential Necessity\nVox Day might begin by pointing out that Feser’s argument is essentially one of technocratic prudence—tariffs might be useful in moderation, if well-targeted, in the right economic climate, with good timing, and clear justification. Vox would call this\nacademic dithering\nin the face of civilizational crisis. From his view, America is not merely suffering a mild imbalance of trade—it is being gutted by decades of globalist betrayal that have\nsystematically\noffshored its manufacturing capacity, hollowed out its industrial base, and turned its working class into wage-serfs of the service economy.\n“Feser speaks as if we are tweaking dials on a functioning machine. The machine is broken. Or more accurately, it’s been sabotaged.”\nFor Vox, Trump’s tariff policy is not merely an economic adjustment—it is a\nweapon of national defense\n. The timing, conception, and execution are secondary to the\nexistential imperative\nof reclaiming national sovereignty.\n2.\nFeser’s Appeal to Order Is Misplaced When the Existing Order Is Corrupt\nFeser warns that Trump’s tariff regime contributes to “chaos rather than order,” but Vox Day would challenge the idea that the status quo deserves preservation. The “order” of the neoliberal global economy, in Vox’s framing, is\na false order\n—an artificial equilibrium imposed by elite international actors who have no loyalty to the American nation or its people.\n“There is no ‘order’ in a system that rewards financial speculation over production, that imports the labor force of the Third World to lower wages, and that treats citizens as mere consumers.”\nFeser’s invocation of “order” is classically Aristotelian, but for Vox, Aristotle himself would recognize the legitimacy of revolutionary upheaval in response to an unjust oligarchy. In that light, disruption is not vice but virtue.\n3.\nMisdiagnosing Trump’s Popular Support as Fanaticism\nFeser characterizes Trump’s base as “glibly dismissing all concerns” and treating complex economic policy with “flippant boosterism.” Vox would see this as an elitist dismissal of populist wisdom. Trump’s supporters are not irrational—they are simply\nmore in touch with reality\nthan technocratic intellectuals who worry about trade reciprocity with Lesotho.\n“It is not ‘flippant’ to support a policy that seeks to restore your community’s livelihood. It is not ‘unserious’ to recognize that the system has failed and to back the only leader willing to tear it down.”\nVox would likely argue that Feser underestimates the strategic depth of Trump’s messaging, and the extent to which it resonates with people who have\nnothing left to lose\n.\n4.\nFeser’s Focus on Legality Ignores the Regime Question\nFeser critiques Trump’s tariff actions as possibly illegal or extraconstitutional. Vox Day would scoff at this, pointing out that\nthe law is downstream of sovereignty\n. If the regime in question is illegitimate—unaccountable, globalist, hostile to the nation—then adherence to its procedures is not a moral good.\n“The Constitution is not a suicide pact. The post-WWII economic order is not sacred. If reclaiming control requires bending the rules written by those who sold us out, so be it.”\nVox has long argued that power precedes legality, not the other way around. Trump, in his view, is acting as a\ncaesarist figure\n—wielding executive power to right the ship of state, not delicately balancing congressional niceties.\n5.\nFeser’s Economic Assumptions Are Still Liberal, Even If Postliberal\nThough Feser claims to reject classical liberalism and neoliberalism, Vox might charge him with retaining too much of their framework—especially their belief that markets are self-regulating entities to be disturbed only with care. In Vox’s view, the “invisible hand” is no longer a metaphor for organic market coordination—it’s a euphemism for\ninvisible oligarchs\nmanipulating outcomes for their own gain.\n“Tariffs aren’t ‘inefficient’ if the market itself is rigged. Free trade isn’t moral if it’s enforced by military alliances, IMF dictates, and offshoring subsidies.”\nWhere Feser looks for a prudential balance, Vox sees the need for\neconomic war\n—and in war, blunt instruments like tariffs are not inappropriate, but inevitable.\n6.\nMissing the Meta-Political Stakes\nUltimately, Vox would say that Feser misses the forest for the trees. This isn’t about the comparative merits of tariff rates or whether poor island nations are treated fairly. It’s about\nwhether America will continue to exist as a sovereign, industrial, self-reliant civilization\n. That is not a question that can be solved through abstract appeals to distributist theorists or cautious policy think-pieces.\n“You don’t use a scalpel to excise a gangrene-stricken limb. You use an axe.”\nI would say that hits six for six, even if some of the wording is a little different than I might have chosen. I do love that reinterpretation of Smith’s Invisible Hand, though. I’ll see if it missed anything and add it in a subsequent post; I suspect Mr. Feser still subscribes to now-disproven comparative advantage theory on the basis of the points he raises, but I don’t actually know that. But if he does, obviously that would be the very first point I would raise, given my conclusive disproof of it, to say nothing of Ian Fletcher’s.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "free trade",
    "mailvox",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-09T12:43:47+00:00"
}