{
  "url": "https://voxday.net/2025/04/01/the-convergence-chronicles/",
  "scraped_at": "2026-01-08T20:15:18.593525",
  "title": "The Convergence Chronicles",
  "date_display": "April 1, 2025",
  "date_iso": "2025-04-01T16:03:41+00:00",
  "date_from_url": "2025-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In 2015, I pointed out that convergence prevents an organization from being able to perform its primary purpose. And we’ve seen this playing out in diverse organizations from Boeing to Warner Bros. But what is remarkable about <a href=\"https://fandompulse.substack.com/p/after-years-of-woke-activism-and\">this chronicle of the convergence and collapse</a> of a voluntary writing organization by <em>Fandom Pulse</em> is the way in which it demonstrates how social justice convergence can prevent even a very loose organization with a single and very simple purpose from performing that sole function.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>NaNoWriMo, the National Novel Writing Month non-profit organization, has been embroiled in many controversies in recent years, and now it is announcing that it is shutting down its author encouragement service for good.</p><p>NaNoWriMo stands for National Novel Writing Month. The organization surrounding it created a website and a sense of community for writers who wanted an extra push to attain their writing goals. The idea is simple: during the month of November each year, the challenge is to write 50,000 words on a project—do something novel-length to complete your book.</p><p>The website has a tracker, community forums, and other productivity tools to help writers. Unfortunately, the site became mired in leftist identity politics in recent years, veering from its mission to try to appeal to the woke mob in publishing. It doesn’t appear like it’s a lot to maintain, but with woke activists taking it over in recent years, the organization became bloated with too big of a structure, and in-fighting eventually led to its complete collapse.</p></blockquote><p>If social justice convergence can destroy the market value of Star Wars, empty out the pews of the Anglican churches in England, and cause NaNoWriMo to collapse, it should be beyond obvious that absolutely no aspect or element of it can be permitted entry into any organization that wishes to survive.</p><p><em><a href=\"https://socialgalactic.com/micropost/fa4fa1c6-e0b3-4d1c-b9b9-173e46b082ce\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In 2015, I pointed out that convergence prevents an organization from being able to perform its primary purpose. And we’ve seen this playing out in diverse organizations from Boeing to Warner Bros. But what is remarkable about\nthis chronicle of the convergence and collapse\nof a voluntary writing organization by\nFandom Pulse\nis the way in which it demonstrates how social justice convergence can prevent even a very loose organization with a single and very simple purpose from performing that sole function.\nNaNoWriMo, the National Novel Writing Month non-profit organization, has been embroiled in many controversies in recent years, and now it is announcing that it is shutting down its author encouragement service for good.\nNaNoWriMo stands for National Novel Writing Month. The organization surrounding it created a website and a sense of community for writers who wanted an extra push to attain their writing goals. The idea is simple: during the month of November each year, the challenge is to write 50,000 words on a project—do something novel-length to complete your book.\nThe website has a tracker, community forums, and other productivity tools to help writers. Unfortunately, the site became mired in leftist identity politics in recent years, veering from its mission to try to appeal to the woke mob in publishing. It doesn’t appear like it’s a lot to maintain, but with woke activists taking it over in recent years, the organization became bloated with too big of a structure, and in-fighting eventually led to its complete collapse.\nIf social justice convergence can destroy the market value of Star Wars, empty out the pews of the Anglican churches in England, and cause NaNoWriMo to collapse, it should be beyond obvious that absolutely no aspect or element of it can be permitted entry into any organization that wishes to survive.\nDISCUSS ON SG",
  "tags": [
    "SJW",
    "trainwreck",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-01T16:03:43+00:00"
}