{
  "url": "https://voxday.net/2025/04/15/the-invention-of-william-shakespeare/",
  "scraped_at": "2026-01-08T20:16:49.743716",
  "title": "The Invention of William Shakespeare",
  "date_display": "April 15, 2025",
  "date_iso": "2025-04-15T17:03:27+00:00",
  "date_from_url": "2025-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The conception that most of us have of the playwright from Stratford-on-Avon <a href=\"https://dennismccarthy.substack.com/p/travelling-back-in-time-to-determine\">is almost entirely a modern construction</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One of the book vendors proudly presents you with the first-ever collection of Shakespeare’s works, put together the previous year by the renowned printer, William Jaggard, for the publisher, Thomas Pavier. But as you excitedly look through the pages, you become even more confused. Only three of the nine plays in the collection seem authentic. One of the plays is A Yorkshire Tragedy, which you had already pruchases, and another, Sir John Oldcastle, is also unfamiliar and not part of any modern Shakespeare collection. Still another, The Whole Contention Between the Two Famous Houses, Lancaster and York, is a combination of two heavily revised renditions of 2 Henry VI and 3 Henry VI. Two other plays—Henry V and The Merry Wives of Windsor—are much simpler and briefer adaptations of the authentic versions of these plays. Another play, Pericles, is conventionally considered an inauthentic, slap-dash treatment of a longer, genuine form that has been lost. The only three that seem normal are The Merchant of Venice, King Lear, A Midsummer Night’s Dream.</p><p>After you complete your visit of all book vendors in London, and are assured that these are all the plays ever printed that were ascribed to William Shakespeare, you now own only 22 plays—of which a dozen of them are either apocryphal, or they are brief, strange, less literary adaptations of more familiar plays. That’s 12 of 22 that are seemingly wrong. You ask sellers about Othello, Macbeth, Twelfth Night, Antony and Cleopatra—but none of these have been printed. And many Londoners have never even heard of these plays.</p><p>Giving up in frustration, you at least take some comfort in the thought that at least you get to see an authentic Hamlet. You rush across London Bridge with your assortment of plays under your arm to the Globe Theater, squeeze amongst the groundlings standing before the stage—and wait for that most famous of speeches in English theater history. And the actor playing Hamlet walks out onto stage, holding a book in his hand, and says:</p><p><em>To be or not to be. Aye, there’s the point,<br/>To die, to sleep, is that all? Aye, all:<br/>No, to sleep, to dream, Aye, marry, there it goes…</em></p><p>What?!? You know this quote is all wrong, even bizarre — a sort of brief, informal rendition of the opening to the real “To be or not to be” soliloquoy…</p><p>Who wrote this shorter, funnier, more action-packed <em>Hamlet</em>? Since the changes applied to this version are so inferior and differently styled from other Shakespeare plays, most scholars assume it was the result of a conspiracy. One or two of his greedy fellow actors supposedly created a briefer version of the play that they then sold to grasping printers and publishers eager to produce a work with Shakespeare’s name on the title page.</p><p>The truth is much simpler: William Shakespeare wrote it, which is why his name is on the title page. After all, we know Shakespeare did adapt an older version of <em>Hamlet—</em>and this first quarto of 1603 is the adaptation that Shakespeare’s company then performed. Of course, he wrote it. The original <em>Hamlet</em>, the one that Thomas Nashe referenced in 1589 as having been written by an “English Seneca,” is actually the authentic masterpiece that everyone is familiar with today. (And again, in an upcoming paper, Schlueter and I will show that Nashe was indeed referring to Thomas North as English Seneca—and that Jonson and Lodge also identified North as the original author of other Shakespearean plays too.)</p><p>What is more, <em>Hamlet</em> is not the only such example. Although this is not widely known, the plays <em>Henry V, Richard III,</em> <em>Henry VI, part 2</em> and <em>Henry VI, part 3</em> also exist in two very different versions: in the genuine, familiar literary form — and as a rewritten, briefer, less erudite, faster-paced staged adaptation. In each case, conventional scholars had always assumed that Shakespeare had written the longer masterpiece, yet it is only their lesser, rewritten theatrical renderings that had ever reached print during Shakespeare’s lifetime — and by 1620 each of these lesser adaptations had been attributed to the Stratford dramatist via the title page. Again, these rewritten versions are so inferior to the originals that orthodox scholars have had a difficult time accounting for Shakespeare’s name on the title pages. So, up until now, conventional scholars had blamed all these lesser works on a system of conspiracies, occurring over decades. Supposedly, various groups of unknown anonymous actors working within the Stratford dramatist’s theater companies rewrote these plays and then secretly sold them to corrupt printers with Shakespeare’s name on the title pages. In reality, of course, there were no conspiracies: These are actually the plays that Shakespeare really wrote—or at least adapted, directed, and produced.</p></blockquote><p>As usual, the analyses of academic historians are fundamentally limited by their insistence on the relevance of their ontological ceilings. Consensus incredulity is an extraordinarily stupid and highly fallible metric, and yet, it’s actually codified into the academic and scientific worlds as “peer review”.</p><p>The problem is that most people are fundamentally unable to even imagine what a world without copyright, without mass market publishing, and without publishing gatekeepers would even look like. The ability to self-publish on Amazon and effectively imitate an author’s style using AI is just beginning to give us the faintest glimmerings of what a free-for-all writing, crediting, and publishing must have been in the early 1600s.</p><p>I find Mr. Mccarthy’s work on the real Shakespeare and the various elements that have gone into the mythical modern construction to be some of the most fascinating archeo-history that I’ve ever seen in my life. The fact that it is all document-driven rather than theory-driven makes it vastly more interesting as well as far more convincing than other efforts of this type.</p><p><em><a href=\"https://socialgalactic.com/micropost/6daf7bce-84fb-44a2-8faa-875a57fb3d54\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The conception that most of us have of the playwright from Stratford-on-Avon\nis almost entirely a modern construction\n:\nOne of the book vendors proudly presents you with the first-ever collection of Shakespeare’s works, put together the previous year by the renowned printer, William Jaggard, for the publisher, Thomas Pavier. But as you excitedly look through the pages, you become even more confused. Only three of the nine plays in the collection seem authentic. One of the plays is A Yorkshire Tragedy, which you had already pruchases, and another, Sir John Oldcastle, is also unfamiliar and not part of any modern Shakespeare collection. Still another, The Whole Contention Between the Two Famous Houses, Lancaster and York, is a combination of two heavily revised renditions of 2 Henry VI and 3 Henry VI. Two other plays—Henry V and The Merry Wives of Windsor—are much simpler and briefer adaptations of the authentic versions of these plays. Another play, Pericles, is conventionally considered an inauthentic, slap-dash treatment of a longer, genuine form that has been lost. The only three that seem normal are The Merchant of Venice, King Lear, A Midsummer Night’s Dream.\nAfter you complete your visit of all book vendors in London, and are assured that these are all the plays ever printed that were ascribed to William Shakespeare, you now own only 22 plays—of which a dozen of them are either apocryphal, or they are brief, strange, less literary adaptations of more familiar plays. That’s 12 of 22 that are seemingly wrong. You ask sellers about Othello, Macbeth, Twelfth Night, Antony and Cleopatra—but none of these have been printed. And many Londoners have never even heard of these plays.\nGiving up in frustration, you at least take some comfort in the thought that at least you get to see an authentic Hamlet. You rush across London Bridge with your assortment of plays under your arm to the Globe Theater, squeeze amongst the groundlings standing before the stage—and wait for that most famous of speeches in English theater history. And the actor playing Hamlet walks out onto stage, holding a book in his hand, and says:\nTo be or not to be. Aye, there’s the point,\nTo die, to sleep, is that all? Aye, all:\nNo, to sleep, to dream, Aye, marry, there it goes…\nWhat?!? You know this quote is all wrong, even bizarre — a sort of brief, informal rendition of the opening to the real “To be or not to be” soliloquoy…\nWho wrote this shorter, funnier, more action-packed\nHamlet\n? Since the changes applied to this version are so inferior and differently styled from other Shakespeare plays, most scholars assume it was the result of a conspiracy. One or two of his greedy fellow actors supposedly created a briefer version of the play that they then sold to grasping printers and publishers eager to produce a work with Shakespeare’s name on the title page.\nThe truth is much simpler: William Shakespeare wrote it, which is why his name is on the title page. After all, we know Shakespeare did adapt an older version of\nHamlet—\nand this first quarto of 1603 is the adaptation that Shakespeare’s company then performed. Of course, he wrote it. The original\nHamlet\n, the one that Thomas Nashe referenced in 1589 as having been written by an “English Seneca,” is actually the authentic masterpiece that everyone is familiar with today. (And again, in an upcoming paper, Schlueter and I will show that Nashe was indeed referring to Thomas North as English Seneca—and that Jonson and Lodge also identified North as the original author of other Shakespearean plays too.)\nWhat is more,\nHamlet\nis not the only such example. Although this is not widely known, the plays\nHenry V, Richard III,\nHenry VI, part 2\nand\nHenry VI, part 3\nalso exist in two very different versions: in the genuine, familiar literary form — and as a rewritten, briefer, less erudite, faster-paced staged adaptation. In each case, conventional scholars had always assumed that Shakespeare had written the longer masterpiece, yet it is only their lesser, rewritten theatrical renderings that had ever reached print during Shakespeare’s lifetime — and by 1620 each of these lesser adaptations had been attributed to the Stratford dramatist via the title page. Again, these rewritten versions are so inferior to the originals that orthodox scholars have had a difficult time accounting for Shakespeare’s name on the title pages. So, up until now, conventional scholars had blamed all these lesser works on a system of conspiracies, occurring over decades. Supposedly, various groups of unknown anonymous actors working within the Stratford dramatist’s theater companies rewrote these plays and then secretly sold them to corrupt printers with Shakespeare’s name on the title pages. In reality, of course, there were no conspiracies: These are actually the plays that Shakespeare really wrote—or at least adapted, directed, and produced.\nAs usual, the analyses of academic historians are fundamentally limited by their insistence on the relevance of their ontological ceilings. Consensus incredulity is an extraordinarily stupid and highly fallible metric, and yet, it’s actually codified into the academic and scientific worlds as “peer review”.\nThe problem is that most people are fundamentally unable to even imagine what a world without copyright, without mass market publishing, and without publishing gatekeepers would even look like. The ability to self-publish on Amazon and effectively imitate an author’s style using AI is just beginning to give us the faintest glimmerings of what a free-for-all writing, crediting, and publishing must have been in the early 1600s.\nI find Mr. Mccarthy’s work on the real Shakespeare and the various elements that have gone into the mythical modern construction to be some of the most fascinating archeo-history that I’ve ever seen in my life. The fact that it is all document-driven rather than theory-driven makes it vastly more interesting as well as far more convincing than other efforts of this type.\nDISCUSS ON SG",
  "tags": [
    "books",
    "history",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-15T17:03:29+00:00"
}