{
  "url": "https://voxday.net/2025/04/07/unthinkable-evacuations/",
  "scraped_at": "2026-01-08T20:15:54.019785",
  "title": "Unthinkable Evacuations",
  "date_display": "April 7, 2025",
  "date_iso": "2025-04-07T10:01:06+00:00",
  "date_from_url": "2025-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Simplicius observes that the mainstream media is now <a href=\"https://simplicius76.substack.com/p/sitrep-4625-hint-of-spring-as-russian\">openly accepting the idea</a> that Ukraine is going to have to give up its five former separatist provinces that are now part of Russia:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For the first time we’re beginning to see major Western publications begin realistically acknowledging the possibility of Ukraine losing all five of the regions demanded by Putin, including Kherson and Zaporozhye in whole. Until now these long-standing Russian demands were virtually ignored or dismissed out of hand by MSM, which only spoke condescendingly enough about the prospects of Russia keeping Crimea, Lugansk, and Donetsk, let alone the others.</p><p><em>But now, reality is beginning to dawn on them. The Telegraph piece breaks the omerta and broaches the delicate eventuality:</em></p><p><em>How would the map of Ukraine change after such a one-sided ceasefire? Putin claims five provinces: Crimea, Luhansk, Donetsk, Kherson and Zaporizhzhia. The last three are still only partially occupied by the Russians.</em></p><p><em>Agreeing to withdraw Ukrainian forces from these regions would increase the Russian-occupied area from about 20pc to roughly 25pc of Ukraine’s sovereign territory. That might sound like a sacrifice worth making to stop the slaughter, though it would inevitably deprive Kyiv of yet more economic resources and its fortified front lines.</em></p><p><em>But such a deal would also mean evacuating millions of civilians. After the well-documented murder, torture and abduction of tens of thousands in Bucha, Mariupol and elsewhere, it is unthinkable that Zelensky would abandon his people to Putin’s paramilitaries and secret police. So a war-torn, impoverished country would have to absorb a huge influx of refugees.</em></p><p><em>Confirmation they understand this would include losing the capital cities of these regions themselves:</em></p><p><em>Worse, a ceasefire on Putin’s terms would crush Ukrainian morale. Some of the cities that would be lost, including Kherson itself, have already been liberated from the Russians, often at great cost.</em></p><p>It’s clear that little by little the inevitable acceptance of Russia’s full demands is being digested.</p><p>But what’s particularly fascinating—and egregious—to observe about the above, is the suggestion that “evacuating millions of civilians”, particularly after many of them were allegedly ‘tortured and murdered’, is something so unthinkable, that it beggars the contemporary imagination, and should definitely be resisted by the moral forces of the world. After all, there is simply no place on earth we could even conceive of where millions of people are currently under similar threat of both mass genocide and forced displacement. The highly principled Western press would certainly apprise us of such an obvious parallel, bringing to light the stupendous hypocrisy thereof, were it to exist somewhere on this small rock, no?</p><p>And this highly righteous press would unquestionably condemn the mirroring tragedy—if such a hypothetical one existed—with the same pharisaical outrage as exhibited here, right?</p><p>….Right?</p></blockquote><p>The propaganda ministers of Clown World still don’t seem to grasp that it’s no longer possible to decry the actions of the declared bad guy <em>du jour</em> while simultaneously defending precisely the same actions by a different international actor. If the world is supposed to respect the Israeli claim on Palestine due to its historical conquest of Canaan, and assert that the various acts of aggression and ethnic cleansing are justified by that claim, how do they imagine that the much stronger Russian claim to eastern Ukraine or the even stronger Chinese claim to Taiwan are not similarly justified?</p><p>The interesting thing which very few people appear to be noticing is the way in which the stage has been set for an Israeli-Turkish struggle for not only Syria, but Jerusalem itself. After all, the Turks owned that land for nearly 200 years, from 1517 to 1917.</p><p><em><a href=\"https://socialgalactic.com/micropost/e1c48a7e-7b8c-447d-82dd-8374618c3387\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Simplicius observes that the mainstream media is now\nopenly accepting the idea\nthat Ukraine is going to have to give up its five former separatist provinces that are now part of Russia:\nFor the first time we’re beginning to see major Western publications begin realistically acknowledging the possibility of Ukraine losing all five of the regions demanded by Putin, including Kherson and Zaporozhye in whole. Until now these long-standing Russian demands were virtually ignored or dismissed out of hand by MSM, which only spoke condescendingly enough about the prospects of Russia keeping Crimea, Lugansk, and Donetsk, let alone the others.\nBut now, reality is beginning to dawn on them. The Telegraph piece breaks the omerta and broaches the delicate eventuality:\nHow would the map of Ukraine change after such a one-sided ceasefire? Putin claims five provinces: Crimea, Luhansk, Donetsk, Kherson and Zaporizhzhia. The last three are still only partially occupied by the Russians.\nAgreeing to withdraw Ukrainian forces from these regions would increase the Russian-occupied area from about 20pc to roughly 25pc of Ukraine’s sovereign territory. That might sound like a sacrifice worth making to stop the slaughter, though it would inevitably deprive Kyiv of yet more economic resources and its fortified front lines.\nBut such a deal would also mean evacuating millions of civilians. After the well-documented murder, torture and abduction of tens of thousands in Bucha, Mariupol and elsewhere, it is unthinkable that Zelensky would abandon his people to Putin’s paramilitaries and secret police. So a war-torn, impoverished country would have to absorb a huge influx of refugees.\nConfirmation they understand this would include losing the capital cities of these regions themselves:\nWorse, a ceasefire on Putin’s terms would crush Ukrainian morale. Some of the cities that would be lost, including Kherson itself, have already been liberated from the Russians, often at great cost.\nIt’s clear that little by little the inevitable acceptance of Russia’s full demands is being digested.\nBut what’s particularly fascinating—and egregious—to observe about the above, is the suggestion that “evacuating millions of civilians”, particularly after many of them were allegedly ‘tortured and murdered’, is something so unthinkable, that it beggars the contemporary imagination, and should definitely be resisted by the moral forces of the world. After all, there is simply no place on earth we could even conceive of where millions of people are currently under similar threat of both mass genocide and forced displacement. The highly principled Western press would certainly apprise us of such an obvious parallel, bringing to light the stupendous hypocrisy thereof, were it to exist somewhere on this small rock, no?\nAnd this highly righteous press would unquestionably condemn the mirroring tragedy—if such a hypothetical one existed—with the same pharisaical outrage as exhibited here, right?\n….Right?\nThe propaganda ministers of Clown World still don’t seem to grasp that it’s no longer possible to decry the actions of the declared bad guy\ndu jour\nwhile simultaneously defending precisely the same actions by a different international actor. If the world is supposed to respect the Israeli claim on Palestine due to its historical conquest of Canaan, and assert that the various acts of aggression and ethnic cleansing are justified by that claim, how do they imagine that the much stronger Russian claim to eastern Ukraine or the even stronger Chinese claim to Taiwan are not similarly justified?\nThe interesting thing which very few people appear to be noticing is the way in which the stage has been set for an Israeli-Turkish struggle for not only Syria, but Jerusalem itself. After all, the Turks owned that land for nearly 200 years, from 1517 to 1917.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-04-07T10:01:07+00:00"
}