{
  "url": "https://voxday.net/2012/09/20/blind-faith-in-science/",
  "scraped_at": "2025-12-14T05:03:40.748245",
  "title": "Blind faith in science",
  "date_display": "September 20, 2012",
  "date_iso": "2012-09-20T10:01:00+00:00",
  "date_from_url": "2012-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite philosophy’s failure to do so, some are still fantasizing about <a href=\"http://ca.news.yahoo.com/science-someday-rule-possibility-god-115945479.html?_esi=1\">Science finally killing God</a>:</p><blockquote><p> Physicists have observed that many of the physical constants that<br> define our universe, from the mass of the electron to the density of<br> dark energy, are eerily perfect for supporting life. Alter one of these<br> constants by a hair, and the universe becomes  unrecognizable. “For<br> example, if the mass of the neutron were a bit larger (in comparison to<br> the mass of the proton) than its actual value, hydrogen would not fuse<br> into deuterium and conventional stars would be impossible,” Carroll<br> said. And thus, so would life as we know it.</br></br></br></br></br></br></br></p><p>Theologians often seize upon the so-called “fine-tuning” of the<br> physical constants as evidence that God must have had a hand in them; it<br> seems he chose the constants just for us. But contemporary physics<br> explains our seemingly supernatural good luck in a different way.</br></br></br></p><p>Some versions of quantum gravity theory, including string theory, predict that our life-giving universe is but one of an infinite number of<br> universes that altogether make up the multiverse. Among these infinite<br> universes, the full range of values of all the physical constants are<br> represented, and only some of the universes have values for the<br> constants that enable the formation of stars, planets and life as we<br> know it. We find ourselves in one of the lucky universes (because where<br> else?).</br></br></br></br></br></br></p><p>Some theologians counter that it is far simpler to invoke God than to<br> postulate the existence of infinitely many universes in order to explain<br> our universe’s life-giving perfection. To them, Carroll retorts that<br> the multiverse wasn’t postulated as a complicated way to explain<br> fine-tuning. On the contrary, it follows as a natural consequence of our<br> best, most elegant theories.</br></br></br></br></br></p></blockquote><p>While it may be true that the multiverse wasn’t originally postulated as a way to explain fine-tuning, there is no question that is the primary way in which it is utilized now.  It borders on the dishonest to pretend otherwise.  The logical irony, of course, is that multiverse theory itself suggests that even if we happen to inhabit a godless universe, there must be other universes in which gods exist.  And then, there is no logical reason to assume that a Creator God which created one universe did not create more universes.  Multiverse theory is not a means of deprecating God, it is merely a means of defending godlessness against the powerful assault of the anthropic principle.</p><p>When one contemplate these matters, one quickly realizes that most scientists would do well to stick to science.  Because as both philosophers and theologians, they tend to be remarkably incompetent.</p></div>",
  "content_text": "Despite philosophy’s failure to do so, some are still fantasizing about\nScience finally killing God\n:\nPhysicists have observed that many of the physical constants that\ndefine our universe, from the mass of the electron to the density of\ndark energy, are eerily perfect for supporting life. Alter one of these\nconstants by a hair, and the universe becomes  unrecognizable. “For\nexample, if the mass of the neutron were a bit larger (in comparison to\nthe mass of the proton) than its actual value, hydrogen would not fuse\ninto deuterium and conventional stars would be impossible,” Carroll\nsaid. And thus, so would life as we know it.\nTheologians often seize upon the so-called “fine-tuning” of the\nphysical constants as evidence that God must have had a hand in them; it\nseems he chose the constants just for us. But contemporary physics\nexplains our seemingly supernatural good luck in a different way.\nSome versions of quantum gravity theory, including string theory, predict that our life-giving universe is but one of an infinite number of\nuniverses that altogether make up the multiverse. Among these infinite\nuniverses, the full range of values of all the physical constants are\nrepresented, and only some of the universes have values for the\nconstants that enable the formation of stars, planets and life as we\nknow it. We find ourselves in one of the lucky universes (because where\nelse?).\nSome theologians counter that it is far simpler to invoke God than to\npostulate the existence of infinitely many universes in order to explain\nour universe’s life-giving perfection. To them, Carroll retorts that\nthe multiverse wasn’t postulated as a complicated way to explain\nfine-tuning. On the contrary, it follows as a natural consequence of our\nbest, most elegant theories.\nWhile it may be true that the multiverse wasn’t originally postulated as a way to explain fine-tuning, there is no question that is the primary way in which it is utilized now.  It borders on the dishonest to pretend otherwise.  The logical irony, of course, is that multiverse theory itself suggests that even if we happen to inhabit a godless universe, there must be other universes in which gods exist.  And then, there is no logical reason to assume that a Creator God which created one universe did not create more universes.  Multiverse theory is not a means of deprecating God, it is merely a means of defending godlessness against the powerful assault of the anthropic principle.\nWhen one contemplate these matters, one quickly realizes that most scientists would do well to stick to science.  Because as both philosophers and theologians, they tend to be remarkably incompetent.",
  "tags": [
    "religion",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-20T09:01:00+00:00"
}