{
  "url": "https://voxday.net/2012/09/25/bombs-before-gdp/",
  "scraped_at": "2025-12-14T05:04:06.465550",
  "title": "Bombs before GDP",
  "date_display": "September 25, 2012",
  "date_iso": "2012-09-25T14:18:00+00:00",
  "date_from_url": "2012-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger considers <a href=\"http://market-ticker.org/akcs-www?post=211959\">the problem of energy production</a> in a world of increasingly expensive oil and coal:</p><blockquote class=\"tr_bq\"><p> We experimented with <em>Thorium</em> as a nuclear fuel in the 1950s<br> and 1960s.  Carried in a molten salt there are a number of significant<br> advantages to this fuel cycle.  Chief among them is that the reactors<br> operate at atmospheric pressure, have a strongly-negative temperature<br> coefficient (that is, reactivity drops as temperature increases) and<br> because they operate with their fuel dispersed in the coolant and rely<br> on a fixed moderator in the reaction vessel <em>shutting them down is<br> simply a matter of draining the working fuel into a tank with sufficient<br> surface area to dissipate decay heat.</br></br></em>  This can be accomplished<br> passively; active cooling of a freeze plug in the bottom of the reactor<br> vessel can be employed during normal operation and if for any reason<br> that cooling is lost the plug melts, the coolant and working fluid<br> drains to tanks and the reactor shuts down.  In addition <em>thorium</em> is about as abundant in the environment as is <em>lead</em>, making its supply effectively infinite.</br></br></br></br></br></br></br></br></br></br></p><p>Finally, these reactors operate at a <strong>much</strong><br> higher temperature; the units we have run (yes, we’ve built them<br> experimentally in the 1950s – 1970s!) run in the neighborhood of 650C. <br> This allows closed-cycle turbine systems that are more efficient than<br> the conventional turbines in existing designs, making practical the<br> location of reactors in places that don’t have large amounts of water<br> available.  That in turn means that the risk of geological and other<br> similar accidents (e.g. tsunamis!) is greatly reduced or eliminated. <br> Finally, the fuel cycle is mostly-closed <strong><em>internally</em></strong>;<br> that is, rather than requiring both fast-breeder reactors and external<br> large-scale reprocessing plants to be practical, along with a way to<br> store a lot of high-level waste these units burn up most of their<br> high-level waste internally and produce their own fuel internally as<br> well as an inherent part of their operation.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>So why didn’t we pursue this path for nuclear power?</p><p><strong>That’s simple: It is entirely-unsuitable for production of nuclear bombs as it produces negligible amounts of plutonium.</strong></p></blockquote><p>A decision that might have made sense in the middle of the 1950s arms<br> race doesn’t make sense more than 60 years later.  So, why aren’t we<br> utilizing thorium-based nuclear power plants?</br></br></p></div>",
  "content_text": "Karl Denninger considers\nthe problem of energy production\nin a world of increasingly expensive oil and coal:\nWe experimented with\nThorium\nas a nuclear fuel in the 1950s\nand 1960s.  Carried in a molten salt there are a number of significant\nadvantages to this fuel cycle.  Chief among them is that the reactors\noperate at atmospheric pressure, have a strongly-negative temperature\ncoefficient (that is, reactivity drops as temperature increases) and\nbecause they operate with their fuel dispersed in the coolant and rely\non a fixed moderator in the reaction vessel\nshutting them down is\nsimply a matter of draining the working fuel into a tank with sufficient\nsurface area to dissipate decay heat.\nThis can be accomplished\npassively; active cooling of a freeze plug in the bottom of the reactor\nvessel can be employed during normal operation and if for any reason\nthat cooling is lost the plug melts, the coolant and working fluid\ndrains to tanks and the reactor shuts down.  In addition\nthorium\nis about as abundant in the environment as is\nlead\n, making its supply effectively infinite.\nFinally, these reactors operate at a\nmuch\nhigher temperature; the units we have run (yes, we’ve built them\nexperimentally in the 1950s – 1970s!) run in the neighborhood of 650C.\nThis allows closed-cycle turbine systems that are more efficient than\nthe conventional turbines in existing designs, making practical the\nlocation of reactors in places that don’t have large amounts of water\navailable.  That in turn means that the risk of geological and other\nsimilar accidents (e.g. tsunamis!) is greatly reduced or eliminated.\nFinally, the fuel cycle is mostly-closed\ninternally\n;\nthat is, rather than requiring both fast-breeder reactors and external\nlarge-scale reprocessing plants to be practical, along with a way to\nstore a lot of high-level waste these units burn up most of their\nhigh-level waste internally and produce their own fuel internally as\nwell as an inherent part of their operation.\nSo why didn’t we pursue this path for nuclear power?\nThat’s simple: It is entirely-unsuitable for production of nuclear bombs as it produces negligible amounts of plutonium.\nA decision that might have made sense in the middle of the 1950s arms\nrace doesn’t make sense more than 60 years later.  So, why aren’t we\nutilizing thorium-based nuclear power plants?",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-25T13:18:00+00:00"
}