{
  "url": "https://voxday.net/2012/09/07/choking-on-red-pi/",
  "scraped_at": "2025-12-14T05:02:56.169556",
  "title": "Choking on the red pill",
  "date_display": "September 7, 2012",
  "date_iso": "2012-09-07T13:00:00+00:00",
  "date_from_url": "2012-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At Alpha Game, I consider <a href=\"http://alphagameplan.blogspot.ch/2012/09/women-arent-attracted-to-godly-men.html\">one of the more problematic Churchian lies</a>, namely, the idea that women of the Church are particularly attracted to men of strong Christian faith:</p><blockquote><p>This may be among the most bitter of the various aspects of the red pill for some men, particularly Christian men, to swallow. It’s a message we hear from Christians and Churchians alike, that women will be attracted to men who are godly pillars of the community, that being “sold out for Jesus” is not merely an attractive feature, but the most definitively attractive aspect of a man for a Christian woman.</p><p>There is one serious problem with this. It is not true.</p></blockquote><p>I have no doubt there will be many Christian women who disagree with this.  I would simply ask them to honestly ask themselves if their strong Christian husband would be as <i>sexually</i> attractive to them if he was every bit as faithful and godly he is now, but lacked his other attractive attributes.</p><p>Nor do I intend to pick on women here – let’s face it, it’s pretty clear when I’m doing that – it is merely that the Church does not teach women it is their faith that is their primary appeal to men.  It does, however, teach men precisely that.</p></div>",
  "content_text": "At Alpha Game, I consider\none of the more problematic Churchian lies\n, namely, the idea that women of the Church are particularly attracted to men of strong Christian faith:\nThis may be among the most bitter of the various aspects of the red pill for some men, particularly Christian men, to swallow. It’s a message we hear from Christians and Churchians alike, that women will be attracted to men who are godly pillars of the community, that being “sold out for Jesus” is not merely an attractive feature, but the most definitively attractive aspect of a man for a Christian woman.\nThere is one serious problem with this. It is not true.\nI have no doubt there will be many Christian women who disagree with this.  I would simply ask them to honestly ask themselves if their strong Christian husband would be as\nsexually\nattractive to them if he was every bit as faithful and godly he is now, but lacked his other attractive attributes.\nNor do I intend to pick on women here – let’s face it, it’s pretty clear when I’m doing that – it is merely that the Church does not teach women it is their faith that is their primary appeal to men.  It does, however, teach men precisely that.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-07T12:00:00+00:00"
}