{
  "url": "https://voxday.net/2012/09/24/christians-and-law/",
  "scraped_at": "2025-12-14T05:04:00.973485",
  "title": "Christians and the Law",
  "date_display": "September 24, 2012",
  "date_iso": "2012-09-24T17:00:00+00:00",
  "date_from_url": "2012-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The responsibility of Christians to obey the Law of Moses is a subject<br> that comes up from time to time, which always surprises me because the<br> Bible is perfectly clear on the matter.  While it is understandable,<br> though not excusable, that atheists regularly confuse Christianity with<br> Judaism when attempting to criticize the former, it is absolutely<br> bizarre that some Christians are still under the impression that they<br> have an obligation to abide by Jewish Law.</br></br></br></br></br></br></p><p>Christians are not Jews.  Christians are not obligated to follow Mosaic<br> Law.  Ask any Jew, he should be able to confirm it.  As will the Bible, in Acts 15:</br></p><blockquote class=\"tr_bq\"><h3> The Council at Jerusalem</h3><p>Certain people came down from Judea to<br> Antioch and were teaching the believers: “Unless you are circumcised,<br> according to the custom taught by Moses, you cannot be saved.”  This<br> brought Paul and Barnabas into sharp dispute and debate with them. So<br> Paul and Barnabas were appointed, along with some other believers, to go<br> up to Jerusalem to see the apostles and elders about this question. The<br> church sent them on their way, and as they traveled through Phoenicia<br> and Samaria, they told how the Gentiles had been converted. This news<br> made all the believers very glad.  When<br> they came to Jerusalem, they were welcomed by the church and the<br> apostles and elders, to whom they reported everything God had done<br> through them.Then<br> some of the believers who belonged to the party of the Pharisees stood<br> up and said, “The Gentiles must be circumcised and required to keep the<br> law of Moses.” <br> The apostles and elders met to consider this question. After<br> much discussion, Peter got up and addressed them: “Brothers, you know<br> that some time ago God made a choice among you that the Gentiles might<br> hear from my lips the message of the gospel and believe. God, who knows the heart, showed that he accepted them by giving the Holy Spirit to them, just as he did to us. He did not discriminate between us and them, for he purified their hearts by faith. Now<br> then, why do you try to test God by putting on the necks of Gentiles a<br> yoke that neither we nor our ancestors have been able to bear? No! We believe it is through the grace of our Lord Jesus that we are saved, just as they are.”<br> The whole assembly<br> became silent as they listened to Barnabas and Paul telling about the<br> signs and wonders God had done among the Gentiles through them. When they finished, James spoke up. “Brothers,” he said, “listen to me. Simon has described to us how God first intervened to choose a people for his name from the Gentiles. The words of the prophets are in agreement with this, as it is written:</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><div class=\"poetry top-05\"><div class=\"line\"> <i>‘After this I will return and rebuild David’s fallen tent.<br> Its ruins I will rebuild, and I will restore it,<br> That the rest of mankind may seek the Lord,<br> Even all the Gentiles who bear my name,<br> Says the Lord, who does these things,<br> Things known from long ago.</br></br></br></br></br></i></div></div><div class=\"top-05\"></div><p></p><div class=\"top-05\"> “It is my judgment, therefore, that we should not make it difficult for the Gentiles who are turning to God. Instead<br> we should write to them, telling them to abstain from food polluted by<br> idols, from sexual immorality, from the meat of strangled animals and<br> from blood. For the law of Moses has been preached in every city from the earliest times and is read in the synagogues on every Sabbath.”</br></br></br></div><h3> The Council’s Letter to Gentile Believers</h3><p>Then the apostles and elders, with the<br> whole church, decided to choose some of their own men and send them to<br> Antioch with Paul and Barnabas. They chose Judas (called Barsabbas) and<br> Silas, men who were leaders among the believers. With them they sent the following letter:</br></br></br></p><div class=\"left-1 child-first-line-1\"><div class=\"first-line-none top-1\"></div></div><div class=\"left-1 child-first-line-1\"><div class=\"first-line-none top-1\"> <i>The apostles and elders, your brothers,</i></div><p><i>To the Gentile believers in Antioch, Syria and Cilicia:</i></p></div><div class=\"left-1 child-first-line-1\"> <i>Greetings.</i></div><div class=\"left-1 child-first-line-1\"> <i>We have heard that some went out from us without our authorization and disturbed you, troubling your minds by what they said. So we all agreed to choose some men and send them to you with our dear friends Barnabas and Paul— men who have risked their lives for the name of our Lord Jesus Christ. Therefore we are sending Judas and Silas to confirm by word of mouth what we are writing. It seemed good to the Holy Spirit and to us not to burden you with anything beyond the following requirements: You<br> are to abstain from food sacrificed to idols, from blood, from the meat<br> of strangled animals and from sexual immorality. You will do well to<br> avoid these things.</br></br></br></i></div><div class=\"left-1 child-first-line-1\"> <i>Farewell. </i></div><div class=\"top-1\"> So the men were sent off and went down to Antioch, where they gathered the church together and delivered the letter. The people read it and were glad for its encouraging message. Judas and Silas, who themselves were prophets, said much to encourage and strengthen the believers. After<br> spending some time there, they were sent off by the believers with the<br> blessing of peace to return to those who had sent them. But Paul and Barnabas remained in Antioch, where they and many others taught and preached the word of the Lord.</br></br></div></blockquote><p>The fact that Jesus Christ did not abolish the Law says nothing about<br> its continued inapplicability to those who are not Jews.  In fact, to<br> claim it now applies to non-Jews when it did not before on the basis of<br> Matthew 5:17-20 is clearly self-contradictory, for the obvious reason<br> that making it applicable to people to whom it did not previously apply<br> would be changing the letter of it.  Note particularly how Jesus states<br> even those who “sets<br> aside one of the least of these commands and teaches others<br> accordingly” will still nevertheless be part of the kingdom of heaven.</br></br></br></br></br></br></br></br></p></div>",
  "content_text": "The responsibility of Christians to obey the Law of Moses is a subject\nthat comes up from time to time, which always surprises me because the\nBible is perfectly clear on the matter.  While it is understandable,\nthough not excusable, that atheists regularly confuse Christianity with\nJudaism when attempting to criticize the former, it is absolutely\nbizarre that some Christians are still under the impression that they\nhave an obligation to abide by Jewish Law.\nChristians are not Jews.  Christians are not obligated to follow Mosaic\nLaw.  Ask any Jew, he should be able to confirm it.  As will the Bible, in Acts 15:\nThe Council at Jerusalem\nCertain people came down from Judea to\nAntioch and were teaching the believers: “Unless you are circumcised,\naccording to the custom taught by Moses, you cannot be saved.”  This\nbrought Paul and Barnabas into sharp dispute and debate with them. So\nPaul and Barnabas were appointed, along with some other believers, to go\nup to Jerusalem to see the apostles and elders about this question. The\nchurch sent them on their way, and as they traveled through Phoenicia\nand Samaria, they told how the Gentiles had been converted. This news\nmade all the believers very glad.  When\nthey came to Jerusalem, they were welcomed by the church and the\napostles and elders, to whom they reported everything God had done\nthrough them.Then\nsome of the believers who belonged to the party of the Pharisees stood\nup and said, “The Gentiles must be circumcised and required to keep the\nlaw of Moses.”\nThe apostles and elders met to consider this question. After\nmuch discussion, Peter got up and addressed them: “Brothers, you know\nthat some time ago God made a choice among you that the Gentiles might\nhear from my lips the message of the gospel and believe. God, who knows the heart, showed that he accepted them by giving the Holy Spirit to them, just as he did to us. He did not discriminate between us and them, for he purified their hearts by faith. Now\nthen, why do you try to test God by putting on the necks of Gentiles a\nyoke that neither we nor our ancestors have been able to bear? No! We believe it is through the grace of our Lord Jesus that we are saved, just as they are.”\nThe whole assembly\nbecame silent as they listened to Barnabas and Paul telling about the\nsigns and wonders God had done among the Gentiles through them. When they finished, James spoke up. “Brothers,” he said, “listen to me. Simon has described to us how God first intervened to choose a people for his name from the Gentiles. The words of the prophets are in agreement with this, as it is written:\n‘After this I will return and rebuild David’s fallen tent.\nIts ruins I will rebuild, and I will restore it,\nThat the rest of mankind may seek the Lord,\nEven all the Gentiles who bear my name,\nSays the Lord, who does these things,\nThings known from long ago.\n“It is my judgment, therefore, that we should not make it difficult for the Gentiles who are turning to God. Instead\nwe should write to them, telling them to abstain from food polluted by\nidols, from sexual immorality, from the meat of strangled animals and\nfrom blood. For the law of Moses has been preached in every city from the earliest times and is read in the synagogues on every Sabbath.”\nThe Council’s Letter to Gentile Believers\nThen the apostles and elders, with the\nwhole church, decided to choose some of their own men and send them to\nAntioch with Paul and Barnabas. They chose Judas (called Barsabbas) and\nSilas, men who were leaders among the believers. With them they sent the following letter:\nThe apostles and elders, your brothers,\nTo the Gentile believers in Antioch, Syria and Cilicia:\nGreetings.\nWe have heard that some went out from us without our authorization and disturbed you, troubling your minds by what they said. So we all agreed to choose some men and send them to you with our dear friends Barnabas and Paul— men who have risked their lives for the name of our Lord Jesus Christ. Therefore we are sending Judas and Silas to confirm by word of mouth what we are writing. It seemed good to the Holy Spirit and to us not to burden you with anything beyond the following requirements: You\nare to abstain from food sacrificed to idols, from blood, from the meat\nof strangled animals and from sexual immorality. You will do well to\navoid these things.\nFarewell.\nSo the men were sent off and went down to Antioch, where they gathered the church together and delivered the letter. The people read it and were glad for its encouraging message. Judas and Silas, who themselves were prophets, said much to encourage and strengthen the believers. After\nspending some time there, they were sent off by the believers with the\nblessing of peace to return to those who had sent them. But Paul and Barnabas remained in Antioch, where they and many others taught and preached the word of the Lord.\nThe fact that Jesus Christ did not abolish the Law says nothing about\nits continued inapplicability to those who are not Jews.  In fact, to\nclaim it now applies to non-Jews when it did not before on the basis of\nMatthew 5:17-20 is clearly self-contradictory, for the obvious reason\nthat making it applicable to people to whom it did not previously apply\nwould be changing the letter of it.  Note particularly how Jesus states\neven those who “sets\naside one of the least of these commands and teaches others\naccordingly” will still nevertheless be part of the kingdom of heaven.",
  "tags": [
    "Christianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-24T16:00:00+00:00"
}