{
  "url": "https://voxday.net/2012/09/27/emotion-logic-and-dishonesty/",
  "scraped_at": "2025-12-14T05:04:17.474697",
  "title": "The descent from dialectic",
  "date_display": "September 27, 2012",
  "date_iso": "2012-09-27T10:21:00+00:00",
  "date_from_url": "2012-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over the course of the discussion of female solipsism that took place at Alpha Game, HUS, and other Game blogs, the distinction between dialectic and rhetoric, and between logic and emotion, has repeatedly come up.  Two things have become obvious as a result, which is that 1) men have no choice but to accept the observable female inclination for solipsism, rhetoric, and emotion, and 2) women have to accept that those men who strongly prefer objective perspectives, dialectic, and logic are never going to look favorably upon women’s rejection of those things even if they accept the fact of the female disinclination.</p><p>The problem is that emotion and rhetoric are both dishonest, the former intrinsically and the latter practically.  This is not to say that the emotions are bad, only that because they are dynamic and the truth is static, emotion-based reasoning is guaranteed to be false at least part of the time.  Rhetoric, on the other hand, does not have to be dishonest, but because it is designed to manipulate and convince those who, as Aristotle pointed out in <i>Rhetoric</i>, “cannot take in at a glance a complicated argument, or follow a long<br> chain of reasoning”, it usually has to be at least somewhat in variance with the complete truth because it is designed to appeal to the emotions.</br></p><p>More <a href=\"http://www.milobookclub.com/2012/09/27/emotion-logic-and-dishonesty/\">at Alpha Game</a>… including an argument for gun control and two counterarguments!  But please keep the inevitable gun discussion here at VP.</p></div>",
  "content_text": "Over the course of the discussion of female solipsism that took place at Alpha Game, HUS, and other Game blogs, the distinction between dialectic and rhetoric, and between logic and emotion, has repeatedly come up.  Two things have become obvious as a result, which is that 1) men have no choice but to accept the observable female inclination for solipsism, rhetoric, and emotion, and 2) women have to accept that those men who strongly prefer objective perspectives, dialectic, and logic are never going to look favorably upon women’s rejection of those things even if they accept the fact of the female disinclination.\nThe problem is that emotion and rhetoric are both dishonest, the former intrinsically and the latter practically.  This is not to say that the emotions are bad, only that because they are dynamic and the truth is static, emotion-based reasoning is guaranteed to be false at least part of the time.  Rhetoric, on the other hand, does not have to be dishonest, but because it is designed to manipulate and convince those who, as Aristotle pointed out in\nRhetoric\n, “cannot take in at a glance a complicated argument, or follow a long\nchain of reasoning”, it usually has to be at least somewhat in variance with the complete truth because it is designed to appeal to the emotions.\nMore\nat Alpha Game\n… including an argument for gun control and two counterarguments!  But please keep the inevitable gun discussion here at VP.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-27T09:21:00+00:00"
}