{
  "url": "https://voxday.net/2012/09/19/free-trade-and-war/",
  "scraped_at": "2025-12-14T05:03:35.250409",
  "title": "Free trade and war",
  "date_display": "September 19, 2012",
  "date_iso": "2012-09-19T08:56:00+00:00",
  "date_from_url": "2012-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet another pillar in the free trade theory appears to be <a href=\"http://www.generationaldynamics.com/cgi-bin/D.PL?xct=gd.e120918#e120918\">on the verge of falling</a>:</p><blockquote><p><b>China declares economic war on Japan</b></p><p>China is trying to hurt Japan economically, to gain leverage in its campaign to take control of the Senkaku/Diaoyu islands. In the 2010 confrontations, China took revenge on Japan by terminating shipments of rare earth minerals, needed for manufacturing of many of Japan’s electronic products. In the current confrontation, the Beijing government is encouraging the Chinese people to demonstrate and protest against Japanese businesses in China. The government urged protesters not to use violence, but that part of the message is clearly not getting through. Protesters torched a Panasonic factory and Toyota dealership, looted and ransacked Japanese department stores and supermarkets in several cities. China’s National Tourism Administration ordered travel companies last week to cancel tours to Japan over the weeklong National Day holiday in early October. AP and Bloomberg</p><p><b>Chinese Communist Party urges punitive sanctions against Japan</b></p><p>The Chinese Communist Party (CCP) is urging strong punitive sanctions against Japan, for its “well-orchestrated plan” to take control of the Senkaku/Diaoyu islands, according to the CCP’s official newspaper:</p><p>“The “nationalization” of the Diaoyu Islands by Japan after “purchasing” them from a “private owner” is ridiculous and cannot change the fact that they are Chinese territory. … China should take strong countermeasures, especially economic sanctions, to respond to Japan’s provocations. Military consideration, however, should be the last choice.</p><p>The United States has frequently used Article XXI Security Exceptions of the WTO (taken from the earlier General Agreement on Tariffs and Trade) to impose economic sanctions on other countries. The security exception clause says a country cannot be stopped from taking any action it considers necessary to protect its security interests. That means a country can impose sanctions on enterprises, financial institutions, organizations and even other countries’ central and local governments. Taking a cue from the US’ practice, China can use the security exception clause to reduce the export of some important materials to Japan.</p><p>China didn’t announce any sanctions against the Philippines in April, but it froze banana imports from that country in response to Manila’s aggressive attitude in the Huangyan Island dispute. Though the economic countermeasure forced the Philippines on the back foot, it also harmed the interests of some Chinese enterprises.</p><p>So it is important for China to devise a sanction plan against Japan that would cause minimum loss to Chinese enterprises.</p><p>The US’ capability to impose economic sanctions on other countries is based on its economic strength, huge share in global trade, financial institutions and global intelligence network. China, too, has the capability to impose sanctions on other countries now that it is the second largest economy, has the largest foreign reserves, and is the largest exporter and second largest importer.</p><p>An analysis of Sino-Japanese economic interdependence shows that Japan’s economy will suffer severely if China were to impose sanctions on it. China’s loss would be relatively less. … So it’s clear that China can deal a heavy blow to the Japanese economy without hurting itself too much by resorting to sanctions.</p><p>Apart from its reliance on China, Japan has been suffering from other economic ills. First, Japan’s massive government debt is increasing substantially. … Third, Japan’s fiscal deterioration is likely to continue. There are enough indications that Japan’s economic growth in 2013 will slow down or slip into another recession. The irreversible trend of long-term economic downturn, combined with Japan’s aging population, will eat into the country’s household savings, and the declining purchasing power of the Japanese will increase Japan’s fiscal debt. …</p><p>But instead of blindly boycotting Japanese goods, China should work out a comprehensive plan which should include imposition of sanctions and taking precautionary measures against any Japanese retaliation. China should also have several rounds of policies ready to undermine the Japanese economy at the least cost of Chinese enterprises.</p><p>Furthermore, in case Chinese enterprises suffer because of the sanctions, the Chinese government should be prepared to compensate them. And once China imposes sanctions on Japan, the government should ensure that all enterprises in the country, domestic and foreign, obey the rules.”</p></blockquote><p>China and Japan have only been trading since diplomatic ties were normalized in 1972; China became <a href=\"http://www.washingtonpost.com/wp-dyn/articles/A40192-2005Jan26.html\">Japan’s largest trading partner</a> in 2004.  A war between two of the world’s largest economies would permanently shatter the oft-heard argument that trade eliminates the possibility of war.  It’s an argument that should always have been dubious, however, as England’s many wars against the various principalities in India and the USA’s Middle East wars have all <i>followed</i> the inception of large-scale trade with the region.</p><p>Once more, we see that free trade delivers precisely the opposite of what it promises.  And, as Generational Dynamics adroitly points out, trade actually expands the range of warfare as well as providing an economic weapon that can be wielded against the trading partner.  Even when trade is not a cause of the war, it provides a means of fighting it.</p><p>Lest anyone think I am setting up a strawman here, consider <a href=\"http://mises.org/daily/915\">this article by a free trade advocate</a> at the Mises Institute: <i>“The Classical Liberals of the nineteenth century were certain that the end of the old Mercantilist system–with its government control of trade and commerce, its bounties (subsidies) and prohibitions on exports and imports–would open wide vistas for improving the material conditions of man through the internationalization of the system of division of labor. They also believed that the elimination of barriers to trade and the free intercourse among men would help to significantly reduce if not end the causes of war among nations.”</i></p></div>",
  "content_text": "Yet another pillar in the free trade theory appears to be\non the verge of falling\n:\nChina declares economic war on Japan\nChina is trying to hurt Japan economically, to gain leverage in its campaign to take control of the Senkaku/Diaoyu islands. In the 2010 confrontations, China took revenge on Japan by terminating shipments of rare earth minerals, needed for manufacturing of many of Japan’s electronic products. In the current confrontation, the Beijing government is encouraging the Chinese people to demonstrate and protest against Japanese businesses in China. The government urged protesters not to use violence, but that part of the message is clearly not getting through. Protesters torched a Panasonic factory and Toyota dealership, looted and ransacked Japanese department stores and supermarkets in several cities. China’s National Tourism Administration ordered travel companies last week to cancel tours to Japan over the weeklong National Day holiday in early October. AP and Bloomberg\nChinese Communist Party urges punitive sanctions against Japan\nThe Chinese Communist Party (CCP) is urging strong punitive sanctions against Japan, for its “well-orchestrated plan” to take control of the Senkaku/Diaoyu islands, according to the CCP’s official newspaper:\n“The “nationalization” of the Diaoyu Islands by Japan after “purchasing” them from a “private owner” is ridiculous and cannot change the fact that they are Chinese territory. … China should take strong countermeasures, especially economic sanctions, to respond to Japan’s provocations. Military consideration, however, should be the last choice.\nThe United States has frequently used Article XXI Security Exceptions of the WTO (taken from the earlier General Agreement on Tariffs and Trade) to impose economic sanctions on other countries. The security exception clause says a country cannot be stopped from taking any action it considers necessary to protect its security interests. That means a country can impose sanctions on enterprises, financial institutions, organizations and even other countries’ central and local governments. Taking a cue from the US’ practice, China can use the security exception clause to reduce the export of some important materials to Japan.\nChina didn’t announce any sanctions against the Philippines in April, but it froze banana imports from that country in response to Manila’s aggressive attitude in the Huangyan Island dispute. Though the economic countermeasure forced the Philippines on the back foot, it also harmed the interests of some Chinese enterprises.\nSo it is important for China to devise a sanction plan against Japan that would cause minimum loss to Chinese enterprises.\nThe US’ capability to impose economic sanctions on other countries is based on its economic strength, huge share in global trade, financial institutions and global intelligence network. China, too, has the capability to impose sanctions on other countries now that it is the second largest economy, has the largest foreign reserves, and is the largest exporter and second largest importer.\nAn analysis of Sino-Japanese economic interdependence shows that Japan’s economy will suffer severely if China were to impose sanctions on it. China’s loss would be relatively less. … So it’s clear that China can deal a heavy blow to the Japanese economy without hurting itself too much by resorting to sanctions.\nApart from its reliance on China, Japan has been suffering from other economic ills. First, Japan’s massive government debt is increasing substantially. … Third, Japan’s fiscal deterioration is likely to continue. There are enough indications that Japan’s economic growth in 2013 will slow down or slip into another recession. The irreversible trend of long-term economic downturn, combined with Japan’s aging population, will eat into the country’s household savings, and the declining purchasing power of the Japanese will increase Japan’s fiscal debt. …\nBut instead of blindly boycotting Japanese goods, China should work out a comprehensive plan which should include imposition of sanctions and taking precautionary measures against any Japanese retaliation. China should also have several rounds of policies ready to undermine the Japanese economy at the least cost of Chinese enterprises.\nFurthermore, in case Chinese enterprises suffer because of the sanctions, the Chinese government should be prepared to compensate them. And once China imposes sanctions on Japan, the government should ensure that all enterprises in the country, domestic and foreign, obey the rules.”\nChina and Japan have only been trading since diplomatic ties were normalized in 1972; China became\nJapan’s largest trading partner\nin 2004.  A war between two of the world’s largest economies would permanently shatter the oft-heard argument that trade eliminates the possibility of war.  It’s an argument that should always have been dubious, however, as England’s many wars against the various principalities in India and the USA’s Middle East wars have all\nfollowed\nthe inception of large-scale trade with the region.\nOnce more, we see that free trade delivers precisely the opposite of what it promises.  And, as Generational Dynamics adroitly points out, trade actually expands the range of warfare as well as providing an economic weapon that can be wielded against the trading partner.  Even when trade is not a cause of the war, it provides a means of fighting it.\nLest anyone think I am setting up a strawman here, consider\nthis article by a free trade advocate\nat the Mises Institute:\n“The Classical Liberals of the nineteenth century were certain that the end of the old Mercantilist system–with its government control of trade and commerce, its bounties (subsidies) and prohibitions on exports and imports–would open wide vistas for improving the material conditions of man through the internationalization of the system of division of labor. They also believed that the elimination of barriers to trade and the free intercourse among men would help to significantly reduce if not end the causes of war among nations.”",
  "tags": [
    "free trade",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-19T07:56:00+00:00"
}