{
  "url": "https://voxday.net/2012/09/25/gay-marriage-eliminates-motherhood/",
  "scraped_at": "2025-12-14T05:04:04.614573",
  "title": "Gay marriage eliminates motherhood",
  "date_display": "September 25, 2012",
  "date_iso": "2012-09-25T07:40:00+00:00",
  "date_from_url": "2012-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Time exposes yet another lie from the pro-homogamy crowd:</p><div class=\"firstPar\"><blockquote class=\"tr_bq\"><p> France is set to ban the words “mother” and “father” from all official documents under controversial plans to legalise gay marriage.  The move, which has outraged Catholics, means only the word “parents”<br> would be used in identical marriage ceremonies for all heterosexual and<br> same-sex couples. The draft law states that “marriage is a union of two people, of<br> different or the same gender”. It says all references to “mothers and fathers” in the civil code –<br> which enshrines French law – will be swapped for simply “parents”. </br></br></br></br></p></blockquote><p>The homogamy advocates often like to ask how government-approved “gay marriage” could possibly affect normal heterosexual marriages.  Here is the answer: by eliminating both maternal and paternal status in law.  Nor is France the only place this legal assault on the traditional concepts of motherhood and fatherhood are taking place; the California Senate has sent up a trial balloon in its bill 777 which appears to be an attempt to remove the traditional concepts from the state educational system.</p><p>The interesting thing will be how this end to the legal statuses of “mother” and “father” will affect divorce law.  After all, it won’t be possible to assume that child custody will be given to the mother, once that position is legally abolished.  One wonders if the pro-homogamy members of the more progressive sex will rethink their support for the fake institution if they realize it may eventually result in their losing a substantial portion of their family court advantage.</p></div><div class=\"secondPar\"></div><div class=\"thirdPar\"></div></div>",
  "content_text": "Time exposes yet another lie from the pro-homogamy crowd:\nFrance is set to ban the words “mother” and “father” from all official documents under controversial plans to legalise gay marriage.  The move, which has outraged Catholics, means only the word “parents”\nwould be used in identical marriage ceremonies for all heterosexual and\nsame-sex couples. The draft law states that “marriage is a union of two people, of\ndifferent or the same gender”. It says all references to “mothers and fathers” in the civil code –\nwhich enshrines French law – will be swapped for simply “parents”.\nThe homogamy advocates often like to ask how government-approved “gay marriage” could possibly affect normal heterosexual marriages.  Here is the answer: by eliminating both maternal and paternal status in law.  Nor is France the only place this legal assault on the traditional concepts of motherhood and fatherhood are taking place; the California Senate has sent up a trial balloon in its bill 777 which appears to be an attempt to remove the traditional concepts from the state educational system.\nThe interesting thing will be how this end to the legal statuses of “mother” and “father” will affect divorce law.  After all, it won’t be possible to assume that child custody will be given to the mother, once that position is legally abolished.  One wonders if the pro-homogamy members of the more progressive sex will rethink their support for the fake institution if they realize it may eventually result in their losing a substantial portion of their family court advantage.",
  "tags": [
    "law",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-25T06:40:00+00:00"
}