{
  "url": "https://voxday.net/2012/09/21/greenberg-interview-sep-2012/",
  "scraped_at": "2025-12-14T05:03:46.333002",
  "title": "Greenberg Interview Sep 2012",
  "date_display": "September 21, 2012",
  "date_iso": "2012-09-21T11:23:00+00:00",
  "date_from_url": "2012-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: You are<br> listening to Greenburg News with your host Brian Greenburg at WNJC<br> 1360AM, now newly syndicated on WIFI 1460AM.  We have an excellent<br> show.  I’m<br> going to talk to the six people who actually watched the political<br> convention.  But we can talk about it.  …  There’s an election in<br> November and for those of you who are going to participate, we have<br> some insight.  We have with us Vox<br> Day, a libertarian political columnist and the author of <i>The Return<br> of the Great Depression</br></i>.  Known as the Internet Superintelligence,<br> he was one of the few economics writers to correctly predict the<br> financial crisis of 2008.  Residing in Italy…anyway Vox, welcome to<br> Greenburg News.</br></br></br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Thank you, sir.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So, where are you<br> in Italy by the way?</br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I’m up in the<br> North.</br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: The more civilized<br> part of the country, is that it?</br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well it all<br> depends on how you want to look at civilization.  I quite like it in<br> the South as well.  But yeah there’s a little bit more structure and<br> business and that sort of thing, in the North.</br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So, they’re next<br> in line too to go broke, after Spain goes down?</br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: I think it’s<br> possible but there have been a lot of people that want to go back to the<br> Lira, have wanted to go back to the Lira pretty much since the Euro<br> got stuck on them.</br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  What happened,<br> people wake up in the middle of the night and all of a sudden people<br> have a different currency?</br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Pretty much.<br> There was a process and we were here when it happened and it was<br> basically like having about 20 percent inflation overnight.  All the<br> businesses rounded up and so the official exchange rate really<br> got bumped up.  What you actually paid was more than the official<br> exchange rate that was supposed to happen.  As a result, tourism was<br> really down and it became much more difficult for Italian companies<br> to compete because they were no longer a low-cost producer.</br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You know there’s<br> something bizarre about this.  And of course people know about the<br> Euro, but its much worse than that, it’s the impact of Brussels’<br> government, and what I mean by that is I was recently in Portugal,<br> visiting Lisbon, and I heard that before I got there…this<br> story…and I thought nah, they didn’t commit economic suicide but in<br> fact that’s what happened to their fishing industry.  They had<br> 150,000 ships and now they have none.</br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, the EU has<br> been unmitigated disaster for most countries in Europe.  The problem<br> is it has been very good for the political class…</br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  For Germany.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Not so much the<br> everyday, average German.  The Germans have done fine because the<br> Germans work hard, and they’re smart, and they tend to do fairly well<br> no matter what happens.  But, the real problem is that all the<br> political class and the media and the academics have been bought<br> off by the flow of taxpayer money from the different countries<br> to…it all goes through the European Commission who then doles out<br> the money to all the people who will continue to push for it.  But<br> that whole process is really broken down because it doesn’t matter<br> how many people you pay off, once things get bad enough they’re not<br> going to be convinced by the various politicians and academics and<br> journalists who are on the payroll of the European Union somehow.</br></br></br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  But let me ask<br> you, if you’re Portuguese…country goes back to the 1,100’s and<br> you’ve had a history over 900 years, going on 1,000 years, of<br> fishing…the lifeblood of the nation and some idiot in Brussels says<br> disband because you have an unfair advantage and they do…</br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The problem is the<br> fisherman doesn’t really have a choice, its not like the fisherman<br> wants to do anything but Brussels is paying for a large fishing<br> police and they are physically preventing people from doing anything.<br> You see the same thing in England, for example, where people who<br> have been selling fruit and oranges and that sort of thing in pounds<br> rather than kilos for hundreds of years, they’re suddenly being shut<br> down and then they’re not allowed to sell, by the British police,<br> unless they sell in kilos the way that they are dictated to sell<br> them.</br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So the way that I<br> look at this situation, depression is imminent in Europe.</br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Oh, its already<br/> here, the depression is already here in the States.<p><a name=\"more\"></a></p></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  No things are<br/> happy here, didn’t you hear?  Its all good.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  When you’re out of<br/> the country sometimes things can get skewed.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, the thing<br/> that people don’t understand, and the thing that people don’t realize,<br/> is that no one ever defined economic depressions by utilizing<br/> official GDP statistics released by the Bureau of Economic Analysis<br/> until after, well after, the Great Depression.  And so to say that we<br/> don’t have a depression because GDP is positive is a fundamental<br/> misunderstanding of what a depression is.  And so the fact that the<br/> government statisticians can find a way of claiming that we still<br/> have economic growth when there’s something like 15,000,000 American<br/> families on food stamps, and the fact that we don’t have people lining<br/> up to go to soup kitchens and stuff.  Instead of that we have people<br/> spending money on their government funded debit cards but the<br/> principle is the same.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You know a<br/> statistic that doesn’t get picked up is the amount of people who have<br/> become “long-term disabled” since the Great Recession<br/> began.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Nearly 4,000,000<br/> people, I think its almost twice the amount of people who were<br/> long-term disabled in this country, you know nearly doubled in the<br/> last 3 years.  Its unbelievable.  And basically they are hiding the<br/> people on their, they’re just warehousing them.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, that’s<br/> why I think it doesn’t make much sense to look at the various<br/> unemployment statistics because all of them are gamed in various<br/> ways.  In the book that you referenced, <i>The Return of the Great<br/> Depression</i>, I have a chapter that is called “No One Knows<br/> Anything” and one of the things that it indicates and goes<br/> through in some detail is showing how the various statistics are<br/> gamed, and how they are, by their own metrics, completely inaccurate.<br/> And so I think its much more interesting and useful, even though<br/> still misleading, but the employment population ratio is a much more<br/> meaningful indicator because that just simply looks at how many<br/> people are employed out of the total population.  And you can see<br/> there, much more easily, the negative state of the economy than you<br/> can when you’re just looking at the unemployment numbers because<br/> their definition of unemployed allows them to take people out of the<br/> work force then claim that they are neither employed nor unemployed.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Well here’s a<br/> definition, we can technically be at full employment if, in essence,<br/> we were to stop the bleeding of new people getting unemployed and<br/> just allowed the benefits to run out on the existing workforce who<br/> were collecting, or unemployed workforce.  And if all these people<br/> are collecting were to go past the 99 weeks or whatever they’re<br/> collecting now, we could say we’re at full employment.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Because the number<br/> is gamed because they don’t count unemployment… unemployment does<br/> not mean you are not employed, it means you are not employed and you<br/> are not actively seeking for a job or collecting unemployment<br/> benefits.  It’s just absolutely ludicrous.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  It is bull, but<br/> besides even that how about the devastation of young people today,<br/> which I want to blame them in a minute, but just as far as the pure<br/> numbers where, what is it one in two, are in effect not employed in<br/> their…either not employed or out of work in the last three years?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Far be it from me<br/> to claim that young people are anything but stupid.  There’s nothing<br/> that I find more annoying.  And speaking as someone who used to be<br/> young, I remember I was young and that’s why I know that young people<br/> are stupid, because I was too.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  I think the<br/> problem is this: when I went to college my tuition was $1,000 a year,<br/> so if I screwed up I’m out of pocket $1,000.  If I would have taken<br/> basket weaving and I spend $4,000 in my example and I graduated and<br/> found there’s no jobs, I’m out four grand.  But today the mistakes are<br/> not $4,000 they’re $100,000 and they’re studying majors where they<br/> don’t…in other words you have to be a lot smarter or more savvy or<br/> much more savvier and that’s not saying blame the students, the 18<br/> year olds, because the parents should be there guiding them to a<br/> major where there’s a prospect of employment.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The problem is<br/> really multi-fold because if you look, I mean yes, young people are<br/> stupid, but on the other hand they’ve also been lied to, you know?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Even if you’re<br/> studying a good solid major…I read a really remarkable statistic<br/> the other day about PhDs back in the 1950’s or something pretty much<br/> if you got a PhD you were immediately employed.  And nowadays the<br/> number of people who get a PhD and are able to find a position is<br/> well below 20 percent and so these are people who are playing the game the<br/> right way but they’re playing the 1950’s game 60 years later.  And<br/> nobody realizes that.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Well its, well<br/> that’s again all the people have been taught is education is the key<br/> to success.  It doesn’t matter what youstudy, just study education.<br/> By the way, have you ever looked into people who pursued becoming a<br/> priest, the seminaries?  And how many seminary graduates can’t find a<br/> pulpit and walk around with thousands of dollars in debt as a result?<br/> The numbers are staggering.  Its a statistic you should explore…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> But let me ask you, you<br/> mentioned about depression.  How do you define a depression as<br/> opposed to a recession we’ve had in other periods of time?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The correct<br/> definition of a depression is very simple, it means a<br/> reduction in the amount of economic activity.  And so there’s many<br/> different ways you can look at that and simply looking at the<br/> employment population ratio is one easy way to do it.  And another<br/> easy way to do it is to look at industrial output.  All the Fed’s<br/> beige book numbers and stuff, those have been turning<br/> negative for some time now, they’ve been up and down.  But the most,<br/> I mean, its kind of like the famous Supreme Court decision about<br/> pornography, in the past a depression was when a people felt they<br/> were in a depression.  And so if you look at the social<br/> mood, if you look at the crime statistics, if you look at the<br/> diseases and people getting sick and that sort of thing, and if you<br/> look at military conflict, those are all things that tend to coincide<br/> with depressions. If you look around at the state of the world<br/> right now, you can see the world is in a depression.  In fact the<br/> world is in a bigger global depression then it was in the 1920’s<br/> because what most people don’t realize is that except for Germany and<br/> the USA there really was no Great Depression in France or in England, and Japan was actually in a major economic boom at the time because<br/> they had taken of Manchuria.  If you look at their GNP statistics<br/> from the time they were experiencing growth of like 15 percent per year.  And<br/> so now what we’re seeing is Europe is in depression, Japan is in<br/> depression, China appears to have now entered it, and USA is in it.<br/> We’re experiencing it, we’re getting towards the end of the beginning.<br/> People are still pretending that we’re not.  They’re still talking<br/> about the slow recovery and that sort of thing, but its all nonsense.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So now that we’ve<br/> defined that things are not good out there and there’s now talk<br/> of…they’re going back to the well.  They’re going to do QE3.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Mm hmm.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  The well is not<br/> really generated anything of substance, obviously, in the past, but<br/> that’s central bankers know so they gotta do what they know.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, its not just<br/> all that they know, its also what is necessary for the banks.  See<br/> what people don’t understand is quantitative easing is not about<br/> saving the economy, quantitative easing is about giving the banks and<br/> the large financial institutions a relatively soft landing as the<br/> economy goes into depression.  So what they’re attempting to do is<br/> basically continue to transfer assets from the taxpayer to the banks<br/> in order to keep them from completely failing and going under.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> If you’re coming at it<br/> from the world of the banker it makes perfect sense.  They’re trying<br/> to defend the survival of the global financial system but the problem<br/> is the whole thing is going to come down sooner or later.  Does it<br/> makes sense to prop it up for a while?  From some people’s<br/> perspective, yes.  But in terms of if you’re  looking at it from what<br/> is best for the economy as a whole, obviously it is best for the<br/> bankrupt institutions to go bankrupt so that what remains of their<br/> good assets can be used to rebuild.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, and what<br/> people fail to realize is by bailing out these banks and keeping the<br/> status quo you have people making capital investment decisions based<br/> on the perception that things are not that bad and then taking on<br/> debt and otherwise investments that if the reality were perceived<br/> correctly they would in no way be taking on any kind of risk.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well sure, look at<br/> all the money that went into Facebook and how much of that got<br/> reallocated and blown away.  The problem is that it’s a very simple<br/> problem at heart.  The problem is that once you start pretending that<br/> something has value that it does not and then you start having people<br/> make decisions based on that, it’s basically like having a small<br/> problem in your engine.  If you don’t stop the car and fix the problem<br/> in the engine eventually you’re going to crack the block and do<br/> something really bad to the engine.  So what we’ve had is pretense<br/> piled upon pretense piled upon fraud piled upon fraud and so now the<br/> entire financial system is one massive collection of contradictions<br/> and illusions, and then you pile on that all the bad decisions that<br/> people are making on the basis of those illusions and you have<br/> something like we all pretend that Facebook is worth whatever billion<br/> and then…how can we even pretend the market is giving us any<br/> information about pricing when Facebook is worth 200 billion<br/> one day and a month later 30 billion.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  That was the big<br/> hype.  Those people should go to jail.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I’m not sure about<br/> that because with Facebook everybody was pretending.  I don’t think<br/> anyone needed to particularly lie about it.  I don’t follow this<br/> stuff closely and I knew there was no way Facebook was<br/> worth what people were bidding it at but the problem is because the<br/> retail, the mom and pop retail investor, with the exception of their<br/> 401(k) have completely exited the stock market.  If you look at the<br/> volume of S&amp;P 500 or NYSE the volume of stocks traded is about one-third of what it was five years ago.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Actually if you<br/> count for the high volume trading…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  …which is like<br/> 75 percent of it.  So, it’s already one-third, so if you take away three-quarters of that, there is no market anymore.  Talking about the market is at 14,000 or<br/> whatever is totally irrelevant and no longer has any meaning and<br/> that’s what I meant about how everything has become an illusion.  And eventually the veil is going to slip and that’s when its probably not<br/> going to be very pleasant for everybody.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Let me ask you,<br/> first of all let’s assign a timeframe.  When do you think that veil<br/> does slip?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I have uniformly<br/> been tremendously unsuccessful at anticipating time frames; I’m<br/> always early.  One of the reasons why…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You were there in<br/> 1991.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:   I was honestly, I have expected all this sort of stuff<br/> since about 1997, ’98, so the fact that the whole process has gone on<br/> this long astounds me.  And even in 2008, when I knew that the Fed was<br/> trying to paper over the gap in private credit by substituting public<br/> credit, I looked at the charts and thought they can’t possibly do<br/> this for more than two years, well its four years now and they’re still doing<br/> it.  They actually doubled the amount of federal debt in four years.<br/> Who would have imagined that would even be possible?  But, anyhow, I<br/> think that I do not see that it is possible for it to continue<br/> another four years.  I would anticipate that at some time in the next<br/> presidential term that its all going to have to come to a head,<br/> probably because of China.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  And why because of<br/> China?  What is it China is going to do that is going to bring about<br/> this collapse?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Because I think<br/> that China is going to be completely unable to continue this whole<br/> process of propping up the US Treasury. When we<br/> talk about frauds and illusions, most of the economic growth in China<br/> is an illusion.  If you look at the steel statistics China…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  There’re no real<br/> statistics in China.  You can look at electricity usage but thats<br/> about the only statistic you can rely on for anything.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You can also look<br/> at the steel stuff because those are sales. I have a friend who works for one of the big Russian ones and<br/> they look at where…they know who they’re selling steel to and how<br/> much they’re selling.  And for years they have been selling more and more and more to<br/> China, but what’s come out is that China hasn’t been using that stuff<br/> because they are building up this big powerful infrastructure,<br/> they’ve basically been building these ghost cities that no one lives<br/> in.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  I was in China a<br/> couple years ago and basically what they call whooping cranes, you go<br/> to any city and any town, there were these cranes clustered together<br/> and empty high-rises.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So now they’re<br/> ghost towns.  But China is a command-controlled economy.  The<br/> government says, when you got the crash in ’08, “banks lend<br/> money” and that’s what banks did.  To whomever and whatever.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  And this was then two years ago and they only started having inflation stated to creep<br/> in, for instance their rent expenses going up 20 percent a year.  And food<br/> costs were going up 15 percent a year.  So this is, that’s like the big<br/> problem.  The cities can survive because they were growing at the<br/> time, but half the people live on $3 a day.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, when that<br/> whole process over there starts to break down, which there are<br/> already numerous signs of it according to various things that I’ve<br/> read.  Then the jig is essentially up because right now the idea that<br/> China is going to somehow grow us out of this is pretty much the last<br/> fig leaf for me.  Nobody’s counting on Europe to rescue America.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  They’re broke.<br/> They’re worse than we are.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.  And all<br/> the Americans…well that’s not quite true.  America’s financial<br/> situation is actually worse than Greece’s, its just that America can<br/> always count on Japan and China to keep buying their debt.  But<br/> that’s what I was saying, once China or Japan no longer feels they’re<br/> able to do that, then that’s when America suddenly starts looking at<br/> the same situation that Greece is.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, there’s no<br/> one there to repatriate.  So now the next step, all right, this thing<br/> breaks down.  So what does that mean “break down?”  What<br/> kinds of, do we go into a depression or a deflation or an inflation?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:<br/> (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  The way I look at<br/> it, the things you hold dear, like a college education, healthcare,<br/> transportation, buying a car, those things will cost more then ever.<br/> And the things you don’t need…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, and they’ll<br/> cost more than ever whether you call it<br/> deflation…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, that’s one<br/> byproduct, but the overall is it going to be like the 30’s where a<br/> dollar is dear, or will it be like Argentina?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I suspect its<br/> going to be more the former, this is something that we have…I call<br/> it the 53 trillion dollar question…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  …because that’s<br/> how much total credit market debt outstanding there is.  And so a lot<br/> of people think we’re going to inflate our way out of it by<br/> increasing the money supply but the problem is the money supply is nine<br/> trillion.  So in order to get rid of the debt by inflation you have<br/> to basically run inflation at about, what is that, about five times.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  To bring up to the<br/> quantity of paper in order to elapse the amount of debt.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, I don’t see<br/> that happening especially when we already know, if you look at<br/> the…when the FDIC closes a bank down we actually get to see how<br/> many of the assets they reported were actually worthless.  And I<br/> calculate that about 40 to 45 percent of all the assets being held by the<br/> banks, at a certain value, about 40 to 45 percent of them are worthless.  So<br/> what’s going to happen is that when all that stuff…basically all<br/> that debts going to get disavowed, its going to get written off.  So<br/> that’s going to cause a lot of problems when, because of other debts<br/> and stuff that are predicated on somebody paying that.  Kinda like<br/> the whole sub-prime issue.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Mm hmm</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  And so, at that<br/> point that’s when you start seeing some major problems.  I think<br/> what’s going to have to happen is the banking, the entire banking<br/> system will probably get nationalized.  That’s usually what happens.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, well sure<br/> when the banks are broke and they’ll just seize up.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right, I think<br/> that everyone’s going to lose their 401(k)s, that all of the money in<br/> the stock market and stuff, and that sort of stuff, that will all get<br/> seized and then there’s going to…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  The government<br/> will directly take people’s 401(k) money?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, I think<br/> that’s fairly obvious.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  It’ll be like<br/> Hungary or wherever?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, it’s an<br/> easy way to do it and it’s going to be easy to come up with some kind<br/> of promises to make up for it.  Its much easier to grab people’s<br/> stock market assets for whatever they might be worth rather than to<br/> take their bank account because people actually need their bank, they<br/> need their money and their bank accounts to survive.  And so, when I<br/> think about these things I usually try to think about them from the<br/> perspective of, okay what if I am…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  I’m the government<br/> and I’m broke, what am I going to do?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right, what am I<br/> going to do in order to….I mean they’ve got two problems. Number one, they<br/> need to try to protect as much of the status quo as possible, because<br/> they like the status quo, they’re in charge, they’re living large,<br/> they want to preserve it.  But they also know that they can’t piss<br/> the entire population off.  That’s when revolutions happen.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Its better for<br/> them to piss off the people of wealth because they’re much smaller<br/> numbers.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right, the thing<br/> that is very hard for people to understand is that there’s a huge<br/> difference between the super-wealthy elite and just kinda your<br/> average wealthy…I drive 2 nice cars, I’m retired and I have a<br/> membership at the nice country club.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  There’s a lot more<br/> of the wealthy than the super-wealthy and the two groups have very<br/> little in common.  And so, I mean I realize there are a lot of people<br/> who are very nervous and paranoid, and maybe even rightly so.<br/> Certainly the fact that Homeland Security and practically every<br/> government agency seems to be buying hundreds of thousands of, if not<br/> millions of, ammo rounds is not encouraging.    And it’s<br/> not encouraging that Obama has been claiming the right to assassinate<br/> any American citizen that he personally designates an enemy.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.  I wanna go<br/> back to this issue about the government seizing assets.  So how, if<br/> you’re a private citizen, how do you protect your retirement assets?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You gotta sell<br/> out. I know there’s a penalty…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So you’re<br/> saying…now even if you roll to a Roth IRA you’re still in trouble,<br/> you’re saying they’ll grab the Roth IRA as well?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You’ve got to get<br/> completely out of the markets.  Ann Barnhardt had a very good piece<br/> on this.  There’s a very important case the other day.  It was<br/> dealing with the company called Sentinel, a financial institution<br/> called Sentinel…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Mm hmm</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  …and they did<br/> the same thing that John Corzine and MF Global<br/> did.  Which is they made some mistakes, they made some bad bets, they<br/> ran out of money, they got called on their margin.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  So then what they<br/> did is they took out a loan using their client’s assets as…what do<br/> you call it?  Not leverage…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Collateral.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Collateral.<br/> Spaced out on that, sorry.  So anyhow, they used their customer’s<br/> assets as collateral  and then they made more bad bets<br/> and lost that.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.  Well sure,<br/> if you’re a loser once you’ll be a loser twice.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.  And so,<br/> at this point they’re gambling desperately.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, they’re<br/> doubling down.  The guy lost everything at the casino and he wants to<br/> make it up on the next big hit.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Exactly.  So<br/> anyhow, they lose of course and now they’re bankrupt.  But, all<br/> the depositors’ assets are gone.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Same thing with MF<br/> Global a couple years later.  I think, so anyhow they’ve still got<br/> some assets left overall.  In bankruptcy…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  …bankruptcy<br/> court, when big companies go bankrupt they’ve all got some assets<br/> somewhere.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Sure.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, the judge<br/> comes and says the people with the first…the customers are saying hey, our money…this is our money, it’s supposed to be separate,<br/> we’ve got all kinds of contracts saying its our money, we should have first claim on whatever assets are left.  But the judge<br/> decided that the folks who loaned the money against those people’s<br/> assets actually came first.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  They came first,<br/> right.  Not the people who’s money was stolen, but rather someone who<br/> had to lend against stolen money.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Exactly.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Which I thought<br/> you couldn’t do that.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, you might<br/> have thought that but you’d be wrong.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So that rule has<br/> changed?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So let me ask you,<br/> where do you put your money then?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Not in<br/> the market.  You probably want to put it with some small local<br/> institution or put it into some kind of physical assets, whether it<br/> be land or gold or, you know, just….those are still things that can<br/> be taken away from you but at least there’s a chance you might<br/> notice.   You know if you’ve<br/> got your money in a Roth IRA with Citi<br/> Bank, or worse, Bank of America, it could be gone for years before<br/> they bother to tell you.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: You<br/> think you have money there and it’s really not there?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Precisely.  That’s<br/> exactly what  happened to the people at Sentinel, that’s exactly what<br/> happened to people who were at MF Global.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  But actually, if<br/> you just transfer your assets every year, from one institution to the<br/> next, wouldn’t that, you know, isn’t that a way of beating the system<br/> as well?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, only if<br/> things go down one at a time though.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Oh I see, they all<br/> go down at once…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  But what I was<br/> saying is that I think is…you asked me what’s going to happen when<br/> the whole system locks up.  And what I think is going to happen when<br/> the whole system locks up…and again this is what I would do if I<br/> was dictator for a day…they will take everything and then they will<br/> promise to pay it out as part of Social Security.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So, right, if you<br/> want the security you have to buy treasury bonds.  Something like<br/> they did in Hungary or whatever.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, there’s<br/> always a way of doing it that sounds a lot less….that sounds less<br/> unpleasant than, “Oh, guess what, all your stuff is gone and if<br/> you’re lucky maybe we’ll throw you a handout here and there.”</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You know, now and then.  And the problem is that’s the good<br/> outcome.    That’s assuming we’ve got folks in charge<br/> who actually mean well and who would really like to pick up the<br/> pieces in a relatively positive way.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Obviously history<br/> tells us that generally when you have a complete<br/> breakdown and that sort of thing, you either get chaos, division and<br/> separation, like we saw in Yugoslavia, like we saw in the Soviet<br/> Union, or you get the man on the white horse riding in and everyone<br/> says Hail Mussolini and then six years later you’re fighting some<br/> stupid war trying to create an empire in Abyssinia.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:<br/> Well, we’re always fighting a stupid war so that’s, you know…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:<br/> Yeah, at least for Americans its really nothing new in that sense.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Its just another<br/> day at the office.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  My concern is that<br/> because of…40 years ago or so even 30 years ago, America was kind<br/> of two different countries.  You had the South and you had everywhere else.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:<br/> Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  No doubt that<br/> there are still…I’m sure there’s still plenty of people across the<br/> South who are just patiently waiting for Round Two.  But, now there’s<br/> more like five or six distinct nations, not necessarily blood-nations, but<br/> very distinct groups that, in times of severe economic stress, are not<br/> likely to stick together but are likely to stick together against<br/> everyone else.  You’ve got the Hispanic population, you’ve got the<br/> black population, you’ve got the Muslim population, you’ve got the<br/> South, you’ve got the sort of mid-west/middle class sort<br/> of thing and then you’ve got the coasts.  Its not too hard to imagine<br/> all of those different groups separating and basically wanting to go<br/> their own way and attempt to fix the challenges…attempt to fix the<br/> problems and meet the challenges by themselves in their own way<br/> rather than as one giant 310 million strong country.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So in essence you<br/> see the nation breaking apart?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, all empires<br/> break apart.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  And the more<br/> diversity that you have the faster you’re going to break apart and<br/> the more severe the stresses are.  And so the whole melting pot<br/> concept has always been complete garbage.  It was a romantic idea of<br/> a British Jew who came to Britain from Russia.  It had<br/> nothing to do with anything relating to the American experience<br/> whatsoever.  And we’ve seen time and time again we’ve seen…look<br/> what we’re seeing in Europe right now, the whole European Union thing<br/> was supposed to be an idea to create a European people, but I can<br/> tell you that is simply not happening in any way.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  That was just a<br/> wet dream of political…the politicians and the academics.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: Of course,<br/> but what I’m saying is that we’re actually seeing much<br/> stronger…we’re seeing the rise of national interest in places it hasn’t been for centuries.  I mean, Scotland is on the verge of<br/> demanding independence.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  I got to tell you<br/> this incident, I didn’t realize that you say this about Scotland.<br/> I’m at the casinos down at Atlantic City last weekend.  These two<br/> Scots were extremely drunk were sitting in the…they were in the<br/> elevator.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Wait, wait,<br/> wait…I find that very hard to believe, some Scots were drinking<br/> alcohol?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Yeah, now there’s<br/> drinking and then there’s like under the table drinking…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  …where they’re<br/> literally, they’re holding up the floor lest it fall down kind of<br/> drinking.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So, but let me<br/> make my point is so this woman says, she couldn’t tell an accent from<br/> a hole in the wall, so anyway she says, “Are you German?”<br/> The guy wanted to just about kill her.  He got up off the<br/> floor and he started, he was like ready…he had to be held back just<br/> about because this woman thought he was German.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:    It<br/> could have been worse, he could have called him English.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  That’s true, too,<br/> but I guess people have a problem with the Germans because they’re<br/> blaming Germany for the whole debacle, so Germany does have a part to<br/> play in this.  Or German corporations.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: I really enjoyed the last time that England<br/> played Germany they had this chant going that was, “Two world<br/> wars and one world cup, doo dah doo dah!”</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:<br/> Well hey, at least they got a world cup.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:<br/> Anyhow, I think that we’re going to start seeing some of the same<br/> stressors that affected the Soviet Union, that affected Yugoslavia,<br/> that are now affecting Europe, that are also affecting Great Brittan.<br/> I think that we’re going to start seeing them become…I mean right<br/> now its still very early and I think that most people would think<br/> that I was kind of crazy to point it out but you know, when I was<br/> warning about the stresses to the global financial system in 2002<br/> and people all thought that was crazy until six years later when<br/> suddenly Henry Paulson is on his knees begging Nancy Pelosi to give<br/> him lots of money so there won’t be tanks in the streets.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: So, there is no place to hide from this…this coming tsunami, is<br/> there?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  No, I mean that’s<br/> why I like Italy because its kind of pre-collapsed.  I like living in a<br/> culture where people already know how to live in elements of complete<br/> corruption and chaos.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You know, its<br/> nothing new to them, they don’t care.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  People still<br/> haven’t figured out how in this country…the reason why I wanted to<br/> bring you on to talk about Romney…and people haven’t figured out<br/> that the politicians that there still is some semblance that when<br/> they speak to you, you really should listen to what they have to say.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: The thing<br/> that’s a little bit frightening about Romney is that…previously I<br/> really didn’t really think much of him, I mean I’m not a really big<br/> fan of Mormons, I’m not a big fan of flip-floppy liberal Republicans,<br/> but that’s all stuff that is within the framework of things you can<br/> deal with, you know?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  But I mean, “ooh<br/> a politician lied and changed his position”!  This is hardly news.   But what is very troubling to me is the way<br/> he and his team behaved at the Republican National Convention<br/> because…and this is why, it’s not because I support Ron Paul<br/> (although I do), it’s because everything that he did was totally<br/> unnecessary.  He did not have to bend and break the rules and change<br/> them.  He did not have to do things like…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  He didn’t have to<br/> stifle dissent.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Precisely.  There<br/> was absolutely no need for him to stifle any of that, he simply did<br/> it because he couldn’t stand it.  And I think in a time when the<br/> country is facing some of the most severe stresses that it has<br/> probably seen since the Civil War the last thing that you need is a<br/> President who cannot tolerate dissent.  Because, if you’ve got…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  He’ll start<br/> locking up half the population…or siccing the IRS on them, they’ll load<br/> up and be like, “Volunteer to join the IRS and round up your<br/> neighbors.”</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, I just I<br/> have the feeling that if the situation gets much worse and Romney is<br/> the President, that he is going to react in precisely the wrong way,<br/> and he’s going to take a bad situation and exacerbate it.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Well, this is a<br/> guy who comes from Wall Street.  Wall Street owns the government.<br/> They’re the ones who created this mess by foisting their desires on<br/> the government and he’s, you know…but Wall Street’s finger prints<br/> are everywhere.  We have what was her name this<br/> what was the other woman, Kagen, who served on the board of directors<br/> of Goldman Sachs.  Their finger prints are everywhere.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  But that’s why I<br/> think that we know that Romney’s going to win the election because<br/> although Obama, I and others have referred to him as President<br/> Goldman Sachs….</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: But that’s just<br/> because he kept trying to appoint people from Goldman Sachs to the<br/> Cabinet but…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Well he’s trying<br/> to reward, return the favor.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right, but that’s<br/> the difference, he’s trying to return the banker’s favor but he’s not<br/> a banker himself.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  No.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  And so I think<br/> that the fact that the Republicans are putting up a true member of<br/> the club versus somebody who is merely friendly to the club, probably<br/> tells us who is likely to win in November, that’s why I was willing<br/> to go out on a limb and predict that Romney will win, back in the<br/> middle of August when the New York Times and Nate Silver and all the<br/> professional pollers were saying that Obama is like 75 percent likely to<br/> win, or whatever.  We’ll see.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  As they say you<br/> always got to follow the money trail and clearly the money trail is<br/> finding its way to Romney.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Is this turn of<br/> events and leaders, as Doug Casey once remarked, going from Caligula<br/> to Nero?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I don’t…no, I<br/> mean Romney is not a Nero figure, in any way.  And really,<br/> Obama’s not a Caligula, Obama just wants to hang out and do<br/> nothing.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  He wants to play<br/> golf.  I think…if you had wrote this or I read this elsewhere but<br/> comparing the two its: Obama he enjoys the trappings of power…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Whereas Romney<br/> enjoys the power.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, that was<br/> something that I wrote.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  There you go…see<br/> I pay attention to you.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  I thought that was<br/> just a great line…and that was how really disturbing because that’s<br/> who these people are.  I mean…Obama has plenty of bad ideas but…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  And that was<br/> before the Republican National Convention so…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Yes.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Now that we’ve got<br/> somebody who like is really organized and is willing to work hard and<br/> doesn’t tolerate dissent.  That’s just…I’d frankly prefer the pot-smoking golfer.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:    Or<br/> cocaine or the bisexual golfer.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  As long as he’s<br/> not working, you know.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  That is true.  But<br/> then he appoints…either one is obviously a bad choice because then<br/> he just appoints all these bureaucrats to make decisions in<br/> government.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I’m not voting for<br/> Obama or Romney…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  That is true.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: The point is that if its not Caligula to Nero it may well be out<br/> of the frying pan and into the fire.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Yeah. What’s bad is that you’re having, you’re being someone who’s “a<br/> free market person” which is like, “war is peace.”<br/> And the “free market” will be blamed for what comes next.<br/> It is a result of capitalism that will generate all the coming<br/> misery.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: I don’t know that it makes…I’m not terribly concerned about where<br/> the blame is going to be apportioned.  There’s going to be no<br/> shortage of it.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The important<br/> thing for people is just to be building up contacts in their<br/> communities and making sure that they have some resources so that if<br/> they can’t access their bank account for a week or month that they<br/> have the resources to get by on their own.  And that’s the important<br/> thing and people are doing that.  There’s a reason why gun sales are<br/> up and ammo sales are up. People understand that something is<br/> coming and they are attempting to do their best to prepare in<br/> whatever small way they can for it.  The problem is you<br/> can’t…you can never adequately prepare for the unknown, but what<br/> you can do is at least be sure that you’re in your local community,<br/> and with your friends and family.  People understand, hey look, when<br/> things go bad, if there’s tough times, we have to stick together and<br/> we have to help each other.  Human civilization has survived<br/> everything that the idiocy and evil of Man has ever thrown at it and<br/> it will survive this too.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  How many years of<br/> darkness do you think we’ll be entering into?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I couldn’t<br/> possibly say.  The only thing that I’m certain about is that we’ve<br/> pretty much reached the end of the American system.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  The personal, the<br/> pursuit of happiness kind of system?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah I think that<br/> that is coming to…rapidly coming to an end.  What comes next?  I<br/> don’t know.  Who in the last days of Rome predicted France and the<br/> Holy Roman Empire and England or even what happened in<br/> Constantinople?  These are things that we cannot reasonable expect to<br/> foresee, but we can expect is that every day the sun is going to<br/> rise, it’s going to rain sooner or later, and we still have to answer<br/> to God for our actions.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  And the wheel is<br/> round…where there’s an action there’s a reaction.  What’s occurred<br/> there’s payment…a payment day is coming.  But I just want to get<br/> back to this point.  This is the most disturbing that you’ve said<br/> today which is…I have a feeling of comfort but, I understand about<br/> reaching into accounts but, you’re saying anybody holding any bank,<br/> any money in any security institution, doesn’t have to be necessarily<br/> in stocks it could be sitting in cash, that that’s all fair game for<br/> the government?  Or that these institutions will just disappear?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  I don’t think that<br/> they will mess with cash in the bank, not initially.  Even in places<br/> like Argentina and Greece, at most what they’ve done is<br/> told you that you can’t take more than a certain amount out at any<br/> time.  Frankly, that’s pretty much the way that it is in the US<br/> already.  You can take it out but they still have to file reports and<br/> whatnot.  The mechanism is already set up for that kind of stuff and<br/> it has been for 20 or 30 years, ever since the War on Drugs.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So, now let me ask<br/> you, is this the Great Conspiracy, or is it just the product of<br/> incompetence?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Hmmm. To be<br/> honest I think both.  I don’t think that there are that many people who really want to crash it.  If you’re part of the elite and you’ve<br/> been living large off it for 50 years, why do you want to bring it to<br/> an end?  People that are really focused on the, “Oh Bill<br/> Clinton…”  I mean, the whole thing about Obama wanting to<br/> become a dictator, we’ve heard that about Bill Clinton and I’m sure<br/> people were hearing it about Richard Nixon.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The reality is<br/> that most people really want to protect the status quo.  Now there are people who want to create a big one world government and stuff,<br/> but crashing the USA is not actually a very effective way of doing<br/> that when the USA was the main mechanism for creating it in the first<br/> place.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right.  You’re<br/> killing the goose.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: There is<br/> something to the whole divide and conquer thing, but you don’t need<br/> to divide and conquer when you just go ahead and you buy the<br/> Senate and get them to pass a treaty.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, you do<br/> whatever you want to do, but ultimately you’re ah…but let me ask<br/> you, on the one hand you’re doing what<br/> you want to do as far as big business, but about the explosion of<br/> social services and social benefits, is that just something to add to<br/> placate the masses?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  They have to do that because if they don’t then we’d already be<br/> living in Yugoslavia.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right, there’d be<br/> uprisings and all that.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Yeah, things would<br/> probably be fine in some places, but in other places it would be<br/> completely unlivable.  That’s what they’re seeing in Greece…that’s<br/> what got Greece in trouble in the first place, they were paying<br/> everybody to do nothing.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  The social<br/> services is… that’s the bread in the bread and<br/> circuses.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  The bread and the<br/> beer.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Precisely.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG: By the way<br/> Vox, I blew off all my other guests because I’m having so much<br/> fun talking to you, by the way.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  You’re too kind.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  We have about five<br/> minutes left to wrap up so I just want to leave something positive<br/> with our listeners and I think I want to reiterate how you button<br/> down for the coming storm.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Well, I think that<br/> you have to look at the main things that you need.  The main things<br/> that you need are: food, water, and you want to be<br/> around good, trustworthy God-fearing people, you want to have some<br/> means of protecting yourself and your family and your surroundings.<br/> So, its just basically going back to basics and not living in this<br/> modern way of assuming that I don’t need to have anything, I’ll just<br/> go down to the shops and pick it up today.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  So you think<br/> people should start building something to secure foodstuffs?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: I think this<br/> is one area where Mitt Romney might be a good role model.  If I<br/> understand correctly Mormons are expected to keep a year’s<br/> supply of food and water and so forth.  That’s not a bad idea.  If<br/> nothing else you can get by on your dry beans and Evian.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:    I<br/> take it that requires a lot of storage to put something for a year?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: It’s not as<br/> bad as…doesn’t take up as much space as you might think but, and<br/> its not as expensive as you might think.  This is the sort of thing<br/> where maybe instead of going to Disneyland, you set yourself up so if<br/> there are issues you’re not quite as worried about it right away.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You make the<br/> investment and you put away the money and you figure out the<br/> security and all that.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD: The stock market’s at relative highs on super low volume.  You<br/> might as well take your money out and get something for it rather<br/> than just watch it go down, when the market starts crashing.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You mentioned<br/> about buying land but land looks like, like everything, real estate<br/> is very much overinflated…</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Sure.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Do you think land<br/> will also decline?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  It might but its<br/> not going to disappear into nothing like Facebook.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  (laughs)</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  At the end of the<br/> day you can still build a house on it.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  But that land<br/> could sit there for a long time to come before you could do something<br/> with it…you could have cash tied up in the value.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  But what you have<br/> to understand is that in times of economic depression its all about<br/> asset protection.  Its not about making money.  You know what I mean?<br/> Economic booms are when you want to leverage and grow and all that<br/> sort of thing.  What works while….what your objective is and what<br/> your focus is in times of economic growth should not be your<br/> objectives in times of… yes, there are people who are trying<br/> to profit on it there are people who are trying to short Facebook or<br/> short Apple or whatever but the problem is that even if you make the<br/> right call it doesn’t matter if your broker goes out of business.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  You have to worry<br/> about the brokerage, the brokerage firm?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Right, exactly.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Then you got real<br/> issues there.  Hey, by the way does your book address those issues?<br/> <i>The Return of the Great Depression</i></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Oh, some of them,<br/> its a little bit more…my focus tends to be a little bit more<br/> theoretical and abstract than particularly practical.  But I’ve been<br/> told that a lot of people who are into the practical side of it<br/> nevertheless like it because they like things being put into context<br/> so that it makes sense to them, rather than just sort of this, “Well<br/> here’s this dark cloud and we don’t know why and we don’t know what.”</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Right. Like any doctor, you want them to analyze why you have the<br/> condition that you have and then that way you can make adjustments.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> VD:  Precisely.</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> BG:  Hey with that Vox,<br/> we’ve run out of time.  Vox Day, just a pleasure.  Really appreciate<br/> your time.  Libertarian political columnist.  Get his book, <i>The<br/> Return of the Great Depression</i>.<p> <b>NB: Thanks very much to MC and BD for the transcript.</b></p></div></div>",
  "content_text": "BG: You are\nlistening to Greenburg News with your host Brian Greenburg at WNJC\n1360AM, now newly syndicated on WIFI 1460AM.  We have an excellent\nshow.  I’m\ngoing to talk to the six people who actually watched the political\nconvention.  But we can talk about it.  …  There’s an election in\nNovember and for those of you who are going to participate, we have\nsome insight.  We have with us Vox\nDay, a libertarian political columnist and the author of\nThe Return\nof the Great Depression\n.  Known as the Internet Superintelligence,\nhe was one of the few economics writers to correctly predict the\nfinancial crisis of 2008.  Residing in Italy…anyway Vox, welcome to\nGreenburg News.\nVD:  Thank you, sir.\nBG:  So, where are you\nin Italy by the way?\nVD:  I’m up in the\nNorth.\nBG: The more civilized\npart of the country, is that it?\nVD:  Well it all\ndepends on how you want to look at civilization.  I quite like it in\nthe South as well.  But yeah there’s a little bit more structure and\nbusiness and that sort of thing, in the North.\nBG:  So, they’re next\nin line too to go broke, after Spain goes down?\nVD: I think it’s\npossible but there have been a lot of people that want to go back to the\nLira, have wanted to go back to the Lira pretty much since the Euro\ngot stuck on them.\nBG:  What happened,\npeople wake up in the middle of the night and all of a sudden people\nhave a different currency?\nVD:  Pretty much.\nThere was a process and we were here when it happened and it was\nbasically like having about 20 percent inflation overnight.  All the\nbusinesses rounded up and so the official exchange rate really\ngot bumped up.  What you actually paid was more than the official\nexchange rate that was supposed to happen.  As a result, tourism was\nreally down and it became much more difficult for Italian companies\nto compete because they were no longer a low-cost producer.\nBG:  You know there’s\nsomething bizarre about this.  And of course people know about the\nEuro, but its much worse than that, it’s the impact of Brussels’\ngovernment, and what I mean by that is I was recently in Portugal,\nvisiting Lisbon, and I heard that before I got there…this\nstory…and I thought nah, they didn’t commit economic suicide but in\nfact that’s what happened to their fishing industry.  They had\n150,000 ships and now they have none.\nVD:  Yeah, the EU has\nbeen unmitigated disaster for most countries in Europe.  The problem\nis it has been very good for the political class…\nBG:  For Germany.\nVD:  Not so much the\neveryday, average German.  The Germans have done fine because the\nGermans work hard, and they’re smart, and they tend to do fairly well\nno matter what happens.  But, the real problem is that all the\npolitical class and the media and the academics have been bought\noff by the flow of taxpayer money from the different countries\nto…it all goes through the European Commission who then doles out\nthe money to all the people who will continue to push for it.  But\nthat whole process is really broken down because it doesn’t matter\nhow many people you pay off, once things get bad enough they’re not\ngoing to be convinced by the various politicians and academics and\njournalists who are on the payroll of the European Union somehow.\nBG:  But let me ask\nyou, if you’re Portuguese…country goes back to the 1,100’s and\nyou’ve had a history over 900 years, going on 1,000 years, of\nfishing…the lifeblood of the nation and some idiot in Brussels says\ndisband because you have an unfair advantage and they do…\nVD:  The problem is the\nfisherman doesn’t really have a choice, its not like the fisherman\nwants to do anything but Brussels is paying for a large fishing\npolice and they are physically preventing people from doing anything.\nYou see the same thing in England, for example, where people who\nhave been selling fruit and oranges and that sort of thing in pounds\nrather than kilos for hundreds of years, they’re suddenly being shut\ndown and then they’re not allowed to sell, by the British police,\nunless they sell in kilos the way that they are dictated to sell\nthem.\nBG:  So the way that I\nlook at this situation, depression is imminent in Europe.\nVD:  Oh, its already\nhere, the depression is already here in the States.\nBG:  No things are\nhappy here, didn’t you hear?  Its all good.\nVD:  (laughs)\nBG:  When you’re out of\nthe country sometimes things can get skewed.\nVD:  Yeah, the thing\nthat people don’t understand, and the thing that people don’t realize,\nis that no one ever defined economic depressions by utilizing\nofficial GDP statistics released by the Bureau of Economic Analysis\nuntil after, well after, the Great Depression.  And so to say that we\ndon’t have a depression because GDP is positive is a fundamental\nmisunderstanding of what a depression is.  And so the fact that the\ngovernment statisticians can find a way of claiming that we still\nhave economic growth when there’s something like 15,000,000 American\nfamilies on food stamps, and the fact that we don’t have people lining\nup to go to soup kitchens and stuff.  Instead of that we have people\nspending money on their government funded debit cards but the\nprinciple is the same.\nBG:  You know a\nstatistic that doesn’t get picked up is the amount of people who have\nbecome “long-term disabled” since the Great Recession\nbegan.\nVD:  Right.\nBG:  Nearly 4,000,000\npeople, I think its almost twice the amount of people who were\nlong-term disabled in this country, you know nearly doubled in the\nlast 3 years.  Its unbelievable.  And basically they are hiding the\npeople on their, they’re just warehousing them.\nVD:  Well, that’s\nwhy I think it doesn’t make much sense to look at the various\nunemployment statistics because all of them are gamed in various\nways.  In the book that you referenced,\nThe Return of the Great\nDepression\n, I have a chapter that is called “No One Knows\nAnything” and one of the things that it indicates and goes\nthrough in some detail is showing how the various statistics are\ngamed, and how they are, by their own metrics, completely inaccurate.\nAnd so I think its much more interesting and useful, even though\nstill misleading, but the employment population ratio is a much more\nmeaningful indicator because that just simply looks at how many\npeople are employed out of the total population.  And you can see\nthere, much more easily, the negative state of the economy than you\ncan when you’re just looking at the unemployment numbers because\ntheir definition of unemployed allows them to take people out of the\nwork force then claim that they are neither employed nor unemployed.\nBG:  Well here’s a\ndefinition, we can technically be at full employment if, in essence,\nwe were to stop the bleeding of new people getting unemployed and\njust allowed the benefits to run out on the existing workforce who\nwere collecting, or unemployed workforce.  And if all these people\nare collecting were to go past the 99 weeks or whatever they’re\ncollecting now, we could say we’re at full employment.\nVD:  Because the number\nis gamed because they don’t count unemployment… unemployment does\nnot mean you are not employed, it means you are not employed and you\nare not actively seeking for a job or collecting unemployment\nbenefits.  It’s just absolutely ludicrous.\nBG:  It is bull, but\nbesides even that how about the devastation of young people today,\nwhich I want to blame them in a minute, but just as far as the pure\nnumbers where, what is it one in two, are in effect not employed in\ntheir…either not employed or out of work in the last three years?\nVD:  Far be it from me\nto claim that young people are anything but stupid.  There’s nothing\nthat I find more annoying.  And speaking as someone who used to be\nyoung, I remember I was young and that’s why I know that young people\nare stupid, because I was too.\nBG:  I think the\nproblem is this: when I went to college my tuition was $1,000 a year,\nso if I screwed up I’m out of pocket $1,000.  If I would have taken\nbasket weaving and I spend $4,000 in my example and I graduated and\nfound there’s no jobs, I’m out four grand.  But today the mistakes are\nnot $4,000 they’re $100,000 and they’re studying majors where they\ndon’t…in other words you have to be a lot smarter or more savvy or\nmuch more savvier and that’s not saying blame the students, the 18\nyear olds, because the parents should be there guiding them to a\nmajor where there’s a prospect of employment.\nVD:  The problem is\nreally multi-fold because if you look, I mean yes, young people are\nstupid, but on the other hand they’ve also been lied to, you know?\nBG:  Right.\nVD:  Even if you’re\nstudying a good solid major…I read a really remarkable statistic\nthe other day about PhDs back in the 1950’s or something pretty much\nif you got a PhD you were immediately employed.  And nowadays the\nnumber of people who get a PhD and are able to find a position is\nwell below 20 percent and so these are people who are playing the game the\nright way but they’re playing the 1950’s game 60 years later.  And\nnobody realizes that.\nBG:  Well its, well\nthat’s again all the people have been taught is education is the key\nto success.  It doesn’t matter what youstudy, just study education.\nBy the way, have you ever looked into people who pursued becoming a\npriest, the seminaries?  And how many seminary graduates can’t find a\npulpit and walk around with thousands of dollars in debt as a result?\nThe numbers are staggering.  Its a statistic you should explore…\nBut let me ask you, you\nmentioned about depression.  How do you define a depression as\nopposed to a recession we’ve had in other periods of time?\nVD:  The correct\ndefinition of a depression is very simple, it means a\nreduction in the amount of economic activity.  And so there’s many\ndifferent ways you can look at that and simply looking at the\nemployment population ratio is one easy way to do it.  And another\neasy way to do it is to look at industrial output.  All the Fed’s\nbeige book numbers and stuff, those have been turning\nnegative for some time now, they’ve been up and down.  But the most,\nI mean, its kind of like the famous Supreme Court decision about\npornography, in the past a depression was when a people felt they\nwere in a depression.  And so if you look at the social\nmood, if you look at the crime statistics, if you look at the\ndiseases and people getting sick and that sort of thing, and if you\nlook at military conflict, those are all things that tend to coincide\nwith depressions. If you look around at the state of the world\nright now, you can see the world is in a depression.  In fact the\nworld is in a bigger global depression then it was in the 1920’s\nbecause what most people don’t realize is that except for Germany and\nthe USA there really was no Great Depression in France or in England, and Japan was actually in a major economic boom at the time because\nthey had taken of Manchuria.  If you look at their GNP statistics\nfrom the time they were experiencing growth of like 15 percent per year.  And\nso now what we’re seeing is Europe is in depression, Japan is in\ndepression, China appears to have now entered it, and USA is in it.\nWe’re experiencing it, we’re getting towards the end of the beginning.\nPeople are still pretending that we’re not.  They’re still talking\nabout the slow recovery and that sort of thing, but its all nonsense.\nBG:  So now that we’ve\ndefined that things are not good out there and there’s now talk\nof…they’re going back to the well.  They’re going to do QE3.\nVD:  Mm hmm.\nBG:  The well is not\nreally generated anything of substance, obviously, in the past, but\nthat’s central bankers know so they gotta do what they know.\nVD:  Well, its not just\nall that they know, its also what is necessary for the banks.  See\nwhat people don’t understand is quantitative easing is not about\nsaving the economy, quantitative easing is about giving the banks and\nthe large financial institutions a relatively soft landing as the\neconomy goes into depression.  So what they’re attempting to do is\nbasically continue to transfer assets from the taxpayer to the banks\nin order to keep them from completely failing and going under.\nIf you’re coming at it\nfrom the world of the banker it makes perfect sense.  They’re trying\nto defend the survival of the global financial system but the problem\nis the whole thing is going to come down sooner or later.  Does it\nmakes sense to prop it up for a while?  From some people’s\nperspective, yes.  But in terms of if you’re  looking at it from what\nis best for the economy as a whole, obviously it is best for the\nbankrupt institutions to go bankrupt so that what remains of their\ngood assets can be used to rebuild.\nBG:  Right, and what\npeople fail to realize is by bailing out these banks and keeping the\nstatus quo you have people making capital investment decisions based\non the perception that things are not that bad and then taking on\ndebt and otherwise investments that if the reality were perceived\ncorrectly they would in no way be taking on any kind of risk.\nVD:  Well sure, look at\nall the money that went into Facebook and how much of that got\nreallocated and blown away.  The problem is that it’s a very simple\nproblem at heart.  The problem is that once you start pretending that\nsomething has value that it does not and then you start having people\nmake decisions based on that, it’s basically like having a small\nproblem in your engine.  If you don’t stop the car and fix the problem\nin the engine eventually you’re going to crack the block and do\nsomething really bad to the engine.  So what we’ve had is pretense\npiled upon pretense piled upon fraud piled upon fraud and so now the\nentire financial system is one massive collection of contradictions\nand illusions, and then you pile on that all the bad decisions that\npeople are making on the basis of those illusions and you have\nsomething like we all pretend that Facebook is worth whatever billion\nand then…how can we even pretend the market is giving us any\ninformation about pricing when Facebook is worth 200 billion\none day and a month later 30 billion.\nBG:  That was the big\nhype.  Those people should go to jail.\nVD:  I’m not sure about\nthat because with Facebook everybody was pretending.  I don’t think\nanyone needed to particularly lie about it.  I don’t follow this\nstuff closely and I knew there was no way Facebook was\nworth what people were bidding it at but the problem is because the\nretail, the mom and pop retail investor, with the exception of their\n401(k) have completely exited the stock market.  If you look at the\nvolume of S&P 500 or NYSE the volume of stocks traded is about one-third of what it was five years ago.\nBG:  Actually if you\ncount for the high volume trading…\nVD:  …which is like\n75 percent of it.  So, it’s already one-third, so if you take away three-quarters of that, there is no market anymore.  Talking about the market is at 14,000 or\nwhatever is totally irrelevant and no longer has any meaning and\nthat’s what I meant about how everything has become an illusion.  And eventually the veil is going to slip and that’s when its probably not\ngoing to be very pleasant for everybody.\nBG:  Let me ask you,\nfirst of all let’s assign a timeframe.  When do you think that veil\ndoes slip?\nVD:  I have uniformly\nbeen tremendously unsuccessful at anticipating time frames; I’m\nalways early.  One of the reasons why…\nBG:  You were there in\n1991.\nVD:   I was honestly, I have expected all this sort of stuff\nsince about 1997, ’98, so the fact that the whole process has gone on\nthis long astounds me.  And even in 2008, when I knew that the Fed was\ntrying to paper over the gap in private credit by substituting public\ncredit, I looked at the charts and thought they can’t possibly do\nthis for more than two years, well its four years now and they’re still doing\nit.  They actually doubled the amount of federal debt in four years.\nWho would have imagined that would even be possible?  But, anyhow, I\nthink that I do not see that it is possible for it to continue\nanother four years.  I would anticipate that at some time in the next\npresidential term that its all going to have to come to a head,\nprobably because of China.\nBG:  And why because of\nChina?  What is it China is going to do that is going to bring about\nthis collapse?\nVD:  Because I think\nthat China is going to be completely unable to continue this whole\nprocess of propping up the US Treasury. When we\ntalk about frauds and illusions, most of the economic growth in China\nis an illusion.  If you look at the steel statistics China…\nBG:  There’re no real\nstatistics in China.  You can look at electricity usage but thats\nabout the only statistic you can rely on for anything.\nVD:  You can also look\nat the steel stuff because those are sales. I have a friend who works for one of the big Russian ones and\nthey look at where…they know who they’re selling steel to and how\nmuch they’re selling.  And for years they have been selling more and more and more to\nChina, but what’s come out is that China hasn’t been using that stuff\nbecause they are building up this big powerful infrastructure,\nthey’ve basically been building these ghost cities that no one lives\nin.\nBG:  I was in China a\ncouple years ago and basically what they call whooping cranes, you go\nto any city and any town, there were these cranes clustered together\nand empty high-rises.\nVD:  Right.\nBG:  So now they’re\nghost towns.  But China is a command-controlled economy.  The\ngovernment says, when you got the crash in ’08, “banks lend\nmoney” and that’s what banks did.  To whomever and whatever.\nVD:  Right.\nBG:  And this was then two years ago and they only started having inflation stated to creep\nin, for instance their rent expenses going up 20 percent a year.  And food\ncosts were going up 15 percent a year.  So this is, that’s like the big\nproblem.  The cities can survive because they were growing at the\ntime, but half the people live on $3 a day.\nVD:  Yeah, when that\nwhole process over there starts to break down, which there are\nalready numerous signs of it according to various things that I’ve\nread.  Then the jig is essentially up because right now the idea that\nChina is going to somehow grow us out of this is pretty much the last\nfig leaf for me.  Nobody’s counting on Europe to rescue America.\nBG:  They’re broke.\nThey’re worse than we are.\nVD:  Right.  And all\nthe Americans…well that’s not quite true.  America’s financial\nsituation is actually worse than Greece’s, its just that America can\nalways count on Japan and China to keep buying their debt.  But\nthat’s what I was saying, once China or Japan no longer feels they’re\nable to do that, then that’s when America suddenly starts looking at\nthe same situation that Greece is.\nBG:  Right, there’s no\none there to repatriate.  So now the next step, all right, this thing\nbreaks down.  So what does that mean “break down?”  What\nkinds of, do we go into a depression or a deflation or an inflation?\nVD:\n(laughs)\nBG:  The way I look at\nit, the things you hold dear, like a college education, healthcare,\ntransportation, buying a car, those things will cost more then ever.\nAnd the things you don’t need…\nVD:  Yeah, and they’ll\ncost more than ever whether you call it\ndeflation…\nBG:  Right, that’s one\nbyproduct, but the overall is it going to be like the 30’s where a\ndollar is dear, or will it be like Argentina?\nVD:  I suspect its\ngoing to be more the former, this is something that we have…I call\nit the 53 trillion dollar question…\nBG: (laughs)\nVD:  …because that’s\nhow much total credit market debt outstanding there is.  And so a lot\nof people think we’re going to inflate our way out of it by\nincreasing the money supply but the problem is the money supply is nine\ntrillion.  So in order to get rid of the debt by inflation you have\nto basically run inflation at about, what is that, about five times.\nBG:  To bring up to the\nquantity of paper in order to elapse the amount of debt.\nVD:  Yeah, I don’t see\nthat happening especially when we already know, if you look at\nthe…when the FDIC closes a bank down we actually get to see how\nmany of the assets they reported were actually worthless.  And I\ncalculate that about 40 to 45 percent of all the assets being held by the\nbanks, at a certain value, about 40 to 45 percent of them are worthless.  So\nwhat’s going to happen is that when all that stuff…basically all\nthat debts going to get disavowed, its going to get written off.  So\nthat’s going to cause a lot of problems when, because of other debts\nand stuff that are predicated on somebody paying that.  Kinda like\nthe whole sub-prime issue.\nBG:  Mm hmm\nVD:  And so, at that\npoint that’s when you start seeing some major problems.  I think\nwhat’s going to have to happen is the banking, the entire banking\nsystem will probably get nationalized.  That’s usually what happens.\nBG:  Right, well sure\nwhen the banks are broke and they’ll just seize up.\nVD:  Right, I think\nthat everyone’s going to lose their 401(k)s, that all of the money in\nthe stock market and stuff, and that sort of stuff, that will all get\nseized and then there’s going to…\nBG:  The government\nwill directly take people’s 401(k) money?\nVD:  Yeah, I think\nthat’s fairly obvious.\nBG:  It’ll be like\nHungary or wherever?\nVD:  Yeah, it’s an\neasy way to do it and it’s going to be easy to come up with some kind\nof promises to make up for it.  Its much easier to grab people’s\nstock market assets for whatever they might be worth rather than to\ntake their bank account because people actually need their bank, they\nneed their money and their bank accounts to survive.  And so, when I\nthink about these things I usually try to think about them from the\nperspective of, okay what if I am…\nBG:  I’m the government\nand I’m broke, what am I going to do?\nVD:  Right, what am I\ngoing to do in order to….I mean they’ve got two problems. Number one, they\nneed to try to protect as much of the status quo as possible, because\nthey like the status quo, they’re in charge, they’re living large,\nthey want to preserve it.  But they also know that they can’t piss\nthe entire population off.  That’s when revolutions happen.\nBG:  Its better for\nthem to piss off the people of wealth because they’re much smaller\nnumbers.\nVD:  Right, the thing\nthat is very hard for people to understand is that there’s a huge\ndifference between the super-wealthy elite and just kinda your\naverage wealthy…I drive 2 nice cars, I’m retired and I have a\nmembership at the nice country club.\nBG:  Right.\nVD:  There’s a lot more\nof the wealthy than the super-wealthy and the two groups have very\nlittle in common.  And so, I mean I realize there are a lot of people\nwho are very nervous and paranoid, and maybe even rightly so.\nCertainly the fact that Homeland Security and practically every\ngovernment agency seems to be buying hundreds of thousands of, if not\nmillions of, ammo rounds is not encouraging.    And it’s\nnot encouraging that Obama has been claiming the right to assassinate\nany American citizen that he personally designates an enemy.\nBG:  Right.  I wanna go\nback to this issue about the government seizing assets.  So how, if\nyou’re a private citizen, how do you protect your retirement assets?\nVD:  You gotta sell\nout. I know there’s a penalty…\nBG:  So you’re\nsaying…now even if you roll to a Roth IRA you’re still in trouble,\nyou’re saying they’ll grab the Roth IRA as well?\nVD:  You’ve got to get\ncompletely out of the markets.  Ann Barnhardt had a very good piece\non this.  There’s a very important case the other day.  It was\ndealing with the company called Sentinel, a financial institution\ncalled Sentinel…\nBG:  Mm hmm\nVD:  …and they did\nthe same thing that John Corzine and MF Global\ndid.  Which is they made some mistakes, they made some bad bets, they\nran out of money, they got called on their margin.\nBG:  Right.\nVD:  So then what they\ndid is they took out a loan using their client’s assets as…what do\nyou call it?  Not leverage…\nBG:  Collateral.\nVD:  Collateral.\nSpaced out on that, sorry.  So anyhow, they used their customer’s\nassets as collateral  and then they made more bad bets\nand lost that.\nBG:  Right.  Well sure,\nif you’re a loser once you’ll be a loser twice.\nVD:  Right.  And so,\nat this point they’re gambling desperately.\nBG:  Right, they’re\ndoubling down.  The guy lost everything at the casino and he wants to\nmake it up on the next big hit.\nVD:  Exactly.  So\nanyhow, they lose of course and now they’re bankrupt.  But, all\nthe depositors’ assets are gone.\nBG:  Right.\nVD:  Same thing with MF\nGlobal a couple years later.  I think, so anyhow they’ve still got\nsome assets left overall.  In bankruptcy…\nBG:  Right.\nVD:  …bankruptcy\ncourt, when big companies go bankrupt they’ve all got some assets\nsomewhere.\nBG:  Sure.\nVD:  Well, the judge\ncomes and says the people with the first…the customers are saying hey, our money…this is our money, it’s supposed to be separate,\nwe’ve got all kinds of contracts saying its our money, we should have first claim on whatever assets are left.  But the judge\ndecided that the folks who loaned the money against those people’s\nassets actually came first.\nBG:  They came first,\nright.  Not the people who’s money was stolen, but rather someone who\nhad to lend against stolen money.\nVD:  Exactly.\nBG:  Which I thought\nyou couldn’t do that.\nVD:  Well, you might\nhave thought that but you’d be wrong.\nBG:  So that rule has\nchanged?\nVD:  Right.\nBG:  So let me ask you,\nwhere do you put your money then?\nVD:  Not in\nthe market.  You probably want to put it with some small local\ninstitution or put it into some kind of physical assets, whether it\nbe land or gold or, you know, just….those are still things that can\nbe taken away from you but at least there’s a chance you might\nnotice.   You know if you’ve\ngot your money in a Roth IRA with Citi\nBank, or worse, Bank of America, it could be gone for years before\nthey bother to tell you.\nBG: You\nthink you have money there and it’s really not there?\nVD:  Precisely.  That’s\nexactly what  happened to the people at Sentinel, that’s exactly what\nhappened to people who were at MF Global.\nBG:  But actually, if\nyou just transfer your assets every year, from one institution to the\nnext, wouldn’t that, you know, isn’t that a way of beating the system\nas well?\nVD:  Well, only if\nthings go down one at a time though.\nBG:  Oh I see, they all\ngo down at once…\nVD:  But what I was\nsaying is that I think is…you asked me what’s going to happen when\nthe whole system locks up.  And what I think is going to happen when\nthe whole system locks up…and again this is what I would do if I\nwas dictator for a day…they will take everything and then they will\npromise to pay it out as part of Social Security.\nBG:  So, right, if you\nwant the security you have to buy treasury bonds.  Something like\nthey did in Hungary or whatever.\nVD:  Yeah, there’s\nalways a way of doing it that sounds a lot less….that sounds less\nunpleasant than, “Oh, guess what, all your stuff is gone and if\nyou’re lucky maybe we’ll throw you a handout here and there.”\nBG:  Right.\nVD:  You know, now and then.  And the problem is that’s the good\noutcome.    That’s assuming we’ve got folks in charge\nwho actually mean well and who would really like to pick up the\npieces in a relatively positive way.\nBG:  Right.\nVD:  Obviously history\ntells us that generally when you have a complete\nbreakdown and that sort of thing, you either get chaos, division and\nseparation, like we saw in Yugoslavia, like we saw in the Soviet\nUnion, or you get the man on the white horse riding in and everyone\nsays Hail Mussolini and then six years later you’re fighting some\nstupid war trying to create an empire in Abyssinia.\nBG:\nWell, we’re always fighting a stupid war so that’s, you know…\nVD:\nYeah, at least for Americans its really nothing new in that sense.\nBG:  Its just another\nday at the office.\nVD:  My concern is that\nbecause of…40 years ago or so even 30 years ago, America was kind\nof two different countries.  You had the South and you had everywhere else.\nBG:\nRight.\nVD:  No doubt that\nthere are still…I’m sure there’s still plenty of people across the\nSouth who are just patiently waiting for Round Two.  But, now there’s\nmore like five or six distinct nations, not necessarily blood-nations, but\nvery distinct groups that, in times of severe economic stress, are not\nlikely to stick together but are likely to stick together against\neveryone else.  You’ve got the Hispanic population, you’ve got the\nblack population, you’ve got the Muslim population, you’ve got the\nSouth, you’ve got the sort of mid-west/middle class sort\nof thing and then you’ve got the coasts.  Its not too hard to imagine\nall of those different groups separating and basically wanting to go\ntheir own way and attempt to fix the challenges…attempt to fix the\nproblems and meet the challenges by themselves in their own way\nrather than as one giant 310 million strong country.\nBG:  So in essence you\nsee the nation breaking apart?\nVD:  Yeah, all empires\nbreak apart.\nBG:  Right.\nVD:  And the more\ndiversity that you have the faster you’re going to break apart and\nthe more severe the stresses are.  And so the whole melting pot\nconcept has always been complete garbage.  It was a romantic idea of\na British Jew who came to Britain from Russia.  It had\nnothing to do with anything relating to the American experience\nwhatsoever.  And we’ve seen time and time again we’ve seen…look\nwhat we’re seeing in Europe right now, the whole European Union thing\nwas supposed to be an idea to create a European people, but I can\ntell you that is simply not happening in any way.\nBG:  That was just a\nwet dream of political…the politicians and the academics.\nVD: Of course,\nbut what I’m saying is that we’re actually seeing much\nstronger…we’re seeing the rise of national interest in places it hasn’t been for centuries.  I mean, Scotland is on the verge of\ndemanding independence.\nBG:  I got to tell you\nthis incident, I didn’t realize that you say this about Scotland.\nI’m at the casinos down at Atlantic City last weekend.  These two\nScots were extremely drunk were sitting in the…they were in the\nelevator.\nVD:  Wait, wait,\nwait…I find that very hard to believe, some Scots were drinking\nalcohol?\nBG:  Yeah, now there’s\ndrinking and then there’s like under the table drinking…\nVD: (laughs)\nBG:  …where they’re\nliterally, they’re holding up the floor lest it fall down kind of\ndrinking.\nVD:  Right.\nBG:  So, but let me\nmake my point is so this woman says, she couldn’t tell an accent from\na hole in the wall, so anyway she says, “Are you German?”\nThe guy wanted to just about kill her.  He got up off the\nfloor and he started, he was like ready…he had to be held back just\nabout because this woman thought he was German.\nVD:    It\ncould have been worse, he could have called him English.\nBG:  That’s true, too,\nbut I guess people have a problem with the Germans because they’re\nblaming Germany for the whole debacle, so Germany does have a part to\nplay in this.  Or German corporations.\nVD: I really enjoyed the last time that England\nplayed Germany they had this chant going that was, “Two world\nwars and one world cup, doo dah doo dah!”\nBG:\nWell hey, at least they got a world cup.\nVD:\nAnyhow, I think that we’re going to start seeing some of the same\nstressors that affected the Soviet Union, that affected Yugoslavia,\nthat are now affecting Europe, that are also affecting Great Brittan.\nI think that we’re going to start seeing them become…I mean right\nnow its still very early and I think that most people would think\nthat I was kind of crazy to point it out but you know, when I was\nwarning about the stresses to the global financial system in 2002\nand people all thought that was crazy until six years later when\nsuddenly Henry Paulson is on his knees begging Nancy Pelosi to give\nhim lots of money so there won’t be tanks in the streets.\nBG: So, there is no place to hide from this…this coming tsunami, is\nthere?\nVD:  No, I mean that’s\nwhy I like Italy because its kind of pre-collapsed.  I like living in a\nculture where people already know how to live in elements of complete\ncorruption and chaos.\nBG:  (laughs)\nVD:  You know, its\nnothing new to them, they don’t care.\nBG:  People still\nhaven’t figured out how in this country…the reason why I wanted to\nbring you on to talk about Romney…and people haven’t figured out\nthat the politicians that there still is some semblance that when\nthey speak to you, you really should listen to what they have to say.\nVD: The thing\nthat’s a little bit frightening about Romney is that…previously I\nreally didn’t really think much of him, I mean I’m not a really big\nfan of Mormons, I’m not a big fan of flip-floppy liberal Republicans,\nbut that’s all stuff that is within the framework of things you can\ndeal with, you know?\nBG:  Right.\nVD:  But I mean, “ooh\na politician lied and changed his position”!  This is hardly news.   But what is very troubling to me is the way\nhe and his team behaved at the Republican National Convention\nbecause…and this is why, it’s not because I support Ron Paul\n(although I do), it’s because everything that he did was totally\nunnecessary.  He did not have to bend and break the rules and change\nthem.  He did not have to do things like…\nBG:  He didn’t have to\nstifle dissent.\nVD:  Precisely.  There\nwas absolutely no need for him to stifle any of that, he simply did\nit because he couldn’t stand it.  And I think in a time when the\ncountry is facing some of the most severe stresses that it has\nprobably seen since the Civil War the last thing that you need is a\nPresident who cannot tolerate dissent.  Because, if you’ve got…\nBG:  He’ll start\nlocking up half the population…or siccing the IRS on them, they’ll load\nup and be like, “Volunteer to join the IRS and round up your\nneighbors.”\nVD:  Yeah, I just I\nhave the feeling that if the situation gets much worse and Romney is\nthe President, that he is going to react in precisely the wrong way,\nand he’s going to take a bad situation and exacerbate it.\nBG:  Well, this is a\nguy who comes from Wall Street.  Wall Street owns the government.\nThey’re the ones who created this mess by foisting their desires on\nthe government and he’s, you know…but Wall Street’s finger prints\nare everywhere.  We have what was her name this\nwhat was the other woman, Kagen, who served on the board of directors\nof Goldman Sachs.  Their finger prints are everywhere.\nVD:  But that’s why I\nthink that we know that Romney’s going to win the election because\nalthough Obama, I and others have referred to him as President\nGoldman Sachs….\nBG:  Right.\nVD: But that’s just\nbecause he kept trying to appoint people from Goldman Sachs to the\nCabinet but…\nBG:  Well he’s trying\nto reward, return the favor.\nVD:  Right, but that’s\nthe difference, he’s trying to return the banker’s favor but he’s not\na banker himself.\nBG:  No.\nVD:  And so I think\nthat the fact that the Republicans are putting up a true member of\nthe club versus somebody who is merely friendly to the club, probably\ntells us who is likely to win in November, that’s why I was willing\nto go out on a limb and predict that Romney will win, back in the\nmiddle of August when the New York Times and Nate Silver and all the\nprofessional pollers were saying that Obama is like 75 percent likely to\nwin, or whatever.  We’ll see.\nBG:  As they say you\nalways got to follow the money trail and clearly the money trail is\nfinding its way to Romney.\nVD:  Right.\nBG:  Is this turn of\nevents and leaders, as Doug Casey once remarked, going from Caligula\nto Nero?\nVD:  I don’t…no, I\nmean Romney is not a Nero figure, in any way.  And really,\nObama’s not a Caligula, Obama just wants to hang out and do\nnothing.\nBG:  He wants to play\ngolf.  I think…if you had wrote this or I read this elsewhere but\ncomparing the two its: Obama he enjoys the trappings of power…\nVD:  Right.\nBG:  Whereas Romney\nenjoys the power.\nVD:  Yeah, that was\nsomething that I wrote.\nBG:  There you go…see\nI pay attention to you.\nVD:  (laughs)\nBG:  I thought that was\njust a great line…and that was how really disturbing because that’s\nwho these people are.  I mean…Obama has plenty of bad ideas but…\nVD:  And that was\nbefore the Republican National Convention so…\nBG:  Yes.\nVD:  Now that we’ve got\nsomebody who like is really organized and is willing to work hard and\ndoesn’t tolerate dissent.  That’s just…I’d frankly prefer the pot-smoking golfer.\nBG:    Or\ncocaine or the bisexual golfer.\nVD:  As long as he’s\nnot working, you know.\nBG:  That is true.  But\nthen he appoints…either one is obviously a bad choice because then\nhe just appoints all these bureaucrats to make decisions in\ngovernment.\nVD:  I’m not voting for\nObama or Romney…\nBG:  That is true.\nVD: The point is that if its not Caligula to Nero it may well be out\nof the frying pan and into the fire.\nBG:  Yeah. What’s bad is that you’re having, you’re being someone who’s “a\nfree market person” which is like, “war is peace.”\nAnd the “free market” will be blamed for what comes next.\nIt is a result of capitalism that will generate all the coming\nmisery.\nVD: I don’t know that it makes…I’m not terribly concerned about where\nthe blame is going to be apportioned.  There’s going to be no\nshortage of it.\nBG:  Right.\nVD:  The important\nthing for people is just to be building up contacts in their\ncommunities and making sure that they have some resources so that if\nthey can’t access their bank account for a week or month that they\nhave the resources to get by on their own.  And that’s the important\nthing and people are doing that.  There’s a reason why gun sales are\nup and ammo sales are up. People understand that something is\ncoming and they are attempting to do their best to prepare in\nwhatever small way they can for it.  The problem is you\ncan’t…you can never adequately prepare for the unknown, but what\nyou can do is at least be sure that you’re in your local community,\nand with your friends and family.  People understand, hey look, when\nthings go bad, if there’s tough times, we have to stick together and\nwe have to help each other.  Human civilization has survived\neverything that the idiocy and evil of Man has ever thrown at it and\nit will survive this too.\nBG:  How many years of\ndarkness do you think we’ll be entering into?\nVD:  I couldn’t\npossibly say.  The only thing that I’m certain about is that we’ve\npretty much reached the end of the American system.\nBG:  The personal, the\npursuit of happiness kind of system?\nVD:  Yeah I think that\nthat is coming to…rapidly coming to an end.  What comes next?  I\ndon’t know.  Who in the last days of Rome predicted France and the\nHoly Roman Empire and England or even what happened in\nConstantinople?  These are things that we cannot reasonable expect to\nforesee, but we can expect is that every day the sun is going to\nrise, it’s going to rain sooner or later, and we still have to answer\nto God for our actions.\nBG:  And the wheel is\nround…where there’s an action there’s a reaction.  What’s occurred\nthere’s payment…a payment day is coming.  But I just want to get\nback to this point.  This is the most disturbing that you’ve said\ntoday which is…I have a feeling of comfort but, I understand about\nreaching into accounts but, you’re saying anybody holding any bank,\nany money in any security institution, doesn’t have to be necessarily\nin stocks it could be sitting in cash, that that’s all fair game for\nthe government?  Or that these institutions will just disappear?\nVD:  I don’t think that\nthey will mess with cash in the bank, not initially.  Even in places\nlike Argentina and Greece, at most what they’ve done is\ntold you that you can’t take more than a certain amount out at any\ntime.  Frankly, that’s pretty much the way that it is in the US\nalready.  You can take it out but they still have to file reports and\nwhatnot.  The mechanism is already set up for that kind of stuff and\nit has been for 20 or 30 years, ever since the War on Drugs.\nBG:  So, now let me ask\nyou, is this the Great Conspiracy, or is it just the product of\nincompetence?\nVD:  Hmmm. To be\nhonest I think both.  I don’t think that there are that many people who really want to crash it.  If you’re part of the elite and you’ve\nbeen living large off it for 50 years, why do you want to bring it to\nan end?  People that are really focused on the, “Oh Bill\nClinton…”  I mean, the whole thing about Obama wanting to\nbecome a dictator, we’ve heard that about Bill Clinton and I’m sure\npeople were hearing it about Richard Nixon.\nBG:  Right.\nVD:  The reality is\nthat most people really want to protect the status quo.  Now there are people who want to create a big one world government and stuff,\nbut crashing the USA is not actually a very effective way of doing\nthat when the USA was the main mechanism for creating it in the first\nplace.\nBG:  Right.  You’re\nkilling the goose.\nVD: There is\nsomething to the whole divide and conquer thing, but you don’t need\nto divide and conquer when you just go ahead and you buy the\nSenate and get them to pass a treaty.\nBG:  Right, you do\nwhatever you want to do, but ultimately you’re ah…but let me ask\nyou, on the one hand you’re doing what\nyou want to do as far as big business, but about the explosion of\nsocial services and social benefits, is that just something to add to\nplacate the masses?\nVD:  They have to do that because if they don’t then we’d already be\nliving in Yugoslavia.\nBG:  Right, there’d be\nuprisings and all that.\nVD:  Yeah, things would\nprobably be fine in some places, but in other places it would be\ncompletely unlivable.  That’s what they’re seeing in Greece…that’s\nwhat got Greece in trouble in the first place, they were paying\neverybody to do nothing.\nBG: (laughs)\nVD:  The social\nservices is… that’s the bread in the bread and\ncircuses.\nBG:  The bread and the\nbeer.\nVD:  Precisely.\nBG: By the way\nVox, I blew off all my other guests because I’m having so much\nfun talking to you, by the way.\nVD:  You’re too kind.\nBG:  We have about five\nminutes left to wrap up so I just want to leave something positive\nwith our listeners and I think I want to reiterate how you button\ndown for the coming storm.\nVD:  Well, I think that\nyou have to look at the main things that you need.  The main things\nthat you need are: food, water, and you want to be\naround good, trustworthy God-fearing people, you want to have some\nmeans of protecting yourself and your family and your surroundings.\nSo, its just basically going back to basics and not living in this\nmodern way of assuming that I don’t need to have anything, I’ll just\ngo down to the shops and pick it up today.\nBG:  So you think\npeople should start building something to secure foodstuffs?\nVD: I think this\nis one area where Mitt Romney might be a good role model.  If I\nunderstand correctly Mormons are expected to keep a year’s\nsupply of food and water and so forth.  That’s not a bad idea.  If\nnothing else you can get by on your dry beans and Evian.\nBG:    I\ntake it that requires a lot of storage to put something for a year?\nVD: It’s not as\nbad as…doesn’t take up as much space as you might think but, and\nits not as expensive as you might think.  This is the sort of thing\nwhere maybe instead of going to Disneyland, you set yourself up so if\nthere are issues you’re not quite as worried about it right away.\nBG:  You make the\ninvestment and you put away the money and you figure out the\nsecurity and all that.\nVD: The stock market’s at relative highs on super low volume.  You\nmight as well take your money out and get something for it rather\nthan just watch it go down, when the market starts crashing.\nBG:  You mentioned\nabout buying land but land looks like, like everything, real estate\nis very much overinflated…\nVD:  Sure.\nBG:  Do you think land\nwill also decline?\nVD:  It might but its\nnot going to disappear into nothing like Facebook.\nBG:  (laughs)\nVD:  At the end of the\nday you can still build a house on it.\nBG:  But that land\ncould sit there for a long time to come before you could do something\nwith it…you could have cash tied up in the value.\nVD:  But what you have\nto understand is that in times of economic depression its all about\nasset protection.  Its not about making money.  You know what I mean?\nEconomic booms are when you want to leverage and grow and all that\nsort of thing.  What works while….what your objective is and what\nyour focus is in times of economic growth should not be your\nobjectives in times of… yes, there are people who are trying\nto profit on it there are people who are trying to short Facebook or\nshort Apple or whatever but the problem is that even if you make the\nright call it doesn’t matter if your broker goes out of business.\nBG:  You have to worry\nabout the brokerage, the brokerage firm?\nVD:  Right, exactly.\nBG:  Then you got real\nissues there.  Hey, by the way does your book address those issues?\nThe Return of the Great Depression\nVD:  Oh, some of them,\nits a little bit more…my focus tends to be a little bit more\ntheoretical and abstract than particularly practical.  But I’ve been\ntold that a lot of people who are into the practical side of it\nnevertheless like it because they like things being put into context\nso that it makes sense to them, rather than just sort of this, “Well\nhere’s this dark cloud and we don’t know why and we don’t know what.”\nBG:  Right. Like any doctor, you want them to analyze why you have the\ncondition that you have and then that way you can make adjustments.\nVD:  Precisely.\nBG:  Hey with that Vox,\nwe’ve run out of time.  Vox Day, just a pleasure.  Really appreciate\nyour time.  Libertarian political columnist.  Get his book,\nThe\nReturn of the Great Depression\n.\nNB: Thanks very much to MC and BD for the transcript.",
  "tags": [
    "economics",
    "interview",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-21T10:23:00+00:00"
}