{
  "url": "https://voxday.net/2012/09/26/homeschool-vaccine-survey/",
  "scraped_at": "2025-12-14T05:04:11.975839",
  "title": "Homeschool vaccine survey",
  "date_display": "September 26, 2012",
  "date_iso": "2012-09-26T14:37:00+00:00",
  "date_from_url": "2012-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you live in Florida, Louisiana, Mississippi, or Oregon and homeschool your children, please consider taking part in <a href=\"http://chefofla.org/nheri.html\">this NHERI-sponsored pilot study</a>:</p><blockquote class=\"tr_bq\"><p> A lot of people feel strongly about the<br> importance of all children being vaccinated for their own good and<br> society’s good. Others feel just as strongly that vaccines are dangerous<br> and do more harm than good.<br> <br> Maybe you haven’t really thought about<br> it and are rather neutral about the issue. But wouldn’t it be<br> interesting to find out the facts about what might be going on with<br> vaccines and the health of our children and society?<br> <br> This is a great opportunity for you to<br> participate in a study to help everyone understand this critical and<br> controversial subject. Homeschoolers, with either vaccinated or non-vaccinated children, are in a unique position to inform this area of research.<br> <br> Study participants will remain anonymous. We fully understand the importance of confidentiality and anonymity.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This should be interesting, as there has been a great deal of theorizing about homeschoolers and vaccinations without anyone actually possessing much in the way of relevant evidence concerning it.</p></div>",
  "content_text": "If you live in Florida, Louisiana, Mississippi, or Oregon and homeschool your children, please consider taking part in\nthis NHERI-sponsored pilot study\n:\nA lot of people feel strongly about the\nimportance of all children being vaccinated for their own good and\nsociety’s good. Others feel just as strongly that vaccines are dangerous\nand do more harm than good.\nMaybe you haven’t really thought about\nit and are rather neutral about the issue. But wouldn’t it be\ninteresting to find out the facts about what might be going on with\nvaccines and the health of our children and society?\nThis is a great opportunity for you to\nparticipate in a study to help everyone understand this critical and\ncontroversial subject. Homeschoolers, with either vaccinated or non-vaccinated children, are in a unique position to inform this area of research.\nStudy participants will remain anonymous. We fully understand the importance of confidentiality and anonymity.\nThis should be interesting, as there has been a great deal of theorizing about homeschoolers and vaccinations without anyone actually possessing much in the way of relevant evidence concerning it.",
  "tags": [
    "education",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-26T13:37:00+00:00"
}