{
  "url": "https://voxday.net/2012/09/24/iran-vs-israe/",
  "scraped_at": "2025-12-14T05:03:59.157555",
  "title": "Iran vs Israel",
  "date_display": "September 24, 2012",
  "date_iso": "2012-09-24T13:00:00+00:00",
  "date_from_url": "2012-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One has to give credit where it is due.  For all of his observable anti-Americanism, Obama nevertheless appears to be doing a better job of <a href=\"http://debka.com/article/22380/Obama-snubs-Netanyahu-on-Iran-My-decisions---only-what%E2%80%99s-right-for-America\">giving priority to American interests</a> on the foreign affairs front than George W. Bush, John McCain, or Mitt Romney:</p><blockquote class=\"tr_bq\"><p> As debkafile<br> reported after that Obama snub, the wrangling with Washington has<br> reduced Netanyahu’s options to start standing alone and making his own<br> decisions. Obama’s latest words underline this. The prime minister can no longer<br> avoid his most fateful decision and one that is critical to Israel’s<br> survival: to attack Iran and disrupt its nuclear program or live with an<br> anti-Semitic nuclear Iran dedicated to the destruction of the Jewish<br> state and a threat to world stability.</br></br></br></br></br></br></br></p><p> For two weeks, the Israeli prime minister has dodged and ducked around<br> the White House message. Instead, he has kept on bombarding Washington<br> with high-powered messengers. They all came back with the same tidings:<br> the US President is not only fed up with Israeli pressure but more<br> determined than evade any military engagement with Iran.</br></br></br></br></p></blockquote><p>The hostilities between Iran and Israel certainly have the potential to be dangerous, but neither country are a direct national security interest of the United States.  Neither is a military ally and both countries could perish in a mutual nuclear conflagration and it wouldn’t effect the USA in the slightest.  If Israel decides to attack Iran, or if Iran decides to attack Israel, the only concern of the USA should be to prevent the war from going regional by keeping the Sunni Arab nations out of the conflict.  Given the fact that Israel has no serious allies and most of Iran’s neighbors are varying degrees of hostile towards both Israel and the Shi’ite Persians of Iran, there is little reason to believe that a war between them is likely to draw in a substantial number of third parties.</p><p>Nor should anyone take the hysterical posturing by American Jews about the potential for a second Holocaust if the USA does not intervene seriously.  Ehud Barak, the Israeli Minister of Defense, has estimated that a war with Iran would last one month and cost Israel <a href=\"http://www.reuters.com/article/2012/08/15/us-israel-iran-idUSBRE87E0AM20120815\">around 500 dead</a>.  In a worst case scenario.</p></div>",
  "content_text": "One has to give credit where it is due.  For all of his observable anti-Americanism, Obama nevertheless appears to be doing a better job of\ngiving priority to American interests\non the foreign affairs front than George W. Bush, John McCain, or Mitt Romney:\nAs debkafile\nreported after that Obama snub, the wrangling with Washington has\nreduced Netanyahu’s options to start standing alone and making his own\ndecisions. Obama’s latest words underline this. The prime minister can no longer\navoid his most fateful decision and one that is critical to Israel’s\nsurvival: to attack Iran and disrupt its nuclear program or live with an\nanti-Semitic nuclear Iran dedicated to the destruction of the Jewish\nstate and a threat to world stability.\nFor two weeks, the Israeli prime minister has dodged and ducked around\nthe White House message. Instead, he has kept on bombarding Washington\nwith high-powered messengers. They all came back with the same tidings:\nthe US President is not only fed up with Israeli pressure but more\ndetermined than evade any military engagement with Iran.\nThe hostilities between Iran and Israel certainly have the potential to be dangerous, but neither country are a direct national security interest of the United States.  Neither is a military ally and both countries could perish in a mutual nuclear conflagration and it wouldn’t effect the USA in the slightest.  If Israel decides to attack Iran, or if Iran decides to attack Israel, the only concern of the USA should be to prevent the war from going regional by keeping the Sunni Arab nations out of the conflict.  Given the fact that Israel has no serious allies and most of Iran’s neighbors are varying degrees of hostile towards both Israel and the Shi’ite Persians of Iran, there is little reason to believe that a war between them is likely to draw in a substantial number of third parties.\nNor should anyone take the hysterical posturing by American Jews about the potential for a second Holocaust if the USA does not intervene seriously.  Ehud Barak, the Israeli Minister of Defense, has estimated that a war with Iran would last one month and cost Israel\naround 500 dead\n.  In a worst case scenario.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-24T12:00:00+00:00"
}