{
  "url": "https://voxday.net/2012/09/27/juxtaposition_1232/",
  "scraped_at": "2025-12-14T05:04:19.290171",
  "title": "Juxtaposition",
  "date_display": "September 27, 2012",
  "date_iso": "2012-09-27T13:30:00+00:00",
  "date_from_url": "2012-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I happened to read two articles describing the same thing from very different perspectives earlier this week.</p><p><a href=\"http://pjmedia.com/blog/no-jewish-people-without-israel-daniel-gordis-excellent-essay/2/\">Item One</a>:</p><blockquote class=\"tr_bq\"><p> Though few may doubt that Jewish life in America could be threatened, Gordis effectively explains why this luxury is precisely <i>because of</i><br> the modern state of Israel. In the most powerful passages of the<br> lengthy piece, he describes the Israeli contribution to the strength of<br> the American Jewish psyche and standing. There was an era not long ago in which American Jews<br> tiptoed around America, nervously striving to stay beneath the radar.<br> They evoked that image of the spies who reported back to Moses after<br> surveying the Promised Land: “We looked like grasshoppers to ourselves,<br> and so we appeared to them.” The American Jews who believe they could<br> survive the loss of Israel do not remember that era. They take it as<br> entirely natural that thousands of American citizens confidently ascend<br> the steps of the Capitol Hill on the lobbying day at AIPAC’s annual<br> Policy Conference….</br></br></br></br></br></br></br></br></br></br></br></p><p>Jews today no longer think of themselves as a tiptoeing people. When<br> Soviet Jews awakened and wanted out of their national prison, American<br> Jews supported them, and the State of Israel made their rescue a<br> national project. When an Air France flight filled with Jews was<br> hijacked to Entebbe, the State of Israel rescued them, and American Jews<br> were filled with unprecedented pride. When Ethiopian Jews were caught<br> in the crosshairs of a deadly civil war, the State of Israel whisked<br> them out, and American philanthropists continue to make them a key<br> priority. Much of what fuels American Jewish pride is the existence and<br> the behavior of the State of Israel.  In ways we do not sufficiently recognize, Israel has changed the<br> existential condition of Jews everywhere, even in America. Without the<br> State of Israel, the self-confidence and sense of belonging that<br> American Jews now take for granted would quickly disappear.</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p><a href=\"http://www.foreignpolicyjournal.com/2012/08/28/us-preparing-for-a-post-israel-middle-east/\"> Item Two</a>:</p><blockquote class=\"tr_bq\"><div style=\"text-align: justify;\"> So what is all the fuss about? It’s a paper entitled “Preparing For A<br> Post Israel Middle East”, an 82-page analysis that concludes that the<br> American national interest in fundamentally at odds with that of Zionist<br> Israel. The authors conclude that Israel is currently the greatest<br> threat to US national interests because its nature and actions prevent<br> normal US relations  with  Arab and  Muslim countries and, to a growing<br> degree, the wider international community….</br></br></br></br></br></br></div><div style=\"text-align: justify;\"></div><div style=\"text-align: justify;\"> Among the many findings:</div><ul><li>Gross Israeli interference in the internal affairs of the United<br> States through spying and illegal US arms transfers. This includes<br> supporting more than 60 ‘front organizations’ and  approximately 7,500<br> US officials who do Israel’s bidding and seek to dominate and intimidate<br> the media and agencies of  the US government which should no longer be<br> condoned;</br></br></br></br></br></li><li>That the United States government no longer has the financial<br> resources, or public support to continue funding Israel. The billions of<br> dollars in direct and indirect aid from US taxpayers to Israel since<br> 1967 is not affordable and is increasingly being objected to by US<br> taxpayers who oppose continuing American military involvement in the<br> Middle East. US public opinion no longer supports funding and executing<br> widely perceived illegal US wars on Israel’s behalf. This view is<br> increasingly being shared by Europe, Asia and the International public;</br></br></br></br></br></br></br></li></ul></blockquote><div style=\"text-align: justify;\"> Taken in tandem,<br> it rather looks as if history may be threatening to repeat itself yet<br> again.  If the existence of Israel has made American Jews confident<br> enough to stop tiptoeing around America and openly dominate Washington,<br> Hollywood, and Wall Street to an extent the various American<br> intelligence agencies believe should no longer be condoned, this would<br> appear to be setting the stage for a power struggle of the sort that<br> always seems to wind up with <a href=\"http://www.biblebelievers.org.au/expelled.htm\">the Jews being expelled</a> through no fault of their own.  It raises two questions in my mind:<ol><li>Have the Jews ever come out on top in such a conflict?</li><li>If not, what is the benefit of swaggering proudly rather than tiptoeing politely when one is a tiny minority of the population.</li></ol></br></br></br></br></br></br></br></div></div>",
  "content_text": "I happened to read two articles describing the same thing from very different perspectives earlier this week.\nItem One\n:\nThough few may doubt that Jewish life in America could be threatened, Gordis effectively explains why this luxury is precisely\nbecause of\nthe modern state of Israel. In the most powerful passages of the\nlengthy piece, he describes the Israeli contribution to the strength of\nthe American Jewish psyche and standing. There was an era not long ago in which American Jews\ntiptoed around America, nervously striving to stay beneath the radar.\nThey evoked that image of the spies who reported back to Moses after\nsurveying the Promised Land: “We looked like grasshoppers to ourselves,\nand so we appeared to them.” The American Jews who believe they could\nsurvive the loss of Israel do not remember that era. They take it as\nentirely natural that thousands of American citizens confidently ascend\nthe steps of the Capitol Hill on the lobbying day at AIPAC’s annual\nPolicy Conference….\nJews today no longer think of themselves as a tiptoeing people. When\nSoviet Jews awakened and wanted out of their national prison, American\nJews supported them, and the State of Israel made their rescue a\nnational project. When an Air France flight filled with Jews was\nhijacked to Entebbe, the State of Israel rescued them, and American Jews\nwere filled with unprecedented pride. When Ethiopian Jews were caught\nin the crosshairs of a deadly civil war, the State of Israel whisked\nthem out, and American philanthropists continue to make them a key\npriority. Much of what fuels American Jewish pride is the existence and\nthe behavior of the State of Israel.  In ways we do not sufficiently recognize, Israel has changed the\nexistential condition of Jews everywhere, even in America. Without the\nState of Israel, the self-confidence and sense of belonging that\nAmerican Jews now take for granted would quickly disappear.\nItem Two\n:\nSo what is all the fuss about? It’s a paper entitled “Preparing For A\nPost Israel Middle East”, an 82-page analysis that concludes that the\nAmerican national interest in fundamentally at odds with that of Zionist\nIsrael. The authors conclude that Israel is currently the greatest\nthreat to US national interests because its nature and actions prevent\nnormal US relations  with  Arab and  Muslim countries and, to a growing\ndegree, the wider international community….\nAmong the many findings:\nGross Israeli interference in the internal affairs of the United\nStates through spying and illegal US arms transfers. This includes\nsupporting more than 60 ‘front organizations’ and  approximately 7,500\nUS officials who do Israel’s bidding and seek to dominate and intimidate\nthe media and agencies of  the US government which should no longer be\ncondoned;\nThat the United States government no longer has the financial\nresources, or public support to continue funding Israel. The billions of\ndollars in direct and indirect aid from US taxpayers to Israel since\n1967 is not affordable and is increasingly being objected to by US\ntaxpayers who oppose continuing American military involvement in the\nMiddle East. US public opinion no longer supports funding and executing\nwidely perceived illegal US wars on Israel’s behalf. This view is\nincreasingly being shared by Europe, Asia and the International public;\nTaken in tandem,\nit rather looks as if history may be threatening to repeat itself yet\nagain.  If the existence of Israel has made American Jews confident\nenough to stop tiptoeing around America and openly dominate Washington,\nHollywood, and Wall Street to an extent the various American\nintelligence agencies believe should no longer be condoned, this would\nappear to be setting the stage for a power struggle of the sort that\nalways seems to wind up with\nthe Jews being expelled\nthrough no fault of their own.  It raises two questions in my mind:\nHave the Jews ever come out on top in such a conflict?\nIf not, what is the benefit of swaggering proudly rather than tiptoeing politely when one is a tiny minority of the population.",
  "tags": [
    "history",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-27T12:30:00+00:00"
}