{
  "url": "https://voxday.net/2012/09/28/kick-back-have-beer/",
  "scraped_at": "2025-12-14T05:04:24.752514",
  "title": "Kick back, have a beer",
  "date_display": "September 28, 2012",
  "date_iso": "2012-09-28T13:00:00+00:00",
  "date_from_url": "2012-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/9572187/Couples-who-share-the-housework-are-more-likely-to-divorce-study-finds.html\">let her get on with the housework</a>.  You’ll not only <i>both </i>be happier, but you’re less likely to end up divorced:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> In what appears to be a slap in the face for gender equality, the report found<br> the divorce rate among couples who shared housework equally was around 50<br> per cent higher than among those where the woman did most of the work.</br></br></div><div class=\"secondPar\"> “What we’ve seen is that sharing equal responsibility for work in the home<br> doesn’t necessarily contribute to contentment,” said Thomas Hansen,<br> co-author of the study entitled “Equality in the Home”.</br></br></div><div class=\"thirdPar\"> The lack of correlation between equality at home and quality of life was<br> surprising, the researcher said.  “One would think that break-ups would occur more often in families with less<br> equality at home, but our statistics show the opposite,” he said. The figures clearly show that “the more a man does in the home, the higher the<br> divorce rate,” he went on.</br></br></br></div></blockquote><p>The idea that the values held by members of equalitarian households are to blame sounds reasonable, but I think the real cause is a natural consequence of men and women having fundamentally different standards.  If you’re going to end up doing it one way or the other, it’s a lot more annoying to have to do it when you thought – however unreasonable the expectation – that someone was going to do it to your liking for you.  A woman who has no expectation of household equality is naturally going to be much happier than one who thought she was going to get it, but didn’t.</p><p>The equalitarian households are simply more likely to discover this than the more traditional ones.  If the homemaking isn’t left to the homemaker, it shouldn’t be a tremendous surprise that things don’t go well.  The household is hardly the only place where it is a terrible idea to assign the job to the individual who cares least about it.  The lesson, as always, is that if you care a lot about how well something is done, you should always do it yourself.</p><p>On the other hand, I suppose it is possible that men doing too much housework is simply a grotesque DLV and they’re actively repelling their wives by turning themselves into disgusting socio-sexual gamma males.</p><p>I found the following to be an interesting conclusion of another study, which does not actually contradict the one cited above, as it is completely in line with the conclusions of a month-long experiment conducted by one of my friends.</p><p><i>The researchers expected to find that where men shouldered more of the burden,<br> women’s happiness levels were higher. In fact they found that it was the men<br> who were happier while their wives and girlfriends appeared to be largely<br> unmoved. </br></br></br></i></p><p>If it makes you happier, then do more housework.  If not, then don’t.  Either way, don’t think that it’s going to score you any points or make her any happier, because you’re probably not going to do it to her satisfaction and it’s even possible that your well-intentioned efforts are making you sexually repulsive to her.</p><div class=\"fourthPar\"></div><div class=\"fifthPar\"></div></div>",
  "content_text": "And\nlet her get on with the housework\n.  You’ll not only\nboth\nbe happier, but you’re less likely to end up divorced:\nIn what appears to be a slap in the face for gender equality, the report found\nthe divorce rate among couples who shared housework equally was around 50\nper cent higher than among those where the woman did most of the work.\n“What we’ve seen is that sharing equal responsibility for work in the home\ndoesn’t necessarily contribute to contentment,” said Thomas Hansen,\nco-author of the study entitled “Equality in the Home”.\nThe lack of correlation between equality at home and quality of life was\nsurprising, the researcher said.  “One would think that break-ups would occur more often in families with less\nequality at home, but our statistics show the opposite,” he said. The figures clearly show that “the more a man does in the home, the higher the\ndivorce rate,” he went on.\nThe idea that the values held by members of equalitarian households are to blame sounds reasonable, but I think the real cause is a natural consequence of men and women having fundamentally different standards.  If you’re going to end up doing it one way or the other, it’s a lot more annoying to have to do it when you thought – however unreasonable the expectation – that someone was going to do it to your liking for you.  A woman who has no expectation of household equality is naturally going to be much happier than one who thought she was going to get it, but didn’t.\nThe equalitarian households are simply more likely to discover this than the more traditional ones.  If the homemaking isn’t left to the homemaker, it shouldn’t be a tremendous surprise that things don’t go well.  The household is hardly the only place where it is a terrible idea to assign the job to the individual who cares least about it.  The lesson, as always, is that if you care a lot about how well something is done, you should always do it yourself.\nOn the other hand, I suppose it is possible that men doing too much housework is simply a grotesque DLV and they’re actively repelling their wives by turning themselves into disgusting socio-sexual gamma males.\nI found the following to be an interesting conclusion of another study, which does not actually contradict the one cited above, as it is completely in line with the conclusions of a month-long experiment conducted by one of my friends.\nThe researchers expected to find that where men shouldered more of the burden,\nwomen’s happiness levels were higher. In fact they found that it was the men\nwho were happier while their wives and girlfriends appeared to be largely\nunmoved.\nIf it makes you happier, then do more housework.  If not, then don’t.  Either way, don’t think that it’s going to score you any points or make her any happier, because you’re probably not going to do it to her satisfaction and it’s even possible that your well-intentioned efforts are making you sexually repulsive to her.",
  "tags": [
    "Alpha Game",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-28T12:00:00+00:00"
}