{
  "url": "https://voxday.net/2012/09/05/mailvox-requested-arbitration/",
  "scraped_at": "2025-12-14T05:02:43.264257",
  "title": "Mailvox: a requested arbitration",
  "date_display": "September 5, 2012",
  "date_iso": "2012-09-05T14:41:00+00:00",
  "date_from_url": "2012-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know you’re dealing with a very special individual when you find yourself longing for the simple pleasure of swatting away the usual anklebiters.  And what is with my critics and their absolute obsession with the human posterior?  Anyhow, Corona Rabbit requested arbitration:</p><p>CR: <i>I would like to know who deleted the CoronaRabbit posts under “True libertarians won’t vote Libertarian”.</i></p><p>VD: One of the blog administrators authorized to do so, who did so correctly as per the rules I established.  It’s not that hard.  When you are asked a direct question that is relevant to the topic at hand, <b>then answer the fucking question</b>. If you can’t follow a few very simple rules of this sort, you can’t be part of the conversation here.</p><p>CR: <i>How very snappy. If you are not available to act as arbiter, then you should not have conversations on your blog. Or rather, you can, but then please rename your site to: Home Of The Ass Flies: We Suck Asses Daily.</i></p><p>Are you aware that I ASKED you to look at my posts, and those of Josh, in order to resolve this very thing? I stated that I was WAITING for that resolution.  Here is the thing, Vox: Josh DEMANDED that I comply with the reply-rule. I saw no need to reply to his bullshit. Still, given his DEMAND, I then asked that YOU make a ruling on whether I was right about Josh being a filthy fucking play-debater.</p><p>Surely I am allowed to do thusly? Apparently, it seems, not. More than that, I was not necessary that I respond: my response to his question (the first version, before he changed it) had already been given, before he even asked. But let me give you the sequence: that is, if you actually do give a fucking damn.</p><p>[LONG AND TEDIOUS REFRAIN OF COMMENT THREAD]</p><p>So do tell me Vox, did I have to answer Josh’s “Question”? Given that before he changed the question, I kind of already had? I was under the impression that the sort of things Josh did were very big no-no’s. Tsk, tsk, tsk.</p><p>Now. Who the hell erased my last posts? I had classically cursed Nate in the last one, and was rather happy with it. Oh, and bought all the little wockers before the Lord: this is the real world, after all, where the Living God walks around. Read Lev 19 (KJV) for a refresher if you are in the mood.</p><p>I was not in the wrong here. Not 100% in the right, fine, but in terms of honesty and truth this was shameful. And do let me point out that Nate, the self-proclaimed Mr Awesome, had apparently read the posts… and then proceeded to proclaim judgement on the side of Josh. Apparenly I had managed to offend his unholiness with my lack of demonic glibness. (The act which led me to, in the absence of ANY fucking arbiter, to bring the Living God into the game.)</p><p>I am waiting for a reply. Not that I care, you understand. Not that I think you will act with any more integrity than the animals did. I would just like you to formaly chose the way of the devil. “I like my universe neat,” sayth the Lord.</p><p><b>THE REQUESTED VERDICT</b></p><p>VD: You very much need to learn to stop trying to tell other people what to do in their own house.  Josh was correct.  You had an obligation to answer his question and instead of doing so, launched an obnoxious and foul-mouthed series of idiotic comments.  Moreover, it is utterly stupid to expect any blogger to act as an arbiter 24-7. That is absolutely ridiculous and you should be embarrassed to have even raised the point.  Nor does failing to arbitrate between commenters on demand somehow transform a blog into an echo chamber.  That doesn’t even make any sense.</p><p>It is 100 percent clear that you did not answer a serious and relevant question.  You even admit it, you are simply attempting to justify not doing so.  You claimed: <i>“I DEEMED IT ANSWER ENOUGH. GIVEN THE CLASSICAL LOGICAL FALLACY JOSH WAS UNDOUBTEDLY KNOWINGLY COMMITTING, I SAW NO REASON TO TREAT JOSH WITH ANYTHING BUT DESERVED CONTEMPT”.</i></p><p>You were wrong.  The various other aspects are irrelevant.  You still have to answer the question.  If Josh was committing a logical fallacy, you should have pointed it out to him, identified the specific logical fallacy committed, and then answered the question.</p></div>",
  "content_text": "You know you’re dealing with a very special individual when you find yourself longing for the simple pleasure of swatting away the usual anklebiters.  And what is with my critics and their absolute obsession with the human posterior?  Anyhow, Corona Rabbit requested arbitration:\nCR:\nI would like to know who deleted the CoronaRabbit posts under “True libertarians won’t vote Libertarian”.\nVD: One of the blog administrators authorized to do so, who did so correctly as per the rules I established.  It’s not that hard.  When you are asked a direct question that is relevant to the topic at hand,\nthen answer the fucking question\n. If you can’t follow a few very simple rules of this sort, you can’t be part of the conversation here.\nCR:\nHow very snappy. If you are not available to act as arbiter, then you should not have conversations on your blog. Or rather, you can, but then please rename your site to: Home Of The Ass Flies: We Suck Asses Daily.\nAre you aware that I ASKED you to look at my posts, and those of Josh, in order to resolve this very thing? I stated that I was WAITING for that resolution.  Here is the thing, Vox: Josh DEMANDED that I comply with the reply-rule. I saw no need to reply to his bullshit. Still, given his DEMAND, I then asked that YOU make a ruling on whether I was right about Josh being a filthy fucking play-debater.\nSurely I am allowed to do thusly? Apparently, it seems, not. More than that, I was not necessary that I respond: my response to his question (the first version, before he changed it) had already been given, before he even asked. But let me give you the sequence: that is, if you actually do give a fucking damn.\n[LONG AND TEDIOUS REFRAIN OF COMMENT THREAD]\nSo do tell me Vox, did I have to answer Josh’s “Question”? Given that before he changed the question, I kind of already had? I was under the impression that the sort of things Josh did were very big no-no’s. Tsk, tsk, tsk.\nNow. Who the hell erased my last posts? I had classically cursed Nate in the last one, and was rather happy with it. Oh, and bought all the little wockers before the Lord: this is the real world, after all, where the Living God walks around. Read Lev 19 (KJV) for a refresher if you are in the mood.\nI was not in the wrong here. Not 100% in the right, fine, but in terms of honesty and truth this was shameful. And do let me point out that Nate, the self-proclaimed Mr Awesome, had apparently read the posts… and then proceeded to proclaim judgement on the side of Josh. Apparenly I had managed to offend his unholiness with my lack of demonic glibness. (The act which led me to, in the absence of ANY fucking arbiter, to bring the Living God into the game.)\nI am waiting for a reply. Not that I care, you understand. Not that I think you will act with any more integrity than the animals did. I would just like you to formaly chose the way of the devil. “I like my universe neat,” sayth the Lord.\nTHE REQUESTED VERDICT\nVD: You very much need to learn to stop trying to tell other people what to do in their own house.  Josh was correct.  You had an obligation to answer his question and instead of doing so, launched an obnoxious and foul-mouthed series of idiotic comments.  Moreover, it is utterly stupid to expect any blogger to act as an arbiter 24-7. That is absolutely ridiculous and you should be embarrassed to have even raised the point.  Nor does failing to arbitrate between commenters on demand somehow transform a blog into an echo chamber.  That doesn’t even make any sense.\nIt is 100 percent clear that you did not answer a serious and relevant question.  You even admit it, you are simply attempting to justify not doing so.  You claimed:\n“I DEEMED IT ANSWER ENOUGH. GIVEN THE CLASSICAL LOGICAL FALLACY JOSH WAS UNDOUBTEDLY KNOWINGLY COMMITTING, I SAW NO REASON TO TREAT JOSH WITH ANYTHING BUT DESERVED CONTEMPT”.\nYou were wrong.  The various other aspects are irrelevant.  You still have to answer the question.  If Josh was committing a logical fallacy, you should have pointed it out to him, identified the specific logical fallacy committed, and then answered the question.",
  "tags": [
    "freakshow",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-05T13:41:00+00:00"
}