{
  "url": "https://voxday.net/2012/09/20/so-much-for-friedman/",
  "scraped_at": "2025-12-14T05:03:42.569328",
  "title": "So much for Friedman",
  "date_display": "September 20, 2012",
  "date_iso": "2012-09-20T13:00:00+00:00",
  "date_from_url": "2012-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ben Bernanke abandons <a href=\"http://ca.news.yahoo.com/bernanke-briefs-u-lawmakers-fiscal-cliff-214236206--sector.html\">the economic theory of monetary supremacy</a>:</p><blockquote class=\"tr_bq\"><p> Bernanke also said then that the Fed could not solve the economy’s problems alone.<br> “If the fiscal cliff isn’t addressed, as I’ve said, I don’t think our tools are strong enough to offset the effects of a major fiscal shock, so we’d have to think about what to do in that contingency,” he said at a news conference last Thursday following a meeting of Fed policymakers. “It’s really important for the fiscal policymakers to, you know, work together to try and find a solution for that.”</br></p></blockquote><p>Translation: We’ve been trying for four years to fix this thing and it isn’t working.  QE3 is just another band-aid that can’t even staunch the bleeding anymore, forget healing the wound.  We need you guys to step up to the plate and spend, spend, spend in order to buy us more time to pick up hard assets before the final collapse.</p></div>",
  "content_text": "Ben Bernanke abandons\nthe economic theory of monetary supremacy\n:\nBernanke also said then that the Fed could not solve the economy’s problems alone.\n“If the fiscal cliff isn’t addressed, as I’ve said, I don’t think our tools are strong enough to offset the effects of a major fiscal shock, so we’d have to think about what to do in that contingency,” he said at a news conference last Thursday following a meeting of Fed policymakers. “It’s really important for the fiscal policymakers to, you know, work together to try and find a solution for that.”\nTranslation: We’ve been trying for four years to fix this thing and it isn’t working.  QE3 is just another band-aid that can’t even staunch the bleeding anymore, forget healing the wound.  We need you guys to step up to the plate and spend, spend, spend in order to buy us more time to pick up hard assets before the final collapse.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-20T12:00:00+00:00"
}