{
  "url": "https://voxday.net/2012/09/06/the-immoral-mind-of-marc-hauser/",
  "scraped_at": "2025-12-14T05:02:52.492787",
  "title": "The immoral mind of Marc Hauser",
  "date_display": "September 6, 2012",
  "date_iso": "2012-09-06T20:00:00+00:00",
  "date_from_url": "2012-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a serious blow to the “morality evolved” crowd when one of its chief proponents, Harvard’s Marc Hauser, has been found to have engaged <a href=\"http://www.boston.com/whitecoatnotes/2012/09/05/harvard-professor-who-resigned-fabricated-manipulated-data-says/UvCmT8yCcmydpDoEkIRhGP/story.html\">in scientific misconduct</a> in attempting to find evidence to support his theories of moral evolution:</p><blockquote><p>Marc Hauser, a prolific scientist and popular psychology professor who last summer resigned from Harvard University, had fabricated data, manipulated results in multiple experiments, and described how studies were conducted in factually incorrect ways, according to the findings of a federal research oversight agency posted online Wednesday.</p><p>The report provides the greatest insight yet into the problems that triggered a three-year internal university investigation that concluded in 2010 that Hauser, a star professor and public intellectual, had committed eight instances of scientific misconduct. The document, which will be published in the Federal Register Thursday, found six cases in which Hauser engaged in research misconduct in work supported by the National Institutes of Health. One paper was retracted and two were corrected, and other problems were found in unpublished work.</p><p>Although Hauser “neither admits nor denies committing research misconduct,” he does, the report states, accept that federal authorities “found evidence of research misconduct.”</p><p>According to the federal findings:</p><p>-Hauser fabricated data in a 2002 Cognition paper that was later retracted, which examined monkeys’ ability to learn patterns of syllables. He never exposed monkeys to a particular sound pattern described in the experiment, despite reporting the results in a graph.</p><p>-In two experiments, researchers measured monkeys’ responses to patterns of consonants and vowels, a process called “coding” their behavior. Hauser falsified the coding, causing the results to pass a statistical test used to ensure that a particular finding was not just a chance result. Colleagues coding the same experiments came up with different results. Hauser “acknowledged to his collaborators that he miscoded some of the trials and that the study failed to provide support for the initial hypothesis,” the report said.</p><p>-A paper examining monkeys’ abilities to learn grammatical patterns included false descriptions of how the monkeys’ behavior was coded, “leading to a false proportion or number of animals showing a favorable response,” the findings stated. In an early version of the paper, he falsely reported that all 16 monkeys responded more strongly to an ungrammatical pattern than a grammatical one. Records reviewed by investigators found that one monkey responded in the opposite way and another responded equally. Hauser claimed that the behavior was coded by three scientists, when in fact he was the only one who measured their behavior. Then, when the manuscript was revised, he provided a false numerical description of the extent of agreement among multiple observers in coding behavior, despite being the only observer. All issues were corrected before publication.</p></blockquote><p>I’ve read Hauser’s <i>Moral Minds</i> twice, and while it is head-and-shoulders above the likes of Dawkins and Harris, I did not find his arguments particularly compelling, for the most part, not that I wasn’t above citing them in my incomplete debate with Dominic.</p></div>",
  "content_text": "It’s a serious blow to the “morality evolved” crowd when one of its chief proponents, Harvard’s Marc Hauser, has been found to have engaged\nin scientific misconduct\nin attempting to find evidence to support his theories of moral evolution:\nMarc Hauser, a prolific scientist and popular psychology professor who last summer resigned from Harvard University, had fabricated data, manipulated results in multiple experiments, and described how studies were conducted in factually incorrect ways, according to the findings of a federal research oversight agency posted online Wednesday.\nThe report provides the greatest insight yet into the problems that triggered a three-year internal university investigation that concluded in 2010 that Hauser, a star professor and public intellectual, had committed eight instances of scientific misconduct. The document, which will be published in the Federal Register Thursday, found six cases in which Hauser engaged in research misconduct in work supported by the National Institutes of Health. One paper was retracted and two were corrected, and other problems were found in unpublished work.\nAlthough Hauser “neither admits nor denies committing research misconduct,” he does, the report states, accept that federal authorities “found evidence of research misconduct.”\nAccording to the federal findings:\n-Hauser fabricated data in a 2002 Cognition paper that was later retracted, which examined monkeys’ ability to learn patterns of syllables. He never exposed monkeys to a particular sound pattern described in the experiment, despite reporting the results in a graph.\n-In two experiments, researchers measured monkeys’ responses to patterns of consonants and vowels, a process called “coding” their behavior. Hauser falsified the coding, causing the results to pass a statistical test used to ensure that a particular finding was not just a chance result. Colleagues coding the same experiments came up with different results. Hauser “acknowledged to his collaborators that he miscoded some of the trials and that the study failed to provide support for the initial hypothesis,” the report said.\n-A paper examining monkeys’ abilities to learn grammatical patterns included false descriptions of how the monkeys’ behavior was coded, “leading to a false proportion or number of animals showing a favorable response,” the findings stated. In an early version of the paper, he falsely reported that all 16 monkeys responded more strongly to an ungrammatical pattern than a grammatical one. Records reviewed by investigators found that one monkey responded in the opposite way and another responded equally. Hauser claimed that the behavior was coded by three scientists, when in fact he was the only one who measured their behavior. Then, when the manuscript was revised, he provided a false numerical description of the extent of agreement among multiple observers in coding behavior, despite being the only observer. All issues were corrected before publication.\nI’ve read Hauser’s\nMoral Minds\ntwice, and while it is head-and-shoulders above the likes of Dawkins and Harris, I did not find his arguments particularly compelling, for the most part, not that I wasn’t above citing them in my incomplete debate with Dominic.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-06T19:00:00+00:00"
}