{
  "url": "https://voxday.net/2012/09/26/the-need-to-restrict-drone-use/",
  "scraped_at": "2025-12-14T05:04:10.156357",
  "title": "The need to restrict drone use",
  "date_display": "September 26, 2012",
  "date_iso": "2012-09-26T10:31:00+00:00",
  "date_from_url": "2012-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those <a href=\"http://www.nytimes.com/roomfordebate/2012/09/25/do-drone-attacks-do-more-harm-than-good/?hp\">discussing the use of killer drones</a>, both pro and con, at the New York Times somehow managed to completely fail to consider the two most problematic aspects of their use:</p><blockquote class=\"tr_bq\"><p> One point in favor of drone strikes is that they are weakening Al<br> Qaeda, the Taliban and affiliated groups, and hence protecting lives,<br> American and other.</br></br></p><p>Also, there don’t seem to be better means of doing<br> so.</br></p><p>Points against drone strikes are the cost in civilian lives, the<br> alienation of parts of the Islamic world, potential harm to the<br> authority of international law, and the possibility that drone use will<br> spread around the world, generating more conflict and harming long-term<br> U.S. interests.</br></br></br></br></p><p>These are all valid points, and I respect that reasonable people<br> could be convinced by either set. My own reasoning turns on four<br> arguments.</br></br></p><ol><li>First, states have a primary responsibility for the protection of<br> their own citizens.  If drone strikes are the best way to remove an<br> all-too-real threat to American lives, then that is an especially<br> weighty consideration.</br></br></br></li><li>Second, I doubt that ending drone strikes would substantially reduce<br> anti-Americanism in the Islamic world or put a dent in radical<br> recruitment.</br></br></li><li>Third, the U.S can do a lot to moderate some harms caused by its use<br> of drones.  By being clearer about what it’s doing and offering detailed<br> legal justification, the U.S. could mitigate damage to international<br> law and the threat of uncontrolled proliferation.</br></br></br></li><li>Finally, there is evidence that drone strikes are less harmful to<br> civilians than other means of reaching Al Qaeda and affiliates in<br> remote, lawless regions (for example, large-scale military operations).</br></br></li></ol></blockquote><p>There are two serious problems with the use of drones overseas, both of which outweigh their potential benefits.  First, it has successfully established a precedent for <a href=\"http://articles.latimes.com/2011/dec/10/nation/la-na-drone-arrest-20111211\">using them domestically</a> for routine law enforcement.  Second, and more problematic, the administration has foolishly granted a comprehensive justification for the use of drones by foreign forces against Americans on American soil.  When foreign militaries acquire access to drones, <a href=\"http://www.huffingtonpost.com/2012/09/24/iran-new-drone_n_1910738.html\">and they will</a>, the US will find little sympathy from other nations when the equivalent of Hellfire missiles begin raining down on New York and California.</p><p>And the threat of disproportionate response won’t necessarily be a convincing deterrent, because clever attackers will be careful to disguise who is piloting the drone.  An Iranian drone might actually belong to China.  A Chinese drone might actually be utilized by American rebels… or by China making it look like American rebels.  The widespread use of drones is a very foolish move on the part of the U.S. Commander-in-Chief and can be safely expected to result in some serious blowback.</p></div>",
  "content_text": "Those\ndiscussing the use of killer drones\n, both pro and con, at the New York Times somehow managed to completely fail to consider the two most problematic aspects of their use:\nOne point in favor of drone strikes is that they are weakening Al\nQaeda, the Taliban and affiliated groups, and hence protecting lives,\nAmerican and other.\nAlso, there don’t seem to be better means of doing\nso.\nPoints against drone strikes are the cost in civilian lives, the\nalienation of parts of the Islamic world, potential harm to the\nauthority of international law, and the possibility that drone use will\nspread around the world, generating more conflict and harming long-term\nU.S. interests.\nThese are all valid points, and I respect that reasonable people\ncould be convinced by either set. My own reasoning turns on four\narguments.\nFirst, states have a primary responsibility for the protection of\ntheir own citizens.  If drone strikes are the best way to remove an\nall-too-real threat to American lives, then that is an especially\nweighty consideration.\nSecond, I doubt that ending drone strikes would substantially reduce\nanti-Americanism in the Islamic world or put a dent in radical\nrecruitment.\nThird, the U.S can do a lot to moderate some harms caused by its use\nof drones.  By being clearer about what it’s doing and offering detailed\nlegal justification, the U.S. could mitigate damage to international\nlaw and the threat of uncontrolled proliferation.\nFinally, there is evidence that drone strikes are less harmful to\ncivilians than other means of reaching Al Qaeda and affiliates in\nremote, lawless regions (for example, large-scale military operations).\nThere are two serious problems with the use of drones overseas, both of which outweigh their potential benefits.  First, it has successfully established a precedent for\nusing them domestically\nfor routine law enforcement.  Second, and more problematic, the administration has foolishly granted a comprehensive justification for the use of drones by foreign forces against Americans on American soil.  When foreign militaries acquire access to drones,\nand they will\n, the US will find little sympathy from other nations when the equivalent of Hellfire missiles begin raining down on New York and California.\nAnd the threat of disproportionate response won’t necessarily be a convincing deterrent, because clever attackers will be careful to disguise who is piloting the drone.  An Iranian drone might actually belong to China.  A Chinese drone might actually be utilized by American rebels… or by China making it look like American rebels.  The widespread use of drones is a very foolish move on the part of the U.S. Commander-in-Chief and can be safely expected to result in some serious blowback.",
  "tags": [
    "technology",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-26T09:31:00+00:00"
}