{
  "url": "https://voxday.net/2012/09/22/trends-and-media/",
  "scraped_at": "2025-12-14T05:03:51.839846",
  "title": "Trends and the media polls",
  "date_display": "September 22, 2012",
  "date_iso": "2012-09-22T15:00:00+00:00",
  "date_from_url": "2012-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Gallup Election Polls</b></p><p>09/5-11/2012<br> Obama 50%<br> Romney 43%</br></br></p><p>09/14-20/2012<br> Obama 47%<br> Romney 47%</br></br></p><p>I’m still trying to figure out how folks like Karl Denninger are interpreting a 7-point swing towards Romney as proof that Obama has the election <a href=\"http://market-ticker.org/akcs-www?post=211812\">all but sewn up</a>.  Especially when Rasmussen shows a similar 46%-46% result.<br> I understand the Electoral College and why some prefer the state-by-state analyses.  But the fact remains that Rasmussen nailed the 2008 popular vote while Nate Silver asserted “Obama’s Convention Bounce May Not Be Receding” on the very day that Gallup reported this seven-point move away from him.<br> Either way, it is useful to recall that in polls as in stocks, past performance does not guarantee future results.</br></br></p></div>",
  "content_text": "Gallup Election Polls\n09/5-11/2012\nObama 50%\nRomney 43%\n09/14-20/2012\nObama 47%\nRomney 47%\nI’m still trying to figure out how folks like Karl Denninger are interpreting a 7-point swing towards Romney as proof that Obama has the election\nall but sewn up\n.  Especially when Rasmussen shows a similar 46%-46% result.\nI understand the Electoral College and why some prefer the state-by-state analyses.  But the fact remains that Rasmussen nailed the 2008 popular vote while Nate Silver asserted “Obama’s Convention Bounce May Not Be Receding” on the very day that Gallup reported this seven-point move away from him.\nEither way, it is useful to recall that in polls as in stocks, past performance does not guarantee future results.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-22T14:00:00+00:00"
}