{
  "url": "https://voxday.net/2012/09/24/wnd-column_24-2/",
  "scraped_at": "2025-12-14T05:03:57.335796",
  "title": "WND column",
  "date_display": "September 24, 2012",
  "date_iso": "2012-09-24T07:40:00+00:00",
  "date_from_url": "2012-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/2012/09/foreigners-first/\"><b>Foreigners First</b></a></p><p><em>Paul had been filibustering the Senate for days, delaying action<br> by requiring the maximum amount of time be spent on each vote until he<br> got a vote on his own bill, which failed, 10-81.  Numerous Republican<br> senators stood up in opposition to Paul’s bill, calling it dangerous and<br> irresponsible, especially to Israel.</br></br></br></br></em><br> <em> </em><br> <br> Keep in mind that this vote took place 11 days after the U.S.<br> ambassador to Libya, J. Christopher Stevens, was murdered along with<br> three other U.S. diplomats in Libya. The federal government is sending<br> money that it doesn’t have to declared and undeclared enemies alike, to<br> countries that Barack Obama has openly declared are not U.S. allies,<br> while simultaneously refusing to re-enact the Bush tax cuts because the<br> country supposedly cannot afford them.</br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Foreigners First\nPaul had been filibustering the Senate for days, delaying action\nby requiring the maximum amount of time be spent on each vote until he\ngot a vote on his own bill, which failed, 10-81.  Numerous Republican\nsenators stood up in opposition to Paul’s bill, calling it dangerous and\nirresponsible, especially to Israel.\nKeep in mind that this vote took place 11 days after the U.S.\nambassador to Libya, J. Christopher Stevens, was murdered along with\nthree other U.S. diplomats in Libya. The federal government is sending\nmoney that it doesn’t have to declared and undeclared enemies alike, to\ncountries that Barack Obama has openly declared are not U.S. allies,\nwhile simultaneously refusing to re-enact the Bush tax cuts because the\ncountry supposedly cannot afford them.",
  "tags": [
    "politics",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-24T06:40:00+00:00"
}