{
  "url": "https://voxday.net/2012/09/27/youd-better-sit-down-for-this-one/",
  "scraped_at": "2025-12-14T05:04:21.106937",
  "title": "You’d better sit down for this one",
  "date_display": "September 27, 2012",
  "date_iso": "2012-09-27T18:05:00+00:00",
  "date_from_url": "2012-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m certain we’re all just absolutely shocked by <a href=\"http://market-ticker.org/akcs-www?post=212062\">this revelation</a>:</p><blockquote class=\"tr_bq\"><p> U.S. intelligence officials knew within 24 hours of the<br> assault on the U.S. Consulate in Libya that it was a terrorist attack<br> and suspected Al Qaeda-tied elements were involved, sources told Fox<br> News — though it took the administration a week to acknowledge it.  The<br> account sharply conflicts with claims on the Sunday after the attack by<br> U.S. Ambassador to the United Nations Susan Rice that the<br> administration believed the strike was a “spontaneous” event triggered<br> by protests in Egypt over an anti-Islam film.</br></br></br></br></br></br></br></p></blockquote><p> It’s always so hard to see innocence shattered.  So much for the feared rage of Jihad Boy.  Sure, we all knew that Obama and his handlers were liars, but the remarkable thing is how bad at it they are.  Mitt Romney, now, there is a politician who can tell perfectly credible lies without blinking, insofar as he can resist contradicting himself.</p></div>",
  "content_text": "I’m certain we’re all just absolutely shocked by\nthis revelation\n:\nU.S. intelligence officials knew within 24 hours of the\nassault on the U.S. Consulate in Libya that it was a terrorist attack\nand suspected Al Qaeda-tied elements were involved, sources told Fox\nNews — though it took the administration a week to acknowledge it.  The\naccount sharply conflicts with claims on the Sunday after the attack by\nU.S. Ambassador to the United Nations Susan Rice that the\nadministration believed the strike was a “spontaneous” event triggered\nby protests in Egypt over an anti-Islam film.\nIt’s always so hard to see innocence shattered.  So much for the feared rage of Jihad Boy.  Sure, we all knew that Obama and his handlers were liars, but the remarkable thing is how bad at it they are.  Mitt Romney, now, there is a politician who can tell perfectly credible lies without blinking, insofar as he can resist contradicting himself.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-09-27T17:05:00+00:00"
}