{
  "url": "https://voxday.net/2007/07/03/dealing-with-female-violence/",
  "scraped_at": "2026-01-08T21:46:50.353842",
  "title": "Dealing with female violence",
  "date_display": "July 3, 2007",
  "date_iso": "2007-07-03T15:11:00+00:00",
  "date_from_url": "2007-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Helen has stirred up a bit of a discussion with her post on the discovery that women are <a href=\"http://drhelen.blogspot.com/2007/07/comments-on-domestic-violence.html\">twice as likely to be physically abusive</a> as men.  I didn’t bother commenting on it the first time, since this is completely obvious to anyone who has ever been around men and women.  While I’ve never hit a woman first outside of the dojo, I’ve been slapped, hit, bitten or otherwise attacked ten or twelve times that I can remember off the top of my head – no, not by Spacebunny and seldom by anyone I was dating – and I’ve only physically retaliated twice.  Once by blocking a second slap in such a way as to break the wrist, once with a hard backhand that sent the woman flying and left her half-unconscious.</p><p>The problem is that these days there is a presumption of male responsibility for any physical conflict, regardless of who initiated it.  I remember Warren Moon getting arrested for shoving his wife after she nearly crushed his skull by throwing a thirty-pound statue at his head.  Like Mrs. Moon, it’s insane.</p><p>While I think turning the other cheek is the right thing to do outside of a relationship, I think it is disastrous within a relationship.  Given what I’ve seen of the relationships where the woman is physically abusive, (I was going to say physically and verbally abusive, but that would be redundant, all physically abusive women are verbally abusive as well), I think it’s much better to teach consequences by striking back hard than to put up with that sort of lunacy.  If a women realizes that the threat of the police won’t get them out of a justified ass-kicking, she’s very unlikely to initiate violence.</p><p>And if the woman wants to call the police, so be it.  The relationship is over.  Count your blessings.  A few days in jail is vastly preferable to a life sentence with an abusive woman.</p><p>Start nothing.  Finish everything.</p></div>",
  "content_text": "Dr. Helen has stirred up a bit of a discussion with her post on the discovery that women are\ntwice as likely to be physically abusive\nas men.  I didn’t bother commenting on it the first time, since this is completely obvious to anyone who has ever been around men and women.  While I’ve never hit a woman first outside of the dojo, I’ve been slapped, hit, bitten or otherwise attacked ten or twelve times that I can remember off the top of my head – no, not by Spacebunny and seldom by anyone I was dating – and I’ve only physically retaliated twice.  Once by blocking a second slap in such a way as to break the wrist, once with a hard backhand that sent the woman flying and left her half-unconscious.\nThe problem is that these days there is a presumption of male responsibility for any physical conflict, regardless of who initiated it.  I remember Warren Moon getting arrested for shoving his wife after she nearly crushed his skull by throwing a thirty-pound statue at his head.  Like Mrs. Moon, it’s insane.\nWhile I think turning the other cheek is the right thing to do outside of a relationship, I think it is disastrous within a relationship.  Given what I’ve seen of the relationships where the woman is physically abusive, (I was going to say physically and verbally abusive, but that would be redundant, all physically abusive women are verbally abusive as well), I think it’s much better to teach consequences by striking back hard than to put up with that sort of lunacy.  If a women realizes that the threat of the police won’t get them out of a justified ass-kicking, she’s very unlikely to initiate violence.\nAnd if the woman wants to call the police, so be it.  The relationship is over.  Count your blessings.  A few days in jail is vastly preferable to a life sentence with an abusive woman.\nStart nothing.  Finish everything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-03T14:11:00+00:00"
}