{
  "url": "https://voxday.net/2007/07/03/ding-dong-bush-is-dead/",
  "scraped_at": "2026-01-08T21:46:48.499458",
  "title": "Ding-dong, the Bush is dead",
  "date_display": "July 3, 2007",
  "date_iso": "2007-07-03T11:08:00+00:00",
  "date_from_url": "2007-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Which old Bush?  The Wicked Bush.  Even Mr. Regression to the Mean admits that Bush is reduced to <a href=\"http://www.nypost.com/php/pfriendly/print.php?url=http://www.nypost.com/seven/06292007/postopinion/opedcolumnists/dubyas_end_opedcolumnists_john_podhoretz.htm\">lurching about like a drunken camel with cataracts</a>:</p><blockquote><p>On those previous occasions when President Bush was saved from his own counterproductive impulses by a revolt within his own party, his defeat was actually a benefit to him. The Miers withdrawal led to the brilliant appointment of Samuel Alito to the Supreme Court. And an American company now owns and manages American ports.</p><p>But the parlous decision to revive the dead immigration bill and fight for it, only to see it go down to defeat again, was an act of political suicide from which this White House will not recover. On the domestic side, Bush will now only govern until the end of his term in an entirely defensive manner – through the veto and not by being a party to the passage of legislation.</p><p>In his first term, Bush had been a party leader and vote-getter so gifted that he single-handedly improved the GOP’s standing in the House and Senate in two successive elections and received 21 percent more votes in his re-election bid than he had in his maiden effort.</p><p>The failure to secure victory in Iraq is the key to understanding the administration’s second-term woes, but that isn’t the whole story. Something got broken on Election Night 2004.</p></blockquote><p>The problem with this otherwise good news is that the only thing that could possibly salvage his presidential legacy now is another 9/11-style event that would whip the populace into enough of a frenzy to support an attack on Iran.  Of course, thanks to the release of the CIA’s Family Jewels and <s>Operation Northwoods</s>related historical events, we know that the smallest supposition of the mere notion of the idea couldn’t possibly even think of crossing the president’s mind.</p><p>If we’re fortunate, the worst he’ll do is focus on continuing to sell out American sovereignty to Mexico.</p></div>",
  "content_text": "Which old Bush?  The Wicked Bush.  Even Mr. Regression to the Mean admits that Bush is reduced to\nlurching about like a drunken camel with cataracts\n:\nOn those previous occasions when President Bush was saved from his own counterproductive impulses by a revolt within his own party, his defeat was actually a benefit to him. The Miers withdrawal led to the brilliant appointment of Samuel Alito to the Supreme Court. And an American company now owns and manages American ports.\nBut the parlous decision to revive the dead immigration bill and fight for it, only to see it go down to defeat again, was an act of political suicide from which this White House will not recover. On the domestic side, Bush will now only govern until the end of his term in an entirely defensive manner – through the veto and not by being a party to the passage of legislation.\nIn his first term, Bush had been a party leader and vote-getter so gifted that he single-handedly improved the GOP’s standing in the House and Senate in two successive elections and received 21 percent more votes in his re-election bid than he had in his maiden effort.\nThe failure to secure victory in Iraq is the key to understanding the administration’s second-term woes, but that isn’t the whole story. Something got broken on Election Night 2004.\nThe problem with this otherwise good news is that the only thing that could possibly salvage his presidential legacy now is another 9/11-style event that would whip the populace into enough of a frenzy to support an attack on Iran.  Of course, thanks to the release of the CIA’s Family Jewels and\nOperation Northwoods\nrelated historical events, we know that the smallest supposition of the mere notion of the idea couldn’t possibly even think of crossing the president’s mind.\nIf we’re fortunate, the worst he’ll do is focus on continuing to sell out American sovereignty to Mexico.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-03T10:08:00+00:00"
}