{
  "url": "https://voxday.net/2007/07/14/do-you-even-read-here/",
  "scraped_at": "2026-01-08T21:48:20.432767",
  "title": "Do you even read here?",
  "date_display": "July 14, 2007",
  "date_iso": "2007-07-14T16:31:00+00:00",
  "date_from_url": "2007-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bob obviously <a href=\"http://rawdc.wordpress.com/2007/07/13/consequences-of-changing-ideology/\">hasn’t been paying attention</a>:</p><blockquote><p>And this is why Vox Day can’t be honest about his beliefs concerning the conflict between evolution and the Bible. He can say he’s an evolution skeptic, because people are willing to put up with a certain amount of cognitive dissonance, but if he was consistent and said he was also skeptical about the truth of the Bible, which teaches that there wasn’t death before the creation of man, it would adversely affect how his core audience viewed him.</p></blockquote><p>Right, I’m so concerned about how my core audience views me and I stick so closely to conventional Christian interpretation of the Bible that I had to INVENT A WORD just to clarify my point criticizing a belief that many of them hold.  I’m not at all skeptical about the truth of the Bible, neither do I consider it to be word-for-word the inerrant and literal Divine Word of God.</p><p>I speak three languages, more or less, and have studied a fourth.  I therefore am more aware than most of the dangers inherent in translation; Umberto Eco’s book <em>Mouse or Rat</em> is a very entertaining and illuminating look at them.  For example, Italian has one word where English has three, hence the need for all the gesticulating and repeating everything three times so that the listener can identify your meaning by triangulation.  Even a simple praise song will often have a slight contextual variation that only someone reasonably comfortable in both languages is likely to detect.</p><p>Being translated from other languages, the English Bible is obviously an imperfect translation, just as the original manuscripts Man’s imperfect translations of the literal Word of God.  And yet, none of that matters.  Being human, fallen and seeing through a glass darkly, we are incapable of distinguishing between that which has perfectly translated from divine to mortal and that which has been imperfectly translated.  Thus, minor errors in translation and petty inconsistencies don’t concern me in the slightest, for I see the Bible’s divine inspiration in the way that its words, however flawed we might perceive them to be, are still wiser than the best that humanity alone can devise with the benefit of two millenia to its advantage.</p><p>I don’t merely believe in the truth of the Bible, I believe in its metatruth.</p></div>",
  "content_text": "Bob obviously\nhasn’t been paying attention\n:\nAnd this is why Vox Day can’t be honest about his beliefs concerning the conflict between evolution and the Bible. He can say he’s an evolution skeptic, because people are willing to put up with a certain amount of cognitive dissonance, but if he was consistent and said he was also skeptical about the truth of the Bible, which teaches that there wasn’t death before the creation of man, it would adversely affect how his core audience viewed him.\nRight, I’m so concerned about how my core audience views me and I stick so closely to conventional Christian interpretation of the Bible that I had to INVENT A WORD just to clarify my point criticizing a belief that many of them hold.  I’m not at all skeptical about the truth of the Bible, neither do I consider it to be word-for-word the inerrant and literal Divine Word of God.\nI speak three languages, more or less, and have studied a fourth.  I therefore am more aware than most of the dangers inherent in translation; Umberto Eco’s book\nMouse or Rat\nis a very entertaining and illuminating look at them.  For example, Italian has one word where English has three, hence the need for all the gesticulating and repeating everything three times so that the listener can identify your meaning by triangulation.  Even a simple praise song will often have a slight contextual variation that only someone reasonably comfortable in both languages is likely to detect.\nBeing translated from other languages, the English Bible is obviously an imperfect translation, just as the original manuscripts Man’s imperfect translations of the literal Word of God.  And yet, none of that matters.  Being human, fallen and seeing through a glass darkly, we are incapable of distinguishing between that which has perfectly translated from divine to mortal and that which has been imperfectly translated.  Thus, minor errors in translation and petty inconsistencies don’t concern me in the slightest, for I see the Bible’s divine inspiration in the way that its words, however flawed we might perceive them to be, are still wiser than the best that humanity alone can devise with the benefit of two millenia to its advantage.\nI don’t merely believe in the truth of the Bible, I believe in its metatruth.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-14T15:31:00+00:00"
}