{
  "url": "https://voxday.net/2007/07/10/evolution-is-easy/",
  "scraped_at": "2026-01-08T21:47:47.343774",
  "title": "Evolution is easy",
  "date_display": "July 10, 2007",
  "date_iso": "2007-07-10T13:04:00+00:00",
  "date_from_url": "2007-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Everyone is getting into the act these days, <a href=\"http://www.fredoneverything.net/BananaBoobs.shtml\">even psychologists</a>!</p><blockquote><p>“Blue-eyed people,” they write, “are considered attractive as potential mates because it is easiest to determine whether they are interested in us or not.”</p><p>Or, as the authors explain, men like blue eyes because, since eyes dilate when the owner is interested in something, in this case getting laid, and since blue eyes better show a large pupil, then men will know when the woman is interested. This produces more children.</p><p>Ponder the solemn fatuity of this. Does any reader over the age of thirteen believe that women with any sort of eyes have trouble letting a man know when they are interested? The authors need to get out more.</p><p>Why is this sort of story-telling so widely engaged in when an alert porcupine would reject it? Because it is PC. As a fellow I see on the internet said in another context, “This is a stretch and illustrates how easy it is to believe what fits your world view.” Yep. The authors would find an evolutionary explanation for a loose doorknob.</p><p>To be fair, the greater reproductive success of the blue-eyed does explain why they predominate around the planet, with the exception of small population pools such as China, Africa, the Arab world, Southern Europe, Japan, India, Mexico, Pakistan, Afghanistan, and South and Central America. It’s because men in all those dark-eyed, under-populated places can’t tell when women are interested.</p></blockquote><p>Being a scientist, I feel it is no less than my scientific duty to contribute to the evolutionary canon, so as a service to the human race I shall lay my humble offering before the shrine of St. Darwin: how Natural Selection explains why men voluntarily select bitchy women as mates.</p><p>Heritable psychological variation is the “raw material” of human evolution by natural selection, and understanding the mechanisms that generate such variation has become a fundamental challenge for contemporary evolutionary biology.  A male human faces an inescapable reproductive dilemma, in that he seeks to spread his genes as widely as possible, an evolutionary pressure which is countered by the fact that an overly aggressive man risks a higher probability of being injured or diseased, thus resulting in a hindered ability to mate.  However, a wholly passive man faces the high probability of falling under the influence of his mate and being prevented from going out to find other potential mates, thereby limiting his gene-spreading.</p><p>The STD-PW dilemma has, through Natural Selection, resulted in the evolutionary stable strategy (ESS) of passive men selecting for bitchy women, with whom they mate and spread their genes before prolonged exposure to the bitch results in the application of one of two variant strategies.  Either the male cannot take the female’s bitching anymore and leaves under its pressure, (the proto-passive strategy) or she is enough of a bitch to forcibly drive him away / leave of her own volition (the passive strategy).</p><p>Either strategy results in freeing the passive man to pursue subsequent mates and further spread his genes without any need for the aggression that would force him to risk reproductive-hindering injury and disease.  Examining the oscillations about the equilibrium point, we find the average payoff to an individual male  in a stable population consisting of 11/12 passive men and 7/12 complete bitches to be 42.</p><p>So, if you have ever wondered why that nice guy is paired up with a total bitch, now you know.  He is merely pursuing the evolutionarily optimal strategy to ensure that his own passivity does not hinder the widest possible transmission of his genes.  If you should wish to nominate your humble scientific servant for the John Maynard Smith prize for this outstanding research in the field of evolutionary biology, <a href=\"http://www.eseb.org/index.html?http://www.eseb.org/jmsprize.htm\">instructions are here</a>.</p><p><em>Seriously, you’re going to bring this weak quasi-game theory shit and try to play it off as science on a game designer?  One trained as an economist, no less?  Don’t play a player.</em></p></div>",
  "content_text": "Everyone is getting into the act these days,\neven psychologists\n!\n“Blue-eyed people,” they write, “are considered attractive as potential mates because it is easiest to determine whether they are interested in us or not.”\nOr, as the authors explain, men like blue eyes because, since eyes dilate when the owner is interested in something, in this case getting laid, and since blue eyes better show a large pupil, then men will know when the woman is interested. This produces more children.\nPonder the solemn fatuity of this. Does any reader over the age of thirteen believe that women with any sort of eyes have trouble letting a man know when they are interested? The authors need to get out more.\nWhy is this sort of story-telling so widely engaged in when an alert porcupine would reject it? Because it is PC. As a fellow I see on the internet said in another context, “This is a stretch and illustrates how easy it is to believe what fits your world view.” Yep. The authors would find an evolutionary explanation for a loose doorknob.\nTo be fair, the greater reproductive success of the blue-eyed does explain why they predominate around the planet, with the exception of small population pools such as China, Africa, the Arab world, Southern Europe, Japan, India, Mexico, Pakistan, Afghanistan, and South and Central America. It’s because men in all those dark-eyed, under-populated places can’t tell when women are interested.\nBeing a scientist, I feel it is no less than my scientific duty to contribute to the evolutionary canon, so as a service to the human race I shall lay my humble offering before the shrine of St. Darwin: how Natural Selection explains why men voluntarily select bitchy women as mates.\nHeritable psychological variation is the “raw material” of human evolution by natural selection, and understanding the mechanisms that generate such variation has become a fundamental challenge for contemporary evolutionary biology.  A male human faces an inescapable reproductive dilemma, in that he seeks to spread his genes as widely as possible, an evolutionary pressure which is countered by the fact that an overly aggressive man risks a higher probability of being injured or diseased, thus resulting in a hindered ability to mate.  However, a wholly passive man faces the high probability of falling under the influence of his mate and being prevented from going out to find other potential mates, thereby limiting his gene-spreading.\nThe STD-PW dilemma has, through Natural Selection, resulted in the evolutionary stable strategy (ESS) of passive men selecting for bitchy women, with whom they mate and spread their genes before prolonged exposure to the bitch results in the application of one of two variant strategies.  Either the male cannot take the female’s bitching anymore and leaves under its pressure, (the proto-passive strategy) or she is enough of a bitch to forcibly drive him away / leave of her own volition (the passive strategy).\nEither strategy results in freeing the passive man to pursue subsequent mates and further spread his genes without any need for the aggression that would force him to risk reproductive-hindering injury and disease.  Examining the oscillations about the equilibrium point, we find the average payoff to an individual male  in a stable population consisting of 11/12 passive men and 7/12 complete bitches to be 42.\nSo, if you have ever wondered why that nice guy is paired up with a total bitch, now you know.  He is merely pursuing the evolutionarily optimal strategy to ensure that his own passivity does not hinder the widest possible transmission of his genes.  If you should wish to nominate your humble scientific servant for the John Maynard Smith prize for this outstanding research in the field of evolutionary biology,\ninstructions are here\n.\nSeriously, you’re going to bring this weak quasi-game theory shit and try to play it off as science on a game designer?  One trained as an economist, no less?  Don’t play a player.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-10T12:04:00+00:00"
}