{
  "url": "https://voxday.net/2007/07/11/gut-feeling-or-memo/",
  "scraped_at": "2026-01-08T21:47:54.780663",
  "title": "Gut feeling or memo?",
  "date_display": "July 11, 2007",
  "date_iso": "2007-07-11T14:39:00+00:00",
  "date_from_url": "2007-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think that’s what <a href=\"http://apnews.myway.com/article/20070711/D8QA8TN01.html\">everyone would like to know.</a> You’d think that the administration couldn’t possibly be stupid enough to even think about running a false flag operation to try to whip the American people into a hysterical frenzy for a war with Iran, especially after the recent reports that Entebbe was just such an operation, but you never know:</p><blockquote><p>U.S. counterterror officials are warning of an increased risk of an attack this summer, given al-Qaida’s apparent interest in summertime strikes and increased al-Qaida training in the Afghan-Pakistani border region.</p><p>On Tuesday, Homeland Security Secretary Michael Chertoff told the editorial board of The Chicago Tribune that he had a “gut feeling” about a new period of increased risk.  He based his assessment on earlier patterns of terrorists in Europe and intelligence he would not disclose.</p></blockquote><p>The problem is that the nature of the previous attacks in Britain is far too small to get Americans worked up for a third invasion of the Middle East.  Even looking the other way while a few terrorists crash their car into a shopping mall isn’t going to do the trick.  So, it leaves the administration with the choice of doing nothing, doing something without any mass support, or trying to generate that support somehow.</p><p>I suspect they’ll choose the first option, if nothing else because far too many people are more than ready to leap on anything that will give them a chance to impeach Bush.</p></div>",
  "content_text": "I think that’s what\neveryone would like to know.\nYou’d think that the administration couldn’t possibly be stupid enough to even think about running a false flag operation to try to whip the American people into a hysterical frenzy for a war with Iran, especially after the recent reports that Entebbe was just such an operation, but you never know:\nU.S. counterterror officials are warning of an increased risk of an attack this summer, given al-Qaida’s apparent interest in summertime strikes and increased al-Qaida training in the Afghan-Pakistani border region.\nOn Tuesday, Homeland Security Secretary Michael Chertoff told the editorial board of The Chicago Tribune that he had a “gut feeling” about a new period of increased risk.  He based his assessment on earlier patterns of terrorists in Europe and intelligence he would not disclose.\nThe problem is that the nature of the previous attacks in Britain is far too small to get Americans worked up for a third invasion of the Middle East.  Even looking the other way while a few terrorists crash their car into a shopping mall isn’t going to do the trick.  So, it leaves the administration with the choice of doing nothing, doing something without any mass support, or trying to generate that support somehow.\nI suspect they’ll choose the first option, if nothing else because far too many people are more than ready to leap on anything that will give them a chance to impeach Bush.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-11T13:39:00+00:00"
}