{
  "url": "https://voxday.net/2007/07/30/mailvox-sheer-heresy/",
  "scraped_at": "2026-01-08T21:49:45.007004",
  "title": "Mailvox: sheer heresy",
  "date_display": "July 30, 2007",
  "date_iso": "2007-07-30T07:38:00+00:00",
  "date_from_url": "2007-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB manages to simultaneously flatter and outrage me:</p><blockquote><p>I’ve just finished The Dark is Rising and congratulations, your Herne is far superior to its carnival float. DiR was enjoyable but too quickly the Dark became more howling plot device than credible threat to the narrative’s linear macguffin quest. And plot holes – how ’bout a “Beware red-haired riders” for the omniscient-at-convenience 11 year old, or a shotgun for the Walker? If I was the ancient, malevolently intelligent Dark, I would not put all nine of the winter candles needed to complete the sign of fire to work freezing a single houseful of my enemies. The simplistic occultism reminded me of that dreadful Masonic opera where the couple passes through elemental peril at the end to become virtuous wizard royalty, Die Zauberflöte. On and on, point being, is this really required reading?</p><p>Marcus Aurelius has lost quite a bit of steam, though bits can be gleaned. Wodehouse is excellent.</p><p>Your books never suck as badly as RA Salvatore’s, who stops being good after the single-titled Drizzt trilogy, something like Sojourn, Exile, and Skewer. His dumbass Dactyl Demon is less threatening than DiR’s nonlethal (we follow rules!) Dark tornado.</p><p>The difference between you and him is that you have saved the best wine for last, indicating steady improvement. I was disappointed after backtracking from the final book in your fantasy trilogy to find things becoming simpler and less inspiring. If I endure inane female dialog, I expect more tits than the alluded wet t-shirt in Excalibur’s puddle.</p><p>Loved the Jonathan stuff, except ending too abrupt. More of that. Ending not abrupt enough in Moonraker-whatever. Maybe you could rewrite it so the Moonies blow the food launchers and the South American prick poignantly throttled while the masses starve.</p><p>The Ghengis wizard story stands out for its tremendous sense of place, politics, lack of plot holes, presence of gory violence, and realistically restrained magic. Plus hot, clueless hand me down concubines….</p><p>Ah yes, the med school student vs. demons kicked ass. Demons gotta have plenty of capacity for damage so you can enjoy their suffering. That’s one problem with your trilogy, deaths for nasties are too clean. Give us some slapping meat and rended torsos, not sterile flame bursts. The savagery of mushroom throne torture was much appreciated, lending unsqueamish gravity lacking in DiR.</p></blockquote><p>If I may point out a few errors, the Jonathan stuff does not end abruptly because it does not have an ending, it’s merely the first four chapters of the first novel in a trilogy entitled <em>The Chronicles of King David</em>.  I was briefly represented by the top CBA literary agency, which couldn’t manage to find me the sort of book deal that I’ve found myself on ten occasions now, needless to say, we’ve gone our separate ways.  But there is a very famous political figure who loved the CoKD sample and emailed me to that effect last year.</p><p>As for The Dark is Rising, I will hear no talk of plot holes or linear macguffins, they are great CHILDREN’S literature and my affection for the books remains undiminished by such unseemly mutterings.  While I can abide with complete equanimity any amount of criticism of my own scribblings, I will brook none of Susan Cooper’s masterpiece.</p><p>I have read Salvatore’s dark elf trilogy; it was a favorite of Big Chilly’s back in the day, but I remain unimpressed.  He’s not even the best AD&amp;D-related writer, I much prefer the Dragonlance Chronicles.</p><p>It is interesting to consider which writers get better as time goes on and which tend to decline.  I don’t think even my worst enemy would deny that my fiction has gotten better – although they might point out there was nowhere to go but up – but Rowlings, Hamilton, Salvatore, King, Clancy and many other writers are all putting out books that are distinctly worse than the books that first made them successful.</p><p>I sometimes wonder if writers should not attempt to develop, since it seems much of this bad writing is caused by the desire to add depth.  I had to put down a book by Simon Green the other day because the protagonist couldn’t blow his nose without reflecting upon the significance of his action and remembering a time when blowing his nose had cost an innocent young girl her life and how that thoughtless act had haunted him ever since.</p><p>In fact, as far as the SF/F genre goes, I would argue that we need less character development, more plot, more cool ideas and better action.  Most genre writers, being irreligious, aren’t capable of much competent character development because they have no understanding of the thought processes or motivations of 90 percent of the human population, but they could write perfectly entertaining stories if they didn’t get bogged down in something that is completely over their head.</p></div>",
  "content_text": "JB manages to simultaneously flatter and outrage me:\nI’ve just finished The Dark is Rising and congratulations, your Herne is far superior to its carnival float. DiR was enjoyable but too quickly the Dark became more howling plot device than credible threat to the narrative’s linear macguffin quest. And plot holes – how ’bout a “Beware red-haired riders” for the omniscient-at-convenience 11 year old, or a shotgun for the Walker? If I was the ancient, malevolently intelligent Dark, I would not put all nine of the winter candles needed to complete the sign of fire to work freezing a single houseful of my enemies. The simplistic occultism reminded me of that dreadful Masonic opera where the couple passes through elemental peril at the end to become virtuous wizard royalty, Die Zauberflöte. On and on, point being, is this really required reading?\nMarcus Aurelius has lost quite a bit of steam, though bits can be gleaned. Wodehouse is excellent.\nYour books never suck as badly as RA Salvatore’s, who stops being good after the single-titled Drizzt trilogy, something like Sojourn, Exile, and Skewer. His dumbass Dactyl Demon is less threatening than DiR’s nonlethal (we follow rules!) Dark tornado.\nThe difference between you and him is that you have saved the best wine for last, indicating steady improvement. I was disappointed after backtracking from the final book in your fantasy trilogy to find things becoming simpler and less inspiring. If I endure inane female dialog, I expect more tits than the alluded wet t-shirt in Excalibur’s puddle.\nLoved the Jonathan stuff, except ending too abrupt. More of that. Ending not abrupt enough in Moonraker-whatever. Maybe you could rewrite it so the Moonies blow the food launchers and the South American prick poignantly throttled while the masses starve.\nThe Ghengis wizard story stands out for its tremendous sense of place, politics, lack of plot holes, presence of gory violence, and realistically restrained magic. Plus hot, clueless hand me down concubines….\nAh yes, the med school student vs. demons kicked ass. Demons gotta have plenty of capacity for damage so you can enjoy their suffering. That’s one problem with your trilogy, deaths for nasties are too clean. Give us some slapping meat and rended torsos, not sterile flame bursts. The savagery of mushroom throne torture was much appreciated, lending unsqueamish gravity lacking in DiR.\nIf I may point out a few errors, the Jonathan stuff does not end abruptly because it does not have an ending, it’s merely the first four chapters of the first novel in a trilogy entitled\nThe Chronicles of King David\n.  I was briefly represented by the top CBA literary agency, which couldn’t manage to find me the sort of book deal that I’ve found myself on ten occasions now, needless to say, we’ve gone our separate ways.  But there is a very famous political figure who loved the CoKD sample and emailed me to that effect last year.\nAs for The Dark is Rising, I will hear no talk of plot holes or linear macguffins, they are great CHILDREN’S literature and my affection for the books remains undiminished by such unseemly mutterings.  While I can abide with complete equanimity any amount of criticism of my own scribblings, I will brook none of Susan Cooper’s masterpiece.\nI have read Salvatore’s dark elf trilogy; it was a favorite of Big Chilly’s back in the day, but I remain unimpressed.  He’s not even the best AD&D-related writer, I much prefer the Dragonlance Chronicles.\nIt is interesting to consider which writers get better as time goes on and which tend to decline.  I don’t think even my worst enemy would deny that my fiction has gotten better – although they might point out there was nowhere to go but up – but Rowlings, Hamilton, Salvatore, King, Clancy and many other writers are all putting out books that are distinctly worse than the books that first made them successful.\nI sometimes wonder if writers should not attempt to develop, since it seems much of this bad writing is caused by the desire to add depth.  I had to put down a book by Simon Green the other day because the protagonist couldn’t blow his nose without reflecting upon the significance of his action and remembering a time when blowing his nose had cost an innocent young girl her life and how that thoughtless act had haunted him ever since.\nIn fact, as far as the SF/F genre goes, I would argue that we need less character development, more plot, more cool ideas and better action.  Most genre writers, being irreligious, aren’t capable of much competent character development because they have no understanding of the thought processes or motivations of 90 percent of the human population, but they could write perfectly entertaining stories if they didn’t get bogged down in something that is completely over their head.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-30T06:38:00+00:00"
}