{
  "url": "https://voxday.net/2007/07/05/mailvox-this-is-amusing/",
  "scraped_at": "2026-01-08T21:47:06.825033",
  "title": "Mailvox: of dirt and Dawkins",
  "date_display": "July 5, 2007",
  "date_iso": "2007-07-05T13:00:00+00:00",
  "date_from_url": "2007-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People are so entirely predictable.  An email came in two days ago from Carol Smith in response to this week’s column on how Dawkins and Gore are prostituting science to sell humanism and global socialism, respectively:</p><blockquote><p>While Richard Dawkins makes the distinction between science and politics very clear, at least to me, apparently that has escaped your notice, even though you quote his very words to that effect.  It is unfortunate that you are unable to state your position without representing that of others.</p></blockquote><p>I wrote back: <em>You are incorrect, Carol.  Have you read “The God Delusion”?  I can only presume you have not.  It is a book concerning how we should conduct human affairs, therefore Dawkins has no standing, the book is fundamentally misleading and Dawkins is using his reputation to prostitute science.</em></p><p>Prompting this reply:</p><blockquote><p>I have read The God Delusion. I have it here, and plan to have Dr. Dawkins sign it in September. Many scientists write on political and social issues. They do not forfeit that right by virtue of their being scientists. You would apparently deny that right.</p></blockquote><p>I wrote back: <em>I wouldn’t deny him the right to write about anything he likes.  But he shouldn’t expect to do so without criticism, which he doesn’t take at all well.  The point is, Dawkins has literally no idea what he is talking about outside of his area of scientific expertise.  For example, ask him what percentage of the 1,763 wars in recorded history were caused by religion.  Or, ask him if Christianity is falsifiable.  Or if a network monitoring program MUST be bigger than the network it monitors.  These are easy, basic questions directly related to the subject of his book and he gets them all wrong.</em></p><p>Also, he is a complete moron to put any stock in Sam Harris.  For example, go to page 229 of “The God Delusion”.  25 cities, right.  WHAT INTEGER CAN YOU DIVIDE 25 BY TO GET 62 PERCENT?  15 of 25 cities is 60 percent.  16 is 64 percent.</p><p>Sweet Darwin, they call themselves scientists and they can’t even catch a basic error in division.</p><p>No response, of course… as apparently Ms Smith was too busy running around <a href=\"http://whatastrangeplanet.blogspot.com/2007/07/christianvsatheist-club-who-is-vox-day.html\">trying to dig up some dirt</a>.  Dig up all you like, Carol, believe me, there’s truckloads, but none of it is going to make Dawkins any less wrong.  I suggest that you worry more <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364\">about this</a>.</p></div>",
  "content_text": "People are so entirely predictable.  An email came in two days ago from Carol Smith in response to this week’s column on how Dawkins and Gore are prostituting science to sell humanism and global socialism, respectively:\nWhile Richard Dawkins makes the distinction between science and politics very clear, at least to me, apparently that has escaped your notice, even though you quote his very words to that effect.  It is unfortunate that you are unable to state your position without representing that of others.\nI wrote back:\nYou are incorrect, Carol.  Have you read “The God Delusion”?  I can only presume you have not.  It is a book concerning how we should conduct human affairs, therefore Dawkins has no standing, the book is fundamentally misleading and Dawkins is using his reputation to prostitute science.\nPrompting this reply:\nI have read The God Delusion. I have it here, and plan to have Dr. Dawkins sign it in September. Many scientists write on political and social issues. They do not forfeit that right by virtue of their being scientists. You would apparently deny that right.\nI wrote back:\nI wouldn’t deny him the right to write about anything he likes.  But he shouldn’t expect to do so without criticism, which he doesn’t take at all well.  The point is, Dawkins has literally no idea what he is talking about outside of his area of scientific expertise.  For example, ask him what percentage of the 1,763 wars in recorded history were caused by religion.  Or, ask him if Christianity is falsifiable.  Or if a network monitoring program MUST be bigger than the network it monitors.  These are easy, basic questions directly related to the subject of his book and he gets them all wrong.\nAlso, he is a complete moron to put any stock in Sam Harris.  For example, go to page 229 of “The God Delusion”.  25 cities, right.  WHAT INTEGER CAN YOU DIVIDE 25 BY TO GET 62 PERCENT?  15 of 25 cities is 60 percent.  16 is 64 percent.\nSweet Darwin, they call themselves scientists and they can’t even catch a basic error in division.\nNo response, of course… as apparently Ms Smith was too busy running around\ntrying to dig up some dirt\n.  Dig up all you like, Carol, believe me, there’s truckloads, but none of it is going to make Dawkins any less wrong.  I suggest that you worry more\nabout this\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-05T12:00:00+00:00"
}