{
  "url": "https://voxday.net/2007/07/17/never-her-fau-2/",
  "scraped_at": "2026-01-08T21:48:33.329505",
  "title": "Never her fault",
  "date_display": "July 17, 2007",
  "date_iso": "2007-07-17T09:25:00+00:00",
  "date_from_url": "2007-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not the fact that totally self-centered women do totally self-centered things that stuns me, there’s no shortage of totall self-centered men doing exactly the same thing.  What seems to be different is that many of these women appear to be in total denial about <a href=\"http://www.telegraph.co.uk/portal/main.jhtml?xml=/portal/2007/07/03/nosplit/ftlifeclass103.xml\">their responsibility for their actions</a>.  This woman left her husband and her son, and is blaming her ex-husband for the fact that her son wants nothing to do with her… even though their daughter now prefers to live with him too:</p><blockquote><p>You left your son for another man, too – and deprived him of his sister – and that would make the hurt of rejection even harder to bear….  I find it amazing that you think it is your husband’s reaction to this desertion that has turned your son against you. You left him and took his sister. You rejected him. You didn’t find him worth mending your marriage for. You left without a backward glance. That’s enough. His feelings are personal to him. He doesn’t need a father to tell him that things are bad.</p></blockquote><p>I also find it interesting how many children of divorce that grew up with mothers who chose to end their marriages end up establishing good relationships with their fathers and cutting off relations with their mothers.  Kids aren’t stupid and it doesn’t matter how many lies they are told, eventually they will figure out who is really the bad guy.</p></div>",
  "content_text": "It’s not the fact that totally self-centered women do totally self-centered things that stuns me, there’s no shortage of totall self-centered men doing exactly the same thing.  What seems to be different is that many of these women appear to be in total denial about\ntheir responsibility for their actions\n.  This woman left her husband and her son, and is blaming her ex-husband for the fact that her son wants nothing to do with her… even though their daughter now prefers to live with him too:\nYou left your son for another man, too – and deprived him of his sister – and that would make the hurt of rejection even harder to bear….  I find it amazing that you think it is your husband’s reaction to this desertion that has turned your son against you. You left him and took his sister. You rejected him. You didn’t find him worth mending your marriage for. You left without a backward glance. That’s enough. His feelings are personal to him. He doesn’t need a father to tell him that things are bad.\nI also find it interesting how many children of divorce that grew up with mothers who chose to end their marriages end up establishing good relationships with their fathers and cutting off relations with their mothers.  Kids aren’t stupid and it doesn’t matter how many lies they are told, eventually they will figure out who is really the bad guy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-17T08:25:00+00:00"
}