{
  "url": "https://voxday.net/2007/07/26/randal-potter-and-deathly-bore/",
  "scraped_at": "2026-01-08T21:49:21.007860",
  "title": "Rand’al Potter and the Deathly Bores",
  "date_display": "July 26, 2007",
  "date_iso": "2007-07-26T11:59:00+00:00",
  "date_from_url": "2007-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I haven’t finished the ultimate Harry Potter novel yet, so I can’t write a full review.  However, I’m not sure I will manage to slog my way through it, as thus far, it’s even worse than the previous book in the series, which hitherto marked the low point.  Sure, it the trek through Mordor got a bit tedious, but here, even the action is a yawn.  Point-yell-miss… point-yell-stun!  Red shirt dies, oh the horror!</p><p>Harry is becoming more and more like Rand’al Thor of the execrable Wheel of Time series; apparently fantasy authors believe that constantly agonizing over every sliver suffered by an individual dedicated to the cause is the height of character development.  Rowlings’s plotting is even less competent than usual and if the Death Eaters weren’t the unmitigated bastard, occultic love children of the National Socialists and Chang Hsien-chung, I’d be rooting for Lord Voldemort.</p><p>There’s no reason for Christians to be upset about Harry Potter.  There’s no more magic in the “magic” than there is a literal god in the <em>deus ex machina</em>.  I finally had to put the book down in disgust when Hermione wracked her brain to think of what spell could possible free a woman from her chains, then pointed her wand and shouted “release”.  I mean, given that schooling in magic is the background for the book series, it’s remarkable that the magic system is so utterly retarded.</p><p>Perhaps it gets better in the second half.  I’m not sure I will last it out long enough to find out.  It’s a very bad sign for a book when you find yourself unconsciously picking up a formulaic <em>libro giallo</em> in preference to finishing what you’ve started.  Needless to say, I’m not feeling terribly inclined to revisit my prediction that it will not be long before Harry Potter will no longer be regarded in the same league as Narnia, The Dark is Rising, A Wrinkle in Time and Watership Down, assuming that it is now.</p></div>",
  "content_text": "I haven’t finished the ultimate Harry Potter novel yet, so I can’t write a full review.  However, I’m not sure I will manage to slog my way through it, as thus far, it’s even worse than the previous book in the series, which hitherto marked the low point.  Sure, it the trek through Mordor got a bit tedious, but here, even the action is a yawn.  Point-yell-miss… point-yell-stun!  Red shirt dies, oh the horror!\nHarry is becoming more and more like Rand’al Thor of the execrable Wheel of Time series; apparently fantasy authors believe that constantly agonizing over every sliver suffered by an individual dedicated to the cause is the height of character development.  Rowlings’s plotting is even less competent than usual and if the Death Eaters weren’t the unmitigated bastard, occultic love children of the National Socialists and Chang Hsien-chung, I’d be rooting for Lord Voldemort.\nThere’s no reason for Christians to be upset about Harry Potter.  There’s no more magic in the “magic” than there is a literal god in the\ndeus ex machina\n.  I finally had to put the book down in disgust when Hermione wracked her brain to think of what spell could possible free a woman from her chains, then pointed her wand and shouted “release”.  I mean, given that schooling in magic is the background for the book series, it’s remarkable that the magic system is so utterly retarded.\nPerhaps it gets better in the second half.  I’m not sure I will last it out long enough to find out.  It’s a very bad sign for a book when you find yourself unconsciously picking up a formulaic\nlibro giallo\nin preference to finishing what you’ve started.  Needless to say, I’m not feeling terribly inclined to revisit my prediction that it will not be long before Harry Potter will no longer be regarded in the same league as Narnia, The Dark is Rising, A Wrinkle in Time and Watership Down, assuming that it is now.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-26T10:59:00+00:00"
}