{
  "url": "https://voxday.net/2007/07/09/science-fetishists-are-retarded/",
  "scraped_at": "2026-01-08T21:47:42.219426",
  "title": "Mailvox: the brilliance of science",
  "date_display": "July 9, 2007",
  "date_iso": "2007-07-09T22:57:00+00:00",
  "date_from_url": "2007-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. PZ Myers makes a habit of claiming that creationists are liars.  I can’t speak for his claims about others, since I’ve never heard of most of them except via Pharyngula, but I do note with some amusement that a guy who openly advocates AVOIDING PUBLIC DEBATE should <a href=\"http://scienceblogs.com/pharyngula/2007/07/if_our_influence_is_measured_b.php#more\">call me a coward… and dishonest</a> for the crime of NOT QUOTING HIS ENTIRE POST HERE but merely quoting part of it and then linking directly to it.</p><p>The funniest thing about that is that most of his post isn’t all there on the front page of his blog either, you have to CLICK ON A LINK to read the rest of it.  Just like you did from my blog, the one difference being that you could initially read more of it on my blog than you could on his.  Yes, taxpayers, you are actually paying this razor-sharp mind to teach your children about Richard Dawkins and his magical flower fairies, or original replicators, whatever.</p><p>Apparently Ed Darrell is using the good doctor as his role model, as he accuses me of using a fictitious quote from Julian Huxley in my column this morning:</p><blockquote><p>Vox quotes it in his article from last night/this morning.  So, in other words, VD spreads the hoaxes with abandon.  They don’t have editors at WND? No fact checkers?  This is why a “debate” is fruitless; trying to debate someone who thinks this alleged quote from Julian Huxley is accurate in its context, or relevant, is a waste of time.</p></blockquote><p>What quote from Julian Huxley?  This one:</p><p><em>“We all jumped at the Origin of the Species because…the idea of God interfered with our sexual mores.”</em></p><p>Ed then adds an additional charge:</p><blockquote><p>Your claim that economists and physicists debate laymen is as specious as your claims against evolution.</p></blockquote><p>Now, <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=56564\">here is the column in question</a>.  If you do find either a quote from Julian Huxley or a claim that economists and physicists debate laymen, do let me know, as I should be very interested to learn that we have apparently discovered that elusive passageway to the universe next door.  There may be a Nobel Prize in it for Mr. Darrell.</p><p>You know, faced with prodiguous intellectual performances like these, it’s really a mystery why we don’t all stop thinking for ourselves and simply accept their desperate assertions that “there is no God!” and “evolution is fact, fact, fact!”</p></div>",
  "content_text": "Dr. PZ Myers makes a habit of claiming that creationists are liars.  I can’t speak for his claims about others, since I’ve never heard of most of them except via Pharyngula, but I do note with some amusement that a guy who openly advocates AVOIDING PUBLIC DEBATE should\ncall me a coward… and dishonest\nfor the crime of NOT QUOTING HIS ENTIRE POST HERE but merely quoting part of it and then linking directly to it.\nThe funniest thing about that is that most of his post isn’t all there on the front page of his blog either, you have to CLICK ON A LINK to read the rest of it.  Just like you did from my blog, the one difference being that you could initially read more of it on my blog than you could on his.  Yes, taxpayers, you are actually paying this razor-sharp mind to teach your children about Richard Dawkins and his magical flower fairies, or original replicators, whatever.\nApparently Ed Darrell is using the good doctor as his role model, as he accuses me of using a fictitious quote from Julian Huxley in my column this morning:\nVox quotes it in his article from last night/this morning.  So, in other words, VD spreads the hoaxes with abandon.  They don’t have editors at WND? No fact checkers?  This is why a “debate” is fruitless; trying to debate someone who thinks this alleged quote from Julian Huxley is accurate in its context, or relevant, is a waste of time.\nWhat quote from Julian Huxley?  This one:\n“We all jumped at the Origin of the Species because…the idea of God interfered with our sexual mores.”\nEd then adds an additional charge:\nYour claim that economists and physicists debate laymen is as specious as your claims against evolution.\nNow,\nhere is the column in question\n.  If you do find either a quote from Julian Huxley or a claim that economists and physicists debate laymen, do let me know, as I should be very interested to learn that we have apparently discovered that elusive passageway to the universe next door.  There may be a Nobel Prize in it for Mr. Darrell.\nYou know, faced with prodiguous intellectual performances like these, it’s really a mystery why we don’t all stop thinking for ourselves and simply accept their desperate assertions that “there is no God!” and “evolution is fact, fact, fact!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-09T21:57:00+00:00"
}