{
  "url": "https://voxday.net/2007/07/20/stop-for-love-of-ralp/",
  "scraped_at": "2026-01-08T21:48:57.942161",
  "title": "Affirmative action at work",
  "date_display": "July 20, 2007",
  "date_iso": "2007-07-20T14:59:00+00:00",
  "date_from_url": "2007-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have the feeling that any day now, Ralph Wiley is going to rise from his grave and <a href=\"http://sports.espn.go.com/espn/page2/story?page=jackson/070719\">throttle Scoop Jackson for setting black sportswriters back</a> forty years:</p><blockquote><p>This is not about greatness as much as it’s about dominance. And how high school athletes in their respective sports have come to define dominance better than professionals have.</p><p>So if I made the statement again — high school athletes are more dominant in sports than professionals — would your reaction still be the same as it was when you first started reading this column?</p><p>Thought not. But at the end of the day, your reaction won’t matter; no one will care about this, because high school athletes will still be looked at in sports as less than equal. Their level of competition amongst themselves is not as great. Many will feel that they are not even deserving of being in this type of conversation, not worthy of this type of praise. Blasphemy, don’t forget.</p><p>Sad, ain’t it?</p></blockquote><p>Oh, excuse me, Scoop wasn’t talking about high schoolers compared to professionals, but women compared to men.  But it is really sad that Cynthia Cooper is not considered to have been more dominant than Michael Jordan, just as it is a travesty that I am not recognized as being more dominant than Pele, Ronaldo or Kaka’ on the basis of my incredible SIX-GOAL GAME against our archrivals in eighth grade.  Has any Brazilian international ever dominated Argentina like that?  I don’t think so.  And not even the <i>bianconeri</i> have ever dominated Serie A the way our team of 8 year-old boys tore up the tournaments two years ago.</p><p>As much as I utterly despise every single female writer for ESPN, I feel now that I may have been a bit too harsh on them.  Even Mary Bucklesbian’s weekly complaint about heterosexual thought-crimes is more related to sports on this planet than Affirmative Action Jackson’s latest lunacy.</p></div>",
  "content_text": "I have the feeling that any day now, Ralph Wiley is going to rise from his grave and\nthrottle Scoop Jackson for setting black sportswriters back\nforty years:\nThis is not about greatness as much as it’s about dominance. And how high school athletes in their respective sports have come to define dominance better than professionals have.\nSo if I made the statement again — high school athletes are more dominant in sports than professionals — would your reaction still be the same as it was when you first started reading this column?\nThought not. But at the end of the day, your reaction won’t matter; no one will care about this, because high school athletes will still be looked at in sports as less than equal. Their level of competition amongst themselves is not as great. Many will feel that they are not even deserving of being in this type of conversation, not worthy of this type of praise. Blasphemy, don’t forget.\nSad, ain’t it?\nOh, excuse me, Scoop wasn’t talking about high schoolers compared to professionals, but women compared to men.  But it is really sad that Cynthia Cooper is not considered to have been more dominant than Michael Jordan, just as it is a travesty that I am not recognized as being more dominant than Pele, Ronaldo or Kaka’ on the basis of my incredible SIX-GOAL GAME against our archrivals in eighth grade.  Has any Brazilian international ever dominated Argentina like that?  I don’t think so.  And not even the\nbianconeri\nhave ever dominated Serie A the way our team of 8 year-old boys tore up the tournaments two years ago.\nAs much as I utterly despise every single female writer for ESPN, I feel now that I may have been a bit too harsh on them.  Even Mary Bucklesbian’s weekly complaint about heterosexual thought-crimes is more related to sports on this planet than Affirmative Action Jackson’s latest lunacy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-20T13:59:00+00:00"
}