{
  "url": "https://voxday.net/2007/07/13/talk-origins-talk-fas/",
  "scraped_at": "2026-01-08T21:48:11.309605",
  "title": "Talk Origins, talk fast",
  "date_display": "July 13, 2007",
  "date_iso": "2007-07-13T04:48:00+00:00",
  "date_from_url": "2007-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This sort of thing is why simply directing people to the Talk Origins FAQ <a href=\"http://www.talkorigins.org/indexcc/CC/CC371_1.html\">may not be considered a conclusive citation</a>:</p><blockquote><p>The reports of the soft tissue, though remarkable, have been sensationalized further. The tissues were not soft and pliable originally. The tissues were rehydrated in the process of removing the surrounding mineral components of the bone (Schweitzer et al. 2005).</p><p>Moreover, it is unknown whether the soft tissues are original tissues. Fossil flexible tissues and nucleated cells have been found before in which the original material was not preserved (Stokstad 2005).</p><p>The age of fossils is not determined by how well they are preserved, because preservation depends far more on factors other than age. The age of this particular bone was determined from the age of the rocks it was found in, namely, the Hell Creek Formation. This formation has been reliably dated by several independent methods (Dalrymple 2000).</p><p>DNA has never been recovered from any dinosaurs nor from anything as old as them, and researchers do not expect to find DNA from these soft tissues (though they can still hope). DNA has been recovered, however, from samples much more than 10,000 years old (Poinar et al. 1998), even more than 300,000 years old (Stokstad 2003; Willerslev et al. 2003). If dinosaur fossils were as young as creationists claim, finding soft tissues in them would not be news, and recovering DNA from them should be easy enough that it would have been done by now.</p></blockquote><p>From the Washington Post: <em>“We have a laboratory where we do cellular and molecular paleontology, so we do cut into bones,” Horner acknowledged. Still, he added, the discovery of what appeared to be soft tissues in the matrix of the fossilized femur was “serendipitous” because the team broke the femur simply because it would not otherwise fit in the helicopter….</em></p><p>He suggested that <a href=\"http://www.washingtonpost.com/wp-dyn/articles/A63318-2005Mar24.html\">other researchers would find more soft tissues</a> if they overcome their reluctance to cut up their exhibits.</p><p>“Oh, that’s right, for sure,” said Ohio University’s Witmer. “Until now, we never thought we could find something like this, so we never looked. A big part of research is not only knowing what to look for, but also knowing it’s there.”</p><p>As I’ve said before, I’m merely an evolutionary skeptic, not a Young Earth Creationist.  But I have to say, the more I read on the pro-evolution side, the weaker their case looks.  I mean, economists know that they don’t understand everything about how the economy works, even though we have a pretty good understanding of certain processes.  We have no problem admitting some of the things that we don’t know… but I’ve never read more weasel phrases like “may be caused” and “might explain” and “could be attributed to” than in my recent perusal of various evolutionary papers.</p><p>Perhaps PZ is right and many of the ID and Creationist standard bearers are liars.  I don’t know, I’ve  read very little that isn’t on the pro-evolution side.  But it’s apparent that despite what seems to be the scientific consensus, the evolutionary case, as it currently appears to be explained, may contain logical holes that could be large enough to drive what might be considered a truck through.</p></div>",
  "content_text": "This sort of thing is why simply directing people to the Talk Origins FAQ\nmay not be considered a conclusive citation\n:\nThe reports of the soft tissue, though remarkable, have been sensationalized further. The tissues were not soft and pliable originally. The tissues were rehydrated in the process of removing the surrounding mineral components of the bone (Schweitzer et al. 2005).\nMoreover, it is unknown whether the soft tissues are original tissues. Fossil flexible tissues and nucleated cells have been found before in which the original material was not preserved (Stokstad 2005).\nThe age of fossils is not determined by how well they are preserved, because preservation depends far more on factors other than age. The age of this particular bone was determined from the age of the rocks it was found in, namely, the Hell Creek Formation. This formation has been reliably dated by several independent methods (Dalrymple 2000).\nDNA has never been recovered from any dinosaurs nor from anything as old as them, and researchers do not expect to find DNA from these soft tissues (though they can still hope). DNA has been recovered, however, from samples much more than 10,000 years old (Poinar et al. 1998), even more than 300,000 years old (Stokstad 2003; Willerslev et al. 2003). If dinosaur fossils were as young as creationists claim, finding soft tissues in them would not be news, and recovering DNA from them should be easy enough that it would have been done by now.\nFrom the Washington Post:\n“We have a laboratory where we do cellular and molecular paleontology, so we do cut into bones,” Horner acknowledged. Still, he added, the discovery of what appeared to be soft tissues in the matrix of the fossilized femur was “serendipitous” because the team broke the femur simply because it would not otherwise fit in the helicopter….\nHe suggested that\nother researchers would find more soft tissues\nif they overcome their reluctance to cut up their exhibits.\n“Oh, that’s right, for sure,” said Ohio University’s Witmer. “Until now, we never thought we could find something like this, so we never looked. A big part of research is not only knowing what to look for, but also knowing it’s there.”\nAs I’ve said before, I’m merely an evolutionary skeptic, not a Young Earth Creationist.  But I have to say, the more I read on the pro-evolution side, the weaker their case looks.  I mean, economists know that they don’t understand everything about how the economy works, even though we have a pretty good understanding of certain processes.  We have no problem admitting some of the things that we don’t know… but I’ve never read more weasel phrases like “may be caused” and “might explain” and “could be attributed to” than in my recent perusal of various evolutionary papers.\nPerhaps PZ is right and many of the ID and Creationist standard bearers are liars.  I don’t know, I’ve  read very little that isn’t on the pro-evolution side.  But it’s apparent that despite what seems to be the scientific consensus, the evolutionary case, as it currently appears to be explained, may contain logical holes that could be large enough to drive what might be considered a truck through.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-13T03:48:00+00:00"
}