{
  "url": "https://voxday.net/2007/07/15/thinking-unthinkable/",
  "scraped_at": "2026-01-08T21:48:22.323694",
  "title": "Thinking the unthinkable",
  "date_display": "July 15, 2007",
  "date_iso": "2007-07-15T15:03:00+00:00",
  "date_from_url": "2007-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bane and numerous others find it <a href=\"http://patdollard.com/2007/07/14/ron-paul-assclown/\">impossible to believe</a> that the current administration is capable of doing what its predecessors did:</p><blockquote><p>Republican presidential candidate, Rep. Ron Paul, said the country is in “great danger” of the U.S. government staging a terrorist attack or a Gulf of Tonkin style provocation, as the war in Iraq continues to deteriorate.</p><p>The Texas congressman offered no specifics nor mentioned President Bush by name, but he clearly insinuated that the administration would not be above staging an incident to revive flagging support.</p></blockquote><p>Read the comments.  They’re like frightened cattle mooing because the meat-packing factory for which they are headed made an unexpected noise that scared them silly, but they don’t offer any evidence or even any logic in defense of their position that it is absolutely impossible for the U.S. government to stage a false flag event in order to drum up support for its foreign policy.</p><p>Never mind the fact that false flags are known to have been staged during the McKinley, Wilson, Roosevelt and Johnson administrations, proposed during the Kennedy administration and <a href=\"http://www.channel4.com/news/articles/politics/the%20white%20house%20memo/161410\">openly discussed by Bush </a>during his first term in office.</p><p>By the way, the link shows how Bush also let the cat out of the bag about the illegitimacy of the US war on Iraq: <em>“The US was thinking of flying U2 reconnaissance aircraft with fighter cover over Iraq, painted in UN colours. If Saddam fired on them, he would be in breach.”</em></p><p>In other words, firing on US planes was never a breach of the peace treaty because there was no treaty between Iraq and the USA, the only treaty was between Iraq and the United Nations.</p></div>",
  "content_text": "Bane and numerous others find it\nimpossible to believe\nthat the current administration is capable of doing what its predecessors did:\nRepublican presidential candidate, Rep. Ron Paul, said the country is in “great danger” of the U.S. government staging a terrorist attack or a Gulf of Tonkin style provocation, as the war in Iraq continues to deteriorate.\nThe Texas congressman offered no specifics nor mentioned President Bush by name, but he clearly insinuated that the administration would not be above staging an incident to revive flagging support.\nRead the comments.  They’re like frightened cattle mooing because the meat-packing factory for which they are headed made an unexpected noise that scared them silly, but they don’t offer any evidence or even any logic in defense of their position that it is absolutely impossible for the U.S. government to stage a false flag event in order to drum up support for its foreign policy.\nNever mind the fact that false flags are known to have been staged during the McKinley, Wilson, Roosevelt and Johnson administrations, proposed during the Kennedy administration and\nopenly discussed by Bush\nduring his first term in office.\nBy the way, the link shows how Bush also let the cat out of the bag about the illegitimacy of the US war on Iraq:\n“The US was thinking of flying U2 reconnaissance aircraft with fighter cover over Iraq, painted in UN colours. If Saddam fired on them, he would be in breach.”\nIn other words, firing on US planes was never a breach of the peace treaty because there was no treaty between Iraq and the USA, the only treaty was between Iraq and the United Nations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-15T14:03:00+00:00"
}