{
  "url": "https://voxday.net/2007/07/16/university-comics/",
  "scraped_at": "2026-01-08T21:48:27.792645",
  "title": "University comics",
  "date_display": "July 16, 2007",
  "date_iso": "2007-07-16T17:57:00+00:00",
  "date_from_url": "2007-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred is amazed, <a href=\"http://www.fredoneverything.net/Kaplan.shtml\">but not surprised</a>:</p><blockquote><p>Comic books. We’re now using comic books to prepare kids for….</p><p>Guess: First grade, you’re thinking, right? Not a bad idea, really. Give kindergarteners Little Lulu comics, maybe Casper the Friendly Ghost, and they’ll be reading by first grade. Good idea. In fact, any number of kids invented this approach on their own. They learned to read, and there wasn’t a damned thing the schools could do about it.</p><p>But no, that’s not it. We’re using comic books to prepare high-school graduates for universities! So help me. Honest.</p></blockquote><p>This is amusing, but the more cogent point that parents must understand is this: <em>Universities are about tuition. The money of the barely sentient spends as well as any other, and there are more of them. Like all businesses, the schools, if such they are, want to expand their customer base. They want to spread the wondrous radiance of cultivation over the autistic, the anencephalic, and perhaps the dead, who might be taught by channeling.</em></p><p>There is no reason to mindlessly buy into the idea that all education is good.  It isn’t.  So, the important thing is to investigate whether the product is worth the price tag, just like any other purchase you consider.</p></div>",
  "content_text": "Fred is amazed,\nbut not surprised\n:\nComic books. We’re now using comic books to prepare kids for….\nGuess: First grade, you’re thinking, right? Not a bad idea, really. Give kindergarteners Little Lulu comics, maybe Casper the Friendly Ghost, and they’ll be reading by first grade. Good idea. In fact, any number of kids invented this approach on their own. They learned to read, and there wasn’t a damned thing the schools could do about it.\nBut no, that’s not it. We’re using comic books to prepare high-school graduates for universities! So help me. Honest.\nThis is amusing, but the more cogent point that parents must understand is this:\nUniversities are about tuition. The money of the barely sentient spends as well as any other, and there are more of them. Like all businesses, the schools, if such they are, want to expand their customer base. They want to spread the wondrous radiance of cultivation over the autistic, the anencephalic, and perhaps the dead, who might be taught by channeling.\nThere is no reason to mindlessly buy into the idea that all education is good.  It isn’t.  So, the important thing is to investigate whether the product is worth the price tag, just like any other purchase you consider.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-16T16:57:00+00:00"
}