{
  "url": "https://voxday.net/2007/07/17/what-else-is-new/",
  "scraped_at": "2026-01-08T21:48:35.141909",
  "title": "What else is new",
  "date_display": "July 17, 2007",
  "date_iso": "2007-07-17T14:53:00+00:00",
  "date_from_url": "2007-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it very annoying that people continue to listen to the idiot Three Monkey commentators despite the fact that they are wrong nearly every time they make a prediction.  You may recall that I was pointing out months ago that <a href=\"http://news.yahoo.com/s/ap/20070717/ap_on_el_pr/presidential_race_ap_poll_1\">none of the “major candidates” are even remotely electable</a>, if one defines electable as having a reasonable chance of winning the presidential election:</p><blockquote><p>The latest Associated Press-Ipsos poll found that nearly a quarter of Republicans are unwilling to back top-tier hopefuls Rudy Giuliani, Fred Thompson, John McCain or Mitt Romney, and no one candidate has emerged as the clear front-runner among Christian evangelicals.</p></blockquote><p>Probably because with the exception of McCain, whose campaign is all but over already, the other three are at least nominally pro-choice on abortion.  The Republican Party might as well roll the dice with Ron Paul, he’s the only one who has even a snowball’s chance of beating Hillary although once Bush goes after Iran, it’s all over.</p><p>Note that the poll appears to support my theory that Fred Thompson was nothing more than a human none-of-the-above vote back when he didn’t look like a probable candidate.  Once he’s in the ring, he’s just another moderate Republican weak on abortion, wrong on the war and questionable on immigration.</p></div>",
  "content_text": "I find it very annoying that people continue to listen to the idiot Three Monkey commentators despite the fact that they are wrong nearly every time they make a prediction.  You may recall that I was pointing out months ago that\nnone of the “major candidates” are even remotely electable\n, if one defines electable as having a reasonable chance of winning the presidential election:\nThe latest Associated Press-Ipsos poll found that nearly a quarter of Republicans are unwilling to back top-tier hopefuls Rudy Giuliani, Fred Thompson, John McCain or Mitt Romney, and no one candidate has emerged as the clear front-runner among Christian evangelicals.\nProbably because with the exception of McCain, whose campaign is all but over already, the other three are at least nominally pro-choice on abortion.  The Republican Party might as well roll the dice with Ron Paul, he’s the only one who has even a snowball’s chance of beating Hillary although once Bush goes after Iran, it’s all over.\nNote that the poll appears to support my theory that Fred Thompson was nothing more than a human none-of-the-above vote back when he didn’t look like a probable candidate.  Once he’s in the ring, he’s just another moderate Republican weak on abortion, wrong on the war and questionable on immigration.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-17T13:53:00+00:00"
}