{
  "url": "https://voxday.net/2007/07/07/why-scientists-are-afraid-to-debate/",
  "scraped_at": "2026-01-08T21:47:25.433477",
  "title": "Why scientists are afraid to debate",
  "date_display": "July 7, 2007",
  "date_iso": "2007-07-07T18:21:00+00:00",
  "date_from_url": "2007-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers quotes Charles Rulon to explain <a href=\"http://scienceblogs.com/pharyngula/2007/07/dont_debate_creationists.php#more\">why he’s not able to defend himself and his beliefs in public</a>:</p><blockquote><p>1. It pits oratory against science in a venue where you’ll be judged on your rhetoric.</p><p><em>Of course, if you actually know your stuff cold, it shouldn’t be a problem.  I have no fear of debating Austrian economic theory in front of socialists, or Open Theory in front of omniderigistes.  Of course, in the case of the latter I would begin by informing them that God has already decreed my imminent victory….</em></p><p>2.  It gives publicity to creationists.</p><p><em>Oh no!  You would think that allowing them to expose their stupidity, which we are told ad infinitum is just painfully obvious, would be something PZ and company would support.</em></p><p>3.  Creationists can generate more lies more quickly than you can refute.</p><p><em>Not if you know your subject well and are capable of articulating it properly.  Of course, if all your answers rely on claiming that no one can possibly understand what you’re saying without a PhD, you might as well recognize that you’re always going to lose in any venue.  In fact, why even talk, since no one can understand you anyhow?</em></p><p>4.Debates artificially give equal time to two sides, falsely elevating creationist trivia to equality with scientific substance.</p><p><em>Of course, debates in which only one side is allowed to talk isn’t really a debate now, is it?  Again, we see that the evolutionists simply can’t defend themselves, so they demand an unfair playing field.</em></p><p>5.  The debates are often used to recruit members to fundamentalist Christian organizations.</p><p><em>So what?  If you’re so convinced that you’re right, shouldn’t you take the opportunity to convince those fence-sitters of your own position?</em></p></blockquote><p>The biggest problem that academics have is that they are intellectual pussies, weakened by a lifetime of getting to stand and lecture in an evironment where everyone who can question them is afraid of upsetting them and receiving a bad grade.</p><p>I can count on one hand the number of college classes I had where I couldn’t make the professor stutter and go evasive by asking him a simple question about something he’d just said.  Most of them are complete intellectual frauds, capable of little more than regurgitating their holy textbooks.</p><p>Daniel Dennett has some harsh words for the likes of PZ and Rulon: <em>“We wouldn’t for one moment pay respectful attention to any scientist who retreated to “If you don’t understand my theory, it’s because you don’t have faith in it!” or “Only official members of my lab have the ability to detect these effects,” or “The contradiction you think you see in my arguments is simply a sign of the limitations of human comprehension….”  Any such declaration would be an intolerable abdication as a scientific investigator; <b>a confession of intellectual bankruptcy.</b>“</em></p></div>",
  "content_text": "PZ Myers quotes Charles Rulon to explain\nwhy he’s not able to defend himself and his beliefs in public\n:\n1. It pits oratory against science in a venue where you’ll be judged on your rhetoric.\nOf course, if you actually know your stuff cold, it shouldn’t be a problem.  I have no fear of debating Austrian economic theory in front of socialists, or Open Theory in front of omniderigistes.  Of course, in the case of the latter I would begin by informing them that God has already decreed my imminent victory….\n2.  It gives publicity to creationists.\nOh no!  You would think that allowing them to expose their stupidity, which we are told ad infinitum is just painfully obvious, would be something PZ and company would support.\n3.  Creationists can generate more lies more quickly than you can refute.\nNot if you know your subject well and are capable of articulating it properly.  Of course, if all your answers rely on claiming that no one can possibly understand what you’re saying without a PhD, you might as well recognize that you’re always going to lose in any venue.  In fact, why even talk, since no one can understand you anyhow?\n4.Debates artificially give equal time to two sides, falsely elevating creationist trivia to equality with scientific substance.\nOf course, debates in which only one side is allowed to talk isn’t really a debate now, is it?  Again, we see that the evolutionists simply can’t defend themselves, so they demand an unfair playing field.\n5.  The debates are often used to recruit members to fundamentalist Christian organizations.\nSo what?  If you’re so convinced that you’re right, shouldn’t you take the opportunity to convince those fence-sitters of your own position?\nThe biggest problem that academics have is that they are intellectual pussies, weakened by a lifetime of getting to stand and lecture in an evironment where everyone who can question them is afraid of upsetting them and receiving a bad grade.\nI can count on one hand the number of college classes I had where I couldn’t make the professor stutter and go evasive by asking him a simple question about something he’d just said.  Most of them are complete intellectual frauds, capable of little more than regurgitating their holy textbooks.\nDaniel Dennett has some harsh words for the likes of PZ and Rulon:\n“We wouldn’t for one moment pay respectful attention to any scientist who retreated to “If you don’t understand my theory, it’s because you don’t have faith in it!” or “Only official members of my lab have the ability to detect these effects,” or “The contradiction you think you see in my arguments is simply a sign of the limitations of human comprehension….”  Any such declaration would be an intolerable abdication as a scientific investigator;\na confession of intellectual bankruptcy.\n“",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-07-07T17:21:00+00:00"
}