{
  "url": "https://voxday.net/2009/10/05/24-days-ou/",
  "scraped_at": "2026-01-08T23:08:40.361056",
  "title": "24 days out",
  "date_display": "October 5, 2009",
  "date_iso": "2009-10-05T14:15:00+00:00",
  "date_from_url": "2009-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.voxday.net/images/RGDcover225.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.voxday.net/images/RGDcover225.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.voxday.net/images/RGDcover225.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>Here’s a bit more news about my forthcoming book.  First, I’m pleased to be able to say that the publisher has agreed to make <i>The Return of the Great Depression</i> available for only $1.99 on Kindle and Scribd.  Second, I sent pre-release galleys to a few writers and business executives with whom I am acquainted; you may recall that <a href=\"http://www.milobookclub.com/2009/09/29/new-book/\">the Mogambo Guru thought rather well of the book</a>.  Here’s what an executive at a large European industrial concern had to say about it.  I should probably mention that by “large”, I mean that its revenues would pass for national GDP in some parts of the world.</p><p><i>“The upward and downward excess we have been observing in the global economy for the last years suggested there was something wrong. It must be recognized that the system is addicted by false and questionable principles of monetary policy which finally brought many enterprises to unreliable business forecasts and disastrous, unsustainable capital expenditures.  This book is an analytic and courageous accusation against those principles, and suggests disruptive, clear-cut, and practical solutions which are quite far from those recently adopted by governments and central banks. I strongly recommend it as vademecum to any business executive.”</i></p><p>It was interesting how this executive found RGD to be useful in articulating the reasons behind what he was already observing in his professional capacity, which spans four continents.  The ominous synchronicity between book theory and business reality here is that two weekends ago, he told me that the moderate improvement his industry had seen since the spring appears to have been little more than inventory restocking, as the industry’s new orders are now looking worse than they were in January.</p></div>",
  "content_text": "Here’s a bit more news about my forthcoming book.  First, I’m pleased to be able to say that the publisher has agreed to make\nThe Return of the Great Depression\navailable for only $1.99 on Kindle and Scribd.  Second, I sent pre-release galleys to a few writers and business executives with whom I am acquainted; you may recall that\nthe Mogambo Guru thought rather well of the book\n.  Here’s what an executive at a large European industrial concern had to say about it.  I should probably mention that by “large”, I mean that its revenues would pass for national GDP in some parts of the world.\n“The upward and downward excess we have been observing in the global economy for the last years suggested there was something wrong. It must be recognized that the system is addicted by false and questionable principles of monetary policy which finally brought many enterprises to unreliable business forecasts and disastrous, unsustainable capital expenditures.  This book is an analytic and courageous accusation against those principles, and suggests disruptive, clear-cut, and practical solutions which are quite far from those recently adopted by governments and central banks. I strongly recommend it as vademecum to any business executive.”\nIt was interesting how this executive found RGD to be useful in articulating the reasons behind what he was already observing in his professional capacity, which spans four continents.  The ominous synchronicity between book theory and business reality here is that two weekends ago, he told me that the moderate improvement his industry had seen since the spring appears to have been little more than inventory restocking, as the industry’s new orders are now looking worse than they were in January.",
  "tags": [
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-05T13:15:00+00:00"
}