{
  "url": "https://voxday.net/2009/10/19/book-review-end-fed-by-ron-pau/",
  "scraped_at": "2026-01-08T23:09:49.070164",
  "title": "WND column",
  "date_display": "October 19, 2009",
  "date_iso": "2009-10-19T07:51:00+00:00",
  "date_from_url": "2009-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=113307\">End the Fed</a></b><br> by Ron Paul<br> Rating: 10 of 10</br></br></p><p><i>“The Federal Reserve System must be challenged. Ultimately, it needs to be eliminated. The government cannot and should not be trusted with a monopoly on money. No single institution in society should have power this immense. In fact, I believe that freedom itself is at stake in this struggle.”</i><br> – Ron Paul, “End the Fed,” p. 11</br></p><p>In 17 years of writing game and book reviews, I can count on two hands the number of times I have ever given out the highest rating. True excellence is to be distinguished from the merely very good, and it is far rarer than the heavy use of superlatives in our everyday language would tend to indicate. <i>End the Fed</i> is more than a timely political polemic, it is also the story of the long and patient campaign by a small group of freedom-loving patriots to restore economic liberty to the American people.</p></div>",
  "content_text": "End the Fed\nby Ron Paul\nRating: 10 of 10\n“The Federal Reserve System must be challenged. Ultimately, it needs to be eliminated. The government cannot and should not be trusted with a monopoly on money. No single institution in society should have power this immense. In fact, I believe that freedom itself is at stake in this struggle.”\n– Ron Paul, “End the Fed,” p. 11\nIn 17 years of writing game and book reviews, I can count on two hands the number of times I have ever given out the highest rating. True excellence is to be distinguished from the merely very good, and it is far rarer than the heavy use of superlatives in our everyday language would tend to indicate.\nEnd the Fed\nis more than a timely political polemic, it is also the story of the long and patient campaign by a small group of freedom-loving patriots to restore economic liberty to the American people.",
  "tags": [
    "books",
    "column"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-19T06:51:00+00:00"
}