{
  "url": "https://voxday.net/2009/10/27/brief-note-to-ankle-biters/",
  "scraped_at": "2026-01-08T23:10:44.041755",
  "title": "A brief note to the ankle-biters",
  "date_display": "October 27, 2009",
  "date_iso": "2009-10-27T17:15:00+00:00",
  "date_from_url": "2009-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On this fine afternoon, I find myself contemplating just what, precisely, could possibly be the purpose for your collective existence, which to the observer appears to testify against intelligent design and natural selection alike.  I don’t pretend to understand what sickness of the soul causes you to repeatedly bash your heads against the unforgiving wall of my logic, or what compulsive disorder drives you to put yourselves in a position to be humiliated over and over again by my superior knowledge and intellect, as no sooner are you shot down than you rise, with all the sublime, shambling grace of a mindless zombie, and stumble back into the fray.</p><p>Are my ankles so sweet that you cannot resist snapping at them?  Do your psychological scars run so deep that you cannot control your masochistic longings for brutal correction?</p><p>For years, I have told myself that even if your tedious and petty objections can only sharpen my arguments in the manner that butter sharpens steel, at least your desire to catch me in error, no matter how small that error might be, could nevertheless serve a useful purpose.  Even the most flawlessly honed body benefits from its intestinal bacteria, after all.  Although, unlike your more intelligent counterparts whose criticisms are thoughtful, substantive, and most of all relevant, you are not capable of understanding anything I write well enough to critique it in a meaningful manner, I assumed you were not only inclined to identify simple errors of basic fact, but were also capable of doing so.</p><p>It appears, however, that you have collectively failed at even this humble task.  And this naturally raises a question.  Is it possible that you could be more completely useless?</p><p>A few nights ago, I was reading <a href=\"http://www.calculatedriskblog.com/\">Calculated Risk</a> and noticed a link to historical pre-FDIC bank failure data.  I followed it, being curious to know how far the official information parted from 1941 source material I had used in writing RGD.  As I suspected, there were a few minor discrepancies as well as the usual Legend of the 4,000*.  (The actual number of failed banks in 1933 is closer to 2,666, but the government always enjoys a nice round number.)</p><p>However, to my surprise, the number of failed bank deposits 1931 was much larger than I recalled it being.  I checked my trusty and oft-updated bank failure spreadsheet and confirmed that the two not only did not match, but were not even close.  The site said 1,690,232 and the spreadsheet said 160,232.  The disturbing similarity made me suspect that the latter was supposed to be the former, albeit with a missing digit, and a check of the 1941 document confirmed the error.  I had dropped the nine in when first typing the number into the spreadsheet… which significantly altered the percentage of bank failures about which I’d repeatedly written on this blog, in my column, and worst of all, <i>in the book that was going to be announced the next day!</i></p><p>I couldn’t remember which chart I had put in the book.  Which chart, dammit?  Was it the year-by-year one, in which case the error would look like an absolute howler since the percentage of failed bank deposits would not be 0.34% but 3.6%?  Or was it the cumulative chart wherein the difference between $68 billion and $90 billion would be visually negligible in comparison to the $666.6 billion in the neighboring column?  And then, of course, there was the small matter of whether this error might call some of my conclusions about the similarity of the historical and present economic contractions into question.</p><p>Fortunately, <i>Figure 6.3. Failed Bank Deposits and Losses in 2009 Dollars</i> turned out to be the cumulative chart rather than the year-by-year one, which did not make the book.  It was incorrect, but not embarrassingly so.  The listing in the appendix couldn’t be helped, since the 160,232 number was directly in the table, but who reads the third appendix anyhow?  Also, in that context it’s quite obviously a typo.  And fortuitously, correcting the error also took care of a synchronicity problem that had been bothering me from the start.  Since my belief is that 2010 compares 1931, why didn’t the bank failure data line up properly?  And why was I following Milton Friedman’s lead in tracking the deposits from 1930 when the whole thing began in 1929?</p><p>Interestingly enough, exchanging the 1929 data for the incorrect 1931 data only required changing a single digit besides the year: <i>“The amount of failed bank deposits as a percentage of total bank deposits is averaging 2.3 percent per year over the last two years, which is more than twice as high as the <s>1.0</s>1.1 percent annual failure rate in <s>1930</s>1929 and <s>1931</s>1930.”</i> And now the bank failure comparisons are properly aligned with the beginnings of the economic contractions, which is nice.</p><p>Still, the typo involved in transferring the information from the book to the spreadsheet notwithstanding, I couldn’t believe that I hadn’t noticed an order of magnitude difference in the amount of failed deposits, especially when this meant that losses were more than 200 percent of failed deposits.  This is theoretically possible since not all bank assets are deposits and actual losses are always higher than FDIC-estimated deposits, but the highest estimated actual loss to deposits in 2009 is only 107 percent so that should have been sufficient to signify that something was wrong.  Ergo, mia culpa.  I have, of course, created <a href=\"http://www.returnofthegreatdepression.com/about/errata/\">an errata page for the book</a> and would appreciate it if any further errors are brought to my attention so that I can update it.</p><p>But, to return to my original point, if those of you who have dedicated yourselves to identifying and drawing attention to even the pettiest of my errors cannot be relied upon to catch such a relatively large and potentially significant mistake, you leave me with little choice but to conclude that you are, in fact, entirely worthless.</p></div>",
  "content_text": "On this fine afternoon, I find myself contemplating just what, precisely, could possibly be the purpose for your collective existence, which to the observer appears to testify against intelligent design and natural selection alike.  I don’t pretend to understand what sickness of the soul causes you to repeatedly bash your heads against the unforgiving wall of my logic, or what compulsive disorder drives you to put yourselves in a position to be humiliated over and over again by my superior knowledge and intellect, as no sooner are you shot down than you rise, with all the sublime, shambling grace of a mindless zombie, and stumble back into the fray.\nAre my ankles so sweet that you cannot resist snapping at them?  Do your psychological scars run so deep that you cannot control your masochistic longings for brutal correction?\nFor years, I have told myself that even if your tedious and petty objections can only sharpen my arguments in the manner that butter sharpens steel, at least your desire to catch me in error, no matter how small that error might be, could nevertheless serve a useful purpose.  Even the most flawlessly honed body benefits from its intestinal bacteria, after all.  Although, unlike your more intelligent counterparts whose criticisms are thoughtful, substantive, and most of all relevant, you are not capable of understanding anything I write well enough to critique it in a meaningful manner, I assumed you were not only inclined to identify simple errors of basic fact, but were also capable of doing so.\nIt appears, however, that you have collectively failed at even this humble task.  And this naturally raises a question.  Is it possible that you could be more completely useless?\nA few nights ago, I was reading\nCalculated Risk\nand noticed a link to historical pre-FDIC bank failure data.  I followed it, being curious to know how far the official information parted from 1941 source material I had used in writing RGD.  As I suspected, there were a few minor discrepancies as well as the usual Legend of the 4,000*.  (The actual number of failed banks in 1933 is closer to 2,666, but the government always enjoys a nice round number.)\nHowever, to my surprise, the number of failed bank deposits 1931 was much larger than I recalled it being.  I checked my trusty and oft-updated bank failure spreadsheet and confirmed that the two not only did not match, but were not even close.  The site said 1,690,232 and the spreadsheet said 160,232.  The disturbing similarity made me suspect that the latter was supposed to be the former, albeit with a missing digit, and a check of the 1941 document confirmed the error.  I had dropped the nine in when first typing the number into the spreadsheet… which significantly altered the percentage of bank failures about which I’d repeatedly written on this blog, in my column, and worst of all,\nin the book that was going to be announced the next day!\nI couldn’t remember which chart I had put in the book.  Which chart, dammit?  Was it the year-by-year one, in which case the error would look like an absolute howler since the percentage of failed bank deposits would not be 0.34% but 3.6%?  Or was it the cumulative chart wherein the difference between $68 billion and $90 billion would be visually negligible in comparison to the $666.6 billion in the neighboring column?  And then, of course, there was the small matter of whether this error might call some of my conclusions about the similarity of the historical and present economic contractions into question.\nFortunately,\nFigure 6.3. Failed Bank Deposits and Losses in 2009 Dollars\nturned out to be the cumulative chart rather than the year-by-year one, which did not make the book.  It was incorrect, but not embarrassingly so.  The listing in the appendix couldn’t be helped, since the 160,232 number was directly in the table, but who reads the third appendix anyhow?  Also, in that context it’s quite obviously a typo.  And fortuitously, correcting the error also took care of a synchronicity problem that had been bothering me from the start.  Since my belief is that 2010 compares 1931, why didn’t the bank failure data line up properly?  And why was I following Milton Friedman’s lead in tracking the deposits from 1930 when the whole thing began in 1929?\nInterestingly enough, exchanging the 1929 data for the incorrect 1931 data only required changing a single digit besides the year:\n“The amount of failed bank deposits as a percentage of total bank deposits is averaging 2.3 percent per year over the last two years, which is more than twice as high as the\n1.0\n1.1 percent annual failure rate in\n1930\n1929 and\n1931\n1930.”\nAnd now the bank failure comparisons are properly aligned with the beginnings of the economic contractions, which is nice.\nStill, the typo involved in transferring the information from the book to the spreadsheet notwithstanding, I couldn’t believe that I hadn’t noticed an order of magnitude difference in the amount of failed deposits, especially when this meant that losses were more than 200 percent of failed deposits.  This is theoretically possible since not all bank assets are deposits and actual losses are always higher than FDIC-estimated deposits, but the highest estimated actual loss to deposits in 2009 is only 107 percent so that should have been sufficient to signify that something was wrong.  Ergo, mia culpa.  I have, of course, created\nan errata page for the book\nand would appreciate it if any further errors are brought to my attention so that I can update it.\nBut, to return to my original point, if those of you who have dedicated yourselves to identifying and drawing attention to even the pettiest of my errors cannot be relied upon to catch such a relatively large and potentially significant mistake, you leave me with little choice but to conclude that you are, in fact, entirely worthless.",
  "tags": [
    "economics",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-27T17:15:00+00:00"
}