{
  "url": "https://voxday.net/2009/10/23/conservatives-at-nro/",
  "scraped_at": "2026-01-08T23:10:20.127000",
  "title": "The “conservatives” editing NRO",
  "date_display": "October 23, 2009",
  "date_iso": "2009-10-23T17:15:00+00:00",
  "date_from_url": "2009-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NRO’s Editors acted like panicked little girls who knew nothing about economics, history, or politics when <a href=\"http://nrd.nationalreview.com/article/?q=NThkZTQ0ZGFlN2FhOWRmNWE4NTY4NmU5Y2Y0NDVkMTk=\">they endorsed the banking bailouts last November</a>.  Now that the government has spent hundreds of billions on the financial institutions and assorted other corporations, and in some cases owns them outright, they want to suddenly rediscover their long-lost principles in order to argue that <a href=\"http://article.nationalreview.com/?q=MjA2NDUwZTNjZTdlM2NkOWE5Y2RmNTQyMjFmNzc3YTc=\">limiting executive pay</a> is somehow a sin against capitalism and small government:</p><blockquote><p>Three things about the Obama administration’s publicity-seeking move to curb executives’ pay at bailed-out companies: It is inevitable, it is stupid, and it is inevitably stupid….  TARP was an emergency measure. The emergency has subsided, and the first order of business is restoring at least some separation between Washington and Wall Street, between political power and the private economy. The love of power can prove at least as corrupting as the love of money, and the American political class does not seem likely to resist either temptation, much less both at once.</p></blockquote><p>Given that the “emergency measure” cop-out has been a known scam since Marius was scaring the Romans into throwing out their law against repeat consulships with the threat of a German invasion, that little bit of attempted posterior-covering isn’t convincing.  The sell-outs supported the bailouts, which tells you all you need to know about the depth of their commitment to capitalism, small government, the Constitution, and American liberty.  Obama’s decision to slash executive pay at bailed-out companies falls far short of what he should do – shut the corporations down and prosecute those guilty of committing fraud – but interrupting the executive feeding frenzy is far more justifiable than the original bail-outs ever were.</p><p>This column is a disgusting display of true colors by false conservatives who sold out whatever conservative principles they once held in service to Wall Street.  Where on Earth do they think these “talented” executives are going to go if they are legally prevented from shoveling millions in taxpayer dollars to themselves?  Move to Swaziland and utilize their highly refined lobbying “skills” there?</p><p>Speaking of bailed-out, government-owned banks, Karl Denninger notes <a href=\"http://market-ticker.denninger.net/archives/1539-Possible-Credit-Dislocation-Be-Warned.html\">something very fishy is going on at Citi</a> and suspects another financial meltdown is in the works:</p><blockquote><p>* Standard “purchase” interest rate is going to 29.99%.</p><p>* The “default rate” is also now 29.99%.</p><p>I have since confirmed that this letter is not just going to people who have had credit “challenges”.  Indeed, this appears to be a blanket change on the part of Citibank.  I now have multiple copies from people who assert that they have 750+ FICOs and have never missed a payment on this or any other obligation – the “paragon” of so-called “responsible” credit use.  All of the letters are identical….  Perhaps what we’re really seeing is a business reacting to hidden deterioration of asset bases that are not known by investors and the public due to the legitimation of bogus accounting that happened this last March, but which is known by company executives!</p><p>Why do I believe this is a plausible, even likely explanation for this behavior by Citibank?  That’s simple: This sort of “terms change”, which is an effective declaration of default even against those who haven’t defaulted (see above; the same 30% rate is being applied to defaulted and non-defaulted accounts!), will drive two consumer behaviors that could ultimately destroy Citibank’s credit card business and perhaps the bank as a whole:</p><p>1. Those who can transfer balances out somewhere else and/or pay them off will immediately do so.  Nobody is going to pay a 30% interest rate and an imposition of default rates on non-defaulted balances willingly and on purpose unless they have no other choice.</p><p>2. A significant number of people, on receipt of this notice and understanding what it means (a declaration that non-defaulted accounts are being charged the same penalty rate as a defaulted account!) will immediately go out and charge up the entire unused balance on their card and then intentionally default.</p></blockquote><p>This whole “recovery” theme and corresponding market rally has stink, stank, stunk like putrifying fish from the start.  I don’t know how much longer the Fed will be able to prop it up, but I very much doubt it’s going to last another six months.</p></div>",
  "content_text": "NRO’s Editors acted like panicked little girls who knew nothing about economics, history, or politics when\nthey endorsed the banking bailouts last November\n.  Now that the government has spent hundreds of billions on the financial institutions and assorted other corporations, and in some cases owns them outright, they want to suddenly rediscover their long-lost principles in order to argue that\nlimiting executive pay\nis somehow a sin against capitalism and small government:\nThree things about the Obama administration’s publicity-seeking move to curb executives’ pay at bailed-out companies: It is inevitable, it is stupid, and it is inevitably stupid….  TARP was an emergency measure. The emergency has subsided, and the first order of business is restoring at least some separation between Washington and Wall Street, between political power and the private economy. The love of power can prove at least as corrupting as the love of money, and the American political class does not seem likely to resist either temptation, much less both at once.\nGiven that the “emergency measure” cop-out has been a known scam since Marius was scaring the Romans into throwing out their law against repeat consulships with the threat of a German invasion, that little bit of attempted posterior-covering isn’t convincing.  The sell-outs supported the bailouts, which tells you all you need to know about the depth of their commitment to capitalism, small government, the Constitution, and American liberty.  Obama’s decision to slash executive pay at bailed-out companies falls far short of what he should do – shut the corporations down and prosecute those guilty of committing fraud – but interrupting the executive feeding frenzy is far more justifiable than the original bail-outs ever were.\nThis column is a disgusting display of true colors by false conservatives who sold out whatever conservative principles they once held in service to Wall Street.  Where on Earth do they think these “talented” executives are going to go if they are legally prevented from shoveling millions in taxpayer dollars to themselves?  Move to Swaziland and utilize their highly refined lobbying “skills” there?\nSpeaking of bailed-out, government-owned banks, Karl Denninger notes\nsomething very fishy is going on at Citi\nand suspects another financial meltdown is in the works:\n* Standard “purchase” interest rate is going to 29.99%.\n* The “default rate” is also now 29.99%.\nI have since confirmed that this letter is not just going to people who have had credit “challenges”.  Indeed, this appears to be a blanket change on the part of Citibank.  I now have multiple copies from people who assert that they have 750+ FICOs and have never missed a payment on this or any other obligation – the “paragon” of so-called “responsible” credit use.  All of the letters are identical….  Perhaps what we’re really seeing is a business reacting to hidden deterioration of asset bases that are not known by investors and the public due to the legitimation of bogus accounting that happened this last March, but which is known by company executives!\nWhy do I believe this is a plausible, even likely explanation for this behavior by Citibank?  That’s simple: This sort of “terms change”, which is an effective declaration of default even against those who haven’t defaulted (see above; the same 30% rate is being applied to defaulted and non-defaulted accounts!), will drive two consumer behaviors that could ultimately destroy Citibank’s credit card business and perhaps the bank as a whole:\n1. Those who can transfer balances out somewhere else and/or pay them off will immediately do so.  Nobody is going to pay a 30% interest rate and an imposition of default rates on non-defaulted balances willingly and on purpose unless they have no other choice.\n2. A significant number of people, on receipt of this notice and understanding what it means (a declaration that non-defaulted accounts are being charged the same penalty rate as a defaulted account!) will immediately go out and charge up the entire unused balance on their card and then intentionally default.\nThis whole “recovery” theme and corresponding market rally has stink, stank, stunk like putrifying fish from the start.  I don’t know how much longer the Fed will be able to prop it up, but I very much doubt it’s going to last another six months.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-23T16:15:00+00:00"
}