{
  "url": "https://voxday.net/2009/10/22/dawkins-historical-dimwi/",
  "scraped_at": "2026-01-08T23:10:11.142432",
  "title": "Dawkins, the historical dimwit",
  "date_display": "October 22, 2009",
  "date_iso": "2009-10-22T14:15:00+00:00",
  "date_from_url": "2009-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Someone really needs to tell the old coot to stop babbling about anything but biology and atheism.  As I demonstrated in TIA, the man simply <a href=\"http://www.hughhewitt.com/blog/g/e2c8b1df-2d99-4647-8ab8-631ee54d9ea4\">doesn’t know a damn thing about history</a>:</p><blockquote><p>HH: Well, you repeatedly use the analogy of a detective at a crime scene throughout The Greatest Show On Earth. But detectives simply can’t dismiss evidence they don’t want to see. There’s a lot of evidence for the miracles, in terms of eyewitness…</p><p>RD: No, there isn’t. What there is, is written stories which were written decades after the alleged events were supposed to happen. No historian would take that seriously.</p><p>HH: Well, that’s why I’m conflicted, because in your book, you talk about the Latin teacher who is stymied at every turn, and yet Latin teachers routinely rely on things like Tacitus and Pliny, and histories that were written centuries after the events in which they are recording occur.</p><p>RD: There’s massive archaeological evidence, there’s massive evidence of all kinds. It’s just not comparable. No…if you talk to any ancient historian of the period, they will agree that it is not good historical evidence.</p><p>HH: Oh, that’s simply not true. Dr. Mark Roberts, double PhD in undergraduate at Harvard has written a very persuasive book upon this. I mean, that’s an astounding statement. Are you unfamiliar with him?</p><p>RD: All right, then there may be some, but a very large number of ancient historians would say…</p><p>HH: Well, you just said there were none. So there are some that you are choosing not to confront.</p><p>RD: You sound like a lawyer.</p><p>HH: I am a lawyer.</p><p>RD: Oh, for God’s sake. Are you? Okay. I didn’t know that. All right. I will accept that there are some ancient historians who take the Gospels seriously. But they were written decades after the events that happened, and they were written by people with an axe to grind, written by disciples. There are no eyewitness written accounts. The earliest New Testament…</p><p>HH: I understand you believe that, Professor. I do. But what I don’t understand is how you can use the analogy of the Latin teacher or the detective, when it breaks down given your dismissal of evidence you don’t see fit to deal with squarely?</p><p>RD: I think that’s a very, very specious comparison, because the Latin teacher is dealing with enormous numbers of documents. Remember, my Latin teacher is supposed to be confronted with skeptics who don’t even think the Latin language was ever spoken. And there’s huge amounts of documentary evidence of the Roman Empire. We’re talking about the entire Roman Empire here. There’s enormous amounts of eyewitness accounts written down at the time. It just is no comparison.</p><p>HH: Actually, it is. It’s actually a very persuasive…in fact, the arguments for the manuscript evidence of Christ and His doings is much stronger than anything, for example, Tacitus or Pliny wrote. It’s just much stronger</p></blockquote><p>It’s probably just as well that Dawkins hides from debate because he’s completely incompetent.  Hugh Hewitt is far from a master debater in my opinion, and yet he caught Dawkins making blatantly false statements about history and historians, forced him to drastically change his definition of evidence from the one he utilizes in his books – the “enormous amount of eyewitness accounts” is a hilarious remark if you’re familiar with his previous statements about the value of eyewitnesses – and encouraged him to make an appeal to documentary evidence that was a sharp dagger in the hearts of dictionary-challenged atheists across the Internet.  And notice that while Hewitt can name a specific historian in support of his position, Dawkins doesn’t… because he can’t.  Just all… er, ah, lots.</p><p>Now, understand that no sane historian or archeologist rejects the Bible as historical evidence.  At most, they reject specific details… rejections which archeological history indicates that they will probably be forced to eventually recant.  Among other things, the Bible is one of the primary sources for calibrating the Egyptian Chronology – ironically, it turns out, as anyone familiar with Rohl’s New Chronology will know – and it has <i>repeatedly</i> shown itself to be more accurate than the dynamic archeological consensus.  From the “mythical” Assyrian empire to Roman tax rolls and titles of Greek officials, the Bible has consistently shown itself to be an extraordinarily reliable historical document.  Were it not for the supernatural elements that material reductionist scientists find impossible to believe, no one would even think to question it.</p><p><i>“The excessive skepticism shown toward the Bible by important historical schools of the eighteenth and nineteenth centuries, certain phrases of which still appear periodically, has been progressively discredited. Discovery after discovery has established the accuracy of innumerable details, and has brought increased recognition to the value of the Bible as a source of history.”</i><br> – <a href=\"http://en.wikipedia.org/wiki/William_F._Albright\">William F. Albright</a></br></p><p>Richard Dawkins continues to keep digging himself in deeper.  By the time he discovers just how completely wrong he was, he will have destroyed the greater part of his scientific legacy.</p></div>",
  "content_text": "Someone really needs to tell the old coot to stop babbling about anything but biology and atheism.  As I demonstrated in TIA, the man simply\ndoesn’t know a damn thing about history\n:\nHH: Well, you repeatedly use the analogy of a detective at a crime scene throughout The Greatest Show On Earth. But detectives simply can’t dismiss evidence they don’t want to see. There’s a lot of evidence for the miracles, in terms of eyewitness…\nRD: No, there isn’t. What there is, is written stories which were written decades after the alleged events were supposed to happen. No historian would take that seriously.\nHH: Well, that’s why I’m conflicted, because in your book, you talk about the Latin teacher who is stymied at every turn, and yet Latin teachers routinely rely on things like Tacitus and Pliny, and histories that were written centuries after the events in which they are recording occur.\nRD: There’s massive archaeological evidence, there’s massive evidence of all kinds. It’s just not comparable. No…if you talk to any ancient historian of the period, they will agree that it is not good historical evidence.\nHH: Oh, that’s simply not true. Dr. Mark Roberts, double PhD in undergraduate at Harvard has written a very persuasive book upon this. I mean, that’s an astounding statement. Are you unfamiliar with him?\nRD: All right, then there may be some, but a very large number of ancient historians would say…\nHH: Well, you just said there were none. So there are some that you are choosing not to confront.\nRD: You sound like a lawyer.\nHH: I am a lawyer.\nRD: Oh, for God’s sake. Are you? Okay. I didn’t know that. All right. I will accept that there are some ancient historians who take the Gospels seriously. But they were written decades after the events that happened, and they were written by people with an axe to grind, written by disciples. There are no eyewitness written accounts. The earliest New Testament…\nHH: I understand you believe that, Professor. I do. But what I don’t understand is how you can use the analogy of the Latin teacher or the detective, when it breaks down given your dismissal of evidence you don’t see fit to deal with squarely?\nRD: I think that’s a very, very specious comparison, because the Latin teacher is dealing with enormous numbers of documents. Remember, my Latin teacher is supposed to be confronted with skeptics who don’t even think the Latin language was ever spoken. And there’s huge amounts of documentary evidence of the Roman Empire. We’re talking about the entire Roman Empire here. There’s enormous amounts of eyewitness accounts written down at the time. It just is no comparison.\nHH: Actually, it is. It’s actually a very persuasive…in fact, the arguments for the manuscript evidence of Christ and His doings is much stronger than anything, for example, Tacitus or Pliny wrote. It’s just much stronger\nIt’s probably just as well that Dawkins hides from debate because he’s completely incompetent.  Hugh Hewitt is far from a master debater in my opinion, and yet he caught Dawkins making blatantly false statements about history and historians, forced him to drastically change his definition of evidence from the one he utilizes in his books – the “enormous amount of eyewitness accounts” is a hilarious remark if you’re familiar with his previous statements about the value of eyewitnesses – and encouraged him to make an appeal to documentary evidence that was a sharp dagger in the hearts of dictionary-challenged atheists across the Internet.  And notice that while Hewitt can name a specific historian in support of his position, Dawkins doesn’t… because he can’t.  Just all… er, ah, lots.\nNow, understand that no sane historian or archeologist rejects the Bible as historical evidence.  At most, they reject specific details… rejections which archeological history indicates that they will probably be forced to eventually recant.  Among other things, the Bible is one of the primary sources for calibrating the Egyptian Chronology – ironically, it turns out, as anyone familiar with Rohl’s New Chronology will know – and it has\nrepeatedly\nshown itself to be more accurate than the dynamic archeological consensus.  From the “mythical” Assyrian empire to Roman tax rolls and titles of Greek officials, the Bible has consistently shown itself to be an extraordinarily reliable historical document.  Were it not for the supernatural elements that material reductionist scientists find impossible to believe, no one would even think to question it.\n“The excessive skepticism shown toward the Bible by important historical schools of the eighteenth and nineteenth centuries, certain phrases of which still appear periodically, has been progressively discredited. Discovery after discovery has established the accuracy of innumerable details, and has brought increased recognition to the value of the Bible as a source of history.”\n–\nWilliam F. Albright\nRichard Dawkins continues to keep digging himself in deeper.  By the time he discovers just how completely wrong he was, he will have destroyed the greater part of his scientific legacy.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-22T13:15:00+00:00"
}