{
  "url": "https://voxday.net/2009/10/28/escape-from-new-york/",
  "scraped_at": "2026-01-08T23:10:47.685362",
  "title": "Escape from New York",
  "date_display": "October 28, 2009",
  "date_iso": "2009-10-28T10:18:00+00:00",
  "date_from_url": "2009-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>New York <a href=\"http://www.nypost.com/p/news/local/tax_refugees_staging_escape_from_qb4pItQ71UXIc0i6cd3UpK\">tries the California model</a> as yet again, mainstream economists demonstrate their irrelevance by completely failing to consider the primary factors involved.  I know nothing about New York’s revenue estimation models, but I can guarantee you that they don’t take into account any change in taxpayer behavior based on changes in the rates, much less changes in their income levels:</p><blockquote><p>New Yorkers are fleeing the state and city in alarming numbers — and costing a fortune in lost tax dollars, a new study shows.  More than 1.5 million state residents left for other parts of the United States from 2000 to 2008, according to the report from the Empire Center for New York State Policy. It was the biggest out-of-state migration in the country.  The vast majority of the migrants, 1.1 million, were former residents of New York City — meaning one out of seven city taxpayers moved out….  What’s worse is that the families fleeing New York are being replaced by lower-income newcomers, who consequently pay less in taxes.</p></blockquote><p>It’s simply incredible that a profession which is largely built around the concept of equilibrium pricing staunchly refuses to consider the effects of the cost of debt and taxation.  This is just the most recent example; in RGD I cited an even more dramatic tax migration from the city of Baltimore.  Of course, the fact that mainstream economists don’t bother to include either debt or taxation in their models makes their decision to exclude the price of housing, food, and fuel out of the “Core CPI” statistic a little more comprehensible.  After all, you’re no more likely to eat, drive or own a house than you are to pay taxes or buy things on credit.</p><p>By the way, the WND publicist has embarked upon a fairly aggressive radio campaign, so I’m doing something like two radio shows a day, starting today.  If you want to follow along and listen to me say pretty much the same thing over and over again, <a href=\"http://www.returnofthegreatdepression.com/events/\">the schedule is posted</a> at the RGD blog.  The link on the right under the book cover, cleverly entitled “RGD Radio Schedule”, will take you to the page which will be updated on a daily basis.</p></div>",
  "content_text": "New York\ntries the California model\nas yet again, mainstream economists demonstrate their irrelevance by completely failing to consider the primary factors involved.  I know nothing about New York’s revenue estimation models, but I can guarantee you that they don’t take into account any change in taxpayer behavior based on changes in the rates, much less changes in their income levels:\nNew Yorkers are fleeing the state and city in alarming numbers — and costing a fortune in lost tax dollars, a new study shows.  More than 1.5 million state residents left for other parts of the United States from 2000 to 2008, according to the report from the Empire Center for New York State Policy. It was the biggest out-of-state migration in the country.  The vast majority of the migrants, 1.1 million, were former residents of New York City — meaning one out of seven city taxpayers moved out….  What’s worse is that the families fleeing New York are being replaced by lower-income newcomers, who consequently pay less in taxes.\nIt’s simply incredible that a profession which is largely built around the concept of equilibrium pricing staunchly refuses to consider the effects of the cost of debt and taxation.  This is just the most recent example; in RGD I cited an even more dramatic tax migration from the city of Baltimore.  Of course, the fact that mainstream economists don’t bother to include either debt or taxation in their models makes their decision to exclude the price of housing, food, and fuel out of the “Core CPI” statistic a little more comprehensible.  After all, you’re no more likely to eat, drive or own a house than you are to pay taxes or buy things on credit.\nBy the way, the WND publicist has embarked upon a fairly aggressive radio campaign, so I’m doing something like two radio shows a day, starting today.  If you want to follow along and listen to me say pretty much the same thing over and over again,\nthe schedule is posted\nat the RGD blog.  The link on the right under the book cover, cleverly entitled “RGD Radio Schedule”, will take you to the page which will be updated on a daily basis.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-28T10:18:00+00:00"
}