{
  "url": "https://voxday.net/2009/10/21/facade-crumbles/",
  "scraped_at": "2026-01-08T23:10:05.679131",
  "title": "The facade crumbles",
  "date_display": "October 21, 2009",
  "date_iso": "2009-10-21T17:15:00+00:00",
  "date_from_url": "2009-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The era of Fed extend-and-pretend appears to be <a href=\"http://www.zerohedge.com/article/mondays-fed-reverse-repo-test-disaster\">fast approaching an end</a>:</p><blockquote><p>On Monday the Federal Reserve held a major reverse repo test, as was announced by the NY Fed and by Zero Hedge. We have subsequently received several unconfirmed reports that the conducted test has been a disaster (we have calls into the Federal Reserve to confirm or deny this, we are eagerly awaiting their reply).</p></blockquote><p>In related news, Karl Denninger reports that JP Morgan/Chase is down to only <a href=\"http://market-ticker.denninger.net/archives/1530-Mondays-Reverse-Repo-Test.html\">$21 billion in actual cash</a>.  But don’t worry, they have lots of other assets… unfortunately, most of them are the sort that keep showing up at only 50 percent valuations whenever a bank is seized by the FDIC.  All of the professional economists have been saying that the crisis is over for months now.  I, on the other hand, don’t think that the next stage has even begun yet.  But surely all the experts can’t be wrong… again!</p></div>",
  "content_text": "The era of Fed extend-and-pretend appears to be\nfast approaching an end\n:\nOn Monday the Federal Reserve held a major reverse repo test, as was announced by the NY Fed and by Zero Hedge. We have subsequently received several unconfirmed reports that the conducted test has been a disaster (we have calls into the Federal Reserve to confirm or deny this, we are eagerly awaiting their reply).\nIn related news, Karl Denninger reports that JP Morgan/Chase is down to only\n$21 billion in actual cash\n.  But don’t worry, they have lots of other assets… unfortunately, most of them are the sort that keep showing up at only 50 percent valuations whenever a bank is seized by the FDIC.  All of the professional economists have been saying that the crisis is over for months now.  I, on the other hand, don’t think that the next stage has even begun yet.  But surely all the experts can’t be wrong… again!",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-21T16:15:00+00:00"
}