{
  "url": "https://voxday.net/2009/10/29/falsifying-rgd/",
  "scraped_at": "2026-01-08T23:10:56.815771",
  "title": "Falsifying RGD",
  "date_display": "October 29, 2009",
  "date_iso": "2009-10-29T12:00:00+00:00",
  "date_from_url": "2009-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been asked to consider the possibility that the thesis of my latest book, <i><a href=\"http://www.amazon.com/Return-Great-Depression-Vox-Day/dp/1935071181/ref=sr_1_8?ie=UTF8&amp;s=books&amp;qid=1255037695&amp;sr=8-8\">The Return of the Great Depression</a></i> is incorrect.  If I were the Mogambo Guru, this would of course be the correct occasion to respond with nothing more than the Mighty Mogambo Snort of Derision (MMSoD) followed by a verbose and entertaining rant involving pitchforks, firearms, indignities performed upon the corpses of deceased central bankers, and gold, but as I am merely an Internet Superintelligence with a tendency to take things literally even when they are clearly intended as metaphor, sarcasm, or irony, sometimes for the purposes of illustration but more often for my own amusement, I shall consider the question of what would indicate that I am incorrect and we are not in the early stages of a massive worldwide economic contraction.</p><p>As it happens, I have gone into some detail in examining the possibility that I am wrong in the book itself by cataloging the six plausible scenarios, five of which are presently part of the present economic discourse.  While the five scenarios that range from <i>Saint Bernanke and the Green Shoots</i> to <i>Great Depression 2.0</i> each have their public advocates who are listed by the scenario they are forecasting, I have yet to discover any economist who is genuinely convinced that we are headed for the sixth scenario: <i>Fallout 4 Live</i>.</p><p>Since a significant part of my conclusions are based on Austrian theory with a much-lesser nod to Minsky’s financial instability hypothesis, the first indication that I could be wrong is related to bank credit.  Austrian theory teaches that either the money supply and/or bank credit has to contract; as Mises puts it: <i>“[T]he moment must eventually come when no further extension of the circulation of fiduciary media is possible.”</i> So, an sustained increase in either TOTLL or total credit market debt would be the first and strongest sign that either a) the depression is coming to an end or b) Whiskey Zulu India, the hyperinflation scenario, is coming to pass.  TOTLL is presently down 8.2% from its peak one year ago, while TCMD was very slightly down in the second quarter; we are still waiting for the third quarter results.</p><p>The second sign will be rising property tax revenues, particularly at the state and local level.  While it is easy for governments to play games with statistics, it is much more difficult for them to falsify their tax revenues. The document “<a href=\"http://www.ncsl.org/print/fiscal/STATEFINANCEGREATDEPRESSION.pdf\">State Finance in the Great Depression</a>” is useful on this score. <i>“After the Depression began, local government property tax collections did not again reach the 1927 level until 1944. For states, it took until 1952 to reach the 1927 level, although in the interval, states had reduced their reliance upon the tax.”</i> Since state and local governments now already derive their revenue from a much broader range of taxes, it is unclear if one can use aggregate tax revenues as a similar indicator, but <a href=\"http://news.yahoo.com/s/nm/20091009/pl_nm/us_usa_state_budgets\">the collapse in cumulative tax revenues</a> from declines in sales and income taxes suggests that this may be the case.</p><p><i>“Among the worst cases is Indiana where revenue collections were 8 percent below forecast, or $254 million lower than expected, leading state budget officials to speculate revenue could fall $1 billion by the end of the fiscal year.”</i></p><p>Most economists will be looking primarily at the GDP figures, and indeed, a positive report above three percent will probably be widely cited as evidence that the recovery has arrived, although anything south of <a href=\"http://finance.yahoo.com/news/Economy-expected-to-grow-in-apf-3242332094.html?x=0&amp;sec=topStories&amp;pos=9&amp;asset=&amp;ccode=\">the 3.3% growth expected by the mainstream consensus</a> will likely sink the markets.  But the current numbers are considerably juiced by the summer housing and automotive subsidies and the “positive” aspects of the improvement from the second quarter were entirely the result of a) government spending, and b) Americans buying fewer imports, neither of which is a legitimate sign of economic growth.  But, I would regard two quarters of economic growth of four percent growth <i>without</i> any substantial government programs propping up consumer spending to be a legitimate sign of recovery. The fact that it is looking increasingly likely that the home buyer’s credit act will now be extended to April 2010 does not inspire great confidence in the legitimacy of the GDP numbers for the third and fourth quarters.  I will be analyzing the Q3 Advance report on the RGD blog later for those who happen to be interested.  (UPDATE: the BEA is reporting 3.5% growth for Q3, of which almost half, 1.7%, is from “motor vehicle output”.  In other words, from additional government-subsidized debt.)</p><p>Finally, it is important to remember that GDP is an artificial construct intended to provide a means of modelling Keynes’s general theory which is predicated first and foremost on <i>employment</i>.  The very concept of a “jobless recovery” is a contradiction in economic terms.  As with GDP, U3 and U6 are subject to government statistical shenanigans, but unemployment is a little harder to disguise, so regardless of how the BLS plays around with the consistency of the “labor force” in order to make the rate look lower, seeing <a href=\"http://2.bp.blogspot.com/_pMscxxELHEg/SsYRy0KCGpI/AAAAAAAAGfs/bpYMDFkuYiM/s1600-h/EmployPoP.jpg\">the Employment/Population ratio</a> move back above the 60% would also be a strong sign of genuine economic recovery.  Note that we are presently at 1984 rates of employment-to-population.</p><p>A fifth indicator that I am incorrect and the hyperinflationary scenario is unfolding instead of the debt-deflationary one is a <i>rapid</i> increase in the price of gold.  Please note that this is not an economic recovery scenario, it is only a different form of the massively contractionary one. I believe that gold, being a form of money, can benefit from deflation.  So, $1,075 gold is not conclusive, especially since it’s still lower than the $1,425 inflation-corrected 1981 peak.  But only inflation could possibly account for the sort of rapid rise in price that would be projected to take it above, say, $5,000 per ounce, and if there is hyperinflation, the gold price can safely be expected to exceed that by a considerable margin.</p><p>Finally, physical shipments of goods are a necessary and relatively objective measure of economic activity.  The Baltic Dry Index is a daily average of international shipping prices and it was at 11,771 at its peak in 2008.  It is presently below 3,000 but rose as high as 4,291 in May, so any move above 5,000 would be an initial indication that an economic recovery is underway.  Above 10,000 would appear to be positive proof that the economy was completely back on track, barring the hyperinflationary scenario, of course.</p><p>In summary:  1) Increasing bank credit and overall debt.  2) Rising state and local property tax revenues.  Possibly increasing aggregate tax revenues as well.  3) Consecutive quarters featuring four-percent plus GDP gains not created by government spending, reduced imports and consumer spending subsidies.  4) Employment to population ratio over 60 percent.  5) Rapidly increasing price of gold over $1,500 per ounce.  6) The Baltic Dry Index exceeding 5,000.  If anyone else has any suggestions, please feel free to list them.</p></div>",
  "content_text": "I’ve been asked to consider the possibility that the thesis of my latest book,\nThe Return of the Great Depression\nis incorrect.  If I were the Mogambo Guru, this would of course be the correct occasion to respond with nothing more than the Mighty Mogambo Snort of Derision (MMSoD) followed by a verbose and entertaining rant involving pitchforks, firearms, indignities performed upon the corpses of deceased central bankers, and gold, but as I am merely an Internet Superintelligence with a tendency to take things literally even when they are clearly intended as metaphor, sarcasm, or irony, sometimes for the purposes of illustration but more often for my own amusement, I shall consider the question of what would indicate that I am incorrect and we are not in the early stages of a massive worldwide economic contraction.\nAs it happens, I have gone into some detail in examining the possibility that I am wrong in the book itself by cataloging the six plausible scenarios, five of which are presently part of the present economic discourse.  While the five scenarios that range from\nSaint Bernanke and the Green Shoots\nto\nGreat Depression 2.0\neach have their public advocates who are listed by the scenario they are forecasting, I have yet to discover any economist who is genuinely convinced that we are headed for the sixth scenario:\nFallout 4 Live\n.\nSince a significant part of my conclusions are based on Austrian theory with a much-lesser nod to Minsky’s financial instability hypothesis, the first indication that I could be wrong is related to bank credit.  Austrian theory teaches that either the money supply and/or bank credit has to contract; as Mises puts it:\n“[T]he moment must eventually come when no further extension of the circulation of fiduciary media is possible.”\nSo, an sustained increase in either TOTLL or total credit market debt would be the first and strongest sign that either a) the depression is coming to an end or b) Whiskey Zulu India, the hyperinflation scenario, is coming to pass.  TOTLL is presently down 8.2% from its peak one year ago, while TCMD was very slightly down in the second quarter; we are still waiting for the third quarter results.\nThe second sign will be rising property tax revenues, particularly at the state and local level.  While it is easy for governments to play games with statistics, it is much more difficult for them to falsify their tax revenues. The document “\nState Finance in the Great Depression\n” is useful on this score.\n“After the Depression began, local government property tax collections did not again reach the 1927 level until 1944. For states, it took until 1952 to reach the 1927 level, although in the interval, states had reduced their reliance upon the tax.”\nSince state and local governments now already derive their revenue from a much broader range of taxes, it is unclear if one can use aggregate tax revenues as a similar indicator, but\nthe collapse in cumulative tax revenues\nfrom declines in sales and income taxes suggests that this may be the case.\n“Among the worst cases is Indiana where revenue collections were 8 percent below forecast, or $254 million lower than expected, leading state budget officials to speculate revenue could fall $1 billion by the end of the fiscal year.”\nMost economists will be looking primarily at the GDP figures, and indeed, a positive report above three percent will probably be widely cited as evidence that the recovery has arrived, although anything south of\nthe 3.3% growth expected by the mainstream consensus\nwill likely sink the markets.  But the current numbers are considerably juiced by the summer housing and automotive subsidies and the “positive” aspects of the improvement from the second quarter were entirely the result of a) government spending, and b) Americans buying fewer imports, neither of which is a legitimate sign of economic growth.  But, I would regard two quarters of economic growth of four percent growth\nwithout\nany substantial government programs propping up consumer spending to be a legitimate sign of recovery. The fact that it is looking increasingly likely that the home buyer’s credit act will now be extended to April 2010 does not inspire great confidence in the legitimacy of the GDP numbers for the third and fourth quarters.  I will be analyzing the Q3 Advance report on the RGD blog later for those who happen to be interested.  (UPDATE: the BEA is reporting 3.5% growth for Q3, of which almost half, 1.7%, is from “motor vehicle output”.  In other words, from additional government-subsidized debt.)\nFinally, it is important to remember that GDP is an artificial construct intended to provide a means of modelling Keynes’s general theory which is predicated first and foremost on\nemployment\n.  The very concept of a “jobless recovery” is a contradiction in economic terms.  As with GDP, U3 and U6 are subject to government statistical shenanigans, but unemployment is a little harder to disguise, so regardless of how the BLS plays around with the consistency of the “labor force” in order to make the rate look lower, seeing\nthe Employment/Population ratio\nmove back above the 60% would also be a strong sign of genuine economic recovery.  Note that we are presently at 1984 rates of employment-to-population.\nA fifth indicator that I am incorrect and the hyperinflationary scenario is unfolding instead of the debt-deflationary one is a\nrapid\nincrease in the price of gold.  Please note that this is not an economic recovery scenario, it is only a different form of the massively contractionary one. I believe that gold, being a form of money, can benefit from deflation.  So, $1,075 gold is not conclusive, especially since it’s still lower than the $1,425 inflation-corrected 1981 peak.  But only inflation could possibly account for the sort of rapid rise in price that would be projected to take it above, say, $5,000 per ounce, and if there is hyperinflation, the gold price can safely be expected to exceed that by a considerable margin.\nFinally, physical shipments of goods are a necessary and relatively objective measure of economic activity.  The Baltic Dry Index is a daily average of international shipping prices and it was at 11,771 at its peak in 2008.  It is presently below 3,000 but rose as high as 4,291 in May, so any move above 5,000 would be an initial indication that an economic recovery is underway.  Above 10,000 would appear to be positive proof that the economy was completely back on track, barring the hyperinflationary scenario, of course.\nIn summary:  1) Increasing bank credit and overall debt.  2) Rising state and local property tax revenues.  Possibly increasing aggregate tax revenues as well.  3) Consecutive quarters featuring four-percent plus GDP gains not created by government spending, reduced imports and consumer spending subsidies.  4) Employment to population ratio over 60 percent.  5) Rapidly increasing price of gold over $1,500 per ounce.  6) The Baltic Dry Index exceeding 5,000.  If anyone else has any suggestions, please feel free to list them.",
  "tags": [
    "books",
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-29T12:00:00+00:00"
}