{
  "url": "https://voxday.net/2009/10/02/federal-reserve-is-wrong-again/",
  "scraped_at": "2026-01-08T23:08:25.783104",
  "title": "The Federal Reserve is wrongagain",
  "date_display": "October 2, 2009",
  "date_iso": "2009-10-02T19:28:00+00:00",
  "date_from_url": "2009-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t mean wrong in the sense that they have announced that the economy is recovering, but it really isn’t.  Well, yes, they’re wrong in that regard too, but I have something a little more <a href=\"http://globaleconomicanalysis.blogspot.com/2009/10/jobs-contract-21th-straight-month.html\">specific and immediately verifiable</a> in mind:</p><blockquote><p>The Fed’s forecasts, released as part of the minutes from its April meeting, show that its staff now expects the unemployment rate to rise to between 9.2% and 9.6% this year. The central bank had forecast in January that the jobless rate would be in a range of 8.5% to 8.8%, but the unemployment rate topped that in April, hitting 8.9%.</p></blockquote><p>Mish notes the fact of two Fed forecasts, one in January and one in May.  Each declared a maximum U-3 unemployment rate, first 8.8 percent, then 9.6 percent.  Today, the BLS announced that <a href=\"http://4.bp.blogspot.com/_nSTO-vZpSgc/SsYeCsY9gkI/AAAAAAAAG_g/gOo7I8sTtkU/s1600-h/table-a12-2009-09.png\">U-3 unemployment hit 9.8 percent</a>, with U-6 unemployment at 17 percent.</p><p>Note that the Fed’s vast team of academic economists armed with PhDs can’t get to within 98 percent precision in two tries, the latter only four months out, while I was able to forecast U.S. housing prices at 99.3 percent accuracy eleven months in advance.  (The mid-range of their nine-month forecast was only at the 88.8 percent level!) Now, bearing in mind that I have absolutely no idea what the price of money or the size of the money supply should be, why in the name of the netherest nether Hell should anyone believe that <i>they</i> do?</p></div>",
  "content_text": "I don’t mean wrong in the sense that they have announced that the economy is recovering, but it really isn’t.  Well, yes, they’re wrong in that regard too, but I have something a little more\nspecific and immediately verifiable\nin mind:\nThe Fed’s forecasts, released as part of the minutes from its April meeting, show that its staff now expects the unemployment rate to rise to between 9.2% and 9.6% this year. The central bank had forecast in January that the jobless rate would be in a range of 8.5% to 8.8%, but the unemployment rate topped that in April, hitting 8.9%.\nMish notes the fact of two Fed forecasts, one in January and one in May.  Each declared a maximum U-3 unemployment rate, first 8.8 percent, then 9.6 percent.  Today, the BLS announced that\nU-3 unemployment hit 9.8 percent\n, with U-6 unemployment at 17 percent.\nNote that the Fed’s vast team of academic economists armed with PhDs can’t get to within 98 percent precision in two tries, the latter only four months out, while I was able to forecast U.S. housing prices at 99.3 percent accuracy eleven months in advance.  (The mid-range of their nine-month forecast was only at the 88.8 percent level!) Now, bearing in mind that I have absolutely no idea what the price of money or the size of the money supply should be, why in the name of the netherest nether Hell should anyone believe that\nthey\ndo?",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-02T18:28:00+00:00"
}