{
  "url": "https://voxday.net/2009/10/24/finishing-off-euthyphro/",
  "scraped_at": "2026-01-08T23:10:23.746435",
  "title": "Finishing off Euthyphro’s dilemmas",
  "date_display": "October 24, 2009",
  "date_iso": "2009-10-24T19:50:00+00:00",
  "date_from_url": "2009-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was a little disappointed that drj wasn’t able to come back and finish <a href=\"http://www.milobookclub.com/2009/10/20/you-dont-know-euthyphro/\">our discussion of the Euthyphro Dilemma</a> the other day.  Drj made an interesting case for distinguishing between the Dilemma, referring to the Socratic dialogue, and the dilemma, referring to the logical structure of the argument that is the conclusion of the Dilemma.  Now, I still take issue with the validity of attempting to utilize the dilemma <i>ex nihilo</i> and ignoring both the integral flaws and specifics of the Dilemma, but since drj and others were willing to concede that a) the Dilemma does not apply to a non-polytheistic situation and b) Socrates was artificially narrowing the definition of “the pious” in order to create the dilemma, I was willing to consider the dilemma in its various modern formulations.</p><p>After being requested to provide a modern formulation, drj gave us this one: <i>“Is that which is moral commanded by God because it is moral, or is it moral because it is commanded by God?”</i></p><p>This formulation avoids several problems with the Dilemma, since the substitution of “moral”, “commanded”, and “God” for “the pious”, “loved”, and “gods”, not only avoids the problem that caused Socrates to twice narrow his definition of “the pious”, but further narrows the key definition by limiting it to actions alone.  When I responded that a similar formulation – <i>Is that which is science performed by scientists because it is science or is it science because it is performed by scientists?</i> – does not cause anyone to insist that science does not exist or that scientists cannot perform science, drj argued that it is not the mere fact of the tautology that matters, but rather, the specific implications of which horn is selected for the relevant subjects.</p><blockquote><p>That conclusion doesn’t arise by simply formulating the argument – it is proposed to come about after one picks the second horn of the dilemma. If one accepted the second horn in your science version, than yes, science would then be simply defined as whatever scientists do. If one were to then say the phrase “scientists are very scientific”, it would appear to have lost any substantive meaning.</p><p>As for the first horn, I’m not sure it your version has the same issues that the monotheistic dilemma does. It makes sense to pick the first horn, but doing so simply doesn’t raise any controversial issues about the nature of a scientist or science, as it does with theism and morality.</p><p>Scientists do practice science because it is science, but not everything they do is science. It poses no problem for the scientist to say that he is constrained in his actions as a scientist, to the rules of science. It however, might pose a problem for certain claims about the monotheistic God, since it suggests that God is actually subject to external rules (just like the scientist).</p></blockquote><p>But first, this explanation removes the idea that the argument’s core logical structure is the relevant part.  Moreover, the idea that a scientist is limited to the scientific method in performing science is not quite as uncontroversial as drj suggests, because acceptance of the first horn would eliminate everything from string theory to evolution from the realm of the scientific.  Second, another formulation will suffice to demonstrate that the logical structure of the argument poses no theological or philosophical problems for either morality or God.</p><p><i>“Is that which is legal legislated by the legislature because it is legal, or is it legal because it is legislated by the legislature?”</i></p><p>As with the modern formulation, the answer here is quite obviously the second horn of the “dilemma”.  Judicial- and executive-branch encroachment on the legislative function notwithstanding, the legality of a law depends solely upon the fact that it was legislated by the relevant legislature.  Nor can there be any question that a legislature has the power to set itself above the legality of its own laws since we see Congress doing this on a regular basis.  And yet, no sane being would claim that this somehow calls into question the existence or the substantive meaning of either the law or the legislature.</p><p>An act which was not legal yesterday is transformed into legality by the act of legislation.  So, unless one genuinely wishes to argue that there is no substantive meaning to saying “that which is legal is legal because it is legislated by Congress”, one cannot possibly argue that there is no substantive meaning to saying “that which is moral is moral because it is commanded by God.”</p><p>And therefore, Euthyphro’s Dilemma and Euthyphro’s dilemma are defeated, both the Socratic argument as well as the modern logical structure.  Should drj or anyone else wish to take exception to this conclusion, I invite them to demonstrate any flaws in my reasoning.</p></div>",
  "content_text": "I was a little disappointed that drj wasn’t able to come back and finish\nour discussion of the Euthyphro Dilemma\nthe other day.  Drj made an interesting case for distinguishing between the Dilemma, referring to the Socratic dialogue, and the dilemma, referring to the logical structure of the argument that is the conclusion of the Dilemma.  Now, I still take issue with the validity of attempting to utilize the dilemma\nex nihilo\nand ignoring both the integral flaws and specifics of the Dilemma, but since drj and others were willing to concede that a) the Dilemma does not apply to a non-polytheistic situation and b) Socrates was artificially narrowing the definition of “the pious” in order to create the dilemma, I was willing to consider the dilemma in its various modern formulations.\nAfter being requested to provide a modern formulation, drj gave us this one:\n“Is that which is moral commanded by God because it is moral, or is it moral because it is commanded by God?”\nThis formulation avoids several problems with the Dilemma, since the substitution of “moral”, “commanded”, and “God” for “the pious”, “loved”, and “gods”, not only avoids the problem that caused Socrates to twice narrow his definition of “the pious”, but further narrows the key definition by limiting it to actions alone.  When I responded that a similar formulation –\nIs that which is science performed by scientists because it is science or is it science because it is performed by scientists?\n– does not cause anyone to insist that science does not exist or that scientists cannot perform science, drj argued that it is not the mere fact of the tautology that matters, but rather, the specific implications of which horn is selected for the relevant subjects.\nThat conclusion doesn’t arise by simply formulating the argument – it is proposed to come about after one picks the second horn of the dilemma. If one accepted the second horn in your science version, than yes, science would then be simply defined as whatever scientists do. If one were to then say the phrase “scientists are very scientific”, it would appear to have lost any substantive meaning.\nAs for the first horn, I’m not sure it your version has the same issues that the monotheistic dilemma does. It makes sense to pick the first horn, but doing so simply doesn’t raise any controversial issues about the nature of a scientist or science, as it does with theism and morality.\nScientists do practice science because it is science, but not everything they do is science. It poses no problem for the scientist to say that he is constrained in his actions as a scientist, to the rules of science. It however, might pose a problem for certain claims about the monotheistic God, since it suggests that God is actually subject to external rules (just like the scientist).\nBut first, this explanation removes the idea that the argument’s core logical structure is the relevant part.  Moreover, the idea that a scientist is limited to the scientific method in performing science is not quite as uncontroversial as drj suggests, because acceptance of the first horn would eliminate everything from string theory to evolution from the realm of the scientific.  Second, another formulation will suffice to demonstrate that the logical structure of the argument poses no theological or philosophical problems for either morality or God.\n“Is that which is legal legislated by the legislature because it is legal, or is it legal because it is legislated by the legislature?”\nAs with the modern formulation, the answer here is quite obviously the second horn of the “dilemma”.  Judicial- and executive-branch encroachment on the legislative function notwithstanding, the legality of a law depends solely upon the fact that it was legislated by the relevant legislature.  Nor can there be any question that a legislature has the power to set itself above the legality of its own laws since we see Congress doing this on a regular basis.  And yet, no sane being would claim that this somehow calls into question the existence or the substantive meaning of either the law or the legislature.\nAn act which was not legal yesterday is transformed into legality by the act of legislation.  So, unless one genuinely wishes to argue that there is no substantive meaning to saying “that which is legal is legal because it is legislated by Congress”, one cannot possibly argue that there is no substantive meaning to saying “that which is moral is moral because it is commanded by God.”\nAnd therefore, Euthyphro’s Dilemma and Euthyphro’s dilemma are defeated, both the Socratic argument as well as the modern logical structure.  Should drj or anyone else wish to take exception to this conclusion, I invite them to demonstrate any flaws in my reasoning.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-24T18:50:00+00:00"
}