{
  "url": "https://voxday.net/2009/10/26/historys-verdic/",
  "scraped_at": "2026-01-08T23:10:34.726594",
  "title": "History’s verdict",
  "date_display": "October 26, 2009",
  "date_iso": "2009-10-26T14:15:00+00:00",
  "date_from_url": "2009-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://mises.org/story/3717\">Economics and Moral Courage</a>, by Llewellyn Rockwell, is one of the most intellectually inspiring articles I have ever read.  It is a beautiful reminder of the transience of what we think is worldly success and accomplishment:</p><blockquote><p>While Mises worked at the Chamber of Commerce because he was denied a paid position at the University of Vienna, [Hans] Mayer served as one of three full professors there, along with socialist Othmar Spann and Count Degenfeld-Schonburg.  Of Spann, Mises wrote that “he did not teach economics. Instead he preached National Socialism.” Of the count, Mises wrote that he was “poorly versed in the problems of economics.”</p><p>It was Mayer who was the truly formidable one. Yet he was no original thinker. Mises wrote that his “lectures were miserable, and his seminar was not much better.” Mayer wrote only a handful of essays. But then, his main concern had nothing to do with theory and nothing to do with ideas. His focus was on academic power within the department and within the profession….</p><p>[Mayer] thrived before the Nazis. He thrived during the Nazi takeover. He helped the Nazis purge the Jews and the liberals from his department. Note that Mayer was no raging anti-Semite himself. His decision was a result of a series of discrete choices for position and power in the profession against truth and principle. For a time, this seemed harmless in some way. And then the moment of truth arrived and he played a role in the mass slaughter of ideas and those who held them.</p><p>Perhaps Mayer thought he had made the right choice. After all, he maintained his privileges and perks. And after the war, when the Communists came and took over the department, he thrived then too. He did all that an academic was supposed to do to get ahead, and achieved all the glory that an academic can achieve, regardless of the circumstances…. He played the game and that was all he did. He thought he won, but history has rendered a different judgment.  He died in 1955. And then what happened? Justice finally arrived. He was instantly forgotten. Of all the students he had during his life, he had none after death. There were no Mayerians. Hayek reflected on the amazing development in an essay. He expected much to come out of the Wieser-Mayer school, but not much to come out of the Mises branch. He writes that the very opposite happened. Mayer’s machine seemed promising, but it broke down completely, while Mises had no machine at all and he became the leader of a global colossus of ideas.</p><p>If we look at Mark Blaug’s book <i>Who’s Who in Economics</i>, a 1,300-page tome, there is an entry for Menger, Hayek, Böhm-Bawerk, and, of course, Ludwig von Mises. The entry calls Mises “the leading twentieth-century figure of the Austrian School” and credits him with contributions to methodology, price theory, business-cycle theory, monetary theory, socialist theory, and interventionism. There is no mention of the price he paid in life, no mention of his courageous moral choices, no mention of the grim reality of a life moving from country to country to stay ahead of the state. He ended up being known only for his triumphs, about which not even Mises was ever made aware during his own life.</p><p>And guess what? There is no entry at all in this same book for Hans Mayer.</p></blockquote><p>Mayer was the typical academic intellectual dwarf and richly deserves to be forgotten by history, but to me the ultimate villain of the piece is Friedrich von Wieser.  Can you imagine having the opportunity to anoint either Ludwig von Mises or Joseph Schumpeter as your successor and then somehow deciding to choose <i>neither of them</i>?  That has got to be the worst employment decision in the history of economics, and quite possibly academics.  It may even have been the most calamitous if one thinks through how much unnecessary economic pain and devastation could have been prevented.</p><p>As brilliant and revolutionary as Mises was, I think I would have preferred to hire Schumpeter to head the department.  His <i>History</i> shows that his perspective was unusually broad and saddling him with the bureaucratic responsibilities would have kept Mises free to focus entirely on research.  Then Schumpeter could have gotten rid of Spann, hired Hayek, and you’d have had the greatest economics department in history despite its small size.  And with that collection of highly functioning brainpower assembled in one place, it’s quite possible that they would have achieved sufficient prestige to prove capable of preventing the Keynesian ascension.  What a tremendous opportunity for Mankind missed.  And what an interestingly esoteric possibility for an alternate history novel….</p></div>",
  "content_text": "Economics and Moral Courage\n, by Llewellyn Rockwell, is one of the most intellectually inspiring articles I have ever read.  It is a beautiful reminder of the transience of what we think is worldly success and accomplishment:\nWhile Mises worked at the Chamber of Commerce because he was denied a paid position at the University of Vienna, [Hans] Mayer served as one of three full professors there, along with socialist Othmar Spann and Count Degenfeld-Schonburg.  Of Spann, Mises wrote that “he did not teach economics. Instead he preached National Socialism.” Of the count, Mises wrote that he was “poorly versed in the problems of economics.”\nIt was Mayer who was the truly formidable one. Yet he was no original thinker. Mises wrote that his “lectures were miserable, and his seminar was not much better.” Mayer wrote only a handful of essays. But then, his main concern had nothing to do with theory and nothing to do with ideas. His focus was on academic power within the department and within the profession….\n[Mayer] thrived before the Nazis. He thrived during the Nazi takeover. He helped the Nazis purge the Jews and the liberals from his department. Note that Mayer was no raging anti-Semite himself. His decision was a result of a series of discrete choices for position and power in the profession against truth and principle. For a time, this seemed harmless in some way. And then the moment of truth arrived and he played a role in the mass slaughter of ideas and those who held them.\nPerhaps Mayer thought he had made the right choice. After all, he maintained his privileges and perks. And after the war, when the Communists came and took over the department, he thrived then too. He did all that an academic was supposed to do to get ahead, and achieved all the glory that an academic can achieve, regardless of the circumstances…. He played the game and that was all he did. He thought he won, but history has rendered a different judgment.  He died in 1955. And then what happened? Justice finally arrived. He was instantly forgotten. Of all the students he had during his life, he had none after death. There were no Mayerians. Hayek reflected on the amazing development in an essay. He expected much to come out of the Wieser-Mayer school, but not much to come out of the Mises branch. He writes that the very opposite happened. Mayer’s machine seemed promising, but it broke down completely, while Mises had no machine at all and he became the leader of a global colossus of ideas.\nIf we look at Mark Blaug’s book\nWho’s Who in Economics\n, a 1,300-page tome, there is an entry for Menger, Hayek, Böhm-Bawerk, and, of course, Ludwig von Mises. The entry calls Mises “the leading twentieth-century figure of the Austrian School” and credits him with contributions to methodology, price theory, business-cycle theory, monetary theory, socialist theory, and interventionism. There is no mention of the price he paid in life, no mention of his courageous moral choices, no mention of the grim reality of a life moving from country to country to stay ahead of the state. He ended up being known only for his triumphs, about which not even Mises was ever made aware during his own life.\nAnd guess what? There is no entry at all in this same book for Hans Mayer.\nMayer was the typical academic intellectual dwarf and richly deserves to be forgotten by history, but to me the ultimate villain of the piece is Friedrich von Wieser.  Can you imagine having the opportunity to anoint either Ludwig von Mises or Joseph Schumpeter as your successor and then somehow deciding to choose\nneither of them\n?  That has got to be the worst employment decision in the history of economics, and quite possibly academics.  It may even have been the most calamitous if one thinks through how much unnecessary economic pain and devastation could have been prevented.\nAs brilliant and revolutionary as Mises was, I think I would have preferred to hire Schumpeter to head the department.  His\nHistory\nshows that his perspective was unusually broad and saddling him with the bureaucratic responsibilities would have kept Mises free to focus entirely on research.  Then Schumpeter could have gotten rid of Spann, hired Hayek, and you’d have had the greatest economics department in history despite its small size.  And with that collection of highly functioning brainpower assembled in one place, it’s quite possible that they would have achieved sufficient prestige to prove capable of preventing the Keynesian ascension.  What a tremendous opportunity for Mankind missed.  And what an interestingly esoteric possibility for an alternate history novel….",
  "tags": [
    "economics",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-26T14:15:00+00:00"
}