{
  "url": "https://voxday.net/2009/10/11/in-which-orac-makes-belated-discovery/",
  "scraped_at": "2026-01-08T23:09:08.852714",
  "title": "In which Orac makes a belated discovery",
  "date_display": "October 11, 2009",
  "date_iso": "2009-10-11T09:53:00+00:00",
  "date_from_url": "2009-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins doesn’t actually give a damn about either science or reason. <a href=\"http://scienceblogs.com/insolence/2009/10/here_are_those_inconvenient_questions_fo.php\">He just hates religion</a>:</p><blockquote><p>Let me repeat that again: I know nothing of any stance he [Bill Maher] may have taken on medical questions. No followup of “what are your complaints?” or “please tell me what you mean.” No “so, what are Maher’s medical views that upset you all so?” It’s as if Dawkins just didn’t care. La-de-da. So what if Maher supports quackery? No problem. As long as he bashes religion, it’s all good.</p></blockquote><p>It’s taken him a while, but it’s good to see that Orac has finally achieved a more accurate understanding of a few of his fellow atheists.  On a related note, <a href=\"http://www.guardian.co.uk/commentisfree/belief/2009/oct/08/atheism-religion-class-science\">this attempted defense of the New Atheists</a> is based on a false foundation:</p><blockquote><p>While some critics of the “new atheists” have made valid arguments, primarily that their optimistic humanism is far from realistic, they are missing out on a simple point: adhering to a scientific worldview requires discipline; it requires giving up on the certainties of childhood and the belief in ultimate protection. I don’t know whether doing so turns us into better human beings, but it certainly makes us intellectually more responsible.</p></blockquote><p>This is why TIA was particularly devastating to the New Atheists’ arguments and why they were forced to retreat from making many of those they had been making prior to its release.  For all that they pretended to ignore the book, you’ll note that you seldom see the Red State argument or “religion causes war” anymore.  Most have even abandoned the “No True Atheist” attempt to absolve atheism for the crimes of historical atheists, although many still cling foolishly to the ludicrous “In the name of” variant.  I’m probably most pleased that no one has even attempted to defend Daniel Dennett’s incompetent attempt to justify the division of doxastic labor on the part of “scientific” belief, although I suspect this has far more to do with the inability of most atheists to read or understand Dennett than it does with <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\">the conclusive nature of my criticism</a> of his logic.</p><p>The New Atheists are precisely the opposite of intellectually responsible.  That’s part of what distinguishes them from more honest atheists such as Meslier and Russell, who did not seek to cloak their disbelief under a fraudulent veil of science.  As I have repeatedly pointed out, their coherent arguments are reliably anti-scientific, as they repeatedly reject objective observation in favor of logic – and bad logic at that.  To give one example, it is an incontrovertible and undeniable fact that no amount of “magical thinking” prevents an individual from being a superlative scientist thanks to the fact that the scientific method is not an ideology or even a belief, it is merely a process.  And yet, this hasn’t prevented Sam Harris and others from not only claiming that it does, <i>but that it must</i>.  (Dawkins, surprisingly, appears to have realized the demonstrable absurdity of this position and rejected both it and its application to Harris’s primary target, Frances Collins.)  One may also note that the religious USA appears to have done rather well in collecting science-related Nobel prizes this year contra the New Atheist position on the incompatibility of religion and science.</p><p>As for their vast catalog of incoherent arguments, the piece by Strenger serves as a reasonable example.  There is nothing comforting or certain about Christianity taken in sum, even if there is comfort and hope to be found in Jesus Christ.  The assurance of “ultimate protection” for those who elect to follow the hard and narrow way in Christianity is distinctly qualified and there is no similar assurance of any kind to be found in any religion except possibly for Islam.</p><p>Where, I wonder, is intellectual responsibility to be found in repeatedly attacking the nonexistent figments of one’s imagination?</p></div>",
  "content_text": "Richard Dawkins doesn’t actually give a damn about either science or reason.\nHe just hates religion\n:\nLet me repeat that again: I know nothing of any stance he [Bill Maher] may have taken on medical questions. No followup of “what are your complaints?” or “please tell me what you mean.” No “so, what are Maher’s medical views that upset you all so?” It’s as if Dawkins just didn’t care. La-de-da. So what if Maher supports quackery? No problem. As long as he bashes religion, it’s all good.\nIt’s taken him a while, but it’s good to see that Orac has finally achieved a more accurate understanding of a few of his fellow atheists.  On a related note,\nthis attempted defense of the New Atheists\nis based on a false foundation:\nWhile some critics of the “new atheists” have made valid arguments, primarily that their optimistic humanism is far from realistic, they are missing out on a simple point: adhering to a scientific worldview requires discipline; it requires giving up on the certainties of childhood and the belief in ultimate protection. I don’t know whether doing so turns us into better human beings, but it certainly makes us intellectually more responsible.\nThis is why TIA was particularly devastating to the New Atheists’ arguments and why they were forced to retreat from making many of those they had been making prior to its release.  For all that they pretended to ignore the book, you’ll note that you seldom see the Red State argument or “religion causes war” anymore.  Most have even abandoned the “No True Atheist” attempt to absolve atheism for the crimes of historical atheists, although many still cling foolishly to the ludicrous “In the name of” variant.  I’m probably most pleased that no one has even attempted to defend Daniel Dennett’s incompetent attempt to justify the division of doxastic labor on the part of “scientific” belief, although I suspect this has far more to do with the inability of most atheists to read or understand Dennett than it does with\nthe conclusive nature of my criticism\nof his logic.\nThe New Atheists are precisely the opposite of intellectually responsible.  That’s part of what distinguishes them from more honest atheists such as Meslier and Russell, who did not seek to cloak their disbelief under a fraudulent veil of science.  As I have repeatedly pointed out, their coherent arguments are reliably anti-scientific, as they repeatedly reject objective observation in favor of logic – and bad logic at that.  To give one example, it is an incontrovertible and undeniable fact that no amount of “magical thinking” prevents an individual from being a superlative scientist thanks to the fact that the scientific method is not an ideology or even a belief, it is merely a process.  And yet, this hasn’t prevented Sam Harris and others from not only claiming that it does,\nbut that it must\n.  (Dawkins, surprisingly, appears to have realized the demonstrable absurdity of this position and rejected both it and its application to Harris’s primary target, Frances Collins.)  One may also note that the religious USA appears to have done rather well in collecting science-related Nobel prizes this year contra the New Atheist position on the incompatibility of religion and science.\nAs for their vast catalog of incoherent arguments, the piece by Strenger serves as a reasonable example.  There is nothing comforting or certain about Christianity taken in sum, even if there is comfort and hope to be found in Jesus Christ.  The assurance of “ultimate protection” for those who elect to follow the hard and narrow way in Christianity is distinctly qualified and there is no similar assurance of any kind to be found in any religion except possibly for Islam.\nWhere, I wonder, is intellectual responsibility to be found in repeatedly attacking the nonexistent figments of one’s imagination?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-11T08:53:00+00:00"
}