{
  "url": "https://voxday.net/2009/10/19/just-one-question/",
  "scraped_at": "2026-01-08T23:09:50.924413",
  "title": "Just one question",
  "date_display": "October 19, 2009",
  "date_iso": "2009-10-19T14:15:00+00:00",
  "date_from_url": "2009-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger notes that no one in the media <a href=\"http://market-ticker.denninger.net/archives/1518-FDIC-Bankrupt-Uh-Huh-Again.html\">seems interested in asking it</a>:</p><blockquote><p>Note that nobody in the mainstream media bothers to bring up “Prompt Corrective Action” and demand from Bair and rest the answer to one simple question: “How does a bank get into a situation where it has a 20, 30, 40, 50% loss on it’s asset base when Prompt Corrective Action and Tier Capital requirements are supposed to cause banks to be seized before ANY loss occurs?”</p></blockquote><p>The present U.S. financial system isn’t merely based on sand, it’s based on the <i>pretense</i> of sand.  Meanwhile, Mike Shedlock catalogs a surprisingly long list of stories about <a href=\"http://globaleconomicanalysis.blogspot.com/2009/10/where-hell-is-outrage.html\">the incestuous Goldman-government circle</a> before wondering why so few Americans are upset about the way a few financial interests are exercising their power to monopolize the economy for their own benefit and to the detriment of the nation, the economy, and the public.  The post is well worth reading; I’m sure you’ll all be relieved to know that the responsibility for avoiding the regulatory failures of the recent past has been placed in the capable hands of the new COO of the SEC, a 29 year-old Goldman guy.</p><p>Unfortunately, since both the Republican and Democratic elite are beholden to the banks rather than to their party’s bases, there is very little chance of this coming to an end in a rational manner.  A small percentage of the American people are infuriated already, but most are still fat and happily feasting on junk food regardless of their employment status.  If they ever become lean and hungry, they’re not likely to sit idly by watching bankers pay themselves billions for stealing taxpayer money while they fall from the comfortable middle class into poverty.</p><p>It’s good to be a bankster now.  But keep in mind, there was also a time when it was good to be a French aristocrat.</p></div>",
  "content_text": "Karl Denninger notes that no one in the media\nseems interested in asking it\n:\nNote that nobody in the mainstream media bothers to bring up “Prompt Corrective Action” and demand from Bair and rest the answer to one simple question: “How does a bank get into a situation where it has a 20, 30, 40, 50% loss on it’s asset base when Prompt Corrective Action and Tier Capital requirements are supposed to cause banks to be seized before ANY loss occurs?”\nThe present U.S. financial system isn’t merely based on sand, it’s based on the\npretense\nof sand.  Meanwhile, Mike Shedlock catalogs a surprisingly long list of stories about\nthe incestuous Goldman-government circle\nbefore wondering why so few Americans are upset about the way a few financial interests are exercising their power to monopolize the economy for their own benefit and to the detriment of the nation, the economy, and the public.  The post is well worth reading; I’m sure you’ll all be relieved to know that the responsibility for avoiding the regulatory failures of the recent past has been placed in the capable hands of the new COO of the SEC, a 29 year-old Goldman guy.\nUnfortunately, since both the Republican and Democratic elite are beholden to the banks rather than to their party’s bases, there is very little chance of this coming to an end in a rational manner.  A small percentage of the American people are infuriated already, but most are still fat and happily feasting on junk food regardless of their employment status.  If they ever become lean and hungry, they’re not likely to sit idly by watching bankers pay themselves billions for stealing taxpayer money while they fall from the comfortable middle class into poverty.\nIt’s good to be a bankster now.  But keep in mind, there was also a time when it was good to be a French aristocrat.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-19T13:15:00+00:00"
}