{
  "url": "https://voxday.net/2009/10/27/late-but-better-than-never/",
  "scraped_at": "2026-01-08T23:10:45.882106",
  "title": "Late, but better than never",
  "date_display": "October 27, 2009",
  "date_iso": "2009-10-27T20:30:00+00:00",
  "date_from_url": "2009-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s was obvious that <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/10/26/AR2009102603394.html?hpid=topnews&amp;sid=ST2009102603447\">the strategists had no idea what to do</a> about 10 minutes after they successfully kicked out the Taliban with the help of the Northern Alliance.  In fairness, this was mostly because there was nothing of material benefit to the USA to be gained there.  The invasion and campaign were brilliant, but the occupation was awesomely stupid.  I thought the decision to allow the DEA to co-opt foreign policy was the particular highlight.</p><blockquote><p>“I have lost understanding of and confidence in the strategic purposes of the United States’ presence in Afghanistan,” he wrote Sept. 10 in a four-page letter to the department’s head of personnel. “I have doubts and reservations about our current strategy and planned future strategy, but my resignation is based not upon how we are pursuing this war, but why and to what end.”</p><p>[M]any Afghans, he wrote in his resignation letter, are fighting the United States largely because its troops are there — a growing military presence in villages and valleys where outsiders, including other Afghans, are not welcome and where the corrupt, U.S.-backed national government is rejected. While the Taliban is a malign presence, and Pakistan-based al-Qaeda needs to be confronted, he said, the United States is asking its troops to die in Afghanistan for what is essentially a far-off civil war.</p></blockquote><p>While I applaud Captain Hoh’s integrity as well as his belated recognition of the futility of U.S. efforts in Afghanistan, he really should have recognized this several years ago.  It is not a surprise that an occupied nation would fight the occupying forces and there is no rational national interest in the USA continuing to keep its military forces stationed in either Iraq or Afghanistan.  All they can reasonably expect to do is to further destabilize the region while providing a sitting target for the various sides jousting for advantage there.</p><p>As the Romans knew, if you’re not going to settle colonists in a conquered territory, you’re not going to stay.  And if you’re not going to stay, there is absolutely no reason to occupy territory once the initial objectives have been realized.</p></div>",
  "content_text": "It’s was obvious that\nthe strategists had no idea what to do\nabout 10 minutes after they successfully kicked out the Taliban with the help of the Northern Alliance.  In fairness, this was mostly because there was nothing of material benefit to the USA to be gained there.  The invasion and campaign were brilliant, but the occupation was awesomely stupid.  I thought the decision to allow the DEA to co-opt foreign policy was the particular highlight.\n“I have lost understanding of and confidence in the strategic purposes of the United States’ presence in Afghanistan,” he wrote Sept. 10 in a four-page letter to the department’s head of personnel. “I have doubts and reservations about our current strategy and planned future strategy, but my resignation is based not upon how we are pursuing this war, but why and to what end.”\n[M]any Afghans, he wrote in his resignation letter, are fighting the United States largely because its troops are there — a growing military presence in villages and valleys where outsiders, including other Afghans, are not welcome and where the corrupt, U.S.-backed national government is rejected. While the Taliban is a malign presence, and Pakistan-based al-Qaeda needs to be confronted, he said, the United States is asking its troops to die in Afghanistan for what is essentially a far-off civil war.\nWhile I applaud Captain Hoh’s integrity as well as his belated recognition of the futility of U.S. efforts in Afghanistan, he really should have recognized this several years ago.  It is not a surprise that an occupied nation would fight the occupying forces and there is no rational national interest in the USA continuing to keep its military forces stationed in either Iraq or Afghanistan.  All they can reasonably expect to do is to further destabilize the region while providing a sitting target for the various sides jousting for advantage there.\nAs the Romans knew, if you’re not going to settle colonists in a conquered territory, you’re not going to stay.  And if you’re not going to stay, there is absolutely no reason to occupy territory once the initial objectives have been realized.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-27T20:30:00+00:00"
}