{
  "url": "https://voxday.net/2009/10/15/letter-to-common-sense-atheism-iii/",
  "scraped_at": "2026-01-08T23:09:28.998104",
  "title": "Letter to Common Sense Atheism III",
  "date_display": "October 15, 2009",
  "date_iso": "2009-10-15T12:46:00+00:00",
  "date_from_url": "2009-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Luke,</p><p>I find it amusing, if not unexpected, that you continue to attempt rambling on about evolution.  It is, as you have admitted, a tangent, but more precisely, it is an irrelevant tangent which has absolutely nothing to do with the discourse to which you invited me.  To charge me with making false assertions and empty hand-waving because I made the mistake of directly answering one of your irrelevant questions is a very strange thing to do, especially when one considers that in that very same letter you neglected to answer the only questions I have asked of you.  I am also somewhat mystified by your decision to selectively quote <a href=\"http://www.milobookclub.com/2009/01/01/rules-of-blog_01/\">the rules of my blog</a> to me as if they were applicable here.  But, as you have appealed to those rules, I shall quote the two that are most relevant as they will suffice to bring your repeated attempt to derail this discussion to an end.</p><p><i>3.  Cross-comments and off-topic comments will usually be deleted. If your comment gets deleted, deal with it. Don’t try to argue with me about it, I’m truly not interested.</i></p><p>10.  Any insertion of evolution or Creationism into a post that is not directly and specifically related to either subject will be deleted. Repeated efforts to do so will result in banning.</p><p>The mere existence of Rule #10 shows how your attempt to turn a discussion about Christianity into one about evolution and/or Creationism is tiresomely predictable in addition to being exactly the pointless sort of thing that this discourse was proposed to avoid.  I also note that your claim to have directly rebutted my three assertions with relevant evidence, argument, and examples is clearly false because the evidence, argument, and examples you provided only served to prove that you had no idea what I was talking about.  I will not bother to support this, even though I could easily do so, for what should be the obvious reason that <i>it is not relevant to this discussion!</i> As many others have done in the past, you are assuming that a refusal to explain something is tantamount to an inability to explain it.  This is not only an illogical assumption but an incorrect one, as I shall soon demonstrate by explaining what I neglected to explain in my previous letter.</p><p>I don’t believe it is accurate to say that my tactics rely upon either obscurantism or <i>unmerited</i> dismissal.  Indeed, by asserting that I am being obscure about the Christian doctrine of the Fall, you paint yourself with the very label I had not hitherto seen any justification to apply, as failing to spell out an obvious conclusion cannot reasonably be confused with being obscure.  I had assumed you were merely ignorant about Christian theology, but if you are not being disingenuous in asserting your failure to understand something as simple as C.S. Lewis’s metaphorical explication of it in the form of science fiction for children, then it will be very difficult for me or anyone else who did understand the metaphor to draw anything other than the obvious conclusion.  Having studied Sam Harris’s debates, I can certainly feel some sympathy regarding your frustration at my claim that you have misunderstood what I have written at almost every turn, but in this particular case, it doesn’t change the fact that you have clearly failed to understand what I wrote.  More importantly, it doesn’t change the fact that most of the people reading our letters had no trouble understanding what you did not.</p><p>Granted, it is not my custom to explain what I consider to be the obvious.  Most of my regular readers are intelligent enough to draw logical conclusions and refusing to spell out the obvious serves as a surprisingly effective means of weeding out the less intelligent critics whose specious and petty critiques are of no interest or benefit to me.  But, in the interest of not being obscure, I will explain my reasoning in greater detail inasmuch as it is directly relevant to the topic of why I am a Christian.  In the example of obscurantism that you mentioned, you wrote that I failed to explain why <i>Out of the Silent Planet</i> is titled as it is, and what the implications of Satan’s temptation of Jesus Christ in the desert are.  Very well, let us address those two points.</p><p>In the Lewis book, Thulcandra, or “the Silent Planet”, refers to the Earth, which, being “bent”, no longer participates in the music of the celestial spheres with the eldila or even communicates with anyone outside the orbit of the Moon.  Hence the appellation “silent”.  Thulcandra is not ruled by the Old One (the Creator God) or Maleldil the Young (Jesus Christ), but by its bent Oyarsa (angelic planetary principality), who represents Lucifer/Satan.  This idea of a world which is ruled by an evil being in rebellion against the Creator God is based on the fundamental Christian theological doctrine of the Fall, which has been told many times in Western literature and is most clearly demonstrated in the Bible by the temptation of Jesus Christ in the desert.  When Satan offered Jesus all the kingdoms of the world in return for his worship, Jesus did not argue that the world was not Satan’s to give as he presumably would have if it were a false offer, (which, as the Son of God he would very well have known), instead he merely refused it.  This strongly suggests that the world is not completely under the direction and control of the Creator God as most atheists assume Christians believe, but is instead ruled by an evil, intelligent, and malicious being who seeks to be worshipped in the place of God.  This concept is further confirmed in numerous places in the Bible, such as when Jesus tells his disciples that “the prince of this world cometh” in Matthew 14:30 and when Paul refers to “the god of this age” in 2nd Corinthians 4:4.  While there is debate among Christians about the extent of this being’s rule, which according to the Bible extends to the <i>aion</i> but not the <i>kosmos</i>, as well as the timing and nature of the end of that rule, there is no serious theological dispute as to the existence of either the evil being or his worldly reign.</p><p>The nature of the being who rules over the world is a tremendously important point to understand for both the Christian and the atheist.  While the atheist can, as many Christians do, wonder about why a deity of sufficient power to end the reign of an evil ruler would not act immediately to do so, it is as illogical for a Christian to blame God for the actions of Satan as it is for a Vikings fan to blame Brad Childress because Percy Harvin ran an incorrect route.  There is no question that Childress could have prevented his wide receiver from running the wrong route by keeping him on the bench, but there is also no question that Harvin was told what the correct route was and chose to run the wrong one anyhow, thereby making Harvin, not Childress, the responsible party.  The analogy is not quite precise, of course.  A more accurate one would be akin to Childress deciding to start Harvin, followed by Bernard Berrian telling Harvin to sit down and let him run the route prior to sneaking in the game and running it incorrectly.  We can blame both Berrian and Harvin for the subsequent incompletion, but we cannot reasonably blame Childress except for his poor judgment in permitting both players the freedom to think for themselves and make their own decisions.  The inherent conflict between a benevolent Creator and a fallen world leads inevitably to the very mainstream Christian doctrine of free will, which is why some atheists such as Sam Harris and Daniel Dennett are so determined to prove that free will does not exist, or is at best an illusion.</p><p>And this leads us to consider some of your more interesting assertions.  Contrary to your fallacious claim to be “<i>too</i> familiar with Christian theology – or rather, Christian <i>theologies</i>”, you demonstrated your ignorance of not only conventional Christian theology, but philosophy in general, when you claimed that you could not possibly have predicted that I would hold the view that God’s goodness is arbitrary.  In fact, it is apparent that your level of knowledge does not even rise <a href=\"”http://en.wikipedia.org/wiki/Euthyphro_dilemma#Attempts_to_resolve_the_dilemma%E2%80%9D”\">to the level of Wikipedia</a>:</p><p><i>“Christian philosophers, starting with Thomas Aquinas have often answered that the dilemma is false: yes, God commands something because it is good, but the reason it is good is that “good is an essential part of God’s nature”. So goodness is grounded in God’s character and merely expressed in moral commands. Therefore whatever a good God commands will always be good.  Fr. Owen Carroll notes that the medieval philosophical tradition Realism, to which Aquinas belonged, assumes that the model that God used when creating the universe was within Himself so that the goodness of this world reflects and participates in some limited way and extent in the infinite goodness of God’s own divine nature. The position of the opposing school of Nominalism maintains that the model that God used when creating the universe is outside of God and thus the goodness of this world is alien to the goodness of God Himself. The moral consequence of the latter position is that whatever God wills is good, even if it is inherently contradictory and morally arbitrary according to the light of human reason.”</i></p><p>Now, my view of God’s arbitrary goodness is not actually Nominalist, the philosophical school which you will note is considered to date back to Plato, because I believe either Fr. Owen or his summarizer is incorrect to the extent that a distinction is drawn between Realism and Nominalism in the specific application of Divine arbitrariness.  But this is beside the point, as the Wikipedia summary is sufficient to demonstrate that you were clearly unaware of how the arbitrary nature of Divine goodness has been a mainstream Christian perspective for at least 700 years, and more likely 1,800 based on the writings of the Latin Fathers.  As it happens, the moral consequence of the Realist position is also that whatever God wills is good even if human reason declares otherwise, due to the imperfection of human reason.  The only difference is that the Realist view assumes human reason must be incorrect or insufficiently informed to understand the Divine perspective whereas the Nominalist view does not; for example, Aquinas’s relevant arguments, which can be found in Iª q. VI a. III and IV,  do not preclude the view of the arbitrary nature of Divine goodness when seen from from lesser perspectives to which I subscribe.  For, as Aquinas himself concludes:</p><p><i>“Hence from the first being, essentially such, and good, everything can be called good and a being, inasmuch as it participates in it by way of a certain assimilation which is far removed and defective; as appears from the above.  Everything is therefore called good from the divine goodness, as from the first exemplary effective and final principle of all goodness. Nevertheless, everything is called good by reason of the similitude of the divine goodness belonging to it, which is formally its own goodness, whereby it is denominated good. And so of all things there is one goodness, and yet many goodnesses.”</i></p><p>Ergo, those who confuse one of the many goodnesses with the one goodness may well elevate that lesser goodness to the supreme position and use it as a basis to conclude that the one goodness is evil and arbitrary, a process that one of my fellow Bucknellians describes as moral evolution and what the Bible describes as calling good evil and evil good.  The Christian debate on the subject long precedes Aquinas, but while Tertullian decries the goodness of Marcion’s God as imperfect, irrational, feeble, weak, and exhausted, at no point does his view of Divine perfection preclude the arbitrary nature of that perfection when viewed from an imperfect human perspective on it.  In fact, his attack on Marcion’s conception of God as a being of simple goodness points directly to the aforementioned Nominalist conclusion despite Tertullian being one of Realism’s most direct antecedents.  But even though more than two millennia of Christian and non-Christian philosophical debate on the nature of God and Divine Goodness somehow managed to escape your attention, it is obvious that my views on the subject were readily available to you because I expressed them on pages 292-3 of <i>The Irrational Atheist</i>.  I stated there that the arbitrary nature of God’s goodness, which has long been a known solution to the first horn of the Euthyphro Dilemma, “can only be considered a genuine problem for those who insist that a fixed principle cannot be arbitrary.”</p><p>And while it would certainly be amusing to see you argue for the immutable nature of the physical constants across the multiverses, I will content myself with simply concluding that you’re correct and the problem is not that you have incorrectly grasped the central aspects of Christian theology.  The problem, rather, is that you simply don’t know a damn thing about them.  You may not think I can charge you with ignorance of Christian theology, but given your confirmed failure to understand my predominantly orthodox beliefs as well as mainstream Narnia-level theology, it is perfectly clear that I or anyone else can not only charge you with it, but convict you.  To paraphrase what I wrote in my first letter, if you don’t understand that the world is fallen, evil, and bent, if you don’t understand that Satan is the prince of this world and the god of this age, you cannot possibly understand the most basic concept of Christianity, much less anything else about it.  Your letters have served to confirm this.  And the Christian doctrine of a fallen world ruled by evil is hardly a concept with which only Christians are familiar, as Philip K. Dick derived the title for the second book in his excellent VALIS trilogy, <i>The Divine Invasion</i>, from it.  Lest I stand accused of obscurantism, the invasion to which the term originally referred is this one:</p><p><i>“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”</i><br> – John 3:16</br></p><p>Now, I trust that I have sufficiently demonstrated why your claim of great familiarity with a variety of mainstream Christian theologies merits not only dismissal, but derision.  If you would like to dispute that conclusion, by all means let me know,, as we have barely begun to scratch the surface of basic Christian theological concepts that are clearly unfamiliar to you.  With regards for your request as to a link to where I support my claims, my recommendation is that you begin by reading the <i>The Chronicles of Narnia</i>.  Just to get you started, please note that the lion represents Jesus.  Then you should be ready for the space trilogy, after which point I would recommend moving on to Chesterton’s <i>Orthodoxy</i>.</p><p>In the third part of your letter, you begin by errantly claiming that I denied God’s omnipotence by asserting that Satan rules the world.  But I did nothing of the kind.  Would you similarly claim that I deny God’s omnipotence because I also assert that King Henry VIII ruled England?  You are making precisely the same mistake for which I criticize Richard Dawkins and Sam Harris in TIA, by confusing capability with action.  This error likely stems from the Sunday School theology of your upbringing, as it is a common misconception among less reflective Christians whose theological foundation is based more on the songs they learned as children than it is on any interpretation of the New Testament, but please note that a rejection of omniderigence is not a rejection of omnipotence because the two concepts are not identical.  To be all-powerful is not synonymous with being all-acting, much less all-controlling, and the foundation for my critique of omniderigence and its concept of a Master Puppeteer God is the rather obvious observation that the God who knows that the sparrow falls is not necessarily the God who killed the sparrow.  This is far from an exotic position and the debate between the hyper-Calvinists and pretty much the rest of Christianity is not a new one.  If you’re looking to find the point where Christian orthodoxy and I part company, then note that it is actually divine <i>omniscience</i> that I question, because I don’t see any Biblical claim or theological requirement for it.  See The Contradiction of Divine Characteristics, TIA pp 270-274.  Even so, the debate over the extent of God’s knowledge still falls well within the umbrella of mainstream Christianity as the various books about Open Theism, both pro and con, will readily show.</p><p>While I am certainly interested in discussing which religious or philosophical account of evil best fits the observable evidence as well as further exploring the details of your beliefs, especially those that concern what appears to be little more than a hedonistic spin on utilitarianism, we cannot reasonably move forward until you answer the questions I asked you in my previous letter.  While your dissertation on desirism did imply an answer of sorts, it is necessary to clarify your precise beliefs regarding the existence of evil and its nature in order to avoid making any false assumptions about them.  I will close by repeating them here now, with the addition of one more question raised by your third letter.  I would appreciate it if you would answer them directly before explaining your answers in as much detail as you might like to provide.</p><p>1.Do you believe in the existence of evil?<br> 2.If you believe that evil exists, is its nature objective or subjective?<br> 3.If you believe the nature of evil to be objective, what is that objective basis?<br> 4.What is the mathematical equation you used to calculate the three probabilities for metaphysical naturalism, orthodox Christian theism, and desirism?</br></br></br></p><p>With regards,<br> Vox</br></p><p><i>This was written in response to <a href=\"http://commonsenseatheism.com/?p=3919\">3rd Letter to Vox Day</a>.</i></p></div>",
  "content_text": "Dear Luke,\nI find it amusing, if not unexpected, that you continue to attempt rambling on about evolution.  It is, as you have admitted, a tangent, but more precisely, it is an irrelevant tangent which has absolutely nothing to do with the discourse to which you invited me.  To charge me with making false assertions and empty hand-waving because I made the mistake of directly answering one of your irrelevant questions is a very strange thing to do, especially when one considers that in that very same letter you neglected to answer the only questions I have asked of you.  I am also somewhat mystified by your decision to selectively quote\nthe rules of my blog\nto me as if they were applicable here.  But, as you have appealed to those rules, I shall quote the two that are most relevant as they will suffice to bring your repeated attempt to derail this discussion to an end.\n3.  Cross-comments and off-topic comments will usually be deleted. If your comment gets deleted, deal with it. Don’t try to argue with me about it, I’m truly not interested.\n10.  Any insertion of evolution or Creationism into a post that is not directly and specifically related to either subject will be deleted. Repeated efforts to do so will result in banning.\nThe mere existence of Rule #10 shows how your attempt to turn a discussion about Christianity into one about evolution and/or Creationism is tiresomely predictable in addition to being exactly the pointless sort of thing that this discourse was proposed to avoid.  I also note that your claim to have directly rebutted my three assertions with relevant evidence, argument, and examples is clearly false because the evidence, argument, and examples you provided only served to prove that you had no idea what I was talking about.  I will not bother to support this, even though I could easily do so, for what should be the obvious reason that\nit is not relevant to this discussion!\nAs many others have done in the past, you are assuming that a refusal to explain something is tantamount to an inability to explain it.  This is not only an illogical assumption but an incorrect one, as I shall soon demonstrate by explaining what I neglected to explain in my previous letter.\nI don’t believe it is accurate to say that my tactics rely upon either obscurantism or\nunmerited\ndismissal.  Indeed, by asserting that I am being obscure about the Christian doctrine of the Fall, you paint yourself with the very label I had not hitherto seen any justification to apply, as failing to spell out an obvious conclusion cannot reasonably be confused with being obscure.  I had assumed you were merely ignorant about Christian theology, but if you are not being disingenuous in asserting your failure to understand something as simple as C.S. Lewis’s metaphorical explication of it in the form of science fiction for children, then it will be very difficult for me or anyone else who did understand the metaphor to draw anything other than the obvious conclusion.  Having studied Sam Harris’s debates, I can certainly feel some sympathy regarding your frustration at my claim that you have misunderstood what I have written at almost every turn, but in this particular case, it doesn’t change the fact that you have clearly failed to understand what I wrote.  More importantly, it doesn’t change the fact that most of the people reading our letters had no trouble understanding what you did not.\nGranted, it is not my custom to explain what I consider to be the obvious.  Most of my regular readers are intelligent enough to draw logical conclusions and refusing to spell out the obvious serves as a surprisingly effective means of weeding out the less intelligent critics whose specious and petty critiques are of no interest or benefit to me.  But, in the interest of not being obscure, I will explain my reasoning in greater detail inasmuch as it is directly relevant to the topic of why I am a Christian.  In the example of obscurantism that you mentioned, you wrote that I failed to explain why\nOut of the Silent Planet\nis titled as it is, and what the implications of Satan’s temptation of Jesus Christ in the desert are.  Very well, let us address those two points.\nIn the Lewis book, Thulcandra, or “the Silent Planet”, refers to the Earth, which, being “bent”, no longer participates in the music of the celestial spheres with the eldila or even communicates with anyone outside the orbit of the Moon.  Hence the appellation “silent”.  Thulcandra is not ruled by the Old One (the Creator God) or Maleldil the Young (Jesus Christ), but by its bent Oyarsa (angelic planetary principality), who represents Lucifer/Satan.  This idea of a world which is ruled by an evil being in rebellion against the Creator God is based on the fundamental Christian theological doctrine of the Fall, which has been told many times in Western literature and is most clearly demonstrated in the Bible by the temptation of Jesus Christ in the desert.  When Satan offered Jesus all the kingdoms of the world in return for his worship, Jesus did not argue that the world was not Satan’s to give as he presumably would have if it were a false offer, (which, as the Son of God he would very well have known), instead he merely refused it.  This strongly suggests that the world is not completely under the direction and control of the Creator God as most atheists assume Christians believe, but is instead ruled by an evil, intelligent, and malicious being who seeks to be worshipped in the place of God.  This concept is further confirmed in numerous places in the Bible, such as when Jesus tells his disciples that “the prince of this world cometh” in Matthew 14:30 and when Paul refers to “the god of this age” in 2nd Corinthians 4:4.  While there is debate among Christians about the extent of this being’s rule, which according to the Bible extends to the\naion\nbut not the\nkosmos\n, as well as the timing and nature of the end of that rule, there is no serious theological dispute as to the existence of either the evil being or his worldly reign.\nThe nature of the being who rules over the world is a tremendously important point to understand for both the Christian and the atheist.  While the atheist can, as many Christians do, wonder about why a deity of sufficient power to end the reign of an evil ruler would not act immediately to do so, it is as illogical for a Christian to blame God for the actions of Satan as it is for a Vikings fan to blame Brad Childress because Percy Harvin ran an incorrect route.  There is no question that Childress could have prevented his wide receiver from running the wrong route by keeping him on the bench, but there is also no question that Harvin was told what the correct route was and chose to run the wrong one anyhow, thereby making Harvin, not Childress, the responsible party.  The analogy is not quite precise, of course.  A more accurate one would be akin to Childress deciding to start Harvin, followed by Bernard Berrian telling Harvin to sit down and let him run the route prior to sneaking in the game and running it incorrectly.  We can blame both Berrian and Harvin for the subsequent incompletion, but we cannot reasonably blame Childress except for his poor judgment in permitting both players the freedom to think for themselves and make their own decisions.  The inherent conflict between a benevolent Creator and a fallen world leads inevitably to the very mainstream Christian doctrine of free will, which is why some atheists such as Sam Harris and Daniel Dennett are so determined to prove that free will does not exist, or is at best an illusion.\nAnd this leads us to consider some of your more interesting assertions.  Contrary to your fallacious claim to be “\ntoo\nfamiliar with Christian theology – or rather, Christian\ntheologies\n”, you demonstrated your ignorance of not only conventional Christian theology, but philosophy in general, when you claimed that you could not possibly have predicted that I would hold the view that God’s goodness is arbitrary.  In fact, it is apparent that your level of knowledge does not even rise\nto the level of Wikipedia\n:\n“Christian philosophers, starting with Thomas Aquinas have often answered that the dilemma is false: yes, God commands something because it is good, but the reason it is good is that “good is an essential part of God’s nature”. So goodness is grounded in God’s character and merely expressed in moral commands. Therefore whatever a good God commands will always be good.  Fr. Owen Carroll notes that the medieval philosophical tradition Realism, to which Aquinas belonged, assumes that the model that God used when creating the universe was within Himself so that the goodness of this world reflects and participates in some limited way and extent in the infinite goodness of God’s own divine nature. The position of the opposing school of Nominalism maintains that the model that God used when creating the universe is outside of God and thus the goodness of this world is alien to the goodness of God Himself. The moral consequence of the latter position is that whatever God wills is good, even if it is inherently contradictory and morally arbitrary according to the light of human reason.”\nNow, my view of God’s arbitrary goodness is not actually Nominalist, the philosophical school which you will note is considered to date back to Plato, because I believe either Fr. Owen or his summarizer is incorrect to the extent that a distinction is drawn between Realism and Nominalism in the specific application of Divine arbitrariness.  But this is beside the point, as the Wikipedia summary is sufficient to demonstrate that you were clearly unaware of how the arbitrary nature of Divine goodness has been a mainstream Christian perspective for at least 700 years, and more likely 1,800 based on the writings of the Latin Fathers.  As it happens, the moral consequence of the Realist position is also that whatever God wills is good even if human reason declares otherwise, due to the imperfection of human reason.  The only difference is that the Realist view assumes human reason must be incorrect or insufficiently informed to understand the Divine perspective whereas the Nominalist view does not; for example, Aquinas’s relevant arguments, which can be found in Iª q. VI a. III and IV,  do not preclude the view of the arbitrary nature of Divine goodness when seen from from lesser perspectives to which I subscribe.  For, as Aquinas himself concludes:\n“Hence from the first being, essentially such, and good, everything can be called good and a being, inasmuch as it participates in it by way of a certain assimilation which is far removed and defective; as appears from the above.  Everything is therefore called good from the divine goodness, as from the first exemplary effective and final principle of all goodness. Nevertheless, everything is called good by reason of the similitude of the divine goodness belonging to it, which is formally its own goodness, whereby it is denominated good. And so of all things there is one goodness, and yet many goodnesses.”\nErgo, those who confuse one of the many goodnesses with the one goodness may well elevate that lesser goodness to the supreme position and use it as a basis to conclude that the one goodness is evil and arbitrary, a process that one of my fellow Bucknellians describes as moral evolution and what the Bible describes as calling good evil and evil good.  The Christian debate on the subject long precedes Aquinas, but while Tertullian decries the goodness of Marcion’s God as imperfect, irrational, feeble, weak, and exhausted, at no point does his view of Divine perfection preclude the arbitrary nature of that perfection when viewed from an imperfect human perspective on it.  In fact, his attack on Marcion’s conception of God as a being of simple goodness points directly to the aforementioned Nominalist conclusion despite Tertullian being one of Realism’s most direct antecedents.  But even though more than two millennia of Christian and non-Christian philosophical debate on the nature of God and Divine Goodness somehow managed to escape your attention, it is obvious that my views on the subject were readily available to you because I expressed them on pages 292-3 of\nThe Irrational Atheist\n.  I stated there that the arbitrary nature of God’s goodness, which has long been a known solution to the first horn of the Euthyphro Dilemma, “can only be considered a genuine problem for those who insist that a fixed principle cannot be arbitrary.”\nAnd while it would certainly be amusing to see you argue for the immutable nature of the physical constants across the multiverses, I will content myself with simply concluding that you’re correct and the problem is not that you have incorrectly grasped the central aspects of Christian theology.  The problem, rather, is that you simply don’t know a damn thing about them.  You may not think I can charge you with ignorance of Christian theology, but given your confirmed failure to understand my predominantly orthodox beliefs as well as mainstream Narnia-level theology, it is perfectly clear that I or anyone else can not only charge you with it, but convict you.  To paraphrase what I wrote in my first letter, if you don’t understand that the world is fallen, evil, and bent, if you don’t understand that Satan is the prince of this world and the god of this age, you cannot possibly understand the most basic concept of Christianity, much less anything else about it.  Your letters have served to confirm this.  And the Christian doctrine of a fallen world ruled by evil is hardly a concept with which only Christians are familiar, as Philip K. Dick derived the title for the second book in his excellent VALIS trilogy,\nThe Divine Invasion\n, from it.  Lest I stand accused of obscurantism, the invasion to which the term originally referred is this one:\n“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”\n– John 3:16\nNow, I trust that I have sufficiently demonstrated why your claim of great familiarity with a variety of mainstream Christian theologies merits not only dismissal, but derision.  If you would like to dispute that conclusion, by all means let me know,, as we have barely begun to scratch the surface of basic Christian theological concepts that are clearly unfamiliar to you.  With regards for your request as to a link to where I support my claims, my recommendation is that you begin by reading the\nThe Chronicles of Narnia\n.  Just to get you started, please note that the lion represents Jesus.  Then you should be ready for the space trilogy, after which point I would recommend moving on to Chesterton’s\nOrthodoxy\n.\nIn the third part of your letter, you begin by errantly claiming that I denied God’s omnipotence by asserting that Satan rules the world.  But I did nothing of the kind.  Would you similarly claim that I deny God’s omnipotence because I also assert that King Henry VIII ruled England?  You are making precisely the same mistake for which I criticize Richard Dawkins and Sam Harris in TIA, by confusing capability with action.  This error likely stems from the Sunday School theology of your upbringing, as it is a common misconception among less reflective Christians whose theological foundation is based more on the songs they learned as children than it is on any interpretation of the New Testament, but please note that a rejection of omniderigence is not a rejection of omnipotence because the two concepts are not identical.  To be all-powerful is not synonymous with being all-acting, much less all-controlling, and the foundation for my critique of omniderigence and its concept of a Master Puppeteer God is the rather obvious observation that the God who knows that the sparrow falls is not necessarily the God who killed the sparrow.  This is far from an exotic position and the debate between the hyper-Calvinists and pretty much the rest of Christianity is not a new one.  If you’re looking to find the point where Christian orthodoxy and I part company, then note that it is actually divine\nomniscience\nthat I question, because I don’t see any Biblical claim or theological requirement for it.  See The Contradiction of Divine Characteristics, TIA pp 270-274.  Even so, the debate over the extent of God’s knowledge still falls well within the umbrella of mainstream Christianity as the various books about Open Theism, both pro and con, will readily show.\nWhile I am certainly interested in discussing which religious or philosophical account of evil best fits the observable evidence as well as further exploring the details of your beliefs, especially those that concern what appears to be little more than a hedonistic spin on utilitarianism, we cannot reasonably move forward until you answer the questions I asked you in my previous letter.  While your dissertation on desirism did imply an answer of sorts, it is necessary to clarify your precise beliefs regarding the existence of evil and its nature in order to avoid making any false assumptions about them.  I will close by repeating them here now, with the addition of one more question raised by your third letter.  I would appreciate it if you would answer them directly before explaining your answers in as much detail as you might like to provide.\n1.Do you believe in the existence of evil?\n2.If you believe that evil exists, is its nature objective or subjective?\n3.If you believe the nature of evil to be objective, what is that objective basis?\n4.What is the mathematical equation you used to calculate the three probabilities for metaphysical naturalism, orthodox Christian theism, and desirism?\nWith regards,\nVox\nThis was written in response to\n3rd Letter to Vox Day\n.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-15T11:46:00+00:00"
}