{
  "url": "https://voxday.net/2009/10/03/letter-to-common-sense-atheism-ii/",
  "scraped_at": "2026-01-08T23:08:27.704384",
  "title": "Letter to Common Sense Atheism II",
  "date_display": "October 3, 2009",
  "date_iso": "2009-10-03T14:48:00+00:00",
  "date_from_url": "2009-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Luke,</p><p>I was a little disappointed by the way your second letter appeared to indicate that this discourse is already on the verge of devolving into the very sort of debate that you originally proposed avoiding.  Fortunately, I think we can avert that by focusing on the question you originally posed to me, namely, why I am a Christian.  Evolution has no more to do with why I am a Christian than the ontological argument, and for all that you might like to discuss those things, they are simply not relevant to the subject.  Now, as to the six sections of <a href=\"http://commonsenseatheism.com/?p=3660\">your last letter</a>, the first two can be readily dismissed.  Regarding the first, I can only say that when I initiate a public discourse with an established figure whose views are well-known to the audience, I prefer to operate out of as little ignorance as possible.  If you happen to feel otherwise, that is certainly your prerogative.</p><p>As to the second point, entitled “Creationism and evolution”, I must inform you that you are both off-topic and incorrect.  It is not possible for you to have investigated the matter, much less to have discredited what I wrote, as you clearly did not understand what I am talking about in any of the three statements I made.  If you do happen to investigate them in the future you will discover, as others have before you, that it isn’t even possible to credibly dispute them.  Perhaps if you had read more of my work, you would know that my criticisms are seldom the expected ones, even if they happen to look superficially similar to those that have been articulated before by others.  And you would also know that professional, academic, and scientific consensus mean absolutely nothing to me when I have examined the supporting facts and logic and reached contrary conclusions.  As it happens, in three weeks my publisher will release a book in which I detail the fatal flaws that render invalid a theory that predates the modern evolutionary synthesis and is equally well-established in its scientific field.  But, as I noted previously, precisely none of this is relevant to the topic at hand!  You wrote to claim that you can’t let me get away with my answers, but I am afraid you have no other choice.  You chose to ask an irrelevant question and I answered it.  It is of no concern to me what you might happen to think of the answer as neither my answer nor your opinion is pertinent to the present discussion.</p><p>Now onto the third point, which happily is a relevant one.  You wrote:</p><blockquote><p>You write as if Christianity is the only worldview that has an account of evil, but this is absurd. All religions have an account of evil. So evil is just as much evidence for their truth as for the truth of Christianity.</p></blockquote><p>There are several problems here.  You begin by incorrectly identifying an implication that simply is not there.  I have never denied that other religions possess accounts of evil.  Every worldview except that of the rational materialist has a more or less coherent account of evil, but the salient point is that <i>those accounts of evil are all very different.</i> Therefore, the question is: of those various accounts of evil, which most closely parallels the evil that we can observe and experience in the material world?  For example, if we say that rape is evil, are we saying that it is an illusion, a personally distasteful confluence of atoms, a minor property crime against the father, or a grievous offense against God’s Will involving the desecration of one of His fleshly temples?  Clearly your conclusion is incorrect because evil cannot provide the same evidence for the truth of <i>competing accounts</i> of evil.  Also incorrect is your description of the Christian concept of evil as “a roaming magical force that hunts us down and seeks to destroy us”.  Evil can be external but it is internal as well, because the Christian concept of evil is simply that which violates the Will of God.  Satan is merely one of many evils, perhaps the greatest example of it, but far from the only one.</p><p>I very much agree with you when you write that “an all-good, all-powerful God doesn’t fit very cleanly with the amount of pointless suffering we see all around the world.”  Of course, your statement does little more than confirm your unfamiliarity with both the Bible and Christian theology that I originally suspected, for as I wrote in my previous letter: “[U]nless you can understand why the first book in C.S. Lewis’s Space Trilogy is called Out of the Silent Planet, unless you fully grasp the implications of the temptation of Jesus in the desert, you cannot possibly understand much about Christianity or the degree of difference between it and other religions.”  The Christian God does not rule this world.  The being that Jesus described as “the prince of this world” in John 14:30 does.  To fail to understand this vital point is to completely fail to understand Christianity, since one cannot possibly understand the significance of the Redeemer if one does not understand from what, and from whom, Man must be redeemed.  While it is true there are Christians who disagree with me on this point and insist that this world is precisely as God planned it and therefore the best of all possible worlds, that evil is an integral part of God’s perfect plan, and that the whole Redemption of Man is merely some sort of elaborate Kabuki dance where the pre-ordained steps are robotically followed, but my view of omniderigence is well-documented.</p><p>Since your understanding of my argument was demonstrably incorrect and your criticism of it verifiably false, it is clear that my belief in Christianity remains rationally justified even if I cannot conclusively prove its truth to anyone else’s satisfaction.  I am curious, however, in your interest in seeing me argue for the existence of evil.  While I have no objection to doing so given the obvious relevance of the matter, I must first understand something about your definition of evil.  Do you believe in the existence of objective evil or do you believe that evil is a purely subjective matter?</p><p>I also note that given your obvious failure to correctly grasp some central aspects of Christian theology, the rational basis of your rejection of Christianity is necessarily called into question.  As I’m sure you understand, the truth or falsehood of Christianity is not dependent upon your intellectual limitations.  Or mine, for that matter.</p><p>On the fourth point, you write:</p><blockquote><p>No doubt, Christianity is different. Every religion is different from all the others. But uniqueness is no measure of truth. Raëlism is pretty unique. So are Jedi-ism, Scientology, the John Coltrane Church, and many other things. But that does nothing to increase their probability of being true.</p></blockquote><p>You’re correct, the mere fact of uniqueness does nothing to increase the probability of anything being true.  The problem is, that is tangential to the point I actually made when I wrote that Christianity was a better guide to human behavior than those other religions, and than the very best models the social sciences have produced despite having two thousand more years of human experience upon which to draw.  That does increase its probability of being true, even from the secular, scientific perspective.</p><p>On the fifth point, I am pleased that you find my perspective to be consistent.  That you find it terrifying is entirely appropriate, since I think people <i>should</i> be terrified by the idea that the world is ruled by an intelligent, evil, genocidal being.  I would find it terrifying too, were it not for the fact that I believe in a greater power that has given men the ability to be free of that rule.  Fear, and freedom from it, is an important theme in the Bible as we would not so often be told “do not be afraid” if there was not something to quite reasonably fear.  However, I have to point out that it is fundamentally unreasonable to fear my perspective if the Christian worldview is incorrect.  The madness that could hypothetically lead me to conclude I am hearing a divine command to commit murder, for example, is not only no more likely to occur than any other form of lethal madness, but possesses an inherent restriction upon it that other forms of madness do not.  Since God has not hitherto issued any such direct commands to me or anyone else of whom I am aware in quite some time now, the Biblical directive to test such phenomena would naturally call for some rather strict criteria.  And, since Christians have been scientifically demonstrated to be happier and less subject to the sort of mental disease that such a scenario requires than non-Christians, it is obvious that any fear of Christians mistakenly believing they are divinely appointed to commit havoc is neither reasonable nor scientific.</p><p>On the sixth point, I have no problem whatsoever admitting that the resurrection of Jesus Christ, even if it were demonstrated to be an incontrovertible historical fact, does not conclusively prove that Jesus Christ is the Son of God, that there is an immortal soul, that Heaven exists, or that Jesus is the only way to it.  This isn’t in dispute; Jesus not only knew all this himself, but he outright predicted that there would be many men who would refuse to believe despite the wondrous signs they had been shown.  Richard Dawkins is only one of numerous atheists who insist that they would not believe in God even if they encountered him directly.  Belief is only half of the salvation equation anyhow, and it is the less important half.</p><p>The reason Christianity is rationally justified even though the ontological argument, cosmological argument, teleological argument, the magical resurrection of Jesus, and the existence of evil do not entail the complete truth of Christianity – which, according to 1 Corinthians 13:11, every Christian knows we cannot know – but they still suffice to establish the Bible as the most credible authority regarding that which is unknown.  This would, in Daniel Dennett’s terms, justify the doxastic division of labor on the part of the Christian, in fact, it would make it a logical necessity.  If we accept your hypothetical suggestion that the Bible genuinely confounds our current understanding of science, then obviously the most rational position is to accept the tenets and dictates of Christianity than to cling to the inferior verities of science, to say nothing of those other religions whose claim on observable, experiential reality is even more tenuous.  This, of course, has nothing to do with why I believe, much less worship, but I think it should satisfy your desire to assert that various common arguments on behalf of the existence of God don’t actually prove the truth of Christianity.</p><p>Belief, like love, is less a state of being than a continuous series of choices.  However, it is clear from your consistent misunderstanding of my statements that the choices you and I have made to believe or not believe are different ones, based on fundamentally different concepts.  I hope that I have clarified some of those concepts so that you have a better grasp of what those differences actually are.  If, in your next letter, you would clarify whether you believe in the existence of evil or not, what you believe its nature to be, and whether that nature is objective or subjective, I can then begin to inquire further as to the foundation of <i>your</i> beliefs.</p><p>With regards,<br> Vox</br></p><p><i>This was written in response to <a href=\"http://commonsenseatheism.com/?p=3660\">2nd Letter to Vox Day</a>.</i></p></div>",
  "content_text": "Dear Luke,\nI was a little disappointed by the way your second letter appeared to indicate that this discourse is already on the verge of devolving into the very sort of debate that you originally proposed avoiding.  Fortunately, I think we can avert that by focusing on the question you originally posed to me, namely, why I am a Christian.  Evolution has no more to do with why I am a Christian than the ontological argument, and for all that you might like to discuss those things, they are simply not relevant to the subject.  Now, as to the six sections of\nyour last letter\n, the first two can be readily dismissed.  Regarding the first, I can only say that when I initiate a public discourse with an established figure whose views are well-known to the audience, I prefer to operate out of as little ignorance as possible.  If you happen to feel otherwise, that is certainly your prerogative.\nAs to the second point, entitled “Creationism and evolution”, I must inform you that you are both off-topic and incorrect.  It is not possible for you to have investigated the matter, much less to have discredited what I wrote, as you clearly did not understand what I am talking about in any of the three statements I made.  If you do happen to investigate them in the future you will discover, as others have before you, that it isn’t even possible to credibly dispute them.  Perhaps if you had read more of my work, you would know that my criticisms are seldom the expected ones, even if they happen to look superficially similar to those that have been articulated before by others.  And you would also know that professional, academic, and scientific consensus mean absolutely nothing to me when I have examined the supporting facts and logic and reached contrary conclusions.  As it happens, in three weeks my publisher will release a book in which I detail the fatal flaws that render invalid a theory that predates the modern evolutionary synthesis and is equally well-established in its scientific field.  But, as I noted previously, precisely none of this is relevant to the topic at hand!  You wrote to claim that you can’t let me get away with my answers, but I am afraid you have no other choice.  You chose to ask an irrelevant question and I answered it.  It is of no concern to me what you might happen to think of the answer as neither my answer nor your opinion is pertinent to the present discussion.\nNow onto the third point, which happily is a relevant one.  You wrote:\nYou write as if Christianity is the only worldview that has an account of evil, but this is absurd. All religions have an account of evil. So evil is just as much evidence for their truth as for the truth of Christianity.\nThere are several problems here.  You begin by incorrectly identifying an implication that simply is not there.  I have never denied that other religions possess accounts of evil.  Every worldview except that of the rational materialist has a more or less coherent account of evil, but the salient point is that\nthose accounts of evil are all very different.\nTherefore, the question is: of those various accounts of evil, which most closely parallels the evil that we can observe and experience in the material world?  For example, if we say that rape is evil, are we saying that it is an illusion, a personally distasteful confluence of atoms, a minor property crime against the father, or a grievous offense against God’s Will involving the desecration of one of His fleshly temples?  Clearly your conclusion is incorrect because evil cannot provide the same evidence for the truth of\ncompeting accounts\nof evil.  Also incorrect is your description of the Christian concept of evil as “a roaming magical force that hunts us down and seeks to destroy us”.  Evil can be external but it is internal as well, because the Christian concept of evil is simply that which violates the Will of God.  Satan is merely one of many evils, perhaps the greatest example of it, but far from the only one.\nI very much agree with you when you write that “an all-good, all-powerful God doesn’t fit very cleanly with the amount of pointless suffering we see all around the world.”  Of course, your statement does little more than confirm your unfamiliarity with both the Bible and Christian theology that I originally suspected, for as I wrote in my previous letter: “[U]nless you can understand why the first book in C.S. Lewis’s Space Trilogy is called Out of the Silent Planet, unless you fully grasp the implications of the temptation of Jesus in the desert, you cannot possibly understand much about Christianity or the degree of difference between it and other religions.”  The Christian God does not rule this world.  The being that Jesus described as “the prince of this world” in John 14:30 does.  To fail to understand this vital point is to completely fail to understand Christianity, since one cannot possibly understand the significance of the Redeemer if one does not understand from what, and from whom, Man must be redeemed.  While it is true there are Christians who disagree with me on this point and insist that this world is precisely as God planned it and therefore the best of all possible worlds, that evil is an integral part of God’s perfect plan, and that the whole Redemption of Man is merely some sort of elaborate Kabuki dance where the pre-ordained steps are robotically followed, but my view of omniderigence is well-documented.\nSince your understanding of my argument was demonstrably incorrect and your criticism of it verifiably false, it is clear that my belief in Christianity remains rationally justified even if I cannot conclusively prove its truth to anyone else’s satisfaction.  I am curious, however, in your interest in seeing me argue for the existence of evil.  While I have no objection to doing so given the obvious relevance of the matter, I must first understand something about your definition of evil.  Do you believe in the existence of objective evil or do you believe that evil is a purely subjective matter?\nI also note that given your obvious failure to correctly grasp some central aspects of Christian theology, the rational basis of your rejection of Christianity is necessarily called into question.  As I’m sure you understand, the truth or falsehood of Christianity is not dependent upon your intellectual limitations.  Or mine, for that matter.\nOn the fourth point, you write:\nNo doubt, Christianity is different. Every religion is different from all the others. But uniqueness is no measure of truth. Raëlism is pretty unique. So are Jedi-ism, Scientology, the John Coltrane Church, and many other things. But that does nothing to increase their probability of being true.\nYou’re correct, the mere fact of uniqueness does nothing to increase the probability of anything being true.  The problem is, that is tangential to the point I actually made when I wrote that Christianity was a better guide to human behavior than those other religions, and than the very best models the social sciences have produced despite having two thousand more years of human experience upon which to draw.  That does increase its probability of being true, even from the secular, scientific perspective.\nOn the fifth point, I am pleased that you find my perspective to be consistent.  That you find it terrifying is entirely appropriate, since I think people\nshould\nbe terrified by the idea that the world is ruled by an intelligent, evil, genocidal being.  I would find it terrifying too, were it not for the fact that I believe in a greater power that has given men the ability to be free of that rule.  Fear, and freedom from it, is an important theme in the Bible as we would not so often be told “do not be afraid” if there was not something to quite reasonably fear.  However, I have to point out that it is fundamentally unreasonable to fear my perspective if the Christian worldview is incorrect.  The madness that could hypothetically lead me to conclude I am hearing a divine command to commit murder, for example, is not only no more likely to occur than any other form of lethal madness, but possesses an inherent restriction upon it that other forms of madness do not.  Since God has not hitherto issued any such direct commands to me or anyone else of whom I am aware in quite some time now, the Biblical directive to test such phenomena would naturally call for some rather strict criteria.  And, since Christians have been scientifically demonstrated to be happier and less subject to the sort of mental disease that such a scenario requires than non-Christians, it is obvious that any fear of Christians mistakenly believing they are divinely appointed to commit havoc is neither reasonable nor scientific.\nOn the sixth point, I have no problem whatsoever admitting that the resurrection of Jesus Christ, even if it were demonstrated to be an incontrovertible historical fact, does not conclusively prove that Jesus Christ is the Son of God, that there is an immortal soul, that Heaven exists, or that Jesus is the only way to it.  This isn’t in dispute; Jesus not only knew all this himself, but he outright predicted that there would be many men who would refuse to believe despite the wondrous signs they had been shown.  Richard Dawkins is only one of numerous atheists who insist that they would not believe in God even if they encountered him directly.  Belief is only half of the salvation equation anyhow, and it is the less important half.\nThe reason Christianity is rationally justified even though the ontological argument, cosmological argument, teleological argument, the magical resurrection of Jesus, and the existence of evil do not entail the complete truth of Christianity – which, according to 1 Corinthians 13:11, every Christian knows we cannot know – but they still suffice to establish the Bible as the most credible authority regarding that which is unknown.  This would, in Daniel Dennett’s terms, justify the doxastic division of labor on the part of the Christian, in fact, it would make it a logical necessity.  If we accept your hypothetical suggestion that the Bible genuinely confounds our current understanding of science, then obviously the most rational position is to accept the tenets and dictates of Christianity than to cling to the inferior verities of science, to say nothing of those other religions whose claim on observable, experiential reality is even more tenuous.  This, of course, has nothing to do with why I believe, much less worship, but I think it should satisfy your desire to assert that various common arguments on behalf of the existence of God don’t actually prove the truth of Christianity.\nBelief, like love, is less a state of being than a continuous series of choices.  However, it is clear from your consistent misunderstanding of my statements that the choices you and I have made to believe or not believe are different ones, based on fundamentally different concepts.  I hope that I have clarified some of those concepts so that you have a better grasp of what those differences actually are.  If, in your next letter, you would clarify whether you believe in the existence of evil or not, what you believe its nature to be, and whether that nature is objective or subjective, I can then begin to inquire further as to the foundation of\nyour\nbeliefs.\nWith regards,\nVox\nThis was written in response to\n2nd Letter to Vox Day\n.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-03T13:48:00+00:00"
}