{
  "url": "https://voxday.net/2009/10/23/letter-to-common-sense-atheism-iv/",
  "scraped_at": "2026-01-08T23:10:16.862081",
  "title": "Letter to Common Sense Atheism IV",
  "date_display": "October 23, 2009",
  "date_iso": "2009-10-23T09:14:00+00:00",
  "date_from_url": "2009-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Luke,</p><p>I’m pleased that we appear to be getting back on track.  But before we delve into the substance of the discourse, I must first point out that the reason you could not count the insults in my previous letter to you is because there were none.  While you may find it embarrassing to have some of your claims to knowledge exposed as false, it is no more insulting for me to declare and subsequently demonstrate your ignorance about basic concepts of mainstream Christian theology than it was for you to imply that I have never thought about how my beliefs can be justified, or to declare that my statements about evolution are discredited, that my assertions about the Christian worldview are absurd, that I repeat many common distortions, and that my concept of morality is terrifying.  This is particularly true in light of the fact that the first four of these “insulting” statements were false, whereas the case for your theological ignorance is conclusive.  Please also keep in mind that the only reason it became necessary to publicly demonstrate the limits of your theological knowledge was because you made the charge of obscurantism.</p><p>Despite your admission of relative ignorance in your last letter, the salient point still appears to have escaped you.  The relevant fact is not that you are unfamiliar with popular children’s literature, a science fiction novel, or even the Western literary canon that includes Milton’s <i>Paradise Lost</i> and Dante’s <i>Inferno</i>, but rather that you are insufficiently familiar with the text of the New Testament and the orthodox interpretations of it that have been the mainstream Christian perspective for most of the last two millennia.  Vox Day Christianity, as you call it, is indistinguishable in the vast majority of particulars from mainstream Protestant Christianity, so there is no justification for attempting to create any distinction between the two because my theological idiosyncracies are of little relevance to this discussion.  You require a much better grasp of mainstream theology than you possess in order to determine which of my beliefs are exotic and which are entirely orthodox, and anyone of reasonable familiarity with the Bible will find my Christian theology to be entirely in line with Scripture even if they happen to disagree with a few of my conclusions and conjectures.  Nothing I have mentioned in my previous letters, with the possible exception of the extent of God’s knowledge, can be reasonably characterized as being outside mainstream Protestant Christianity.  And even in the case of Open Theism, that is a debate that is taking place entirely within that mainstream.</p><p>This leads me to the inconsistency demonstrated in your ill-considered attempt to plead the Courtier’s Reply.  While a lifelong atheist could reasonably admit ignorance of a particular theology based upon the existence of something he does not believe, this is not true in the case of an atheist who presents himself as a former believer, especially not one who claims to be not only well-versed, but “too familiar” with the relevant theologies.  The analogy fails because even if you are now an atheist who considers theology akin to the systematic study of imaginary fabrics, you presented yourself as a former expert on those very fabrics.  You may come from a tradition that values clarity, argument, and evidence, but thus far you have exhibited little more than ignorance, logical incompetence, and inconsistency.  Lest you be tempted to cry insult again, please note that this conclusion is merely an observation based on the evidence of your four letters and I believe it is one that is very difficult for the objective reader to avoid.  Fortunately, all three conditions can be remedied as they are not terminal.</p><p>For example, it was logically false to assert that the answer to the question “Do you believe in evil?” was somehow dependent upon my definition of evil.  As was indicated by the subsequent questions regarding the nature of evil, the question clearly applied to your belief <i>in any form of evil</i>, not your belief in evil as I happen to define it.  I did not ask “Do you believe in evil as I previously defined it?”  If you are an NFL fan and I ask the question “Do you like football?”, the correct answer is “yes, I do like football” even if you suspect that I may be thinking of the sport which is called soccer in the States.  Regardless of whether I am talking about soccer or NFL football, the fact remains that you are a fan of the sport of football.  Since you eventually declared that you believe in an evil that “thwarts more and stronger reasons for action than it fulfills”, it appears that your answer is yes, you believe in evil.  If I have misinterpreted your answer and you actually do not believe in any form of evil, please correct me.</p><p>While it is true that there are many different definitions of objective and subjective, the philosophers’ concept of mind-independence is no more relevant to the subject at hand than the grammatical concept pertaining to the use of a form as the object of a transitive verb.  Applying the relevant definition of objective to your answer – “not influenced by personal feelings, interpretations, or prejudice; based on facts; unbiased: <i>an objective opinion</i>” – regarding the nature of evil clearly indicates that you believe evil is a fundamentally subjective concept.  In fact, based on your explication of desirism, it is apparent that in your view, evil is not only subjective, but dynamic and transitory as well.  Unfortunately, this rejection of the concept of objective evil renders it impossible for us to compare the Christian view of evil with other accounts of it because neither of us can possibly know what your definition of evil is for any single act or individual at any given point on the space-time continuum.  Since we lack any fixed and coherent metric, no comparisons are possible.  I am open to hearing any suggestions you might have for an objective measure by which the Christian concept of evil can be compared with other religious and philosophical concepts of evil, but as it stands, given your rejection of an objective standard of evil and your preference for a subjective and transitory one, we can no more compare the Christian definition of evil to other accounts of it than we could compare our respective heights by utilizing variable centimeters.  If you have any ideas for a reasonable and objective measure by which we can judge these competing concepts, please feel free to suggest them.  My suggestion is that if you could even identify a single act that you believe to be objectively evil that is also deemed evil under the Christian moral code, such as the act of rape, we could at least make a partial comparison of religious and philosophical moral codes.</p><p>But in the meantime, I will say that I find your moral perspective on good and evil to be both fascinating… and familiar.  You describe it as desirism, which is a term that is new to me, but based on your description it appears to be little more than a collectivist variant on an older moral code that is perhaps best exhibited in the commentaries that a young philosophy student once wrote on <i>A System of Ethics</i> by Friedrich Paulsen.</p><p><i>“I do not agree with the view that to be moral, the motive of one’s actions has to be benefiting others. Morality does not have to be defined in relation to others. . . . [People like me want to] satisfy our hearts to the full and in doing so we automatically have the most valuable moral codes. Of course there are people and objects in the world, but they are all there only for me. . . . I have my desire and act on it.”</i></p><p>It appears that the only substantive difference between your desirism and the desirism of Mao Tse-Tung is that your moral code is, ironically enough, more collective than the infamous communist leader’s. Whereas Mao distinguishes between good and evil on the sole basis of the comparative strengths of the individual desires, you add to this comparison the additional component of a majority vote.  Even if we leave the consequences of this utilitarianism aside, which you will note you have not done in some of your previous references to Christian morality, this is a rationally untenable position that is even less defensible than Sam Harris’s happiness/suffering moral metric.  I believe you already suspect as much due to your quixotic attempt to define certain desires as not-desires in order to avoid the uncomfortable logical conclusions to your moral reasoning.</p><p>When you assert, for example, that racism is evil under the desirist code, you are therefore required to assume that more and stronger desires are potentially thwarted than fulfilled by it.  But this assumption is easily shown to be a false one.  In materalist terms, the desire to live is observably no stronger than the desire to propagate one’s own kind, this is why most people will risk fatal diseases in order to engage in sexual relations, why a woman will carry a child to term even when doing so risks her own life, and why men will sacrifice their lives to preserve the lives of their women and children.  This indicates that the strength of the collective racist desire for racial purity is stronger than the collective non-racist desire for a multi-racial culture and may even be stronger than the collective desire of the minority races to survive.  This is supported by an examination of your chosen example of Triumphant Nazism, which proves precisely the opposite of what you believed it did.</p><p><i>“Turn this knob to the right, and racist desires strengthen throughout the population. Turn this knob to the left, and racist desires decrease. To say that racist desires are evil is to say that turning this knob to the right thwarts more desires than turning this knob to the left. If we turn the knob to the right, many racist desires are fulfilled but the desires of minorities are thwarted. If we turn the knob all the way to the left, no racist desires are thwarted (because they don’t exist), and also the desires of minorities are not thwarted.”</i></p><p>This reasoning led you to an incorrect conclusion because you failed to realize that turning the knob all the way to the right means that racist desires are fulfilled and no desires of minorities are thwarted – because they don’t exist either!  As you wrote, turning the knob all the way to the left means that no racist desires are thwarted and no desires of minorities are thwarted.  But because a failure to thwart desires is not equivalent to <i>fulfilling</i> desires, this means that turning the knob all the way to the right would not only fulfill more and stronger reasons for action than it would thwart, it would fulfill more and stronger reasons for action than turning the knob all the way to the left even without the numerical requirement of a majority of the population possessing the racist desires.  Therefore, under the desirist moral code, the Nazi extermination program is confirmed to be good and opposition to it, <i>or even mitigation of it</i>, is a definite evil.</p><p>Moreover, the intrinsically totalitarian aspects of your moral code are intimated even in your incorrect interpretation of the example.  If, for example, turning the knob all the way to the left would fulfill more desires than it would thwart, then it would be a moral good to eliminate the racist desires from those harboring them and a moral evil to fail to do so.  It is no coincidence that this is precisely the reasoning that the Maoists used in attempting to eliminate “false consciousness” by the use of <i>Laodong Gaizao</i>, “re-education through labor” in prison camps.  And this logical consequentialism does not even begin to address desirism’s fatal structural flaws related to the impossibility of establishing precisely what the divergent and opposing desires are, measuring their relative strengths, ennumerating their respective adherents, or accounting for the incontrovertible fact that desires fluctuate and change within every individual.</p><p>While you may not be troubled by the fact that your chosen morality is definitionally Satanic from the Christian perspective, I would at least hope the fact that it can be accurately described as collective Maoism and utilized to logically justify the moral goodness of the historical <i>Endlösung</i> would encourage you to reconsider your enthusiasm for it.  While the truth or falsehood of desirism may not be determined by the consequences of the actions it dictates, they must nevertheless be taken into account by anyone who is willing to state an opinion about the truth of Christianity on the basis of the actions of Christians or the Christian God.</p><p>With regards,<br> Vox</br></p><p><i>This was written in response to <a href=\"http://commonsenseatheism.com/?p=4104\">4th Letter to Vox Day</a></i></p></div>",
  "content_text": "Dear Luke,\nI’m pleased that we appear to be getting back on track.  But before we delve into the substance of the discourse, I must first point out that the reason you could not count the insults in my previous letter to you is because there were none.  While you may find it embarrassing to have some of your claims to knowledge exposed as false, it is no more insulting for me to declare and subsequently demonstrate your ignorance about basic concepts of mainstream Christian theology than it was for you to imply that I have never thought about how my beliefs can be justified, or to declare that my statements about evolution are discredited, that my assertions about the Christian worldview are absurd, that I repeat many common distortions, and that my concept of morality is terrifying.  This is particularly true in light of the fact that the first four of these “insulting” statements were false, whereas the case for your theological ignorance is conclusive.  Please also keep in mind that the only reason it became necessary to publicly demonstrate the limits of your theological knowledge was because you made the charge of obscurantism.\nDespite your admission of relative ignorance in your last letter, the salient point still appears to have escaped you.  The relevant fact is not that you are unfamiliar with popular children’s literature, a science fiction novel, or even the Western literary canon that includes Milton’s\nParadise Lost\nand Dante’s\nInferno\n, but rather that you are insufficiently familiar with the text of the New Testament and the orthodox interpretations of it that have been the mainstream Christian perspective for most of the last two millennia.  Vox Day Christianity, as you call it, is indistinguishable in the vast majority of particulars from mainstream Protestant Christianity, so there is no justification for attempting to create any distinction between the two because my theological idiosyncracies are of little relevance to this discussion.  You require a much better grasp of mainstream theology than you possess in order to determine which of my beliefs are exotic and which are entirely orthodox, and anyone of reasonable familiarity with the Bible will find my Christian theology to be entirely in line with Scripture even if they happen to disagree with a few of my conclusions and conjectures.  Nothing I have mentioned in my previous letters, with the possible exception of the extent of God’s knowledge, can be reasonably characterized as being outside mainstream Protestant Christianity.  And even in the case of Open Theism, that is a debate that is taking place entirely within that mainstream.\nThis leads me to the inconsistency demonstrated in your ill-considered attempt to plead the Courtier’s Reply.  While a lifelong atheist could reasonably admit ignorance of a particular theology based upon the existence of something he does not believe, this is not true in the case of an atheist who presents himself as a former believer, especially not one who claims to be not only well-versed, but “too familiar” with the relevant theologies.  The analogy fails because even if you are now an atheist who considers theology akin to the systematic study of imaginary fabrics, you presented yourself as a former expert on those very fabrics.  You may come from a tradition that values clarity, argument, and evidence, but thus far you have exhibited little more than ignorance, logical incompetence, and inconsistency.  Lest you be tempted to cry insult again, please note that this conclusion is merely an observation based on the evidence of your four letters and I believe it is one that is very difficult for the objective reader to avoid.  Fortunately, all three conditions can be remedied as they are not terminal.\nFor example, it was logically false to assert that the answer to the question “Do you believe in evil?” was somehow dependent upon my definition of evil.  As was indicated by the subsequent questions regarding the nature of evil, the question clearly applied to your belief\nin any form of evil\n, not your belief in evil as I happen to define it.  I did not ask “Do you believe in evil as I previously defined it?”  If you are an NFL fan and I ask the question “Do you like football?”, the correct answer is “yes, I do like football” even if you suspect that I may be thinking of the sport which is called soccer in the States.  Regardless of whether I am talking about soccer or NFL football, the fact remains that you are a fan of the sport of football.  Since you eventually declared that you believe in an evil that “thwarts more and stronger reasons for action than it fulfills”, it appears that your answer is yes, you believe in evil.  If I have misinterpreted your answer and you actually do not believe in any form of evil, please correct me.\nWhile it is true that there are many different definitions of objective and subjective, the philosophers’ concept of mind-independence is no more relevant to the subject at hand than the grammatical concept pertaining to the use of a form as the object of a transitive verb.  Applying the relevant definition of objective to your answer – “not influenced by personal feelings, interpretations, or prejudice; based on facts; unbiased:\nan objective opinion\n” – regarding the nature of evil clearly indicates that you believe evil is a fundamentally subjective concept.  In fact, based on your explication of desirism, it is apparent that in your view, evil is not only subjective, but dynamic and transitory as well.  Unfortunately, this rejection of the concept of objective evil renders it impossible for us to compare the Christian view of evil with other accounts of it because neither of us can possibly know what your definition of evil is for any single act or individual at any given point on the space-time continuum.  Since we lack any fixed and coherent metric, no comparisons are possible.  I am open to hearing any suggestions you might have for an objective measure by which the Christian concept of evil can be compared with other religious and philosophical concepts of evil, but as it stands, given your rejection of an objective standard of evil and your preference for a subjective and transitory one, we can no more compare the Christian definition of evil to other accounts of it than we could compare our respective heights by utilizing variable centimeters.  If you have any ideas for a reasonable and objective measure by which we can judge these competing concepts, please feel free to suggest them.  My suggestion is that if you could even identify a single act that you believe to be objectively evil that is also deemed evil under the Christian moral code, such as the act of rape, we could at least make a partial comparison of religious and philosophical moral codes.\nBut in the meantime, I will say that I find your moral perspective on good and evil to be both fascinating… and familiar.  You describe it as desirism, which is a term that is new to me, but based on your description it appears to be little more than a collectivist variant on an older moral code that is perhaps best exhibited in the commentaries that a young philosophy student once wrote on\nA System of Ethics\nby Friedrich Paulsen.\n“I do not agree with the view that to be moral, the motive of one’s actions has to be benefiting others. Morality does not have to be defined in relation to others. . . . [People like me want to] satisfy our hearts to the full and in doing so we automatically have the most valuable moral codes. Of course there are people and objects in the world, but they are all there only for me. . . . I have my desire and act on it.”\nIt appears that the only substantive difference between your desirism and the desirism of Mao Tse-Tung is that your moral code is, ironically enough, more collective than the infamous communist leader’s. Whereas Mao distinguishes between good and evil on the sole basis of the comparative strengths of the individual desires, you add to this comparison the additional component of a majority vote.  Even if we leave the consequences of this utilitarianism aside, which you will note you have not done in some of your previous references to Christian morality, this is a rationally untenable position that is even less defensible than Sam Harris’s happiness/suffering moral metric.  I believe you already suspect as much due to your quixotic attempt to define certain desires as not-desires in order to avoid the uncomfortable logical conclusions to your moral reasoning.\nWhen you assert, for example, that racism is evil under the desirist code, you are therefore required to assume that more and stronger desires are potentially thwarted than fulfilled by it.  But this assumption is easily shown to be a false one.  In materalist terms, the desire to live is observably no stronger than the desire to propagate one’s own kind, this is why most people will risk fatal diseases in order to engage in sexual relations, why a woman will carry a child to term even when doing so risks her own life, and why men will sacrifice their lives to preserve the lives of their women and children.  This indicates that the strength of the collective racist desire for racial purity is stronger than the collective non-racist desire for a multi-racial culture and may even be stronger than the collective desire of the minority races to survive.  This is supported by an examination of your chosen example of Triumphant Nazism, which proves precisely the opposite of what you believed it did.\n“Turn this knob to the right, and racist desires strengthen throughout the population. Turn this knob to the left, and racist desires decrease. To say that racist desires are evil is to say that turning this knob to the right thwarts more desires than turning this knob to the left. If we turn the knob to the right, many racist desires are fulfilled but the desires of minorities are thwarted. If we turn the knob all the way to the left, no racist desires are thwarted (because they don’t exist), and also the desires of minorities are not thwarted.”\nThis reasoning led you to an incorrect conclusion because you failed to realize that turning the knob all the way to the right means that racist desires are fulfilled and no desires of minorities are thwarted – because they don’t exist either!  As you wrote, turning the knob all the way to the left means that no racist desires are thwarted and no desires of minorities are thwarted.  But because a failure to thwart desires is not equivalent to\nfulfilling\ndesires, this means that turning the knob all the way to the right would not only fulfill more and stronger reasons for action than it would thwart, it would fulfill more and stronger reasons for action than turning the knob all the way to the left even without the numerical requirement of a majority of the population possessing the racist desires.  Therefore, under the desirist moral code, the Nazi extermination program is confirmed to be good and opposition to it,\nor even mitigation of it\n, is a definite evil.\nMoreover, the intrinsically totalitarian aspects of your moral code are intimated even in your incorrect interpretation of the example.  If, for example, turning the knob all the way to the left would fulfill more desires than it would thwart, then it would be a moral good to eliminate the racist desires from those harboring them and a moral evil to fail to do so.  It is no coincidence that this is precisely the reasoning that the Maoists used in attempting to eliminate “false consciousness” by the use of\nLaodong Gaizao\n, “re-education through labor” in prison camps.  And this logical consequentialism does not even begin to address desirism’s fatal structural flaws related to the impossibility of establishing precisely what the divergent and opposing desires are, measuring their relative strengths, ennumerating their respective adherents, or accounting for the incontrovertible fact that desires fluctuate and change within every individual.\nWhile you may not be troubled by the fact that your chosen morality is definitionally Satanic from the Christian perspective, I would at least hope the fact that it can be accurately described as collective Maoism and utilized to logically justify the moral goodness of the historical\nEndlösung\nwould encourage you to reconsider your enthusiasm for it.  While the truth or falsehood of desirism may not be determined by the consequences of the actions it dictates, they must nevertheless be taken into account by anyone who is willing to state an opinion about the truth of Christianity on the basis of the actions of Christians or the Christian God.\nWith regards,\nVox\nThis was written in response to\n4th Letter to Vox Day",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-23T08:14:00+00:00"
}