{
  "url": "https://voxday.net/2009/10/17/liberal-integrity/",
  "scraped_at": "2026-01-08T23:09:39.944657",
  "title": "Liberal integrity",
  "date_display": "October 17, 2009",
  "date_iso": "2009-10-17T17:38:00+00:00",
  "date_from_url": "2009-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Florio of Pro Football Talk <a href=\"http://profootballtalk.nbcsports.com/2009/10/17/first-paper-to-run-limbaugh-slavery-quote-issues-retraction/\">desperately tries to cover his backside</a> after the St. Louis Post-Dispatch admitted that it has no evidence that Rush Limbaugh ever made the “divisive” comments that caused him to be dropped from the ownership group bidding for the Rams.</p><p><i>“When posting on the matter on Monday, we made it clear that Limbaugh contends he never said the words.”</i></p><p>That’s Florio’s story now.  But that’s also a very misleading characterization of <a href=\"http://profootballtalk.nbcsports.com/2009/10/12/limbaugh-addresses-critics-of-his-plan-to-buy-the-rams/\">his earlier post</a> on the matter, to say nothing of the intervening posts made in the five days between Monday and Saturday:</p><blockquote><p>During his Monday show, Limbaugh broadly claimed that 15 hours per week of radio programming covering 21 years had been reviewed.  (It’s a job that would take more than 16,000 hours, so he apparently has a bunch of employees.)  Said Limbaugh, “There is not even an inkling that any words in this quote are accurate.”</p><p>But here’s the key — he never directly denied saying the precise words that Burwell assigned to him.  Sure, Limbaugh made vague claims of libel and slander, but there should be no ambiguity here.  If Burwell attributed a concocted, made up quote to Limbaugh, Limbaugh’s lawyers should be demanding a retraction and a large bag of cash.</p><p>Though I’ve got no idea whether Limbaugh said it, Burwell says that Limbaugh said it.  And if Limbaugh didn’t say it, he’s got an open-and-shut defamation claim against Burwell, the Post-Dispatch, and anyone else who has attributed that quote to Limbaugh….</p><p>Look, either he said it or he didn’t.  And in referring to an item from the Post-Dispatch that troubled him because it suggested that he supports slavery, all Limbaugh had to do was read the quote that Bryan Burwell attributed to Limbaugh and say, “Folks, here are the words they say that I said.  And I swear to you that I never uttered these words.”</p><p>The fact that Limbaugh didn’t do that makes us think that maybe he said it.  And we’ll continue to think that maybe Limbaugh said it until Limbaugh either specifically and categorically denies making the remark or successfully sues Burwell and the Post-Dispatch for falsely claiming that Limbaugh made a statement that any fair-minded person would regard as incredibly and patently racist.</p></blockquote><p>I like Pro Football Talk.  It’s a good NFL-related site.  But, like many of its readers, its ludicrously biased coverage of the <i>affaire Limbaugh</i> has forced me to concur with many other PFT readers who have concluded that its proprietor appears to have the integrity of a player’s agent and the spine of a sea slug.  Everyone who knew anything about Limbaugh and the way the left obsessively tracks his show knew there was no chance that he had said anything even remotely similar to what was falsely attributed to him.  Read the comments, as it’s obvious that a lot of PFT readers are not inclined to let Florio skate by on this one.</p><p>The man owes Limbaugh an unmitigated apology as does the NFL commissioner, Smith from the NFLPA, and a whole host of other media lefties who mindlessly leaped to the attack and in doing so shredded their false claims to objectivity.  I rather hope Rush does as Florio originally suggested and follows through in suing those who slandered him.</p></div>",
  "content_text": "Mike Florio of Pro Football Talk\ndesperately tries to cover his backside\nafter the St. Louis Post-Dispatch admitted that it has no evidence that Rush Limbaugh ever made the “divisive” comments that caused him to be dropped from the ownership group bidding for the Rams.\n“When posting on the matter on Monday, we made it clear that Limbaugh contends he never said the words.”\nThat’s Florio’s story now.  But that’s also a very misleading characterization of\nhis earlier post\non the matter, to say nothing of the intervening posts made in the five days between Monday and Saturday:\nDuring his Monday show, Limbaugh broadly claimed that 15 hours per week of radio programming covering 21 years had been reviewed.  (It’s a job that would take more than 16,000 hours, so he apparently has a bunch of employees.)  Said Limbaugh, “There is not even an inkling that any words in this quote are accurate.”\nBut here’s the key — he never directly denied saying the precise words that Burwell assigned to him.  Sure, Limbaugh made vague claims of libel and slander, but there should be no ambiguity here.  If Burwell attributed a concocted, made up quote to Limbaugh, Limbaugh’s lawyers should be demanding a retraction and a large bag of cash.\nThough I’ve got no idea whether Limbaugh said it, Burwell says that Limbaugh said it.  And if Limbaugh didn’t say it, he’s got an open-and-shut defamation claim against Burwell, the Post-Dispatch, and anyone else who has attributed that quote to Limbaugh….\nLook, either he said it or he didn’t.  And in referring to an item from the Post-Dispatch that troubled him because it suggested that he supports slavery, all Limbaugh had to do was read the quote that Bryan Burwell attributed to Limbaugh and say, “Folks, here are the words they say that I said.  And I swear to you that I never uttered these words.”\nThe fact that Limbaugh didn’t do that makes us think that maybe he said it.  And we’ll continue to think that maybe Limbaugh said it until Limbaugh either specifically and categorically denies making the remark or successfully sues Burwell and the Post-Dispatch for falsely claiming that Limbaugh made a statement that any fair-minded person would regard as incredibly and patently racist.\nI like Pro Football Talk.  It’s a good NFL-related site.  But, like many of its readers, its ludicrously biased coverage of the\naffaire Limbaugh\nhas forced me to concur with many other PFT readers who have concluded that its proprietor appears to have the integrity of a player’s agent and the spine of a sea slug.  Everyone who knew anything about Limbaugh and the way the left obsessively tracks his show knew there was no chance that he had said anything even remotely similar to what was falsely attributed to him.  Read the comments, as it’s obvious that a lot of PFT readers are not inclined to let Florio skate by on this one.\nThe man owes Limbaugh an unmitigated apology as does the NFL commissioner, Smith from the NFLPA, and a whole host of other media lefties who mindlessly leaped to the attack and in doing so shredded their false claims to objectivity.  I rather hope Rush does as Florio originally suggested and follows through in suing those who slandered him.",
  "tags": [
    "politics",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-17T16:38:00+00:00"
}