{
  "url": "https://voxday.net/2009/10/16/mailvox-on-method/",
  "scraped_at": "2026-01-08T23:09:34.425488",
  "title": "Mailvox: on method",
  "date_display": "October 16, 2009",
  "date_iso": "2009-10-16T16:08:00+00:00",
  "date_from_url": "2009-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB thinks he’s figured out my approach to developing defensible positions:</p><blockquote><p>Here’s an outline based on my observations of your learning to thesis process. Is there anything I’m missing?</p><p>1. Select narrow topic.<br> 2. Ask experts to ID sources.<br> 3. Scan and jot occasional note.<br> 4. 2nd reading, pursue suspicions deep into the material.<br> 5. Make minimal positive public statements and destroy opponents using their own illogic.<br> 6. Gradually increase positive suggestions and assertions to keep pace with finished thesis.<br> 7. When challenged on an iceberg tip, unload thesis for maximum credibility transfer.</br></br></br></br></br></br></p></blockquote><p>I can’t say that I’ve ever thought through how I approach this sort of thing, really, but I suppose that’s actually a fairly accurate description of how I go about the process of learning something new that is likely to be contentious in some way.  The most important thing is to resist the urge to engage in any debate or do anything but ask questions when you have not yet mastered a sufficient amount of the best material that is reasonably accessible to you, especially the best material from the contrary side.  For example, in writing RGD, I went back and read three of Keynes’s works, as well as Samuelson’s original 1948 textbook and five of Paul Krugman’s books, in addition to about fifty or sixty of his columns, in order to ensure that I had the Keynesian position correct.  (I still somehow managed to miss the one in which he first calculated the need for a stimulus that was smaller than the one he later criticized the Obama administration for not making larger.)  I then read several Austrian criticisms of Keynes, beginning with Hayek and Hazlitt.  Why?  Because I know that every Keynesian economist who reads the book is going to do his damndest to attack my understanding of Keynesianism, Neo-Keynesianism, and Post-Keynesianism in order to use even the slightest error as an excuse to dismiss my conclusions.  It’s entirely possible – in fact, it’s probable – that they’ll find something, but I’m not going to make it easy for them.  The monetarists, of course, will be too busy having hissy fits over my characterization of Milton Friedman as a Keynesian heretic who nonetheless remains a Keynesian to notice that they have completely abandoned the core of his monetarist theory.</p><p>The fact that I know Krugman’s work, or Dawkins’s work, or Marx’s work much better than the vast majority of their fans always gives me a massive advantage in discussions, especially when those on the other side haven’t bothered to read a speck of anything that criticizes their point of view.  My feeling is that you can best understand something by reading both the source material and the critical material, which for some reason most people seem loathe to do.  Conversely, the worst thing you can do is what many atheists do so often and so foolishly, which is pretend to knowledge that you do not have and which the other side almost certainly possesses.</p><p>This segues nicely to Sloo’s complaint about my etiquette:</p><blockquote><p>I really tried to get into this debate. But as I read Vox’s replies, his condescending sneer works its way into my head and replaces my mental reading voice. It really is off-putting, surely you guys have to admit. He is clearly an intelligent man, but 60% of everything is the delivery. Work a little on your tact and social manners Vox, you have already proven your intellect.  Oh, and why the smokescreen still? ‘Refer to my book’, ‘as Thomas Aquinas says’, ‘again you [Luke] have made an incorrect assumption/have demonstrated your ignorance/are ill-prepared etc. etc. Clearly we’re all just complete idiots in your presence Vox, so why don’t you just spell out your points for us.</p></blockquote><p>Tone is not truth, and neither tact nor manners are the issue here.  I didn’t select the tone of the discussion, which was set by Luke’s second letter.  I’ve made it very clear that I will always respond to others in the manner they address me.  If you don’t want me to mercilessly expose your errors, your ignorance, and your lack of intelligence, then I strongly recommend that you avoid attacking me, launching passive-aggressive assaults, or informing me that I am wrong/stupid/uninformed without being able to conclusively demonstrate it.  If you can show me I’m wrong, I’ll admit it.  I have done it before, I will do it again, and I have no problem doing it.  But, if you incorrectly assert that I am wrong, I also don’t have any problem with demonstrating, in excruciating and humiliating detail if that’s what you require, that your assertions are false.</p><p>As for smokescreens, the fact that you think I have engaged in any says far more about your own approach to debate than it does about anything I’ve written here.  I think it’s absurd to expect me to cut-and-paste numerous pages of text that I’d previously written into what is already a three thousand-word letter.  If you can’t bother to read something that is supposedly of interest to you, well, you’ll have to find someone else to hold your hand because I’m not going to waste my time.</p><p>King Prawn, meanwhile, takes exception to my assuming a literate readership:</p><blockquote><p>Your explanation of the Silent Planet reference was both enlightening and helpful to furthering the discussion. I don’t understand why you couldn’t have just laid it out before. It’s a bit unreasonable to expect everyone to have read all the same books you have and therefore to have the background information to come to your “obvious” conclusion. You also seem to think your dimissals are warranted, but I think maybe you misunderstand the purpose of dialogue. You communicate your thoughts, then recieve feedback. Regardless of the intelligence level of the recipient, one should strive to make themselves understood. You are running the risk of appearing not to have entered this discussion in good faith.</p></blockquote><p>Let me get this straight.  I get invited to a discussion about my religious beliefs which the other party immediately attempts to turn into a conventional bait-and-switch on evolution.  He then makes numerous false claims about both his knowledge and my own, and engages in passive-aggressive attacks while demonstrating a near-complete lack of understanding of something he claims to understand very well… and you think I’m running the risk of not having entered the discussion in good faith?</p><p>As for not walking Luke through the Lewis metaphor, I can only say that if he was genuinely a sincere former Christian possessed of great familiarity with the wide variety of Christian theologies that he claimed to be, there is simply no chance that he would not immediately recognize the “Silent Planet” metaphor or fail to grasp its connection to the temptation of Jesus Christ in the desert.  Even an intelligent non-Christian with no theological knowledge at all could probably have figured it out with or without the aid of a visit to Wikipedia.  I cited the title of the first book in the most famous Christian science fiction trilogy, not an obscure bit of text buried somewhere in Aquinas or Augustine that no one can reasonably be expected to know.  Since I recently wrote reviews on books by Shermer and Bernanke, it should be readily apparent that I don’t expect most people to have read what I have read.  But if you haven’t even read <i>C.S. Lewis</i>, then I have absolutely no time or regard for you.</p><p>As for dismissal, what else can one possibly do with feedback that is illogical, incorrect, and based on a false understanding of what was written?  I once interviewed Umberto Eco and was a little surprised at how vehemently he engaged with my questions and disputed the interpretations of his texts that lay underneath them.  It wasn’t until later, when I saw him deal very kindly with a petrified interviewer who was in well over her head, that I realized he had responded to me as an intellectual equal and was taking my questions seriously.  I don’t mind walking people through things when they genuinely want to learn – that’s what Voxiversity is for – but if you want to be handled with kid gloves, then you’d best not come here demanding treatment as an equal, much less a superior.</p></div>",
  "content_text": "JB thinks he’s figured out my approach to developing defensible positions:\nHere’s an outline based on my observations of your learning to thesis process. Is there anything I’m missing?\n1. Select narrow topic.\n2. Ask experts to ID sources.\n3. Scan and jot occasional note.\n4. 2nd reading, pursue suspicions deep into the material.\n5. Make minimal positive public statements and destroy opponents using their own illogic.\n6. Gradually increase positive suggestions and assertions to keep pace with finished thesis.\n7. When challenged on an iceberg tip, unload thesis for maximum credibility transfer.\nI can’t say that I’ve ever thought through how I approach this sort of thing, really, but I suppose that’s actually a fairly accurate description of how I go about the process of learning something new that is likely to be contentious in some way.  The most important thing is to resist the urge to engage in any debate or do anything but ask questions when you have not yet mastered a sufficient amount of the best material that is reasonably accessible to you, especially the best material from the contrary side.  For example, in writing RGD, I went back and read three of Keynes’s works, as well as Samuelson’s original 1948 textbook and five of Paul Krugman’s books, in addition to about fifty or sixty of his columns, in order to ensure that I had the Keynesian position correct.  (I still somehow managed to miss the one in which he first calculated the need for a stimulus that was smaller than the one he later criticized the Obama administration for not making larger.)  I then read several Austrian criticisms of Keynes, beginning with Hayek and Hazlitt.  Why?  Because I know that every Keynesian economist who reads the book is going to do his damndest to attack my understanding of Keynesianism, Neo-Keynesianism, and Post-Keynesianism in order to use even the slightest error as an excuse to dismiss my conclusions.  It’s entirely possible – in fact, it’s probable – that they’ll find something, but I’m not going to make it easy for them.  The monetarists, of course, will be too busy having hissy fits over my characterization of Milton Friedman as a Keynesian heretic who nonetheless remains a Keynesian to notice that they have completely abandoned the core of his monetarist theory.\nThe fact that I know Krugman’s work, or Dawkins’s work, or Marx’s work much better than the vast majority of their fans always gives me a massive advantage in discussions, especially when those on the other side haven’t bothered to read a speck of anything that criticizes their point of view.  My feeling is that you can best understand something by reading both the source material and the critical material, which for some reason most people seem loathe to do.  Conversely, the worst thing you can do is what many atheists do so often and so foolishly, which is pretend to knowledge that you do not have and which the other side almost certainly possesses.\nThis segues nicely to Sloo’s complaint about my etiquette:\nI really tried to get into this debate. But as I read Vox’s replies, his condescending sneer works its way into my head and replaces my mental reading voice. It really is off-putting, surely you guys have to admit. He is clearly an intelligent man, but 60% of everything is the delivery. Work a little on your tact and social manners Vox, you have already proven your intellect.  Oh, and why the smokescreen still? ‘Refer to my book’, ‘as Thomas Aquinas says’, ‘again you [Luke] have made an incorrect assumption/have demonstrated your ignorance/are ill-prepared etc. etc. Clearly we’re all just complete idiots in your presence Vox, so why don’t you just spell out your points for us.\nTone is not truth, and neither tact nor manners are the issue here.  I didn’t select the tone of the discussion, which was set by Luke’s second letter.  I’ve made it very clear that I will always respond to others in the manner they address me.  If you don’t want me to mercilessly expose your errors, your ignorance, and your lack of intelligence, then I strongly recommend that you avoid attacking me, launching passive-aggressive assaults, or informing me that I am wrong/stupid/uninformed without being able to conclusively demonstrate it.  If you can show me I’m wrong, I’ll admit it.  I have done it before, I will do it again, and I have no problem doing it.  But, if you incorrectly assert that I am wrong, I also don’t have any problem with demonstrating, in excruciating and humiliating detail if that’s what you require, that your assertions are false.\nAs for smokescreens, the fact that you think I have engaged in any says far more about your own approach to debate than it does about anything I’ve written here.  I think it’s absurd to expect me to cut-and-paste numerous pages of text that I’d previously written into what is already a three thousand-word letter.  If you can’t bother to read something that is supposedly of interest to you, well, you’ll have to find someone else to hold your hand because I’m not going to waste my time.\nKing Prawn, meanwhile, takes exception to my assuming a literate readership:\nYour explanation of the Silent Planet reference was both enlightening and helpful to furthering the discussion. I don’t understand why you couldn’t have just laid it out before. It’s a bit unreasonable to expect everyone to have read all the same books you have and therefore to have the background information to come to your “obvious” conclusion. You also seem to think your dimissals are warranted, but I think maybe you misunderstand the purpose of dialogue. You communicate your thoughts, then recieve feedback. Regardless of the intelligence level of the recipient, one should strive to make themselves understood. You are running the risk of appearing not to have entered this discussion in good faith.\nLet me get this straight.  I get invited to a discussion about my religious beliefs which the other party immediately attempts to turn into a conventional bait-and-switch on evolution.  He then makes numerous false claims about both his knowledge and my own, and engages in passive-aggressive attacks while demonstrating a near-complete lack of understanding of something he claims to understand very well… and you think I’m running the risk of not having entered the discussion in good faith?\nAs for not walking Luke through the Lewis metaphor, I can only say that if he was genuinely a sincere former Christian possessed of great familiarity with the wide variety of Christian theologies that he claimed to be, there is simply no chance that he would not immediately recognize the “Silent Planet” metaphor or fail to grasp its connection to the temptation of Jesus Christ in the desert.  Even an intelligent non-Christian with no theological knowledge at all could probably have figured it out with or without the aid of a visit to Wikipedia.  I cited the title of the first book in the most famous Christian science fiction trilogy, not an obscure bit of text buried somewhere in Aquinas or Augustine that no one can reasonably be expected to know.  Since I recently wrote reviews on books by Shermer and Bernanke, it should be readily apparent that I don’t expect most people to have read what I have read.  But if you haven’t even read\nC.S. Lewis\n, then I have absolutely no time or regard for you.\nAs for dismissal, what else can one possibly do with feedback that is illogical, incorrect, and based on a false understanding of what was written?  I once interviewed Umberto Eco and was a little surprised at how vehemently he engaged with my questions and disputed the interpretations of his texts that lay underneath them.  It wasn’t until later, when I saw him deal very kindly with a petrified interviewer who was in well over her head, that I realized he had responded to me as an intellectual equal and was taking my questions seriously.  I don’t mind walking people through things when they genuinely want to learn – that’s what Voxiversity is for – but if you want to be handled with kid gloves, then you’d best not come here demanding treatment as an equal, much less a superior.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-16T15:08:00+00:00"
}