{
  "url": "https://voxday.net/2009/10/27/mailvox-materialists-dilemma/",
  "scraped_at": "2026-01-08T23:10:40.157174",
  "title": "Mailvox: the materialist’s observations",
  "date_display": "October 27, 2009",
  "date_iso": "2009-10-27T10:00:00+00:00",
  "date_from_url": "2009-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JS is musing on some observations:</p><blockquote><p>I wanted to  ask you about William Lane Craig. Having seen or listened to many of his debates and arguments, I have to say that the guy is pretty impressive. During his debate with Bart Ehrman though, Ehrman brought up an interesting point.  Craig had pulled out some probability equations to display that the resurrection of Christ was more likely than other explanations (followers stealing the body, Jesus’ evil twin), particularly the explanations put forth in Ehrman’s book. Ehrman then responded by saying “I can’t believe we are arguing about the probability of the resurrection, we would be laughed off the stage if we were in front of a crowd of real academics.” He then went on to downplay WLC appeals to authority by stating Craig taught and lived in a bubble where all the academics he interacted with were believers and that he had little idea of the beliefs of academics outside the academia of faith.</p><p>In addition to ridiculing Craig’s authority appeals, what Ehrman was getting at was that the idea of a supernatural resurrection is so ridiculous, probability formulation doesn’t even come into play because it is absurd on the face of it. Isn’t this where believers’ argument get hung up, even arguments as compelling as Craig’s? Given what we know about the physical world, a  mythical resurrection just isn’t possible.  Keep in mind that I’m not necessarily making a statement of opposition here, just stating an “observable truth”. This brings forward another question, which is why we don’t see evidence of the supernatural/mystical/divine, etc. today? My thought is that if this material existed, we would have found some definitive evidence for it by now. But what little evidence there is for ghost or whatever else, is readily dismissed. Do you Vox, have any examples of the supernatural that would be at all convincing to the open mind?</p><p>Finally, while my materialism may be strong, I have noticed a sad trend with my fellow materialists, which is a vainglorious attitude and sort of misplaced condescension. When I read Sam Harris’ article against Francis Collins, I must admit that I was ashamed to be part of this worldview, yet the shouts of “here, here” on the message boards in the secular blogosphere were largely in agreement. If Collins had been Jewish or Islamic, I’m pretty sure the NYT would not have run that article.</p><p>My final question to you is this….what is the source of this narrow-minded attitude of the secular set, be they scientist, philosopher, or layperson? Is it fear? My thought is that if your argument is strong enough, there is no reason to resort to libelous acts and petty insults. I have started to notice this trend among my fellow secularists more and more and admit that it is beginning to try my patience.</p></blockquote><p>First, let me say that I am deeply unimpressed by both Craig’s appeal to mathematical precision and Ehrman’s appeal to academic credentials.  Craig’s stunt is no more valid when he pulls it than it was when Dawkins or Luke do the same; “probability calculations” have all too often become a bizarre rhetorical flourish that is no more legitimate today than were similarly innumerate shenanigans when Charles Babbage decried them back in 1830.  Any economist can tell you that probability is problematic enough even when you have the relevant numbers, and appealing to it is fraudulent when you don’t – especially when you don’t because you <i>can’t</i>!</p><p>Ehrman, however, is demonstrating nothing but a willfully closed mind and a blind faith in materialism.  We see observable evidence of what may or may not be the supernatural every day, from the mystery of human consciousness to people being confirmed dead by medical experts and then somehow returning to life.  The fact that we possess possible material explanations for these things and that this evidence presently falls short of being definitive does not make it nonexistent.  I readily admit that we may one day prove that consciousness is a purely material construct and that every single post-mortem resurrection was merely a mistaken observation on the declaring doctor’s part, but in the meantime, assuming those two things as fact is nothing but an act of pure and stubborn faith that cannot be justified by the material evidence available at the present.  This is a good example of how many atheist arguments rely upon appeals to logic even though they are presented under the color of science.</p><p>Moreover, this ignores the mass of documentary evidence <a href=\"http://www.archive.org/stream/demonpossessiona00nevi/demonpossessiona00nevi_djvu.txt\">supporting the existence</a> of the supernatural.  While it is often possible to dismiss testimonial evidence with ex post facto diagnoses of “mental illness” and “hallucination”, there are no shortage of incidents that do not lend themselves to such interpretations, such as when individuals speak languages they do not know or possess information that they have no material means of possessing.  I have personally witnessed the latter, and while in that particular case I can concoct a very complicated and improbable (in the non-mathematical sense) scenario in order to rationalize it materially, it is not the sort of thing that anyone who is genuinely open-minded would be able to completely dismiss.</p><p>As for your observation that your fellow secular materialists have become increasingly vainglorious and narrow-minded, I believe it is because they have been misled into a false sense of security by a combination of Christian intellectual sloth and the increasing compartmentalization of Western society.  Intelligent, self-satisfied atheists with post-graduate degrees think those who believe in the supernatural are all poorly educated dimwits out to oppress others for the same reason that wealthy, suburban Christians with beautiful families think those who don’t believe in God are all miserable gay alcoholics out to commit suicide.  Their paths very seldom cross, their assumptions are often confirmed by the extreme examples that come to their attention, and on the rare occasion that the intelligent, highly-educated Christian or the happy, well-adjusted atheist finds himself in the territory of “the other”, he’s usually going to be inclined to keep his mouth shut about his beliefs in order to avoid unnecessarily rocking the boat.  This dynamic can be seen at work even on this blog, as with a few exceptions, the people known with certainty to be atheists tend to be the less intelligent, socially autistic variety, just as on campus the only identifiable Christians tend to be either the genuine saints or annoying evangelizing whackos.</p><p>Nor should the effect of Christian intellectual sloth be discounted.  Having long been the dominant belief-system, Christians all too readily drift off into internecine navel-gazing rather than intelligent engagement; even here I occasionally have to prevent people from starting an esoteric theological debate while in the middle of discussing the most basic concepts with non-believers who are unfamiliar with them.  I think part of what you are describing is a minor secular version of the same process at work in the university environment.  When Sam Harris makes a demonstrably stupid statement about the intrinsic inability of someone given to “magical thinking” to perform science, a statement which can be easily and conclusively proved to be utterly false, he is not questioned by his fellow secularists, let alone derided as he merits.  And even in your own case, your language betrays the bias of your assumptions.  There is no debate over whether a mythical resurrection is or isn’t possible because the question at hand is whether the impossible resurrection is a myth or not!  And remember how often academics have been historically prone to reach consensus on beliefs and ideologies later confirmed to have been completely false – see yesterday’s post on <a href=\"http://www.milobookclub.com/2009/10/26/wnd-depression-po/\">Mises vs Mayers</a> for just one of many possible examples – so I suggest it would not be wise to place too much confidence in the present academic consensus regarding rational materialism.</p><p>I explained my reasoning on the non-existence of scientific evidence for the supernatural in a 2002 column entitled <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=26592\">Satan, Science, and the Supernatural</a>.  Jesus taught that we cannot enter into the light until we first recognize and reject the darkness within us, so if you are going to find evidence for the supernatural in a fallen world, you must begin by searching for evil.  To paraphrase Nietzsche, if you stare into the abyss long enough, it will eventually meet your eyes. You may not be a Christian once you reach that point, but you will certainly no longer be a pure materialist either.  Nietzsche was speaking metaphorically, of course, but I believe his words are more literally true than he realized or intended at the time.</p></div>",
  "content_text": "JS is musing on some observations:\nI wanted to  ask you about William Lane Craig. Having seen or listened to many of his debates and arguments, I have to say that the guy is pretty impressive. During his debate with Bart Ehrman though, Ehrman brought up an interesting point.  Craig had pulled out some probability equations to display that the resurrection of Christ was more likely than other explanations (followers stealing the body, Jesus’ evil twin), particularly the explanations put forth in Ehrman’s book. Ehrman then responded by saying “I can’t believe we are arguing about the probability of the resurrection, we would be laughed off the stage if we were in front of a crowd of real academics.” He then went on to downplay WLC appeals to authority by stating Craig taught and lived in a bubble where all the academics he interacted with were believers and that he had little idea of the beliefs of academics outside the academia of faith.\nIn addition to ridiculing Craig’s authority appeals, what Ehrman was getting at was that the idea of a supernatural resurrection is so ridiculous, probability formulation doesn’t even come into play because it is absurd on the face of it. Isn’t this where believers’ argument get hung up, even arguments as compelling as Craig’s? Given what we know about the physical world, a  mythical resurrection just isn’t possible.  Keep in mind that I’m not necessarily making a statement of opposition here, just stating an “observable truth”. This brings forward another question, which is why we don’t see evidence of the supernatural/mystical/divine, etc. today? My thought is that if this material existed, we would have found some definitive evidence for it by now. But what little evidence there is for ghost or whatever else, is readily dismissed. Do you Vox, have any examples of the supernatural that would be at all convincing to the open mind?\nFinally, while my materialism may be strong, I have noticed a sad trend with my fellow materialists, which is a vainglorious attitude and sort of misplaced condescension. When I read Sam Harris’ article against Francis Collins, I must admit that I was ashamed to be part of this worldview, yet the shouts of “here, here” on the message boards in the secular blogosphere were largely in agreement. If Collins had been Jewish or Islamic, I’m pretty sure the NYT would not have run that article.\nMy final question to you is this….what is the source of this narrow-minded attitude of the secular set, be they scientist, philosopher, or layperson? Is it fear? My thought is that if your argument is strong enough, there is no reason to resort to libelous acts and petty insults. I have started to notice this trend among my fellow secularists more and more and admit that it is beginning to try my patience.\nFirst, let me say that I am deeply unimpressed by both Craig’s appeal to mathematical precision and Ehrman’s appeal to academic credentials.  Craig’s stunt is no more valid when he pulls it than it was when Dawkins or Luke do the same; “probability calculations” have all too often become a bizarre rhetorical flourish that is no more legitimate today than were similarly innumerate shenanigans when Charles Babbage decried them back in 1830.  Any economist can tell you that probability is problematic enough even when you have the relevant numbers, and appealing to it is fraudulent when you don’t – especially when you don’t because you\ncan’t\n!\nEhrman, however, is demonstrating nothing but a willfully closed mind and a blind faith in materialism.  We see observable evidence of what may or may not be the supernatural every day, from the mystery of human consciousness to people being confirmed dead by medical experts and then somehow returning to life.  The fact that we possess possible material explanations for these things and that this evidence presently falls short of being definitive does not make it nonexistent.  I readily admit that we may one day prove that consciousness is a purely material construct and that every single post-mortem resurrection was merely a mistaken observation on the declaring doctor’s part, but in the meantime, assuming those two things as fact is nothing but an act of pure and stubborn faith that cannot be justified by the material evidence available at the present.  This is a good example of how many atheist arguments rely upon appeals to logic even though they are presented under the color of science.\nMoreover, this ignores the mass of documentary evidence\nsupporting the existence\nof the supernatural.  While it is often possible to dismiss testimonial evidence with ex post facto diagnoses of “mental illness” and “hallucination”, there are no shortage of incidents that do not lend themselves to such interpretations, such as when individuals speak languages they do not know or possess information that they have no material means of possessing.  I have personally witnessed the latter, and while in that particular case I can concoct a very complicated and improbable (in the non-mathematical sense) scenario in order to rationalize it materially, it is not the sort of thing that anyone who is genuinely open-minded would be able to completely dismiss.\nAs for your observation that your fellow secular materialists have become increasingly vainglorious and narrow-minded, I believe it is because they have been misled into a false sense of security by a combination of Christian intellectual sloth and the increasing compartmentalization of Western society.  Intelligent, self-satisfied atheists with post-graduate degrees think those who believe in the supernatural are all poorly educated dimwits out to oppress others for the same reason that wealthy, suburban Christians with beautiful families think those who don’t believe in God are all miserable gay alcoholics out to commit suicide.  Their paths very seldom cross, their assumptions are often confirmed by the extreme examples that come to their attention, and on the rare occasion that the intelligent, highly-educated Christian or the happy, well-adjusted atheist finds himself in the territory of “the other”, he’s usually going to be inclined to keep his mouth shut about his beliefs in order to avoid unnecessarily rocking the boat.  This dynamic can be seen at work even on this blog, as with a few exceptions, the people known with certainty to be atheists tend to be the less intelligent, socially autistic variety, just as on campus the only identifiable Christians tend to be either the genuine saints or annoying evangelizing whackos.\nNor should the effect of Christian intellectual sloth be discounted.  Having long been the dominant belief-system, Christians all too readily drift off into internecine navel-gazing rather than intelligent engagement; even here I occasionally have to prevent people from starting an esoteric theological debate while in the middle of discussing the most basic concepts with non-believers who are unfamiliar with them.  I think part of what you are describing is a minor secular version of the same process at work in the university environment.  When Sam Harris makes a demonstrably stupid statement about the intrinsic inability of someone given to “magical thinking” to perform science, a statement which can be easily and conclusively proved to be utterly false, he is not questioned by his fellow secularists, let alone derided as he merits.  And even in your own case, your language betrays the bias of your assumptions.  There is no debate over whether a mythical resurrection is or isn’t possible because the question at hand is whether the impossible resurrection is a myth or not!  And remember how often academics have been historically prone to reach consensus on beliefs and ideologies later confirmed to have been completely false – see yesterday’s post on\nMises vs Mayers\nfor just one of many possible examples – so I suggest it would not be wise to place too much confidence in the present academic consensus regarding rational materialism.\nI explained my reasoning on the non-existence of scientific evidence for the supernatural in a 2002 column entitled\nSatan, Science, and the Supernatural\n.  Jesus taught that we cannot enter into the light until we first recognize and reject the darkness within us, so if you are going to find evidence for the supernatural in a fallen world, you must begin by searching for evil.  To paraphrase Nietzsche, if you stare into the abyss long enough, it will eventually meet your eyes. You may not be a Christian once you reach that point, but you will certainly no longer be a pure materialist either.  Nietzsche was speaking metaphorically, of course, but I believe his words are more literally true than he realized or intended at the time.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-27T10:00:00+00:00"
}