{
  "url": "https://voxday.net/2009/10/14/mailvox-new-find/",
  "scraped_at": "2026-01-08T23:09:25.312040",
  "title": "Mailvox: a new find",
  "date_display": "October 14, 2009",
  "date_iso": "2009-10-14T18:59:00+00:00",
  "date_from_url": "2009-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GT would like to know what I think about the fossil record in light of <a href=\"http://news.bbc.co.uk/2/hi/science/nature/8306060.stm\">this newly announced discovery</a>:</p><blockquote><p>Researchers in China and the UK say they have discovered the fossils of a new type of flying reptile that lived more than 160 million years ago. The find is named Darwinopterus, after famous naturalist Charles Darwin. Experts say it provides the first clear evidence of a controversial type of evolution called modular evolution.</p></blockquote><p>My first thought is that all new fossils should be named after St. Darwin of the Galapagos.  I want to see them all named Darwin Darwin Darwinus and anything less would be an insult to a particular agglomeration of atoms that coalesced for a few decades before dispersing more than a century ago.  I have to admit, I find the cult of the dead scientist to be tremendously amusing, especially given the way in which this particular dead scientist’s theory has done little more than ride the coattails of Mendel’s for sixty years.  But it keeps a number of socially awkward men happily occupied without bothering anyone, and as we know from Keynes, digging holes in the ground stimulates the economy, so it’s all good.</p><p>But in answer to the question, there are two ways of looking at this, that of the true believer and that of the skeptic.  The true believer, naturally, will point to the discovery and say: “look, one more gap filled!”  That’s a perfectly reasonable perspective, and indeed, it fits with the True Belief that given enough time, chance, and government funding, every gap in the fossil record could theoretically be filled.  Just do enough digging and eventually there won’t be any room for doubt.  At which point, presumably all the evolutionary biologists can go home and spend their days singing songs to St. Darwin since there won’t actually be any need for their so-called science once the bone collection is complete.</p><p>The skeptic, on the other hand, notes this interesting sentence in the middle of the piece: <i>“Researchers say that this could be evidence of what they call modular evolution – where natural selection forces a whole series of traits to change rapidly rather than just one.”</i> Given the difficulty evolutionists have had over the last 150 years in demonstrating the ability of natural selection to permanently change even a single trait, this is a significant alteration to the historical theory.  I’ve commented before on how a scientific theory in the process of failing requires adding increasingly contorted epicycles and “modular evolution”, like “punctuated equilibrium” sounds very much like one of those things.</p><p>Of course, in light of the recent news that paleontologists may not be able to tell baby dinosaurs from distinct species, perhaps the fact that the new discovery has a head and neck just like that of “advanced” pterosaurs, while the rest of the skeleton is identical to that of “primitive” forms indicates that we should assume these are simply three examples of the same species at different ages.</p></div>",
  "content_text": "GT would like to know what I think about the fossil record in light of\nthis newly announced discovery\n:\nResearchers in China and the UK say they have discovered the fossils of a new type of flying reptile that lived more than 160 million years ago. The find is named Darwinopterus, after famous naturalist Charles Darwin. Experts say it provides the first clear evidence of a controversial type of evolution called modular evolution.\nMy first thought is that all new fossils should be named after St. Darwin of the Galapagos.  I want to see them all named Darwin Darwin Darwinus and anything less would be an insult to a particular agglomeration of atoms that coalesced for a few decades before dispersing more than a century ago.  I have to admit, I find the cult of the dead scientist to be tremendously amusing, especially given the way in which this particular dead scientist’s theory has done little more than ride the coattails of Mendel’s for sixty years.  But it keeps a number of socially awkward men happily occupied without bothering anyone, and as we know from Keynes, digging holes in the ground stimulates the economy, so it’s all good.\nBut in answer to the question, there are two ways of looking at this, that of the true believer and that of the skeptic.  The true believer, naturally, will point to the discovery and say: “look, one more gap filled!”  That’s a perfectly reasonable perspective, and indeed, it fits with the True Belief that given enough time, chance, and government funding, every gap in the fossil record could theoretically be filled.  Just do enough digging and eventually there won’t be any room for doubt.  At which point, presumably all the evolutionary biologists can go home and spend their days singing songs to St. Darwin since there won’t actually be any need for their so-called science once the bone collection is complete.\nThe skeptic, on the other hand, notes this interesting sentence in the middle of the piece:\n“Researchers say that this could be evidence of what they call modular evolution – where natural selection forces a whole series of traits to change rapidly rather than just one.”\nGiven the difficulty evolutionists have had over the last 150 years in demonstrating the ability of natural selection to permanently change even a single trait, this is a significant alteration to the historical theory.  I’ve commented before on how a scientific theory in the process of failing requires adding increasingly contorted epicycles and “modular evolution”, like “punctuated equilibrium” sounds very much like one of those things.\nOf course, in light of the recent news that paleontologists may not be able to tell baby dinosaurs from distinct species, perhaps the fact that the new discovery has a head and neck just like that of “advanced” pterosaurs, while the rest of the skeleton is identical to that of “primitive” forms indicates that we should assume these are simply three examples of the same species at different ages.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-14T17:59:00+00:00"
}