{
  "url": "https://voxday.net/2009/10/06/mailvox-god-detests-you/",
  "scraped_at": "2026-01-08T23:08:46.033547",
  "title": "Mailvox: God detests you",
  "date_display": "October 6, 2009",
  "date_iso": "2009-10-06T11:58:00+00:00",
  "date_from_url": "2009-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whereas I merely hold you in intellectual contempt.  If I were a typical atheist whiner, I’d worry a lot more about the former than the latter.  Bob writes:</p><blockquote><p>I came here with the genuine wish to learn why people believe what they believe and find myself so terribly disappointed. Here is a blogger that instead of explaining himself prefers to sling insults at others. I do not understand his letters to the comprehensible Luke and so am branded unintelligent. I am not unintelligent. I put it to Mr Vox that an intelligent man would be able to explain himself in words that the average person can understand (and certainly me). I also put it to Mr Vox that it is his responsibility to explain himself in words that the average person can understand as he is a Christian and his words could very well save the idle reader. Alas instead he insults the idle reader who is now adding another name to the list of hateful Christians, increasing the size of the wedge between me and faith.</p></blockquote><p>Bob appears to have missed the point that the unintelligence is <i>relative</i>, not absolute.  And actually, Bob is learning quite a bit about the Bible, God’s attitude towards men like him, and the guidance it actually provides to Christians here.  I must also point out that Bob is not only a whiner, but a proven liar, as I have explained numerous things in great detail in my two letters to Luke as well as in the associated comments.  I deny that I have slung any insults that are not accurate and independently verifiable observations; a commenter may find it insulting when I point out that he has completely failed to understand something that is both logical and supported by the relevant documentation, but that does not change the observable fact that he failed to understand it.  Those who don’t like it when I describe them as lacking in relative intelligence would be wiser to demonstrate the superior intelligence they claim to possess rather than its opposite.</p><p>In <a href=\"http://www.milobookclub.com/2009/01/01/rules-of-blog_01/\">THE RULES OF THE BLOG</a> I make it very clear that I will respond in the manner I am addressed.  This includes passive-aggressiveness and snark, which will be treated in the same manner as more direct attacks. If you think any professional writer, let alone a Superintelligence, is incapable of detecting such faux-civility, let me assure you that you are delusional.  As I also point out in the rules it is wise to ask if your assumptions are correct before you elect to launch a critical attack based on those assumptions. I have been writing controversial opinion commentary on a very public site for eight years, so the chances are reasonably high that I saw and successfully dealt with your argument long before you first formulated your thoughts on the subject, particularly if they are related to a subject as old as Christianity.</p><p>Let me give an example from the comments yesterday.  Instead of simply asking the obvious question: “isn’t that a circular argument”, Silver Bullet first incorrectly asserts that my explanation for why I am a Christian involves circular reasoning.  Then, after I and others explain that he has improperly summarized my explanation and correctly inform him that there is no circular reasoning involved, he improperly summarizes it <i>again</i>, then assumes a condescending posture, claims that my dissertation is “ridiculous” and that my response to his criticism is “ignorant.”  At no time has he ever stopped to simply ask the obvious question: “why do you believe that your argument is not circular?”  He’s not the least bit interested in being informed, he’s simply an unintelligent, illogical ankle-biter who merits nothing better than a brutal and contemptuous slapdown.  It is very easy to demonstrate how he has been wrong about the logic of the explanation – note that it’s not even an argument – from the start.  Also note that he substitutes “Why do you believe in the Christian God” for “Why are you a Christian” throughout his comments, which is incorrect but irrelevant as I can show his illogic even using his own rephrasing.</p><p>1) Why do you believe in the Christian God?<br> <i>Why do you believe in the government.</i></br></p><p>2) Because I believe in the Christian definition of evil.<br> <i>Because I believe in the government’s definition of crime.</i></br></p><p>3) What is the Christian definition of evil?<br> <i>What is the government’s definition of crime?</i></br></p><p>4) That which is defined as evil in the Bible.<br> <i>That which is defined as crime in the statutes.</i></br></p><p>Now, Silver Bullet’s logic claims that because “violation of the government’s laws” and “that which is defined as crime in the statutes” are interchangeable in meaning, the argument is intrinsically circular.  He explains, as to an 8 year old, that a statute can’t confirm government-defined crime since government-defined crime is based on the statutes.  Now, this would be true if it weren’t for the obvious fact that <i>the actions which the government defines as crime can be confirmed to exist independently of the statutes.</i></p><p>Returning to the subject, it’s clear that Bob is more familiar with Sunday School theology than with the Bible, let alone any sophisticated Christian analyses.  Not only is it not my responsibility to explain anything to anyone who willfully refuses to seriously entertain reasonable answers to questions he has asked, it is actually my duty to help other Christians avoid the dishonest snares that this sort of deceiver often makes a habit of laying.  According to the Bible, God considers it righteous to detest the sort of dishonesty we see on a regular basis from a certain type of atheist.  He also detests the thoughts of the wicked, His curse is on them, He discards them like dross, and promises to destroy all of them even as He laughs at them.  One can even reasonably interpret His detestation of their sacrifices to indicate that He despises their <i>good</i> deeds.  This message of Divine detestation for a certain kind of individual is consistent throughout both the Old and New Testaments.</p><p>So, who are the wicked?  Those who detest the upright.  Those who suppress the truth.  Those who abuse those who correct them.  Those who say: “No one sees me… I am, and there is none besides me.” (Isaiah 47:10)</p><p>Now, please note that I am not describing atheists such as Luke here, at least not on the basis of the evidence of his two letters to date.  Ignorance and errors of logic are very different from dishonesty; anyone can be wrong but no one has to lie, misrepresent, or otherwise attempt to deceive.  There are indisputably a number of atheist regulars here who I have found to be honest, intelligent, and even in some cases genuinely truth-seeking.  They simply lack faith for a variety of reasons, some of them very understandable.  For example, who can truly blame Charles Darwin for the shattering of his Christian faith after the death of his beloved daughter?  After all, few have the fortitude of Job; every Christian should pray that his faith is never put to such a terrible test.</p><p>It’s worth noting that even the Bible distinguishes between godlessness and wickedness, although the two often coincide.  But isn’t it amazing that a text more than two thousand years old can so perfectly describe the behavior of certain individuals today?</p><p><i>A fool’s lips bring him strife,<br> and his mouth invites a beating.</br></i><br> – Proverbs 18:6</br></p><p><i>Finally, brothers, pray for us that the message of the Lord may spread rapidly and be honored, just as it was with you. And pray that we may be delivered from wicked and evil men, for not everyone has faith.</i><br> – 2nd Thessalonians 3:1-2</br></p><p><i>They have become filled with every kind of wickedness, evil, greed and depravity. They are full of envy, murder, strife, deceit and malice. They are gossips, slanderers, God-haters, insolent, arrogant and boastful; they invent ways of doing evil; they disobey their parents;</i><br> – Romans 1:29-30</br></p><p>Fortunately, wickedness is a choice, as is repentance.  And every mocker, every fool, every dishonest, godless, would-be critic here knows that they have consciously made that choice, even if they will never admit it to anyone.  No doubt it would tear at the heart of a better man than me that some so firmly prefer wickedness to wisdom and deception to truth, but I have to confess that their self-destructive choice does not trouble me in the slightest.</p></div>",
  "content_text": "Whereas I merely hold you in intellectual contempt.  If I were a typical atheist whiner, I’d worry a lot more about the former than the latter.  Bob writes:\nI came here with the genuine wish to learn why people believe what they believe and find myself so terribly disappointed. Here is a blogger that instead of explaining himself prefers to sling insults at others. I do not understand his letters to the comprehensible Luke and so am branded unintelligent. I am not unintelligent. I put it to Mr Vox that an intelligent man would be able to explain himself in words that the average person can understand (and certainly me). I also put it to Mr Vox that it is his responsibility to explain himself in words that the average person can understand as he is a Christian and his words could very well save the idle reader. Alas instead he insults the idle reader who is now adding another name to the list of hateful Christians, increasing the size of the wedge between me and faith.\nBob appears to have missed the point that the unintelligence is\nrelative\n, not absolute.  And actually, Bob is learning quite a bit about the Bible, God’s attitude towards men like him, and the guidance it actually provides to Christians here.  I must also point out that Bob is not only a whiner, but a proven liar, as I have explained numerous things in great detail in my two letters to Luke as well as in the associated comments.  I deny that I have slung any insults that are not accurate and independently verifiable observations; a commenter may find it insulting when I point out that he has completely failed to understand something that is both logical and supported by the relevant documentation, but that does not change the observable fact that he failed to understand it.  Those who don’t like it when I describe them as lacking in relative intelligence would be wiser to demonstrate the superior intelligence they claim to possess rather than its opposite.\nIn\nTHE RULES OF THE BLOG\nI make it very clear that I will respond in the manner I am addressed.  This includes passive-aggressiveness and snark, which will be treated in the same manner as more direct attacks. If you think any professional writer, let alone a Superintelligence, is incapable of detecting such faux-civility, let me assure you that you are delusional.  As I also point out in the rules it is wise to ask if your assumptions are correct before you elect to launch a critical attack based on those assumptions. I have been writing controversial opinion commentary on a very public site for eight years, so the chances are reasonably high that I saw and successfully dealt with your argument long before you first formulated your thoughts on the subject, particularly if they are related to a subject as old as Christianity.\nLet me give an example from the comments yesterday.  Instead of simply asking the obvious question: “isn’t that a circular argument”, Silver Bullet first incorrectly asserts that my explanation for why I am a Christian involves circular reasoning.  Then, after I and others explain that he has improperly summarized my explanation and correctly inform him that there is no circular reasoning involved, he improperly summarizes it\nagain\n, then assumes a condescending posture, claims that my dissertation is “ridiculous” and that my response to his criticism is “ignorant.”  At no time has he ever stopped to simply ask the obvious question: “why do you believe that your argument is not circular?”  He’s not the least bit interested in being informed, he’s simply an unintelligent, illogical ankle-biter who merits nothing better than a brutal and contemptuous slapdown.  It is very easy to demonstrate how he has been wrong about the logic of the explanation – note that it’s not even an argument – from the start.  Also note that he substitutes “Why do you believe in the Christian God” for “Why are you a Christian” throughout his comments, which is incorrect but irrelevant as I can show his illogic even using his own rephrasing.\n1) Why do you believe in the Christian God?\nWhy do you believe in the government.\n2) Because I believe in the Christian definition of evil.\nBecause I believe in the government’s definition of crime.\n3) What is the Christian definition of evil?\nWhat is the government’s definition of crime?\n4) That which is defined as evil in the Bible.\nThat which is defined as crime in the statutes.\nNow, Silver Bullet’s logic claims that because “violation of the government’s laws” and “that which is defined as crime in the statutes” are interchangeable in meaning, the argument is intrinsically circular.  He explains, as to an 8 year old, that a statute can’t confirm government-defined crime since government-defined crime is based on the statutes.  Now, this would be true if it weren’t for the obvious fact that\nthe actions which the government defines as crime can be confirmed to exist independently of the statutes.\nReturning to the subject, it’s clear that Bob is more familiar with Sunday School theology than with the Bible, let alone any sophisticated Christian analyses.  Not only is it not my responsibility to explain anything to anyone who willfully refuses to seriously entertain reasonable answers to questions he has asked, it is actually my duty to help other Christians avoid the dishonest snares that this sort of deceiver often makes a habit of laying.  According to the Bible, God considers it righteous to detest the sort of dishonesty we see on a regular basis from a certain type of atheist.  He also detests the thoughts of the wicked, His curse is on them, He discards them like dross, and promises to destroy all of them even as He laughs at them.  One can even reasonably interpret His detestation of their sacrifices to indicate that He despises their\ngood\ndeeds.  This message of Divine detestation for a certain kind of individual is consistent throughout both the Old and New Testaments.\nSo, who are the wicked?  Those who detest the upright.  Those who suppress the truth.  Those who abuse those who correct them.  Those who say: “No one sees me… I am, and there is none besides me.” (Isaiah 47:10)\nNow, please note that I am not describing atheists such as Luke here, at least not on the basis of the evidence of his two letters to date.  Ignorance and errors of logic are very different from dishonesty; anyone can be wrong but no one has to lie, misrepresent, or otherwise attempt to deceive.  There are indisputably a number of atheist regulars here who I have found to be honest, intelligent, and even in some cases genuinely truth-seeking.  They simply lack faith for a variety of reasons, some of them very understandable.  For example, who can truly blame Charles Darwin for the shattering of his Christian faith after the death of his beloved daughter?  After all, few have the fortitude of Job; every Christian should pray that his faith is never put to such a terrible test.\nIt’s worth noting that even the Bible distinguishes between godlessness and wickedness, although the two often coincide.  But isn’t it amazing that a text more than two thousand years old can so perfectly describe the behavior of certain individuals today?\nA fool’s lips bring him strife,\nand his mouth invites a beating.\n– Proverbs 18:6\nFinally, brothers, pray for us that the message of the Lord may spread rapidly and be honored, just as it was with you. And pray that we may be delivered from wicked and evil men, for not everyone has faith.\n– 2nd Thessalonians 3:1-2\nThey have become filled with every kind of wickedness, evil, greed and depravity. They are full of envy, murder, strife, deceit and malice. They are gossips, slanderers, God-haters, insolent, arrogant and boastful; they invent ways of doing evil; they disobey their parents;\n– Romans 1:29-30\nFortunately, wickedness is a choice, as is repentance.  And every mocker, every fool, every dishonest, godless, would-be critic here knows that they have consciously made that choice, even if they will never admit it to anyone.  No doubt it would tear at the heart of a better man than me that some so firmly prefer wickedness to wisdom and deception to truth, but I have to confess that their self-destructive choice does not trouble me in the slightest.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-06T10:58:00+00:00"
}