{
  "url": "https://voxday.net/2009/10/16/major-mortgage-fraud/",
  "scraped_at": "2026-01-08T23:09:32.608599",
  "title": "Mortgage and foreclosure fraud",
  "date_display": "October 16, 2009",
  "date_iso": "2009-10-16T12:44:00+00:00",
  "date_from_url": "2009-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Socionomics teaches that the end of a fifth wave, especially in a major bubble, is rife with fraud, forgery, and other financial shenanigans.  One of the major ones that is still percolating is the massive amount of mortgage fraud that was committed by banks and other financial institutions in mass-producing home loans for securitization purposes.  It increasingly appears that a statistically significant portion of the foreclosures in process <a href=\"http://www.scribd.com/doc/20916919/Foreclosure-Fraud-Guide-to-Looking-up-Public-Records-for-Fraud\">are being pursued on a fraudulent basis</a> by entities which do not actually hold the rights to the mortgage.</p><blockquote><p>Helpful Guide For All States on how to research your recorded documents at county recorder and determine if there are forgeries or fraud when facing foreclosure….  More and more evidence in coming forth which indicates some of the notorious predatory lenders took shortcuts and did illegal document recordings and some with forgeries.</p></blockquote><p>I’d heard rumors of some shady practices at the mortgage banks as long as seven years ago, but now it appears that documented evidence of them is coming to light.  If you took out a loan any time in the last five to seven years, it’s probably worth checking out the public records to find out if your lender was one of the fraudulent ones or not.  Of course, this may also explain why some banks have been so uncharacteristically slow about following through on pursuing homeowners in default; they may know they don’t actually have the right to foreclose on them.</p><p>As usual, it’s Karl Denninger <a href=\"http://market-ticker.denninger.net/archives/1513-A-Birdie-On-Possible-Foreclosure-Frauds.html\">who posted this first</a>, as he is increasingly focused on the incredible amount of <a href=\"http://market-ticker.denninger.net/archives/1512-The-MERShole-Yawns-Wide.html\">illegal activity taking place</a> in the financial and federal sectors over the last year.  On a tangential note, the U.S. deleveraging process appears to be continuing, as total loans and leases at commercial banks declined $146 billion in September.  TOTLL is now down 6.8 percent YTD and 8.2 percent since the October 2008 peak of $7.32 trillion.  This is not indicative of economic expansion, especially considering that this decline has taken place despite the Federal incentives encouraging people to take on new automotive and housing debt.</p></div>",
  "content_text": "Socionomics teaches that the end of a fifth wave, especially in a major bubble, is rife with fraud, forgery, and other financial shenanigans.  One of the major ones that is still percolating is the massive amount of mortgage fraud that was committed by banks and other financial institutions in mass-producing home loans for securitization purposes.  It increasingly appears that a statistically significant portion of the foreclosures in process\nare being pursued on a fraudulent basis\nby entities which do not actually hold the rights to the mortgage.\nHelpful Guide For All States on how to research your recorded documents at county recorder and determine if there are forgeries or fraud when facing foreclosure….  More and more evidence in coming forth which indicates some of the notorious predatory lenders took shortcuts and did illegal document recordings and some with forgeries.\nI’d heard rumors of some shady practices at the mortgage banks as long as seven years ago, but now it appears that documented evidence of them is coming to light.  If you took out a loan any time in the last five to seven years, it’s probably worth checking out the public records to find out if your lender was one of the fraudulent ones or not.  Of course, this may also explain why some banks have been so uncharacteristically slow about following through on pursuing homeowners in default; they may know they don’t actually have the right to foreclose on them.\nAs usual, it’s Karl Denninger\nwho posted this first\n, as he is increasingly focused on the incredible amount of\nillegal activity taking place\nin the financial and federal sectors over the last year.  On a tangential note, the U.S. deleveraging process appears to be continuing, as total loans and leases at commercial banks declined $146 billion in September.  TOTLL is now down 6.8 percent YTD and 8.2 percent since the October 2008 peak of $7.32 trillion.  This is not indicative of economic expansion, especially considering that this decline has taken place despite the Federal incentives encouraging people to take on new automotive and housing debt.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-16T11:44:00+00:00"
}