{
  "url": "https://voxday.net/2009/10/22/minor-but-legitimate-intervention/",
  "scraped_at": "2026-01-08T23:10:09.289611",
  "title": "A minor, but legitimate intervention",
  "date_display": "October 22, 2009",
  "date_iso": "2009-10-22T11:19:00+00:00",
  "date_from_url": "2009-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, far more of <a href=\"http://finance.yahoo.com/news/US-plans-big-pay-cuts-at-apf-22499205.html?x=0\">this sort of thing</a> is in order:</p><blockquote><p>The Obama administration plans to order companies that received huge U.S. government bailouts last year to sharply cut the compensation of their highest paid executives, according to a person familiar with the decision. The seven companies that received the most assistance will have to cut the annual salaries of their 25 highest-paid executive by an average of about 90 percent from last year, said the person, who spoke on condition of anonymity because it has not been announced.  This person said Wednesday that the Treasury Department will announce the deep pay cuts within the next few days.</p></blockquote><p>Look very closely at any commentator, so-called conservative or otherwise, who complains about this action by the White House being somehow “anti-capitalist”.  If he was also a supporter of the bailouts last November, you should never, ever, consider taking him seriously again, because he’s either an untrustoworthy hypocrite or he’s too dumb to even realize his inconsistency.  Once the government stepped in to socialize a corporation’s losses, that corporation lost the right to privatize its profits or even manage itself independently.  From an economic perspective, the only thing more disastrous than a pure socialist system where both profits and losses are public is a fascist system where profits are private and losses are public.</p><p>No doubt this is merely a token act meant to discharge the growing public fury with Goldman and the other giant <s>vampire squids</s>financial institutions.  If Obama was serious, he’d announce a retroactive 95 percent tax on all bonuses paid in 2008 or later at institutions that received government assistance since August 2008 and accept Paul Volcker’s advice to beginning breaking up the big banks.  Of course, what he should actually do is force the banks to mark the values of their assets to market, <a href=\"http://market-ticker.denninger.net/archives/1518-FDIC-Bankrupt-Uh-Huh-Again.html\">obey the law and have the FDIC initiate Prompt Corrective Actions</a> as they are legally bound to do, and shut down every big bank that is insolvent.  But he’s neither smart enough to understand the need to do this nor courageous enough to do so in the face of opposition from the influential <s>vampire squids</s>financial institutions.  And so the debt spiral continues….</p></div>",
  "content_text": "Actually, far more of\nthis sort of thing\nis in order:\nThe Obama administration plans to order companies that received huge U.S. government bailouts last year to sharply cut the compensation of their highest paid executives, according to a person familiar with the decision. The seven companies that received the most assistance will have to cut the annual salaries of their 25 highest-paid executive by an average of about 90 percent from last year, said the person, who spoke on condition of anonymity because it has not been announced.  This person said Wednesday that the Treasury Department will announce the deep pay cuts within the next few days.\nLook very closely at any commentator, so-called conservative or otherwise, who complains about this action by the White House being somehow “anti-capitalist”.  If he was also a supporter of the bailouts last November, you should never, ever, consider taking him seriously again, because he’s either an untrustoworthy hypocrite or he’s too dumb to even realize his inconsistency.  Once the government stepped in to socialize a corporation’s losses, that corporation lost the right to privatize its profits or even manage itself independently.  From an economic perspective, the only thing more disastrous than a pure socialist system where both profits and losses are public is a fascist system where profits are private and losses are public.\nNo doubt this is merely a token act meant to discharge the growing public fury with Goldman and the other giant\nvampire squids\nfinancial institutions.  If Obama was serious, he’d announce a retroactive 95 percent tax on all bonuses paid in 2008 or later at institutions that received government assistance since August 2008 and accept Paul Volcker’s advice to beginning breaking up the big banks.  Of course, what he should actually do is force the banks to mark the values of their assets to market,\nobey the law and have the FDIC initiate Prompt Corrective Actions\nas they are legally bound to do, and shut down every big bank that is insolvent.  But he’s neither smart enough to understand the need to do this nor courageous enough to do so in the face of opposition from the influential\nvampire squids\nfinancial institutions.  And so the debt spiral continues….",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-22T10:19:00+00:00"
}