{
  "url": "https://voxday.net/2009/10/14/nfl-ownership-follies/",
  "scraped_at": "2026-01-08T23:09:23.493554",
  "title": "NFL ownership follies",
  "date_display": "October 14, 2009",
  "date_iso": "2009-10-14T15:15:00+00:00",
  "date_from_url": "2009-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget NBC, Mike Florio appears to be ready for his cameo on MSNBC.  Here he attempts to float the idea that <a href=\"http://profootballtalk.nbcsports.com/2009/10/14/limbaughs-politics-are-in-line-with-most-nfl-owners/\">Limbaugh scrubbed his transcripts</a>:</p><blockquote><p>And regardless of the debate over whether Limbaugh did or didn’t say things that have been attributed to him but that, as Limbaugh claims, don’t show up in the Limbaugh-generated tapes and transcripts of his show (in this regard, most lawyers know of at least one judges who is very adept at ensuring the official record of in-court statements never includes potentially embarrasing or controversial commens from the man or woman in black), it’s not what he has said in the past that should scare the owners — it’s what he might say in the future.</p></blockquote><p>Right, one of the most popular broadcasters in the world somehow managed to eliminate every recording in which he uttered inflammatory words.  This is ludicrous.</p><p>The entire episode has been interesting in that it highlights the difference between the toadying sort of individuals whose success stems from successfully crawling their way up the employee ladder versus entrepeneurs who actually create their own success.  It’s no surprise that the doorknob chosen by the NFL players would flap his lips on a subject that is none of his business, but Roger Goodell, who is showing more and more signs of being a terrible NFL commissioner, should have known better than to even think about commenting on the prospective ownership of any NFL franchise.</p><p>When one considers that the Dolphins are giving away small ownership slices to former methheads in the name of diversity, it’s absurd to that one of America’s most successful businessmen should be preemptively shot down on the off chance that he is foolish enough to invest in what is nothing but a vanity investment in the first place.  If the economy goes the way I expect it to, in the not-too-distant future the same people who are presently pontificating on why Limbaugh shouldn’t be <i>permitted</i> to buy an NFL team will be desperately seeking bids from Russian gangsters and Colombian drug lords like the NBA is already doing.</p><p>It was amusing to see Peter King lumbering about in attempting to dance around the NFL’s affiliation with Keith Olbermann, who is far more extreme and far less popular than Rush Limbaugh.  With classic left-liberal illogic, he declares that it’s just fine for a league-employed commentator to be a political flamethrower who offends millions, but that the league would be damaged if he were to be an owner.  This makes no sense, since the league-employed commentator is much more in the face of the public he is offending, but then, that’s par for King’s analytical abilities.</p><p>My attitude is that turnabout is fair play.  If the Left can do play business thought police, so can the Right, and I’d love to see those owners, whose politics are far more similar to Limbaugh’s than Olbermann’s, take Goodell and every other league employee who was dumb enough to advocate thought-policing to task.</p></div>",
  "content_text": "Forget NBC, Mike Florio appears to be ready for his cameo on MSNBC.  Here he attempts to float the idea that\nLimbaugh scrubbed his transcripts\n:\nAnd regardless of the debate over whether Limbaugh did or didn’t say things that have been attributed to him but that, as Limbaugh claims, don’t show up in the Limbaugh-generated tapes and transcripts of his show (in this regard, most lawyers know of at least one judges who is very adept at ensuring the official record of in-court statements never includes potentially embarrasing or controversial commens from the man or woman in black), it’s not what he has said in the past that should scare the owners — it’s what he might say in the future.\nRight, one of the most popular broadcasters in the world somehow managed to eliminate every recording in which he uttered inflammatory words.  This is ludicrous.\nThe entire episode has been interesting in that it highlights the difference between the toadying sort of individuals whose success stems from successfully crawling their way up the employee ladder versus entrepeneurs who actually create their own success.  It’s no surprise that the doorknob chosen by the NFL players would flap his lips on a subject that is none of his business, but Roger Goodell, who is showing more and more signs of being a terrible NFL commissioner, should have known better than to even think about commenting on the prospective ownership of any NFL franchise.\nWhen one considers that the Dolphins are giving away small ownership slices to former methheads in the name of diversity, it’s absurd to that one of America’s most successful businessmen should be preemptively shot down on the off chance that he is foolish enough to invest in what is nothing but a vanity investment in the first place.  If the economy goes the way I expect it to, in the not-too-distant future the same people who are presently pontificating on why Limbaugh shouldn’t be\npermitted\nto buy an NFL team will be desperately seeking bids from Russian gangsters and Colombian drug lords like the NBA is already doing.\nIt was amusing to see Peter King lumbering about in attempting to dance around the NFL’s affiliation with Keith Olbermann, who is far more extreme and far less popular than Rush Limbaugh.  With classic left-liberal illogic, he declares that it’s just fine for a league-employed commentator to be a political flamethrower who offends millions, but that the league would be damaged if he were to be an owner.  This makes no sense, since the league-employed commentator is much more in the face of the public he is offending, but then, that’s par for King’s analytical abilities.\nMy attitude is that turnabout is fair play.  If the Left can do play business thought police, so can the Right, and I’d love to see those owners, whose politics are far more similar to Limbaugh’s than Olbermann’s, take Goodell and every other league employee who was dumb enough to advocate thought-policing to task.",
  "tags": [
    "politics",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-14T14:15:00+00:00"
}