{
  "url": "https://voxday.net/2009/10/01/not-best-star/",
  "scraped_at": "2026-01-08T23:08:16.525669",
  "title": "Not the best start",
  "date_display": "October 1, 2009",
  "date_iso": "2009-10-01T14:30:00+00:00",
  "date_from_url": "2009-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gene Quinn, a defender of patent law and IP, <a href=\"http://www.ipwatchdog.com/2009/09/30/responding-to-critics-my-view-on-patents-innovation/id=6421/#comment-8389\">lays down an impressive challenge</a>:</p><blockquote><p>I challenge anyone to a debate on this topic anywhere, at any time, to be moderated by a mutually agreed panel or moderator. I know as well as everyone here that I will never be taken up on that offer. I wonder why? If I am so stupid and irresponsible and ignorant then someone take me up and prove to the world I am as such. Of course there will be no takers because in a true debate none of the nay-sayers stand any chance and would be exposed for what they truly are. Nevertheless, the challenge is made. I am sure the silence will be deafening. Or wait, even better… the response will be “there is no point in debating you because you are .” We all know that is what they are going to say, and rational people will understand that to be nothing more than cowardice.</p></blockquote><p>Really?  In order to disabuse Mr. Quinn of his belief in the cowardice of IP opponents, I sent him an email inviting him to a debate on the matter in Europe next spring.  It will be interesting to see if he genuinely meant what he wrote or if it was mere rhetorical bluster.  Being the holder of some IP myself, I’m far from a militant on the issue and am quite willing to be convinced if Mr. Quinn can present a compelling case, but at present I am deeply, deeply skeptical of the economic benefit of intellectual property protections by government.</p><p>Stephen Kinsella of the Mises Institute also <a href=\"http://blog.mises.org/archives/010746.asp\">didn’t hesitate to dispel Mr. Quinn’s doubts</a> about the willingness of IP skeptics to take him on.  Kinsella is far more versed on the subject than I am, but since I have more actual experience creating IP than he does, I expect our approaches would vary greatly.</p><p>UPDATE – The gentleman is well up for the challenge.  We’ve exchanged email and if we can manage to coordinate things next spring in the venue I have in mind, will debate the issue then.  I’ll be sure to arrange that either a transcript or a video will be made available.</p></div>",
  "content_text": "Gene Quinn, a defender of patent law and IP,\nlays down an impressive challenge\n:\nI challenge anyone to a debate on this topic anywhere, at any time, to be moderated by a mutually agreed panel or moderator. I know as well as everyone here that I will never be taken up on that offer. I wonder why? If I am so stupid and irresponsible and ignorant then someone take me up and prove to the world I am as such. Of course there will be no takers because in a true debate none of the nay-sayers stand any chance and would be exposed for what they truly are. Nevertheless, the challenge is made. I am sure the silence will be deafening. Or wait, even better… the response will be “there is no point in debating you because you are .” We all know that is what they are going to say, and rational people will understand that to be nothing more than cowardice.\nReally?  In order to disabuse Mr. Quinn of his belief in the cowardice of IP opponents, I sent him an email inviting him to a debate on the matter in Europe next spring.  It will be interesting to see if he genuinely meant what he wrote or if it was mere rhetorical bluster.  Being the holder of some IP myself, I’m far from a militant on the issue and am quite willing to be convinced if Mr. Quinn can present a compelling case, but at present I am deeply, deeply skeptical of the economic benefit of intellectual property protections by government.\nStephen Kinsella of the Mises Institute also\ndidn’t hesitate to dispel Mr. Quinn’s doubts\nabout the willingness of IP skeptics to take him on.  Kinsella is far more versed on the subject than I am, but since I have more actual experience creating IP than he does, I expect our approaches would vary greatly.\nUPDATE – The gentleman is well up for the challenge.  We’ve exchanged email and if we can manage to coordinate things next spring in the venue I have in mind, will debate the issue then.  I’ll be sure to arrange that either a transcript or a video will be made available.",
  "tags": [
    "IP"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-01T13:30:00+00:00"
}