{
  "url": "https://voxday.net/2009/10/16/occams-razor-is-correct-here/",
  "scraped_at": "2026-01-08T23:09:36.276399",
  "title": "Occam’s Razor is correct here",
  "date_display": "October 16, 2009",
  "date_iso": "2009-10-16T19:30:00+00:00",
  "date_from_url": "2009-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The reason <a href=\"http://harpers.org/archive/2009/10/hbc-90005911\">Obama hasn’t looked that smart</a> since taking office is because he isn’t:</p><blockquote><p>Are you tired of hearing how “smart” Barack Obama is? I reached my limit over the summer, when The New York Times Magazine quoted Valerie Jarrett, the president’s liaison to Chicago City Hall, declaring, “I mean, he’s really by far smarter than anybody I know.”</p><p>Well, as any Chicago schoolboy knows, there are many different kinds of smart. And right now our commander-in-chief is not looking particularly brilliant— at least on the level of substantive politics.</p></blockquote><p>As I said before the election, Obama is far from the genius he is often portrayed as being.  There is an absolute ceiling on his IQ of 130, based on his attendance at a high school where students took the PSAT and his failure to achieve any National Merit recognition.  I estimate his IQ <a href=\"http://www.milobookclub.com/2008/09/18/barack-obamas-iq-is-116_18/\">to be around 116</a>, which is one standard deviation above average, but two standard deviations short of the level loosely described as a genius-level intelligence.  (I don’t agree with that definition, by the way; I think genius is far more rare than +3 SD IQs and I think IQ is only one component of genius.)</p><p>Intelligence is overrated anyhow.  It’s an important factor in accomplishment, but it is by no means the most important one.  Focus, determination, connections, and ambition are all more important components of achievement and it’s interesting to contemplate where Obama is probably most gifted considering his relative lack of intelligence.</p></div>",
  "content_text": "The reason\nObama hasn’t looked that smart\nsince taking office is because he isn’t:\nAre you tired of hearing how “smart” Barack Obama is? I reached my limit over the summer, when The New York Times Magazine quoted Valerie Jarrett, the president’s liaison to Chicago City Hall, declaring, “I mean, he’s really by far smarter than anybody I know.”\nWell, as any Chicago schoolboy knows, there are many different kinds of smart. And right now our commander-in-chief is not looking particularly brilliant— at least on the level of substantive politics.\nAs I said before the election, Obama is far from the genius he is often portrayed as being.  There is an absolute ceiling on his IQ of 130, based on his attendance at a high school where students took the PSAT and his failure to achieve any National Merit recognition.  I estimate his IQ\nto be around 116\n, which is one standard deviation above average, but two standard deviations short of the level loosely described as a genius-level intelligence.  (I don’t agree with that definition, by the way; I think genius is far more rare than +3 SD IQs and I think IQ is only one component of genius.)\nIntelligence is overrated anyhow.  It’s an important factor in accomplishment, but it is by no means the most important one.  Focus, determination, connections, and ambition are all more important components of achievement and it’s interesting to contemplate where Obama is probably most gifted considering his relative lack of intelligence.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-16T18:30:00+00:00"
}