{
  "url": "https://voxday.net/2009/10/21/of-might-and-rig/",
  "scraped_at": "2026-01-08T23:10:03.842116",
  "title": "Of might and right",
  "date_display": "October 21, 2009",
  "date_iso": "2009-10-21T14:15:00+00:00",
  "date_from_url": "2009-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the tangential topics that has come up in relation to yesterday’s discussion of <a href=\"http://www.milobookclub.com/2009/10/20/you-dont-know-euthyphro/\">the mistitled and oft-misapplied Euthyphro Dilemma</a> is the question of whether the concept “God’s Game, God’s Rules” is equivalent to declaring that “might makes right”.  Setting aside the obvious and unproven assumption that might inherently does not make right, I think it is quite easy to demonstrate that the authority of the Creator God to establish a code of rules that make up human morality does not derive from His might, however great that might be, but rather from His act of creation.</p><p>Consider, for example, the National Football League.  The NFL organization owns and creates the rules of the game, by which the players on the field are expected to abide.  Now, the NFL certainly possesses greater might than any one player and arguably even more than all the players combined.  But, the NFL is significantly less mighty than, just to pick one example, the People’s Liberation Army.  Now, no one disputes the right of the NFL to change the rules so that the penalty for offsides is fifteen yards instead of five, even if we think the change is a ridiculous one.  But is this right determined by the NFL’s might?  I don’t think so.</p><p>Why not?  Because if the right to determine the rules was simply a matter of might, then it would be entirely proper for the PLA, which already owns vast quantities of corporations around the world, to land a division in Manhattan, forcibly seize the NFL offices and unilaterally declare a change to the offsides penalty.  There would be no rational justification for complaining about this action, except of course for the same objections to the desirability of the rule change that would have applied in the previous scenario.  So, unless you are willing to accede to the right of the PLA to change the NFL rules on the basis of its might, it is obvious that there must be a significant distinction between creative ownership making right and might making right, even if might is a necessary component of the original creation.</p><p>I also think it is relevant to point out that one cannot reasonably subject the NFL to its own rules.  I am certainly unaware of any sitting commissioner ever being penalized for holding or pass interference.</p></div>",
  "content_text": "One of the tangential topics that has come up in relation to yesterday’s discussion of\nthe mistitled and oft-misapplied Euthyphro Dilemma\nis the question of whether the concept “God’s Game, God’s Rules” is equivalent to declaring that “might makes right”.  Setting aside the obvious and unproven assumption that might inherently does not make right, I think it is quite easy to demonstrate that the authority of the Creator God to establish a code of rules that make up human morality does not derive from His might, however great that might be, but rather from His act of creation.\nConsider, for example, the National Football League.  The NFL organization owns and creates the rules of the game, by which the players on the field are expected to abide.  Now, the NFL certainly possesses greater might than any one player and arguably even more than all the players combined.  But, the NFL is significantly less mighty than, just to pick one example, the People’s Liberation Army.  Now, no one disputes the right of the NFL to change the rules so that the penalty for offsides is fifteen yards instead of five, even if we think the change is a ridiculous one.  But is this right determined by the NFL’s might?  I don’t think so.\nWhy not?  Because if the right to determine the rules was simply a matter of might, then it would be entirely proper for the PLA, which already owns vast quantities of corporations around the world, to land a division in Manhattan, forcibly seize the NFL offices and unilaterally declare a change to the offsides penalty.  There would be no rational justification for complaining about this action, except of course for the same objections to the desirability of the rule change that would have applied in the previous scenario.  So, unless you are willing to accede to the right of the PLA to change the NFL rules on the basis of its might, it is obvious that there must be a significant distinction between creative ownership making right and might making right, even if might is a necessary component of the original creation.\nI also think it is relevant to point out that one cannot reasonably subject the NFL to its own rules.  I am certainly unaware of any sitting commissioner ever being penalized for holding or pass interference.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-21T13:15:00+00:00"
}