{
  "url": "https://voxday.net/2009/10/09/peace-on-ear/",
  "scraped_at": "2026-01-08T23:09:05.164178",
  "title": "Too freaking funny",
  "date_display": "October 9, 2009",
  "date_iso": "2009-10-09T15:12:00+00:00",
  "date_from_url": "2009-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What on Earth <a href=\"http://www.reuters.com/article/topNews/idUSTRE5981JK20091009?sp=true\">can the Nobel committee possibly be thinking</a>?  The man hasn’t even closed Guantanamo Bay or ended either of the two military occupations he promised to end!</p><blockquote><p>OSLO/WASHINGTON (Reuters) – U.S. President Barack Obama won the Nobel Peace Prize on Friday for offering the world hope and striving for nuclear disarmament in a surprise award that drew both warm praise and sharp criticism. The bestowal of one of the world’s top accolades on a president less than nine months in office, who has yet to score a major foreign policy success, was greeted with gasps of astonishment from journalists at the announcement in Oslo.</p></blockquote><p>As I said, this administration is seriously outperforming its comedic potential.  I wonder what their rationale for it will be… for excellence in presidenting while black?  First Arafat, then Krugman, now Obama.  At this rate, it won’t be long before they’ll be giving out Nobel Prizes en masse to minority kids who manage to graduate from public high school.</p><p>But at least this teaches us one thing.  As Parrothead Al suggested, JaMarcus Russell has got to be a shoe-in for NFL MVP now.  And it may even lay the foundation for a unique opportunity in political governance!  If the Eurofascists manage to finish ramming the <s>European Constitution</s>Lisbon Treaty down the throats of the Europeans who didn’t vote for it sometime in the next three years, the European Commission could then select Obama to be the President of the European Union as well as the United States.</p></div>",
  "content_text": "What on Earth\ncan the Nobel committee possibly be thinking\n?  The man hasn’t even closed Guantanamo Bay or ended either of the two military occupations he promised to end!\nOSLO/WASHINGTON (Reuters) – U.S. President Barack Obama won the Nobel Peace Prize on Friday for offering the world hope and striving for nuclear disarmament in a surprise award that drew both warm praise and sharp criticism. The bestowal of one of the world’s top accolades on a president less than nine months in office, who has yet to score a major foreign policy success, was greeted with gasps of astonishment from journalists at the announcement in Oslo.\nAs I said, this administration is seriously outperforming its comedic potential.  I wonder what their rationale for it will be… for excellence in presidenting while black?  First Arafat, then Krugman, now Obama.  At this rate, it won’t be long before they’ll be giving out Nobel Prizes en masse to minority kids who manage to graduate from public high school.\nBut at least this teaches us one thing.  As Parrothead Al suggested, JaMarcus Russell has got to be a shoe-in for NFL MVP now.  And it may even lay the foundation for a unique opportunity in political governance!  If the Eurofascists manage to finish ramming the\nEuropean Constitution\nLisbon Treaty down the throats of the Europeans who didn’t vote for it sometime in the next three years, the European Commission could then select Obama to be the President of the European Union as well as the United States.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-09T14:12:00+00:00"
}