{
  "url": "https://voxday.net/2009/10/18/practice-makes-perfec/",
  "scraped_at": "2026-01-08T23:09:43.615003",
  "title": "Practice makes perfect",
  "date_display": "October 18, 2009",
  "date_iso": "2009-10-18T15:12:00+00:00",
  "date_from_url": "2009-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Before they go on to lose wars in Afghanistan and Pakistan, Obama figures his administration could use some practice <a href=\"http://www.nytimes.com/2009/10/18/weekinreview/18davidcarr.html?_r=2\">losing one on the home front</a>:</p><blockquote><p>“We’re going to treat them the way we would treat an opponent,” Anita Dunn, the White House communications director, said in an interview with The New York Times. “As they are undertaking a war against Barack Obama and the White House, we don’t need to pretend that this is the way that legitimate news organizations behave.”</p><p>Ah, but pretending has traditionally been a valuable part of the presidential playbook. Smiling and wearing beige even under the most withering news media assault is not only good manners, but also has generally been good politics. While there is undoubtedly a visceral thrill in finally setting out after your antagonists, the history of administrations that have successfully taken on the media and won is shorter than this sentence.</p></blockquote><p>I’m not a fan of Fox News, but the thing that is so ridiculous about this is that Fox is more balanced – and has been objectively confirmed to be more balanced – than the other cable news networks and the mainstream media in general.  Even liberals who doubted this couldn’t credibly do so any longer once CNN took it upon itself to fact-check <i>an SNL skit</i> for the crime of being insufficiently reverential.</p><p>Anyhow, the article reports that Fox’s ratings are up 20 percent.  Obama’s, on the other hand, are down 38 percent since Inaugural Day.  It increasingly appears that strategically besting Hilary Clinton and her team in claiming the Democratic nomination was less Julius Caesar defeating Boadicea and more the equivalent of beating Miss South Carolina at chess.</p></div>",
  "content_text": "Before they go on to lose wars in Afghanistan and Pakistan, Obama figures his administration could use some practice\nlosing one on the home front\n:\n“We’re going to treat them the way we would treat an opponent,” Anita Dunn, the White House communications director, said in an interview with The New York Times. “As they are undertaking a war against Barack Obama and the White House, we don’t need to pretend that this is the way that legitimate news organizations behave.”\nAh, but pretending has traditionally been a valuable part of the presidential playbook. Smiling and wearing beige even under the most withering news media assault is not only good manners, but also has generally been good politics. While there is undoubtedly a visceral thrill in finally setting out after your antagonists, the history of administrations that have successfully taken on the media and won is shorter than this sentence.\nI’m not a fan of Fox News, but the thing that is so ridiculous about this is that Fox is more balanced – and has been objectively confirmed to be more balanced – than the other cable news networks and the mainstream media in general.  Even liberals who doubted this couldn’t credibly do so any longer once CNN took it upon itself to fact-check\nan SNL skit\nfor the crime of being insufficiently reverential.\nAnyhow, the article reports that Fox’s ratings are up 20 percent.  Obama’s, on the other hand, are down 38 percent since Inaugural Day.  It increasingly appears that strategically besting Hilary Clinton and her team in claiming the Democratic nomination was less Julius Caesar defeating Boadicea and more the equivalent of beating Miss South Carolina at chess.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-18T14:12:00+00:00"
}