{
  "url": "https://voxday.net/2009/10/30/rgd-199/",
  "scraped_at": "2026-01-08T23:11:02.279675",
  "title": "RGD $1.99",
  "date_display": "October 30, 2009",
  "date_iso": "2009-10-30T11:36:00+00:00",
  "date_from_url": "2009-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I wasn’t able to make the ebook available for free, you can get the PDF <a href=\"http://www.scribd.com/doc/21344045/Return-of-the-Great-Depression\">for only $1.99 at Scribd</a> immediately.  The Kindle version will also be $1.99 when Amazon finally gets around to updating their database and makes it available.  Even if you’re waiting for your hardcover to arrive, you might still like to check out <a href=\"http://www.scribd.com/doc/21344045/Return-of-the-Great-Depression\">the Scribd preview</a>, since it features three four-page sections that cover the comparison of present and historical bank failures, the “global savings glut” and the failure of the monetarist predictive model, and five of my suggestions for what can and should be done on the macro scale.  I always prefer to have both the book and the ebook myself, and thanks to the low ebook price and the Amazon discount you can get both the hardcover and the PDF for less than the cover price of the former alone.</p><p>Today looks like a busy day.  I had three radio interviews yesterday and five today; it was gratifying to discover how keenly interested people are in the subject matter.  Granted, the national show was focused on money matters, that being the name of the show, but regardless, it was remarkable to observe the divergence between the reactions of the Wall Street-based financial media and the talk radio hosts to yesterday’s “surprising” GDP report.  Speaking of today’s radio shows, one of them is The Barry Farber Show.  I’ll be on from 8PM to 9 PM Eastern and his producer said that he’d very much welcome callers with questions about the book in the second half-hour.  The number is 800-336-2225 if you’ve got an economics related one that I haven’t addressed here already and the show has <a href=\"http://www.crni.net/default.aspx\">an Internet live stream available</a>.</p></div>",
  "content_text": "While I wasn’t able to make the ebook available for free, you can get the PDF\nfor only $1.99 at Scribd\nimmediately.  The Kindle version will also be $1.99 when Amazon finally gets around to updating their database and makes it available.  Even if you’re waiting for your hardcover to arrive, you might still like to check out\nthe Scribd preview\n, since it features three four-page sections that cover the comparison of present and historical bank failures, the “global savings glut” and the failure of the monetarist predictive model, and five of my suggestions for what can and should be done on the macro scale.  I always prefer to have both the book and the ebook myself, and thanks to the low ebook price and the Amazon discount you can get both the hardcover and the PDF for less than the cover price of the former alone.\nToday looks like a busy day.  I had three radio interviews yesterday and five today; it was gratifying to discover how keenly interested people are in the subject matter.  Granted, the national show was focused on money matters, that being the name of the show, but regardless, it was remarkable to observe the divergence between the reactions of the Wall Street-based financial media and the talk radio hosts to yesterday’s “surprising” GDP report.  Speaking of today’s radio shows, one of them is The Barry Farber Show.  I’ll be on from 8PM to 9 PM Eastern and his producer said that he’d very much welcome callers with questions about the book in the second half-hour.  The number is 800-336-2225 if you’ve got an economics related one that I haven’t addressed here already and the show has\nan Internet live stream available\n.",
  "tags": [
    "books",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-30T11:36:00+00:00"
}