{
  "url": "https://voxday.net/2009/10/21/rgd-second-review/",
  "scraped_at": "2026-01-08T23:10:02.033624",
  "title": "RGD: the second review",
  "date_display": "October 21, 2009",
  "date_iso": "2009-10-21T10:43:00+00:00",
  "date_from_url": "2009-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chad the Elder of the Fraters Libertas <a href=\"http://www.fraterslibertas.com/2009/10/alpine-redoubt.html\">reviews RGD</a>:</p><blockquote><p>Let me start by passing on a shocking piece of information: Vox Day is not an economist. That may lead some to discount his views on matters economic, but in this case it proves to be beneficial. He approaches the subject as an outsider and is not wedded to any particular school of economic theory from his background. This allows him to be rather dispassionate in his analysis and also forces him to be more vigorous in his research since he doesn’t come into it with a great deal of experience.</p><p>It also makes <i>The Return of the Great Depression</i> a more understandable and entertaining read than your average economic tome. That’s not to say its been dumbed down or overly simplified. Vox takes on some rather weighty and complicated economic topics. But, as he previously did in <i>The Irrational Atheist</i>, he does so in his own unique voice (Vox’s vox?). Even while explaining the inner workings of the money supply or the components that make up GDP, he maintains his straight-shooting style infused with the mix of cynicism and sarcastic humor that readers of his blog have come to expect.</p></blockquote><p>I have to admit, after the complete, utter, and admitted failure of mainstream economics to foresee or forestall the present crisis, or to present potential solutions beyond increasing the amount of debt-funded spending, I would think that not being a credentialed economist would be seen as a strength rather than a weakness these days.  If the basic theory is bad, learning more sophisticated ways of playing with it is not going to help you understand anything.</p></div>",
  "content_text": "Chad the Elder of the Fraters Libertas\nreviews RGD\n:\nLet me start by passing on a shocking piece of information: Vox Day is not an economist. That may lead some to discount his views on matters economic, but in this case it proves to be beneficial. He approaches the subject as an outsider and is not wedded to any particular school of economic theory from his background. This allows him to be rather dispassionate in his analysis and also forces him to be more vigorous in his research since he doesn’t come into it with a great deal of experience.\nIt also makes\nThe Return of the Great Depression\na more understandable and entertaining read than your average economic tome. That’s not to say its been dumbed down or overly simplified. Vox takes on some rather weighty and complicated economic topics. But, as he previously did in\nThe Irrational Atheist\n, he does so in his own unique voice (Vox’s vox?). Even while explaining the inner workings of the money supply or the components that make up GDP, he maintains his straight-shooting style infused with the mix of cynicism and sarcastic humor that readers of his blog have come to expect.\nI have to admit, after the complete, utter, and admitted failure of mainstream economics to foresee or forestall the present crisis, or to present potential solutions beyond increasing the amount of debt-funded spending, I would think that not being a credentialed economist would be seen as a strength rather than a weakness these days.  If the basic theory is bad, learning more sophisticated ways of playing with it is not going to help you understand anything.",
  "tags": [
    "books",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-21T09:43:00+00:00"
}