{
  "url": "https://voxday.net/2009/10/25/rgd-release-hounds/",
  "scraped_at": "2026-01-08T23:10:29.173594",
  "title": "RGD: release the hounds",
  "date_display": "October 25, 2009",
  "date_iso": "2009-10-25T16:00:00+00:00",
  "date_from_url": "2009-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the official starting gun for the Amazon book bomb for <a href=\"http://www.amazon.com/Return-Great-Depression-Vox-Day/dp/1935071181/ref=sr_1_8?ie=UTF8&amp;s=books&amp;qid=1255037695&amp;sr=8-8\">The Return of the Great Depression</a>.  If you’re interested in buying it, either for yourself or for someone else, I’d encourage you to order a copy from Amazon in the next 12 hours.  Its initial ranking was 19,795 overall and 50 in Economic History, so that’s the starting point.  If you’re keeping track of the ratings as well as your fantasy team, feel free to post them here as they change on an hourly basis.  I think 1,000 and 10 would be an excellent objective; anything above that would be a smashing success.</p><p>By way of encouragement, I’d like the Dread Ilk to be the first to know about the <a href=\"http://www.returnofthegreatdepression.com\">dedicated book site</a>, which was developed for RGD by WorldNetDaily.  In addition to featuring a collection of my WND columns related to the economic crisis dating back to 2002, it also has some economic prediction trackings – including a rather nice one in 2008 that I’d completely forgotten – scheduled events, reviews, and <a href=\"http://www.returnofthegreatdepression.com/blog/\">an economics blog</a> where I will be posting daily.  The official publication date isn’t until Thursday, but I believe that WND intends to announce the book site tomorrow.  Some additional content, such as YouTube videos, will likely appear on the site in the relatively near future.  I also plan to make some of the spreadsheets I used in producing the charts for the book available for download from the site as well.</p><p>I very much appreciate the encouragement that people here have shown throughout the writing of RGD and I hope that you will find that it does not disappoint you.  It is not a massive book, but it is most definitely a data-rich one.  And we should probably all hope that it is a massively incorrect one.</p><p>UPDATE – Thank you very much if you participated in the Amazon launch last night.  It was a huge success and significantly exceeded my hopes for it by reaching #90 overall and #5 in Economics.  You even made it <a href=\"http://www.returnofthegreatdepression.com/2009/10/the-4-mover-and-shaker-on-amazon/\">the #1 Mover and Shaker on Amazon</a>!  I appreciate the confidence you have shown in the book and will look forward to hearing your thoughts on it after it arrives and you read it.</p></div>",
  "content_text": "This is the official starting gun for the Amazon book bomb for\nThe Return of the Great Depression\n.  If you’re interested in buying it, either for yourself or for someone else, I’d encourage you to order a copy from Amazon in the next 12 hours.  Its initial ranking was 19,795 overall and 50 in Economic History, so that’s the starting point.  If you’re keeping track of the ratings as well as your fantasy team, feel free to post them here as they change on an hourly basis.  I think 1,000 and 10 would be an excellent objective; anything above that would be a smashing success.\nBy way of encouragement, I’d like the Dread Ilk to be the first to know about the\ndedicated book site\n, which was developed for RGD by WorldNetDaily.  In addition to featuring a collection of my WND columns related to the economic crisis dating back to 2002, it also has some economic prediction trackings – including a rather nice one in 2008 that I’d completely forgotten – scheduled events, reviews, and\nan economics blog\nwhere I will be posting daily.  The official publication date isn’t until Thursday, but I believe that WND intends to announce the book site tomorrow.  Some additional content, such as YouTube videos, will likely appear on the site in the relatively near future.  I also plan to make some of the spreadsheets I used in producing the charts for the book available for download from the site as well.\nI very much appreciate the encouragement that people here have shown throughout the writing of RGD and I hope that you will find that it does not disappoint you.  It is not a massive book, but it is most definitely a data-rich one.  And we should probably all hope that it is a massively incorrect one.\nUPDATE – Thank you very much if you participated in the Amazon launch last night.  It was a huge success and significantly exceeded my hopes for it by reaching #90 overall and #5 in Economics.  You even made it\nthe #1 Mover and Shaker on Amazon\n!  I appreciate the confidence you have shown in the book and will look forward to hearing your thoughts on it after it arrives and you read it.",
  "tags": [
    "books",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-25T16:00:00+00:00"
}