{
  "url": "https://voxday.net/2009/10/20/rgd-reviews/",
  "scraped_at": "2026-01-08T23:09:56.481990",
  "title": "RGD: reviews",
  "date_display": "October 20, 2009",
  "date_iso": "2009-10-20T07:54:00+00:00",
  "date_from_url": "2009-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Right Condition <a href=\"http://www.rightcondition.com/2009/10/return-of-great-depression-book-review.html\">reviews <i>The Return of the Great Depression</i></a>:</p><blockquote><p>Once in a while, a book comes along that shakes so many of your core beliefs that you are left questioning either the integrity of what you have read or your own knowledge. In this particular case, I had the privilege of a sneak peek at <i>The Return of the Great Depression</i> by Vox Day and with most certainty can state, it is the latter. RGD as it shall be referred to from now on, as can be inferred from its title makes a very compelling case as to the state of our economy and where this nation is potentially headed. However do not be misled by its name, for this is much more than a prophecy, it is principally and foremost an economic text diligently spending the majority of its efforts in explaining why we are standing on the edge of a precipice.</p></blockquote><p> Chad the Elder of the Fraters Libertas <a href=\"http://www.fraterslibertas.com/2009/10/alpine-redoubt.html\">reviews RGD</a>:</p><blockquote><p>Let me start by passing on a shocking piece of information: Vox Day is not an economist. That may lead some to discount his views on matters economic, but in this case it proves to be beneficial. He approaches the subject as an outsider and is not wedded to any particular school of economic theory from his background. This allows him to be rather dispassionate in his analysis and also forces him to be more vigorous in his research since he doesn’t come into it with a great deal of experience.</p><p>It also makes <i>The Return of the Great Depression</i> a more understandable and entertaining read than your average economic tome. That’s not to say its been dumbed down or overly simplified. Vox takes on some rather weighty and complicated economic topics…. if you want to read an informative, thoughtful, and even sometimes entertaining book on the current economic situation, you can’t go wrong with <i>The Return of the Great Depression.</i></p></blockquote></div>",
  "content_text": "Right Condition\nreviews\nThe Return of the Great Depression\n:\nOnce in a while, a book comes along that shakes so many of your core beliefs that you are left questioning either the integrity of what you have read or your own knowledge. In this particular case, I had the privilege of a sneak peek at\nThe Return of the Great Depression\nby Vox Day and with most certainty can state, it is the latter. RGD as it shall be referred to from now on, as can be inferred from its title makes a very compelling case as to the state of our economy and where this nation is potentially headed. However do not be misled by its name, for this is much more than a prophecy, it is principally and foremost an economic text diligently spending the majority of its efforts in explaining why we are standing on the edge of a precipice.\nChad the Elder of the Fraters Libertas\nreviews RGD\n:\nLet me start by passing on a shocking piece of information: Vox Day is not an economist. That may lead some to discount his views on matters economic, but in this case it proves to be beneficial. He approaches the subject as an outsider and is not wedded to any particular school of economic theory from his background. This allows him to be rather dispassionate in his analysis and also forces him to be more vigorous in his research since he doesn’t come into it with a great deal of experience.\nIt also makes\nThe Return of the Great Depression\na more understandable and entertaining read than your average economic tome. That’s not to say its been dumbed down or overly simplified. Vox takes on some rather weighty and complicated economic topics…. if you want to read an informative, thoughtful, and even sometimes entertaining book on the current economic situation, you can’t go wrong with\nThe Return of the Great Depression.",
  "tags": [
    "books",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-20T06:54:00+00:00"
}