{
  "url": "https://voxday.net/2009/10/05/rothbard-anticipates-krugman-again/",
  "scraped_at": "2026-01-08T23:08:42.310210",
  "title": "Rothbard anticipates Krugman… again",
  "date_display": "October 5, 2009",
  "date_iso": "2009-10-05T17:30:00+00:00",
  "date_from_url": "2009-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Which is really rather remarkable, when you consider that the man has been dead for some time now.  The amusing thing is that Paul Krugman has no idea how utterly predictable both the failure of the Obama economic plan and <a href=\"http://krugman.blogs.nytimes.com/2009/10/03/obamas-anzio/\">his own reaction to it</a> was:</p><blockquote><p>[T]he worst of it is that it was more or less predictable. I went back to my first blog post — January 6, 2009 — worrying that the Obama economic plan was too cautious. I wrote:</p><p><i>This really does look like a plan that falls well short of what advocates of strong stimulus were hoping for — and it seems as if that was done in order to win Republican votes. Yet even if the plan gets the hoped-for 80 votes in the Senate, which seems doubtful, responsibility for the plan’s perceived failure, if it’s spun that way, will be placed on Democrats.  I see the following scenario: a weak stimulus plan, perhaps even weaker than what we’re talking about now, is crafted to win those extra GOP votes. The plan limits the rise in unemployment, but things are still pretty bad, with the rate peaking at something like 9 percent and coming down only slowly. And then Mitch McConnell says “See, government spending doesn’t work.”  Let’s hope I’ve got this wrong.</i></p><p>Alas, I didn’t have it wrong — except that unemployment will, if we’re lucky, peak around 10 percent, not 9.</p></blockquote><p>Here’s a prediction: U-3 unemployment won’t peak around 10 percent and when it doesn’t, Krugman will come up with yet another excuse for his failed Keynesian theory that will relate to how the stimulus was either not implemented properly or was implemented too late on too small a scale… even if there is a third stimulus plan next year.  It’s amusing to note that according to his recent column, he genuinely believes that the $1.2 trillion stimulus plan of Romer’s that he preferred to Obama’s $787 billion plan – which is right around the $1.18 trillion plan that he implicitly recommended at the time – would have magically made the vital difference.</p><p>None of this is any surprise, of course, which is why <a href=\"http://www.wnd.com/index.php?pageId=81193\">I was able to anticipate Krugman’s excuse-making</a> two months before he began laying the foundation for it and ten months before he actually started making excuses.  The reason it wasn’t a surprise is because, as Murray Rothbard explained in <i>America’s Great Depression</i>, this is the usual result when Keynesian theory fails in application, as it reliably does.</p><p><i>“Suppose a theory asserts that a certain policy will cure a depression. The government, obedient to the theory, puts the policy into effect. The depression is not cured. The critics and advocates of the theory now leap to the fore with interpretations. The critics say that failure proves the theory incorrect. The advocates say that the government erred in not pursuing the theory boldly enough, and that what is needed is stronger measures in the same direction.”</i><br> – Murray Rothbard, <i>America’s Great Depression</i>, 1963</br></p><p>But as bad as Krugman is when he’s ineptly trying to make forecasts using his own flawed Keynesian models, <a href=\"http://krugman.blogs.nytimes.com/2009/10/05/reinventing-1934-macro/\">he’s utterly hopeless when trying to critique other theories</a> that he quite clearly doesn’t know or understand.  Here he unwisely attacks Arnold Kling, and, by extension, Joseph Schumpeter.</p><blockquote><p>It’s all there: mass unemployment is necessary, because you have to shift resources away from sectors that got too big, stimulus is a bad thing because it slows the necessary adjustment. And now as then, the whole notion falls apart when you ask why, say, a housing boom — which requires shifting resources into housing — doesn’t produce the same kind of unemployment as a housing bust that shifts resources out of housing.</p></blockquote><p>Sweet John Maynard but the man can really be astoundingly obtuse at times.  He seriously can’t figure out why a boom doesn’t produce the same kind of unemployment that a bust does?  It’s as if the Keynesian focus on the aggregate economy completely destroys an economist’s ability to focus on anything smaller than the entire economy, like an economic sector or an industry.  He does have a point, though.  It never made sense to go back to Schumpeter’s 1934 macroeconomics, since Mises already had this process nailed down in 1912 in his <i>Theory of Money and Credit</i>.</p><p>The housing boom, which was fueled by debt, causes resources to be shifted out of other sectors into housing.  This doesn’t cause unemployment because the women who leave their office jobs to become real estate agents and the men who leave their auto manufacturing jobs to become construction workers <i>aren’t unemployed</i>.  Once the creation of new debt subsides, whether it is because the central bank increased interest rates, banks stop lending, or consumers stop borrowing, the bust begins but the housing industry workers who lose their jobs <i>can’t go back to their old jobs</i> because those jobs don’t exist.  It’s not as a decrease in demand for housing necessitates an increase in demand in some other sector of the economy.  So, in this case, they become unemployed.</p><p>The reason stimulus is a bad thing is because it props up the malinvested industry at an artificial level of demand and pays for workers who would otherwise be unemployed to make things that no one is willing to pay for at current prices.  (Or, as is more often the case these days, is unwilling to go into additional debt for in order to buy.)  As the September plunge in car sales shows, the industry will collapse as soon as the government stops propping it up.  And, to the extent it prevents capital resources and those otherwise unemployed people from going out and working in more productive industries, it harms the prospect of future economic growth.</p></div>",
  "content_text": "Which is really rather remarkable, when you consider that the man has been dead for some time now.  The amusing thing is that Paul Krugman has no idea how utterly predictable both the failure of the Obama economic plan and\nhis own reaction to it\nwas:\n[T]he worst of it is that it was more or less predictable. I went back to my first blog post — January 6, 2009 — worrying that the Obama economic plan was too cautious. I wrote:\nThis really does look like a plan that falls well short of what advocates of strong stimulus were hoping for — and it seems as if that was done in order to win Republican votes. Yet even if the plan gets the hoped-for 80 votes in the Senate, which seems doubtful, responsibility for the plan’s perceived failure, if it’s spun that way, will be placed on Democrats.  I see the following scenario: a weak stimulus plan, perhaps even weaker than what we’re talking about now, is crafted to win those extra GOP votes. The plan limits the rise in unemployment, but things are still pretty bad, with the rate peaking at something like 9 percent and coming down only slowly. And then Mitch McConnell says “See, government spending doesn’t work.”  Let’s hope I’ve got this wrong.\nAlas, I didn’t have it wrong — except that unemployment will, if we’re lucky, peak around 10 percent, not 9.\nHere’s a prediction: U-3 unemployment won’t peak around 10 percent and when it doesn’t, Krugman will come up with yet another excuse for his failed Keynesian theory that will relate to how the stimulus was either not implemented properly or was implemented too late on too small a scale… even if there is a third stimulus plan next year.  It’s amusing to note that according to his recent column, he genuinely believes that the $1.2 trillion stimulus plan of Romer’s that he preferred to Obama’s $787 billion plan – which is right around the $1.18 trillion plan that he implicitly recommended at the time – would have magically made the vital difference.\nNone of this is any surprise, of course, which is why\nI was able to anticipate Krugman’s excuse-making\ntwo months before he began laying the foundation for it and ten months before he actually started making excuses.  The reason it wasn’t a surprise is because, as Murray Rothbard explained in\nAmerica’s Great Depression\n, this is the usual result when Keynesian theory fails in application, as it reliably does.\n“Suppose a theory asserts that a certain policy will cure a depression. The government, obedient to the theory, puts the policy into effect. The depression is not cured. The critics and advocates of the theory now leap to the fore with interpretations. The critics say that failure proves the theory incorrect. The advocates say that the government erred in not pursuing the theory boldly enough, and that what is needed is stronger measures in the same direction.”\n– Murray Rothbard,\nAmerica’s Great Depression\n, 1963\nBut as bad as Krugman is when he’s ineptly trying to make forecasts using his own flawed Keynesian models,\nhe’s utterly hopeless when trying to critique other theories\nthat he quite clearly doesn’t know or understand.  Here he unwisely attacks Arnold Kling, and, by extension, Joseph Schumpeter.\nIt’s all there: mass unemployment is necessary, because you have to shift resources away from sectors that got too big, stimulus is a bad thing because it slows the necessary adjustment. And now as then, the whole notion falls apart when you ask why, say, a housing boom — which requires shifting resources into housing — doesn’t produce the same kind of unemployment as a housing bust that shifts resources out of housing.\nSweet John Maynard but the man can really be astoundingly obtuse at times.  He seriously can’t figure out why a boom doesn’t produce the same kind of unemployment that a bust does?  It’s as if the Keynesian focus on the aggregate economy completely destroys an economist’s ability to focus on anything smaller than the entire economy, like an economic sector or an industry.  He does have a point, though.  It never made sense to go back to Schumpeter’s 1934 macroeconomics, since Mises already had this process nailed down in 1912 in his\nTheory of Money and Credit\n.\nThe housing boom, which was fueled by debt, causes resources to be shifted out of other sectors into housing.  This doesn’t cause unemployment because the women who leave their office jobs to become real estate agents and the men who leave their auto manufacturing jobs to become construction workers\naren’t unemployed\n.  Once the creation of new debt subsides, whether it is because the central bank increased interest rates, banks stop lending, or consumers stop borrowing, the bust begins but the housing industry workers who lose their jobs\ncan’t go back to their old jobs\nbecause those jobs don’t exist.  It’s not as a decrease in demand for housing necessitates an increase in demand in some other sector of the economy.  So, in this case, they become unemployed.\nThe reason stimulus is a bad thing is because it props up the malinvested industry at an artificial level of demand and pays for workers who would otherwise be unemployed to make things that no one is willing to pay for at current prices.  (Or, as is more often the case these days, is unwilling to go into additional debt for in order to buy.)  As the September plunge in car sales shows, the industry will collapse as soon as the government stops propping it up.  And, to the extent it prevents capital resources and those otherwise unemployed people from going out and working in more productive industries, it harms the prospect of future economic growth.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-05T16:30:00+00:00"
}