{
  "url": "https://voxday.net/2009/10/08/someone-tell-united-negro-college-fund/",
  "scraped_at": "2026-01-08T23:08:55.238611",
  "title": "Someone tell the United Negro College Fund",
  "date_display": "October 8, 2009",
  "date_iso": "2009-10-08T10:59:00+00:00",
  "date_from_url": "2009-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the more amusing commenters at Pro Football Talk opposed to <a href=\"http://profootballtalk.nbcsports.com/2009/10/07/roman-oben-speaks-out-against-potential-limbaugh-ownership-of-rams\">the possibility of Rush Limbaugh purchasing a part-interest</a> in the St. Louis Rams:</p><blockquote><p>The word ‘Negro’ is offensive and Rush exploited that to boost ratings.</p></blockquote><p>That was a gem spotted in the comment thread inspired by a ridiculous piece written by a former NFL player <a href=\"http://views.washingtonpost.com/theleague/panelists/2009/10/rush-limbaugh-st-louis-rams-oben.html\">in the Washington Post</a>.  The reality is that Limbaugh, with his media savvy, would probably be a much better owner than several teams have at present, moreover, there’s no longer any question that the man was correct about Donovan McNabb, he of the 58.9% career completion percentage and <s>1.05</s>2.15 TD/INT ratio, being an overrated quarterback.  I just can’t see the NFL being dumb enough to ban an owner out of distaste for politics that are extremely popular with a statistically significant portion of its fan base.  That’s the self-destructive sort of thing the mainstream media does, and it has obviously not escaped the NFL’s attention that the mainstream media is in the process of collapsing.  After all, the reason it created the NFL Network is to have a vehicle to deliver its product to its customers once the networks can’t afford to pay huge broadcast rights fees anymore.</p></div>",
  "content_text": "One of the more amusing commenters at Pro Football Talk opposed to\nthe possibility of Rush Limbaugh purchasing a part-interest\nin the St. Louis Rams:\nThe word ‘Negro’ is offensive and Rush exploited that to boost ratings.\nThat was a gem spotted in the comment thread inspired by a ridiculous piece written by a former NFL player\nin the Washington Post\n.  The reality is that Limbaugh, with his media savvy, would probably be a much better owner than several teams have at present, moreover, there’s no longer any question that the man was correct about Donovan McNabb, he of the 58.9% career completion percentage and\n1.05\n2.15 TD/INT ratio, being an overrated quarterback.  I just can’t see the NFL being dumb enough to ban an owner out of distaste for politics that are extremely popular with a statistically significant portion of its fan base.  That’s the self-destructive sort of thing the mainstream media does, and it has obviously not escaped the NFL’s attention that the mainstream media is in the process of collapsing.  After all, the reason it created the NFL Network is to have a vehicle to deliver its product to its customers once the networks can’t afford to pay huge broadcast rights fees anymore.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-08T09:59:00+00:00"
}