{
  "url": "https://voxday.net/2009/10/04/ware-wease/",
  "scraped_at": "2026-01-08T23:08:33.314693",
  "title": "‘Ware the weasel",
  "date_display": "October 4, 2009",
  "date_iso": "2009-10-04T13:11:00+00:00",
  "date_from_url": "2009-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.timesonline.co.uk/tol/news/politics/article6860600.ece\">Good on Boris</a>!  I don’t believe David Cameron has any intention of holding a referendum unless he is absolutely forced to do so:</p><blockquote><p>David Cameron today dug in over Europe and set himself at odds with Boris Johnson by refusing to say whether the Conservative Party would hold a referendum on the Lisbon Treaty if it comes into force before the general election. The Tory leader will try to face down his party this week in Manchester by claiming that the Conservatives should have “one policy at a time”: to promise to hold a referendum while the treaty is still being debated elsewhere in Europe.</p></blockquote><p>Daniel Hannan or some other popular Euroskeptic ought to challenge Cameron for the Tory leadership if he will not commit explicitly to holding a referendum on the Lisbon Treaty <i>and</i> abrogating it if the English people vote against the it.  Cameron being a moderate EUnik was obviously hoping that the Irish would relieve him of having to take a public Euroskeptic position, but if he won’t, UKIP will become the UK’s second party.</p><p>Which they may do anyhow.  It’s not as if the EU is going to become any more popular as hope that the European economy is in recovery now slowly dissipates.</p></div>",
  "content_text": "Good on Boris\n!  I don’t believe David Cameron has any intention of holding a referendum unless he is absolutely forced to do so:\nDavid Cameron today dug in over Europe and set himself at odds with Boris Johnson by refusing to say whether the Conservative Party would hold a referendum on the Lisbon Treaty if it comes into force before the general election. The Tory leader will try to face down his party this week in Manchester by claiming that the Conservatives should have “one policy at a time”: to promise to hold a referendum while the treaty is still being debated elsewhere in Europe.\nDaniel Hannan or some other popular Euroskeptic ought to challenge Cameron for the Tory leadership if he will not commit explicitly to holding a referendum on the Lisbon Treaty\nand\nabrogating it if the English people vote against the it.  Cameron being a moderate EUnik was obviously hoping that the Irish would relieve him of having to take a public Euroskeptic position, but if he won’t, UKIP will become the UK’s second party.\nWhich they may do anyhow.  It’s not as if the EU is going to become any more popular as hope that the European economy is in recovery now slowly dissipates.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-04T12:11:00+00:00"
}