{
  "url": "https://voxday.net/2009/10/26/wnd-depression-po/",
  "scraped_at": "2026-01-08T23:10:36.533134",
  "title": "WND depression poll",
  "date_display": "October 26, 2009",
  "date_iso": "2009-10-26T17:15:00+00:00",
  "date_from_url": "2009-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see that an overwhelming number of WND’s readers – 88% at this point! – believe that <a href=\"http://forums.wnd.com/index.php?pageId=589&amp;pollShowResults=1\">the U.S. is headed for another Great Depression</a>.  I very much doubt they’re all readers of my column either.  It would seem that neither the stock market rally nor the endless stream of happy talk from the politicians and the financial media has convinced many people of anything.  Of course, what are mere words when banks like Citi are jacking up interest rates on credit cards to 29.99% and First Premier is charging 79.9% when depositors can’t get 2% on their savings accounts.  Neither the Fed nor the politicians are going to be able to get the banks lending when no one in their right mind can afford to own a credit card.  As Mike Shedlock points out, this isn’t a bad thing, it is in fact <a href=\"http://globaleconomicanalysis.blogspot.com/2009/10/how-citi-grinch-stole-christmas-and-why.html\">a necessary thing</a>.</p><p>It’s pretty clear that those voting aren’t regular readers of my column, though, since 39% selected the option that says Obama is the most to blame.  Obama isn’t even in the top 20 of those who are most to blame for the developing depression, although no doubt it will be a major part of his legacy.  This event was a long time in the making and although Obama’s ill-considered actions have only made things worse, there was nothing he could have done to stop it.   In fact, if he had acted properly, everyone would already be conscious that the depression is upon us and many people would be blaming him for that.</p><p>My answer is: “Yes, the Depression is, in fact, already here”.  And even if the BEA avoids springing a UK-style surprise to the downside later this week, no pumped-up reports of “better-than-expected” 3.3% GDP growth later this week is going to change that.</p><p>I’ll be on the radio with our old friend Jerry Hughes discussing this and other things from 4-5 PM eastern.  Listen in via <a href=\"http://www.accentradionetwork.com/chooseplayer.htm\">the Internet broadcast</a>.</p></div>",
  "content_text": "It’s interesting to see that an overwhelming number of WND’s readers – 88% at this point! – believe that\nthe U.S. is headed for another Great Depression\n.  I very much doubt they’re all readers of my column either.  It would seem that neither the stock market rally nor the endless stream of happy talk from the politicians and the financial media has convinced many people of anything.  Of course, what are mere words when banks like Citi are jacking up interest rates on credit cards to 29.99% and First Premier is charging 79.9% when depositors can’t get 2% on their savings accounts.  Neither the Fed nor the politicians are going to be able to get the banks lending when no one in their right mind can afford to own a credit card.  As Mike Shedlock points out, this isn’t a bad thing, it is in fact\na necessary thing\n.\nIt’s pretty clear that those voting aren’t regular readers of my column, though, since 39% selected the option that says Obama is the most to blame.  Obama isn’t even in the top 20 of those who are most to blame for the developing depression, although no doubt it will be a major part of his legacy.  This event was a long time in the making and although Obama’s ill-considered actions have only made things worse, there was nothing he could have done to stop it.   In fact, if he had acted properly, everyone would already be conscious that the depression is upon us and many people would be blaming him for that.\nMy answer is: “Yes, the Depression is, in fact, already here”.  And even if the BEA avoids springing a UK-style surprise to the downside later this week, no pumped-up reports of “better-than-expected” 3.3% GDP growth later this week is going to change that.\nI’ll be on the radio with our old friend Jerry Hughes discussing this and other things from 4-5 PM eastern.  Listen in via\nthe Internet broadcast\n.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-26T17:15:00+00:00"
}