{
  "url": "https://voxday.net/2009/10/20/you-dont-know-euthyphro/",
  "scraped_at": "2026-01-08T23:09:58.318585",
  "title": "You don’t know Euthyphro",
  "date_display": "October 20, 2009",
  "date_iso": "2009-10-20T14:30:00+00:00",
  "date_from_url": "2009-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ll be addressing Luke’s fourth letter in a day or three, but in the meantime, I couldn’t possibly let <a href=\"http://commonsenseatheism.com/?p=4074#comments\">this very funny comment</a> by drj pass unremarked.  As I pointed out in TIA, half-educated atheists often like to resort to the Euthyphro Dilemma, but because they haven’t actually read Plato, they have absolutely no idea that the argument doesn’t merely fail due to moral arbitrariness or because of its intrinsic inapplicability to a non-polytheistic concept of the divine, it first fails on the basis of a dishonest, logically invalid, and <i>admitted</i> modification of an integral definition by Socrates.</p><blockquote><p>What’s funny is… the Euthyphro dilemma is supposed to work on people like Vox. Its supposed to confront them with a reductio ad absurdum – that it should to be absurd to think morality is arbitrary, evils are actually goods when commanded by the right being, and that all statements about the goodness of God become meaningless. What can you do though, when one simply fails to recognize the “absurdum”, in reductio ad absurdum?</p></blockquote><p>Drj clearly doesn’t realize <i>there is no absurdum to be recognized</i> because the attempt to reduce the argument to the required tautology falls apart before it is completed.  Any time you encounter someone appealing to Euthyphro in a discussion of religion or morality, you can be very confident that he doesn’t know what he’s talking about.  See TIA pp 291-300.</p></div>",
  "content_text": "I’ll be addressing Luke’s fourth letter in a day or three, but in the meantime, I couldn’t possibly let\nthis very funny comment\nby drj pass unremarked.  As I pointed out in TIA, half-educated atheists often like to resort to the Euthyphro Dilemma, but because they haven’t actually read Plato, they have absolutely no idea that the argument doesn’t merely fail due to moral arbitrariness or because of its intrinsic inapplicability to a non-polytheistic concept of the divine, it first fails on the basis of a dishonest, logically invalid, and\nadmitted\nmodification of an integral definition by Socrates.\nWhat’s funny is… the Euthyphro dilemma is supposed to work on people like Vox. Its supposed to confront them with a reductio ad absurdum – that it should to be absurd to think morality is arbitrary, evils are actually goods when commanded by the right being, and that all statements about the goodness of God become meaningless. What can you do though, when one simply fails to recognize the “absurdum”, in reductio ad absurdum?\nDrj clearly doesn’t realize\nthere is no absurdum to be recognized\nbecause the attempt to reduce the argument to the required tautology falls apart before it is completed.  Any time you encounter someone appealing to Euthyphro in a discussion of religion or morality, you can be very confident that he doesn’t know what he’s talking about.  See TIA pp 291-300.",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-10-20T13:30:00+00:00"
}