{
  "url": "https://voxday.net/2018/10/03/a-letter-to-the-civic-nationalists/",
  "scraped_at": "2025-12-20T05:11:03.905448",
  "title": "A letter to the civic nationalists",
  "date_display": "October 3, 2018",
  "date_iso": "2018-10-03T10:25:02+00:00",
  "date_from_url": "2018-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Inspired by the Kavanaugh confirmation hearings, the Z-man <a href=\"http://thezman.com/wordpress/?p=15176\">addresses the civic nationalists</a> who have been distressed by this glimpse into the manners and customs of Post-America.</p><blockquote><p>Think about all that has been said and written in favor of civil nationalism, yet, here we are anyway…. Look at the fruits of civic nationalism. The champions of the constitutional order and rule of law are all sitting on the Republican side, getting rolled by the non-white rage heads responsible for this circus. The professional civic nationalists have built out a well-financed system to promote your cause. Yet here they are getting clobbered again. If they can’t win this fight, what can they win?</p><p>Look. I get it. In your heart you know our side is right about “the race stuff.”. It’s why you moved to a neighborhood with good schools and a bad basketball team. It’s why you support Israel and oppose Islam. You know that only in a society run by white men can there be anything resembling civil order. You hate yourself for it so you have created all sorts of ways to show you’re not an anti-Semite or conceal your real feelings toward blacks. It’s hard to put down that steamer trunk of guilt you have been taught to carry.</p><p>I get it. All of us on this side of the great divide get it. All of us have made the journey you will have to make. It’s not easy to accept that all the stuff you have been taught about the constitution and patriotism was just a way to blind you to the approaching darkness. Now you have a chance to open your eyes and see what comes next if you don’t begin your journey to this side. That circus on your television is not going to just fade away. it is a glimpse into the future, of your children’s future and your grandchildren’s future.</p></blockquote><p>Many civic nationalists can’t bear to face the truth about the transformation of the USA into Post-America due to their own identity complications. I understand that challenge very well, being identity-complicated myself.</p><p>But if you are willing to sell out your entire nation, your entire <i>civilization</i>, for the sake of your Chinese wife, your adopted black son, or your very nice, hard-working neighbor from Venezuela who loves football and just wants a better life for his extended family, then how are you any different than the businessman who was willing to sell the Soviets the rope with which they intended to hang him? How are you not a traitor to your family, your people, and your country, even by your own lofty principles?</p><p>If your definition of “America” requires <i>denying the very existence of America</i> as an actual, material, historical nation, if you deny that Americans are one united people descended from the same ancestors, speaking the same language, professing the same religion, attached to the same principles of government, and very similar in their manners and customs, then how can you possibly consider yourself to be a patriot or a loyal American at all?</p><p>And, regardless of your heritage, your ideological self-identification, or your position on optimal tax rates, how can you possibly consider yourself to be anything but a de facto member of the anti-American globalist Left?</p></div>",
  "content_text": "Inspired by the Kavanaugh confirmation hearings, the Z-man\naddresses the civic nationalists\nwho have been distressed by this glimpse into the manners and customs of Post-America.\nThink about all that has been said and written in favor of civil nationalism, yet, here we are anyway…. Look at the fruits of civic nationalism. The champions of the constitutional order and rule of law are all sitting on the Republican side, getting rolled by the non-white rage heads responsible for this circus. The professional civic nationalists have built out a well-financed system to promote your cause. Yet here they are getting clobbered again. If they can’t win this fight, what can they win?\nLook. I get it. In your heart you know our side is right about “the race stuff.”. It’s why you moved to a neighborhood with good schools and a bad basketball team. It’s why you support Israel and oppose Islam. You know that only in a society run by white men can there be anything resembling civil order. You hate yourself for it so you have created all sorts of ways to show you’re not an anti-Semite or conceal your real feelings toward blacks. It’s hard to put down that steamer trunk of guilt you have been taught to carry.\nI get it. All of us on this side of the great divide get it. All of us have made the journey you will have to make. It’s not easy to accept that all the stuff you have been taught about the constitution and patriotism was just a way to blind you to the approaching darkness. Now you have a chance to open your eyes and see what comes next if you don’t begin your journey to this side. That circus on your television is not going to just fade away. it is a glimpse into the future, of your children’s future and your grandchildren’s future.\nMany civic nationalists can’t bear to face the truth about the transformation of the USA into Post-America due to their own identity complications. I understand that challenge very well, being identity-complicated myself.\nBut if you are willing to sell out your entire nation, your entire\ncivilization\n, for the sake of your Chinese wife, your adopted black son, or your very nice, hard-working neighbor from Venezuela who loves football and just wants a better life for his extended family, then how are you any different than the businessman who was willing to sell the Soviets the rope with which they intended to hang him? How are you not a traitor to your family, your people, and your country, even by your own lofty principles?\nIf your definition of “America” requires\ndenying the very existence of America\nas an actual, material, historical nation, if you deny that Americans are one united people descended from the same ancestors, speaking the same language, professing the same religion, attached to the same principles of government, and very similar in their manners and customs, then how can you possibly consider yourself to be a patriot or a loyal American at all?\nAnd, regardless of your heritage, your ideological self-identification, or your position on optimal tax rates, how can you possibly consider yourself to be anything but a de facto member of the anti-American globalist Left?",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-03T09:25:02+00:00"
}