{
  "url": "https://voxday.net/2018/10/22/a-most-excellent-code-of-conduct/",
  "scraped_at": "2025-12-20T05:13:46.366338",
  "title": "A most excellent Code of Conduct",
  "date_display": "October 22, 2018",
  "date_iso": "2018-10-22T22:56:49+00:00",
  "date_from_url": "2018-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, <a href=\"https://www.sqlite.org/codeofconduct.html\">this is one CoC</a> I’d like to see more open source projects adopting.</p><blockquote><p>1. Overview<br>Having been encouraged by clients to adopt a written code of conduct, the SQLite developers elected to govern their interactions with each other, with their clients, and with the larger SQLite user community in accordance with the “instruments of good works” from chapter 4 of The Rule of St. Benedict. This code of conduct has proven its mettle in thousands of diverse communities for over 1,500 years, and has served as a baseline for many civil law codes since the time of Charlemagne.</br></p><p>This rule is strict, and none are able to comply perfectly. Grace is readily granted for minor transgressions. All are encouraged to follow this rule closely, as in so doing they may expect to live happier, healthier, and more productive lives. The entire rule is good and wholesome, and yet we make no enforcement of the more introspective aspects.</p><p>Everyone is free to use the SQLite source code, object code, and/or documentation regardless of their opinion of and adherence to this rule. SQLite has been and continues to be completely free to everyone, without precondition.</p><p>However, those who wish to participate in the SQLite community, either by commenting on the public mailing lists or by contributing patches or suggestions or in any other way, are expected to conduct themselves in a manner that honors the overarching spirit of the rule, even if they disagree with specific details. Polite and professional discussion is always welcomed, from anyone.</p><p>2. The Rule<br>First of all, love the Lord God with your whole heart, your whole soul, and your whole strength. Then, love your neighbor as yourself.</br></p></blockquote><p>Read the whole thing there. If it was good enough for St. Benedict’s little project, it’s good enough for yours.</p></div>",
  "content_text": "Now,\nthis is one CoC\nI’d like to see more open source projects adopting.\n1. Overview\nHaving been encouraged by clients to adopt a written code of conduct, the SQLite developers elected to govern their interactions with each other, with their clients, and with the larger SQLite user community in accordance with the “instruments of good works” from chapter 4 of The Rule of St. Benedict. This code of conduct has proven its mettle in thousands of diverse communities for over 1,500 years, and has served as a baseline for many civil law codes since the time of Charlemagne.\nThis rule is strict, and none are able to comply perfectly. Grace is readily granted for minor transgressions. All are encouraged to follow this rule closely, as in so doing they may expect to live happier, healthier, and more productive lives. The entire rule is good and wholesome, and yet we make no enforcement of the more introspective aspects.\nEveryone is free to use the SQLite source code, object code, and/or documentation regardless of their opinion of and adherence to this rule. SQLite has been and continues to be completely free to everyone, without precondition.\nHowever, those who wish to participate in the SQLite community, either by commenting on the public mailing lists or by contributing patches or suggestions or in any other way, are expected to conduct themselves in a manner that honors the overarching spirit of the rule, even if they disagree with specific details. Polite and professional discussion is always welcomed, from anyone.\n2. The Rule\nFirst of all, love the Lord God with your whole heart, your whole soul, and your whole strength. Then, love your neighbor as yourself.\nRead the whole thing there. If it was good enough for St. Benedict’s little project, it’s good enough for yours.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-22T21:56:49+00:00"
}