{
  "url": "https://voxday.net/2018/10/04/civnat-vs-nationalist/",
  "scraped_at": "2025-12-20T05:11:14.605178",
  "title": "CivNat vs Nationalist",
  "date_display": "October 4, 2018",
  "date_iso": "2018-10-04T09:20:31+00:00",
  "date_from_url": "2018-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"https://www.youtube.com/watch?v=wMNH1bgKUgc\">exchange in the comments</a> of Rorschach of Swindon’s video channel perfectly explicates both the uselessness and the ultimately inimical status of the civic nationalists:</p><blockquote><p><b>Tsaddiq: </b>I am a classical liberal. Here in America, it has basically been rebranded as Libertarian. I think to have victory, you have to do what the Progressives did at the turn of the 20th century. Invest and invade  education. I am not going to go backwards to tribalism. That is what Progressivism has become and always was. It is an offshoot of Socialism really. The government can bring utopia. I cannot abide or play the same game. Perhaps you could disguise what you are doing to have a veneer of Tribalism. But we have to move back away from that philosophy.﻿</p><p><b>Rorschach: </b>The world has always been tribal, and no matter how many sports ball games they throw at us, and no matter how many times they pretend that we are all the same, reality and biology wins out in the end, and humanity is always going to revert back to a tribe versus tribe situation. I read history, lots and lots of history, and this little brief interlude in time is going to be seen as that stupid moment when white people tried to bring everyone together. It failed. White people were too nice, and began to be exploited, leading to a reaction (which we are beginning to see now) and a break-down of the multicultural experiment, leading to the collapse of countries and the end of the modern matriarchal welfare state. This is the end of the post WW2 period. It’s interesting to live through, but things are going to get pretty brutal from here.﻿</p></blockquote><p>Civic nationalists are inherently disloyal to their nation. They are globalists lite who not only conflate the state with the nation, but elevate membership in the state above membership in the nation. Ironically, they consider themselves to be “individualists” while simultaneously elevating the state to a sacral and definitive status well beyond that of any “tribalist” they accuse of collectivism.</p><p>And their melting pottist ideology is every bit in conflict with history and observable reality as feminism, Communism, and the neo-liberal world order.</p></div>",
  "content_text": "This\nexchange in the comments\nof Rorschach of Swindon’s video channel perfectly explicates both the uselessness and the ultimately inimical status of the civic nationalists:\nTsaddiq:\nI am a classical liberal. Here in America, it has basically been rebranded as Libertarian. I think to have victory, you have to do what the Progressives did at the turn of the 20th century. Invest and invade  education. I am not going to go backwards to tribalism. That is what Progressivism has become and always was. It is an offshoot of Socialism really. The government can bring utopia. I cannot abide or play the same game. Perhaps you could disguise what you are doing to have a veneer of Tribalism. But we have to move back away from that philosophy.﻿\nRorschach:\nThe world has always been tribal, and no matter how many sports ball games they throw at us, and no matter how many times they pretend that we are all the same, reality and biology wins out in the end, and humanity is always going to revert back to a tribe versus tribe situation. I read history, lots and lots of history, and this little brief interlude in time is going to be seen as that stupid moment when white people tried to bring everyone together. It failed. White people were too nice, and began to be exploited, leading to a reaction (which we are beginning to see now) and a break-down of the multicultural experiment, leading to the collapse of countries and the end of the modern matriarchal welfare state. This is the end of the post WW2 period. It’s interesting to live through, but things are going to get pretty brutal from here.﻿\nCivic nationalists are inherently disloyal to their nation. They are globalists lite who not only conflate the state with the nation, but elevate membership in the state above membership in the nation. Ironically, they consider themselves to be “individualists” while simultaneously elevating the state to a sacral and definitive status well beyond that of any “tribalist” they accuse of collectivism.\nAnd their melting pottist ideology is every bit in conflict with history and observable reality as feminism, Communism, and the neo-liberal world order.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-04T08:20:31+00:00"
}