{
  "url": "https://voxday.net/2018/10/25/darkstream-fake-news-fake-bomb/",
  "scraped_at": "2025-12-20T05:14:10.578381",
  "title": "Darkstream: Fake News, Fake Bomb",
  "date_display": "October 25, 2018",
  "date_iso": "2018-10-25T13:20:50+00:00",
  "date_from_url": "2018-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/DFaLx4t7ll4\" width=\"512\"></iframe></div><p><i>From the transcript of <a href=\"https://youtu.be/DFaLx4t7ll4\">the Darkstream</a>:</i></p><p>What I thought was really  interesting about the God-Emperor’s statements today was that they made it  clear that he’s condemning <i>all </i>political violence, which of course we  know is predominantly conducted by  Democrats, it is predominantly conducted  by Antifa, and so it’s just utterly  ridiculous to pretend that Donald  Trump’s violent rhetoric  is inspiring people to do bad and  terrible things. Now it is <i>possible </i>that  the person responsible is actually a  Republican, it’s <i>possible </i>that the person  responsible is a channer pulling some  sort of serious practical joke, but these “bombs”, so to speak, look like  something out of the Acme catalog that  you see in the Wile E. Coyote vs Roadrunner  cartoons.</p><p>Now we see this stuff over and  over and over again, we see these hoaxes  over and over and over again, and you  know that the people perpetrating them are  midwits, you know they’re not terribly  smart because they just think, well, it  worked once, it worked twice, it worked  three times, therefore it will always work! Surely  no one will ever notice this pattern of  behavior! And of course the media is  leaping on this in a big way. What’s funny  is that there are even Democratic  politicians like Cuomo who are claiming  falsely that they received these fake  bombs.</p><p>You know when political violence, <i>real </i>political violence takes place in a  country, like for example when the  Shining Path went after politicians and  and police in Peru, there was no  mistaking it. There was no mistaking the  political violence in Ireland either, but this stuff is a joke. It’s a hoax, it’s a false flag, it is fake  news! The whole idea is to  attempt to repress Republican attacks on  the Democrats, and especially  Republican attacks on the media, because  they’re so effective. I mean think about  it,  what is the narrative here? Because the  President and others say that the media  is fake, people are sending bombs in the  mail and therefore the president  shouldn’t do that. How does this make any  sense at all? There is no logic to it. If you  actually wrote it out in a proper  syllogistic form, you would see  that it doesn’t work, it’s bad logic,  and it’s bad rhetoric too because  everybody knows it’s fake I mean, you’re  going to solve the problem of the news  you push being fake by creating more  fake news? The narrative is  just absolutely ludicrous.</p><p>As you’d expect, Neon Revolt <a href=\"https://www.neonrevolt.com/2018/10/25/magabomber-the-utter-implosion-of-the-bombocrat-party-fakenews-fakebombs-bombocrats-falseflag-qanon-greatawakening-neonrevolt/\">has considerably more</a> on the Fake News Fake Bombs.</p><p>UPDATE: They’re <a href=\"https://www.nbcnewyork.com/news/local/Pipe-Bombs-Clinton-Obama-Soros-Waters-CNN-Time-Warner-Holder-Brennan-498490732.html\">doubling down</a> on their false flaggery. Robert De Niro? Seriously?</p><blockquote class=\"tr_bq\"><p>Investigators seized two more suspected package explosives — one addressed to former Vice President Joe Biden in Delaware and one addressed to Robert De Niro in New York</p></blockquote></div>",
  "content_text": "From the transcript of\nthe Darkstream\n:\nWhat I thought was really  interesting about the God-Emperor’s statements today was that they made it  clear that he’s condemning\nall\npolitical violence, which of course we  know is predominantly conducted by  Democrats, it is predominantly conducted  by Antifa, and so it’s just utterly  ridiculous to pretend that Donald  Trump’s violent rhetoric  is inspiring people to do bad and  terrible things. Now it is\npossible\nthat  the person responsible is actually a  Republican, it’s\npossible\nthat the person  responsible is a channer pulling some  sort of serious practical joke, but these “bombs”, so to speak, look like  something out of the Acme catalog that  you see in the Wile E. Coyote vs Roadrunner  cartoons.\nNow we see this stuff over and  over and over again, we see these hoaxes  over and over and over again, and you  know that the people perpetrating them are  midwits, you know they’re not terribly  smart because they just think, well, it  worked once, it worked twice, it worked  three times, therefore it will always work! Surely  no one will ever notice this pattern of  behavior! And of course the media is  leaping on this in a big way. What’s funny  is that there are even Democratic  politicians like Cuomo who are claiming  falsely that they received these fake  bombs.\nYou know when political violence,\nreal\npolitical violence takes place in a  country, like for example when the  Shining Path went after politicians and  and police in Peru, there was no  mistaking it. There was no mistaking the  political violence in Ireland either, but this stuff is a joke. It’s a hoax, it’s a false flag, it is fake  news! The whole idea is to  attempt to repress Republican attacks on  the Democrats, and especially  Republican attacks on the media, because  they’re so effective. I mean think about  it,  what is the narrative here? Because the  President and others say that the media  is fake, people are sending bombs in the  mail and therefore the president  shouldn’t do that. How does this make any  sense at all? There is no logic to it. If you  actually wrote it out in a proper  syllogistic form, you would see  that it doesn’t work, it’s bad logic,  and it’s bad rhetoric too because  everybody knows it’s fake I mean, you’re  going to solve the problem of the news  you push being fake by creating more  fake news? The narrative is  just absolutely ludicrous.\nAs you’d expect, Neon Revolt\nhas considerably more\non the Fake News Fake Bombs.\nUPDATE: They’re\ndoubling down\non their false flaggery. Robert De Niro? Seriously?\nInvestigators seized two more suspected package explosives — one addressed to former Vice President Joe Biden in Delaware and one addressed to Robert De Niro in New York",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-25T12:20:50+00:00"
}