{
  "url": "https://voxday.net/2018/10/02/darkstream-comicsgate-vs-marvel/",
  "scraped_at": "2025-12-20T05:10:56.554638",
  "title": "Darkstream: ComicsGate vs Marvel",
  "date_display": "October 2, 2018",
  "date_iso": "2018-10-02T12:11:30+00:00",
  "date_from_url": "2018-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/ihM-7tMeopw\" width=\"512\"></iframe></div><p><i>From the transcript <a href=\"https://youtu.be/ihM-7tMeopw\">of the Darkstream</a>:</i></p><p>The  interesting thing about this particular  lawsuit is that number one, the  defamation claim is  ridiculous. It is very, very hard to win a  defamation claim in the United States. If  this was in England or in a couple  other legal jurisdictions maybe  there’s a decent chance, but not in the  States, with a few specific state-based exceptions. However, the tortious interference claim  is quite possibly serious and it is  quite possibly legitimate. We don’t know, however, because we do not know what went into  Antarctic Press’s decision-making.</p><p>Now  the circumstantial evidence does tend to  indicate that Mark Waid’s call to them  and the contract subsequently being withdrawn was causal, that there was a causal relationship  between  those two things, but for all we know at  the moment it’s just circumstantial  evidence. This is why there is a part of the legal  process called discovery, when you get to  interview the other side under oath, take affadavits, and then of course  request any and all communications that  were related to that decision. And so you  know, again, we don’t know! Antarctic has  very publicly stated that Mark Waid’s  phone call had nothing to do with their  decision, but of course they might be  lying. They can say whatever  they want and it’s totally  meaningless at this point in time. Given  their obvious desire to stay in with the  comics industry mainstream, I don’t think  that their word can be taken seriously, and so we’ll find  out down the road.</p><p>I don’t think  if this will ever go to trial. I  think that if discovery reveals that Mark Waid’s interference did  cause Antarctic to break their contract  with Richard Meyer, then Waid is going  to be advised to settle, and given that  he may not even be paying for his lawyer  himself, he may not have a whole lot to  say about it. So here’s the thing: at  this point in time I don’t think that  either Richard Meyer and his attorney, or  Mark Waid and his attorney, actually know  what the truth is. The only  people who really know what the truth is  are not party to the lawsuit, and they are the people at Antarctic Press.</p><p>That being said, a lot of the stuff  that people are talking about and what people are saying about the whole  lawsuit is totally ridiculous. You know, they’re they’re trying to bring up stuff  related to past comments that Richards  made, they’re trying to bring up comments  that Mark Waid has made, and all that  sort of thing. What you have to  understand is that none of that matters. You can check this out  on InfoGalactic to confirm it, but <a href=\"https://infogalactic.com/info/Tortious_interference\">there are six elements to a claim of tortious interference</a>. Now if you listen, you’ll notice that all of the  self-appointed legal experts on sites  like <i>Bounding Into Comics</i> and <i>Bleeding Cool</i> and whatever, they’re not even <i>addressing </i>the relevant points.</p><p>So the  six points. First, the existence of a  contractual relationship or beneficial  business relationship between the two  parties, was there one between Richard  Meier and Antarctic Press? Yes, there was  a contract. Number two, knowledge of that relationship by a  third party, there was knowledge of that? Mark Waid knew about it. Three, intent of the third party to induce a party to the  relationship to breach the relationship. Did Mark Waid have that intent? Yes, we  know he had that intent, he publicly  stated it. Four, lack of any privilege on  the part of the third party to induce  such a breach. Obviously as a freelancer  working for Marvel, Waid had nothing to do  with either company, so four is also  confirmed. Five, the contractual  relationship is breached. Was it breached? Yes it was, that’s also yes. And then six, damage to the party against whom the  breach occurs. Now that’s the one area  that might be the weak link for Richard  Meyers’s case.</p><p><i>(Note that it is NOT necessarily required to conclusively demonstrate causality between the interference and the breach. It can be sufficient to demonstrate that the interference was intentional, improper, and the desired breach subsequently took place. The legal focus is on the improper nature of the interference, not establishing that the interference was the sole or primary cause of the breach.)</i></p><p>You know, it is  somewhat troubling that he is saying  things that are manifestly not true, saying, “well I couldn’t get it published  by any other publisher.” I can’t speak for  any other publisher, but all I know is  that we never heard from Richard Meyers. Dark Legion never heard from Richard  Meyers. Arkhaven Comics would not have  published him, but Dark Legion might have, and so if he didn’t talk to us, then he  probably didn’t talk to Top Cow, he  probably didn’t talk to DC, he probably  didn’t talk to IDW, or to Image. I don’t  know who he talked to, but to claim  that you could not be published by any  other publisher when at least one other  publisher knows that you never  contacted them… I think that you need  to be careful about making obviously  false claims like that. If you make a  false claim, if you make a claim that  everybody knows is false, it’s going to be  shot down.</p><p>Now that doesn’t mean that  Richard Meyers hasn’t been damaged. I think that you can probably  make a pretty good case that his  reputation was damaged considering the  level of the incendiary attacks and so forth  on him. Don’t get me wrong, I don’t like the  guy. I don’t know the guy, literally the only thing I know about  the guy is that he does nothing but badmouth me and Arkhaven and Dark Legion and everything to do  with us, so as far as I’m  concerned we’re definitely not  standing with him. We’re also definitely  not standing with Mark Waid, we’re just  sitting here watching this from the sidelines and learning as much as we can  about the industry.</p><p>But what I can also say is that if the lawyers who finally contacted me about the ComicsGate trademark via email are  responsible for Richard Meyers’s case, he’s  going to lose. Because if they are so  dumb, if they are so lazy and incapable  of doing their homework, as to send me  personally a cease-and-desist email for  something that I haven’t done and to which I  am not even a relevant party, then  there is absolutely no way they are  going to win a case against a top-notch lawyer like Mark Zaid. That’s my perspective, you can take  it or leave it, but the fact of the  matter is that when you see  incompetence and ineptitude of the  sort that we’ve witnessed from some of  the legal folks surrounding the ComicsGate people, I don’t think that it’s likely that they’re going to be very  successful even if they have a pretty  good case.</p><p>In further support of my observations, a Darkstream viewer <a href=\"https://www.youtube.com/watch?v=ihM-7tMeopw&amp;lc=UgxneuNIAq9VnjV8WJh4AaABAg\">commented</a>:</p><blockquote class=\"tr_bq\"><p>You make a good point about the lawyers. I was arguing with Rekieta Law about the trademark thing and he didn’t realize the burden of proof is on the plaintiff not the defendant. This is something I found from 15-30 min of internet research so how he got it wrong boggle the mind. Just shows he didn’t bother to research it. It doesn’t surprise me he didn’t even bother to consider that maybe you sue the company, not management or the figurehead.</p></blockquote><p>UPDATE:  I dug out the “cease-and-desist” email from 2VS’s attorneys and can confirm they are a Pennsylvania law firm that is not the same as the Texas firm that is handling Meyers’s case. So, perhaps the Texas lawyers are more on the ball.</p><p>I can also confirm that I am in no way sponsored by, approved by, or affiliated with Two-Face Van Sciver or ComicsGate. I most certainly am none of those things. At this point, who the hell would want to be?</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nThe  interesting thing about this particular  lawsuit is that number one, the  defamation claim is  ridiculous. It is very, very hard to win a  defamation claim in the United States. If  this was in England or in a couple  other legal jurisdictions maybe  there’s a decent chance, but not in the  States, with a few specific state-based exceptions. However, the tortious interference claim  is quite possibly serious and it is  quite possibly legitimate. We don’t know, however, because we do not know what went into  Antarctic Press’s decision-making.\nNow  the circumstantial evidence does tend to  indicate that Mark Waid’s call to them  and the contract subsequently being withdrawn was causal, that there was a causal relationship  between  those two things, but for all we know at  the moment it’s just circumstantial  evidence. This is why there is a part of the legal  process called discovery, when you get to  interview the other side under oath, take affadavits, and then of course  request any and all communications that  were related to that decision. And so you  know, again, we don’t know! Antarctic has  very publicly stated that Mark Waid’s  phone call had nothing to do with their  decision, but of course they might be  lying. They can say whatever  they want and it’s totally  meaningless at this point in time. Given  their obvious desire to stay in with the  comics industry mainstream, I don’t think  that their word can be taken seriously, and so we’ll find  out down the road.\nI don’t think  if this will ever go to trial. I  think that if discovery reveals that Mark Waid’s interference did  cause Antarctic to break their contract  with Richard Meyer, then Waid is going  to be advised to settle, and given that  he may not even be paying for his lawyer  himself, he may not have a whole lot to  say about it. So here’s the thing: at  this point in time I don’t think that  either Richard Meyer and his attorney, or  Mark Waid and his attorney, actually know  what the truth is. The only  people who really know what the truth is  are not party to the lawsuit, and they are the people at Antarctic Press.\nThat being said, a lot of the stuff  that people are talking about and what people are saying about the whole  lawsuit is totally ridiculous. You know, they’re they’re trying to bring up stuff  related to past comments that Richards  made, they’re trying to bring up comments  that Mark Waid has made, and all that  sort of thing. What you have to  understand is that none of that matters. You can check this out  on InfoGalactic to confirm it, but\nthere are six elements to a claim of tortious interference\n. Now if you listen, you’ll notice that all of the  self-appointed legal experts on sites  like\nBounding Into Comics\nand\nBleeding Cool\nand whatever, they’re not even\naddressing\nthe relevant points.\nSo the  six points. First, the existence of a  contractual relationship or beneficial  business relationship between the two  parties, was there one between Richard  Meier and Antarctic Press? Yes, there was  a contract. Number two, knowledge of that relationship by a  third party, there was knowledge of that? Mark Waid knew about it. Three, intent of the third party to induce a party to the  relationship to breach the relationship. Did Mark Waid have that intent? Yes, we  know he had that intent, he publicly  stated it. Four, lack of any privilege on  the part of the third party to induce  such a breach. Obviously as a freelancer  working for Marvel, Waid had nothing to do  with either company, so four is also  confirmed. Five, the contractual  relationship is breached. Was it breached? Yes it was, that’s also yes. And then six, damage to the party against whom the  breach occurs. Now that’s the one area  that might be the weak link for Richard  Meyers’s case.\n(Note that it is NOT necessarily required to conclusively demonstrate causality between the interference and the breach. It can be sufficient to demonstrate that the interference was intentional, improper, and the desired breach subsequently took place. The legal focus is on the improper nature of the interference, not establishing that the interference was the sole or primary cause of the breach.)\nYou know, it is  somewhat troubling that he is saying  things that are manifestly not true, saying, “well I couldn’t get it published  by any other publisher.” I can’t speak for  any other publisher, but all I know is  that we never heard from Richard Meyers. Dark Legion never heard from Richard  Meyers. Arkhaven Comics would not have  published him, but Dark Legion might have, and so if he didn’t talk to us, then he  probably didn’t talk to Top Cow, he  probably didn’t talk to DC, he probably  didn’t talk to IDW, or to Image. I don’t  know who he talked to, but to claim  that you could not be published by any  other publisher when at least one other  publisher knows that you never  contacted them… I think that you need  to be careful about making obviously  false claims like that. If you make a  false claim, if you make a claim that  everybody knows is false, it’s going to be  shot down.\nNow that doesn’t mean that  Richard Meyers hasn’t been damaged. I think that you can probably  make a pretty good case that his  reputation was damaged considering the  level of the incendiary attacks and so forth  on him. Don’t get me wrong, I don’t like the  guy. I don’t know the guy, literally the only thing I know about  the guy is that he does nothing but badmouth me and Arkhaven and Dark Legion and everything to do  with us, so as far as I’m  concerned we’re definitely not  standing with him. We’re also definitely  not standing with Mark Waid, we’re just  sitting here watching this from the sidelines and learning as much as we can  about the industry.\nBut what I can also say is that if the lawyers who finally contacted me about the ComicsGate trademark via email are  responsible for Richard Meyers’s case, he’s  going to lose. Because if they are so  dumb, if they are so lazy and incapable  of doing their homework, as to send me  personally a cease-and-desist email for  something that I haven’t done and to which I  am not even a relevant party, then  there is absolutely no way they are  going to win a case against a top-notch lawyer like Mark Zaid. That’s my perspective, you can take  it or leave it, but the fact of the  matter is that when you see  incompetence and ineptitude of the  sort that we’ve witnessed from some of  the legal folks surrounding the ComicsGate people, I don’t think that it’s likely that they’re going to be very  successful even if they have a pretty  good case.\nIn further support of my observations, a Darkstream viewer\ncommented\n:\nYou make a good point about the lawyers. I was arguing with Rekieta Law about the trademark thing and he didn’t realize the burden of proof is on the plaintiff not the defendant. This is something I found from 15-30 min of internet research so how he got it wrong boggle the mind. Just shows he didn’t bother to research it. It doesn’t surprise me he didn’t even bother to consider that maybe you sue the company, not management or the figurehead.\nUPDATE:  I dug out the “cease-and-desist” email from 2VS’s attorneys and can confirm they are a Pennsylvania law firm that is not the same as the Texas firm that is handling Meyers’s case. So, perhaps the Texas lawyers are more on the ball.\nI can also confirm that I am in no way sponsored by, approved by, or affiliated with Two-Face Van Sciver or ComicsGate. I most certainly am none of those things. At this point, who the hell would want to be?",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-02T11:11:30+00:00"
}