{
  "url": "https://voxday.net/2018/10/05/darkstream-the-supreme-court-and-social-justice-rhetoric/",
  "scraped_at": "2025-12-20T05:11:27.593898",
  "title": "Darkstream: The Supreme Court and social justice rhetoric",
  "date_display": "October 5, 2018",
  "date_iso": "2018-10-05T15:00:01+00:00",
  "date_from_url": "2018-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/NUNDMfofFEs\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/NUNDMfofFEs\">of the Darkstream</a>:</p><p><i>Is calling an SJW a social justice terrorist  good rhetoric?</i></p><p>No, it’s terrible, it’s absolutely terrible. The  whole point of rhetoric is to instigate  emotions. SJWs do consider themselves to  be brave warriors for social justice, that’s why using SJW in a derogatory  sense upsets them. They do not consider  themselves to be terrorists, so you might  as well call them social justice poopyheads, that’s not effective either. What  you guys need to learn is it’s not about  what YOU think.</p><p>You know I find this  incredibly irritating. People  are constantly saying “well, I call them social  justice crybabies cuz I think they I  think they cry and they’re babies.” First of  all, no, you don’t call them that, nobody  calls them that, you’ve never called them  that. Second, it’s not about you, it’s  not about what you think, it’s about what <i>they </i>think. That’s why rhetoric is effective. Rhetoric points to the truth, you know,  and they’re not terrorists, terrorists are actually scary and SJWs are not. That’s part of why they’re  so successful, you know, because they’re  not scary people who are taken seriously.</p><p>Yeah, alternatively use what they call  you, mockingly, but use it not ironically,  that can also be effective. SJWs aren’t warriors and they don’t fight  anything but caffeine and sugar  addictions, diabetes, and obesity. That’s  true, but they like to think that they  are, and so when you’re calling them “warriors” they know that you’re mocking them,  that’s why it’s so effective. What is a good use of rhetoric to use  against SJWS? They hate being called SJWs, it  drives them crazy, they even try to claim that the Alt-Right  invented it! No, the Alt-Right  didn’t invent any of that, that’s what  they actually call themselves and it was  just such a lame, ridiculous term that it  became a perjorative, a very effective one.</p><p>What would you call them to offend them? I just call them SJWs, that offends them  every single time, they hate it. Don’t you understand the most  effective rhetoric to use against  something is that which upsets them the  most? That’s why the whole “Democrats are the real racists” doesn’t work at all, because they don’t  regard themselves as being racist, they’re too clueless and hypocritical to  make the abstract leap that is required to  connect their paternalistic attitude  towards minorities with racism and understand that  it is actually racist. Again,  you’re delving into the realm of  dialectic, as soon as you have to start  explaining something you are in the  realm of dialectic. If you are applying  logic to it you’re in the realm of  dialectic. Whatever you use has  to inflict emotional pain on them.</p><p><i>To which I later added in the comments:</i></p><p>For the benefit of those of you who are too stupid to understand either my books or Aristotle’s, I will dumb the concept down to the maximum extent possible:</p><p>Rhetoric is NOT about YOU. It is not about what you think, it is not about what makes sense to you, it is not about what you think sounds cool, clever, witty, funny, or will “cause heads to explode”. Rhetoric is about what observably causes emotional pain and distress to its target.</p><p>If you think calling the Left, which has supported every terrorist movement since the Irgun, the IRA, and the PLO, “terrorists”, is going to cause them any emotional pain at all, then you are even dumber than I already think you are.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nIs calling an SJW a social justice terrorist  good rhetoric?\nNo, it’s terrible, it’s absolutely terrible. The  whole point of rhetoric is to instigate  emotions. SJWs do consider themselves to  be brave warriors for social justice, that’s why using SJW in a derogatory  sense upsets them. They do not consider  themselves to be terrorists, so you might  as well call them social justice poopyheads, that’s not effective either. What  you guys need to learn is it’s not about  what YOU think.\nYou know I find this  incredibly irritating. People  are constantly saying “well, I call them social  justice crybabies cuz I think they I  think they cry and they’re babies.” First of  all, no, you don’t call them that, nobody  calls them that, you’ve never called them  that. Second, it’s not about you, it’s  not about what you think, it’s about what\nthey\nthink. That’s why rhetoric is effective. Rhetoric points to the truth, you know,  and they’re not terrorists, terrorists are actually scary and SJWs are not. That’s part of why they’re  so successful, you know, because they’re  not scary people who are taken seriously.\nYeah, alternatively use what they call  you, mockingly, but use it not ironically,  that can also be effective. SJWs aren’t warriors and they don’t fight  anything but caffeine and sugar  addictions, diabetes, and obesity. That’s  true, but they like to think that they  are, and so when you’re calling them “warriors” they know that you’re mocking them,  that’s why it’s so effective. What is a good use of rhetoric to use  against SJWS? They hate being called SJWs, it  drives them crazy, they even try to claim that the Alt-Right  invented it! No, the Alt-Right  didn’t invent any of that, that’s what  they actually call themselves and it was  just such a lame, ridiculous term that it  became a perjorative, a very effective one.\nWhat would you call them to offend them? I just call them SJWs, that offends them  every single time, they hate it. Don’t you understand the most  effective rhetoric to use against  something is that which upsets them the  most? That’s why the whole “Democrats are the real racists” doesn’t work at all, because they don’t  regard themselves as being racist, they’re too clueless and hypocritical to  make the abstract leap that is required to  connect their paternalistic attitude  towards minorities with racism and understand that  it is actually racist. Again,  you’re delving into the realm of  dialectic, as soon as you have to start  explaining something you are in the  realm of dialectic. If you are applying  logic to it you’re in the realm of  dialectic. Whatever you use has  to inflict emotional pain on them.\nTo which I later added in the comments:\nFor the benefit of those of you who are too stupid to understand either my books or Aristotle’s, I will dumb the concept down to the maximum extent possible:\nRhetoric is NOT about YOU. It is not about what you think, it is not about what makes sense to you, it is not about what you think sounds cool, clever, witty, funny, or will “cause heads to explode”. Rhetoric is about what observably causes emotional pain and distress to its target.\nIf you think calling the Left, which has supported every terrorist movement since the Irgun, the IRA, and the PLO, “terrorists”, is going to cause them any emotional pain at all, then you are even dumber than I already think you are.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-05T14:00:01+00:00"
}