{
  "url": "https://voxday.net/2018/10/31/darkstream-in-defense-of-the-us-border/",
  "scraped_at": "2025-12-20T05:14:55.839849",
  "title": "Darkstream: In Defense of the US Border",
  "date_display": "October 31, 2018",
  "date_iso": "2018-10-31T13:04:10+00:00",
  "date_from_url": "2018-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/OKuixxy3cFg\" width=\"512\"></iframe></div><p>From the transcript of <a href=\"https://youtu.be/OKuixxy3cFg\">the Darkstream</a>:</p><p>The problem  is that Americans don’t understand that  the frontier closed over one hundred years  ago. These people are not coming to  America to become Americans, they’re  invading America to demand tribute. There’s an old saying about the  Danegeld: once you pay the Danegeld  you’ll never be rid of the Dane. The United States brought in immigrants, brought in refugees, and all they did was encourage more. And  that’s why the United States is falling  apart.</p><p>The average IQ has fallen by as  much as eight points. The country is  literally stupefying itself, enstupidating itself, however you want to describe it, the  country is actively lowering its  standard of living and its ability to  maintain its infrastructure. It is not  sustainable. Trump  understands what is politically possible  better than me, that’s true, but  it’s not about politics. War is not about  politics. When Clausewitz talks about war being politics by other means, that’s the whole point, it’s about <i>other  means</i>. Once you’re in the realm of  defending borders, that’s not something  that you need to win support for, you  either do it or you don’t, and if you  don’t do it then you have failed. It’s  that simple.</p><p>Gordon says the entire West is infested  with that mentality. That’s absolutely  true and it’s not an accident. It’s a mentality that has been pushed  systematically on the West by a  coalition of peoples whose interests are  intrinsically anti-Western. It’s not a  single group of people. It’s not just the  Jews, it’s not just the socialists, it’s  not just the various immigrant peoples,  it is a coalition of peoples whose  interests are in general opposed to the  interests of the Western people.</p><p>Now the  West has brought it on itself, you know. The fact that the West colonized these  other countries, the fact that the West  imposed their economic systems and their  currencies and their legal systems and  everything else on other countries, is  now coming back to bite the West. This is  a normal reaction to empire. If you study  the empires of the past, whether you  study the Athenian empire, whether you  study the Roman empire, whether you look  at some of the Chinese empires, whether  you look at the German empire, whether  you look at the British empire, all of  these empires were fundamentally  weakened by the nature of their  having established their rule over foreign  nations because it’s a relationship that  goes both ways. When you set up a colony in another  nation you obviously affect that nation, but that nation also affects you. That’s why the Dutch have an issue  with the people who obtain Dutch  citizenship through living in  the Netherlands Antilles.</p><p>This is a  historical pattern that repeats itself  over and over and over again, and the  logic of empire is what is now  destroying the United States empire. People say, well, you know, the US is not  an empire, we don’t have an emperor. Well, who was the emperor of the Athenian empire? You can’t name it,  there wasn’t one, because an empire is  not about what you call the ruler or  rulers, it’s fundamentally about whether one nation is ruling over a  series of other nations or not.</p><p>A reader is reminded of the historical cycle described in the ancient Chinese classic:</p><blockquote><p>The latest Darkstream immediately brought to mind the famous opening lines of <i>Three Kingdoms</i>:</p><p><i>“Here begins our tale. The empire, long divided, must unite; long united, must divide. Thus it has ever been.”</i></p><p>The urge to unite speaks to man’s hubris and arrogance, and the eventual division, to the inevitable end of that folly and hubris.</p></blockquote></div>",
  "content_text": "From the transcript of\nthe Darkstream\n:\nThe problem  is that Americans don’t understand that  the frontier closed over one hundred years  ago. These people are not coming to  America to become Americans, they’re  invading America to demand tribute. There’s an old saying about the  Danegeld: once you pay the Danegeld  you’ll never be rid of the Dane. The United States brought in immigrants, brought in refugees, and all they did was encourage more. And  that’s why the United States is falling  apart.\nThe average IQ has fallen by as  much as eight points. The country is  literally stupefying itself, enstupidating itself, however you want to describe it, the  country is actively lowering its  standard of living and its ability to  maintain its infrastructure. It is not  sustainable. Trump  understands what is politically possible  better than me, that’s true, but  it’s not about politics. War is not about  politics. When Clausewitz talks about war being politics by other means, that’s the whole point, it’s about\nother  means\n. Once you’re in the realm of  defending borders, that’s not something  that you need to win support for, you  either do it or you don’t, and if you  don’t do it then you have failed. It’s  that simple.\nGordon says the entire West is infested  with that mentality. That’s absolutely  true and it’s not an accident. It’s a mentality that has been pushed  systematically on the West by a  coalition of peoples whose interests are  intrinsically anti-Western. It’s not a  single group of people. It’s not just the  Jews, it’s not just the socialists, it’s  not just the various immigrant peoples,  it is a coalition of peoples whose  interests are in general opposed to the  interests of the Western people.\nNow the  West has brought it on itself, you know. The fact that the West colonized these  other countries, the fact that the West  imposed their economic systems and their  currencies and their legal systems and  everything else on other countries, is  now coming back to bite the West. This is  a normal reaction to empire. If you study  the empires of the past, whether you  study the Athenian empire, whether you  study the Roman empire, whether you look  at some of the Chinese empires, whether  you look at the German empire, whether  you look at the British empire, all of  these empires were fundamentally  weakened by the nature of their  having established their rule over foreign  nations because it’s a relationship that  goes both ways. When you set up a colony in another  nation you obviously affect that nation, but that nation also affects you. That’s why the Dutch have an issue  with the people who obtain Dutch  citizenship through living in  the Netherlands Antilles.\nThis is a  historical pattern that repeats itself  over and over and over again, and the  logic of empire is what is now  destroying the United States empire. People say, well, you know, the US is not  an empire, we don’t have an emperor. Well, who was the emperor of the Athenian empire? You can’t name it,  there wasn’t one, because an empire is  not about what you call the ruler or  rulers, it’s fundamentally about whether one nation is ruling over a  series of other nations or not.\nA reader is reminded of the historical cycle described in the ancient Chinese classic:\nThe latest Darkstream immediately brought to mind the famous opening lines of\nThree Kingdoms\n:\n“Here begins our tale. The empire, long divided, must unite; long united, must divide. Thus it has ever been.”\nThe urge to unite speaks to man’s hubris and arrogance, and the eventual division, to the inevitable end of that folly and hubris.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-31T13:04:10+00:00"
}