{
  "url": "https://voxday.net/2018/10/11/darkstream-jordan-peterson-stars-as-wormtongue/",
  "scraped_at": "2025-12-20T05:12:19.198908",
  "title": "Darkstream: Jordan Peterson stars as Wormtongue",
  "date_display": "October 11, 2018",
  "date_iso": "2018-10-11T15:00:02+00:00",
  "date_from_url": "2018-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/WzG_xz2Zz7k\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/WzG_xz2Zz7k\">of the Darkstream</a>:</p><p>It’s really amazing to see how  someone like Jordan Peterson simply  doesn’t understand that people pay  attention to what you say, and that people  pay attention to what you said <i>yesterday</i>. People pay attention to what you wrote! He seems to think that as long  as you fold, spindle, and mutilate the  ideas that are coming out of your mouth, as long as you pretend to be thinking  very seriously, really debating with  yourself and thinking very hard like  you’ve never ever thought about the  subject before, then you can say whatever  you want. Because, you know, you don’t think  you’re right, it’s just a thought  experiment, it’s just an idea, just, you know, contemplating various  options and throwing ideas out there. It’s total bullshit! It is from  the start, it is all the way through, it  is at the finish.</p><p>Let me make it clear for you: Jordan Peterson is a used car salesman, except the used car he is selling is  himself. Okay? He’s not your dad, he’s not  your uncle, he is somebody who is making  a lot of money off of you and people  like you because you’re dumb enough to  fall for this guy! Look, I’m a writer, I am an editor, and I knew before I  finished the first chapter of <i>12 Rules  of Life</i> that Jordan Peterson was an  intellectual charlatan. Now, I will admit  that I wasn’t aware that he was a  complete lunatic until I read <i>Maps of Meaning</i>. I didn’t realize that  there was something genuinely wrong with  him until I read <i>Maps of Meaning</i> and I  didn’t realize how totally full of bullshit he is until I watched some of his videos.</p><p>Look, when you see him pull this  move, “no, I’ve never thought about this  before, I’m really just working my way  through the same thing that I’ve  been asked about 50 times before, but I  want you to think that I’m really trying  to puzzle my way through this and I  don’t want you to hold me accountable  for anything that I say,” I mean, you  should be <i>embarrassed!</i> You should be irritated with yourself  for listening to this guy at all!</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nIt’s really amazing to see how  someone like Jordan Peterson simply  doesn’t understand that people pay  attention to what you say, and that people  pay attention to what you said\nyesterday\n. People pay attention to what you wrote! He seems to think that as long  as you fold, spindle, and mutilate the  ideas that are coming out of your mouth, as long as you pretend to be thinking  very seriously, really debating with  yourself and thinking very hard like  you’ve never ever thought about the  subject before, then you can say whatever  you want. Because, you know, you don’t think  you’re right, it’s just a thought  experiment, it’s just an idea, just, you know, contemplating various  options and throwing ideas out there. It’s total bullshit! It is from  the start, it is all the way through, it  is at the finish.\nLet me make it clear for you: Jordan Peterson is a used car salesman, except the used car he is selling is  himself. Okay? He’s not your dad, he’s not  your uncle, he is somebody who is making  a lot of money off of you and people  like you because you’re dumb enough to  fall for this guy! Look, I’m a writer, I am an editor, and I knew before I  finished the first chapter of\n12 Rules  of Life\nthat Jordan Peterson was an  intellectual charlatan. Now, I will admit  that I wasn’t aware that he was a  complete lunatic until I read\nMaps of Meaning\n. I didn’t realize that  there was something genuinely wrong with  him until I read\nMaps of Meaning\nand I  didn’t realize how totally full of bullshit he is until I watched some of his videos.\nLook, when you see him pull this  move, “no, I’ve never thought about this  before, I’m really just working my way  through the same thing that I’ve  been asked about 50 times before, but I  want you to think that I’m really trying  to puzzle my way through this and I  don’t want you to hold me accountable  for anything that I say,” I mean, you  should be\nembarrassed!\nYou should be irritated with yourself  for listening to this guy at all!",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-11T14:00:02+00:00"
}