{
  "url": "https://voxday.net/2018/10/06/darkstream-jordan-peterson-sells-out-america/",
  "scraped_at": "2025-12-20T05:11:36.018212",
  "title": "Darkstream: Jordan Peterson sells out America",
  "date_display": "October 6, 2018",
  "date_iso": "2018-10-06T16:41:38+00:00",
  "date_from_url": "2018-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"384\" src=\"https://www.youtube.com/embed/6P3AAXOg9CE\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/6P3AAXOg9CE\">of the Darkstream</a>:</p><p>I warned  you about Jordan Peterson. A lot of  people were unhappy when I first came  out and pointed out that Jordan Peterson  is not a good guy, that Jordan Peterson is not on our side, that  Jordan Peterson is not an enemy of the SJWs, and that he is not someone who’s  good for the Right. Now, the thing is, either you stand for what is right  or what you don’t, and when Jordan  Peterson came out today against Judge Kavanaugh’s confirmation and explicitly came out and said  that if Kavanaugh is confirmed  -which he  will be, by the way, in case you haven’t  heard,  two of the four maybe votes in the  Senate have come out openly and  confirmed that they are going to support Kavanaugh’s confirmation and more  significantly one of them is actually  the West Virginia Democrat – so you know,  for years  Jordan Peterson has said he’s terrified  of making the mistake that is going to  ruin his career.</p><p>Now I don’t know if this  is actually sufficient to sink his  career or not, but it should be,  because this makes very clear that  Jordan Peterson is in league with the SJWs. Jordan Peterson is, in American  terms, a Democrat and there’s absolutely no question that the  intellectual dark web, the Ben Shapiros the Eric  Weinsteins, the recycled New Atheist known as Sam Harris, and Jordan  Peterson himself, are all on the side of  the Left. This is not a surprise, I mean,  I’ve been telling you guys this for ages. I knew that  he was not a good guy, that he was not on  our side, that he was part of the problem  rather than part of the solution  from the time I read his book. There are so many people who say such  incredibly dumb things about Peterson  because they happen to like one thing  that he said, they happen to like two  things that he said. Here’s the thing you  can always find <i>something </i>that somebody  says that you agree with. That doesn’t  mean that their objectives are aligned  with yours</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nI warned  you about Jordan Peterson. A lot of  people were unhappy when I first came  out and pointed out that Jordan Peterson  is not a good guy, that Jordan Peterson is not on our side, that  Jordan Peterson is not an enemy of the SJWs, and that he is not someone who’s  good for the Right. Now, the thing is, either you stand for what is right  or what you don’t, and when Jordan  Peterson came out today against Judge Kavanaugh’s confirmation and explicitly came out and said  that if Kavanaugh is confirmed  -which he  will be, by the way, in case you haven’t  heard,  two of the four maybe votes in the  Senate have come out openly and  confirmed that they are going to support Kavanaugh’s confirmation and more  significantly one of them is actually  the West Virginia Democrat – so you know,  for years  Jordan Peterson has said he’s terrified  of making the mistake that is going to  ruin his career.\nNow I don’t know if this  is actually sufficient to sink his  career or not, but it should be,  because this makes very clear that  Jordan Peterson is in league with the SJWs. Jordan Peterson is, in American  terms, a Democrat and there’s absolutely no question that the  intellectual dark web, the Ben Shapiros the Eric  Weinsteins, the recycled New Atheist known as Sam Harris, and Jordan  Peterson himself, are all on the side of  the Left. This is not a surprise, I mean,  I’ve been telling you guys this for ages. I knew that  he was not a good guy, that he was not on  our side, that he was part of the problem  rather than part of the solution  from the time I read his book. There are so many people who say such  incredibly dumb things about Peterson  because they happen to like one thing  that he said, they happen to like two  things that he said. Here’s the thing you  can always find\nsomething\nthat somebody  says that you agree with. That doesn’t  mean that their objectives are aligned  with yours",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-06T15:41:38+00:00"
}