{
  "url": "https://voxday.net/2018/10/13/disney-de-sjws/",
  "scraped_at": "2025-12-20T05:12:33.839911",
  "title": "Disney de-SJWs",
  "date_display": "October 13, 2018",
  "date_iso": "2018-10-13T06:00:04+00:00",
  "date_from_url": "2018-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First James Gunn, <a href=\"https://boundingintocomics.com/2018/10/12/chuck-wendig-fired-from-marvel-and-star-wars/\">now Chuck Wendig</a>.</p><blockquote><p>Chuck Wendig@ChuckWendig<br>So, here’s a thing that has happened – I just got fired from Marvel. Taken off issues 4 and 5 of SHADOW OF VADER, and taken off an as-yet-unannounced SW book.</br></p><p>Chuck Wendig@ChuckWendig<br>Today I got the call. I’m fired. Because of the negativity and vulgarity that my tweets bring. Seriously, that’s what Mark, the editor said. It was too much politics, too much vulgarity, too much negativity on my part.</br></p></blockquote><p> It’s a little soon to call it a trend, especially since Kathleen Kennedy had her contract extended, but it is a pair of very small steps forward for the Evil Empire.</p><p>No worries, Chuck. I’m sure DC will find something for you to ruin.</p></div>",
  "content_text": "First James Gunn,\nnow Chuck Wendig\n.\nChuck Wendig@ChuckWendig\nSo, here’s a thing that has happened – I just got fired from Marvel. Taken off issues 4 and 5 of SHADOW OF VADER, and taken off an as-yet-unannounced SW book.\nChuck Wendig@ChuckWendig\nToday I got the call. I’m fired. Because of the negativity and vulgarity that my tweets bring. Seriously, that’s what Mark, the editor said. It was too much politics, too much vulgarity, too much negativity on my part.\nIt’s a little soon to call it a trend, especially since Kathleen Kennedy had her contract extended, but it is a pair of very small steps forward for the Evil Empire.\nNo worries, Chuck. I’m sure DC will find something for you to ruin.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-13T05:00:04+00:00"
}