{
  "url": "https://voxday.net/2018/10/02/excerpt-ship-of-fools/",
  "scraped_at": "2025-12-20T05:10:52.227425",
  "title": "EXCERPT: Ship of Fools",
  "date_display": "October 2, 2018",
  "date_iso": "2018-10-02T01:14:13+00:00",
  "date_from_url": "2018-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.amazon.com/dp/B07HX4188K/ref=as_li_ss_il?ie=UTF8&amp;qid=1538384225&amp;sr=8-1&amp;keywords=ship+of+fools+hallpike&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=6954a08cb288ddaa7f0ad233f983b774\" rel=\"noopener\" style=\"clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B07HX4188K&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B07HX4188K&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>From <i><b><a href=\"https://amzn.to/2QjvuQ8\">SHIP OF FOOLS: An Anthology of Learned Nonsense About Primitive Society</a></b></i> by C.R. Hallpike.</p><p>Those who have no idea about any of this and want to speculate about early man or human nature in general simply assume that the lives of primitive peoples are basically like ours. For example, someone (Curtis 2013) has recently proposed that “The first, and most ancient function of manners is to solve the problem of how to be social without getting sick [from other people’s germs].” The picture of life in the background of this theory is obviously something like modern London, of dense crowds packed into buses and the Tube and breathing each other’s germs, shaking hands and kissing, using public lavatories, picking up things other people have handled in shops, and so on. Hunter-gatherer life, by contrast is very healthy: very small populations that cannot support epidemic diseases like measles and small-pox; no domestic animals, especially birds, from which humans can catch a whole range of infections; no clothes or houses which are notorious breeding grounds for a variety of parasites and their diseases; poor communications with other groups and their diseases; and a life in the sun and open air which are powerful antiseptics. If there was a “first and most ancient function of manners” it would actually have been to reduce social friction among small groups of people like this who have to live and get along with one another, not to avoid the largely imaginary dangers from communicable diseases.</p><p>Carrier and Morgan (2014) claim that men’s faces and jaws are more robust than women’s because for millions of years men have engaged in fist fights just like pub brawls in our society. First of all, in order for natural selection to have produced this result fist fights would have had to be lethal, and we know from bare-knuckle boxing in modern times that they aren’t. (Well-known instances of men being killed by a single punch are not the result of the punch but of falling and hitting their heads.) Indeed, where boxing is a social custom it is typically intended as a non-lethal form of competition, like wrestling. On the other hand, we know from anthropological studies that when hunter-gatherers (and everyone else) intend serious harm to one another they typically use weapons like clubs, spears, or rocks because they are so much more effective than trying to use one’s bare hands, which usually ends up in ineffectual scuffling unless people have been trained in martial arts.</p><p>Sex at Dawn (Ryan and Jetha 2010), by a psychologist and his wife, has been extremely well received by the general public. It claims that until 10,000 years ago, hunter-gatherers lived in communities where there was no such thing as marriage, but simply a sexual free-for-all. (They shared everything else, so why not each other?) Then, with the beginning of farming, there also came private property, and this meant that men started to worry about identifying heirs to whom they could pass on their land. This, in turn, produced monogamy and the regulation of our sexual impulses. First of all, it is generally accepted by physical anthropologists that pair-bonding is a key feature of human behavior which separates our species from all other primates, and must go back at least to Homo erectus. The elimination of female estrus allowed frequent sexual activity that cemented pair-bonding, and also “reduced the potential for [male] competition and safeguarded the alliances of hunter males” (Wilson 2004: 140-41). Secondly, if their theory were true we would expect to find a sexual free-for-all among existing hunter-gatherers, but marriage is actually a well-attested institution among them—primitive sexual free-for-alls are actually a Victorian myth. And thirdly, farming itself does not normally produce private property, but rather the communal rights of kin-groups over their land, and monogamy, at least as a norm, is far less frequent than polygamy. So, rather a disappointment for the polyamorists the book was intended to encourage.</p><p>But evolutionary psychologists have probably produced more fanciful theories about early Man than anyone else.</p><p>Evolutionary psychologists have always been fascinated by religion, and discussion of it usually begins something like this: “The propensity for religious belief may be innate because it is found in societies around the world. Innate behaviours are shaped by natural selection because they confer some advantage in the struggle for survival. But if religion is innate, what could that advantage have been?” (Wade 2007: 164).</p><p>“Religion” is not, in fact, some simple disposition that could possibly be either innate or learned. It is a highly complex phenomenon both psychologically and culturally, and there are major differences between the forms of religion found in primitive societies and the world religions with which we are familiar, as I have described in detail elsewhere (Hallpike 1977: 254-74; 2008a: 266-87; 2008b: 288-388; 2016: 62-88). But studying all these ethnographic facts is time-consuming and boring, and it is much more fun to assume that we all know what we mean by “religion”—something like “faith in spiritual beings”—and get on with constructing imaginative explanations about how it must have been adaptive for early man.</p><p>“No one”, continues Wade, “can describe with certainty the specific needs of hunter-gatherer societies that religion evolved to satisfy. But a strong possibility is that religion co-evolved with language, because language can be used to deceive, and religion is a safeguard against deception. Religion began as a mechanism for a community [wait for it!] <i>to exclude those who could not be trusted</i>” [my emphasis] (ibid., 164). And how exactly is this supposed to have worked? The answer is apparently the basic vulnerability of all societies to those freeloaders who are always poised like vultures to take advantage of the system. “Unless freeloaders can be curbed, a society may disintegrate, since membership loses its advantages. With the advent of language, freeloaders gained a great weapon, the power to deceive. Religion could have evolved as a means of defense against freeloading. Those who committed themselves in public ritual to the sacred truth were armed against the lie by knowing that they could trust one another” (ibid., 165).</p><p>Now since ritual, myth, and symbolism are fundamental elements of religion in all societies, it is indeed perfectly true that, as embodiments of meaning, they all need some form of linguistic expression in order to be shared in a common culture. For example, the celebrated Hohlenstein-Stadel carving of the Lion Man, a standing male figure with a lion’s head, has been dated to 40,000 years BP, and it has been estimated that it took about 400 hours to carve (Cook 2013: 33). It seems inconceivable that anyone could have done this unless he could also have given some explanation of what he was doing to his companions that they would have understood, and this would have obviously required a reasonably well-developed language.</p><p>To this extent Wade is therefore quite correct to claim that “religion” could not have developed without language, but participation in religious ritual has nothing whatever to do with commitment to truth or security against lying. The Konso believed that Waqa, the Sky God, sent rain, indeed that he almost was rain: <i>Waqa irobini</i>, “Waqa is raining” was a very common phrase I heard whenever rain fell. He was also believed to withhold rain from villages where there was too much quarrelling, and could strike dead those who lied under a sacred oath. But a crucial difference between the Konso and ourselves is that we are fundamentally aware of the possibility of <i>unbelief</i>, of the denial of anything beyond the purely material, so that the assertion of belief in God as true in our society is not like the belief of the Konso in Waqa. In their culture there is no real awareness of the possibility of not believing in Waqa, and his reality is simply taken for granted. When Wade says that “religious truths are accepted not as mere statements of fact but as sacred truths, something that it would be morally wrong to doubt” (ibid., 164) this may have some relevance to modern religion, but it has none to the forms of religion in primitive society.</p><p>The other selective advantage of religion, according to Wade, is that “It was then co-opted by the rulers of settled societies as a way of solidifying their authority and justifying their privileged position” (ibid., 164). The cynical ruler, smirking behind his hand at the simplicity of the peasants who thought him divine, is actually an invention of the Enlightenment.</p><p>In fact, in primitive society authority itself attracts sacred status, so that in the traditional society of the Tauade when a Big Man died his body would be put into a specially built enclosure which women were not allowed to enter. Pigs were then slaughtered inside the enclosure and the sacred bull-roarer was whirled, away from the gaze of the women. If enough boys were available they would be kept inside the enclosure in a little hut for several months where they could imbibe the vitality of the dead chief and were taught by adult men to be tough and aggressive. The Big Man’s corpse, meanwhile, had been put on a special platform in his hamlet where it was allowed to rot, and it was thought that people absorbed the powers of the Big Man in the smell. Big Men also had a special association with certain birds of prey and sacred oaks, and were believed to be essential for the general health and well being of the group. But these folk beliefs were certainly not “invented” by the Big Men to drum up support.</p></div>",
  "content_text": "From\nSHIP OF FOOLS: An Anthology of Learned Nonsense About Primitive Society\nby C.R. Hallpike.\nThose who have no idea about any of this and want to speculate about early man or human nature in general simply assume that the lives of primitive peoples are basically like ours. For example, someone (Curtis 2013) has recently proposed that “The first, and most ancient function of manners is to solve the problem of how to be social without getting sick [from other people’s germs].” The picture of life in the background of this theory is obviously something like modern London, of dense crowds packed into buses and the Tube and breathing each other’s germs, shaking hands and kissing, using public lavatories, picking up things other people have handled in shops, and so on. Hunter-gatherer life, by contrast is very healthy: very small populations that cannot support epidemic diseases like measles and small-pox; no domestic animals, especially birds, from which humans can catch a whole range of infections; no clothes or houses which are notorious breeding grounds for a variety of parasites and their diseases; poor communications with other groups and their diseases; and a life in the sun and open air which are powerful antiseptics. If there was a “first and most ancient function of manners” it would actually have been to reduce social friction among small groups of people like this who have to live and get along with one another, not to avoid the largely imaginary dangers from communicable diseases.\nCarrier and Morgan (2014) claim that men’s faces and jaws are more robust than women’s because for millions of years men have engaged in fist fights just like pub brawls in our society. First of all, in order for natural selection to have produced this result fist fights would have had to be lethal, and we know from bare-knuckle boxing in modern times that they aren’t. (Well-known instances of men being killed by a single punch are not the result of the punch but of falling and hitting their heads.) Indeed, where boxing is a social custom it is typically intended as a non-lethal form of competition, like wrestling. On the other hand, we know from anthropological studies that when hunter-gatherers (and everyone else) intend serious harm to one another they typically use weapons like clubs, spears, or rocks because they are so much more effective than trying to use one’s bare hands, which usually ends up in ineffectual scuffling unless people have been trained in martial arts.\nSex at Dawn (Ryan and Jetha 2010), by a psychologist and his wife, has been extremely well received by the general public. It claims that until 10,000 years ago, hunter-gatherers lived in communities where there was no such thing as marriage, but simply a sexual free-for-all. (They shared everything else, so why not each other?) Then, with the beginning of farming, there also came private property, and this meant that men started to worry about identifying heirs to whom they could pass on their land. This, in turn, produced monogamy and the regulation of our sexual impulses. First of all, it is generally accepted by physical anthropologists that pair-bonding is a key feature of human behavior which separates our species from all other primates, and must go back at least to Homo erectus. The elimination of female estrus allowed frequent sexual activity that cemented pair-bonding, and also “reduced the potential for [male] competition and safeguarded the alliances of hunter males” (Wilson 2004: 140-41). Secondly, if their theory were true we would expect to find a sexual free-for-all among existing hunter-gatherers, but marriage is actually a well-attested institution among them—primitive sexual free-for-alls are actually a Victorian myth. And thirdly, farming itself does not normally produce private property, but rather the communal rights of kin-groups over their land, and monogamy, at least as a norm, is far less frequent than polygamy. So, rather a disappointment for the polyamorists the book was intended to encourage.\nBut evolutionary psychologists have probably produced more fanciful theories about early Man than anyone else.\nEvolutionary psychologists have always been fascinated by religion, and discussion of it usually begins something like this: “The propensity for religious belief may be innate because it is found in societies around the world. Innate behaviours are shaped by natural selection because they confer some advantage in the struggle for survival. But if religion is innate, what could that advantage have been?” (Wade 2007: 164).\n“Religion” is not, in fact, some simple disposition that could possibly be either innate or learned. It is a highly complex phenomenon both psychologically and culturally, and there are major differences between the forms of religion found in primitive societies and the world religions with which we are familiar, as I have described in detail elsewhere (Hallpike 1977: 254-74; 2008a: 266-87; 2008b: 288-388; 2016: 62-88). But studying all these ethnographic facts is time-consuming and boring, and it is much more fun to assume that we all know what we mean by “religion”—something like “faith in spiritual beings”—and get on with constructing imaginative explanations about how it must have been adaptive for early man.\n“No one”, continues Wade, “can describe with certainty the specific needs of hunter-gatherer societies that religion evolved to satisfy. But a strong possibility is that religion co-evolved with language, because language can be used to deceive, and religion is a safeguard against deception. Religion began as a mechanism for a community [wait for it!]\nto exclude those who could not be trusted\n” [my emphasis] (ibid., 164). And how exactly is this supposed to have worked? The answer is apparently the basic vulnerability of all societies to those freeloaders who are always poised like vultures to take advantage of the system. “Unless freeloaders can be curbed, a society may disintegrate, since membership loses its advantages. With the advent of language, freeloaders gained a great weapon, the power to deceive. Religion could have evolved as a means of defense against freeloading. Those who committed themselves in public ritual to the sacred truth were armed against the lie by knowing that they could trust one another” (ibid., 165).\nNow since ritual, myth, and symbolism are fundamental elements of religion in all societies, it is indeed perfectly true that, as embodiments of meaning, they all need some form of linguistic expression in order to be shared in a common culture. For example, the celebrated Hohlenstein-Stadel carving of the Lion Man, a standing male figure with a lion’s head, has been dated to 40,000 years BP, and it has been estimated that it took about 400 hours to carve (Cook 2013: 33). It seems inconceivable that anyone could have done this unless he could also have given some explanation of what he was doing to his companions that they would have understood, and this would have obviously required a reasonably well-developed language.\nTo this extent Wade is therefore quite correct to claim that “religion” could not have developed without language, but participation in religious ritual has nothing whatever to do with commitment to truth or security against lying. The Konso believed that Waqa, the Sky God, sent rain, indeed that he almost was rain:\nWaqa irobini\n, “Waqa is raining” was a very common phrase I heard whenever rain fell. He was also believed to withhold rain from villages where there was too much quarrelling, and could strike dead those who lied under a sacred oath. But a crucial difference between the Konso and ourselves is that we are fundamentally aware of the possibility of\nunbelief\n, of the denial of anything beyond the purely material, so that the assertion of belief in God as true in our society is not like the belief of the Konso in Waqa. In their culture there is no real awareness of the possibility of not believing in Waqa, and his reality is simply taken for granted. When Wade says that “religious truths are accepted not as mere statements of fact but as sacred truths, something that it would be morally wrong to doubt” (ibid., 164) this may have some relevance to modern religion, but it has none to the forms of religion in primitive society.\nThe other selective advantage of religion, according to Wade, is that “It was then co-opted by the rulers of settled societies as a way of solidifying their authority and justifying their privileged position” (ibid., 164). The cynical ruler, smirking behind his hand at the simplicity of the peasants who thought him divine, is actually an invention of the Enlightenment.\nIn fact, in primitive society authority itself attracts sacred status, so that in the traditional society of the Tauade when a Big Man died his body would be put into a specially built enclosure which women were not allowed to enter. Pigs were then slaughtered inside the enclosure and the sacred bull-roarer was whirled, away from the gaze of the women. If enough boys were available they would be kept inside the enclosure in a little hut for several months where they could imbibe the vitality of the dead chief and were taught by adult men to be tough and aggressive. The Big Man’s corpse, meanwhile, had been put on a special platform in his hamlet where it was allowed to rot, and it was thought that people absorbed the powers of the Big Man in the smell. Big Men also had a special association with certain birds of prey and sacred oaks, and were believed to be essential for the general health and well being of the group. But these folk beliefs were certainly not “invented” by the Big Men to drum up support.",
  "tags": [
    "Excerpts"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-02T00:14:13+00:00"
}