{
  "url": "https://voxday.net/2018/10/29/godaddy-bans-gab/",
  "scraped_at": "2025-12-20T05:14:43.397826",
  "title": "GoDaddy bans Gab",
  "date_display": "October 29, 2018",
  "date_iso": "2018-10-29T10:49:24+00:00",
  "date_from_url": "2018-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Add GoDaddy to the list of corporations deplatforming Gab:</p><blockquote class=\"tr_bq\"><p>Gab, the far-right social network that the suspect in Saturday’s mass shooting at Pittsburgh synagogue used to share anti-Semitic posts, has gone offline after GoDaddy gave it 24 hours to find a new domain provider. GoDaddy’s decision comes after PayPal, Medium, Stripe, and Joyent banned Gab’s accounts over the weekend.</p></blockquote><p>I’m not going to pretend that I don’t find this extremely amusing, or that I did not anticipate this result when Andrew Torba refused to remove libel, pornography, and fake rape photoshops from his site at my request. As I said more than a year ago, Torba lacks the temperament and the detachment required to run a company, particularly in testing times such as these. But the Gab deplatforming is merely a minor symptom of the real problem, which has been decades in the making.</p><p>As I mentioned <a href=\"https://youtu.be/sLlw4pMDohg\">in the Darkstream</a> last night, what these corporations are doing is literally destroying the basis for a developed economy. And not only what they are doing now, but what they have been in the process of doing for the past 15 years. The EULAs, the Terms of Service, and the selling of software of a service, and the SJW convergence have all collectively routed around the rule of law which is necessary for sustained economic growth over time.</p><blockquote><p>In countries with strong rule of law:</p><p>1. Property rights over land, equipment, and personal items are clear and protected by law.<br>3. Contracts between people, businesses, and the government are effectively enforced by the legal system.<br>3. Political accountability is high and corruption is low.<br>4. Business regulations are clear and enforced in a transparent manner.</br></br></br></p><p>In such environments people make long-term investments and build large organizations. In contrast, if the property rights and contracts are not enforced and the business regulations are not clear, most of the economy consists of small family owned firms with little modern equipment. A high-tech, prosperous economy would not develop.</p></blockquote><p>Effectively, there are no contracts anymore in the digital economy. There is no predictability anymore. There is no accountability. There is no responsibility. There are no requirements for performance anymore. In sum, the US digital economy is rapidly becoming the equivalent of a third-world economy, complete with crony capitalism and digital robber barons.</p></div>",
  "content_text": "Add GoDaddy to the list of corporations deplatforming Gab:\nGab, the far-right social network that the suspect in Saturday’s mass shooting at Pittsburgh synagogue used to share anti-Semitic posts, has gone offline after GoDaddy gave it 24 hours to find a new domain provider. GoDaddy’s decision comes after PayPal, Medium, Stripe, and Joyent banned Gab’s accounts over the weekend.\nI’m not going to pretend that I don’t find this extremely amusing, or that I did not anticipate this result when Andrew Torba refused to remove libel, pornography, and fake rape photoshops from his site at my request. As I said more than a year ago, Torba lacks the temperament and the detachment required to run a company, particularly in testing times such as these. But the Gab deplatforming is merely a minor symptom of the real problem, which has been decades in the making.\nAs I mentioned\nin the Darkstream\nlast night, what these corporations are doing is literally destroying the basis for a developed economy. And not only what they are doing now, but what they have been in the process of doing for the past 15 years. The EULAs, the Terms of Service, and the selling of software of a service, and the SJW convergence have all collectively routed around the rule of law which is necessary for sustained economic growth over time.\nIn countries with strong rule of law:\n1. Property rights over land, equipment, and personal items are clear and protected by law.\n3. Contracts between people, businesses, and the government are effectively enforced by the legal system.\n3. Political accountability is high and corruption is low.\n4. Business regulations are clear and enforced in a transparent manner.\nIn such environments people make long-term investments and build large organizations. In contrast, if the property rights and contracts are not enforced and the business regulations are not clear, most of the economy consists of small family owned firms with little modern equipment. A high-tech, prosperous economy would not develop.\nEffectively, there are no contracts anymore in the digital economy. There is no predictability anymore. There is no accountability. There is no responsibility. There are no requirements for performance anymore. In sum, the US digital economy is rapidly becoming the equivalent of a third-world economy, complete with crony capitalism and digital robber barons.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-29T10:49:24+00:00"
}