{
  "url": "https://voxday.net/2018/10/03/gun-ghoul-comicsgate-and-copyright/",
  "scraped_at": "2025-12-20T05:11:09.090703",
  "title": "Gun Ghoul, ComicsGate, and copyright",
  "date_display": "October 3, 2018",
  "date_iso": "2018-10-03T17:00:06+00:00",
  "date_from_url": "2018-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bounding Into Comics covers <a href=\"https://boundingintocomics.com/2018/10/03/amazon-takes-down-then-restores-will-caligans-gun-ghoul-cites-copyright-infringement/\">the mysterious case of four titles being blocked</a> at Amazon last month:</p><blockquote><p>Amazon recently took down Dark Legion Comics and Will Caligan’s <i>Gun Ghoul</i> issues. All four issues were blocked from Amazon’s store and unavailable to customers for a little over week. This block specifically applied to digital editions of the books. Print editions were not affected.</p><p>Amazon claimed the books might have had a possible copyright infringement. However, upon further review they discovered there was no copyright infringement and the books were once again available to be purchased.</p><p>This isn’t the first time that one of Vox Day’s publishing companies has had their books removed from Amazon. Vox Day tells us that Johan Kalsi’s <i>Corrosion </i>was unpublished multiple times when it was released in 2017. At the same time <i>Gun Ghoul</i> was taken down, Amazon also removed <i>Corrosion </i>from their store citing misleading information. However, that book has also been restored and is now available on Amazon.</p></blockquote><p>If you’re targeted by SJWs, you have to expect there will inevitably be shenanigans. Don’t freak out, don’t worry, don’t be surprised, and don’t lose your temper. Often, upon investigation, the SJW will turn out to have crossed a line and even the most SJW-amenable authority will force them to retreat.</p></div>",
  "content_text": "Bounding Into Comics covers\nthe mysterious case of four titles being blocked\nat Amazon last month:\nAmazon recently took down Dark Legion Comics and Will Caligan’s\nGun Ghoul\nissues. All four issues were blocked from Amazon’s store and unavailable to customers for a little over week. This block specifically applied to digital editions of the books. Print editions were not affected.\nAmazon claimed the books might have had a possible copyright infringement. However, upon further review they discovered there was no copyright infringement and the books were once again available to be purchased.\nThis isn’t the first time that one of Vox Day’s publishing companies has had their books removed from Amazon. Vox Day tells us that Johan Kalsi’s\nCorrosion\nwas unpublished multiple times when it was released in 2017. At the same time\nGun Ghoul\nwas taken down, Amazon also removed\nCorrosion\nfrom their store citing misleading information. However, that book has also been restored and is now available on Amazon.\nIf you’re targeted by SJWs, you have to expect there will inevitably be shenanigans. Don’t freak out, don’t worry, don’t be surprised, and don’t lose your temper. Often, upon investigation, the SJW will turn out to have crossed a line and even the most SJW-amenable authority will force them to retreat.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-03T16:00:06+00:00"
}