{
  "url": "https://voxday.net/2018/10/09/how-to-lose-an-argument/",
  "scraped_at": "2025-12-20T05:11:59.817557",
  "title": "How to Lose an Argument",
  "date_display": "October 9, 2018",
  "date_iso": "2018-10-09T10:54:11+00:00",
  "date_from_url": "2018-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://pbs.twimg.com/media/Do8hIoBXgAAjE_4.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"565\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://pbs.twimg.com/media/Do8hIoBXgAAjE_4.jpg\" width=\"282\"/></a>By Ben Shapiro. Code Pink’s National Director <a href=\"https://twitter.com/Keque_Mage/status/1048011118461898752\">shows how easy it is</a> to rattle Ben Shapiro and completely shut him down. The rampant hypocrisy in his contradictory approach towards his nation-state and towards the USA leaves him with an easy weakness that anyone can easily exploit. It’s also clear that both the Left and the Right have increasingly had it with all the Israel First activists in the US media. There is a very hard line between<i> supporting Israel</i> and <i>supporting Israel at the expense of America</i>, and Ben Shapiro is one of many in the US media who is observably on the wrong side of it.</p><p>It’s also a good example of how rhetoric trumps dialectic. “Apartheid Israel” is a rhetorical kill shot. Sure, one can make a reasonable dialectical argument that Israel is not an apartheid state according to the technical definition of the series of laws that were collectively known as the historical South African policy of apartheid from 1948 to 1994. But the very effectiveness of the kill shot indicates that whether the charge is technically true or not, the rhetoric tends to point towards the truth of the situation, especially since Israel has the legal equivalent of South Africa’s Prohibition of Mixed Marriages Act of 1949, which was the first apartheid law, as well as a milder religious version of the Population Registration Act of 1950.</p><p>For example, the Code Pink woman could have easily pointed out that Israel observably practices religious apartheid, as the Supreme Court of Israel has ruled that even Jews or the descendants of Jews that actively practice any religion other than Judaism are not entitled to immigrate to Israel. The point is that it is relatively easy to expose even the smoothest, most-practiced wormtongues with sufficient mastery of rhetoric and dialectic combined with an awareness of their customary deceits and inconsistencies.</p></div>",
  "content_text": "By Ben Shapiro. Code Pink’s National Director\nshows how easy it is\nto rattle Ben Shapiro and completely shut him down. The rampant hypocrisy in his contradictory approach towards his nation-state and towards the USA leaves him with an easy weakness that anyone can easily exploit. It’s also clear that both the Left and the Right have increasingly had it with all the Israel First activists in the US media. There is a very hard line between\nsupporting Israel\nand\nsupporting Israel at the expense of America\n, and Ben Shapiro is one of many in the US media who is observably on the wrong side of it.\nIt’s also a good example of how rhetoric trumps dialectic. “Apartheid Israel” is a rhetorical kill shot. Sure, one can make a reasonable dialectical argument that Israel is not an apartheid state according to the technical definition of the series of laws that were collectively known as the historical South African policy of apartheid from 1948 to 1994. But the very effectiveness of the kill shot indicates that whether the charge is technically true or not, the rhetoric tends to point towards the truth of the situation, especially since Israel has the legal equivalent of South Africa’s Prohibition of Mixed Marriages Act of 1949, which was the first apartheid law, as well as a milder religious version of the Population Registration Act of 1950.\nFor example, the Code Pink woman could have easily pointed out that Israel observably practices religious apartheid, as the Supreme Court of Israel has ruled that even Jews or the descendants of Jews that actively practice any religion other than Judaism are not entitled to immigrate to Israel. The point is that it is relatively easy to expose even the smoothest, most-practiced wormtongues with sufficient mastery of rhetoric and dialectic combined with an awareness of their customary deceits and inconsistencies.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-09T09:54:11+00:00"
}