{
  "url": "https://voxday.net/2018/10/11/interview-with-bleeding-cool/",
  "scraped_at": "2025-12-20T05:12:17.357144",
  "title": "Interview with Bleeding Cool",
  "date_display": "October 11, 2018",
  "date_iso": "2018-10-11T12:15:53+00:00",
  "date_from_url": "2018-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over the last few weeks, I was interviewed extensively by Mark Siefert and Rich Johnston of Bleeding Cool, the comics media site. It is quite literally the longest, most thorough interview I have ever read, much less participated in on either side. Bleeding Cool posted <a href=\"https://www.bleedingcool.com/2018/10/10/vox-day-altered-states-of-america/\">the entire interview almost entirely verbatim</a>, including the follow-up questions and answers. It is precisely 767 percent more honest and fair than the NPR hit piece was, and demonstrates rather clearly how the Internet media puts the mainstream media to journalistic shame.</p><p>This doesn’t mean either Siefert or Johnston agree with me at all about anything. They very clearly don’t, for the most part. But they recognize that Arkhaven and Dark Legion have successfully established themselves in the comics space and that it makes no sense to simply pretend that we don’t exist. Beyond that, they observably understand that the customary SJW response is not only ineffectual, but serves to add considerable fuel to the fire that motivates us and our supporters.</p><p>In some ways it’s a debate as well as an interview; while I could offer a few objections to some of his corrections to my answers, there is little point in going down those rabbit holes. For example, I don’t view Marvel’s denial of its director of content and character development Sana Amanat’s connection to the Clinton Foundation to be conclusive or convincing given the direct relationships between the foundation, her cousin, and her two brothers. But given the in-depth investigation they clearly did into my family and heritage – which was very interesting as I previously knew nothing about my historically significant Irish ancestor – they doubtless have the ability to dig considerably deeper into that situation if they wish to do so.</p><p>But it is <a href=\"https://www.bleedingcool.com/2018/10/10/vox-day-altered-states-of-america/\">a fair, detailed, and extremely informative interview</a>, which I suspect a number of people on both sides of the ideological spectrum will enjoy reading. I expect a fair number of SJWs will be outraged by the fact that Bleeding Cool acknowledged my existence at all, and when they did, failed to devote the entire interview to angrily denouncing NAZICOMICSHATE, but then, birds will fly and fish will swim too.</p><blockquote><p>We no longer live in a world where we can mutually pretend that our comics don’t contain politics so we don’t have to argue about it. Politics covers everything like a rash you want to scratch even though you know that’ll make it worse. Comics are no longer a brotherhood beyond politics, and fandom is no longer sacred ground.</p><p>Vox Day has played a role in creating that world, in my opinion (which he disputes to a substantial degree in the interview below, for the record), and has also published books that I dislike, and things that are intentionally antagonistic. On the book and comics publishing front, that doesn’t bother me, at all. Have at it. It is a legitimate function of art to be disagreeable, to inspire dislike and even anger.</p><p>Because comics can in fact be dangerous, very many publishers in our history have faced struggles for distribution and placement on newstands or in stores. Day has stated that he’s had some inexplicable issues with selling his comics on Amazon. If that’s true, it’s wrong. Any distributor or retailer can refuse to carry a comic for any reason (a concept that I am personally very familiar with), and that’s perfectly fine too. But if there’s any third party or rogue employee interfering with Castalia House books or comics from being sold at Amazon when those comics are salable according to standard policies, not only are you in the wrong, but you’re also helping Vox Day, not hurting him. You’re giving him and his followers something to fight.</p><p>You won’t convince anyone that Vox Day’s politics and opinions are wrong by restricting his followers’ ability to buy his comics. Quite to the contrary. Attempting to win by restricting the publication of information (note that this is a different thing than controlling the flow of information that you yourself consume) does not put one in particularly enviable company. That’s not how to win any modern conflict, let alone a conflict based on information… which is all of them now.</p><p>I’d much rather be reading the <i>There Will Be War</i> series than discussing Vox Day’s politics. Or writing that post about Luis Senarens that I mentioned earlier. But politics are the core of who Vox Day is and what he talks about — for the moment — so let’s go….</p><p><b>Bleeding Cool:</b> I want to start off with something that’s come up in connection to Comicsgate and events that have spun out of your disagreements with Ethan Van Sciver. Comicsgaters often say they want politics out of comics. At its core, the idea that people want comics to be escapist entertainment certainly isn’t objectionable. But you recently noted:</p><p><i>“Second, comics have always had political and ideological elements to them; the core problem with what the SJWs are doing in comics is less about how they are inserting their lunatic politics into the comics and more about the way in which they are ideologically policing who is permitted to produce and publish comics at Marvel, DC, Image, IDW, and other comics publishers.”</i></p><p>Is it possible to create superhero comics without political elements? Is “with great power comes great responsibility” a political statement?</p><p><b>Vox Day: </b>Yes, it is possible to create superhero comics without political elements, but one will end up with a limited range of stories that are intrinsically unrealistic. After all, there is no way that the governments and militaries of the world would simply ignore the increased power that superheroes could offer them. “With great power comes great responsibility” is not a political statement, it is a moral statement. And it is not possible to create superhero comics without moral elements.</p></blockquote><p>Read the whole novella-sized article, entitled <a href=\"https://www.bleedingcool.com/2018/10/10/vox-day-altered-states-of-america/\" style=\"font-style: italic;\">Vox Day: Altered States of America</a>, there.</p><p>Also, speaking of Arkhaven Comics and Chuck Dixon, I’m happy to report that <b><i><a href=\"https://aerbook.com/maker/productcard-4091242-1875.html\">CHUCK DIXON’S AVALON #2: RULEBREAKER</a></i></b>, is now available in a gold logo edition from Arkhaven Direct, this time complete with dialogue. We’re working on getting replacement issues out to those who received what we shall euphemistically describe as “silent collector’s editions”.</p><p>UPDATE: The initial response <a href=\"https://twitter.com/bleedingcool/status/1050203404566482945\">on Twitter</a> is, of course, entirely surprising to absolutely no one.</p><blockquote class=\"tr_bq\"><p>Smack Talk Showdown@SmackTalkShwdwn<br>This is disgusting. Why give this hate monger a platform?</br></p></blockquote></div>",
  "content_text": "Over the last few weeks, I was interviewed extensively by Mark Siefert and Rich Johnston of Bleeding Cool, the comics media site. It is quite literally the longest, most thorough interview I have ever read, much less participated in on either side. Bleeding Cool posted\nthe entire interview almost entirely verbatim\n, including the follow-up questions and answers. It is precisely 767 percent more honest and fair than the NPR hit piece was, and demonstrates rather clearly how the Internet media puts the mainstream media to journalistic shame.\nThis doesn’t mean either Siefert or Johnston agree with me at all about anything. They very clearly don’t, for the most part. But they recognize that Arkhaven and Dark Legion have successfully established themselves in the comics space and that it makes no sense to simply pretend that we don’t exist. Beyond that, they observably understand that the customary SJW response is not only ineffectual, but serves to add considerable fuel to the fire that motivates us and our supporters.\nIn some ways it’s a debate as well as an interview; while I could offer a few objections to some of his corrections to my answers, there is little point in going down those rabbit holes. For example, I don’t view Marvel’s denial of its director of content and character development Sana Amanat’s connection to the Clinton Foundation to be conclusive or convincing given the direct relationships between the foundation, her cousin, and her two brothers. But given the in-depth investigation they clearly did into my family and heritage – which was very interesting as I previously knew nothing about my historically significant Irish ancestor – they doubtless have the ability to dig considerably deeper into that situation if they wish to do so.\nBut it is\na fair, detailed, and extremely informative interview\n, which I suspect a number of people on both sides of the ideological spectrum will enjoy reading. I expect a fair number of SJWs will be outraged by the fact that Bleeding Cool acknowledged my existence at all, and when they did, failed to devote the entire interview to angrily denouncing NAZICOMICSHATE, but then, birds will fly and fish will swim too.\nWe no longer live in a world where we can mutually pretend that our comics don’t contain politics so we don’t have to argue about it. Politics covers everything like a rash you want to scratch even though you know that’ll make it worse. Comics are no longer a brotherhood beyond politics, and fandom is no longer sacred ground.\nVox Day has played a role in creating that world, in my opinion (which he disputes to a substantial degree in the interview below, for the record), and has also published books that I dislike, and things that are intentionally antagonistic. On the book and comics publishing front, that doesn’t bother me, at all. Have at it. It is a legitimate function of art to be disagreeable, to inspire dislike and even anger.\nBecause comics can in fact be dangerous, very many publishers in our history have faced struggles for distribution and placement on newstands or in stores. Day has stated that he’s had some inexplicable issues with selling his comics on Amazon. If that’s true, it’s wrong. Any distributor or retailer can refuse to carry a comic for any reason (a concept that I am personally very familiar with), and that’s perfectly fine too. But if there’s any third party or rogue employee interfering with Castalia House books or comics from being sold at Amazon when those comics are salable according to standard policies, not only are you in the wrong, but you’re also helping Vox Day, not hurting him. You’re giving him and his followers something to fight.\nYou won’t convince anyone that Vox Day’s politics and opinions are wrong by restricting his followers’ ability to buy his comics. Quite to the contrary. Attempting to win by restricting the publication of information (note that this is a different thing than controlling the flow of information that you yourself consume) does not put one in particularly enviable company. That’s not how to win any modern conflict, let alone a conflict based on information… which is all of them now.\nI’d much rather be reading the\nThere Will Be War\nseries than discussing Vox Day’s politics. Or writing that post about Luis Senarens that I mentioned earlier. But politics are the core of who Vox Day is and what he talks about — for the moment — so let’s go….\nBleeding Cool:\nI want to start off with something that’s come up in connection to Comicsgate and events that have spun out of your disagreements with Ethan Van Sciver. Comicsgaters often say they want politics out of comics. At its core, the idea that people want comics to be escapist entertainment certainly isn’t objectionable. But you recently noted:\n“Second, comics have always had political and ideological elements to them; the core problem with what the SJWs are doing in comics is less about how they are inserting their lunatic politics into the comics and more about the way in which they are ideologically policing who is permitted to produce and publish comics at Marvel, DC, Image, IDW, and other comics publishers.”\nIs it possible to create superhero comics without political elements? Is “with great power comes great responsibility” a political statement?\nVox Day:\nYes, it is possible to create superhero comics without political elements, but one will end up with a limited range of stories that are intrinsically unrealistic. After all, there is no way that the governments and militaries of the world would simply ignore the increased power that superheroes could offer them. “With great power comes great responsibility” is not a political statement, it is a moral statement. And it is not possible to create superhero comics without moral elements.\nRead the whole novella-sized article, entitled\nVox Day: Altered States of America\n, there.\nAlso, speaking of Arkhaven Comics and Chuck Dixon, I’m happy to report that\nCHUCK DIXON’S AVALON #2: RULEBREAKER\n, is now available in a gold logo edition from Arkhaven Direct, this time complete with dialogue. We’re working on getting replacement issues out to those who received what we shall euphemistically describe as “silent collector’s editions”.\nUPDATE: The initial response\non Twitter\nis, of course, entirely surprising to absolutely no one.\nSmack Talk Showdown@SmackTalkShwdwn\nThis is disgusting. Why give this hate monger a platform?",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-11T11:15:53+00:00"
}