{
  "url": "https://voxday.net/2018/10/06/jordan-peterson-kneecaps-his-defenders/",
  "scraped_at": "2025-12-20T05:11:34.207845",
  "title": "Jordan Peterson kneecaps his defenders",
  "date_display": "October 6, 2018",
  "date_iso": "2018-10-06T12:00:05+00:00",
  "date_from_url": "2018-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peterson’s cultists really are desperate.<i> It was a joke. He’s being sarcastic. I think he’s waxing ironic. he has to be joking. He’s drunk tweeting. I’m hoping @jordanbpeterson is drunk posting tonight. Did he really mean it?</i><br><i><br/></i>And my favorite:<i> It’s the scurvy talking.</i></br></p><p>But no, Crazy Christ wasn’t “being sarcastic” when he suggested that Kavanaugh step down if confirmed.</p><blockquote><p>Jordan B Peterson@jordanbpeterson<br>If confirmed Kavanaugh should step down.</br></p><p>Jordan B Peterson@jordanbpeterson<br>I’m not certain that is the right move. It’s very complex. But he would have his name cleared, and a figure who might be less divisive might be put forward.</br></p></blockquote><p>This episode has not only demonstrated that Jordan Peterson is NOT on our side, it has shown that a) his defenders are clueless cultists who simply refuse to accept the truth about him, and, b) Jordan Peterson is a complete ignoramus when it comes to American politics.</p><p>First, Supreme Court Justice-to-be Kavanaugh would not have his name cleared. Just ask Robert Bork or Richard Nixon. Second, the God-Emperor Donald Trump would not respond by putting forward someone less divisive, he would absolutely name someone he could trust not to betray him by stepping down after all the hard work was done, someone who is a fire-breather that would make Kavanaugh look like a cuddly teddy bear in comparison.</p><p>Which is to say, someone considerably MORE divisive.</p><p>I am genuinely curious to see what sort of excuse the Jordanetics cultists will provide next for their hero. Especially since he is such a shameless and transparent liar.</p><blockquote class=\"tr_bq\"><p>I have a habit of not preparing my talks until really the last minute, and I mean that’s not exactly true, because I’ve been thinking about what I’m going to talk to you about tonight for a very long time, but <b>I, I </b>really only got the title for this talk firmly in place about half an hour ago. <b>And, and</b> one of the things I like to do when I’m speaking to people is to tell them what I’m thinking about, not what I’ve already thought about, you know, and certainly not what I know, but what I’m thinking about, what I’m trying to figure out.</p></blockquote><p>It’s strange, then, that he so often happens to say the same things over and over and over again. Does he never manage to figure anything out? Notice again how he advertises when he’s about to lie. Many people, me included, repeat words or even stutter, but I’ve noticed that Peterson tends to primarily do it when he’s about to say something he knows to be false.</p><p>I will admit that I found Stefan’s puzzled reaction to Peterson’s original tweet to be mildly amusing. Surely there must be some kind of <i>context </i>in which the Crazy Christ didn’t actually <i>mean </i>what he quite clearly wrote!</p><blockquote><p>@StefanMolyneux<br>I find this bafflingly incomprehensible. Appease disproven accusers? Can anyone help me with context?</br></p><p>@ButMuhRussia<br>Vox told you, Stefan. You just didn’t listen.</br></p><p>@CovfefusMaximus<br>Context: Peterson is a fraud, exposed by Vox Day months ago</br></p><p>@ProgenyOfEurope<br>Context: he is an intellectual fraud.</br></p></blockquote><p>Just to be clear, I have no problem whatsoever with Stefan. He owes me nothing and we get along fine. He’s neither the first nor last intelligent individual to be taken in by Peterson’s bafflegarble. As far as I can tell, Milo is about the only one to have seen through Peterson as quickly as I did, even though he was considerably more polite about it. Although it would appear Mike Cernovich has now too:</p><p><i>Professor Peterson: Have you resigned your position in an effort to appease the hate mob that targeted you? That would clear your name, yes? </i></p></div>",
  "content_text": "Peterson’s cultists really are desperate.\nIt was a joke. He’s being sarcastic. I think he’s waxing ironic. he has to be joking. He’s drunk tweeting. I’m hoping @jordanbpeterson is drunk posting tonight. Did he really mean it?\nAnd my favorite:\nIt’s the scurvy talking.\nBut no, Crazy Christ wasn’t “being sarcastic” when he suggested that Kavanaugh step down if confirmed.\nJordan B Peterson@jordanbpeterson\nIf confirmed Kavanaugh should step down.\nJordan B Peterson@jordanbpeterson\nI’m not certain that is the right move. It’s very complex. But he would have his name cleared, and a figure who might be less divisive might be put forward.\nThis episode has not only demonstrated that Jordan Peterson is NOT on our side, it has shown that a) his defenders are clueless cultists who simply refuse to accept the truth about him, and, b) Jordan Peterson is a complete ignoramus when it comes to American politics.\nFirst, Supreme Court Justice-to-be Kavanaugh would not have his name cleared. Just ask Robert Bork or Richard Nixon. Second, the God-Emperor Donald Trump would not respond by putting forward someone less divisive, he would absolutely name someone he could trust not to betray him by stepping down after all the hard work was done, someone who is a fire-breather that would make Kavanaugh look like a cuddly teddy bear in comparison.\nWhich is to say, someone considerably MORE divisive.\nI am genuinely curious to see what sort of excuse the Jordanetics cultists will provide next for their hero. Especially since he is such a shameless and transparent liar.\nI have a habit of not preparing my talks until really the last minute, and I mean that’s not exactly true, because I’ve been thinking about what I’m going to talk to you about tonight for a very long time, but\nI, I\nreally only got the title for this talk firmly in place about half an hour ago.\nAnd, and\none of the things I like to do when I’m speaking to people is to tell them what I’m thinking about, not what I’ve already thought about, you know, and certainly not what I know, but what I’m thinking about, what I’m trying to figure out.\nIt’s strange, then, that he so often happens to say the same things over and over and over again. Does he never manage to figure anything out? Notice again how he advertises when he’s about to lie. Many people, me included, repeat words or even stutter, but I’ve noticed that Peterson tends to primarily do it when he’s about to say something he knows to be false.\nI will admit that I found Stefan’s puzzled reaction to Peterson’s original tweet to be mildly amusing. Surely there must be some kind of\ncontext\nin which the Crazy Christ didn’t actually\nmean\nwhat he quite clearly wrote!\n@StefanMolyneux\nI find this bafflingly incomprehensible. Appease disproven accusers? Can anyone help me with context?\n@ButMuhRussia\nVox told you, Stefan. You just didn’t listen.\n@CovfefusMaximus\nContext: Peterson is a fraud, exposed by Vox Day months ago\n@ProgenyOfEurope\nContext: he is an intellectual fraud.\nJust to be clear, I have no problem whatsoever with Stefan. He owes me nothing and we get along fine. He’s neither the first nor last intelligent individual to be taken in by Peterson’s bafflegarble. As far as I can tell, Milo is about the only one to have seen through Peterson as quickly as I did, even though he was considerably more polite about it. Although it would appear Mike Cernovich has now too:\nProfessor Peterson: Have you resigned your position in an effort to appease the hate mob that targeted you? That would clear your name, yes?",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-06T11:00:05+00:00"
}