{
  "url": "https://voxday.net/2018/10/06/mailvox-double-down-at-your-own-risk/",
  "scraped_at": "2025-12-20T05:11:32.707718",
  "title": "Mailvox: double down at your own risk",
  "date_display": "October 6, 2018",
  "date_iso": "2018-10-06T10:16:44+00:00",
  "date_from_url": "2018-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lovekraft is whining because he refuses to accept that stubbornly standing by a false position and doubling down on it is never, ever, going to receive anything but open contempt from me.</p><blockquote><p>Your ego is getting the better of you. One post you say you encourage discussion, the next you come across as a complete prick.</p><p>Make up your mind asshole.</p><p>I am one of your long-time followers and supporters. Hopefully others here will see what their so-called mentor thinks of them.</p></blockquote><p>First, this has nothing to do with my ego. And trying to make the subject about me would make Lovekraft liable for a permanent ban even if he wasn’t reduced to namecalling.</p><p>Second, I encourage intelligent discussion, not butthurt babbling from people who suggest something, have their suggestions shot down, then repeatedly insist that their suggestions are too valuable without being able to offer the slightest bit of evidence in support of their position.</p><p>I was asked “is calling an SJW a social justice terrorist good rhetoric?” The answer was: no, it is terrible and ineffective rhetoric. “Social Justice Terrorist” is, just like “Social Justice Crybaby” and “Social Justice Whiner”, inept rhetoric of the sort produced by those who simply don’t understand the basics of Aristotelian rhetoric and dialectic. Lovekraft even attempted to claim that “Social Justice Terrorist” isn’t meant to serve as a rhetorical pejorative attacking the Extreme Left, but rather, as a rhetorical persuasive aimed at the Center, that “its effectiveness may lie in converting the normies.”</p><p>It does nothing of the sort. How, precisely, is that going to work? What emotion is “Social Justice Terrorist” supposed to trigger in the centrist, and of what is that emotion going to persuade the sort of people who can’t even be convinced that Antifa dressing in black masks, setting cars on fire, and physically beating people up in public are a genuine threat to the body politic?</p><p>Third, there is no conflict between a) encouraging intelligent discussion and b) coming off as a complete prick. Fourth, I don’t give a quantum of a fraction of a sliver of a damn if I come off as a complete prick. The comments are there because the readers requested them, not because I wanted to be subjected to a daily dose of foolish questions, idiotic assertions, gamma posturings, personal attacks, trolls, buffoons, attention seekers, and psychologically troubled individuals working out their issues in public. I put up with the comments, I engage with the comments, I even occasionally derive value from the comments but never, ever, make the mistake of thinking that they are an integral aspect of this blog.</p><p>Fifth, if I have to make up my mind between encouraging discussion and modifying my offensive behavior, then I will shut down the comments so I don’t have to listen to any of the nonsense anymore. I walked away from both Alpha Game and my WND column without any ceremony or hesitation, does anyone truly believe I would never do the same here? Fortunately, as I have already pointed out, it is a false dichotomy and I do not need to make that choice.</p><p>Sixth, it is only because Lovekraft is a longtime follower and supporter that he’s not being banned for violating the Second Directive: <i>I am not the subject.</i> At the same time, as a longtime follower and supporter, he should know better. No matter how betrayed and butthurt you might feel, a commenter should have better self-control. Bitch about me all you like on Twitter or your own site, but you are not on equal ground here where I am both the lawmaker and chief enforcer.</p><p>Seventh, I am not a mentor. I have not agreed to mentor <i>anyone</i>. Everyone who reads this blog or any of the books I have written is perfectly free to take or leave the information provided there. If what I’ve written is useful to you, great. If you disagree with something I wrote, fine. Disagree all you like. But if you say something stupid <i>here</i>, there is a reasonable chance I will tell you that it is stupid. If you insist on behaving like a moron, there is a reasonable chance I will identify you as one. And if you want to reject everything I do and say, and with which I am involved, because I don’t look at you with sad paternal eyes, tell you you’re good enough just the way you are, and metaphorically hug you the way you wish your father would, well, Jordan Peterson is probably more your style anyhow.</p></div>",
  "content_text": "Lovekraft is whining because he refuses to accept that stubbornly standing by a false position and doubling down on it is never, ever, going to receive anything but open contempt from me.\nYour ego is getting the better of you. One post you say you encourage discussion, the next you come across as a complete prick.\nMake up your mind asshole.\nI am one of your long-time followers and supporters. Hopefully others here will see what their so-called mentor thinks of them.\nFirst, this has nothing to do with my ego. And trying to make the subject about me would make Lovekraft liable for a permanent ban even if he wasn’t reduced to namecalling.\nSecond, I encourage intelligent discussion, not butthurt babbling from people who suggest something, have their suggestions shot down, then repeatedly insist that their suggestions are too valuable without being able to offer the slightest bit of evidence in support of their position.\nI was asked “is calling an SJW a social justice terrorist good rhetoric?” The answer was: no, it is terrible and ineffective rhetoric. “Social Justice Terrorist” is, just like “Social Justice Crybaby” and “Social Justice Whiner”, inept rhetoric of the sort produced by those who simply don’t understand the basics of Aristotelian rhetoric and dialectic. Lovekraft even attempted to claim that “Social Justice Terrorist” isn’t meant to serve as a rhetorical pejorative attacking the Extreme Left, but rather, as a rhetorical persuasive aimed at the Center, that “its effectiveness may lie in converting the normies.”\nIt does nothing of the sort. How, precisely, is that going to work? What emotion is “Social Justice Terrorist” supposed to trigger in the centrist, and of what is that emotion going to persuade the sort of people who can’t even be convinced that Antifa dressing in black masks, setting cars on fire, and physically beating people up in public are a genuine threat to the body politic?\nThird, there is no conflict between a) encouraging intelligent discussion and b) coming off as a complete prick. Fourth, I don’t give a quantum of a fraction of a sliver of a damn if I come off as a complete prick. The comments are there because the readers requested them, not because I wanted to be subjected to a daily dose of foolish questions, idiotic assertions, gamma posturings, personal attacks, trolls, buffoons, attention seekers, and psychologically troubled individuals working out their issues in public. I put up with the comments, I engage with the comments, I even occasionally derive value from the comments but never, ever, make the mistake of thinking that they are an integral aspect of this blog.\nFifth, if I have to make up my mind between encouraging discussion and modifying my offensive behavior, then I will shut down the comments so I don’t have to listen to any of the nonsense anymore. I walked away from both Alpha Game and my WND column without any ceremony or hesitation, does anyone truly believe I would never do the same here? Fortunately, as I have already pointed out, it is a false dichotomy and I do not need to make that choice.\nSixth, it is only because Lovekraft is a longtime follower and supporter that he’s not being banned for violating the Second Directive:\nI am not the subject.\nAt the same time, as a longtime follower and supporter, he should know better. No matter how betrayed and butthurt you might feel, a commenter should have better self-control. Bitch about me all you like on Twitter or your own site, but you are not on equal ground here where I am both the lawmaker and chief enforcer.\nSeventh, I am not a mentor. I have not agreed to mentor\nanyone\n. Everyone who reads this blog or any of the books I have written is perfectly free to take or leave the information provided there. If what I’ve written is useful to you, great. If you disagree with something I wrote, fine. Disagree all you like. But if you say something stupid\nhere\n, there is a reasonable chance I will tell you that it is stupid. If you insist on behaving like a moron, there is a reasonable chance I will identify you as one. And if you want to reject everything I do and say, and with which I am involved, because I don’t look at you with sad paternal eyes, tell you you’re good enough just the way you are, and metaphorically hug you the way you wish your father would, well, Jordan Peterson is probably more your style anyhow.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-06T09:16:44+00:00"
}