{
  "url": "https://voxday.net/2018/10/29/mailvox-fight-the-good-fight/",
  "scraped_at": "2025-12-20T05:14:45.211019",
  "title": "Mailvox: Fight the good fight",
  "date_display": "October 29, 2018",
  "date_iso": "2018-10-29T15:00:02+00:00",
  "date_from_url": "2018-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Christian reader shares his experience of returning to his converged home church:</p><blockquote><p>I wanted to drop a note and let you know what a comfort your postings on what is happening in the church have been to me. My wife and I recently rejoined the church I grew up in and am just now realizing how bad the necrosis actually is. This church has been a community bulwark for over 150 years but over the last decade has succumbed to the conciliatory vacuousness of SJWs in the exact sequence of events you frequently describe. I can’t imagine they will even be able to stomach proclaiming the narrow path of salvation or deity of Christ five years from now.</p><p>Your posts are like receiving an explicit diagnosis for the rare disease no one has been able to diagnose for years. I pray it is not too late to effect an intervention of some sort. I think it is safe to assume your occasional thoughts on this matter are greatly appreciated by many like me.</p></blockquote><p>Remember, we <i>will </i>win the war. But we’re going to lose more than few battles along the way. The important thing is to never submit and never stop getting back up again. We’re the special forces operating in enemy territory, undertaking the mission in the supreme confidence that our Commander will launch the orbital artillery and send in the space marines at the precise moment He deems right.</p><p>If you want to understand that exact sequence of events he describes, read <i><b><a href=\"https://aerbook.com/maker/productcard-3528271-1875.html\">SJWs Always Double Down</a></b></i>. It’s all in there.</p></div>",
  "content_text": "A Christian reader shares his experience of returning to his converged home church:\nI wanted to drop a note and let you know what a comfort your postings on what is happening in the church have been to me. My wife and I recently rejoined the church I grew up in and am just now realizing how bad the necrosis actually is. This church has been a community bulwark for over 150 years but over the last decade has succumbed to the conciliatory vacuousness of SJWs in the exact sequence of events you frequently describe. I can’t imagine they will even be able to stomach proclaiming the narrow path of salvation or deity of Christ five years from now.\nYour posts are like receiving an explicit diagnosis for the rare disease no one has been able to diagnose for years. I pray it is not too late to effect an intervention of some sort. I think it is safe to assume your occasional thoughts on this matter are greatly appreciated by many like me.\nRemember, we\nwill\nwin the war. But we’re going to lose more than few battles along the way. The important thing is to never submit and never stop getting back up again. We’re the special forces operating in enemy territory, undertaking the mission in the supreme confidence that our Commander will launch the orbital artillery and send in the space marines at the precise moment He deems right.\nIf you want to understand that exact sequence of events he describes, read\nSJWs Always Double Down\n. It’s all in there.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-29T15:00:02+00:00"
}