{
  "url": "https://voxday.net/2018/10/03/moira-is-telling-the-truth/",
  "scraped_at": "2025-12-20T05:11:07.237758",
  "title": "Moira is telling the truth",
  "date_display": "October 3, 2018",
  "date_iso": "2018-10-03T15:00:00+00:00",
  "date_from_url": "2018-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A witness to the abuses committed by Walter Breen, Marion Zimmer Bradley, and their evil coterie of sex criminals backs up the events chronicled by Moira Greyland in <a href=\"https://aerbook.com/maker/productcard-3769832-1875.html\" style=\"font-style: italic; font-weight: bold;\">The Last Closet</a> in an email sent to Moira.</p><blockquote><p>I remember reading <i>Mists of Avalon</i> when it came out, and it was already known by all the kids what your family did. I remember lots of us kids reading that book in context, because we knew and were creeped out… I remember one thing about it that was ugly was that “a bunch of this is about being really mean to Dorothy”.</p><p>We didn’t like that about it. I remember wanting to tell authorities of some kind. The kids made damn sure I didn’t do that- they were afraid they’d be in trouble because they seduced these adults and got drugs from them.</p><p>The big thing was, that if we told, then you and your brother would end up in foster. The kids involved sexually and otherwise swore that they didn’t do this to their own kids, just other people’s, so it would be hurting you for no good reason. They didn’t think they were a good enough reason.</p><p>It’s all so sad, with that regret as far as I go. I could have told but absolutely nobody would have backed me up – I wasn’t “in it”, so I was useless as any sort of witness. I swear to anyone that disbelieves Moira, for whatever reason, that the scenario she speaks about is absolutely true, it really did happen, with a ton of people involved.</p><p>I can’t vouch for details, I wasn’t involved. Although I  came close. I was put in uncomfortable sexual situations with the Breens and pals. I chickened out and and threatened to tell. Telling was NOT welcome, to say the least. I know many who did not chicken out, and even made fun of those who did. The kids being preyed on were more “grown up”, more cool, and in the scene.</p><p>Moira is telling the truth.</p></blockquote><p>Keep this in mind if you ever find yourself thinking that reconciliation, negotiation, and compromise is a viable option, or that the situation isn’t actually worse than the conspiracy theorists tell you.</p></div>",
  "content_text": "A witness to the abuses committed by Walter Breen, Marion Zimmer Bradley, and their evil coterie of sex criminals backs up the events chronicled by Moira Greyland in\nThe Last Closet\nin an email sent to Moira.\nI remember reading\nMists of Avalon\nwhen it came out, and it was already known by all the kids what your family did. I remember lots of us kids reading that book in context, because we knew and were creeped out… I remember one thing about it that was ugly was that “a bunch of this is about being really mean to Dorothy”.\nWe didn’t like that about it. I remember wanting to tell authorities of some kind. The kids made damn sure I didn’t do that- they were afraid they’d be in trouble because they seduced these adults and got drugs from them.\nThe big thing was, that if we told, then you and your brother would end up in foster. The kids involved sexually and otherwise swore that they didn’t do this to their own kids, just other people’s, so it would be hurting you for no good reason. They didn’t think they were a good enough reason.\nIt’s all so sad, with that regret as far as I go. I could have told but absolutely nobody would have backed me up – I wasn’t “in it”, so I was useless as any sort of witness. I swear to anyone that disbelieves Moira, for whatever reason, that the scenario she speaks about is absolutely true, it really did happen, with a ton of people involved.\nI can’t vouch for details, I wasn’t involved. Although I  came close. I was put in uncomfortable sexual situations with the Breens and pals. I chickened out and and threatened to tell. Telling was NOT welcome, to say the least. I know many who did not chicken out, and even made fun of those who did. The kids being preyed on were more “grown up”, more cool, and in the scene.\nMoira is telling the truth.\nKeep this in mind if you ever find yourself thinking that reconciliation, negotiation, and compromise is a viable option, or that the situation isn’t actually worse than the conspiracy theorists tell you.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-03T14:00:00+00:00"
}