{
  "url": "https://voxday.net/2018/10/28/over-the-target-it-seems-2/",
  "scraped_at": "2025-12-20T05:14:41.572115",
  "title": "Over the target, it seems",
  "date_display": "October 28, 2018",
  "date_iso": "2018-10-28T23:36:57+00:00",
  "date_from_url": "2018-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Milo – MILO, of all people – is <a href=\"https://www.facebook.com/myiannopoulos/posts/1294920853979140?__tn__=-R\">receiving pushback</a> from the followers of St. Jordan the Never-Sleeping because he wrote the Foreword to <i><b><a href=\"https://amzn.to/2O8hirX\">Jordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker</a></b></i>:</p><blockquote><p>Gage Martinez<br>It seems like milo just doesn’t like that jordan took his place when milo stopped doing well reasoned debates and started focusing instead on being “outrageous”.</br></p><p>Jason Murray<br>i have followed you for about 2 years now. I have loved watching you tell people to screw off and being yourself. Today i will be unfollowing you. I may check on you from time to time. Reason. From the description of this book, it nothing but a hit piece on a good and honest, and yes imperfect man. I will read your forward and possibly this book. Though i doubt I’ll get to the book.</br></p><p>Craig Mac Corkle<br>You usually do have an interesting point of view, and I’m not sure that I’m understanding this one. But I’ll take a look at it. It’s just doesn’t make any sense to me but best of luck with it. Dont know Vox. But i like JBP, and the IDW. These people have amazing credentials, but aren’t infallible, or afraid of criticism. I don’t know, seems like a strange move.</br></p><p>William Cuddling<br>No one’s dismissing you out of hand. Fact is, judging from the statements you’ve made publicly about Peterson, your point of view just isn’t that interesting, so why would anyone wanna buy a book, the synopsis of which reads like an introduction to just another in a lone line of bullshit hit-pieces, just so we have the honor of reading your foreword? Personally couldn’t care less if you go after Peterson. Just sick of your whining.</br></p><p>Matt Malone<br>Theres plenty to criticize about Peterson, but Milo just seems peeved when anyone get more attention than him. Ben Shapiro has also leapfrogged Milo and rightfully so, much more thoughtful commentator… The right criticizes the left for their purity spirals where they will turn on anyone who deviates from their orthodoxy, but Milo is pretty similar. The left seems self righteous when they do it but Milo just seems petty. Overall he is deleterious to any positions he holds, and its no wonder noone wants to associate with him.</br></p><p>Jason Murray Alaina Toledo<br>I see a man that isnt afraid to admit that he doesn’t know all the answers and will concede that he is wrong when faced with evidence of such. There is nothing wrong with JBP and he doesn’t deserve to be attacked as a lair or hypocrite, when all that he is doing is trying to do is help us all to see that the world has rules, and that we should try to live by them, for the well being of the individual and though the individual, society as a whole. You should really listen to everything he has to say before drawing conclusions.</br></p><p>John Tangney<br>Vox day has always seemed like a total Muppet to me, and his criticisms of Peterson based in jealousy rather than anything substantive.</br></p><p>Justin Grajek<br>Jealous of his popularity Milo? His views are nuanced and thoughtful instead of emotion driven. I don’t think you can say the same.</br></p><p>Nalinne Jones<br>Lame. Unfollowing.</br></p><p>Halldór Magnússon<br>Milo, you are putting it up like one has to choose between you and Peterson. I am sorry but it’s an unfair competition, you lose big time which is so not necessary, you can be on the same team. If you want fewer followers then continue on this road.</br></p><p>Sean Grabill<br>So, you get neutered and you have to neuter someone else to get your revenge? You used to have important things to say and then you started crawling into the gutter with the left. It seems like you lost yourself down there and the limelight became more important than the things that used to matter. It wasn’t so long ago you were the one we were all supposed to hate, but you’ve forgotten all too soon what that was like, or maybe that’s what made you so bitter. If this is the end of your movie, cry into a $100 bill, and ride off into the sunset, have some grace. You were better than associating yourself with this garbage. Is that still in you or have they just taken the piss right out of you?</br></p></blockquote><p>It’s funny, but all these comments sound almost identical to the comments left in response to one of my Jordanetics videos on the Darkstream. It’s really remarkable how so many people are so bitter, jealous, and envious that they are inspired to criticize St. Jordan of the Cider.</p></div>",
  "content_text": "Milo – MILO, of all people – is\nreceiving pushback\nfrom the followers of St. Jordan the Never-Sleeping because he wrote the Foreword to\nJordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker\n:\nGage Martinez\nIt seems like milo just doesn’t like that jordan took his place when milo stopped doing well reasoned debates and started focusing instead on being “outrageous”.\nJason Murray\ni have followed you for about 2 years now. I have loved watching you tell people to screw off and being yourself. Today i will be unfollowing you. I may check on you from time to time. Reason. From the description of this book, it nothing but a hit piece on a good and honest, and yes imperfect man. I will read your forward and possibly this book. Though i doubt I’ll get to the book.\nCraig Mac Corkle\nYou usually do have an interesting point of view, and I’m not sure that I’m understanding this one. But I’ll take a look at it. It’s just doesn’t make any sense to me but best of luck with it. Dont know Vox. But i like JBP, and the IDW. These people have amazing credentials, but aren’t infallible, or afraid of criticism. I don’t know, seems like a strange move.\nWilliam Cuddling\nNo one’s dismissing you out of hand. Fact is, judging from the statements you’ve made publicly about Peterson, your point of view just isn’t that interesting, so why would anyone wanna buy a book, the synopsis of which reads like an introduction to just another in a lone line of bullshit hit-pieces, just so we have the honor of reading your foreword? Personally couldn’t care less if you go after Peterson. Just sick of your whining.\nMatt Malone\nTheres plenty to criticize about Peterson, but Milo just seems peeved when anyone get more attention than him. Ben Shapiro has also leapfrogged Milo and rightfully so, much more thoughtful commentator… The right criticizes the left for their purity spirals where they will turn on anyone who deviates from their orthodoxy, but Milo is pretty similar. The left seems self righteous when they do it but Milo just seems petty. Overall he is deleterious to any positions he holds, and its no wonder noone wants to associate with him.\nJason Murray Alaina Toledo\nI see a man that isnt afraid to admit that he doesn’t know all the answers and will concede that he is wrong when faced with evidence of such. There is nothing wrong with JBP and he doesn’t deserve to be attacked as a lair or hypocrite, when all that he is doing is trying to do is help us all to see that the world has rules, and that we should try to live by them, for the well being of the individual and though the individual, society as a whole. You should really listen to everything he has to say before drawing conclusions.\nJohn Tangney\nVox day has always seemed like a total Muppet to me, and his criticisms of Peterson based in jealousy rather than anything substantive.\nJustin Grajek\nJealous of his popularity Milo? His views are nuanced and thoughtful instead of emotion driven. I don’t think you can say the same.\nNalinne Jones\nLame. Unfollowing.\nHalldór Magnússon\nMilo, you are putting it up like one has to choose between you and Peterson. I am sorry but it’s an unfair competition, you lose big time which is so not necessary, you can be on the same team. If you want fewer followers then continue on this road.\nSean Grabill\nSo, you get neutered and you have to neuter someone else to get your revenge? You used to have important things to say and then you started crawling into the gutter with the left. It seems like you lost yourself down there and the limelight became more important than the things that used to matter. It wasn’t so long ago you were the one we were all supposed to hate, but you’ve forgotten all too soon what that was like, or maybe that’s what made you so bitter. If this is the end of your movie, cry into a $100 bill, and ride off into the sunset, have some grace. You were better than associating yourself with this garbage. Is that still in you or have they just taken the piss right out of you?\nIt’s funny, but all these comments sound almost identical to the comments left in response to one of my Jordanetics videos on the Darkstream. It’s really remarkable how so many people are so bitter, jealous, and envious that they are inspired to criticize St. Jordan of the Cider.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-28T23:36:57+00:00"
}