{
  "url": "https://voxday.net/2018/10/17/rorshach-reviews-banned-bleeding-cool-interview/",
  "scraped_at": "2025-12-20T05:12:59.333652",
  "title": "Rorshach reviews banned Bleeding Cool interview",
  "date_display": "October 17, 2018",
  "date_iso": "2018-10-17T01:11:17+00:00",
  "date_from_url": "2018-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/lMs8JXrDC3w\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/lMs8JXrDC3w\">of the video</a>:</p><p><b>BC: </b>You often refer to a formula which says: Diversity + Proximity = War. And you use diversity in this sense to mean ethnic diversity. Does it apply to ideological diversity? Does a comic book publishing company which has a politically diverse staff and group of creators become stronger?</p><p><b>VD: </b>Yes, ethnic diversity combined with proximity is one of the primary historical drivers of war. In fact, the great Israeli military historian Martin van Creveld, who we have the privilege to publish at Castalia House, has concluded that human migration is so closely intertwined with war that they are essentially two sides of the same coin. Ideological diversity can certainly lead to war, as the case of the Spanish civil war demonstrates, but it is usually intranational war rather than international war.</p><p><b>Rorshach: </b>Absolutely true! Wow! No wonder they want to memory-hole this article. The truth about diversity. Oh my god! He’s got to interject himself all the time, this writer. My god, they’re so scared of what he has to say here. They can’t just let the interview speak for itself. They’re absolutely terrified of him.</p></div>",
  "content_text": "From the transcript\nof the video\n:\nBC:\nYou often refer to a formula which says: Diversity + Proximity = War. And you use diversity in this sense to mean ethnic diversity. Does it apply to ideological diversity? Does a comic book publishing company which has a politically diverse staff and group of creators become stronger?\nVD:\nYes, ethnic diversity combined with proximity is one of the primary historical drivers of war. In fact, the great Israeli military historian Martin van Creveld, who we have the privilege to publish at Castalia House, has concluded that human migration is so closely intertwined with war that they are essentially two sides of the same coin. Ideological diversity can certainly lead to war, as the case of the Spanish civil war demonstrates, but it is usually intranational war rather than international war.\nRorshach:\nAbsolutely true! Wow! No wonder they want to memory-hole this article. The truth about diversity. Oh my god! He’s got to interject himself all the time, this writer. My god, they’re so scared of what he has to say here. They can’t just let the interview speak for itself. They’re absolutely terrified of him.",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-17T00:11:17+00:00"
}