{
  "url": "https://voxday.net/2018/10/10/that-moment-you-realize-theyre-crazy/",
  "scraped_at": "2025-12-20T05:12:10.367469",
  "title": "That moment you realize they’re crazy",
  "date_display": "October 10, 2018",
  "date_iso": "2018-10-10T14:06:19+00:00",
  "date_from_url": "2018-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a story about Terence McKenna, upon being introduced at a conference by an academic who kept going on about the epic drug-taker’s amazing metaphors concerning other-dimensional elves, standing up and angrily shouting, “It’s not a metaphor! The elves are real!” At which point everyone in the audience suddenly realized that the famous techno-philosopher was not brilliant, he was not insightful, and his thinking was neither revolutionary nor creative, he was just crazy.</p><p>Owen Benjamin – by the way, you guys were right, the man is extremely funny – <a href=\"https://youtu.be/xs8ACVUxnWg\">appears to have had a similar epiphany</a> about the intellectual frauds known as Jordan Peterson and the rest of the New York Times-christened “Intellectual Dark Web”. From the transcript:</p><blockquote><p>Brett Weinstein comes out swinging. I was saying WeinSTINE, they were saying it was WeinSTINE. They’re such fucking little weasels. When Brett was on Rogan, they said it was WeinSTINE instead of STEEN, but that was blatantly because of Harvey. Now they’re all saying WeinSTEEN. Bunch of fucking weasels. The Intellectual Douche Weasels. IDW. Intellectual Douche Weasels.</p><p>For those of you who are like, “oh, you’re turning on your own, Big Bear,” no, I’m not. I’m using criticism and social shame to try to alter someone’s behavior. I am not taking anyone’s rights or calling for anything.</p><p>Brett Weinstein says “Quite a good discussion of some IDW-” That’s Intellectual Douche Weasel. The Intellectual Dark Web, what a bunch of fags. All right, “reactions to the Kavanaugh confirmation and push-back. Warning, contains nuance. You may be triggered. If you are, avoid social media for 24 hours. Comfort and herb tea are available free of charge at a local safe space.”</p><p>These people. I can’t believe I was once rooting for them. That’s all right. See, that’s a mistake I expect you to get past with me. I made a mistake, I said you can trust a guy like Brett Weinstein to give pushback from a liberal stance and that’s how you can come up with the best- no! These people are undercutting the American republic and they can go fuck themselves. Don’t listen to a word out of their mouths.</p><p>I’m asking you to do that out of consent, by the way. I’m not forcing anyone or condemning or “taking down”. That’s so stupid. This is Charlie’s reaction, by the way, when I told him what Jordan Peterson has been up to. He hasn’t been taking it very well. You know, he looked up to him almost like a father figure and now he doesn’t even want to clean his room! He’s just throwing his toys everywhere… he’s spiralling.</p><p>By the way, you’re the one who cleans your room. It has nothing to do with Jordan Peterson. Everybody just needs a better Dad. That’s what it comes down to. The Baby Boomers sucked at being parents and so now no one knows what money is or how the government works.</p></blockquote><p>What’s interesting to me about the Official Opposition’s sudden reaction to Jordan Peterson’s massive <i>faux pas</i> is the way they are desperately trying to reinforce his false “thought experiment” narrative.  What a great nuanced discussion! It’s just a thought experiment that demonstrates how nuanced and thoughtful ol’ Uncle Jordan is! He didn’t actually mean what he said. LOL! Don’t you know he just works out what he thinks in public? He’s been thinking about this issue for a long time, a <i>long </i>time, but he’s just working out what he thinks about it now in response to your reaction to his tweet, which you must understand was just a nuanced thought experiment that struck him amidst his contemplation on how best to clean someone else’s room.</p><p>No, it’s an extremely significant demonstration of how little character and integrity these weasels possess, as they join forces in order to cover up for Jordan Peterson’s mask slipping in public and revealing the real anti-American left-wing globalist face underneath. In fact, the main thing I took from all of this was the confirmation that Scott Adams is not on our side, after he rushed to accept the Crazy Christ’s “clarification”.</p><p>Think about this. Did Milo ever get this kind of protective public insulation for his public missteps? Did they ever extend the same benefit of the doubt to Kavanaugh or anything that President Trump has ever said? The Incestuous Douche Weasels know, <i>they immediately recognized</i>, that Peterson exposed himself badly on Supreme Court Justice Kavanaugh, and anyone who falls for this frantic <i>ex post facto</i> itachi kabuki is a self-deluded fool.</p><p>It is simply ghastly to observe how many Peterson cultists continue to delude themselves about the man, <i>even after </i>they saw him unmask himself. They have the situation precisely backwards. Peterson didn’t take one bad position after establishing many good ones, to the contrary, he very publicly took one good position early on that is very much against the flow of his entire personal and professional perspective.</p></div>",
  "content_text": "There is a story about Terence McKenna, upon being introduced at a conference by an academic who kept going on about the epic drug-taker’s amazing metaphors concerning other-dimensional elves, standing up and angrily shouting, “It’s not a metaphor! The elves are real!” At which point everyone in the audience suddenly realized that the famous techno-philosopher was not brilliant, he was not insightful, and his thinking was neither revolutionary nor creative, he was just crazy.\nOwen Benjamin – by the way, you guys were right, the man is extremely funny –\nappears to have had a similar epiphany\nabout the intellectual frauds known as Jordan Peterson and the rest of the New York Times-christened “Intellectual Dark Web”. From the transcript:\nBrett Weinstein comes out swinging. I was saying WeinSTINE, they were saying it was WeinSTINE. They’re such fucking little weasels. When Brett was on Rogan, they said it was WeinSTINE instead of STEEN, but that was blatantly because of Harvey. Now they’re all saying WeinSTEEN. Bunch of fucking weasels. The Intellectual Douche Weasels. IDW. Intellectual Douche Weasels.\nFor those of you who are like, “oh, you’re turning on your own, Big Bear,” no, I’m not. I’m using criticism and social shame to try to alter someone’s behavior. I am not taking anyone’s rights or calling for anything.\nBrett Weinstein says “Quite a good discussion of some IDW-” That’s Intellectual Douche Weasel. The Intellectual Dark Web, what a bunch of fags. All right, “reactions to the Kavanaugh confirmation and push-back. Warning, contains nuance. You may be triggered. If you are, avoid social media for 24 hours. Comfort and herb tea are available free of charge at a local safe space.”\nThese people. I can’t believe I was once rooting for them. That’s all right. See, that’s a mistake I expect you to get past with me. I made a mistake, I said you can trust a guy like Brett Weinstein to give pushback from a liberal stance and that’s how you can come up with the best- no! These people are undercutting the American republic and they can go fuck themselves. Don’t listen to a word out of their mouths.\nI’m asking you to do that out of consent, by the way. I’m not forcing anyone or condemning or “taking down”. That’s so stupid. This is Charlie’s reaction, by the way, when I told him what Jordan Peterson has been up to. He hasn’t been taking it very well. You know, he looked up to him almost like a father figure and now he doesn’t even want to clean his room! He’s just throwing his toys everywhere… he’s spiralling.\nBy the way, you’re the one who cleans your room. It has nothing to do with Jordan Peterson. Everybody just needs a better Dad. That’s what it comes down to. The Baby Boomers sucked at being parents and so now no one knows what money is or how the government works.\nWhat’s interesting to me about the Official Opposition’s sudden reaction to Jordan Peterson’s massive\nfaux pas\nis the way they are desperately trying to reinforce his false “thought experiment” narrative.  What a great nuanced discussion! It’s just a thought experiment that demonstrates how nuanced and thoughtful ol’ Uncle Jordan is! He didn’t actually mean what he said. LOL! Don’t you know he just works out what he thinks in public? He’s been thinking about this issue for a long time, a\nlong\ntime, but he’s just working out what he thinks about it now in response to your reaction to his tweet, which you must understand was just a nuanced thought experiment that struck him amidst his contemplation on how best to clean someone else’s room.\nNo, it’s an extremely significant demonstration of how little character and integrity these weasels possess, as they join forces in order to cover up for Jordan Peterson’s mask slipping in public and revealing the real anti-American left-wing globalist face underneath. In fact, the main thing I took from all of this was the confirmation that Scott Adams is not on our side, after he rushed to accept the Crazy Christ’s “clarification”.\nThink about this. Did Milo ever get this kind of protective public insulation for his public missteps? Did they ever extend the same benefit of the doubt to Kavanaugh or anything that President Trump has ever said? The Incestuous Douche Weasels know,\nthey immediately recognized\n, that Peterson exposed himself badly on Supreme Court Justice Kavanaugh, and anyone who falls for this frantic\nex post facto\nitachi kabuki is a self-deluded fool.\nIt is simply ghastly to observe how many Peterson cultists continue to delude themselves about the man,\neven after\nthey saw him unmask himself. They have the situation precisely backwards. Peterson didn’t take one bad position after establishing many good ones, to the contrary, he very publicly took one good position early on that is very much against the flow of his entire personal and professional perspective.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-10T13:06:19+00:00"
}