{
  "url": "https://voxday.net/2018/10/03/the-forgery-of-knowledge/",
  "scraped_at": "2025-12-20T05:11:05.385449",
  "title": "The forgery of knowledge",
  "date_display": "October 3, 2018",
  "date_iso": "2018-10-03T12:05:28+00:00",
  "date_from_url": "2018-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A team of three ethnographicists conclusively demonstrate how modern scholastics is <a href=\"https://areomagazine.com/2018/10/02/academic-grievance-studies-and-the-corruption-of-scholarship/\">a complete forgery of knowledge</a>:</p><blockquote><p>Our approach is best understood as a kind of reflexive ethnography—that is, we conducted a study of a peculiar academic culture by immersing ourselves within it, reflecting its output and modifying our understanding until we became “outsiders within” it.</p><p>Our objective was to learn about this culture and establish that we had become fluent in its language and customs by publishing peer-reviewed papers in its top journals, which usually only experts in the field are capable of doing. Because we came to conceptualize this project as a kind of reflexive ethnographic study in which we sought to understand the field and how it works by participating in it, obtaining peer reviewers’ comments about what we were doing right and what needed to change to make absurd theses acceptable was central to the project. Indeed, the reviewers’ comments are in many ways more revealing about the state of these fields than the acceptances themselves.</p><p>While our papers are all outlandish or intentionally broken in significant ways, it is important to recognize that they blend in almost perfectly with others in the disciplines under our consideration. To demonstrate this, we needed to get papers accepted, especially by significant and influential journals. Merely blending in couldn’t generate the depth necessary for our study, however. We also needed to write papers that took risks to test certain hypotheses such that the fact of their acceptance itself makes a statement about the problem we’re studying (see the Papers section, below). Consequently, although this study does not qualify as being particularly controlled, we did control one important variable: the big-picture methodology we used to write every paper.</p><p>Our paper-writing methodology always followed a specific pattern: it started with an idea that spoke to our epistemological or ethical concerns with the field and then sought to bend the existing scholarship to support it. The goal was always to use what the existing literature offered to get some little bit of lunacy or depravity to be acceptable at the highest levels of intellectual respectability within the field. Therefore, each paper began with something absurd or deeply unethical (or both) that we wanted to forward or conclude. We then made the existing peer-reviewed literature do our bidding in the attempt to get published in the academic canon.</p><p>This is the primary point of the project: What we just described is not knowledge production; it’s sophistry. That is, it’s a forgery of knowledge that should not be mistaken for the real thing. The biggest difference between us and the scholarship we are studying by emulation is that we know we made things up.</p></blockquote><p>The papers they managed to get published are hilarious, including one that is literally a feminist rewrite of a chapter from <i>Mein Kampf</i>. One paper, <i>Human reactions to rape culture and queer performativity at urban dog parks in Portland, Oregon</i>, even “gained special recognition for excellence from its journal, <i>Gender, Place, and Culture</i>, a highly ranked journal that leads the field of feminist geography. The journal honored it as one of twelve leading pieces in feminist geography as a part of the journal’s 25th anniversary celebration.”</p></div>",
  "content_text": "A team of three ethnographicists conclusively demonstrate how modern scholastics is\na complete forgery of knowledge\n:\nOur approach is best understood as a kind of reflexive ethnography—that is, we conducted a study of a peculiar academic culture by immersing ourselves within it, reflecting its output and modifying our understanding until we became “outsiders within” it.\nOur objective was to learn about this culture and establish that we had become fluent in its language and customs by publishing peer-reviewed papers in its top journals, which usually only experts in the field are capable of doing. Because we came to conceptualize this project as a kind of reflexive ethnographic study in which we sought to understand the field and how it works by participating in it, obtaining peer reviewers’ comments about what we were doing right and what needed to change to make absurd theses acceptable was central to the project. Indeed, the reviewers’ comments are in many ways more revealing about the state of these fields than the acceptances themselves.\nWhile our papers are all outlandish or intentionally broken in significant ways, it is important to recognize that they blend in almost perfectly with others in the disciplines under our consideration. To demonstrate this, we needed to get papers accepted, especially by significant and influential journals. Merely blending in couldn’t generate the depth necessary for our study, however. We also needed to write papers that took risks to test certain hypotheses such that the fact of their acceptance itself makes a statement about the problem we’re studying (see the Papers section, below). Consequently, although this study does not qualify as being particularly controlled, we did control one important variable: the big-picture methodology we used to write every paper.\nOur paper-writing methodology always followed a specific pattern: it started with an idea that spoke to our epistemological or ethical concerns with the field and then sought to bend the existing scholarship to support it. The goal was always to use what the existing literature offered to get some little bit of lunacy or depravity to be acceptable at the highest levels of intellectual respectability within the field. Therefore, each paper began with something absurd or deeply unethical (or both) that we wanted to forward or conclude. We then made the existing peer-reviewed literature do our bidding in the attempt to get published in the academic canon.\nThis is the primary point of the project: What we just described is not knowledge production; it’s sophistry. That is, it’s a forgery of knowledge that should not be mistaken for the real thing. The biggest difference between us and the scholarship we are studying by emulation is that we know we made things up.\nThe papers they managed to get published are hilarious, including one that is literally a feminist rewrite of a chapter from\nMein Kampf\n. One paper,\nHuman reactions to rape culture and queer performativity at urban dog parks in Portland, Oregon\n, even “gained special recognition for excellence from its journal,\nGender, Place, and Culture\n, a highly ranked journal that leads the field of feminist geography. The journal honored it as one of twelve leading pieces in feminist geography as a part of the journal’s 25th anniversary celebration.”",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-03T11:05:28+00:00"
}