{
  "url": "https://voxday.net/2018/10/01/virtue-signal-fail/",
  "scraped_at": "2025-12-20T05:10:48.569422",
  "title": "Virtue-signal fail",
  "date_display": "October 1, 2018",
  "date_iso": "2018-10-01T17:36:22+00:00",
  "date_from_url": "2018-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Shockingly, despite all his furious denouncings of everything to the ideological Right of George Bush, Richard Meyer has entirely failed to win over the SJWs of the comics industry. His tortious interference lawsuit against Mark Waid of Marvel hasn’t exactly <a href=\"https://boundingintocomics.com/2018/10/01/after-diversity-comics-sues-mark-waid-comic-book-professionals-launch-istandwithmarkwaid/\">been greeted with open arms</a> by the comic artist pros.</p><blockquote class=\"tr_bq\"><p>After news broke of Richard Meyer’s lawsuit against Mark Waid for tortious interference and defamation, a number of comic book industry professionals rallied around the DC Comics and Marvel Comics veteran writer.</p></blockquote><p>I have no dog in that particular fight. Both men appear to be rather nasty pieces of work, if their Twitter accounts are reliable indicators. That being said, the timeline of events does appear to suggest that Waid <i>may </i>be guilty of interfering with Meyer’s contract with Antarctica Press, although I’d like Meyer’s chances a lot better if he wasn’t relying upon <a href=\"https://www.youtube.com/watch?v=YoF7EqwT11c\">an inept nobody from outstate Minnesota</a> as his lawyer.</p><p>As a general rule, when your lawyer is prone to spouting off in complete ignorance of events, it’s not a good sign. The thing that was most amusing about this Rekieta guy posturing and babbling on and on about how I was probably wrong about my supposed violation of 2VS’s trademark claim is that <i>at no point</i> did he ever take the trouble to ascertain <i>if I was even a relevant party</i> concerning the subject before publicly commenting on it. As it happens, I was not. So, if his handling of Meyer’s case against Waid is anywhere nearly as incompetent as his approach to 2VS’s against me was, he’s going to get his head handed to him by the big guns that Marvel will bring in.</p><p>Don’t get me wrong. The white-shoe-wearing big guns <i>can </i>be beaten. I’ve seen it done and I’ve done it. But they are seldom beaten by clueless, careless, posturing loudmouths. We didn’t bother to blow the guy’s feeble non-case apart because I didn’t want anything to do with ComicsGate after discovering that it is nothing more than 2VS’s fan club. But I tend to doubt Waid and his attorneys will do the same.</p></div>",
  "content_text": "Shockingly, despite all his furious denouncings of everything to the ideological Right of George Bush, Richard Meyer has entirely failed to win over the SJWs of the comics industry. His tortious interference lawsuit against Mark Waid of Marvel hasn’t exactly\nbeen greeted with open arms\nby the comic artist pros.\nAfter news broke of Richard Meyer’s lawsuit against Mark Waid for tortious interference and defamation, a number of comic book industry professionals rallied around the DC Comics and Marvel Comics veteran writer.\nI have no dog in that particular fight. Both men appear to be rather nasty pieces of work, if their Twitter accounts are reliable indicators. That being said, the timeline of events does appear to suggest that Waid\nmay\nbe guilty of interfering with Meyer’s contract with Antarctica Press, although I’d like Meyer’s chances a lot better if he wasn’t relying upon\nan inept nobody from outstate Minnesota\nas his lawyer.\nAs a general rule, when your lawyer is prone to spouting off in complete ignorance of events, it’s not a good sign. The thing that was most amusing about this Rekieta guy posturing and babbling on and on about how I was probably wrong about my supposed violation of 2VS’s trademark claim is that\nat no point\ndid he ever take the trouble to ascertain\nif I was even a relevant party\nconcerning the subject before publicly commenting on it. As it happens, I was not. So, if his handling of Meyer’s case against Waid is anywhere nearly as incompetent as his approach to 2VS’s against me was, he’s going to get his head handed to him by the big guns that Marvel will bring in.\nDon’t get me wrong. The white-shoe-wearing big guns\ncan\nbe beaten. I’ve seen it done and I’ve done it. But they are seldom beaten by clueless, careless, posturing loudmouths. We didn’t bother to blow the guy’s feeble non-case apart because I didn’t want anything to do with ComicsGate after discovering that it is nothing more than 2VS’s fan club. But I tend to doubt Waid and his attorneys will do the same.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-01T16:36:22+00:00"
}