{
  "url": "https://voxday.net/2018/10/15/vox-was-right/",
  "scraped_at": "2025-12-20T05:12:46.703485",
  "title": "Vox was right",
  "date_display": "October 15, 2018",
  "date_iso": "2018-10-15T18:39:01+00:00",
  "date_from_url": "2018-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of all the words of screen and pen<br>The saddest are these:<br><a href=\"https://caffeineandphilosophy.com/2018/10/12/i-was-wrong-about-jordan-peterson-and-vox-was-right/\">“Vox was right again.”</a></br></br></p><blockquote><p>A while back, I wrote <a href=\"https://caffeineandphilosophy.com/2018/05/10/an-open-letter-to-vox-day-regarding-dr-jordan-peterson/\">a post defending Jordan Peterson</a> against Vox Day’s criticisms. My claim was that while Jordan Peterson’s value is somewhat exaggerated by many of his followers, for whom his ideas seemed new and extraordinary, Vox Day’s claims seemed exaggerated. Vox argued that Peterson was an existential relativist, that he was controlled opposition, that his teachings are more harmful then helpful, and that he was simply insane. All of that seemed wrong, at least hyperbolic. To me, Peterson seemed like a modern Joseph Campbell, essentially a mythologist just teaching the moral stories of myths with the rhetorical skill of a showman. For a generation immersed in social-media and public-school propaganda, this seemed like a generally good thing, especially when coupled with his opposition to bill C-16.</p><p>To set the tone for this post, it is only now that I remember that his opposition to this bill was unsuccessful. The bill was passed on June 19, 2017. Not only was it unsuccessful, but Peterson had promised to go to jail if necessary, were the bill passed and accusations of violating said bill brought against him. At the time, it seemed rather admirable. But given the amount of fire he’s been under, it seems strange that his opponents have found no opportunity to challenge his conviction on the matter. Rather than being on hunger strike in some jail, he’s been traveling around the world on tour with his book.</p><p>I’m not saying Peterson should actively be hunting out a jail-term in order to be consistent, as that was not what he had promised. But the situation seems a bit incongruous, and most people don’t remember what it was that brought him to popularity in the first place. With the help of a little bit of recollection, however, I have come to believe that Vox Day was, in fact, right about Dr. Peterson.</p></blockquote><p>That pair of comments on the original post haven’t aged well. In fairness to those who were snowed by the Canadian Conman, old Uncle Jordy is extremely dedicated to confusing and confabulating his audiences.</p><p>Remember, falsehoods have consequences. That’s what makes them false.</p></div>",
  "content_text": "Of all the words of screen and pen\nThe saddest are these:\n“Vox was right again.”\nA while back, I wrote\na post defending Jordan Peterson\nagainst Vox Day’s criticisms. My claim was that while Jordan Peterson’s value is somewhat exaggerated by many of his followers, for whom his ideas seemed new and extraordinary, Vox Day’s claims seemed exaggerated. Vox argued that Peterson was an existential relativist, that he was controlled opposition, that his teachings are more harmful then helpful, and that he was simply insane. All of that seemed wrong, at least hyperbolic. To me, Peterson seemed like a modern Joseph Campbell, essentially a mythologist just teaching the moral stories of myths with the rhetorical skill of a showman. For a generation immersed in social-media and public-school propaganda, this seemed like a generally good thing, especially when coupled with his opposition to bill C-16.\nTo set the tone for this post, it is only now that I remember that his opposition to this bill was unsuccessful. The bill was passed on June 19, 2017. Not only was it unsuccessful, but Peterson had promised to go to jail if necessary, were the bill passed and accusations of violating said bill brought against him. At the time, it seemed rather admirable. But given the amount of fire he’s been under, it seems strange that his opponents have found no opportunity to challenge his conviction on the matter. Rather than being on hunger strike in some jail, he’s been traveling around the world on tour with his book.\nI’m not saying Peterson should actively be hunting out a jail-term in order to be consistent, as that was not what he had promised. But the situation seems a bit incongruous, and most people don’t remember what it was that brought him to popularity in the first place. With the help of a little bit of recollection, however, I have come to believe that Vox Day was, in fact, right about Dr. Peterson.\nThat pair of comments on the original post haven’t aged well. In fairness to those who were snowed by the Canadian Conman, old Uncle Jordy is extremely dedicated to confusing and confabulating his audiences.\nRemember, falsehoods have consequences. That’s what makes them false.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-15T17:39:01+00:00"
}