{
  "url": "https://voxday.net/2018/10/17/winestream-foundation-edition/",
  "scraped_at": "2025-12-20T05:13:02.969964",
  "title": "Winestream: Foundation edition",
  "date_display": "October 17, 2018",
  "date_iso": "2018-10-17T14:09:53+00:00",
  "date_from_url": "2018-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/hnh2byx8bCA\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\">We had an amazing time at the Voxiversity Foundation <strike>Dinner</strike>Weekend. There was considerable discussion, strategery, and analysis of both the IGG situation and the upcoming movie project intermingled with excellent food provided by a Spanish chef who skillfully reinvented everything from paella to the burger. The wines were phenomenal, ranging from the local Priorats to my favorite Ribiero del Duero, and at the request of one attendee, we even did <a href=\"https://youtu.be/hnh2byx8bCA\">a live Winestream</a> sampling an Israeli cabernet. We also did a live Voxiversity on rhetoric and dialectic that will be out in November.<p>If you’d like to attend next year’s dinner, which we collectively decided will again be in Spain, consider becoming <a href=\"http://www.castaliahouse.com/downloads/voxiversity-foundation/\">a Foundation backer</a>. (Please note that <a href=\"http://www.castaliahouse.com/?post_type=download&amp;s=voxiversity\">the various subscriptions</a> are MONTHLY.) I can’t speak for anyone else who was there, but the event was not only extremely enjoyable, it was incredibly <i>productive</i>.</p></div></div>",
  "content_text": "We had an amazing time at the Voxiversity Foundation\nDinner\nWeekend. There was considerable discussion, strategery, and analysis of both the IGG situation and the upcoming movie project intermingled with excellent food provided by a Spanish chef who skillfully reinvented everything from paella to the burger. The wines were phenomenal, ranging from the local Priorats to my favorite Ribiero del Duero, and at the request of one attendee, we even did\na live Winestream\nsampling an Israeli cabernet. We also did a live Voxiversity on rhetoric and dialectic that will be out in November.\nIf you’d like to attend next year’s dinner, which we collectively decided will again be in Spain, consider becoming\na Foundation backer\n. (Please note that\nthe various subscriptions\nare MONTHLY.) I can’t speak for anyone else who was there, but the event was not only extremely enjoyable, it was incredibly\nproductive\n.",
  "tags": [
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-17T13:09:53+00:00"
}