{
  "url": "https://voxday.net/2018/10/06/wormtongue-confirmed/",
  "scraped_at": "2025-12-20T05:11:39.646687",
  "title": "Wormtongue confirmed",
  "date_display": "October 6, 2018",
  "date_iso": "2018-10-06T23:17:03+00:00",
  "date_from_url": "2018-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordan Peterson is behaving the way all con men behave when they’ve gotten ahead of the con. Now he’s walking it back. And Scott Adams is helping him try to sell it and salvage his credibility:</p><blockquote><p>Jordan B Peterson@jordanbpeterson<br>If confirmed Kavanaugh should step down.</br></p><p>Jordan B Peterson@jordanbpeterson<br>I’m not certain that is the right move. It’s very complex. But he would have his name cleared, and a figure who might be less divisive might be put forward.</br></p><p>Jordan B Peterson@jordanbpeterson<br>That might decrease residual alienation from the left, and make things less polarized moving forward. Of course, that has to be balanced against handing any victory to the “believe all accusers” crowd.</br></p><p>Jordan B Peterson@jordanbpeterson<br>I was thinking all this whole trying to plot out a strategy that would be least damaging, on the whole. And I’m not jumping up and down claiming to be correct. Thought is experiment, not reality.</br></p><p>Scott Adams<br>Clarification accepted.</br></p></blockquote><p>If you STILL buy into Jordan Peterson’s bullshit after this pathetic “never mind, I’ll just walk it back” display, you will fully deserve the disenchantment that will be your fate.</p><p>Let me be clear: Jordan Peterson is absolutely and utterly full of shit… and he always has been.</p></div>",
  "content_text": "Jordan Peterson is behaving the way all con men behave when they’ve gotten ahead of the con. Now he’s walking it back. And Scott Adams is helping him try to sell it and salvage his credibility:\nJordan B Peterson@jordanbpeterson\nIf confirmed Kavanaugh should step down.\nJordan B Peterson@jordanbpeterson\nI’m not certain that is the right move. It’s very complex. But he would have his name cleared, and a figure who might be less divisive might be put forward.\nJordan B Peterson@jordanbpeterson\nThat might decrease residual alienation from the left, and make things less polarized moving forward. Of course, that has to be balanced against handing any victory to the “believe all accusers” crowd.\nJordan B Peterson@jordanbpeterson\nI was thinking all this whole trying to plot out a strategy that would be least damaging, on the whole. And I’m not jumping up and down claiming to be correct. Thought is experiment, not reality.\nScott Adams\nClarification accepted.\nIf you STILL buy into Jordan Peterson’s bullshit after this pathetic “never mind, I’ll just walk it back” display, you will fully deserve the disenchantment that will be your fate.\nLet me be clear: Jordan Peterson is absolutely and utterly full of shit… and he always has been.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-10-06T22:17:03+00:00"
}