{
  "url": "https://voxday.net/2014/05/03/a-tale-of-two-reviews-2/",
  "scraped_at": "2025-12-16T12:13:21.028045",
  "title": "A tale of four reviews",
  "date_display": "May 3, 2014",
  "date_iso": "2014-05-03T13:11:00+00:00",
  "date_from_url": "2014-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s as expected as it is informative that “Opera Vita Aeterna” is meeting with entirely different receptions depending upon the reader.  For example, here is a review of the Hugo-nominated novelette <a href=\"http://www.whygodwhy.org/t3926-opera-vita-aeternasic-by-vox-day\">from one Nerdvanel</a>:</p><blockquote class=\"tr_bq\"><p> Apparently “Opera Vita Aeterna” is totally ungrammatical in Latin. I didn’t notice any spelling errors in the story itself, but really, having errors like that in the title is bad enough. People who know anything about Latin should know that it’s an inflected language and therefore those inflections should be paid attention to if a grammatical result is desired. I don’t know if Vox is really that ignorant or if he just doesn’t care.</p><p>Then to the epub file… Opera Vita Aeterna has a cover page. On it is a 3d-render of an ominous castle, probably meant to be the good guy monastery in the story. When you look closely, several interesting features appear. For one thing, the castle seems to have been carved from rock as a single piece. They should have used a stone texture that had cracks in it to simulate the castle having been constructed from hewn blocks, assuming that was what had happened. Then, the castle itself is terribly designed. The architect must have been incompetent beyond belief. The castle is incredibly impractical while at the same time being really ugly. I don’t know how those side towers in particular got okayed or whether the explanation for the disparate window sizes is that the perspective is all off or if those lower windows are just unreasonably huge. Also, it looks like the designers had heard that castles have crenelated fortifications but don’t know what they’re for or what they should look like.</p><p>The lighting is really weird too. It looks like the inhabitants of the castle like to point multiple searchlights (not pictured) at the clouds. They also have other light sources (also not pictured) pointed at the castle. The light looks cold and artificial, so the universe in which the castle is situated must have at least 20th Century technology or else magic to spare on frivolous things. Neither is exactly consistent with the story.</p><p>But enough about the cover. What comes next is a series of praise blurbs for another book by Vox, A Throne of Bones.</p><p>The esteemed sources providing the blurbs:<br> – Two self-published authors I had never heard of, giving faint praise<br> – Three unpopular blogs ideologically close to Vox, one of which currently has a post on the front page talking about how Vox’s racist statements totally aren’t racist<br> – Two anonymous Amazon reviews that could have been written by just anyone</br></br></br></p><p>Some of the more notable contents in the blurbs:<br> – Putting Vox on a level with Tolkien (x1)<br> – Putting Vox on a level with Martin (x2)<br> – Saying that Vox is better than Martin (x2)</br></br></br></p><p>You can judge for yourself how accurate those are.</p><p>This was pretty long, so let’s call this post an introduction and move to the novella itself in the next post.</p><p>The story begins in what in this world is called “853 Anno Salutis Humanae”, “in the Year of the Human(e) Salvation” according to my research. The term should probably be “Anno Salutis Hominum”, “in the Year of the Salvation of Humans”, but apparently looking that up was too difficult. “Humanus” is an adjective, not a noun. Well, trying to be gracious here, perhaps the author was trying to imply that some unspecified but important salvation had been a humane thing to do or done by humans or that Not-Jesus had been all man and zero God. I think there’s no chance of that though.</p><p>You see, Vox Day is a Christian apologist. It would be heretical to have his Not-Jesus not be fully man and fully God as the real-world doctrine has it. Also, now that I pay attention to it, I see that the story has a lot of questionable Latin in it.</p><p>And by the way, speaking of potential heresy, I think it’s worth mentioning that Vox Day’s name can be translated as “Voice of Godde”. Vox Day is in English pronounced the same as “Vox Dei”, which is Latin for “Voice of God”. That sounds just a tad arrogant. I wonder what the Inquisition would have thought of it. It’s like Vox is implying that all of his opinions are God’s opinions. But more than that, Vox is making it sound like he is channeling God and Vox’s writings are holy scripture. I thought humility was an important Christian virtue.</p><p>We finally get to the first paragraph, and it contains some really “good” material.</p><p>Quote : <i>The pallid sun was descending, its ineffective rays no longer sufficient to hold it up in the sky or to penetrate the northern winds that gathered strength with the whispered promises of the incipient dark.</i></p><p>Apparently in this world suns are held up by radiation pressure. It also sounds like it should be dark. Electromagnetic radiation being unable to somehow get through thin air should have that effect, at least in a logical world.</p><p>Also, I wonder if the winds whisper different things during different times of the day or if the winds’ verbal communication is limited to always repeating things like “Daaaark… Whooooosh… Daaaark…” Winds shouldn’t have a brain, after all.</p><p>Quote : <i>The first of the two moons was already visible high above the mountains. Soon Arbhadis, Night’s Mistress, would unveil herself as well.</i></p><p>Apparently moon rays are more effectual than sun rays.</p><p>I don’t know if Arbhadis is the second moon or what. We’re never told. In case it is, I wonder what the first moon is called. Is it Night’s Wife, Night’s Other Mistress, or what? Anyway, apparently Arbhadis is already on the scene, just hidden by clouds, unless you think those mountains qualify as a metaphorical, overly thick veil. Any of this is however doesn’t matter one little bit as far as the story goes. We’ll never hear of Arbhadis again. After this point the author largely stops his efforts to write in an evocative language. Too bad for the lost humor value.</p></blockquote><p>There is more, but you can read it there. So, that’s one perspective. I will merely note that the castle on the cover is not the monastery, it is Raknarborg, the castle in which the events of “The Last Witchking”, the title story of collection in which “Opera Vita Aeterna” was published, take place. I would think that the difference between a castle-fortress and a small rural abbey were obvious, but then, I would also have thought the difference between <i>Latina </i>and <i>italiano </i>are obvious too. In ogni caso, <a href=\"http://chris-gerrib.livejournal.com/492897.html\">here is a second review</a>, from Chris Gerrib:</p><blockquote class=\"tr_bq\"><p> Overall, the story is not as bad as I feared, which is small praise<br> indeed for a Hugo-nominated work.  I found the world-building a bit<br> jarring.  How much of that is my dislike for bog-standard Dark Ages<br> European fantasy I can’t really tell you.  I do think the payoff – elf<br> finishes book – was too light for the story.  I had no emotional<br> attachment to any character, so that didn’t help matters.  I also<br> thought the elf’s response to the slaughter of his friends was weak – no<br> guilt at not being there to help or blaming himself for putting them at<br> risk, for example.</br></br></br></br></br></br></br></br></p></blockquote><p>And for a different perspective, <a href=\"http://malcolmthecynic.wordpress.com/2014/04/21/opera-vita-aertna/\">here is a third review</a>:</p><blockquote class=\"tr_bq\"><p> It is absolutely brilliant, one of the best short stories I have read in<br> years. This is why, no matter how much I might disagree with Vox Day<br> (or, you know, agree with people who think he can be an asshole), I<br> can’t help but respect the man. He understands pathos, tragedy, and<br> redemption in a way few modern authors do, and “Opera Vita Aeterna” is a<br> short piece of great beauty. The pacing was spot on and the emotional<br> beats hit perfectly.</br></br></br></br></br></br></p></blockquote><p>Finally, <a href=\"http://www.aetherczar.com/?p=3195\">a fourth review</a>, which goes into a similar level of detail to the first review, only to reach very different conclusions.</p><blockquote class=\"tr_bq\"><p> In today’s bloodthirsty fantasy genre, all too often “guy rapes his sister next to the corpse of their murdered child” (and sadly, I’m not exaggerating) is considered the epitome of high-brow artistic sophistication. I find it encouraging and refreshing to encounter an author like Vox Day, who can craft a subtle, complex, and powerful story through the old-fashioned method of plot and character development, rather than falling back on the shock value of depravity to stimulate his readers. Vox Day has helped restore my faith in the possibility of quality contemporary fantasy.</p><p>To that end, I’ve signed up as a supporter of LONCON3. For $43, I will be a member of the group that gets to vote on the Hugo award. I’m looking forward to the opportunity to review the other nominated short stories to see if they can exceed the high bar set by Vox Day. I’m also looking forward to reviewing the nominees in the other<br> categories. Fans and readers who have been turned off by the state of<br> contemporary science fiction and fantasy may wish to reconsider their<br> decision. A brash crew of insurgents, like Vox Day, working largely<br> outside the mainstream publishing industry, are in the process of<br> reinventing the genre.</br></br></br></br></br></p></blockquote><p>What explains the difference between these extraordinarily different reviews of exactly the same literary work? Is it all down to politics? I don’t think that is entirely the case. Certainly politics plays a part in it; it is obvious that the first reviewer is actively hunting for things to criticize. A brief mention of the world’s two moons is hardly the equivalent of Chekov’s Gun. What did he expect to see, Arbhadis colliding spectacularly with the first moon and a chunk of the resulting rubble plunging to earth just in time to kill the evil, hypocritical abbot before he could murder the elf in reaction to his self-loathing over having succumbed to the temptation of elven beauty?</p><p>I think the main reason for the fear and loathing seen here is that having amputated themselves from the source from which all love, awe, and wonder spring, they have no basis upon which to judge anything but mechanics and adherence to their ever-mutating principles of the moment. If you’re looking for  literary pyrotechnics or the message that [insert minority of choice] can do anything that straight white men can do, only better, you’re bound to be disappointed. Although I will say that if you don’t see any humor in an overly literal concept of solar supports in a medievalesque story, well, I can’t help you there.</p><p>Nerdvanel says he is content to let others judge for themselves whether A THRONE OF BONES is better than A DANCE WITH DRAGONS. I concur, and I’m likewise content to leave it to others to judge for themselves which of these four reviews is the most accurate.</p></div>",
  "content_text": "It’s as expected as it is informative that “Opera Vita Aeterna” is meeting with entirely different receptions depending upon the reader.  For example, here is a review of the Hugo-nominated novelette\nfrom one Nerdvanel\n:\nApparently “Opera Vita Aeterna” is totally ungrammatical in Latin. I didn’t notice any spelling errors in the story itself, but really, having errors like that in the title is bad enough. People who know anything about Latin should know that it’s an inflected language and therefore those inflections should be paid attention to if a grammatical result is desired. I don’t know if Vox is really that ignorant or if he just doesn’t care.\nThen to the epub file… Opera Vita Aeterna has a cover page. On it is a 3d-render of an ominous castle, probably meant to be the good guy monastery in the story. When you look closely, several interesting features appear. For one thing, the castle seems to have been carved from rock as a single piece. They should have used a stone texture that had cracks in it to simulate the castle having been constructed from hewn blocks, assuming that was what had happened. Then, the castle itself is terribly designed. The architect must have been incompetent beyond belief. The castle is incredibly impractical while at the same time being really ugly. I don’t know how those side towers in particular got okayed or whether the explanation for the disparate window sizes is that the perspective is all off or if those lower windows are just unreasonably huge. Also, it looks like the designers had heard that castles have crenelated fortifications but don’t know what they’re for or what they should look like.\nThe lighting is really weird too. It looks like the inhabitants of the castle like to point multiple searchlights (not pictured) at the clouds. They also have other light sources (also not pictured) pointed at the castle. The light looks cold and artificial, so the universe in which the castle is situated must have at least 20th Century technology or else magic to spare on frivolous things. Neither is exactly consistent with the story.\nBut enough about the cover. What comes next is a series of praise blurbs for another book by Vox, A Throne of Bones.\nThe esteemed sources providing the blurbs:\n– Two self-published authors I had never heard of, giving faint praise\n– Three unpopular blogs ideologically close to Vox, one of which currently has a post on the front page talking about how Vox’s racist statements totally aren’t racist\n– Two anonymous Amazon reviews that could have been written by just anyone\nSome of the more notable contents in the blurbs:\n– Putting Vox on a level with Tolkien (x1)\n– Putting Vox on a level with Martin (x2)\n– Saying that Vox is better than Martin (x2)\nYou can judge for yourself how accurate those are.\nThis was pretty long, so let’s call this post an introduction and move to the novella itself in the next post.\nThe story begins in what in this world is called “853 Anno Salutis Humanae”, “in the Year of the Human(e) Salvation” according to my research. The term should probably be “Anno Salutis Hominum”, “in the Year of the Salvation of Humans”, but apparently looking that up was too difficult. “Humanus” is an adjective, not a noun. Well, trying to be gracious here, perhaps the author was trying to imply that some unspecified but important salvation had been a humane thing to do or done by humans or that Not-Jesus had been all man and zero God. I think there’s no chance of that though.\nYou see, Vox Day is a Christian apologist. It would be heretical to have his Not-Jesus not be fully man and fully God as the real-world doctrine has it. Also, now that I pay attention to it, I see that the story has a lot of questionable Latin in it.\nAnd by the way, speaking of potential heresy, I think it’s worth mentioning that Vox Day’s name can be translated as “Voice of Godde”. Vox Day is in English pronounced the same as “Vox Dei”, which is Latin for “Voice of God”. That sounds just a tad arrogant. I wonder what the Inquisition would have thought of it. It’s like Vox is implying that all of his opinions are God’s opinions. But more than that, Vox is making it sound like he is channeling God and Vox’s writings are holy scripture. I thought humility was an important Christian virtue.\nWe finally get to the first paragraph, and it contains some really “good” material.\nQuote :\nThe pallid sun was descending, its ineffective rays no longer sufficient to hold it up in the sky or to penetrate the northern winds that gathered strength with the whispered promises of the incipient dark.\nApparently in this world suns are held up by radiation pressure. It also sounds like it should be dark. Electromagnetic radiation being unable to somehow get through thin air should have that effect, at least in a logical world.\nAlso, I wonder if the winds whisper different things during different times of the day or if the winds’ verbal communication is limited to always repeating things like “Daaaark… Whooooosh… Daaaark…” Winds shouldn’t have a brain, after all.\nQuote :\nThe first of the two moons was already visible high above the mountains. Soon Arbhadis, Night’s Mistress, would unveil herself as well.\nApparently moon rays are more effectual than sun rays.\nI don’t know if Arbhadis is the second moon or what. We’re never told. In case it is, I wonder what the first moon is called. Is it Night’s Wife, Night’s Other Mistress, or what? Anyway, apparently Arbhadis is already on the scene, just hidden by clouds, unless you think those mountains qualify as a metaphorical, overly thick veil. Any of this is however doesn’t matter one little bit as far as the story goes. We’ll never hear of Arbhadis again. After this point the author largely stops his efforts to write in an evocative language. Too bad for the lost humor value.\nThere is more, but you can read it there. So, that’s one perspective. I will merely note that the castle on the cover is not the monastery, it is Raknarborg, the castle in which the events of “The Last Witchking”, the title story of collection in which “Opera Vita Aeterna” was published, take place. I would think that the difference between a castle-fortress and a small rural abbey were obvious, but then, I would also have thought the difference between\nLatina\nand\nitaliano\nare obvious too. In ogni caso,\nhere is a second review\n, from Chris Gerrib:\nOverall, the story is not as bad as I feared, which is small praise\nindeed for a Hugo-nominated work.  I found the world-building a bit\njarring.  How much of that is my dislike for bog-standard Dark Ages\nEuropean fantasy I can’t really tell you.  I do think the payoff – elf\nfinishes book – was too light for the story.  I had no emotional\nattachment to any character, so that didn’t help matters.  I also\nthought the elf’s response to the slaughter of his friends was weak – no\nguilt at not being there to help or blaming himself for putting them at\nrisk, for example.\nAnd for a different perspective,\nhere is a third review\n:\nIt is absolutely brilliant, one of the best short stories I have read in\nyears. This is why, no matter how much I might disagree with Vox Day\n(or, you know, agree with people who think he can be an asshole), I\ncan’t help but respect the man. He understands pathos, tragedy, and\nredemption in a way few modern authors do, and “Opera Vita Aeterna” is a\nshort piece of great beauty. The pacing was spot on and the emotional\nbeats hit perfectly.\nFinally,\na fourth review\n, which goes into a similar level of detail to the first review, only to reach very different conclusions.\nIn today’s bloodthirsty fantasy genre, all too often “guy rapes his sister next to the corpse of their murdered child” (and sadly, I’m not exaggerating) is considered the epitome of high-brow artistic sophistication. I find it encouraging and refreshing to encounter an author like Vox Day, who can craft a subtle, complex, and powerful story through the old-fashioned method of plot and character development, rather than falling back on the shock value of depravity to stimulate his readers. Vox Day has helped restore my faith in the possibility of quality contemporary fantasy.\nTo that end, I’ve signed up as a supporter of LONCON3. For $43, I will be a member of the group that gets to vote on the Hugo award. I’m looking forward to the opportunity to review the other nominated short stories to see if they can exceed the high bar set by Vox Day. I’m also looking forward to reviewing the nominees in the other\ncategories. Fans and readers who have been turned off by the state of\ncontemporary science fiction and fantasy may wish to reconsider their\ndecision. A brash crew of insurgents, like Vox Day, working largely\noutside the mainstream publishing industry, are in the process of\nreinventing the genre.\nWhat explains the difference between these extraordinarily different reviews of exactly the same literary work? Is it all down to politics? I don’t think that is entirely the case. Certainly politics plays a part in it; it is obvious that the first reviewer is actively hunting for things to criticize. A brief mention of the world’s two moons is hardly the equivalent of Chekov’s Gun. What did he expect to see, Arbhadis colliding spectacularly with the first moon and a chunk of the resulting rubble plunging to earth just in time to kill the evil, hypocritical abbot before he could murder the elf in reaction to his self-loathing over having succumbed to the temptation of elven beauty?\nI think the main reason for the fear and loathing seen here is that having amputated themselves from the source from which all love, awe, and wonder spring, they have no basis upon which to judge anything but mechanics and adherence to their ever-mutating principles of the moment. If you’re looking for  literary pyrotechnics or the message that [insert minority of choice] can do anything that straight white men can do, only better, you’re bound to be disappointed. Although I will say that if you don’t see any humor in an overly literal concept of solar supports in a medievalesque story, well, I can’t help you there.\nNerdvanel says he is content to let others judge for themselves whether A THRONE OF BONES is better than A DANCE WITH DRAGONS. I concur, and I’m likewise content to leave it to others to judge for themselves which of these four reviews is the most accurate.",
  "tags": [
    "Hugo Award",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-03T12:11:00+00:00"
}