{
  "url": "https://voxday.net/2014/05/11/a-woman-surprised/",
  "scraped_at": "2025-12-16T12:14:07.428830",
  "title": "A woman surprised",
  "date_display": "May 11, 2014",
  "date_iso": "2014-05-11T08:27:00+00:00",
  "date_from_url": "2014-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://forums.spacebattles.com/threads/mini-review-quantum-mortis-a-man-disrupted-this-isnt-one-of-your-kurtzweilian-death-cults.288682/\">review of <i><b>QUANTUM MORTIS A Man Disrupted</b></i></a> is unusual, since it is written by an avowed anti-fan, (and not merely an anti-fan of me), who, unlike some, elected to read the book and review it instead of merely reacting to the name of one of the authors:</p><blockquote class=\"tr_bq\"><p> I went into this book fully expecting to hate it. I was in fact<br> gleefully awaiting it to turn into a giant pile of shit that I could<br> tear apart with glee. One of the co-writers of this book was Vox “Throw<br> acid in women’s faces for the greater good” Day and the only endorsement<br> in the back of the book was <i>Tom Kratman</i>.</br></br></br></br></p><p>I was not prepared to give this book even a single chance, but by the<br> end I was furiously swiping through pages with pure glee. Its basically<br> the anti-Oathbound for me, a book I went in expecting to love and hated<br> it.</br></br></br></p><p>The plot in the general sense is your standard Noir in Space setup:<br> Investigator starts work on a simple case that turns out to be much<br> bigger than it looks and spirals into one that could decide the fate of<br> the entire planet and the main character is a grizzled hardass bigot.<br> What makes it work is that the characters are actually <i>fantastic </i>and<br> Steve Rzasa’s writing saves Vox Day’s and turns the book into an<br> utterly enjoyable piece of pulp fiction that’s so stupid it wraps around<br> to utterly fucking brilliant….</br></br></br></br></br></br></br></p><p>The book also subverts the hell out of a lot of the usual cliches as<br> well. The villain is actually a gigantic threat to the point that they<br> confront them with a Kill Team, a regiment of Marines and a <i>Battleship in orbit</i><br> and Tower puts their odds of survival at “low”. AIs are also treated as<br> actual beings capable of independent thought, emotion and <i>sacrifice</i> and the book laughs off the idea of “Kill all Humans” or “God Complex” AIs.</br></br></br></br></p><p>The book also treats people who can kill with glee while making one liners as being <i>total psychopaths</i><br> who freak the main character the fuck out while treating the guy puking<br> his guts out and crying while mowing enemies down as being far more<br> normal and perfectly respectable.</br></br></br></p></blockquote><p>The first draft of the second QUANTUM MORTIS novel is now complete, so there is a good chance it will be out in July. Tower and Baby are back, and they find themselves facing a threat that is even more gigantic and intergalactically dangerous than the one posed in <a href=\"http://www.amazon.com/QUANTUM-MORTIS-A-Man-Disrupted-ebook/dp/B00I4W7WTS\"><i><b>QM:AMD</b></i></a>. But Tower has a new gun….</p></div>",
  "content_text": "This\nreview of\nQUANTUM MORTIS A Man Disrupted\nis unusual, since it is written by an avowed anti-fan, (and not merely an anti-fan of me), who, unlike some, elected to read the book and review it instead of merely reacting to the name of one of the authors:\nI went into this book fully expecting to hate it. I was in fact\ngleefully awaiting it to turn into a giant pile of shit that I could\ntear apart with glee. One of the co-writers of this book was Vox “Throw\nacid in women’s faces for the greater good” Day and the only endorsement\nin the back of the book was\nTom Kratman\n.\nI was not prepared to give this book even a single chance, but by the\nend I was furiously swiping through pages with pure glee. Its basically\nthe anti-Oathbound for me, a book I went in expecting to love and hated\nit.\nThe plot in the general sense is your standard Noir in Space setup:\nInvestigator starts work on a simple case that turns out to be much\nbigger than it looks and spirals into one that could decide the fate of\nthe entire planet and the main character is a grizzled hardass bigot.\nWhat makes it work is that the characters are actually\nfantastic\nand\nSteve Rzasa’s writing saves Vox Day’s and turns the book into an\nutterly enjoyable piece of pulp fiction that’s so stupid it wraps around\nto utterly fucking brilliant….\nThe book also subverts the hell out of a lot of the usual cliches as\nwell. The villain is actually a gigantic threat to the point that they\nconfront them with a Kill Team, a regiment of Marines and a\nBattleship in orbit\nand Tower puts their odds of survival at “low”. AIs are also treated as\nactual beings capable of independent thought, emotion and\nsacrifice\nand the book laughs off the idea of “Kill all Humans” or “God Complex” AIs.\nThe book also treats people who can kill with glee while making one liners as being\ntotal psychopaths\nwho freak the main character the fuck out while treating the guy puking\nhis guts out and crying while mowing enemies down as being far more\nnormal and perfectly respectable.\nThe first draft of the second QUANTUM MORTIS novel is now complete, so there is a good chance it will be out in July. Tower and Baby are back, and they find themselves facing a threat that is even more gigantic and intergalactically dangerous than the one posed in\nQM:AMD\n. But Tower has a new gun….",
  "tags": [
    "Book Review",
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-11T07:27:00+00:00"
}