{
  "url": "https://voxday.net/2014/05/02/an-unconvincing-presiden/",
  "scraped_at": "2025-12-16T12:13:15.137597",
  "title": "An unconvincing president",
  "date_display": "May 2, 2014",
  "date_iso": "2014-05-02T13:09:00+00:00",
  "date_from_url": "2014-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steven Gould’s <a href=\"http://eatourbrains.com/steve/?p=1219\">inept and dishonest efforts</a> to mitigate the continuing damage to SFWA taking place on his watch is really rather entertaining. And while I will leave the discussion of whether SFWA’s philosophy is hellish or not to the more theologically inclined, there are few things more Orwellian than Mr. Gould’s historical revisionism.</p><blockquote class=\"tr_bq\"><p> Recently a member of SFWA resigned and gave as their reasons that they were being slandered and libeled by leaders and members of SFWA who were also engaged in an “organized attempts to harass my readers and hurt my sales figures.” He subsequently posted this letter on his website.</p><p>The writer in question is a successful author of over a dozen SF &amp; Fantasy novels and has previously been nominated for the Nebula Award. The fact that I’d never heard of them before receiving their resignation email says far more about me and the scope of my reading in the field than it does about them. There are 1800 members of the organization after all, but I would like to point out that this also means that neither I nor any other officer or director of this organization has been slandering, libeling, or organizing against that person–I would certainly have heard about it. When asked for specifics, the author replied that it would be unprofessional to name those who had.</p></blockquote><p>Notice the first thing the SFWA president attempts to do is diminish John C. Wright’s <a href=\"http://www.milobookclub.com/2014/03/17/poll-who-is-greatest-living-sf-writer/\">standing in the field</a>. Perhaps it is true that he’d never heard of any of Mr. Wright’s brilliant novels, from the magnificant <i>The Golden Age</i> to the Nebula-nominated <i>Orphans of Chaos</i> and the amazing Night Land novella, “Awake in the Night” that was literally named The Year’s Best Science Fiction. The fact that the SFWA president openly admits he has never heard of the man who Publisher’s Weekly described as potentially bing “this fledgling century’s most important new SF talent” tends to underline what I, and others, have pointed out concerning SFWA’s irrelevance to the genre.</p><p>But whether his claim is true or not, what is the point of telling everyone that? To underline his ignorance? No, what he is trying to do is send a signal to the lesser talents of SFWA that it doesn’t matter that one of the best and most important writers in the genre is spurning them.</p><p>He’s also implicitly attempting to attack John C. Wright’s integrity. To show that Gould is being disingenuous here, the SFWA Report that was used to justify Gould’s purging of me included 20 statements from individuals purported to be either members, prospective members, and in one case, “an outgoing board member”. Not a single one was named.</p><blockquote class=\"tr_bq\"><p> In researching this I have seen some critical historical posts by both members and non-members responding to statements made by the author. Without passing judgment on the nature of the author’s posts I would like to make the following points:</p><p>1. <b>The only place where the Science Fiction and Fantasy<br> Writers of America makes an effort to monitor and control what members<br> and non-members say or write is <i>within the official publications and venues of the organization itself</i> and<br> then only to the extent that the language does or does not support the<br> goals and purposes of the organization. These venues include, among<br> others, <i>The SFWA Bulletin</i>, the SFWA website, our meetings,<br> official communications to the membership, and our online member<br> discussion boards. They certainly do not include members’ own websites,<br> their fiction, their conversations, pieces published in non-sfwa<br> publications, and any other private and public space.*</br></br></br></br></br></br></br></br></br></b></p></blockquote><p>This is an absolute lie by Gould. In the SFWA Report, Section B. Continuing pattern of actions prejudicial to SFWA, Board Member Matthew Johnson writes:</p><p><i>1. Attacks on members<br>Attacks on members which occurred through SFWA channels or in SFWA-controlled spaces are addressed in part A. The following looks at attacks and threats which were made in his blog and other public space.<br> </br></br></i><br> <i>Personal attacks<br>Beale has made numerous attacks on fellow SFWA members which may be seen as going outside the bounds of professional conduct. The best-known and most consistent is likely his use of derogatory nicknames, such as “McRapey” for John Scalzi and “McRacist” for N.K. Jemisin (see Fig B.1). He has also compared Amal el-Mohtar to an Egyptian cleric who has, according to Beale, called for the ethnic cleansing of Egypt (Fig B.2); accused James Enge of “despicable behavior” (see Fig B.3); accused Ms. Jemisin of plagiarism (see Fig B.4); and has published a blog comment claiming that Teresa Nielsen Hayden has herpes. (See Appendix I for the question of whether and why to consider blog comments.  In this case, though, Beale actually reprinted the comment in one of his own blog posts, making him more clearly the publisher of the comment: see Fig B.5) </br></i></br></p><p>This proves Stephen Gould to be a blatant liar. The SFWA clearly monitors and controls what both members and non-members say on their personal blogs and other public spaces. Of course, the SFWA has tried to bury this report, so perhaps Mr. Gould thought that he could get away with telling outright lies.</p><blockquote class=\"tr_bq\"><p> 2.<b> It <i>is</i> the position of SFWA that language <i>within our official channels and publications </i>which marginalizes and/or alienates any portion of our membership  does <i>not</i> support the goals and purposes of the organization.</b></p></blockquote><p>This is fascinating, considering that in my response to the SFWA Report, I chronicled no less than 71 attacks on other members in the SFWA Forum itself by the following SFWA members, most of which were NOT directed at me.</p><p>Athena Andreadis, Liz Argall, William Barton, Andrew Burt, Steve Carper, Gregory Norman Bossert, Carrie Cuin, Amal El-Mohtar, Jim Fiscus, Diana Pharoah Francis, Steven Gould, Sarah Grey, Jim Hines, Keffy Kehrli, Kate Kligman, Lee Martindale, David Moles, T.L. Morganfield, Jason Sanford, Steven Saus, Catherine Shaffer, Cory Skerry, Charles Stross, Rachel Swirsky, Elise Tobler, Wendy Wagner, Sean Wallace, Damien Walter, Bud Webster, Django Wexler</p><p>For example: Board Member Jim Fiscus. <i>Posted 15 May, 2013 – 10:23 PM “We have a reckless jerk who wants to harm people — not just harm<br> SFWA or sff.net — they want to harm individual human beings.  And they<br> do not give a damn what harm they do to people. The thing is that this thinking has much wider implications.  It is<br> no different from the ideological purity demanded by the Tea Party or<br> the Taliban, and it’s only a small step from the tactics used by the<br> Taliban and the Westboro Baptist Church.”</br></br></br></br></br></i> Note that this attack, <b>by an SFWA Board Member in the SFWA Forum</b>, took place before I’d violated any SFWA policies myself. So, again, we see that Gould is lying.</p><blockquote class=\"tr_bq\"><p> 3. I don’t see this as a particularly onerous or oppressive policy as this simply boils down to treating <i>all</i> our members with respect <i>in our official channels of communication</i>.<br> While it is my belief that the vast majority of our members would not<br> intentionally disparage their fellows based on irrelevant factors like<br> gender identity, ethnicity, religion, age, sexual preference, or<br> ableness, they certainly are not constrained from doing so in a host of<br> non-SFWA venues.</br></br></br></br></br></p></blockquote><p>And for the third time, it is easy to prove that Gould is lying. Not only are members constrained from disparaging their fellows in a host of non-SFWA venues, they are expected to constrain their own commenters as well and will be held responsible for ALL of their commenters comments, even if they utilize an open and unmoderated comment system. From the SFWA Report Appendix I. Inclusion of blog comments:</p><p><i>This Appendix examines the question of whether to give weight to comments made on Beale’s blog by people other than himself. A key question is whether or not Beale actively manages the content of the comment threads on his blog by removing comments: if he does so, it follows that he has permitted all<br>other comments to remain.</br></i></p><p><i>In considering the question, it’s worth looking at the precise meaning of the term “moderate” in the context of Blogger, the blogging platform used by Beale. As this article by Blogger explains, turning on Comment Moderation in that platform means that all comments have to be actively approved by the operator of the blog before they are published. Beale’s blog is not moderated in this sense, possibly because the large volume of comments on his posts would make it impractical.</i><br> <i><br>However, there is evidence to suggest that Beale actively manages the comments on his blog.</br></i>… <i>Therefore it would seem that Beale actively manages the content in the comment threads on his blogs, meaning that while he may not necessarily agree with the content of those comments that are not deleted, he does consider them to be appropriate for publication.</i></br></p><blockquote class=\"tr_bq\"><p> 4. Just as SFWA doesn’t control what members and non-members say in<br> non-SFWA spaces, it also doesn’t control what members and non-members say in response to<br> members’ public comments, statements, essays, and blog posts. When<br> persons say things in public that others find objectionable, it is<br> likely they will receive criticism and objections. There is an odd<br> misconception among some that Freedom of Speech includes freedom from<br> the consequences of one’s speech and freedom from commentary on what one<br> has said.<i> </i></br></br></br></br></br></br></br></p></blockquote><p>A fourth and particularly egregious lie. Gould knows that the very blog post he used as an excuse to purge me was a RESPONSE to NK Jemisin’s attack on me, an attack to which he himself linked in the SFWA Forum. Once more, the evidence is in the SFWA Report.</p><p><i>The incident which prompted this investigation was Mr. Beale’s use of the SFWAAuthors Twitter account to distribute his blog of June 13, 2013 “A black female fantasist calls for Reconciliation.” </i></p><blockquote class=\"tr_bq\"><p> 5. There also seems to be an oddly misplaced tendency to look at SFWA’s recent efforts to moderate language <i>in its own channels</i> as<br> somehow being responsible for public criticism of various individual’s<br> public statements and positions. I submit, though, that if one<br> is somehow threatened by the organization’s requirements that we treat<br> fellow members with respect <i>within our official channels</i>, then the problem is someplace other than with SFWA.</br></br></br></br></p></blockquote><p>For the first time, Gould doesn’t directly lie, he merely attempts to deceive with misdirection and then launches another passive-aggressive attack on Mr. Wright. In his attempt to minimize the impact of Mr. Wright’s renunciation of SFWA, he has done nothing more than to show himself to be a shameless liar, and in doing so, helped support Mr. Wright’s case for leaving the organization.</p><blockquote class=\"tr_bq\"><h5> *Board investigation of harassment complaints may take public statements into consideration, but this is <i>extremely</i> rare.</h5></blockquote><p>Translation: Never mind what I said above, we’ll actually do whatever we want, whenever we want. But don’t worry, as long as you stick sufficiently close to the currently approved opinions with which we will provide you, you shouldn’t have a problem. As long as you don’t run for office against me, of course.</p></div>",
  "content_text": "Steven Gould’s\ninept and dishonest efforts\nto mitigate the continuing damage to SFWA taking place on his watch is really rather entertaining. And while I will leave the discussion of whether SFWA’s philosophy is hellish or not to the more theologically inclined, there are few things more Orwellian than Mr. Gould’s historical revisionism.\nRecently a member of SFWA resigned and gave as their reasons that they were being slandered and libeled by leaders and members of SFWA who were also engaged in an “organized attempts to harass my readers and hurt my sales figures.” He subsequently posted this letter on his website.\nThe writer in question is a successful author of over a dozen SF & Fantasy novels and has previously been nominated for the Nebula Award. The fact that I’d never heard of them before receiving their resignation email says far more about me and the scope of my reading in the field than it does about them. There are 1800 members of the organization after all, but I would like to point out that this also means that neither I nor any other officer or director of this organization has been slandering, libeling, or organizing against that person–I would certainly have heard about it. When asked for specifics, the author replied that it would be unprofessional to name those who had.\nNotice the first thing the SFWA president attempts to do is diminish John C. Wright’s\nstanding in the field\n. Perhaps it is true that he’d never heard of any of Mr. Wright’s brilliant novels, from the magnificant\nThe Golden Age\nto the Nebula-nominated\nOrphans of Chaos\nand the amazing Night Land novella, “Awake in the Night” that was literally named The Year’s Best Science Fiction. The fact that the SFWA president openly admits he has never heard of the man who Publisher’s Weekly described as potentially bing “this fledgling century’s most important new SF talent” tends to underline what I, and others, have pointed out concerning SFWA’s irrelevance to the genre.\nBut whether his claim is true or not, what is the point of telling everyone that? To underline his ignorance? No, what he is trying to do is send a signal to the lesser talents of SFWA that it doesn’t matter that one of the best and most important writers in the genre is spurning them.\nHe’s also implicitly attempting to attack John C. Wright’s integrity. To show that Gould is being disingenuous here, the SFWA Report that was used to justify Gould’s purging of me included 20 statements from individuals purported to be either members, prospective members, and in one case, “an outgoing board member”. Not a single one was named.\nIn researching this I have seen some critical historical posts by both members and non-members responding to statements made by the author. Without passing judgment on the nature of the author’s posts I would like to make the following points:\n1.\nThe only place where the Science Fiction and Fantasy\nWriters of America makes an effort to monitor and control what members\nand non-members say or write is\nwithin the official publications and venues of the organization itself\nand\nthen only to the extent that the language does or does not support the\ngoals and purposes of the organization. These venues include, among\nothers,\nThe SFWA Bulletin\n, the SFWA website, our meetings,\nofficial communications to the membership, and our online member\ndiscussion boards. They certainly do not include members’ own websites,\ntheir fiction, their conversations, pieces published in non-sfwa\npublications, and any other private and public space.*\nThis is an absolute lie by Gould. In the SFWA Report, Section B. Continuing pattern of actions prejudicial to SFWA, Board Member Matthew Johnson writes:\n1. Attacks on members\nAttacks on members which occurred through SFWA channels or in SFWA-controlled spaces are addressed in part A. The following looks at attacks and threats which were made in his blog and other public space.\nPersonal attacks\nBeale has made numerous attacks on fellow SFWA members which may be seen as going outside the bounds of professional conduct. The best-known and most consistent is likely his use of derogatory nicknames, such as “McRapey” for John Scalzi and “McRacist” for N.K. Jemisin (see Fig B.1). He has also compared Amal el-Mohtar to an Egyptian cleric who has, according to Beale, called for the ethnic cleansing of Egypt (Fig B.2); accused James Enge of “despicable behavior” (see Fig B.3); accused Ms. Jemisin of plagiarism (see Fig B.4); and has published a blog comment claiming that Teresa Nielsen Hayden has herpes. (See Appendix I for the question of whether and why to consider blog comments.  In this case, though, Beale actually reprinted the comment in one of his own blog posts, making him more clearly the publisher of the comment: see Fig B.5)\nThis proves Stephen Gould to be a blatant liar. The SFWA clearly monitors and controls what both members and non-members say on their personal blogs and other public spaces. Of course, the SFWA has tried to bury this report, so perhaps Mr. Gould thought that he could get away with telling outright lies.\n2.\nIt\nis\nthe position of SFWA that language\nwithin our official channels and publications\nwhich marginalizes and/or alienates any portion of our membership  does\nnot\nsupport the goals and purposes of the organization.\nThis is fascinating, considering that in my response to the SFWA Report, I chronicled no less than 71 attacks on other members in the SFWA Forum itself by the following SFWA members, most of which were NOT directed at me.\nAthena Andreadis, Liz Argall, William Barton, Andrew Burt, Steve Carper, Gregory Norman Bossert, Carrie Cuin, Amal El-Mohtar, Jim Fiscus, Diana Pharoah Francis, Steven Gould, Sarah Grey, Jim Hines, Keffy Kehrli, Kate Kligman, Lee Martindale, David Moles, T.L. Morganfield, Jason Sanford, Steven Saus, Catherine Shaffer, Cory Skerry, Charles Stross, Rachel Swirsky, Elise Tobler, Wendy Wagner, Sean Wallace, Damien Walter, Bud Webster, Django Wexler\nFor example: Board Member Jim Fiscus.\nPosted 15 May, 2013 – 10:23 PM “We have a reckless jerk who wants to harm people — not just harm\nSFWA or sff.net — they want to harm individual human beings.  And they\ndo not give a damn what harm they do to people. The thing is that this thinking has much wider implications.  It is\nno different from the ideological purity demanded by the Tea Party or\nthe Taliban, and it’s only a small step from the tactics used by the\nTaliban and the Westboro Baptist Church.”\nNote that this attack,\nby an SFWA Board Member in the SFWA Forum\n, took place before I’d violated any SFWA policies myself. So, again, we see that Gould is lying.\n3. I don’t see this as a particularly onerous or oppressive policy as this simply boils down to treating\nall\nour members with respect\nin our official channels of communication\n.\nWhile it is my belief that the vast majority of our members would not\nintentionally disparage their fellows based on irrelevant factors like\ngender identity, ethnicity, religion, age, sexual preference, or\nableness, they certainly are not constrained from doing so in a host of\nnon-SFWA venues.\nAnd for the third time, it is easy to prove that Gould is lying. Not only are members constrained from disparaging their fellows in a host of non-SFWA venues, they are expected to constrain their own commenters as well and will be held responsible for ALL of their commenters comments, even if they utilize an open and unmoderated comment system. From the SFWA Report Appendix I. Inclusion of blog comments:\nThis Appendix examines the question of whether to give weight to comments made on Beale’s blog by people other than himself. A key question is whether or not Beale actively manages the content of the comment threads on his blog by removing comments: if he does so, it follows that he has permitted all\nother comments to remain.\nIn considering the question, it’s worth looking at the precise meaning of the term “moderate” in the context of Blogger, the blogging platform used by Beale. As this article by Blogger explains, turning on Comment Moderation in that platform means that all comments have to be actively approved by the operator of the blog before they are published. Beale’s blog is not moderated in this sense, possibly because the large volume of comments on his posts would make it impractical.\nHowever, there is evidence to suggest that Beale actively manages the comments on his blog.\n…\nTherefore it would seem that Beale actively manages the content in the comment threads on his blogs, meaning that while he may not necessarily agree with the content of those comments that are not deleted, he does consider them to be appropriate for publication.\n4. Just as SFWA doesn’t control what members and non-members say in\nnon-SFWA spaces, it also doesn’t control what members and non-members say in response to\nmembers’ public comments, statements, essays, and blog posts. When\npersons say things in public that others find objectionable, it is\nlikely they will receive criticism and objections. There is an odd\nmisconception among some that Freedom of Speech includes freedom from\nthe consequences of one’s speech and freedom from commentary on what one\nhas said.\nA fourth and particularly egregious lie. Gould knows that the very blog post he used as an excuse to purge me was a RESPONSE to NK Jemisin’s attack on me, an attack to which he himself linked in the SFWA Forum. Once more, the evidence is in the SFWA Report.\nThe incident which prompted this investigation was Mr. Beale’s use of the SFWAAuthors Twitter account to distribute his blog of June 13, 2013 “A black female fantasist calls for Reconciliation.”\n5. There also seems to be an oddly misplaced tendency to look at SFWA’s recent efforts to moderate language\nin its own channels\nas\nsomehow being responsible for public criticism of various individual’s\npublic statements and positions. I submit, though, that if one\nis somehow threatened by the organization’s requirements that we treat\nfellow members with respect\nwithin our official channels\n, then the problem is someplace other than with SFWA.\nFor the first time, Gould doesn’t directly lie, he merely attempts to deceive with misdirection and then launches another passive-aggressive attack on Mr. Wright. In his attempt to minimize the impact of Mr. Wright’s renunciation of SFWA, he has done nothing more than to show himself to be a shameless liar, and in doing so, helped support Mr. Wright’s case for leaving the organization.\n*Board investigation of harassment complaints may take public statements into consideration, but this is\nextremely\nrare.\nTranslation: Never mind what I said above, we’ll actually do whatever we want, whenever we want. But don’t worry, as long as you stick sufficiently close to the currently approved opinions with which we will provide you, you shouldn’t have a problem. As long as you don’t run for office against me, of course.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-02T12:09:00+00:00"
}