{
  "url": "https://voxday.net/2014/05/16/anti-race-is-anti-science/",
  "scraped_at": "2025-12-16T12:14:40.357524",
  "title": "Anti-race is anti-science",
  "date_display": "May 16, 2014",
  "date_iso": "2014-05-16T13:00:00+00:00",
  "date_from_url": "2014-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be interesting to see the likes of Jared Diamond attempt to explain away the undeniable genetic differences between the various human subspecies; his reference to the Flat Earth Society is as clear a case of emotional projection as one could hope to find. In a chapter entitled “The Human Experiment”, Nicholas Wade observes that criticism-averse biologists are playing a shell game that provides sociologists who don’t understand the relevant science with sufficient cover to deny the scientifically undeniable:</p><blockquote class=\"tr_bq\"><p> Many scholars like to make safe nods to multicultural orthodoxy by implying that human races do not exist. <i>Race? Debunking a Scientific Myth</i> is the title of a recent book by a physical anthropologist and a geneticist, though their text is not nearly so specific. “The concept of race has no genetic or scientific basis,” writes Craig Venter, who was the leading decoder of the human genome but has no known expertise in the relevant discipline of population genetics.</p><p>Only people capable of thinking the Earth is flat believe in the existence of human races, according to the geographer Jared Diamond. “The reality of human races is another commonsense ‘truth’ destined to follow the flat Earth into oblivion,” he asserts. For a subtler position, consider the following statement, which seems to say the same thing. “It is increasingly clear that there is no scientific basis for defining precise ethnic or racial boundaries,” writes Francis Collins, director of the National Human Genome Research Institute in a review of the project’s implications. This form of words, commonly used by biologists to imply that they accept the orthodox political take on the nonexistence of race, means rather less than meets the eye. When a distinct boundary develops between races, they are no longer races but separate species. So to say there are no precise boundaries between races is like saying there are no square circles.</p><p>A few biologists have begun to agree that there are human races, but they hasten to add that the fact means very little. Races exist, but the implications are “not much,” says the evolutionary biologist Jerry Coyne. Too bad—nature has performed this grand 50,000 year experiment, generating scores of fascinating variations on the human theme, only to have evolutionary biologists express disappointment at her efforts.</p><p>From biologists’ obfuscations on the subject of race, sociologists have incorrectly inferred that there is no biological basis for race, confirming their preference for regarding race as just a social construct. How did the academic world contrive to reach a position on race so far removed from reality and commonsense observation?</p><p>The politically driven distortion of scientific views about race can be traced to a sustained campaign from the 1950s onward by the anthropologist Ashley Montagu, who sought to make the word race taboo, at least when referring to people. Montagu, who was Jewish, grew up in the East End district of London, where he experienced considerable anti-Semitism. He was trained as a social anthropologist in London and New York, where he studied under Franz Boas, a champion of racial equality and the belief that culture alone shapes human behavior. He began to promote Boas’s ideas with more zeal than their author. Montagu developed passionate views on the evils of race. “Race is the witchcraft, the demonology of our time, the means by which we exorcise the imagined demoniacal powers among us,” he wrote. “It is the contemporary myth, humankind’s most dangerous myth, America’s Original Sin.”</p><p>In the postwar years, with the horror of the Holocaust weighing on people’s minds, Montagu found ready acceptance of his views. These were prominent in the influential UNESCO statement on race, first issued in 1950, which he helped draft. He believed that imperialism, racism and anti-Semitism were driven by notions of race and could be undermined by showing that races did not exist. However much one may sympathize with Montagu’s motives, it is perhaps simplistic to believe that an evil can be eliminated by banning the words that conceptualize it. But suppression of the word was Montagu’s goal, and to a remarkable extent he succeeded.</p><p>“The very word race is itself racist,” he wrote in his book <i>Man’s Most Dangerous Myth: The Fallacy of Race</i>. Many scholars who understood human races very well began to drop the use of the term rather than risk being ostracized as racists. In a survey taken in 1987, only 50% of physical anthropologists (researchers who deal with human bones) agreed that human races exist, and among social anthropologists (who deal with people) just 29% did so.</p></blockquote><p>How unfortunate for the self-styled anti-racists that scientody is bound, in the end, punch right through the most firmly lodged dogmas of scientistry. It’s a bit ironic that a member of the most tribal people in human history, (and one of the most scientifically accomplished, for that matter), the Jews, should be responsible for this profoundly anti-scientific triumph of propaganda; imagine if Montagu had instead waged a similarly successful campaign against the fundamental evils of a belief in gravity.</p><p>Instead of marveling at the amazing coincidence of people being beaten to death in the wrong part of town, we would be wondering how it was possible that so many people were being mysteriously found dead on the floor of the Grand Canyon.</p><p>But the scientific fact is that race exists, it is a concept based on observable genetic differences that are the result of human microevolution, and those differences have a significant impact on human behavior. The Collins position, which is that while race exists, it does not matter, is weaselly, incorrect, and scientifically outdated.</p><blockquote class=\"tr_bq\"><p> Lewontin’s thesis immediately became the central genetic plank of<br> those who believe that denying the existence of race is an effective way<br> to combat racism. It is prominently cited in <i>Man’s Most Dangerous Myth: The Fallacy of Race</i>,<br> an influential book written by the anthropologist Ashley Montagu with<br> the aim of eliminating race from the political and scientific<br> vocabulary. Lewontin’s statement is quoted at the beginning of the<br> American Anthropological Association’s statement on race and is a<br> founding principle of the assertion by sociologists that race is a<br> social construct, not a biological one.</br></br></br></br></br></br></br></br></p><p>But despite all the<br> weight that continues to be placed on it, Lewontin’s statement is<br> incorrect. It’s not the basic finding that is wrong. Many other studies<br> have confirmed that roughly 85% of human variation is among individuals<br> and 15% between populations. This is just what would be expected, given<br> that each race has inherited its genetic patrimony from the same<br> ancestral population that existed in the comparatively recent past.</br></br></br></br></br></br></p><p>What<br> is in error is Lewontin’s assertion that the amount of variation<br> between populations is so small as to be negligible. In fact it’s quite<br> significant. Sewall Wright, an eminent population geneticist, said that a<br> fixation index of 5% to 15% indicates “moderate genetic<br> differentiation” and that even with an index of 5% or less,<br> “differentiation is by no means negligible.” If differences of 10 to 15%<br> were seen in any other than the human species they would be called<br> subspecies, in Wright’s view.</br></br></br></br></br></br></br></br></p></blockquote><p>It is more than a little ironic that it is those who so loudly proclaim that they “fucking love science” are among the most terrified of the genetic science that touches most closely upon who and what they are. Perhaps it is because I am tri-racial that I don’t give a damn about the racial pieties; what do various pretensions to White supremacy or Asian supremacy or the intrinsic superiority of La Raza  mean to one who is all-of-the-above?</p><p>In matters of race, as in all things, the facts are what they are, not what anyone might wish them to be. And the sooner that we face those facts and begin to deal in terms of objective and scientific reality rather than wishful thinking, the sooner that our social and personal policies are likely to meet with success rather than inevitable and cataclysmic failure.</p></div>",
  "content_text": "It should be interesting to see the likes of Jared Diamond attempt to explain away the undeniable genetic differences between the various human subspecies; his reference to the Flat Earth Society is as clear a case of emotional projection as one could hope to find. In a chapter entitled “The Human Experiment”, Nicholas Wade observes that criticism-averse biologists are playing a shell game that provides sociologists who don’t understand the relevant science with sufficient cover to deny the scientifically undeniable:\nMany scholars like to make safe nods to multicultural orthodoxy by implying that human races do not exist.\nRace? Debunking a Scientific Myth\nis the title of a recent book by a physical anthropologist and a geneticist, though their text is not nearly so specific. “The concept of race has no genetic or scientific basis,” writes Craig Venter, who was the leading decoder of the human genome but has no known expertise in the relevant discipline of population genetics.\nOnly people capable of thinking the Earth is flat believe in the existence of human races, according to the geographer Jared Diamond. “The reality of human races is another commonsense ‘truth’ destined to follow the flat Earth into oblivion,” he asserts. For a subtler position, consider the following statement, which seems to say the same thing. “It is increasingly clear that there is no scientific basis for defining precise ethnic or racial boundaries,” writes Francis Collins, director of the National Human Genome Research Institute in a review of the project’s implications. This form of words, commonly used by biologists to imply that they accept the orthodox political take on the nonexistence of race, means rather less than meets the eye. When a distinct boundary develops between races, they are no longer races but separate species. So to say there are no precise boundaries between races is like saying there are no square circles.\nA few biologists have begun to agree that there are human races, but they hasten to add that the fact means very little. Races exist, but the implications are “not much,” says the evolutionary biologist Jerry Coyne. Too bad—nature has performed this grand 50,000 year experiment, generating scores of fascinating variations on the human theme, only to have evolutionary biologists express disappointment at her efforts.\nFrom biologists’ obfuscations on the subject of race, sociologists have incorrectly inferred that there is no biological basis for race, confirming their preference for regarding race as just a social construct. How did the academic world contrive to reach a position on race so far removed from reality and commonsense observation?\nThe politically driven distortion of scientific views about race can be traced to a sustained campaign from the 1950s onward by the anthropologist Ashley Montagu, who sought to make the word race taboo, at least when referring to people. Montagu, who was Jewish, grew up in the East End district of London, where he experienced considerable anti-Semitism. He was trained as a social anthropologist in London and New York, where he studied under Franz Boas, a champion of racial equality and the belief that culture alone shapes human behavior. He began to promote Boas’s ideas with more zeal than their author. Montagu developed passionate views on the evils of race. “Race is the witchcraft, the demonology of our time, the means by which we exorcise the imagined demoniacal powers among us,” he wrote. “It is the contemporary myth, humankind’s most dangerous myth, America’s Original Sin.”\nIn the postwar years, with the horror of the Holocaust weighing on people’s minds, Montagu found ready acceptance of his views. These were prominent in the influential UNESCO statement on race, first issued in 1950, which he helped draft. He believed that imperialism, racism and anti-Semitism were driven by notions of race and could be undermined by showing that races did not exist. However much one may sympathize with Montagu’s motives, it is perhaps simplistic to believe that an evil can be eliminated by banning the words that conceptualize it. But suppression of the word was Montagu’s goal, and to a remarkable extent he succeeded.\n“The very word race is itself racist,” he wrote in his book\nMan’s Most Dangerous Myth: The Fallacy of Race\n. Many scholars who understood human races very well began to drop the use of the term rather than risk being ostracized as racists. In a survey taken in 1987, only 50% of physical anthropologists (researchers who deal with human bones) agreed that human races exist, and among social anthropologists (who deal with people) just 29% did so.\nHow unfortunate for the self-styled anti-racists that scientody is bound, in the end, punch right through the most firmly lodged dogmas of scientistry. It’s a bit ironic that a member of the most tribal people in human history, (and one of the most scientifically accomplished, for that matter), the Jews, should be responsible for this profoundly anti-scientific triumph of propaganda; imagine if Montagu had instead waged a similarly successful campaign against the fundamental evils of a belief in gravity.\nInstead of marveling at the amazing coincidence of people being beaten to death in the wrong part of town, we would be wondering how it was possible that so many people were being mysteriously found dead on the floor of the Grand Canyon.\nBut the scientific fact is that race exists, it is a concept based on observable genetic differences that are the result of human microevolution, and those differences have a significant impact on human behavior. The Collins position, which is that while race exists, it does not matter, is weaselly, incorrect, and scientifically outdated.\nLewontin’s thesis immediately became the central genetic plank of\nthose who believe that denying the existence of race is an effective way\nto combat racism. It is prominently cited in\nMan’s Most Dangerous Myth: The Fallacy of Race\n,\nan influential book written by the anthropologist Ashley Montagu with\nthe aim of eliminating race from the political and scientific\nvocabulary. Lewontin’s statement is quoted at the beginning of the\nAmerican Anthropological Association’s statement on race and is a\nfounding principle of the assertion by sociologists that race is a\nsocial construct, not a biological one.\nBut despite all the\nweight that continues to be placed on it, Lewontin’s statement is\nincorrect. It’s not the basic finding that is wrong. Many other studies\nhave confirmed that roughly 85% of human variation is among individuals\nand 15% between populations. This is just what would be expected, given\nthat each race has inherited its genetic patrimony from the same\nancestral population that existed in the comparatively recent past.\nWhat\nis in error is Lewontin’s assertion that the amount of variation\nbetween populations is so small as to be negligible. In fact it’s quite\nsignificant. Sewall Wright, an eminent population geneticist, said that a\nfixation index of 5% to 15% indicates “moderate genetic\ndifferentiation” and that even with an index of 5% or less,\n“differentiation is by no means negligible.” If differences of 10 to 15%\nwere seen in any other than the human species they would be called\nsubspecies, in Wright’s view.\nIt is more than a little ironic that it is those who so loudly proclaim that they “fucking love science” are among the most terrified of the genetic science that touches most closely upon who and what they are. Perhaps it is because I am tri-racial that I don’t give a damn about the racial pieties; what do various pretensions to White supremacy or Asian supremacy or the intrinsic superiority of La Raza  mean to one who is all-of-the-above?\nIn matters of race, as in all things, the facts are what they are, not what anyone might wish them to be. And the sooner that we face those facts and begin to deal in terms of objective and scientific reality rather than wishful thinking, the sooner that our social and personal policies are likely to meet with success rather than inevitable and cataclysmic failure.",
  "tags": [
    "science",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-16T12:00:00+00:00"
}