{
  "url": "https://voxday.net/2014/05/05/exploding-orthodoxy/",
  "scraped_at": "2025-12-16T12:13:31.724084",
  "title": "Exploding orthodoxy",
  "date_display": "May 5, 2014",
  "date_iso": "2014-05-05T08:23:00+00:00",
  "date_from_url": "2014-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Murray anticipates that <a href=\"http://online.wsj.com/news/articles/SB10001424052702303380004579521482247869874?mg=reno64-wsj\">“A Troublesome Inheritance: Genes, Race and Human History” by Nicholas Wade</a>, is going to explode more equalitarian minds than his own landmark work did:</p><blockquote class=\"tr_bq\"><p> The orthodoxy’s equivalent of the Nicene Creed has two scientific<br> tenets. The first, promulgated by geneticist Richard Lewontin in “The<br> Apportionment of Human Diversity” (1972), is that the races are so close<br> to genetically identical that “racial classification is now seen to be<br> of virtually no genetic or taxonomic significance.” The second,<br> popularized by the late paleontologist<br> Stephen Jay Gould,<br> is that human evolution in everything but cosmetic differences<br> stopped before humans left Africa, meaning that “human equality is a<br> contingent fact of history,” as he put it in an essay of that title in<br> 1984.</br></br></br></br></br></br></br></br></br></br></p><p>Since the sequencing of the human genome in 2003, what is known by geneticists has increasingly diverged from this orthodoxy, even as social scientists and the mainstream press have steadfastly ignored the new research. Nicholas Wade, for more than 20 years a highly regarded science writer at the New York Times, has written a book that pulls back the curtain….</p><p>At the heart of the book, stated quietly but with<br> command of the technical literature, is a bombshell. It is now known<br> with a high level of scientific confidence that both tenets of the<br> orthodoxy are wrong.</br></br></br></p><p> Mr. Lewontin turns out to have been mistaken<br> on several counts, but the most obvious is this: If he had been right,<br> then genetic variations among humans would not naturally sort people<br> into races and ethnicities. But, as Mr. Wade reports, that’s exactly<br> what happens. A computer given a random sampling of bits of DNA that are<br> known to vary among humans—from among the millions of them—will cluster<br> them into groups that correspond to the self-identified race or<br> ethnicity of the subjects. This is not because the software assigns the<br> computer that objective but because those are the clusters that provide<br> the best statistical fit. If the subjects’ ancestors came from all over<br> the inhabited world, the clusters that first emerge will identify the<br> five major races: Asians, Caucasians, sub-Saharan Africans, Native<br> Americans and the original inhabitants of Australia and Papua New<br> Guinea. If the subjects all come from European ancestry, the clusters<br> will instead correspond to Italians, Germans, French and the rest of<br> Europe’s many ethnicities. Mr. Lewontin was not only wrong but<br> spectacularly wrong. It appears that the most natural of all ways to<br> classify humans genetically is by the racial and ethnic groups that<br> humans have identified from time out of mind.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p> Stephen Jay Gould’s<br> assurance that significant evolution had stopped before humans left<br> Africa has also proved to be wrong—not surprisingly, since it was so<br> counterintuitive to begin with.</br></br></br></p></blockquote><p>Those who still stubbornly cling to their antiscientific belief in human equality are the Flat Earth Society of our day. There is truly nothing surprising here except the name of the author; for a New York Times columnist to abjure liberal race orthodoxy is like a sitting cardinal of the Catholic Church publishing a book declaring that God does not exist.</p><p>All the dogma goodthink with which we were raised, all the statements about “race is only skin deep” and “it’s not genetics, its the culture” and “deep inside we’re all the same” are nothing more than children’s tale meant to obscure the frightening truth. Science is gradually peeling away the orthodox falsehoods; soon it will be impossible to conceal the important and necessary discussions about reality under nonsensical accusations of racism.</p><p>It will be interesting to see how science-loving equalitarians react to the discovery that they will have to choose between science and their faith. I expect that most of them will react as they did when economics made incontrovertibly clear the intrinsic contradictions of socialism and stubbornly cling to their antiscientific beliefs without admitting that they have openly rejected science.</p></div>",
  "content_text": "Charles Murray anticipates that\n“A Troublesome Inheritance: Genes, Race and Human History” by Nicholas Wade\n, is going to explode more equalitarian minds than his own landmark work did:\nThe orthodoxy’s equivalent of the Nicene Creed has two scientific\ntenets. The first, promulgated by geneticist Richard Lewontin in “The\nApportionment of Human Diversity” (1972), is that the races are so close\nto genetically identical that “racial classification is now seen to be\nof virtually no genetic or taxonomic significance.” The second,\npopularized by the late paleontologist\nStephen Jay Gould,\nis that human evolution in everything but cosmetic differences\nstopped before humans left Africa, meaning that “human equality is a\ncontingent fact of history,” as he put it in an essay of that title in\n1984.\nSince the sequencing of the human genome in 2003, what is known by geneticists has increasingly diverged from this orthodoxy, even as social scientists and the mainstream press have steadfastly ignored the new research. Nicholas Wade, for more than 20 years a highly regarded science writer at the New York Times, has written a book that pulls back the curtain….\nAt the heart of the book, stated quietly but with\ncommand of the technical literature, is a bombshell. It is now known\nwith a high level of scientific confidence that both tenets of the\northodoxy are wrong.\nMr. Lewontin turns out to have been mistaken\non several counts, but the most obvious is this: If he had been right,\nthen genetic variations among humans would not naturally sort people\ninto races and ethnicities. But, as Mr. Wade reports, that’s exactly\nwhat happens. A computer given a random sampling of bits of DNA that are\nknown to vary among humans—from among the millions of them—will cluster\nthem into groups that correspond to the self-identified race or\nethnicity of the subjects. This is not because the software assigns the\ncomputer that objective but because those are the clusters that provide\nthe best statistical fit. If the subjects’ ancestors came from all over\nthe inhabited world, the clusters that first emerge will identify the\nfive major races: Asians, Caucasians, sub-Saharan Africans, Native\nAmericans and the original inhabitants of Australia and Papua New\nGuinea. If the subjects all come from European ancestry, the clusters\nwill instead correspond to Italians, Germans, French and the rest of\nEurope’s many ethnicities. Mr. Lewontin was not only wrong but\nspectacularly wrong. It appears that the most natural of all ways to\nclassify humans genetically is by the racial and ethnic groups that\nhumans have identified from time out of mind.\nStephen Jay Gould’s\nassurance that significant evolution had stopped before humans left\nAfrica has also proved to be wrong—not surprisingly, since it was so\ncounterintuitive to begin with.\nThose who still stubbornly cling to their antiscientific belief in human equality are the Flat Earth Society of our day. There is truly nothing surprising here except the name of the author; for a New York Times columnist to abjure liberal race orthodoxy is like a sitting cardinal of the Catholic Church publishing a book declaring that God does not exist.\nAll the dogma goodthink with which we were raised, all the statements about “race is only skin deep” and “it’s not genetics, its the culture” and “deep inside we’re all the same” are nothing more than children’s tale meant to obscure the frightening truth. Science is gradually peeling away the orthodox falsehoods; soon it will be impossible to conceal the important and necessary discussions about reality under nonsensical accusations of racism.\nIt will be interesting to see how science-loving equalitarians react to the discovery that they will have to choose between science and their faith. I expect that most of them will react as they did when economics made incontrovertibly clear the intrinsic contradictions of socialism and stubbornly cling to their antiscientific beliefs without admitting that they have openly rejected science.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-05T07:23:00+00:00"
}