{
  "url": "https://voxday.net/2014/05/27/free-speech-in-corporate-america/",
  "scraped_at": "2025-12-16T12:15:34.174645",
  "title": "Free speech in corporate America",
  "date_display": "May 27, 2014",
  "date_iso": "2014-05-27T13:00:00+00:00",
  "date_from_url": "2014-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While self-described savages are openly attacking free speech at SF conventions, more men are <a href=\"http://www.dailymail.co.uk/news/article-2639528/My-guess-sister-smokin-hot-Tech-guru-fire-creepy-comments-virgin-killers-manifesto-sick-female-fans-swoon-shooter-Twitter.html\">losing their jobs for expressing their opinions</a> on current affairs:</p><blockquote class=\"tr_bq\"><p> A tech guru who was accused of making ‘weird and insensitive’ comments about the murderous manifesto written by Santa Barbara shooter Elliot Rodger has been fired. Rap Genius co-founder Mahbod Moghadam posted a series of bizarre annotations alongside extracts from the virgin killer’s 141-page memoir, including one that speculates that Rodger’s sister must be ‘smokin hot’. After the accusations, he was lambasted as being misogynistic, and it has since emerged that he was let go from the company he helped found.</p></blockquote><p>Would it have been less indicative of hatred for women had Mr. Moghadam speculated that <a href=\"http://i.dailymail.co.uk/i/pix/2014/05/27/article-0-1E373AFC00000578-986_634x663.jpg\">this girl</a> was ugly? Rodger wasn’t an unattractive young man and since his Eurasian features were on the feminine side, it would be logical to conclude that his sister was likely more attractive than the norm. As, in fact, appears to be the case.</p><p>I would think that women, in particular, would want to avoid an employment standard where one will lose one’s job simply for expressing an opinion about a woman’s attractiveness. I tend to suspect that the company was simply looking for an excuse to rid itself of an unwanted founder and took advantage of an opportunity. But coming as it does on the heels of other opinion-related dismissals, the news is somewhat troubling.</p><p>UPDATE: as is so often the case, Moghadam was not actually fired. He merely resigned: <i>“In light of this, Mahbod has resigned – both in his capacity as an<br> employee of the company, and as a member of our board of directors,<br> effective immediately.”</br></br></i></p></div>",
  "content_text": "While self-described savages are openly attacking free speech at SF conventions, more men are\nlosing their jobs for expressing their opinions\non current affairs:\nA tech guru who was accused of making ‘weird and insensitive’ comments about the murderous manifesto written by Santa Barbara shooter Elliot Rodger has been fired. Rap Genius co-founder Mahbod Moghadam posted a series of bizarre annotations alongside extracts from the virgin killer’s 141-page memoir, including one that speculates that Rodger’s sister must be ‘smokin hot’. After the accusations, he was lambasted as being misogynistic, and it has since emerged that he was let go from the company he helped found.\nWould it have been less indicative of hatred for women had Mr. Moghadam speculated that\nthis girl\nwas ugly? Rodger wasn’t an unattractive young man and since his Eurasian features were on the feminine side, it would be logical to conclude that his sister was likely more attractive than the norm. As, in fact, appears to be the case.\nI would think that women, in particular, would want to avoid an employment standard where one will lose one’s job simply for expressing an opinion about a woman’s attractiveness. I tend to suspect that the company was simply looking for an excuse to rid itself of an unwanted founder and took advantage of an opportunity. But coming as it does on the heels of other opinion-related dismissals, the news is somewhat troubling.\nUPDATE: as is so often the case, Moghadam was not actually fired. He merely resigned:\n“In light of this, Mahbod has resigned – both in his capacity as an\nemployee of the company, and as a member of our board of directors,\neffective immediately.”",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-27T12:00:00+00:00"
}