{
  "url": "https://voxday.net/2014/05/31/gatekeepers-vs-defensor-lector/",
  "scraped_at": "2025-12-16T12:15:57.045611",
  "title": "Gatekeepers vs thedefensor lector",
  "date_display": "May 31, 2014",
  "date_iso": "2014-05-31T09:51:00+00:00",
  "date_from_url": "2014-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A pair of contrasting views on the Amazon vs Major Publishers battle appear in the New York Times. Joe Nocera writes <a href=\"http://www.nytimes.com/2014/05/31/opinion/nocera-amazons-bullying-tactics.html?hp&amp;rref=opinion\">of Amazon’s “bullying” tactics</a>:</p><blockquote class=\"tr_bq\"><p> The story really began some years ago, when Amazon began issuing a standard price for e-books of $9.99 — in some cases selling below cost. Publishers feared that they would become locked into the $9.99 price the same way the music industry had been locked into 99-cent songs by Apple’s iTunes service. They fought back by joining forces with Apple, cutting preferable deals to participate in Apple’s e-book-selling service, and then forcing Amazon to go along with the same terms. E-book prices quickly rose.</p><p>Unfortunately for the publishers, their brilliant idea turned out to be an illegal conspiracy, and the government forced them to settle on terms that had the effect of boosting Amazon. Although Amazon has not entirely reverted back to $9.99 e-books, it could if it wanted to, and it has in some cases. In other cases — especially with self-published books or romances — e-book prices are down to $5.99 and even $2.99. “There is a strong gravitational pull downward,” said one publisher (who did not want to be quoted, fearing Amazon’s wrath).</p><p>The way I hear it, what Amazon is insisting upon is a deal where it would no longer have to bear the full brunt of its discounting — the publisher would have to bear some of it, in the form of tighter margins, or even losses. Hachette, meanwhile, contends that it needs to be compensated for the important things publishers do: editing, marketing, and curating.</p><p>This is an argument that may appeal to the cultural elite, but it is unlikely to move Jeff Bezos, Amazon’s founder and chief executive. Publishers, he has been known to say, are gatekeepers. “Even well-meaning gatekeepers slow innovation,” he wrote in his 2011 letter to shareholders, according to Brad Stone, the author of a recent book about Amazon, “The Everything Store.”</p></blockquote><p>The very complaint that Amazon is selling $9.99 books at a loss reveals that it is the publishers who are the bad guys here. They are desperately trying to retain the outdated model for physical books and apply it to ebooks, which makes absolutely no sense, because that allows them to significantly increase their profit margins at the expense of a) Amazon, b) book buyers, and c) authors. Bezos is correct to dismiss the publishers as gatekeepers, and I very much doubt he considers them to be well-meaning ones.</p><p>The other article, a defense of the publishers, inadvertently <a href=\"http://www.nytimes.com/2014/05/31/opinion/how-book-publishers-can-beat-amazon.html?hp&amp;rref=opinion\">proves the exact same point</a>:</p><blockquote class=\"tr_bq\"><p> How did Amazon attain such monopsony power? By providing valuable services? Perhaps, to some extent. But consider that from the moment it introduced its Kindle product, Amazon sold e-books at prices far below what it was buying them for. If Amazon bought an e-book from Hachette for $13, it resold it to a consumer for $9.99, losing $3.01 per e-book. It should come as no surprise that under these circumstances, e-book buyers flocked to Amazon….</p><p>So far, Hachette, to its credit, has been unbending. But Amazon still<br> has its nuclear option. It would appear that unless Amazon backs down —<br> through public pressure or government intervention — publishers will<br> have no choice but to employ their own nuclear option: pull all their<br> books from Amazon and throw their weight behind a law-abiding<br> alternative. Perhaps the best solution would be an online marketplace<br> controlled by the publishers — with the 30 percent commission being<br> split 50-50 with the authors in addition to the author’s royalty.</br></br></br></br></br></br></br></p></blockquote><p>The ironic thing is that the pro-publisher position is based on the fear of the possibility that Amazon might one day do what the publishers <i>have already done</i>. It is based on the idea that Amazon will eventually jack prices up, never mind the fact that Amazon’s entire business model is based on selling more goods and lower prices. The thing is, even if Amazon QUADRUPLED its average price to the book buyer after driving all the major publishers out of business, retail prices would <i>still be lower</i> than the suggested retail price given by most of the major publishers.</p><p>Seriously. The average Amazon price for an ebook is around $6.94. The publishers have been trying to push ebook retail prices up to $27.99; as I pointed out the other day, a new Tor ebook has a digital list price of $27.99, one dollar more than the retail price of $26.99 for the hardcover.</p><p>The inept nature of the defense of the publishers can be seen in the proposed solution. The publishers would NEVER be content with such a system; they would fight it even more vehemently than they are fighting Amazon’s attempt to bring ebook prices down below $5. The major publishers want the old system where they sell the book for half the retail price and pay $2.50 to the author. At $28, they get $14 from which they pay $2.50. That is $11.50 gross profit with an 82 percent profit margin; very healthy indeed.</p><p>If they set up Publizon, they’d have to reduce their prices to $9.99 to compete with Amazon. They’d pay $2.50 to the author as a royalty, plus another $1.50 as per the suggested model. That means that their gross profit would fall to $5.99 and their profit margin to 60 percent. Still healthy, but far less profitable and probably insufficient to maintain their New York office space and the rest of their expensive overhead. And that’s assuming people are willing to buy books at Publizon; knowing the publishers’ general contempt for the book buying public, it is highly unlikely they can successfully set up a retail operation catering to it.</p><p>Meanwhile, they are also competing with Castalia and the other independents, who are selling high-quality ebooks for $4.99. As well as with the self-publishers selling books for as little as $0.99. Any way you look at it, the major publishers cannot possibly survive with their current editorial and distribution structures intact.</p><p>Amazon isn’t the bad guy here. Amazon is the <i>defensor lector</i>, the hero of the hour. And speaking of Amazon, fans of a certain fedora-wearing author will no doubt be pleased to know that Castalia will be announcing the release of a new book on Amazon in the coming week, one entitled <i>CITY BEYOND TIME: Tales of the Fall of Metachronopolis</i>.</p></div>",
  "content_text": "A pair of contrasting views on the Amazon vs Major Publishers battle appear in the New York Times. Joe Nocera writes\nof Amazon’s “bullying” tactics\n:\nThe story really began some years ago, when Amazon began issuing a standard price for e-books of $9.99 — in some cases selling below cost. Publishers feared that they would become locked into the $9.99 price the same way the music industry had been locked into 99-cent songs by Apple’s iTunes service. They fought back by joining forces with Apple, cutting preferable deals to participate in Apple’s e-book-selling service, and then forcing Amazon to go along with the same terms. E-book prices quickly rose.\nUnfortunately for the publishers, their brilliant idea turned out to be an illegal conspiracy, and the government forced them to settle on terms that had the effect of boosting Amazon. Although Amazon has not entirely reverted back to $9.99 e-books, it could if it wanted to, and it has in some cases. In other cases — especially with self-published books or romances — e-book prices are down to $5.99 and even $2.99. “There is a strong gravitational pull downward,” said one publisher (who did not want to be quoted, fearing Amazon’s wrath).\nThe way I hear it, what Amazon is insisting upon is a deal where it would no longer have to bear the full brunt of its discounting — the publisher would have to bear some of it, in the form of tighter margins, or even losses. Hachette, meanwhile, contends that it needs to be compensated for the important things publishers do: editing, marketing, and curating.\nThis is an argument that may appeal to the cultural elite, but it is unlikely to move Jeff Bezos, Amazon’s founder and chief executive. Publishers, he has been known to say, are gatekeepers. “Even well-meaning gatekeepers slow innovation,” he wrote in his 2011 letter to shareholders, according to Brad Stone, the author of a recent book about Amazon, “The Everything Store.”\nThe very complaint that Amazon is selling $9.99 books at a loss reveals that it is the publishers who are the bad guys here. They are desperately trying to retain the outdated model for physical books and apply it to ebooks, which makes absolutely no sense, because that allows them to significantly increase their profit margins at the expense of a) Amazon, b) book buyers, and c) authors. Bezos is correct to dismiss the publishers as gatekeepers, and I very much doubt he considers them to be well-meaning ones.\nThe other article, a defense of the publishers, inadvertently\nproves the exact same point\n:\nHow did Amazon attain such monopsony power? By providing valuable services? Perhaps, to some extent. But consider that from the moment it introduced its Kindle product, Amazon sold e-books at prices far below what it was buying them for. If Amazon bought an e-book from Hachette for $13, it resold it to a consumer for $9.99, losing $3.01 per e-book. It should come as no surprise that under these circumstances, e-book buyers flocked to Amazon….\nSo far, Hachette, to its credit, has been unbending. But Amazon still\nhas its nuclear option. It would appear that unless Amazon backs down —\nthrough public pressure or government intervention — publishers will\nhave no choice but to employ their own nuclear option: pull all their\nbooks from Amazon and throw their weight behind a law-abiding\nalternative. Perhaps the best solution would be an online marketplace\ncontrolled by the publishers — with the 30 percent commission being\nsplit 50-50 with the authors in addition to the author’s royalty.\nThe ironic thing is that the pro-publisher position is based on the fear of the possibility that Amazon might one day do what the publishers\nhave already done\n. It is based on the idea that Amazon will eventually jack prices up, never mind the fact that Amazon’s entire business model is based on selling more goods and lower prices. The thing is, even if Amazon QUADRUPLED its average price to the book buyer after driving all the major publishers out of business, retail prices would\nstill be lower\nthan the suggested retail price given by most of the major publishers.\nSeriously. The average Amazon price for an ebook is around $6.94. The publishers have been trying to push ebook retail prices up to $27.99; as I pointed out the other day, a new Tor ebook has a digital list price of $27.99, one dollar more than the retail price of $26.99 for the hardcover.\nThe inept nature of the defense of the publishers can be seen in the proposed solution. The publishers would NEVER be content with such a system; they would fight it even more vehemently than they are fighting Amazon’s attempt to bring ebook prices down below $5. The major publishers want the old system where they sell the book for half the retail price and pay $2.50 to the author. At $28, they get $14 from which they pay $2.50. That is $11.50 gross profit with an 82 percent profit margin; very healthy indeed.\nIf they set up Publizon, they’d have to reduce their prices to $9.99 to compete with Amazon. They’d pay $2.50 to the author as a royalty, plus another $1.50 as per the suggested model. That means that their gross profit would fall to $5.99 and their profit margin to 60 percent. Still healthy, but far less profitable and probably insufficient to maintain their New York office space and the rest of their expensive overhead. And that’s assuming people are willing to buy books at Publizon; knowing the publishers’ general contempt for the book buying public, it is highly unlikely they can successfully set up a retail operation catering to it.\nMeanwhile, they are also competing with Castalia and the other independents, who are selling high-quality ebooks for $4.99. As well as with the self-publishers selling books for as little as $0.99. Any way you look at it, the major publishers cannot possibly survive with their current editorial and distribution structures intact.\nAmazon isn’t the bad guy here. Amazon is the\ndefensor lector\n, the hero of the hour. And speaking of Amazon, fans of a certain fedora-wearing author will no doubt be pleased to know that Castalia will be announcing the release of a new book on Amazon in the coming week, one entitled\nCITY BEYOND TIME: Tales of the Fall of Metachronopolis\n.",
  "tags": [
    "books",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-31T08:51:00+00:00"
}