{
  "url": "https://voxday.net/2014/05/15/genetic-segregation/",
  "scraped_at": "2025-12-16T12:14:33.412509",
  "title": "Genetic segregation",
  "date_display": "May 15, 2014",
  "date_iso": "2014-05-15T09:11:00+00:00",
  "date_from_url": "2014-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/05/venngenes.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/05/venngenes.jpg\" width=\"282\"/></a></div><p><i>“The regional nature of selection was first made evident in a genomewide scan undertaken by Jonathan Pritchard, a population geneticist at the University of Chicago, in 2006. He looked for genes under selection in the three major races—Africans, East Asians and Europeans (or more exactly Caucasians, but European genetics are at present much better understood, so European populations are the usual subjects of study). Copious genetic data had been collected on each race as part of the HapMap, a project undertaken by the National Institutes of Health to explore the genetic roots of common disease. In each race Pritchard found about 200 genetic regions that showed a characteristic signature of having been under selection (206 in Africans, 185 in East Asians and 188 in Europeans). But in each race, a largely different set of genes was under selection, with only quite minor overlaps.”</i></p><p>The primary theme of Nicholas Wade’s <i><b>A Troublesome Inheritance</b></i> is repeated over and over by Wade in the early chapters like a drumbeat, as if he knows the critical reader is not going to read very far into the book and will misrepresent what Wade is asserting: human evolution has been recent, copious, and regional. It is also apparent that Wade knows why his words are likely to be twisted and attacked: <i>“The fact that human evolution has been recent, copious and regional is not widely recognized, even though it has now been reported by many articles in the literature of genetics. The reason is in part that the knowledge is so new and in part because it raises awkward challenges to deeply held conventional wisdom.”</i></p><p>Genetic science has already exploded most of the equalitarian mantras. We are not all the same under the skin. Race is not a social construct. Race is not only skin-deep. The content of your character can, on average, be estimated by, if not necessarily the color of your skin, the sum total of your superficial features. Human evolution did not stop at some point in the distant past. Civilization is not magically bestowed by geographic location. Education is not the answer.</p><p>The reason even professional biologists are afraid to discuss the current scientific evidence coming out of the genetic laboratories is because it leads to one inescapable conclusion: all of the social policies based upon the idea of basic human equality are doomed to failure. And worse, when combined with other evidence from other disciplines, it leads to a second conclusion: most of the social policies designed to improve the lot of the so-called disadvantaged are not merely doomed to failure, but are intrinsically dyscivic in nature and are more likely to drag the genetically advantaged populations down into semi-barbarism than to help the genetically disadvantaged populations become fully civilized on average.</p><p>Not all of the specifics of these known genetic differences are known, much less the full extent of their effects on human behavior. Some of them are, of course, trivial. But they are not all insignificant. Consider, for example, the example of the MAO-A gene, which is connected to the control of aggression.</p><p><i>“As it happens, the promoter for MAO-A is quite variable in the human population. People may have two, three, four or five copies of it, and the more copies they have, the more of the MAO-A enzyme their cells produce. What difference does this make to a person’s behavior? Quite a lot, it turns out. People with three, four or five copies of the MAO-A promoter are normal but those with only two copies have a much higher level of delinquency…. He and his colleagues looked at the MAO-A promoters in African Americans. The subjects were the same 2,524 American youths in the study by Shih mentioned above. Of the African American men in the sample, 5% carried two MAO-A promoters, the condition that Shih had found to be associated with higher levels of delinquency. Members of the two-promoter group were significantly more likely to have been arrested and imprisoned than African Americans who carried three or four promoters. The same comparison could not be made in white, or Caucasian, males, the researchers report, because only 0.1% carry the two-promoter allele.”</i></p><p>Does this mean that all African-Americans are prone to violence? No, it proves the exact opposite. The vast majority are not. But it does mean that with regards to this single factor related to an individual’s ability to control his own aggression, an African-American male is 50 times more likely to have a genetic handicap in comparison with a white male. Therefore, social policies that blithely assume that African-American males have the same intrinsic ability to control their aggression as white males are not only unscientific, but <a href=\"http://www.wnd.com/2014/05/white-family-stalked-pummeled-by-black-mob/\">can be reliably predicted to fail</a>. That is just one significant genetic distinction that has been discovered. There will be more. There will be many more.</p><p>Equality is not merely unscientific, at this point it is now objectively antiscientific. The undeniable fact of human genetic segregation does not intrinsically justify the eugenic excesses and ethnic cleansings of the past. But sooner or later, as the science advances, it will force the eventual discussion of whether the costs of playing equalitarian make-believe are too high for Western civilization, if that civilization wishes to survive.</p></div>",
  "content_text": "“The regional nature of selection was first made evident in a genomewide scan undertaken by Jonathan Pritchard, a population geneticist at the University of Chicago, in 2006. He looked for genes under selection in the three major races—Africans, East Asians and Europeans (or more exactly Caucasians, but European genetics are at present much better understood, so European populations are the usual subjects of study). Copious genetic data had been collected on each race as part of the HapMap, a project undertaken by the National Institutes of Health to explore the genetic roots of common disease. In each race Pritchard found about 200 genetic regions that showed a characteristic signature of having been under selection (206 in Africans, 185 in East Asians and 188 in Europeans). But in each race, a largely different set of genes was under selection, with only quite minor overlaps.”\nThe primary theme of Nicholas Wade’s\nA Troublesome Inheritance\nis repeated over and over by Wade in the early chapters like a drumbeat, as if he knows the critical reader is not going to read very far into the book and will misrepresent what Wade is asserting: human evolution has been recent, copious, and regional. It is also apparent that Wade knows why his words are likely to be twisted and attacked:\n“The fact that human evolution has been recent, copious and regional is not widely recognized, even though it has now been reported by many articles in the literature of genetics. The reason is in part that the knowledge is so new and in part because it raises awkward challenges to deeply held conventional wisdom.”\nGenetic science has already exploded most of the equalitarian mantras. We are not all the same under the skin. Race is not a social construct. Race is not only skin-deep. The content of your character can, on average, be estimated by, if not necessarily the color of your skin, the sum total of your superficial features. Human evolution did not stop at some point in the distant past. Civilization is not magically bestowed by geographic location. Education is not the answer.\nThe reason even professional biologists are afraid to discuss the current scientific evidence coming out of the genetic laboratories is because it leads to one inescapable conclusion: all of the social policies based upon the idea of basic human equality are doomed to failure. And worse, when combined with other evidence from other disciplines, it leads to a second conclusion: most of the social policies designed to improve the lot of the so-called disadvantaged are not merely doomed to failure, but are intrinsically dyscivic in nature and are more likely to drag the genetically advantaged populations down into semi-barbarism than to help the genetically disadvantaged populations become fully civilized on average.\nNot all of the specifics of these known genetic differences are known, much less the full extent of their effects on human behavior. Some of them are, of course, trivial. But they are not all insignificant. Consider, for example, the example of the MAO-A gene, which is connected to the control of aggression.\n“As it happens, the promoter for MAO-A is quite variable in the human population. People may have two, three, four or five copies of it, and the more copies they have, the more of the MAO-A enzyme their cells produce. What difference does this make to a person’s behavior? Quite a lot, it turns out. People with three, four or five copies of the MAO-A promoter are normal but those with only two copies have a much higher level of delinquency…. He and his colleagues looked at the MAO-A promoters in African Americans. The subjects were the same 2,524 American youths in the study by Shih mentioned above. Of the African American men in the sample, 5% carried two MAO-A promoters, the condition that Shih had found to be associated with higher levels of delinquency. Members of the two-promoter group were significantly more likely to have been arrested and imprisoned than African Americans who carried three or four promoters. The same comparison could not be made in white, or Caucasian, males, the researchers report, because only 0.1% carry the two-promoter allele.”\nDoes this mean that all African-Americans are prone to violence? No, it proves the exact opposite. The vast majority are not. But it does mean that with regards to this single factor related to an individual’s ability to control his own aggression, an African-American male is 50 times more likely to have a genetic handicap in comparison with a white male. Therefore, social policies that blithely assume that African-American males have the same intrinsic ability to control their aggression as white males are not only unscientific, but\ncan be reliably predicted to fail\n. That is just one significant genetic distinction that has been discovered. There will be more. There will be many more.\nEquality is not merely unscientific, at this point it is now objectively antiscientific. The undeniable fact of human genetic segregation does not intrinsically justify the eugenic excesses and ethnic cleansings of the past. But sooner or later, as the science advances, it will force the eventual discussion of whether the costs of playing equalitarian make-believe are too high for Western civilization, if that civilization wishes to survive.",
  "tags": [
    "science",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-15T08:11:00+00:00"
}