{
  "url": "https://voxday.net/2014/05/10/geno-cultural-eucivicis/",
  "scraped_at": "2025-12-16T12:14:04.087307",
  "title": "Geno-cultural eucivicism",
  "date_display": "May 10, 2014",
  "date_iso": "2014-05-10T10:23:00+00:00",
  "date_from_url": "2014-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The “culture is not genetic” crowd is finished, they simply don’t realize it yet because they a) have never thought logically through their position, and, b) are not up on the relevant science. <a href=\"http://www.newscientist.com/article/dn25538-how-your-ancestors-farms-shaped-your-thinking.html#.U22YjFE9hfQ\">This study of differing Han cognitive styles</a> is but one of the many examples that is putting the coup de grace into the blank slate myth:</p><blockquote class=\"tr_bq\"><p> It has long been suggested that China’s reliance on rice fostered collectivist attitudes, and the Confucian emphasis on group allegiance and conformity. Such attitudes are even cited as explaining why Europe, rather than China, was the home of the industrial revolution: the revolution was based on scientific thinking, which is held to rely on individualism and openness to innovation. But the idea that growing rice promotes a group mentality remained speculation.</p><p>Talhelm and his colleagues in China decided to test it. They gave standard tests for cognitive style, individualism, and in-group loyalty to 1162 students in six cities across China, in wheat or rice-growing areas. All were Han Chinese, China’s dominant ethnic group, so other differences were hopefully minimal.</p><p>Nevertheless, they found many differences in cognitive style. For instance, students from all-wheat areas were 56 per cent more likely to think analytically than students from all-rice areas. For example, when asked to match the two closest of sheep, dog and grass, they grouped sheep and dog, which appear most similar. Students from rice-growing areas grouped sheep and grass, as these have the closest relationship to each other in real life, and to them this relationship mattered more than physical resemblance.</p></blockquote><p>I read Wade’s <i>A Troublesome Inheritance</i> yesterday, and while it was not without flaws, it does make for a useful roundup of the current state of genetic science as it presently relates to race, culture, and civilization. It is very nearly a restatement of my time-to-civilization hypothesis, and even provides some evidence in support of this.</p><p>Due to the intertwining of genetic microevolution, culture, and individual behavior, it is very likely that the differences in cognitive style observed are the result of genetic microevolution in the divergent Han populations brought about by the different growing cultures. It might be useful to think of these “cultural selections” as inadvertent genetic programming which tends to have either eucivic or dyscivic consequences over time.</p><p>I will get into this in considerably more detail over the next week, but after reading Wade’s book, it is apparent to me that geno-cultural eucivicism is likely to become one of the more important concepts of the 21st century.</p></div>",
  "content_text": "The “culture is not genetic” crowd is finished, they simply don’t realize it yet because they a) have never thought logically through their position, and, b) are not up on the relevant science.\nThis study of differing Han cognitive styles\nis but one of the many examples that is putting the coup de grace into the blank slate myth:\nIt has long been suggested that China’s reliance on rice fostered collectivist attitudes, and the Confucian emphasis on group allegiance and conformity. Such attitudes are even cited as explaining why Europe, rather than China, was the home of the industrial revolution: the revolution was based on scientific thinking, which is held to rely on individualism and openness to innovation. But the idea that growing rice promotes a group mentality remained speculation.\nTalhelm and his colleagues in China decided to test it. They gave standard tests for cognitive style, individualism, and in-group loyalty to 1162 students in six cities across China, in wheat or rice-growing areas. All were Han Chinese, China’s dominant ethnic group, so other differences were hopefully minimal.\nNevertheless, they found many differences in cognitive style. For instance, students from all-wheat areas were 56 per cent more likely to think analytically than students from all-rice areas. For example, when asked to match the two closest of sheep, dog and grass, they grouped sheep and dog, which appear most similar. Students from rice-growing areas grouped sheep and grass, as these have the closest relationship to each other in real life, and to them this relationship mattered more than physical resemblance.\nI read Wade’s\nA Troublesome Inheritance\nyesterday, and while it was not without flaws, it does make for a useful roundup of the current state of genetic science as it presently relates to race, culture, and civilization. It is very nearly a restatement of my time-to-civilization hypothesis, and even provides some evidence in support of this.\nDue to the intertwining of genetic microevolution, culture, and individual behavior, it is very likely that the differences in cognitive style observed are the result of genetic microevolution in the divergent Han populations brought about by the different growing cultures. It might be useful to think of these “cultural selections” as inadvertent genetic programming which tends to have either eucivic or dyscivic consequences over time.\nI will get into this in considerably more detail over the next week, but after reading Wade’s book, it is apparent to me that geno-cultural eucivicism is likely to become one of the more important concepts of the 21st century.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-10T09:23:00+00:00"
}