{
  "url": "https://voxday.net/2014/05/20/how-to-vote-no-award/",
  "scraped_at": "2025-12-16T12:14:56.433769",
  "title": "How to vote No Award",
  "date_display": "May 20, 2014",
  "date_iso": "2014-05-20T17:00:00+00:00",
  "date_from_url": "2014-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hugo voters are instructed in <a href=\"http://theweaselking.livejournal.com/4574210.html?nojs=1\">the most effective way to use the No Award vote</a> by the Weasel King:</p><blockquote class=\"tr_bq\"><p> More so this year than most years, it’s important to understand how voting “No Award” works.</p><p>The Teal Deer: <b>If you want to vote No Award over something, put No Award at the end of your ballot and DO NOT list the things you’re voting No Award over.</b></p><p>Basically, if you put something on your ballot AT ALL, you risk your vote going to that thing, especially since “No Award” is most often the first thing eliminated. The reason it works that way is a little counterintuitive, until you realise that No Award is just another candidate on the ballot.</p><p>For an example showing the problem, let’s take perennial No-Award-voting favourite category, “Best Doctor Who Episode Written By Stephen Moffat”. In 2012, the candidates were Community, some dude having a meltdown at the previous year’s Hugo awards, and three largely indistinguishable Doctor Who episodes written by Stephen Moffat, Neil Gaiman aping the style of Stephen Moffat, and Tom MacRae.</p><p>Let’s imagine your ballot. You are a sensible person of good taste! You want Community to win and all the other options to die in a fire.</p><p>You SHOULD vote:<br> 1. Community<br> 2. No Award</br></br></p><p>The naive model of Hugo voting that a great many people have might make this mistake, though: Because they want the other options to die in a fire, but ESPECIALLY hate that one dude’s meltdown and the particularly bad Stephen Moffat episode, they might vote like this<br> 1. Community<br> 2. No Award<br> 3. Some dude having a meltdown onstage<br> 4. Stephen Moffat.</br></br></br></br></p><p>And, y’see, that’s bad. Because of how the vote counting works, many people THINK they’re “leaving off” Tom MacRae and Neil Gaiman but making extra sure to “downvote” Moffat and Some Dude, when actually they’re voting *for* Some Dude and Stephen Moffat *over* MacRae and Gaiman.</p><p>Because the voters in this category historically have poor taste, let’s imagine the first-round of ballots runs:</p><p>Gaiman:50<br> Moffat: 40<br> MacRae: 30<br> Some Dude: 30<br> No Award: 10<br> Community: 1. You are the only person with taste this hypothetical year, hypothetical Hugo Voter.</br></br></br></br></br></p><p>So, Community is eliminated, and all the first-place Community votes (yours) now go to their second choice: No Award. Which is now last and *it* is eliminated, which dumps all the votes for it (including yours) to the next choice down. In your case, Some Dude.</p><p>Let’s pretend the 10 people who stuck No Award first really did mean it and didn’t list anything, so their votes now vanish. This leaves the current voting as:</p><p>Gaiman:50<br> Moffat: 40<br> Some Dude: 31<br> MacRae: 30… and MacRae is now last, and is eliminated.</br></br></br></p><p>Congratulations, Hugo Voter. You just eliminated Tom MacRae by throwing your support to Some Dude, when you *meant* to say that Some Dude was so terrible that the only person he should lose to this year is Stephen Moffat and you were actually somewhat okay with Tom MacRae even if you didn’t think Doctor Who should be mistaken for “best of the year”.</p></blockquote><p>More so than most years? Duly noted. I shall be certain to provide my Hugo recommendations once the Hugo packet has been released and I’ve had the chance to read it. I have a feeling No Award is going to do very, very well across the board this year.</p><p>He’ll surely beat this guy: Charles Stross showed a complete lack of class in claiming his rival Larry Correia’s Best Novel-nominated <i>WARBOUND </i>“<a href=\"http://www.antipope.org/charlie/blog-static/2014/05/some-news-about-the-hugo-voter.html#comment-1953729\">is on the ballot as a protest nomination, not a real contender</a>” for the award. I’ve read the work of both men, I like the work of both men, and I can say <i>WARBOUND </i>is better than any full-length work Stross has published except the excellent <i>ACCELERANDO</i>. Of course, voters may not be able to read Mr. Stross’s work anyhow since, unlike Mr. Correia’s publisher, Mr. Stross’s publisher has refused to include the complete novel in the Hugo packet.</p><p>Stross writes: <i>“My point about Correia is that he and V* D* allegedly engaged in<br> ballot-stuffing — jointly advancing an example shortlist and<br> encouraging their fans to vote for the party line. To the extent that<br> this happened (and we’ll probably find out after the awards when the<br> usual nomination breakdown is released) then he and V* D* both picked up<br> votes from one another’s clan, thereby amplifying the volume of their<br> nominations.”</br></br></br></br></br></br></i></p><p>The point is totally false. Unlike Stross himself, who explicitly declared he was engaged in a “shameless campaign” for specific Hugo nominations this year, I neither campaigned nor ballot-stuffed anything. The fact is that I put up a single post with my own recommendations, which differed at least somewhat from Larry’s, just like dozens of other writers in the field. If I happen to have more loyal readers than other authors, well, it is a popularity contest, isn’t it?</p></div>",
  "content_text": "Hugo voters are instructed in\nthe most effective way to use the No Award vote\nby the Weasel King:\nMore so this year than most years, it’s important to understand how voting “No Award” works.\nThe Teal Deer:\nIf you want to vote No Award over something, put No Award at the end of your ballot and DO NOT list the things you’re voting No Award over.\nBasically, if you put something on your ballot AT ALL, you risk your vote going to that thing, especially since “No Award” is most often the first thing eliminated. The reason it works that way is a little counterintuitive, until you realise that No Award is just another candidate on the ballot.\nFor an example showing the problem, let’s take perennial No-Award-voting favourite category, “Best Doctor Who Episode Written By Stephen Moffat”. In 2012, the candidates were Community, some dude having a meltdown at the previous year’s Hugo awards, and three largely indistinguishable Doctor Who episodes written by Stephen Moffat, Neil Gaiman aping the style of Stephen Moffat, and Tom MacRae.\nLet’s imagine your ballot. You are a sensible person of good taste! You want Community to win and all the other options to die in a fire.\nYou SHOULD vote:\n1. Community\n2. No Award\nThe naive model of Hugo voting that a great many people have might make this mistake, though: Because they want the other options to die in a fire, but ESPECIALLY hate that one dude’s meltdown and the particularly bad Stephen Moffat episode, they might vote like this\n1. Community\n2. No Award\n3. Some dude having a meltdown onstage\n4. Stephen Moffat.\nAnd, y’see, that’s bad. Because of how the vote counting works, many people THINK they’re “leaving off” Tom MacRae and Neil Gaiman but making extra sure to “downvote” Moffat and Some Dude, when actually they’re voting *for* Some Dude and Stephen Moffat *over* MacRae and Gaiman.\nBecause the voters in this category historically have poor taste, let’s imagine the first-round of ballots runs:\nGaiman:50\nMoffat: 40\nMacRae: 30\nSome Dude: 30\nNo Award: 10\nCommunity: 1. You are the only person with taste this hypothetical year, hypothetical Hugo Voter.\nSo, Community is eliminated, and all the first-place Community votes (yours) now go to their second choice: No Award. Which is now last and *it* is eliminated, which dumps all the votes for it (including yours) to the next choice down. In your case, Some Dude.\nLet’s pretend the 10 people who stuck No Award first really did mean it and didn’t list anything, so their votes now vanish. This leaves the current voting as:\nGaiman:50\nMoffat: 40\nSome Dude: 31\nMacRae: 30… and MacRae is now last, and is eliminated.\nCongratulations, Hugo Voter. You just eliminated Tom MacRae by throwing your support to Some Dude, when you *meant* to say that Some Dude was so terrible that the only person he should lose to this year is Stephen Moffat and you were actually somewhat okay with Tom MacRae even if you didn’t think Doctor Who should be mistaken for “best of the year”.\nMore so than most years? Duly noted. I shall be certain to provide my Hugo recommendations once the Hugo packet has been released and I’ve had the chance to read it. I have a feeling No Award is going to do very, very well across the board this year.\nHe’ll surely beat this guy: Charles Stross showed a complete lack of class in claiming his rival Larry Correia’s Best Novel-nominated\nWARBOUND\n“\nis on the ballot as a protest nomination, not a real contender\n” for the award. I’ve read the work of both men, I like the work of both men, and I can say\nWARBOUND\nis better than any full-length work Stross has published except the excellent\nACCELERANDO\n. Of course, voters may not be able to read Mr. Stross’s work anyhow since, unlike Mr. Correia’s publisher, Mr. Stross’s publisher has refused to include the complete novel in the Hugo packet.\nStross writes:\n“My point about Correia is that he and V* D* allegedly engaged in\nballot-stuffing — jointly advancing an example shortlist and\nencouraging their fans to vote for the party line. To the extent that\nthis happened (and we’ll probably find out after the awards when the\nusual nomination breakdown is released) then he and V* D* both picked up\nvotes from one another’s clan, thereby amplifying the volume of their\nnominations.”\nThe point is totally false. Unlike Stross himself, who explicitly declared he was engaged in a “shameless campaign” for specific Hugo nominations this year, I neither campaigned nor ballot-stuffed anything. The fact is that I put up a single post with my own recommendations, which differed at least somewhat from Larry’s, just like dozens of other writers in the field. If I happen to have more loyal readers than other authors, well, it is a popularity contest, isn’t it?",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-20T16:00:00+00:00"
}