{
  "url": "https://voxday.net/2014/05/04/if-you-dont-mind/",
  "scraped_at": "2025-12-16T12:13:28.031722",
  "title": "If you don’t mind",
  "date_display": "May 4, 2014",
  "date_iso": "2014-05-04T17:00:00+00:00",
  "date_from_url": "2014-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We are going to be announcing a pair of John C. Wright books this week, although only one of them is going to be of interest to the many of you who have already had the good fortune to read his previous release. As you may have noticed on the sidebar, Castalia is releasing AWAKE IN THE NIGHT as a stand-alone novella for the purpose of raising awareness of the excellent AWAKE IN THE NIGHT LAND via the KDP Select program.</p><p>However, since it is a different listing with a different ASIN, <a href=\"http://www.amazon.com/Awake-Night-John-C-Wright-ebook/dp/B00K425CL6\">AWAKE IN THE NIGHT</a> presently lacks reviews. So, I’d like to ask those of you who reviewed the complete collection to copy the relevant aspects of your review to the listing for the single novella as well, if you don’t mind. The sooner the better, if you happen to have the time.</p></div>",
  "content_text": "We are going to be announcing a pair of John C. Wright books this week, although only one of them is going to be of interest to the many of you who have already had the good fortune to read his previous release. As you may have noticed on the sidebar, Castalia is releasing AWAKE IN THE NIGHT as a stand-alone novella for the purpose of raising awareness of the excellent AWAKE IN THE NIGHT LAND via the KDP Select program.\nHowever, since it is a different listing with a different ASIN,\nAWAKE IN THE NIGHT\npresently lacks reviews. So, I’d like to ask those of you who reviewed the complete collection to copy the relevant aspects of your review to the listing for the single novella as well, if you don’t mind. The sooner the better, if you happen to have the time.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-04T16:00:00+00:00"
}