{
  "url": "https://voxday.net/2014/05/26/qed/",
  "scraped_at": "2025-12-16T12:15:30.517678",
  "title": "QED",
  "date_display": "May 26, 2014",
  "date_iso": "2014-05-26T17:55:00+00:00",
  "date_from_url": "2014-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears I may have erred in describing NK Jemisin as “an educated, but ignorant half-savage”. I was <a href=\"http://nkjemisin.com/2014/05/wiscon-38-guest-of-honor-speech/\">clearly too generous</a> in giving her the benefit of the doubt, as she is, by her own admission, “all savage and damned proud of it”.</p><blockquote class=\"tr_bq\"><p> This is why I say I was premature in calling for a reconciliation. Reconciliations are for after the violence has ended. In South Africa the Truth &amp; Reconciliation Commission came after apartheid’s end; in Rwanda it started after the genocide stopped; in Australia reconciliation began after its indigenous people stopped being classified as “fauna” by its government. Reconciliation is a part of the healing process, but how can there be healing when the wounds are still being inflicted? How can we begin to talk about healing when all the perpetrators have to do is toss out dogwhistles and disclaimers of evil intent to pretend they’ve done no harm?</p><p>(Incidentally: Mr. Various Diseases, Mr. Civility, and Misters and Misses<br> Free Speech At All Costs, if you represent the civilization to which<br> I’m supposed to aspire then I am <b>all</b> savage, and damned proud of it.  You may collectively kiss my black ass)….</br></br></p><p>There are some signs of hope, I guess:  SFWA did throw that one bigot<br> out, though plenty more remain.  Chip Delany’s been honored as a SFWA<br> Grandmaster some fifty years after one of his novels was rejected for<br> serialization in ANALOG because its editors didn’t think anyone could<br> relate to a black protagonist.  WisCon invited me here to be one of its<br> Guests of Honor, five years after I ragequit the Concom over the<br> Elizabeth Moon affair.  We are talking about what’s happening.  We are<br> fighting back.  But I am desperately afraid that Delany’s prediction<br> will continue to prove true, and that the violence will escalate as more<br> of us step up and demand that our contributions be recognized, our<br> personhood respected, our presence acknowledged.  If that’s the case,<br> then we haven’t seen the worst of it yet.  And we need to prepare.</br></br></br></br></br></br></br></br></br></br></br></p><p>So.  If they think we are a threat?  Let’s give them a threat.  They<br> want to call us savages?  Let’s show them exactly what that means.</br></p></blockquote><p>Yes, because history is absolutely rife with examples of how well savages fare when faced with civilized opposition. I note, with no small amusement, that Jemisin has now publicly conceded the truth of everything I wrote in that controversial Twitter-linked post last summer. She has not only conceded her barbarism and her inability to grasp the fundamental nature of SF/F, but the nonsensical nature of her call for “reconciliation” in SF/F as well.</p><p>Last summer, <a href=\"http://www.milobookclub.com/2013/06/13/a-black-female-fantasis/\">I wrote</a>:<i> “Jemisin clearly does not understand that her dishonest call for<br> “reconciliation” and even more diversity within SF/F is tantamount to a<br> call for its decline into irrelevance. Nor do the back-patting Samuel<br> Johnsons wiping their eyes and congratulating her for her<br> ever-so-touching speech understand that.</br></br></br></br></i><br> <i>There can be no reconciliation between the observant and the delusional.”</i></br></p><p>Even the most skeptical critic must admit that I warned everyone the pinkshirt inquisition would not end with me. Don’t let that “plenty more remain” escape your notice. Remember, this is the woman who would read out Robert Heinlein himself out from the SF genre on the basis of his being “<a href=\"http://nkjemisin.com/2012/09/things-people-need-to-understand-issue-223-2/\">racist as fuck</a>“, as well as “the average American” and “most of science fiction fandom” too.</p><p>I, for one, welcome this escalation. I think it is a wonderful thing that the other side has finally admitted the ideological conflict they have long denied. I find it encouraging that they now openly confess they seek to “Make them uncomfortable.  Shout them down.  Kick them out.”</p><p>Disnearations of civilization indeed.</p></div>",
  "content_text": "It appears I may have erred in describing NK Jemisin as “an educated, but ignorant half-savage”. I was\nclearly too generous\nin giving her the benefit of the doubt, as she is, by her own admission, “all savage and damned proud of it”.\nThis is why I say I was premature in calling for a reconciliation. Reconciliations are for after the violence has ended. In South Africa the Truth & Reconciliation Commission came after apartheid’s end; in Rwanda it started after the genocide stopped; in Australia reconciliation began after its indigenous people stopped being classified as “fauna” by its government. Reconciliation is a part of the healing process, but how can there be healing when the wounds are still being inflicted? How can we begin to talk about healing when all the perpetrators have to do is toss out dogwhistles and disclaimers of evil intent to pretend they’ve done no harm?\n(Incidentally: Mr. Various Diseases, Mr. Civility, and Misters and Misses\nFree Speech At All Costs, if you represent the civilization to which\nI’m supposed to aspire then I am\nall\nsavage, and damned proud of it.  You may collectively kiss my black ass)….\nThere are some signs of hope, I guess:  SFWA did throw that one bigot\nout, though plenty more remain.  Chip Delany’s been honored as a SFWA\nGrandmaster some fifty years after one of his novels was rejected for\nserialization in ANALOG because its editors didn’t think anyone could\nrelate to a black protagonist.  WisCon invited me here to be one of its\nGuests of Honor, five years after I ragequit the Concom over the\nElizabeth Moon affair.  We are talking about what’s happening.  We are\nfighting back.  But I am desperately afraid that Delany’s prediction\nwill continue to prove true, and that the violence will escalate as more\nof us step up and demand that our contributions be recognized, our\npersonhood respected, our presence acknowledged.  If that’s the case,\nthen we haven’t seen the worst of it yet.  And we need to prepare.\nSo.  If they think we are a threat?  Let’s give them a threat.  They\nwant to call us savages?  Let’s show them exactly what that means.\nYes, because history is absolutely rife with examples of how well savages fare when faced with civilized opposition. I note, with no small amusement, that Jemisin has now publicly conceded the truth of everything I wrote in that controversial Twitter-linked post last summer. She has not only conceded her barbarism and her inability to grasp the fundamental nature of SF/F, but the nonsensical nature of her call for “reconciliation” in SF/F as well.\nLast summer,\nI wrote\n:\n“Jemisin clearly does not understand that her dishonest call for\n“reconciliation” and even more diversity within SF/F is tantamount to a\ncall for its decline into irrelevance. Nor do the back-patting Samuel\nJohnsons wiping their eyes and congratulating her for her\never-so-touching speech understand that.\nThere can be no reconciliation between the observant and the delusional.”\nEven the most skeptical critic must admit that I warned everyone the pinkshirt inquisition would not end with me. Don’t let that “plenty more remain” escape your notice. Remember, this is the woman who would read out Robert Heinlein himself out from the SF genre on the basis of his being “\nracist as fuck\n“, as well as “the average American” and “most of science fiction fandom” too.\nI, for one, welcome this escalation. I think it is a wonderful thing that the other side has finally admitted the ideological conflict they have long denied. I find it encouraging that they now openly confess they seek to “Make them uncomfortable.  Shout them down.  Kick them out.”\nDisnearations of civilization indeed.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-26T16:55:00+00:00"
}