{
  "url": "https://voxday.net/2014/05/28/reproductive-equality/",
  "scraped_at": "2025-12-16T12:15:40.414237",
  "title": "Reproductive equality",
  "date_display": "May 28, 2014",
  "date_iso": "2014-05-28T13:00:00+00:00",
  "date_from_url": "2014-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An Ohio bill addresses one long-ignored injustice intrinsic to current abortion law, <a href=\"http://dadsrights.com/index.php/new-abortion-legislation/\">reproductive inequality</a>.</p><blockquote class=\"tr_bq\"><p> Legislation in the Ohio House of Representatives (House Bill 252)<br> requires written consent from the father of an unborn child in order to<br> perform an abortion.  The bill will put to test the “it’s my body, it’s<br> my right” notion of pro-choice activists by adding the rights of the<br> father of the unborn child into the equation.  Ideally, the decision of<br> abortion should be a consensus between both parents, with both parties<br> being involved in any decisions regarding the child.</br></br></br></br></br></br></p><p>This is a significant legal and social issue where parental rights<br> are heavily unbalanced due to the fact that a father plays no role in a<br> matter as critical as his unborn child’s life.  If a woman decides to<br> keep her child, the father is required to pay child support regardless<br> of whether he wanted to keep the child or not, or face future jail time.<br>  A father currently has no say.  Alternatively he cannot opt-out of<br> parenthood, but a woman can: She can do so by abortion.</br></br></br></br></br></br></p><p>Under the Ohio Bill, a woman must have written consent from the<br> father; if a woman is claiming rape, she must file a police report,<br> provide other court documents or an official complaint of the incident.<br>  If the woman chooses to undergo an abortion in this case, the physician<br> must have “reasonable cause” to believe the woman’s claim of rape and<br> thus, perform an abortion.  In cases where the father may be unknown, a<br> list of all potential fathers must be submitted to a physician.  They<br> will all be contacted and summoned to a paternity test.  If the father<br> is not found, no abortion can be performed.  The bill would turn<br> abortion without a father’s permission or naming a “false biological<br> father” into a first-degree misdemeanor with a maximum $1,000 fine.  A<br> second occasion of providing false information would be considered a<br> fifth degree felony.</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I’d vastly prefer to see abortion banned and prosecuted as manslaughter, but this is a realistic and not-unreasonable step in the right direction. After all, his DNA, his choice. A woman should no more be permitted to unilaterally choose abortion than a man should be permitted to force a woman to get one.</p></div>",
  "content_text": "An Ohio bill addresses one long-ignored injustice intrinsic to current abortion law,\nreproductive inequality\n.\nLegislation in the Ohio House of Representatives (House Bill 252)\nrequires written consent from the father of an unborn child in order to\nperform an abortion.  The bill will put to test the “it’s my body, it’s\nmy right” notion of pro-choice activists by adding the rights of the\nfather of the unborn child into the equation.  Ideally, the decision of\nabortion should be a consensus between both parents, with both parties\nbeing involved in any decisions regarding the child.\nThis is a significant legal and social issue where parental rights\nare heavily unbalanced due to the fact that a father plays no role in a\nmatter as critical as his unborn child’s life.  If a woman decides to\nkeep her child, the father is required to pay child support regardless\nof whether he wanted to keep the child or not, or face future jail time.\nA father currently has no say.  Alternatively he cannot opt-out of\nparenthood, but a woman can: She can do so by abortion.\nUnder the Ohio Bill, a woman must have written consent from the\nfather; if a woman is claiming rape, she must file a police report,\nprovide other court documents or an official complaint of the incident.\nIf the woman chooses to undergo an abortion in this case, the physician\nmust have “reasonable cause” to believe the woman’s claim of rape and\nthus, perform an abortion.  In cases where the father may be unknown, a\nlist of all potential fathers must be submitted to a physician.  They\nwill all be contacted and summoned to a paternity test.  If the father\nis not found, no abortion can be performed.  The bill would turn\nabortion without a father’s permission or naming a “false biological\nfather” into a first-degree misdemeanor with a maximum $1,000 fine.  A\nsecond occasion of providing false information would be considered a\nfifth degree felony.\nI’d vastly prefer to see abortion banned and prosecuted as manslaughter, but this is a realistic and not-unreasonable step in the right direction. After all, his DNA, his choice. A woman should no more be permitted to unilaterally choose abortion than a man should be permitted to force a woman to get one.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-28T12:00:00+00:00"
}