{
  "url": "https://voxday.net/2014/05/29/saladin-and-diversity/",
  "scraped_at": "2025-12-16T12:15:45.982148",
  "title": "Saladin and diversity",
  "date_display": "May 29, 2014",
  "date_iso": "2014-05-29T11:18:00+00:00",
  "date_from_url": "2014-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The great Islamic sultan Saladin succeeded his uncle as vizier to the Fatimid caliph before he engineered a largely bloodless coup that allowed him to supplant the Fatimids and establish the Kurdish Ayyubid dynasty in Egypt. However, two years before the coup, he was faced with the challenge of dealing with a large foreign army who had been imported by the caliph in order to better control the oft-restive Egyptian and Syrian emirs. From Thomas Asbridge’s <i>The Crusades: The Authoritative History of the War for the Holy Land</i>:</p><blockquote class=\"tr_bq\"><p> In the early summer of 1169, Mutamin, the leading eunuch within the caliph’s palace, sought to engineer a coup against Saladin, opening channels of negotiation with the kingdom of Jerusalem in the hope of prompting yet another Frankish invasion of Egypt to topple the Ayyubids. A secret envoy was dispatched from Cairo, disguised as a beggar, but passing near Bilbais a Syrian Turk spotted that he was wearing new sandals whose fine quality jarred with his otherwise ragged appearance. With suspicions aroused, the agent was arrested and letters to the Franks discovered, sewn into the lining of his shoes, revealing the plot. Saladin curtailed the independence of the Fatimid court, executing the eunuch Mutamin in August and replacing him with Qaragush, who from this point forward presided over all palace affairs.</p><p>Saladin’s severe intervention elicited an outbreak of unrest among Cairo’s military garrison.The city was packed with some 50,000 black Sudanese troops, whose loyalty to the caliph made them a dangerous counter to Ayyubid authority. For two days they rioted through the streets, marching on Saladin’s position in the vizier’s palace. Abu’l Haija the Fat was sent to stem their advance, but Saladin knew that he lacked the manpower to prevail in open combat and soon adopted less direct tactics. Most of the Sudanese lived with their families in the al-Mansura quarter of Cairo. Saladin ordered that the entire area be set alight, according to one Muslim contemporary leaving it ‘to burn down around [the rebelling troops’] possessions, children and women’. With their morale shattered by this callous atrocity, the Sudanese agreed a truce, the terms of which were supposed to provide for safe passage up the Nile. But once out of the city and travelling south in smaller, disorganised groups, they fell victim to treacherous counter-attacks from Turan-Shah and were virtually annihilated.</p></blockquote><p>It should be noted that Turan-Shah was Saladin’s brother and lieutenant. Now consider: Cairo was founded in 973 and by 1340 it had a population of “nearly half a million”. If we generously assume the population of Cairo was 400,000 in 1169, this means that Saladin managed to eliminate or forcibly deport an armed foreign population that made up between 12 and 20 percent of the entire populace in a matter of <i>days</i>.</p><p>Keep that in mind when you assume that because there are a large number of foreign immigrants in a previously homogenous society, there always will be. Being one of the greatest and most decisive generals in human history, Saladin’s ruthless actions were more efficient and effective than most of their kind, but these periodic ethnic cleansings are the historical norm throughout the world and have reliably followed periods of relative peace and mass immigration.</p><p>The point is not to argue that these actions are good, only that they appear to be a predictable consequence of importing large numbers of foreigners. Of course, there is another known historical alternative, such as when the Ayyubid sultan was overthrown by his imported Mamluk slave soldiers 81 years later.</p><p>Sometimes the native populations win, sometimes the immigrants do. Saladin himself was a Kurd, after all, not an Egyptian or an Arab, although he was fully accepted by the Egyptians and Arabs over whom he ruled and he remains one of the greatest heroes of both Islam and Arabia. But the one thing that never seems to happen is for everyone to live together in one peaceful, multi-ethnic society. Not for long, anyhow.</p></div>",
  "content_text": "The great Islamic sultan Saladin succeeded his uncle as vizier to the Fatimid caliph before he engineered a largely bloodless coup that allowed him to supplant the Fatimids and establish the Kurdish Ayyubid dynasty in Egypt. However, two years before the coup, he was faced with the challenge of dealing with a large foreign army who had been imported by the caliph in order to better control the oft-restive Egyptian and Syrian emirs. From Thomas Asbridge’s\nThe Crusades: The Authoritative History of the War for the Holy Land\n:\nIn the early summer of 1169, Mutamin, the leading eunuch within the caliph’s palace, sought to engineer a coup against Saladin, opening channels of negotiation with the kingdom of Jerusalem in the hope of prompting yet another Frankish invasion of Egypt to topple the Ayyubids. A secret envoy was dispatched from Cairo, disguised as a beggar, but passing near Bilbais a Syrian Turk spotted that he was wearing new sandals whose fine quality jarred with his otherwise ragged appearance. With suspicions aroused, the agent was arrested and letters to the Franks discovered, sewn into the lining of his shoes, revealing the plot. Saladin curtailed the independence of the Fatimid court, executing the eunuch Mutamin in August and replacing him with Qaragush, who from this point forward presided over all palace affairs.\nSaladin’s severe intervention elicited an outbreak of unrest among Cairo’s military garrison.The city was packed with some 50,000 black Sudanese troops, whose loyalty to the caliph made them a dangerous counter to Ayyubid authority. For two days they rioted through the streets, marching on Saladin’s position in the vizier’s palace. Abu’l Haija the Fat was sent to stem their advance, but Saladin knew that he lacked the manpower to prevail in open combat and soon adopted less direct tactics. Most of the Sudanese lived with their families in the al-Mansura quarter of Cairo. Saladin ordered that the entire area be set alight, according to one Muslim contemporary leaving it ‘to burn down around [the rebelling troops’] possessions, children and women’. With their morale shattered by this callous atrocity, the Sudanese agreed a truce, the terms of which were supposed to provide for safe passage up the Nile. But once out of the city and travelling south in smaller, disorganised groups, they fell victim to treacherous counter-attacks from Turan-Shah and were virtually annihilated.\nIt should be noted that Turan-Shah was Saladin’s brother and lieutenant. Now consider: Cairo was founded in 973 and by 1340 it had a population of “nearly half a million”. If we generously assume the population of Cairo was 400,000 in 1169, this means that Saladin managed to eliminate or forcibly deport an armed foreign population that made up between 12 and 20 percent of the entire populace in a matter of\ndays\n.\nKeep that in mind when you assume that because there are a large number of foreign immigrants in a previously homogenous society, there always will be. Being one of the greatest and most decisive generals in human history, Saladin’s ruthless actions were more efficient and effective than most of their kind, but these periodic ethnic cleansings are the historical norm throughout the world and have reliably followed periods of relative peace and mass immigration.\nThe point is not to argue that these actions are good, only that they appear to be a predictable consequence of importing large numbers of foreigners. Of course, there is another known historical alternative, such as when the Ayyubid sultan was overthrown by his imported Mamluk slave soldiers 81 years later.\nSometimes the native populations win, sometimes the immigrants do. Saladin himself was a Kurd, after all, not an Egyptian or an Arab, although he was fully accepted by the Egyptians and Arabs over whom he ruled and he remains one of the greatest heroes of both Islam and Arabia. But the one thing that never seems to happen is for everyone to live together in one peaceful, multi-ethnic society. Not for long, anyhow.",
  "tags": [
    "Vibrancy is our strength",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-29T10:18:00+00:00"
}