{
  "url": "https://voxday.net/2014/05/21/sff-thought-police-strike-again/",
  "scraped_at": "2025-12-16T12:15:00.150733",
  "title": "SF/F Thought Police strike again",
  "date_display": "May 21, 2014",
  "date_iso": "2014-05-21T13:00:00+00:00",
  "date_from_url": "2014-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or, <a href=\"http://jasoncordova.com/2014/05/20/uncle-timmy-and-the-thought-police/\">why Uncle Timmy was disinvited</a> from Archon:</p><blockquote class=\"tr_bq\"><p> I’m going to tell you a little story about a good man who has been slandered and libeled by one individual who is hiding behind the anonymity of the Internets. That good man? Tim “Uncle Timmy” Bolgeo.</p><p>You see, a pathetic troll whose name I’m not going to bother typing (because it’s a nickname that the individual hides behind because they’re afraid of owning up to their actions) has, after taking random snippets of conversations and tacky jokes that Uncle Timmy publishes on something called “The Revenge”, managed to get Uncle Timmy uninvited from Archon this year. Archon, apparently, is “listening to the fans” (the one who has slandered and committed libel, but we won’t get into that at the moment) and decided that it was in their best interest to not have Uncle Timmy as their Fan Guest of Honor this year.</p><p>Let’s ignore, for the moment, the forty years that Uncle Timmy has dedicated to fandom in the South and Midwest. Let’s forget that he started and ran Libertycon for 25 years, which is one of the more popular “small cons” around. Let’s ignore the fact that the man is extremely smart and is an engineer who has a sterling reputation (except when he’s playing spades. He’s a jerk when he plays spades). Heck, let’s even ignore the fact that Uncle Timmy is an old, fat white dude who started a scholarship for a fan and friend (a black man) after he died tragically while trying to help someone.</p><p>Oh, wait. No. Not only no, but hell no. All these facts are pertinent to the lie being spread that Uncle Timmy is one big old Southern racist redneck who hates science.</p></blockquote><p>I told you none of this was about me, none of it ever had much to do with me. But now you know why I have never backed down to the petty pinkshirted grotesqueries. SFWA, Archon, Rutgers, Smith, Brandeis, Haverford, it’s all the same. It’s all about control of the narrative, control of the organization, and control of the lines of communication.</p><p>That’s why toleration is not an option. That’s why preening oneself on refusing to take a stand is moral cowardice. Those are merely slow forms of surrender and submission. Sad Puppies was the first time the pinkshirts have been punched in the mouth in decades and they reacted like a vampire to Holy Water. But it was a mere splash, when what is needed is an inexhaustible firehose.</p><p>On a related subject, <a href=\"http://accordingtohoyt.com/2014/05/21/nebulizing-the-patriarchy/\">Sarah Hoyt addresses</a> the triumphant vaginalism of the SFWA, which celebrates the fact that its membership did not vote an award to a single white male this year.</p><p>UPDATE: Apparently I am wrong and the Nebulas were all about me.</p><blockquote class=\"tr_bq\"><p> It’s so heartening and amazing that so many women authors won! I know<br> there has been a lot of drama about sexism and racism in science fiction<br> circles lately and I feel like all of these women winning such a high<br> prize is just awesome. The Vox Days of the world are going to be nearly<br> apoplectic with anger but they can go fuck themselves. Women in sci-fi<br> for the win!<br> – trynewideas, ULauren Davis Monday 12:11pm</br></br></br></br></br></br></p></blockquote><p>Apoplectic? Quite the contrary, I am VASTLY amused. I hope they are successful in setting up the multicultural Matriarchy of their absurd fantasies. I love the fact they actually gave an award to Swirsky’s ridiculous dino-porn revenge fantasy and I wish they’d gone one step deeper into self-marginalization and only given awards to gay black women writers. They are actively killing off the market for pink science fiction and they don’t even realize they are doing it. These women are in sci-fi the same way a cancer cell is in the human body. The only victory they will find is self-extinction. They can hand themselves hundreds of awards, thousands, but they will never receive the respect they so desperately crave.</p><p>Because the map is not the territory.</p></div>",
  "content_text": "Or,\nwhy Uncle Timmy was disinvited\nfrom Archon:\nI’m going to tell you a little story about a good man who has been slandered and libeled by one individual who is hiding behind the anonymity of the Internets. That good man? Tim “Uncle Timmy” Bolgeo.\nYou see, a pathetic troll whose name I’m not going to bother typing (because it’s a nickname that the individual hides behind because they’re afraid of owning up to their actions) has, after taking random snippets of conversations and tacky jokes that Uncle Timmy publishes on something called “The Revenge”, managed to get Uncle Timmy uninvited from Archon this year. Archon, apparently, is “listening to the fans” (the one who has slandered and committed libel, but we won’t get into that at the moment) and decided that it was in their best interest to not have Uncle Timmy as their Fan Guest of Honor this year.\nLet’s ignore, for the moment, the forty years that Uncle Timmy has dedicated to fandom in the South and Midwest. Let’s forget that he started and ran Libertycon for 25 years, which is one of the more popular “small cons” around. Let’s ignore the fact that the man is extremely smart and is an engineer who has a sterling reputation (except when he’s playing spades. He’s a jerk when he plays spades). Heck, let’s even ignore the fact that Uncle Timmy is an old, fat white dude who started a scholarship for a fan and friend (a black man) after he died tragically while trying to help someone.\nOh, wait. No. Not only no, but hell no. All these facts are pertinent to the lie being spread that Uncle Timmy is one big old Southern racist redneck who hates science.\nI told you none of this was about me, none of it ever had much to do with me. But now you know why I have never backed down to the petty pinkshirted grotesqueries. SFWA, Archon, Rutgers, Smith, Brandeis, Haverford, it’s all the same. It’s all about control of the narrative, control of the organization, and control of the lines of communication.\nThat’s why toleration is not an option. That’s why preening oneself on refusing to take a stand is moral cowardice. Those are merely slow forms of surrender and submission. Sad Puppies was the first time the pinkshirts have been punched in the mouth in decades and they reacted like a vampire to Holy Water. But it was a mere splash, when what is needed is an inexhaustible firehose.\nOn a related subject,\nSarah Hoyt addresses\nthe triumphant vaginalism of the SFWA, which celebrates the fact that its membership did not vote an award to a single white male this year.\nUPDATE: Apparently I am wrong and the Nebulas were all about me.\nIt’s so heartening and amazing that so many women authors won! I know\nthere has been a lot of drama about sexism and racism in science fiction\ncircles lately and I feel like all of these women winning such a high\nprize is just awesome. The Vox Days of the world are going to be nearly\napoplectic with anger but they can go fuck themselves. Women in sci-fi\nfor the win!\n– trynewideas, ULauren Davis Monday 12:11pm\nApoplectic? Quite the contrary, I am VASTLY amused. I hope they are successful in setting up the multicultural Matriarchy of their absurd fantasies. I love the fact they actually gave an award to Swirsky’s ridiculous dino-porn revenge fantasy and I wish they’d gone one step deeper into self-marginalization and only given awards to gay black women writers. They are actively killing off the market for pink science fiction and they don’t even realize they are doing it. These women are in sci-fi the same way a cancer cell is in the human body. The only victory they will find is self-extinction. They can hand themselves hundreds of awards, thousands, but they will never receive the respect they so desperately crave.\nBecause the map is not the territory.",
  "tags": [
    "SFWA",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-21T12:00:00+00:00"
}