{
  "url": "https://voxday.net/2014/05/10/smirkings-and-quirkings/",
  "scraped_at": "2025-12-16T12:14:05.555848",
  "title": "Smirkings and quirkings",
  "date_display": "May 10, 2014",
  "date_iso": "2014-05-10T20:30:00+00:00",
  "date_from_url": "2014-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If I could only give a single piece of advice to a SF/F writer it would be this: excise the verbs “to smirk” and “to quirk” from your literary arsenal. At some point in the last 10-15 years, they mutually invaded the genre and have become all but ubiquitous.</p><p>First, note that quirk is not even a verb! It is a bloody NOUN. Seriously. It even says so in the dictionary and everything!</p><p>QUIRK noun<br> 1. a peculiarity of action, behavior, or personality; mannerism: He is full of strange quirks.<br> 2. a shift, subterfuge, or evasion; quibble.<br> 3. a sudden twist or turn: He lost his money by a quirk of fate.<br> 4.a flourish or showy stroke, as in writing.<br> 5.Architecture.<br> a.an acute angle or channel, as one dividing two parts of a molding or one dividing a flush bead from the adjoining surfaces.<br> b.an area taken from a larger area, as a room or a plot of ground.<br> c.an enclosure for this area.</br></br></br></br></br></br></br></br></p><p>How, pray tell, does one “quirk a smile”. How is a sentence “quirked” rather than “said”? I’m not sure who is responsible, but I have the vague sense that David Weber may be the chiefly culpable party. In any event, quirking is the twerking of science fiction and fantasy genre; it is annoying, vulgar, and fundamentally stupid.</p><p>Weber’s<i> On Basilisk Station</i> contains 4 quirks.</p><ol><li>Honor stood motionless, watching through the armorplast, feeling Nimitz rise straight and tall on her shoulder to join her perusal, and an eyebrow quirked.</li><li> The numeral on her maneuvering display changed to “1,” and she turned to Webster and quirked an eyebrow, waiting out the seconds until he nodded.</li><li>Her lips quirked at the thought, and she worked her way more briskly through the traffic.</li><li>She paused, eyebrow quirked as if to ask if Honor was with her, and Honor nodded.</li></ol><p>Now, at least the smirk addicts use an actual verb as a verb. But they still, for the most part, use it ineptly, even when it isn’t being used improperly. Let’s go to the definition again:</p><p>SMIRK verb<br> 1. to smile in an affected, smug, or offensively familiar way.<br> 2. to smile in a manner expressing expressing scorn, smugness, etc, rather than pleasure</br></br></p><p>Like “quirked”, “smirked” is frequently used as a said-bookism, and an improper said-bookism at that. It is a manner of smiling, not a manner of speaking.</p><p>Scott Lynch serves as a good example. He’s considered one of the better “new” writers, and as a pure wordsmith, he’s quite competent. In his first book, <i>The Lies of Locke Lamora</i>, while there are no quirks, there are no less than 11 smirks.</p><ol><li>Calo had dark liquor-colored skin and hair like an inky slice of night; the tautness of the flesh around his dark eyes was broken only by a fine network of laugh-lines (though anyone who knew the Sanza twins would more readily describe them as smirk-lines)</li><li>“Incomparable.” He coughed, and then, with quick jerky motions, he loosened his black neck-cloths just the slightest bit; the Salvaras smirked charmingly together. “I’m reminded again why I have such success selling gentler liquors to you people.”</li><li>Capa Barsavi reached out with his right hand and turned Locke’s head slightly upward by the chin, staring down into Locke’s eyes as he spoke. “How old are you, Locke Lamora? Six? Seven? Already responsible for a breach of the Peace, a burnt-down tavern, and six or seven deaths.” The Capa smirked. “I have assassins five times your age who should be so bold. Has Chains told you the way it is, with my city and my laws?”</li><li> “Consider it my challenge to you, to go hand in hand with my blessing.” Barsavi smirked.</li><li> “The threat of an empty stomach soon rekindles wisdom.” Chains smirked.</li><li> “I shall return very shortly,” said Locke, and he spun on his heel and made for the door. As he left the receiving room, he allowed himself a brief smirk of pleasure; the guards pinning Benjavier now looked almost as frightened of him as the waiter did.</li><li> The sun was pouring down light and heat with its usual intensity, and Locke was sweating hard inside his fine new clothes, but for a few moments he let a satisfied smirk creep onto his face.</li><li> “She is knitting, my lady,” said Reynart, with a smirk that told of some private joke.</li><li> “Now,” said Doña Sofia with a smirk, “it will either be Doña Vorchenza, or it will be a pair of young people doing something they should not….”</li><li> The Falconer stood in the center of the little room, smirking at Locke, his hand folded before him.</li><li>“Oh no, Master Lamora.” Now the sorcerer positively smirked.</li></ol><p>The disease apparently progresses with time. <i>Red Seas Under Red Skies</i> contains 14 smirks, while <i>The Republic of Thieves </i>features 19 for the reader’s edification and enjoyment.</p><p>I have a theory about why pinkshirts are so prone to having their characters not only smirking often, but smirking improperly. The former because it serves as a signpost to the reader that a cleverness has been committed, and the latter because it is the writer speaking through the character, communicating his sense of self-satisfaction with the character’s behavior in the scene.</p><p>It should surprise no one to discover there are no smirkings and quirkings to be found in Tolkien.</p></div>",
  "content_text": "If I could only give a single piece of advice to a SF/F writer it would be this: excise the verbs “to smirk” and “to quirk” from your literary arsenal. At some point in the last 10-15 years, they mutually invaded the genre and have become all but ubiquitous.\nFirst, note that quirk is not even a verb! It is a bloody NOUN. Seriously. It even says so in the dictionary and everything!\nQUIRK noun\n1. a peculiarity of action, behavior, or personality; mannerism: He is full of strange quirks.\n2. a shift, subterfuge, or evasion; quibble.\n3. a sudden twist or turn: He lost his money by a quirk of fate.\n4.a flourish or showy stroke, as in writing.\n5.Architecture.\na.an acute angle or channel, as one dividing two parts of a molding or one dividing a flush bead from the adjoining surfaces.\nb.an area taken from a larger area, as a room or a plot of ground.\nc.an enclosure for this area.\nHow, pray tell, does one “quirk a smile”. How is a sentence “quirked” rather than “said”? I’m not sure who is responsible, but I have the vague sense that David Weber may be the chiefly culpable party. In any event, quirking is the twerking of science fiction and fantasy genre; it is annoying, vulgar, and fundamentally stupid.\nWeber’s\nOn Basilisk Station\ncontains 4 quirks.\nHonor stood motionless, watching through the armorplast, feeling Nimitz rise straight and tall on her shoulder to join her perusal, and an eyebrow quirked.\nThe numeral on her maneuvering display changed to “1,” and she turned to Webster and quirked an eyebrow, waiting out the seconds until he nodded.\nHer lips quirked at the thought, and she worked her way more briskly through the traffic.\nShe paused, eyebrow quirked as if to ask if Honor was with her, and Honor nodded.\nNow, at least the smirk addicts use an actual verb as a verb. But they still, for the most part, use it ineptly, even when it isn’t being used improperly. Let’s go to the definition again:\nSMIRK verb\n1. to smile in an affected, smug, or offensively familiar way.\n2. to smile in a manner expressing expressing scorn, smugness, etc, rather than pleasure\nLike “quirked”, “smirked” is frequently used as a said-bookism, and an improper said-bookism at that. It is a manner of smiling, not a manner of speaking.\nScott Lynch serves as a good example. He’s considered one of the better “new” writers, and as a pure wordsmith, he’s quite competent. In his first book,\nThe Lies of Locke Lamora\n, while there are no quirks, there are no less than 11 smirks.\nCalo had dark liquor-colored skin and hair like an inky slice of night; the tautness of the flesh around his dark eyes was broken only by a fine network of laugh-lines (though anyone who knew the Sanza twins would more readily describe them as smirk-lines)\n“Incomparable.” He coughed, and then, with quick jerky motions, he loosened his black neck-cloths just the slightest bit; the Salvaras smirked charmingly together. “I’m reminded again why I have such success selling gentler liquors to you people.”\nCapa Barsavi reached out with his right hand and turned Locke’s head slightly upward by the chin, staring down into Locke’s eyes as he spoke. “How old are you, Locke Lamora? Six? Seven? Already responsible for a breach of the Peace, a burnt-down tavern, and six or seven deaths.” The Capa smirked. “I have assassins five times your age who should be so bold. Has Chains told you the way it is, with my city and my laws?”\n“Consider it my challenge to you, to go hand in hand with my blessing.” Barsavi smirked.\n“The threat of an empty stomach soon rekindles wisdom.” Chains smirked.\n“I shall return very shortly,” said Locke, and he spun on his heel and made for the door. As he left the receiving room, he allowed himself a brief smirk of pleasure; the guards pinning Benjavier now looked almost as frightened of him as the waiter did.\nThe sun was pouring down light and heat with its usual intensity, and Locke was sweating hard inside his fine new clothes, but for a few moments he let a satisfied smirk creep onto his face.\n“She is knitting, my lady,” said Reynart, with a smirk that told of some private joke.\n“Now,” said Doña Sofia with a smirk, “it will either be Doña Vorchenza, or it will be a pair of young people doing something they should not….”\nThe Falconer stood in the center of the little room, smirking at Locke, his hand folded before him.\n“Oh no, Master Lamora.” Now the sorcerer positively smirked.\nThe disease apparently progresses with time.\nRed Seas Under Red Skies\ncontains 14 smirks, while\nThe Republic of Thieves\nfeatures 19 for the reader’s edification and enjoyment.\nI have a theory about why pinkshirts are so prone to having their characters not only smirking often, but smirking improperly. The former because it serves as a signpost to the reader that a cleverness has been committed, and the latter because it is the writer speaking through the character, communicating his sense of self-satisfaction with the character’s behavior in the scene.\nIt should surprise no one to discover there are no smirkings and quirkings to be found in Tolkien.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-10T19:30:00+00:00"
}