{
  "url": "https://voxday.net/2014/05/08/the-choosing-time/",
  "scraped_at": "2025-12-16T12:13:53.370043",
  "title": "The choosing time",
  "date_display": "May 8, 2014",
  "date_iso": "2014-05-08T16:47:00+00:00",
  "date_from_url": "2014-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>With the quasi-completion of the Left’s long march through the media institutions, everything traditional, Christian, or moral <a href=\"http://www.deadline.com/2014/05/hgtv-pulls-new-home-flipping-series-after-report-emerges-identifying-its-stars-as-anti-gay-activists/#more-725868\">is now effectively banned</a> from mainstream publication and broadcast. We have two choices. Abandon our standards in order to get along or begin developing our own distribution channels and refuse to participate in the mainstream’s headlong dive into utter depravity and appeal to the lowest possible denominator:</p><blockquote class=\"tr_bq\"><p> After the group Right Wing Watch reported the twins who star in HGTV’s recently greenlit reality series Flip It Forward are anti-gay activists, the network said this morning it had given the hook to the series, which was set to debut in October.</p></blockquote><p>This is why we need to develop our own content. This is why we need to develop our own distribution channels. This is why we need to do what the Left has done, which is to choose our side and relentlessly reject everything about the enemy. Because they are not merely the opposition, they are the self-declared enemy.</p><p>Don’t pride yourself on your tolerance of them because tolerance is not a virtue and tolerance of the wicked is a sin. Don’t try to separate yourself from others on your side in the hopes that they will spare you, because that separation is exactly what they require in order to divide and conquer.</p><p>Stop kidding yourself. You’re not disarming any of your foes with the disclaimer “I don’t agree with everything X says”. All that amounts to is a futile plea to not be damned by the only association that matters to them: do you not understand that by the lights of the pointing-and-shrieking pack, if you are not pointing and shrieking with them you are against them?</p><p>I don’t agree with everything that anyone says. For that matter, I don’t even agree with everything I have ever said. But I know who is on the side of light, truth, and reason and who is on the side of darkness, lies, and madness. Compromise with the latter at your peril.</p></div>",
  "content_text": "With the quasi-completion of the Left’s long march through the media institutions, everything traditional, Christian, or moral\nis now effectively banned\nfrom mainstream publication and broadcast. We have two choices. Abandon our standards in order to get along or begin developing our own distribution channels and refuse to participate in the mainstream’s headlong dive into utter depravity and appeal to the lowest possible denominator:\nAfter the group Right Wing Watch reported the twins who star in HGTV’s recently greenlit reality series Flip It Forward are anti-gay activists, the network said this morning it had given the hook to the series, which was set to debut in October.\nThis is why we need to develop our own content. This is why we need to develop our own distribution channels. This is why we need to do what the Left has done, which is to choose our side and relentlessly reject everything about the enemy. Because they are not merely the opposition, they are the self-declared enemy.\nDon’t pride yourself on your tolerance of them because tolerance is not a virtue and tolerance of the wicked is a sin. Don’t try to separate yourself from others on your side in the hopes that they will spare you, because that separation is exactly what they require in order to divide and conquer.\nStop kidding yourself. You’re not disarming any of your foes with the disclaimer “I don’t agree with everything X says”. All that amounts to is a futile plea to not be damned by the only association that matters to them: do you not understand that by the lights of the pointing-and-shrieking pack, if you are not pointing and shrieking with them you are against them?\nI don’t agree with everything that anyone says. For that matter, I don’t even agree with everything I have ever said. But I know who is on the side of light, truth, and reason and who is on the side of darkness, lies, and madness. Compromise with the latter at your peril.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-08T15:47:00+00:00"
}