{
  "url": "https://voxday.net/2014/05/11/the-dramatic-limits-of-pink-sff/",
  "scraped_at": "2025-12-16T12:14:10.147152",
  "title": "The dramatic limits of Pink SF/F",
  "date_display": "May 11, 2014",
  "date_iso": "2014-05-11T13:00:00+00:00",
  "date_from_url": "2014-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been finding the reading of Scott Lynch’s first two “Gentlemen Bastard” books to be more than a little educational because they are such a strange combination of competent writing with flawed and shallow story-telling. As such, they provide a useful perspective on precisely where and how Pink SF/F goes awry as literature.</p><p>Take the following quote from <i>Red Seas Under Red Skies</i>, which shows how a desired concept could have been handled well while simultaneously fumbling the execution:</p><blockquote class=\"tr_bq\"><p> <i>“When you go to sea, there’s two necessities, for luck. First, you’re courting an awful fate if you take a ship to sea without at least one woman officer. It’s the law of the Lord of the Grasping Waters. His mandate. He’s got a fixation for the daughters of the land; he’ll smash any ship that puts to sea without at least one aboard. Plus, it’s plain common sense. They’re good officers. Decent plain sailors, but finer officers than you or I. Just the way the gods made ’em.</i></p><p><i>“Second, it’s powerful bad luck to put out without cats on board. Not only as they kill the rats, but as they’re the proudest creatures anywhere, wet or dry. Iono admires the little fuckers. Got a ship with women and cats aboard, you’ll have the finest luck you can hope for. Now, our little boat’s so small I reckon we’re fine without no woman. Fishers and harbor boats go out all the time, no worries. But with the pair of you aboard, I’ll be damned if I’m not bringing a cat. A little one suits a little vessel.”</i></p></blockquote><p>Now, this is a subversion of the urban legend that women were historically considered bad luck on sailing ships. Fair enough, although it doesn’t address the real reason women were not permitted to serve on ships in the past, the fact that they tend to destroy ship morale and provide a major distraction for the male crew in addition to getting pregnant and rendering themselves unfit for service.</p><p>Changing the superstition works. But simply declaring, contra literally <i>everything</i> shown in both books before or after the statement, that women are intrinsically better <i>military officers </i>than men, is absurd and indicates either PC preaching or catering to a specific market that enjoys that particular fantasy. The book would have been much more coherent had Lynch simply ended the first necessity before adding the four sentences about “plain common sense”. Instead of getting on with the story, we find ourselves wondering about the mystery of the general absence of these superior female officers. Indeed, how did it come to pass that the Stragos, the naval commander who is a central character in the plot of the second book, is a man?</p><p>The ease with which a single throwaway dog-whistle can render the plot nonsensical points to an inevitable problem with SF/F that is both a) derivative of traditional genre works and b) politically correct. It is fractured by the intrinsic conflict of two contradictory logics, and thus forces the resolution of those contradictions by predictable and usually unsatisfactory means. For example, the preponderance of rape and child murder in modern SF/F is not the result of modern SF/F writers being particularly prone to either sexual assault or violence, indeed, the male writers are probably among the least likely men on the planet to have either had sex with a woman or raised a hand in violence to anyone.</p><p>But the ubiquity of rape and attempted rape is the result of the forced marriage of the traditional “rescue the woman’s virtue” trope with the PC “a woman has a right to rut like a mink in heat without being criticized for it” concept. When there is no virtue to be lost or saved, there is no shame or drama in it. All that is left is the lesser shame and drama of the potential violation of a woman’s consent.</p><p>In the same way, the relentless Herodianism of Pink SF/F is the result of the forced marriage of the traditional “protect the helpless” trope with the PC “women are equal to men” belief. This means that children now make up the entirety of the classes to be protected in Pink SF/F, thereby requiring them to become the only victims who are capable of generating any sympathy in the reader. Unless, of course, a character is victimized solely due to his race or sexual preference.</p><p>And those are the restrictions imposed upon the <i>competent </i>Pink SF/F writers, who attempt to intelligently resolve the logical contradictions. The incompetent ones, (and I note that the failed resolution above stuck out precisely because Lynch is an otherwise competent writer), simply lurch from one leap of illogic to the next, never realizing that they are contradicting themselves and presenting the reader with an incoherent imaginary world.</p><p>On a tangential note, it’s not hard at all to understand why Lynch’s books are popular among the Pink SF/F-reading crowd, and at least in the case of the first book, beyond. Despite the fact that the books are repetitively circular from a plot perspective, are subject to the aforementioned logical constraints, contain no drama or pathos, and go absolutely nowhere in any deeper sense, they do provide very well indeed for the wish fulfillment of a certain psychology that bastes itself in its belief in its own cleverness.</p></div>",
  "content_text": "I’ve been finding the reading of Scott Lynch’s first two “Gentlemen Bastard” books to be more than a little educational because they are such a strange combination of competent writing with flawed and shallow story-telling. As such, they provide a useful perspective on precisely where and how Pink SF/F goes awry as literature.\nTake the following quote from\nRed Seas Under Red Skies\n, which shows how a desired concept could have been handled well while simultaneously fumbling the execution:\n“When you go to sea, there’s two necessities, for luck. First, you’re courting an awful fate if you take a ship to sea without at least one woman officer. It’s the law of the Lord of the Grasping Waters. His mandate. He’s got a fixation for the daughters of the land; he’ll smash any ship that puts to sea without at least one aboard. Plus, it’s plain common sense. They’re good officers. Decent plain sailors, but finer officers than you or I. Just the way the gods made ’em.\n“Second, it’s powerful bad luck to put out without cats on board. Not only as they kill the rats, but as they’re the proudest creatures anywhere, wet or dry. Iono admires the little fuckers. Got a ship with women and cats aboard, you’ll have the finest luck you can hope for. Now, our little boat’s so small I reckon we’re fine without no woman. Fishers and harbor boats go out all the time, no worries. But with the pair of you aboard, I’ll be damned if I’m not bringing a cat. A little one suits a little vessel.”\nNow, this is a subversion of the urban legend that women were historically considered bad luck on sailing ships. Fair enough, although it doesn’t address the real reason women were not permitted to serve on ships in the past, the fact that they tend to destroy ship morale and provide a major distraction for the male crew in addition to getting pregnant and rendering themselves unfit for service.\nChanging the superstition works. But simply declaring, contra literally\neverything\nshown in both books before or after the statement, that women are intrinsically better\nmilitary officers\nthan men, is absurd and indicates either PC preaching or catering to a specific market that enjoys that particular fantasy. The book would have been much more coherent had Lynch simply ended the first necessity before adding the four sentences about “plain common sense”. Instead of getting on with the story, we find ourselves wondering about the mystery of the general absence of these superior female officers. Indeed, how did it come to pass that the Stragos, the naval commander who is a central character in the plot of the second book, is a man?\nThe ease with which a single throwaway dog-whistle can render the plot nonsensical points to an inevitable problem with SF/F that is both a) derivative of traditional genre works and b) politically correct. It is fractured by the intrinsic conflict of two contradictory logics, and thus forces the resolution of those contradictions by predictable and usually unsatisfactory means. For example, the preponderance of rape and child murder in modern SF/F is not the result of modern SF/F writers being particularly prone to either sexual assault or violence, indeed, the male writers are probably among the least likely men on the planet to have either had sex with a woman or raised a hand in violence to anyone.\nBut the ubiquity of rape and attempted rape is the result of the forced marriage of the traditional “rescue the woman’s virtue” trope with the PC “a woman has a right to rut like a mink in heat without being criticized for it” concept. When there is no virtue to be lost or saved, there is no shame or drama in it. All that is left is the lesser shame and drama of the potential violation of a woman’s consent.\nIn the same way, the relentless Herodianism of Pink SF/F is the result of the forced marriage of the traditional “protect the helpless” trope with the PC “women are equal to men” belief. This means that children now make up the entirety of the classes to be protected in Pink SF/F, thereby requiring them to become the only victims who are capable of generating any sympathy in the reader. Unless, of course, a character is victimized solely due to his race or sexual preference.\nAnd those are the restrictions imposed upon the\ncompetent\nPink SF/F writers, who attempt to intelligently resolve the logical contradictions. The incompetent ones, (and I note that the failed resolution above stuck out precisely because Lynch is an otherwise competent writer), simply lurch from one leap of illogic to the next, never realizing that they are contradicting themselves and presenting the reader with an incoherent imaginary world.\nOn a tangential note, it’s not hard at all to understand why Lynch’s books are popular among the Pink SF/F-reading crowd, and at least in the case of the first book, beyond. Despite the fact that the books are repetitively circular from a plot perspective, are subject to the aforementioned logical constraints, contain no drama or pathos, and go absolutely nowhere in any deeper sense, they do provide very well indeed for the wish fulfillment of a certain psychology that bastes itself in its belief in its own cleverness.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-11T12:00:00+00:00"
}