{
  "url": "https://voxday.net/2014/05/08/the-ire-of-irrelevan/",
  "scraped_at": "2025-12-16T12:13:51.904010",
  "title": "The ire of the irrelevant",
  "date_display": "May 8, 2014",
  "date_iso": "2014-05-08T13:00:00+00:00",
  "date_from_url": "2014-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What is it with these Canadian SFWA members?  A SF nonentity is foolish enough to call John C. Wright a liar despite the readily accessible public record:</p><blockquote class=\"tr_bq\"><p> Andrew Barton ‏@ActsofAndrewB <br> John C Wright is either ignorant or a liar. Theodore Beale was kicked out of SFWA for using its Twitter feed to disseminate a racist screed.</br></p><p>Andrew Barton ‏@ActsofAndrewB <br> Personally, given the evidence I have seen thus far, my own suspicion is that John C. Wright knows he is lying and does not give a fuck.</br></p><p>Andrew Barton ‏@ActsofAndrewB <br> I know this because I am one of those who sent an email to my SFWA board rep demanding Beale’s removal. Good riddance to a goddamned swine.</br></p><p>Andrew Barton ‏@ActsofAndrewB <br> Sometimes I feel like just scouring this planet of life would be the most expedient course.</br></p><p>Andrew Barton ‏@ActsofAndrewB <br> Folk’re sure confident saying things online that they wouldn’t if they said them to my face, giving me a chance to break their fucking nose.</br></p></blockquote><p>The self-proclaimed pencil-neck geek is a real tuff guy. It’s fascinating to observe the way these SWPLs insist that it is beyond the pale to call a deceitful and obnoxious African-American “an educated but ignorant half-savage” but deem it acceptable to label Hispanics “goddamned swine”. No wonder so few writers of color, such as Larry Correia and Sarah Hoyt, have any desire to join the organization.</p><p>At this point, any SF/F writer would have to be a complete fool to think that joining SFWA will enhance his career in any way. SFWA members know that SFWA provides a writer with zero credibility with the publishers, (editors in the SFWA Forum openly joke about how only total noobs are so stupid as to mention their memberships when they are submitting manuscripts), so there is literally no professional upside that comes with the downside of paying for having one’s speech policed.</p><p>Now consider that this SFWA nobody was attacking a science fiction master on the very day that Mr. Wright’s novella was #86 on Amazon: 4,117 people downloaded <a href=\"http://www.amazon.com/Awake-Night-John-C-Wright-ebook/dp/B00K425CL6\"><b><i>AWAKE IN THE NIGHT</i></b></a> yesterday and the day before.  Another new release from Mr. Wright has been #1 in Science Fiction History &amp; Criticism for three straight days. It is readily apparent that Mr. Wright doesn’t need SFWA. I certainly don’t need SFWA. Neither does anyone else anymore.</p><p>It is very easy to demonstrate that Mr. Barton is a liar himself. <a href=\"http://www.sfwa.org/2013/08/board-communication-on-member-expulsion/\">The SFWA did not give any reason</a> for expelling an unnamed member last year and still has issued no official statement concerning any of the reasons for its actions: <i>“We will continue to omit the expelled individual’s name and the details of his behavior on advice of counsel.”</i></p><p>And as I pointed out in <a href=\"http://www.voxday.net/mart/SFWA_response.pdf\">my response to the SFWA report</a> concerning the various false claims about SFWA’s “twitter feed”: <i>“the channel does not belong to SFWA, the Content did not belong to SFWA, the content was deemed permissible by the channel owner, and the personal attack contained in the blog post to which the tweet linked was fully in line with previous personal attacks made by dozens of other members of the organization in official SFWA spaces. Therefore it is incorrect to claim that an official SFWA channel was misused via the marking for inclusion of the blog post of June 13, 2013 in the @sfwaauthors Twitter feed.”</i></p><p>Barton is only one of many SFWA members who simply do not grasp that “@sfwaauthors” is not, and has never been, “SFWA’s Twitter feed”. That is “@sfwa”, which according to Twitter’s Terms of Usage, does not belong to SFWA either. They also do not grasp that the tweet in question contained nothing that was racist or offensive, it was a simple link to a blog post. And finally, anyone who has read either the 34-page SFWA report or <a href=\"http://www.voxday.net/mart/SFWA_response.pdf\">my detailed response to it</a> knows that the SFWA Board’s action was based on its active thought policing of a) me on my personal blog, b) the various commenters on my blog, and c) people with no connection to me commenting on sites with no connection to me. The SFWA President even admitted as much the other day: <i>“Board investigation of harassment complaints may take public statements into consideration”. </i><br> <i><br/></i><br> By which they not only mean public statements by their members, but also by anyone<i> </i>who happens to comment on a member’s blog or anywhere else on the Internet.</br></br></p><p>Mr. Wright’s view of SFWA is entirely correct. The SFWA Board has overtly and undeniably claimed for itself the right to police the public statements of SFWA members. Although the SFWA Board has done its best to <a href=\"http://www.milobookclub.com/2013/08/20/burying-evidence/\">bury its own report</a>, inadvertently encouraging members like Andrew Barton to present fiction as fact, the truth is out there. Some of the sub-irrelevant SFWA members, such as the clueless wonder who keeps posting links to her blog post here on unrelated topics, would be advised to read it.</p></div>",
  "content_text": "What is it with these Canadian SFWA members?  A SF nonentity is foolish enough to call John C. Wright a liar despite the readily accessible public record:\nAndrew Barton ‏@ActsofAndrewB\nJohn C Wright is either ignorant or a liar. Theodore Beale was kicked out of SFWA for using its Twitter feed to disseminate a racist screed.\nAndrew Barton ‏@ActsofAndrewB\nPersonally, given the evidence I have seen thus far, my own suspicion is that John C. Wright knows he is lying and does not give a fuck.\nAndrew Barton ‏@ActsofAndrewB\nI know this because I am one of those who sent an email to my SFWA board rep demanding Beale’s removal. Good riddance to a goddamned swine.\nAndrew Barton ‏@ActsofAndrewB\nSometimes I feel like just scouring this planet of life would be the most expedient course.\nAndrew Barton ‏@ActsofAndrewB\nFolk’re sure confident saying things online that they wouldn’t if they said them to my face, giving me a chance to break their fucking nose.\nThe self-proclaimed pencil-neck geek is a real tuff guy. It’s fascinating to observe the way these SWPLs insist that it is beyond the pale to call a deceitful and obnoxious African-American “an educated but ignorant half-savage” but deem it acceptable to label Hispanics “goddamned swine”. No wonder so few writers of color, such as Larry Correia and Sarah Hoyt, have any desire to join the organization.\nAt this point, any SF/F writer would have to be a complete fool to think that joining SFWA will enhance his career in any way. SFWA members know that SFWA provides a writer with zero credibility with the publishers, (editors in the SFWA Forum openly joke about how only total noobs are so stupid as to mention their memberships when they are submitting manuscripts), so there is literally no professional upside that comes with the downside of paying for having one’s speech policed.\nNow consider that this SFWA nobody was attacking a science fiction master on the very day that Mr. Wright’s novella was #86 on Amazon: 4,117 people downloaded\nAWAKE IN THE NIGHT\nyesterday and the day before.  Another new release from Mr. Wright has been #1 in Science Fiction History & Criticism for three straight days. It is readily apparent that Mr. Wright doesn’t need SFWA. I certainly don’t need SFWA. Neither does anyone else anymore.\nIt is very easy to demonstrate that Mr. Barton is a liar himself.\nThe SFWA did not give any reason\nfor expelling an unnamed member last year and still has issued no official statement concerning any of the reasons for its actions:\n“We will continue to omit the expelled individual’s name and the details of his behavior on advice of counsel.”\nAnd as I pointed out in\nmy response to the SFWA report\nconcerning the various false claims about SFWA’s “twitter feed”:\n“the channel does not belong to SFWA, the Content did not belong to SFWA, the content was deemed permissible by the channel owner, and the personal attack contained in the blog post to which the tweet linked was fully in line with previous personal attacks made by dozens of other members of the organization in official SFWA spaces. Therefore it is incorrect to claim that an official SFWA channel was misused via the marking for inclusion of the blog post of June 13, 2013 in the @sfwaauthors Twitter feed.”\nBarton is only one of many SFWA members who simply do not grasp that “@sfwaauthors” is not, and has never been, “SFWA’s Twitter feed”. That is “@sfwa”, which according to Twitter’s Terms of Usage, does not belong to SFWA either. They also do not grasp that the tweet in question contained nothing that was racist or offensive, it was a simple link to a blog post. And finally, anyone who has read either the 34-page SFWA report or\nmy detailed response to it\nknows that the SFWA Board’s action was based on its active thought policing of a) me on my personal blog, b) the various commenters on my blog, and c) people with no connection to me commenting on sites with no connection to me. The SFWA President even admitted as much the other day:\n“Board investigation of harassment complaints may take public statements into consideration”.\nBy which they not only mean public statements by their members, but also by anyone\nwho happens to comment on a member’s blog or anywhere else on the Internet.\nMr. Wright’s view of SFWA is entirely correct. The SFWA Board has overtly and undeniably claimed for itself the right to police the public statements of SFWA members. Although the SFWA Board has done its best to\nbury its own report\n, inadvertently encouraging members like Andrew Barton to present fiction as fact, the truth is out there. Some of the sub-irrelevant SFWA members, such as the clueless wonder who keeps posting links to her blog post here on unrelated topics, would be advised to read it.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-08T12:00:00+00:00"
}