{
  "url": "https://voxday.net/2014/05/13/the-prosecution-rests/",
  "scraped_at": "2025-12-16T12:14:19.306562",
  "title": "The prosecution rests",
  "date_display": "May 13, 2014",
  "date_iso": "2014-05-13T08:58:00+00:00",
  "date_from_url": "2014-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright <a href=\"http://www.scifiwright.com/2014/05/an-afterword-on-the-stormtroopers-of-toleration/\">reflects on the SF/F community’s response</a> to his article in <i>Intercollegiate Review</i>, which appears to mark the first time that the SF/F community at large has ever indicated it is aware of the existence of <i>Intercollegiate Review</i>:</p><blockquote class=\"tr_bq\"><p> I am surprised, but should not be, that an obscure opinion in an obscure journal by an obscure author such as myself would provoke so many loud and hostile reactions. (Maybe it is a slow news day and there is nothing else to fret about.)</p><p>Why so vehement a reaction when so other published opinions of mine, much more controversial, go uncontroverted? I suspect that the witchhunters hate being identified for what they are. Truth is their kriptonite.</p><p>I won’t bother linking to them. Overhearing strangers talk about me either in praise or blame bores me, since I am not a fascinating subject to myself, and none of these people know my character or my character flaws.</p><p>But I will make one comment, which I hope is telling: Please note that these various articles critiquing my article do not say, “the witch hunt never happened; we, the socially-aware segment of the science fiction community, are completely forgiving of all personal flaws and differences of opinion, political and personal, between ourselves and Malzberg, Moon, Correia, Card, etc, and we judge their works only on the merit of the writing!”</p><p>Instead they say, “But those people he defends really are witches and pariahs! Right-thinking people must have nothing to do with them!”</p><p>Which would seem to prove, rather than refute, my point.</p></blockquote><p>And that would be checkmate.</p><p>It is rather remarkable how obtuse the hissy-fitters of the Left repeatedly show themselves to be. My personal favorite was SFWA President Steven Gould publicly asserting that his organization doesn’t do what got the whole ball rolling in the first place, then noting with an asterisk that it actually does exactly what he had been denying.</p><p>They don’t seem to grasp that the moment you proclaim “there is no place for X in our community”, X can be, and will be, defined as anything those with sufficient power deem it to be. If it is acceptable to say there is no place for racists, then it is also acceptable to say there is no place for blacks. If it is acceptable to say there is no place for libertarians, it is acceptable to say that there is no place for socialists. If it is acceptable to say there is no place for the science-literate, it is acceptable to say there is no place for the half-savage.</p><p>Once thought policing is imposed, the situation has devolved into a straightforward power game. But, as the slack-jawed reaction to the Hugo nominations has shown, they’re not actually ready for the open conflict they created. They don’t even realize that we haven’t even <i>begun </i>to flex our muscles. They thought they’d won the game while the other team was still in the locker room. Now the first three or four players players have stepped onto the field and they are absolutely shocked to discover that we showed up.</p><p>The amusing thing is that they think we’re crying about their harmless little attacks because that’s what they would feel like doing in our shoes. They still don’t realize that we are not like them. They still have no idea what is coming.</p></div>",
  "content_text": "John C. Wright\nreflects on the SF/F community’s response\nto his article in\nIntercollegiate Review\n, which appears to mark the first time that the SF/F community at large has ever indicated it is aware of the existence of\nIntercollegiate Review\n:\nI am surprised, but should not be, that an obscure opinion in an obscure journal by an obscure author such as myself would provoke so many loud and hostile reactions. (Maybe it is a slow news day and there is nothing else to fret about.)\nWhy so vehement a reaction when so other published opinions of mine, much more controversial, go uncontroverted? I suspect that the witchhunters hate being identified for what they are. Truth is their kriptonite.\nI won’t bother linking to them. Overhearing strangers talk about me either in praise or blame bores me, since I am not a fascinating subject to myself, and none of these people know my character or my character flaws.\nBut I will make one comment, which I hope is telling: Please note that these various articles critiquing my article do not say, “the witch hunt never happened; we, the socially-aware segment of the science fiction community, are completely forgiving of all personal flaws and differences of opinion, political and personal, between ourselves and Malzberg, Moon, Correia, Card, etc, and we judge their works only on the merit of the writing!”\nInstead they say, “But those people he defends really are witches and pariahs! Right-thinking people must have nothing to do with them!”\nWhich would seem to prove, rather than refute, my point.\nAnd that would be checkmate.\nIt is rather remarkable how obtuse the hissy-fitters of the Left repeatedly show themselves to be. My personal favorite was SFWA President Steven Gould publicly asserting that his organization doesn’t do what got the whole ball rolling in the first place, then noting with an asterisk that it actually does exactly what he had been denying.\nThey don’t seem to grasp that the moment you proclaim “there is no place for X in our community”, X can be, and will be, defined as anything those with sufficient power deem it to be. If it is acceptable to say there is no place for racists, then it is also acceptable to say there is no place for blacks. If it is acceptable to say there is no place for libertarians, it is acceptable to say that there is no place for socialists. If it is acceptable to say there is no place for the science-literate, it is acceptable to say there is no place for the half-savage.\nOnce thought policing is imposed, the situation has devolved into a straightforward power game. But, as the slack-jawed reaction to the Hugo nominations has shown, they’re not actually ready for the open conflict they created. They don’t even realize that we haven’t even\nbegun\nto flex our muscles. They thought they’d won the game while the other team was still in the locker room. Now the first three or four players players have stepped onto the field and they are absolutely shocked to discover that we showed up.\nThe amusing thing is that they think we’re crying about their harmless little attacks because that’s what they would feel like doing in our shoes. They still don’t realize that we are not like them. They still have no idea what is coming.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-13T07:58:00+00:00"
}