{
  "url": "https://voxday.net/2014/05/18/the-end-of-nebula/",
  "scraped_at": "2025-12-16T12:14:44.017439",
  "title": "The end of the Nebula",
  "date_display": "May 18, 2014",
  "date_iso": "2014-05-18T16:45:00+00:00",
  "date_from_url": "2014-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s more than a little ironic that so many people are expressing fear for the fate of the Hugo Awards due to the nominations of works by Larry Correia and me when it is readily apparent that it is the status of the other science fiction award that is in considerably more danger. While the pinkshirts are celebrating the wonderful news that four women won the four SFWA awards for the best “science fiction” this year, more astute observers will recall the principle that men have a long-standing tendency to abandon what are viewed as women’s professions and any field dominated by women tends to lose status in the eyes of both sexes.</p><p>(This is why the fact that men are statistically overrepresented as firefighters and computer programmers is supposed to be a major societal problem, but no one is concerned by the fact that women are statistically overrepresented as nurses and primary schoolteachers.)</p><p>Whether this is the consequence of raw male sexism or the female tendency to reward others on the basis of their status in the herd rather than individual excellence is irrelevant. What the awards sweep indicates is that the reputation of the Nebula award, which has been dubious since <i>The Quantum Rose</i> won best novel, is now in freefall.</p><p>It will be interesting to see if there are any male winners in the next few years; I would not be surprised if, within five years, there are not even any male nominees. The organization is not only in the process of being abandoned to women, but to the sort of women who are much more interested in the sex and politics of the author than in the actual fiction.</p><p>And, of course, it wouldn’t be SFWA if they couldn’t host an awards dinner without shooting themselves in the foot. Robin Wayne Bailey posts on Facebook:</p><p><i>“The amazing fuckitude of the 2013 Nebulas blind-sided and shocked me as my presentation speech, including Frank Robinson’s acceptance remarks, were totally fucking skipped. I’ve promised to be silent for a few days while the ombudsman figures how how it happened, but I won’t be totally silent, and I won’t let SFWA off the hook for this affront to Frank Robinson and also to myself. I’m furious. Never in the history of SFWA has something like this happened.”</i></p><p>That is certainly a novel way of honoring a “special guest”. The observable reality is that SFWA isn’t a science fiction organization anymore, it is now a women’s political action committee. Male members, even those who are past leaders of the organization, shouldn’t be surprised to find themselves silenced and shunned in the future.</p><p>Fortunately, those running the show are SF/F nonentities, many of whom have never even published a single novel, so it’s not like such treatment is going to harm anyone’s career.</p></div>",
  "content_text": "It’s more than a little ironic that so many people are expressing fear for the fate of the Hugo Awards due to the nominations of works by Larry Correia and me when it is readily apparent that it is the status of the other science fiction award that is in considerably more danger. While the pinkshirts are celebrating the wonderful news that four women won the four SFWA awards for the best “science fiction” this year, more astute observers will recall the principle that men have a long-standing tendency to abandon what are viewed as women’s professions and any field dominated by women tends to lose status in the eyes of both sexes.\n(This is why the fact that men are statistically overrepresented as firefighters and computer programmers is supposed to be a major societal problem, but no one is concerned by the fact that women are statistically overrepresented as nurses and primary schoolteachers.)\nWhether this is the consequence of raw male sexism or the female tendency to reward others on the basis of their status in the herd rather than individual excellence is irrelevant. What the awards sweep indicates is that the reputation of the Nebula award, which has been dubious since\nThe Quantum Rose\nwon best novel, is now in freefall.\nIt will be interesting to see if there are any male winners in the next few years; I would not be surprised if, within five years, there are not even any male nominees. The organization is not only in the process of being abandoned to women, but to the sort of women who are much more interested in the sex and politics of the author than in the actual fiction.\nAnd, of course, it wouldn’t be SFWA if they couldn’t host an awards dinner without shooting themselves in the foot. Robin Wayne Bailey posts on Facebook:\n“The amazing fuckitude of the 2013 Nebulas blind-sided and shocked me as my presentation speech, including Frank Robinson’s acceptance remarks, were totally fucking skipped. I’ve promised to be silent for a few days while the ombudsman figures how how it happened, but I won’t be totally silent, and I won’t let SFWA off the hook for this affront to Frank Robinson and also to myself. I’m furious. Never in the history of SFWA has something like this happened.”\nThat is certainly a novel way of honoring a “special guest”. The observable reality is that SFWA isn’t a science fiction organization anymore, it is now a women’s political action committee. Male members, even those who are past leaders of the organization, shouldn’t be surprised to find themselves silenced and shunned in the future.\nFortunately, those running the show are SF/F nonentities, many of whom have never even published a single novel, so it’s not like such treatment is going to harm anyone’s career.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-18T15:45:00+00:00"
}