{
  "url": "https://voxday.net/2014/05/01/the-moving-goalposts-of-pc-morality/",
  "scraped_at": "2025-12-16T12:13:07.330816",
  "title": "The moving goalposts of PC morality",
  "date_display": "May 1, 2014",
  "date_iso": "2014-05-01T09:58:00+00:00",
  "date_from_url": "2014-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A basic concept of economics explains <a href=\"http://www.iea.org.uk/blog/the-economics-of-political-correctness\">why the various evils of the equalitarians can never be conquered</a> and serves as the logical basis for demonstrating that there is nothing moral about political correctness.</p><blockquote class=\"tr_bq\"><p> A positional good is a good that people acquire to signalise where<br> they stand in a social hierarchy; it is acquired in order to set oneself<br> apart from others. Positional goods therefore have a peculiar property:<br> the utility their consumers derive from them is inversely related to<br> the number of people who can access them.</br></br></br></br></p><p>Positionality is not a property of the good itself, it is a matter of<br> the consumer’s motivations. I may buy an exquisite variety of wine<br> because I genuinely enjoy the taste, or acquire a degree from a<br> reputable university because I genuinely appreciate what that university<br> has to offer. But my motivation could also be to set myself apart from<br> others, to present myself as more sophisticated or smarter. From merely<br> observing that I consume the product, you could not tell my motivation.<br> But you could tell it by observing how I respond once other people start<br> drinking the same wine, or attending the same university….</br></br></br></br></br></br></br></br></p><p>PC-brigadiers behave exactly like owners of a positional good who panic because wider availability of that good threatens their social status. The PC brigade has been highly successful in creating new social taboos, but their success is their very problem. Moral superiority is a prime example of a positional good, because we cannot all be morally superior to each other. Once you have successfully exorcised a word or an opinion, how do you differentiate yourself from others now? You need new things to be outraged about, new ways of asserting your imagined moral superiority.</p><p>You can do that by insisting that the no real progress has been made, that your issue is as real as ever, and just manifests itself in more subtle ways. Many people may imitate your rhetoric, but they do not really mean it, they are faking it, they are poseurs. You can also hugely inflate the definition of an existing offense. Or you can move on to discover new things to label ‘offensive’, new victim groups, new patterns of dominance and oppression.</p></blockquote><p>This is why SFWA overreacted so conspicuously and dramatically to my factual statements about a token writer whose main role in the organization was totemic. Their fainting fits and outrage were conspicuous consumption, designed to elevate their status within the group.</p><p>The main reason that this crowd was so deeply offended by my nomination was because it cheapens their painstakingly acquired status. Here they are, brandishing their expensive, designer outrage purses, when suddenly the Hugo voters hand them the equivalent of a notice that they’ve bought nothing but a cheap knockoff that anyone can pick up for nothing.</p><p>And this is why my usual critics, such as Jim Hines and John Scalzi, were wise to support my right to be on the ballot despite the fact that we know they could not care less about the rules are. They have already learned, (even if they haven’t publicly admitted it yet), that they simply can’t keep up with the conspicuous consumption of the more extreme elements of the PC brigade. Eventually, they will be shaken off by their putative allies, because without shaking them off, the extremists cannot maintain their conspicuous pose of moral superiority.</p><p>Which further goes to prove that their professed moral superiority is only a pose and there is nothing moral about PC morality at all. To be meaningful and coherent, to be a moral standard, morality must be universal and objective. And obviously, a dynamic morality defined by the most conspicuous consumers for the purposes of their own distinction can never be either.</p></div>",
  "content_text": "A basic concept of economics explains\nwhy the various evils of the equalitarians can never be conquered\nand serves as the logical basis for demonstrating that there is nothing moral about political correctness.\nA positional good is a good that people acquire to signalise where\nthey stand in a social hierarchy; it is acquired in order to set oneself\napart from others. Positional goods therefore have a peculiar property:\nthe utility their consumers derive from them is inversely related to\nthe number of people who can access them.\nPositionality is not a property of the good itself, it is a matter of\nthe consumer’s motivations. I may buy an exquisite variety of wine\nbecause I genuinely enjoy the taste, or acquire a degree from a\nreputable university because I genuinely appreciate what that university\nhas to offer. But my motivation could also be to set myself apart from\nothers, to present myself as more sophisticated or smarter. From merely\nobserving that I consume the product, you could not tell my motivation.\nBut you could tell it by observing how I respond once other people start\ndrinking the same wine, or attending the same university….\nPC-brigadiers behave exactly like owners of a positional good who panic because wider availability of that good threatens their social status. The PC brigade has been highly successful in creating new social taboos, but their success is their very problem. Moral superiority is a prime example of a positional good, because we cannot all be morally superior to each other. Once you have successfully exorcised a word or an opinion, how do you differentiate yourself from others now? You need new things to be outraged about, new ways of asserting your imagined moral superiority.\nYou can do that by insisting that the no real progress has been made, that your issue is as real as ever, and just manifests itself in more subtle ways. Many people may imitate your rhetoric, but they do not really mean it, they are faking it, they are poseurs. You can also hugely inflate the definition of an existing offense. Or you can move on to discover new things to label ‘offensive’, new victim groups, new patterns of dominance and oppression.\nThis is why SFWA overreacted so conspicuously and dramatically to my factual statements about a token writer whose main role in the organization was totemic. Their fainting fits and outrage were conspicuous consumption, designed to elevate their status within the group.\nThe main reason that this crowd was so deeply offended by my nomination was because it cheapens their painstakingly acquired status. Here they are, brandishing their expensive, designer outrage purses, when suddenly the Hugo voters hand them the equivalent of a notice that they’ve bought nothing but a cheap knockoff that anyone can pick up for nothing.\nAnd this is why my usual critics, such as Jim Hines and John Scalzi, were wise to support my right to be on the ballot despite the fact that we know they could not care less about the rules are. They have already learned, (even if they haven’t publicly admitted it yet), that they simply can’t keep up with the conspicuous consumption of the more extreme elements of the PC brigade. Eventually, they will be shaken off by their putative allies, because without shaking them off, the extremists cannot maintain their conspicuous pose of moral superiority.\nWhich further goes to prove that their professed moral superiority is only a pose and there is nothing moral about PC morality at all. To be meaningful and coherent, to be a moral standard, morality must be universal and objective. And obviously, a dynamic morality defined by the most conspicuous consumers for the purposes of their own distinction can never be either.",
  "tags": [
    "economics",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-01T08:58:00+00:00"
}