{
  "url": "https://voxday.net/2014/05/28/those-brutal-crusaders/",
  "scraped_at": "2025-12-16T12:15:37.892133",
  "title": "The Sack of Jerusalem, revised",
  "date_display": "May 28, 2014",
  "date_iso": "2014-05-28T06:00:00+00:00",
  "date_from_url": "2014-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more history I read, the more I learn that the pop version of it isn’t merely incomplete, it is often downright misleading. I was always dubious of the stories of the terrible massacre of Jews and Muslims by Christian crusaders during the Sack of Jerusalem; the detail about the blood reaching to the bridles of the horses ridden by the knights in particular never passed the smell test for four reasons:</p><ol><li>The crusaders didn’t have many horses left. They’d eaten most of them at the siege of Antioch and they weren’t able to replace many of them.</li><li>You’d have to kill a tremendous amount of people very, very quickly and intentionally drain their bodies for the blood to get that deep before it ran off through the city’s drainage systems.</li><li>There were only about 15,000 crusaders attacking the city.</li><li>Who rides horses when storming city walls?</li></ol><p>Despite my skepticism about the body count, I was startled by the incredible shrinking number of people killed after the walls were breached when reading Thomas Asbridge’s <i>The Crusades: The Authoritative History of the War for the Holy Land</i>.</p><blockquote class=\"tr_bq\"><p> Neither Latin nor Arabic sources shy away from recording the dreadful horror of this sack, the one side glorying in victory, the other appalled by its raw savagery. In the decades that followed Near Eastern Islam came to regard the Latin atrocities at Jerusalem as an act of crusader barbarity and defilement, demanding of urgent vengeance. By the thirteenth century, the Iraqi Muslim Ibn al-Athir estimated the number of Muslim dead at 70,000. Modern historians long regarded this figure to be an exaggeration, but generally accepted that Latin estimates in excess of 10,000 might be accurate. However, recent research has uncovered close contemporary Hebrew testimony which indicates that casualties may not have exceeded 3,000, and that large numbers of prisoners were taken when Jerusalem fell. This suggests that, even in the Middle Ages, the image of the crusaders’ brutality in 1099 was subject to hyperbole and manipulation on both sides of the divide.</p></blockquote><p>Casualties may not have exceeded 3,000? For what is still cited as one of the most brutal massacres of all time? It’s the Spanish Inquisition all over again. Here, for example, is the previous authority on The Crusades, Steven Runciman, describing the sack:</p><blockquote class=\"tr_bq\"><p> Iftikhar and his men were safely escorted out of the city and permitted to join the Moslem garrison of Ascalon. They were the only Moslems in Jerusalem to save their lives. The Crusaders, maddened by so great a victory after such suffering, rushed through the streets and into the houses and mosques killing all that they met, men, women, and children alike. All that afternoon and all through the night the massacre continued. Tancred’s banner was no protection to the refugees in the mosque of al-Aqsa. Early next morning a band of Crusaders forced an entry into the mosque and slew everyone. When Raymond of Aguilers later that morning went to visit the Temple area he had to pick his way through corpses and blood that reached up to his knees.</p><p>The Jews of Jerusalem fled in a body to their chief synagogue. But they were held to have aided the Moslems and no mercy was shown to them. The building was set on fire and they were all burnt within. The massacre at Jerusalem profoundly impressed all the world. No one can say how many victims were involved, but it emptied Jerusalem of its Moslem and Jewish inhabitants.<br> – <i>The First Crusade</i>, Steven Runciman, p. 286-287</br></p></blockquote><p>What may not be apparent here is that Jerusalem had already been emptied of its Christian inhabitants, who were expelled by Iftikhar ad-Dawla, the Fatimid governor of the city, in preparation for a potential siege, and who, by Runciman’s own account, “outnumbered the Moslems in Jerusalem”. And it should be obvious that the 15,000 attackers couldn’t have killed all that many people, considering that they spent the evening of the day they took the city gathering in order to give thanks to God.</p><blockquote class=\"tr_bq\"><p> The other unassailable truth of Jerusalem’s conquest is that the crusaders were not simply driven by a desire for blood or plunder; they were also empowered by heartfelt piety and the authentic belief that they were doing God’s work. Thus that first, ghastly day of sack and slaughter concluded with an act of worship. In a moment which perfectly encapsulated the crusade’s extraordinary fusion of violence and faith, dusk on 15 July 1099 saw the Latins gather to give tearful thanks to their God. A Latin contemporary rejoiced in recounting that, ‘going to the Sepulchre of the Lord and his glorious Temple, the clerics and also the laity, singing a new song unto the Lord in a high-sounding voice of exultation, and making offerings and most humble supplications, joyously visited the Holy Place as they had so long desired to do’.</p></blockquote><p>Now, a sack certainly did take place and many of the city’s inhabitants were killed. But the scale appears to have been at least one order of magnitude less than has been conventionally claimed and certainly the <i>entire </i>population was not wiped out. So where did the legend come from? From a chronicler who wasn’t there liberally borrowing imagery from the Revelation of St. John.</p><blockquote class=\"tr_bq\"><p> The <i>Gesta Francorum</i> noted that the crusaders were left wading up to their ankles in blood by the work of butchery. However, another ‘eyewitness’, Raymond of Aguilers, expanded on this image. Lifting a scriptural quote from the New Testament Book of Revelation, he declared that the Franks ‘rode in [enemy] blood to the knees and bridles of their horses’. This more extreme image gained wide acceptance and was repeated by numerous western European histories and chronicles in the course of the twelfth century.</p></blockquote></div>",
  "content_text": "The more history I read, the more I learn that the pop version of it isn’t merely incomplete, it is often downright misleading. I was always dubious of the stories of the terrible massacre of Jews and Muslims by Christian crusaders during the Sack of Jerusalem; the detail about the blood reaching to the bridles of the horses ridden by the knights in particular never passed the smell test for four reasons:\nThe crusaders didn’t have many horses left. They’d eaten most of them at the siege of Antioch and they weren’t able to replace many of them.\nYou’d have to kill a tremendous amount of people very, very quickly and intentionally drain their bodies for the blood to get that deep before it ran off through the city’s drainage systems.\nThere were only about 15,000 crusaders attacking the city.\nWho rides horses when storming city walls?\nDespite my skepticism about the body count, I was startled by the incredible shrinking number of people killed after the walls were breached when reading Thomas Asbridge’s\nThe Crusades: The Authoritative History of the War for the Holy Land\n.\nNeither Latin nor Arabic sources shy away from recording the dreadful horror of this sack, the one side glorying in victory, the other appalled by its raw savagery. In the decades that followed Near Eastern Islam came to regard the Latin atrocities at Jerusalem as an act of crusader barbarity and defilement, demanding of urgent vengeance. By the thirteenth century, the Iraqi Muslim Ibn al-Athir estimated the number of Muslim dead at 70,000. Modern historians long regarded this figure to be an exaggeration, but generally accepted that Latin estimates in excess of 10,000 might be accurate. However, recent research has uncovered close contemporary Hebrew testimony which indicates that casualties may not have exceeded 3,000, and that large numbers of prisoners were taken when Jerusalem fell. This suggests that, even in the Middle Ages, the image of the crusaders’ brutality in 1099 was subject to hyperbole and manipulation on both sides of the divide.\nCasualties may not have exceeded 3,000? For what is still cited as one of the most brutal massacres of all time? It’s the Spanish Inquisition all over again. Here, for example, is the previous authority on The Crusades, Steven Runciman, describing the sack:\nIftikhar and his men were safely escorted out of the city and permitted to join the Moslem garrison of Ascalon. They were the only Moslems in Jerusalem to save their lives. The Crusaders, maddened by so great a victory after such suffering, rushed through the streets and into the houses and mosques killing all that they met, men, women, and children alike. All that afternoon and all through the night the massacre continued. Tancred’s banner was no protection to the refugees in the mosque of al-Aqsa. Early next morning a band of Crusaders forced an entry into the mosque and slew everyone. When Raymond of Aguilers later that morning went to visit the Temple area he had to pick his way through corpses and blood that reached up to his knees.\nThe Jews of Jerusalem fled in a body to their chief synagogue. But they were held to have aided the Moslems and no mercy was shown to them. The building was set on fire and they were all burnt within. The massacre at Jerusalem profoundly impressed all the world. No one can say how many victims were involved, but it emptied Jerusalem of its Moslem and Jewish inhabitants.\n–\nThe First Crusade\n, Steven Runciman, p. 286-287\nWhat may not be apparent here is that Jerusalem had already been emptied of its Christian inhabitants, who were expelled by Iftikhar ad-Dawla, the Fatimid governor of the city, in preparation for a potential siege, and who, by Runciman’s own account, “outnumbered the Moslems in Jerusalem”. And it should be obvious that the 15,000 attackers couldn’t have killed all that many people, considering that they spent the evening of the day they took the city gathering in order to give thanks to God.\nThe other unassailable truth of Jerusalem’s conquest is that the crusaders were not simply driven by a desire for blood or plunder; they were also empowered by heartfelt piety and the authentic belief that they were doing God’s work. Thus that first, ghastly day of sack and slaughter concluded with an act of worship. In a moment which perfectly encapsulated the crusade’s extraordinary fusion of violence and faith, dusk on 15 July 1099 saw the Latins gather to give tearful thanks to their God. A Latin contemporary rejoiced in recounting that, ‘going to the Sepulchre of the Lord and his glorious Temple, the clerics and also the laity, singing a new song unto the Lord in a high-sounding voice of exultation, and making offerings and most humble supplications, joyously visited the Holy Place as they had so long desired to do’.\nNow, a sack certainly did take place and many of the city’s inhabitants were killed. But the scale appears to have been at least one order of magnitude less than has been conventionally claimed and certainly the\nentire\npopulation was not wiped out. So where did the legend come from? From a chronicler who wasn’t there liberally borrowing imagery from the Revelation of St. John.\nThe\nGesta Francorum\nnoted that the crusaders were left wading up to their ankles in blood by the work of butchery. However, another ‘eyewitness’, Raymond of Aguilers, expanded on this image. Lifting a scriptural quote from the New Testament Book of Revelation, he declared that the Franks ‘rode in [enemy] blood to the knees and bridles of their horses’. This more extreme image gained wide acceptance and was repeated by numerous western European histories and chronicles in the course of the twelfth century.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-28T05:00:00+00:00"
}