{
  "url": "https://voxday.net/2014/05/19/vps-first-rule/",
  "scraped_at": "2025-12-16T12:14:49.096208",
  "title": "VP’s First Rule",
  "date_display": "May 19, 2014",
  "date_iso": "2014-05-19T13:00:00+00:00",
  "date_from_url": "2014-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>1. You will be addressed in the style you choose. If you come in here<br> slinging insults and acting disrespectfully, you will be treated with a<br> contemptuous and derisive disdain that will, based on past experience,<br> probably upset you.  This is particularly true for visitors who are<br> under the impression, mistaken or not, that they are far more<br> intelligent than the average individual here.  If instead, you elect to<br> offer substantive and civil criticism, then you will meet with a<br> similarly civil response.</br></br></br></br></br></br></br></i></p><p>I understand that some would-be rhetoricians mistakenly think that it is effective rhetoric to inappropriately apply labels that I have created specifically to describe certain things to me, to this blog, and to my readers. This is a false claim, moreover, a claim that can only be made in the full knowledge that it is not true.<br> <i><br/></i><br> So, be advised that if you describe this blog as a warren or its readers as rabbits, I will respond to you as if what you claim to believe is actually true. Which is to say that you will be expelled from the so-called warren in precisely the same manner you would be if it were a real intellectual warren. <br> <i><br/></i><br> If you wish to criticize, then criticize. You are free to do so. I have no objection to straightforward and honest criticism. But do not lie. Do not bear false witness. Do not engage in dishonest childish rhetorical tactics. And keep the First Rule in mind.</br></br></br></br></p></div>",
  "content_text": "1. You will be addressed in the style you choose. If you come in here\nslinging insults and acting disrespectfully, you will be treated with a\ncontemptuous and derisive disdain that will, based on past experience,\nprobably upset you.  This is particularly true for visitors who are\nunder the impression, mistaken or not, that they are far more\nintelligent than the average individual here.  If instead, you elect to\noffer substantive and civil criticism, then you will meet with a\nsimilarly civil response.\nI understand that some would-be rhetoricians mistakenly think that it is effective rhetoric to inappropriately apply labels that I have created specifically to describe certain things to me, to this blog, and to my readers. This is a false claim, moreover, a claim that can only be made in the full knowledge that it is not true.\nSo, be advised that if you describe this blog as a warren or its readers as rabbits, I will respond to you as if what you claim to believe is actually true. Which is to say that you will be expelled from the so-called warren in precisely the same manner you would be if it were a real intellectual warren.\nIf you wish to criticize, then criticize. You are free to do so. I have no objection to straightforward and honest criticism. But do not lie. Do not bear false witness. Do not engage in dishonest childish rhetorical tactics. And keep the First Rule in mind.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-19T12:00:00+00:00"
}