{
  "url": "https://voxday.net/2014/05/13/we-can-play-that-game/",
  "scraped_at": "2025-12-16T12:14:21.198011",
  "title": "We can play that game",
  "date_display": "May 13, 2014",
  "date_iso": "2014-05-13T13:00:00+00:00",
  "date_from_url": "2014-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember, any time you see someone pop off about Christianity or say anything negative about anyone on the Right who isn’t a straight white male, one has a duty to register a complaint with the appropriate speech police. Those are the new rules of the game, after all, and there is NO PLACE IN SOCIETY for anyone who expresses a negative opinion about God, or Christians, or <a href=\"http://www.dailymail.co.uk/news/article-2626218/MP-condemns-police-sending-two-officers-home-Twitter-user-criticised-UKIP.html\">the UK Independence Party</a>.</p><blockquote class=\"tr_bq\"><p> An education official was visited by police because he had upset Ukip on Twitter. Officers knocked at Michael Abberton’s door to question him about a mocked-up poster he had placed online that criticised the Eurosceptic party’s policies.</p><p>They asked him about his ‘intentions toward Ukip’ and suggested he should tell no one that the visit had taken place.</p><p>Mr Abberton, a Green party member, said police had overstepped the mark. The Cambridgeshire force said it had acted over a possible breach of electoral law. But their heavy-handed actions were condemned by civil rights campaigners and politicians from across the political spectrum.</p></blockquote><p>That sort of thing works much better on the r/selected anyhow, which makes it some QUALITY black-knighting. Because, remember, there is NO PLACE IN SOCIETY for people who do not believe the things that we believe.</p><p>If you seriously want to knock a feminist back, drop that line on her. They literally have no idea how to respond to being targeted that way. Not when there is NO PLACE IN SOCIETY for her.</p></div>",
  "content_text": "Remember, any time you see someone pop off about Christianity or say anything negative about anyone on the Right who isn’t a straight white male, one has a duty to register a complaint with the appropriate speech police. Those are the new rules of the game, after all, and there is NO PLACE IN SOCIETY for anyone who expresses a negative opinion about God, or Christians, or\nthe UK Independence Party\n.\nAn education official was visited by police because he had upset Ukip on Twitter. Officers knocked at Michael Abberton’s door to question him about a mocked-up poster he had placed online that criticised the Eurosceptic party’s policies.\nThey asked him about his ‘intentions toward Ukip’ and suggested he should tell no one that the visit had taken place.\nMr Abberton, a Green party member, said police had overstepped the mark. The Cambridgeshire force said it had acted over a possible breach of electoral law. But their heavy-handed actions were condemned by civil rights campaigners and politicians from across the political spectrum.\nThat sort of thing works much better on the r/selected anyhow, which makes it some QUALITY black-knighting. Because, remember, there is NO PLACE IN SOCIETY for people who do not believe the things that we believe.\nIf you seriously want to knock a feminist back, drop that line on her. They literally have no idea how to respond to being targeted that way. Not when there is NO PLACE IN SOCIETY for her.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-13T12:00:00+00:00"
}