{
  "url": "https://voxday.net/2014/05/04/weaponizing-girls/",
  "scraped_at": "2025-12-16T12:13:26.213410",
  "title": "Weaponizing girls",
  "date_display": "May 4, 2014",
  "date_iso": "2014-05-04T13:00:00+00:00",
  "date_from_url": "2014-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It astonishes me that liberals such as Nicholas Kristof can’t seem to understand that they are <a href=\"http://www.nytimes.com/2014/05/04/opinion/sunday/kristof-bring-back-our-girls.html?hp&amp;rref=opinion&amp;_r=0\">metaphorically painting targets</a> on the very young women they wish to proclaim off-bounds when they openly advocate female education as the most effective means of destroying rival cultures.</p><blockquote class=\"tr_bq\"><p> DOZENS<br> of heavily armed terrorists rolled into the sleepy little town one<br> night in a convoy of trucks, buses and vans. They made their way to the<br> girls’ boarding school. The<br> high school girls, asleep in their dormitory, awoke to gunfire. The<br> attackers stormed the school, set it on fire, and, residents said, then<br> herded several hundred terrified girls into the vehicles — and drove off<br> and vanished.</br></br></br></br></br></br></br></p><p>That<br> was April 15 in northern Nigeria. The girls were kidnapped by an<br> extremist Muslim group called Boko Haram, whose name in the Hausa<br> language means “<a href=\"http://studies.aljazeera.net/ResourceGallery/media/Documents/2012/2/29/2012229113341793734BOKO%20HARAM%20NIGERIAS%20EXTREMIST%20ISLAMIC%20SECT.pdf\" title=\"A pdf\">Western education is a sin.</a>”</br></br></br></p><p>The attack in Nigeria is part of a global backlash against girls’ education by extremists. The Pakistani Taliban shot Malala Yousafzai in the head at age 15 because she advocated for girls’ education. Extremists threw acid in the faces of girls walking to school in Afghanistan. And in Nigeria, militants destroyed 50 schools last year alone.</p><p>If the girls aren’t rescued, “no parent will allow their female child to go to school,” Hadiza Bala Usman, who has led protests in Nigeria on behalf of the missing girls, warned in a telephone interview….</p><p>The<br> best tool to fight extremism is education, especially of girls — and<br> that means ensuring that it is safe to study. The greatest threat to<br> militancy in the long run comes not from drones but from girls with<br> schoolbooks.</br></br></br></br></p><p>“These<br> abducted schoolgirls are my sisters,” Malala told me in an email from<br> Britain, where she is recovering from the Taliban attack, “and I call on<br> the international community and the government of Nigeria to take<br> action and save my sisters.” She added: “It should be our duty to speak<br> up for our brothers and sisters in Nigeria who are in a very difficult<br> situation.”</br></br></br></br></br></br></p></blockquote><p>It is apparent that the cunning plan of Western liberals to destroy the Dar al-Islam  by pushing secularized Western education on Islamic women has been comprehended by the strategists of the global Caliphate. The jihadists are responding in two ways, by infiltrating and taking over educational facilities in the West and by destroying Western educational facilities in the South and East. The very name of the Nigerian group illustrates that they grasp the Western tactic.</p><p>Now liberals like Kristof are aghast at the fact that the very young women they intentionally turned into cultural weapons on behalf of their secular ideals are being targeted for enslavement and destruction. But what else did they expect? It would appear they were misled by the widespread failure of the Christians of the West to respond to the successful capture of their daughters by the secular establishment into thinking that the Muslims of the South and East would be similarly complacent.</p><p>If Western secularists actually gave a damn about women, (and the tens of millions of aborted young girls around the world strongly suggests they don’t), then they should have thought twice before weaponizing young women and turning them into legitimate targets in the violent clash of rival cultures.</p><p>Some of my dimmer critics have been foolish enough to claim that I support the actions of the Islamic militants in targeting young women. I do not. In fact, I am a far more staunch opponent of the militants’ objectives than those secular would-be dimmis will ever be. Unlike them, I will never submit. Unlike them, I have a rational perspective on strategy. I understand that if you make something a weapon, your enemy will have to be cowardly, self-defeating, or a fool to refrain from destroying it.</p><p>And Islam was weakening its enemies by capturing its youth long before Western secularists had the bright idea of taking over the school systems. But at least the equalitarians should be pleased to know that it is not only boys who are now able to pursue a career as a janissary catamite.</p></div>",
  "content_text": "It astonishes me that liberals such as Nicholas Kristof can’t seem to understand that they are\nmetaphorically painting targets\non the very young women they wish to proclaim off-bounds when they openly advocate female education as the most effective means of destroying rival cultures.\nDOZENS\nof heavily armed terrorists rolled into the sleepy little town one\nnight in a convoy of trucks, buses and vans. They made their way to the\ngirls’ boarding school. The\nhigh school girls, asleep in their dormitory, awoke to gunfire. The\nattackers stormed the school, set it on fire, and, residents said, then\nherded several hundred terrified girls into the vehicles — and drove off\nand vanished.\nThat\nwas April 15 in northern Nigeria. The girls were kidnapped by an\nextremist Muslim group called Boko Haram, whose name in the Hausa\nlanguage means “\nWestern education is a sin.\n”\nThe attack in Nigeria is part of a global backlash against girls’ education by extremists. The Pakistani Taliban shot Malala Yousafzai in the head at age 15 because she advocated for girls’ education. Extremists threw acid in the faces of girls walking to school in Afghanistan. And in Nigeria, militants destroyed 50 schools last year alone.\nIf the girls aren’t rescued, “no parent will allow their female child to go to school,” Hadiza Bala Usman, who has led protests in Nigeria on behalf of the missing girls, warned in a telephone interview….\nThe\nbest tool to fight extremism is education, especially of girls — and\nthat means ensuring that it is safe to study. The greatest threat to\nmilitancy in the long run comes not from drones but from girls with\nschoolbooks.\n“These\nabducted schoolgirls are my sisters,” Malala told me in an email from\nBritain, where she is recovering from the Taliban attack, “and I call on\nthe international community and the government of Nigeria to take\naction and save my sisters.” She added: “It should be our duty to speak\nup for our brothers and sisters in Nigeria who are in a very difficult\nsituation.”\nIt is apparent that the cunning plan of Western liberals to destroy the Dar al-Islam  by pushing secularized Western education on Islamic women has been comprehended by the strategists of the global Caliphate. The jihadists are responding in two ways, by infiltrating and taking over educational facilities in the West and by destroying Western educational facilities in the South and East. The very name of the Nigerian group illustrates that they grasp the Western tactic.\nNow liberals like Kristof are aghast at the fact that the very young women they intentionally turned into cultural weapons on behalf of their secular ideals are being targeted for enslavement and destruction. But what else did they expect? It would appear they were misled by the widespread failure of the Christians of the West to respond to the successful capture of their daughters by the secular establishment into thinking that the Muslims of the South and East would be similarly complacent.\nIf Western secularists actually gave a damn about women, (and the tens of millions of aborted young girls around the world strongly suggests they don’t), then they should have thought twice before weaponizing young women and turning them into legitimate targets in the violent clash of rival cultures.\nSome of my dimmer critics have been foolish enough to claim that I support the actions of the Islamic militants in targeting young women. I do not. In fact, I am a far more staunch opponent of the militants’ objectives than those secular would-be dimmis will ever be. Unlike them, I will never submit. Unlike them, I have a rational perspective on strategy. I understand that if you make something a weapon, your enemy will have to be cowardly, self-defeating, or a fool to refrain from destroying it.\nAnd Islam was weakening its enemies by capturing its youth long before Western secularists had the bright idea of taking over the school systems. But at least the equalitarians should be pleased to know that it is not only boys who are now able to pursue a career as a janissary catamite.",
  "tags": [
    "education",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-05-04T12:00:00+00:00"
}