{
  "url": "https://voxday.net/2020/06/01/enjoy-the-inevitable/",
  "scraped_at": "2025-12-21T12:56:19.009216",
  "title": "Enjoy the inevitable",
  "date_display": "June 1, 2020",
  "date_iso": "2020-06-01T14:16:13+00:00",
  "date_from_url": "2020-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you be discouraged, keep in mind that <i>everything </i>we’ve been seeing over the last few days has been absolutely inevitable since 1965. There was never any other possible outcome. The decline and fall was designed. On a related note, see if you can spot what I found amusing about <a href=\"https://declineandfall.blog/2018/12/14/vox-day-and-2033/\">this rather apposite article</a> concerning my prediction of the coming collapse of the United States.</p><blockquote><p>According to Vox Day, the 1965 immigration act and the subsequent amnesty were nothing short of existential disasters for the United States. He recently wrote about the consequences of the Act:<br><i><br/></i><i>“The post-1965 mass immigration policy was entirely based on lies and misrepresentations, and 50 years on it is clear that global migration has destroyed America, the largest invasion in human history has severely weakened the United States, and if a significant portion of the post-1965 immigrants and their descendants are not repatriated in the next decade, they will cause the complete collapse of the Union, violent ethnic conflict, and a civil war of unprecedented magnitude.”</i></br></p><p>Vox wrote a long post last year about Representative Emanuel Celler, the primary author of the 1965 act. He suggests that as a third-generation immigrant, Celler was blind to the inevitable consequences of increased migration. Many dismiss Vox as a racist because he observes the actions and consequences of different ethnic groups, but they rarely engage with those observations themselves. It should be obvious that the descendants of the pioneers who fought the American Revolution will have different worldviews than the descendants of Ellis Island immigrants. Many of the most vocal proponents of increased migration are descendants of immigrants themselves. The notion that America is a “nation of immigrants” is a mantra repeated by the descendants of immigrants.</p><p>Early in the 2016 presidential campaign, Vox responded to Globalist Party Republican John Kasich’s call for amnesty for illegal aliens:</p><p><i>“The dirt is not magic. The USA is not magically exempt from the same rules of power, politics, and war that have stricken nearly every other multiethnic society in history at one time or another. There is absolutely nothing preventing what has happened many times elsewhere from happening on US soil.”</i></p><p>I believe it was Steve Sailer who coined the term “magic dirt” to refer to the belief that migrants from diverse nations and cultures can suddenly become just as American as George Washington and Thomas Jefferson when they set foot on American soil. Despite globalist media doing their best to label any such discussion as racist, the debate about exactly what it means to be American is a necessary one to have. Is America a place? Is it an idea? Or is it a people, the descendants of its founders? This question is easier with mono-ethnic nations. Ethiopia is a place inhabited by Ethiopians. Japan is a nation inhabited by the Japanese. But who decides who is American?</p></blockquote><p>Oh, the irony…. Actually, I don’t believe for one second that Cellar was unaware of the inevitable consequences of his actions. While many of his co-ethnics bought into the con, Cellar himself was seeking to break the power of the white Christian world hegemony created by Great Britain and inherited by the USA after World War II. Anyhow, do you seriously believe that you can live in peace in the same society as the joggers who are protesting and looting everything or the Antifa activists who are burning and breaking everything? Forget whether you want to do so or not, do you actually believe it is even <i>possible?</i><br><i><br/></i>One reason the Roman Empire lasted so much longer than the US Empire will is that the Romans knew better than to permit the foreign corruption of their state.<br><i><br/></i><i>From the readiness wherewith the Romans conferred the right of citizenship on foreigners, there came to be so many new citizens in Rome, and possessed of so large a share of the suffrage, that the government itself began to alter, forsaking those courses which it was accustomed to follow, and growing estranged from the men to whom it had before looked for guidance. Which being observed by Quintius Fabius when censor, he caused all those new citizens to be classed in four Tribes, that being reduced within this narrow limit they might not have it in their power to corrupt the entire State. And this was a wisely contrived measure, for, without introducing any violent change, it supplied a convenient remedy, and one so acceptable to the republic as to gain for Fabius the well-deserved name of Maximus.</i><br><i>– </i>Machiavelli<i>, </i>CHAPTER XLIX,<i> Discourses</i><i></i><br><i><b><br/></b></i>This column, written more than nine years ago, may help one put recent events in the proper historical perspective.</br></br></br></br></p><p><i><b>The New White Man’s Burden</b></i><br>28 February 2011<br><i><br/></i>The harsh historical reality is that no human society ever survives. They come into being, they thrive, they decline and eventually they perish. If they were remarkable, perhaps they will leave indications of their past existence through literature and the arts, through place names and through their influence on subsequent ideas and modes of thought. But that does not bring them back to life; the modern Greece of IMF-inspired riots, burning banks and filthy streets is not the ancient Greece of the philosophers and the Athenian Empire.</br></br></p><p>Societies also tend to collapse much faster than anyone, especially its inhabitants, ever anticipates.  Plato envisioned his ideal republic 24 years after the unexpected defeat of Athens in the Peloponnesian War, and no doubt he had little idea that Athens would never rise again to its former glory.  Cicero composed his ode to the ideal of Roman governance in <i>De re publica</i> only seven years before his beloved Republic of Rome collapsed into civil war and eventual dictatorship. The British empire, upon which the sun never set, ruled over a quarter of the world’s population and nearly a quarter of its total land area before it fell into rapid decline and disappeared within 30 years of it reaching its greatest expanse. Last week, the British were shocked to discover that they lacked the wherewithal to rescue their own citizens from the wreckage of a fifth-rate Arab country.</p><p>In summary, the apex is always the point at which the eventual decline begins. It is now abundantly clear that 1989, which marked the fall of the Berlin Wall and the subsequent breakup of the Soviet empire, also represented the high point for the American empire. As if the market and economic catastrophes of the last 12 years were not evidence enough, the stunning impotence of America in the face of Islamic revival sweeping over one collapsing U.S.-backed ally after another makes it eminently clear that America is a global power in decline.</p><p>American authors such as Pat Buchanan and Paul Kennedy were among the first to perceive that America was in a state of decline. Now, even foreign journalists are aware of the phenomenon and comment openly upon it. The neocon triumphalism behind the military occupations of Afghanistan and Iraq was nothing more than the usual last gasp of empires; this has been a recognizable pattern since the Athenians sent the flower of their navy to perish on the shores of Sicily more than 2,000 years ago.</p><p>The decline of America can be traced to three fundamental factors: debt, demographics and democracy.  Of those three factors, it is demographics that is the most vital. Since the 1965 Immigration Act, the American political elite has been electing a new people by encouraging immigration from a wide variety of societies that are vastly different in ethnic and cultural terms than American society. In combination with this vast invasion of the, shall we say, unconventionally civilized, the traditional male-female dynamic that had proven successful for centuries was altered through a transformation of the legal and judicial systems. This confluence of factors has created a tremendous challenge for the white male population, as young white American men now have every material incentive to opt out of activities which tend to foster societal survival and very little incentive to opt in.</p><p>This challenge does not exist because Roissy and the other apostles of Game are incorrect about the deck being grotesquely stacked against the delta males upon whom the continued survival of civilization ultimately rests. It exists precisely because they are correct. They are absolutely right. No society that has been reorganized and restructured to provide such a perverse system of incentives deserves to survive, indeed, no such civilized society ever has survived. And therein lies the awesome challenge present to the men of the West, to the young men of America, today.</p><p>The education system is stacked against them. The media are stacked against them. The law is stacked against them. The family courts are stacked against them. The church will cheerfully lecture them on their failures while uniformly giving women a pass on everything from abortion and gluttony to a failure to honor and submit to their husbands. Society has provided every possible excuse for a young, white Christian man to give up, opt out and become the videogame-addicted, marriage-avoidant, slut-shagging degenerate that the entertainment industry portrays him to be.</p><p>But is this not precisely the sort of challenge that real men have always craved? To stubbornly persist in the face of overwhelming evil is the root of all heroism. Instead of being seen as an unavoidable morass, the culture must be viewed as an evil to be resisted and eventually overcome. Not every man will survive the battle, just as not every Marine who stormed the bloody beaches of Tarawa lived to tell the terrible tale. For every man who marries a God-fearing woman and becomes the head of a strong family in which the basic tenets of American Christian civilization are preserved, there will be one who is financially raped in divorce court, is ruined by the parasitic governmental hegemony or falls victim to an intoxicated illegal alien driving without a driver’s license. But it is no shame to fall in the battle. The only shame is to be found in the failure to fight it.</p><p>There is no reason for despair. The collapse of American empire is precisely what will bring about the end of the current system in which the unproductive prosper on the efforts of the productive, and it is certain because it is mathematically unsustainable. The old White Man’s Burden was to bring Christian civilization to the savage. The new White Man’s Burden is to plant seeds of Christian civilization that are capable of surviving the coming descent into savagery.</p></div>",
  "content_text": "Lest you be discouraged, keep in mind that\neverything\nwe’ve been seeing over the last few days has been absolutely inevitable since 1965. There was never any other possible outcome. The decline and fall was designed. On a related note, see if you can spot what I found amusing about\nthis rather apposite article\nconcerning my prediction of the coming collapse of the United States.\nAccording to Vox Day, the 1965 immigration act and the subsequent amnesty were nothing short of existential disasters for the United States. He recently wrote about the consequences of the Act:\n“The post-1965 mass immigration policy was entirely based on lies and misrepresentations, and 50 years on it is clear that global migration has destroyed America, the largest invasion in human history has severely weakened the United States, and if a significant portion of the post-1965 immigrants and their descendants are not repatriated in the next decade, they will cause the complete collapse of the Union, violent ethnic conflict, and a civil war of unprecedented magnitude.”\nVox wrote a long post last year about Representative Emanuel Celler, the primary author of the 1965 act. He suggests that as a third-generation immigrant, Celler was blind to the inevitable consequences of increased migration. Many dismiss Vox as a racist because he observes the actions and consequences of different ethnic groups, but they rarely engage with those observations themselves. It should be obvious that the descendants of the pioneers who fought the American Revolution will have different worldviews than the descendants of Ellis Island immigrants. Many of the most vocal proponents of increased migration are descendants of immigrants themselves. The notion that America is a “nation of immigrants” is a mantra repeated by the descendants of immigrants.\nEarly in the 2016 presidential campaign, Vox responded to Globalist Party Republican John Kasich’s call for amnesty for illegal aliens:\n“The dirt is not magic. The USA is not magically exempt from the same rules of power, politics, and war that have stricken nearly every other multiethnic society in history at one time or another. There is absolutely nothing preventing what has happened many times elsewhere from happening on US soil.”\nI believe it was Steve Sailer who coined the term “magic dirt” to refer to the belief that migrants from diverse nations and cultures can suddenly become just as American as George Washington and Thomas Jefferson when they set foot on American soil. Despite globalist media doing their best to label any such discussion as racist, the debate about exactly what it means to be American is a necessary one to have. Is America a place? Is it an idea? Or is it a people, the descendants of its founders? This question is easier with mono-ethnic nations. Ethiopia is a place inhabited by Ethiopians. Japan is a nation inhabited by the Japanese. But who decides who is American?\nOh, the irony…. Actually, I don’t believe for one second that Cellar was unaware of the inevitable consequences of his actions. While many of his co-ethnics bought into the con, Cellar himself was seeking to break the power of the white Christian world hegemony created by Great Britain and inherited by the USA after World War II. Anyhow, do you seriously believe that you can live in peace in the same society as the joggers who are protesting and looting everything or the Antifa activists who are burning and breaking everything? Forget whether you want to do so or not, do you actually believe it is even\npossible?\nOne reason the Roman Empire lasted so much longer than the US Empire will is that the Romans knew better than to permit the foreign corruption of their state.\nFrom the readiness wherewith the Romans conferred the right of citizenship on foreigners, there came to be so many new citizens in Rome, and possessed of so large a share of the suffrage, that the government itself began to alter, forsaking those courses which it was accustomed to follow, and growing estranged from the men to whom it had before looked for guidance. Which being observed by Quintius Fabius when censor, he caused all those new citizens to be classed in four Tribes, that being reduced within this narrow limit they might not have it in their power to corrupt the entire State. And this was a wisely contrived measure, for, without introducing any violent change, it supplied a convenient remedy, and one so acceptable to the republic as to gain for Fabius the well-deserved name of Maximus.\n–\nMachiavelli\n,\nCHAPTER XLIX,\nDiscourses\nThis column, written more than nine years ago, may help one put recent events in the proper historical perspective.\nThe New White Man’s Burden\n28 February 2011\nThe harsh historical reality is that no human society ever survives. They come into being, they thrive, they decline and eventually they perish. If they were remarkable, perhaps they will leave indications of their past existence through literature and the arts, through place names and through their influence on subsequent ideas and modes of thought. But that does not bring them back to life; the modern Greece of IMF-inspired riots, burning banks and filthy streets is not the ancient Greece of the philosophers and the Athenian Empire.\nSocieties also tend to collapse much faster than anyone, especially its inhabitants, ever anticipates.  Plato envisioned his ideal republic 24 years after the unexpected defeat of Athens in the Peloponnesian War, and no doubt he had little idea that Athens would never rise again to its former glory.  Cicero composed his ode to the ideal of Roman governance in\nDe re publica\nonly seven years before his beloved Republic of Rome collapsed into civil war and eventual dictatorship. The British empire, upon which the sun never set, ruled over a quarter of the world’s population and nearly a quarter of its total land area before it fell into rapid decline and disappeared within 30 years of it reaching its greatest expanse. Last week, the British were shocked to discover that they lacked the wherewithal to rescue their own citizens from the wreckage of a fifth-rate Arab country.\nIn summary, the apex is always the point at which the eventual decline begins. It is now abundantly clear that 1989, which marked the fall of the Berlin Wall and the subsequent breakup of the Soviet empire, also represented the high point for the American empire. As if the market and economic catastrophes of the last 12 years were not evidence enough, the stunning impotence of America in the face of Islamic revival sweeping over one collapsing U.S.-backed ally after another makes it eminently clear that America is a global power in decline.\nAmerican authors such as Pat Buchanan and Paul Kennedy were among the first to perceive that America was in a state of decline. Now, even foreign journalists are aware of the phenomenon and comment openly upon it. The neocon triumphalism behind the military occupations of Afghanistan and Iraq was nothing more than the usual last gasp of empires; this has been a recognizable pattern since the Athenians sent the flower of their navy to perish on the shores of Sicily more than 2,000 years ago.\nThe decline of America can be traced to three fundamental factors: debt, demographics and democracy.  Of those three factors, it is demographics that is the most vital. Since the 1965 Immigration Act, the American political elite has been electing a new people by encouraging immigration from a wide variety of societies that are vastly different in ethnic and cultural terms than American society. In combination with this vast invasion of the, shall we say, unconventionally civilized, the traditional male-female dynamic that had proven successful for centuries was altered through a transformation of the legal and judicial systems. This confluence of factors has created a tremendous challenge for the white male population, as young white American men now have every material incentive to opt out of activities which tend to foster societal survival and very little incentive to opt in.\nThis challenge does not exist because Roissy and the other apostles of Game are incorrect about the deck being grotesquely stacked against the delta males upon whom the continued survival of civilization ultimately rests. It exists precisely because they are correct. They are absolutely right. No society that has been reorganized and restructured to provide such a perverse system of incentives deserves to survive, indeed, no such civilized society ever has survived. And therein lies the awesome challenge present to the men of the West, to the young men of America, today.\nThe education system is stacked against them. The media are stacked against them. The law is stacked against them. The family courts are stacked against them. The church will cheerfully lecture them on their failures while uniformly giving women a pass on everything from abortion and gluttony to a failure to honor and submit to their husbands. Society has provided every possible excuse for a young, white Christian man to give up, opt out and become the videogame-addicted, marriage-avoidant, slut-shagging degenerate that the entertainment industry portrays him to be.\nBut is this not precisely the sort of challenge that real men have always craved? To stubbornly persist in the face of overwhelming evil is the root of all heroism. Instead of being seen as an unavoidable morass, the culture must be viewed as an evil to be resisted and eventually overcome. Not every man will survive the battle, just as not every Marine who stormed the bloody beaches of Tarawa lived to tell the terrible tale. For every man who marries a God-fearing woman and becomes the head of a strong family in which the basic tenets of American Christian civilization are preserved, there will be one who is financially raped in divorce court, is ruined by the parasitic governmental hegemony or falls victim to an intoxicated illegal alien driving without a driver’s license. But it is no shame to fall in the battle. The only shame is to be found in the failure to fight it.\nThere is no reason for despair. The collapse of American empire is precisely what will bring about the end of the current system in which the unproductive prosper on the efforts of the productive, and it is certain because it is mathematically unsustainable. The old White Man’s Burden was to bring Christian civilization to the savage. The new White Man’s Burden is to plant seeds of Christian civilization that are capable of surviving the coming descent into savagery.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-01T13:16:13+00:00"
}