{
  "url": "https://voxday.net/2020/06/01/game-design-interview-2015/",
  "scraped_at": "2025-12-21T12:56:20.827185",
  "title": "Game design interview (2015)",
  "date_display": "June 1, 2020",
  "date_iso": "2020-06-01T16:55:49+00:00",
  "date_from_url": "2020-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm1.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"399\" data-original-width=\"640\" decoding=\"async\" fetchpriority=\"high\" height=\"249\" src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm1.png\" width=\"400\"/></a></div><p><i>You may be familiar with long-time blogger, game designer, science fiction writer, and gamergate supporter Vox Day. He recently did an interview in Russian with Werta Best at old-games.ru where he shares insider information on how he has been designing games for over two decades. Currently he is lead designer for Alpenwolf. Below is the interview in English.</i></p><p>—</p><p><b>When and how you started your activity in the development of computer games?</b></p><p>My interest in game development began in 1989 when two friends and I formed “Screaming Tortellini Software” with the idea of making games. We never did anything substantive, but one of them co-founded Fenris Wolf with me in 1993. My first serious professional activity was coming up with the concept for a 16-bit, 44 Khz, 16-channel sound card in the spring of 1989. An engineer at my father’s company built a prototype for me and we had it working perfectly, but I could never convince anyone at the company to take it seriously, including my father. This was two years before Media Vision released its Pro Audio Spectrum, an 8-bit, 2-channel card that was a massive success. I should have dropped out of college and started selling it; that is one of my bigger regrets.</p><p><b>Why did you decide to call your team “Fenris Wolf” after a hero of Scandinavian epics?</b></p><p>I grew up in Minnesota. My partner Andrew was Scandinavian and we were both steeped in Scandinavian mythology. It was a fairly natural choice for us.</p><p><b>What was the main idea in Rebel Moon book which you wrote in collaboration with Bruce Bethke? The “Rebel Moon” – it was the “Book based on PC game” or vise versa :)?</b></p><p>The game design preceded the book. In fact, it was the game tie-in that first interested Scott Shannon of Pocket Books, since we met at CGDC. I brought Bruce in because it was my first attempt at writing anything and I figured I’d better have a co-author who knew what he was doing. I learned a tremendous amount from him. He’s a great writer and one of the very few genuinely funny writers out there. Scott was the first publisher to be aware of the importance of game tie-ins; he published the Doom books, Rebel Moon, and he even arranged it with Blizzard for me to write the Starcraft novels. However, I subsequently, and rather stupidly, declined to write them, since they just wanted generic cackling villain stuff and I wasn’t interested in that.</p><p><b>Did you have some feelings in those years (1995) that using of Creative Labs 3D Blaster hardware maybe a cause of low popularity for Rebel Moon game (RM).</b></p><p>We knew from the start that we would never sell a single copy of it at retail because the game was tied to the Creative hardware. That didn’t bother us. It gave us the foot in the industry door we were seeking.</p><p><b>Who was the first member in your team who proposed the revolutionary idea to use the beautiful color lighting in the developed RM game engine? Attention please, it was before Unreal release! Did your team perform an overview of the graphics capabilities for other first person shooters published before RM?</b></p><p>That was my partner Andrew’s idea. We knew Marc Rein and the guys at Unreal very well, in fact, our audio guy and housemate is now their audio director. Because we came from a high-resolution graphics background, we always looked to push the envelope in one way or another. Expanding the color depth was something we wanted to do as soon as the hardware could handle it. The problem was that you were still limited to 256-color palettes in the textures due to memory limitations.</p><p><b>Why didn’t you release the updated version of Rebel Moon on the Windows platform after you upgraded the graphics engine for Rebel Moon Rising (RMR)? This was quite possible, whereas for both games formats in level maps were almost 99{105b5945f2a7891a3dd860d3a09046b26c32f8a07d097b566642738deee8841e} fully compatible!</b></p><p>The thought never even occurred to us. We were never in the habit of looking back at what we’d already done. All we were concerned about is how we could most effectively make use of the new and better hardware that was coming out.</p><p><b>We couldn’t found in the Internet any CD-covers of the Rebel Moon game. Apparently, this game came out only in the collection from Creative Labs disc, and the separate disk of the Rebel Moon game never was published?</b></p><p>That’s correct. It was only available in a CD envelope included in the 3D Blaster box. The sleeve cover was a painting of a rebel LDF solder sitting down, holding a pistol and staring up at the Earth.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm3.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" data-original-height=\"521\" data-original-width=\"432\" decoding=\"async\" height=\"400\" src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm3.jpg\" width=\"331\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"521\" data-original-width=\"432\" data-src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm3.jpg\" decoding=\"async\" height=\"400\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20432%20521%22%3E%3C/svg%3E\" width=\"331\"/></a></div><p><b>Unlike the previous game, the Rebel Moon Rising was created without of any book basis. Who was the first who proposed the idea of continuation for Rebel Moon game series called Rebel Moon Rising?</b></p><p>I think it was our lead artist, Brett Hawkins, who came up with the title. We’d always intended to continue with the lunar rebellion narrative. If you’ve read the novel, then you know that everything from the continuation of the war to the jump to alien D-space was planned. Old school fans will probably be interested to know that my Quantum Mortis series is the Rebel Moon narrative expanded into the very far future.</p><p><b>What’s in your opinion was the reason for poor commercial success of Rebel Moon Rising – is it because of previous game has low popularity (Rebel Moon, 1995) or due to low resolution of sprites used in both games?</b></p><p>One word. QUAKE. Rebel Moon Rising got pretty good reviews and was well-regarded by other designers, but once people had a taste of 3D, they didn’t want to go back to 2.5D. It’s not like that surprised us. After all, I was the one who originally trademarked “3D Blaster” years before and I’d spent a lot of time out in the Bay Area as a Transdimensional Evangelist trying to convince Creative, Hercules, and Diamond, among others, to adopt 3D acceleration long before Jensen Huang got Nvidea going. We knew 3D was going to be big for the shooter market, but we didn’t have time to write a 3D engine on Intel’s schedule. And more importantly, we discovered that the graphics bus was too slow to let the MMX properly support 3D at the higher resolutions we originally intended to support.</p><p>The original MMX was actually four times faster than it was able to deliver, but the limitation was the bus, not the chip’s performance. We were the ones who discovered the problem; Intel was absolutely horrified when we proved it to them by blitting a 2-bit black rectangle. Commercial success was always an afterthought, as our Intel relationship guided most of our decisions and generated most of our revenue.</p><p><b>We were very pleased with effects for varying of gravity on some level’s maps – it was one of the most original gameplay ideas in both Rebel Moon games. Has anyone used same method for walkthrough of levels in other games published in 90s? Who was the author of idea in your team?</b></p><p>I don’t know. I asked Andrew and he doesn’t recall either. Our culture at Fenris Wolf was always one of pushing things further. We created the first escort mission in a shooter, we were the first to support MMX, the first to implement speech recognition in a multiplayer game (you could switch weapons and send predetermined messages using your voice), and we also introduced a number of smaller innovations like in-level variable gravity. Given that the game was set in space, the idea of blowing up a gravity generator and then having it affect the gameplay would have seemed pretty obvious to all of us at the time.</p><p><b>The net game levels walkthrough in RMR is more interesting than single player maps. It seems that RMR game originally was planned as a coop game only and single player levels are just the secondary product from net levels. Is it right?</b></p><p>No, it’s precisely backward. The problem with single player was that Intel’s testers simply weren’t gamers. We created the first two levels, which are borderline retarded and come complete with arrows on the floor pointing GO THIS WAY, rather late in the process because the testers couldn’t manage to complete levels that any competent gamer could play through in minutes. So we had to dumb everything down. We didn’t even do the multiplayer stuff until the retail release with GT, but because Intel wasn’t involved with those, we could design them for proper gamers. That’s probably why they are more interesting.</p><p><b>In our opinion, for Rebel Moon Rising game very effective way was used to a sharp change of the game environment – teleportation to another planet (in alien world). And it was made one year before popular Half-Life! (teleport to Xen…). This significant jump was originally planned in the RMR game scenario as well as concept art?</b></p><p>In light of the fact that we were using an expanded color depth for the first time, my decision to set the storyline in space, on the Moon, was a very, very bad one. I thought it would be visually impressive to have these rich jeweled tones of the lasers and lights contrasted against the grays of the environment, but the effect was just too subtle. And our artists, while smart and talented, were all very young and hired straight out of art school with no computer or 3D experience. We should have done something more wild and garish like Unreal.</p><p>The decision to shift the focus to the alien environments allowed us to bring in more color and interesting visuals than was permitted by an environment mostly filled with black space and Moon rocks. The jump was definitely planned in the design document and it was always part of the story, but we did end up putting more of the levels in the alien environments than originally planned due to the desire to incorporate more interesting graphical elements.</p><p><b>The RMR game has one interesting level – mission with task to liquidation of woman. She was commander(!) of Earth special(!) forces(!). Do you afraid of strong hate from feminist organizations now about such mission goals :)?</b></p><p>No. Couldn’t care less. We weren’t making a political point. It wasn’t our only assassination mission anyhow, I think there was one in the original RM as well.</p><p><b>What the creatures were as prototypes for two alien races in RMR: Estrons and Shoggrans?</b></p><p>The alien races were original creations. The Shog’grans were industrial and took advantage of the less advanced Estrons by turning them into slaves that were horrifically mutilated imitations of the Shog’gran Interregnum, the poor Subestrons. We didn’t base the races on anything in particular, we just wanted some reason that the LDF fighters would find sympathy with the very monsters they fought and killed at the end of Rebel Moon. So Shog’grans and Estrons were primarily created to meet the demands of the narrative.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm2.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"666\" data-original-width=\"480\" decoding=\"async\" height=\"400\" src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm2.jpg\" width=\"287\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"666\" data-original-width=\"480\" data-src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm2.jpg\" decoding=\"async\" height=\"400\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20480%20666%22%3E%3C/svg%3E\" width=\"287\"/></a></div><p><b>When you began to plan one more continuation for RM series? Was the Rebel Moon Revolution (RMRev) originally planned with absolutely another gameplay format (command tactical shooter)?</b></p><p>Yes. I was playing a lot of Advanced Squad Leader at the time, so the idea of having a 2D strategy game connected to the 3D tactical game was very attractive to me. However, we made a fatal mistake in deciding to rely upon two levels of artificial intelligence and giving both friendly and enemy squads near-complete autonomy within the mission parameters rather than going with a heavily scripted approach.</p><p>There were three ways to solve the problem, we took one with Revolution, Half-Life took another, and later, Combat Mission took a third. Obviously, Valve’s solution was the best. But even today, no one has AI as good as RMRev had, because it is very hard to do well and even companies like Kynogon were much more focused on the purely tactical aspects. In addition to designing the Strat and Tac AIs, we brought in the guy who did the AI for Enemy Nations, which at the time was considered state of the art. But we definitely bit off more than we could reasonably chew with a team that size.<br><b><br/></b><b>Why did you decided not to use sprites in Rebel Moon Revolution game? After all, the well known publisher GT Interactive has released two 3D shooters in the 1998: NAM and WWIIGI, with more poor quality of sprites and sounds than were used in RMR. Why you decided to create a new game entirely in 3D-graphics?</b></br></p><p>We would have done the original RM in 3D if we could have. We always wanted to do 3D and write our own engine. GT Interactive even offered us the use of the Unreal engine for RMRev; we probably should have just accepted it and figured out how to add some decent AI to it rather than insisting on writing our own Revolution engine. The root problem was that we never had enough programmers to achieve our vision, we never had more than four and two of them were entirely devoted to AI.</p><p><b>If your team members began to create from scratch 3D-graphics engine and AI engine for Rebel Moon Revolution game, did they fully understand all complexities of this path? How hard it was for you and for your friends on this way?</b></p><p>What we didn’t understand was that you can really only do one major new thing and two minor new things at a time. We were trying to simultaneously break new ground, at least for us, in four major new ways. We were writing our own non-Euclidean 3D engine, we were developing two tiers of advanced AI, we were developing a launch title for an new console, and we were trying to wed a 2D strategy game to a 3D tactical game. It was completely insane in retrospect. We were too young, and we’d had too much early success, to grasp our limitations.</p><p>The crazy thing is that we still would have pulled the larger part of it off if it hadn’t been for both Sega and GT going down in flames at around the same time. We had an incredibly smart and talented team at Fenris, we found jobs for every single employee within weeks after we decided to shut down. Most of them are still in the industry, or eventually left it on their own terms.</p><p>To be honest, though, since both Eric and John, the two AI programmers, were diagnosed with cancer and subsequently died not very long after that, it was hard for any of us to feel too sorry for ourselves. We may have missed out on becoming something akin to Epic, but there are worse fates.</p><p><b>Without going into details of legal trials, please say, what was the main reason of the publishing abolition of this in all aspects revolutionary (Rebel Moon Revolution) game? Maybe it was the usual competition of the game developers?</b></p><p>GT Interactive was running out of money and as far as I can tell, they cut every game that wasn’t scheduled for completion within the next six months. The problem is that they didn’t actually cancel the game, which would have permitted us to take it elsewhere, they simply refused to pay an already-approved milestone. They ended up having to write us a much larger check two years later, but by then the damage was done. We couldn’t take the game, or even the engine, to another publisher with that hanging over our heads. When Sega of Japan shut down Sega of America around the same time, the one-two punch was simply more than one small company could take.</p><p><b>And now one of important questions for me about canceling of Rebel Moon Revolution. In 1999 before publishing “The War in Heaven” game your team has an almost completed engine (REV Engine v.0.9). Why did you not to compile a simple 3D-shooter with 3D models, levels from RMRev project, simplified AI and without any voice control? It would be a little bit another Rebel Moon Revolution than originally planned. For example, it would be like a Terra Nova: Strike Force Centaury (1996). What you can say about it?</b></p><p>We didn’t have the clean rights to use the engine, it was tied up for the following two years in the ongoing legal dispute with GT. That didn’t affect either The War in Heaven or Traveller because we already had specific permission from GT to produce those games with that engine. I tried very hard to get GT to cancel both RMRev and The War in Heaven (since they were trying to defund the former anyway and the latter was dead on arrival due to changes at Walmart), and let us use the technology to do a WWII 3D shooter, but they said no one would be interested in that sort of game. That was futile, in retrospect, but I had no idea they were in so much financial trouble at the time. Of course, it was their inability to see opportunities like doing a WWII 3D shooter years before CoD or Medal of Honor that contributed to their failure.</p><p><b>Can you tell us something about another your cancelled game project called “RPG Traveller“? What the engine was planned to use in this game? What the story used for game?</b></p><p>That would have been a legendary game. Julian LeFay of Daggerfall fame was a friend of ours, and he left Bethesda to come work with us on Traveller for a Sega of America launch title. We were using the Revolution engine adapted for the Katana (later renamed the Dreamcast), and we had an excellent story that Marc Miller and I were putting together. It was a very open RPG in the Bethesda model, a sort of Privateer set in the Traveller universe crossed with a giant Zhodani conspiracy to blow up a star prior to launching another invasion of the Imperium.</p><p>Unfortunately, Sega of Japan abruptly decided that it couldn’t trust American developers and shut down Sega of America as well as every American-developed title. They were both secretive and stupid; the former Sega of America CEO Tom Kalinske talked about it here. Needless to say, we weren’t surprised when the Dreamcast failed.</p><p><b>In files of RMRev demo I found an example of Vietnamese-like level, M-16 weapon model and unfinished US soldier 3D model. Did you prepare some reserve variants of planned on REV Engine games about Vietnam war or other? It would be very good to publish such game before NAM in 1998.</b></p><p>After we failed to convince GT to let us do a WWII game, we thought we might be able to convince them to do 3D Vietnam since we knew about the 2.5D NAM. So, we put together a quick level with an M-16 to show them. They shot that down too, of course, due to their financial troubles. Remember, at the time, we had no idea why they were suddenly refusing to continue with projects that they had been publicly bragging about only weeks before.</p><p><b>How do you feel about fan-made translations and Win-ports for good old games?</b></p><p>Love them. Very happy to support them in any way I can. If anyone enjoys bringing our old code to life or making use of our old art and music, I love to see it and will freely grant permission for it upon request.</p><p><b>Have you any plans for remakes of your old game projects? Do you plan now some new game projects?</b></p><p>We are in the process of doing some very interesting and significant stuff in the 3D miniature and combat management spaces. It will be as ground-breaking in its own way as RMR and RMRev were. It’s called First Sword and I’m applying many of the lessons I’ve learned over the last 20 years in designing it. I hope old fans of Fenris Wolf will consider backing the First Sword Kickstarter that Alpenwolf will be doing in the April-May timeframe. We’ve got a great team of very smart new guys combined with very experienced older guys. Those who are interested in it can sign up for our Game Development newsletter here.</p><p><b>What you can say about wide popularization and free distribution of legacy games published in 90s years?</b></p><p>I’m all for it. I’m glad to see Kickstarter making so many great retro projects like Star Citizen and Shroud of the Avatar possible. Of course, the fact that they’re not called Wing Commander and Ultima shows that the publishers are still a problem and a major pain in the posterior of the developers.<br><b><br/></b><b>Do you play in modern games? And how you can estimate the quality of many modern computer game hits with a super overdone 3D-graphics? Have we any chances to look “new old games” with breathtaking gameplay, at all?</b></br></p><p>Yes, I play a fairly wide variety of them, although I don’t play as deeply into them as I once did. I’m very disappointed with what most modern games have done with all of this incredible processing power at their disposal. While they’re pretty, many of the current games are somewhat dumbed-down from previous games; for all the bells and whistles they’ve got, the core shooter gameplay hasn’t improved much from Team Fortress.</p><p>I think considerably more development effort should be placed on AI rather than graphics; I’ve been beating that drum for over a decade now. Multiplayer has proven to be somewhat of a letdown, and since we can’t make the players any smarter, more cooperative, or more interesting, we desperately need to give designers a way around their intrinsic limitations.</p></div>",
  "content_text": "You may be familiar with long-time blogger, game designer, science fiction writer, and gamergate supporter Vox Day. He recently did an interview in Russian with Werta Best at old-games.ru where he shares insider information on how he has been designing games for over two decades. Currently he is lead designer for Alpenwolf. Below is the interview in English.\n—\nWhen and how you started your activity in the development of computer games?\nMy interest in game development began in 1989 when two friends and I formed “Screaming Tortellini Software” with the idea of making games. We never did anything substantive, but one of them co-founded Fenris Wolf with me in 1993. My first serious professional activity was coming up with the concept for a 16-bit, 44 Khz, 16-channel sound card in the spring of 1989. An engineer at my father’s company built a prototype for me and we had it working perfectly, but I could never convince anyone at the company to take it seriously, including my father. This was two years before Media Vision released its Pro Audio Spectrum, an 8-bit, 2-channel card that was a massive success. I should have dropped out of college and started selling it; that is one of my bigger regrets.\nWhy did you decide to call your team “Fenris Wolf” after a hero of Scandinavian epics?\nI grew up in Minnesota. My partner Andrew was Scandinavian and we were both steeped in Scandinavian mythology. It was a fairly natural choice for us.\nWhat was the main idea in Rebel Moon book which you wrote in collaboration with Bruce Bethke? The “Rebel Moon” – it was the “Book based on PC game” or vise versa :)?\nThe game design preceded the book. In fact, it was the game tie-in that first interested Scott Shannon of Pocket Books, since we met at CGDC. I brought Bruce in because it was my first attempt at writing anything and I figured I’d better have a co-author who knew what he was doing. I learned a tremendous amount from him. He’s a great writer and one of the very few genuinely funny writers out there. Scott was the first publisher to be aware of the importance of game tie-ins; he published the Doom books, Rebel Moon, and he even arranged it with Blizzard for me to write the Starcraft novels. However, I subsequently, and rather stupidly, declined to write them, since they just wanted generic cackling villain stuff and I wasn’t interested in that.\nDid you have some feelings in those years (1995) that using of Creative Labs 3D Blaster hardware maybe a cause of low popularity for Rebel Moon game (RM).\nWe knew from the start that we would never sell a single copy of it at retail because the game was tied to the Creative hardware. That didn’t bother us. It gave us the foot in the industry door we were seeking.\nWho was the first member in your team who proposed the revolutionary idea to use the beautiful color lighting in the developed RM game engine? Attention please, it was before Unreal release! Did your team perform an overview of the graphics capabilities for other first person shooters published before RM?\nThat was my partner Andrew’s idea. We knew Marc Rein and the guys at Unreal very well, in fact, our audio guy and housemate is now their audio director. Because we came from a high-resolution graphics background, we always looked to push the envelope in one way or another. Expanding the color depth was something we wanted to do as soon as the hardware could handle it. The problem was that you were still limited to 256-color palettes in the textures due to memory limitations.\nWhy didn’t you release the updated version of Rebel Moon on the Windows platform after you upgraded the graphics engine for Rebel Moon Rising (RMR)? This was quite possible, whereas for both games formats in level maps were almost 99{105b5945f2a7891a3dd860d3a09046b26c32f8a07d097b566642738deee8841e} fully compatible!\nThe thought never even occurred to us. We were never in the habit of looking back at what we’d already done. All we were concerned about is how we could most effectively make use of the new and better hardware that was coming out.\nWe couldn’t found in the Internet any CD-covers of the Rebel Moon game. Apparently, this game came out only in the collection from Creative Labs disc, and the separate disk of the Rebel Moon game never was published?\nThat’s correct. It was only available in a CD envelope included in the 3D Blaster box. The sleeve cover was a painting of a rebel LDF solder sitting down, holding a pistol and staring up at the Earth.\nUnlike the previous game, the Rebel Moon Rising was created without of any book basis. Who was the first who proposed the idea of continuation for Rebel Moon game series called Rebel Moon Rising?\nI think it was our lead artist, Brett Hawkins, who came up with the title. We’d always intended to continue with the lunar rebellion narrative. If you’ve read the novel, then you know that everything from the continuation of the war to the jump to alien D-space was planned. Old school fans will probably be interested to know that my Quantum Mortis series is the Rebel Moon narrative expanded into the very far future.\nWhat’s in your opinion was the reason for poor commercial success of Rebel Moon Rising – is it because of previous game has low popularity (Rebel Moon, 1995) or due to low resolution of sprites used in both games?\nOne word. QUAKE. Rebel Moon Rising got pretty good reviews and was well-regarded by other designers, but once people had a taste of 3D, they didn’t want to go back to 2.5D. It’s not like that surprised us. After all, I was the one who originally trademarked “3D Blaster” years before and I’d spent a lot of time out in the Bay Area as a Transdimensional Evangelist trying to convince Creative, Hercules, and Diamond, among others, to adopt 3D acceleration long before Jensen Huang got Nvidea going. We knew 3D was going to be big for the shooter market, but we didn’t have time to write a 3D engine on Intel’s schedule. And more importantly, we discovered that the graphics bus was too slow to let the MMX properly support 3D at the higher resolutions we originally intended to support.\nThe original MMX was actually four times faster than it was able to deliver, but the limitation was the bus, not the chip’s performance. We were the ones who discovered the problem; Intel was absolutely horrified when we proved it to them by blitting a 2-bit black rectangle. Commercial success was always an afterthought, as our Intel relationship guided most of our decisions and generated most of our revenue.\nWe were very pleased with effects for varying of gravity on some level’s maps – it was one of the most original gameplay ideas in both Rebel Moon games. Has anyone used same method for walkthrough of levels in other games published in 90s? Who was the author of idea in your team?\nI don’t know. I asked Andrew and he doesn’t recall either. Our culture at Fenris Wolf was always one of pushing things further. We created the first escort mission in a shooter, we were the first to support MMX, the first to implement speech recognition in a multiplayer game (you could switch weapons and send predetermined messages using your voice), and we also introduced a number of smaller innovations like in-level variable gravity. Given that the game was set in space, the idea of blowing up a gravity generator and then having it affect the gameplay would have seemed pretty obvious to all of us at the time.\nThe net game levels walkthrough in RMR is more interesting than single player maps. It seems that RMR game originally was planned as a coop game only and single player levels are just the secondary product from net levels. Is it right?\nNo, it’s precisely backward. The problem with single player was that Intel’s testers simply weren’t gamers. We created the first two levels, which are borderline retarded and come complete with arrows on the floor pointing GO THIS WAY, rather late in the process because the testers couldn’t manage to complete levels that any competent gamer could play through in minutes. So we had to dumb everything down. We didn’t even do the multiplayer stuff until the retail release with GT, but because Intel wasn’t involved with those, we could design them for proper gamers. That’s probably why they are more interesting.\nIn our opinion, for Rebel Moon Rising game very effective way was used to a sharp change of the game environment – teleportation to another planet (in alien world). And it was made one year before popular Half-Life! (teleport to Xen…). This significant jump was originally planned in the RMR game scenario as well as concept art?\nIn light of the fact that we were using an expanded color depth for the first time, my decision to set the storyline in space, on the Moon, was a very, very bad one. I thought it would be visually impressive to have these rich jeweled tones of the lasers and lights contrasted against the grays of the environment, but the effect was just too subtle. And our artists, while smart and talented, were all very young and hired straight out of art school with no computer or 3D experience. We should have done something more wild and garish like Unreal.\nThe decision to shift the focus to the alien environments allowed us to bring in more color and interesting visuals than was permitted by an environment mostly filled with black space and Moon rocks. The jump was definitely planned in the design document and it was always part of the story, but we did end up putting more of the levels in the alien environments than originally planned due to the desire to incorporate more interesting graphical elements.\nThe RMR game has one interesting level – mission with task to liquidation of woman. She was commander(!) of Earth special(!) forces(!). Do you afraid of strong hate from feminist organizations now about such mission goals :)?\nNo. Couldn’t care less. We weren’t making a political point. It wasn’t our only assassination mission anyhow, I think there was one in the original RM as well.\nWhat the creatures were as prototypes for two alien races in RMR: Estrons and Shoggrans?\nThe alien races were original creations. The Shog’grans were industrial and took advantage of the less advanced Estrons by turning them into slaves that were horrifically mutilated imitations of the Shog’gran Interregnum, the poor Subestrons. We didn’t base the races on anything in particular, we just wanted some reason that the LDF fighters would find sympathy with the very monsters they fought and killed at the end of Rebel Moon. So Shog’grans and Estrons were primarily created to meet the demands of the narrative.\nWhen you began to plan one more continuation for RM series? Was the Rebel Moon Revolution (RMRev) originally planned with absolutely another gameplay format (command tactical shooter)?\nYes. I was playing a lot of Advanced Squad Leader at the time, so the idea of having a 2D strategy game connected to the 3D tactical game was very attractive to me. However, we made a fatal mistake in deciding to rely upon two levels of artificial intelligence and giving both friendly and enemy squads near-complete autonomy within the mission parameters rather than going with a heavily scripted approach.\nThere were three ways to solve the problem, we took one with Revolution, Half-Life took another, and later, Combat Mission took a third. Obviously, Valve’s solution was the best. But even today, no one has AI as good as RMRev had, because it is very hard to do well and even companies like Kynogon were much more focused on the purely tactical aspects. In addition to designing the Strat and Tac AIs, we brought in the guy who did the AI for Enemy Nations, which at the time was considered state of the art. But we definitely bit off more than we could reasonably chew with a team that size.\nWhy did you decided not to use sprites in Rebel Moon Revolution game? After all, the well known publisher GT Interactive has released two 3D shooters in the 1998: NAM and WWIIGI, with more poor quality of sprites and sounds than were used in RMR. Why you decided to create a new game entirely in 3D-graphics?\nWe would have done the original RM in 3D if we could have. We always wanted to do 3D and write our own engine. GT Interactive even offered us the use of the Unreal engine for RMRev; we probably should have just accepted it and figured out how to add some decent AI to it rather than insisting on writing our own Revolution engine. The root problem was that we never had enough programmers to achieve our vision, we never had more than four and two of them were entirely devoted to AI.\nIf your team members began to create from scratch 3D-graphics engine and AI engine for Rebel Moon Revolution game, did they fully understand all complexities of this path? How hard it was for you and for your friends on this way?\nWhat we didn’t understand was that you can really only do one major new thing and two minor new things at a time. We were trying to simultaneously break new ground, at least for us, in four major new ways. We were writing our own non-Euclidean 3D engine, we were developing two tiers of advanced AI, we were developing a launch title for an new console, and we were trying to wed a 2D strategy game to a 3D tactical game. It was completely insane in retrospect. We were too young, and we’d had too much early success, to grasp our limitations.\nThe crazy thing is that we still would have pulled the larger part of it off if it hadn’t been for both Sega and GT going down in flames at around the same time. We had an incredibly smart and talented team at Fenris, we found jobs for every single employee within weeks after we decided to shut down. Most of them are still in the industry, or eventually left it on their own terms.\nTo be honest, though, since both Eric and John, the two AI programmers, were diagnosed with cancer and subsequently died not very long after that, it was hard for any of us to feel too sorry for ourselves. We may have missed out on becoming something akin to Epic, but there are worse fates.\nWithout going into details of legal trials, please say, what was the main reason of the publishing abolition of this in all aspects revolutionary (Rebel Moon Revolution) game? Maybe it was the usual competition of the game developers?\nGT Interactive was running out of money and as far as I can tell, they cut every game that wasn’t scheduled for completion within the next six months. The problem is that they didn’t actually cancel the game, which would have permitted us to take it elsewhere, they simply refused to pay an already-approved milestone. They ended up having to write us a much larger check two years later, but by then the damage was done. We couldn’t take the game, or even the engine, to another publisher with that hanging over our heads. When Sega of Japan shut down Sega of America around the same time, the one-two punch was simply more than one small company could take.\nAnd now one of important questions for me about canceling of Rebel Moon Revolution. In 1999 before publishing “The War in Heaven” game your team has an almost completed engine (REV Engine v.0.9). Why did you not to compile a simple 3D-shooter with 3D models, levels from RMRev project, simplified AI and without any voice control? It would be a little bit another Rebel Moon Revolution than originally planned. For example, it would be like a Terra Nova: Strike Force Centaury (1996). What you can say about it?\nWe didn’t have the clean rights to use the engine, it was tied up for the following two years in the ongoing legal dispute with GT. That didn’t affect either The War in Heaven or Traveller because we already had specific permission from GT to produce those games with that engine. I tried very hard to get GT to cancel both RMRev and The War in Heaven (since they were trying to defund the former anyway and the latter was dead on arrival due to changes at Walmart), and let us use the technology to do a WWII 3D shooter, but they said no one would be interested in that sort of game. That was futile, in retrospect, but I had no idea they were in so much financial trouble at the time. Of course, it was their inability to see opportunities like doing a WWII 3D shooter years before CoD or Medal of Honor that contributed to their failure.\nCan you tell us something about another your cancelled game project called “RPG Traveller“? What the engine was planned to use in this game? What the story used for game?\nThat would have been a legendary game. Julian LeFay of Daggerfall fame was a friend of ours, and he left Bethesda to come work with us on Traveller for a Sega of America launch title. We were using the Revolution engine adapted for the Katana (later renamed the Dreamcast), and we had an excellent story that Marc Miller and I were putting together. It was a very open RPG in the Bethesda model, a sort of Privateer set in the Traveller universe crossed with a giant Zhodani conspiracy to blow up a star prior to launching another invasion of the Imperium.\nUnfortunately, Sega of Japan abruptly decided that it couldn’t trust American developers and shut down Sega of America as well as every American-developed title. They were both secretive and stupid; the former Sega of America CEO Tom Kalinske talked about it here. Needless to say, we weren’t surprised when the Dreamcast failed.\nIn files of RMRev demo I found an example of Vietnamese-like level, M-16 weapon model and unfinished US soldier 3D model. Did you prepare some reserve variants of planned on REV Engine games about Vietnam war or other? It would be very good to publish such game before NAM in 1998.\nAfter we failed to convince GT to let us do a WWII game, we thought we might be able to convince them to do 3D Vietnam since we knew about the 2.5D NAM. So, we put together a quick level with an M-16 to show them. They shot that down too, of course, due to their financial troubles. Remember, at the time, we had no idea why they were suddenly refusing to continue with projects that they had been publicly bragging about only weeks before.\nHow do you feel about fan-made translations and Win-ports for good old games?\nLove them. Very happy to support them in any way I can. If anyone enjoys bringing our old code to life or making use of our old art and music, I love to see it and will freely grant permission for it upon request.\nHave you any plans for remakes of your old game projects? Do you plan now some new game projects?\nWe are in the process of doing some very interesting and significant stuff in the 3D miniature and combat management spaces. It will be as ground-breaking in its own way as RMR and RMRev were. It’s called First Sword and I’m applying many of the lessons I’ve learned over the last 20 years in designing it. I hope old fans of Fenris Wolf will consider backing the First Sword Kickstarter that Alpenwolf will be doing in the April-May timeframe. We’ve got a great team of very smart new guys combined with very experienced older guys. Those who are interested in it can sign up for our Game Development newsletter here.\nWhat you can say about wide popularization and free distribution of legacy games published in 90s years?\nI’m all for it. I’m glad to see Kickstarter making so many great retro projects like Star Citizen and Shroud of the Avatar possible. Of course, the fact that they’re not called Wing Commander and Ultima shows that the publishers are still a problem and a major pain in the posterior of the developers.\nDo you play in modern games? And how you can estimate the quality of many modern computer game hits with a super overdone 3D-graphics? Have we any chances to look “new old games” with breathtaking gameplay, at all?\nYes, I play a fairly wide variety of them, although I don’t play as deeply into them as I once did. I’m very disappointed with what most modern games have done with all of this incredible processing power at their disposal. While they’re pretty, many of the current games are somewhat dumbed-down from previous games; for all the bells and whistles they’ve got, the core shooter gameplay hasn’t improved much from Team Fortress.\nI think considerably more development effort should be placed on AI rather than graphics; I’ve been beating that drum for over a decade now. Multiplayer has proven to be somewhat of a letdown, and since we can’t make the players any smarter, more cooperative, or more interesting, we desperately need to give designers a way around their intrinsic limitations.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-01T15:55:49+00:00"
}