{
  "url": "https://voxday.net/2020/06/02/intimidating-intelligence/",
  "scraped_at": "2025-12-21T12:56:28.217576",
  "title": "Intimidating intelligence",
  "date_display": "June 2, 2020",
  "date_iso": "2020-06-02T14:52:15+00:00",
  "date_from_url": "2020-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, the new episode of Hypergamouse, <a href=\"http://www.webtoons.com/en/challenge/hypergamouse/intimidating-intelligence/viewer?title_no=423082&amp;episode_no=6\">INTIMIDATING INTELLIGENCE</a>, is now live on Webtoons.</p><p>Second, the second book in the Castalia Library subscription, THE MEDITATIONS OF MARCUS AURELIUS ANTONINUS is now being bound. The first shipments should begin next week. This leads us to the following question:</p><p>We’re now ready to start thinking about producing a non-subscription Castalia Library book every other month. What sort of books would you like to see us produce? These would be limited edition one-offs that would not require a subscription, just a 90-day preorder. These one-offs could include previously published books rebound in leather; for example, there are 200 copies of Umberto Eco’s <i>Numero Zero</i> that we could acquire and rebind if there are enough Eco fans interested in having an Easton Press-style collector’s edition.</p><p>The Library and Libraria subscriptions will continue as planned in any event. And our first priority, obviously, is finishing the Junior Classics and getting them out to the backers. But it’s time for us to start discussing what we are going to do after that.</p><p><b>UPDATE: </b>Let me be more specific. Exactly what titles would be of interest to those who would like to purchase one-offs? And are you only interested in books with interiors that we layout and print ourselves or are leather rebindings of the sort that Easton Press does of interest as well?</p><p><b>UPDATE:</b> If you’re not interested in buying leather-bound books, then I’m obviously not interested in your opinion. This discussion is not for you.</p></div>",
  "content_text": "First, the new episode of Hypergamouse,\nINTIMIDATING INTELLIGENCE\n, is now live on Webtoons.\nSecond, the second book in the Castalia Library subscription, THE MEDITATIONS OF MARCUS AURELIUS ANTONINUS is now being bound. The first shipments should begin next week. This leads us to the following question:\nWe’re now ready to start thinking about producing a non-subscription Castalia Library book every other month. What sort of books would you like to see us produce? These would be limited edition one-offs that would not require a subscription, just a 90-day preorder. These one-offs could include previously published books rebound in leather; for example, there are 200 copies of Umberto Eco’s\nNumero Zero\nthat we could acquire and rebind if there are enough Eco fans interested in having an Easton Press-style collector’s edition.\nThe Library and Libraria subscriptions will continue as planned in any event. And our first priority, obviously, is finishing the Junior Classics and getting them out to the backers. But it’s time for us to start discussing what we are going to do after that.\nUPDATE:\nLet me be more specific. Exactly what titles would be of interest to those who would like to purchase one-offs? And are you only interested in books with interiors that we layout and print ourselves or are leather rebindings of the sort that Easton Press does of interest as well?\nUPDATE:\nIf you’re not interested in buying leather-bound books, then I’m obviously not interested in your opinion. This discussion is not for you.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-02T13:52:15+00:00"
}