{
  "url": "https://voxday.net/2020/06/09/mailvox-waking-up-to-churchianity/",
  "scraped_at": "2025-12-21T12:57:19.478468",
  "title": "Mailvox: waking up to Churchianity",
  "date_display": "June 9, 2020",
  "date_iso": "2020-06-09T12:47:04+00:00",
  "date_from_url": "2020-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new reader discovers that Churchianity is not Christianity:</p><blockquote><p>I’ve been a reader of yours for maybe a year now, or a little more,whereas my wife has been a long time reader, so I’m fairly new to this. I would like to briefly share a bit of info with you that you may find interesting, I’ll try to keep it short.</p><p>I was browsing my local news today just to see what stories they’re spinning with the protests of late and I found a picture of our previous pastors protesting in our town for George Floyd, and they’re not exactly hiding.</p><p>After getting out of a bad church I spent years in, me and my wife attended the church, Life Church, for around a year and a half and stopped attending over a year ago. The virtue signaling kicked up, the pastor started cherry picking scriptures for his shallow sermons, and we got tired of being pressured to give and tithe..which his wife railed on every single service. For the sake of brevity, that’s about the jist of it all.</p><p>Not just this event, but my wife and I have seen many of our “christian” friends and acquaintances reveal themselves as churchians as of late. They’d rather virtue signal and would sooner shelter a foreigner from Somalia then care after their own. Yes, we experienced this first hand. They do not serve the good, the true and the beautiful, but themselves.</p><p>Anyone who continues to support this church is either ignorant of the evil of this, or willfully conceding to this wickedness.</p></blockquote><p>A converged church is a wicked church that invents and condemns “sins” that are not sins while condoning actual sin. Racism is not, and has never been, <i>and can never be</i>, a sin, unless God Himself can sin. To claim otherwise is pure inversion. And only the wicked deem the separation of sheep and goats, of wheat and chaff, of truth and lies, to be evil.</p><p>If your pastor or preacher or priest is preaching this Churchian wickedness, call him out. And if the congregation will not cast him out, then it is time to leave.</p><p>The Bible warns that many who profess themselves to be Christians will be deceived. Now, do you truly not see the grand deception at work here? And ask yourself this: does the world hate or does it celebrate these brave anti-racist Churchians?</p></div>",
  "content_text": "A new reader discovers that Churchianity is not Christianity:\nI’ve been a reader of yours for maybe a year now, or a little more,whereas my wife has been a long time reader, so I’m fairly new to this. I would like to briefly share a bit of info with you that you may find interesting, I’ll try to keep it short.\nI was browsing my local news today just to see what stories they’re spinning with the protests of late and I found a picture of our previous pastors protesting in our town for George Floyd, and they’re not exactly hiding.\nAfter getting out of a bad church I spent years in, me and my wife attended the church, Life Church, for around a year and a half and stopped attending over a year ago. The virtue signaling kicked up, the pastor started cherry picking scriptures for his shallow sermons, and we got tired of being pressured to give and tithe..which his wife railed on every single service. For the sake of brevity, that’s about the jist of it all.\nNot just this event, but my wife and I have seen many of our “christian” friends and acquaintances reveal themselves as churchians as of late. They’d rather virtue signal and would sooner shelter a foreigner from Somalia then care after their own. Yes, we experienced this first hand. They do not serve the good, the true and the beautiful, but themselves.\nAnyone who continues to support this church is either ignorant of the evil of this, or willfully conceding to this wickedness.\nA converged church is a wicked church that invents and condemns “sins” that are not sins while condoning actual sin. Racism is not, and has never been,\nand can never be\n, a sin, unless God Himself can sin. To claim otherwise is pure inversion. And only the wicked deem the separation of sheep and goats, of wheat and chaff, of truth and lies, to be evil.\nIf your pastor or preacher or priest is preaching this Churchian wickedness, call him out. And if the congregation will not cast him out, then it is time to leave.\nThe Bible warns that many who profess themselves to be Christians will be deceived. Now, do you truly not see the grand deception at work here? And ask yourself this: does the world hate or does it celebrate these brave anti-racist Churchians?",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-09T11:47:04+00:00"
}