{
  "url": "https://voxday.net/2020/06/04/mailvox-the-usaf-converged/",
  "scraped_at": "2025-12-21T12:56:42.759338",
  "title": "Mailvox: the USAF, converged",
  "date_display": "June 4, 2020",
  "date_iso": "2020-06-04T17:53:32+00:00",
  "date_from_url": "2020-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A soon-to-be ex-Airman shares his observations concerning the convergence of the USAF:</p><blockquote><p>I listened to the audiobook of <i>Corporate Cancer </i>a couple of months ago, and at that time I categorized my own workplace, the USAF as Level 4, highly converged. But recent events have caused me to reevaluate, and I am convinced that the USAF has achieved Level 5 and has become fully converged. Attached is a copy of a recent post on Facebook by the highest ranking enlisted member in the force, the Chief Master Sergeant of the Air Force, Kaleth O. Wright. This post played a big role in my need to reevaluate. Here are the highlights:</p><p><i>“Who am I? I am a Black man who happens to be the Chief Master Sergeant of the Air Force. I am George Floyd…I am Philando Castile, I am Michael Brown, I am Alton Sterling, I am Tamir Rice.”</i><br><i><br/></i><i>“This, my friends, is my greatest fear, not that I will be killed by a white police officer (believe me my heart starts racing like most other Black men in America when I see those blue lights behind me)…but that I will wake up to a report that one of our Black Airmen has died at the hands of a white police officer.”</i><br><i><br/></i><i>“So, I spent the last week, “plotting, planning, strategizing, organizing and mobilizing” just as Killer Mike, the popular Atlanta rapper and activist encouraged us to do.”</i><br><i><br/></i><i>“I believe that we have not made much progress in this area of racial injustice and diversity among our ranks. This is why I’m working with General Goldfein, first and foremost to have a full and thorough independent review of our military justice system…We are also working to improve the diversity of our force, especially within the senior ranks.”</i><br><i><br/></i><i>“You might think you know what it’s like to grow up, exist, survive and even thrive in this country as a Black person…but let me tell you, regardless of how many Black friends you have, or how Black your neighborhood was, or if your spouse or in-laws are Black…you don’t know. You don’t know the anxiety, the despair, the heartache, the fear, the rage and the disappointment that comes with living in this country, OUR country every single day.”</i></br></br></br></br></p><p>The evidence of the full convergence is everywhere. When deployed, there is a TV service that we are provided which is not nearly as cool as UATV. It is called the Armed Forces Network and it is so packed with anti-American propaganda that sometimes I can’t help but laugh. There are constant commercials proclaiming “Diversity is Our Strength.” As well as those touting American citizenship for those who serve. So we are openly training and running logistics for our own invaders. We get constant diversity centered e-mails, and my home base acknowledges cultural appreciation months throughout the year. Even Pacific Islander month!</p><p>That same base also has a giant recruiting billboard which can be seen from the highway. On it is the picture of a woman security forces member holding a gun. And in big letters it reads “I swear to defend…” It seriously has the … and just leaves it at that. I’ve never seen a better piece of grabbler propaganda in my life.</p><p>I am deployed to one of the grabbler wars right now, but I should be returning to the states before long. I am a young Airman without much rank and the USAF has proven through it’s convergence that it is not the place to go for those who wish to defend America. For that reason, I’m out.</p></blockquote><p>This convergence is why I am predicting that the US military is going to shock the world by unexpectedly losing an important battle one of these days. The Chinese and Russians already know that the US empire is fading, even if those who rule it from the Potomac haven’t realized it yet.</p></div>",
  "content_text": "A soon-to-be ex-Airman shares his observations concerning the convergence of the USAF:\nI listened to the audiobook of\nCorporate Cancer\na couple of months ago, and at that time I categorized my own workplace, the USAF as Level 4, highly converged. But recent events have caused me to reevaluate, and I am convinced that the USAF has achieved Level 5 and has become fully converged. Attached is a copy of a recent post on Facebook by the highest ranking enlisted member in the force, the Chief Master Sergeant of the Air Force, Kaleth O. Wright. This post played a big role in my need to reevaluate. Here are the highlights:\n“Who am I? I am a Black man who happens to be the Chief Master Sergeant of the Air Force. I am George Floyd…I am Philando Castile, I am Michael Brown, I am Alton Sterling, I am Tamir Rice.”\n“This, my friends, is my greatest fear, not that I will be killed by a white police officer (believe me my heart starts racing like most other Black men in America when I see those blue lights behind me)…but that I will wake up to a report that one of our Black Airmen has died at the hands of a white police officer.”\n“So, I spent the last week, “plotting, planning, strategizing, organizing and mobilizing” just as Killer Mike, the popular Atlanta rapper and activist encouraged us to do.”\n“I believe that we have not made much progress in this area of racial injustice and diversity among our ranks. This is why I’m working with General Goldfein, first and foremost to have a full and thorough independent review of our military justice system…We are also working to improve the diversity of our force, especially within the senior ranks.”\n“You might think you know what it’s like to grow up, exist, survive and even thrive in this country as a Black person…but let me tell you, regardless of how many Black friends you have, or how Black your neighborhood was, or if your spouse or in-laws are Black…you don’t know. You don’t know the anxiety, the despair, the heartache, the fear, the rage and the disappointment that comes with living in this country, OUR country every single day.”\nThe evidence of the full convergence is everywhere. When deployed, there is a TV service that we are provided which is not nearly as cool as UATV. It is called the Armed Forces Network and it is so packed with anti-American propaganda that sometimes I can’t help but laugh. There are constant commercials proclaiming “Diversity is Our Strength.” As well as those touting American citizenship for those who serve. So we are openly training and running logistics for our own invaders. We get constant diversity centered e-mails, and my home base acknowledges cultural appreciation months throughout the year. Even Pacific Islander month!\nThat same base also has a giant recruiting billboard which can be seen from the highway. On it is the picture of a woman security forces member holding a gun. And in big letters it reads “I swear to defend…” It seriously has the … and just leaves it at that. I’ve never seen a better piece of grabbler propaganda in my life.\nI am deployed to one of the grabbler wars right now, but I should be returning to the states before long. I am a young Airman without much rank and the USAF has proven through it’s convergence that it is not the place to go for those who wish to defend America. For that reason, I’m out.\nThis convergence is why I am predicting that the US military is going to shock the world by unexpectedly losing an important battle one of these days. The Chinese and Russians already know that the US empire is fading, even if those who rule it from the Potomac haven’t realized it yet.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-04T16:53:32+00:00"
}