{
  "url": "https://voxday.net/2020/06/06/patreon-plays-dirty/",
  "scraped_at": "2025-12-21T12:56:59.265132",
  "title": "Patreon plays dirty",
  "date_display": "June 6, 2020",
  "date_iso": "2020-06-06T14:29:01+00:00",
  "date_from_url": "2020-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned previously, Patreon has taken the highly unusual tactic of attempting to sue its customers for doing exactly what they are required to do in the terms of use, and in the process, it has publicly admitted to its deceptive practices in the legal filing.</p><p>We’re clearly not dealing with the legal equivalent of rocket scientists here.</p><p>In brief, Patreon required users to first talk to them, and then go to arbitration if the matter could not be resolved by the discussion.</p><p><i>We encourage you to contact us if you have an issue. If a dispute does arise out of these terms or related to your use of Patreon, and it cannot be resolved after you talk with us, then it must be resolved by arbitration. </i></p><p>Patreon created the dispute by deplatforming Owen and intentionally interfering in the relationship between him and his supporters. So, Owen and the Bears talked to Patreon about the dispute as required by the terms of use. Their response was to shriek that they were being extorted… in at least one case by someone who had never had <u>any</u> contact with them. Since the issue could not be resolved, Patreon was informed that Owen and the Bears would be going to arbitration. But before the arbitrations were filed, Patreon surreptitiously altered its terms of use to bar one specific thing: one of the issues that it had been informed would be involved in the arbitration claim, namely, its tortious interference in the separate economic contract between Owen and his supporters. On December 19, 2019, Patreon slipped this little change into its terms of use without notifying anyone.</p><p><i>This clause does not limit either party’s ability to file an action in a court with jurisdiction to seek injunctive or other equitable relief for disputes relating to intellectual property, proprietary data or to enforce this dispute resolution clause, <b>including your agreement not to assert claims related to the suspension or termination of another person’s account.</b> In any such action, the court rather than an arbitrator must decide whether such a claim is arbitrable and must decide whether the party is entitled to the requested injunctive or other equitable relief.</i></p><p>Now, this is clearly a Deceptive Practice under 1770, which bars the insertion of an unconscionable clause into a contract. No contract can require your agreement to accept tortious interference or any other violation of your civil rights. That wasn’t the only Deceptive Practice committed in Patreon’s alteration of its terms of use, but that is the only one relevant here, so we won’t go any deeper into that subject for the time being. Furthermore, both the arbitration company and various arbitrators have already, and <u>repeatedly</u>, ruled that the claims are arbitrable.</p><p>On January 3rd, the Bears filed for arbitration, separately, as required by the terms of use. So what Patreon is now asserting is that because those users filed demands for arbitration, they did so in violation of the revised terms that were deceptively changed 12 days earlier in direct response to their initial contractually-required notice… even though Patreon didn’t notify them of the change. If that sounds exceptionally stupid to you, that’s because it is. Patreon’s legal situation is actually even more precarious than I’ve described it here, because the whole point of requiring individual arbitrations in the first place is to avoid class-action lawsuits, but Patreon has just filed a lawsuit against a class, <i>both aspects of which are specifically barred by the contract</i>. In other words, in this very lawsuit, Patreon has actually done what they falsely accuse these Bears of having done.</p><p>Since a lawsuit is a matter of public record whereas an arbitration is not, the Owen-haters on Reddit have just published all the names of the Bears being sued by Patreon. Needless to say, the Legion is on it and we will be legally retaliating very strongly in order to see that Patreon and their lawyers are severely punished for this despicable and unexpected tactic. But the doxxing has already taken place, so if any of you experiences any blowback from this, please be sure to document everything and let us know right away so that the Legion can include everything in their future filings concerning this element of the matter.</p><p>If you’re one of the Bears concerned, please don’t worry about anything. It’s going to be fine. The Legion – and more – are on it, and everyone will have your back, just as you have had Owen’s. This is an absolutely desperate move by Patreon to try to further delay your arbitrations against them because they are losing very badly. And if you’re wondering how this joke of a lawsuit can be a matter of public record when you haven’t even been served, <i>exactly</i>. As you can see here, Patreon’s lawyers are not following any of the rules of either the legal or the arbitration processes, which is one of the reasons they are losing so consistently and comprehensively.</p><p>Anyhow, I’ll be doing a Darkstream today and will address questions about the matter from everyone. The key right now is to remain calm, remain together, and have faith that we will be completely victorious in the end. This is not our first rodeo. We will win. And while we didn’t anticipate this level of utter lunacy from Patreon, or their desperate refusal to accept the inevitable, the enemy always gets a vote.</p><p>So, it is increasingly looking like there either won’t be a Patreon by the end of the year or Owen and the Bears will own it. It’s rather like finding yourself fighting a duel with someone who genuinely believes his most effective attack is to disembowel himself.</p></div>",
  "content_text": "As I mentioned previously, Patreon has taken the highly unusual tactic of attempting to sue its customers for doing exactly what they are required to do in the terms of use, and in the process, it has publicly admitted to its deceptive practices in the legal filing.\nWe’re clearly not dealing with the legal equivalent of rocket scientists here.\nIn brief, Patreon required users to first talk to them, and then go to arbitration if the matter could not be resolved by the discussion.\nWe encourage you to contact us if you have an issue. If a dispute does arise out of these terms or related to your use of Patreon, and it cannot be resolved after you talk with us, then it must be resolved by arbitration.\nPatreon created the dispute by deplatforming Owen and intentionally interfering in the relationship between him and his supporters. So, Owen and the Bears talked to Patreon about the dispute as required by the terms of use. Their response was to shriek that they were being extorted… in at least one case by someone who had never had\nany\ncontact with them. Since the issue could not be resolved, Patreon was informed that Owen and the Bears would be going to arbitration. But before the arbitrations were filed, Patreon surreptitiously altered its terms of use to bar one specific thing: one of the issues that it had been informed would be involved in the arbitration claim, namely, its tortious interference in the separate economic contract between Owen and his supporters. On December 19, 2019, Patreon slipped this little change into its terms of use without notifying anyone.\nThis clause does not limit either party’s ability to file an action in a court with jurisdiction to seek injunctive or other equitable relief for disputes relating to intellectual property, proprietary data or to enforce this dispute resolution clause,\nincluding your agreement not to assert claims related to the suspension or termination of another person’s account.\nIn any such action, the court rather than an arbitrator must decide whether such a claim is arbitrable and must decide whether the party is entitled to the requested injunctive or other equitable relief.\nNow, this is clearly a Deceptive Practice under 1770, which bars the insertion of an unconscionable clause into a contract. No contract can require your agreement to accept tortious interference or any other violation of your civil rights. That wasn’t the only Deceptive Practice committed in Patreon’s alteration of its terms of use, but that is the only one relevant here, so we won’t go any deeper into that subject for the time being. Furthermore, both the arbitration company and various arbitrators have already, and\nrepeatedly\n, ruled that the claims are arbitrable.\nOn January 3rd, the Bears filed for arbitration, separately, as required by the terms of use. So what Patreon is now asserting is that because those users filed demands for arbitration, they did so in violation of the revised terms that were deceptively changed 12 days earlier in direct response to their initial contractually-required notice… even though Patreon didn’t notify them of the change. If that sounds exceptionally stupid to you, that’s because it is. Patreon’s legal situation is actually even more precarious than I’ve described it here, because the whole point of requiring individual arbitrations in the first place is to avoid class-action lawsuits, but Patreon has just filed a lawsuit against a class,\nboth aspects of which are specifically barred by the contract\n. In other words, in this very lawsuit, Patreon has actually done what they falsely accuse these Bears of having done.\nSince a lawsuit is a matter of public record whereas an arbitration is not, the Owen-haters on Reddit have just published all the names of the Bears being sued by Patreon. Needless to say, the Legion is on it and we will be legally retaliating very strongly in order to see that Patreon and their lawyers are severely punished for this despicable and unexpected tactic. But the doxxing has already taken place, so if any of you experiences any blowback from this, please be sure to document everything and let us know right away so that the Legion can include everything in their future filings concerning this element of the matter.\nIf you’re one of the Bears concerned, please don’t worry about anything. It’s going to be fine. The Legion – and more – are on it, and everyone will have your back, just as you have had Owen’s. This is an absolutely desperate move by Patreon to try to further delay your arbitrations against them because they are losing very badly. And if you’re wondering how this joke of a lawsuit can be a matter of public record when you haven’t even been served,\nexactly\n. As you can see here, Patreon’s lawyers are not following any of the rules of either the legal or the arbitration processes, which is one of the reasons they are losing so consistently and comprehensively.\nAnyhow, I’ll be doing a Darkstream today and will address questions about the matter from everyone. The key right now is to remain calm, remain together, and have faith that we will be completely victorious in the end. This is not our first rodeo. We will win. And while we didn’t anticipate this level of utter lunacy from Patreon, or their desperate refusal to accept the inevitable, the enemy always gets a vote.\nSo, it is increasingly looking like there either won’t be a Patreon by the end of the year or Owen and the Bears will own it. It’s rather like finding yourself fighting a duel with someone who genuinely believes his most effective attack is to disembowel himself.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-06T13:29:01+00:00"
}