{
  "url": "https://voxday.net/2020/06/15/the-people-of-color-revolution/",
  "scraped_at": "2025-12-21T12:58:00.104143",
  "title": "The People of Color Revolution",
  "date_display": "June 15, 2020",
  "date_iso": "2020-06-15T10:47:32+00:00",
  "date_from_url": "2020-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is becoming obvious to everyone who has witnessed the so-called Color Revolutions performed by the Deep State that the Black Lives Matter / Antifa “protests” are simply the same weapon <a href=\"https://www.unz.com/mwhitney/do-deep-state-elements-operate-within-the-protest-movement/\">now aimed at the American people</a> and the U.S. government:</p><blockquote><p>Why has the media failed to show the vast destruction of businesses and private property? Why have they minimized the effects of vandalism, looting and arson? Why have they fanned the flames of social unrest from the very beginning, shrugging off the ruin and devastation while cheerleading the demonstrations as a heroic struggle for racial justice? Is this is the same media that supported every bloody war, every foreign intervention, and every color-revolution for the last 5 decades? Are we really expected to believe that they’ve changed their stripes and become an energized proponent of social justice?</p><p>Nonsense. The media’s role in concealing the damage should only convince skeptics that the protests are just one part of a much larger operation. What we’re seeing play out in over 400 cities across the US, has more to do with toppling Trump and sowing racial division than it does with the killing of George Floyd. <b>The scale and coordination alone suggests that elements in the deep state are probably involved. We know from evidence uncovered during the Russiagate probe, that the media works hand-in-glove with the Intel agencies and FBI while–at the same time– serving as a mouthpiece for elites.</b> That hasn’t changed, in fact, it’s gotten even worse. The uniformity of the coverage suggests that that same perception management strategy is being employed here as well. Even at this late date, the determination to remove Trump from office is as strong as ever even though, in the present case, it has been combined with the broader political strategy of inciting fratricidal violence, obliterating urban areas, and spreading anarchy across the country. <b>This isn’t about racial justice or police brutality, it’s about regime change, internal destabilization, and martial law….</b></p><p>The United States has never experienced two weeks of sustained protests in hundreds of its cities at the same time. <b>It’s beyond suspicious, it points to extensive coordination with groups across the country, a comprehensive media strategy (that probably preceded the killing of George Floyd), a sizable presence on social media (to put people on the street), and agents provocateur whose task is to incite violence, loot and create mayhem.</b></p></blockquote><p>What this means is that martial law is coming to the USA, and probably sooner than you might imagine. Moreover, its institution will be absolutely justified by the level of treason involved. The events of the hot summer to come may turn out to be the ultimate Q proof, and also explain the God-Emperor’s uncharacteristic equanimity and relative taciturnity concerning the ongoing riots; he knew what was coming, he knows it is going to get worse, and he is waiting for the correct moment to strike at those who are behind it.</p><p>The average white American is rapidly getting to the point of seeing the actions of the Deep State provocateurs as treason. But he isn’t quite there yet. And I doubt the God-Emperor will launch The Storm until he is, because the actions that he absolutely has to take in order to deal with this attack on America will be very upsetting to the average Fox News viewer.</p><p>FDR had to wait for Pearl Harbor and a German declaration of war before he was able to declare war on Germany. The neocons had to wait until 9/11 to get their long-sought war with Iraq. Trump has to wait until the Deep State crosses a similar line before acting, which is precisely why the “protesters” and their allies in state and local government have been seeking to bait him into premature anti-revolutionary action.</p></div>",
  "content_text": "It is becoming obvious to everyone who has witnessed the so-called Color Revolutions performed by the Deep State that the Black Lives Matter / Antifa “protests” are simply the same weapon\nnow aimed at the American people\nand the U.S. government:\nWhy has the media failed to show the vast destruction of businesses and private property? Why have they minimized the effects of vandalism, looting and arson? Why have they fanned the flames of social unrest from the very beginning, shrugging off the ruin and devastation while cheerleading the demonstrations as a heroic struggle for racial justice? Is this is the same media that supported every bloody war, every foreign intervention, and every color-revolution for the last 5 decades? Are we really expected to believe that they’ve changed their stripes and become an energized proponent of social justice?\nNonsense. The media’s role in concealing the damage should only convince skeptics that the protests are just one part of a much larger operation. What we’re seeing play out in over 400 cities across the US, has more to do with toppling Trump and sowing racial division than it does with the killing of George Floyd.\nThe scale and coordination alone suggests that elements in the deep state are probably involved. We know from evidence uncovered during the Russiagate probe, that the media works hand-in-glove with the Intel agencies and FBI while–at the same time– serving as a mouthpiece for elites.\nThat hasn’t changed, in fact, it’s gotten even worse. The uniformity of the coverage suggests that that same perception management strategy is being employed here as well. Even at this late date, the determination to remove Trump from office is as strong as ever even though, in the present case, it has been combined with the broader political strategy of inciting fratricidal violence, obliterating urban areas, and spreading anarchy across the country.\nThis isn’t about racial justice or police brutality, it’s about regime change, internal destabilization, and martial law….\nThe United States has never experienced two weeks of sustained protests in hundreds of its cities at the same time.\nIt’s beyond suspicious, it points to extensive coordination with groups across the country, a comprehensive media strategy (that probably preceded the killing of George Floyd), a sizable presence on social media (to put people on the street), and agents provocateur whose task is to incite violence, loot and create mayhem.\nWhat this means is that martial law is coming to the USA, and probably sooner than you might imagine. Moreover, its institution will be absolutely justified by the level of treason involved. The events of the hot summer to come may turn out to be the ultimate Q proof, and also explain the God-Emperor’s uncharacteristic equanimity and relative taciturnity concerning the ongoing riots; he knew what was coming, he knows it is going to get worse, and he is waiting for the correct moment to strike at those who are behind it.\nThe average white American is rapidly getting to the point of seeing the actions of the Deep State provocateurs as treason. But he isn’t quite there yet. And I doubt the God-Emperor will launch The Storm until he is, because the actions that he absolutely has to take in order to deal with this attack on America will be very upsetting to the average Fox News viewer.\nFDR had to wait for Pearl Harbor and a German declaration of war before he was able to declare war on Germany. The neocons had to wait until 9/11 to get their long-sought war with Iraq. Trump has to wait until the Deep State crosses a similar line before acting, which is precisely why the “protesters” and their allies in state and local government have been seeking to bait him into premature anti-revolutionary action.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-15T09:47:32+00:00"
}