{
  "url": "https://voxday.net/2020/06/17/the-boy-scouts-converged-2/",
  "scraped_at": "2025-12-21T12:58:16.787718",
  "title": "The Boy Scouts, converged",
  "date_display": "June 17, 2020",
  "date_iso": "2020-06-17T13:00:25+00:00",
  "date_from_url": "2020-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>With the possible exception of NASCAR, I don’t know that I’ve ever seen an organization disembowel itself as rapidly <a href=\"https://scoutingwire.org/bsas-commitment-to-act-against-racial-injustice/\">as the Boy Scouts of America</a>:</p><blockquote><p>There is no place for racism – not in Scouting and not in our communities. Racism will not be tolerated.</p><p>We condemn the murders of George Floyd, Ahmaud Arbery, Breonna Taylor and all those who are not named but are equally important. We hear the anguish, feel the heartbreak, and join the country’s resolve to do better.</p><p>The Boy Scouts of America stands with Black families and the Black community because we believe that Black Lives Matter. This is not a political issue; it is a human rights issue and one we all have a duty to address. That is why, as an organization, we commit to:</p><ul><li>Introducing a specific diversity and inclusion merit badge that will be required for the rank of Eagle Scout. It will build on components within existing merit badges, including the American Cultures and Citizenship in the Community merit badges, which require Scouts to learn about and engage with other groups and cultures to increase understanding and spur positive action.</li><li>Reviewing every element of our programs to ensure diversity and inclusion are engrained at every level for participants and volunteers by applying a standard that promotes racial equality and denounces racism, discrimination, inequality and injustice.</li><li>Requiring diversity and inclusion training for all BSA employees starting July 1 and taking immediate action toward introducing a version for volunteers in the coming months.</li><li>Conducting a review of property names, events and insignia, in partnership with local councils, to build on and enhance the organization’s nearly 30-year ban on use of the Confederate flag and to ensure that symbols of oppression are not in use today or in the future.</li></ul><p>These are our next steps but certainly not our last.</p></blockquote><p>No, the beheading tends to follow the self-evisceration. It’s intriguing to see how the mask has finally come off and tolerance is no longer being sold as a virtue now that the corporate cancer has metastasized. As I have pointed out for years, it is intolerance that is the virtue and <a href=\"http://voxday.blogspot.com/2006/04/on-virtue-of-tolerance.html\">tolerance is the Sin of Jeroboam</a>. And given how they define racism, discrimination, inequality, and injustice, it is now eminently clear, by their own confession, that there is no place for SJWs or Black Lives Matter or Antifa in any civilized society.</p><p>If you understand that social justice is not justice, it should not be hard to grasp that racial injustice is not injustice. Remember, the adjective <i>modifies </i>the noun. And notice that no comments are permitted in response on the statement on the BSA website.</p></div>",
  "content_text": "With the possible exception of NASCAR, I don’t know that I’ve ever seen an organization disembowel itself as rapidly\nas the Boy Scouts of America\n:\nThere is no place for racism – not in Scouting and not in our communities. Racism will not be tolerated.\nWe condemn the murders of George Floyd, Ahmaud Arbery, Breonna Taylor and all those who are not named but are equally important. We hear the anguish, feel the heartbreak, and join the country’s resolve to do better.\nThe Boy Scouts of America stands with Black families and the Black community because we believe that Black Lives Matter. This is not a political issue; it is a human rights issue and one we all have a duty to address. That is why, as an organization, we commit to:\nIntroducing a specific diversity and inclusion merit badge that will be required for the rank of Eagle Scout. It will build on components within existing merit badges, including the American Cultures and Citizenship in the Community merit badges, which require Scouts to learn about and engage with other groups and cultures to increase understanding and spur positive action.\nReviewing every element of our programs to ensure diversity and inclusion are engrained at every level for participants and volunteers by applying a standard that promotes racial equality and denounces racism, discrimination, inequality and injustice.\nRequiring diversity and inclusion training for all BSA employees starting July 1 and taking immediate action toward introducing a version for volunteers in the coming months.\nConducting a review of property names, events and insignia, in partnership with local councils, to build on and enhance the organization’s nearly 30-year ban on use of the Confederate flag and to ensure that symbols of oppression are not in use today or in the future.\nThese are our next steps but certainly not our last.\nNo, the beheading tends to follow the self-evisceration. It’s intriguing to see how the mask has finally come off and tolerance is no longer being sold as a virtue now that the corporate cancer has metastasized. As I have pointed out for years, it is intolerance that is the virtue and\ntolerance is the Sin of Jeroboam\n. And given how they define racism, discrimination, inequality, and injustice, it is now eminently clear, by their own confession, that there is no place for SJWs or Black Lives Matter or Antifa in any civilized society.\nIf you understand that social justice is not justice, it should not be hard to grasp that racial injustice is not injustice. Remember, the adjective\nmodifies\nthe noun. And notice that no comments are permitted in response on the statement on the BSA website.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-17T12:00:25+00:00"
}