{
  "url": "https://voxday.net/2020/06/06/the-promethean-playbook/",
  "scraped_at": "2025-12-21T12:57:01.082427",
  "title": "The Promethean playbook",
  "date_display": "June 6, 2020",
  "date_iso": "2020-06-06T16:03:08+00:00",
  "date_from_url": "2020-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Atlantic</i> is literally spelling it out for those who are too slow to recognize <a href=\"https://www.theatlantic.com/ideas/archive/2020/06/how-regime-change-happens/612739/\">the obvious pattern of a color revolution</a> playing out:</p><blockquote><p>What the United States is witnessing is less like the chaos of 1968, which further divided a nation, and more like the nonviolent movements that earned broad societal support in places such as Serbia, Ukraine, and Tunisia, and swept away the dictatorial likes of Milošević, Yanukovych, and Ben Ali.</p><p>And although Trump’s time in office will end with an election and not an ouster, it is only possible to grasp the magnitude of what we’re seeing and to map what comes next by looking to these antecedents from abroad.</p><p>As in the case of many such revolutions, two battles are being waged in America. One is a long struggle against a brutal and repressive ideology. The other is a narrower fight over the fate of a particular leader. The president rose to power by inflaming racial tensions. He now finds his own fate enmeshed in the struggle against police brutality and racism.</p><p>The most important theorist of nonviolent revolutions is the late political scientist Gene Sharp. A conscientious objector during the Korean War who spent nine months in prison, Sharp became a close student of Mahatma Gandhi’s struggles. His work set out to extract the lessons of the Indian revolt against the British. He wanted to understand the weaknesses of authoritarian regimes—and how nonviolent movements could exploit them. Sharp distilled what he learned into a 93-page handbook, From Dictatorship to Democracy, a how-to guide for toppling autocracy.</p><p>Sharp’s foundational insight is embedded in an aphorism: “Obedience is at the heart of political power.” A dictator doesn’t maintain power on his own; he relies on individuals and institutions to carry out his orders. A successful democratic revolution prods these enablers to stop obeying. It makes them ashamed of their complicity and fearful of the social and economic costs of continued collaboration.</p><p>Sharp posited that revolutionaries should focus first on the regime’s softest underbelly: the media, the business elites, and the police. The allegiance of individuals in the outer circle of power is thin and rooted in fear. By standing strong in the face of armed suppression, protesters can supply examples of courage that inspire functionaries to stop carrying out orders, or as Sharp put it, to “withhold cooperation.” Each instance of resistance provides the model for further resistance. As the isolation of the dictators grows—as the inner circles of power join the outer circle in withholding cooperation—the regime crumbles.</p><p>This is essentially what transpired in Ukraine in 2014. When the country’s president backed away from plans to join the European Union, a crowd amassed in Kyiv’s central square, the Maidan. The throngs initially had no avowed intention or realistic hope of overthrowing the kleptocratic president, Viktor Yanukovych. But instead of letting the demonstrators shout themselves hoarse in the thick of subfreezing winter, Yanukovych set about violently confronting them. This tactic backfired horribly. A movement with limited aims became a full-blown revolution.</p></blockquote><p>Essentially… there is the key tell that assures us the writer knows he is misleading his readers. The Maidan protesters were not “violently confronted” by the Yanukovych regime, <a href=\"https://www.pri.org/stories/2014-03-14/who-were-maidan-snipers\">they were murdered by mercenaries</a> in the employ of the people who were pulling their strings, the very same people who are now pulling the strings of BLM and Antifa in the USA’s own would-be color revolution.</p><p>That’s why there are now anti-sniper snipers in position around the White House and other protest locations. They are not there to shoot the protesters, they are there to prevent the puppets from being publicly sacrificed by the puppetmasters.</p></div>",
  "content_text": "The Atlantic\nis literally spelling it out for those who are too slow to recognize\nthe obvious pattern of a color revolution\nplaying out:\nWhat the United States is witnessing is less like the chaos of 1968, which further divided a nation, and more like the nonviolent movements that earned broad societal support in places such as Serbia, Ukraine, and Tunisia, and swept away the dictatorial likes of Milošević, Yanukovych, and Ben Ali.\nAnd although Trump’s time in office will end with an election and not an ouster, it is only possible to grasp the magnitude of what we’re seeing and to map what comes next by looking to these antecedents from abroad.\nAs in the case of many such revolutions, two battles are being waged in America. One is a long struggle against a brutal and repressive ideology. The other is a narrower fight over the fate of a particular leader. The president rose to power by inflaming racial tensions. He now finds his own fate enmeshed in the struggle against police brutality and racism.\nThe most important theorist of nonviolent revolutions is the late political scientist Gene Sharp. A conscientious objector during the Korean War who spent nine months in prison, Sharp became a close student of Mahatma Gandhi’s struggles. His work set out to extract the lessons of the Indian revolt against the British. He wanted to understand the weaknesses of authoritarian regimes—and how nonviolent movements could exploit them. Sharp distilled what he learned into a 93-page handbook, From Dictatorship to Democracy, a how-to guide for toppling autocracy.\nSharp’s foundational insight is embedded in an aphorism: “Obedience is at the heart of political power.” A dictator doesn’t maintain power on his own; he relies on individuals and institutions to carry out his orders. A successful democratic revolution prods these enablers to stop obeying. It makes them ashamed of their complicity and fearful of the social and economic costs of continued collaboration.\nSharp posited that revolutionaries should focus first on the regime’s softest underbelly: the media, the business elites, and the police. The allegiance of individuals in the outer circle of power is thin and rooted in fear. By standing strong in the face of armed suppression, protesters can supply examples of courage that inspire functionaries to stop carrying out orders, or as Sharp put it, to “withhold cooperation.” Each instance of resistance provides the model for further resistance. As the isolation of the dictators grows—as the inner circles of power join the outer circle in withholding cooperation—the regime crumbles.\nThis is essentially what transpired in Ukraine in 2014. When the country’s president backed away from plans to join the European Union, a crowd amassed in Kyiv’s central square, the Maidan. The throngs initially had no avowed intention or realistic hope of overthrowing the kleptocratic president, Viktor Yanukovych. But instead of letting the demonstrators shout themselves hoarse in the thick of subfreezing winter, Yanukovych set about violently confronting them. This tactic backfired horribly. A movement with limited aims became a full-blown revolution.\nEssentially… there is the key tell that assures us the writer knows he is misleading his readers. The Maidan protesters were not “violently confronted” by the Yanukovych regime,\nthey were murdered by mercenaries\nin the employ of the people who were pulling their strings, the very same people who are now pulling the strings of BLM and Antifa in the USA’s own would-be color revolution.\nThat’s why there are now anti-sniper snipers in position around the White House and other protest locations. They are not there to shoot the protesters, they are there to prevent the puppets from being publicly sacrificed by the puppetmasters.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-06-06T15:03:08+00:00"
}