{
  "url": "https://voxday.net/2005/10/17/anti-science-of-evolution/",
  "scraped_at": "2026-01-08T20:47:09.609522",
  "title": "The anti-science of evolution",
  "date_display": "October 17, 2005",
  "date_iso": "2005-10-17T10:07:00+00:00",
  "date_from_url": "2005-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to note the reactions of any group of religious faithful to the honest questions of skeptics.  Fred, whose recent column is quoted below, is no Creationist; he’s not even a Christian.  I do happen to be a Christian, but I am largely agnostic on the question of origins, and I suspect that the truth is far stranger than anything anyone sane currently believes.  I mean, it’s not as if quantum theory looked either practical or credible to anyone prior to 1900, right?</p><blockquote><p><a href=\"http://www.fredoneverything.net/EvolutionPhiladelphia.shtml\">I note that Compulsory Evolutionists are fellow travelers of the regnant cultural Marxism</a>, though I don’t think that they are aware of it. They display the same hermetic materialism, the same desire to suppress dissent by the application of centralized governmental power, the same weird hostility to religion. They do not say, “I think Christianity is nonsense and will therefore ignore it,” but rather “These ideas shall not be permitted.”….</p><p>I once posed these questions in a column on Fredoneverything.net and, in another place, to a group of committed evangelicals of Evolution. A tremendous influx of email resulted. Much of it was predictable. Many Christians congratulated me on having disproved Evolution, which I had not done. The intelligent and independent-minded wrote thoughtfully. Of the Knights Templar of Evolution, none—not one—answered the foregoing yes-or-no questions. They ducked. They dodged. They waxed wroth. They called names.</p><p>This is the behavior not of scientists but of true believers.</p></blockquote><p>For me, it is primarily this aggressively defensive behavior on the part of its hard-core faithful that leads me to believe evolution will eventually come to be seen by future scientists as one of the great embarrassments of 20th Century science.</p><p>Since I am a Christian, I can be easily dismissed as an ignorant Flat Earther.  But ignoring intelligent atheists like Fred Reed who share my evolutionary skepticism is a little more difficult.</p></div>",
  "content_text": "It’s always interesting to note the reactions of any group of religious faithful to the honest questions of skeptics.  Fred, whose recent column is quoted below, is no Creationist; he’s not even a Christian.  I do happen to be a Christian, but I am largely agnostic on the question of origins, and I suspect that the truth is far stranger than anything anyone sane currently believes.  I mean, it’s not as if quantum theory looked either practical or credible to anyone prior to 1900, right?\nI note that Compulsory Evolutionists are fellow travelers of the regnant cultural Marxism\n, though I don’t think that they are aware of it. They display the same hermetic materialism, the same desire to suppress dissent by the application of centralized governmental power, the same weird hostility to religion. They do not say, “I think Christianity is nonsense and will therefore ignore it,” but rather “These ideas shall not be permitted.”….\nI once posed these questions in a column on Fredoneverything.net and, in another place, to a group of committed evangelicals of Evolution. A tremendous influx of email resulted. Much of it was predictable. Many Christians congratulated me on having disproved Evolution, which I had not done. The intelligent and independent-minded wrote thoughtfully. Of the Knights Templar of Evolution, none—not one—answered the foregoing yes-or-no questions. They ducked. They dodged. They waxed wroth. They called names.\nThis is the behavior not of scientists but of true believers.\nFor me, it is primarily this aggressively defensive behavior on the part of its hard-core faithful that leads me to believe evolution will eventually come to be seen by future scientists as one of the great embarrassments of 20th Century science.\nSince I am a Christian, I can be easily dismissed as an ignorant Flat Earther.  But ignoring intelligent atheists like Fred Reed who share my evolutionary skepticism is a little more difficult.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-17T09:07:00+00:00"
}