{
  "url": "https://voxday.net/2005/10/03/correcting-correction-to-corrections/",
  "scraped_at": "2026-01-08T20:45:42.400488",
  "title": "Correcting the correction to the corrections",
  "date_display": "October 3, 2005",
  "date_iso": "2005-10-03T08:17:00+00:00",
  "date_from_url": "2005-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Editor &amp; Publisher:</p><blockquote><p>Just days after it ran an editors’ note–under pressure from outside and within–that sort of admitted it had erred in a blast at Fox News’ Gerald Rivera during the Katrina tragedy, The New York Times finally ran a full correction on Sunday, on its editorial page, for a miscue by columnist Paul Krugman, while announcing a new policy on noting errors on that page.</p><p>Krugman had three times previously admitted getting wrong part of his Aug. 19 column about media recounts of the 2000 Bush-Gore race, but critics kept claiming that he still hadn’t gotten it quite right. Editorial Page Editor Gail Collins wrote on Sunday that it had turned into a “correction run amok.”</p><p>After publishing his third correction on the Web, Krugman asked Collins, she wrote, “if he could refrain from revisiting the subject yet again in print. I agreed, feeling we had reached the point of cruelty to readers. But I was wrong. The correction should have run in the same newspaper where the original error and all its little offspring had appeared.”</p></blockquote><p>One shudders to think how many trees would perish in the service of correcting Paul Krugman’s many errors were any of the New York Times editors to know the first thing about economics.  I spotted six notable errors within the first three chapters of one of his books when I was researching the chapter on him for my profitable, but unpublishable <em>Media Whores: Courtesans and Charlatans of the American Commentariat</em>.</p><p>Actually, if anyone has an interest in that, I can post a chapter or two here.</p></div>",
  "content_text": "From Editor & Publisher:\nJust days after it ran an editors’ note–under pressure from outside and within–that sort of admitted it had erred in a blast at Fox News’ Gerald Rivera during the Katrina tragedy, The New York Times finally ran a full correction on Sunday, on its editorial page, for a miscue by columnist Paul Krugman, while announcing a new policy on noting errors on that page.\nKrugman had three times previously admitted getting wrong part of his Aug. 19 column about media recounts of the 2000 Bush-Gore race, but critics kept claiming that he still hadn’t gotten it quite right. Editorial Page Editor Gail Collins wrote on Sunday that it had turned into a “correction run amok.”\nAfter publishing his third correction on the Web, Krugman asked Collins, she wrote, “if he could refrain from revisiting the subject yet again in print. I agreed, feeling we had reached the point of cruelty to readers. But I was wrong. The correction should have run in the same newspaper where the original error and all its little offspring had appeared.”\nOne shudders to think how many trees would perish in the service of correcting Paul Krugman’s many errors were any of the New York Times editors to know the first thing about economics.  I spotted six notable errors within the first three chapters of one of his books when I was researching the chapter on him for my profitable, but unpublishable\nMedia Whores: Courtesans and Charlatans of the American Commentariat\n.\nActually, if anyone has an interest in that, I can post a chapter or two here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-03T07:17:00+00:00"
}