{
  "url": "https://voxday.net/2005/10/22/dichotomous-subversive-part-i-of-ii/",
  "scraped_at": "2026-01-08T20:47:47.632787",
  "title": "The Dichotomous Subversive – part I of II",
  "date_display": "October 22, 2005",
  "date_iso": "2005-10-22T12:01:00+00:00",
  "date_from_url": "2005-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>The Dichotomous Subversive: Douglas Adams and the Rule of Unreason</b><br>by Vox Day<br>copyright (c) 2004</br></br></p><p>From <a href=\"http://66.84.52.211/cgi-bin/plugins/MivaEmpresas/miva?plugins/MivaMerchants/merchant.mvc+Screen=PROD&amp;Store_Code=BB&amp;Product_Code=HHGG&amp;Category_Code=H2G2\">THE ANTHOLOGY AT THE END OF THE UNIVERSE</a>, Ben Bella Books</p><p>It is not written in thirty-foot high letters of fire on top of the Quentulus Quazgar Mountains, but there is a distinct message that can be found woven throughout Douglas Adams’ (regrettably no longer) increasingly innacurately named Hitchhiker’s Trilogy.  His is a seditious message, a wildly subversive one, in fact, considering the ironic circumstances of its germination and subsequent propagation.</p><p>The dark master of the black art of humor, Adams is a fearless thrower of flames; an equal-opportunity mocker, his targets are freely distributed across the spectrum. He ridicules rock bands, religious fundamentalists, quantum mechanists, environmentalists and the Oxford English dictionary.  He mocks Hollywood screenwriters and philosophers with equal enthusiasm, ; he lampoons politicians and poets with effortlessly cruel flair.  If an author can be discerned through the veil of his characters, he would appear to be more Wowbagger the Infinitely Prolonged than the long-suffering Arthur Dent, though Adams does not trouble to order his insults alphabetically.</p><p>To fully appreciate the overarching contempt that fuels Adams’ humor, it is necessary to understand that the government that inspired it was not the post-Thatcher New Labour of Tony Blair’s Cool Britannia, but the grim, ponderous Old Labour regime of Harold Wilson and James Callaghan.  Economically illiterate and dominated by socialist trade-unions, its policies had led to a severe devalution of the pound combined with harsh currency controls that limited the amount of cash British vacationers could take out of the country, forcing a nation with colonies in Bermuda and the Virgin Islands to spend its vacations at the cold Atlantic beaches of Blackpool.</p><p>The Hitchhiker’s Guide to the Galaxy begins with the indelible image of a showdown between a bulldozer and a man futilely attempting to defend his property against the proclaimed interest of the governing authorities.  The remorseless and inexorable logic of the Council — you’ve got to build bypasses – was recently echoed in the U.S.A. by the Connecticut Supreme Court, which ruled that the city of New London was operating within its rights when it used its power of eminent domain to condemn the middle-class Fort Trumbull neighborhood in order to permit developers to knock down ninety homes and replace them with upscale condominiums and an office park.</p><p>One hopes that unlike the case of Arthur Dent’s house, these demolitions will not soon be followed by the total destruction of the Earth.</p><p>This classic critique of eminent domain is far from the only one that Adams makes in his clandestine litany of the mindless abuses of government.  His feelings on the bureaucrats who run the show could hardly be made more clear when he writes that it is the ugly, unevolved Vogons who have migrated in mass to the political hub of the galaxy and now make up “the immensely powerful backbone of the Galactic Civil Service.”  Anyone who has had the misfortune of encountering the corpulent troglodytes who dwell in department of transportation offices will readily recognize where Adams likely found his inspiration for both the Vogon’s appearance and their unhelpful philosophy.</p><p><em>“They are one of the most unpleasant races in the Galaxy— – not actually evil, but bad tempered, bureaucratic, officious and callous. They wouldn’t even lift a finger to save their own grandmothers from the Ravenous Bugblatter Beast of Traal without orders signed in triplicate, sent in, sent back, queried, lost, found, subjected to public inquiry, lost again, and finally buried in soft peat and recycled as firelighters.”</em></p><p>This profoundly negative attitude towards government is not limited to observations of its low-level functionaries, but is instead a broad-based, highly conceptual worldview.  The citizen of a world-spanning empire declining into global irrelevance, Douglas Adams paints a picture of a galaxy in similar decline, where the “wild, rich and largely tax-free” days of glory and greatness are lost in the mists of time and those who cater to the wealthy Galactic elite are forced to hibernate in time stasis to wait until the economic cycle of boom and bust plays itself out.</p><p>Remarkably, Adams manages to mine this unlikely field, economics, for some of his most scathing barbs.  The dismal science does not often figure into fictional plot lines and still less is it played for laughs, but nevertheless, it has an integral role in both the overall story and Adams’ underlying theme.  Indeed, Adams betrays a remarkably sophisticated understanding of economics when he pokes fun at the Marxian concept of capitalist crisis in the Shoe Event Horizon that ruins the world of Frogstar World B.</p><p>Furthermore, his grasp of the dangers of inflation is not only markedly superior to the world’s current central bankers, but he also lays the blame squarely where it lies, namely, with the government authorities responsible for adopting an inherently worthless paper currency subject to inevitable inflation.</p><p><em> “Thank you. Since we decided a few weeks ago to adopt the leaf as legal tender, we have, of course, all become immensely rich.”</em></p><p>Ford stared in disbelief at the crowd who were murmuring appreciatively at this and greedily fingering the wads of leaves with which their track suits were stuffed.</p><p>“But we have also,” continued the Management Consultant, “run into a small inflation problem on account of the high level of leaf availability, which means that, I gather, the current going rate has something like three deciduous forests buying one ship’s peanut.”</p><p>Murmurs of alarm came from the crowd. The Management Consultant waved them down.</p><p>“So in order to obviate this problem,” he continued, “and effectively revaluate the leaf, we are about to embark on a massive defoliation campaign, and . . .  er, burn down all the forests. I think you’ll all agree that’s a sensible move under the circumstances.” </p><p>It would seem that the British government’s currency disaster of his youth left an indelible impression on Adams, for he mentions the collapse of the Altairan dollar on more than one occasion and expresses deep skepticism about the concept of compound interest outpacing inflation in describing how one pays for a meal at Milliways, the restaurant at the end of the universe, with a single penny.  Indeed, Adams’ environmentalist take on paper currency sounds very much like that of Austrian School economist Murray Rothbard, whose seminal history of money and banking chronicles how American monetary authorities have repeatedly caused social and economic calamity through an addiction to expansive monetary policy:</p><p><em>The issue of this fiat “Continental’ paper rapidly escalated over the next few years…. The result was, as could be expected, a rapid price inflation in terms of the paper notes, and a corollary accelerating depreciation of the paper in terms of specie [gold or silver coin].  Thus, at the end of 1776, the Continentals were worth $1 to $1.25 in specie; by the fall of the following year, its value had fallen to 3-to-1; by December 1778 the value was 6.8-to-1; and by December 1779, to the negligible 42-to-1.  By the spring of 1781, the Continentals were virtually worthless, exchanging on the market at 168 dollars to one dollar in specie.  This collapse of the Continental currency gave rise to the phrase “not worth a Continental.” <br>– Murray Rothbard, A History of Money and Banking in the United States, p. 59</br></em></p><p>Money mismanagement is far from the only form of gross government incompetence target<br> ed by Adams.  When Marvin is stuck in the swamp on Squornshellous Zeta, the robot tells a mattress named Zem about a speech he once gave at the opening of a thousand-mile bridge constructed in the swamp.  “It was going to revitalize the economy of the Squornshellous System,” he informs the flolloping Zem.  “They spent the entire economy of the Squornshellous System building it.”</br></p><p>Friedrich Hayek’s  “Two Pages of Fiction: The Impossibility of Socialist Calculation,” is famous for demonstrating how the central planner’s task is bound to be a hopeless one,  but Adams takes the concept one step further by pointing out the inevitable absurdities as well.  Squornshellous Zeta’s economic revival project fails in a spectacular manner at what should have been its moment of glory by sinking into the swamp and killing everyone.  In addition to being a critique of central planning, this vignette could also be seen as a sly reference to the lethal nature of socialist governments in the twentieth century, which so often began by promising Heaven on Earth and instead delivered Hell.</p><p>– END PART I –</p></div>",
  "content_text": "The Dichotomous Subversive: Douglas Adams and the Rule of Unreason\nby Vox Day\ncopyright (c) 2004\nFrom\nTHE ANTHOLOGY AT THE END OF THE UNIVERSE\n, Ben Bella Books\nIt is not written in thirty-foot high letters of fire on top of the Quentulus Quazgar Mountains, but there is a distinct message that can be found woven throughout Douglas Adams’ (regrettably no longer) increasingly innacurately named Hitchhiker’s Trilogy.  His is a seditious message, a wildly subversive one, in fact, considering the ironic circumstances of its germination and subsequent propagation.\nThe dark master of the black art of humor, Adams is a fearless thrower of flames; an equal-opportunity mocker, his targets are freely distributed across the spectrum. He ridicules rock bands, religious fundamentalists, quantum mechanists, environmentalists and the Oxford English dictionary.  He mocks Hollywood screenwriters and philosophers with equal enthusiasm, ; he lampoons politicians and poets with effortlessly cruel flair.  If an author can be discerned through the veil of his characters, he would appear to be more Wowbagger the Infinitely Prolonged than the long-suffering Arthur Dent, though Adams does not trouble to order his insults alphabetically.\nTo fully appreciate the overarching contempt that fuels Adams’ humor, it is necessary to understand that the government that inspired it was not the post-Thatcher New Labour of Tony Blair’s Cool Britannia, but the grim, ponderous Old Labour regime of Harold Wilson and James Callaghan.  Economically illiterate and dominated by socialist trade-unions, its policies had led to a severe devalution of the pound combined with harsh currency controls that limited the amount of cash British vacationers could take out of the country, forcing a nation with colonies in Bermuda and the Virgin Islands to spend its vacations at the cold Atlantic beaches of Blackpool.\nThe Hitchhiker’s Guide to the Galaxy begins with the indelible image of a showdown between a bulldozer and a man futilely attempting to defend his property against the proclaimed interest of the governing authorities.  The remorseless and inexorable logic of the Council — you’ve got to build bypasses – was recently echoed in the U.S.A. by the Connecticut Supreme Court, which ruled that the city of New London was operating within its rights when it used its power of eminent domain to condemn the middle-class Fort Trumbull neighborhood in order to permit developers to knock down ninety homes and replace them with upscale condominiums and an office park.\nOne hopes that unlike the case of Arthur Dent’s house, these demolitions will not soon be followed by the total destruction of the Earth.\nThis classic critique of eminent domain is far from the only one that Adams makes in his clandestine litany of the mindless abuses of government.  His feelings on the bureaucrats who run the show could hardly be made more clear when he writes that it is the ugly, unevolved Vogons who have migrated in mass to the political hub of the galaxy and now make up “the immensely powerful backbone of the Galactic Civil Service.”  Anyone who has had the misfortune of encountering the corpulent troglodytes who dwell in department of transportation offices will readily recognize where Adams likely found his inspiration for both the Vogon’s appearance and their unhelpful philosophy.\n“They are one of the most unpleasant races in the Galaxy— – not actually evil, but bad tempered, bureaucratic, officious and callous. They wouldn’t even lift a finger to save their own grandmothers from the Ravenous Bugblatter Beast of Traal without orders signed in triplicate, sent in, sent back, queried, lost, found, subjected to public inquiry, lost again, and finally buried in soft peat and recycled as firelighters.”\nThis profoundly negative attitude towards government is not limited to observations of its low-level functionaries, but is instead a broad-based, highly conceptual worldview.  The citizen of a world-spanning empire declining into global irrelevance, Douglas Adams paints a picture of a galaxy in similar decline, where the “wild, rich and largely tax-free” days of glory and greatness are lost in the mists of time and those who cater to the wealthy Galactic elite are forced to hibernate in time stasis to wait until the economic cycle of boom and bust plays itself out.\nRemarkably, Adams manages to mine this unlikely field, economics, for some of his most scathing barbs.  The dismal science does not often figure into fictional plot lines and still less is it played for laughs, but nevertheless, it has an integral role in both the overall story and Adams’ underlying theme.  Indeed, Adams betrays a remarkably sophisticated understanding of economics when he pokes fun at the Marxian concept of capitalist crisis in the Shoe Event Horizon that ruins the world of Frogstar World B.\nFurthermore, his grasp of the dangers of inflation is not only markedly superior to the world’s current central bankers, but he also lays the blame squarely where it lies, namely, with the government authorities responsible for adopting an inherently worthless paper currency subject to inevitable inflation.\n“Thank you. Since we decided a few weeks ago to adopt the leaf as legal tender, we have, of course, all become immensely rich.”\nFord stared in disbelief at the crowd who were murmuring appreciatively at this and greedily fingering the wads of leaves with which their track suits were stuffed.\n“But we have also,” continued the Management Consultant, “run into a small inflation problem on account of the high level of leaf availability, which means that, I gather, the current going rate has something like three deciduous forests buying one ship’s peanut.”\nMurmurs of alarm came from the crowd. The Management Consultant waved them down.\n“So in order to obviate this problem,” he continued, “and effectively revaluate the leaf, we are about to embark on a massive defoliation campaign, and . . .  er, burn down all the forests. I think you’ll all agree that’s a sensible move under the circumstances.”\nIt would seem that the British government’s currency disaster of his youth left an indelible impression on Adams, for he mentions the collapse of the Altairan dollar on more than one occasion and expresses deep skepticism about the concept of compound interest outpacing inflation in describing how one pays for a meal at Milliways, the restaurant at the end of the universe, with a single penny.  Indeed, Adams’ environmentalist take on paper currency sounds very much like that of Austrian School economist Murray Rothbard, whose seminal history of money and banking chronicles how American monetary authorities have repeatedly caused social and economic calamity through an addiction to expansive monetary policy:\nThe issue of this fiat “Continental’ paper rapidly escalated over the next few years…. The result was, as could be expected, a rapid price inflation in terms of the paper notes, and a corollary accelerating depreciation of the paper in terms of specie [gold or silver coin].  Thus, at the end of 1776, the Continentals were worth $1 to $1.25 in specie; by the fall of the following year, its value had fallen to 3-to-1; by December 1778 the value was 6.8-to-1; and by December 1779, to the negligible 42-to-1.  By the spring of 1781, the Continentals were virtually worthless, exchanging on the market at 168 dollars to one dollar in specie.  This collapse of the Continental currency gave rise to the phrase “not worth a Continental.”\n– Murray Rothbard, A History of Money and Banking in the United States, p. 59\nMoney mismanagement is far from the only form of gross government incompetence target\ned by Adams.  When Marvin is stuck in the swamp on Squornshellous Zeta, the robot tells a mattress named Zem about a speech he once gave at the opening of a thousand-mile bridge constructed in the swamp.  “It was going to revitalize the economy of the Squornshellous System,” he informs the flolloping Zem.  “They spent the entire economy of the Squornshellous System building it.”\nFriedrich Hayek’s  “Two Pages of Fiction: The Impossibility of Socialist Calculation,” is famous for demonstrating how the central planner’s task is bound to be a hopeless one,  but Adams takes the concept one step further by pointing out the inevitable absurdities as well.  Squornshellous Zeta’s economic revival project fails in a spectacular manner at what should have been its moment of glory by sinking into the swamp and killing everyone.  In addition to being a critique of central planning, this vignette could also be seen as a sly reference to the lethal nature of socialist governments in the twentieth century, which so often began by promising Heaven on Earth and instead delivered Hell.\n– END PART I –",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-22T11:01:00+00:00"
}