{
  "url": "https://voxday.net/2005/10/03/im-beginning-to-enjoy-ongoing-debacle/",
  "scraped_at": "2026-01-08T20:45:46.888970",
  "title": "I’m beginning to enjoy the ongoing debacle",
  "date_display": "October 3, 2005",
  "date_iso": "2005-10-03T14:39:00+00:00",
  "date_from_url": "2005-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ramesh Ponnuru writes on NRO’s Corner:</p><blockquote><p>THE PICK  It’s an inspiring testament to the diversity of the president’s cronies. Wearing heels is not an impediment to being a presidential crony in this administration! I can only assume that the president felt that his support was slipping in this important bloc, and he had to do something to shore it up.</p></blockquote><p>It’s beginning to sound as if Ramesh is about one more presidential speech from defecting to the Libertarian Party.</p><p>Chief John-John and Harriet.  I wonder how many you who flirted with third parties before returning to the Republican fold in 2004 on the basis of the Supreme Court nominations now wish you hadn’t?</p><p>UPDATE: <em>“The President’s nomination of Miers is a betrayal of the conservative, pro-family voters whose support put Bush in the White House in both the 2000 and 2004 elections and who were promised Supreme Court appointments in the mold of Thomas and Scalia. Instead we were given ‘stealth nominees,’ who have never ruled on controversial issues, more in the mold of the disastrous choice of David Souter by this President’s father.</em></p><p>“When there are so many proven judges in the mix, it is unacceptable this President has appointed a political crony with no conservative credentials. This attempt at ‘Bush Packing’ the Supreme Court must not be allowed to pass the Senate and we will forcefully oppose this nomination.” – from Drudge</p><p>All together now… I TOLD YOU SO!</p></div>",
  "content_text": "Ramesh Ponnuru writes on NRO’s Corner:\nTHE PICK  It’s an inspiring testament to the diversity of the president’s cronies. Wearing heels is not an impediment to being a presidential crony in this administration! I can only assume that the president felt that his support was slipping in this important bloc, and he had to do something to shore it up.\nIt’s beginning to sound as if Ramesh is about one more presidential speech from defecting to the Libertarian Party.\nChief John-John and Harriet.  I wonder how many you who flirted with third parties before returning to the Republican fold in 2004 on the basis of the Supreme Court nominations now wish you hadn’t?\nUPDATE:\n“The President’s nomination of Miers is a betrayal of the conservative, pro-family voters whose support put Bush in the White House in both the 2000 and 2004 elections and who were promised Supreme Court appointments in the mold of Thomas and Scalia. Instead we were given ‘stealth nominees,’ who have never ruled on controversial issues, more in the mold of the disastrous choice of David Souter by this President’s father.\n“When there are so many proven judges in the mix, it is unacceptable this President has appointed a political crony with no conservative credentials. This attempt at ‘Bush Packing’ the Supreme Court must not be allowed to pass the Senate and we will forcefully oppose this nomination.”\n– from Drudge\nAll together now… I TOLD YOU SO!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-03T13:39:00+00:00"
}