{
  "url": "https://voxday.net/2005/10/20/mailvox-equines-and-equalitarians-ii/",
  "scraped_at": "2026-01-08T20:47:35.808997",
  "title": "Mailvox: Equines and equalitarians II",
  "date_display": "October 20, 2005",
  "date_iso": "2005-10-20T11:15:00+00:00",
  "date_from_url": "2005-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris is slow to grasp that she doesn’t get to make the rules:</p><blockquote><p>Did you miss the point where I indicated that one single argument is not, and should not be, the whole of a debate? I’m perfectly happy staying right here, where people can see every argument on the subject I’ve made to you and vice versa, rather than on the front page where all the stuff I’ve said in the past gets swept aside with each new post and we go around in circles forever.  Stand and deliver here, VD.</p></blockquote><p>First, my blog, my rules.  So, regardless of how happy you are, no.  Second, your assumptions are as errant when it comes to Internet software technology as they are with regards to my intellectual character.  It is the Haloscan comments which will get washed away with time, which are not searchable and which do not get backed up.  This is why, when someone makes an insightful, funny or otherwise interesting comment, I post it, in order to preserve it.  It may not be your fault that you didn’t know this, but it is your fault that you didn’t bother to ask.</p><blockquote><p>If you could parse an argument, you’d be able to see that the thrust of that sentence wasn’t that I know lots of smart women, yay me, but that the smart women I know are evidence that Spacebunny’s not exemplary of her gender.  But you’re right, VD. The women I know aren’t private university types: they’re largely composed of engineering grad students at top rank state programs. Many of them have mastered discussing arcane technical concepts in a foreign language they learned as teenagers, but they’re clearly not too bright. Really.</p></blockquote><p>Yes, I did grasp your insult to her.  You’d be banned already, were it not for Spacebunny’s encouraging me to hold off.  So, not only can I parse your argument, but I can also demonstrate that “the thrust of your argument” depends upon your claim to know “smart women”, which is not acceptable evidence to anyone here.  According to you – and why should we take your statements at face value when you have repeatedly accused me of dishonesty instead of doing the same – your friends are taking classes in public universities.  Meanwhile, my female friends – there are people here who know them and can vouch for them – graduated from elite private institutions, so based on the entrance requirements, the chances that your little engineers are smarter are slim.  And if your friends are anything like the women engineers I know, they’d sell their soul to be more like Spacebunny.  She is an extraordinary example of her sex.</p><p>The ability to function in a foreign language proves nothing.  All it means is that you’re an immigrant.  I know dim-witted people who do it every day, while the three smartest individuals I know don’t.</p><blockquote><p>“I’ve answered every point you’ve put before me on this thread; you can’t say the same. Your current post on the front page demonstrates massive ignorance when you claim that “What prevented a literate upper-class Greek or Roman woman from writing a history or a philosophical treatise, or, like Galen, poking about corpses?” (Hint: in the Greek upper class, women simply weren’t educated beyond what we know today as “home economics”. Literacy was minimal or non-existent. The average age for an upper-class male was 30, the average [married] age for an upper-class female was 14, at which point they immediately started having kids. You’re simply an idiot if you think that, as a group, they had any chance in hell to do anything else with their lives.)</p></blockquote><p>Your claim of answering every point I’ve put before you is demonstrably false, as you ignore both the cited evidence of female Roman literacy and pretensions to intellectual achievement during the Imperial era, the admittedly oblique reference to Japanese women’s literacy as well as the dichotomy of homosexual achievement in the face of even greater social repression.  I note that as I’ve now finally addressed the historical issue, I am not aware of any point of yours have I missed.  If I have, it is unintentional;  please bring it to my attention and I will answer it.  As to the Greeks, the mere existence of Sappho casts doubt on your assertion and I’d like to see your sources demonstrating this minimal literacy.  In any case, since when do children render intellectual achievement impossible, especially in a slave-owning culture?  Did upper-class Greek women even nurse their own children?  I know that upper-class women in the Middle Ages certainly didn’t.</p><blockquote><p>And you outright contradict yourself. Back the Electrolite thread you said “I suppose I might as well point out now that if anyone had actually bothered to read the column instead of limiting themselves to the one quote, I clearly subscribe to the DON’T school, not the CAN’T.”  However, today you said “However, I’m not implying that women’s science ability and inclination is much lower than men, I’m outright stating it.”</p></blockquote><p>Does the meaning of the word “and” escape you?  If not, then please tell me if “inclination” falls under DON’T or CAN’T?  Since <a href=\"http://www.voxday.net/archive/2005/022105.html\">the column to which you are referring</a> stated that women were being intellectually cauterized by the current educational system, it’s either crazy or intentionally dishonest to conclude that I believed women “couldn’t” do better due to genetic limitations when the sole factor on which I was placing the blame is an environmental one.  Is that true or not?  And if not, please do walk us through the logic of how it isn’t.</p><p>As I wrote in 2003 and repeated in February: <em>“Instead of taking advantage of their intellectual freedom and unprecedented access to education, the feminist vanguard has embraced an anti-intellectual dogmatism that imprisons the current generation of young women in the academic convent of Women’s Studies, robbing them of both foundational knowledge and the capacity for rational linear thought, thus ensuring that this generation, like its foremothers, will also fail to accomplish anything worthy of historical regard.</em></p><p>And from this you glean an attack on women’s genetic shortcomings?  You underline my case!</p><blockquote><p>But it’s other people that can’t put together a coherent logical argument. Right.</p></blockquote><p>I haven’t seen you demonstrate the ability to do so yet.  You’ve simply sniped away at various statements I’ve made, while making more than one ludicrously spurious and unsupported assertion in the process.  Not even your fellow critics have indicated that they’re impressed with your arguments; I’m certainly not.</p></div>",
  "content_text": "Chris is slow to grasp that she doesn’t get to make the rules:\nDid you miss the point where I indicated that one single argument is not, and should not be, the whole of a debate? I’m perfectly happy staying right here, where people can see every argument on the subject I’ve made to you and vice versa, rather than on the front page where all the stuff I’ve said in the past gets swept aside with each new post and we go around in circles forever.  Stand and deliver here, VD.\nFirst, my blog, my rules.  So, regardless of how happy you are, no.  Second, your assumptions are as errant when it comes to Internet software technology as they are with regards to my intellectual character.  It is the Haloscan comments which will get washed away with time, which are not searchable and which do not get backed up.  This is why, when someone makes an insightful, funny or otherwise interesting comment, I post it, in order to preserve it.  It may not be your fault that you didn’t know this, but it is your fault that you didn’t bother to ask.\nIf you could parse an argument, you’d be able to see that the thrust of that sentence wasn’t that I know lots of smart women, yay me, but that the smart women I know are evidence that Spacebunny’s not exemplary of her gender.  But you’re right, VD. The women I know aren’t private university types: they’re largely composed of engineering grad students at top rank state programs. Many of them have mastered discussing arcane technical concepts in a foreign language they learned as teenagers, but they’re clearly not too bright. Really.\nYes, I did grasp your insult to her.  You’d be banned already, were it not for Spacebunny’s encouraging me to hold off.  So, not only can I parse your argument, but I can also demonstrate that “the thrust of your argument” depends upon your claim to know “smart women”, which is not acceptable evidence to anyone here.  According to you – and why should we take your statements at face value when you have repeatedly accused me of dishonesty instead of doing the same – your friends are taking classes in public universities.  Meanwhile, my female friends – there are people here who know them and can vouch for them – graduated from elite private institutions, so based on the entrance requirements, the chances that your little engineers are smarter are slim.  And if your friends are anything like the women engineers I know, they’d sell their soul to be more like Spacebunny.  She is an extraordinary example of her sex.\nThe ability to function in a foreign language proves nothing.  All it means is that you’re an immigrant.  I know dim-witted people who do it every day, while the three smartest individuals I know don’t.\n“I’ve answered every point you’ve put before me on this thread; you can’t say the same. Your current post on the front page demonstrates massive ignorance when you claim that “What prevented a literate upper-class Greek or Roman woman from writing a history or a philosophical treatise, or, like Galen, poking about corpses?” (Hint: in the Greek upper class, women simply weren’t educated beyond what we know today as “home economics”. Literacy was minimal or non-existent. The average age for an upper-class male was 30, the average [married] age for an upper-class female was 14, at which point they immediately started having kids. You’re simply an idiot if you think that, as a group, they had any chance in hell to do anything else with their lives.)\nYour claim of answering every point I’ve put before you is demonstrably false, as you ignore both the cited evidence of female Roman literacy and pretensions to intellectual achievement during the Imperial era, the admittedly oblique reference to Japanese women’s literacy as well as the dichotomy of homosexual achievement in the face of even greater social repression.  I note that as I’ve now finally addressed the historical issue, I am not aware of any point of yours have I missed.  If I have, it is unintentional;  please bring it to my attention and I will answer it.  As to the Greeks, the mere existence of Sappho casts doubt on your assertion and I’d like to see your sources demonstrating this minimal literacy.  In any case, since when do children render intellectual achievement impossible, especially in a slave-owning culture?  Did upper-class Greek women even nurse their own children?  I know that upper-class women in the Middle Ages certainly didn’t.\nAnd you outright contradict yourself. Back the Electrolite thread you said “I suppose I might as well point out now that if anyone had actually bothered to read the column instead of limiting themselves to the one quote, I clearly subscribe to the DON’T school, not the CAN’T.”  However, today you said “However, I’m not implying that women’s science ability and inclination is much lower than men, I’m outright stating it.”\nDoes the meaning of the word “and” escape you?  If not, then please tell me if “inclination” falls under DON’T or CAN’T?  Since\nthe column to which you are referring\nstated that women were being intellectually cauterized by the current educational system, it’s either crazy or intentionally dishonest to conclude that I believed women “couldn’t” do better due to genetic limitations when the sole factor on which I was placing the blame is an environmental one.  Is that true or not?  And if not, please do walk us through the logic of how it isn’t.\nAs I wrote in 2003 and repeated in February:\n“Instead of taking advantage of their intellectual freedom and unprecedented access to education, the feminist vanguard has embraced an anti-intellectual dogmatism that imprisons the current generation of young women in the academic convent of Women’s Studies, robbing them of both foundational knowledge and the capacity for rational linear thought, thus ensuring that this generation, like its foremothers, will also fail to accomplish anything worthy of historical regard.\nAnd from this you glean an attack on women’s genetic shortcomings?  You underline my case!\nBut it’s other people that can’t put together a coherent logical argument. Right.\nI haven’t seen you demonstrate the ability to do so yet.  You’ve simply sniped away at various statements I’ve made, while making more than one ludicrously spurious and unsupported assertion in the process.  Not even your fellow critics have indicated that they’re impressed with your arguments; I’m certainly not.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-20T10:15:00+00:00"
}