{
  "url": "https://voxday.net/2005/10/04/mailvox-as-to-apparent-hypocrisy/",
  "scraped_at": "2026-01-08T20:45:49.821714",
  "title": "Mailvox: as to apparent hypocrisy",
  "date_display": "October 4, 2005",
  "date_iso": "2005-10-04T10:24:00+00:00",
  "date_from_url": "2005-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>IN2N asks a reasonable question:</p><blockquote><p>I am curious though, why the copyright citation? Seems like a lot of folks around here ascribe to the notion that a man’s ideas are not his own…</p></blockquote><p>If you want to take a shot, IN2N, then by all means, take a shot!  As I’m the only possible target – being the party responsible for posting a copyright notice – there’s no need for this slyly oblique critique.</p><p>Anyhow, the reason for the copyright notice is twofold.  While I am completely unconcerned about my works being copied and distributed electronically, I do not wish to see them promulgated without being identified correctly.  I may be dubious about the ability to own ideas, but I do not deny that there is usually an original source for them, even if it is nothing more than a blending of ideas first conceived by other invididuals.</p><p>Second, my publishers and the overwhelming majority of my potential publishers do not subscribe to my skeptical view of copyright.  If I wish to work with them – and I do – then I am compelled to respect their views.  This is why there are no free downloadable versions of my novels posted here ala Charles Stross’s <em>Accelerando</em>, although I have repeatedly requested permission to do so from my publisher.</p></div>",
  "content_text": "IN2N asks a reasonable question:\nI am curious though, why the copyright citation? Seems like a lot of folks around here ascribe to the notion that a man’s ideas are not his own…\nIf you want to take a shot, IN2N, then by all means, take a shot!  As I’m the only possible target – being the party responsible for posting a copyright notice – there’s no need for this slyly oblique critique.\nAnyhow, the reason for the copyright notice is twofold.  While I am completely unconcerned about my works being copied and distributed electronically, I do not wish to see them promulgated without being identified correctly.  I may be dubious about the ability to own ideas, but I do not deny that there is usually an original source for them, even if it is nothing more than a blending of ideas first conceived by other invididuals.\nSecond, my publishers and the overwhelming majority of my potential publishers do not subscribe to my skeptical view of copyright.  If I wish to work with them – and I do – then I am compelled to respect their views.  This is why there are no free downloadable versions of my novels posted here ala Charles Stross’s\nAccelerando\n, although I have repeatedly requested permission to do so from my publisher.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-04T09:24:00+00:00"
}