{
  "url": "https://voxday.net/2005/10/18/mailvox-determined-to-see-what-is-no/",
  "scraped_at": "2026-01-08T20:47:17.623764",
  "title": "Mailvox: determined to see what is not there",
  "date_display": "October 18, 2005",
  "date_iso": "2005-10-18T11:05:00+00:00",
  "date_from_url": "2005-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris so desperately wants to believe in my intellectual dishonesty:</p><blockquote><p>– You don’t have to know jack about Latin or Italian, or have read everything VD has written to examine the above posts and realize VD changed his line of argument. This is clear evidence of backpedaling, right under your nose… unless you can make a substantive argument to the contrary, which seems unlikely.  Furthermore, the fact that he’d backpedal on something so trivial as a glorified spelling error suggests (but does not absolutely prove) that intellectual honestly isn’t real high on his list of priorities. This is something you and everyone else should keep in mind when reading through is stuff.</p></blockquote><p>I haven’t backpedaled at all.  Not once.  If anyone had simply bothered to ask me, “why did you call it Popoli instead of Populi?”, I would have told them.  There was already a bunch of Vox Populi this and Vox Populi that, and since I’d been learning Italian, I simply changed it to Popoli, which happens to be Italian for “peoples”.  “Popolo” would have made a bit more sense, but I thought that made it look like a Papal blog or something to your average person.  I don’t know why, but there’s something inherently silly about too many unadulterated Os.</p><p>Anyhow, it is always dangerous to assume knowledge, or the lack of it, on the part of another.  It is silly to assume that any political commentator would be unaware of the famous phrase, “vox populi, vox dei”, and particularly stupid to do so in the case of one who actually calls himself Vox Day.</p><blockquote><p>– The reason you don’t see as many of the “critiques with substance” as you might wish is that VD’s intellectual dishonesty, combined with the obnoxious tone and outrageous content of his remarks is more than enough for many people to write him off as a complete loon. People are only guaranteed a fair hearing in a court of law; everywhere else, it’s a privilege that other people may see fit to bestow as they wish… and they usually don’t bestow their time and attention on obnoxious twits like VD.</p></blockquote><p>Except, of course, when they do bestow such time and attention, and still can’t be bothered to walk us poor simpletons through the ridiculously easy way they can effortlessly shred my arguments.  Isn’t it amazing, how they always have the time to read and call names, but never enough to make the easy and coherent case they claim they could?  Also, note how this argument begins from the errant assumption that I am intellectually dishonest based on the “evidence” of the blog name.</p><blockquote><p>– Of course, it’s not at all clear that VD particularly wants to subject his ramblings to “critiques with substance.” Consider <a href=\"http://www.nielsenhayden.com/electrolite/archives/006122.html\">the infamous Electrolite thread</a> that, even half a year later, still bothers VD enough for him to bitch about at every opportunity. VD’s remarks were critiqued by men and women with substantive experience in almost every branch of science who stomped all over his column on the “mental pollution of feminism.”</p></blockquote><p>Yes, my distaste for substantive criticism is why there are month-long discussions of WWII, massive line-by-line posts on atheism and the Inquisition, and so forth.  It is very clear, Chris just doesn’t have a clue.  Provide a serious critique, Chris, and I’ll post it here.  Go for it.  You’re not too busy to post of bunch of comments, so you’re not too busy to provide an easy refutation of a recent column or two.</p><p>As for the Electrolyte uproar, do you seriously think it bothers me?  Do you think that’s why I happily <a href=\"http://www.nielsenhayden.com/electrolite/archives/006122.html\">provide links to it</a>.  It bothers me so much that I’m planning to run for SFWA president and as part of my campaign I will cite issues raised in it.  Do you truly believe that I am the least bit concerned about what that group of would-be TOR authors think?  They didn’t do any stomping, indeed, many of them embarrassed themselves with their illogic and hypocrisy.</p><p>And contrary to what many of the reading-challenged Pandagonians – please excuse the redundancy – appear to have taken away from that Electrolyte forum, I have not been banned from either the SFWA or future Nebula juries.  It would honestly appall many of those who were attacking me there to know that people believe that the SFWA engages in censorship and the suppression of free thought.</p><p>I shall await your substantive critique with some pleasure, Chris.  Write as much as you like, I’ll happily post it here in its entirety.</p></div>",
  "content_text": "Chris so desperately wants to believe in my intellectual dishonesty:\n– You don’t have to know jack about Latin or Italian, or have read everything VD has written to examine the above posts and realize VD changed his line of argument. This is clear evidence of backpedaling, right under your nose… unless you can make a substantive argument to the contrary, which seems unlikely.  Furthermore, the fact that he’d backpedal on something so trivial as a glorified spelling error suggests (but does not absolutely prove) that intellectual honestly isn’t real high on his list of priorities. This is something you and everyone else should keep in mind when reading through is stuff.\nI haven’t backpedaled at all.  Not once.  If anyone had simply bothered to ask me, “why did you call it Popoli instead of Populi?”, I would have told them.  There was already a bunch of Vox Populi this and Vox Populi that, and since I’d been learning Italian, I simply changed it to Popoli, which happens to be Italian for “peoples”.  “Popolo” would have made a bit more sense, but I thought that made it look like a Papal blog or something to your average person.  I don’t know why, but there’s something inherently silly about too many unadulterated Os.\nAnyhow, it is always dangerous to assume knowledge, or the lack of it, on the part of another.  It is silly to assume that any political commentator would be unaware of the famous phrase, “vox populi, vox dei”, and particularly stupid to do so in the case of one who actually calls himself Vox Day.\n– The reason you don’t see as many of the “critiques with substance” as you might wish is that VD’s intellectual dishonesty, combined with the obnoxious tone and outrageous content of his remarks is more than enough for many people to write him off as a complete loon. People are only guaranteed a fair hearing in a court of law; everywhere else, it’s a privilege that other people may see fit to bestow as they wish… and they usually don’t bestow their time and attention on obnoxious twits like VD.\nExcept, of course, when they do bestow such time and attention, and still can’t be bothered to walk us poor simpletons through the ridiculously easy way they can effortlessly shred my arguments.  Isn’t it amazing, how they always have the time to read and call names, but never enough to make the easy and coherent case they claim they could?  Also, note how this argument begins from the errant assumption that I am intellectually dishonest based on the “evidence” of the blog name.\n– Of course, it’s not at all clear that VD particularly wants to subject his ramblings to “critiques with substance.” Consider\nthe infamous Electrolite thread\nthat, even half a year later, still bothers VD enough for him to bitch about at every opportunity. VD’s remarks were critiqued by men and women with substantive experience in almost every branch of science who stomped all over his column on the “mental pollution of feminism.”\nYes, my distaste for substantive criticism is why there are month-long discussions of WWII, massive line-by-line posts on atheism and the Inquisition, and so forth.  It is very clear, Chris just doesn’t have a clue.  Provide a serious critique, Chris, and I’ll post it here.  Go for it.  You’re not too busy to post of bunch of comments, so you’re not too busy to provide an easy refutation of a recent column or two.\nAs for the Electrolyte uproar, do you seriously think it bothers me?  Do you think that’s why I happily\nprovide links to it\n.  It bothers me so much that I’m planning to run for SFWA president and as part of my campaign I will cite issues raised in it.  Do you truly believe that I am the least bit concerned about what that group of would-be TOR authors think?  They didn’t do any stomping, indeed, many of them embarrassed themselves with their illogic and hypocrisy.\nAnd contrary to what many of the reading-challenged Pandagonians – please excuse the redundancy – appear to have taken away from that Electrolyte forum, I have not been banned from either the SFWA or future Nebula juries.  It would honestly appall many of those who were attacking me there to know that people believe that the SFWA engages in censorship and the suppression of free thought.\nI shall await your substantive critique with some pleasure, Chris.  Write as much as you like, I’ll happily post it here in its entirety.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-18T10:05:00+00:00"
}