{
  "url": "https://voxday.net/2005/10/19/mailvox-equines-and-equalitarians/",
  "scraped_at": "2026-01-08T20:47:26.578915",
  "title": "Mailvox: equines and equalitarians",
  "date_display": "October 19, 2005",
  "date_iso": "2005-10-19T08:48:00+00:00",
  "date_from_url": "2005-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Chris writes, one detects the faint drumming of undead hooves in the distance:</p><blockquote><p>Actually, you mentioned it [the Electrolyte deal] again with regard to a “mailvox” before bringing up anything regarding the Pandagon thread. And you’d do far better to argue that you mentioned it with far less frequency prior to last week… except now you’re apparently running for SFWA president, which doesn’t strike me as the action of a guy who’s over it. (Or perhaps that was a rather poor attempt at humor, in which case you might want to work on that aspect of your writing a bit more.)</p></blockquote><p>In either case, it was a response to someone else bringing it up, Chris.  And if you think my running for the SFWA presidency isn’t funny, well, you wouldn’t seem to know much about that organization’s voting crowd or how they have to scrounge around in order to find people to run for office.  What’s really funny is that there is a remote possibility that the non-voting majority just might be amused enough to pay attention and throw out the busy-bodies who run the show with such elan and incompetence.</p><blockquote><p><em>First, I don’t think they have to be much, much lower. To spend the time required to write a book about a particular subject, one usually has to have an unusually high level of interest in it.</em></p><p>True, but, while “hard” sf novels contain physics (or other types of “hard” science) they are not in and of themselves science. The amount of scientific understanding needed to write hard SF is at the college level, if not lower – Niven was a dropout, for instance. If you’re saying women can’t write hard SF because they can’t “hack” the science, then you’re basically implying that their science ability is much, much lower than that of men.</p></blockquote><p>Although we’ve been using it as a reasonable approximate, a college degree is not the only indicator of inclination or ability.  I would say that Niven is an extraordinary exception, except there is no shortage of college dropouts among the true innovators of science – an subject for another time.  However, I’m not implying that women’s science ability and inclination is much lower than men, I’m outright stating it.  It is becoming increasingly clear that education (or the lack of it) does not account for the differences between the sexes that the equalitarians believed it would; women now receive more college degrees than men and yet do not apply for patents, start technology companies or make scientific discoveries in anywhere near the numbers that one would expect based on the number of women holding relevant degrees.</p><blockquote><p><em>Is the inclination societal or genetic? Well, historically, women have not been in the forefront of technological or scientific exploration in any human society of which I am aware. Given the many vast differences between these societies, this would appear to suggest that the difference is not societal.</em></p><p>Except that virtually all of those societies put women in a position where they didn’t have the opportunity to do hardly anything outside the home. Add in the fact that “technological and scientific exploration” as we know it didn’t actually begin until a few hundred years ago (as a current reader of the Baroque Cycle should be well aware) then virtually the only data point we have to work is Western society. And, as I pointed out numerous times (but, golly, you pretty much completely ignored), the evidence is that when women are allowed to do work beyond the home, they’re able to do work at least on par with men in the vast majority of cases.</p></blockquote><p>What a load of PC tripe!  Women were in a position to do many, many things that they nevertheless didn’t do.  What prevented a literate upper-class Greek or Roman woman from writing a history or a philosophical treatise, or, like Galen, poking about corpses?  The existence of exceptional women like Murasaki Shikibu and Sappho indicates that there were no shortage of women who had the opportunity to contribute to the advancement of human knowledge, but simply didn’t.  The dearth of female achievement in the scientific and artistic worlds today is simply an echo of this historical reality.  As Camille Paglia points out, where are the great female rock guitarists?  Why can’t any major pop singer but Beyonce write her own songs, much less produce her own music, while every two-bit garage band manages to come up with their own stuff, however awful?</p><p>For that matter what percentage of men went to college between the Enlightenment and whatever point you’d like to use as the establishment of the “generally egalitarian” society?  And did those scions of the Eastern establishment actually provide the bulk of scientific advance in America during that time?  Were gays historically repressed, and if so, how were they still able to offer more noteworthy contributions to the advancement of human knowledge despite there being so few of them, relatively speaking?</p><p>Also, stating that men and women work on par in the “vast majority of cases” is an assertion that is not only naked, it is actually less supported by the evidence than my original statement with which you’re taking exception.</p><blockquote><p>A peer-reviewed environment is a necessity for all quantifiable, scientific questions. And given that you’re constantly throwing around anecdotal evidence with regard to this question, I certainly think a more rigorous environment would be welcome. And I think an examination of all possible facts and arguments is a necessity for any rational proposition, including the idea of equal rights. That kind of environment was in place in society as a whole during the past two centuries of the women’s rights movement – society considered the question, and overwhelmingly came to the conclusion that women are equal to men, and should be treated accordingly. But, again, that kind of environment is far from in evidence on your blog.</p></blockquote><p>Now you’re losing it altogether.  WHile I would certainly welcome a more rigorous examination of the question, arguing that equal rights was the result of a rational, peer-reviewed process or even societal consensus is ridiculous.  Society certainly does not believe women are equal to men and our laws and organizational procedures overwhelmingly reflect this.</p><blockquote><p>In that case, your ignorance of Sterling is unfortunate. Sterling’s at least as “hard” as anybody else on your list, in terms of intellectual rigor… but considering that he tends to undermine your assertion as to what “hard sf” is, and the ability of non-scientists to write it, I can see why you’d tend to want to ignore him.</p></blockquote><p>I don’t “want to ignore” him, I’m simply admitting that he doesn’t belong on the hard SF list as defined by the book from which I took the definition.</p><blockquote><p>Here’s the deal, VD: in the “rational debates” you seem so found of, the burden of proof tends to be on the party challenging the conventional wisdom. For example, if I claimed that an alien civilization was hiding from us on the far side of Pluto, and that to save the world we had to commit every resource available to go out there and kill them all, the burden of proof would be on me. Likewise, since you’re arguing something that’s generally abhorrent to most people, and would have vast implications for our generally egalitarian society, an argument that you can’t prove you’re right to any degree of certainty is really all I need.</p></blockquote><p>The idea that women are not completely the same as men in every physical and mental way and that every difference is merely cultural is neither new nor generally abhorrent to most people.  Given the vast amount of evidence that men have genetic advantages with regards to some things and women have genetic advantages with regards to others, the burden of proof still rests with the egalitarians.  The reason that “Math is hard” Barbie upsets your crowd is that most men and women accept my point<br> of view even though it contradicts the official media-anointed worldview.</br></p><p>As for the generally egalitarian society, enjoy it while you can.  As I’ve previously written, its structural weaknesses are such that it will have a shorter shelf life than communism.  I find it more than a little ironic that the forward-thinkers of the SF-writing community have given so little thought to the probable demographic effects of the equalitarian policies they champion.</p></div>",
  "content_text": "As Chris writes, one detects the faint drumming of undead hooves in the distance:\nActually, you mentioned it [the Electrolyte deal] again with regard to a “mailvox” before bringing up anything regarding the Pandagon thread. And you’d do far better to argue that you mentioned it with far less frequency prior to last week… except now you’re apparently running for SFWA president, which doesn’t strike me as the action of a guy who’s over it. (Or perhaps that was a rather poor attempt at humor, in which case you might want to work on that aspect of your writing a bit more.)\nIn either case, it was a response to someone else bringing it up, Chris.  And if you think my running for the SFWA presidency isn’t funny, well, you wouldn’t seem to know much about that organization’s voting crowd or how they have to scrounge around in order to find people to run for office.  What’s really funny is that there is a remote possibility that the non-voting majority just might be amused enough to pay attention and throw out the busy-bodies who run the show with such elan and incompetence.\nFirst, I don’t think they have to be much, much lower. To spend the time required to write a book about a particular subject, one usually has to have an unusually high level of interest in it.\nTrue, but, while “hard” sf novels contain physics (or other types of “hard” science) they are not in and of themselves science. The amount of scientific understanding needed to write hard SF is at the college level, if not lower – Niven was a dropout, for instance. If you’re saying women can’t write hard SF because they can’t “hack” the science, then you’re basically implying that their science ability is much, much lower than that of men.\nAlthough we’ve been using it as a reasonable approximate, a college degree is not the only indicator of inclination or ability.  I would say that Niven is an extraordinary exception, except there is no shortage of college dropouts among the true innovators of science – an subject for another time.  However, I’m not implying that women’s science ability and inclination is much lower than men, I’m outright stating it.  It is becoming increasingly clear that education (or the lack of it) does not account for the differences between the sexes that the equalitarians believed it would; women now receive more college degrees than men and yet do not apply for patents, start technology companies or make scientific discoveries in anywhere near the numbers that one would expect based on the number of women holding relevant degrees.\nIs the inclination societal or genetic? Well, historically, women have not been in the forefront of technological or scientific exploration in any human society of which I am aware. Given the many vast differences between these societies, this would appear to suggest that the difference is not societal.\nExcept that virtually all of those societies put women in a position where they didn’t have the opportunity to do hardly anything outside the home. Add in the fact that “technological and scientific exploration” as we know it didn’t actually begin until a few hundred years ago (as a current reader of the Baroque Cycle should be well aware) then virtually the only data point we have to work is Western society. And, as I pointed out numerous times (but, golly, you pretty much completely ignored), the evidence is that when women are allowed to do work beyond the home, they’re able to do work at least on par with men in the vast majority of cases.\nWhat a load of PC tripe!  Women were in a position to do many, many things that they nevertheless didn’t do.  What prevented a literate upper-class Greek or Roman woman from writing a history or a philosophical treatise, or, like Galen, poking about corpses?  The existence of exceptional women like Murasaki Shikibu and Sappho indicates that there were no shortage of women who had the opportunity to contribute to the advancement of human knowledge, but simply didn’t.  The dearth of female achievement in the scientific and artistic worlds today is simply an echo of this historical reality.  As Camille Paglia points out, where are the great female rock guitarists?  Why can’t any major pop singer but Beyonce write her own songs, much less produce her own music, while every two-bit garage band manages to come up with their own stuff, however awful?\nFor that matter what percentage of men went to college between the Enlightenment and whatever point you’d like to use as the establishment of the “generally egalitarian” society?  And did those scions of the Eastern establishment actually provide the bulk of scientific advance in America during that time?  Were gays historically repressed, and if so, how were they still able to offer more noteworthy contributions to the advancement of human knowledge despite there being so few of them, relatively speaking?\nAlso, stating that men and women work on par in the “vast majority of cases” is an assertion that is not only naked, it is actually less supported by the evidence than my original statement with which you’re taking exception.\nA peer-reviewed environment is a necessity for all quantifiable, scientific questions. And given that you’re constantly throwing around anecdotal evidence with regard to this question, I certainly think a more rigorous environment would be welcome. And I think an examination of all possible facts and arguments is a necessity for any rational proposition, including the idea of equal rights. That kind of environment was in place in society as a whole during the past two centuries of the women’s rights movement – society considered the question, and overwhelmingly came to the conclusion that women are equal to men, and should be treated accordingly. But, again, that kind of environment is far from in evidence on your blog.\nNow you’re losing it altogether.  WHile I would certainly welcome a more rigorous examination of the question, arguing that equal rights was the result of a rational, peer-reviewed process or even societal consensus is ridiculous.  Society certainly does not believe women are equal to men and our laws and organizational procedures overwhelmingly reflect this.\nIn that case, your ignorance of Sterling is unfortunate. Sterling’s at least as “hard” as anybody else on your list, in terms of intellectual rigor… but considering that he tends to undermine your assertion as to what “hard sf” is, and the ability of non-scientists to write it, I can see why you’d tend to want to ignore him.\nI don’t “want to ignore” him, I’m simply admitting that he doesn’t belong on the hard SF list as defined by the book from which I took the definition.\nHere’s the deal, VD: in the “rational debates” you seem so found of, the burden of proof tends to be on the party challenging the conventional wisdom. For example, if I claimed that an alien civilization was hiding from us on the far side of Pluto, and that to save the world we had to commit every resource available to go out there and kill them all, the burden of proof would be on me. Likewise, since you’re arguing something that’s generally abhorrent to most people, and would have vast implications for our generally egalitarian society, an argument that you can’t prove you’re right to any degree of certainty is really all I need.\nThe idea that women are not completely the same as men in every physical and mental way and that every difference is merely cultural is neither new nor generally abhorrent to most people.  Given the vast amount of evidence that men have genetic advantages with regards to some things and women have genetic advantages with regards to others, the burden of proof still rests with the egalitarians.  The reason that “Math is hard” Barbie upsets your crowd is that most men and women accept my point\nof view even though it contradicts the official media-anointed worldview.\nAs for the generally egalitarian society, enjoy it while you can.  As I’ve previously written, its structural weaknesses are such that it will have a shorter shelf life than communism.  I find it more than a little ironic that the forward-thinkers of the SF-writing community have given so little thought to the probable demographic effects of the equalitarian policies they champion.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-19T07:48:00+00:00"
}