{
  "url": "https://voxday.net/2005/10/27/nightmare-scenario/",
  "scraped_at": "2026-01-08T20:48:17.295065",
  "title": "The nightmare scenario",
  "date_display": "October 27, 2005",
  "date_iso": "2005-10-27T16:45:00+00:00",
  "date_from_url": "2005-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ESPN’s Daily Quickie on Sheryl Swoopes:</p><blockquote><p>I’m all for finding true love, but I’m wary of the slippery slope of relationships between coaches and players; part of the Swoopes’ story is that her partner, Alisa Scott, is a former assistant coach with the Comets, the team Swoopes has played for since ’97</p><p>One of the most important underreported stories in sports is the damage that happens in otherwise unethical relationships between college coaches (women OR men) and players.</p></blockquote><p>I can’t imagine giving up on the NFL, but I might have to consider it if Bill Parcells ever comes out of the closet and announces that he is in love with Julius Jones.  (I was going to write Keyshawn Johnson, at first, but then I realized how absurd that sounded.  As if Keyshawn has room for anyone in his life but Keyshawn.)</p><p>UPDATE: And while we’re on the subject of football, I <a href=\"http://sportsillustrated.cnn.com/2005/writers/jimmy_traina/10/27/therant1027/index.html\">can’t help but concur with SI’s The Rant</a>. <em>Michael Vick will never win a Super Bowl. He won’t even win an NFC Championship game.  He’ll keep the Falcons in the postseason for years to come, he’ll keep fans entertained and he’ll give game commentators and football talking heads plenty of chances to wax poetic about his abilities. But Vick can only take the Falcons so far before coming up short, and the reason he’ll fail is simple: He is a terrible passing quarterback.</em></p><p>I’m not so sure about that postseason thing, but I will be truly stunned if Michael Vick ever ends up with a Super Bowl ring.  He’s a HORRIBLE quarterback.  I wouldn’t have thought it possible, but he’s actually worse than Kordell Stewart, aka Slash, aka Mr. INT.</p></div>",
  "content_text": "ESPN’s Daily Quickie on Sheryl Swoopes:\nI’m all for finding true love, but I’m wary of the slippery slope of relationships between coaches and players; part of the Swoopes’ story is that her partner, Alisa Scott, is a former assistant coach with the Comets, the team Swoopes has played for since ’97\nOne of the most important underreported stories in sports is the damage that happens in otherwise unethical relationships between college coaches (women OR men) and players.\nI can’t imagine giving up on the NFL, but I might have to consider it if Bill Parcells ever comes out of the closet and announces that he is in love with Julius Jones.  (I was going to write Keyshawn Johnson, at first, but then I realized how absurd that sounded.  As if Keyshawn has room for anyone in his life but Keyshawn.)\nUPDATE: And while we’re on the subject of football, I\ncan’t help but concur with SI’s The Rant\n.\nMichael Vick will never win a Super Bowl. He won’t even win an NFC Championship game.  He’ll keep the Falcons in the postseason for years to come, he’ll keep fans entertained and he’ll give game commentators and football talking heads plenty of chances to wax poetic about his abilities. But Vick can only take the Falcons so far before coming up short, and the reason he’ll fail is simple: He is a terrible passing quarterback.\nI’m not so sure about that postseason thing, but I will be truly stunned if Michael Vick ever ends up with a Super Bowl ring.  He’s a HORRIBLE quarterback.  I wouldn’t have thought it possible, but he’s actually worse than Kordell Stewart, aka Slash, aka Mr. INT.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-10-27T15:45:00+00:00"
}