{
  "url": "https://voxday.net/2008/03/09/at-least-someone-appreciates-i/",
  "scraped_at": "2026-01-08T22:14:50.210661",
  "title": "At least someone appreciates them",
  "date_display": "March 9, 2008",
  "date_iso": "2008-03-09T15:01:00+00:00",
  "date_from_url": "2008-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The amusing thing about some of the atheist potshots at TIA is the way it shows that they’re <a href=\"http://www.ipandora.net/2008/03/07/a-truly-great-insult/\">afraid to quote the very bits they’re complaining about</a>.  I’ve seen several complaints that I call Christopher Hitchens a drunk, but they never provide the quote because that would demonstrate that it’s not Hitchens’s drinking that is the relevant aspect of the quote, but rather his reliable, verifiable and factual wrongness.</p><blockquote><p>In the The Irrational Atheist, Day employs some truly beautiful insults along with scathing rhetoric and his usual razor-sharp logic, factual analysis, and wit, to disarm, mock, and bludgeon his “Unholy Trinity” of Dawkins, Hitchens, and Dennett, as well as others.  Read <a href=\"http://www.evangelicaloutpost.com/archives/004264.html\">Joe Carter’s 60 second review</a> at the Evangelical Outpost, where he quotes what is quite possibly the best insult I’ve ever heard:</p></blockquote><p>On a totally trivial note, it might interest you to know that TIA is now paired by Amazon with the very book for which Crown Forum rejected it.  I’m pleased with how it all worked out, but I can’t help but wonder if a bigger publisher would have made it more difficult for the Unholy Trinity to maintain the pretense that it doesn’t exist.  Probably not.</p><p>But as I’ve said before, while they can avoid the book, they won’t be able to ignore the arguments it contains much longer.  It’s been interesting to note that while the downloads have continued at about the same rate, the percentage of LIT and PDB downloads have increased in the last week.  To me, that appears to indicate that those outside the blogosphere are beginning to hear about the book.</p></div>",
  "content_text": "The amusing thing about some of the atheist potshots at TIA is the way it shows that they’re\nafraid to quote the very bits they’re complaining about\n.  I’ve seen several complaints that I call Christopher Hitchens a drunk, but they never provide the quote because that would demonstrate that it’s not Hitchens’s drinking that is the relevant aspect of the quote, but rather his reliable, verifiable and factual wrongness.\nIn the The Irrational Atheist, Day employs some truly beautiful insults along with scathing rhetoric and his usual razor-sharp logic, factual analysis, and wit, to disarm, mock, and bludgeon his “Unholy Trinity” of Dawkins, Hitchens, and Dennett, as well as others.  Read\nJoe Carter’s 60 second review\nat the Evangelical Outpost, where he quotes what is quite possibly the best insult I’ve ever heard:\nOn a totally trivial note, it might interest you to know that TIA is now paired by Amazon with the very book for which Crown Forum rejected it.  I’m pleased with how it all worked out, but I can’t help but wonder if a bigger publisher would have made it more difficult for the Unholy Trinity to maintain the pretense that it doesn’t exist.  Probably not.\nBut as I’ve said before, while they can avoid the book, they won’t be able to ignore the arguments it contains much longer.  It’s been interesting to note that while the downloads have continued at about the same rate, the percentage of LIT and PDB downloads have increased in the last week.  To me, that appears to indicate that those outside the blogosphere are beginning to hear about the book.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-09T15:01:00+00:00"
}