{
  "url": "https://voxday.net/2008/03/26/atheist-dance/",
  "scraped_at": "2026-01-08T22:17:05.091477",
  "title": "The atheist dance",
  "date_display": "March 26, 2008",
  "date_iso": "2008-03-26T16:56:00+00:00",
  "date_from_url": "2008-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://corner.nationalreview.com/post/?q=NTVlODVkNjk3YjNkZTgxMzUwMmIxYzU2MTI5YTBiOWI=\">Corner atheists concur</a>.  When godless atheists kill, it can’t possibly be their godlessness that’s to blame in any way.  No matter how often they do it.  No matter how reliably predictive the “atheist in power” model is:</p><blockquote><p>I hit the trifecta — Mark K., John D., and Andrew S. all taking exception to my noting the Godless Red Chinese murdering Tibetans.</p></blockquote><p>And on those occasion that atheist regimes murder specifically “in the name of atheism”, they are, of course, practicing a religion of atheism and are therefore No True Atheists.  I love the way the New Atheists have been routed so thoroughly that atheists such as the Rational Response Squad and John Derbyshire are now openly claiming as atheists those who believe in reincarnation, evil spirits, astrology and a whole host of supernatural concepts.  It’s a beautiful Fighting Withdrawal that abandons both the militant New Atheists and secular scientists with whom they previously identified.</p><p>In any event, Derbyshire gets it wrong.  The <a href=\"http://www.brown.edu/Research/BuddhistTempleArt/buddhism3.html\">Tibetan Buddhists are no atheists</a> by any definition. <i>“And although the original teachings of the Buddha do not mention a creator or other deities, Tibetan Buddhism embraces a vast pantheon of divinities.  These supramundane beings derive from the intersection of many sources and influences, both native and external.</i>“</p><p>Shake it, baby.</p></div>",
  "content_text": "The\nCorner atheists concur\n.  When godless atheists kill, it can’t possibly be their godlessness that’s to blame in any way.  No matter how often they do it.  No matter how reliably predictive the “atheist in power” model is:\nI hit the trifecta — Mark K., John D., and Andrew S. all taking exception to my noting the Godless Red Chinese murdering Tibetans.\nAnd on those occasion that atheist regimes murder specifically “in the name of atheism”, they are, of course, practicing a religion of atheism and are therefore No True Atheists.  I love the way the New Atheists have been routed so thoroughly that atheists such as the Rational Response Squad and John Derbyshire are now openly claiming as atheists those who believe in reincarnation, evil spirits, astrology and a whole host of supernatural concepts.  It’s a beautiful Fighting Withdrawal that abandons both the militant New Atheists and secular scientists with whom they previously identified.\nIn any event, Derbyshire gets it wrong.  The\nTibetan Buddhists are no atheists\nby any definition.\n“And although the original teachings of the Buddha do not mention a creator or other deities, Tibetan Buddhism embraces a vast pantheon of divinities.  These supramundane beings derive from the intersection of many sources and influences, both native and external.\n“\nShake it, baby.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-26T16:56:00+00:00"
}