{
  "url": "https://voxday.net/2008/03/08/bad-astronomy-bad-science/",
  "scraped_at": "2026-01-08T22:14:43.656011",
  "title": "Bad Astronomy, bad science",
  "date_display": "March 8, 2008",
  "date_iso": "2008-03-08T19:00:00+00:00",
  "date_from_url": "2008-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No scientist should even open his mouth about other scientific disciplines, nine times out of ten, he <a href=\"http://www.badastronomy.com/bablog/2008/03/08/ignorance-is-blitz/\">merely discredits the entire profession</a>:</p><blockquote><p>evolutionary biology does in fact explain our concepts of justice, equality, and freedom. Just because you say it doesn’t doesn’t mean it doesn’t. We evolved these concepts as prehistoric humans and the species we evolved from developed into tribal cultures. Those concepts helped ensure our survival, so we adapted to include them in our daily lives.</p></blockquote><p>I’m definitely going to nail an evolutionary biologist to the wall with this one during the next discussion of evolution.  I so love how scientists in one discipline make outrageous, nonsensical claims for other disciplines, which are then completely disavowed by the scientists in that discipline.  Scott Hatfield, I should very much like to know your opinion on the matter….</p><p>Now, do provide the <i>scientific evidence</i> for this evolution of justice, equality and freedom, BA.  What was the mechanism of this “evolution”?  How fast did these concepts evolve, and from what?  At what museum may we view the memetic fossil evidence?  And given the clear empirical evidence that a belief in God is hugely beneficial for the rate of human propagation, aren’t you really offering a proof of God here?</p><p>This is the best part:</p><blockquote><p>It’s clear to me that you don’t really understand anything at all about science, the scientific method, and how successful it is in understanding the world and universe around us.</p></blockquote><p>This is pretty amusing coming from someone who genuinely believes there is scientific evidence for the evolution of abstract concepts.  This is especially ironic when that same someone claims conclusive proof of what he also declares cannot be seen, tasted, heard, touched or sensed in any way.  This is a particularly interesting statement in light of the way in which scientists reliably insist that science is not in the “proof” business at all.</p><p>The idea that science is successful in understanding the world around us is also amusing.  Whether one looks at an individual, a family or a society, the one thing you can absolutely count on to rapidly destroy it is following the advice of the scientists interested in the matter.  Assuming, of course, that the entire planet isn’t destroyed first by a few of the more deadly gifts that scientists have so kindly given humanity.  Thanks, science!</p><p>You may now make your historically ignorant statement attempting to give science credit for that which either predates science, was created by non-scientists, or should more rightly be credited to entrepeneurial activity.</p><p>And FYI, libertarian!=ultraconservative.</p></div>",
  "content_text": "No scientist should even open his mouth about other scientific disciplines, nine times out of ten, he\nmerely discredits the entire profession\n:\nevolutionary biology does in fact explain our concepts of justice, equality, and freedom. Just because you say it doesn’t doesn’t mean it doesn’t. We evolved these concepts as prehistoric humans and the species we evolved from developed into tribal cultures. Those concepts helped ensure our survival, so we adapted to include them in our daily lives.\nI’m definitely going to nail an evolutionary biologist to the wall with this one during the next discussion of evolution.  I so love how scientists in one discipline make outrageous, nonsensical claims for other disciplines, which are then completely disavowed by the scientists in that discipline.  Scott Hatfield, I should very much like to know your opinion on the matter….\nNow, do provide the\nscientific evidence\nfor this evolution of justice, equality and freedom, BA.  What was the mechanism of this “evolution”?  How fast did these concepts evolve, and from what?  At what museum may we view the memetic fossil evidence?  And given the clear empirical evidence that a belief in God is hugely beneficial for the rate of human propagation, aren’t you really offering a proof of God here?\nThis is the best part:\nIt’s clear to me that you don’t really understand anything at all about science, the scientific method, and how successful it is in understanding the world and universe around us.\nThis is pretty amusing coming from someone who genuinely believes there is scientific evidence for the evolution of abstract concepts.  This is especially ironic when that same someone claims conclusive proof of what he also declares cannot be seen, tasted, heard, touched or sensed in any way.  This is a particularly interesting statement in light of the way in which scientists reliably insist that science is not in the “proof” business at all.\nThe idea that science is successful in understanding the world around us is also amusing.  Whether one looks at an individual, a family or a society, the one thing you can absolutely count on to rapidly destroy it is following the advice of the scientists interested in the matter.  Assuming, of course, that the entire planet isn’t destroyed first by a few of the more deadly gifts that scientists have so kindly given humanity.  Thanks, science!\nYou may now make your historically ignorant statement attempting to give science credit for that which either predates science, was created by non-scientists, or should more rightly be credited to entrepeneurial activity.\nAnd FYI, libertarian!=ultraconservative.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-08T19:00:00+00:00"
}