{
  "url": "https://voxday.net/2008/03/16/econ-podcas/",
  "scraped_at": "2026-01-08T22:15:43.858232",
  "title": "Econ podcast",
  "date_display": "March 16, 2008",
  "date_iso": "2008-03-16T10:16:00+00:00",
  "date_from_url": "2008-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How many of you are interested in a weekly economics podcast?  I’m not thinking of anything too formal, just an Econ Guy thing called Voxonomics featuring conversations with various economists and investors from around the world.  I spoke with the White Buffalo – a fellow econ major and the star of the department when we were at university together – and he’s willing to play Johnny to my Sports Guy.  A regular “Are You Worried Yet” segment would certainly seem to be appropriate in light of today’s circumstances….  Other segments might include “Eat My Shorts” with the Mad day-trading Aussie, “Global Money” with the Gnome of Zurich and “Survivalist 101” with Nate.</p><p>In this vein, I spoke with the XAU Xpert, and he explained why the gold price is due for a steep correction soon even if it remains in a long-term bull.  The demand is heavily spec at the moment and the high price is crushing the manufacturers, particularly those outside the USA who supply US markets and get paid in dollars.  The XAU Xpert would have been a great guest, but while we talked about it, unfortunately he can’t do the prospective podcast because his words can literally move the market  If you’re wondering why the metals should do okay, but are unlikely to be a magic investment that flies when all around are crashing, <a href=\"http://www.kitco.com/ind/Akerman/mar122008.html\">Rick Ackerman sums it up very well</a>:</p><blockquote><p>Recognizing that there is no way it can induce consumers to borrow-and-binge once again with the economy slipping into a real estate deflation, the Fed has seized on an extremely risky alternative. By assuming effective ownership of all the bad paper that has clogged the credit markets, the central bank has given the banks the statutory ability to create more loans. But if the demand for loans fails to materialize and now-burgeoning bank reserves go unused, then we are about to see a collapse in money velocity that would be deflationary in the extreme.</p><p>That is what we expect, and it implies there will ultimately be no hyperinflation. However, as long as the threat of one seems real, gold and silver quotes are likely to remain firm. But the threat could vanish quickly if and when the speculative blowoff that has seized commodity markets ends, presumably taking the stock market with it. Even then, precious metals are bound to outperform other classes of investment assets and hold their purchasing power. But it nonetheless remains a possibility that this will come about because their price has fallen less steeply than that of other assets and investables.</p></blockquote></div>",
  "content_text": "How many of you are interested in a weekly economics podcast?  I’m not thinking of anything too formal, just an Econ Guy thing called Voxonomics featuring conversations with various economists and investors from around the world.  I spoke with the White Buffalo – a fellow econ major and the star of the department when we were at university together – and he’s willing to play Johnny to my Sports Guy.  A regular “Are You Worried Yet” segment would certainly seem to be appropriate in light of today’s circumstances….  Other segments might include “Eat My Shorts” with the Mad day-trading Aussie, “Global Money” with the Gnome of Zurich and “Survivalist 101” with Nate.\nIn this vein, I spoke with the XAU Xpert, and he explained why the gold price is due for a steep correction soon even if it remains in a long-term bull.  The demand is heavily spec at the moment and the high price is crushing the manufacturers, particularly those outside the USA who supply US markets and get paid in dollars.  The XAU Xpert would have been a great guest, but while we talked about it, unfortunately he can’t do the prospective podcast because his words can literally move the market  If you’re wondering why the metals should do okay, but are unlikely to be a magic investment that flies when all around are crashing,\nRick Ackerman sums it up very well\n:\nRecognizing that there is no way it can induce consumers to borrow-and-binge once again with the economy slipping into a real estate deflation, the Fed has seized on an extremely risky alternative. By assuming effective ownership of all the bad paper that has clogged the credit markets, the central bank has given the banks the statutory ability to create more loans. But if the demand for loans fails to materialize and now-burgeoning bank reserves go unused, then we are about to see a collapse in money velocity that would be deflationary in the extreme.\nThat is what we expect, and it implies there will ultimately be no hyperinflation. However, as long as the threat of one seems real, gold and silver quotes are likely to remain firm. But the threat could vanish quickly if and when the speculative blowoff that has seized commodity markets ends, presumably taking the stock market with it. Even then, precious metals are bound to outperform other classes of investment assets and hold their purchasing power. But it nonetheless remains a possibility that this will come about because their price has fallen less steeply than that of other assets and investables.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-16T10:16:00+00:00"
}