{
  "url": "https://voxday.net/2008/03/26/emotional-case-for-science/",
  "scraped_at": "2026-01-08T22:17:01.458114",
  "title": "The emotional case for “science”",
  "date_display": "March 26, 2008",
  "date_iso": "2008-03-26T10:56:00+00:00",
  "date_from_url": "2008-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Mad Biologist <a href=\"http://scienceblogs.com/mikethemadbiologist/2008/03/another_fight_about_framing_an.php\">sticks a philosophical gun to his forehead and splatters the room </a>with what previously passed for his brain:</p><blockquote><p>The other thing we evolutionary biologists don’t do enough of, and this stems from the previous point, is make an emotional and moral case for the study of evolution. Last night, I concluded my talk with a quote from Dover, PA creationist school board member William Buckingham, who declared, “Two thousand years ago someone died on a cross. Can’t someone take a stand for him?”</p><p>My response was, “In the last two minutes, someone died from a bacterial infection. We take a stand for him.”</p></blockquote><p>The moral case for evolution?  The EMOTIONAL and MORAL case for evolution?  You can go ahead and write off TENS now, because what was once merely worthy of skepticism is rapidly approaching utter farce.  With defenders like this, one need not even pay any attention to those openly attacking the theory, however credible or crazy they might be.  So much for the claims to be objective science, this is most remniscent of Richard Dawkins’s howlingly ludicrous conclusion of his “unrebuttable” central argument of <i>The God Delusion</i>:</p><p><i>6. We should not give up hope of a better crane arising in physics, something as powerful as Darwinism is for biology. But even in the absence of a strongly satisfying crane to match the biological one, the relatively weak cranes we have at present are, when abetted by the anthropic principle, self-evidently better than the self-defeating skyhook hypothesis of an intelligent designer.</i></p><p>In summary, because Richard Dawkins believes we should not give up hope that something we do not currently know might possibly exist because we have some partial explanations for other things that we do know exist, we must therefore conclude that God does not exist.  This is total logical incompetence on a grand scale, which the Mad Biologist approaches in abandoning all claims to the scientific method in order to make a moral case for the meaningless transition of one form of organic material into another.  He might as reasonably assign color <i>ex nihilo</i> to the fate of the bacterially infected deceased as assign any meaning to it, let alone attempt to build a moral case for a “scientific” theory from it.</p><p>Needless to say, PZ Myers actually thinks both Dawkins’s and the Mad Biologist’s lines of “reason” are brilliant.  It’s simply astonishing.  And by all means, I should very much like to see these clueless fetishists attempt this line of biological evangelism, it should make for extraordinarily amusing blogfodder.</p></div>",
  "content_text": "A Mad Biologist\nsticks a philosophical gun to his forehead and splatters the room\nwith what previously passed for his brain:\nThe other thing we evolutionary biologists don’t do enough of, and this stems from the previous point, is make an emotional and moral case for the study of evolution. Last night, I concluded my talk with a quote from Dover, PA creationist school board member William Buckingham, who declared, “Two thousand years ago someone died on a cross. Can’t someone take a stand for him?”\nMy response was, “In the last two minutes, someone died from a bacterial infection. We take a stand for him.”\nThe moral case for evolution?  The EMOTIONAL and MORAL case for evolution?  You can go ahead and write off TENS now, because what was once merely worthy of skepticism is rapidly approaching utter farce.  With defenders like this, one need not even pay any attention to those openly attacking the theory, however credible or crazy they might be.  So much for the claims to be objective science, this is most remniscent of Richard Dawkins’s howlingly ludicrous conclusion of his “unrebuttable” central argument of\nThe God Delusion\n:\n6. We should not give up hope of a better crane arising in physics, something as powerful as Darwinism is for biology. But even in the absence of a strongly satisfying crane to match the biological one, the relatively weak cranes we have at present are, when abetted by the anthropic principle, self-evidently better than the self-defeating skyhook hypothesis of an intelligent designer.\nIn summary, because Richard Dawkins believes we should not give up hope that something we do not currently know might possibly exist because we have some partial explanations for other things that we do know exist, we must therefore conclude that God does not exist.  This is total logical incompetence on a grand scale, which the Mad Biologist approaches in abandoning all claims to the scientific method in order to make a moral case for the meaningless transition of one form of organic material into another.  He might as reasonably assign color\nex nihilo\nto the fate of the bacterially infected deceased as assign any meaning to it, let alone attempt to build a moral case for a “scientific” theory from it.\nNeedless to say, PZ Myers actually thinks both Dawkins’s and the Mad Biologist’s lines of “reason” are brilliant.  It’s simply astonishing.  And by all means, I should very much like to see these clueless fetishists attempt this line of biological evangelism, it should make for extraordinarily amusing blogfodder.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-26T10:56:00+00:00"
}