{
  "url": "https://voxday.net/2008/03/22/enlightenment-and-liberty/",
  "scraped_at": "2026-01-08T22:16:31.656714",
  "title": "Enlightenment and liberty",
  "date_display": "March 22, 2008",
  "date_iso": "2008-03-22T09:00:00+00:00",
  "date_from_url": "2008-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like most Americans, Scott Hatfield doesn’t understand what the Enlightenment represents.  Nor does he understand how completely I reject it:</p><blockquote><p>Again, you’ve boxed yourself into a corner because of your rhetoric. The hyperbole about the Enlightenment era as a whole was not needed to make the point that absolute secularization has born some bitter fruit, but you just had to have your broad-brushed flourish. I guess that’s the Vox Style.  Oh, well, dead horse. You haven’t addressed the central point that good things came out of the Enlightenment (such as the Bill of Rights). If I’m wrong, please show me where the First Amendment can be derived purely from Christian theology as widely accepted prior to 1800.</p></blockquote><p>The Bill of Rights and the First Amendment are absolutely not products of the Enlightenment.  First, for Scott’s edification, I point out that the Enlightenment is a fundamentally authoritarian movement:</p><p><i>The first major Enlightenment figure in England was Thomas Hobbes, who caused great controversy with the release of his provocative treatise Leviathan (1651). Taking a sociological perspective, Hobbes felt that by nature, people were self-serving and preoccupied with the gathering of a limited number of resources. To keep balance, Hobbes continued, it was essential to have a single intimidating ruler. A half century later, John Locke came into the picture, promoting the opposite type of government—a representative government—in his Two Treatises of Government (1690).  Although Hobbes would be more influential among his contemporaries, it was clear that Locke’s message was closer to the English people’s hearts and minds. Just before the turn of the century, in 1688, English Protestants helped overthrow the Catholic king James II and installed the Protestant monarchs William and Mary. In the aftermath of this Glorious Revolution, the English government ratified <a href=\"http://www.constitution.org/eng/eng_bor.htm\">a new Bill of Rights</a> that granted more personal freedoms.</i></p><p>In other words, PRIOR to the publication of Locke’s work and long before 1800, the English Protestants established a Bill of Rights that explicitly rejects the Enlightenment concepts of Hobbes and most of the French philosophes who came along later.  There was little new about the American Bill of Rights, it was mostly an explicit extension of its English predecessor, which includes freedoms of speech and religion, from Parliament to the individual.  Even the original Bill of Rights built upon the concepts of the Magna Carta Libertatum of 1215 and Henry I’s Charter of Liberties of 1100.  When viewed from a historical perspective, it is obvious that democracy, divided government and guaranteed rights cannot reasonably be considered Enlightenment concepts, as all three predated the Enlightenment by centuries.  Indeed, the distinguishing factors of the American and French Revolutions were that while the former was a) Christian and b) skeptical of government power, while the latter was a) anti-clerical and b) trusting in government power.  One has merely to examine the broad limitations on the “human rights” of a genuinely Enlightenment-based government, such as the First French Republic, the European Union, or the United Nations, to understand that the concept of unalienable individual rights endowed by a Creator is not only foreign to the Enlightenment, it is downright antithetical to it.</p><p>In summary, the Bill of Rights did not come out of the Enlightenment, it was the result of combining the medieval tradition of the English Common Law with 18th century American Christianity.  This latter influence is overt, because it was from their shared Christian tradition that the American revolutionaries derived the concept of God and God-granted rights as being superior to government, whereas the Enlightenment tradition does not recognize God and therefore accepts no supra-governmental limitations; all Enlightenment rights are expressly granted by government and can be freely abrogated by it at will.  I recommend that Scott examine Article 29 of the Universal Declaration of Human Rights and Articles 17 and 18 of the European Convention on Human Rights.</p><p>French Foreign Minister Bernard Kouchner may have best summed up the primary challenge of a post-Christian Europe.  “I knew what was the West, and I don’t know what the West is now.”</p></div>",
  "content_text": "Like most Americans, Scott Hatfield doesn’t understand what the Enlightenment represents.  Nor does he understand how completely I reject it:\nAgain, you’ve boxed yourself into a corner because of your rhetoric. The hyperbole about the Enlightenment era as a whole was not needed to make the point that absolute secularization has born some bitter fruit, but you just had to have your broad-brushed flourish. I guess that’s the Vox Style.  Oh, well, dead horse. You haven’t addressed the central point that good things came out of the Enlightenment (such as the Bill of Rights). If I’m wrong, please show me where the First Amendment can be derived purely from Christian theology as widely accepted prior to 1800.\nThe Bill of Rights and the First Amendment are absolutely not products of the Enlightenment.  First, for Scott’s edification, I point out that the Enlightenment is a fundamentally authoritarian movement:\nThe first major Enlightenment figure in England was Thomas Hobbes, who caused great controversy with the release of his provocative treatise Leviathan (1651). Taking a sociological perspective, Hobbes felt that by nature, people were self-serving and preoccupied with the gathering of a limited number of resources. To keep balance, Hobbes continued, it was essential to have a single intimidating ruler. A half century later, John Locke came into the picture, promoting the opposite type of government—a representative government—in his Two Treatises of Government (1690).  Although Hobbes would be more influential among his contemporaries, it was clear that Locke’s message was closer to the English people’s hearts and minds. Just before the turn of the century, in 1688, English Protestants helped overthrow the Catholic king James II and installed the Protestant monarchs William and Mary. In the aftermath of this Glorious Revolution, the English government ratified\na new Bill of Rights\nthat granted more personal freedoms.\nIn other words, PRIOR to the publication of Locke’s work and long before 1800, the English Protestants established a Bill of Rights that explicitly rejects the Enlightenment concepts of Hobbes and most of the French philosophes who came along later.  There was little new about the American Bill of Rights, it was mostly an explicit extension of its English predecessor, which includes freedoms of speech and religion, from Parliament to the individual.  Even the original Bill of Rights built upon the concepts of the Magna Carta Libertatum of 1215 and Henry I’s Charter of Liberties of 1100.  When viewed from a historical perspective, it is obvious that democracy, divided government and guaranteed rights cannot reasonably be considered Enlightenment concepts, as all three predated the Enlightenment by centuries.  Indeed, the distinguishing factors of the American and French Revolutions were that while the former was a) Christian and b) skeptical of government power, while the latter was a) anti-clerical and b) trusting in government power.  One has merely to examine the broad limitations on the “human rights” of a genuinely Enlightenment-based government, such as the First French Republic, the European Union, or the United Nations, to understand that the concept of unalienable individual rights endowed by a Creator is not only foreign to the Enlightenment, it is downright antithetical to it.\nIn summary, the Bill of Rights did not come out of the Enlightenment, it was the result of combining the medieval tradition of the English Common Law with 18th century American Christianity.  This latter influence is overt, because it was from their shared Christian tradition that the American revolutionaries derived the concept of God and God-granted rights as being superior to government, whereas the Enlightenment tradition does not recognize God and therefore accepts no supra-governmental limitations; all Enlightenment rights are expressly granted by government and can be freely abrogated by it at will.  I recommend that Scott examine Article 29 of the Universal Declaration of Human Rights and Articles 17 and 18 of the European Convention on Human Rights.\nFrench Foreign Minister Bernard Kouchner may have best summed up the primary challenge of a post-Christian Europe.  “I knew what was the West, and I don’t know what the West is now.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-22T09:00:00+00:00"
}