{
  "url": "https://voxday.net/2008/03/20/fed-and-depression/",
  "scraped_at": "2026-01-08T22:16:20.518805",
  "title": "The Fed and the Depression",
  "date_display": "March 20, 2008",
  "date_iso": "2008-03-20T18:47:00+00:00",
  "date_from_url": "2008-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ben Bernanke <a href=\"http://worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=59405\">defies the common Keynesian position</a>:</p><blockquote><p>It was in large part to improve the management of banking panics that the Federal Reserve was created in 1913. However, as Friedman and Schwartz discuss in some detail, in the early 1930s the Federal Reserve did not serve that function. The problem within the Fed was largely doctrinal: Fed officials appeared to subscribe to Treasury Secretary Andrew Mellon’s infamous ‘liquidationist’ thesis, that weeding out “weak” banks was a harsh but necessary prerequisite to the recovery of the banking system. Moreover, most of the failing banks were small banks (as opposed to what we would now call money-center banks) and not members of the Federal Reserve System. Thus the Fed saw no particular need to try to stem the panics. At the same time, the large banks – which would have intervened before the founding of the Fed – felt that protecting their smaller brethren was no longer their responsibility. Indeed, since the large banks felt confident that the Fed would protect them if necessary, the weeding out of small competitors was a positive good, from their point of view.  In short, according to Friedman and Schwartz, because of institutional changes and misguided doctrines, the banking panics of the Great Contraction were much more severe and widespread than would have normally occurred during a downturn. …</p><p>Let me end my talk by abusing slightly my status as an official representative of the Federal Reserve. I would like to say to Milton and Anna: Regarding the Great Depression. You’re right, we did it. We’re very sorry. But thanks to you, we won’t do it again.</p></blockquote><p>This jocular statement has never gotten the widespread attention it deserves, even if the current Fed Chairman errantly attributes this demonstration of Fed responsibility to the famous monetarist when it was actually the Austrian economist Murray Rothbard who first made the conclusive case in his 1963 book <i>America’s Great Depression</i>.  It’s interesting, however, to see how Bernanke is, despite his promise, following the same general model that his predecessors did.  I’ll have more detailed analysis of this in a future Voxonomics to see just how closely the Fed is imitating history, but needless to say, this doesn’t bode terribly well for the future.</p><p>I have to say, I’m really impressed with this timely step by WorldNetDaily, even though I knew nothing about it.  If I understand my principles of socionomics, this is a definite bear sign as a broadening interest in technical analysis usually indicates volatility and a down market.</p></div>",
  "content_text": "Ben Bernanke\ndefies the common Keynesian position\n:\nIt was in large part to improve the management of banking panics that the Federal Reserve was created in 1913. However, as Friedman and Schwartz discuss in some detail, in the early 1930s the Federal Reserve did not serve that function. The problem within the Fed was largely doctrinal: Fed officials appeared to subscribe to Treasury Secretary Andrew Mellon’s infamous ‘liquidationist’ thesis, that weeding out “weak” banks was a harsh but necessary prerequisite to the recovery of the banking system. Moreover, most of the failing banks were small banks (as opposed to what we would now call money-center banks) and not members of the Federal Reserve System. Thus the Fed saw no particular need to try to stem the panics. At the same time, the large banks – which would have intervened before the founding of the Fed – felt that protecting their smaller brethren was no longer their responsibility. Indeed, since the large banks felt confident that the Fed would protect them if necessary, the weeding out of small competitors was a positive good, from their point of view.  In short, according to Friedman and Schwartz, because of institutional changes and misguided doctrines, the banking panics of the Great Contraction were much more severe and widespread than would have normally occurred during a downturn. …\nLet me end my talk by abusing slightly my status as an official representative of the Federal Reserve. I would like to say to Milton and Anna: Regarding the Great Depression. You’re right, we did it. We’re very sorry. But thanks to you, we won’t do it again.\nThis jocular statement has never gotten the widespread attention it deserves, even if the current Fed Chairman errantly attributes this demonstration of Fed responsibility to the famous monetarist when it was actually the Austrian economist Murray Rothbard who first made the conclusive case in his 1963 book\nAmerica’s Great Depression\n.  It’s interesting, however, to see how Bernanke is, despite his promise, following the same general model that his predecessors did.  I’ll have more detailed analysis of this in a future Voxonomics to see just how closely the Fed is imitating history, but needless to say, this doesn’t bode terribly well for the future.\nI have to say, I’m really impressed with this timely step by WorldNetDaily, even though I knew nothing about it.  If I understand my principles of socionomics, this is a definite bear sign as a broadening interest in technical analysis usually indicates volatility and a down market.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-20T18:47:00+00:00"
}