{
  "url": "https://voxday.net/2008/03/04/fiction-as-non-fiction/",
  "scraped_at": "2026-01-08T22:14:17.332042",
  "title": "Fiction as non-fiction",
  "date_display": "March 4, 2008",
  "date_iso": "2008-03-04T09:47:00+00:00",
  "date_from_url": "2008-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nytimes.com/2008/03/04/books/04fake.html?_r=1&amp;hp&amp;oref=slogin\">The latest publishing scandal</a> is hardly a surprise.  I’d bet that the majority of the non-fiction personal triumph tearjerkers out there are substantially fictional:</p><blockquote><p>In “Love and Consequences,” a critically acclaimed memoir published last week, Margaret B. Jones wrote about her life as a half-white, half-Native American girl growing up in South-Central Los Angeles as a foster child among gang-bangers, running drugs for the Bloods.  The problem is that none of it is true.</p><p>Margaret B. Jones is a pseudonym for Margaret Seltzer, who is all white and grew up in the well-to-do Sherman Oaks section of Los Angeles, in the San Fernando Valley, with her biological family. She graduated from the Campbell Hall School, a private Episcopal day school in the North Hollywood neighborhood. She has never lived with a foster family, nor did she run drugs for any gang members. Nor did she graduate from the University of Oregon, as she had claimed….</p><p>The revelations of Ms. Seltzer’s mendacity came in the wake of the news last week that a Holocaust memoir, “Misha: A Mémoire of the Holocaust Years” by Misha Defonseca, was a fake, and perhaps more notoriously, two years ago James Frey, the author of a best-selling memoir, “A Million Little Pieces,” admitted that he had made up or exaggerated details in his account of his drug addiction and recovery.</p></blockquote><p>One would think that the first sign that a chubby, literate white girl claiming that she had run drugs for the Bloods was telling tale tales would be <i>it’s a chubby white girl claiming to have run drugs for the Bloods!</i> In addition to the completely obvious, such as the names “Terrell” (Owens) and “Taye” (Diggs) for her non-existent black foster brothers and the aforementioned fact of the author’s chubby white girlness, it’s worth noting that there is no gang per se called “Bloods”, it’s a broad criminal affiliation to which many location-based gangs belong, not that the chick lit editor who was listening to Ms Seltzer’s melodramatic stories with her heart in her mouth would have known that.</p><p>This sort of thing was old when it was Vanilla Ice and Rigoberta Menchu doing it more than a decade ago; I’d guess that most of the successful black gangster rappers are the college-educated sons of doctors and lawyers.  This happens because most people like fantasy, but many of them don’t like to admit it.</p></div>",
  "content_text": "The latest publishing scandal\nis hardly a surprise.  I’d bet that the majority of the non-fiction personal triumph tearjerkers out there are substantially fictional:\nIn “Love and Consequences,” a critically acclaimed memoir published last week, Margaret B. Jones wrote about her life as a half-white, half-Native American girl growing up in South-Central Los Angeles as a foster child among gang-bangers, running drugs for the Bloods.  The problem is that none of it is true.\nMargaret B. Jones is a pseudonym for Margaret Seltzer, who is all white and grew up in the well-to-do Sherman Oaks section of Los Angeles, in the San Fernando Valley, with her biological family. She graduated from the Campbell Hall School, a private Episcopal day school in the North Hollywood neighborhood. She has never lived with a foster family, nor did she run drugs for any gang members. Nor did she graduate from the University of Oregon, as she had claimed….\nThe revelations of Ms. Seltzer’s mendacity came in the wake of the news last week that a Holocaust memoir, “Misha: A Mémoire of the Holocaust Years” by Misha Defonseca, was a fake, and perhaps more notoriously, two years ago James Frey, the author of a best-selling memoir, “A Million Little Pieces,” admitted that he had made up or exaggerated details in his account of his drug addiction and recovery.\nOne would think that the first sign that a chubby, literate white girl claiming that she had run drugs for the Bloods was telling tale tales would be\nit’s a chubby white girl claiming to have run drugs for the Bloods!\nIn addition to the completely obvious, such as the names “Terrell” (Owens) and “Taye” (Diggs) for her non-existent black foster brothers and the aforementioned fact of the author’s chubby white girlness, it’s worth noting that there is no gang per se called “Bloods”, it’s a broad criminal affiliation to which many location-based gangs belong, not that the chick lit editor who was listening to Ms Seltzer’s melodramatic stories with her heart in her mouth would have known that.\nThis sort of thing was old when it was Vanilla Ice and Rigoberta Menchu doing it more than a decade ago; I’d guess that most of the successful black gangster rappers are the college-educated sons of doctors and lawyers.  This happens because most people like fantasy, but many of them don’t like to admit it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-04T09:47:00+00:00"
}