{
  "url": "https://voxday.net/2008/03/14/good-advice/",
  "scraped_at": "2026-01-08T22:15:34.691553",
  "title": "Good advice",
  "date_display": "March 14, 2008",
  "date_iso": "2008-03-14T10:55:00+00:00",
  "date_from_url": "2008-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cassy Fiano encourages women to <a href=\"http://wizbangblog.com/content/2008/03/11/michelle-obama-men-are-selfish-incompetent-and-a-mess.php\">stop stabbing their men in the back</a>:</p><blockquote><p>And this “harmless” disparagement of husbands among wives is not harmless either, ladies. It may seem like it’s just fun and games to put down your husband when you’re gossiping with your girlfriends, but it isn’t. Would you say that kind of stuff to his face? Would you tell your husband that he can’t take care of himself if his life depended on it, that he’s selfish and doesn’t pay enough attention to his family? If you wouldn’t, then don’t go around laughing about it with your girlfriends without a second thought.</p></blockquote><p>I can’t speak for what goes on when the girls are gabbing, but this sort of thing in mixed company irritates me to no end.  I especially despise those women who try to hide behind the passive-aggressive “I’m just joking” game.  As Spacebunny says, this sort of behavior reflects badly on the man.  But it reflects even worse on the woman.  And it’s certainly inspired some piling on <a href=\"http://www.blogger.com/comment.g?blogID=3210540&amp;postID=6905141697224539503&amp;isPopup=true\">at Dr. Helen’s place</a>.</p></div>",
  "content_text": "Cassy Fiano encourages women to\nstop stabbing their men in the back\n:\nAnd this “harmless” disparagement of husbands among wives is not harmless either, ladies. It may seem like it’s just fun and games to put down your husband when you’re gossiping with your girlfriends, but it isn’t. Would you say that kind of stuff to his face? Would you tell your husband that he can’t take care of himself if his life depended on it, that he’s selfish and doesn’t pay enough attention to his family? If you wouldn’t, then don’t go around laughing about it with your girlfriends without a second thought.\nI can’t speak for what goes on when the girls are gabbing, but this sort of thing in mixed company irritates me to no end.  I especially despise those women who try to hide behind the passive-aggressive “I’m just joking” game.  As Spacebunny says, this sort of behavior reflects badly on the man.  But it reflects even worse on the woman.  And it’s certainly inspired some piling on\nat Dr. Helen’s place\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-14T10:55:00+00:00"
}