{
  "url": "https://voxday.net/2008/03/28/in-defense-of-irratheis/",
  "scraped_at": "2026-01-08T22:17:20.154314",
  "title": "In defense of Irratheism",
  "date_display": "March 28, 2008",
  "date_iso": "2008-03-28T16:00:00+00:00",
  "date_from_url": "2008-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which the inestimable John Derbyshire and I engage in a frank exchange of views following his assertion that the Tibetan Buddhists are atheists.  And, of course, I have Derb’s permission to post these emails:</p><blockquote><p><b>Not so fast, my friend: <i>“And although the original teachings of the Buddha do not mention a creator or other deities, <a href=\"http://www.brown.edu/Research/BuddhistTempleArt/buddhism3.html\">Tibetan Buddhism embraces a vast pantheon of divinities</a>.  These supramundane beings derive from the intersection of many sources and influences, both native and external.”</i></b></p><p>Sorry, but I don’t think these entities rise to the level of gods.  They are more in the East Asian tradition of (in Chinese) “shen” and “gui” — i.e. benevolent and malign spirits.  “Angels” and “demons”are really the way we express these notions in Indo-European languages.  (Although R.H. Mathews’ very dependable “Chinese-English Dictionary” (1931) defines “shen” as:  “A spirit; a god.  Spiritual, inscrutable, divine, supernatural.  The soul.”  But even that illustrated the point that there isn’t a good one-one match of concepts here.)</p><p><b>Sure.  But in the Christian… shall we say, “mythology”… fallen angels ARE pagan gods.  Recall how Jehovah stands in the “assembly of the gods”, and you surely know that neither Jehovah nor Jesus Christ are considered “the god of this age” by Christians.  It appears you’re subscribing here to an atheistically irrelevant Christian division between God and god.  This looks rather like a Fighting Withdrawal, in which you’re abandoning nine-tenths of your atheist/scientific creed in a mistaken attempt to protect a very narrow definition of atheism, as well as every claim to objective scientific superiority that atheism ever had.  I understand the train of thought, of course, but I think you’ll find that you’re fatally boxing yourself in here in an attempt to preserve a Christian-Atheist dialectic.</b></p><p>I don’t see that.  An atheist, in my understanding (and Messrs Merriam and Webster’s), is a person who denies that there is a God.  You can deny that there is a God and yet believe in a whole ontinuum of supernatural critters, from everyday (-night?) ghosts up to the angels.  You seem to be using “atheist” to mean “a person who denies the supernatural.”  That would be a “naturalist,” or colloquially a “materialist.”</p><p>An atheist denies God.  He does not necessarily deny leprechauns.</p><p>As to the “scientific superiority of atheism,” I have no idea what it means, and would therefore not claim it, not ever have.</p><p><b>Very well, I cheerfully retract the scientific superiority bit, since upon reflection, I don’t recall you ever making any such general claim and I’ve read most of your work over the last 10 years. However, yours seems to be a very Christian atheism, as the <i>“a-theos”</i> is a Greek concept which refers to the very sort of non-God pagan gods in which the Tibetans believe. </b></p><p>Well, duh it’s a Christian atheism.  I was raised a Christian, know my Bible better than most Christians I meet, can instantly find my page in the prayer book, and can sing around 100 hymns from memory.  (Which is 99 more than the average American Christian.)  What OTHER kind of atheist would I be?</p><p>(Old Irish joke:  an Ulsterman being interrogated by terrorist gunmen pleads: “I’m an atheist!”  They snarl back: “All right — but are ye a Catholic atheist or a Protestant atheist?”)</p><p>The modern atheism we all discuss is a denial of the Abrahamic (Jewish/Christian/Moslem) mono-deity.  That’s the common usage.  It need not involve a denial of the supernatural.  As I said, if you tell me you are an atheist, but believe in ghosts, or leprechauns, or spirit messages via an ouija board, I see no contradiction.  I’d extend that to the Tibetan gods, though I’ll agree this is nit-pickable.</p><p>The primitive types of religion — animism and shamanism — are, to my way of thinking, just beneath modern theism-atheism discussions, having really no intellectual content.  The world (animists and shamanists tell us) is populated by invisible spirits — benign (the “shen”) and malign (the “gui”).  To dignify this as “theism,” or its negation as “atheism,” is like making mumblety-peg an Olympic sport; or like calling Intelligent Design a scientific theory.  I’ll allow that Lamaism is a step above that, having intellectual Buddhism pasted on to the aboriginal Tibetan religion (a shamanist/animist concoction called “Bon,” if memory serves).  Since intellectual Buddhism is atheist, though, in the broader sense — no God, no gods — my refusal to dignify the primitive beliefs as theism is unaffected.</p><p>And contrariwise, the modern style of atheism need not involve a denial of the supernatural.  The grandaddy of modern atheism, Bertrand Russell, had a strong mystical streak, as a perusal of his autobiography will easily confirm.  (Sam Harris shows the same tendencies.)  We are very small and ignorant, the universe is very big and strange, and any reflective person keeps an open mind as to what is out there in the darkness beyond our little campfire’s glow.</p><p>That it is all explained in texts written by Bronze Age goatherds living in caves, though, seems pretty improbable to your modern atheist.  That the Pope, the Archbishop of Canterbury, the Grand Mufti of Jerusalem, the Chief Rabbi, or the Akond of Swat, have anything true to tell me about the world or my place in it, I am unpersuaded. That they have fundamental disagreements with each other about the “unassailable truths” of which they claim custody, doesn’t help a bit.  If I go to study astronomy, biology, or chemistry in Athens, Benares, or Cairo, I shall learn the same things in the three different places. Students of theology in those places will learn three utterly different things.  Truth, it seems to me, ought to be indivisible, not dependent on accidents of geography.</p><p><b>I think your response is most common-sensical, if not necessarily one I’d wish to defend from an abstract intellectual perspective.  Which is fine, as you point out, you’re not claiming otherwise and certainly I wouldn’t attempt to claim that my Christian beliefs are either purely rational or derived from reason.  Reason has its place, but it is demonstrably a poor foundation for ordering a society of mostly irrational beings, be they evolved <i>ex nihilo</i> or created <i>Imago Dei</i>.</b></p></blockquote><p>There are some interesting points here.  I shall delve into them later when I have more time.  The important thing to grasp is that living one’s life by beliefs that are irrational by abstract intellectual standards is not indefensible nor indicative of a sub-par intellect.  Quite to the contrary, doing so is entirely normal human behavior, regardless of what those beliefs happen to be.</p></div>",
  "content_text": "In which the inestimable John Derbyshire and I engage in a frank exchange of views following his assertion that the Tibetan Buddhists are atheists.  And, of course, I have Derb’s permission to post these emails:\nNot so fast, my friend:\n“And although the original teachings of the Buddha do not mention a creator or other deities,\nTibetan Buddhism embraces a vast pantheon of divinities\n.  These supramundane beings derive from the intersection of many sources and influences, both native and external.”\nSorry, but I don’t think these entities rise to the level of gods.  They are more in the East Asian tradition of (in Chinese) “shen” and “gui” — i.e. benevolent and malign spirits.  “Angels” and “demons”are really the way we express these notions in Indo-European languages.  (Although R.H. Mathews’ very dependable “Chinese-English Dictionary” (1931) defines “shen” as:  “A spirit; a god.  Spiritual, inscrutable, divine, supernatural.  The soul.”  But even that illustrated the point that there isn’t a good one-one match of concepts here.)\nSure.  But in the Christian… shall we say, “mythology”… fallen angels ARE pagan gods.  Recall how Jehovah stands in the “assembly of the gods”, and you surely know that neither Jehovah nor Jesus Christ are considered “the god of this age” by Christians.  It appears you’re subscribing here to an atheistically irrelevant Christian division between God and god.  This looks rather like a Fighting Withdrawal, in which you’re abandoning nine-tenths of your atheist/scientific creed in a mistaken attempt to protect a very narrow definition of atheism, as well as every claim to objective scientific superiority that atheism ever had.  I understand the train of thought, of course, but I think you’ll find that you’re fatally boxing yourself in here in an attempt to preserve a Christian-Atheist dialectic.\nI don’t see that.  An atheist, in my understanding (and Messrs Merriam and Webster’s), is a person who denies that there is a God.  You can deny that there is a God and yet believe in a whole ontinuum of supernatural critters, from everyday (-night?) ghosts up to the angels.  You seem to be using “atheist” to mean “a person who denies the supernatural.”  That would be a “naturalist,” or colloquially a “materialist.”\nAn atheist denies God.  He does not necessarily deny leprechauns.\nAs to the “scientific superiority of atheism,” I have no idea what it means, and would therefore not claim it, not ever have.\nVery well, I cheerfully retract the scientific superiority bit, since upon reflection, I don’t recall you ever making any such general claim and I’ve read most of your work over the last 10 years. However, yours seems to be a very Christian atheism, as the\n“a-theos”\nis a Greek concept which refers to the very sort of non-God pagan gods in which the Tibetans believe.\nWell, duh it’s a Christian atheism.  I was raised a Christian, know my Bible better than most Christians I meet, can instantly find my page in the prayer book, and can sing around 100 hymns from memory.  (Which is 99 more than the average American Christian.)  What OTHER kind of atheist would I be?\n(Old Irish joke:  an Ulsterman being interrogated by terrorist gunmen pleads: “I’m an atheist!”  They snarl back: “All right — but are ye a Catholic atheist or a Protestant atheist?”)\nThe modern atheism we all discuss is a denial of the Abrahamic (Jewish/Christian/Moslem) mono-deity.  That’s the common usage.  It need not involve a denial of the supernatural.  As I said, if you tell me you are an atheist, but believe in ghosts, or leprechauns, or spirit messages via an ouija board, I see no contradiction.  I’d extend that to the Tibetan gods, though I’ll agree this is nit-pickable.\nThe primitive types of religion — animism and shamanism — are, to my way of thinking, just beneath modern theism-atheism discussions, having really no intellectual content.  The world (animists and shamanists tell us) is populated by invisible spirits — benign (the “shen”) and malign (the “gui”).  To dignify this as “theism,” or its negation as “atheism,” is like making mumblety-peg an Olympic sport; or like calling Intelligent Design a scientific theory.  I’ll allow that Lamaism is a step above that, having intellectual Buddhism pasted on to the aboriginal Tibetan religion (a shamanist/animist concoction called “Bon,” if memory serves).  Since intellectual Buddhism is atheist, though, in the broader sense — no God, no gods — my refusal to dignify the primitive beliefs as theism is unaffected.\nAnd contrariwise, the modern style of atheism need not involve a denial of the supernatural.  The grandaddy of modern atheism, Bertrand Russell, had a strong mystical streak, as a perusal of his autobiography will easily confirm.  (Sam Harris shows the same tendencies.)  We are very small and ignorant, the universe is very big and strange, and any reflective person keeps an open mind as to what is out there in the darkness beyond our little campfire’s glow.\nThat it is all explained in texts written by Bronze Age goatherds living in caves, though, seems pretty improbable to your modern atheist.  That the Pope, the Archbishop of Canterbury, the Grand Mufti of Jerusalem, the Chief Rabbi, or the Akond of Swat, have anything true to tell me about the world or my place in it, I am unpersuaded. That they have fundamental disagreements with each other about the “unassailable truths” of which they claim custody, doesn’t help a bit.  If I go to study astronomy, biology, or chemistry in Athens, Benares, or Cairo, I shall learn the same things in the three different places. Students of theology in those places will learn three utterly different things.  Truth, it seems to me, ought to be indivisible, not dependent on accidents of geography.\nI think your response is most common-sensical, if not necessarily one I’d wish to defend from an abstract intellectual perspective.  Which is fine, as you point out, you’re not claiming otherwise and certainly I wouldn’t attempt to claim that my Christian beliefs are either purely rational or derived from reason.  Reason has its place, but it is demonstrably a poor foundation for ordering a society of mostly irrational beings, be they evolved\nex nihilo\nor created\nImago Dei\n.\nThere are some interesting points here.  I shall delve into them later when I have more time.  The important thing to grasp is that living one’s life by beliefs that are irrational by abstract intellectual standards is not indefensible nor indicative of a sub-par intellect.  Quite to the contrary, doing so is entirely normal human behavior, regardless of what those beliefs happen to be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-28T16:00:00+00:00"
}