{
  "url": "https://voxday.net/2008/03/17/irish-problem-with-euro/",
  "scraped_at": "2026-01-08T22:15:53.097597",
  "title": "The Irish problem with the Euro",
  "date_display": "March 17, 2008",
  "date_iso": "2008-03-17T12:10:00+00:00",
  "date_from_url": "2008-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AE-P’s report helps explain why <a href=\"http://www.telegraph.co.uk/money/main.jhtml?xml=/money/2008/03/11/cnirish111.xml\">the euro and the EU may not survive the Fimbulwinter</a>, as socionomics would predict:</p><blockquote><p>Morgan Kelly, of University College Dublin, said the government is almost powerless to stop the downturn becoming a severe slump. “We’re in a classic post-bubble recession, yet we can’t do anything that a country would normally do in this situation because we’re inside the eurozone,” Prof Kelly said. “We can’t cut interest rates, we can’t devalue, and there is a lot less room for fiscal stimulus than people think. We’re stuck.</p></blockquote><p>When a nation permits its government to hand its monetary policy over to Belgian bankers, it shouldn’t be terribly surprised to discover that its monetary policy is run for the benefit of Belgian bankers, not the nation.  I wonder how many times the Irish government will have to make the Irish people vote in order to get the <s>European Constitution</s>Lisbon treaty passed?</p></div>",
  "content_text": "AE-P’s report helps explain why\nthe euro and the EU may not survive the Fimbulwinter\n, as socionomics would predict:\nMorgan Kelly, of University College Dublin, said the government is almost powerless to stop the downturn becoming a severe slump. “We’re in a classic post-bubble recession, yet we can’t do anything that a country would normally do in this situation because we’re inside the eurozone,” Prof Kelly said. “We can’t cut interest rates, we can’t devalue, and there is a lot less room for fiscal stimulus than people think. We’re stuck.\nWhen a nation permits its government to hand its monetary policy over to Belgian bankers, it shouldn’t be terribly surprised to discover that its monetary policy is run for the benefit of Belgian bankers, not the nation.  I wonder how many times the Irish government will have to make the Irish people vote in order to get the\nEuropean Constitution\nLisbon treaty passed?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-17T12:10:00+00:00"
}