{
  "url": "https://voxday.net/2008/03/20/its-one-way-ou/",
  "scraped_at": "2026-01-08T22:16:16.880353",
  "title": "It’s one way out",
  "date_display": "March 20, 2008",
  "date_iso": "2008-03-20T09:18:00+00:00",
  "date_from_url": "2008-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Like Mississippi, many states use an inflated graduation rate for federal reporting requirements under the No Child Left Behind law and a different one at home. As a result, researchers say, <a href=\"http://www.nytimes.com/2008/03/20/education/20graduation.html?hp\">federal figures obscure a dropout epidemic</a> so severe that only about 70 percent of the one million American students who start ninth grade each year graduate four years later.</p></blockquote><p>But whatever would we do without a public school system that can barely move half the students that enter it even with social promotion?  If you tried to design an even half-way rational means of educating a child, just what aspects of the present system would you retain?  And as the CPI fiction shows, these are far from the only federal figures being severely fudged.</p></div>",
  "content_text": "Like Mississippi, many states use an inflated graduation rate for federal reporting requirements under the No Child Left Behind law and a different one at home. As a result, researchers say,\nfederal figures obscure a dropout epidemic\nso severe that only about 70 percent of the one million American students who start ninth grade each year graduate four years later.\nBut whatever would we do without a public school system that can barely move half the students that enter it even with social promotion?  If you tried to design an even half-way rational means of educating a child, just what aspects of the present system would you retain?  And as the CPI fiction shows, these are far from the only federal figures being severely fudged.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-20T09:18:00+00:00"
}