{
  "url": "https://voxday.net/2008/03/08/land-without-children/",
  "scraped_at": "2026-01-08T22:14:37.506493",
  "title": "A land without children",
  "date_display": "March 8, 2008",
  "date_iso": "2008-03-08T08:19:00+00:00",
  "date_from_url": "2008-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sorry about the absence of bloggertainment for the last two days, but I actually had to do a bit of what passes for labor these days.  This took me to Germany, and the most remarkable thing I noticed was that during my entire trip, I saw a grand total of three children.  Now, granted I wasn’t often in an environment where one would expect to see a lot of children, but even at the train station or when a friend and I walked to lunch through the middle of town, I saw virtually no one younger than 15 or so.</p><p>When I mentioned this yesterday to a media relations woman – a pretty, married German lady in her late twenties and childless – she commented that German women are taught to believe that if you take the time to pursue a college education, you have wasted those years should you subsequently fail to “use” that education by having children instead of a career.  But when I asked her if she felt she was making effective use of her education by keeping the press informed about her company’s latest innovations in a minor field of electronics, she laughed and admitted that she was already beginning to wonder what was so damned important about her career.  This was remarkable, since questioning the intellectual status quo isn’t exactly what you’d call a strong point for Germans of either sex.</p><p>In the Terry Pratchett novel <i>Interesting Times</i>, the British humorist notes that a breeding bias for treacherous killers eventually creates a situation where it is dangerous to lean over a cradle.  In light of this observation, it seems remarkable that even the most staunch proponents of evolution fail to recognize the obvious problem intrinsic in teaching the more intelligent 50 percent of the female population that they have a moral imperative to unquestioningly render themselves worker drones.  It’s also remarkable that so many people believe themseselves to be “using” their education by virtue of their employment in a job that has nothing whatsoever to do with their university studies.</p></div>",
  "content_text": "I’m sorry about the absence of bloggertainment for the last two days, but I actually had to do a bit of what passes for labor these days.  This took me to Germany, and the most remarkable thing I noticed was that during my entire trip, I saw a grand total of three children.  Now, granted I wasn’t often in an environment where one would expect to see a lot of children, but even at the train station or when a friend and I walked to lunch through the middle of town, I saw virtually no one younger than 15 or so.\nWhen I mentioned this yesterday to a media relations woman – a pretty, married German lady in her late twenties and childless – she commented that German women are taught to believe that if you take the time to pursue a college education, you have wasted those years should you subsequently fail to “use” that education by having children instead of a career.  But when I asked her if she felt she was making effective use of her education by keeping the press informed about her company’s latest innovations in a minor field of electronics, she laughed and admitted that she was already beginning to wonder what was so damned important about her career.  This was remarkable, since questioning the intellectual status quo isn’t exactly what you’d call a strong point for Germans of either sex.\nIn the Terry Pratchett novel\nInteresting Times\n, the British humorist notes that a breeding bias for treacherous killers eventually creates a situation where it is dangerous to lean over a cradle.  In light of this observation, it seems remarkable that even the most staunch proponents of evolution fail to recognize the obvious problem intrinsic in teaching the more intelligent 50 percent of the female population that they have a moral imperative to unquestioningly render themselves worker drones.  It’s also remarkable that so many people believe themseselves to be “using” their education by virtue of their employment in a job that has nothing whatsoever to do with their university studies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-08T08:19:00+00:00"
}