{
  "url": "https://voxday.net/2008/03/27/lexicology/",
  "scraped_at": "2026-01-08T22:17:12.754522",
  "title": "Voxicon",
  "date_display": "March 27, 2008",
  "date_iso": "2008-03-27T16:39:00+00:00",
  "date_from_url": "2008-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This Voxological lexicon may be of some utility when reading this blog:</i></p><p> <b>Aprevistan:</b> One who subscribes to some form of Open Theory or opposes the concept of an omniderigent God on Biblical grounds.</p><p><b>Atheist, High Church:</b> An individual lacking god belief who is college-educated, self-identifies as an atheist and subscribes entirely to a materialist model of the universe, rejecting all supernatural concepts.  Usually subscribes to “Enlightenment values” as well as secular humanism, considers himself rational and is often evangelical or militant about his lack of god belief.</p><p><b>Atheist, Low Church:</b> An individual lacking god belief who does not self-identify as an atheist, usually has not completed college and does not possess a conscious model of the universe, although assumes an essentially materialist one.  May or may not reject the supernatural and is not terribly interested in abstract concepts.  Doesn’t know what “Enlightenment values” are, doesn’t care, but generally subscribes to a belief in evolution and trusts in science.  Not the least bit evangelical or militant about his lack of god belief.</p><p><b>Atheist Dance:</b> Changing the definition of atheism depending upon what the atheist is attempting to prove or disprove at the moment.</p><p><b>Broken Bamboo:</b> A defensive argumentative technique which asserts that the non-atheist is attacking a strawman position instead of an actual atheist argument, even when the argument attacked is a specific argument made by a well-known atheist in one of his best-selling books.</p><p><b>Captain Underoos:</b> Mitt Romney</p><p><b>CCD:</b> Confront, Cow, Destroy.  One of Vox’s favored methods of removing intellectual legitimacy from an opponent.  First, challenge the claims made by the opponent.  Second, intimidate them by demonstrating a superior understanding of their own arguments.  Third, demolish whatever respectability they may have in the eyes of others by showing their verifiable errors of fact and logic.</p><p><b>Circle Jerk:</b> The action when one Horseman publicly reviews, critiques or judges another Horseman’s work, especially when one Horseman judges the quality of another Horseman’s judgment of the quality of his own work.</p><p><b>Climacaustal:</b> A member of the pseudoscientific cult of Anthropogenic Global Warming/Climate Change. (AGW/CC)</p><p><b>Defiance on Hill 1917:</b> Any of the various arguments used in a futile attempt to separate atheism as a belief system from the historical fact that regimes ruled by atheists have committed a statistically disproportionate amount of atrocities.  This can take the form of a No True Atheist argument, a Rage Against the Facts argument or the “Communism is a religion” argument.</p><p><b>Extinction Equation:</b> Sam Harris’s central argument from <i>The End of Faith</i>, which states that Science plus Religious Faith equals Imminent Human Extinction.</p><p><b>Four Horsemen of the Bukkakelypse:</b> Richard Dawkins, Daniel Dennett, Sam Harris, and Christopher Hitchens.  Less Dennett, also known as the Unholy Trinity.</p><p>Fowl Atheist:  Pharyngula blogger Paul Myers, an outspoken atheist afraid of public debate.</p><p><b>Hultgreen-Curie Syndrome:</b> The lethal disease that strikes female pioneers.  Named after Kara Hultgreen and Madame Curie, the syndrome has struck down numerous brave women on the frontiers of female innovation, including the first woman to use a washing machine, who tragically drowned in it, and the first Roman woman to eat reclining on a couch, who choked to death on a grape.</p><p><b>Magic Negro:</b>Barrack Hussein Soetoro/Soebarkah/Obama</p><p><b>Magic Negro Part II: Republican Edition:</b> Hermain Cain</p><p><b>ND-TENS</b> Neo-Darwinian Theory of Evolution by Natural Selection.</p><p><b>TENS:</b> Theory of Evolution by Natural Selection.</p><p><b>TE(p)NSBMGDaGF:</b> Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow.</p><p><b>Omniderigence:</b> The concept of an all-acting God who is responsible for all human decisions, actions, and historical events, large and small.  Also known as the God of the Perfect Plan or the Swallow-slaying God.</p><p>Omniderigiste: One who subscribes to omniderigence.</p><p><b>Voliscience:</b> The ability to know whatever one wishes to know at any given moment.  This is distinguished from omniscience, which requires knowing all things at all times.</p><p><b>Irratheist:</b> An atheist who asserts the superiority of atheism on the basis of its supposed foundation in science and reason while simultaneously defining atheism as being a concept strictly limited to the absence of a belief in the existence of God, thereby accepting the validity of atheist belief in astrology, Buddhism, reincarnation, Heaven, Hell, pagan gods and every other supernatural phenomena or concept currently unknown to science.  This is usually an extreme example of a Fighting Withdrawal argument, but can, in some cases, represent a genuine intellectual position.</p><p><b>Science Reason:</b> The pagan god of the science fetishists and militant atheists.  Its great prophet UberDawks has revealed that it will one day push out IDIOT FUNDIES from the shiny, sexy, secular society that will be established after the Singularity.</p><p><b>Fighting Withdrawal:</b> An argumentative technique often used by atheists which involves defending a position or an individual by sacrificing the larger part of the defended position or the defended individual’s arguments, usually without understanding that the sacrifice has been made.</p><p><b>Silence That Gun:</b> A post-argument technique utilized by many atheists of falling silent and disappearing rather than conceding the point when their arguments have been refuted.  This can also apply to book reviews.</p><p><b>Subtraction Fallacy:</b> An argument made in near-complete ignorance of Christian theology in which it is argued that atheists only believe in one less supernatural deity than Christians.  Also known as Stephen F. Roberts’s One Less God argument.</p><p><b>Rage Against the Facts</b>: A counter-ontological argument which states that because the atheist cannot understand the logic which would explain the nature of the relationship underlying an observed causation, said causation cannot exist, all supporting empirical evidence notwithstanding.  Also known as the “In the Name of” argument.</p><p>Hume’s Last Gasp: A logically fallacious and anti-scientific assertion about the varying nature of the quality of evidence required to prove the verity of one claim versus another claim.  More commonly known as the Extraordinary Claims concept.</p><p>Marinello: A bizarre defensive response which involves accusing the accuser of being/doing precisely what he has just accused the defendant of being/doing .  Example: “I’m not 0-10, you’re 0-10!”</p><p><b>MPAI:</b> Most People Are Idiots.</p><p><b>Scientage:</b> The body of scientific knowledge.</p><p><b>Scientody:</b> The scientific method.</p><p><b>Scientistry:</b> The profession of science.  (This refers to the labor performed by sufficiently credentialed scientists, not an expression of quasi-religious faith on the part of the scientific faithful.)</p><p><b>Scienthology:</b> The practice of a division of doxastic labor which involves blindly placing one’s uninformed faith in the opinions of scientists, particularly those opinions which are advertised as a “scientific consensus”.  Also includes the fetishistic worship of a romanticized Platonic ideal of science, primarily by those lacking professional scientific credentials.</p><p><b>Unholy Trinity:</b> Richard Dawkins, Sam Harris, and Christopher Hitchens</p><p><b>Lizard Queen:</b> Hillary Rodham Clinton</p><p><b>Euzi:</b> A politician, bureaucrat, or supporter of the European Union.</p><p> <i><b>APHORISMS</b></i></p><p>Get up.  Don’t argue, don’t complain, and don’t cry.  Just get up and go on.</p><p>Never assume error, inquire to confirm it.</p><p>Reason can no more deliver operative moral systems than socialism can provide functional pricing models.</p><p>A ruthless commitment to logic and truth tends to be persuasive over time because the human mind can only stand so much cognitive dissonance before it either begins to break down or accept that which is both logical and observable.</p></div>",
  "content_text": "This Voxological lexicon may be of some utility when reading this blog:\nAprevistan:\nOne who subscribes to some form of Open Theory or opposes the concept of an omniderigent God on Biblical grounds.\nAtheist, High Church:\nAn individual lacking god belief who is college-educated, self-identifies as an atheist and subscribes entirely to a materialist model of the universe, rejecting all supernatural concepts.  Usually subscribes to “Enlightenment values” as well as secular humanism, considers himself rational and is often evangelical or militant about his lack of god belief.\nAtheist, Low Church:\nAn individual lacking god belief who does not self-identify as an atheist, usually has not completed college and does not possess a conscious model of the universe, although assumes an essentially materialist one.  May or may not reject the supernatural and is not terribly interested in abstract concepts.  Doesn’t know what “Enlightenment values” are, doesn’t care, but generally subscribes to a belief in evolution and trusts in science.  Not the least bit evangelical or militant about his lack of god belief.\nAtheist Dance:\nChanging the definition of atheism depending upon what the atheist is attempting to prove or disprove at the moment.\nBroken Bamboo:\nA defensive argumentative technique which asserts that the non-atheist is attacking a strawman position instead of an actual atheist argument, even when the argument attacked is a specific argument made by a well-known atheist in one of his best-selling books.\nCaptain Underoos:\nMitt Romney\nCCD:\nConfront, Cow, Destroy.  One of Vox’s favored methods of removing intellectual legitimacy from an opponent.  First, challenge the claims made by the opponent.  Second, intimidate them by demonstrating a superior understanding of their own arguments.  Third, demolish whatever respectability they may have in the eyes of others by showing their verifiable errors of fact and logic.\nCircle Jerk:\nThe action when one Horseman publicly reviews, critiques or judges another Horseman’s work, especially when one Horseman judges the quality of another Horseman’s judgment of the quality of his own work.\nClimacaustal:\nA member of the pseudoscientific cult of Anthropogenic Global Warming/Climate Change. (AGW/CC)\nDefiance on Hill 1917:\nAny of the various arguments used in a futile attempt to separate atheism as a belief system from the historical fact that regimes ruled by atheists have committed a statistically disproportionate amount of atrocities.  This can take the form of a No True Atheist argument, a Rage Against the Facts argument or the “Communism is a religion” argument.\nExtinction Equation:\nSam Harris’s central argument from\nThe End of Faith\n, which states that Science plus Religious Faith equals Imminent Human Extinction.\nFour Horsemen of the Bukkakelypse:\nRichard Dawkins, Daniel Dennett, Sam Harris, and Christopher Hitchens.  Less Dennett, also known as the Unholy Trinity.\nFowl Atheist:  Pharyngula blogger Paul Myers, an outspoken atheist afraid of public debate.\nHultgreen-Curie Syndrome:\nThe lethal disease that strikes female pioneers.  Named after Kara Hultgreen and Madame Curie, the syndrome has struck down numerous brave women on the frontiers of female innovation, including the first woman to use a washing machine, who tragically drowned in it, and the first Roman woman to eat reclining on a couch, who choked to death on a grape.\nMagic Negro:\nBarrack Hussein Soetoro/Soebarkah/Obama\nMagic Negro Part II: Republican Edition:\nHermain Cain\nND-TENS\nNeo-Darwinian Theory of Evolution by Natural Selection.\nTENS:\nTheory of Evolution by Natural Selection.\nTE(p)NSBMGDaGF:\nTheorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow.\nOmniderigence:\nThe concept of an all-acting God who is responsible for all human decisions, actions, and historical events, large and small.  Also known as the God of the Perfect Plan or the Swallow-slaying God.\nOmniderigiste: One who subscribes to omniderigence.\nVoliscience:\nThe ability to know whatever one wishes to know at any given moment.  This is distinguished from omniscience, which requires knowing all things at all times.\nIrratheist:\nAn atheist who asserts the superiority of atheism on the basis of its supposed foundation in science and reason while simultaneously defining atheism as being a concept strictly limited to the absence of a belief in the existence of God, thereby accepting the validity of atheist belief in astrology, Buddhism, reincarnation, Heaven, Hell, pagan gods and every other supernatural phenomena or concept currently unknown to science.  This is usually an extreme example of a Fighting Withdrawal argument, but can, in some cases, represent a genuine intellectual position.\nScience Reason:\nThe pagan god of the science fetishists and militant atheists.  Its great prophet UberDawks has revealed that it will one day push out IDIOT FUNDIES from the shiny, sexy, secular society that will be established after the Singularity.\nFighting Withdrawal:\nAn argumentative technique often used by atheists which involves defending a position or an individual by sacrificing the larger part of the defended position or the defended individual’s arguments, usually without understanding that the sacrifice has been made.\nSilence That Gun:\nA post-argument technique utilized by many atheists of falling silent and disappearing rather than conceding the point when their arguments have been refuted.  This can also apply to book reviews.\nSubtraction Fallacy:\nAn argument made in near-complete ignorance of Christian theology in which it is argued that atheists only believe in one less supernatural deity than Christians.  Also known as Stephen F. Roberts’s One Less God argument.\nRage Against the Facts\n: A counter-ontological argument which states that because the atheist cannot understand the logic which would explain the nature of the relationship underlying an observed causation, said causation cannot exist, all supporting empirical evidence notwithstanding.  Also known as the “In the Name of” argument.\nHume’s Last Gasp: A logically fallacious and anti-scientific assertion about the varying nature of the quality of evidence required to prove the verity of one claim versus another claim.  More commonly known as the Extraordinary Claims concept.\nMarinello: A bizarre defensive response which involves accusing the accuser of being/doing precisely what he has just accused the defendant of being/doing .  Example: “I’m not 0-10, you’re 0-10!”\nMPAI:\nMost People Are Idiots.\nScientage:\nThe body of scientific knowledge.\nScientody:\nThe scientific method.\nScientistry:\nThe profession of science.  (This refers to the labor performed by sufficiently credentialed scientists, not an expression of quasi-religious faith on the part of the scientific faithful.)\nScienthology:\nThe practice of a division of doxastic labor which involves blindly placing one’s uninformed faith in the opinions of scientists, particularly those opinions which are advertised as a “scientific consensus”.  Also includes the fetishistic worship of a romanticized Platonic ideal of science, primarily by those lacking professional scientific credentials.\nUnholy Trinity:\nRichard Dawkins, Sam Harris, and Christopher Hitchens\nLizard Queen:\nHillary Rodham Clinton\nEuzi:\nA politician, bureaucrat, or supporter of the European Union.\nAPHORISMS\nGet up.  Don’t argue, don’t complain, and don’t cry.  Just get up and go on.\nNever assume error, inquire to confirm it.\nReason can no more deliver operative moral systems than socialism can provide functional pricing models.\nA ruthless commitment to logic and truth tends to be persuasive over time because the human mind can only stand so much cognitive dissonance before it either begins to break down or accept that which is both logical and observable.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2008-03-27T16:39:00+00:00"
}