{
  "url": "https://voxday.net/2008/03/28/mad-biologist-projects-his-problems/",
  "scraped_at": "2026-01-08T22:17:18.283230",
  "title": "The Maladroit Biologist",
  "date_display": "March 28, 2008",
  "date_iso": "2008-03-28T10:21:00+00:00",
  "date_from_url": "2008-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Read <a href=\"http://scienceblogs.com/mikethemadbiologist/2008/03/i_see_stupid_people_the_vox_da.php\">the Mad Biologist’s rabid and amusing defense</a> of his “moral and emotional case for evolution”, which, as one of his readers correctly notes, isn’t even a “moral argument on behalf of evolution”, much less one for “the utility of evolutionary biology”, but rather an incompetent case for teaching evolution.  First, <a href=\"http://www.milobookclub.com/2008/03/26/emotional-case-for-science/\">note that this post</a> is what he seriously describes as going “berserk”.  Second, it’s ironic that he accuses me of minimal reading comprehension skills in the same post that he wrongly claims I have made him “part of Dawkins’ atheist argument”.  I merely noted that his very poor reasoning “is most remniscent of Richard Dawkins’s howlingly ludicrous conclusion of his ‘unrebuttable’ central argument of <i>The God Delusion</i>.”  It’s not my fault when others advance demonstrably flawed arguments, it’s remarkable how instead of admitting the obvious flaws I have pointed out and improving their arguments, they prefer to accuse me of stupidity, fling a few metaphorical feces, and dig the hole deeper with their futile defenses.</p><p>Clearly atheists have no monopoly on logical incompetence.  And speaking of incompetence, let’s consider the Mad Biologist’s own six-point description of what he means by moral.  (Note for the Mad Biologist: noting the fact that both you and Richard Dawkins have presented arguments that have six points to them should not be read as a statement indicating that the two of you are making the same argument.)</p><blockquote><p>1. Creationists argue that evolutionary biology will lead to all sorts of immorality, and that it should not be taught in schools (or taught in such a watered down manner that it will effectively not be taught at all). This means fewer people will be able to become evolutionary biologists, as well as a general public that is more ignorant of biology.</p></blockquote><p>This is not the primary basis of most Creationists’ objections to evolutionary biology.  The primary basis is that first, it is not true, and second, that it is not science.  But even if we ignore those two factors, it is obvious that by the moral standard of both Christian and Islamic Creationists, there is no shortage of empirical evidence that the Creationists have a pretty good case regarding immorality.  Pick whatever metric you like, it’s easily verified.  And on the other hand, there is no inherent moral virtue in a greater number of evolutionary biologists or a general public less ignorant of biology, and there’s no inherent connection between the state of the general public’s knowledge and advances in a particular field od science.  More importantly, the idea that biology can be effectively taught in school system that fails to graduate a substantial portion of its students and cannot teach a large percentage of them to read, do math, or think logically is absurd.</p><blockquote><p> 2. As I described during my talk, and repeatedly discuss on my blog, including in the post that got Vox’s panties in a bunch, genomic based medicine (human and infectious disease), not to mention other areas of applied biology, relies on evolutionary theory, tools, and methods. All those articles about ‘decoding the book of life’ don’t happen without evolutionary biology.</p></blockquote><p>Quite possibly true to some extent, although I suspect there’s more than a bit of post-facto darwining being exhibited here.  Genomic-based medicine also relies heavily on computer software technology and I don’t think too many people would be impressed with an identical case for the moral imperative of increasing the number of software designers.  Moreover, without evolutionary biology, we would also sacrifice our ability to develop biological weapons targeted to specific genetic types and our ability to allow insurance companies to deny medical coverage to genetically unfortunate individuals.</p><blockquote><p>3. Developing vaccines, discovering new antibiotics, and finding new therapeutic treatments, which we do in genomics by using evolutionary biology, are moral actions.</p></blockquote><p>Really?  Usually the defenders of science insist that such actions are no more intrinsicly moral or immoral than developing nuclear weapons, biological weapons, and new means of torture.  On what basis is the development of a new therapeutic treatment any more moral or immoral than the development of a new weaponized Ebola virus?</p><blockquote><p>4. Denying the use (and existence) of these powerful tools, as well as the potential training of future scientists will impede our ability to cure disease.</p></blockquote><p>And it will also impede our ability to develop new and more efficient means of killing other people.  Both statements are undeniable.</p><blockquote><p>5. Reducing our ability to combat infectious disease is immoral.</p></blockquote><p>On what basis is reducing our ability to combat infectious disease immoral?  If we accept the moral standard of the overpopulation crowd, this reduction would be considered moral while combatting natural infectious disease to reduce the population is immoral.  It depends upon the moral standard.  Certainly by the Christian moral standard the statement is correct, but we are sadly uninformed as to which moral standard this car crash of an argument is appealing.</p><blockquote><p>6. Therefore, opposing evolution, as creationists do, because it is theologically inconvenient is wrong, and supporting evolution is a good thing–a moral thing (and ethical too).</p></blockquote><p>The mere appearance of a “therefore” at the end does not a logically sound conclusion make.  His assertion notwithstanding, the Mad Biologist never actually gets around to describing what he means by moral and his argument is built upon a verifiably false foundation with several intervening points taking only the positive aspects into account while ignoring the negative aspects.  Whether one chooses to regard it as a definition of morality or a logical case for the teaching of evolution, it fails badly.  Like Richard Dawkins, the Mad Biologist only manages to demonstrate a) the logical incompetence of biologists, and, b) why biologists really would be wise to stick to biology and stop embarrassing themselves in public.</p><p>I understand that this argument, such as it is, is intended to be a rhetorical device, not science.  My point is that it’s a demonstrably bad one, and, as I predicted, it makes for very funny blogfodder indeed.  Now, if only we could get these science fetishists to attempt poetry as well as rhetoric in defense of their object of veneration, I think my joy would be complete.</p></div>",
  "content_text": "Read\nthe Mad Biologist’s rabid and amusing defense\nof his “moral and emotional case for evolution”, which, as one of his readers correctly notes, isn’t even a “moral argument on behalf of evolution”, much less one for “the utility of evolutionary biology”, but rather an incompetent case for teaching evolution.  First,\nnote that this post\nis what he seriously describes as going “berserk”.  Second, it’s ironic that he accuses me of minimal reading comprehension skills in the same post that he wrongly claims I have made him “part of Dawkins’ atheist argument”.  I merely noted that his very poor reasoning “is most remniscent of Richard Dawkins’s howlingly ludicrous conclusion of his ‘unrebuttable’ central argument of\nThe God Delusion\n.”  It’s not my fault when others advance demonstrably flawed arguments, it’s remarkable how instead of admitting the obvious flaws I have pointed out and improving their arguments, they prefer to accuse me of stupidity, fling a few metaphorical feces, and dig the hole deeper with their futile defenses.\nClearly atheists have no monopoly on logical incompetence.  And speaking of incompetence, let’s consider the Mad Biologist’s own six-point description of what he means by moral.  (Note for the Mad Biologist: noting the fact that both you and Richard Dawkins have presented arguments that have six points to them should not be read as a statement indicating that the two of you are making the same argument.)\n1. Creationists argue that evolutionary biology will lead to all sorts of immorality, and that it should not be taught in schools (or taught in such a watered down manner that it will effectively not be taught at all). This means fewer people will be able to become evolutionary biologists, as well as a general public that is more ignorant of biology.\nThis is not the primary basis of most Creationists’ objections to evolutionary biology.  The primary basis is that first, it is not true, and second, that it is not science.  But even if we ignore those two factors, it is obvious that by the moral standard of both Christian and Islamic Creationists, there is no shortage of empirical evidence that the Creationists have a pretty good case regarding immorality.  Pick whatever metric you like, it’s easily verified.  And on the other hand, there is no inherent moral virtue in a greater number of evolutionary biologists or a general public less ignorant of biology, and there’s no inherent connection between the state of the general public’s knowledge and advances in a particular field od science.  More importantly, the idea that biology can be effectively taught in school system that fails to graduate a substantial portion of its students and cannot teach a large percentage of them to read, do math, or think logically is absurd.\n2. As I described during my talk, and repeatedly discuss on my blog, including in the post that got Vox’s panties in a bunch, genomic based medicine (human and infectious disease), not to mention other areas of applied biology, relies on evolutionary theory, tools, and methods. All those articles about ‘decoding the book of life’ don’t happen without evolutionary biology.\nQuite possibly true to some extent, although I suspect there’s more than a bit of post-facto darwining being exhibited here.  Genomic-based medicine also relies heavily on computer software technology and I don’t think too many people would be impressed with an identical case for the moral imperative of increasing the number of software designers.  Moreover, without evolutionary biology, we would also sacrifice our ability to develop biological weapons targeted to specific genetic types and our ability to allow insurance companies to deny medical coverage to genetically unfortunate individuals.\n3. Developing vaccines, discovering new antibiotics, and finding new therapeutic treatments, which we do in genomics by using evolutionary biology, are moral actions.\nReally?  Usually the defenders of science insist that such actions are no more intrinsicly moral or immoral than developing nuclear weapons, biological weapons, and new means of torture.  On what basis is the development of a new therapeutic treatment any more moral or immoral than the development of a new weaponized Ebola virus?\n4. Denying the use (and existence) of these powerful tools, as well as the potential training of future scientists will impede our ability to cure disease.\nAnd it will also impede our ability to develop new and more efficient means of killing other people.  Both statements are undeniable.\n5. Reducing our ability to combat infectious disease is immoral.\nOn what basis is reducing our ability to combat infectious disease immoral?  If we accept the moral standard of the overpopulation crowd, this reduction would be considered moral while combatting natural infectious disease to reduce the population is immoral.  It depends upon the moral standard.  Certainly by the Christian moral standard the statement is correct, but we are sadly uninformed as to which moral standard this car crash of an argument is appealing.\n6. Therefore, opposing evolution, as creationists do, because it is theologically inconvenient is wrong, and supporting evolution is a good thing–a moral thing (and ethical too).\nThe mere appearance of a “therefore” at the end does not a logically sound conclusion make.  His assertion notwithstanding, the Mad Biologist never actually gets around to describing what he means by moral and his argument is built upon a verifiably false foundation with several intervening points taking only the positive aspects into account while ignoring the negative aspects.  Whether one chooses to regard it as a definition of morality or a logical case for the teaching of evolution, it fails badly.  Like Richard Dawkins, the Mad Biologist only manages to demonstrate a) the logical incompetence of biologists, and, b) why biologists really would be wise to stick to biology and stop embarrassing themselves in public.\nI understand that this argument, such as it is, is intended to be a rhetorical device, not science.  My point is that it’s a demonstrably bad one, and, as I predicted, it makes for very funny blogfodder indeed.  Now, if only we could get these science fetishists to attempt poetry as well as rhetoric in defense of their object of veneration, I think my joy would be complete.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-28T10:21:00+00:00"
}