{
  "url": "https://voxday.net/2008/03/02/mailvox-false-hope/",
  "scraped_at": "2026-01-08T22:14:03.064515",
  "title": "Mailvox: a false hope",
  "date_display": "March 2, 2008",
  "date_iso": "2008-03-02T12:41:00+00:00",
  "date_from_url": "2008-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another college atheist writes in defense of Sam Harris:</p><blockquote><p>I read your book today. I too, was a Chrsitian, and a fairly conservative one. But I had some questions about it, and Sam Harris book turned me away from it.  I found most of your attacks on Harris to be erronous. Except for when you talked about Harris glossing over the evils of Stalin and Mao (you’re dead right there) it sounded like you were distorting what Harris said, or at least what he meant. Also, I never read that Harris thoguht religion was worse than rape–did you make that up?</p></blockquote><p>It’s very strange that this kid could see through the spurious nature of Harris’s No True Atheist defense of communism, yet not recognize the ridiculous nature of the Red State argument and other Harrisian fabrications.  As for the hope that I’m dumb enough to simply fabricate quotes relating to a controversial subject, well, here’s <a href=\"http://www.thesunmagazine.org/issues/369/the_temple_of_reason?page=2\">the notorious statement right here</a>:</p><p><i><b>Saltman:</b> “Your analogy between organized religion and rape is pretty inflammatory. Is that intentional?”</i></p><p><b>Harris:</b> I can be even more inflammatory than that. If I could wave a magic wand and get rid of either rape or religion, I would not hesitate to get rid of religion. I think more people are dying as a result of our religious myths than as a result of any other ideology.</p><p>It’s sad that a child raised Christian would turn away from the faith of his fathers.  But one despairs for the human race to know that anyone could do so on the basis of arguments made by Sam Harris.  Mercury in the vaccines is the only plausible explanation.</p><p>UPDATE – Speaking of vaccine damage, another TIA reviewer <a href=\"http://www.amazon.com/review/R2V1CD5IK2PLE8/ref=cm_cr_rdp_perm/\">is obviously quite reliable on the details</a> in his review of the response to Clinton, Sam, and the crew:</p><blockquote><p>Robert Beale, right wing blogger, video gamer and part-time Christian fantasy novelist is the literary equivalent of Ann Coulter, and his frequent invocation of the Holocaust, race, gender, class and other cultural hot buttons on his Vox Populi blog is an exercise in intellectual bomb throwing.</p></blockquote><p>I particularly enjoyed the claim that I confuse correlation with causation, when I specifically point out that it is the very high level of correlation that suggests causation.  The New Atheists, on the other hand, are permitted by their acolytes to assume causation without even demonstrating correlation in the first place.</p></div>",
  "content_text": "Another college atheist writes in defense of Sam Harris:\nI read your book today. I too, was a Chrsitian, and a fairly conservative one. But I had some questions about it, and Sam Harris book turned me away from it.  I found most of your attacks on Harris to be erronous. Except for when you talked about Harris glossing over the evils of Stalin and Mao (you’re dead right there) it sounded like you were distorting what Harris said, or at least what he meant. Also, I never read that Harris thoguht religion was worse than rape–did you make that up?\nIt’s very strange that this kid could see through the spurious nature of Harris’s No True Atheist defense of communism, yet not recognize the ridiculous nature of the Red State argument and other Harrisian fabrications.  As for the hope that I’m dumb enough to simply fabricate quotes relating to a controversial subject, well, here’s\nthe notorious statement right here\n:\nSaltman:\n“Your analogy between organized religion and rape is pretty inflammatory. Is that intentional?”\nHarris:\nI can be even more inflammatory than that. If I could wave a magic wand and get rid of either rape or religion, I would not hesitate to get rid of religion. I think more people are dying as a result of our religious myths than as a result of any other ideology.\nIt’s sad that a child raised Christian would turn away from the faith of his fathers.  But one despairs for the human race to know that anyone could do so on the basis of arguments made by Sam Harris.  Mercury in the vaccines is the only plausible explanation.\nUPDATE – Speaking of vaccine damage, another TIA reviewer\nis obviously quite reliable on the details\nin his review of the response to Clinton, Sam, and the crew:\nRobert Beale, right wing blogger, video gamer and part-time Christian fantasy novelist is the literary equivalent of Ann Coulter, and his frequent invocation of the Holocaust, race, gender, class and other cultural hot buttons on his Vox Populi blog is an exercise in intellectual bomb throwing.\nI particularly enjoyed the claim that I confuse correlation with causation, when I specifically point out that it is the very high level of correlation that suggests causation.  The New Atheists, on the other hand, are permitted by their acolytes to assume causation without even demonstrating correlation in the first place.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-02T12:41:00+00:00"
}