{
  "url": "https://voxday.net/2008/03/26/non-tia-book-review/",
  "scraped_at": "2026-01-08T22:16:59.092183",
  "title": "ReadingWrath",
  "date_display": "March 26, 2008",
  "date_iso": "2008-03-26T10:28:00+00:00",
  "date_from_url": "2008-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Flicka <a href=\"http://flickaspumoni.blogspot.com/2007/04/book-review-wrath-of-angels.html\">reviews <i>The Wrath of Angels</i></a>:</p><blockquote><p>Theodore Beale describes himself as a writer of Christian Fantasy, and certainly The Wrath of Angels can fit into that category. I think that if you do not consider the Bible to be absolute truth then you will enjoy this tale as fantasy. But any student of God’s word will immediately recognize within the characters and story a comprehensive theology through which the doctrines of angels, sin and forgiveness are illuminated, fleshed out, and animated. And as such <i>The Wrath of Angels</i> is more Christianity-Imaginatively-Expressed than Christian Fantasy.</p><p>I enjoy Beale’s wonderfully descriptive style. His narrative is like the fluff of beautiful imagery sandwiched between hard slices of fast-paced action scenes. He has an impressive and thoroughly enjoyable vocabulary and brandishes words as deftly as The Lord Of Chaos does his sword. Thankfully, missing from his style are the ubiquitous fragmented sentences just to make a point, and the one sentence paragraphs as though every statement were a profundity, and the italicized sentences to reveal the mind of the charatcter that litter so many pages in contemporary fiction. Out of the midst of the many references from sources as varied as archaic literature to contemporary rock bands, along with the thoughtful, observant unfolding of his tale, emerges a unique and strong voice.</p></blockquote><p>Flicka wrote this review a while ago, but I hadn’t seen it, so it was a nice surprise on <a href=\"http://rantingroom.blogspot.com/\">the Original Cyberpunk’s shiny new site</a>.  I’m quite pleased with how Wrath has been received, although it seems I may have been a bit too clever for my own good in burying the subtext too deeply for anyone to notice.  The plot point that Flicka mentions as not being explained might be a little more obvious if one understands my background in economics and my interest in currencies… there is a whole level to the novel that literally no one has noticed despite a few – quite clearly ineffectual – hints about its existence.</p></div>",
  "content_text": "Flicka\nreviews\nThe Wrath of Angels\n:\nTheodore Beale describes himself as a writer of Christian Fantasy, and certainly The Wrath of Angels can fit into that category. I think that if you do not consider the Bible to be absolute truth then you will enjoy this tale as fantasy. But any student of God’s word will immediately recognize within the characters and story a comprehensive theology through which the doctrines of angels, sin and forgiveness are illuminated, fleshed out, and animated. And as such\nThe Wrath of Angels\nis more Christianity-Imaginatively-Expressed than Christian Fantasy.\nI enjoy Beale’s wonderfully descriptive style. His narrative is like the fluff of beautiful imagery sandwiched between hard slices of fast-paced action scenes. He has an impressive and thoroughly enjoyable vocabulary and brandishes words as deftly as The Lord Of Chaos does his sword. Thankfully, missing from his style are the ubiquitous fragmented sentences just to make a point, and the one sentence paragraphs as though every statement were a profundity, and the italicized sentences to reveal the mind of the charatcter that litter so many pages in contemporary fiction. Out of the midst of the many references from sources as varied as archaic literature to contemporary rock bands, along with the thoughtful, observant unfolding of his tale, emerges a unique and strong voice.\nFlicka wrote this review a while ago, but I hadn’t seen it, so it was a nice surprise on\nthe Original Cyberpunk’s shiny new site\n.  I’m quite pleased with how Wrath has been received, although it seems I may have been a bit too clever for my own good in burying the subtext too deeply for anyone to notice.  The plot point that Flicka mentions as not being explained might be a little more obvious if one understands my background in economics and my interest in currencies… there is a whole level to the novel that literally no one has noticed despite a few – quite clearly ineffectual – hints about its existence.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-26T10:28:00+00:00"
}