{
  "url": "https://voxday.net/2008/03/30/obama-and-odinga/",
  "scraped_at": "2026-01-08T22:17:29.329393",
  "title": "Obama and Odinga",
  "date_display": "March 30, 2008",
  "date_iso": "2008-03-30T09:53:00+00:00",
  "date_from_url": "2008-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Catkiller! <a href=\"http://www.rightnation.us/forums/index.php?automodule=blog&amp;blogid=7&amp;#\">brings some of the Magic Negro’s less savory connections</a> noted by the international press to our attention.</p><blockquote><p>Raila Odinga, it said, who was then the current presidential frontrunner, had promised to implement strict Islamic Sharia law if he received the Muslim vote and was elected president. Odinga had signed a secret memorandum of understanding with Sheikh Abdullahi Abdi, chairman of the National Leaders Forum, in which Odinga had allegedly stated his intention, if elected, to</p><p><i>“within six months, rewrite the Constitution of Kenya to recognize Sharia as the only true law sanctioned by the Holy Quran for Muslim declared regions”.</i></p></blockquote><p>And what is Obama’s connection to Odinga?  They are cousins, it seems:</p><blockquote><p>Mr Odinga, 63, said that the US senator’s father, from western Kenya’s Luo tribe, was his maternal uncle. “He has called me to talk about the destabilising constitutional crisis in this country, despite being in the middle of the very busy New Hampshire primary,” Mr Odinga said yesterday.</p><p>Mr Obama’s spokesman Robert Gibbs confirmed that the senator spoke to the Kenyan opposition leader on Monday afternoon for about five minutes before going into a rally in New Hampshire, according to Associated Press.</p></blockquote><p>Apparently that middle name “Hussein” may be a little more significant than originally thought… especially since the Rev. Jeremiah Wright’s Christianity appears to be of a severely mutated non-Western variety and Obama has declared his distance from it anyhow.</p><p>Not that the Lizard Queen is significantly more sane, <a href=\"http://online.wsj.com/article/declarations.html\">as Peggy Noonan notes</a>:</p><blockquote><p>What struck me as the best commentary on the Bosnia story came from a poster called GI Joe who wrote in to a news blog: <i>“Actually Mrs. Clinton was too modest. I was there and saw it all. When Mrs. Clinton got off the plane the tarmac came under mortar and machine gun fire. I was blown off my tank and exposed to enemy fire. Mrs. Clinton without regard to her own safety dragged me to safety, jumped on the tank and opened fire, killing 50 of the enemy.” Soon a suicide bomber appeared, but Mrs. Clinton stopped the guards from opening fire. “She talked to the man in his own language and got him [to] surrender. She found that he had suffered terribly as a result of policies of George Bush. She defused the bomb vest herself.” Then she turned to his wounds. “She stopped my bleeding and saved my life. Chelsea donated the blood.”</i></p><p>Made me laugh. It was like the voice of the people answering back. This guy knows that what Mrs. Clinton said is sort of crazy.</p></blockquote></div>",
  "content_text": "Catkiller!\nbrings some of the Magic Negro’s less savory connections\nnoted by the international press to our attention.\nRaila Odinga, it said, who was then the current presidential frontrunner, had promised to implement strict Islamic Sharia law if he received the Muslim vote and was elected president. Odinga had signed a secret memorandum of understanding with Sheikh Abdullahi Abdi, chairman of the National Leaders Forum, in which Odinga had allegedly stated his intention, if elected, to\n“within six months, rewrite the Constitution of Kenya to recognize Sharia as the only true law sanctioned by the Holy Quran for Muslim declared regions”.\nAnd what is Obama’s connection to Odinga?  They are cousins, it seems:\nMr Odinga, 63, said that the US senator’s father, from western Kenya’s Luo tribe, was his maternal uncle. “He has called me to talk about the destabilising constitutional crisis in this country, despite being in the middle of the very busy New Hampshire primary,” Mr Odinga said yesterday.\nMr Obama’s spokesman Robert Gibbs confirmed that the senator spoke to the Kenyan opposition leader on Monday afternoon for about five minutes before going into a rally in New Hampshire, according to Associated Press.\nApparently that middle name “Hussein” may be a little more significant than originally thought… especially since the Rev. Jeremiah Wright’s Christianity appears to be of a severely mutated non-Western variety and Obama has declared his distance from it anyhow.\nNot that the Lizard Queen is significantly more sane,\nas Peggy Noonan notes\n:\nWhat struck me as the best commentary on the Bosnia story came from a poster called GI Joe who wrote in to a news blog:\n“Actually Mrs. Clinton was too modest. I was there and saw it all. When Mrs. Clinton got off the plane the tarmac came under mortar and machine gun fire. I was blown off my tank and exposed to enemy fire. Mrs. Clinton without regard to her own safety dragged me to safety, jumped on the tank and opened fire, killing 50 of the enemy.” Soon a suicide bomber appeared, but Mrs. Clinton stopped the guards from opening fire. “She talked to the man in his own language and got him [to] surrender. She found that he had suffered terribly as a result of policies of George Bush. She defused the bomb vest herself.” Then she turned to his wounds. “She stopped my bleeding and saved my life. Chelsea donated the blood.”\nMade me laugh. It was like the voice of the people answering back. This guy knows that what Mrs. Clinton said is sort of crazy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-30T08:53:00+00:00"
}