{
  "url": "https://voxday.net/2008/03/09/pz-whines-about-expelled/",
  "scraped_at": "2026-01-08T22:14:53.896114",
  "title": "PZ whines aboutExpelled",
  "date_display": "March 9, 2008",
  "date_iso": "2008-03-09T19:31:00+00:00",
  "date_from_url": "2008-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not even a woman scorned is as upset as <a href=\"http://scienceblogs.com/pharyngula/2008/03/its_a_propaganda_film.php#comments\">the would-be scientific expert who is ignored as irrelevant</a>:</p><blockquote><p>If the producers of Expelled are so confident that they can make a strong case of conspiracy against scientists, then before they start showing this to uninformed politicians, they ought to screen it before scientists and historians and philosophers of science, who will be able to judge it on its merits.</p></blockquote><p>Because, PZ, as we’ve already seen with TIA, whenever someone does make a strong case against secular scientists or atheists, these self-proclaimed champions of intellectual discourse suddenly go silent and try to pretend they’ve never heard of it.  Dawkins was happy to write posts about TIA being “a flea” before it was published, Harris was perfectly happy to answer questions via email before it was published, a number of richarddawkins.net atheists were announcing their intention of doing chapter by chapter rebuttals of this little flea book… some of them even started on them.</p><p>And then, upon discovering that they were confronted by a strong case that they didn’t have the means to credibly answer, they all fell silent.  You yourself, PZ, were offered a copy of TIA for review, but you weren’t interested, you’d rather just complain about the Creation Museum, the employment practices of fourth-rate colleges, and not being offered pre-release screenings of documentaries than address a substantive and detailed refutation of your atheist icons.  So, how in the name of St. Darwin of the Galapagos are the producers of <i>Expelled</i> not justified in doing likewise and ignoring you and your fellow scientists?</p><p>Furthermore, it’s generally not left to the condemned to judge the case against him on its merits.</p><p>UPDATE – Since he’s not busy watching movies, it seems PZ has the time to weigh in on <a href=\"http://scienceblogs.com/pharyngula/2008/03/beale_vs_plait.php#comments\">the matter of dark matter</a>.</p></div>",
  "content_text": "Not even a woman scorned is as upset as\nthe would-be scientific expert who is ignored as irrelevant\n:\nIf the producers of Expelled are so confident that they can make a strong case of conspiracy against scientists, then before they start showing this to uninformed politicians, they ought to screen it before scientists and historians and philosophers of science, who will be able to judge it on its merits.\nBecause, PZ, as we’ve already seen with TIA, whenever someone does make a strong case against secular scientists or atheists, these self-proclaimed champions of intellectual discourse suddenly go silent and try to pretend they’ve never heard of it.  Dawkins was happy to write posts about TIA being “a flea” before it was published, Harris was perfectly happy to answer questions via email before it was published, a number of richarddawkins.net atheists were announcing their intention of doing chapter by chapter rebuttals of this little flea book… some of them even started on them.\nAnd then, upon discovering that they were confronted by a strong case that they didn’t have the means to credibly answer, they all fell silent.  You yourself, PZ, were offered a copy of TIA for review, but you weren’t interested, you’d rather just complain about the Creation Museum, the employment practices of fourth-rate colleges, and not being offered pre-release screenings of documentaries than address a substantive and detailed refutation of your atheist icons.  So, how in the name of St. Darwin of the Galapagos are the producers of\nExpelled\nnot justified in doing likewise and ignoring you and your fellow scientists?\nFurthermore, it’s generally not left to the condemned to judge the case against him on its merits.\nUPDATE – Since he’s not busy watching movies, it seems PZ has the time to weigh in on\nthe matter of dark matter\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-09T19:31:00+00:00"
}