{
  "url": "https://voxday.net/2008/03/11/sam-harris-responds/",
  "scraped_at": "2026-01-08T22:15:08.547073",
  "title": "Sam Harris responds",
  "date_display": "March 11, 2008",
  "date_iso": "2008-03-11T10:06:00+00:00",
  "date_from_url": "2008-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As anyone who has read TIA knows, I’m not exactly what you would call respectful of Sam Harris’s performance in <i>The End of Faith</i> and <i>Letter to a Christian Nation</i>.  But to his great credit, he’s not afraid to answer substantive and very specific questions about his work.  We even discussed the possibility of a debate in Europe, but while he’s open to the idea, he’s understandably busy completing his dissertation now, so perhaps we’ll do it next year.</p><p>Here are his responses, I’ll let you chew on them today and will post my take on them tomorrow:</p><blockquote><p><i>1.  When you wrote the Red State/Blue State argument quoted by Richard Dawkins in <i>The God Delusion</i>, were you aware that the electoral data for the various counties in which the various cities mentioned are located was available?  If you were not, are you willing to concede that the more accurate county data supports a conclusion that is the precise opposite of the one you reached in <i>Letter to a Christian Nation</i>?</i></p><p>I haven’t seen the electoral data you mentioned. Feel free to send a link, if you have one.</p><p><i>2.  Are you willing to admit that religion is not the explicit cause of more than 90 percent of the war throughout recorded human history?  Are you also willing to admit that religious faith is not a significant aspect of military strategy, tactics, recruitment or discipline?</i></p><p>I wouldn’t be able to quantify this, but I freely admit that religion is not the only explicit cause of war and it probably is not the main cause. I would say that tribalism generally is the cause, and religious tribalism is a subset. Still, I think religion creates the most energetic and pathological forms of tribalism, and it is the form I am most worried about in the future. The other forms are showing clear signs of evaporating (racism, nationalism, etc.). Religion is the only one that has very good defenses against modernity.</p><p><i>3.  Were you aware that the professional historians’ estimated bodycount of the most deadly Inquisition, the Spanish, was less than 3,000 deaths over 345 years when you described the inquisition as one of the two “darkest episodes in the history of faith”?  I’d also be interested in knowing your understanding of the inquisition’s lethality at the time you wrote that.</i></p><p>I wrote about the Inquisition as a whole (not just the Spanish). Here is what I said in The End of Faith (p.87)  Witches,in all likelihood, did not even exist, and those murdered in their stead numbered perhaps 40,000 to 50,000 over three hundred years of persecution;19  Along with the associated endnote (p. 255). 19 R. Briggs, Witches and Neighbors: The Social and Cultural Context of European Witchcraft(New York:Viking,1996), has this to say on the <br>subject:</br></p><p>“On the wilder shores of the feminist and witch-cult movements a potent myth has become established, to the effect that 9 million women were burned as witches in Europe; gendercide rather than genocide. This is an overestimate by a factor of up to 200, for the most reasonable modern estimates suggest perhaps 100,000 trials between 1450 and 1750, with something between 40,000 and 50,000 executions, of which 20 to 25 percent were men.”</p><p>Such a revaluation of numbers does little to mitigate the horror and injustice of this period. Even to read of the Salem witch trials, which resulted in the hanging of “only” nineteen people, is to be brought face to face with the seemingly boundless evil that is apt to fill the voids in our understanding of the world.</p><p><i>4.  How does your long-term vision of world government differ from Bertrand Russell’s?  Why are you opposed to American national sovereignty?</i></p><p>I’ve forgotten what BR said about world government. And my brief comments on the subject were made with the full knowledge that it is unlikely to be desirable or practical any time soon. In the meantime, I am not opposed to American sovereignty. I’m opposed to nationalism (because it is idiotic), but I am not opposed to safeguarding civilization. For what it’s worth, I think we need to put even more resources into our military than we do.</p><p><i>5.  Are there other forms of “unjustified belief” or “an absence of rationality” than religious faith?</i></p><p>Of course.</p><p><i>6.  Did you forget that you had defined Buddhism as not being a religion of faith when you compared the societal health of the U.S.A. to that of “the least religious states”?</i></p><p>But I said that most Buddhists don’t realize this and practice Buddhism like a religion.</p><p><i>7.  If the world is genuinely imperiled by nuclear weaponry in the hands of religious individuals, isn’t it true that science is as much to blame as religion?  And if the peril is both imminent and genuine, wouldn’t it be more practical and far less costly in terms of human life to end science rather than religion?</i></p><p>You are committing a genetic fallacy here. The problem with Nazis, for instance, was not the railroads and ovens. The problem was their beliefs (and subsequent actions). Blaming the technology (or its source in science) misses the point. That said, I believe that certain types of scientific information should not be published (and there may be some that should not be sought in the first place) — things like the recipe for synthesizing the smallpox virus, etc.</p></blockquote><p>As I said, I’ll provide my take on these answers tomorrow, but they reveal two interesting things.  First, I no longer suspect Sam Harris is intellectually dishonest, it’s pretty clear that he’s merely – let’s be polite – imprecise.  It’s this imprecision which led to the various contrary definitions and tautologies as well as creating the occasional impression of duplicity in his writing; it also explains why he so frequently complains of being misunderstood.  And he is correct, actually, because when he writes two inherently contradictory statements, the reader cannot correctly understand the one without being forced to misunderstand the other.</p><p>Second, his willingness to explain himself and take concrete positions leaves a lot of his defenders out to dry.  They’re far less honest than he is and are wholly dependent upon being able to dance between one contradictory explanation and the next in order to cry strawman, so his answers tend to leave them pinned down and exposed.</p></div>",
  "content_text": "As anyone who has read TIA knows, I’m not exactly what you would call respectful of Sam Harris’s performance in\nThe End of Faith\nand\nLetter to a Christian Nation\n.  But to his great credit, he’s not afraid to answer substantive and very specific questions about his work.  We even discussed the possibility of a debate in Europe, but while he’s open to the idea, he’s understandably busy completing his dissertation now, so perhaps we’ll do it next year.\nHere are his responses, I’ll let you chew on them today and will post my take on them tomorrow:\n1.  When you wrote the Red State/Blue State argument quoted by Richard Dawkins in\nThe God Delusion\n, were you aware that the electoral data for the various counties in which the various cities mentioned are located was available?  If you were not, are you willing to concede that the more accurate county data supports a conclusion that is the precise opposite of the one you reached in\nLetter to a Christian Nation\n?\nI haven’t seen the electoral data you mentioned. Feel free to send a link, if you have one.\n2.  Are you willing to admit that religion is not the explicit cause of more than 90 percent of the war throughout recorded human history?  Are you also willing to admit that religious faith is not a significant aspect of military strategy, tactics, recruitment or discipline?\nI wouldn’t be able to quantify this, but I freely admit that religion is not the only explicit cause of war and it probably is not the main cause. I would say that tribalism generally is the cause, and religious tribalism is a subset. Still, I think religion creates the most energetic and pathological forms of tribalism, and it is the form I am most worried about in the future. The other forms are showing clear signs of evaporating (racism, nationalism, etc.). Religion is the only one that has very good defenses against modernity.\n3.  Were you aware that the professional historians’ estimated bodycount of the most deadly Inquisition, the Spanish, was less than 3,000 deaths over 345 years when you described the inquisition as one of the two “darkest episodes in the history of faith”?  I’d also be interested in knowing your understanding of the inquisition’s lethality at the time you wrote that.\nI wrote about the Inquisition as a whole (not just the Spanish). Here is what I said in The End of Faith (p.87)  Witches,in all likelihood, did not even exist, and those murdered in their stead numbered perhaps 40,000 to 50,000 over three hundred years of persecution;19  Along with the associated endnote (p. 255). 19 R. Briggs, Witches and Neighbors: The Social and Cultural Context of European Witchcraft(New York:Viking,1996), has this to say on the\nsubject:\n“On the wilder shores of the feminist and witch-cult movements a potent myth has become established, to the effect that 9 million women were burned as witches in Europe; gendercide rather than genocide. This is an overestimate by a factor of up to 200, for the most reasonable modern estimates suggest perhaps 100,000 trials between 1450 and 1750, with something between 40,000 and 50,000 executions, of which 20 to 25 percent were men.”\nSuch a revaluation of numbers does little to mitigate the horror and injustice of this period. Even to read of the Salem witch trials, which resulted in the hanging of “only” nineteen people, is to be brought face to face with the seemingly boundless evil that is apt to fill the voids in our understanding of the world.\n4.  How does your long-term vision of world government differ from Bertrand Russell’s?  Why are you opposed to American national sovereignty?\nI’ve forgotten what BR said about world government. And my brief comments on the subject were made with the full knowledge that it is unlikely to be desirable or practical any time soon. In the meantime, I am not opposed to American sovereignty. I’m opposed to nationalism (because it is idiotic), but I am not opposed to safeguarding civilization. For what it’s worth, I think we need to put even more resources into our military than we do.\n5.  Are there other forms of “unjustified belief” or “an absence of rationality” than religious faith?\nOf course.\n6.  Did you forget that you had defined Buddhism as not being a religion of faith when you compared the societal health of the U.S.A. to that of “the least religious states”?\nBut I said that most Buddhists don’t realize this and practice Buddhism like a religion.\n7.  If the world is genuinely imperiled by nuclear weaponry in the hands of religious individuals, isn’t it true that science is as much to blame as religion?  And if the peril is both imminent and genuine, wouldn’t it be more practical and far less costly in terms of human life to end science rather than religion?\nYou are committing a genetic fallacy here. The problem with Nazis, for instance, was not the railroads and ovens. The problem was their beliefs (and subsequent actions). Blaming the technology (or its source in science) misses the point. That said, I believe that certain types of scientific information should not be published (and there may be some that should not be sought in the first place) — things like the recipe for synthesizing the smallpox virus, etc.\nAs I said, I’ll provide my take on these answers tomorrow, but they reveal two interesting things.  First, I no longer suspect Sam Harris is intellectually dishonest, it’s pretty clear that he’s merely – let’s be polite – imprecise.  It’s this imprecision which led to the various contrary definitions and tautologies as well as creating the occasional impression of duplicity in his writing; it also explains why he so frequently complains of being misunderstood.  And he is correct, actually, because when he writes two inherently contradictory statements, the reader cannot correctly understand the one without being forced to misunderstand the other.\nSecond, his willingness to explain himself and take concrete positions leaves a lot of his defenders out to dry.  They’re far less honest than he is and are wholly dependent upon being able to dance between one contradictory explanation and the next in order to cry strawman, so his answers tend to leave them pinned down and exposed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-11T10:06:00+00:00"
}