{
  "url": "https://voxday.net/2008/03/23/science-bites-dust-again/",
  "scraped_at": "2026-01-08T22:16:40.797362",
  "title": "“Science” bites the dust… again",
  "date_display": "March 23, 2008",
  "date_iso": "2008-03-23T22:12:00+00:00",
  "date_from_url": "2008-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The amusing thing is that on the science blogs, they’re still yammering on about <a href=\"http://www.theaustralian.news.com.au/story/0,25197,23411799-7583,00.html\">the “scientific fact” of greenhouse gas-caused global warming</a>:</p><blockquote><p>Last Monday – on ABC Radio National, of all places – there was a tipping point of a different kind in the debate on climate change. It was a remarkable interview involving the co-host of Counterpoint, Michael Duffy and Jennifer Marohasy, a biologist and senior fellow of Melbourne-based think tank the Institute of Public Affairs. Anyone in public life who takes a position on the greenhouse gas hypothesis will ignore it at their peril.</p><p>Duffy asked Marohasy: “Is the Earth still warming?”</p><p>She replied: “No, actually, there has been cooling, if you take 1998 as your point of reference. If you take 2002 as your point of reference, then temperatures have plateaued. This is certainly not what you’d expect if carbon dioxide is driving temperature because carbon dioxide levels have been increasing but temperatures have actually been coming down over the last 10 years.”</p><p>Duffy: “Is this a matter of any controversy?”</p><p>Marohasy: “Actually, no. The head of the IPCC (Intergovernmental Panel on Climate Change) has actually acknowledged it. He talks about the apparent plateau in temperatures so far this century. So he recognises that in this century, over the past eight years, temperatures have plateaued … This is not what you’d expect, as I said, because if carbon dioxide is driving temperature then you’d expect that, given carbon dioxide levels have been continuing to increase, temperatures should be going up … So (it’s) very unexpected, not something that’s being discussed. It should be being discussed, though, because it’s very significant.”</p><p>Duffy: “It’s not only that it’s not discussed. We never hear it, do we? Whenever there’s any sort of weather event that can be linked into the global warming orthodoxy, it’s put on the front page. But a fact like that, which is that global warming stopped a decade ago, is virtually never reported, which is extraordinary.”</p></blockquote><p>So, let’s see.  Embryonic stem cell research, check.  Dark matter, check.  Global warming, check.  Evolution, okay, jury’s still out.  These days, skepticism is the only rational perspective for the intelligent layman to regard what passes for science today.</p><p>It seems to me that the more you understand the “science”, the more likely you are to completely fail to see the flaws in the consensus model.  This tends to remind me of economics, where all the experts habitually deny that a recession is approaching until they decide post-facto that we’ve been in one for three quarters.  I’ve been saving some of the housing forecasts from NAR’s chief economist and they make for hilarious reading when you compare them to the NAR reports that cover the period predicted.</p><p>According to the “scientific” forecast, housing prices were to stabilize in late 2007 and hold firm in 2008.  Here’s the November 2007 forecast for 2008: <i>“Existing-home prices are expected to decline 1.7 percent to a median of $218,200 for all of this year and hold essentially even in 2008 at $218,300.</i> Wow, what precision!  To a tenth of a percent!  The February report comes out this week… let’s just say that instead of $218k, I’m expecting a decline that would project to $175k or less by the end of the year.  But what do I know, I’m not an “expert” paying close attention to the “science” of the housing market, after all.</p><p>For those of you who find my evolutionary skepticism upsetting, please try to grasp that it has nothing to do with my religion, but rather is born of my understanding of the problems inherent to complex models with a high degree of variability and low levels of verifiable data.  I received a sophisticated economics education long before I became a Christian.  In fact, I have come to be convinced that it is the simplistic nature of the training for the biological sciences that causes most evolutionists to vastly overestimate the value and precision of their current models and massively underestimate the probability that they will have to serious overhaul them, if not entirely abandon them.</p><p>But regardless, don’t mind me, I’m far too busy enjoying the massive discomfiture of the neo-Keynesians to seriously annoy you right now.  Notice that I’m far from the only one who <a href=\"http://www.mises.org/story/1789\">sees a connection between the two scientific faiths of Keynesianism and Darwinism</a>; I’d very much like to hear Paul Krugman attempt to explain away the current economic situation in terms he has not previously described as “religious”.</p></div>",
  "content_text": "The amusing thing is that on the science blogs, they’re still yammering on about\nthe “scientific fact” of greenhouse gas-caused global warming\n:\nLast Monday – on ABC Radio National, of all places – there was a tipping point of a different kind in the debate on climate change. It was a remarkable interview involving the co-host of Counterpoint, Michael Duffy and Jennifer Marohasy, a biologist and senior fellow of Melbourne-based think tank the Institute of Public Affairs. Anyone in public life who takes a position on the greenhouse gas hypothesis will ignore it at their peril.\nDuffy asked Marohasy: “Is the Earth still warming?”\nShe replied: “No, actually, there has been cooling, if you take 1998 as your point of reference. If you take 2002 as your point of reference, then temperatures have plateaued. This is certainly not what you’d expect if carbon dioxide is driving temperature because carbon dioxide levels have been increasing but temperatures have actually been coming down over the last 10 years.”\nDuffy: “Is this a matter of any controversy?”\nMarohasy: “Actually, no. The head of the IPCC (Intergovernmental Panel on Climate Change) has actually acknowledged it. He talks about the apparent plateau in temperatures so far this century. So he recognises that in this century, over the past eight years, temperatures have plateaued … This is not what you’d expect, as I said, because if carbon dioxide is driving temperature then you’d expect that, given carbon dioxide levels have been continuing to increase, temperatures should be going up … So (it’s) very unexpected, not something that’s being discussed. It should be being discussed, though, because it’s very significant.”\nDuffy: “It’s not only that it’s not discussed. We never hear it, do we? Whenever there’s any sort of weather event that can be linked into the global warming orthodoxy, it’s put on the front page. But a fact like that, which is that global warming stopped a decade ago, is virtually never reported, which is extraordinary.”\nSo, let’s see.  Embryonic stem cell research, check.  Dark matter, check.  Global warming, check.  Evolution, okay, jury’s still out.  These days, skepticism is the only rational perspective for the intelligent layman to regard what passes for science today.\nIt seems to me that the more you understand the “science”, the more likely you are to completely fail to see the flaws in the consensus model.  This tends to remind me of economics, where all the experts habitually deny that a recession is approaching until they decide post-facto that we’ve been in one for three quarters.  I’ve been saving some of the housing forecasts from NAR’s chief economist and they make for hilarious reading when you compare them to the NAR reports that cover the period predicted.\nAccording to the “scientific” forecast, housing prices were to stabilize in late 2007 and hold firm in 2008.  Here’s the November 2007 forecast for 2008:\n“Existing-home prices are expected to decline 1.7 percent to a median of $218,200 for all of this year and hold essentially even in 2008 at $218,300.\nWow, what precision!  To a tenth of a percent!  The February report comes out this week… let’s just say that instead of $218k, I’m expecting a decline that would project to $175k or less by the end of the year.  But what do I know, I’m not an “expert” paying close attention to the “science” of the housing market, after all.\nFor those of you who find my evolutionary skepticism upsetting, please try to grasp that it has nothing to do with my religion, but rather is born of my understanding of the problems inherent to complex models with a high degree of variability and low levels of verifiable data.  I received a sophisticated economics education long before I became a Christian.  In fact, I have come to be convinced that it is the simplistic nature of the training for the biological sciences that causes most evolutionists to vastly overestimate the value and precision of their current models and massively underestimate the probability that they will have to serious overhaul them, if not entirely abandon them.\nBut regardless, don’t mind me, I’m far too busy enjoying the massive discomfiture of the neo-Keynesians to seriously annoy you right now.  Notice that I’m far from the only one who\nsees a connection between the two scientific faiths of Keynesianism and Darwinism\n; I’d very much like to hear Paul Krugman attempt to explain away the current economic situation in terms he has not previously described as “religious”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-23T22:12:00+00:00"
}