{
  "url": "https://voxday.net/2008/03/15/showman/",
  "scraped_at": "2026-01-08T22:15:42.034895",
  "title": "The showman",
  "date_display": "March 15, 2008",
  "date_iso": "2008-03-15T17:17:00+00:00",
  "date_from_url": "2008-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I enjoyed WFB’s sense of humor, but I always suspected <a href=\"http://cavett.blogs.nytimes.com/2008/03/14/uncommoner-than-thou-buckley-part-two/index.html\">he was a bit of a charlatan</a>.  One can’t be a TV intellectual and not carry somewhat of the carnie in one’s veins.  Pretending to knowledge that you don’t actually possess is one of the temptations of the highly intelligent and highly educated; because most people aren’t inclined to risk testing you, you can count on getting away with it most of the time.</p><blockquote><p>Buckley enjoyed tossing literary references into the conversation; a habit not always guaranteed to make friends. Once, in answer to something I said, he injected, “As Oscar Wilde said, ‘Hypocrisy is the compliment that vice pays to virtue.”</p><p>A fine and witty remark to be sure, but one you wouldn’t be wise to depend on as your opening gag in your nightclub act. And one I would guess he knew it might take the rest of us a moment to fully “get.” If then.</p><p>But that’s not what bothered me about it. A little voice in me whispered, “Is that Oscar Wilde?” In one of those bizarre coincidences life tickles us with, a French friend had given me, two days before, a volume of famous “Citations” (see tahss ee own) by French wits. Try real hard to believe that among the half dozen she had checkmarked as favorites was that one. Yes. The alleged Wilde.</p></blockquote><p>A fair word of warning: I almost never bluff.  I prefer to do the precise opposite of Buckley, which is to quote references without signaling the reader or the listener.  I still can’t believe that no one has picked up on a totally appropriate TIA reference to the best song by one of the two greatest Wax Trax! bands.  So few are bright enough to grasp the full extent of my brilliance….</p><p>Upon further review, make that three greatest.  I forgot Laibach.  Caribou!  Anyhow, in general, always be dubious whenever someone attributes a quote to Wilde, Lincoln or Churchill, they seem to be three perennial favorites among quote-fakers.  Whenever I’m dubious about the validity of a quote, I simply ask the quoter what work the quote first appeared in.  This usually prompts a speedy admission that not only do they not know, but that they’re not actually sure the person quoted said whatever it was they were supposed to have said.</p><p>Public display via literary reference is somewhat of a stupid game anyhow.  That’s why although I keep a few conventional showstoppers on hand, I prefer to rely on quoting one of history’s great philosophers, Chuck D of Public Enemy.  There’s almost no situation in which a PE quote is not “in full E-F-F-E-C-T otherwise known as ‘effect'”.  If “there’s a five-letter word to describe her character” doesn’t fit, “the reasons are several, most of them federal” probably will.</p><p>Or better yet, just make up something ludicrous and attribute it to someone wildly implausible.  That works too.</p></div>",
  "content_text": "I enjoyed WFB’s sense of humor, but I always suspected\nhe was a bit of a charlatan\n.  One can’t be a TV intellectual and not carry somewhat of the carnie in one’s veins.  Pretending to knowledge that you don’t actually possess is one of the temptations of the highly intelligent and highly educated; because most people aren’t inclined to risk testing you, you can count on getting away with it most of the time.\nBuckley enjoyed tossing literary references into the conversation; a habit not always guaranteed to make friends. Once, in answer to something I said, he injected, “As Oscar Wilde said, ‘Hypocrisy is the compliment that vice pays to virtue.”\nA fine and witty remark to be sure, but one you wouldn’t be wise to depend on as your opening gag in your nightclub act. And one I would guess he knew it might take the rest of us a moment to fully “get.” If then.\nBut that’s not what bothered me about it. A little voice in me whispered, “Is that Oscar Wilde?” In one of those bizarre coincidences life tickles us with, a French friend had given me, two days before, a volume of famous “Citations” (see tahss ee own) by French wits. Try real hard to believe that among the half dozen she had checkmarked as favorites was that one. Yes. The alleged Wilde.\nA fair word of warning: I almost never bluff.  I prefer to do the precise opposite of Buckley, which is to quote references without signaling the reader or the listener.  I still can’t believe that no one has picked up on a totally appropriate TIA reference to the best song by one of the two greatest Wax Trax! bands.  So few are bright enough to grasp the full extent of my brilliance….\nUpon further review, make that three greatest.  I forgot Laibach.  Caribou!  Anyhow, in general, always be dubious whenever someone attributes a quote to Wilde, Lincoln or Churchill, they seem to be three perennial favorites among quote-fakers.  Whenever I’m dubious about the validity of a quote, I simply ask the quoter what work the quote first appeared in.  This usually prompts a speedy admission that not only do they not know, but that they’re not actually sure the person quoted said whatever it was they were supposed to have said.\nPublic display via literary reference is somewhat of a stupid game anyhow.  That’s why although I keep a few conventional showstoppers on hand, I prefer to rely on quoting one of history’s great philosophers, Chuck D of Public Enemy.  There’s almost no situation in which a PE quote is not “in full E-F-F-E-C-T otherwise known as ‘effect'”.  If “there’s a five-letter word to describe her character” doesn’t fit, “the reasons are several, most of them federal” probably will.\nOr better yet, just make up something ludicrous and attribute it to someone wildly implausible.  That works too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-15T17:17:00+00:00"
}