{
  "url": "https://voxday.net/2008/03/24/stolen-fruit-of-pre-enlightenmen/",
  "scraped_at": "2026-01-08T22:16:48.172439",
  "title": "The stolen fruit of the pre-Enlightenment",
  "date_display": "March 24, 2008",
  "date_iso": "2008-03-24T15:15:00+00:00",
  "date_from_url": "2008-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Hatfield defends the Age of Enlightenment and a few of the modern myths about it:</p><blockquote><p>There are positive values that come out of the Age of Enlightenment. Some of them are religious in nature, some are not, but they are characteristic of that age, not of the age of the Magna Carta or the tradition of English common law.</p></blockquote><p>Very well, specifically what are these positive values?  One of the most annoying things about discussing the Enlightenment, especially with its would-be restorers, is that they simply don’t know enough about it was to be specific about what it is they are defending.  In almost every case, what is purported to be a positive “Enlightenment value” can be easily proven to be nothing of the sort, as we saw with Kelly of the RRS’s bizarre example of “democracy”.  The level of historical ignorance is shocking.</p><blockquote><p>If things would just arrange themselves neatly into Christian and non-Christian intellectual movements the world would be a simpler place, but that’s not how things are. Cherry-picking the past to serve a present agenda is not the right way to do history, and that goes for both the secularist and dominionist takes on the Founding Fathers, I think.</p></blockquote><p>First, I am no dominionist, my amusingly inaccurate Wikipedia entry notwithstanding.  Second, it is not cherry-picking to point out that the religious intellectual tradition of the Christian Founding Fathers which led to the separation of church and state – for the good of the church – had nothing to do with the Enlightenment, but rather stemmed from the pre-Enlightenment Reform tradition that was hugely influential in England.</p><blockquote><p>Don’t play games. The notion that God places temporal rulers in their position is a clear teaching found throughout the Bible. The idea that people should rise up against their God-appointed rulers to seek political liberty is not clearly taught. It has to be teased out of the text by someone whose sensibilities are modern, rather than medieval. That idea emerged in the period known as the Age of Enlightenment. It is not an anti-Christian idea, but neither is it the one, true, historic ‘Christian’ position. If it were, there would innumerable examples in the 17 centuries that proceeded John Locke of Christian nations with elected rulers.</p></blockquote><p>Don’t play historically ignorant.  There is a small, pre-Enlightenment movement called “Protestant” which even in its name suggests that people should rise up against those claiming to be their God-appointed rulers.  I note that you can’t possibly argue a distinction between spiritual and secular ruler here, because that would depend on applying a concept that you are claiming did not exist for another 200 years.  And in addition to the rebellious pre-Enlightenment traditions of the Magna Charta and the Bill of Rights, medieval England also gave us the limited government concept of the Charter of Liberties, which dates back to 1100.  The Enlightenment was merely a short-lived and perverse offshoot of this combination of Christian intellectual movements in the spiritual and secular arenas.</p><p>I should like to know, Scott, were you aware of the existence of the pre-Enlightenment English Bill of Rights when you declared the American Bill of Rights to be a product of the Enlightenment?</p><p>As for the example of Christian nations with elected rulers, I would point to the Prince-Electors of Germany, who made up the <i>electoral college</i> responsible for selecting the Holy Roman Emperor from 1125 until 1806 when Napoleon ended the practice, along, one might add, with the Enlightenment itself.  Moreover, the cantons of Switzerland long had a Christian tradition of elected rule, dating back prior to the establishment of the confederation in 1271.  This Swiss tradition was extremely influential due to Geneva being the heart of the Reform church, in fact, John Calvin’s biography notes: <i>“Calvin was the first of the Reformers to demand complete separation between Church and State, and thus he advanced another principle which has been of inestimable value. The German Reformation was decided by the will of the princes; the Swiss Reformation, by the will of the people; although in each case there was a sympathy between the rulers and the majority of the population. The Swiss Reformers, however, living in the republic at Geneva, developed a free Church in a free State, while Luther and Melanchthon, with their native reverence for monarchial institutions and the German Empire, taught passive obedience in politics and brought the Church under bondage to the civil authority.”</i></p><p>Now, it seems probable that the reason the two Reformations happened to occur where they did is primarily due to pagan Germanic tribal traditions that survived the conversion to Christianity, although it’s worth noting that the establishment of the democratic Icelandic Althing closely corresponds to Iceland’s conversion to Christianity.  But regardless, the concepts that came out of this process of Reformation clearly became Christian ones that long preceded the Age of Enlightenment and it is absurd to attempt to retroactively assign them to a profoundly anti-democratic, anti-individualistic tradition such as the Enlightenment.</p></div>",
  "content_text": "Scott Hatfield defends the Age of Enlightenment and a few of the modern myths about it:\nThere are positive values that come out of the Age of Enlightenment. Some of them are religious in nature, some are not, but they are characteristic of that age, not of the age of the Magna Carta or the tradition of English common law.\nVery well, specifically what are these positive values?  One of the most annoying things about discussing the Enlightenment, especially with its would-be restorers, is that they simply don’t know enough about it was to be specific about what it is they are defending.  In almost every case, what is purported to be a positive “Enlightenment value” can be easily proven to be nothing of the sort, as we saw with Kelly of the RRS’s bizarre example of “democracy”.  The level of historical ignorance is shocking.\nIf things would just arrange themselves neatly into Christian and non-Christian intellectual movements the world would be a simpler place, but that’s not how things are. Cherry-picking the past to serve a present agenda is not the right way to do history, and that goes for both the secularist and dominionist takes on the Founding Fathers, I think.\nFirst, I am no dominionist, my amusingly inaccurate Wikipedia entry notwithstanding.  Second, it is not cherry-picking to point out that the religious intellectual tradition of the Christian Founding Fathers which led to the separation of church and state – for the good of the church – had nothing to do with the Enlightenment, but rather stemmed from the pre-Enlightenment Reform tradition that was hugely influential in England.\nDon’t play games. The notion that God places temporal rulers in their position is a clear teaching found throughout the Bible. The idea that people should rise up against their God-appointed rulers to seek political liberty is not clearly taught. It has to be teased out of the text by someone whose sensibilities are modern, rather than medieval. That idea emerged in the period known as the Age of Enlightenment. It is not an anti-Christian idea, but neither is it the one, true, historic ‘Christian’ position. If it were, there would innumerable examples in the 17 centuries that proceeded John Locke of Christian nations with elected rulers.\nDon’t play historically ignorant.  There is a small, pre-Enlightenment movement called “Protestant” which even in its name suggests that people should rise up against those claiming to be their God-appointed rulers.  I note that you can’t possibly argue a distinction between spiritual and secular ruler here, because that would depend on applying a concept that you are claiming did not exist for another 200 years.  And in addition to the rebellious pre-Enlightenment traditions of the Magna Charta and the Bill of Rights, medieval England also gave us the limited government concept of the Charter of Liberties, which dates back to 1100.  The Enlightenment was merely a short-lived and perverse offshoot of this combination of Christian intellectual movements in the spiritual and secular arenas.\nI should like to know, Scott, were you aware of the existence of the pre-Enlightenment English Bill of Rights when you declared the American Bill of Rights to be a product of the Enlightenment?\nAs for the example of Christian nations with elected rulers, I would point to the Prince-Electors of Germany, who made up the\nelectoral college\nresponsible for selecting the Holy Roman Emperor from 1125 until 1806 when Napoleon ended the practice, along, one might add, with the Enlightenment itself.  Moreover, the cantons of Switzerland long had a Christian tradition of elected rule, dating back prior to the establishment of the confederation in 1271.  This Swiss tradition was extremely influential due to Geneva being the heart of the Reform church, in fact, John Calvin’s biography notes:\n“Calvin was the first of the Reformers to demand complete separation between Church and State, and thus he advanced another principle which has been of inestimable value. The German Reformation was decided by the will of the princes; the Swiss Reformation, by the will of the people; although in each case there was a sympathy between the rulers and the majority of the population. The Swiss Reformers, however, living in the republic at Geneva, developed a free Church in a free State, while Luther and Melanchthon, with their native reverence for monarchial institutions and the German Empire, taught passive obedience in politics and brought the Church under bondage to the civil authority.”\nNow, it seems probable that the reason the two Reformations happened to occur where they did is primarily due to pagan Germanic tribal traditions that survived the conversion to Christianity, although it’s worth noting that the establishment of the democratic Icelandic Althing closely corresponds to Iceland’s conversion to Christianity.  But regardless, the concepts that came out of this process of Reformation clearly became Christian ones that long preceded the Age of Enlightenment and it is absurd to attempt to retroactively assign them to a profoundly anti-democratic, anti-individualistic tradition such as the Enlightenment.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-24T15:15:00+00:00"
}