{
  "url": "https://voxday.net/2008/03/16/tia-deeply-clueless-critic/",
  "scraped_at": "2026-01-08T22:15:45.765711",
  "title": "TIA: a deeply clueless critic",
  "date_display": "March 16, 2008",
  "date_iso": "2008-03-16T15:09:00+00:00",
  "date_from_url": "2008-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned previously, I’m going to let Evangelical Realism finish his review of TIA before responding to it in its entirety, but since I had a request to respond to one of his more amusing attempts, I shall do so here.  It should demonstrate the truth of my battleground aphorism: <a href=\"http://realevang.wordpress.com/2008/03/11/tia-hoping-something-sticks/\">the best strategy is an incompetent enemy</a>:</p><blockquote><p> I think I’m becoming more familiar with Vox Day’s style of argumentation: just throw a bunch of nasty stuff and hope something sticks. Chapter 5 of The Irrational Atheist is a good example, and it opens with a tasty bit of ad hominem.</p><p><i>In the historical introduction to his famous military treatise, the Chinese general Sun Tzu advised the wise general to lure his opponent from ground where the opponent holds a strong position in the hopes of being able to attack him in a weaker one. It is interesting to see that Sam Harris and Richard Dawkins both make inadvertent use of this tactic with their mutual assertion that religious faith bears responsibility for enabling the making of war even when it is not, in itself, a primary cause of conflict. It is also ironic, given their near total ignorance of military history and the art of war.</i></p><p>Now we know what sort of role Vox wants to cast Harris and Dawkins in: that of ignorant buffoons pontificating about subjects they know nothing about. I’d be tempted to mention something about pots and kettles, if Vox had been able to demonstrate any actual ignorance on Harris’ and Dawkins’ part, but it seems that their “errors” are not so much factual contradictions as they are merely the “mistake” of looking at things differently than Vox does.</p></blockquote><p> A truthful statement relevant to the matter under discussion is not an <i>ad hominem</i> attack.  Neither Sam Harris nor Richard Dawkins know the first thing about military history or military science and I expect they would admit as much when asked.  Second, notice that Evangelical Realism is a deeply dishonest reviewer.  He repeatedly attempts to hold me to a completely different standard than he holds Harris, Dawkins and the others, moreover, he is too ignorant of military history to understand the way in which their errors demonstrate their obvious lack of knowledge about the subject.  ER makes no attempt to demonstrate that Harris and Dawkins possess any knowledge of military history or military science whatsoever – he can’t, because there is absolutely no evidence for it and a fair amount to the contrary – moreover, he is clearly unaware that Harris already conceded the larger point that he is attempting to defend in the Fighting Withdrawal from “religion causes war” to “tribalism causes war”.</p><blockquote><p> He begins by conceding the visible merit of the assertion that it does make a difference whether your soldiers sincerely believe in an afterlife and in glorious rewards for those who die in battle. But even though Harris and Dawkins are actually correct, they’re still wrong. They’re supposed to be ignorant buffoons, after all, so there must be something bad that Vox can say about them:</p><p><i>The First Crusade was a long time ago, it has been more than a thousand years since the massacre at Solomon’s Temple took place. In that millennia [sic], many wars have been fought, very few of which have involved unarmed youth militias inspired by insane devotion to a god. Moreover, from a military perspective, suicide attacks are a negligible tactic.</i></p><p>That’s the “rebuttal.” Faced with the undeniable fact that religious fervor does indeed play a secondary contributory role in war, Vox falls back on the argument that Harris and Dawkins are wrong because religion is not the sole/primary cause of wars.  This rhetorical bait and switch pretty much sums up all of his arguments regarding religion and war.</p></blockquote><p> ER makes two blunders here.  First, I conceded no such thing.  I merely admitted the apparent logic of the argument – which is merely a variant of the “no atheist in foxholes” that so many atheists angrily deny – before stating “even in these examples, one can see the first visible cracks in the argument.”  While it’s quite possible to construct a reasonable logical case for atheist cowardice and theist fearlessness, this is not tantamount to proving the case with evidence.  Neither Dawkins nor Harris ever offer any empirical evidence here in support of their purely philosophical argument.</p><p>His second and much more egregious blunder is to wrongly equate “negligible tactic” and “very few of which have involved” with “secondary contributory role”.  Religion does not play a secondary contributory role in war.  It does not play a tertiary contributory role in war.  It plays virtually no role in war at all, it is not even involved in any way more than 90 percent of the time.  There is no “rhetorical bait-and-switch”, ER either made a huge mistake or he is attempting a shamelessly dishonest substitution himself.</p><blockquote><p> Part of the reason his argument is so weak is because he seems to have mixed feelings on the topic himself. For example, after Harris cites a list of long and bloody sectarian conflicts, Vox responds:</p><p><i>[N]early every example given here includes Muslims. To Sam Harris, all religions might be equally mythical and therefore the same, but it is hard to fail to notice that it is not the Jains, Mormons, Hindus, or Christians who are actively stirring up violence all over the world.</i></p><p>Of course, if it were Christians, or even Jews, showing up in all those contexts, it’s a safe bet he would attribute this to the persecution of God’s chosen people by the forces of evil, but since it’s Muslims, why then it’s only because they’re “actively stirring up violence.” But it shows some of Vox’s mixed feelings that he would join Harris and Dawkins in suggesting a connection between religion (Islam) and violence. Given the choice between rejecting religion and rejecting science however (Chapter 3), Vox would rather get rid of science than get rid of Islam. It’s a tough call, but he has to side with religion against science, because there isn’t any objective, verifiable argument that could be used against one religion that won’t work equally well against them all.</p></blockquote><p> This pair of bizarre statements has nothing to do with anything, except to try to obscure the fact that virtually no religion has historically had much to do with war, if anything, except one.  I have no “mixed feelings” and what I would do or would not do in an alternate universe where Jews are actively waging holy wars across China or Christians are engaged in a bloody crusade to recapture the holy city of Los Angeles is totally irrelevant.  It’s not my fault that ER doesn’t like the empirical evidence provided by some 6,000 years of human warfare.</p><blockquote><p> But, to return to the subject at hand, Vox claims that, of Harris’ list of sectarian conflicts, at least four aren’t religious at all.</p><p>1. The conflict in Palestine is primarily ethnic, not religious…</p><p>2. The conflict in Northern Ireland is primarily ethnic and political, not religious…</p><p>3. Although foreign Muslims have come to the aid of their co-religionists in the Chechen war, the cause has absolutely nothing to do with any religious conflict between the Chechen Muslims and the Orthodox Russians, but the fact that Chechnya has been seeking independence from Russia since it was forcibly annexed in 1870 by Tsar Alexander II…</p><p>4. In Sri Lanka, the political divide is linguistic, not religious. Tamil-speaking Hindus and Christians are allied against Sinhalese-speaking Buddhists and Muslims…</p><p>Now remember, the claim Vox is allegedly rebutting as “near total ignorance” is the claim that religion plays a contributory role in violent group-vs-group conflict. His rebuttal, however, consists of the same old bait-and-switch: the Middle Eastern conflict is not primarily religious; the Northern Ireland conflict is not primarily religious, etc. In other words, he’s completely ignoring the question of what role religion does play in these conflicts; he’d rather talk about what religion is not doing. (And one thing we’ve noted before: it’s certainly not helping!)</p></blockquote><p> ER gets it wrong again here.  The Harris claim I am rebutting here is not “the claim that religion plays a contributory role in violent group-vs-group conflict”, but rather the specific claim that “conflicts that seem driven entirely by territorial concerns, therefore, are often deeply rooted in religion.”  In these four cases, none of the conflicts are rooted in religion at all, let alone deeply.</p><blockquote><p> Vox spends a lot of time talking about factors other than religion which do play a significant role in war; apparently this is supposed to prove that Vox knows more about history than Harris and Dawkins. But it’s really just so much smoke and mirrors, a distraction to divert attention from the question of what role religion does play in generating enthusiasm for wars that might otherwise be more easily recognized as based on prejudice, greed, lust for power, etc. And even with all this hand-waving, Vox still doesn’t get everything quite right.</p><p><i>In a continent with only four religions or religious denominations of note in 1400, Europe was divided into over 1,000 independent political states. This number was reduced by half only 117 years later, at the start of the Protestant Reformation. And while there was certainly an amount of violent interdenominational Christian conflict during the Reformation and Counter-Reformation, it is difficult to imagine that even with the increase in the amount of potential religious conflict, more wars took place than occurred during the century leading up to it, wherein half of the political entities disappeared, swallowed up by their larger, more powerful neighbors.</i></p><p>Why do we need to content ourselves with “imagining” how many wars took place between 1400 and 1517? As Vox states elsewhere in TIA, he has the full 3-volume Encyclopedia of War. Why not just look up the figures? You can bet that if he had actual statistics to back up his claims, he wouldn’t make such vague speculations. But the fact of the matter is, war is not the only way smaller states can unite into larger conglomerates. Did the original Thirteen Colonies become 50 United States by invasion and conquest? Was the current European Union built by bullets and tanks? Diplomacy, economics, union via royal marriages: there are lots of ways of building larger states that do not require open bloodshed.</p></blockquote><p> Yes, a detailed recitation of the other factors almost completely ignored by Dawkins and Harris and apparently unknown to both does, in fact, tend to show that I know a good deal more about the subject than the other two gentlemen.  Sam Harris has gracefully conceded as much by stating his inability to quantify these matters.  Why not just look up the figures for that period?  Because, as I point out in TIA, they are incomplete.  The Encyclopedia lists 90 European wars during that time, but as with the Assyrian wars, one war tends to stand in for several of its type.  For example, the single entry for the German Civil War (1400-1411) actually covers three separate low-level wars between King Wenceslaus of Germany and Bohemia and the Elector of the Palatine, the Margrave of Moravia and his brother, the King of Hungary.  Also, the historical data from that time is far too incomplete to presume that we have an accurate accounting of why each political entity was subsumed, what we do know is that none of the wars at this time could have been religious in nature because there was no religious divide in that area during that period except for the various wars against the Turks.</p><p>ER’s second question is laughable.  If he’d looked at the table in TIA listing every historical U.S. war, he’d know that the answer is yes, the original Thirteen Colonies did become the 50 United States through invasion and conquest.  As it is also stated in TIA, the European Union is not yet a political entity, anyhow, I fully expect it to engage in civil war when one of its member-states attempts to secede in the next decade if it does not collapse first.  There are certainly ways of building larger states peacefully, but a brief survey of any country will readily show that this is far less often the case than the use of violence.</p><blockquote><p> Vox also has problems with the idea of in-group/out-group rivalries.</p><p><i>Most endo-exo rivalries stem from basic territorialism and the will to power, not rival group identities; the champions of reason have it backwards. Consider the rival groups we currently identify as “French” and “German.” As recently as 814, they were a single ethnic group known as “the Franks.” While the French national identity was forged early on, thanks in part to the open geography of France, there was no German nation as such, instead there was only the multiplicity of principalities known collectively and inaccurately as the Holy Roman Empire, which over time came to be dominated by the Austrian Hapsburg dynasty in the south and the Kingdom of Prussia in the north.</i></p><p>It was not until after the Napoleonic wars and the Franco-Prussian wars that anything resembling what we would recognize today as being “Germany” came into existence…</p><p>Is it more reasonable, then, to assume that any latent French hostility towards Germans stems from an out-group identity that didn’t even exist for most of French history, or a simple and understandable distaste for being invaded and slaughtered by a group of distant cousins with a proven historical predilection for doing so?</p><p>Believe it or not, Vox is actually trying to argue that just because the national identities of “French” and “German” didn’t exist until recent times, neither group had any group identity during the time the one group was invading and slaughtering the other! It’s the same bait-and-switch tactic as before: introduce some other factor (territorialism) which also played a role in the conflict, and poof, the other role (group rivalry) has somehow been proven not to have contributed anything significant. Or at least, Vox has attempted to distract our attention from it. Maybe if we ignore it, it will just go away? But even Vox admits that both groups knew which group was invading, and which was being slaughtered, as shown by his question at the end. So the group identity was there, no matter how it was labeled.</p></blockquote><p> ER somehow manages to avoid both significant points here in reaching an errant conclusion.  First, he avoids mentioning the fact that I am using this example to rebut the idea that group identities come from religion, as Harris and Dawkins claim.  In this case, they cannot have, since the identities predate the religious divide.  Second, ER fails to understand that his conclusion has it precisely backwards, because the national group identities stem from the slaughter, the slaughter doesn’t stem from the group identity!  They were all Franks, brother fighting brother and uncle fighting nephew.  The Gallic Franks subsequently called French didn’t hate the Teutonic Franks subsequently called Germans for being not-French, they hated them for being prone to invade them no matter what they were called.  ER’s reasoning is circular.</p><blockquote><p> Vox tries a similar “rebuttal” by suggesting that, if religion plays a role in war, we ought to see higher rates of volunteerism in countries like Iran. For some reason, he declines to take other factors into consideration (i.e. economy, unemployment, ratio of nominal religion vs. sincere belief, etc), and he also omits any reference to the various Islamic militias and paramilitary organizations like Hamas and Al Qaeda. Nor does he make any distinction between the rate of volunteerism in times of peace (when the possibilities of martyrdom are low) versus rates in times of war. No, all he wants to do is throw out a number that he can claim is, in some sense, contrary to what he himself has already conceded to be true: that religion does have an influence on support for, and participation in, violent conflicts.</p></blockquote><p> Notice here again that he criticizes my evidence while defending a position for which no evidence at all is given.  The various militias and paramilitaries are numerically insignificant; neither Hamas nor Al Qaeda are Iranian operations anyhow and so have nothing to do with the evidence presented.</p><blockquote><p> And he reverts to his peculiar predilection for defining things in terms of lists by insisting that if religion contributed anything significant to warfare, we ought to find references to it in the various lists of strategies and tactics compiled by the likes of Caesar, Sun Tzu, and so on. Since they do not include religion in their written lists, Vox concludes that religion has no significant role in warfare. In one fell swoop, Vox invalidates the entire military chaplaincy! Oops.</p></blockquote><p> ER demonstrates both his poor reasoning and his military ignorance here.  Not every aspect of the military has anything to do with strategy and tactics, while the chaplaincy has its place but no one with any knowledge or experience of the military would consider it to be of of any strategic or tactical importance.  Certainly the Waffen SS, the Red Army and the People’s Army never saw any need for it.  Indeed, it is more than a little amusing to imagine a general wondering where to best make use of his chaplains when considering an upcoming engagement.</p><p> UPDATE – ER is more clueless than I’d realized.  He’s now trying to make the bizarre point that admitting the obvious existence of chaplains in some Western armies somehow excuses the complete ignorance of Dawkins and Harris of all things military as they attempt to argue that religious faith is somehow dangerous to mankind.  But military chaplains are a complete irrelevancy, for example, an estimated 2,300 chaplains are known to have served in the Union army, an insignificant fraction of the 2,778,304 troops enlisted.</p></div>",
  "content_text": "As I mentioned previously, I’m going to let Evangelical Realism finish his review of TIA before responding to it in its entirety, but since I had a request to respond to one of his more amusing attempts, I shall do so here.  It should demonstrate the truth of my battleground aphorism:\nthe best strategy is an incompetent enemy\n:\nI think I’m becoming more familiar with Vox Day’s style of argumentation: just throw a bunch of nasty stuff and hope something sticks. Chapter 5 of The Irrational Atheist is a good example, and it opens with a tasty bit of ad hominem.\nIn the historical introduction to his famous military treatise, the Chinese general Sun Tzu advised the wise general to lure his opponent from ground where the opponent holds a strong position in the hopes of being able to attack him in a weaker one. It is interesting to see that Sam Harris and Richard Dawkins both make inadvertent use of this tactic with their mutual assertion that religious faith bears responsibility for enabling the making of war even when it is not, in itself, a primary cause of conflict. It is also ironic, given their near total ignorance of military history and the art of war.\nNow we know what sort of role Vox wants to cast Harris and Dawkins in: that of ignorant buffoons pontificating about subjects they know nothing about. I’d be tempted to mention something about pots and kettles, if Vox had been able to demonstrate any actual ignorance on Harris’ and Dawkins’ part, but it seems that their “errors” are not so much factual contradictions as they are merely the “mistake” of looking at things differently than Vox does.\nA truthful statement relevant to the matter under discussion is not an\nad hominem\nattack.  Neither Sam Harris nor Richard Dawkins know the first thing about military history or military science and I expect they would admit as much when asked.  Second, notice that Evangelical Realism is a deeply dishonest reviewer.  He repeatedly attempts to hold me to a completely different standard than he holds Harris, Dawkins and the others, moreover, he is too ignorant of military history to understand the way in which their errors demonstrate their obvious lack of knowledge about the subject.  ER makes no attempt to demonstrate that Harris and Dawkins possess any knowledge of military history or military science whatsoever – he can’t, because there is absolutely no evidence for it and a fair amount to the contrary – moreover, he is clearly unaware that Harris already conceded the larger point that he is attempting to defend in the Fighting Withdrawal from “religion causes war” to “tribalism causes war”.\nHe begins by conceding the visible merit of the assertion that it does make a difference whether your soldiers sincerely believe in an afterlife and in glorious rewards for those who die in battle. But even though Harris and Dawkins are actually correct, they’re still wrong. They’re supposed to be ignorant buffoons, after all, so there must be something bad that Vox can say about them:\nThe First Crusade was a long time ago, it has been more than a thousand years since the massacre at Solomon’s Temple took place. In that millennia [sic], many wars have been fought, very few of which have involved unarmed youth militias inspired by insane devotion to a god. Moreover, from a military perspective, suicide attacks are a negligible tactic.\nThat’s the “rebuttal.” Faced with the undeniable fact that religious fervor does indeed play a secondary contributory role in war, Vox falls back on the argument that Harris and Dawkins are wrong because religion is not the sole/primary cause of wars.  This rhetorical bait and switch pretty much sums up all of his arguments regarding religion and war.\nER makes two blunders here.  First, I conceded no such thing.  I merely admitted the apparent logic of the argument – which is merely a variant of the “no atheist in foxholes” that so many atheists angrily deny – before stating “even in these examples, one can see the first visible cracks in the argument.”  While it’s quite possible to construct a reasonable logical case for atheist cowardice and theist fearlessness, this is not tantamount to proving the case with evidence.  Neither Dawkins nor Harris ever offer any empirical evidence here in support of their purely philosophical argument.\nHis second and much more egregious blunder is to wrongly equate “negligible tactic” and “very few of which have involved” with “secondary contributory role”.  Religion does not play a secondary contributory role in war.  It does not play a tertiary contributory role in war.  It plays virtually no role in war at all, it is not even involved in any way more than 90 percent of the time.  There is no “rhetorical bait-and-switch”, ER either made a huge mistake or he is attempting a shamelessly dishonest substitution himself.\nPart of the reason his argument is so weak is because he seems to have mixed feelings on the topic himself. For example, after Harris cites a list of long and bloody sectarian conflicts, Vox responds:\n[N]early every example given here includes Muslims. To Sam Harris, all religions might be equally mythical and therefore the same, but it is hard to fail to notice that it is not the Jains, Mormons, Hindus, or Christians who are actively stirring up violence all over the world.\nOf course, if it were Christians, or even Jews, showing up in all those contexts, it’s a safe bet he would attribute this to the persecution of God’s chosen people by the forces of evil, but since it’s Muslims, why then it’s only because they’re “actively stirring up violence.” But it shows some of Vox’s mixed feelings that he would join Harris and Dawkins in suggesting a connection between religion (Islam) and violence. Given the choice between rejecting religion and rejecting science however (Chapter 3), Vox would rather get rid of science than get rid of Islam. It’s a tough call, but he has to side with religion against science, because there isn’t any objective, verifiable argument that could be used against one religion that won’t work equally well against them all.\nThis pair of bizarre statements has nothing to do with anything, except to try to obscure the fact that virtually no religion has historically had much to do with war, if anything, except one.  I have no “mixed feelings” and what I would do or would not do in an alternate universe where Jews are actively waging holy wars across China or Christians are engaged in a bloody crusade to recapture the holy city of Los Angeles is totally irrelevant.  It’s not my fault that ER doesn’t like the empirical evidence provided by some 6,000 years of human warfare.\nBut, to return to the subject at hand, Vox claims that, of Harris’ list of sectarian conflicts, at least four aren’t religious at all.\n1. The conflict in Palestine is primarily ethnic, not religious…\n2. The conflict in Northern Ireland is primarily ethnic and political, not religious…\n3. Although foreign Muslims have come to the aid of their co-religionists in the Chechen war, the cause has absolutely nothing to do with any religious conflict between the Chechen Muslims and the Orthodox Russians, but the fact that Chechnya has been seeking independence from Russia since it was forcibly annexed in 1870 by Tsar Alexander II…\n4. In Sri Lanka, the political divide is linguistic, not religious. Tamil-speaking Hindus and Christians are allied against Sinhalese-speaking Buddhists and Muslims…\nNow remember, the claim Vox is allegedly rebutting as “near total ignorance” is the claim that religion plays a contributory role in violent group-vs-group conflict. His rebuttal, however, consists of the same old bait-and-switch: the Middle Eastern conflict is not primarily religious; the Northern Ireland conflict is not primarily religious, etc. In other words, he’s completely ignoring the question of what role religion does play in these conflicts; he’d rather talk about what religion is not doing. (And one thing we’ve noted before: it’s certainly not helping!)\nER gets it wrong again here.  The Harris claim I am rebutting here is not “the claim that religion plays a contributory role in violent group-vs-group conflict”, but rather the specific claim that “conflicts that seem driven entirely by territorial concerns, therefore, are often deeply rooted in religion.”  In these four cases, none of the conflicts are rooted in religion at all, let alone deeply.\nVox spends a lot of time talking about factors other than religion which do play a significant role in war; apparently this is supposed to prove that Vox knows more about history than Harris and Dawkins. But it’s really just so much smoke and mirrors, a distraction to divert attention from the question of what role religion does play in generating enthusiasm for wars that might otherwise be more easily recognized as based on prejudice, greed, lust for power, etc. And even with all this hand-waving, Vox still doesn’t get everything quite right.\nIn a continent with only four religions or religious denominations of note in 1400, Europe was divided into over 1,000 independent political states. This number was reduced by half only 117 years later, at the start of the Protestant Reformation. And while there was certainly an amount of violent interdenominational Christian conflict during the Reformation and Counter-Reformation, it is difficult to imagine that even with the increase in the amount of potential religious conflict, more wars took place than occurred during the century leading up to it, wherein half of the political entities disappeared, swallowed up by their larger, more powerful neighbors.\nWhy do we need to content ourselves with “imagining” how many wars took place between 1400 and 1517? As Vox states elsewhere in TIA, he has the full 3-volume Encyclopedia of War. Why not just look up the figures? You can bet that if he had actual statistics to back up his claims, he wouldn’t make such vague speculations. But the fact of the matter is, war is not the only way smaller states can unite into larger conglomerates. Did the original Thirteen Colonies become 50 United States by invasion and conquest? Was the current European Union built by bullets and tanks? Diplomacy, economics, union via royal marriages: there are lots of ways of building larger states that do not require open bloodshed.\nYes, a detailed recitation of the other factors almost completely ignored by Dawkins and Harris and apparently unknown to both does, in fact, tend to show that I know a good deal more about the subject than the other two gentlemen.  Sam Harris has gracefully conceded as much by stating his inability to quantify these matters.  Why not just look up the figures for that period?  Because, as I point out in TIA, they are incomplete.  The Encyclopedia lists 90 European wars during that time, but as with the Assyrian wars, one war tends to stand in for several of its type.  For example, the single entry for the German Civil War (1400-1411) actually covers three separate low-level wars between King Wenceslaus of Germany and Bohemia and the Elector of the Palatine, the Margrave of Moravia and his brother, the King of Hungary.  Also, the historical data from that time is far too incomplete to presume that we have an accurate accounting of why each political entity was subsumed, what we do know is that none of the wars at this time could have been religious in nature because there was no religious divide in that area during that period except for the various wars against the Turks.\nER’s second question is laughable.  If he’d looked at the table in TIA listing every historical U.S. war, he’d know that the answer is yes, the original Thirteen Colonies did become the 50 United States through invasion and conquest.  As it is also stated in TIA, the European Union is not yet a political entity, anyhow, I fully expect it to engage in civil war when one of its member-states attempts to secede in the next decade if it does not collapse first.  There are certainly ways of building larger states peacefully, but a brief survey of any country will readily show that this is far less often the case than the use of violence.\nVox also has problems with the idea of in-group/out-group rivalries.\nMost endo-exo rivalries stem from basic territorialism and the will to power, not rival group identities; the champions of reason have it backwards. Consider the rival groups we currently identify as “French” and “German.” As recently as 814, they were a single ethnic group known as “the Franks.” While the French national identity was forged early on, thanks in part to the open geography of France, there was no German nation as such, instead there was only the multiplicity of principalities known collectively and inaccurately as the Holy Roman Empire, which over time came to be dominated by the Austrian Hapsburg dynasty in the south and the Kingdom of Prussia in the north.\nIt was not until after the Napoleonic wars and the Franco-Prussian wars that anything resembling what we would recognize today as being “Germany” came into existence…\nIs it more reasonable, then, to assume that any latent French hostility towards Germans stems from an out-group identity that didn’t even exist for most of French history, or a simple and understandable distaste for being invaded and slaughtered by a group of distant cousins with a proven historical predilection for doing so?\nBelieve it or not, Vox is actually trying to argue that just because the national identities of “French” and “German” didn’t exist until recent times, neither group had any group identity during the time the one group was invading and slaughtering the other! It’s the same bait-and-switch tactic as before: introduce some other factor (territorialism) which also played a role in the conflict, and poof, the other role (group rivalry) has somehow been proven not to have contributed anything significant. Or at least, Vox has attempted to distract our attention from it. Maybe if we ignore it, it will just go away? But even Vox admits that both groups knew which group was invading, and which was being slaughtered, as shown by his question at the end. So the group identity was there, no matter how it was labeled.\nER somehow manages to avoid both significant points here in reaching an errant conclusion.  First, he avoids mentioning the fact that I am using this example to rebut the idea that group identities come from religion, as Harris and Dawkins claim.  In this case, they cannot have, since the identities predate the religious divide.  Second, ER fails to understand that his conclusion has it precisely backwards, because the national group identities stem from the slaughter, the slaughter doesn’t stem from the group identity!  They were all Franks, brother fighting brother and uncle fighting nephew.  The Gallic Franks subsequently called French didn’t hate the Teutonic Franks subsequently called Germans for being not-French, they hated them for being prone to invade them no matter what they were called.  ER’s reasoning is circular.\nVox tries a similar “rebuttal” by suggesting that, if religion plays a role in war, we ought to see higher rates of volunteerism in countries like Iran. For some reason, he declines to take other factors into consideration (i.e. economy, unemployment, ratio of nominal religion vs. sincere belief, etc), and he also omits any reference to the various Islamic militias and paramilitary organizations like Hamas and Al Qaeda. Nor does he make any distinction between the rate of volunteerism in times of peace (when the possibilities of martyrdom are low) versus rates in times of war. No, all he wants to do is throw out a number that he can claim is, in some sense, contrary to what he himself has already conceded to be true: that religion does have an influence on support for, and participation in, violent conflicts.\nNotice here again that he criticizes my evidence while defending a position for which no evidence at all is given.  The various militias and paramilitaries are numerically insignificant; neither Hamas nor Al Qaeda are Iranian operations anyhow and so have nothing to do with the evidence presented.\nAnd he reverts to his peculiar predilection for defining things in terms of lists by insisting that if religion contributed anything significant to warfare, we ought to find references to it in the various lists of strategies and tactics compiled by the likes of Caesar, Sun Tzu, and so on. Since they do not include religion in their written lists, Vox concludes that religion has no significant role in warfare. In one fell swoop, Vox invalidates the entire military chaplaincy! Oops.\nER demonstrates both his poor reasoning and his military ignorance here.  Not every aspect of the military has anything to do with strategy and tactics, while the chaplaincy has its place but no one with any knowledge or experience of the military would consider it to be of of any strategic or tactical importance.  Certainly the Waffen SS, the Red Army and the People’s Army never saw any need for it.  Indeed, it is more than a little amusing to imagine a general wondering where to best make use of his chaplains when considering an upcoming engagement.\nUPDATE – ER is more clueless than I’d realized.  He’s now trying to make the bizarre point that admitting the obvious existence of chaplains in some Western armies somehow excuses the complete ignorance of Dawkins and Harris of all things military as they attempt to argue that religious faith is somehow dangerous to mankind.  But military chaplains are a complete irrelevancy, for example, an estimated 2,300 chaplains are known to have served in the Union army, an insignificant fraction of the 2,778,304 troops enlisted.",
  "tags": [
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2008-03-16T15:09:00+00:00"
}