{
  "url": "https://voxday.net/2008/03/06/tia-unfair-to-sam-harris/",
  "scraped_at": "2026-01-08T22:14:35.665083",
  "title": "TIA: unfair to Sam Harris",
  "date_display": "March 6, 2008",
  "date_iso": "2008-03-06T08:10:00+00:00",
  "date_from_url": "2008-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GoTT feels that <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=193\">I didn’t give Sam Harris a fair shake in TIA</a>:</p><blockquote><p>First off, an apology. I have been unfair to Vox Day. I sent him an email yesteray after readin his book. I suggested that he made up that quote form Harris that rape is better than relgion. It was a shocking quote, but I should never have accused Vox of lying, and that’s essentially what I did. I turned out that Harris DID make this quote.  I sent an email afterward saying I was disappointed in Harris’s comment. But I did not get through. I also said that the Blue State argument was one I did NOT think was erronous, although others were.</p></blockquote><p>Apology accepted.  To be honest, I wasn’t offended by the accusation of lying – <a href=\"http://www.thesunmagazine.org/issues/369/the_temple_of_reason?page=2\">the damning Harris quote</a> that begins the chapter was a Sep. 2006 interview entitled “The Temple of Reason” – but rather the idea that I’d be dumb enough to lie about something in a book that thousands of people would be scrutinizing closely.  And to GoTT’s credit, at least he attempts to list what arguments he feels are erroneous, rather than hiding behind a nebulous general statement.</p><blockquote><p>I told him in the email that I thought his attacks on Harris were unfair becasue they seemed to misconstrue the intention of Harris’s arguments. Here are some examples I posted on Samharris.org:</p><p>For example, Vox says that Sam’s definition of morality (about happiness vs. suffering) is incorrect, because this is not the system of morals Christians subscribe to. this is exactly Sams’ point, that religious concersn of morality often lie outside happiness vs. suffering, and thus often even contribute to suffering. Harris proposes this definition of morality becasue he beleives it is superior to the Christian definiton, of “whatever God says.” Vox ignores this, saying that “morality should never be confused with a hedonic metric of happiness or suffering.”</p></blockquote><p>GoTT doesn’t understand the point.  I’m not saying that Harris is incorrect because his imagined definition of morality is different than the Christian one – although he is incorrect when he states that Christians use human standards of good to define God’s goodness – but because he is simply inventing a morality <i>ex nihilo</i>.  Since the morality he discusses in Letter to a Christian Nation are Christian morals, it is incorrect to criticize them from the perspective of a non-existent standard.  I’m not ignoring the fact that he’s proposing a new standard, I’m pointing out that it’s a stupid one.</p><blockquote><p>He also faults Harris’s blame for AIDS transmission in Africa, on the reluctance of teaching condom use, saying that STDs are caused “by the very prudery that Christians condemn.” Right, but it’s the sex taboos that actually contribute to that very promiscuity whicb is Sams’ whole point.</p></blockquote><p>Sex taboos don’t tend to contribute to promiscuity.  They tend to inhibit it, which is why would-be libertines like Christopher Hitchens hate them and complain about sexual repression.</p><blockquote><p>He also says that Harris is wrong in declaring that faith presents a nuclear threat becasue,” it is Science, not Faith that is the factor in the equation represents a deadly danger to mankind.” This is where he goes terribly wrong.  THis is technophobia and full-flower. Not too different from what we see in Hollywood from Terminator to Godsend. Now, he has a point in declaring that “all risks are inherently NOT worth taking. He gives the example of “weapons designed to kill anyone with a genetic marker” as a possible abuse of future technology.  But he ignores what Sam has already pointed out–that atoricites that are generally held up as the abuses of science–like those of the Nazi doctors or Hiroshima–are really not attributable to science but to tribalism. LIke giving chimps advanced weapons to carry on their petty warfare. To be fair, it’s not really faith that’s the root problem either–Vox is right here. The underlying problem is still tribalism, not belief in God.  Vox admits he doesn’t want to do back to the stone age, and has no desire to eradicate science. But his contention that science is the worst offender is entirely false.</p></blockquote><p>I don’t ever say anything about science being the worst offender, except to point out that IF Harris’s extinction equation is correct and that Man is under dire threat of extinction, logic dictates that it is science that must be eliminated to end this threat, not faith.  This is an unavoidable conclusion, since eliminating faith will not end, or even seriously reduce, the threat.</p><p>If I was unfair to Sam Harris, it was the cruelty of taking his arguments seriously enough to address them in a straightforward manner.</p></div>",
  "content_text": "GoTT feels that\nI didn’t give Sam Harris a fair shake in TIA\n:\nFirst off, an apology. I have been unfair to Vox Day. I sent him an email yesteray after readin his book. I suggested that he made up that quote form Harris that rape is better than relgion. It was a shocking quote, but I should never have accused Vox of lying, and that’s essentially what I did. I turned out that Harris DID make this quote.  I sent an email afterward saying I was disappointed in Harris’s comment. But I did not get through. I also said that the Blue State argument was one I did NOT think was erronous, although others were.\nApology accepted.  To be honest, I wasn’t offended by the accusation of lying –\nthe damning Harris quote\nthat begins the chapter was a Sep. 2006 interview entitled “The Temple of Reason” – but rather the idea that I’d be dumb enough to lie about something in a book that thousands of people would be scrutinizing closely.  And to GoTT’s credit, at least he attempts to list what arguments he feels are erroneous, rather than hiding behind a nebulous general statement.\nI told him in the email that I thought his attacks on Harris were unfair becasue they seemed to misconstrue the intention of Harris’s arguments. Here are some examples I posted on Samharris.org:\nFor example, Vox says that Sam’s definition of morality (about happiness vs. suffering) is incorrect, because this is not the system of morals Christians subscribe to. this is exactly Sams’ point, that religious concersn of morality often lie outside happiness vs. suffering, and thus often even contribute to suffering. Harris proposes this definition of morality becasue he beleives it is superior to the Christian definiton, of “whatever God says.” Vox ignores this, saying that “morality should never be confused with a hedonic metric of happiness or suffering.”\nGoTT doesn’t understand the point.  I’m not saying that Harris is incorrect because his imagined definition of morality is different than the Christian one – although he is incorrect when he states that Christians use human standards of good to define God’s goodness – but because he is simply inventing a morality\nex nihilo\n.  Since the morality he discusses in Letter to a Christian Nation are Christian morals, it is incorrect to criticize them from the perspective of a non-existent standard.  I’m not ignoring the fact that he’s proposing a new standard, I’m pointing out that it’s a stupid one.\nHe also faults Harris’s blame for AIDS transmission in Africa, on the reluctance of teaching condom use, saying that STDs are caused “by the very prudery that Christians condemn.” Right, but it’s the sex taboos that actually contribute to that very promiscuity whicb is Sams’ whole point.\nSex taboos don’t tend to contribute to promiscuity.  They tend to inhibit it, which is why would-be libertines like Christopher Hitchens hate them and complain about sexual repression.\nHe also says that Harris is wrong in declaring that faith presents a nuclear threat becasue,” it is Science, not Faith that is the factor in the equation represents a deadly danger to mankind.” This is where he goes terribly wrong.  THis is technophobia and full-flower. Not too different from what we see in Hollywood from Terminator to Godsend. Now, he has a point in declaring that “all risks are inherently NOT worth taking. He gives the example of “weapons designed to kill anyone with a genetic marker” as a possible abuse of future technology.  But he ignores what Sam has already pointed out–that atoricites that are generally held up as the abuses of science–like those of the Nazi doctors or Hiroshima–are really not attributable to science but to tribalism. LIke giving chimps advanced weapons to carry on their petty warfare. To be fair, it’s not really faith that’s the root problem either–Vox is right here. The underlying problem is still tribalism, not belief in God.  Vox admits he doesn’t want to do back to the stone age, and has no desire to eradicate science. But his contention that science is the worst offender is entirely false.\nI don’t ever say anything about science being the worst offender, except to point out that IF Harris’s extinction equation is correct and that Man is under dire threat of extinction, logic dictates that it is science that must be eliminated to end this threat, not faith.  This is an unavoidable conclusion, since eliminating faith will not end, or even seriously reduce, the threat.\nIf I was unfair to Sam Harris, it was the cruelty of taking his arguments seriously enough to address them in a straightforward manner.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-06T08:10:00+00:00"
}