{
  "url": "https://voxday.net/2008/03/31/title-ix-science/",
  "scraped_at": "2026-01-08T22:17:40.651091",
  "title": "Title IX science",
  "date_display": "March 31, 2008",
  "date_iso": "2008-03-31T11:17:00+00:00",
  "date_from_url": "2008-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As with the universities, the influx of women into science is having the observable result of degrading its quality.  This will only increase as political pressure from women causes Title IX to be applied to science as it has been applied to sports.  By way of example, consider <a href=\"http://drhelen.blogspot.com/2008/03/are-guys-really-clueless-when-it-comes.html\">the recent study cited by Dr. Helen</a>, wherein a scientific researcher named Coreen concludes that the inability of women to communicate properly is indicative of a male shortcoming.  As one commenter, presumably male, rightly notes:</p><blockquote><p>Let me make sure I have this right, it’s men fault for not reading subtle non-verbal clues by women who REFUSE TO BE CLEAR WITH VERBAL COMMUNICATION and it’s somehow a man’s fault?  Anyone follow this logic?  If you do, you’re a woman.</p></blockquote><p>Regardless of your sex, if you fail to communicate your intentions accurately, then the fault lies solely with you.  The whole study is a misconception, since even when a woman actually happens to know what her intentions are – and is willing to admit them to herself – it is often not in her interest to communicate them accurately to the other party.  For example, a woman who wants a man to buy her a drink will send purposefully misleading sexual messages in order to obtain what she wants.  Is it more accurate to say that the man mistaken her signal or has he been misled?  In many circumstances, the whole point of non-verbal communication is to AVOID the accurate transmission of information and intent.</p><p>Spacebunny points out that signals are also culturally dependent and vary from individual to individual anyhow.</p><p>I’ve never had a problem with confusing friendly signals with sexual ones myself, mostly because I paid them no heed.  If a man finds himself playing a reactive role with women, then he’s already behind the eight ball.  And if she is really interested in a sexual or romantic context, there’s no need to worry about any entrail interpreting, as she will make the signal abundantly clear.</p></div>",
  "content_text": "As with the universities, the influx of women into science is having the observable result of degrading its quality.  This will only increase as political pressure from women causes Title IX to be applied to science as it has been applied to sports.  By way of example, consider\nthe recent study cited by Dr. Helen\n, wherein a scientific researcher named Coreen concludes that the inability of women to communicate properly is indicative of a male shortcoming.  As one commenter, presumably male, rightly notes:\nLet me make sure I have this right, it’s men fault for not reading subtle non-verbal clues by women who REFUSE TO BE CLEAR WITH VERBAL COMMUNICATION and it’s somehow a man’s fault?  Anyone follow this logic?  If you do, you’re a woman.\nRegardless of your sex, if you fail to communicate your intentions accurately, then the fault lies solely with you.  The whole study is a misconception, since even when a woman actually happens to know what her intentions are – and is willing to admit them to herself – it is often not in her interest to communicate them accurately to the other party.  For example, a woman who wants a man to buy her a drink will send purposefully misleading sexual messages in order to obtain what she wants.  Is it more accurate to say that the man mistaken her signal or has he been misled?  In many circumstances, the whole point of non-verbal communication is to AVOID the accurate transmission of information and intent.\nSpacebunny points out that signals are also culturally dependent and vary from individual to individual anyhow.\nI’ve never had a problem with confusing friendly signals with sexual ones myself, mostly because I paid them no heed.  If a man finds himself playing a reactive role with women, then he’s already behind the eight ball.  And if she is really interested in a sexual or romantic context, there’s no need to worry about any entrail interpreting, as she will make the signal abundantly clear.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-31T10:17:00+00:00"
}