{
  "url": "https://voxday.net/2008/03/13/triumph-of-science-skeptic/",
  "scraped_at": "2026-01-08T22:15:19.818071",
  "title": "Triumph of the science skeptic",
  "date_display": "March 13, 2008",
  "date_iso": "2008-03-13T09:57:00+00:00",
  "date_from_url": "2008-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few days ago, during the discussion about the existence or non-existence of dark matter and dark energy, I wrote: <i>“Scientists and science fetishists may hate it that a part-time rebel scientist such as myself should so confidently express contempt for the current consensus, but you don’t need impressive scientific credentials or even to make use the scientific method to recognize when a group of people are attempting to BS everyone else, you simply need to keep your eyes open and possess sufficient experience with human nature.”</i></p><p>So it was a happy coincidence that I discovered, in the process of trying and failing to straighten out my office for the Nth time in six months, an unread 24 September 2007 issue of New Scientist.  Naturally, I abandoned the effort and kicked back in The Comfy Chair, and was promptly rewarded with the very amusing sight of a headline that read “Dimmer outlook for dark matter” on page 12:</p><blockquote><p><b>Dimmer outlook for dark matter</b></p><p>Though we can’t see it, dark matter is supposed to make up 22 per cent of the universe.  Now it turns out it might not exist at all.  Earlier this year, the discovery of a ring-like astronomical feature, invisible except for the way its gravity distorts background galaxies, was hailed as proof for the existence of dark matter and the death knell for a rival theory known as modified Newtonian dynamics (MOND)….  Jee’s team dismissed the MOND explanation because they thought it predicts that there should be no enhanced gravity without visible matter to do the enhancing.  “This is a common misconception,” says Milgrom.  “In fact, in MOND there does not necessarily have to be visible matter there to boost gravity – it is naturally boosted in the transition region.”  No one knows what physics may underpin such a transition.</p><p>“I am interested to hear that the transition between the Newtonian and MONDian regime also gives rise to a ring,” says Jee.  “In general, I am happy whenever there comes a theory which is simpler but can explain more observations.”</p><p>Stronger evidence may be found in three dwarf galaxies which were formed in galactic collisions near the galaxy NGC 5291, discovered this year by a team led by Frederic Bournaud of the French Atomic Energy Commission in Paris.  “The collision should have stripped the galaxies of all their dark matter yet they still have enhanced gravity,” says Milgrom.  “MOND explains things naturally whereas dark matter proponents have to propose the existence of yet another type of dark matter – cold molecular gas.”</p></blockquote><p>Yes, I did laugh out loud upon reading that, less at the inevitable discomfiture of <a href=\"http://www.badastronomy.com/bablog/2008/03/08/ignorance-is-blitz/\">Bad Astronomy and his space fetish crew</a> than the thought of a momentary flicker of despair flashing through Scott Hatfield’s mind about the ultimate fate of another consensus theory of which I am similarly skeptical.  May I propose the term Dark Vapor to accompany its fellows Dark Matter and Dark Energy to complete the unobservable trilogy of Dark Mystery?  It seems rather fitting.  As I have previously written, the more one has to weld epicycles and epiphenomena to one’s theory in order to make it work, the less likely it is to stand up over time.  And it doesn’t take a complete understanding of a theory to recognize when such furious retro-fitting is being done to it.</p><p>I don’t actually care whether Dark Vapor exists or not.  For all I know, it does.  Having no capacity for making a judgment based on the empirical data myself, I merely run what I’m informed through the logic machine, and anyhow, my attitude towards most of these things tends to be rather similar to that of Sherlock Holmes.  But due partly to my belief in the need for science reform, and partly to my fundamental character flaws, I do so enjoy seeing their unmitigated faith in scientific snapshots landing the stupidly arrogant scientific faithful on their asses yet again.  What passes for science these days is beginning to sound like a Monty Python skit:</p><p><i>“Dark Matter and Dark Energy…Dark Matter and Dark Energy…. Our two explanations are Dark Matter and Dark Energy…and Dark Vapor…. Our three explanations are Dark Matter, and Dark Energy, and Dark Vapor…and an almost fanatical devotion to Karl Popper…. Our four…no… Amongst our explanations are such elements as Dark Matter, Dark Energy…. I’ll come in again.”</i></p></div>",
  "content_text": "A few days ago, during the discussion about the existence or non-existence of dark matter and dark energy, I wrote:\n“Scientists and science fetishists may hate it that a part-time rebel scientist such as myself should so confidently express contempt for the current consensus, but you don’t need impressive scientific credentials or even to make use the scientific method to recognize when a group of people are attempting to BS everyone else, you simply need to keep your eyes open and possess sufficient experience with human nature.”\nSo it was a happy coincidence that I discovered, in the process of trying and failing to straighten out my office for the Nth time in six months, an unread 24 September 2007 issue of New Scientist.  Naturally, I abandoned the effort and kicked back in The Comfy Chair, and was promptly rewarded with the very amusing sight of a headline that read “Dimmer outlook for dark matter” on page 12:\nDimmer outlook for dark matter\nThough we can’t see it, dark matter is supposed to make up 22 per cent of the universe.  Now it turns out it might not exist at all.  Earlier this year, the discovery of a ring-like astronomical feature, invisible except for the way its gravity distorts background galaxies, was hailed as proof for the existence of dark matter and the death knell for a rival theory known as modified Newtonian dynamics (MOND)….  Jee’s team dismissed the MOND explanation because they thought it predicts that there should be no enhanced gravity without visible matter to do the enhancing.  “This is a common misconception,” says Milgrom.  “In fact, in MOND there does not necessarily have to be visible matter there to boost gravity – it is naturally boosted in the transition region.”  No one knows what physics may underpin such a transition.\n“I am interested to hear that the transition between the Newtonian and MONDian regime also gives rise to a ring,” says Jee.  “In general, I am happy whenever there comes a theory which is simpler but can explain more observations.”\nStronger evidence may be found in three dwarf galaxies which were formed in galactic collisions near the galaxy NGC 5291, discovered this year by a team led by Frederic Bournaud of the French Atomic Energy Commission in Paris.  “The collision should have stripped the galaxies of all their dark matter yet they still have enhanced gravity,” says Milgrom.  “MOND explains things naturally whereas dark matter proponents have to propose the existence of yet another type of dark matter – cold molecular gas.”\nYes, I did laugh out loud upon reading that, less at the inevitable discomfiture of\nBad Astronomy and his space fetish crew\nthan the thought of a momentary flicker of despair flashing through Scott Hatfield’s mind about the ultimate fate of another consensus theory of which I am similarly skeptical.  May I propose the term Dark Vapor to accompany its fellows Dark Matter and Dark Energy to complete the unobservable trilogy of Dark Mystery?  It seems rather fitting.  As I have previously written, the more one has to weld epicycles and epiphenomena to one’s theory in order to make it work, the less likely it is to stand up over time.  And it doesn’t take a complete understanding of a theory to recognize when such furious retro-fitting is being done to it.\nI don’t actually care whether Dark Vapor exists or not.  For all I know, it does.  Having no capacity for making a judgment based on the empirical data myself, I merely run what I’m informed through the logic machine, and anyhow, my attitude towards most of these things tends to be rather similar to that of Sherlock Holmes.  But due partly to my belief in the need for science reform, and partly to my fundamental character flaws, I do so enjoy seeing their unmitigated faith in scientific snapshots landing the stupidly arrogant scientific faithful on their asses yet again.  What passes for science these days is beginning to sound like a Monty Python skit:\n“Dark Matter and Dark Energy…Dark Matter and Dark Energy…. Our two explanations are Dark Matter and Dark Energy…and Dark Vapor…. Our three explanations are Dark Matter, and Dark Energy, and Dark Vapor…and an almost fanatical devotion to Karl Popper…. Our four…no… Amongst our explanations are such elements as Dark Matter, Dark Energy…. I’ll come in again.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-13T09:57:00+00:00"
}