{
  "url": "https://voxday.net/2008/03/11/two-tia-reviews-2/",
  "scraped_at": "2026-01-08T22:15:06.733990",
  "title": "Two contrasting TIA reviews",
  "date_display": "March 11, 2008",
  "date_iso": "2008-03-11T08:36:00+00:00",
  "date_from_url": "2008-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Catkiller! <a href=\"http://www.rightnation.us/forums/index.php?automodule=blog&amp;blogid=7&amp;\">thinks rather highly of TIA</a>:</p><blockquote><p>In recent years, the intellectual foundation has been laid for the cultural and political ascendence of the right. Forget all the electoral ups and downs of the GOP, for they are little more than the final death throes of the old struggle between two sides in a staged match. A change is coming because the curtain has been lifted and the Wizard is just now finishing his pleas to pay no attention to the man behind it.</p><p>Powerful books have been written recently that will change this country as they have in the past. Common Sense convinced American colonists, among other things, that one need not blindly follow a king to please God. Narratives on the Life of an American Slave showed the intellectuals of its day what one of their own had to go through in order to become one of them. Today, we see the blooming spring created by books such as Jim Powell’s FDR’s Folly and Amity Shlaes’ The Forgotten Man which have defintifively put to rest the notion that left-wing economics saved the United States from collapse. Philip Hamburger’s Separation of Church and State has dispelled the myth that today’s concept of ‘separation’ is rooted in the same idea of anti-establishment religious liberty that animated the Founding Fathers. And Jonah Goldberg is turning the conventional political spectrum on its ear with Liberal Facism. If we give weight to these books as they warrant, those of us on the right will never again lack for an ironclad historical basis form which to contend with the left.</p><p>I’m confident that Vox Day’s The Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens will take its place among this new canon as well.</p></blockquote><p><a href=\"http://zarbi.livejournal.com/110267.html\">Richarddawkins.netter Zarbi</a>, on the other hand, seems to have been concerned enough about the book to lie about it, when he managed to even follow the arguments at all.  Among many other things, he fails to understand that Richard Dawkins’s failure to properly define complexity can’t reasonably be blamed on me.  The amazing thing isn’t that his self-refuting review manages to be almost entirely unrelated to the actual text of TIA despite its length, but the fact that some dim-witted atheists seriously consider it to be a substantive rebuttal.</p><blockquote><p>I have to say that having read the book, it is still hard to determine what “dissect” is intended to mean. The best I can come up with is “try and show they are wrong about lots of stuff”. Well, fair enough. No-one should be surprised if three (or five?) atheist writers don’t make a mistake or two over the years. The problem for Day is that he is attempting to see dogma where there is none. You don’t score points by pointing out fallibility when there has been no claim of perfection, or by showing differences in the viewpoints of people who never claim any kind of unity. This kind of “straw man” approach is common in the book. But, anyway, how is this dissection attempted? Well, if one ignores the ad-hominem attacks that make up close to half the writing, it is by attempts to show that the Trinity are factually wrong in a considerable number of cases. In fact, a very large number of cases indeed. The book is apparently full of facts. There is no doubt that it has required a considerable amount of knowledge and research to write. The question is, is this mountain of facts relevant to the points being made? Well, much of the time, no. The facts are mostly used to very carefully take to pieces straw man arguments….</p><p>I feel I have dealt with sufficient chapters to reveal the nature of the book, and how the author’s case is put. There is much more to the book, but this is a review, not a full-length response. I shall leave that to others with more time and patience! I think the pattern here is clear. Day has attacked the “Trinity” with vigour, passion and energy. But his aim is poor, and he mostly puts considerable effort into dealing with positions that are clearly straw men, or that he seems to have simply misunderstood. There may be a book to be written about the phenomenon of the so-called “New Atheists” that deals with weaknesses in their arguments and their views. That book may well be useful, to help the debate about religion to proceed productively. “The Irrational Atheist” is certainly not such a book.</p></blockquote><p>I’ve posted <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=345\">Zarbi’s review on the TIA forum</a>, and below it I’ve also posted a list of 42 of the specific arguments addressed in the book, 12 of which were specifically made by Richard Dawkins – including the one Dawkins himself described as the central argument of The God Delusion – and 22 made by Sam Harris.  I believe each argument is accurately and fairly described when it is not quoted in full, so I would be very interested in knowing precisely which of those 42 arguments Zarbi considers to be straw men.  I tend to suspect that he doesn’t actually believe any of them are and that he is blatantly lying when he writes that I am “dealing with “positions that are clearly straw men”.  Sam Harris’s forthright responses to my questions should suffice to prove that this is not even remotely close to being the case.</p><p>And since apparently it’s necessary for some of the dimmer brights, let me explain that by “dissect”, I mean to take apart, closely examine and adjudicate the factual and logical legitimacy of the arguments made by the three – no five – individuals.  And for further clarification:</p><p><b>Unholy Trinity</b>: Dawkins, Harris, Hitchens<br><b>New Atheists</b>: Dawkins, Harris, Dennett<br><b>Four Horsemen of the Bukkakelypse</b>: Dawkins, Harris, Dennett, Hitchens<br><b>Atheist Icons</b>: Ingersoll, Russell, Dawkins, Harris, Hitchens, Dennett, Onfray</br></br></br></p></div>",
  "content_text": "Catkiller!\nthinks rather highly of TIA\n:\nIn recent years, the intellectual foundation has been laid for the cultural and political ascendence of the right. Forget all the electoral ups and downs of the GOP, for they are little more than the final death throes of the old struggle between two sides in a staged match. A change is coming because the curtain has been lifted and the Wizard is just now finishing his pleas to pay no attention to the man behind it.\nPowerful books have been written recently that will change this country as they have in the past. Common Sense convinced American colonists, among other things, that one need not blindly follow a king to please God. Narratives on the Life of an American Slave showed the intellectuals of its day what one of their own had to go through in order to become one of them. Today, we see the blooming spring created by books such as Jim Powell’s FDR’s Folly and Amity Shlaes’ The Forgotten Man which have defintifively put to rest the notion that left-wing economics saved the United States from collapse. Philip Hamburger’s Separation of Church and State has dispelled the myth that today’s concept of ‘separation’ is rooted in the same idea of anti-establishment religious liberty that animated the Founding Fathers. And Jonah Goldberg is turning the conventional political spectrum on its ear with Liberal Facism. If we give weight to these books as they warrant, those of us on the right will never again lack for an ironclad historical basis form which to contend with the left.\nI’m confident that Vox Day’s The Irrational Atheist: Dissecting the Unholy Trinity of Dawkins, Harris, and Hitchens will take its place among this new canon as well.\nRicharddawkins.netter Zarbi\n, on the other hand, seems to have been concerned enough about the book to lie about it, when he managed to even follow the arguments at all.  Among many other things, he fails to understand that Richard Dawkins’s failure to properly define complexity can’t reasonably be blamed on me.  The amazing thing isn’t that his self-refuting review manages to be almost entirely unrelated to the actual text of TIA despite its length, but the fact that some dim-witted atheists seriously consider it to be a substantive rebuttal.\nI have to say that having read the book, it is still hard to determine what “dissect” is intended to mean. The best I can come up with is “try and show they are wrong about lots of stuff”. Well, fair enough. No-one should be surprised if three (or five?) atheist writers don’t make a mistake or two over the years. The problem for Day is that he is attempting to see dogma where there is none. You don’t score points by pointing out fallibility when there has been no claim of perfection, or by showing differences in the viewpoints of people who never claim any kind of unity. This kind of “straw man” approach is common in the book. But, anyway, how is this dissection attempted? Well, if one ignores the ad-hominem attacks that make up close to half the writing, it is by attempts to show that the Trinity are factually wrong in a considerable number of cases. In fact, a very large number of cases indeed. The book is apparently full of facts. There is no doubt that it has required a considerable amount of knowledge and research to write. The question is, is this mountain of facts relevant to the points being made? Well, much of the time, no. The facts are mostly used to very carefully take to pieces straw man arguments….\nI feel I have dealt with sufficient chapters to reveal the nature of the book, and how the author’s case is put. There is much more to the book, but this is a review, not a full-length response. I shall leave that to others with more time and patience! I think the pattern here is clear. Day has attacked the “Trinity” with vigour, passion and energy. But his aim is poor, and he mostly puts considerable effort into dealing with positions that are clearly straw men, or that he seems to have simply misunderstood. There may be a book to be written about the phenomenon of the so-called “New Atheists” that deals with weaknesses in their arguments and their views. That book may well be useful, to help the debate about religion to proceed productively. “The Irrational Atheist” is certainly not such a book.\nI’ve posted\nZarbi’s review on the TIA forum\n, and below it I’ve also posted a list of 42 of the specific arguments addressed in the book, 12 of which were specifically made by Richard Dawkins – including the one Dawkins himself described as the central argument of The God Delusion – and 22 made by Sam Harris.  I believe each argument is accurately and fairly described when it is not quoted in full, so I would be very interested in knowing precisely which of those 42 arguments Zarbi considers to be straw men.  I tend to suspect that he doesn’t actually believe any of them are and that he is blatantly lying when he writes that I am “dealing with “positions that are clearly straw men”.  Sam Harris’s forthright responses to my questions should suffice to prove that this is not even remotely close to being the case.\nAnd since apparently it’s necessary for some of the dimmer brights, let me explain that by “dissect”, I mean to take apart, closely examine and adjudicate the factual and logical legitimacy of the arguments made by the three – no five – individuals.  And for further clarification:\nUnholy Trinity\n: Dawkins, Harris, Hitchens\nNew Atheists\n: Dawkins, Harris, Dennett\nFour Horsemen of the Bukkakelypse\n: Dawkins, Harris, Dennett, Hitchens\nAtheist Icons\n: Ingersoll, Russell, Dawkins, Harris, Hitchens, Dennett, Onfray",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-11T08:36:00+00:00"
}