{
  "url": "https://voxday.net/2008/03/13/voxs-first-law-in-operation/",
  "scraped_at": "2026-01-08T22:15:23.585058",
  "title": "The First Law in operation",
  "date_display": "March 13, 2008",
  "date_iso": "2008-03-13T13:52:00+00:00",
  "date_from_url": "2008-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vox’s First Law: <a href=\"http://scienceblogs.com/pharyngula/2008/03/why_do_we_even_stoop_to_mentio.php#comments\">Any sufficiently advanced intelligence is indistinguishable from insanity</a>.</p><p>I do enjoy PZ’s little jabs, he’s such a coward that he’ll go on and on about my opinions while pointedly trying to ignore that I’ve published a book that cuts the heart out of his atheist icons.  Now he’s afraid to even directly link to the very article he’s complaining about, which is why there’s not a single reference to Title IX in either his post or what he amusingly calls <a href=\"http://scienceblogs.com/goodmath/2008/03/vox_day_on_women_in_science.php\">Mark Chu-Carroll’s “evisceration”</a> of the column.</p><p>How does one “eviscerate” an argument when one fails to even mention, let alone refute, its central point?  That word does not mean what he thinks it means.</p><p>As for the commenter’s question about why Sam Harris would respond to me?  Probably because unlike these fourth-raters, he is capable of recognizing a superior intellect that is <a href=\"http://www.milobookclub.com/2008/03/12/notes-on-sam-harriss-responses/\">demonstrably capable of dismantling his arguments</a>.  If he wants to improve those arguments, then it is in his direct interest to pay attention any criticism that is relevant regardless of the source.  One doesn’t have to be bestest buddies with one’s critics in order to benefit from their input.  I don’t mind that PZ takes shots at me, I merely regret that his criticism is so lightweight.</p></div>",
  "content_text": "Vox’s First Law:\nAny sufficiently advanced intelligence is indistinguishable from insanity\n.\nI do enjoy PZ’s little jabs, he’s such a coward that he’ll go on and on about my opinions while pointedly trying to ignore that I’ve published a book that cuts the heart out of his atheist icons.  Now he’s afraid to even directly link to the very article he’s complaining about, which is why there’s not a single reference to Title IX in either his post or what he amusingly calls\nMark Chu-Carroll’s “evisceration”\nof the column.\nHow does one “eviscerate” an argument when one fails to even mention, let alone refute, its central point?  That word does not mean what he thinks it means.\nAs for the commenter’s question about why Sam Harris would respond to me?  Probably because unlike these fourth-raters, he is capable of recognizing a superior intellect that is\ndemonstrably capable of dismantling his arguments\n.  If he wants to improve those arguments, then it is in his direct interest to pay attention any criticism that is relevant regardless of the source.  One doesn’t have to be bestest buddies with one’s critics in order to benefit from their input.  I don’t mind that PZ takes shots at me, I merely regret that his criticism is so lightweight.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-13T13:52:00+00:00"
}