{
  "url": "https://voxday.net/2008/03/31/when-greatness-beckons/",
  "scraped_at": "2026-01-08T22:17:38.775985",
  "title": "When greatness beckons",
  "date_display": "March 31, 2008",
  "date_iso": "2008-03-31T08:42:00+00:00",
  "date_from_url": "2008-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As well-loved as Pope John Paul II was, his successor, Pope Benedict XVI may one day be regarded as a far more important leader of the Roman Catholic Church.  He is certainly revealing himself to possess an extremely formidable intellect.  I don’t think many have yet realized that with his speech at Regensburg and his public baptism of Magdi Allam at Easter, he has responded to the decades-long advance of the Ummah <a href=\"http://www.atimes.com/atimes/Front_Page/JC26Aa01.html\">by throwing down a gauntlet</a> that is all the more serious for its non-violence.  I suspect that this is not a man who thinks in terms of years, or even decades, but centuries.</p><blockquote><p>European Christianity may be reduced to a few coals glowing in the ashes, but it is not dead, only marginalized. If the Catholic youth of Europe are offered a great task – to evangelize the Muslims whose restlessness threatens to push Europe into social chaos – many of them may heed the call.</p><p>As I wrote in 2005, “Now that everyone is talking about Europe’s demographic death, it is time to point out that there exists a way out: convert European Muslims to Christianity.” Today’s Europeans stem from the melting-pot of the barbarian invasions that replaced the vanishing population of the Roman Empire. The genius of the Catholic Church was to absorb them. If Benedict XVI can convert this new wave of invaders from North Africa and the Middle East, history will place him on a par with his great namesake, the founder of the monastic order the bears his name.</p></blockquote><p>I can’t say how this will all turn out.  But one thing I have learned from history is that its post-facto title of greatness tends to be bestowed upon those men who find themselves at the nexus of great events and rise to the occasion.  Pope Benedict may be one such man, as he appears to following the very strategy that the Archbishop Peter Akinola recommended in response to the violent challenge to Nigerian Christians posed by the expanse of the Ummah there: “Make the church grow”.</p></div>",
  "content_text": "As well-loved as Pope John Paul II was, his successor, Pope Benedict XVI may one day be regarded as a far more important leader of the Roman Catholic Church.  He is certainly revealing himself to possess an extremely formidable intellect.  I don’t think many have yet realized that with his speech at Regensburg and his public baptism of Magdi Allam at Easter, he has responded to the decades-long advance of the Ummah\nby throwing down a gauntlet\nthat is all the more serious for its non-violence.  I suspect that this is not a man who thinks in terms of years, or even decades, but centuries.\nEuropean Christianity may be reduced to a few coals glowing in the ashes, but it is not dead, only marginalized. If the Catholic youth of Europe are offered a great task – to evangelize the Muslims whose restlessness threatens to push Europe into social chaos – many of them may heed the call.\nAs I wrote in 2005, “Now that everyone is talking about Europe’s demographic death, it is time to point out that there exists a way out: convert European Muslims to Christianity.” Today’s Europeans stem from the melting-pot of the barbarian invasions that replaced the vanishing population of the Roman Empire. The genius of the Catholic Church was to absorb them. If Benedict XVI can convert this new wave of invaders from North Africa and the Middle East, history will place him on a par with his great namesake, the founder of the monastic order the bears his name.\nI can’t say how this will all turn out.  But one thing I have learned from history is that its post-facto title of greatness tends to be bestowed upon those men who find themselves at the nexus of great events and rise to the occasion.  Pope Benedict may be one such man, as he appears to following the very strategy that the Archbishop Peter Akinola recommended in response to the violent challenge to Nigerian Christians posed by the expanse of the Ummah there: “Make the church grow”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-03-31T07:42:00+00:00"
}