{
  "url": "https://voxday.net/2009/04/05/addressing-run-of-mill-atheis/",
  "scraped_at": "2026-01-08T22:52:32.107803",
  "title": "Addressing a run-of-the-mill atheist",
  "date_display": "April 5, 2009",
  "date_iso": "2009-04-05T09:30:00+00:00",
  "date_from_url": "2009-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Skepdude apparently <a href=\"http://skepfeeds.wordpress.com/2009/04/02/we-knew-this-was-going-to-happen/\">lacks a dictionary</a>:</p><blockquote><p>First, I would like to see what evidence he is referring to when he says that “all of the available evidence demonstrates rather conclusively that the objects of their ridicule are, as a point of fact, rather more intelligent”, because I suspect he’s using a very unorthodox definition of evidence here.</p></blockquote><p>Logical and empirical evidence.  Or, to be more specific, logical, documentary and statistical evidence.  Let us consider the most readily available example: Since I am known to possess, at a bare minimum, a Mensa-required +2SD IQ, it is obvious that most of my atheist critics are statistically bound to fall well short of that not-terribly-impressive level.  In further support of this observation, I have seen many run-of-the-mill atheists, the vast majority of whom use logic and grammar in such a manner as to indicate a moderate-to-average level of intelligence, describing individuals such as Alister McGrath, Dinesh D’Souza, and me as if we are uniformly possessed of a sub-standard level of intelligence.  (It is, of course, amusing to see an atheist suggest that I might elect to make use of an unorthodox definition of evidence, when almost every single atheist claim that “there is no evidence for God’s existence” <i>requires</i> ignoring the standard definitions of evidence provided by every English language dictionary from American Standard to Webster as well as the definitions used in the American legal system.)  I could point to dozens of these spurious accusations of stupidity on Scienceblogs alone, but it is perhaps more usefully ironic to note that a prime example of what I am describing can be found <a href=\"http://skepfeeds.wordpress.com/2009/04/02/we-knew-this-was-going-to-happen/#comment-1211\">right there in the first comment</a> on Skepdude’s post.</p><p>Amusing, but inconsequential.  Skepdude’s much more serious error follows, however, when he writes:</p><blockquote><p>Bit hypocritital no? First he says that our primary form of “debate” is calling people stupid, which of course must be wrong, then he turns around and presents his argument/debate which basically amounts to nothing more than calling us fools. Now, I’m nothing but a mere run of the mill internet atheist, who is mentally inferior as demonstrated by all the available evidence, but this sort of reasoning sounds a little….well…..<s>stupid</s>foolish to me!</p></blockquote><p>This is precisely the same sort of thing we have seen so often before.  Call it the First Law Fandango.  Because Skepdude possesses an above-average intelligence, he assumes that because he does not understand what an individual of superior intelligence has written, that individual and/or his reasoning must be stupid, foolish, hypocritical, etc.  But there is a basic logical flaw in his errant attempt to find hypocrisy here, because it is eminently obvious – based on the readily available documentary evidence – that a single reference to a well-known Bible verse is neither a) an argument, nor b) my primary form of debate.  So, no, not in the least bit hypocritical.</p><p>Shall we pull out the telestrator?  Very well.  Even if I had been making an argument there in the second of those two sentences – which I was not, I was merely offering scriptural support for my assertion that atheism has been around for a very long time and will probably always exist so long as there is conceptual space for it – a single argument does not dictate any specific form of debate, much less define <i>my primary</i> form of debate.  In fact, a keen observer might even be able to detect that my primary form of debate is to read the other side’s material, point out the verifiable errors that were made in that material, and then show how those errors render the other side’s conclusions unviable.  Then, use the demonstrable fact of those errors and that unviability to justify all sorts of terrible intellectual abuse.  The main variant, of course, is to begin with the abuse, then demonstrate why the abuse is fully justified.</p><p>There is rather a great deal of evidence showing this to be my primary form of debate; there is at least a book full of it.  However, we know that most atheists reject both documentary and testimonial evidence out of hand, which leads one to wonder what sort of scientific evidence could be sufficient to prove my hypocrisy or lack of it to Skepdude…  and upon what he could possibly attempt to base an actual argument in support of his implication.   At times, I seriously begin to wonder if the most useful definition of atheism is “epistemological incoherence”.</p></div>",
  "content_text": "Skepdude apparently\nlacks a dictionary\n:\nFirst, I would like to see what evidence he is referring to when he says that “all of the available evidence demonstrates rather conclusively that the objects of their ridicule are, as a point of fact, rather more intelligent”, because I suspect he’s using a very unorthodox definition of evidence here.\nLogical and empirical evidence.  Or, to be more specific, logical, documentary and statistical evidence.  Let us consider the most readily available example: Since I am known to possess, at a bare minimum, a Mensa-required +2SD IQ, it is obvious that most of my atheist critics are statistically bound to fall well short of that not-terribly-impressive level.  In further support of this observation, I have seen many run-of-the-mill atheists, the vast majority of whom use logic and grammar in such a manner as to indicate a moderate-to-average level of intelligence, describing individuals such as Alister McGrath, Dinesh D’Souza, and me as if we are uniformly possessed of a sub-standard level of intelligence.  (It is, of course, amusing to see an atheist suggest that I might elect to make use of an unorthodox definition of evidence, when almost every single atheist claim that “there is no evidence for God’s existence”\nrequires\nignoring the standard definitions of evidence provided by every English language dictionary from American Standard to Webster as well as the definitions used in the American legal system.)  I could point to dozens of these spurious accusations of stupidity on Scienceblogs alone, but it is perhaps more usefully ironic to note that a prime example of what I am describing can be found\nright there in the first comment\non Skepdude’s post.\nAmusing, but inconsequential.  Skepdude’s much more serious error follows, however, when he writes:\nBit hypocritital no? First he says that our primary form of “debate” is calling people stupid, which of course must be wrong, then he turns around and presents his argument/debate which basically amounts to nothing more than calling us fools. Now, I’m nothing but a mere run of the mill internet atheist, who is mentally inferior as demonstrated by all the available evidence, but this sort of reasoning sounds a little….well…..\nstupid\nfoolish to me!\nThis is precisely the same sort of thing we have seen so often before.  Call it the First Law Fandango.  Because Skepdude possesses an above-average intelligence, he assumes that because he does not understand what an individual of superior intelligence has written, that individual and/or his reasoning must be stupid, foolish, hypocritical, etc.  But there is a basic logical flaw in his errant attempt to find hypocrisy here, because it is eminently obvious – based on the readily available documentary evidence – that a single reference to a well-known Bible verse is neither a) an argument, nor b) my primary form of debate.  So, no, not in the least bit hypocritical.\nShall we pull out the telestrator?  Very well.  Even if I had been making an argument there in the second of those two sentences – which I was not, I was merely offering scriptural support for my assertion that atheism has been around for a very long time and will probably always exist so long as there is conceptual space for it – a single argument does not dictate any specific form of debate, much less define\nmy primary\nform of debate.  In fact, a keen observer might even be able to detect that my primary form of debate is to read the other side’s material, point out the verifiable errors that were made in that material, and then show how those errors render the other side’s conclusions unviable.  Then, use the demonstrable fact of those errors and that unviability to justify all sorts of terrible intellectual abuse.  The main variant, of course, is to begin with the abuse, then demonstrate why the abuse is fully justified.\nThere is rather a great deal of evidence showing this to be my primary form of debate; there is at least a book full of it.  However, we know that most atheists reject both documentary and testimonial evidence out of hand, which leads one to wonder what sort of scientific evidence could be sufficient to prove my hypocrisy or lack of it to Skepdude…  and upon what he could possibly attempt to base an actual argument in support of his implication.   At times, I seriously begin to wonder if the most useful definition of atheism is “epistemological incoherence”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-05T08:30:00+00:00"
}