{
  "url": "https://voxday.net/2009/04/22/clarification/",
  "scraped_at": "2026-01-08T22:54:07.590815",
  "title": "A clarification",
  "date_display": "April 22, 2009",
  "date_iso": "2009-04-22T10:28:00+00:00",
  "date_from_url": "2009-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mark Steyn <a href=\"http://corner.nationalreview.com/post/?q=Y2QxYzNlOTc3NTQwNGE0ZTgxNTQzYzRkZGIwMzdmYjk=\">defends himself</a> against a false impression I may have created:</p><blockquote><p>Just for the record, I have opposed laws against Holocaust denial my entire adult life. I even have a book out there explaining why. Up north I’ve spent the last year-and-a-half attacking the ludicrous position of the buffoon who runs the Canadian Jewish Congress and his friends in B’nai Brith Canada and similar organizations that restrictions on free speech are necessary because, if you let some loser in his parents’ basement in Saskatoon post an anti-Semitic remark on the Internet, next thing you know the prairies will be in the express lane to Auschwitz.</p></blockquote><p>Steyn is entirely correct to point this out.  He has long been an outspoken defender of free speech and was forced to endure a long legal battle after being attacked by the Canadian Jewish Congress and various Canadian kangaroo courts.  It would not be going too far to say that he is one of the recognizable champions of free speech in the conservative media today, and I believe he is quite possibly the very last individual in the Western Hemisphere who would support the prosecution of a Holocaust denier.  I apologize if anyone was left with the mistaken impression that Mark Steyn would ever support any criminalization of Holocaust denial on the basis of <a href=\"http://www.milobookclub.com/2009/04/21/lobby-is-at-it-again/\">yesterday’s blog post</a>.</p><p>That being said, Steyn’s correct defense of himself was somewhat beside the point of both my email to him as well as the aforementioned blog post.  My primary intent in emailing him was to deplore the attack on the neutral Swiss inherent in the claim: <b><i>“The mainstreaming of Mahmoud by Merz &amp; Co is worse than what Neville Chamberlain and Lord Halifax did.”</i></b> In fact, my email to him began thusly:</p><p><i>“What part of the concept of “neutrality” do you not understand?  It is well understood by everyone that Switzerland is not in the business of taking sides.  To maintain neutrality in such circumstances, when taking sides for PR’s sake is the normal and easy thing to do, is entirely admirable.  Someone has to make it possible to negotiate between warring parties and Switzerland has historically served this purpose very well.”</i></p><p>Steyn also left out the first part of the sentence that he quoted in his Corner post.  The omitted phrase is in bold text:</p><p>“<i><b>I am pro-Israel myself, but as a side note,</b> please know that the constant references to the Holocaust by pro-Israeli writers is one reason why no one in Europe outside of Germany pays any attention to it anymore.  Holocaust references are now seen as little more than emotional propaganda, as the event has been trivialized by over-reference to it.”</i></p><p>There is admittedly a real difference between criminalizing Holocaust denial and criticizing those who permit free speech.  But it is a difference of degree, not of kind, and in both cases the guiding motivation is an attempt to exert control over the dialogue.  In my opinion, a declaration that Swiss neutrality is worse than the historical appeasement of Nazi Germany and the breakup of the Stresa Front is not only incorrect, but borders on the outrageous.</p><p>As to my other point, I remain mystified as to why the news that a famously neutral country continues to act in a consistently neutral manner is deemed more important than <a href=\"http://www.salon.com/opinion/greenwald/2009/04/20/harman/\">a major scandal</a> that now involves Rep. Jane Harman, former Attorney General Alberto Gonzalez, a suspected Israeli agent, and two AIPAC officials charged with spying on the United States?  As of this moment, there are 17 posts by various NROniks about Iran and the Geneva Conference on the Corner, compared to just two about the Harman scandal.</p><p>Finally, let me point out that I do not think Germans are hung up on Holocaust guilt.  Young Germans in particular don’t understand what the events of more than six decades ago are supposed to have to do with their lives.  Still, for a variety of reasons, they are not as completely indifferent to the historical events as most of their fellow Europeans are.  Since I speak German and live in Europe, I suspect I may possess a more accurate understanding of current European attitudes than a Canadian living in New Hampshire.</p></div>",
  "content_text": "Mark Steyn\ndefends himself\nagainst a false impression I may have created:\nJust for the record, I have opposed laws against Holocaust denial my entire adult life. I even have a book out there explaining why. Up north I’ve spent the last year-and-a-half attacking the ludicrous position of the buffoon who runs the Canadian Jewish Congress and his friends in B’nai Brith Canada and similar organizations that restrictions on free speech are necessary because, if you let some loser in his parents’ basement in Saskatoon post an anti-Semitic remark on the Internet, next thing you know the prairies will be in the express lane to Auschwitz.\nSteyn is entirely correct to point this out.  He has long been an outspoken defender of free speech and was forced to endure a long legal battle after being attacked by the Canadian Jewish Congress and various Canadian kangaroo courts.  It would not be going too far to say that he is one of the recognizable champions of free speech in the conservative media today, and I believe he is quite possibly the very last individual in the Western Hemisphere who would support the prosecution of a Holocaust denier.  I apologize if anyone was left with the mistaken impression that Mark Steyn would ever support any criminalization of Holocaust denial on the basis of\nyesterday’s blog post\n.\nThat being said, Steyn’s correct defense of himself was somewhat beside the point of both my email to him as well as the aforementioned blog post.  My primary intent in emailing him was to deplore the attack on the neutral Swiss inherent in the claim:\n“The mainstreaming of Mahmoud by Merz & Co is worse than what Neville Chamberlain and Lord Halifax did.”\nIn fact, my email to him began thusly:\n“What part of the concept of “neutrality” do you not understand?  It is well understood by everyone that Switzerland is not in the business of taking sides.  To maintain neutrality in such circumstances, when taking sides for PR’s sake is the normal and easy thing to do, is entirely admirable.  Someone has to make it possible to negotiate between warring parties and Switzerland has historically served this purpose very well.”\nSteyn also left out the first part of the sentence that he quoted in his Corner post.  The omitted phrase is in bold text:\n“\nI am pro-Israel myself, but as a side note,\nplease know that the constant references to the Holocaust by pro-Israeli writers is one reason why no one in Europe outside of Germany pays any attention to it anymore.  Holocaust references are now seen as little more than emotional propaganda, as the event has been trivialized by over-reference to it.”\nThere is admittedly a real difference between criminalizing Holocaust denial and criticizing those who permit free speech.  But it is a difference of degree, not of kind, and in both cases the guiding motivation is an attempt to exert control over the dialogue.  In my opinion, a declaration that Swiss neutrality is worse than the historical appeasement of Nazi Germany and the breakup of the Stresa Front is not only incorrect, but borders on the outrageous.\nAs to my other point, I remain mystified as to why the news that a famously neutral country continues to act in a consistently neutral manner is deemed more important than\na major scandal\nthat now involves Rep. Jane Harman, former Attorney General Alberto Gonzalez, a suspected Israeli agent, and two AIPAC officials charged with spying on the United States?  As of this moment, there are 17 posts by various NROniks about Iran and the Geneva Conference on the Corner, compared to just two about the Harman scandal.\nFinally, let me point out that I do not think Germans are hung up on Holocaust guilt.  Young Germans in particular don’t understand what the events of more than six decades ago are supposed to have to do with their lives.  Still, for a variety of reasons, they are not as completely indifferent to the historical events as most of their fellow Europeans are.  Since I speak German and live in Europe, I suspect I may possess a more accurate understanding of current European attitudes than a Canadian living in New Hampshire.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-22T09:28:00+00:00"
}