{
  "url": "https://voxday.net/2009/04/15/exercise-in-propaganda/",
  "scraped_at": "2026-01-08T22:53:32.737080",
  "title": "An exercise in propaganda",
  "date_display": "April 15, 2009",
  "date_iso": "2009-04-15T17:15:00+00:00",
  "date_from_url": "2009-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Wall Street Journal indicates that the “stress tests” aren’t intended as anything but <a href=\"http://online.wsj.com/article/SB123975110468218627.html\">pure government propaganda</a>:</p><blockquote><p>It isn’t clear precisely what information the government might disclose. It remains possible the data won’t be specific to individual banks. But some within the administration believe a certain amount of information needs to be released in order to provide assurance about the validity and rigor of the assessments. In addition, these people also are concerned that the tests won’t be able to fulfill <b>their basic function of shoring up confidence</b> unless investors are able to see data for themselves.</p></blockquote><p>The entire exercise is nothing more than a bizarre neo-Keynesian spin on “restoring animal spirits”.  A serious test of banking stability would simply report the data gathered – which should be made public given the massive taxpayer investment in the banks – which would then allow anyone to decide if the state of the banks merited confidence or not.</p><p>But all this hand-wringing over precisely what information can be selectively released without causing more damage than it avoids indicates that the point is simply to convince the gullible that everything is fine and the financial authorities have it all under control.  Given how many times people on both sides of the political spectrum have fallen for this line, it’s no wonder they’re giving it another go.</p><p>Just in case you’re not convinced that it’s all smoke-and-mirrors, both <a href=\"http://www.calculatedriskblog.com/2009/04/roubini-and-stress-test-scenarios.html\">Calculated Risk and Roubini</a> have been contemplating whether it’s only the “baseline case” for the tests that is invalid or whether the “adverse case” has already been exceeded:</p><blockquote><p>Roubini concludes:  “Actual macro data for 2009 are already worse than the more adverse scenario in the stress tests. These are not stress tests but rather fudge tests.”</p><p>I agree there is no real stress test, and the more adverse scenario is the real baseline. But I think it is premature to say that the more adverse scenario is meaningless.</p></blockquote><p>I loved this contribution from a commenter: <i>“The containment is spreading at an accelerating rate….”</i></p></div>",
  "content_text": "The Wall Street Journal indicates that the “stress tests” aren’t intended as anything but\npure government propaganda\n:\nIt isn’t clear precisely what information the government might disclose. It remains possible the data won’t be specific to individual banks. But some within the administration believe a certain amount of information needs to be released in order to provide assurance about the validity and rigor of the assessments. In addition, these people also are concerned that the tests won’t be able to fulfill\ntheir basic function of shoring up confidence\nunless investors are able to see data for themselves.\nThe entire exercise is nothing more than a bizarre neo-Keynesian spin on “restoring animal spirits”.  A serious test of banking stability would simply report the data gathered – which should be made public given the massive taxpayer investment in the banks – which would then allow anyone to decide if the state of the banks merited confidence or not.\nBut all this hand-wringing over precisely what information can be selectively released without causing more damage than it avoids indicates that the point is simply to convince the gullible that everything is fine and the financial authorities have it all under control.  Given how many times people on both sides of the political spectrum have fallen for this line, it’s no wonder they’re giving it another go.\nJust in case you’re not convinced that it’s all smoke-and-mirrors, both\nCalculated Risk and Roubini\nhave been contemplating whether it’s only the “baseline case” for the tests that is invalid or whether the “adverse case” has already been exceeded:\nRoubini concludes:  “Actual macro data for 2009 are already worse than the more adverse scenario in the stress tests. These are not stress tests but rather fudge tests.”\nI agree there is no real stress test, and the more adverse scenario is the real baseline. But I think it is premature to say that the more adverse scenario is meaningless.\nI loved this contribution from a commenter:\n“The containment is spreading at an accelerating rate….”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-15T16:15:00+00:00"
}