{
  "url": "https://voxday.net/2009/04/08/farrago-of-fandangos/",
  "scraped_at": "2026-01-08T22:52:53.698608",
  "title": "A farrago of fandangos",
  "date_display": "April 8, 2009",
  "date_iso": "2009-04-08T19:30:00+00:00",
  "date_from_url": "2009-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All right, <a href=\"http://skepfeeds.wordpress.com/2009/04/05/i-guees-i-had-it-coming-vox-day-wants-a-fight/\">we’ll call it a draw</a>:</p><blockquote><p>First, Mr. Vox wants to take a shot at my challenge of his claim that they (religious) are more intelligent than us (atheists). While it is quite ridiculous to make that statement for any group in relation to any other group, nevertheless he clearly means to say that religious people are smarter than the atheists.</p></blockquote><p>Read it again, o valiant black knight of atheism.  The fact that I have repeatedly explained, both in TIA and on this blog, why atheists are more intelligent <i>on average</i> than theists, is sufficient to demolish your attempt to construct this demonstrable strawman.</p><blockquote><p>Basically Vox thinks that “I think so” should be considered good evidence.  Well, personally I would expect something a little more firm such as say, at the very least, an article in a major wold newspaper, referring to some survey/study with a title of something like, oh I don’t know “Intelligent people ‘less likely to believe in God” perhaps? Or this one maybe? Now that is what I would  consider as evidence, but Vox’s word, unfortunately does not count. Sorry Vox but that’s just the way it is and it doesn’t matter how much you deny it, evidence will never be defined as one person’s word in any dictionary!…</p><p>No Mr Day, having strict standards for evidence is not a shortcoming of skeptics and atheists as you would like to suggest, at the contrary it is a virtue. Some very intelligent men have said that extraordinary claims require extraordinary evidence, and is there a more extraordinary claim than God? Vox uses the typical strategy of most anti-scientists, more specifically trying to use the everyday use definitions of certain words in an effort to minimize or avoid the more rigorous requirements that a scientific approach demands.</p></blockquote><p>Vox thinks absolutely nothing of the kind.  I’ve already pointed out that, as per the usual First Law Fandango, Skepdude doesn’t even understand what I wrote in the first place.  Now he’s quibbling with the dictionary definition of evidence.  Again, that’s fairly par for the course when dealing with a run-of-the-mill internet atheist.  An atheist can reasonably attempt to argue that there is no “scientific evidence” for God.  An atheist who attempts to argue that there is no “evidence” for God is not only an ignorant and maleducated fool, he is very easily shown to be an incorrect, ignorant, and maleducated fool.  No one is permitted to completely redefine standard, well-defined words in the interest of supporting their arguments.</p><blockquote><p>So did he make an assertion that atheism has been around for a long time? Sure he did. But did he not also call all atheists fools? See it is right there, in the middle of the second sentence. He is paraphrasing the Bible, but it is clear, I think, that this is a statement that he agrees with. How do I know he accepts what the Bible says on the issue? Because he is using that paraphrased verse to support his statement, namely that “Atheism will always exist”. You don’t use an untrue statement to support your own claim now do you? So I don’t know why Vox is embarrassing himself implying that he doesn’t think we’re all fools over here. I don’t know what Vox is thinking. Pointing at claim/statement #1 does not negate that you made claim/statement #2.</p></blockquote><p>It is entirely obvious that Skepdude doesn’t know what Vox is thinking; one of his problems is that he keeps claiming, incorrectly, that he does.  The veritable farrago of First Law Fandangos raises the question if he is even potentially capable of understanding what Vox is writing, let alone thinking.  A single “claim/statement” is obviously not the same thing as “a primary form of debate” so it’s not possible to even begin build a theoretical case for hypocrisy here, let alone present a convincing one.  As for the request for evidence of comparative intelligences, I respectfully submit that this pair of exchanges should more than suffice even without the previous compendium of readily available documentary evidence in support of the same conclusion.  One final note – on what internet do atheists only describe theistic <i>beliefs</i> as stupid rather than the theists themselves?</p><p>UPDATE: Skepdude simply <a href=\"http://skepfeeds.wordpress.com/2009/04/08/the-education-of-vox-day-part-1-the-straw-man-fallacy/\">can’t figure it out</a>:</p><blockquote><p>How is it that you think that atheist are on average smarter than theists, but then turn around that the internet atheists are less intelligent than the theists?</p></blockquote><p>Because internet atheists are a small subset of all atheists, and the theists they make a habit of calling stupid – the specific objects of ridicule listed were Alister McGrath, Dinesh D’Souza, and me – are an extremely small subset of theists.</p><p>As for the “challenge”, Skepdude’s argument(s) clearly qualified for Strawman under step 1 of the Wikipedia definition.  He repeatedly presented “a misrepresentation of the opponent’s position” because, among other things, he failed to understand who I was describing when I wrote “the objects of their ridicule”.  I even provided three examples, which made it clear that I was not talking about all of the nearly 6 billion theists on the planet, but rather a specific subset of theists who have written responses to the New Atheists.  Consider what we already know about all three theists specifically mentioned:  they are all authors who have been published at least six times apiece and their books clearly indicate a level of intelligence that ranges somewhere between +2 and +4SD above the norm.  All three attended elite universities and have the track record of tangible success expected of highly intelligent individuals.  One is even confirmed at least a +2SD IQ due to the Mensa requirements….</p><p>On the other hand, the inability of run-of-the-mill internet atheists to demonstrate even basic reading comprehension skills, combined with their predilection for spelling, grammatical, and logical errors as well as their easily verifiable ignorance of basic dictionary terms, indicates intelligence levels ranging from -1SD to +2SD.  While we don’t have absolute proof that Skepdude or any of the Internet atheists he mentioned don’t have 175+ IQs or that McGrath doesn’t have an 85 IQ – for that we’d need to collect the confirmed IQ results for everyone concerned – we do possess a rather large body of documentary evidence that permits one to reach the logical conclusion that I did: run-of-the-mill internet atheists regularly describe certain theists who are observably more intelligent than they are as stupid.  Now, Skepdude may not be guilty of explicitly engaging in this practice, but, as I pointed out, his commenters clearly are.  Skepdude even implicitly indulges in this practice himself, as the idea that I, or anyone else with a confirmed 132 IQ or better, require further education in order to understand something as simple as a strawman argument would be insulting if it wasn’t so ludicrous.</p><p>I already explained this <a href=\"http://www.milobookclub.com/2009/04/05/addressing-run-of-mill-atheis/\">in my first post</a>, but it seems that some people require it to be spelled out for them.  Which is not a problem, but, it should be noted, also tends to support my original point.  Skepdude could have easily saved himself a considerable amount of Strawman construction had he simply elected to ask “specifically what do you mean by objects of ridicule” rather than leaping at the perceived opportunity to hurl charges of error and hypocrisy.  But, this is the internet, and would-be critics seldom look before they leap.</p><p>And yes, I am now officially bored with the subject.  No doubt you are too.</p></div>",
  "content_text": "All right,\nwe’ll call it a draw\n:\nFirst, Mr. Vox wants to take a shot at my challenge of his claim that they (religious) are more intelligent than us (atheists). While it is quite ridiculous to make that statement for any group in relation to any other group, nevertheless he clearly means to say that religious people are smarter than the atheists.\nRead it again, o valiant black knight of atheism.  The fact that I have repeatedly explained, both in TIA and on this blog, why atheists are more intelligent\non average\nthan theists, is sufficient to demolish your attempt to construct this demonstrable strawman.\nBasically Vox thinks that “I think so” should be considered good evidence.  Well, personally I would expect something a little more firm such as say, at the very least, an article in a major wold newspaper, referring to some survey/study with a title of something like, oh I don’t know “Intelligent people ‘less likely to believe in God” perhaps? Or this one maybe? Now that is what I would  consider as evidence, but Vox’s word, unfortunately does not count. Sorry Vox but that’s just the way it is and it doesn’t matter how much you deny it, evidence will never be defined as one person’s word in any dictionary!…\nNo Mr Day, having strict standards for evidence is not a shortcoming of skeptics and atheists as you would like to suggest, at the contrary it is a virtue. Some very intelligent men have said that extraordinary claims require extraordinary evidence, and is there a more extraordinary claim than God? Vox uses the typical strategy of most anti-scientists, more specifically trying to use the everyday use definitions of certain words in an effort to minimize or avoid the more rigorous requirements that a scientific approach demands.\nVox thinks absolutely nothing of the kind.  I’ve already pointed out that, as per the usual First Law Fandango, Skepdude doesn’t even understand what I wrote in the first place.  Now he’s quibbling with the dictionary definition of evidence.  Again, that’s fairly par for the course when dealing with a run-of-the-mill internet atheist.  An atheist can reasonably attempt to argue that there is no “scientific evidence” for God.  An atheist who attempts to argue that there is no “evidence” for God is not only an ignorant and maleducated fool, he is very easily shown to be an incorrect, ignorant, and maleducated fool.  No one is permitted to completely redefine standard, well-defined words in the interest of supporting their arguments.\nSo did he make an assertion that atheism has been around for a long time? Sure he did. But did he not also call all atheists fools? See it is right there, in the middle of the second sentence. He is paraphrasing the Bible, but it is clear, I think, that this is a statement that he agrees with. How do I know he accepts what the Bible says on the issue? Because he is using that paraphrased verse to support his statement, namely that “Atheism will always exist”. You don’t use an untrue statement to support your own claim now do you? So I don’t know why Vox is embarrassing himself implying that he doesn’t think we’re all fools over here. I don’t know what Vox is thinking. Pointing at claim/statement #1 does not negate that you made claim/statement #2.\nIt is entirely obvious that Skepdude doesn’t know what Vox is thinking; one of his problems is that he keeps claiming, incorrectly, that he does.  The veritable farrago of First Law Fandangos raises the question if he is even potentially capable of understanding what Vox is writing, let alone thinking.  A single “claim/statement” is obviously not the same thing as “a primary form of debate” so it’s not possible to even begin build a theoretical case for hypocrisy here, let alone present a convincing one.  As for the request for evidence of comparative intelligences, I respectfully submit that this pair of exchanges should more than suffice even without the previous compendium of readily available documentary evidence in support of the same conclusion.  One final note – on what internet do atheists only describe theistic\nbeliefs\nas stupid rather than the theists themselves?\nUPDATE: Skepdude simply\ncan’t figure it out\n:\nHow is it that you think that atheist are on average smarter than theists, but then turn around that the internet atheists are less intelligent than the theists?\nBecause internet atheists are a small subset of all atheists, and the theists they make a habit of calling stupid – the specific objects of ridicule listed were Alister McGrath, Dinesh D’Souza, and me – are an extremely small subset of theists.\nAs for the “challenge”, Skepdude’s argument(s) clearly qualified for Strawman under step 1 of the Wikipedia definition.  He repeatedly presented “a misrepresentation of the opponent’s position” because, among other things, he failed to understand who I was describing when I wrote “the objects of their ridicule”.  I even provided three examples, which made it clear that I was not talking about all of the nearly 6 billion theists on the planet, but rather a specific subset of theists who have written responses to the New Atheists.  Consider what we already know about all three theists specifically mentioned:  they are all authors who have been published at least six times apiece and their books clearly indicate a level of intelligence that ranges somewhere between +2 and +4SD above the norm.  All three attended elite universities and have the track record of tangible success expected of highly intelligent individuals.  One is even confirmed at least a +2SD IQ due to the Mensa requirements….\nOn the other hand, the inability of run-of-the-mill internet atheists to demonstrate even basic reading comprehension skills, combined with their predilection for spelling, grammatical, and logical errors as well as their easily verifiable ignorance of basic dictionary terms, indicates intelligence levels ranging from -1SD to +2SD.  While we don’t have absolute proof that Skepdude or any of the Internet atheists he mentioned don’t have 175+ IQs or that McGrath doesn’t have an 85 IQ – for that we’d need to collect the confirmed IQ results for everyone concerned – we do possess a rather large body of documentary evidence that permits one to reach the logical conclusion that I did: run-of-the-mill internet atheists regularly describe certain theists who are observably more intelligent than they are as stupid.  Now, Skepdude may not be guilty of explicitly engaging in this practice, but, as I pointed out, his commenters clearly are.  Skepdude even implicitly indulges in this practice himself, as the idea that I, or anyone else with a confirmed 132 IQ or better, require further education in order to understand something as simple as a strawman argument would be insulting if it wasn’t so ludicrous.\nI already explained this\nin my first post\n, but it seems that some people require it to be spelled out for them.  Which is not a problem, but, it should be noted, also tends to support my original point.  Skepdude could have easily saved himself a considerable amount of Strawman construction had he simply elected to ask “specifically what do you mean by objects of ridicule” rather than leaping at the perceived opportunity to hurl charges of error and hypocrisy.  But, this is the internet, and would-be critics seldom look before they leap.\nAnd yes, I am now officially bored with the subject.  No doubt you are too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-08T18:30:00+00:00"
}