{
  "url": "https://voxday.net/2009/04/05/hitchens-gets-his-ass-kicked-again/",
  "scraped_at": "2026-01-08T22:52:33.928557",
  "title": "Hitchens gets his ass kicked again",
  "date_display": "April 5, 2009",
  "date_iso": "2009-04-05T14:45:00+00:00",
  "date_from_url": "2009-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fortunately for Hitchens, if not his credibility, <a href=\"http://commonsenseatheism.com/?p=1230\">it’s only metaphorical this time</a>:</p><blockquote><p>The debate went exactly as I expected. Craig was flawless and unstoppable. Hitchens was rambling and incoherent, with the occasional rhetorical jab. Frankly, Craig spanked Hitchens like a foolish child. Perhaps Hitchens realized how bad things were for him after Craig’s opening speech, as even Hitchens’ rhetorical flourishes were not as confident as usual. Hitchens wasted his cross-examination time with questions like, “If a baby was born in Palestine, would you rather it be a Muslim baby or an atheist baby?” He did not even bother to give his concluding remarks, ceding the time instead to Q&amp;A.</p></blockquote><p>That summary, by the way, was not provided by an evangelical Christian, but an atheist blogger known as Common Sense Atheism.  He wasn’t the only one, as John Loftus of Debunking Christianity even <a href=\"http://debunkingchristianity.blogspot.com/2009/03/my-prediction-william-lane-craig-will.html\">predicted that Hitchens would get his head handed to him</a>.  A similar summary of the debate by a Christian in the audience <a href=\"http://douggeivett.wordpress.com/2009/04/05/william-lane-craig-vs-christopher-hitchens-first-report/\">can be found here</a>.  As is so often the case when the theist knows how to take the offensive, the atheist barely even attempts to defend himself against straightforward attacks on his arguments, but instead attempts to evade them because he simply doesn’t have any defense to offer.</p><p>Doug Geivett’s concise summary of Hitchens’s performance should suffice to finish him as a serious disputant on the subject: <i>“While Hitchens did make arguments, they were largely unfocused, sometimes disconnected, and often irrelevant.”</i> The honest observer of any creed, or lack of creed, will note that this could serve equally well as a description of the man’s book on the subject.</p></div>",
  "content_text": "Fortunately for Hitchens, if not his credibility,\nit’s only metaphorical this time\n:\nThe debate went exactly as I expected. Craig was flawless and unstoppable. Hitchens was rambling and incoherent, with the occasional rhetorical jab. Frankly, Craig spanked Hitchens like a foolish child. Perhaps Hitchens realized how bad things were for him after Craig’s opening speech, as even Hitchens’ rhetorical flourishes were not as confident as usual. Hitchens wasted his cross-examination time with questions like, “If a baby was born in Palestine, would you rather it be a Muslim baby or an atheist baby?” He did not even bother to give his concluding remarks, ceding the time instead to Q&A.\nThat summary, by the way, was not provided by an evangelical Christian, but an atheist blogger known as Common Sense Atheism.  He wasn’t the only one, as John Loftus of Debunking Christianity even\npredicted that Hitchens would get his head handed to him\n.  A similar summary of the debate by a Christian in the audience\ncan be found here\n.  As is so often the case when the theist knows how to take the offensive, the atheist barely even attempts to defend himself against straightforward attacks on his arguments, but instead attempts to evade them because he simply doesn’t have any defense to offer.\nDoug Geivett’s concise summary of Hitchens’s performance should suffice to finish him as a serious disputant on the subject:\n“While Hitchens did make arguments, they were largely unfocused, sometimes disconnected, and often irrelevant.”\nThe honest observer of any creed, or lack of creed, will note that this could serve equally well as a description of the man’s book on the subject.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-05T13:45:00+00:00"
}