{
  "url": "https://voxday.net/2009/04/21/in-which-we-are-grateful-for-obamas/",
  "scraped_at": "2026-01-08T22:54:00.247009",
  "title": "In which we are grateful for Obama’s election",
  "date_display": "April 21, 2009",
  "date_iso": "2009-04-21T08:56:00+00:00",
  "date_from_url": "2009-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Meghan McCain demonstrates that <a href=\"http://www.nydailynews.com/news/politics/2009/04/20/2009-04-20_meghan_mccain_im_being_followed_on_twitter_by_former_bush_administration_bigwig_.html\">the McCain genetics are deeply flawed</a>:</p><blockquote><p>“Karl Rove follows me on Twitter. That’s creepy,” wrote McCain, 24, on the DailyBeast website.  McCain wrote she joined Twitter a few months ago because it allowed her to share the “less serious” and “humorously uncensored moments” of her life. Twitter, the wildly popular microblogging platform, constrains messaging to 140 characters or less.</p><p>“But there’s also been a downside: I am now being followed by Karl Rove, and my local sheriff, and God knows how many other political pundits,” McCain wrote. “We need to take Twitter back from the creepy people.”</p><p>McCain said she’s intrigued by Rove’s Twitter feeds because at the White House Rove was viewed as this “inaccessible man-behind-the-curtain figure,” and, now, he’s sending out these public messages numerous times a day.</p></blockquote><p>Does the Chunky Chipmunk not realize that <i>she</i> is following <i>him</i>?  Or that if she is correct and Rove has a “ghost twitterer”, <i>he’s not the one following her</i> anyhow!  Republicans, please note that this wannabe possesses fully one-half the gene pool that you wanted to elect president.  As bad as Obama has been, as stupendously horrendous as he is going to be, you should still be down on your knees every day thanking your Creator that John McCain was not elected president.</p><p>Full disclosure:  I do not follow Miss McCain.  Nor do I see why anyone would bother, as I am confident it would be more profitable to seek wisdom and useful information in the pigeon droppings that litter the statues in the piazza.</p></div>",
  "content_text": "Meghan McCain demonstrates that\nthe McCain genetics are deeply flawed\n:\n“Karl Rove follows me on Twitter. That’s creepy,” wrote McCain, 24, on the DailyBeast website.  McCain wrote she joined Twitter a few months ago because it allowed her to share the “less serious” and “humorously uncensored moments” of her life. Twitter, the wildly popular microblogging platform, constrains messaging to 140 characters or less.\n“But there’s also been a downside: I am now being followed by Karl Rove, and my local sheriff, and God knows how many other political pundits,” McCain wrote. “We need to take Twitter back from the creepy people.”\nMcCain said she’s intrigued by Rove’s Twitter feeds because at the White House Rove was viewed as this “inaccessible man-behind-the-curtain figure,” and, now, he’s sending out these public messages numerous times a day.\nDoes the Chunky Chipmunk not realize that\nshe\nis following\nhim\n?  Or that if she is correct and Rove has a “ghost twitterer”,\nhe’s not the one following her\nanyhow!  Republicans, please note that this wannabe possesses fully one-half the gene pool that you wanted to elect president.  As bad as Obama has been, as stupendously horrendous as he is going to be, you should still be down on your knees every day thanking your Creator that John McCain was not elected president.\nFull disclosure:  I do not follow Miss McCain.  Nor do I see why anyone would bother, as I am confident it would be more profitable to seek wisdom and useful information in the pigeon droppings that litter the statues in the piazza.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-21T07:56:00+00:00"
}