{
  "url": "https://voxday.net/2009/04/17/in-which-mr-goldberg-loses-patience/",
  "scraped_at": "2026-01-08T22:53:47.491945",
  "title": "In which Mr. Goldberg loses patience",
  "date_display": "April 17, 2009",
  "date_iso": "2009-04-17T17:15:00+00:00",
  "date_from_url": "2009-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unfortunately, he’s still much too polite, as he left out the obvious, “<a href=\"http://corner.nationalreview.com/post/?q=MThlN2I5NTc4OWIwMTVmZTBjYjE3MzRiNjQzOGJmOGQ=\">Look, you utter morons</a>….”</p><blockquote><p>How do I say this so people will understand? <b>Fascism isn’t a libertarian doctrine!</b> It just isn’t, never will be and it can’t be cast as one. Anarchism, secessionism, extreme localism or rampant individualism may be bad, evil, wrong, stupid, selfish and all sorts of other things (though not by my lights). But they have nothing to do with a totalitarian vision of the state where individuals and institutions alike must march in step and take orders from the government.</p></blockquote><p>Anyone who describes libertarianism as being in <i>any</i> way akin to fascism is either a) totally dishonest, b) totally ignorant, or c) remarkably stupid.  Without exception.  The heart of fascism is “nulla contro lo stato”.  Nothing contrary to the State.  The heart of libertarianism is “lo stato limitato”.  The two ideologies are inimical and they always will be.</p></div>",
  "content_text": "Unfortunately, he’s still much too polite, as he left out the obvious, “\nLook, you utter morons\n….”\nHow do I say this so people will understand?\nFascism isn’t a libertarian doctrine!\nIt just isn’t, never will be and it can’t be cast as one. Anarchism, secessionism, extreme localism or rampant individualism may be bad, evil, wrong, stupid, selfish and all sorts of other things (though not by my lights). But they have nothing to do with a totalitarian vision of the state where individuals and institutions alike must march in step and take orders from the government.\nAnyone who describes libertarianism as being in\nany\nway akin to fascism is either a) totally dishonest, b) totally ignorant, or c) remarkably stupid.  Without exception.  The heart of fascism is “nulla contro lo stato”.  Nothing contrary to the State.  The heart of libertarianism is “lo stato limitato”.  The two ideologies are inimical and they always will be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-17T16:15:00+00:00"
}