{
  "url": "https://voxday.net/2009/04/13/interesting-times-pakistan/",
  "scraped_at": "2026-01-08T22:53:19.901183",
  "title": "Interesting times: Pakistan",
  "date_display": "April 13, 2009",
  "date_iso": "2009-04-13T22:18:00+00:00",
  "date_from_url": "2009-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rogue nukes!  Perhaps Obama will get his wish and have a shot <a href=\"http://www.smh.com.au/world/warning-that-pakistan-is-in-danger-of-collapse-within-months-20090412-a40u.html\">at his own invasion</a>.  But will he choose Pakistan, Somalia, or Thailand?</p><blockquote><p>PAKISTAN could collapse within months, one of the more influential counter-insurgency voices in Washington says.  The warning comes as the US scrambles to redeploy its military forces and diplomats in an attempt to stem rising violence and anarchy in Afghanistan and Pakistan….</p><p>As the US implements a new strategy in Central Asia so comprehensive that some analysts now dub the cross-border conflict “Obama’s war”, Dr Kilcullen said time was running out for international efforts to pull both countries back from the brink.</p></blockquote><p>Given that <i>Thailand</i> is engulfed in chaos, I won’t be surprised to see several national governments collapse before the end of the year.  And the more Washington insists on involving itself in these situations, the more likely additional forms of blowback will become.</p></div>",
  "content_text": "Rogue nukes!  Perhaps Obama will get his wish and have a shot\nat his own invasion\n.  But will he choose Pakistan, Somalia, or Thailand?\nPAKISTAN could collapse within months, one of the more influential counter-insurgency voices in Washington says.  The warning comes as the US scrambles to redeploy its military forces and diplomats in an attempt to stem rising violence and anarchy in Afghanistan and Pakistan….\nAs the US implements a new strategy in Central Asia so comprehensive that some analysts now dub the cross-border conflict “Obama’s war”, Dr Kilcullen said time was running out for international efforts to pull both countries back from the brink.\nGiven that\nThailand\nis engulfed in chaos, I won’t be surprised to see several national governments collapse before the end of the year.  And the more Washington insists on involving itself in these situations, the more likely additional forms of blowback will become.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-13T21:18:00+00:00"
}