{
  "url": "https://voxday.net/2009/04/23/its-hardly-diamonds-first-fiction/",
  "scraped_at": "2026-01-08T22:54:16.769211",
  "title": "It’s hardly Diamond’s first fiction",
  "date_display": "April 23, 2009",
  "date_iso": "2009-04-23T17:30:00+00:00",
  "date_from_url": "2009-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>His correct observation that territorial conflicts are more rooted in geography than religion notwithstanding, I have tended to consider <i>Guns, Germs, and Steel</i> to be little more than an ahistorical concoction that combines pop history and science with illogical speculation and political correctness.  So, <a href=\"http://www.nypost.com/seven/04232009/news/worldnews/tribal_libel_ambush_165820.htm\">his apparent carelessness</a> with easily verifiable facts doesn’t surprise me at all:</p><blockquote><p> In an April 21, 2008, article on blood feuds by Pulitzer Prize-winning scientist Jared Diamond, tribesman Daniel Wemp recounts how he spent three years hellbent on getting revenge for his uncle Soll’s death.  The feud led to six battles and the deaths of 300 pigs, the story went. Finally, a hired thug shot Isum Mandingo, the man Wemp held responsible for Soll’s murder, in the back with an arrow, leaving him paralyzed and in a wheelchair, according to Diamond….</p><p>When media watchdog group stinkyjournalism.org sent a team of fact-checkers to New Guinea to check the article’s veracity, they found Mandingo, who disputed reports of his paralysis by walking on his own two feet.</p><p>“No matter what The New Yorker says and what Diamond says, the fact is that he is not paralyzed and is not confined to a wheelchair,” said Rhonda Shearer, the site’s founder…</p><p>There were no shouts and murders, but the story remains the talk of the tribes, she said.  Mandingo told the researchers he had no involvement in any blood feuds.</p></blockquote><p>Journalists always get something basic wrong.  Always.  I’ve seen factual errors in pieces only <i>one paragraph long!</i> The facts only exist insofar as they support the preconceived narrative, and if the two happen to come into conflict, most of the time it’s the facts that will be jettisoned.</p></div>",
  "content_text": "His correct observation that territorial conflicts are more rooted in geography than religion notwithstanding, I have tended to consider\nGuns, Germs, and Steel\nto be little more than an ahistorical concoction that combines pop history and science with illogical speculation and political correctness.  So,\nhis apparent carelessness\nwith easily verifiable facts doesn’t surprise me at all:\nIn an April 21, 2008, article on blood feuds by Pulitzer Prize-winning scientist Jared Diamond, tribesman Daniel Wemp recounts how he spent three years hellbent on getting revenge for his uncle Soll’s death.  The feud led to six battles and the deaths of 300 pigs, the story went. Finally, a hired thug shot Isum Mandingo, the man Wemp held responsible for Soll’s murder, in the back with an arrow, leaving him paralyzed and in a wheelchair, according to Diamond….\nWhen media watchdog group stinkyjournalism.org sent a team of fact-checkers to New Guinea to check the article’s veracity, they found Mandingo, who disputed reports of his paralysis by walking on his own two feet.\n“No matter what The New Yorker says and what Diamond says, the fact is that he is not paralyzed and is not confined to a wheelchair,” said Rhonda Shearer, the site’s founder…\nThere were no shouts and murders, but the story remains the talk of the tribes, she said.  Mandingo told the researchers he had no involvement in any blood feuds.\nJournalists always get something basic wrong.  Always.  I’ve seen factual errors in pieces only\none paragraph long!\nThe facts only exist insofar as they support the preconceived narrative, and if the two happen to come into conflict, most of the time it’s the facts that will be jettisoned.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-23T16:30:00+00:00"
}