{
  "url": "https://voxday.net/2009/04/05/keynesians-are-wrong-again/",
  "scraped_at": "2026-01-08T22:52:35.763109",
  "title": "The Keynesians are wrong again",
  "date_display": "April 5, 2009",
  "date_iso": "2009-04-05T18:30:00+00:00",
  "date_from_url": "2009-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The chancellor <a href=\"http://business.timesonline.co.uk/tol/business/economics/article6037167.ece\">admits his error</a> and pushes the date of anticipated economic recovery further into the future:</p><blockquote><p>THE chancellor, Alistair Darling, has admitted that he and his Treasury officials got it wrong over the length and severity of the recession and that he will be forced to tear up his economic predictions….  “I thought we would see growth in the second part of the year,” he said.  However, the chancellor now thinks any recovery will come later: “I think it will be the back end, turn of the year time, before we start seeing growth here.”</p></blockquote><p>I anticipated this, as you may recall, <a href=\"http://www.milobookclub.com/2008/10/18/innovation-in-economics/\">last October</a>: <i>“Increasing government spending to escape a recession? Now, there’s a new concept! Considering that Darling’s brilliant plan has literally been textbook macroeconomics for the past five decades, what are the chances that this is somehow going to fail? Infinity to one against or Infinity squared to one?</i>“</p><p>As an encore, I’m going to go out on a massive limb and predict that Jim Cramer is completely incorrect in declaring, on April 2, 2009, that the depression is over and a new bull run is commencing:</p><blockquote><p>Throughout that day, the “Mad Money” host told viewers of MSNBC’s “Morning Joe,” CNBC’s “Street Signs” and finally on his own program that the Depression was over and that we were on the verge of a bull run for the financial markets.  “We have reached the land of a thousand bull dances – phoney maroney, why? Because the market swallowed its Prozac,” Cramer said on CNBC’s “Mad Money” April 2. “And right now, right here on this show – I am announcing the Depression over!”</p></blockquote><p>There will probably be a nice bear market rally.  I correctly anticipated the first leg of it a few weeks ago when I told the shorts to get out.  But, sometime during 2010, Cramer is going to be eating mega-crow about this absurd announcement.</p></div>",
  "content_text": "The chancellor\nadmits his error\nand pushes the date of anticipated economic recovery further into the future:\nTHE chancellor, Alistair Darling, has admitted that he and his Treasury officials got it wrong over the length and severity of the recession and that he will be forced to tear up his economic predictions….  “I thought we would see growth in the second part of the year,” he said.  However, the chancellor now thinks any recovery will come later: “I think it will be the back end, turn of the year time, before we start seeing growth here.”\nI anticipated this, as you may recall,\nlast October\n:\n“Increasing government spending to escape a recession? Now, there’s a new concept! Considering that Darling’s brilliant plan has literally been textbook macroeconomics for the past five decades, what are the chances that this is somehow going to fail? Infinity to one against or Infinity squared to one?\n“\nAs an encore, I’m going to go out on a massive limb and predict that Jim Cramer is completely incorrect in declaring, on April 2, 2009, that the depression is over and a new bull run is commencing:\nThroughout that day, the “Mad Money” host told viewers of MSNBC’s “Morning Joe,” CNBC’s “Street Signs” and finally on his own program that the Depression was over and that we were on the verge of a bull run for the financial markets.  “We have reached the land of a thousand bull dances – phoney maroney, why? Because the market swallowed its Prozac,” Cramer said on CNBC’s “Mad Money” April 2. “And right now, right here on this show – I am announcing the Depression over!”\nThere will probably be a nice bear market rally.  I correctly anticipated the first leg of it a few weeks ago when I told the shorts to get out.  But, sometime during 2010, Cramer is going to be eating mega-crow about this absurd announcement.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-05T17:30:00+00:00"
}