{
  "url": "https://voxday.net/2009/04/21/lobby-is-at-it-again/",
  "scraped_at": "2026-01-08T22:54:02.097650",
  "title": "The Lobby is at it again",
  "date_display": "April 21, 2009",
  "date_iso": "2009-04-21T13:39:00+00:00",
  "date_from_url": "2009-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What a shocking surprise.  No doubt all of the true blue, patriotic pro-American columnists in the conservative media will be writing about <a href=\"http://static.cqpolitics.com/harman-3098436-page1.html?docID=hsnews-000003098436&amp;cpage=1\">AIPAC’s latest attempt</a> to covertly influence the US government via a corrupt Democrat rather than express shock and horror that <a href=\"http://corner.nationalreview.com/post/?q=ZTc3YzQ4OTJmMDdjZGZmODhmOWI4ZWJiNWQyNmFhNmQ=\">Switzerland is still neutral</a>:</p><blockquote><p>Rep. Jane Harman , the California Democrat with a longtime involvement in intelligence issues, was overheard on an NSA wiretap telling a suspected Israeli agent that she would lobby the Justice Department reduce espionage-related charges against two officials of the American Israeli Public Affairs Committee, the most powerful pro-Israel organization in Washington.</p></blockquote><p>I am generally pro-Israel myself.  I’m certainly not in the least bit sympathetic to the so-called Palestinians, much less the modern remnants of the Persian empire.  But it is utterly absurd for the dual citizens in both the conservative and mainstream medias to declare that anyone who might happen to cast a skeptical eye on <i>traitorous espionage</i> is anti-semitic.  In fact, the only logical conclusion is that anyone who attempts to shut down the discussion of AIPAC’s misdeeds must be at least somewhat opposed to American interests.</p><p>As I wrote to Mark Steyn earlier today, with the exception of Germany, Europeans are completely Holocausted-out.  Crying Holocaust or anointing a Hitler of the week just isn’t taken seriously by anyone anymore.  In fact, the laws against Holocaust denial have only led people to call the Holocaust into question.  After all, there’s no need for a law against denying World War II, <i>because everyone knows it happened</i>.</p><p>UPDATE – Steve Sailer brings in a guest commentator <a href=\"http://isteve.blogspot.com/2009/04/guest-commentary-on-rep-jane-harmans.html\">to comment</a> on the Harman situation:</p><blockquote><p>Excessive partiality for one foreign nation and excessive dislike of another cause those whom they actuate to see danger only on one side, and serve to veil and even second the arts of influence on the other. Real patriots who may resist the intrigues of the favorite are liable to become suspected and odious, while its tools and dupes usurp the applause and confidence of the people to surrender their interests.”</p></blockquote></div>",
  "content_text": "What a shocking surprise.  No doubt all of the true blue, patriotic pro-American columnists in the conservative media will be writing about\nAIPAC’s latest attempt\nto covertly influence the US government via a corrupt Democrat rather than express shock and horror that\nSwitzerland is still neutral\n:\nRep. Jane Harman , the California Democrat with a longtime involvement in intelligence issues, was overheard on an NSA wiretap telling a suspected Israeli agent that she would lobby the Justice Department reduce espionage-related charges against two officials of the American Israeli Public Affairs Committee, the most powerful pro-Israel organization in Washington.\nI am generally pro-Israel myself.  I’m certainly not in the least bit sympathetic to the so-called Palestinians, much less the modern remnants of the Persian empire.  But it is utterly absurd for the dual citizens in both the conservative and mainstream medias to declare that anyone who might happen to cast a skeptical eye on\ntraitorous espionage\nis anti-semitic.  In fact, the only logical conclusion is that anyone who attempts to shut down the discussion of AIPAC’s misdeeds must be at least somewhat opposed to American interests.\nAs I wrote to Mark Steyn earlier today, with the exception of Germany, Europeans are completely Holocausted-out.  Crying Holocaust or anointing a Hitler of the week just isn’t taken seriously by anyone anymore.  In fact, the laws against Holocaust denial have only led people to call the Holocaust into question.  After all, there’s no need for a law against denying World War II,\nbecause everyone knows it happened\n.\nUPDATE – Steve Sailer brings in a guest commentator\nto comment\non the Harman situation:\nExcessive partiality for one foreign nation and excessive dislike of another cause those whom they actuate to see danger only on one side, and serve to veil and even second the arts of influence on the other. Real patriots who may resist the intrigues of the favorite are liable to become suspected and odious, while its tools and dupes usurp the applause and confidence of the people to surrender their interests.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-21T12:39:00+00:00"
}