{
  "url": "https://voxday.net/2009/04/17/mailvox-no-psychopaths-here/",
  "scraped_at": "2026-01-08T22:53:42.015021",
  "title": "Mailvox: no psychopaths here",
  "date_display": "April 17, 2009",
  "date_iso": "2009-04-17T08:43:00+00:00",
  "date_from_url": "2009-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB queries local eddies in the psycho-social continuum:</p><blockquote><p>I enjoyed your exploration in the angels trilogy of the psychology of two school shooters superficially similar to Dylan and Klebold. I wonder if you have seen <a href=\"http://www.slate.com/id/2099203/\">this article </a>offering a different story than the “bullying” line for Dylan and Klebold’s behavior.</p><p>I am not deprecating bullying as a factor since loneliness is a major part of the human suffering of psychopathy. But I suspect after reading that it was not bullying but psychopathic nihilistic contempt for humanity that best explains the massacre. I noted three points from the article:</p><p>1) Harris went quiet and planned for a year, allowing many people on the hit list to graduate<br>2) The planned massacre revolved around explosives, was orders of magnitudes larger, and was aimed at targets beyond the school<br>3) Harris seems to fit the psychopathic mastermind personality so well – the article develops a more comprehensive picture of his words and actions over time than the “bullying did it” articles I’ve seen</br></br></p><p>What do you think of the figures tossed around, that 1% or 4% are psychopaths? Could one say that you and Bane are both ones? Over the last month I have been induced by life evidence to evaluate my psychological profile, then a close friend’s, and that is how I came across the Columbine article.</p></blockquote><p>It was an interesting article.  Harris was certainly an intriguing personality; I’m rather pleased that my fictional portrayal appears to have gotten the dynamic between the two killers generally right.  In answer to JB’s questions, I think the percentages are exaggerated, as the imprecision alone is sufficient to indicate.  And I don’t believe that either Bane or I can be reasonably described as pyschopathic even though both of us might superficially appear to score higher than the average on the Hare checklist.  To paraphrase something Bane once said, ruthlessness is often nothing more than a comprehensive understanding the range of the available choices and a willingness to act on the basis of that understanding.  But we’re both far too accepting of our personal responsibilities and far too little impressed by our places in the vastness of Creation to ever qualify as being even remotely psychopathic.</p><p>I will admit that the highly intelligent are probably more prone to being inaccurately viewed as a bit psychopathic, although it’s not reasonable to always blame a lack of empathy for holding people in contempt; many, if not most, people are genuinely contemptible in one way or another.  For example, holding an individual in contempt because he is a relative retard incapable of basic reading comprehension or formulating substantive criticism is not tantamount to denying his equal value as a human being in possession of a soul.  It simply means that his opinions are of no value.  I believe there is no shortage of evidence to demonstrate that this is true most of the time for most of the 6 billion individuals on the planet.</p><p>However, it’s also true that those who favor the abstract over the material, as most intellectuals do, operate in a manner that can appear to be similar to psychopaths in that they don’t tend to pay a great deal of attention to individual matters.  But this is generally an issue of focus and perspective, not incapacity.  The significant difference can be seen in the way that genuine intellectuals don’t take criticism personally because they know that it is their ideas that are the real target; the psychopath, on the other hand, invents slights and takes great personal offense at imaginary provocations because he believes that everything revolves around him.</p></div>",
  "content_text": "JB queries local eddies in the psycho-social continuum:\nI enjoyed your exploration in the angels trilogy of the psychology of two school shooters superficially similar to Dylan and Klebold. I wonder if you have seen\nthis article\noffering a different story than the “bullying” line for Dylan and Klebold’s behavior.\nI am not deprecating bullying as a factor since loneliness is a major part of the human suffering of psychopathy. But I suspect after reading that it was not bullying but psychopathic nihilistic contempt for humanity that best explains the massacre. I noted three points from the article:\n1) Harris went quiet and planned for a year, allowing many people on the hit list to graduate\n2) The planned massacre revolved around explosives, was orders of magnitudes larger, and was aimed at targets beyond the school\n3) Harris seems to fit the psychopathic mastermind personality so well – the article develops a more comprehensive picture of his words and actions over time than the “bullying did it” articles I’ve seen\nWhat do you think of the figures tossed around, that 1% or 4% are psychopaths? Could one say that you and Bane are both ones? Over the last month I have been induced by life evidence to evaluate my psychological profile, then a close friend’s, and that is how I came across the Columbine article.\nIt was an interesting article.  Harris was certainly an intriguing personality; I’m rather pleased that my fictional portrayal appears to have gotten the dynamic between the two killers generally right.  In answer to JB’s questions, I think the percentages are exaggerated, as the imprecision alone is sufficient to indicate.  And I don’t believe that either Bane or I can be reasonably described as pyschopathic even though both of us might superficially appear to score higher than the average on the Hare checklist.  To paraphrase something Bane once said, ruthlessness is often nothing more than a comprehensive understanding the range of the available choices and a willingness to act on the basis of that understanding.  But we’re both far too accepting of our personal responsibilities and far too little impressed by our places in the vastness of Creation to ever qualify as being even remotely psychopathic.\nI will admit that the highly intelligent are probably more prone to being inaccurately viewed as a bit psychopathic, although it’s not reasonable to always blame a lack of empathy for holding people in contempt; many, if not most, people are genuinely contemptible in one way or another.  For example, holding an individual in contempt because he is a relative retard incapable of basic reading comprehension or formulating substantive criticism is not tantamount to denying his equal value as a human being in possession of a soul.  It simply means that his opinions are of no value.  I believe there is no shortage of evidence to demonstrate that this is true most of the time for most of the 6 billion individuals on the planet.\nHowever, it’s also true that those who favor the abstract over the material, as most intellectuals do, operate in a manner that can appear to be similar to psychopaths in that they don’t tend to pay a great deal of attention to individual matters.  But this is generally an issue of focus and perspective, not incapacity.  The significant difference can be seen in the way that genuine intellectuals don’t take criticism personally because they know that it is their ideas that are the real target; the psychopath, on the other hand, invents slights and takes great personal offense at imaginary provocations because he believes that everything revolves around him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-17T07:43:00+00:00"
}