{
  "url": "https://voxday.net/2009/04/20/mailvox-aztec-invasion/",
  "scraped_at": "2026-01-08T22:53:58.442812",
  "title": "Mailvox: AnAztecinvasion",
  "date_display": "April 20, 2009",
  "date_iso": "2009-04-20T18:32:00+00:00",
  "date_from_url": "2009-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>FD isn’t optimistic:</p><blockquote><p>As a naturalized citizen of Spanish origin , I welcome your analysis.  The problem with the immigration issue in the United States is that much of it comes from one country, Mexico.  The term “Hispanic” or “Latin” has been corrupted here in order to hide politically incorrect truths . First of all, Mexico does not call itself a “Latin” or “Hispanic” country, it is always shouting through its semi-controlled media that they are <i>una nacion azteca</i>.  Translation: “We are an Aztec nation”.</p><p>You can imagine what horrors and screams that would happen in the U.S. if the media and the government here proclaimed: “We are an Anglo-Saxon nation”.  I say this to correct the impression regarding the ethnicity of most of the illegal aliens that cross the u.s. mexico border.  The truth is that most of the “illegals” are not really “Hispanic” or “Latin” either in ethnicity or outlook , their true cultural roots are actually “Mezo-American ” or “Indian”.</p><p>Mexico and Central America is actually a majority “Indian” or “Mestizo” societies , except for the higher Spanish classes, the majority of the poor populations are pre-Columbian descendants. As long as these populations were checked by natural causes and infant mortalities the balance with<br>the neighbor U.S. was not much of a problem .  In the post-World War II era, UN and private charitable programs of vaccinations and clean water have permitted these countries with large family traditions to explode its populations, with no hope that their economies would expand to service all these extra people .</br></p><p>Non-christian or “pre-christian” imperial societies would know how to act under these outside pressures the United States is under, a program like Japan or China to kick out anybody who is not “like them”, or like ancient Rome establish a no-man’s land frontier of forts and army posts across the border in order to hold back the tide.  these measures are going to take a tremedous amount of courage and fortitude to implement, unfortunately the “west” has apparently been softened by Marxism and other pseudo-christian and cosmopolitan ideologies and frankly I do not think it can recover.</p></blockquote><p>This almost forces one to contemplate the obvious question.  If the Aztec population of California decides to erect the Great Pyramid of Los Angeles and dedicate it to the Sun God, would carving the hearts out of captured Anglos be a Constitutionally-protected practice under the First Amendment?  I mean, it would be hard to argue that it wasn’t a genuine exercise of religion with verifiable historical antecedents.</p></div>",
  "content_text": "FD isn’t optimistic:\nAs a naturalized citizen of Spanish origin , I welcome your analysis.  The problem with the immigration issue in the United States is that much of it comes from one country, Mexico.  The term “Hispanic” or “Latin” has been corrupted here in order to hide politically incorrect truths . First of all, Mexico does not call itself a “Latin” or “Hispanic” country, it is always shouting through its semi-controlled media that they are\nuna nacion azteca\n.  Translation: “We are an Aztec nation”.\nYou can imagine what horrors and screams that would happen in the U.S. if the media and the government here proclaimed: “We are an Anglo-Saxon nation”.  I say this to correct the impression regarding the ethnicity of most of the illegal aliens that cross the u.s. mexico border.  The truth is that most of the “illegals” are not really “Hispanic” or “Latin” either in ethnicity or outlook , their true cultural roots are actually “Mezo-American ” or “Indian”.\nMexico and Central America is actually a majority “Indian” or “Mestizo” societies , except for the higher Spanish classes, the majority of the poor populations are pre-Columbian descendants. As long as these populations were checked by natural causes and infant mortalities the balance with\nthe neighbor U.S. was not much of a problem .  In the post-World War II era, UN and private charitable programs of vaccinations and clean water have permitted these countries with large family traditions to explode its populations, with no hope that their economies would expand to service all these extra people .\nNon-christian or “pre-christian” imperial societies would know how to act under these outside pressures the United States is under, a program like Japan or China to kick out anybody who is not “like them”, or like ancient Rome establish a no-man’s land frontier of forts and army posts across the border in order to hold back the tide.  these measures are going to take a tremedous amount of courage and fortitude to implement, unfortunately the “west” has apparently been softened by Marxism and other pseudo-christian and cosmopolitan ideologies and frankly I do not think it can recover.\nThis almost forces one to contemplate the obvious question.  If the Aztec population of California decides to erect the Great Pyramid of Los Angeles and dedicate it to the Sun God, would carving the hearts out of captured Anglos be a Constitutionally-protected practice under the First Amendment?  I mean, it would be hard to argue that it wasn’t a genuine exercise of religion with verifiable historical antecedents.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-20T17:32:00+00:00"
}