{
  "url": "https://voxday.net/2009/04/28/mailvox-that-sounds-familiar/",
  "scraped_at": "2026-01-08T22:54:41.295135",
  "title": "Mailvox: that sounds familiar",
  "date_display": "April 28, 2009",
  "date_iso": "2009-04-28T08:28:00+00:00",
  "date_from_url": "2009-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JC has a request:</p><blockquote><p>I am a member of the Ft Lauderdale Socrates Cafe, with numerous atheists on its extensive mailing list.  Recently an atheist submitted a farcical “Exam” for believers to answer.  I would like to submit one question from this exam for you to answer and submit it in the near future to give the atheists a little something to mull over.  This is one of the BETTER questions.  You should see the others.  You addressed an atheist’s question last January.  When I posted your response to the mailing list it was like an intellectual time bomb went off.  They all retreated to their holes for over a week and nobody would refute it.</p><p><i>Which of the following is most likely to be true, and why?</i></p><p>1. Romulus was the son of God, born to a mortal human virgin.<br>2. Dionysus turned water into wine.<br>3. Apollonius of Tyana raised a girl from the dead.<br>4. Jesus Christ was the son of God, born to a mortal virgin. turned water into wine, and raised a man from the dead.</br></br></br></p></blockquote><p>What a surprise to learn that argumentative Internet atheists should suddenly fall silent when confronted with one of my responses.  Unfortunately for the state of the discourse, that has become the usual pattern, which doesn’t reflect well on their confidence in their own arguments.  But how can I deny the request after hearing such an amusing AAR of the previous engagement?  My conclusions are as follows:</p><p>1. This is obviously the least credible of the four options presented because Romulus was never claimed to have been the son of God, but the son of Mars, the Roman god of war who does not merit the capital-G being himself the son of Jupiter.  Furthermore, the claim was always considered specious because the mother was assumed to have asserted divine paternity in a futile attempt to save her twin sons from the royal authorities. The historical record even states outright that rape was the cause of her pregnancy.  Livy describes it thusly: <i>“THE STORY OF ROMULUS. Birth and Uprearing.  But the Fates had, I believe, already decreed the origin of this great city and the foundation of the mightiest empire under heaven. The Vestal was forcibly violated and gave birth to twins. She named Mars as their father, either because she really believed it, or because the fault might appear less heinous if a deity were the cause of it. But neither gods nor men sheltered her or her babes from the king’s cruelty; the priestess was thrown into prison, the boys were ordered to be thrown into the river.”</i></p><p>2. There are no histories which claim the Greek god Dionysius turned water into wine nor are there any purported eyewitnesses to him doing so; the histories which do mention water turning into wine at two temples dedicated to him don’t even pretend to take the tradition seriously.  Pausanius writes: <i>“Three pots are brought into the building by the priests and set down empty in the presence of the citizens and of any strangers who may chance to be in the country. The doors of the building are sealed by the priests themselves and by any others who may be so inclined.  On the morrow they are allowed to examine the seals, and on going into the building they find the pots filled with wine….  If the Greeks are to be believed in these matters, one might with equal reason accept what the Ethiopians above Syene say about the table of the sun.”</i></p><p>And then, of course, one must also take into account that no one actually claimed to have ever seen Dionysius, for the very good reason that the sight of him was generally supposed to immediately precede being torn to pieces by his maddened Maenads.  Dionysius is a mythic deity; there has never been any belief that he was a historical personage in either his Greek or Roman form.</p><p>3. We are told that there is little information about Apollonius that does not come from Philostratus, who is believed to have fabricated many of the stories and dialogues in <i>Life of Apollonius of Tyana</i>, which was not completed until 217 AD at the earliest.  Philostratus’s temporal distance from the events he is relating means they are less credible than the Gospels by historical definition.  The similarity between the miraculous deeds of Jesus Christ and the miracles of Apollonius, combined with the fact that Philostratus wrote the “biography” at the request of Julia Domna, a Roman empress from a priestly pagan family of Baal-worshippers, strongly suggests that the work was conceived as propaganda intended to help the pagan priesthood compete with a rapidly growing Christianity.  This conclusion is supported by the fact that Domna’s husband, the emperor Septimus Severus, outlawed conversion to Christianity, and that the Emperor Diocletian later made use of the fictional biography during the Diocletianic Persecution of 303–311.</p><p>4: The four accounts of Jesus Christ’s life are written by three men who were eyewitnesses to the claimed events and a fourth man who was personally acquainted with individuals who were eyewitnesses.  All four accounts are rife with archeologically verifiable facts, some of which were first known only through the Gospels, while the age and number of manuscripts containing them render the Gospels inherently more historically credible than most ancient documents whose veracity is undoubted.  Therefore, option D, Jesus Christ was the son of God, born to a mortal virgin, turned water into wine, and raised a man from the dead, is more likely to be true even though it is superficially three times more incredible than any of the competing claims offered.</p><p>However, if anyone should like to make a competing case for options 1-3, I would be pleased to see them do so here, since it seems unlikely that the devotees of Socrates are going to do so.</p><p>UPDATE: DaveD brings <a href=\"http://www.boecomic.com/?p=344\">a timely comic</a> to our attention.</p></div>",
  "content_text": "JC has a request:\nI am a member of the Ft Lauderdale Socrates Cafe, with numerous atheists on its extensive mailing list.  Recently an atheist submitted a farcical “Exam” for believers to answer.  I would like to submit one question from this exam for you to answer and submit it in the near future to give the atheists a little something to mull over.  This is one of the BETTER questions.  You should see the others.  You addressed an atheist’s question last January.  When I posted your response to the mailing list it was like an intellectual time bomb went off.  They all retreated to their holes for over a week and nobody would refute it.\nWhich of the following is most likely to be true, and why?\n1. Romulus was the son of God, born to a mortal human virgin.\n2. Dionysus turned water into wine.\n3. Apollonius of Tyana raised a girl from the dead.\n4. Jesus Christ was the son of God, born to a mortal virgin. turned water into wine, and raised a man from the dead.\nWhat a surprise to learn that argumentative Internet atheists should suddenly fall silent when confronted with one of my responses.  Unfortunately for the state of the discourse, that has become the usual pattern, which doesn’t reflect well on their confidence in their own arguments.  But how can I deny the request after hearing such an amusing AAR of the previous engagement?  My conclusions are as follows:\n1. This is obviously the least credible of the four options presented because Romulus was never claimed to have been the son of God, but the son of Mars, the Roman god of war who does not merit the capital-G being himself the son of Jupiter.  Furthermore, the claim was always considered specious because the mother was assumed to have asserted divine paternity in a futile attempt to save her twin sons from the royal authorities. The historical record even states outright that rape was the cause of her pregnancy.  Livy describes it thusly:\n“THE STORY OF ROMULUS. Birth and Uprearing.  But the Fates had, I believe, already decreed the origin of this great city and the foundation of the mightiest empire under heaven. The Vestal was forcibly violated and gave birth to twins. She named Mars as their father, either because she really believed it, or because the fault might appear less heinous if a deity were the cause of it. But neither gods nor men sheltered her or her babes from the king’s cruelty; the priestess was thrown into prison, the boys were ordered to be thrown into the river.”\n2. There are no histories which claim the Greek god Dionysius turned water into wine nor are there any purported eyewitnesses to him doing so; the histories which do mention water turning into wine at two temples dedicated to him don’t even pretend to take the tradition seriously.  Pausanius writes:\n“Three pots are brought into the building by the priests and set down empty in the presence of the citizens and of any strangers who may chance to be in the country. The doors of the building are sealed by the priests themselves and by any others who may be so inclined.  On the morrow they are allowed to examine the seals, and on going into the building they find the pots filled with wine….  If the Greeks are to be believed in these matters, one might with equal reason accept what the Ethiopians above Syene say about the table of the sun.”\nAnd then, of course, one must also take into account that no one actually claimed to have ever seen Dionysius, for the very good reason that the sight of him was generally supposed to immediately precede being torn to pieces by his maddened Maenads.  Dionysius is a mythic deity; there has never been any belief that he was a historical personage in either his Greek or Roman form.\n3. We are told that there is little information about Apollonius that does not come from Philostratus, who is believed to have fabricated many of the stories and dialogues in\nLife of Apollonius of Tyana\n, which was not completed until 217 AD at the earliest.  Philostratus’s temporal distance from the events he is relating means they are less credible than the Gospels by historical definition.  The similarity between the miraculous deeds of Jesus Christ and the miracles of Apollonius, combined with the fact that Philostratus wrote the “biography” at the request of Julia Domna, a Roman empress from a priestly pagan family of Baal-worshippers, strongly suggests that the work was conceived as propaganda intended to help the pagan priesthood compete with a rapidly growing Christianity.  This conclusion is supported by the fact that Domna’s husband, the emperor Septimus Severus, outlawed conversion to Christianity, and that the Emperor Diocletian later made use of the fictional biography during the Diocletianic Persecution of 303–311.\n4: The four accounts of Jesus Christ’s life are written by three men who were eyewitnesses to the claimed events and a fourth man who was personally acquainted with individuals who were eyewitnesses.  All four accounts are rife with archeologically verifiable facts, some of which were first known only through the Gospels, while the age and number of manuscripts containing them render the Gospels inherently more historically credible than most ancient documents whose veracity is undoubted.  Therefore, option D, Jesus Christ was the son of God, born to a mortal virgin, turned water into wine, and raised a man from the dead, is more likely to be true even though it is superficially three times more incredible than any of the competing claims offered.\nHowever, if anyone should like to make a competing case for options 1-3, I would be pleased to see them do so here, since it seems unlikely that the devotees of Socrates are going to do so.\nUPDATE: DaveD brings\na timely comic\nto our attention.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-28T07:28:00+00:00"
}