{
  "url": "https://voxday.net/2009/04/10/mailvox-just-read-bloody-book/",
  "scraped_at": "2026-01-08T22:53:05.295544",
  "title": "Mailvox: just read the bloody book",
  "date_display": "April 10, 2009",
  "date_iso": "2009-04-10T12:34:00+00:00",
  "date_from_url": "2009-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BL suggests a theory as to why internet discourse takes place at such a low level today:</p><blockquote><p>I wish to comment on books and reading. My observation is that most people don’t read books; those that claim to usually don’t finish them or skim the book, read the forward, and carry on as if they,ve read it confident that next person they encounter on the subject has done the same thing or less. This I find to be predominant among younger liberals who operate behind an intellectual facade. They then seem to be convinced that they have actually read the book! This is clearly evident in the response to TIA – an excellent and valuable book which I like to give as a gift to students.</p></blockquote><p>I find it remarkable how many individuals on both sides of numerous debates – not just the atheism/religion one – operate in almost complete ignorance of not only the material on the other side, but of the material <i>on their own side!</i> Just as it’s readily apparent that the average individual who brings up Hume, Epictetus, or Plato have never read their works, it’s seldom hard to detect that a significant percentage of those who claim they have read the works of Shakespeare, Dickens, or Homer have actually done so.</p><p>The conflation of having heard of something with <i>knowing</i> it is a widespread disease, and tools like Wikipedia and other Internet reference sites only make it worse.  But reading a single famous quote from a work is not tantamount to reading the work itself, and citing a summary on Wikipedia is not indicative of actually understanding anything about that which is being summarized.</p><p>Most people read only to have their prejudices confirmed.  So, if you want to have a significant advantage over most people, always read as much as you can about your subject from every perspective.  I don’t particularly enjoy wallowing in jargon-filled Communist literature, logically challenged atheist philosophy or mindless neo-monetarism with a Keynesian twist, but I do it because I cannot understand the full scope of the discourse if I don’t.</p><p>I very seldom agree with Cisbio – and <i>mama mia</i> is he in for a spanking when I finally get around to replying to his last critique – but one thing he was absolutely right to do was to call me on my not having read a book that I cited based on a third-party reference.  In general, it’s always wise to either read a book so that you know what you’re talking about, or just keep your mouth shut about it.</p></div>",
  "content_text": "BL suggests a theory as to why internet discourse takes place at such a low level today:\nI wish to comment on books and reading. My observation is that most people don’t read books; those that claim to usually don’t finish them or skim the book, read the forward, and carry on as if they,ve read it confident that next person they encounter on the subject has done the same thing or less. This I find to be predominant among younger liberals who operate behind an intellectual facade. They then seem to be convinced that they have actually read the book! This is clearly evident in the response to TIA – an excellent and valuable book which I like to give as a gift to students.\nI find it remarkable how many individuals on both sides of numerous debates – not just the atheism/religion one – operate in almost complete ignorance of not only the material on the other side, but of the material\non their own side!\nJust as it’s readily apparent that the average individual who brings up Hume, Epictetus, or Plato have never read their works, it’s seldom hard to detect that a significant percentage of those who claim they have read the works of Shakespeare, Dickens, or Homer have actually done so.\nThe conflation of having heard of something with\nknowing\nit is a widespread disease, and tools like Wikipedia and other Internet reference sites only make it worse.  But reading a single famous quote from a work is not tantamount to reading the work itself, and citing a summary on Wikipedia is not indicative of actually understanding anything about that which is being summarized.\nMost people read only to have their prejudices confirmed.  So, if you want to have a significant advantage over most people, always read as much as you can about your subject from every perspective.  I don’t particularly enjoy wallowing in jargon-filled Communist literature, logically challenged atheist philosophy or mindless neo-monetarism with a Keynesian twist, but I do it because I cannot understand the full scope of the discourse if I don’t.\nI very seldom agree with Cisbio – and\nmama mia\nis he in for a spanking when I finally get around to replying to his last critique – but one thing he was absolutely right to do was to call me on my not having read a book that I cited based on a third-party reference.  In general, it’s always wise to either read a book so that you know what you’re talking about, or just keep your mouth shut about it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-10T11:34:00+00:00"
}