{
  "url": "https://voxday.net/2009/04/01/national-health-care-resu/",
  "scraped_at": "2026-01-08T22:52:15.487033",
  "title": "Death Hospital",
  "date_display": "April 1, 2009",
  "date_iso": "2009-04-01T11:17:00+00:00",
  "date_from_url": "2009-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Americans who like to trumpet the wonders of the British NHS should probably think twice before subjecting themselves to <a href=\"http://www.timesonline.co.uk/tol/news/uk/health/article5924777.ece\">its tender mercies</a>:</p><blockquote><p>Patients admitted for emergency treatment at an NHS Trust were subjected to “shocking and appalling” care that included untrained receptionists carrying out medical checks and heart monitors being switched off, a report concluded today.  The Healthcare Commission, the NHS standards watchdog, said that evidence suggested that as many as 400 deaths at Mid Staffordshire NHS Foundation Trust could have been prevented and may have been the result of poor care.</p></blockquote><p>That’s 400 deaths at a single hospital.  When discussing how the government – the government! – is going to save money by running things, does no one ever stop to think precisely how the government is going to save that money?  The answer is pretty simple.  Reduce and Remove.  They’ll REDUCE the quality the service or product and justify that by REMOVING your other options.</p><p>UPDATE – Make that 400 to 1200 deaths, <i>in three years</i>!  On the plus side, if a <s>socialized</s> nationalized health service does kill dear old mum as the reports indicate is not at all unlikely, <a href=\"http://www.breitbart.com/article.php?id=CNG.09affc88c9815310300a92378aed0564.2f1&amp;show_article=1\">you will get an apology</a> from the Prime Minister and the Health Secretary.  Which, it has to be admitted, is more than you’d ever get from a private corporation or church charity.  One could, of course, argue that they’re a great deal less likely to kill dear old mum in the first place, but let’s not focus on the negative:</p><blockquote><p>The British government apologised Wednesday after a damning official report into a hospital likened by one patient’s relative to “a Third World” health centre.  Stafford Hospital in central England was found to have appalling standards of care, putting patients at risk and leading to some dying, according to a report on Tuesday.  Between 400 and 1,200 more people died than would have been expected in a three-year period at the National Health Service (NHS) hospital, according to an investigation by the Healthcare Commission watchdog.</p><p>“We do apologise to all those people who have suffered from the mistakes that have been made in the Stafford Hospital,” said Prime Minister Gordon Brown, questioned on the matter at his weekly grilling in the House of Commons….</p><p>Health Secretary Alan Johnson said: “I apologise on behalf of the government and the NHS, for the pain and anguish caused to so many patients and their families by the appalling standards of care at Stafford Hospital.</p></blockquote><p>You know there’s a Fox News executive reading about patients wandering around fighting each other and thinking: “I know… reality TV show….  Survivor: Death Hospital!”</p></div>",
  "content_text": "Americans who like to trumpet the wonders of the British NHS should probably think twice before subjecting themselves to\nits tender mercies\n:\nPatients admitted for emergency treatment at an NHS Trust were subjected to “shocking and appalling” care that included untrained receptionists carrying out medical checks and heart monitors being switched off, a report concluded today.  The Healthcare Commission, the NHS standards watchdog, said that evidence suggested that as many as 400 deaths at Mid Staffordshire NHS Foundation Trust could have been prevented and may have been the result of poor care.\nThat’s 400 deaths at a single hospital.  When discussing how the government – the government! – is going to save money by running things, does no one ever stop to think precisely how the government is going to save that money?  The answer is pretty simple.  Reduce and Remove.  They’ll REDUCE the quality the service or product and justify that by REMOVING your other options.\nUPDATE – Make that 400 to 1200 deaths,\nin three years\n!  On the plus side, if a\nsocialized\nnationalized health service does kill dear old mum as the reports indicate is not at all unlikely,\nyou will get an apology\nfrom the Prime Minister and the Health Secretary.  Which, it has to be admitted, is more than you’d ever get from a private corporation or church charity.  One could, of course, argue that they’re a great deal less likely to kill dear old mum in the first place, but let’s not focus on the negative:\nThe British government apologised Wednesday after a damning official report into a hospital likened by one patient’s relative to “a Third World” health centre.  Stafford Hospital in central England was found to have appalling standards of care, putting patients at risk and leading to some dying, according to a report on Tuesday.  Between 400 and 1,200 more people died than would have been expected in a three-year period at the National Health Service (NHS) hospital, according to an investigation by the Healthcare Commission watchdog.\n“We do apologise to all those people who have suffered from the mistakes that have been made in the Stafford Hospital,” said Prime Minister Gordon Brown, questioned on the matter at his weekly grilling in the House of Commons….\nHealth Secretary Alan Johnson said: “I apologise on behalf of the government and the NHS, for the pain and anguish caused to so many patients and their families by the appalling standards of care at Stafford Hospital.\nYou know there’s a Fox News executive reading about patients wandering around fighting each other and thinking: “I know… reality TV show….  Survivor: Death Hospital!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-01T10:17:00+00:00"
}