{
  "url": "https://voxday.net/2009/04/11/non-science-of-science/",
  "scraped_at": "2026-01-08T22:53:08.947924",
  "title": "Exomethodological science",
  "date_display": "April 11, 2009",
  "date_iso": "2009-04-11T15:42:00+00:00",
  "date_from_url": "2009-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this extended comment by Post-secular merited a post of its own:</p><blockquote><p>As an evangelical Christian who has practiced science at the highest levels, I’m very ambivalent about the alleged decline of scientists’ trustworthiness. Since I don’t believe science is the ultimate way of knowing about the world, I applaud the demotion of scientists from their undeserved position as the modern day arbiters of ultimate truth. At the same time, I shudder at the fact that something like a 3rd of the population of the world’s only superpower believe the earth is only 10,000 years old, and that scientists only believe otherwise so they can force our children to learn about evolution, which will, of course, turn them into atheists. I’d like to think we’re increasingly rejecting knowledge handed down from on high because we’re thinking more critically about the alleged objectivity of science. But I’m afraid the main driver of this distrust is less rational, and therefore, more harmful than good. I’d like to think Americans increasingly distrust scientists because our increasingly sophisticated epistemology requires us to. However, the lamentable reality is that most Americans distrust science for mostly bad reasons including misunderstanding how science really works, unnecessary religious prejudices, rare but highly publicized cases of fraud, and science’s arrogant and offensive self-appointed ambassadors (Dawkins et al.). Influential leaders from both Science and Faith have drawn lines in the sand that they shouldn’t have. And the voices of those who wear both hats in good conscience are unfortunately drowned out by the mobs on either side, both foaming at the mouth. People should be properly skeptical about scientists’ biases and other human failings. They should not, however, use these as excuses to deny the reality of verifiable facts.</p><p>In regards to the role of consensus and the scientific method in the actual practice of science, I refer interested parties to Thomas Kuhn’s work. Having read Kuhn’s work and that of his critics, in my opinion, his description is by far the most accurate portrayal of how science actually works. There are episodes in the development of science that don’t fit his description very well, but the majority of science history bears out his arguments admirably well and much better than those of his detractors. At the risk of oversimplification, let me briefly summarize for those who are unfamiliar with Kuhn. As you have accurately pointed out, the scientific method isn’t hard to understand. However, science doesn’t work by the scientific method, at least not the one most people think of when they hear the term. Undergraduate textbooks tell the new initiate that if the data don’t support the hypothesis, the hypothesis must be thrown out. But up on the 6th floor where science is really occurring, the first time this happens, it is not the hypothesis but the data that is immediately thrown out, and the experiment is repeated. This problematic piece of data will remain an irrelevant artifact of a botched experiment until it pops up repeatedly and simply refuses to go away. Then, and only then, does a scientist even begin to question his hypothesis, and even then only very cautiously. Only after the data is found by other labs using other equipment/techniques will the scientific community even begin to acknowledge that an anomaly to the hypothesis has been found. But even then, the hypothesis is not discarded. The hypothesis will generally only be discarded after an alternative, competing hypothesis that explains at least as much of the total data in the field has been formulated. The hypotheses then duel it out, and eventually, the community of scientists decides which hypothesis will carry them into future investigations.</p><p>Now all of this may sound “unscientific”, but it appears so only if one tries to impose the textbook version of science onto the actual thing. It may also seem that all of this bias results in lots of wasted time and decreases the efficiency of scientific progress. However, it is precisely the opposite. Science progresses as fast as it does precisely because it is driven by paradigms. A paradigm provides a scientist with the confidence she needs to expend the enormous resources necessary to perform experiments that by sheer probability are almost certain to fail. My own analogy might help illustrate Kuhn’s ideas.</p><p>Imagine you’re standing in an Olympic-sized pool of water you can’t see through trying to find 10 red objects on the bottom of the pool. These are the major pieces of data that confirm your developing scientific model. Unawares to you, one of the red objects is attached to a blue object, and your scientific model cannot account for blue objects of any kind. Imagine further that each reach of your hand into the water costs you a year of your life. Your task is to find all the red objects that will firmly establish your scientific model before you die so you can claim the model as your own, give it your name or the name of your favorite video game (which scientists love to do) cure some diseases, and maybe win a Nobel prize. Obviously, you’d want to find the object in as few attempts as possible. In the absence of any a priori information, the objects you search for are distributed randomly. Your situation is hopeless without a map of where in the water to look. That map is the rough equivalent of a scientific paradigm. A paradigm tells you where to look in the water. It gives you the confidence you need to thrust your hand in the water over and over, giving a year of your life each time. Now imagine the pool has several other ambitious scientists like you. If you all operate on the same paradigm, the objects will be found much faster than if you were all operating on different paradigms. And most importantly, the blue object, the one that will call the model into question, will be found faster too. That’s what paradigms do, and they do it very successfully 90% of the time. Most of the major breakthroughs in science have come when a prevailing paradigm has been used so successfully and explored so thoroughly that its inevitable limitations are exposed. Far from being an irrational process, following a paradigm is a highly rational process. In fact, doing science without a paradigm represents a much more random process. I experienced much of this process firsthand as a contributor to a paradigm-changing study published in Science in 2006. (Exploiting the reversibility of natural product glycosyltransferase-catalyzed reactions, Zhang CS, Griffith BR, et al., SCIENCE, Volume 313, Issue: 5791, Pages: 1291-1294.) At the risk of appearing to brag, this paper now has 6x the average number of citations for a Science paper. In other words, our study changed the way others in our field thought about their science, and when they went looking where we told them to, the red objects were where we predicted they’d be.</p><p>My larger point is that consensus does and should play a huge role in the progress of science. Anyone who argues that working within a consensus is unscientific most likely has never done any real science. Scientists’ description of the world only changes in fundamental ways rarely, but it has happened many times, and will probably happen many more times. That doesn’t mean science isn’t scientific. It does mean that it is not a thoroughly rational process, because as Kuhn points out, the winner in a paradigm competition is not always chosen for rational reasons. Scientists are people and prefer paradigms for subjective reasons of beauty, elegance, and simplicity, which are all in the eye of the beholder. But neither is science thoroughly irrational. It is a human endeavor to gain understanding of the world that differs in some fundamental ways from other types of learning but is similar in many fundamental ways too. I hope this helps some of the contributors to this thread understand a) that scientists work 90% of the time within a consensus, b) a bit<br> more about why scientists work within paradigms and c) how scientists can change the way they describe the world in fundamental ways without being unscientific.</br></p></blockquote><p>I quite appreciate this informative lecture on real science from a real scientist.  However, I note that according to Post-secular, scientists are commonly operating outside the bounds of the scientific method for perfectly reasonable and pragmatic reasons.  I think that’s completely acceptable, as results are the main object of scientific research, after all.  But here’s the problem with this exo-methodological science.  If scientists are NOT genuinely operating by the pure scientific method which the science fetishists so regularly hold over everyone’s heads, then they have absolutely no right to claim that they doing so.  They especially have no right to hide behind what could fairly be described as a Noble Lie in order to discredit other forms of non-science or to grant a false imprimatur to their own efforts.</p><p>This is precisely why I believe it is so necessary to distinguish between the three aspects of science; science: the knowledge base, science: the method, and science: the profession.  It is absurd to speak of consensus with regards to the method just as it makes little sense to talk about the progress of the profession.  It is ironic indeed that a profession devoted to detail should be so careless when it comes to describing itself and its activities; one might reasonably conclude that this carelessness, combined with what appears to be somewhat of a Noble Lie, is at least in part due to a general awareness that its secular priesthood status might be in jeopardy should the public ever come to a sufficient understanding of the way in which the profession operates and protects what it perceives as its turf.</p><p>The issue here is not if science is irrational or not, but rather, if activities outside the direct application of the scientific method are science or not.  If they are, then it is obvious that the legitimacy objections to describing a wide variety fields, including mathematics, intelligent design, evolution, sociology, and even economics, as non-scientific really needs to be reconsidered.</p></div>",
  "content_text": "I thought this extended comment by Post-secular merited a post of its own:\nAs an evangelical Christian who has practiced science at the highest levels, I’m very ambivalent about the alleged decline of scientists’ trustworthiness. Since I don’t believe science is the ultimate way of knowing about the world, I applaud the demotion of scientists from their undeserved position as the modern day arbiters of ultimate truth. At the same time, I shudder at the fact that something like a 3rd of the population of the world’s only superpower believe the earth is only 10,000 years old, and that scientists only believe otherwise so they can force our children to learn about evolution, which will, of course, turn them into atheists. I’d like to think we’re increasingly rejecting knowledge handed down from on high because we’re thinking more critically about the alleged objectivity of science. But I’m afraid the main driver of this distrust is less rational, and therefore, more harmful than good. I’d like to think Americans increasingly distrust scientists because our increasingly sophisticated epistemology requires us to. However, the lamentable reality is that most Americans distrust science for mostly bad reasons including misunderstanding how science really works, unnecessary religious prejudices, rare but highly publicized cases of fraud, and science’s arrogant and offensive self-appointed ambassadors (Dawkins et al.). Influential leaders from both Science and Faith have drawn lines in the sand that they shouldn’t have. And the voices of those who wear both hats in good conscience are unfortunately drowned out by the mobs on either side, both foaming at the mouth. People should be properly skeptical about scientists’ biases and other human failings. They should not, however, use these as excuses to deny the reality of verifiable facts.\nIn regards to the role of consensus and the scientific method in the actual practice of science, I refer interested parties to Thomas Kuhn’s work. Having read Kuhn’s work and that of his critics, in my opinion, his description is by far the most accurate portrayal of how science actually works. There are episodes in the development of science that don’t fit his description very well, but the majority of science history bears out his arguments admirably well and much better than those of his detractors. At the risk of oversimplification, let me briefly summarize for those who are unfamiliar with Kuhn. As you have accurately pointed out, the scientific method isn’t hard to understand. However, science doesn’t work by the scientific method, at least not the one most people think of when they hear the term. Undergraduate textbooks tell the new initiate that if the data don’t support the hypothesis, the hypothesis must be thrown out. But up on the 6th floor where science is really occurring, the first time this happens, it is not the hypothesis but the data that is immediately thrown out, and the experiment is repeated. This problematic piece of data will remain an irrelevant artifact of a botched experiment until it pops up repeatedly and simply refuses to go away. Then, and only then, does a scientist even begin to question his hypothesis, and even then only very cautiously. Only after the data is found by other labs using other equipment/techniques will the scientific community even begin to acknowledge that an anomaly to the hypothesis has been found. But even then, the hypothesis is not discarded. The hypothesis will generally only be discarded after an alternative, competing hypothesis that explains at least as much of the total data in the field has been formulated. The hypotheses then duel it out, and eventually, the community of scientists decides which hypothesis will carry them into future investigations.\nNow all of this may sound “unscientific”, but it appears so only if one tries to impose the textbook version of science onto the actual thing. It may also seem that all of this bias results in lots of wasted time and decreases the efficiency of scientific progress. However, it is precisely the opposite. Science progresses as fast as it does precisely because it is driven by paradigms. A paradigm provides a scientist with the confidence she needs to expend the enormous resources necessary to perform experiments that by sheer probability are almost certain to fail. My own analogy might help illustrate Kuhn’s ideas.\nImagine you’re standing in an Olympic-sized pool of water you can’t see through trying to find 10 red objects on the bottom of the pool. These are the major pieces of data that confirm your developing scientific model. Unawares to you, one of the red objects is attached to a blue object, and your scientific model cannot account for blue objects of any kind. Imagine further that each reach of your hand into the water costs you a year of your life. Your task is to find all the red objects that will firmly establish your scientific model before you die so you can claim the model as your own, give it your name or the name of your favorite video game (which scientists love to do) cure some diseases, and maybe win a Nobel prize. Obviously, you’d want to find the object in as few attempts as possible. In the absence of any a priori information, the objects you search for are distributed randomly. Your situation is hopeless without a map of where in the water to look. That map is the rough equivalent of a scientific paradigm. A paradigm tells you where to look in the water. It gives you the confidence you need to thrust your hand in the water over and over, giving a year of your life each time. Now imagine the pool has several other ambitious scientists like you. If you all operate on the same paradigm, the objects will be found much faster than if you were all operating on different paradigms. And most importantly, the blue object, the one that will call the model into question, will be found faster too. That’s what paradigms do, and they do it very successfully 90% of the time. Most of the major breakthroughs in science have come when a prevailing paradigm has been used so successfully and explored so thoroughly that its inevitable limitations are exposed. Far from being an irrational process, following a paradigm is a highly rational process. In fact, doing science without a paradigm represents a much more random process. I experienced much of this process firsthand as a contributor to a paradigm-changing study published in Science in 2006. (Exploiting the reversibility of natural product glycosyltransferase-catalyzed reactions, Zhang CS, Griffith BR, et al., SCIENCE, Volume 313, Issue: 5791, Pages: 1291-1294.) At the risk of appearing to brag, this paper now has 6x the average number of citations for a Science paper. In other words, our study changed the way others in our field thought about their science, and when they went looking where we told them to, the red objects were where we predicted they’d be.\nMy larger point is that consensus does and should play a huge role in the progress of science. Anyone who argues that working within a consensus is unscientific most likely has never done any real science. Scientists’ description of the world only changes in fundamental ways rarely, but it has happened many times, and will probably happen many more times. That doesn’t mean science isn’t scientific. It does mean that it is not a thoroughly rational process, because as Kuhn points out, the winner in a paradigm competition is not always chosen for rational reasons. Scientists are people and prefer paradigms for subjective reasons of beauty, elegance, and simplicity, which are all in the eye of the beholder. But neither is science thoroughly irrational. It is a human endeavor to gain understanding of the world that differs in some fundamental ways from other types of learning but is similar in many fundamental ways too. I hope this helps some of the contributors to this thread understand a) that scientists work 90% of the time within a consensus, b) a bit\nmore about why scientists work within paradigms and c) how scientists can change the way they describe the world in fundamental ways without being unscientific.\nI quite appreciate this informative lecture on real science from a real scientist.  However, I note that according to Post-secular, scientists are commonly operating outside the bounds of the scientific method for perfectly reasonable and pragmatic reasons.  I think that’s completely acceptable, as results are the main object of scientific research, after all.  But here’s the problem with this exo-methodological science.  If scientists are NOT genuinely operating by the pure scientific method which the science fetishists so regularly hold over everyone’s heads, then they have absolutely no right to claim that they doing so.  They especially have no right to hide behind what could fairly be described as a Noble Lie in order to discredit other forms of non-science or to grant a false imprimatur to their own efforts.\nThis is precisely why I believe it is so necessary to distinguish between the three aspects of science; science: the knowledge base, science: the method, and science: the profession.  It is absurd to speak of consensus with regards to the method just as it makes little sense to talk about the progress of the profession.  It is ironic indeed that a profession devoted to detail should be so careless when it comes to describing itself and its activities; one might reasonably conclude that this carelessness, combined with what appears to be somewhat of a Noble Lie, is at least in part due to a general awareness that its secular priesthood status might be in jeopardy should the public ever come to a sufficient understanding of the way in which the profession operates and protects what it perceives as its turf.\nThe issue here is not if science is irrational or not, but rather, if activities outside the direct application of the scientific method are science or not.  If they are, then it is obvious that the legitimacy objections to describing a wide variety fields, including mathematics, intelligent design, evolution, sociology, and even economics, as non-scientific really needs to be reconsidered.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-11T14:42:00+00:00"
}