{
  "url": "https://voxday.net/2009/04/23/not-democracy/",
  "scraped_at": "2026-01-08T22:54:14.880908",
  "title": "Not a democracy",
  "date_display": "April 23, 2009",
  "date_iso": "2009-04-23T14:15:00+00:00",
  "date_from_url": "2009-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.rasmussenreports.com/public_content/business/federal_bailout/most_americans_say_bailouts_were_bad_idea_political_class_disagrees\">Rasmussen Report</a> illustrates why genuine democracy, with all its flaws, would be vastly preferable to the strictly limited system of elite-dominated faux democracy presently in place:</p><blockquote><p>Looking back, 59% of voters nationwide believe the federal bailouts for banks and other financial institutions were a bad idea. The latest Rasmussen Reports national telephone survey found that just 26% think they were a good idea.  The numbers are similar for the bailout loans given to General Motors and Chrysler: 60% say they were a bad idea, and just 26% hold the opposite view.  Public opposition to the bailouts has been strong right from the start. In September, right after Lehman Brothers collapsed, just seven percent (7%) of voters thought the federal government should use taxpayer funds to keep a large financial institution solvent. Sixty-five percent (65%) said the companies should file for bankruptcy….</p><p>Today, by a 61% to 23% margin, the Political Class still believes the bailouts for the financial industry were a good idea. By a 64% to 23%, they say the same about the auto bailouts.</p></blockquote><p>This is why it really doesn’t matter for whom you vote.  The Political Class is going to do whatever it wants to do on matters it deems important, it’s only influenced by the voters on the marginal issues that it really doesn’t care about.  Hoi polloi are smarter, too.  Consider this: <i>“29% of all voters believe the bailouts will have a positive long-term impact on the economy. Most (51%) believe the bailouts will hurt. Once again, the Political Class has an entirely different view. By a 75% to 17% margin, the Political Class believes the bailouts will have a positive long-term impact.”</i></p></div>",
  "content_text": "This\nRasmussen Report\nillustrates why genuine democracy, with all its flaws, would be vastly preferable to the strictly limited system of elite-dominated faux democracy presently in place:\nLooking back, 59% of voters nationwide believe the federal bailouts for banks and other financial institutions were a bad idea. The latest Rasmussen Reports national telephone survey found that just 26% think they were a good idea.  The numbers are similar for the bailout loans given to General Motors and Chrysler: 60% say they were a bad idea, and just 26% hold the opposite view.  Public opposition to the bailouts has been strong right from the start. In September, right after Lehman Brothers collapsed, just seven percent (7%) of voters thought the federal government should use taxpayer funds to keep a large financial institution solvent. Sixty-five percent (65%) said the companies should file for bankruptcy….\nToday, by a 61% to 23% margin, the Political Class still believes the bailouts for the financial industry were a good idea. By a 64% to 23%, they say the same about the auto bailouts.\nThis is why it really doesn’t matter for whom you vote.  The Political Class is going to do whatever it wants to do on matters it deems important, it’s only influenced by the voters on the marginal issues that it really doesn’t care about.  Hoi polloi are smarter, too.  Consider this:\n“29% of all voters believe the bailouts will have a positive long-term impact on the economy. Most (51%) believe the bailouts will hurt. Once again, the Political Class has an entirely different view. By a 75% to 17% margin, the Political Class believes the bailouts will have a positive long-term impact.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-23T13:15:00+00:00"
}