{
  "url": "https://voxday.net/2009/04/08/opting-out-of-family-cour/",
  "scraped_at": "2026-01-08T22:52:50.047377",
  "title": "Opting out of Family Court",
  "date_display": "April 8, 2009",
  "date_iso": "2009-04-08T08:44:00+00:00",
  "date_from_url": "2009-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder how many more of these cases will happen before it occurs to womens’ rights advocates that perhaps stacking the deck in favor of female divorcees <a href=\"http://abcnews.go.com/US/wireStory?id=7279759\">may not actually be in the best interests of women</a>.  A house, full custody, and an oversized child-support subsidy isn’t worth much to a dead woman:</p><blockquote><p>A man facing a divorce trial shot and killed his estranged wife, their teenage daughter and two other relatives in rural north Alabama before returning to his home in a nearby town and killing himself, authorities said Tuesday.  Kevin Garner’s body was found Tuesday afternoon near his Priceville home, which burned to the ground overnight. His divorce trial was to start Wednesday.</p></blockquote><p>The current system of assigning the maximum possible blame and financial responsibility to the male half of the divorcing couple is pure madness.  It simply has to end before it tears civil society into shreds.  I was in a fantasy football league – not the VPFL – with one man whose ex-wife was a useless and unemployed mother less capable of raising children than the average wolf.  She wanted out of the marriage in order to pursue the fun that she felt she’d missed out on in her younger days, and was initially happy to accept a reasonably equitable joint-custody arrangment that gave the man plenty of time with his kids.</p><p>However, once the ex-wife belatedly realized that the gravy train was over, she went out of her way to provoke a confrontation <i>at his house</i> after surreptitiously arranging to send the potential witness away by lying about one of her ex-relations.  She called the police <i>because he yelled at her</i> for violating the custody order and trespassing in his house, the man got slapped with a restraining order, had his custody suspended, and couldn’t see his kids without supervision for a few weeks.  The Family Court judge was completely uninterested in hearing any testimony about her provable deceit, or indeed, hearing any testimony about her at all.  Fortunately, the woman was ultimately unsuccessful in her attempt to reduce his custody or increase his forced contribution to her lifestyle.  But if she’d succeeded, I wouldn’t have found it impossible to understand if he elected to respond by blowing the bitch’s head off.</p><p>When the courts will not give justice, the Devil is always pleased to proffer revenge.</p></div>",
  "content_text": "I wonder how many more of these cases will happen before it occurs to womens’ rights advocates that perhaps stacking the deck in favor of female divorcees\nmay not actually be in the best interests of women\n.  A house, full custody, and an oversized child-support subsidy isn’t worth much to a dead woman:\nA man facing a divorce trial shot and killed his estranged wife, their teenage daughter and two other relatives in rural north Alabama before returning to his home in a nearby town and killing himself, authorities said Tuesday.  Kevin Garner’s body was found Tuesday afternoon near his Priceville home, which burned to the ground overnight. His divorce trial was to start Wednesday.\nThe current system of assigning the maximum possible blame and financial responsibility to the male half of the divorcing couple is pure madness.  It simply has to end before it tears civil society into shreds.  I was in a fantasy football league – not the VPFL – with one man whose ex-wife was a useless and unemployed mother less capable of raising children than the average wolf.  She wanted out of the marriage in order to pursue the fun that she felt she’d missed out on in her younger days, and was initially happy to accept a reasonably equitable joint-custody arrangment that gave the man plenty of time with his kids.\nHowever, once the ex-wife belatedly realized that the gravy train was over, she went out of her way to provoke a confrontation\nat his house\nafter surreptitiously arranging to send the potential witness away by lying about one of her ex-relations.  She called the police\nbecause he yelled at her\nfor violating the custody order and trespassing in his house, the man got slapped with a restraining order, had his custody suspended, and couldn’t see his kids without supervision for a few weeks.  The Family Court judge was completely uninterested in hearing any testimony about her provable deceit, or indeed, hearing any testimony about her at all.  Fortunately, the woman was ultimately unsuccessful in her attempt to reduce his custody or increase his forced contribution to her lifestyle.  But if she’d succeeded, I wouldn’t have found it impossible to understand if he elected to respond by blowing the bitch’s head off.\nWhen the courts will not give justice, the Devil is always pleased to proffer revenge.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-08T07:44:00+00:00"
}