{
  "url": "https://voxday.net/2009/04/27/pandemonia/",
  "scraped_at": "2026-01-08T22:54:35.048370",
  "title": "Pandemonia",
  "date_display": "April 27, 2009",
  "date_iso": "2009-04-27T10:38:00+00:00",
  "date_from_url": "2009-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A doctor in Mexico City claims that the swine flu outbreak <a href=\"http://news.bbc.co.uk/2/hi/talking_point/8018428.stm\">is worse than reported</a>:</p><blockquote><p>I’m a specialist doctor in respiratory diseases and intensive care at the Mexican National Institute of Health. There is a severe emergency over the swine flu here. More and more patients are being admitted to the intensive care unit. Despite the heroic efforts of all staff (doctors, nurses, specialists, etc) patients continue to inevitably die. The truth is that anti-viral treatments and vaccines are not expected to have any effect, even at high doses. It is a great fear among the staff. The infection risk is very high among the doctors and health staff.</p><p>There is a sense of chaos in the other hospitals and we do not know what to do. Staff are starting to leave and many are opting to retire or apply for holidays. The truth is that mortality is even higher than what is being reported by the authorities, at least in the hospital where I work it. It is killing three to four patients daily, and it has been going on for more than three weeks. It is a shame and there is great fear here. Increasingly younger patients aged 20 to 30 years are dying before our helpless eyes and there is great sadness among health professionals here.</p></blockquote><p>This is grim news, not just due to the chance that there will be a flu pandemic, but because it’s pretty close to the last thing that the global economy needed at the moment.  If you’ve got vacation accrued, this might be a good time to take it and work on your Call of Duty skillz.  Or to look into the possibility of tele-commuting.</p><p>Meanwhile Stratfor sees not only economic concerns, but worries about the geopolitical impact: <i>“Depending on the extent of the virus’s spread, it could directly affect production: Offices and factories would shut down in areas where the flu was particularly rampant, amid efforts to control it. International travel and trade might well be affected, both voluntarily (as people avoided travel and refused to buy goods from countries heavily infected) and involuntarily (as states acted to protect their populations). The greatest effect would be psychological. In a world where consumer confidence has already been deeply affected by the economic downturn, a pandemic would dramatically darken the mood of the international system, with potential impact on governments.”</i></p></div>",
  "content_text": "A doctor in Mexico City claims that the swine flu outbreak\nis worse than reported\n:\nI’m a specialist doctor in respiratory diseases and intensive care at the Mexican National Institute of Health. There is a severe emergency over the swine flu here. More and more patients are being admitted to the intensive care unit. Despite the heroic efforts of all staff (doctors, nurses, specialists, etc) patients continue to inevitably die. The truth is that anti-viral treatments and vaccines are not expected to have any effect, even at high doses. It is a great fear among the staff. The infection risk is very high among the doctors and health staff.\nThere is a sense of chaos in the other hospitals and we do not know what to do. Staff are starting to leave and many are opting to retire or apply for holidays. The truth is that mortality is even higher than what is being reported by the authorities, at least in the hospital where I work it. It is killing three to four patients daily, and it has been going on for more than three weeks. It is a shame and there is great fear here. Increasingly younger patients aged 20 to 30 years are dying before our helpless eyes and there is great sadness among health professionals here.\nThis is grim news, not just due to the chance that there will be a flu pandemic, but because it’s pretty close to the last thing that the global economy needed at the moment.  If you’ve got vacation accrued, this might be a good time to take it and work on your Call of Duty skillz.  Or to look into the possibility of tele-commuting.\nMeanwhile Stratfor sees not only economic concerns, but worries about the geopolitical impact:\n“Depending on the extent of the virus’s spread, it could directly affect production: Offices and factories would shut down in areas where the flu was particularly rampant, amid efforts to control it. International travel and trade might well be affected, both voluntarily (as people avoided travel and refused to buy goods from countries heavily infected) and involuntarily (as states acted to protect their populations). The greatest effect would be psychological. In a world where consumer confidence has already been deeply affected by the economic downturn, a pandemic would dramatically darken the mood of the international system, with potential impact on governments.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-27T09:38:00+00:00"
}