{
  "url": "https://voxday.net/2009/04/15/police-really-are-stupid/",
  "scraped_at": "2026-01-08T22:53:29.046654",
  "title": "The police really are stupid",
  "date_display": "April 15, 2009",
  "date_iso": "2009-04-15T08:23:00+00:00",
  "date_from_url": "2009-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nytimes.com/1999/09/09/nyregion/metro-news-briefs-connecticut-judge-rules-that-police-can-bar-high-iq-scores.html\">By choice</a>, believe it or not:</p><blockquote><p>A Federal judge has dismissed a lawsuit by a man who was barred from the New London police force because he scored too high on an intelligence test.  In a ruling made public on Tuesday, Judge Peter C. Dorsey of the United States District Court in New Haven agreed that the plaintiff, Robert Jordan, was denied an opportunity to interview for a police job because of his high test scores. But he said that that did not mean Mr. Jordan was a victim of discrimination.</p><p>Judge Dorsey ruled that Mr. Jordan was not denied equal protection because the city of New London applied the same standard to everyone: anyone who scored too high was rejected.</p></blockquote><p>This old link came up in relation to a recent Slashdot article about an arrest based, in part, upon a college student’s suspicious possession of a <i>dual-boot Linux</i> system.  If that’s not enough to convict, I don’t know what is; it’s surprising they didn’t shoot him on the spot.  It would be amusing to determine who is less intelligent, on average, police or schoolteachers.  My money is on the schoolteachers, as we already know that their average IQ <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=42742\">is in the vicinity of 91</a>.</p></div>",
  "content_text": "By choice\n, believe it or not:\nA Federal judge has dismissed a lawsuit by a man who was barred from the New London police force because he scored too high on an intelligence test.  In a ruling made public on Tuesday, Judge Peter C. Dorsey of the United States District Court in New Haven agreed that the plaintiff, Robert Jordan, was denied an opportunity to interview for a police job because of his high test scores. But he said that that did not mean Mr. Jordan was a victim of discrimination.\nJudge Dorsey ruled that Mr. Jordan was not denied equal protection because the city of New London applied the same standard to everyone: anyone who scored too high was rejected.\nThis old link came up in relation to a recent Slashdot article about an arrest based, in part, upon a college student’s suspicious possession of a\ndual-boot Linux\nsystem.  If that’s not enough to convict, I don’t know what is; it’s surprising they didn’t shoot him on the spot.  It would be amusing to determine who is less intelligent, on average, police or schoolteachers.  My money is on the schoolteachers, as we already know that their average IQ\nis in the vicinity of 91\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-15T07:23:00+00:00"
}