{
  "url": "https://voxday.net/2009/04/19/quick-hit-game-reviews/",
  "scraped_at": "2026-01-08T22:53:52.926668",
  "title": "Quick hit game reviews",
  "date_display": "April 19, 2009",
  "date_iso": "2009-04-19T10:36:00+00:00",
  "date_from_url": "2009-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Gears of War 2:</b>very good graphics, scripting, and dialogue, interesting multiplay.  However, the weapon controls aren’t great and the Locust storyline is kind of stupid.  I got bored with the whole “missing wife” thing very early on; while it’s easy to see what they were shooting for, they only achieved annoying bathos.  6 of 10.</p><p><b>COD 5:</b>I’ve only played the PS/3 multiplayer, but I’ve played a lot of that and it’s excellent.  Absorbing gameplay, excellent graphics, good weapon controls, nice progression system.  It’s sometimes a bit too easy to kill from a distance without a scope and every now and then one can empty an LMG into an enemy right in front of you without scratching them, but it’s very good.  The Infinity Ward games always seem to be better than the Treyarch ones.  My only complaint is that there’s little effort to make team action more viable.  8 of 10 (multiplayer)</p><p><b>Frontline: Fuels of War:</b>A reasonable effort, but the gameplay is average, the graphics are mediocre, the enemy soldiers are pretty random, and the storyline doesn’t make much sense.  Basic weapon controls are different than COD for no rational reason I can see.  5 of 10.</p><p><b>Assassin’s Creed:</b>Great graphics.  Interesting variant on the stealth concept.  Absolutely terrible storytelling, abysmal dialogue, and poor design fundamentals ruin what should have been a fascinating setting.  I’ve also heard the missions are very repetitive, but I quit playing very early on after being forced to listen to constant blather about how assassins are all about NOT harming innocents.  Are you freaking kidding me?  Why not just mount them on unicorns and arm them with paintballs while you’re at it!  They went so far as to name the game after its very worst aspect.  Jade Raymond is attractive and she’s a competent producer, but she definitely needs to stay the hell away from the narrative.  3 of 10.</p><p>By the way, just to confirm I wasn’t imagining the spectacular lameness, I checked out <a href=\"http://www.xboxgazette.com/interview_assassins_creed_en.php\">an interview with her</a>.  Get this: <i>“This historic ambiguity has allowed us to portray the Assassins as a forward thinking group with the single objective to stop the war….  In Assassin’s Creed, Crusaders (and the Saracens) are not the Assassin’s true enemy. War is – as are those who exploit it.”</i> Ridiculous and howlingly anti-historical.  I would have had more respect for Ubisoft Montreal if they’d portrayed the Assassins as a forward-thinking group with the single objective of legalizing gay marriage.</p></div>",
  "content_text": "Gears of War 2:\nvery good graphics, scripting, and dialogue, interesting multiplay.  However, the weapon controls aren’t great and the Locust storyline is kind of stupid.  I got bored with the whole “missing wife” thing very early on; while it’s easy to see what they were shooting for, they only achieved annoying bathos.  6 of 10.\nCOD 5:\nI’ve only played the PS/3 multiplayer, but I’ve played a lot of that and it’s excellent.  Absorbing gameplay, excellent graphics, good weapon controls, nice progression system.  It’s sometimes a bit too easy to kill from a distance without a scope and every now and then one can empty an LMG into an enemy right in front of you without scratching them, but it’s very good.  The Infinity Ward games always seem to be better than the Treyarch ones.  My only complaint is that there’s little effort to make team action more viable.  8 of 10 (multiplayer)\nFrontline: Fuels of War:\nA reasonable effort, but the gameplay is average, the graphics are mediocre, the enemy soldiers are pretty random, and the storyline doesn’t make much sense.  Basic weapon controls are different than COD for no rational reason I can see.  5 of 10.\nAssassin’s Creed:\nGreat graphics.  Interesting variant on the stealth concept.  Absolutely terrible storytelling, abysmal dialogue, and poor design fundamentals ruin what should have been a fascinating setting.  I’ve also heard the missions are very repetitive, but I quit playing very early on after being forced to listen to constant blather about how assassins are all about NOT harming innocents.  Are you freaking kidding me?  Why not just mount them on unicorns and arm them with paintballs while you’re at it!  They went so far as to name the game after its very worst aspect.  Jade Raymond is attractive and she’s a competent producer, but she definitely needs to stay the hell away from the narrative.  3 of 10.\nBy the way, just to confirm I wasn’t imagining the spectacular lameness, I checked out\nan interview with her\n.  Get this:\n“This historic ambiguity has allowed us to portray the Assassins as a forward thinking group with the single objective to stop the war….  In Assassin’s Creed, Crusaders (and the Saracens) are not the Assassin’s true enemy. War is – as are those who exploit it.”\nRidiculous and howlingly anti-historical.  I would have had more respect for Ubisoft Montreal if they’d portrayed the Assassins as a forward-thinking group with the single objective of legalizing gay marriage.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-19T09:36:00+00:00"
}