{
  "url": "https://voxday.net/2009/04/06/reason-is-irrelevan/",
  "scraped_at": "2026-01-08T22:52:39.068405",
  "title": "The reason is irrelevant",
  "date_display": "April 6, 2009",
  "date_iso": "2009-04-06T14:30:00+00:00",
  "date_from_url": "2009-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When you hand over control, you hand over control, and there’s not much point about <a href=\"http://online.wsj.com/article/SB123879833094588163.html\">crying over the fact that you lost it</a> later:</p><blockquote><p>Under the Bush team a prominent and profitable bank, under threat of a damaging public audit, was forced to accept less than $1 billion of TARP money. The government insisted on buying a new class of preferred stock which gave it a tiny, minority position. The money flowed to the bank. Arguably, back then, the Bush administration was acting for purely economic reasons. It wanted to recapitalize the banks to halt a financial panic….</p><p>After 35 years in America, I never thought I would see this. I still can’t quite believe we will sit by as this crisis is used to hand control of our economy over to government. But here we are, on the brink. Clearly, I have been naive.</p></blockquote><p>The Bush administration bluffed the banks and Obama is taking advantage of it. <i>This is how the expansion of government in a two-party system usually works!</i> It’s the Counterpush principle, the Nixon-to-China concept.  The party which is supposedly <i>against</i> something is used to punch a hole through the wall of popular opinion, then the other party exploits the breach.</p></div>",
  "content_text": "When you hand over control, you hand over control, and there’s not much point about\ncrying over the fact that you lost it\nlater:\nUnder the Bush team a prominent and profitable bank, under threat of a damaging public audit, was forced to accept less than $1 billion of TARP money. The government insisted on buying a new class of preferred stock which gave it a tiny, minority position. The money flowed to the bank. Arguably, back then, the Bush administration was acting for purely economic reasons. It wanted to recapitalize the banks to halt a financial panic….\nAfter 35 years in America, I never thought I would see this. I still can’t quite believe we will sit by as this crisis is used to hand control of our economy over to government. But here we are, on the brink. Clearly, I have been naive.\nThe Bush administration bluffed the banks and Obama is taking advantage of it.\nThis is how the expansion of government in a two-party system usually works!\nIt’s the Counterpush principle, the Nixon-to-China concept.  The party which is supposedly\nagainst\nsomething is used to punch a hole through the wall of popular opinion, then the other party exploits the breach.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-06T13:30:00+00:00"
}