{
  "url": "https://voxday.net/2009/04/09/seeking-third-world-electorate/",
  "scraped_at": "2026-01-08T22:52:59.194824",
  "title": "Seeking a Third World electorate",
  "date_display": "April 9, 2009",
  "date_iso": "2009-04-09T13:00:00+00:00",
  "date_from_url": "2009-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.nytimes.com/2009/04/09/us/politics/09immig.html?hp\">immigration idiocy</a> isn’t exactly shocking:</p><blockquote><p>While acknowledging that the recession makes the political battle more difficult, President Obama plans to begin addressing the country’s immigration system this year, including looking for a path for illegal immigrants to become legal, a senior administration official said on Wednesday….  Opponents of legalization legislation were incredulous at the idea that Mr. Obama would take on immigration when economic pain for Americans is so widespread.</p></blockquote><p>With unemployment rising and real wages still lower than 1973, it’s obviously the worst possible time to consider legitimizing and importing yet more unskilled, uncivilized Third Worlders.  The idea sounds utterly mad to sane Western minds, but because Obama is a Third Worlder and not a Westerner himself, his dream inherited from his non-American father is to transform the twitching corpse of Western America into the same sort of barbaric Southern morass that exists throughout most of the non-European world, and from which he hails.</p><p>As you know, I was already certain that America was toast long before Obama got elected.  However, his actions appear likely to increase the rate of decline as the country heads towards demise, and hopefully, devolution.  This should be an interesting political battle, though, as it will be fascinating to see if having Obama on the Cherry Blossom Throne rather than Bush will cause the Republican elite to turn against the very migration they supported during the last <s>amnesty attempt</s>push for immigration “reform”.  And don’t forget, Republicans, it was first Reagan, then Bush, who did the advance work for Obama’s actions here.</p><p>It should be comical to learn what justification for importing more of these unwanted and unneeded masses is offered by Obama.  I’m assuming he’s not dumb enough to come right out and declare that he requires a different electorate, but in light of his first two months, that’s not outside the realm of possibility.  It’s not impossible that this could mark Obama’s inevitable HillaryCare moment.</p><p>UPDATE – In case you’re not completely convinced that the USA is beyond saving, consider <a href=\"http://www.rasmussenreports.com/public_content/politics/general_politics/just_53_say_capitalism_better_than_socialism\">the following poll results</a>:</p><blockquote><p>Only 53% of American adults believe capitalism is better than socialism.  The latest Rasmussen Reports national telephone survey found that 20% disagree and say socialism is better. Twenty-seven percent (27%) are not sure which is better.</p></blockquote><p>I’m sure importing and giving the right to vote to masses of Mexicans, South Americans, and Somalis, all of whom are well-accustomed to socialist rule, will drive that 53 percent figure into a minority before too long.  And then it won’t take long to transform the former land of the free and the home of the brave into America the Third World Hellhole.</p><p>That effort to unseat Hussein is looking more and more worthwhile every day, isn’t it, Republicans?</p></div>",
  "content_text": "This\nimmigration idiocy\nisn’t exactly shocking:\nWhile acknowledging that the recession makes the political battle more difficult, President Obama plans to begin addressing the country’s immigration system this year, including looking for a path for illegal immigrants to become legal, a senior administration official said on Wednesday….  Opponents of legalization legislation were incredulous at the idea that Mr. Obama would take on immigration when economic pain for Americans is so widespread.\nWith unemployment rising and real wages still lower than 1973, it’s obviously the worst possible time to consider legitimizing and importing yet more unskilled, uncivilized Third Worlders.  The idea sounds utterly mad to sane Western minds, but because Obama is a Third Worlder and not a Westerner himself, his dream inherited from his non-American father is to transform the twitching corpse of Western America into the same sort of barbaric Southern morass that exists throughout most of the non-European world, and from which he hails.\nAs you know, I was already certain that America was toast long before Obama got elected.  However, his actions appear likely to increase the rate of decline as the country heads towards demise, and hopefully, devolution.  This should be an interesting political battle, though, as it will be fascinating to see if having Obama on the Cherry Blossom Throne rather than Bush will cause the Republican elite to turn against the very migration they supported during the last\namnesty attempt\npush for immigration “reform”.  And don’t forget, Republicans, it was first Reagan, then Bush, who did the advance work for Obama’s actions here.\nIt should be comical to learn what justification for importing more of these unwanted and unneeded masses is offered by Obama.  I’m assuming he’s not dumb enough to come right out and declare that he requires a different electorate, but in light of his first two months, that’s not outside the realm of possibility.  It’s not impossible that this could mark Obama’s inevitable HillaryCare moment.\nUPDATE – In case you’re not completely convinced that the USA is beyond saving, consider\nthe following poll results\n:\nOnly 53% of American adults believe capitalism is better than socialism.  The latest Rasmussen Reports national telephone survey found that 20% disagree and say socialism is better. Twenty-seven percent (27%) are not sure which is better.\nI’m sure importing and giving the right to vote to masses of Mexicans, South Americans, and Somalis, all of whom are well-accustomed to socialist rule, will drive that 53 percent figure into a minority before too long.  And then it won’t take long to transform the former land of the free and the home of the brave into America the Third World Hellhole.\nThat effort to unseat Hussein is looking more and more worthwhile every day, isn’t it, Republicans?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-09T12:00:00+00:00"
}