{
  "url": "https://voxday.net/2009/04/03/sinking-world/",
  "scraped_at": "2026-01-08T22:52:24.717651",
  "title": "Sinking the world",
  "date_display": "April 3, 2009",
  "date_iso": "2009-04-03T21:03:00+00:00",
  "date_from_url": "2009-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When your economic model fails again and your economy is once more on the verge of collapse, what’s the solution?  Do the same thing but <a href=\"http://www.ft.com/cms/s/0/082652de-1fb0-11de-a1df-00144feabdc0.html\">big it up</a>!</p><blockquote><p>World leaders on Thursday heralded the G20 summit as the day the world “fought back against the recession” as they put on a show of unity that lifted global markets and mapped out a new future for financial regulation.  Gordon Brown, UK prime minister, host of the summit, said the meeting marked the emergence of a “new world order”, as he unveiled what leaders claimed was a $1,100bn package of measures to tackle the global downturn, including support for lower income countries and a $250bn plan to boost the international money supply.</p></blockquote><p>There’s a pattern at work here.  After the 1987 Asian currency fiasco nearly sunk Wall Street, the Fed managed to inflate the tech equity bubble.  When that blew up in 2000, they used the martial response to 9/11 and the housing bubble to reinflate.  Now, since their usual national tools have failed, they’re attempting to throw the combined weight of the G20’s resources at the problem, <i>based on the same precisely the same set of assumptions that have repeatedly made the problem worse!</i></p><p>This action doesn’t “save the world”, in fact, it makes it much more likely that what was mostly an American depression from 1929 to 1940 will be repeated on a scope that is an order of magnitude larger.  If we’re unfortunate, it will also be on a <i>scale</i> that is an order of magnitude larger as well.</p><p>The fundamental problem isn’t a lack of resources, it is a <i>misallocation</i> of resources.  Giving GM more money isn’t going to cause more people to want to buy GM cars, it merely postpones the inevitable collapse and increases its economic and social costs.  And don’t forget what happened the last time the media announced the world’s salvation… in February 1999.<br><a href=\"http://www.elliottwave.com/chartfolder/stu/TimeSaveWorld040209.gif\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://www.elliottwave.com/chartfolder/stu/TimeSaveWorld040209.gif\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 399px; height: 526px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.elliottwave.com/chartfolder/stu/TimeSaveWorld040209.gif\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 399px; height: 526px;\"/></a></br></p></div>",
  "content_text": "When your economic model fails again and your economy is once more on the verge of collapse, what’s the solution?  Do the same thing but\nbig it up\n!\nWorld leaders on Thursday heralded the G20 summit as the day the world “fought back against the recession” as they put on a show of unity that lifted global markets and mapped out a new future for financial regulation.  Gordon Brown, UK prime minister, host of the summit, said the meeting marked the emergence of a “new world order”, as he unveiled what leaders claimed was a $1,100bn package of measures to tackle the global downturn, including support for lower income countries and a $250bn plan to boost the international money supply.\nThere’s a pattern at work here.  After the 1987 Asian currency fiasco nearly sunk Wall Street, the Fed managed to inflate the tech equity bubble.  When that blew up in 2000, they used the martial response to 9/11 and the housing bubble to reinflate.  Now, since their usual national tools have failed, they’re attempting to throw the combined weight of the G20’s resources at the problem,\nbased on the same precisely the same set of assumptions that have repeatedly made the problem worse!\nThis action doesn’t “save the world”, in fact, it makes it much more likely that what was mostly an American depression from 1929 to 1940 will be repeated on a scope that is an order of magnitude larger.  If we’re unfortunate, it will also be on a\nscale\nthat is an order of magnitude larger as well.\nThe fundamental problem isn’t a lack of resources, it is a\nmisallocation\nof resources.  Giving GM more money isn’t going to cause more people to want to buy GM cars, it merely postpones the inevitable collapse and increases its economic and social costs.  And don’t forget what happened the last time the media announced the world’s salvation… in February 1999.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-03T20:03:00+00:00"
}