{
  "url": "https://voxday.net/2009/04/29/skeptics-justification/",
  "scraped_at": "2026-01-08T22:54:50.488465",
  "title": "The skeptic’s intuition",
  "date_display": "April 29, 2009",
  "date_iso": "2009-04-29T19:11:00+00:00",
  "date_from_url": "2009-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I finished John Derbyshire’s fascinating book about the Riemann Hypothesis yesterday, <i>Prime Obsession</i>, and a particular passage towards the end got me thinking about my own doubts about Darwin’s famous hypothesis.  With all due apologies to Derb, I’m afraid this post doesn’t have anything to do with the subject of his book per se, about which I shall definitely write another time.</p><blockquote><p>Setting aside their search for a proof, how do mathematicians <i>feel</i> about the RH?  What does their intuition tell them?  Is the RH true or not?  I made a point of asking every mathematician I spoke with, very directly, whether he or she believed the Hypothesis to be true.  The answers formed a wide spectrum, with a full range of eigenvalues.</p><p>Among that majority of mathematicians who believe it true (Hugh Montgomery, for example), it is the sheer weight of evidence that tells.  Now, all professional mathematicians are that weight of evidence can be a very treacherous measure.  There was a good weight of evidence for <i>Li(x)</i> being always greater than <i>π(x)</i> until Littlewood’s 1914 result disproved it.  Ah, yes, RH believers will tell you, but that was merely one line of evidence, numerical evidence, together with the unsupported assumption that the second log-integral term -½<i>Li(x½)</i> would continue to dominate the difference, which would therefore always be negative.  For the Hypothesis we have far more lines.  The RH underpins an enormous body of results, most of them very reasonable and – to bring in a word mathematicians are especially fond of – “elegant.”  There are now hundreds of theorems that begin “Assuming the truth of the Riemann Hypothesis….”  They would all come crashing down if the RH were false.  That is undesirable, of course, so the believers might be accused of wishful thinking, but it’s not the undesirability of losing those results, it’s the fact of their existence.  Weight of evidence.</p><p>Other mathematicians believe, as Alan Turing did, that the RH is probably false.  Martin Huxley is a current non-believer.  He justifies his nonbelief on entirely intuitive grounds, citing an argument first put forward by Littlewood: “A long-open conjecture in analysis generally turns out to be false.  A long-open conjecture in algebra generally turns out to be true.”<br>– <i>Prime Obsession</i> pp 356-357</br></p></blockquote><p>The salient question, then, is if the present ND-TENS more aptly analogous to analysis or algebra?  I am an evolutionary skeptic for a number of reasons, but my intuitive reasoning on the matter is essentially similar to Huxley’s.  Moreover, the fact that mathematicians manage to peaceably disagree about the truth or not-truth of the Riemann Hypothesis while biologists cannot bear to hear the least little criticism of Neo-Darwinian theory without throwing a hissy fit also tends to invoke serious doubt about the latter in the rational observer.</p><p>There’s no question that Riemann possessed a far more brilliant mind than Darwin.  The RH is elegant while NDT-TENS is tortured and crude.  If I were pressed by the likes of Derbyshire and had to declare one way or the other, I’d have to side with the RH believers and the Darwin doubters.</p></div>",
  "content_text": "I finished John Derbyshire’s fascinating book about the Riemann Hypothesis yesterday,\nPrime Obsession\n, and a particular passage towards the end got me thinking about my own doubts about Darwin’s famous hypothesis.  With all due apologies to Derb, I’m afraid this post doesn’t have anything to do with the subject of his book per se, about which I shall definitely write another time.\nSetting aside their search for a proof, how do mathematicians\nfeel\nabout the RH?  What does their intuition tell them?  Is the RH true or not?  I made a point of asking every mathematician I spoke with, very directly, whether he or she believed the Hypothesis to be true.  The answers formed a wide spectrum, with a full range of eigenvalues.\nAmong that majority of mathematicians who believe it true (Hugh Montgomery, for example), it is the sheer weight of evidence that tells.  Now, all professional mathematicians are that weight of evidence can be a very treacherous measure.  There was a good weight of evidence for\nLi(x)\nbeing always greater than\nπ(x)\nuntil Littlewood’s 1914 result disproved it.  Ah, yes, RH believers will tell you, but that was merely one line of evidence, numerical evidence, together with the unsupported assumption that the second log-integral term -½\nLi(x½)\nwould continue to dominate the difference, which would therefore always be negative.  For the Hypothesis we have far more lines.  The RH underpins an enormous body of results, most of them very reasonable and – to bring in a word mathematicians are especially fond of – “elegant.”  There are now hundreds of theorems that begin “Assuming the truth of the Riemann Hypothesis….”  They would all come crashing down if the RH were false.  That is undesirable, of course, so the believers might be accused of wishful thinking, but it’s not the undesirability of losing those results, it’s the fact of their existence.  Weight of evidence.\nOther mathematicians believe, as Alan Turing did, that the RH is probably false.  Martin Huxley is a current non-believer.  He justifies his nonbelief on entirely intuitive grounds, citing an argument first put forward by Littlewood: “A long-open conjecture in analysis generally turns out to be false.  A long-open conjecture in algebra generally turns out to be true.”\n–\nPrime Obsession\npp 356-357\nThe salient question, then, is if the present ND-TENS more aptly analogous to analysis or algebra?  I am an evolutionary skeptic for a number of reasons, but my intuitive reasoning on the matter is essentially similar to Huxley’s.  Moreover, the fact that mathematicians manage to peaceably disagree about the truth or not-truth of the Riemann Hypothesis while biologists cannot bear to hear the least little criticism of Neo-Darwinian theory without throwing a hissy fit also tends to invoke serious doubt about the latter in the rational observer.\nThere’s no question that Riemann possessed a far more brilliant mind than Darwin.  The RH is elegant while NDT-TENS is tortured and crude.  If I were pressed by the likes of Derbyshire and had to declare one way or the other, I’d have to side with the RH believers and the Darwin doubters.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-29T18:11:00+00:00"
}