{
  "url": "https://voxday.net/2009/04/03/there-is-no-downside/",
  "scraped_at": "2026-01-08T22:52:22.873641",
  "title": "There is no downside",
  "date_display": "April 3, 2009",
  "date_iso": "2009-04-03T08:50:00+00:00",
  "date_from_url": "2009-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers provides amusement by worrying about the economic crisis harming <a href=\"http://scienceblogs.com/pharyngula/2009/03/eroding_our_intellectual_infra.php#comments\">America’s “intellectual infrastructure”</a>:</p><blockquote><p>One of the challenges facing the country right now in this time of economic crisis is that we’re also about to be confronted by the result of a decade of neglect of the nation’s infrastructure, in particular, the chronic starvation of our universities. It’s an insidious problem, because as administrations have discovered time and again, you can cut an education budget and nothing bad happens, from their perspective.</p></blockquote><p>But where is the evidence that America’s universities are its intellectual infrastructure?  It’s a self-serving assumption, and a problematic one when considered in a realistic light.  The comments are an absolute gold mine of comedy – to which I have referred before – as the hard scientists begin by beating up on the humanities and the fake sciences until eventually both sides join hands, sing Kumbaya, and reach a general agreement that Womyns’ Studies and Postmodern Philosophy are just as important as Biology and Physics and that every academic discipline should be lavishly funded by the taxpayers.</p><p>However, the Pharyngulans are confusing theory with reality here, as they discuss what the liberal arts are theoretically supposed to be as opposed to what they actually are at an American university.  This is ironic, as their community is one of the foremost examples of how an American university system does not teach one how to think ; indeed, it does precisely the opposite as one will not find a less thoughtful, more dogmatic individual than the average American academic.</p><p>And, as others have noticed, it’s becoming evident that the best and brightest coming out of America’s most elite universities are actively contributing to America’s economic demise.  There is arguably a stronger case for shutting down the universities entirely than there is for not reducing their funding; paying to obtain a piece of paper calling itself a university degree is no longer tantamount to obtaining what passes for an education.  From politics and business to economics and the liberal arts, the American university system has been <a href=\"http://www.livemint.com/2009/03/15220749/Post-financial-crisis-Bschoo.html\">a massive failure</a>.</p><p><i>““It is so obvious that something big has failed,” said Angel Cabrera, dean of the Thunderbird School of Global Management in Glendale, Arizona. “We can look the other way, but come on. The chief executive officers of those companies, those are people we used to brag about. We cannot say, ‘Well, it wasn’t our fault’ when there is such a systemic, widespread failure of leadership.”</i></p></div>",
  "content_text": "PZ Myers provides amusement by worrying about the economic crisis harming\nAmerica’s “intellectual infrastructure”\n:\nOne of the challenges facing the country right now in this time of economic crisis is that we’re also about to be confronted by the result of a decade of neglect of the nation’s infrastructure, in particular, the chronic starvation of our universities. It’s an insidious problem, because as administrations have discovered time and again, you can cut an education budget and nothing bad happens, from their perspective.\nBut where is the evidence that America’s universities are its intellectual infrastructure?  It’s a self-serving assumption, and a problematic one when considered in a realistic light.  The comments are an absolute gold mine of comedy – to which I have referred before – as the hard scientists begin by beating up on the humanities and the fake sciences until eventually both sides join hands, sing Kumbaya, and reach a general agreement that Womyns’ Studies and Postmodern Philosophy are just as important as Biology and Physics and that every academic discipline should be lavishly funded by the taxpayers.\nHowever, the Pharyngulans are confusing theory with reality here, as they discuss what the liberal arts are theoretically supposed to be as opposed to what they actually are at an American university.  This is ironic, as their community is one of the foremost examples of how an American university system does not teach one how to think ; indeed, it does precisely the opposite as one will not find a less thoughtful, more dogmatic individual than the average American academic.\nAnd, as others have noticed, it’s becoming evident that the best and brightest coming out of America’s most elite universities are actively contributing to America’s economic demise.  There is arguably a stronger case for shutting down the universities entirely than there is for not reducing their funding; paying to obtain a piece of paper calling itself a university degree is no longer tantamount to obtaining what passes for an education.  From politics and business to economics and the liberal arts, the American university system has been\na massive failure\n.\n““It is so obvious that something big has failed,” said Angel Cabrera, dean of the Thunderbird School of Global Management in Glendale, Arizona. “We can look the other way, but come on. The chief executive officers of those companies, those are people we used to brag about. We cannot say, ‘Well, it wasn’t our fault’ when there is such a systemic, widespread failure of leadership.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-03T07:50:00+00:00"
}