{
  "url": "https://voxday.net/2009/04/13/ware-next-waco/",
  "scraped_at": "2026-01-08T22:53:18.092503",
  "title": "‘Ware the next Waco",
  "date_display": "April 13, 2009",
  "date_iso": "2009-04-13T17:15:00+00:00",
  "date_from_url": "2009-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s Clinton redux.  Federal agencies appear to be <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=94799\">gunning for the right-wing militias</a> again:</p><blockquote><p>“The DHS/Office of Intelligence and Analysis (I&amp;A) has no specific information that domestic right wing terrorists are currently planning acts of violence.” Nonetheless, it states that “right wing extremists may be gaining new recruits by playing on their fears about … the economic downturn and the election of the first African-American President …”</p></blockquote><p>I don’t think anyone has fears about election of the first African-American president.  I think, on the other hand, they wish they could be certain that Obama actually was African-American.  The fear is more centered around the possibility that the man is the first Kenyan-Muslim socialist to hold the office.  It’s not so much that Obama’s middle name is Hussein as the fact that he has “mistakenly” referred to “<a href=\"http://www.youtube.com/watch?v=iQqIpdBOg6I\">his Muslim faith</a>” and <a href=\"http://www.youtube.com/watch?v=5JGK-xbXxMw\">bowed in public to the King of Saudi Arabia</a>.</p><p>What’s he going to do next for an encore, get caught on film praying to Mecca?  No doubt the mainstream media would attempt to explain it away as a misunderstood yoga session.  Anyhow, what happened to all those green shoots we were hearing about last week?  If the recovery is just around the corner, then one would assume that any concerns driven by the economic downturn have already been rendered moot.</p></div>",
  "content_text": "It’s Clinton redux.  Federal agencies appear to be\ngunning for the right-wing militias\nagain:\n“The DHS/Office of Intelligence and Analysis (I&A) has no specific information that domestic right wing terrorists are currently planning acts of violence.” Nonetheless, it states that “right wing extremists may be gaining new recruits by playing on their fears about … the economic downturn and the election of the first African-American President …”\nI don’t think anyone has fears about election of the first African-American president.  I think, on the other hand, they wish they could be certain that Obama actually was African-American.  The fear is more centered around the possibility that the man is the first Kenyan-Muslim socialist to hold the office.  It’s not so much that Obama’s middle name is Hussein as the fact that he has “mistakenly” referred to “\nhis Muslim faith\n” and\nbowed in public to the King of Saudi Arabia\n.\nWhat’s he going to do next for an encore, get caught on film praying to Mecca?  No doubt the mainstream media would attempt to explain it away as a misunderstood yoga session.  Anyhow, what happened to all those green shoots we were hearing about last week?  If the recovery is just around the corner, then one would assume that any concerns driven by the economic downturn have already been rendered moot.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-04-13T16:15:00+00:00"
}