{
  "url": "https://voxday.net/2020/01/18/apples-to-apples/",
  "scraped_at": "2025-12-21T03:13:04.820434",
  "title": "Apples to apples",
  "date_display": "January 18, 2020",
  "date_iso": "2020-01-18T16:43:31+00:00",
  "date_from_url": "2020-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was pretty sure that I was faster than Derrick Henry back in the day, but I didn’t realize I was THAT much faster:</p><blockquote class=\"tr_bq\"><p>Also a standout track &amp; field athlete, Henry competed as a sprinter at Yulee from 2010 to 2011. He posted a personal-best time of 11.11 seconds in the 100-meter dash at the 2011 FHSAA 2A District 3 Championships, where he placed seventh.</p></blockquote><p>I found that mildly amusing, as my best high school 100-meter time was 10.82. Of course, it’s not just Henry’s speed that makes him a great running back. It’s one thing to run that fast at 135 pounds, it’s another thing to do it at 235. I remember <a href=\"https://www.youtube.com/watch?v=ePSDQYUduZM\">watching Darrell Thompson play</a> at the University of Minnesota during my college track days and thinking, “I wonder if I could do that? He’s slower than me… but then, he is probably a LOT harder to bring down.” Thompson and I were at the same meet once, but we didn’t run against each other. He was beaten by one of my teammates, though.</p><p>It’s even more amusing to see that Wikipedia considers Henry to be “a standout track &amp; field athlete” when it doesn’t even mention my track &amp; field career, which included multiple conference championships, both individual and team, at the high school and NCAA D1 levels.<br><b><br/></b><b>UPDATE: </b>An alternate history sidenote. In my very brief football career, which ended at the age of 8, I almost never got on the field because the coach always played this one boy who was very fast and strong at running back. The boy also grew up to be an excellent sprinter in high school, although we never happened to run against each other due to being in different conferences and regions. But there was no shame in sitting on the bench behind him, as he wound up being an All-American running back who held his conference’s career rushing record for 12 years.</br></p><p>Years later, that coach apologized to me for never even trying to give me a chance to get on the field. But I didn’t have a problem with it at the time, and it was probably a blessing in the end because I’m the only one of the three Minnesota sprinters mentioned who hasn’t had any knee or hip surgeries. I certainly wouldn’t still be playing soccer. But it is intriguing to think of how good one high school’s football and track teams might have been if I’d stayed in the public school system and continued playing football instead of soccer.</p></div>",
  "content_text": "I was pretty sure that I was faster than Derrick Henry back in the day, but I didn’t realize I was THAT much faster:\nAlso a standout track & field athlete, Henry competed as a sprinter at Yulee from 2010 to 2011. He posted a personal-best time of 11.11 seconds in the 100-meter dash at the 2011 FHSAA 2A District 3 Championships, where he placed seventh.\nI found that mildly amusing, as my best high school 100-meter time was 10.82. Of course, it’s not just Henry’s speed that makes him a great running back. It’s one thing to run that fast at 135 pounds, it’s another thing to do it at 235. I remember\nwatching Darrell Thompson play\nat the University of Minnesota during my college track days and thinking, “I wonder if I could do that? He’s slower than me… but then, he is probably a LOT harder to bring down.” Thompson and I were at the same meet once, but we didn’t run against each other. He was beaten by one of my teammates, though.\nIt’s even more amusing to see that Wikipedia considers Henry to be “a standout track & field athlete” when it doesn’t even mention my track & field career, which included multiple conference championships, both individual and team, at the high school and NCAA D1 levels.\nUPDATE:\nAn alternate history sidenote. In my very brief football career, which ended at the age of 8, I almost never got on the field because the coach always played this one boy who was very fast and strong at running back. The boy also grew up to be an excellent sprinter in high school, although we never happened to run against each other due to being in different conferences and regions. But there was no shame in sitting on the bench behind him, as he wound up being an All-American running back who held his conference’s career rushing record for 12 years.\nYears later, that coach apologized to me for never even trying to give me a chance to get on the field. But I didn’t have a problem with it at the time, and it was probably a blessing in the end because I’m the only one of the three Minnesota sprinters mentioned who hasn’t had any knee or hip surgeries. I certainly wouldn’t still be playing soccer. But it is intriguing to think of how good one high school’s football and track teams might have been if I’d stayed in the public school system and continued playing football instead of soccer.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-18T16:43:31+00:00"
}