{
  "url": "https://voxday.net/2020/01/26/atheism-is-genetic/",
  "scraped_at": "2025-12-21T03:13:55.368020",
  "title": "Atheism is genetic",
  "date_display": "January 26, 2020",
  "date_iso": "2020-01-26T12:01:24+00:00",
  "date_from_url": "2020-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or is, at the very least, <a href=\"https://www.rt.com/news/479132-genes-responsible-for-autism/\">a developmental disorder linked to genetic causes</a>:</p><blockquote><p>The largest genetic sequencing study of autism spectrum disorder (ASD) ever conducted has found 102 genes associated with autism, a major step towards an eventual cure, which may involve genetic manipulation. Most of these 102 genes were expressed in the brain, and affect synapses or regulate other genes. This means they have important roles in switching other genes on and off.</p><p>Furthermore, 49 of these genes are also linked to other developmental disorders, underlining the fact that the neurobiology of many such conditions are likely to overlap.</p></blockquote><p>I first postulated my hypothesis concerning a link between the autism spectrum and atheism <a href=\"http://voxday.blogspot.com/2007/08/socially-autistic-atheist.html\">back in  2007</a> in response to a post by PZ Myers at Pharyngula in which he and other atheists were bragging about their relatively high Asperger’s Quotient scores. I wrote: “<i>Obviously, more comprehensive and scientific tests would be advised before any definite conclusion can be reached, but these initial observations do appear to indicate a possibility that atheism could be nothing more than a minor mental disorder.”</i></p><p>Since then, at least two scientific studies that were directly inspired by my hypothesis have found that there is a statistical correlation between atheism and the autism spectrum.</p><p>This new study indicates – it does not yet prove, but it indicates – that scientists will eventually be able to find a link between those 102 genes and atheism, which suggests that it is atheism, not religion, that will one day be cured by science. One should note that this genetic link also explains why atheism has never propagated very successfully from one generation to the next, as atheists tend to be very unfit in the evolutionary sense of natural and sexual selection.</p><p>So, don’t be bothered by your shower-averse, science-loving, fedora-sporting acquaintance who insists on quoting Richard Dawkins at everyone apropos of nothing. Just assure him that he does well to trust in science, as one day science will cure his genetic developmental disorder.</p></div>",
  "content_text": "Or is, at the very least,\na developmental disorder linked to genetic causes\n:\nThe largest genetic sequencing study of autism spectrum disorder (ASD) ever conducted has found 102 genes associated with autism, a major step towards an eventual cure, which may involve genetic manipulation. Most of these 102 genes were expressed in the brain, and affect synapses or regulate other genes. This means they have important roles in switching other genes on and off.\nFurthermore, 49 of these genes are also linked to other developmental disorders, underlining the fact that the neurobiology of many such conditions are likely to overlap.\nI first postulated my hypothesis concerning a link between the autism spectrum and atheism\nback in  2007\nin response to a post by PZ Myers at Pharyngula in which he and other atheists were bragging about their relatively high Asperger’s Quotient scores. I wrote: “\nObviously, more comprehensive and scientific tests would be advised before any definite conclusion can be reached, but these initial observations do appear to indicate a possibility that atheism could be nothing more than a minor mental disorder.”\nSince then, at least two scientific studies that were directly inspired by my hypothesis have found that there is a statistical correlation between atheism and the autism spectrum.\nThis new study indicates – it does not yet prove, but it indicates – that scientists will eventually be able to find a link between those 102 genes and atheism, which suggests that it is atheism, not religion, that will one day be cured by science. One should note that this genetic link also explains why atheism has never propagated very successfully from one generation to the next, as atheists tend to be very unfit in the evolutionary sense of natural and sexual selection.\nSo, don’t be bothered by your shower-averse, science-loving, fedora-sporting acquaintance who insists on quoting Richard Dawkins at everyone apropos of nothing. Just assure him that he does well to trust in science, as one day science will cure his genetic developmental disorder.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-26T12:01:24+00:00"
}