{
  "url": "https://voxday.net/2020/01/19/falsifying-the-nppn-hypothesis/",
  "scraped_at": "2025-12-21T03:13:12.128100",
  "title": "Falsifying the NPPN hypothesis",
  "date_display": "January 19, 2020",
  "date_iso": "2020-01-19T13:00:05+00:00",
  "date_from_url": "2020-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is a thought concerning the oft-expressed assertion that an overrepresentation in the number of Nobel Prizes awarded to individuals of Jewish descent is an indicator of Jewish intelligence, or what may be described as the Nobel Prize Per Nation (NPPN) hypothesis. What got me thinking about this was that on <i>Russia Today</i>, it was pointed out by a Los Angeles film critic that the film <i>Jojo Rabbit</i>, which has been nominated for six Oscars, <a href=\"https://www.rt.com/op-ed/478360-jojo-rabbit-oscar-holocaust/\">is an average film</a> that would never have been nominated for an award if its subject matter was not the Holocaust.</p><p>So, it should be possible to count up the number of Oscar nominations awarded to Holocaust-related films, then compare the Oscar nomination/Holocaust film ratio to the ratio of Oscars nominations given to all non-Holocaust films. My hypothesis is that the Holocaust film overperformance will actually exceed the reported statistical Nobel Prize overperformance of 99,900 percent, and thereby add additional weight to my statistical demolition of the ridiculous “115 average IQ” rhetoric.</p><p>I am not going to bother testing the hypothesis for the obvious reason that a) I have already proved what I wanted to prove to my own satisfaction, b) I don’t care who is, on average, smarter than whom, and c) I really don’t care about prizes, Hollywood, or Hollywood prizes. But if some film buff feels like putting in the effort, tell me how it works out and I’ll post the results here.</p><p>Of course, the most obvious disproof of the NPPN hypothesis is to simply turn the argument on its head. If it is true that a high ratio of Nobel Prizes per nation is a proof of high average national intelligence, then a low ratio of NPPN  must be a proof of low average intelligence. Since China only has 11 Nobel Prize winners despite having a very large population, (6.9 percent of its statistical share) and India has only 10 despite a population of 1.2 billion, (6.6 percent of its statistical share), the NPPN argument rests upon the idea that the Chinese and Indian people are considerably less intelligent than most of the nations on Earth.</p><p>It is also worth noting that although Jews are said to have won a total of 41 percent of all the Nobel Prizes in economics, <i>there is no Nobel Prize in economics</i>. It is actually the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel, a prize that was established in 1968 by a donation from Sweden’s central bank, the Sveriges Riksbank, on the bank’s 300th anniversary and is not one of the prizes that Alfred Nobel established in his will in 1895.</p><p>Anyhow, the Nobel Prizes awarded to Barack Obama and Bob Dylan should be more than sufficient to demonstrate the total absurdity of the hyphothesis. The NPPN hypothesis is no more credible than the argument that the three greatest science fiction novelists are Lois McMaster Bujold, NK Jemisin, and Connie Willis because they have won the most Hugo Awards for Best Novel.</p><p>Neither credentials nor participation trophies are indicative of intelligence.</p></div>",
  "content_text": "Here is a thought concerning the oft-expressed assertion that an overrepresentation in the number of Nobel Prizes awarded to individuals of Jewish descent is an indicator of Jewish intelligence, or what may be described as the Nobel Prize Per Nation (NPPN) hypothesis. What got me thinking about this was that on\nRussia Today\n, it was pointed out by a Los Angeles film critic that the film\nJojo Rabbit\n, which has been nominated for six Oscars,\nis an average film\nthat would never have been nominated for an award if its subject matter was not the Holocaust.\nSo, it should be possible to count up the number of Oscar nominations awarded to Holocaust-related films, then compare the Oscar nomination/Holocaust film ratio to the ratio of Oscars nominations given to all non-Holocaust films. My hypothesis is that the Holocaust film overperformance will actually exceed the reported statistical Nobel Prize overperformance of 99,900 percent, and thereby add additional weight to my statistical demolition of the ridiculous “115 average IQ” rhetoric.\nI am not going to bother testing the hypothesis for the obvious reason that a) I have already proved what I wanted to prove to my own satisfaction, b) I don’t care who is, on average, smarter than whom, and c) I really don’t care about prizes, Hollywood, or Hollywood prizes. But if some film buff feels like putting in the effort, tell me how it works out and I’ll post the results here.\nOf course, the most obvious disproof of the NPPN hypothesis is to simply turn the argument on its head. If it is true that a high ratio of Nobel Prizes per nation is a proof of high average national intelligence, then a low ratio of NPPN  must be a proof of low average intelligence. Since China only has 11 Nobel Prize winners despite having a very large population, (6.9 percent of its statistical share) and India has only 10 despite a population of 1.2 billion, (6.6 percent of its statistical share), the NPPN argument rests upon the idea that the Chinese and Indian people are considerably less intelligent than most of the nations on Earth.\nIt is also worth noting that although Jews are said to have won a total of 41 percent of all the Nobel Prizes in economics,\nthere is no Nobel Prize in economics\n. It is actually the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel, a prize that was established in 1968 by a donation from Sweden’s central bank, the Sveriges Riksbank, on the bank’s 300th anniversary and is not one of the prizes that Alfred Nobel established in his will in 1895.\nAnyhow, the Nobel Prizes awarded to Barack Obama and Bob Dylan should be more than sufficient to demonstrate the total absurdity of the hyphothesis. The NPPN hypothesis is no more credible than the argument that the three greatest science fiction novelists are Lois McMaster Bujold, NK Jemisin, and Connie Willis because they have won the most Hugo Awards for Best Novel.\nNeither credentials nor participation trophies are indicative of intelligence.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-19T13:00:05+00:00"
}