{
  "url": "https://voxday.net/2020/01/15/fight-back-or-else/",
  "scraped_at": "2025-12-21T03:12:42.982725",
  "title": "Fight back or else",
  "date_display": "January 15, 2020",
  "date_iso": "2020-01-15T10:45:28+00:00",
  "date_from_url": "2020-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stefan Molyneux discovers that if you don’t fight back the first time, <a href=\"https://reclaimthenet.org/stefan-molyneux-mailchimp-terminated/\">there will be a second deplatforming</a>. And, almost certainly, a third, and a fourth….</p><blockquote><p>Email marketing service Mailchimp has terminated the account of Stefan Molyneux, host of the philosophy show Freedomain, after a complaint from Nandini Jammi, co-founder of activist group Sleeping Giants.</p><p>Mailchimp appears to have made the decision largely based on this complaint from Jammi which alleges that Molyneux is a white nationalist who promotes eugenics and race science. Molyneux denied these allegations but Mailchimp decided to terminate his account anyway and thanked Jammi for “bringing this to our attention.”</p></blockquote><p>This appears to be textbook tortious interference. Jammi has absolutely no involvement in the contract between Mailchimp and Molyneux, but she intentionally damaged their contractual relationship.</p><p>Mailchimp is in Georgia, and according to one Georgia lawyer, <i>“there are at least two actionable tort claims available in Georgia for a plaintiff who has been injured by wrongful interference with a business relationship: tortious interference with contractual rights and tortious interference with business relations.”</i><br><i><br/></i>Interestingly enough, in Georgia,<i> proof of a valid and enforceable contract need not be proved for interference of business relations. </i><i>A plaintiff need not wait to show that an interference resulted in breach to pursue tortious interference – he need only show interference that, because of the defendant’s interference, a third party’s performance of a contract was made more difficult, more expensive or actually caused the party not to perform the contract.</i><br><i><br/></i>He certainly won’t have any trouble proving interference or intentionality, given the way that the responsible third party put her actions right on the public record.</br></br></p><blockquote><p>Nandini Jammi@nandoodles<br>Good to know that Molyneux has been financially reeling since he was kicked off PayPal. He’s on SubscribeStar now, but probably earning a fraction of what he did before.</br></p><p>Nandini Jammi@nandoodles<br>Speaking of which… Hey @mailchimp/@MailchimpAbuse – did you know you power white nationalist Stefan Molyneux’s email newsletter? Molyneux promotes eugenics, race science and “men’s rights” activism. Can you look into this please?</br></p><p>Mailchimp@Mailchimp<br>Replying to @nandoodles<br>Thank you for bringing this to our attention. We’ve terminated this account.</br></br></p><p>Nandini Jammi@nandoodles<br>Which reminds me, didn’t @YouTube say it would be cracking down on creators “alleging that a group is superior in order to justify discrimination, segregation or exclusion”? What’s Molyneux still doing on YouTube?</br></p></blockquote><p>However, your legal rights may as well not exist if you do not aggressively defend them. And one thing I can testify, now that we’ve gained a fair amount of experience of them, is that most of these big tech companies have legal departments that might as well be writing their contracts of adhesion in crayon. Nor are their high-priced outside counsels necessarily any better.</p><p>St. Efan has demonstrated himself to be a soft target due to his failure to fight back against Paypal. If he lets this one go as well, he’ll almost certainly find himself deplatformed everywhere else in very short order. Remember this: while jaw-jaw is better than war-war, it is no substitute for it. When it becomes necessary to fight, then your only options are to a) fight or b) surrender. And no amount of thoughtful rationalizing and lamenting the decline of Man and his civilization will hide the fact that you have chosen to surrender if you are not fighting.</p><p>I have made it very, very clear that the Legal Legion and I will <i>vigorously </i>exercise our legal rights whenever an individual – whether she calls herself a reporter or not – or organization attempts to interfere with our various contractual relationships. And if anyone doubts that we’ve laid more than a few legal traps in preparation for those inevitable attempts, well, perhaps you should go and talk to Patreon about how much they are enjoying their current dance with the Legion.</p><p>And since we’re on the subject, if you are a New York, Georgia, or California lawyer who is interested in collecting skulls and scalps by putting in some <i>pro bono</i> time with the LLoE, get in touch. I can assure you, no one is having more fun these days than the Legal Legion.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://privacy.patreon.com/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1000\" data-original-width=\"1000\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://1.bp.blogspot.com/-7eWocI6RsnI/Xh7sH3HqOrI/AAAAAAAAEmg/4H_UlOphB30PvsL0hhQoc7gZzAa1jxlLQCLcBGAsYHQ/s320/Legal{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}2BLegion{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}2Bof{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}2BEvil.png\" width=\"320\"/></a></div></div>",
  "content_text": "Stefan Molyneux discovers that if you don’t fight back the first time,\nthere will be a second deplatforming\n. And, almost certainly, a third, and a fourth….\nEmail marketing service Mailchimp has terminated the account of Stefan Molyneux, host of the philosophy show Freedomain, after a complaint from Nandini Jammi, co-founder of activist group Sleeping Giants.\nMailchimp appears to have made the decision largely based on this complaint from Jammi which alleges that Molyneux is a white nationalist who promotes eugenics and race science. Molyneux denied these allegations but Mailchimp decided to terminate his account anyway and thanked Jammi for “bringing this to our attention.”\nThis appears to be textbook tortious interference. Jammi has absolutely no involvement in the contract between Mailchimp and Molyneux, but she intentionally damaged their contractual relationship.\nMailchimp is in Georgia, and according to one Georgia lawyer,\n“there are at least two actionable tort claims available in Georgia for a plaintiff who has been injured by wrongful interference with a business relationship: tortious interference with contractual rights and tortious interference with business relations.”\nInterestingly enough, in Georgia,\nproof of a valid and enforceable contract need not be proved for interference of business relations.\nA plaintiff need not wait to show that an interference resulted in breach to pursue tortious interference – he need only show interference that, because of the defendant’s interference, a third party’s performance of a contract was made more difficult, more expensive or actually caused the party not to perform the contract.\nHe certainly won’t have any trouble proving interference or intentionality, given the way that the responsible third party put her actions right on the public record.\nNandini Jammi@nandoodles\nGood to know that Molyneux has been financially reeling since he was kicked off PayPal. He’s on SubscribeStar now, but probably earning a fraction of what he did before.\nNandini Jammi@nandoodles\nSpeaking of which… Hey @mailchimp/@MailchimpAbuse – did you know you power white nationalist Stefan Molyneux’s email newsletter? Molyneux promotes eugenics, race science and “men’s rights” activism. Can you look into this please?\nMailchimp@Mailchimp\nReplying to @nandoodles\nThank you for bringing this to our attention. We’ve terminated this account.\nNandini Jammi@nandoodles\nWhich reminds me, didn’t @YouTube say it would be cracking down on creators “alleging that a group is superior in order to justify discrimination, segregation or exclusion”? What’s Molyneux still doing on YouTube?\nHowever, your legal rights may as well not exist if you do not aggressively defend them. And one thing I can testify, now that we’ve gained a fair amount of experience of them, is that most of these big tech companies have legal departments that might as well be writing their contracts of adhesion in crayon. Nor are their high-priced outside counsels necessarily any better.\nSt. Efan has demonstrated himself to be a soft target due to his failure to fight back against Paypal. If he lets this one go as well, he’ll almost certainly find himself deplatformed everywhere else in very short order. Remember this: while jaw-jaw is better than war-war, it is no substitute for it. When it becomes necessary to fight, then your only options are to a) fight or b) surrender. And no amount of thoughtful rationalizing and lamenting the decline of Man and his civilization will hide the fact that you have chosen to surrender if you are not fighting.\nI have made it very, very clear that the Legal Legion and I will\nvigorously\nexercise our legal rights whenever an individual – whether she calls herself a reporter or not – or organization attempts to interfere with our various contractual relationships. And if anyone doubts that we’ve laid more than a few legal traps in preparation for those inevitable attempts, well, perhaps you should go and talk to Patreon about how much they are enjoying their current dance with the Legion.\nAnd since we’re on the subject, if you are a New York, Georgia, or California lawyer who is interested in collecting skulls and scalps by putting in some\npro bono\ntime with the LLoE, get in touch. I can assure you, no one is having more fun these days than the Legal Legion.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-15T10:45:28+00:00"
}