{
  "url": "https://voxday.net/2020/01/04/post-peak-nfl/",
  "scraped_at": "2025-12-21T03:11:31.204195",
  "title": "Post-peak NFL",
  "date_display": "January 4, 2020",
  "date_iso": "2020-01-04T15:24:57+00:00",
  "date_from_url": "2020-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The serious drop in attendance hasn’t happened yet, but the NFL does appear to be <a href=\"https://profootballtalk.nbcsports.com/2020/01/03/nfl-attendance-hits-a-15-year-low/\">past its peak</a> already:</p><blockquote><p>According to David Broughton and Andrew Levin of Sports Business Daily, the NFL averaged 66,648 attendees at home games in 2019. That’s the lowest average since 2004.</p><p>The Cowboys averaged 90,929, leading the league for 11 straight seasons. Fifteen teams saw a decline in attendance, led by the Jaguars (8.7 percent drop), Raiders (7.6 percent) and Bengals (7.0 percent)….</p><p>Attendance peaked in 2016, with 69,487 per game. In 2004, 66,328 attended each game, on average.</p></blockquote><p>What is more ominous about this is that it is happening towards the end of an economic boom at a stock market peak. It’s only a 4.5 percent decline, but as I noted in <i>Corporate Cancer</i>, the first downward stage is usually a 20 percent drop before it temporarily stabilizes at the lower plateau, with an eventual decline to 50 percent of peak.</p></div>",
  "content_text": "The serious drop in attendance hasn’t happened yet, but the NFL does appear to be\npast its peak\nalready:\nAccording to David Broughton and Andrew Levin of Sports Business Daily, the NFL averaged 66,648 attendees at home games in 2019. That’s the lowest average since 2004.\nThe Cowboys averaged 90,929, leading the league for 11 straight seasons. Fifteen teams saw a decline in attendance, led by the Jaguars (8.7 percent drop), Raiders (7.6 percent) and Bengals (7.0 percent)….\nAttendance peaked in 2016, with 69,487 per game. In 2004, 66,328 attended each game, on average.\nWhat is more ominous about this is that it is happening towards the end of an economic boom at a stock market peak. It’s only a 4.5 percent decline, but as I noted in\nCorporate Cancer\n, the first downward stage is usually a 20 percent drop before it temporarily stabilizes at the lower plateau, with an eventual decline to 50 percent of peak.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-04T15:24:57+00:00"
}