{
  "url": "https://voxday.net/2020/01/03/reading-list-2019/",
  "scraped_at": "2025-12-21T03:11:23.432621",
  "title": "Reading List 2019",
  "date_display": "January 3, 2020",
  "date_iso": "2020-01-03T02:20:41+00:00",
  "date_from_url": "2020-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><u><b>Five Stars</b></u><br>A History of the Peninsular War, Vol. I, Charles Oman<br>A History of the Peninsular War, Vol. II, Charles Oman<br>A History of the Peninsular War, Vol. III, Charles Oman<br>A History of the Peninsular War, Vol. IV, Charles Oman<br>1Q84, Haruki Murakami<br>The Seville Communion, Arturo Perez-Reverte<br>The Tale of Genji, Murasaki Shikibu</br></br></br></br></br></br></br></p><p><u><b>Four Stars</b></u><br>Killing Commendatore, Haruki Murakami<br>Wellington’s Army, Charles Oman<br>Warwick the Kingmaker, Charles Oman<br>Night Watch, Terry Pratchett<br>A Hymn to Old Age, Hermann Hesse<br>In the Beginning Was the Command Line, Neal Stephenson<br>Neuromancer, William Gibson<br>Count Zero, William Gibson<br>Mona Lisa Overdrive, William Gibson<br>Zero History, William Gibson<br>The Master of Go, Yusanari Kawabata<br>What We Become, Arturo Perez-Reverte<br>The Nautical Chart, Arturo Perez-Reverte</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><u><b>Three Stars</b></u><br>Klingsor’s Last Summer, Hermann Hesse<br>Hooking Up, Tom Wolfe<br>A Man in Full, Tom Wolfe<br>A History of England, Charles Oman<br>Pattern Recognition, William Gibson<br>The Jews, Hillair Belloc<br>Captain Alatriste, Arturo Perez-Reverte<br>Purity of Blood, Arturo Perez-Reverte<br>The Sun Over Breda, Arturo Perez-Reverte<br>The King’s Gold, Arturo Perez-Reverte<br>The Cavalier in the Yellow Doublet, Arturo Perez-Reverte<br>The Children of Hurin, JRR Tolkien</br></br></br></br></br></br></br></br></br></br></br></br></p><p><u><b>Two Stars</b></u><br>Fall, or, Dodge in Hell, Neal Stephenson<br>The Trojan Mouse, Sam Lively<br>The Virtue of Nationalism, Yoram Hazony<br>Tender is the Night, F. Scott Fitzgerald<br>I am Charlotte Simmons, Tom Wolfe<br>From Bauhaus to Our House, Tom Wolfe</br></br></br></br></br></br></p><p><u><b>One Star</b></u><br>The Right Side of History, Ben Shapiro<br>House of the Sleeping Beauties, Yusanari Kawabata</br></br></p><p>If you’re interested in <a href=\"https://www.unauthorized.tv/programs/darkstream-557-reading-list-2019-f18c27?categoryId=11683\">a discussion of these books</a> and why I rated them the way I did, you can watch it on Unauthorized if you are a subscriber there.</p></div>",
  "content_text": "Five Stars\nA History of the Peninsular War, Vol. I, Charles Oman\nA History of the Peninsular War, Vol. II, Charles Oman\nA History of the Peninsular War, Vol. III, Charles Oman\nA History of the Peninsular War, Vol. IV, Charles Oman\n1Q84, Haruki Murakami\nThe Seville Communion, Arturo Perez-Reverte\nThe Tale of Genji, Murasaki Shikibu\nFour Stars\nKilling Commendatore, Haruki Murakami\nWellington’s Army, Charles Oman\nWarwick the Kingmaker, Charles Oman\nNight Watch, Terry Pratchett\nA Hymn to Old Age, Hermann Hesse\nIn the Beginning Was the Command Line, Neal Stephenson\nNeuromancer, William Gibson\nCount Zero, William Gibson\nMona Lisa Overdrive, William Gibson\nZero History, William Gibson\nThe Master of Go, Yusanari Kawabata\nWhat We Become, Arturo Perez-Reverte\nThe Nautical Chart, Arturo Perez-Reverte\nThree Stars\nKlingsor’s Last Summer, Hermann Hesse\nHooking Up, Tom Wolfe\nA Man in Full, Tom Wolfe\nA History of England, Charles Oman\nPattern Recognition, William Gibson\nThe Jews, Hillair Belloc\nCaptain Alatriste, Arturo Perez-Reverte\nPurity of Blood, Arturo Perez-Reverte\nThe Sun Over Breda, Arturo Perez-Reverte\nThe King’s Gold, Arturo Perez-Reverte\nThe Cavalier in the Yellow Doublet, Arturo Perez-Reverte\nThe Children of Hurin, JRR Tolkien\nTwo Stars\nFall, or, Dodge in Hell, Neal Stephenson\nThe Trojan Mouse, Sam Lively\nThe Virtue of Nationalism, Yoram Hazony\nTender is the Night, F. Scott Fitzgerald\nI am Charlotte Simmons, Tom Wolfe\nFrom Bauhaus to Our House, Tom Wolfe\nOne Star\nThe Right Side of History, Ben Shapiro\nHouse of the Sleeping Beauties, Yusanari Kawabata\nIf you’re interested in\na discussion of these books\nand why I rated them the way I did, you can watch it on Unauthorized if you are a subscriber there.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-03T02:20:41+00:00"
}