{
  "url": "https://voxday.net/2020/01/22/rip-sir-bedivere/",
  "scraped_at": "2025-12-21T03:13:33.681760",
  "title": "RIP Sir Bedivere",
  "date_display": "January 22, 2020",
  "date_iso": "2020-01-22T15:55:52+00:00",
  "date_from_url": "2020-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another Python has left the building. <a href=\"https://www.dailymail.co.uk/news/article-7916055/Monty-Python-star-Terry-Jones-died-aged-77-agent-says.html\">RIP Terry Jones</a>:</p><blockquote><p>‘We are deeply saddened to have to announce the passing of beloved husband and father, Terry Jones.</p><p>‘Terry passed away on the evening of 21 January 2020 at the age of 77 with his wife Anna Soderstrom by his side after a long, extremely brave but always good humoured battle with a rare form of dementia, FTD. Over the past few days his wife, children, extended family and many close friends have been constantly with Terry as he gently slipped away at his home in North London.</p><p>We have all lost a kind, funny, warm, creative and truly loving man whose uncompromising individuality, relentless intellect and extraordinary humour has given pleasure to countless millions across six decades.’</p></blockquote><p>With Terry Gilliam, Jones wrote and directed what is almost certainly the funniest movie ever filmed, <i>Monty Python and the Holy Grail</i>. The mere fact that it is still being quoted on a daily basis around the world despite having been released 45 years ago is astonishing, as is the fact that young men today find it every bit as funny as young men did twenty and thirty years ago. The humor is truly timeless.</p><p>Monty Python never again reached such heights, but then, no one else ever did either. And while people will point to the mother in Life of Brian, Cardinal Biggles of the Spanish Inquisition sketch, or Mr. Creosote from the famous “wafer thin” sketch, for my money, his greatest character was Sir Bedivere and his most unforgettable line was from the Holy Grail.</p><p><i>“Who are you, who are so wise in the ways of science?”</i></p><p>It still makes me laugh, every single time.</p></div>",
  "content_text": "Another Python has left the building.\nRIP Terry Jones\n:\n‘We are deeply saddened to have to announce the passing of beloved husband and father, Terry Jones.\n‘Terry passed away on the evening of 21 January 2020 at the age of 77 with his wife Anna Soderstrom by his side after a long, extremely brave but always good humoured battle with a rare form of dementia, FTD. Over the past few days his wife, children, extended family and many close friends have been constantly with Terry as he gently slipped away at his home in North London.\nWe have all lost a kind, funny, warm, creative and truly loving man whose uncompromising individuality, relentless intellect and extraordinary humour has given pleasure to countless millions across six decades.’\nWith Terry Gilliam, Jones wrote and directed what is almost certainly the funniest movie ever filmed,\nMonty Python and the Holy Grail\n. The mere fact that it is still being quoted on a daily basis around the world despite having been released 45 years ago is astonishing, as is the fact that young men today find it every bit as funny as young men did twenty and thirty years ago. The humor is truly timeless.\nMonty Python never again reached such heights, but then, no one else ever did either. And while people will point to the mother in Life of Brian, Cardinal Biggles of the Spanish Inquisition sketch, or Mr. Creosote from the famous “wafer thin” sketch, for my money, his greatest character was Sir Bedivere and his most unforgettable line was from the Holy Grail.\n“Who are you, who are so wise in the ways of science?”\nIt still makes me laugh, every single time.",
  "tags": [
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-22T15:55:52+00:00"
}