{
  "url": "https://voxday.net/2020/01/24/russia-bans-dual-citizens/",
  "scraped_at": "2025-12-21T03:13:48.419571",
  "title": "Russia bans dual-citizens",
  "date_display": "January 24, 2020",
  "date_iso": "2020-01-24T13:54:17+00:00",
  "date_from_url": "2020-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No wonder the neoclowns have been clamoring incessantly for war with Russia. They recognized, before anyone else did, that <a href=\"https://cluborlov.blogspot.com/2020/01/life-after-putin.html\">their “hello, fellow Russians” jig</a> was up:</p><blockquote><p>Dual citizens and holders of foreign residency permits will now be barred from holding official positions within the Russian Federation. In addition, 25 years of Russian residency will be required of anyone running for President instead of the current 10. This may seem like a minor change, but it is causing Russia’s fifth-columnists and members of the liberal opposition to tear their hair out while gnashing their teeth because most of the current ones will be automatically disqualified from holding office while any future ones will be forced to choose between serving Russia and having a bug-out plan.</p><p>More specifically, given their new outsider status, their Western masters will consider them useless and will no longer funnel funds to them or offer them free regime change training. This approach is sure to be more effective than the current, more labor-intensive one of playing whack-a-mole with foreign-financed NGOs and foreign agents attempting to infiltrate Russia’s government.</p></blockquote><p>The United States and other Western governments desperately need to enact a similar law. Ideally, even being <i>eligible </i>for dual-citizenship would disqualify a citizen from holding office or working for the national government.</p></div>",
  "content_text": "No wonder the neoclowns have been clamoring incessantly for war with Russia. They recognized, before anyone else did, that\ntheir “hello, fellow Russians” jig\nwas up:\nDual citizens and holders of foreign residency permits will now be barred from holding official positions within the Russian Federation. In addition, 25 years of Russian residency will be required of anyone running for President instead of the current 10. This may seem like a minor change, but it is causing Russia’s fifth-columnists and members of the liberal opposition to tear their hair out while gnashing their teeth because most of the current ones will be automatically disqualified from holding office while any future ones will be forced to choose between serving Russia and having a bug-out plan.\nMore specifically, given their new outsider status, their Western masters will consider them useless and will no longer funnel funds to them or offer them free regime change training. This approach is sure to be more effective than the current, more labor-intensive one of playing whack-a-mole with foreign-financed NGOs and foreign agents attempting to infiltrate Russia’s government.\nThe United States and other Western governments desperately need to enact a similar law. Ideally, even being\neligible\nfor dual-citizenship would disqualify a citizen from holding office or working for the national government.",
  "tags": [
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-24T13:54:17+00:00"
}