{
  "url": "https://voxday.net/2020/01/14/the-catholic-convergence/",
  "scraped_at": "2025-12-21T03:12:39.320846",
  "title": "The Catholic convergence",
  "date_display": "January 14, 2020",
  "date_iso": "2020-01-14T17:10:52+00:00",
  "date_from_url": "2020-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was fascinating to read how Teilhard de Chardin, whose heretical pseudo-theology was built around his concept of convergence, <a href=\"https://onepeterfive.com/teilhard-chardin-ambiguity-pope/\">actively practiced a very different concept</a> I used precisely the same word to describe:</p><blockquote><p>Teilhard de Chardin manifested both sides of the Modernist. On the one hand, he wanted to “aggiornamentize” or update Christian doctrine until, ceasing to be what it had been historically, it essentially turned into modern thought. His preferred medium for the transition was evolutionary scientism. He believed not only that the evolution of species had already been adequately demonstrated, but also that evolution is the paradigm for grasping the whole of reality, including its spiritual aspects. He argued that matter evolves into spirit and that spirit will evolve into the cosmic Christ. The general framework is a Hegelian progressivism in which, in spite of momentary setbacks and conflicts, the whole universe, with mankind at its crest, is gradually improving, rising, and achieving spiritualization.</p><p>As a result, Teilhard rejected the doctrine of the creation and fall of Adam and Eve and, more pointedly for the Holy Office, the doctrine of original sin, which he called “an absurdity.” For Teilhard, the first men (there were many of them) were prehistoric primates of weak intelligence, and the “fall” simply describes the alienation from God of insufficiently spiritualized beings. Thus, there is no place whatsoever for the doctrine of a sin attaching to human nature by way of natural generation from Adam – in spite of the fact that this was taught as a de fide dogma by the Council of Trent.</p><p>Teilhard’s views on polygenism and original sin were among those condemned in Pius XII’s encyclical Humani Generis of 1950. Yet Teilhard’s reaction, while apparently submissive in the public forum, was fiercely contemptuous in private. He characterized Humani Generis in the following words: <i>“A good psychoanalyst would see in it the clear traces of a specific religious perversion – the masochism and sadism of orthodoxy; the pleasure of swallowing, and making others swallow, the truth under its crudest and stupidest forms”</i>.</p><p>On the other hand – and this is a crucial point for understanding the general ecclesial crisis in which we find ourselves today – Teilhard, like many Modernists before and after him, refused to leave the Catholic Church, no matter how “badly” he felt he was treated by it. For him, the goal was to ride out the waves as long as possible, to influence and infiltrate, to make disciples, plant seeds, and publish (or, in his case, arrange for posthumous publications, since for the final period of his life, he was under strictures). He really believed he had the mission of changing the Church from within. Although he no longer professed the Catholic Faith – he once said to Dietrich von Hildebrand that St. Augustine “had spoiled everything by introducing the supernatural” (!) – the idea of being an ex-Catholic, sitting on the outside of the institution, held no appeal for him. It was as if he thought that only the Catholic Church provided the infrastructure necessary for the transmission of a synthetic, worldwide philosophy.</p><p>Thus, in a letter dated January 26, 1936, he wrote:</p><p><i>What increasingly dominates my interest is the effort to establish within myself, and to diffuse around me, a new religion (let’s call it an improved Christianity if you like) whose personal God is no longer the great Neolithic landowner of times gone by, but the Soul of the world … as demanded by the cultural and religious stage we have now reached.</i></p><p>In another letter about five years later, on March 21, 1941, he declared:<i> “According to my own principles, I cannot fight against Christianity; I can only work inside it by trying to transform and convert it.”</i></p></blockquote><p>Or rather, to infiltrate and converge it.</p></div>",
  "content_text": "It was fascinating to read how Teilhard de Chardin, whose heretical pseudo-theology was built around his concept of convergence,\nactively practiced a very different concept\nI used precisely the same word to describe:\nTeilhard de Chardin manifested both sides of the Modernist. On the one hand, he wanted to “aggiornamentize” or update Christian doctrine until, ceasing to be what it had been historically, it essentially turned into modern thought. His preferred medium for the transition was evolutionary scientism. He believed not only that the evolution of species had already been adequately demonstrated, but also that evolution is the paradigm for grasping the whole of reality, including its spiritual aspects. He argued that matter evolves into spirit and that spirit will evolve into the cosmic Christ. The general framework is a Hegelian progressivism in which, in spite of momentary setbacks and conflicts, the whole universe, with mankind at its crest, is gradually improving, rising, and achieving spiritualization.\nAs a result, Teilhard rejected the doctrine of the creation and fall of Adam and Eve and, more pointedly for the Holy Office, the doctrine of original sin, which he called “an absurdity.” For Teilhard, the first men (there were many of them) were prehistoric primates of weak intelligence, and the “fall” simply describes the alienation from God of insufficiently spiritualized beings. Thus, there is no place whatsoever for the doctrine of a sin attaching to human nature by way of natural generation from Adam – in spite of the fact that this was taught as a de fide dogma by the Council of Trent.\nTeilhard’s views on polygenism and original sin were among those condemned in Pius XII’s encyclical Humani Generis of 1950. Yet Teilhard’s reaction, while apparently submissive in the public forum, was fiercely contemptuous in private. He characterized Humani Generis in the following words:\n“A good psychoanalyst would see in it the clear traces of a specific religious perversion – the masochism and sadism of orthodoxy; the pleasure of swallowing, and making others swallow, the truth under its crudest and stupidest forms”\n.\nOn the other hand – and this is a crucial point for understanding the general ecclesial crisis in which we find ourselves today – Teilhard, like many Modernists before and after him, refused to leave the Catholic Church, no matter how “badly” he felt he was treated by it. For him, the goal was to ride out the waves as long as possible, to influence and infiltrate, to make disciples, plant seeds, and publish (or, in his case, arrange for posthumous publications, since for the final period of his life, he was under strictures). He really believed he had the mission of changing the Church from within. Although he no longer professed the Catholic Faith – he once said to Dietrich von Hildebrand that St. Augustine “had spoiled everything by introducing the supernatural” (!) – the idea of being an ex-Catholic, sitting on the outside of the institution, held no appeal for him. It was as if he thought that only the Catholic Church provided the infrastructure necessary for the transmission of a synthetic, worldwide philosophy.\nThus, in a letter dated January 26, 1936, he wrote:\nWhat increasingly dominates my interest is the effort to establish within myself, and to diffuse around me, a new religion (let’s call it an improved Christianity if you like) whose personal God is no longer the great Neolithic landowner of times gone by, but the Soul of the world … as demanded by the cultural and religious stage we have now reached.\nIn another letter about five years later, on March 21, 1941, he declared:\n“According to my own principles, I cannot fight against Christianity; I can only work inside it by trying to transform and convert it.”\nOr rather, to infiltrate and converge it.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-14T17:10:52+00:00"
}