{
  "url": "https://voxday.net/2020/01/11/too-short-and-too-dishonest-for-the-ride/",
  "scraped_at": "2026-01-08T13:32:57.307891",
  "title": "Too short and too dishonest for the ride",
  "date_display": "January 11, 2020",
  "date_iso": "2020-01-11T10:44:16+00:00",
  "date_from_url": "2020-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People often ask me to work with, or publish, or link to, or otherwise support various individuals who are more or less on the ideological Right. And, of course, that has been something that we’ve tried repeatedly to do since we founded Castalia House. The problem, as we have learned over time, is that most people are simply too stupid, too short-sighted, too narcissistic, too independent, or too dishonest to be worth assisting.</p><p>The Z-man is not entirely devoid of ideas, and I have occasionally linked to his more insightful posts, but the following comment should suffice to demonstrate why he’s simply not someone that anyone can take seriously as an intellectual or even a commentator. Keep in mind that this is a comment on a post dedicated to declaring that he is the one pure soul worthy of support in a dissident swamp of grifters.</p><blockquote><p>thezman<br> There was never a lawsuit against Indiegogo. Court filings are public records. For starters, in such a dispute the attorney will look at the contract you signed. He will see there is a dispute resolution process and ask you if you initiated that process. If not, then you will need to do that first. Once that is done and you are not satisfied, he will tell you that the next step is arbitration. Getting a judge to set aside an arbitration clause in a contract is extremely difficult and mostly pointless.</br></p><p>The bottom line is Indiegogo canceled the project, gave the people their money back and that was it. There was no lawsuit. No class action. No arbitration. Nothing.</p></blockquote><p>The combination of ignorance, stupidity, envy, and gamma posturing would be difficult to top without resorting to the visual medium of YouTube. It doesn’t even rise to the level of a clueless mainstream political reporter. Nevertheless, don’t correct him. Don’t set the record straight. Don’t provide him with any proof of what actually happened at all – and I know that literally hundreds of you have it in your possession. Just let his statement stand for the record.</p><p>And keep it in mind the next time you ask me why I regard right-wing mediocrities like the Z-man with undisguised contempt and refuse to have anything to do with his kind. Many, if not most, of the so-called “grifters” he decries are not only smarter and harder-working than he is, they are more accomplished and far more worthy of your trust.</p><p>Meanwhile, it’s good to see that others on the Right are discovering lawfare can be an effective way <a href=\"https://www.politico.com/news/2020/01/09/brimelow-new-york-times-lawsuit-097095\">to strike back at the weaponized media</a>:</p><blockquote><p>Peter Brimelow, an anti-immigration activist who hosts a website that has published the writings of white supremacists, is suing The New York Times for $5 million for labeling him an “open white nationalist” in an article last year.</p><p>The characterization of Brimelow that triggered the libel lawsuit appeared in a Jan. 15, 2019 article by Times political reporter Trip Gabriel that offered a chronology of racist and inflammatory comments by Rep. Steve King (R-Iowa)….</p><p>“We stand by the story and will vigorously defend,” Times spokeswoman Eileen Murphy said.</p></blockquote><p>One of these days, we’re going to have to put together a class action against Wikipedia and other media sites used to seed the never-ending slander and libel. This is a good time to go after the media because they no longer have the resources to defend themselves as both their circulations and their revenues are declining.</p><p>UPDATE: This response by a Z-maniac is more than a little amusing, considering our complete lack of interest in what any of them happen to think about me or anything else:</p><blockquote class=\"tr_bq\"><p>This is how a cult leader reassures the faithful: Denigrate the faithless to instill self-righteous superiority within the cult so that they dismiss any counterclaims without thought. Real evidence is no longer necessary. A measured response is to link to evidence or acknowledge that a sealed arbitration leaves room for skepticism.</p></blockquote><p>Notice how the gammas always love to theorize and posture in the complete absence of information. They project their own lack of knowledge as well as their inability to not blurt out everything they know to everyone else. The idea that someone who genuinely possesses the conclusive evidence might not care what they believe is simply beyond their imagination. Sometimes the cult’s superiority is real. And as cults go, it’s quite affordable.</p><p>I just thought this was an excellent opportunity to demonstrate to everyone who is in the know that an occasional anklebiter is both a fool and a liar. There is no need to prove it to those who are dumb enough to take him seriously; they will simply move the goalposts anyhow. If they mattered, we’d prove it to them. But they don’t.</p></div>",
  "content_text": "People often ask me to work with, or publish, or link to, or otherwise support various individuals who are more or less on the ideological Right. And, of course, that has been something that we’ve tried repeatedly to do since we founded Castalia House. The problem, as we have learned over time, is that most people are simply too stupid, too short-sighted, too narcissistic, too independent, or too dishonest to be worth assisting.\nThe Z-man is not entirely devoid of ideas, and I have occasionally linked to his more insightful posts, but the following comment should suffice to demonstrate why he’s simply not someone that anyone can take seriously as an intellectual or even a commentator. Keep in mind that this is a comment on a post dedicated to declaring that he is the one pure soul worthy of support in a dissident swamp of grifters.\nthezman\nThere was never a lawsuit against Indiegogo. Court filings are public records. For starters, in such a dispute the attorney will look at the contract you signed. He will see there is a dispute resolution process and ask you if you initiated that process. If not, then you will need to do that first. Once that is done and you are not satisfied, he will tell you that the next step is arbitration. Getting a judge to set aside an arbitration clause in a contract is extremely difficult and mostly pointless.\nThe bottom line is Indiegogo canceled the project, gave the people their money back and that was it. There was no lawsuit. No class action. No arbitration. Nothing.\nThe combination of ignorance, stupidity, envy, and gamma posturing would be difficult to top without resorting to the visual medium of YouTube. It doesn’t even rise to the level of a clueless mainstream political reporter. Nevertheless, don’t correct him. Don’t set the record straight. Don’t provide him with any proof of what actually happened at all – and I know that literally hundreds of you have it in your possession. Just let his statement stand for the record.\nAnd keep it in mind the next time you ask me why I regard right-wing mediocrities like the Z-man with undisguised contempt and refuse to have anything to do with his kind. Many, if not most, of the so-called “grifters” he decries are not only smarter and harder-working than he is, they are more accomplished and far more worthy of your trust.\nMeanwhile, it’s good to see that others on the Right are discovering lawfare can be an effective way\nto strike back at the weaponized media\n:\nPeter Brimelow, an anti-immigration activist who hosts a website that has published the writings of white supremacists, is suing The New York Times for $5 million for labeling him an “open white nationalist” in an article last year.\nThe characterization of Brimelow that triggered the libel lawsuit appeared in a Jan. 15, 2019 article by Times political reporter Trip Gabriel that offered a chronology of racist and inflammatory comments by Rep. Steve King (R-Iowa)….\n“We stand by the story and will vigorously defend,” Times spokeswoman Eileen Murphy said.\nOne of these days, we’re going to have to put together a class action against Wikipedia and other media sites used to seed the never-ending slander and libel. This is a good time to go after the media because they no longer have the resources to defend themselves as both their circulations and their revenues are declining.\nUPDATE: This response by a Z-maniac is more than a little amusing, considering our complete lack of interest in what any of them happen to think about me or anything else:\nThis is how a cult leader reassures the faithful: Denigrate the faithless to instill self-righteous superiority within the cult so that they dismiss any counterclaims without thought. Real evidence is no longer necessary. A measured response is to link to evidence or acknowledge that a sealed arbitration leaves room for skepticism.\nNotice how the gammas always love to theorize and posture in the complete absence of information. They project their own lack of knowledge as well as their inability to not blurt out everything they know to everyone else. The idea that someone who genuinely possesses the conclusive evidence might not care what they believe is simply beyond their imagination. Sometimes the cult’s superiority is real. And as cults go, it’s quite affordable.\nI just thought this was an excellent opportunity to demonstrate to everyone who is in the know that an occasional anklebiter is both a fool and a liar. There is no need to prove it to those who are dumb enough to take him seriously; they will simply move the goalposts anyhow. If they mattered, we’d prove it to them. But they don’t.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-09-30T13:05:05+00:00"
}