{
  "url": "https://voxday.net/2020/01/01/traffic-report-2019/",
  "scraped_at": "2025-12-21T03:11:17.878558",
  "title": "Traffic report 2019",
  "date_display": "January 1, 2020",
  "date_iso": "2020-01-01T23:38:22+00:00",
  "date_from_url": "2020-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If 2018 was an unusually challenging year, 2019 was a year of almost non-stop crushing by the Evil Legion of Evil and the extended blog community. Like the previous year, it was full of deplatformings and bannings, disruptions and disqualifications. Unlike the previous year, it also saw the Legion striking back with a vengeance, including a resolution of the Indiegogo deplatforming and a multi-pronged replatforming campaign on behalf of the Big Bear and others directed at Patreon that is still in process.</p><p>And while 2019 unfortunately did not see the publication of <i>A Sea of Skulls</i>, it was witness to the creation of Castalia Deluxe and a stupendously successful campaign to bring the Junior Classics back into print. The Castalia crew also managed to get the 31+ hour audiobook for <i>A Throne of Bones</i> out, which was unexpectedly successful as more audiobooks were sold in five months than the ebook and print editions combined had sold in five years. And 2019 also saw the long-delayed publication of <i>Corporate Cancer</i>, which despite its short length was two years in the making.</p><p>In 2019, Vox Popoli had 32,757,068 Google pageviews. The blog is now running at an average rate of 89,745 daily pageviews, up a modest 1.5 percent from an average 88,384 last year. The running annual pageview totals are as follows:</p><p>2008: 3,496,757<br>2009: 4,414,801<br>2010: 4,827,183<br>2011: 5,422,628<br>2012: 6,098,774<br>2013: 9,340,663<br>2014: 11,236,085<br>2015: 16,211,875<br>2016: 25,817,343<br>2017: 31,216,357<br>2018: 32,260,094<br>2019: 32,757,068</br></br></br></br></br></br></br></br></br></br></br></p><p>I mentioned that readers should look for further advances on the video front in 2019, but I had absolutely no inkling of the massive enthusiasm that would greet the establishment of Unauthorized.TV. What started as a backup plan in the event of a possible YouTube deplatforming has somehow been transformed into one of the more significant activities in which we are involved. Unauthorized ended the year with 15,032 registered users while the Darkstream closed out 2019 with 33,484 subscribers and 698 channel members. And then, of course, there is the smashing success of the <i>Rebel’s Run</i> fundraising, about which you will no doubt hear considerably more in 2020, as well as SocialGalactic 2.0.</p><p>Thanks to everyone who continues to read VP and to everyone who supports one or more of the various penumbras that have emanated from it. Thanks especially to the Infogalactic Burn Unit, the Alt★Hero backers, the Castalia authors and volunteers, the Brainstorm crew (about which more in 2020), the Unauthorized subscribers, the Reprehensibles, the Replatformers, and the Arkhaven team, all of whom have come together in a spirit of creative cooperation to make these various projects viable. Your participation in these things is invaluable and very much appreciated, regardless of what form it takes. 2019 was a fantastic year. 2020 is going to be epic.</p><p>Sadly, due to the capitulation of John Scalzi, who apparently has given up posting no longer posts his blog traffic numbers, the comparison of VP’s annual traffic to that of the Most Popular Blog in Science Fiction is no longer possible. Sometimes victory is bittersweet.</p><p>Regardless, the ride never ends.</p><p>UPDATE: I am informed me that there were also 625,200 downloads of the podcast derived from the Darkstream in 2019, which was up from 500 downloads in 2018. I am skeptical that we can maintain that rate of growth in 2020, but then, you never know.</p></div>",
  "content_text": "If 2018 was an unusually challenging year, 2019 was a year of almost non-stop crushing by the Evil Legion of Evil and the extended blog community. Like the previous year, it was full of deplatformings and bannings, disruptions and disqualifications. Unlike the previous year, it also saw the Legion striking back with a vengeance, including a resolution of the Indiegogo deplatforming and a multi-pronged replatforming campaign on behalf of the Big Bear and others directed at Patreon that is still in process.\nAnd while 2019 unfortunately did not see the publication of\nA Sea of Skulls\n, it was witness to the creation of Castalia Deluxe and a stupendously successful campaign to bring the Junior Classics back into print. The Castalia crew also managed to get the 31+ hour audiobook for\nA Throne of Bones\nout, which was unexpectedly successful as more audiobooks were sold in five months than the ebook and print editions combined had sold in five years. And 2019 also saw the long-delayed publication of\nCorporate Cancer\n, which despite its short length was two years in the making.\nIn 2019, Vox Popoli had 32,757,068 Google pageviews. The blog is now running at an average rate of 89,745 daily pageviews, up a modest 1.5 percent from an average 88,384 last year. The running annual pageview totals are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,422,628\n2012: 6,098,774\n2013: 9,340,663\n2014: 11,236,085\n2015: 16,211,875\n2016: 25,817,343\n2017: 31,216,357\n2018: 32,260,094\n2019: 32,757,068\nI mentioned that readers should look for further advances on the video front in 2019, but I had absolutely no inkling of the massive enthusiasm that would greet the establishment of Unauthorized.TV. What started as a backup plan in the event of a possible YouTube deplatforming has somehow been transformed into one of the more significant activities in which we are involved. Unauthorized ended the year with 15,032 registered users while the Darkstream closed out 2019 with 33,484 subscribers and 698 channel members. And then, of course, there is the smashing success of the\nRebel’s Run\nfundraising, about which you will no doubt hear considerably more in 2020, as well as SocialGalactic 2.0.\nThanks to everyone who continues to read VP and to everyone who supports one or more of the various penumbras that have emanated from it. Thanks especially to the Infogalactic Burn Unit, the Alt★Hero backers, the Castalia authors and volunteers, the Brainstorm crew (about which more in 2020), the Unauthorized subscribers, the Reprehensibles, the Replatformers, and the Arkhaven team, all of whom have come together in a spirit of creative cooperation to make these various projects viable. Your participation in these things is invaluable and very much appreciated, regardless of what form it takes. 2019 was a fantastic year. 2020 is going to be epic.\nSadly, due to the capitulation of John Scalzi, who apparently has given up posting no longer posts his blog traffic numbers, the comparison of VP’s annual traffic to that of the Most Popular Blog in Science Fiction is no longer possible. Sometimes victory is bittersweet.\nRegardless, the ride never ends.\nUPDATE: I am informed me that there were also 625,200 downloads of the podcast derived from the Darkstream in 2019, which was up from 500 downloads in 2018. I am skeptical that we can maintain that rate of growth in 2020, but then, you never know.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-01-01T23:38:22+00:00"
}