{
  "url": "https://voxday.net/2022/08/04/depopulation-watch-north-dakota/",
  "scraped_at": "2026-01-08T13:26:40.969361",
  "title": "Depopulation Watch: North Dakota",
  "date_display": "August 4, 2022",
  "date_iso": "2022-08-04T11:42:25+00:00",
  "date_from_url": "2022-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong>Live Births</strong></p><ul class=\"wp-block-list\"><li>2020: 10,051</li><li>2021: 10,106</li><li>2022: 4,668 (through June 30)</li></ul><p>This means <a href=\"https://www.health.nd.gov/vital/vr-publications\">North Dakota</a> is on track this year for 9,336 live births, a 7.6 percent decline from the pre-vaxx average. Could be worse, but it’s not a good sign since it is further evidence that the vaxx inhibits human fertility, as has already been observed in Taiwan, Germany, and the United Kingdom.</p><p><strong>UPDATE:</strong> On a related front, stillbirths <a href=\"https://sheldonyakiwchuk.substack.com/p/86-stillbirths-in-waterloo-ontario?utm_source=email\">appear to have increased nearly 3,000 percent</a> over the last six months in Waterloo, Canada. All 86 mothers were reportedly vaccinated. This rise in stillbirths may account for a substantial portion of the observed fall in live births.</p><p><strong>UPDATE:</strong> Hawaii is on track for a 9.3 percent post-vaxx decline in the number of live births.</p><p><em><a href=\"https://social.infogalactic.com/micropost/55c67b2d-9d91-4aa9-a9d1-17723f2e88e7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Live Births\n2020: 10,051\n2021: 10,106\n2022: 4,668 (through June 30)\nThis means\nNorth Dakota\nis on track this year for 9,336 live births, a 7.6 percent decline from the pre-vaxx average. Could be worse, but it’s not a good sign since it is further evidence that the vaxx inhibits human fertility, as has already been observed in Taiwan, Germany, and the United Kingdom.\nUPDATE:\nOn a related front, stillbirths\nappear to have increased nearly 3,000 percent\nover the last six months in Waterloo, Canada. All 86 mothers were reportedly vaccinated. This rise in stillbirths may account for a substantial portion of the observed fall in live births.\nUPDATE:\nHawaii is on track for a 9.3 percent post-vaxx decline in the number of live births.\nDISCUSS ON SG",
  "tags": [
    "globalism",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-04T15:34:42+00:00"
}