{
  "url": "https://voxday.net/2022/08/23/herd-people/",
  "scraped_at": "2026-01-08T13:28:37.425922",
  "title": "Herd People",
  "date_display": "August 23, 2022",
  "date_iso": "2022-08-23T10:31:46+00:00",
  "date_from_url": "2022-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t matter how smart you are <a href=\"https://stevekirsch.substack.com/p/inside-the-mind-of-one-of-my-very\">if you are psychologically unable</a> to analyze anything outside of what previously recognized authorities have told you to believe:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I recently talked to a friend of mine at a recent social event. We’ll call him Bob. He’s super smart about most things. But when it comes to the vaccine, he’s blind to the truth.</p><p>He was bragging about how he has been vaxxed 6 times with the COVID vax and he’s perfectly healthy. He can’t wait for SB 866 in California to pass so when his kids turn 12, they can decide to get the vaccine over their mother’s objections.</p><p>Bob thinks I’m a nut case, cherry picking data. He says I used to be respected, but after turning anti-vax, people have lost all respect for me. He said I have a religious belief about the vaccine and I’m not driven by data.</p><p>What he isn’t telling anyone is that he’s been losing his vision ever since he got his first COVID vaccine. He used to have 20/20 vision, but now he wears glasses and can’t drive at night. When I brought up the data showing the connection between the shots and vision loss, he changed the topic.</p><p>I showed him two papers showing the more you vaccinate, the sicker you get (see the two papers here). I asked, “Where are the papers that show the opposite?” He ignored my request.</p><p>He gets his belief system from the mainstream media. Full stop. He reasons that if I was correct, surely Bill Gates would agree with me and admit they goofed. It’s 100% deference to authority.</p><p>Bob will not look at the data himself and he doesn’t want to discuss it. He will not engage. He thinks that if I was right, there would be more than a handful of people speaking out. So he tallies the size of the support base on each side of an issue instead of looking at the data.</p></blockquote><p>I pay literally zero attention to what Herd People say. They are easily identified, because their first concern is always optics. Furthermore, their defense of authorities is always <em>motivational</em>. If you point out that the evidence suggests that the government, or Bill Gates, or some other authority is lying, rather than consider the evidence, both damning and exculpatory, they will always ask why the observably dishonest party would choose to lie.</p><p>And, rather bizarrely, “because they are going to be rewarded with large sums of money” is never considered an acceptable explanation, even if the Herd Person is an economist and rational materialist who believes that all human action is derived from monetary interests.</p><p>Anyhow, if the Herd People are emotionally attached to an idea, that’s a pretty reliable indicator that the idea is false. And regardless, it would no more occur to me to take their programmed opinions into account than to consider what actual cows happen to think. There is literally nothing going on inside their heads that can be reasonably described as a “thought process”. It’s more of a “feelings process”.</p><p><strong>UPDATE:</strong> Consider <a href=\"https://www.dailymail.co.uk/news/article-11137063/Vladimir-praises-Russian-patriot-killed-car-bomb-amid-funeral-Putins-Rasputin-daughter.html\">the Ukrainian response</a> to Russian claims that a Ukrainian agent was responsible for the Darya Dugina assassination in light of this observation of Herd People behavior and the way in which they are programmed.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On the latest Russian reports, the bomb was attached to Dugin’s car inside his guarded compound. Ukraine focuses on military targets, unlike Russia, and there is no discernible gain in attacking one of Putin’s media puppets or allocating scarce operatives inside the Russian Federation to such a goal that is meaningless to the liberation of Ukraine.</p></blockquote><p>The defense is motivational rather than factual. Ergo, we can reasonably conclude that those offering it are knowingly lying.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1af1edf5-8be9-43b8-ae26-27c604fbbd2f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It doesn’t matter how smart you are\nif you are psychologically unable\nto analyze anything outside of what previously recognized authorities have told you to believe:\nI recently talked to a friend of mine at a recent social event. We’ll call him Bob. He’s super smart about most things. But when it comes to the vaccine, he’s blind to the truth.\nHe was bragging about how he has been vaxxed 6 times with the COVID vax and he’s perfectly healthy. He can’t wait for SB 866 in California to pass so when his kids turn 12, they can decide to get the vaccine over their mother’s objections.\nBob thinks I’m a nut case, cherry picking data. He says I used to be respected, but after turning anti-vax, people have lost all respect for me. He said I have a religious belief about the vaccine and I’m not driven by data.\nWhat he isn’t telling anyone is that he’s been losing his vision ever since he got his first COVID vaccine. He used to have 20/20 vision, but now he wears glasses and can’t drive at night. When I brought up the data showing the connection between the shots and vision loss, he changed the topic.\nI showed him two papers showing the more you vaccinate, the sicker you get (see the two papers here). I asked, “Where are the papers that show the opposite?” He ignored my request.\nHe gets his belief system from the mainstream media. Full stop. He reasons that if I was correct, surely Bill Gates would agree with me and admit they goofed. It’s 100% deference to authority.\nBob will not look at the data himself and he doesn’t want to discuss it. He will not engage. He thinks that if I was right, there would be more than a handful of people speaking out. So he tallies the size of the support base on each side of an issue instead of looking at the data.\nI pay literally zero attention to what Herd People say. They are easily identified, because their first concern is always optics. Furthermore, their defense of authorities is always\nmotivational\n. If you point out that the evidence suggests that the government, or Bill Gates, or some other authority is lying, rather than consider the evidence, both damning and exculpatory, they will always ask why the observably dishonest party would choose to lie.\nAnd, rather bizarrely, “because they are going to be rewarded with large sums of money” is never considered an acceptable explanation, even if the Herd Person is an economist and rational materialist who believes that all human action is derived from monetary interests.\nAnyhow, if the Herd People are emotionally attached to an idea, that’s a pretty reliable indicator that the idea is false. And regardless, it would no more occur to me to take their programmed opinions into account than to consider what actual cows happen to think. There is literally nothing going on inside their heads that can be reasonably described as a “thought process”. It’s more of a “feelings process”.\nUPDATE:\nConsider\nthe Ukrainian response\nto Russian claims that a Ukrainian agent was responsible for the Darya Dugina assassination in light of this observation of Herd People behavior and the way in which they are programmed.\nOn the latest Russian reports, the bomb was attached to Dugin’s car inside his guarded compound. Ukraine focuses on military targets, unlike Russia, and there is no discernible gain in attacking one of Putin’s media puppets or allocating scarce operatives inside the Russian Federation to such a goal that is meaningless to the liberation of Ukraine.\nThe defense is motivational rather than factual. Ergo, we can reasonably conclude that those offering it are knowingly lying.\nDISCUSS ON SG",
  "tags": [
    "media",
    "philosophy",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-23T11:38:34+00:00"
}