{
  "url": "https://voxday.net/2022/08/26/proxy-war-2-0/",
  "scraped_at": "2026-01-08T13:28:55.719145",
  "title": "Proxy War 2.0",
  "date_display": "August 26, 2022",
  "date_iso": "2022-08-26T12:54:15+00:00",
  "date_from_url": "2022-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ukraine is a proxy war between the USA and Russia and everyone knows it, including, most importantly, <a href=\"https://www.globaltimes.cn/page/202208/1273543.shtml?id=11\">the Chinese</a>. They also know that Taiwan is anticipated to be the next proxy war, which is why I expect Chairman Xi, who according to Lee Kwan Yew is the most intelligent senior actor on the international scene, to work out a peaceful alternative to shedding large quantities of Chinese blood on behalf of US neocons.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>GLOBAL TIMES:</strong> Some argue that the US wants to use Taiwan as a “porcupine” and is ready to fight to the last drop of Taiwan people’s blood to weaken China just as what it did with Ukrainians. How do you view such an opinion? Does the US have such intent?</p><p><strong>Berletic:</strong> This is actually the most likely scenario – using Taiwan as a proxy against the rest of China to exhaust it politically, economically, and militarily. The US is indeed conducting a similar proxy conflict against Russia through Ukraine. Many aspects of US interference in regards to Taiwan including political and military support, mirror what preceded the conflict now raging in Ukraine. The US deliberately picked a red line to Russia in regards to Ukraine and is now doing the same to China in regards to Taiwan. The US demonstrably doesn’t care about Taiwan’s future in any sense and has already begun preparing itself in terms of semiconductor production for a disruption in Taiwan Washington itself is attempting to create. The US will do everything in its power to realize this provocation by crossing red lines for China it knows cannot be ignored.</p><p><strong><strong>GLOBAL TIMES:</strong></strong> Is there a trend that Washington is shifting from strategic ambiguity toward Taiwan to strategic clarity? Is this an adventurous move?</p><p><strong>Berletic:</strong> The shift in Washington is one born out of desperation rather than adventurism. The US is out of time. China’s economic and military rise means that as each year goes by the US is less and less able to hold any sort of advantage over China should it provoke a conflict either directly or by proxy.</p></blockquote><p>Empires are increasingly prone to fighting proxy wars in their final stages, because they simply do not possess the military might that was required to establish the empire in the first place. And they avoid direct confrontation for fear that they will be defeated; it’s much easier to spin and create separation from a proxy defeat than from a direct one. This foreign policy on the part of the empire’s foreign rulers is absolutely pro forma; history suggests that one should expect a domestic crackdown on regime critics to accompany the proxy wars that will almost certainly end in defeat.</p><p><em><a href=\"https://social.infogalactic.com/micropost/13c56403-d9ac-4e32-83e3-dcf60ea33ab9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Ukraine is a proxy war between the USA and Russia and everyone knows it, including, most importantly,\nthe Chinese\n. They also know that Taiwan is anticipated to be the next proxy war, which is why I expect Chairman Xi, who according to Lee Kwan Yew is the most intelligent senior actor on the international scene, to work out a peaceful alternative to shedding large quantities of Chinese blood on behalf of US neocons.\nGLOBAL TIMES:\nSome argue that the US wants to use Taiwan as a “porcupine” and is ready to fight to the last drop of Taiwan people’s blood to weaken China just as what it did with Ukrainians. How do you view such an opinion? Does the US have such intent?\nBerletic:\nThis is actually the most likely scenario – using Taiwan as a proxy against the rest of China to exhaust it politically, economically, and militarily. The US is indeed conducting a similar proxy conflict against Russia through Ukraine. Many aspects of US interference in regards to Taiwan including political and military support, mirror what preceded the conflict now raging in Ukraine. The US deliberately picked a red line to Russia in regards to Ukraine and is now doing the same to China in regards to Taiwan. The US demonstrably doesn’t care about Taiwan’s future in any sense and has already begun preparing itself in terms of semiconductor production for a disruption in Taiwan Washington itself is attempting to create. The US will do everything in its power to realize this provocation by crossing red lines for China it knows cannot be ignored.\nGLOBAL TIMES:\nIs there a trend that Washington is shifting from strategic ambiguity toward Taiwan to strategic clarity? Is this an adventurous move?\nBerletic:\nThe shift in Washington is one born out of desperation rather than adventurism. The US is out of time. China’s economic and military rise means that as each year goes by the US is less and less able to hold any sort of advantage over China should it provoke a conflict either directly or by proxy.\nEmpires are increasingly prone to fighting proxy wars in their final stages, because they simply do not possess the military might that was required to establish the empire in the first place. And they avoid direct confrontation for fear that they will be defeated; it’s much easier to spin and create separation from a proxy defeat than from a direct one. This foreign policy on the part of the empire’s foreign rulers is absolutely pro forma; history suggests that one should expect a domestic crackdown on regime critics to accompany the proxy wars that will almost certainly end in defeat.\nDISCUSS ON SG",
  "tags": [
    "China",
    "neocons",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-26T12:54:18+00:00"
}