{
  "url": "https://voxday.net/2022/08/18/summa-speculatica/",
  "scraped_at": "2026-01-08T13:28:09.921886",
  "title": "Summa Speculatica",
  "date_display": "August 18, 2022",
  "date_iso": "2022-08-18T14:48:00+00:00",
  "date_from_url": "2022-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>My aversion for theology, particularly of the modern sort, is well-known here. But that aversion has never extended to St. Thomas Aquinas, whom I admire enormously, and as I was reading selections from his Summa Theologica, as I do on occasion, I thought it might be interesting to consider my own thoughts on his various positions. So, I returned to the beginning, which is the ten articles on the nature and extent of sacred doctrine. </em></p><p>I answered them – my answers are in italics – prior to re-reading his answers, so as not to compromise my own reactions.</p><p>To place our purpose within proper limits, we first endeavor to investigate the nature and extent of this sacred doctrine. Concerning this there are ten points of inquiry:</p><p>(1) Whether it is necessary?<em> YES</em></p><p>(2) Whether it is a science?<em> YES, although not as science is presently defined by post-modernity or in the scientodic sense.</em></p><p>(3) Whether it is one or many? <em> ONE, in the sense of true Sacred Doctrine. Of course, there are many false sacred doctrines.</em></p><p>(4) Whether it is speculative or practical? <em> PRACTICAL, albeit with speculative consequences.</em></p><p>(5) How it is compared with other sciences? <em>UNFAVORABLY in the modern context. I assume Aquinas is viewing it from the “Queen of Sciences” perspective here, but I could be wrong.</em></p><p>(6) Whether it is the same as wisdom? <em>NO</em></p><p>(7) Whether God is its subject-matter?<em> YES</em></p><p>(8) Whether it is a matter of argument?<em> YES</em></p><p>(9) Whether it rightly employs metaphors and similes?<em> YES</em></p><p>(10) Whether the Sacred Scripture of this doctrine may be expounded in different senses?<em> YES</em></p><p><em>I’ll compare my answers with the Great Ox’s and attempt to ascertain where I went awry in a future post.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/e7d3e099-b64a-49cf-80f1-095845bd2f15\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "My aversion for theology, particularly of the modern sort, is well-known here. But that aversion has never extended to St. Thomas Aquinas, whom I admire enormously, and as I was reading selections from his Summa Theologica, as I do on occasion, I thought it might be interesting to consider my own thoughts on his various positions. So, I returned to the beginning, which is the ten articles on the nature and extent of sacred doctrine.\nI answered them – my answers are in italics – prior to re-reading his answers, so as not to compromise my own reactions.\nTo place our purpose within proper limits, we first endeavor to investigate the nature and extent of this sacred doctrine. Concerning this there are ten points of inquiry:\n(1) Whether it is necessary?\nYES\n(2) Whether it is a science?\nYES, although not as science is presently defined by post-modernity or in the scientodic sense.\n(3) Whether it is one or many?\nONE, in the sense of true Sacred Doctrine. Of course, there are many false sacred doctrines.\n(4) Whether it is speculative or practical?\nPRACTICAL, albeit with speculative consequences.\n(5) How it is compared with other sciences?\nUNFAVORABLY in the modern context. I assume Aquinas is viewing it from the “Queen of Sciences” perspective here, but I could be wrong.\n(6) Whether it is the same as wisdom?\nNO\n(7) Whether God is its subject-matter?\nYES\n(8) Whether it is a matter of argument?\nYES\n(9) Whether it rightly employs metaphors and similes?\nYES\n(10) Whether the Sacred Scripture of this doctrine may be expounded in different senses?\nYES\nI’ll compare my answers with the Great Ox’s and attempt to ascertain where I went awry in a future post.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-18T15:02:27+00:00"
}