{
  "url": "https://voxday.net/2022/08/12/the-twa-800-coverup/",
  "scraped_at": "2026-01-08T13:27:25.996693",
  "title": "The TWA 800 Coverup",
  "date_display": "August 12, 2022",
  "date_iso": "2022-08-12T15:18:04+00:00",
  "date_from_url": "2022-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This “conspiracy theory” has been so obvious for so long that it won’t surprise anyone to learn that US Navy personnel who were on the scene have confirmed that the US Navy <a href=\"https://www.americanthinker.com/articles/2022/08/the_twa_800_whistleblower_is_legit.html\">shot down the passenger plane</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On the evening of July 17, 1996, as Teele relates, the <em>Carr </em>was trying out new AN/SPY-1 Alpha radar as well as new AN/SPS 49 radar. For this simulated air attack, the target was to be a drone pulled by a military aircraft using a thousand-or-so foot chain. Teele was among the personnel monitoring this activity from within the ship’s combat information center (CIC).</p><p>In its November 1997 summary the FBI acknowledged that three submarines — the USS <em>Normandy</em>, the USS <em>Trepang</em>, and the USS <em>Albuquerque </em>— were in the “immediate vicinity of the crash site.” So too, said the FBI, were an Aegis cruiser, and a US Navy P-3 Orion. The P-3, in fact, just happened to be flying about seven thousand feet above TWA 800 when the plane was blown out of the sky.</p><p>Teele puts the USS <em>Carr </em>in this group as well. Although he has not said so publicly, Teele strongly believes that the USS <em>Leyte Gulf</em>, another Ticonderoga-class guided missile cruiser, was involved. With Teele confirming there was a drone in the mix, the U.S. Navy had all the “combatants” needed for a Cooperative Engagement Capability (CEC) missile test.</p><p>In 1996, the Navy was in the process of introducing this enormously complex system. The CEC was created to integrate the information coming from each of the combatant’s sensors — range, bearing, elevation, Doppler updates etc. — and feed the integrated picture back to the individual combatants. In the CEC live-fire tests, which began as early as 1994 in Puerto Rico, drones played the role of “unknown assumed enemy.” The P-3’s role was to relay data among the various units involved. In this way, as Teele explains, one ship could track the assumed enemy, and another ship could fire.</p><p>Teele describes the assumed enemy as a “low, slow flier flying toward us.” The tragedy that followed would likely have been averted had not air traffic control held the Paris-bound TWA 800 at 13,700 feet to allow US Air 217 heading north to pass safely overhead. “I believe we jumped the gun,” said Teele. “We had a track on a contact that came out that fit the profile that we were given.” TWA 800 became the “assumed enemy.” Says Teele, “It matched the drill.”</p><p>Two missiles were fired. Over his headset, Teele heard the announcement, “Birds away.” A few minutes later, he heard “Splash,” meaning the missiles had hit the target. Soon after that, he heard someone say, “Wo, wo, wo.” And another person added, “Wait a minute. We hit an Airbus.”</p><p>In fact, eight years earlier, at the tail end of the Iran-Iraq War, an Aegis cruiser, the USS <em>Vincennes</em>, fired two Standard Missiles at a commercial Iranian Airbus, IR 655. IR 655 had reached 13,500 feet, a final altitude almost identical to TWA 800’s. Capt. Will Rogers III gave the order to fire. Rogers and his crew had mistaken the ascending passenger jet with 290 people on board for a descending Iranian F-14, a fighter plane. Stuff happens.</p><p>The stuff that happened on the night of July 17, 1996 outraged Teele’s CO, Captain Wray. “These have got to be the dumbest idiots I’ve ever seen in my life,” Teele remembers Wray as saying. “How do you accidentally fire a missile? You don’t know the color of missiles? One is blue. One is white. Blue mean training. White means live. You’ve got to be stupid to put a white on the rail.” Although his memory as to which ship was responsible is admittedly uncertain, Teele believes it was the <em>Leyte Gulf</em>.</p><p>Despite the long-established mandate that neighboring ships rush to the scene of an accident, the <em>Carr </em>turned tail and headed out to sea “at top speed.” Teele’s leading petty officer made it so clear that he was to say nothing of what he saw or heard. He then issued the order, “Pull the RD390 tapes, close all positional log books, including the bridges, tape them and leave them on the DRT table!”</p><p>The documents were then taken to a place called the “shred room” where they were destroyed using salt water and a shredder. “We ran to Bermuda where we were not allowed to leave the ship, no phone calls, emails secured, and nothing was to be discussed!” says Teele. “Everyone that was involved was told in CIC, ‘This didn’t happen!’” As far as the major media are concerned, it never did.</p></blockquote><p>Of course, given what we now know about government-related incidents, the more serious question isn’t whether the US Navy shot down TWA 800 or not, but whether the firing of the live missile at the airliner was intentional or accidental.</p><p>In the post-vaxx era, <em>argumentum ad incredulitatem</em> is no longer viable. Because now we all know, beyond any shadow of a doubt, that U.S. government employees are absolutely capable of doing something like that.</p><p><em><a href=\"https://social.infogalactic.com/micropost/103a591f-906f-45dd-9ee3-2afad875e60a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This “conspiracy theory” has been so obvious for so long that it won’t surprise anyone to learn that US Navy personnel who were on the scene have confirmed that the US Navy\nshot down the passenger plane\n:\nOn the evening of July 17, 1996, as Teele relates, the\nCarr\nwas trying out new AN/SPY-1 Alpha radar as well as new AN/SPS 49 radar. For this simulated air attack, the target was to be a drone pulled by a military aircraft using a thousand-or-so foot chain. Teele was among the personnel monitoring this activity from within the ship’s combat information center (CIC).\nIn its November 1997 summary the FBI acknowledged that three submarines — the USS\nNormandy\n, the USS\nTrepang\n, and the USS\nAlbuquerque\n— were in the “immediate vicinity of the crash site.” So too, said the FBI, were an Aegis cruiser, and a US Navy P-3 Orion. The P-3, in fact, just happened to be flying about seven thousand feet above TWA 800 when the plane was blown out of the sky.\nTeele puts the USS\nCarr\nin this group as well. Although he has not said so publicly, Teele strongly believes that the USS\nLeyte Gulf\n, another Ticonderoga-class guided missile cruiser, was involved. With Teele confirming there was a drone in the mix, the U.S. Navy had all the “combatants” needed for a Cooperative Engagement Capability (CEC) missile test.\nIn 1996, the Navy was in the process of introducing this enormously complex system. The CEC was created to integrate the information coming from each of the combatant’s sensors — range, bearing, elevation, Doppler updates etc. — and feed the integrated picture back to the individual combatants. In the CEC live-fire tests, which began as early as 1994 in Puerto Rico, drones played the role of “unknown assumed enemy.” The P-3’s role was to relay data among the various units involved. In this way, as Teele explains, one ship could track the assumed enemy, and another ship could fire.\nTeele describes the assumed enemy as a “low, slow flier flying toward us.” The tragedy that followed would likely have been averted had not air traffic control held the Paris-bound TWA 800 at 13,700 feet to allow US Air 217 heading north to pass safely overhead. “I believe we jumped the gun,” said Teele. “We had a track on a contact that came out that fit the profile that we were given.” TWA 800 became the “assumed enemy.” Says Teele, “It matched the drill.”\nTwo missiles were fired. Over his headset, Teele heard the announcement, “Birds away.” A few minutes later, he heard “Splash,” meaning the missiles had hit the target. Soon after that, he heard someone say, “Wo, wo, wo.” And another person added, “Wait a minute. We hit an Airbus.”\nIn fact, eight years earlier, at the tail end of the Iran-Iraq War, an Aegis cruiser, the USS\nVincennes\n, fired two Standard Missiles at a commercial Iranian Airbus, IR 655. IR 655 had reached 13,500 feet, a final altitude almost identical to TWA 800’s. Capt. Will Rogers III gave the order to fire. Rogers and his crew had mistaken the ascending passenger jet with 290 people on board for a descending Iranian F-14, a fighter plane. Stuff happens.\nThe stuff that happened on the night of July 17, 1996 outraged Teele’s CO, Captain Wray. “These have got to be the dumbest idiots I’ve ever seen in my life,” Teele remembers Wray as saying. “How do you accidentally fire a missile? You don’t know the color of missiles? One is blue. One is white. Blue mean training. White means live. You’ve got to be stupid to put a white on the rail.” Although his memory as to which ship was responsible is admittedly uncertain, Teele believes it was the\nLeyte Gulf\n.\nDespite the long-established mandate that neighboring ships rush to the scene of an accident, the\nCarr\nturned tail and headed out to sea “at top speed.” Teele’s leading petty officer made it so clear that he was to say nothing of what he saw or heard. He then issued the order, “Pull the RD390 tapes, close all positional log books, including the bridges, tape them and leave them on the DRT table!”\nThe documents were then taken to a place called the “shred room” where they were destroyed using salt water and a shredder. “We ran to Bermuda where we were not allowed to leave the ship, no phone calls, emails secured, and nothing was to be discussed!” says Teele. “Everyone that was involved was told in CIC, ‘This didn’t happen!’” As far as the major media are concerned, it never did.\nOf course, given what we now know about government-related incidents, the more serious question isn’t whether the US Navy shot down TWA 800 or not, but whether the firing of the live missile at the airliner was intentional or accidental.\nIn the post-vaxx era,\nargumentum ad incredulitatem\nis no longer viable. Because now we all know, beyond any shadow of a doubt, that U.S. government employees are absolutely capable of doing something like that.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-12T15:19:39+00:00"
}