{
  "url": "https://voxday.net/2022/08/22/the-cost-of-broken-neutrality/",
  "scraped_at": "2026-01-08T13:28:30.439703",
  "title": "The Cost of Broken Neutrality",
  "date_display": "August 22, 2022",
  "date_iso": "2022-08-22T10:05:33+00:00",
  "date_from_url": "2022-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An influential Swiss businessman <a href=\"https://www.srf.ch/news/regional/zuerich-schaffhausen/nach-blocher-uebernahme-winterthurer-zeitung-schlaegt-svp-kurs-ein\">points out to the Swiss</a> that their government’s abandonment of their historica neutrality means that they are responsible, in part, for the enemies on the other side that are killed in the war to which Switzerland is now a party.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the <em>Tages-Anzeiger</em> I read about the tragic fate of bloody young Russian soldiers who died in the Ukraine war.</p><p>The title reads: “These teenagers died for Putin on the battlefield”. We suffer through words and pictures as hopeful eighteen- to twenty-year-old boys perished in the fighting in eastern Ukraine. Or, as a data analysis shows, “who gives his life for the Kremlin ruler”.</p><p>Their names are Eduard, Maxim, Boris or Chan-Tsaj and they often come from poor areas. And they leave behind grieving parents, siblings, and sometimes even wives and children. We see how a deceased person is honored, for example, at a school memorial service – namely by a “lectern of the hero”. Or a funeral service with relatives and friends walking behind the coffin, military personnel in goose step and a band playing a funeral march.</p><p>It goes to the heart and hurts. That many young soldiers die is the truth. On both sides.</p><p>But only part of the truth – only half the truth. Because in view of the fallen Russian teenage soldiers, one should also ask the question: Why are they dead? Someone must have killed them.</p><p>And that brings us to the other side of the coin: As in any war, two parties are fighting. The young Russian soldiers were killed by Ukrainian soldiers. They, in turn, are armed by the West, mainly by the US, but also by the EU. Even with the support of neutral Switzerland, which broke Swiss neutrality and is thus a party to the war. It helps that bloody young Russian soldiers have to die. For example Eduard, Maxim, Boris or Chan-Tsaj. Why did Switzerland get involved here?</p></blockquote><p>Needless to say, various pro-war media and government figures <a href=\"https://www.rt.com/news/561261-swiss-minister-blame-west-ukraine/\">just about lost their little minds</a> at Blocher’s observation of the undeniable.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Blocher’s piece was met with an angry response by Swiss media and politicians, who blasted him for not saying “who started the war.” “He doesn’t say a word about the fact that Ukraine was attacked by Russia and is defending itself, that Putin started the war,” the <em>Switzerland Times</em> wrote.</p><p>Swiss <em>Watson </em>news outlet called Blocher’s column “bizarre” and accused the former minister of “ignoring Russian war crimes.” According to the outlet, Blocher is currently working on an initiative that would compel Bern to not only refrain from participating in conflicts outside of its territory, but avoid imposing economic sanctions in such cases as well.</p><p>MP Philipp Matthias Bregy, the head of the Center party’s parliamentary group, accused Blocher of distorting history, and said the former minister himself told a “half-truth” by “ignoring the aggressor.”</p><p>Andrea Caroni, the vice president of the Swiss Liberals, claimed Blocher is playing into the hands of the Kremlin. “Putin does not need a propaganda minister anymore,” he told Swiss newspaper Sonntagszeitung. “Blocher does it for free.”</p></blockquote><p>All of this is just meaningless rhetorical posturing thrown out to obfuscate the correct, and vital, point that Blocher has made. <em>It doesn’t matter who started the war.</em> It doesn’t matter who is winning or who is losing. It doesn’t matter who has, or has not, committed war crimes. It doesn’t matter who was the aggressor. Rightly or wrongly, it cannot be denied that <em>Switzerland chose to take a side</em>, that it is now a party to the war, and therefore, it is responsible – and it will be held responsible by its enemies – for what happens to the people and the military forces of those enemies.</p><p>There are no shortage of various aspects of the current situation that can be reasonably argued. Did the war start in 2014 or in 2022? Should the people of Crimea and Donbass be permitted democratic self-determination? Was the Crimean referendum legitimate and fair? Are the Ukranians actually winning the war or are they losing it? Are the Russians justified in launching attacks on what President Putin describes as the “decision centers” of the nations waging war against them? Should the Swiss government prioritize the well-being of the Swiss people or its promises to the EU member-states? All of these things can be debated by reasonable observers.</p><p>But what cannot be argued – although I expect it will be, to very little avail, in the future – is that the Swiss government broke its historic neutrality and made the uncharacteristic choice to side with the Ukro-NATO alliance in its war against Russia and its allies.</p><p>In doing so, Switzerland has foolishly risked far more than one cold and dark winter without Russian natural gas. It also risks its relationships with the vast majority of nations around the world who have clearly taken the side of Russia despite – or in some cases, because of – US pressure to join the NATO sanctions regime.</p><p>This is a world war. It will expand to Asia soon. It may expand to the Middle East and South America as well. Does Switzerland really wish to find itself at war with Brazil, China, India, Iran, and Saudi Arabia, as well as Russia? Do the Swiss people really wish to discover what will happen to their economy when it is sanctioned by all of those nations? Because that is exactly what will happen if they does not hasten to extricate themselves from the foolish foreign policy of their existing government.</p><p>At this point, the only intelligent move for the Swiss people is for them to pass a referendum restoring their historic neutrality and <em>absolutely forbidding</em> any future Swiss government from similarly putting the nation at risk of both military assault and economic isolation from the majority of the nations of the world by taking one side against another.</p><p><em><a href=\"https://social.infogalactic.com/micropost/644491ab-443d-46d4-858a-ab0cdc753495\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An influential Swiss businessman\npoints out to the Swiss\nthat their government’s abandonment of their historica neutrality means that they are responsible, in part, for the enemies on the other side that are killed in the war to which Switzerland is now a party.\nIn the\nTages-Anzeiger\nI read about the tragic fate of bloody young Russian soldiers who died in the Ukraine war.\nThe title reads: “These teenagers died for Putin on the battlefield”. We suffer through words and pictures as hopeful eighteen- to twenty-year-old boys perished in the fighting in eastern Ukraine. Or, as a data analysis shows, “who gives his life for the Kremlin ruler”.\nTheir names are Eduard, Maxim, Boris or Chan-Tsaj and they often come from poor areas. And they leave behind grieving parents, siblings, and sometimes even wives and children. We see how a deceased person is honored, for example, at a school memorial service – namely by a “lectern of the hero”. Or a funeral service with relatives and friends walking behind the coffin, military personnel in goose step and a band playing a funeral march.\nIt goes to the heart and hurts. That many young soldiers die is the truth. On both sides.\nBut only part of the truth – only half the truth. Because in view of the fallen Russian teenage soldiers, one should also ask the question: Why are they dead? Someone must have killed them.\nAnd that brings us to the other side of the coin: As in any war, two parties are fighting. The young Russian soldiers were killed by Ukrainian soldiers. They, in turn, are armed by the West, mainly by the US, but also by the EU. Even with the support of neutral Switzerland, which broke Swiss neutrality and is thus a party to the war. It helps that bloody young Russian soldiers have to die. For example Eduard, Maxim, Boris or Chan-Tsaj. Why did Switzerland get involved here?\nNeedless to say, various pro-war media and government figures\njust about lost their little minds\nat Blocher’s observation of the undeniable.\nBlocher’s piece was met with an angry response by Swiss media and politicians, who blasted him for not saying “who started the war.” “He doesn’t say a word about the fact that Ukraine was attacked by Russia and is defending itself, that Putin started the war,” the\nSwitzerland Times\nwrote.\nSwiss\nWatson\nnews outlet called Blocher’s column “bizarre” and accused the former minister of “ignoring Russian war crimes.” According to the outlet, Blocher is currently working on an initiative that would compel Bern to not only refrain from participating in conflicts outside of its territory, but avoid imposing economic sanctions in such cases as well.\nMP Philipp Matthias Bregy, the head of the Center party’s parliamentary group, accused Blocher of distorting history, and said the former minister himself told a “half-truth” by “ignoring the aggressor.”\nAndrea Caroni, the vice president of the Swiss Liberals, claimed Blocher is playing into the hands of the Kremlin. “Putin does not need a propaganda minister anymore,” he told Swiss newspaper Sonntagszeitung. “Blocher does it for free.”\nAll of this is just meaningless rhetorical posturing thrown out to obfuscate the correct, and vital, point that Blocher has made.\nIt doesn’t matter who started the war.\nIt doesn’t matter who is winning or who is losing. It doesn’t matter who has, or has not, committed war crimes. It doesn’t matter who was the aggressor. Rightly or wrongly, it cannot be denied that\nSwitzerland chose to take a side\n, that it is now a party to the war, and therefore, it is responsible – and it will be held responsible by its enemies – for what happens to the people and the military forces of those enemies.\nThere are no shortage of various aspects of the current situation that can be reasonably argued. Did the war start in 2014 or in 2022? Should the people of Crimea and Donbass be permitted democratic self-determination? Was the Crimean referendum legitimate and fair? Are the Ukranians actually winning the war or are they losing it? Are the Russians justified in launching attacks on what President Putin describes as the “decision centers” of the nations waging war against them? Should the Swiss government prioritize the well-being of the Swiss people or its promises to the EU member-states? All of these things can be debated by reasonable observers.\nBut what cannot be argued – although I expect it will be, to very little avail, in the future – is that the Swiss government broke its historic neutrality and made the uncharacteristic choice to side with the Ukro-NATO alliance in its war against Russia and its allies.\nIn doing so, Switzerland has foolishly risked far more than one cold and dark winter without Russian natural gas. It also risks its relationships with the vast majority of nations around the world who have clearly taken the side of Russia despite – or in some cases, because of – US pressure to join the NATO sanctions regime.\nThis is a world war. It will expand to Asia soon. It may expand to the Middle East and South America as well. Does Switzerland really wish to find itself at war with Brazil, China, India, Iran, and Saudi Arabia, as well as Russia? Do the Swiss people really wish to discover what will happen to their economy when it is sanctioned by all of those nations? Because that is exactly what will happen if they does not hasten to extricate themselves from the foolish foreign policy of their existing government.\nAt this point, the only intelligent move for the Swiss people is for them to pass a referendum restoring their historic neutrality and\nabsolutely forbidding\nany future Swiss government from similarly putting the nation at risk of both military assault and economic isolation from the majority of the nations of the world by taking one side against another.\nDISCUSS ON SG",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-22T10:05:35+00:00"
}