{
  "url": "https://voxday.net/2022/08/16/the-quantum-editing-hypothesis/",
  "scraped_at": "2026-01-08T13:27:55.416453",
  "title": "The Quantum Editing Hypothesis",
  "date_display": "August 16, 2022",
  "date_iso": "2022-08-16T15:10:55+00:00",
  "date_from_url": "2022-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of Christians are, quite understandably, deeply appalled at the idea that Satan can not only quote Scripture and inspire the publication of false and misleading Scriptures, but can even <em>ex post facto</em> alter the historical texts. However, 2 Thessalonians appears to suggest that in the rebellion that follows the exit of the Restrainer, the man of lawlessness will “exalt himself over everything that is called God”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Concerning the coming of our Lord Jesus Christ and our being gathered to him, we ask you, brothers and sisters, not to become easily unsettled or alarmed by the teaching allegedly from us—whether by a prophecy or by word of mouth or by letter—asserting that the day of the Lord has already come. Don’t let anyone deceive you in any way, for that day will not come until the rebellion occurs and the man of lawlessness is revealed, the man doomed to destruction. He will oppose and will exalt himself over everything that is called God or is worshipped, so that he sets himself up in God’s temple, proclaiming himself to be God.</p></blockquote><p>Does this include “the Word of God” in the context of the physical texts of the Bible? It’s not conclusive, but it certainly would appear to be a potentially viable interpretation, particularly when all of the Christian organizations that supposedly represent “the Bride of Christ” have observably prostrated themselves before the spirit of evil.</p><p>And we know that God’s words can be perverted. Are you so absolutely certain that you know the limits to which it can be done?</p><p><em>Every man’s word shall be his burden; for ye have perverted the words of the living God, of the Lord of hosts our God.</em> – Jeremiah 23:36</p><p>This is not an opinion. This is merely observation and hypothesis. Perhaps the Mandela Effect skeptics are completely correct and nothing has ever changed in any text or corporate logo despite our unreliable childhood memories of something having been different in the past. But the hypothesis is important, because it provides a predictive model concerning the possibility of future, more spiritually significant alterations.</p><p>Here is why I would caution those who insist upon the absolute impossibility of any such changes – and I freely admit that they <em>are</em>, to the best of my understanding, absolutely impossible. Anyone who is armed by the awareness of the possibility of quantum editing is unlikely to be deceived, whereas those who insist upon the eternal immutability of the text under any and all circumstances will find it very hard to avoid being deceived.</p><p>Note for the midwits: don’t even start with your ridiculous “X can’t be Y, because that would mean Z isn’t Z” illogic. In fact, please just excise the whole binary “if-then” routine from your repertoire. The subject is observably beyond you.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c968183d-69f2-4691-9e66-20ceebbc83b7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A number of Christians are, quite understandably, deeply appalled at the idea that Satan can not only quote Scripture and inspire the publication of false and misleading Scriptures, but can even\nex post facto\nalter the historical texts. However, 2 Thessalonians appears to suggest that in the rebellion that follows the exit of the Restrainer, the man of lawlessness will “exalt himself over everything that is called God”.\nConcerning the coming of our Lord Jesus Christ and our being gathered to him, we ask you, brothers and sisters, not to become easily unsettled or alarmed by the teaching allegedly from us—whether by a prophecy or by word of mouth or by letter—asserting that the day of the Lord has already come. Don’t let anyone deceive you in any way, for that day will not come until the rebellion occurs and the man of lawlessness is revealed, the man doomed to destruction. He will oppose and will exalt himself over everything that is called God or is worshipped, so that he sets himself up in God’s temple, proclaiming himself to be God.\nDoes this include “the Word of God” in the context of the physical texts of the Bible? It’s not conclusive, but it certainly would appear to be a potentially viable interpretation, particularly when all of the Christian organizations that supposedly represent “the Bride of Christ” have observably prostrated themselves before the spirit of evil.\nAnd we know that God’s words can be perverted. Are you so absolutely certain that you know the limits to which it can be done?\nEvery man’s word shall be his burden; for ye have perverted the words of the living God, of the Lord of hosts our God.\n– Jeremiah 23:36\nThis is not an opinion. This is merely observation and hypothesis. Perhaps the Mandela Effect skeptics are completely correct and nothing has ever changed in any text or corporate logo despite our unreliable childhood memories of something having been different in the past. But the hypothesis is important, because it provides a predictive model concerning the possibility of future, more spiritually significant alterations.\nHere is why I would caution those who insist upon the absolute impossibility of any such changes – and I freely admit that they\nare\n, to the best of my understanding, absolutely impossible. Anyone who is armed by the awareness of the possibility of quantum editing is unlikely to be deceived, whereas those who insist upon the eternal immutability of the text under any and all circumstances will find it very hard to avoid being deceived.\nNote for the midwits: don’t even start with your ridiculous “X can’t be Y, because that would mean Z isn’t Z” illogic. In fact, please just excise the whole binary “if-then” routine from your repertoire. The subject is observably beyond you.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-16T15:36:49+00:00"
}