{
  "url": "https://voxday.net/2022/08/28/the-death-of-davos-man/",
  "scraped_at": "2026-01-08T13:29:08.693978",
  "title": "The Death of Davos Man",
  "date_display": "August 28, 2022",
  "date_iso": "2022-08-28T13:17:48+00:00",
  "date_from_url": "2022-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The postmodernist econo-cultural vision of Europe has failed abysmally, as the ambitions of its architects were always based on false foundations and vastly exceeded their capabilities. More than four-fifths of the world has rejected their evil vision; the active resistance to it has barely even begun to take form. But it is already clear that there will be no Great Reset, and the global imperialists who believed they were destined to rule the world and own everything in it will be lucky to survive the series of regime changes over the next decade that are among <a href=\"https://thesaker.is/all-the-way-to-odessa/\">the probable consequences of the Euro-Russian War</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The leadership in Moscow is making it very clear, to internal and international audiences, the new deal consists in slow cooking the Kiev racket inside a massive cauldron while polishing its status of financial black hole for the collective West. Until we reach boiling point – which will be a revolution or a putsch.</p><p>In parallel, The Lords of (Proxy) War will continue with their own strategy, which is to pillage an enfeebled, fearful, Europe, then dressing it up as a perfumed colony to be ruthlessly exploited ad nauseam by the imperial oligarchy.</p><p>Europe is now a runaway TGV – minus the requisite Hollywood production values. Assuming it does not veer off track – a dicey proposition – it may eventually arrive at a railway station called Agenda 2030, The Great Narrative, or some other NATO/Davos denomination du jour.</p><p>As it stands, what’s remarkable is how the “marginal” Russian economy hardly broke a sweat to “end the abundance” of the wealthiest region on the planet.</p><p>Moscow does not even entertain the notion of negotiating with Brussels because there’s nothing to negotiate – considering puny Eurocrats will only be hurled away from their zombified state when the dire socio-economic consequences of “the end of abundance” will finally translate into peasants with pitchforks roaming the continent.</p><p>It may be eons away, but inevitably the average Italian, German or Frenchman will connect the dots and realize it is their own “leaders” – national nullities and mostly unelected Eurocrats – who are paving their road to poverty.</p><p>You will be poor. And you will like it. Because we are all supporting freedom for Ukrainian neo-nazis. That brings the concept of “multicultural Europe” to a whole new level.</p></blockquote><p>It’s clear that the Russians have already concluded that they will have to separate the eastern half of Ukraine from the NATO-WEF regime in order to keep the Russian-speakers living there safe from the terrorist attacks of the desperate, and defeated, government in Kiev. The question is whether they will do so quickly, or if they will continue to proceed with the highly effective attrition warfare that is depleting US military resources while simultaneously putting economic pressure on the European governments.</p><p>My bet is on the latter. I suspect the Russians are less interested in regime change in Kiev than they are in Berlin, Paris, Rome, Warsaw, and Bern. They know perfectly well that the people of Europe are no more enthusiastic about “standing with Ukraine” than they are about “welcoming refugees”; the media narratives were always fake and wholly manufactured.</p><ul class=\"wp-block-list\"><li><em>The EU will encounter “major challenges” due to the sanctions it imposed on Russia over the conflict in Ukraine, the bloc’s top diplomat, Josep Borrell, has said.</em></li><li><em>Former Czech President Vaclav Klaus has rejected the notion that the Ukrainian conflict has been the sole reason for the economic problems now experienced around the globe. “This is self-inflicted, this is self-inflicted by the West. The Russian invasion just added to that.”</em></li><li><em>Budapest refuses to negotiate any further EU restrictions targeting Russian energy because there is no current alternative to supplies from Moscow, Hungarian Foreign Minister Peter Szijjarto said on Saturday.</em></li><li><em>With food prices up 15 percent, COVID-19 job losses and surging energy costs, more and more people are seeking support from different social services. Germany’s 962 food banks are supporting more than two million customers.</em></li><li><em>Beyond firewood and natural gas, energy prices in Croatia have skyrocketed in the past few months. It’s not just consumers feeling the squeeze – across the country, it essentially forces many small fuel stations out of business. The entire nation is preparing for the incoming winter with unease.</em></li><li><em>A group of Left-SPD lawmakers have had enough of the unprecedented Ukraine arms shipments following on the heels of Berlin boosting its military budget by €100 billion. They’ve sent a letter to German Chancellor Olaf Scholz with the title, “The weapons must be silent!” Instead of pumping weapons into a hot conflict with a nuclear-armed superpower, the group within Scholz’s own party are demanding the pursuit of a diplomatic negotiations, pushing the Ukrainians to the peace talks table. </em></li></ul><p>Davos Man is dead. And winter is coming.</p><p><em><a href=\"https://social.infogalactic.com/micropost/32cf329a-76b2-4da4-ad86-a4a86f80da29\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The postmodernist econo-cultural vision of Europe has failed abysmally, as the ambitions of its architects were always based on false foundations and vastly exceeded their capabilities. More than four-fifths of the world has rejected their evil vision; the active resistance to it has barely even begun to take form. But it is already clear that there will be no Great Reset, and the global imperialists who believed they were destined to rule the world and own everything in it will be lucky to survive the series of regime changes over the next decade that are among\nthe probable consequences of the Euro-Russian War\n.\nThe leadership in Moscow is making it very clear, to internal and international audiences, the new deal consists in slow cooking the Kiev racket inside a massive cauldron while polishing its status of financial black hole for the collective West. Until we reach boiling point – which will be a revolution or a putsch.\nIn parallel, The Lords of (Proxy) War will continue with their own strategy, which is to pillage an enfeebled, fearful, Europe, then dressing it up as a perfumed colony to be ruthlessly exploited ad nauseam by the imperial oligarchy.\nEurope is now a runaway TGV – minus the requisite Hollywood production values. Assuming it does not veer off track – a dicey proposition – it may eventually arrive at a railway station called Agenda 2030, The Great Narrative, or some other NATO/Davos denomination du jour.\nAs it stands, what’s remarkable is how the “marginal” Russian economy hardly broke a sweat to “end the abundance” of the wealthiest region on the planet.\nMoscow does not even entertain the notion of negotiating with Brussels because there’s nothing to negotiate – considering puny Eurocrats will only be hurled away from their zombified state when the dire socio-economic consequences of “the end of abundance” will finally translate into peasants with pitchforks roaming the continent.\nIt may be eons away, but inevitably the average Italian, German or Frenchman will connect the dots and realize it is their own “leaders” – national nullities and mostly unelected Eurocrats – who are paving their road to poverty.\nYou will be poor. And you will like it. Because we are all supporting freedom for Ukrainian neo-nazis. That brings the concept of “multicultural Europe” to a whole new level.\nIt’s clear that the Russians have already concluded that they will have to separate the eastern half of Ukraine from the NATO-WEF regime in order to keep the Russian-speakers living there safe from the terrorist attacks of the desperate, and defeated, government in Kiev. The question is whether they will do so quickly, or if they will continue to proceed with the highly effective attrition warfare that is depleting US military resources while simultaneously putting economic pressure on the European governments.\nMy bet is on the latter. I suspect the Russians are less interested in regime change in Kiev than they are in Berlin, Paris, Rome, Warsaw, and Bern. They know perfectly well that the people of Europe are no more enthusiastic about “standing with Ukraine” than they are about “welcoming refugees”; the media narratives were always fake and wholly manufactured.\nThe EU will encounter “major challenges” due to the sanctions it imposed on Russia over the conflict in Ukraine, the bloc’s top diplomat, Josep Borrell, has said.\nFormer Czech President Vaclav Klaus has rejected the notion that the Ukrainian conflict has been the sole reason for the economic problems now experienced around the globe. “This is self-inflicted, this is self-inflicted by the West. The Russian invasion just added to that.”\nBudapest refuses to negotiate any further EU restrictions targeting Russian energy because there is no current alternative to supplies from Moscow, Hungarian Foreign Minister Peter Szijjarto said on Saturday.\nWith food prices up 15 percent, COVID-19 job losses and surging energy costs, more and more people are seeking support from different social services. Germany’s 962 food banks are supporting more than two million customers.\nBeyond firewood and natural gas, energy prices in Croatia have skyrocketed in the past few months. It’s not just consumers feeling the squeeze – across the country, it essentially forces many small fuel stations out of business. The entire nation is preparing for the incoming winter with unease.\nA group of Left-SPD lawmakers have had enough of the unprecedented Ukraine arms shipments following on the heels of Berlin boosting its military budget by €100 billion. They’ve sent a letter to German Chancellor Olaf Scholz with the title, “The weapons must be silent!” Instead of pumping weapons into a hot conflict with a nuclear-armed superpower, the group within Scholz’s own party are demanding the pursuit of a diplomatic negotiations, pushing the Ukrainians to the peace talks table.\nDavos Man is dead. And winter is coming.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-28T14:26:25+00:00"
}