{
  "url": "https://voxday.net/2022/08/11/the-rules-of-trolling/",
  "scraped_at": "2026-01-08T13:27:19.042163",
  "title": "The Rules of Trolling",
  "date_display": "August 11, 2022",
  "date_iso": "2022-08-11T09:34:18+00:00",
  "date_from_url": "2022-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Saker releases <a href=\"https://thesaker.is/a-short-vademecum-for-aspiring-trolls/\">a basic guide to trolling</a> in the aftermath of the mass onslaught of neocon trolls on his site. A lot of it sounds remarkably familiar, does it not?</p><ul class=\"wp-block-list\"><li>Rule number one: <strong>always make sure your comment is either the very first one (best!) or, at least, one of the top ones.</strong> This way you can best derail the discussion away from the actual article and make it all about your talking points. This was almost always the case when I was still writing for the <em>Unz Review</em>, and it is still very often the case on the Saker blog today. I would call this rule “the golden rule of trolling”.</li><li>Do not, ever, refer to the actual contents of article you comment upon. Doing so might lead the readers to familiarize themselves with the author’s arguments or, worse, the factual and logical substantiation of these arguments. You want emotion, not analysis.</li><li>Make sure to psychoanalyze both the author and the blog itself. Use sentences such as “you only write this because” or “in spite of the horrific censorship on this blog…” etc. This is basically the good old <em>ad hominem</em> disguised as some kind of insight into things the troll cannot – by definition – have any information about.</li><li>In your comment, make sure to align as many Neocon talking points as possible, you can join them together into (apparent) sentences and (apparent) paragraphs. This way you give the external appearance of making an cogent argument while doing no such thing.</li><li>Ignore the author’s arguments. If the author write “A”, do not directly dispute it, don’t even refer to it. Instead, write “non-A”. In fact, the ideal troll comment is one which never gives the reader a reason to look up the author’s actual arguments.</li><li>Make sure that your comment is formally polite. Thus not only do you sound respectful and sincere (“all I want is an honest discussion!“), but it reduces the chances that the moderators will send it to trash. You can be snarky, of course, but that opens up your comment to being sent to trash on formal reasons.</li><li>Claim the coveted “victim of censorship” status. Yes, even when you ignore (deliberately or not) the commenting rules! This technique is especially useful if your comment is illogical, off-topic or pain stupid. After all, in our times of “positivity” and “acceptance” it would be most politically incorrect to call any comment “nonsensical” or “stupid”!</li><li>Misuse terms, especially those which are often misunderstood by non-specialists. The perfect example would be the difference between “air superiority” and “air supremacy”, or use “contested airspace”. The goal here is not to make a fact based and logical argument, the goal is to repeat Neocon talking points as often as possible. With some luck, other commentators will pick up this misuse of terms and you will achieve a synergistic effect.</li><li>Go fishing. By that I mean this: post a number of statements and see if anybody else will “bite”, possibly a fellow troll (paid or not). Example, “it appears that a single Ukrainian MiG-29A shot 3 Su-35S in one mission“. With any luck, somebody will bite and, there we go, the synergistic effect will be achieved.</li><li>Ignore points made in the original article. This is a crucial one. If an author writes “A” and then goes into some details explaining the factual and logical basis for this argument, don’t engage, but ignore it! Pretend as if it did not exist. With some luck, those who just skimmed over and article won’t realize what you are doing.</li><li>“Bounce” external arguments. By this I mean simply write “I read fill the black” and ask for a rebuttal. The function and purpose of this technique is double: derail the conversation and (try to) force the author to waste his/her time debunking as many idiotic arguments as possible.</li></ul><p>Fortunately, the development of SocialGalactic means our community no longer needs to deal with trolls or pay any attention to their ankle-biting antics any longer. And that’s all that matters, because as far as I can tell, there isn’t a single person of note anywhere who doesn’t have at least a few trolls incessantly posting nonsense about them on Twitter, on Reddit, or some other Internet cesspool.</p><p>Seriously, pick a random “celebrity”, however well-loved or trivial. I guarantee you a moment’s search will find trolls sniping at the late Olivia Newton John as well as at the latest Z-list British Love Islander and the most recent YouTuber to reach 100,000 subscribers. Self-appointed critics are the price of success, and it is one of the reasons why even the most famous attention whores who have assiduously pursued fame eventually find themselves backing away from the spotlights and the red carpets.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6bb8d710-d727-44bf-aa59-212bdd11aa7a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Saker releases\na basic guide to trolling\nin the aftermath of the mass onslaught of neocon trolls on his site. A lot of it sounds remarkably familiar, does it not?\nRule number one:\nalways make sure your comment is either the very first one (best!) or, at least, one of the top ones.\nThis way you can best derail the discussion away from the actual article and make it all about your talking points. This was almost always the case when I was still writing for the\nUnz Review\n, and it is still very often the case on the Saker blog today. I would call this rule “the golden rule of trolling”.\nDo not, ever, refer to the actual contents of article you comment upon. Doing so might lead the readers to familiarize themselves with the author’s arguments or, worse, the factual and logical substantiation of these arguments. You want emotion, not analysis.\nMake sure to psychoanalyze both the author and the blog itself. Use sentences such as “you only write this because” or “in spite of the horrific censorship on this blog…” etc. This is basically the good old\nad hominem\ndisguised as some kind of insight into things the troll cannot – by definition – have any information about.\nIn your comment, make sure to align as many Neocon talking points as possible, you can join them together into (apparent) sentences and (apparent) paragraphs. This way you give the external appearance of making an cogent argument while doing no such thing.\nIgnore the author’s arguments. If the author write “A”, do not directly dispute it, don’t even refer to it. Instead, write “non-A”. In fact, the ideal troll comment is one which never gives the reader a reason to look up the author’s actual arguments.\nMake sure that your comment is formally polite. Thus not only do you sound respectful and sincere (“all I want is an honest discussion!“), but it reduces the chances that the moderators will send it to trash. You can be snarky, of course, but that opens up your comment to being sent to trash on formal reasons.\nClaim the coveted “victim of censorship” status. Yes, even when you ignore (deliberately or not) the commenting rules! This technique is especially useful if your comment is illogical, off-topic or pain stupid. After all, in our times of “positivity” and “acceptance” it would be most politically incorrect to call any comment “nonsensical” or “stupid”!\nMisuse terms, especially those which are often misunderstood by non-specialists. The perfect example would be the difference between “air superiority” and “air supremacy”, or use “contested airspace”. The goal here is not to make a fact based and logical argument, the goal is to repeat Neocon talking points as often as possible. With some luck, other commentators will pick up this misuse of terms and you will achieve a synergistic effect.\nGo fishing. By that I mean this: post a number of statements and see if anybody else will “bite”, possibly a fellow troll (paid or not). Example, “it appears that a single Ukrainian MiG-29A shot 3 Su-35S in one mission“. With any luck, somebody will bite and, there we go, the synergistic effect will be achieved.\nIgnore points made in the original article. This is a crucial one. If an author writes “A” and then goes into some details explaining the factual and logical basis for this argument, don’t engage, but ignore it! Pretend as if it did not exist. With some luck, those who just skimmed over and article won’t realize what you are doing.\n“Bounce” external arguments. By this I mean simply write “I read fill the black” and ask for a rebuttal. The function and purpose of this technique is double: derail the conversation and (try to) force the author to waste his/her time debunking as many idiotic arguments as possible.\nFortunately, the development of SocialGalactic means our community no longer needs to deal with trolls or pay any attention to their ankle-biting antics any longer. And that’s all that matters, because as far as I can tell, there isn’t a single person of note anywhere who doesn’t have at least a few trolls incessantly posting nonsense about them on Twitter, on Reddit, or some other Internet cesspool.\nSeriously, pick a random “celebrity”, however well-loved or trivial. I guarantee you a moment’s search will find trolls sniping at the late Olivia Newton John as well as at the latest Z-list British Love Islander and the most recent YouTuber to reach 100,000 subscribers. Self-appointed critics are the price of success, and it is one of the reasons why even the most famous attention whores who have assiduously pursued fame eventually find themselves backing away from the spotlights and the red carpets.\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-11T09:44:01+00:00"
}