{
  "url": "https://voxday.net/2022/08/02/the-sacrificial-lamb-approaches/",
  "scraped_at": "2026-01-08T13:26:26.672658",
  "title": "The Sacrificial Lamb Approaches",
  "date_display": "August 2, 2022",
  "date_iso": "2022-08-02T10:33:12+00:00",
  "date_from_url": "2022-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The only logical explanation for Nancy Pelosi’s much-rumored “secret” visit to Taiwan is for her to serve as a sacrificial <em>casus belli</em> to start the war that the neocons want with China at the earliest opportunity.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Taiwan has relocated French-supplied Mirage 2000 fighter jets and other military hardware, according to local media, ahead of a possible visit by US House Speaker Nancy Pelosi. Eight additional aircraft were moved to the Chihhang Air Base, adding to the two Mirage 2000 fighters already stationed there, the Taiwan-based China Times reported on Tuesday.</p><p>The base is located in the southeastern part of the island, from where Pelosi’s plane is expected to approach, the outlet said. The facility was put on high alert, it added.</p><p>Meanwhile Taiwan’s Navy deployed two additional anti-submarine helicopters to patrol the waters near the island, the report said.</p></blockquote><p>Meanwhile, the USS <em>Ronald Reagan</em> is said to be approaching Chinese waters as Chinese social media is reporting that both the <em>Shandong </em>and <em>Fujian </em>aircraft carriers have left their bases. China’s position remains very clear, and was repeated by the spokesman for the Foreign Ministry yesterday.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Reuters: </strong>US House Speaker Nancy Pelosi is scheduled to visit Southeast Asia and East Asia this week and Taiwan is not mentioned in her itinerary. What’s China’s comment?</p><p><strong>Zhao Lijian:</strong> Recently, the Chinese side has repeatedly made clear to the US side our serious concern over Speaker Pelosi’s potential visit to Taiwan and our firm opposition to the visit. We have been stressing that such a visit would lead to serious consequences. As President Xi Jinping stressed to US President Joe Biden in their phone call, the position of the Chinese government and people on the Taiwan question is consistent, and resolutely safeguarding China’s national sovereignty and territorial integrity is the firm will of the more than 1.4 billion Chinese people. The public opinion cannot be defied. Those who play with fire will perish by it. We believe that the US side is fully aware of China’s strong and clear message. </p><p>We are closely following the itinerary of Speaker Pelosi. A visit to Taiwan by her would constitute a gross interference in China’s internal affairs, seriously undermine China’s sovereignty and territorial integrity, wantonly trample on the one-China principle, greatly threaten peace and stability across the Taiwan Strait, severely undermine China-US relations and lead to a very serious situation and grave consequences. </p><p>We want to once again make it clear to the US side that the Chinese side is fully prepared for any eventuality and that the People’s Liberation Army of China will never sit idly by, and we will make resolute response and take strong countermeasures to uphold China’s sovereignty and territorial integrity, What the US should do is to abide by the one-China principle and the stipulations of the three Sino-US joint communiqués, fulfill President Biden’s commitment of not supporting “Taiwan independence” and not arrange for a visit by Speaker Pelosi to Taiwan. </p></blockquote><p>It will be interesting to see if China decides to take the bait and initiate or if it finds another way of saving face. Either way, we may witness the long-expected opening of the second front soon.</p><p><em><a href=\"https://social.infogalactic.com/micropost/433b5c15-fe22-48d6-bec9-6bb842c5911b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The only logical explanation for Nancy Pelosi’s much-rumored “secret” visit to Taiwan is for her to serve as a sacrificial\ncasus belli\nto start the war that the neocons want with China at the earliest opportunity.\nTaiwan has relocated French-supplied Mirage 2000 fighter jets and other military hardware, according to local media, ahead of a possible visit by US House Speaker Nancy Pelosi. Eight additional aircraft were moved to the Chihhang Air Base, adding to the two Mirage 2000 fighters already stationed there, the Taiwan-based China Times reported on Tuesday.\nThe base is located in the southeastern part of the island, from where Pelosi’s plane is expected to approach, the outlet said. The facility was put on high alert, it added.\nMeanwhile Taiwan’s Navy deployed two additional anti-submarine helicopters to patrol the waters near the island, the report said.\nMeanwhile, the USS\nRonald Reagan\nis said to be approaching Chinese waters as Chinese social media is reporting that both the\nShandong\nand\nFujian\naircraft carriers have left their bases. China’s position remains very clear, and was repeated by the spokesman for the Foreign Ministry yesterday.\nReuters:\nUS House Speaker Nancy Pelosi is scheduled to visit Southeast Asia and East Asia this week and Taiwan is not mentioned in her itinerary. What’s China’s comment?\nZhao Lijian:\nRecently, the Chinese side has repeatedly made clear to the US side our serious concern over Speaker Pelosi’s potential visit to Taiwan and our firm opposition to the visit. We have been stressing that such a visit would lead to serious consequences. As President Xi Jinping stressed to US President Joe Biden in their phone call, the position of the Chinese government and people on the Taiwan question is consistent, and resolutely safeguarding China’s national sovereignty and territorial integrity is the firm will of the more than 1.4 billion Chinese people. The public opinion cannot be defied. Those who play with fire will perish by it. We believe that the US side is fully aware of China’s strong and clear message.\nWe are closely following the itinerary of Speaker Pelosi. A visit to Taiwan by her would constitute a gross interference in China’s internal affairs, seriously undermine China’s sovereignty and territorial integrity, wantonly trample on the one-China principle, greatly threaten peace and stability across the Taiwan Strait, severely undermine China-US relations and lead to a very serious situation and grave consequences.\nWe want to once again make it clear to the US side that the Chinese side is fully prepared for any eventuality and that the People’s Liberation Army of China will never sit idly by, and we will make resolute response and take strong countermeasures to uphold China’s sovereignty and territorial integrity, What the US should do is to abide by the one-China principle and the stipulations of the three Sino-US joint communiqués, fulfill President Biden’s commitment of not supporting “Taiwan independence” and not arrange for a visit by Speaker Pelosi to Taiwan.\nIt will be interesting to see if China decides to take the bait and initiate or if it finds another way of saving face. Either way, we may witness the long-expected opening of the second front soon.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-02T11:14:36+00:00"
}