{
  "url": "https://voxday.net/2022/08/17/they-want-you-fat-then-dead/",
  "scraped_at": "2026-01-08T13:28:00.552555",
  "title": "They Want You Fat, Then Dead",
  "date_display": "August 17, 2022",
  "date_iso": "2022-08-17T15:27:19+00:00",
  "date_from_url": "2022-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s literally <a href=\"https://market-ticker.org/akcs-www?post=246632\">no other conclusion</a> one can possibly reach, given the behavior of the techno-medico-media complex. Apparently it’s much more profitable to slowly kill the unproductive over time than it is to sell things to them.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For ten years on these pages I’ve talked about getting the carbs and machine-processed oils out of your diet. For eight of those last ten years this was perfectly ok with the various censors — Google, to be specific.</p><p>When Covid started up I pointed out that by the data if you were a fat-ass you were wildly more-likely to die. Not a little more likely, much more likely. 2, 3, 5, ten times more-likely, depending on how much of a fat-ass you were. The worse it was, the worse the outcomes. That doesn’t mean you would definitely die because probability doesn’t work like that, at least until probability is 1.0.</p><p>I also have been pointing out for those same ten years that you don’t need fancy tests or money. All you need is to stand naked against a wall and look down. If you have a gut you’re metabolically compromised. If you can’t see your genitals you’re severely compromised.</p><p>Not “sometimes”, not “maybe”, every time.</p><p>Well, post Covid’s emergence I was basically forced to move all of my articles on low-carb eating off the “advertising is shown” side of the site, because it was suddenly considered “medical misinformation”, despite it being perfectly fine for ten years to discuss such topics. It isn’t “misinformation” at all, but to argue against, even with scientific data behind your opinion anything other than the “one true way”, as defined by the government and big tech in collusion, suddenly became verboten. This is one of the earlier articles, incidentally, which surprisingly wasn’t flagged.</p><p><a href=\"https://market-ticker.org/akcs-www?archive-list=Market-Ticker-Nad&amp;cat=Personal+Health\">You can go here</a>, if you wish, which is the “cheat” to get the archives of all the stuff moved over. Some of it has rolled off but not all, for example the marked-exempt <a href=\"https://market-ticker.org/akcs-www?post=231343\">Demolishing The Lies On Low-Carb Eating</a> post.</p><p>Now I want you to pay attention to <a href=\"https://www.youtube.com/watch?v=6KS7M0s2fJM\">this, which just recently published and thus far Youtube hasn’t forced it offline</a>. They probably will. It documents medical studies that proved the use of insulin as a treatment for Type II diabetes doesn’t decrease all-cause mortality; that is, it does nothing to keep you from being dead.</p><p>In fact it slightly but statistically increases your odds of being dead!</p><p>That’s right — your doctor eventually prescribes something that increases your odds of being dead.</p><p>Yet this is what basically every medical scold sells you if you’re overweight and show up with high blood glucose: You have an irreversible condition, you can manage it with drugs which will progressively stop working over time, exercise will help but again the damage is irreversible and, in the end, you’re fucked.</p><p>IT IS A LIE.</p></blockquote><p>Get lean. Keep your blood clean. Don’t enter the Kill Machine.</p><p><em><a href=\"https://social.infogalactic.com/micropost/67395b16-dd88-4adb-bc48-576170986372\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There’s literally\nno other conclusion\none can possibly reach, given the behavior of the techno-medico-media complex. Apparently it’s much more profitable to slowly kill the unproductive over time than it is to sell things to them.\nFor ten years on these pages I’ve talked about getting the carbs and machine-processed oils out of your diet. For eight of those last ten years this was perfectly ok with the various censors — Google, to be specific.\nWhen Covid started up I pointed out that by the data if you were a fat-ass you were wildly more-likely to die. Not a little more likely, much more likely. 2, 3, 5, ten times more-likely, depending on how much of a fat-ass you were. The worse it was, the worse the outcomes. That doesn’t mean you would definitely die because probability doesn’t work like that, at least until probability is 1.0.\nI also have been pointing out for those same ten years that you don’t need fancy tests or money. All you need is to stand naked against a wall and look down. If you have a gut you’re metabolically compromised. If you can’t see your genitals you’re severely compromised.\nNot “sometimes”, not “maybe”, every time.\nWell, post Covid’s emergence I was basically forced to move all of my articles on low-carb eating off the “advertising is shown” side of the site, because it was suddenly considered “medical misinformation”, despite it being perfectly fine for ten years to discuss such topics. It isn’t “misinformation” at all, but to argue against, even with scientific data behind your opinion anything other than the “one true way”, as defined by the government and big tech in collusion, suddenly became verboten. This is one of the earlier articles, incidentally, which surprisingly wasn’t flagged.\nYou can go here\n, if you wish, which is the “cheat” to get the archives of all the stuff moved over. Some of it has rolled off but not all, for example the marked-exempt\nDemolishing The Lies On Low-Carb Eating\npost.\nNow I want you to pay attention to\nthis, which just recently published and thus far Youtube hasn’t forced it offline\n. They probably will. It documents medical studies that proved the use of insulin as a treatment for Type II diabetes doesn’t decrease all-cause mortality; that is, it does nothing to keep you from being dead.\nIn fact it slightly but statistically increases your odds of being dead!\nThat’s right — your doctor eventually prescribes something that increases your odds of being dead.\nYet this is what basically every medical scold sells you if you’re overweight and show up with high blood glucose: You have an irreversible condition, you can manage it with drugs which will progressively stop working over time, exercise will help but again the damage is irreversible and, in the end, you’re fucked.\nIT IS A LIE.\nGet lean. Keep your blood clean. Don’t enter the Kill Machine.\nDISCUSS ON SG",
  "tags": [
    "health care",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-17T15:27:19+00:00"
}