{
  "url": "https://voxday.net/2022/08/21/unrest-in-europe/",
  "scraped_at": "2026-01-08T13:28:24.960976",
  "title": "Unrest in Europe",
  "date_display": "August 21, 2022",
  "date_iso": "2022-08-21T09:54:09+00:00",
  "date_from_url": "2022-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If even the wealthy and highly-prepared Swiss are anticipating <a href=\"https://www.rt.com/news/561220-switzerland-revolt-energy-deficit-police/\">shortage-related social unrest</a> despite their world-class self-sufficiency, the social order across Europe and in the UK is unlikely to remain intact this winter.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Swiss people may revolt and resort to looting if the Alpine nation is hit by a severe energy crunch this winter, the police chief of one of its cantons told local media on Saturday.</p><p>Fredy Fassler, the head of the Security and Justice Department in the canton of St. Gallen, told German-language daily Blick that a blackout would have “far-reaching consequences.”</p><p>“Imagine, you can no longer withdraw money at the ATM, you can no longer pay with the card in the store or refuel your tank at the gas station. Heating stops working. It’s cold. Streets go dark. It is conceivable that the population would rebel or that there would be looting,” he said, adding that the country’s authorities should take measures to prepare for such extreme scenarios…</p><p>Fassler’s comments come after Swiss authorities said last week that they may place restrictions on energy consumption this coming winter, signaling that “power shortages [are] among the most serious risks” for the landlocked country.</p></blockquote><p>What the police chief doesn’t mention is that the main reason the Swiss would likely be rebelling against their government is that the country produces what should be sufficient electricity for its own winter needs, but it has promised to provide a fair amount of that electricity to the rest of Europe. And the Swiss people are very unlikely to accept the idea that they have to freeze in darkness so that their electricity can be sent to France or Germany due to the outdated ideals of a few globalist Europhiles.</p><p>Still, the fact that the Swiss authorities are already talking openly about the situation and at least beginning to try to address the problem is a positive sign. The silence of the EU countries on the subject does not bode quite so well. Of course, the solution for the Europeans is perfectly straightforward: stop participating in the neocon’s proxy war on Russia, end the idiotic sanctions regime, return everything that was seized, and apologize profusely to the Russian government.</p><p>Like it or not, no one can deny that it’s a better alternative than famine, freezing, and facing a popular revolt. If they don’t choose wisely, the over/under on EU regime change before this time next year is probably around five and could be considerably higher. And Italy and Hungary will not be the only nations to exit the EU.</p><p>Nationalism is inevitable. Nationalism is inevitable because globalist imperialism is constructed on false foundations that we now know to be both evil and impossible.</p><p><strong>UPDATE: </strong>Notice that the Swiss are on the verge of panic on the basis of an expected 10-percent shortfall. I anticipate the shortfalls in other European nations will be at least 3x that.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The energy shortage is “imminent”, Roger Nordmann from the left-wing Social Democratic party told the <em>SonntagsBlick</em>. “The war in Ukraine is causing acute gas shortages. Half of the nuclear power plants in France are at a standstill. And the drought is putting a strain on hydropower. This combination of drastic factors means that Switzerland could be short of around 15% gas and up to 10% electricity in the coming winter,” he said.</p></blockquote><p>So end your war on Russia, guys. You took sides and you lost. It’s over. This really isn’t that hard.</p><p><strong>UPDATE: </strong>Now the NHS in the UK is also starting <a href=\"https://www.rt.com/business/561169-britain-warned-humanitarian-crisis/\">to foresee trouble</a>. Perhaps if the British authorities would stop welcoming “refugees” and start repatriating them to their homelands, they’d possess sufficient resources to prevent a humanitarian crisis among their own people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The UK could face a “humanitarian crisis” involving ill health, excess deaths and rising inequality if the government does not take urgent action on rising energy bills, the National Health Service (NHS) Confederation warned on Friday. The organization wrote to the chancellor of the exchequer, claiming that failing to act would add more pressure on health services that were already strained.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/14abd8ea-9cc9-42ef-ad1b-fcc0dda637f5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If even the wealthy and highly-prepared Swiss are anticipating\nshortage-related social unrest\ndespite their world-class self-sufficiency, the social order across Europe and in the UK is unlikely to remain intact this winter.\nSwiss people may revolt and resort to looting if the Alpine nation is hit by a severe energy crunch this winter, the police chief of one of its cantons told local media on Saturday.\nFredy Fassler, the head of the Security and Justice Department in the canton of St. Gallen, told German-language daily Blick that a blackout would have “far-reaching consequences.”\n“Imagine, you can no longer withdraw money at the ATM, you can no longer pay with the card in the store or refuel your tank at the gas station. Heating stops working. It’s cold. Streets go dark. It is conceivable that the population would rebel or that there would be looting,” he said, adding that the country’s authorities should take measures to prepare for such extreme scenarios…\nFassler’s comments come after Swiss authorities said last week that they may place restrictions on energy consumption this coming winter, signaling that “power shortages [are] among the most serious risks” for the landlocked country.\nWhat the police chief doesn’t mention is that the main reason the Swiss would likely be rebelling against their government is that the country produces what should be sufficient electricity for its own winter needs, but it has promised to provide a fair amount of that electricity to the rest of Europe. And the Swiss people are very unlikely to accept the idea that they have to freeze in darkness so that their electricity can be sent to France or Germany due to the outdated ideals of a few globalist Europhiles.\nStill, the fact that the Swiss authorities are already talking openly about the situation and at least beginning to try to address the problem is a positive sign. The silence of the EU countries on the subject does not bode quite so well. Of course, the solution for the Europeans is perfectly straightforward: stop participating in the neocon’s proxy war on Russia, end the idiotic sanctions regime, return everything that was seized, and apologize profusely to the Russian government.\nLike it or not, no one can deny that it’s a better alternative than famine, freezing, and facing a popular revolt. If they don’t choose wisely, the over/under on EU regime change before this time next year is probably around five and could be considerably higher. And Italy and Hungary will not be the only nations to exit the EU.\nNationalism is inevitable. Nationalism is inevitable because globalist imperialism is constructed on false foundations that we now know to be both evil and impossible.\nUPDATE:\nNotice that the Swiss are on the verge of panic on the basis of an expected 10-percent shortfall. I anticipate the shortfalls in other European nations will be at least 3x that.\nThe energy shortage is “imminent”, Roger Nordmann from the left-wing Social Democratic party told the\nSonntagsBlick\n. “The war in Ukraine is causing acute gas shortages. Half of the nuclear power plants in France are at a standstill. And the drought is putting a strain on hydropower. This combination of drastic factors means that Switzerland could be short of around 15% gas and up to 10% electricity in the coming winter,” he said.\nSo end your war on Russia, guys. You took sides and you lost. It’s over. This really isn’t that hard.\nUPDATE:\nNow the NHS in the UK is also starting\nto foresee trouble\n. Perhaps if the British authorities would stop welcoming “refugees” and start repatriating them to their homelands, they’d possess sufficient resources to prevent a humanitarian crisis among their own people.\nThe UK could face a “humanitarian crisis” involving ill health, excess deaths and rising inequality if the government does not take urgent action on rising energy bills, the National Health Service (NHS) Confederation warned on Friday. The organization wrote to the chancellor of the exchequer, claiming that failing to act would add more pressure on health services that were already strained.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-08-21T11:18:04+00:00"
}