{
  "url": "https://voxday.net/2019/09/06/a-fake-conservatives-fake-history-of-gamergate/",
  "scraped_at": "2025-12-21T02:57:17.323458",
  "title": "A fake conservative’s fake history of GamerGate",
  "date_display": "September 6, 2019",
  "date_iso": "2019-09-06T13:45:12+00:00",
  "date_from_url": "2019-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neoclown Ekaterina Jung is more concerned with attempting to gatekeep conservatives and keep them away from those unsavory nationalists who might actually try to win rather than go down in graceful defeat than she is in actually addressing any of the actual history in an article that purports – mostly falsely – <a href=\"https://arcdigital.media/almost-everything-you-know-about-gamergate-is-wrong-c4a50a3515fb\">to explain GamerGate</a> four years later:</p><blockquote><p>Was GamerGate a precursor to the alt-right and did it prepare the ground for Trump’s election?</p><p>In a literal sense, the answer to the first part is a clear no: The alt-right as a white nationalist fringe existed at least since 2010, when Richard Spencer launched the Alternative Right website. However, it is true that the alt-right’s online presence skyrocketed in 2015 and that a major vehicle for its attempted mainstreaming was Breitbart, the right-wing site which also embraced GamerGate.</p><p>In his perceptive Vox article in 2014, Klein noted that despite the left-of-center politics of most GamerGaters, media treatment of the controversy had been sharply divided along left/right lines: Liberal opinion was “in lockstep against Gamergate,” while some conservatives and critics of the social justice left were sympathetic. Breitbart, in particular, made GamerGate its pet cause, starting with a September 1, 2014 article by the soon-to-be-infamous Milo Yiannopoulos titled “Feminist Bullies Tearing the Video Game Industry Apart.” Yiannopoulos also championed GamerGate on Twitter; with his flashy bad-boy persona, he quickly became a hero to many in the movement, even those who otherwise had no affection for Breitbart’s politics.</p><p>It is also true that there were alt-right-type elements within GamerGate. As I cautioned in an early article on the movement, any backlash against extremist versions of feminism and “social justice” is likely to be a magnet for actual misogynists, bigots, and far-right extremists. (Ironically, one example I cited was pro-GamerGate lawyer Mike Cernovich, whose past misogynist tweets had been flagged by a GamerGate opponent — and who went on to become a prominent alt-right figure before eventually attempting to distance himself from the extremist fringe.) There were also the “edgy” teens who came in by way of “/pol/,” the 4chan “Politically Incorrect” board notorious for racist and anti-Semitic memes, and who thought it was good fun to post a cartoon of Sarkeesian as a greedy Jew.</p><p>“Since GamerGate didn’t have any sort of people controlling its population, and it was nominally against leftists, it attracted /pol/, obviously,” a Jewish GamerGater who wanted to be identified only as David, a politically centrist tech worker in his late twenties, told me in an email. Yet David also stressed that he saw “very little” anti-Semitism in GamerGate-related conversations and made many Jewish friends through the movement.</p><p>Far from setting the tone in GamerGate, its far-right members felt sufficiently embattled to start a separate 8chan forum, /ggrevolt/ (GamerGate Revolt); its denizens often disliked “regular” GamerGaters at least as much as they did “social justice warriors.” Video blogger June Lapine (“Shoe0nHead” on YouTube), a 28-year-old New Yorker who was involved with GamerGate from the start, says that /ggrevolt/ was her “first introduction to what [the] ‘alt-right’ was.”</p><p>There is strong evidence that as the alt-right began to gather steam in late 2015, Yiannopoulos tried to channel GamerGate — which he often tried to treat as his private army — in its direction. In January 2016, someone leaked chat logs in which pro-GamerGate blogger Ethan Ralph, who was close to Yiannopoulos, and several of his friends from /ggrevolt/ trashed GamerGate, agreed that the culture war needed to move on to the alt-right, and discussed plans to “reappropriate” GamerGate for the alt-right by purging liberals, who were mocked as “SJW-lite.” These revelations, which coincided with intensifying harassment of GamerGaters by /ggrevolt/ types, rocked what remained of GamerGate and got Ralph banned from the Kotaku In Action board (which did not stop The Daily Dot from calling Ralph a “GamerGate leader” when he was arrested several months later for assaulting a police officer).</p><p>In the end, the GamerGate-to-Alt-Right pipeline never materialized. However, a number of previously liberal GamerGaters did get on the “Trump Train” in 2016. At present, still-active GamerGaters to whom I have spoken estimate that about half of the posters on Kotaku In Action are pro-Trump. Some may have fallen for the Breitbart lure; others saw Trump as the answer to “political correctness” or shared his hostility to the mainstream media, which they (correctly) felt had been extremely shoddy and biased in its GamerGate coverage.</p><p>The slide toward Trumpism disappointed many GamerGate sympathizers; it also made some left-of-center GamerGaters such as Matt Jarbo — a.k.a. “Mundane Matt,” the YouTuber whose video on the Quinn cronyism allegations helped start the controversy — worry if they’ve helped elect Trump. “I definitely don’t want that on my conscience,” Jarbo joked uneasily in our recent interview. Others, such as fellow YouTuber Lapine, a self-described “proud social democrat,” dismiss the idea as “delusional.” As Lapine puts it, “everyone is always pointing fingers at who is to blame for Trump.”</p></blockquote><p>Jung is just trying to work in a hit piece attacking the nationalist Right that she fears while ostensibly writing about GamerGate. It’s highly amusing that she takes shots at both Milo and Cerno, as well as the Alt Right, without ever mentioning the one individual who was, unlike either Mike or Milo, both a pre-Quinnspiracy OGGer and openly Alt-Right.</p><p>But mostly it’s bad journalism; she doesn’t bother to talk to any of the major GamerGate figures or follow-up on what has happened to them since, she has no idea why the backlash to GameJournoPros took place or even mention the exposure of the conspiracy and the mailing list, and she completely fails to make the connection between the tactics successfully utilized by GamerGate and the tactics that are now commonly used for everything from Sad Puppies to consumer lawfare against the SJWs and the social media giants.</p><p>Consider what Jung claims to be the moral of the GamerGate story for conservatives:</p><p><i><b>For critics of the left, the main moral of the story is that it’s important to repudiate unsavory allies.</b></i></p><p>In other words, please cuck. <i>This is absolutely and entirely false.</i> If you want to understand GamerGate, you’d do far better to simply read chapter 8 of <i><a href=\"https://www.amazon.com/SJWs-Always-Lie-Thought-Justice-ebook/dp/B014GMBUR4/\">SJWS ALWAYS LIE</a></i>, Striking Back at the Thought Police, which explained the relationship between GamerGate and Donald Trump back in 2015 at the very start of the chapter.</p><p><i>The reason SJWs have been so successful since the 1990s is that for more than two decades, they simply did not meet with any serious or organized resistance. #GamerGate represented the first serious organized resistance to them, and in only one year, the intrepid warriors of the gamer community have inspired similar resistance movements to surface in science fiction, in comics, and in romance. Echoes of #GamerGate have begun to appear in the popular culture, as Donald Trump not only refused to kowtow before Fox News’s Megyn Kelly flashing of the SJWs’ Woman card during the U.S. presidential debate but afterwards declared political correctness to be a big problem in the U.S.A. Trump’s unexpected popularity in the polls is, to a large extent, a consequence of his willingness to confront the SJW Narrative and speak the truth as he sees it.</i><br><i><br/></i><i>#GamerGate tactics are also beginning to be adopted by other groups for unrelated purposes, as there is a distinctly GG tone to the anti-Planned Parenthood memes that have been cropping up on Twitter ever since The Center for Medical Progress began releasing its sting-videos that showed Planned Parenthood employees openly discussing the sale of human organs taken from the infants it aborts. American immigration opponents have also successfully tarred some of the leading Republican candidates as well as their media supporters with the #cuckservative hashtag, much to the dismay of both the G.O.P. elite and the New York Times alike. It is therefore little wonder that SJWs are terrified of #GamerGate and see it as their most fearsome enemy.</i><br><i><br/></i>An actual GamerGater commenting on Instapundit provides <a href=\"https://pjmedia.com/instapundit/341183/#comment-4605894708\">a much better summary</a>.</br></br></p><blockquote><p>I was in gamergate and it had several interesting aspects that I personally witnessed.</p><p><b>1. Gamergate was first time I learned that SJWs don’t really care who they demonize</b>. We had many Lefty type gamers that were astonished that they too would be declared “bad people” for defending their hobby.</p><p><b>2. Organizations have more money then you could make a dent into with a boycott, but nobody ever has enough time.</b> We learned that you can overwhelm an organization’s customer facing department and PR with email and phone call campaigns.</p><p><b>3. Never ever ever make someone a leader. </b>The Media loves to find leaders and smear them to smear the movement by proxy. Lots of people got smeared, lots of people lost their jobs.</p><p><b>4. Mainstream conservatives are traitorous cunts and should never be trusted to guard an outhouse. </b>We tried to get so called conservative journalists interested in what we were doing. Most ignored us as they thought we were just “a bunch of nerds playing games in mom’s basement”, and of course we had the shitheads that said we were misogynists and games cause violence. In the end one guy gave us a fair shake, Milo Yiannopoulos and started giving us coverage. As per their nature the conservatives tried to deep six his ass and sent him to the fringes of society and the MSM was just giddy with the results.</p></blockquote></div>",
  "content_text": "Neoclown Ekaterina Jung is more concerned with attempting to gatekeep conservatives and keep them away from those unsavory nationalists who might actually try to win rather than go down in graceful defeat than she is in actually addressing any of the actual history in an article that purports – mostly falsely –\nto explain GamerGate\nfour years later:\nWas GamerGate a precursor to the alt-right and did it prepare the ground for Trump’s election?\nIn a literal sense, the answer to the first part is a clear no: The alt-right as a white nationalist fringe existed at least since 2010, when Richard Spencer launched the Alternative Right website. However, it is true that the alt-right’s online presence skyrocketed in 2015 and that a major vehicle for its attempted mainstreaming was Breitbart, the right-wing site which also embraced GamerGate.\nIn his perceptive Vox article in 2014, Klein noted that despite the left-of-center politics of most GamerGaters, media treatment of the controversy had been sharply divided along left/right lines: Liberal opinion was “in lockstep against Gamergate,” while some conservatives and critics of the social justice left were sympathetic. Breitbart, in particular, made GamerGate its pet cause, starting with a September 1, 2014 article by the soon-to-be-infamous Milo Yiannopoulos titled “Feminist Bullies Tearing the Video Game Industry Apart.” Yiannopoulos also championed GamerGate on Twitter; with his flashy bad-boy persona, he quickly became a hero to many in the movement, even those who otherwise had no affection for Breitbart’s politics.\nIt is also true that there were alt-right-type elements within GamerGate. As I cautioned in an early article on the movement, any backlash against extremist versions of feminism and “social justice” is likely to be a magnet for actual misogynists, bigots, and far-right extremists. (Ironically, one example I cited was pro-GamerGate lawyer Mike Cernovich, whose past misogynist tweets had been flagged by a GamerGate opponent — and who went on to become a prominent alt-right figure before eventually attempting to distance himself from the extremist fringe.) There were also the “edgy” teens who came in by way of “/pol/,” the 4chan “Politically Incorrect” board notorious for racist and anti-Semitic memes, and who thought it was good fun to post a cartoon of Sarkeesian as a greedy Jew.\n“Since GamerGate didn’t have any sort of people controlling its population, and it was nominally against leftists, it attracted /pol/, obviously,” a Jewish GamerGater who wanted to be identified only as David, a politically centrist tech worker in his late twenties, told me in an email. Yet David also stressed that he saw “very little” anti-Semitism in GamerGate-related conversations and made many Jewish friends through the movement.\nFar from setting the tone in GamerGate, its far-right members felt sufficiently embattled to start a separate 8chan forum, /ggrevolt/ (GamerGate Revolt); its denizens often disliked “regular” GamerGaters at least as much as they did “social justice warriors.” Video blogger June Lapine (“Shoe0nHead” on YouTube), a 28-year-old New Yorker who was involved with GamerGate from the start, says that /ggrevolt/ was her “first introduction to what [the] ‘alt-right’ was.”\nThere is strong evidence that as the alt-right began to gather steam in late 2015, Yiannopoulos tried to channel GamerGate — which he often tried to treat as his private army — in its direction. In January 2016, someone leaked chat logs in which pro-GamerGate blogger Ethan Ralph, who was close to Yiannopoulos, and several of his friends from /ggrevolt/ trashed GamerGate, agreed that the culture war needed to move on to the alt-right, and discussed plans to “reappropriate” GamerGate for the alt-right by purging liberals, who were mocked as “SJW-lite.” These revelations, which coincided with intensifying harassment of GamerGaters by /ggrevolt/ types, rocked what remained of GamerGate and got Ralph banned from the Kotaku In Action board (which did not stop The Daily Dot from calling Ralph a “GamerGate leader” when he was arrested several months later for assaulting a police officer).\nIn the end, the GamerGate-to-Alt-Right pipeline never materialized. However, a number of previously liberal GamerGaters did get on the “Trump Train” in 2016. At present, still-active GamerGaters to whom I have spoken estimate that about half of the posters on Kotaku In Action are pro-Trump. Some may have fallen for the Breitbart lure; others saw Trump as the answer to “political correctness” or shared his hostility to the mainstream media, which they (correctly) felt had been extremely shoddy and biased in its GamerGate coverage.\nThe slide toward Trumpism disappointed many GamerGate sympathizers; it also made some left-of-center GamerGaters such as Matt Jarbo — a.k.a. “Mundane Matt,” the YouTuber whose video on the Quinn cronyism allegations helped start the controversy — worry if they’ve helped elect Trump. “I definitely don’t want that on my conscience,” Jarbo joked uneasily in our recent interview. Others, such as fellow YouTuber Lapine, a self-described “proud social democrat,” dismiss the idea as “delusional.” As Lapine puts it, “everyone is always pointing fingers at who is to blame for Trump.”\nJung is just trying to work in a hit piece attacking the nationalist Right that she fears while ostensibly writing about GamerGate. It’s highly amusing that she takes shots at both Milo and Cerno, as well as the Alt Right, without ever mentioning the one individual who was, unlike either Mike or Milo, both a pre-Quinnspiracy OGGer and openly Alt-Right.\nBut mostly it’s bad journalism; she doesn’t bother to talk to any of the major GamerGate figures or follow-up on what has happened to them since, she has no idea why the backlash to GameJournoPros took place or even mention the exposure of the conspiracy and the mailing list, and she completely fails to make the connection between the tactics successfully utilized by GamerGate and the tactics that are now commonly used for everything from Sad Puppies to consumer lawfare against the SJWs and the social media giants.\nConsider what Jung claims to be the moral of the GamerGate story for conservatives:\nFor critics of the left, the main moral of the story is that it’s important to repudiate unsavory allies.\nIn other words, please cuck.\nThis is absolutely and entirely false.\nIf you want to understand GamerGate, you’d do far better to simply read chapter 8 of\nSJWS ALWAYS LIE\n, Striking Back at the Thought Police, which explained the relationship between GamerGate and Donald Trump back in 2015 at the very start of the chapter.\nThe reason SJWs have been so successful since the 1990s is that for more than two decades, they simply did not meet with any serious or organized resistance. #GamerGate represented the first serious organized resistance to them, and in only one year, the intrepid warriors of the gamer community have inspired similar resistance movements to surface in science fiction, in comics, and in romance. Echoes of #GamerGate have begun to appear in the popular culture, as Donald Trump not only refused to kowtow before Fox News’s Megyn Kelly flashing of the SJWs’ Woman card during the U.S. presidential debate but afterwards declared political correctness to be a big problem in the U.S.A. Trump’s unexpected popularity in the polls is, to a large extent, a consequence of his willingness to confront the SJW Narrative and speak the truth as he sees it.\n#GamerGate tactics are also beginning to be adopted by other groups for unrelated purposes, as there is a distinctly GG tone to the anti-Planned Parenthood memes that have been cropping up on Twitter ever since The Center for Medical Progress began releasing its sting-videos that showed Planned Parenthood employees openly discussing the sale of human organs taken from the infants it aborts. American immigration opponents have also successfully tarred some of the leading Republican candidates as well as their media supporters with the #cuckservative hashtag, much to the dismay of both the G.O.P. elite and the New York Times alike. It is therefore little wonder that SJWs are terrified of #GamerGate and see it as their most fearsome enemy.\nAn actual GamerGater commenting on Instapundit provides\na much better summary\n.\nI was in gamergate and it had several interesting aspects that I personally witnessed.\n1. Gamergate was first time I learned that SJWs don’t really care who they demonize\n. We had many Lefty type gamers that were astonished that they too would be declared “bad people” for defending their hobby.\n2. Organizations have more money then you could make a dent into with a boycott, but nobody ever has enough time.\nWe learned that you can overwhelm an organization’s customer facing department and PR with email and phone call campaigns.\n3. Never ever ever make someone a leader.\nThe Media loves to find leaders and smear them to smear the movement by proxy. Lots of people got smeared, lots of people lost their jobs.\n4. Mainstream conservatives are traitorous cunts and should never be trusted to guard an outhouse.\nWe tried to get so called conservative journalists interested in what we were doing. Most ignored us as they thought we were just “a bunch of nerds playing games in mom’s basement”, and of course we had the shitheads that said we were misogynists and games cause violence. In the end one guy gave us a fair shake, Milo Yiannopoulos and started giving us coverage. As per their nature the conservatives tried to deep six his ass and sent him to the fringes of society and the MSM was just giddy with the results.",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-06T12:45:12+00:00"
}