{
  "url": "https://voxday.net/2019/09/27/all-conservatives-are-cucks/",
  "scraped_at": "2025-12-21T02:59:52.359080",
  "title": "All conservatives are cucks",
  "date_display": "September 27, 2019",
  "date_iso": "2019-09-27T18:27:30+00:00",
  "date_from_url": "2019-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case I failed to make the point sufficiently clear in <i>Cuckservative</i>, former British Prime Minister and Conservative Party leader John Major has stepped in to clarify matters.</p><blockquote class=\"tr_bq\"><p>Most Conservatives are not a Brexit Party tribute band, nor have we abandoned our core values to find compromise, seek allies, and strive for unity, rather than division and disarray. We abhor the language of division and hate – and words such as ‘saboteur’, ‘traitor’, ‘enemy’, ‘surrender’, ‘betrayal’ have no place in our party, our politics, nor in our society.</p></blockquote><p>Do you understand the significance of what he is saying there? Because he is inadvertently speaking the plain and simple truth. The core value of the conservative <i>is the act of seeking compromise</i>. The art of the conservative is practicing politics as conversation rather than as a form of war.</p><p>That, in a nutshell, is why I have always said that I am not a conservative.</p><p>And it is also why conservativism is an intrinsically non-Christian identity, for all its evangelical trappings in the USA.</p><p><i>Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword. For I have come to turn “a man against his father, a daughter against her mother, a daughter-in-law against her mother-in-law—a man’s enemies will be the members of his own household.”</i><br>– Matthew 10:34-36</br></p></div>",
  "content_text": "In case I failed to make the point sufficiently clear in\nCuckservative\n, former British Prime Minister and Conservative Party leader John Major has stepped in to clarify matters.\nMost Conservatives are not a Brexit Party tribute band, nor have we abandoned our core values to find compromise, seek allies, and strive for unity, rather than division and disarray. We abhor the language of division and hate – and words such as ‘saboteur’, ‘traitor’, ‘enemy’, ‘surrender’, ‘betrayal’ have no place in our party, our politics, nor in our society.\nDo you understand the significance of what he is saying there? Because he is inadvertently speaking the plain and simple truth. The core value of the conservative\nis the act of seeking compromise\n. The art of the conservative is practicing politics as conversation rather than as a form of war.\nThat, in a nutshell, is why I have always said that I am not a conservative.\nAnd it is also why conservativism is an intrinsically non-Christian identity, for all its evangelical trappings in the USA.\nDo not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword. For I have come to turn “a man against his father, a daughter against her mother, a daughter-in-law against her mother-in-law—a man’s enemies will be the members of his own household.”\n– Matthew 10:34-36",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-27T17:27:30+00:00"
}