{
  "url": "https://voxday.net/2019/09/02/il-gattopardo/",
  "scraped_at": "2025-12-21T02:56:48.311705",
  "title": "Il Gattopardo",
  "date_display": "September 2, 2019",
  "date_iso": "2019-09-02T13:31:13+00:00",
  "date_from_url": "2019-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.unz.com/tlynch/the-leopard/\">A very thorough review</a> of the classic Italian film – and novel – <i>The Leopard</i>:</p><blockquote><p>Luchino Visconti’s masterpiece is his 1963 historical epic <i>The Leopard</i> (Il Gattopardo, which actually refers to a smaller spotted wild cat, the serval, which is the heraldic animal of the Princes of Salina in Sicily). Visconti’s film is a remarkably faithful adaptation of the 1958 novel of the same name by Giuseppe Tomasi di Lampedusa. <i>The Leopard</i> became the best-selling Italian novel of all time, carrying off many critical laurels as well. In its beauty of language, philosophical depth, and emotional power, <i>The Leopard</i> is one of the greatest novels I have ever read, and Visconti’s film does it full justice. Both are works of genius.</p><p>Set during the Risorgimento, the unification of Italy into a modern nation-state, <i>The Leopard</i> is sometimes called “the Italian <i>Gone with the Wind</i>,” which is an apt comparison, although <i>The Leopard</i> is better both as a book and a film. Like <i>Gone with the Wind</i>, <i>The Leopard</i> is a historical romance set against the backdrop of a war of national unification in which a modern, bourgeois-liberal industrial society (the Northern Kingdom of Piedmont and Sardinia, ruled from Turin by the House of Savoy), triumphs over a feudal, agrarian aristocracy (the Kingdom of the Two Sicilies, encompassing Sicily and Southern Italy and ruled from Naples by the house of Bourbon). Even the time period is basically the same. The novel <i>The Leopard</i> is set primarily in 1860–62, and the film takes place entirely in this time frame.</p><p>The story begins in May of 1860, when Giuseppe Garibaldi, a charismatic nationalist general, raised an insurgent force of 1000 volunteers and landed in Sicily to overthrow the Bourbons. The Garibaldini fought for no king or parliament. They fought for the nationalist idea. They fought for a unified Italy that did not yet exist.</p><p>Garibaldi fought his way to Palermo, declared himself dictator, then raised new troops to take the fight to the mainland, where he overthrew the last Bourbon king, Francis II. Then Garibaldi handed the kingdom over to king Victor Emanuel of Piedmont and Sardinia and retired into private life. Plebiscites were held throughout Italy, except in Venice, which was under Austrian rule. All of Italy, save the Papal States, agreed to unification under the House of Savoy. In 1862, Garibaldi raised an army to march on Rome and forcibly incorporate the Papal States, but he was stopped by troops loyal to the new unified kingdom.</p><p>Lampedusa was a Sicilian aristocrat and a partisan of aristocracy. As a study of classical aristocratic virtues, <i>The Leopard</i> can be placed alongside Aristotle’s<i> Nicomachean Ethics</i>. As a meditation on the decline of aristocracy into oligarchy, it can be placed alongside Plato’s <i>Republic</i>. Visconti, however, was both an aristocrat and a self-professed Communist. Thus his adaptation also highlights other aspects of the novel, dramatizing how the revolutionary energies unleashed by the ideas of the sovereign people and a unified national state were coopted by the old Italian aristocracy and corrupted by the rising middle classes.</p></blockquote><p><i>The Leopard</i> is very much the Italian <i>Gone With the Wind</i>. I’ve read it twice, and I highly recommend the novel to anyone. I haven’t seen the film yet, but I intend to do so soon. Read the whole review <a href=\"http://www.unz.com/tlynch/the-leopard/\">there</a>.</p></div>",
  "content_text": "A very thorough review\nof the classic Italian film – and novel –\nThe Leopard\n:\nLuchino Visconti’s masterpiece is his 1963 historical epic\nThe Leopard\n(Il Gattopardo, which actually refers to a smaller spotted wild cat, the serval, which is the heraldic animal of the Princes of Salina in Sicily). Visconti’s film is a remarkably faithful adaptation of the 1958 novel of the same name by Giuseppe Tomasi di Lampedusa.\nThe Leopard\nbecame the best-selling Italian novel of all time, carrying off many critical laurels as well. In its beauty of language, philosophical depth, and emotional power,\nThe Leopard\nis one of the greatest novels I have ever read, and Visconti’s film does it full justice. Both are works of genius.\nSet during the Risorgimento, the unification of Italy into a modern nation-state,\nThe Leopard\nis sometimes called “the Italian\nGone with the Wind\n,” which is an apt comparison, although\nThe Leopard\nis better both as a book and a film. Like\nGone with the Wind\n,\nThe Leopard\nis a historical romance set against the backdrop of a war of national unification in which a modern, bourgeois-liberal industrial society (the Northern Kingdom of Piedmont and Sardinia, ruled from Turin by the House of Savoy), triumphs over a feudal, agrarian aristocracy (the Kingdom of the Two Sicilies, encompassing Sicily and Southern Italy and ruled from Naples by the house of Bourbon). Even the time period is basically the same. The novel\nThe Leopard\nis set primarily in 1860–62, and the film takes place entirely in this time frame.\nThe story begins in May of 1860, when Giuseppe Garibaldi, a charismatic nationalist general, raised an insurgent force of 1000 volunteers and landed in Sicily to overthrow the Bourbons. The Garibaldini fought for no king or parliament. They fought for the nationalist idea. They fought for a unified Italy that did not yet exist.\nGaribaldi fought his way to Palermo, declared himself dictator, then raised new troops to take the fight to the mainland, where he overthrew the last Bourbon king, Francis II. Then Garibaldi handed the kingdom over to king Victor Emanuel of Piedmont and Sardinia and retired into private life. Plebiscites were held throughout Italy, except in Venice, which was under Austrian rule. All of Italy, save the Papal States, agreed to unification under the House of Savoy. In 1862, Garibaldi raised an army to march on Rome and forcibly incorporate the Papal States, but he was stopped by troops loyal to the new unified kingdom.\nLampedusa was a Sicilian aristocrat and a partisan of aristocracy. As a study of classical aristocratic virtues,\nThe Leopard\ncan be placed alongside Aristotle’s\nNicomachean Ethics\n. As a meditation on the decline of aristocracy into oligarchy, it can be placed alongside Plato’s\nRepublic\n. Visconti, however, was both an aristocrat and a self-professed Communist. Thus his adaptation also highlights other aspects of the novel, dramatizing how the revolutionary energies unleashed by the ideas of the sovereign people and a unified national state were coopted by the old Italian aristocracy and corrupted by the rising middle classes.\nThe Leopard\nis very much the Italian\nGone With the Wind\n. I’ve read it twice, and I highly recommend the novel to anyone. I haven’t seen the film yet, but I intend to do so soon. Read the whole review\nthere\n.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-02T12:31:13+00:00"
}