{
  "url": "https://voxday.net/2019/09/18/philosophizing-in-the-best-possible-way/",
  "scraped_at": "2025-12-21T02:58:41.682496",
  "title": "Philosophizing in the best possible way",
  "date_display": "September 18, 2019",
  "date_iso": "2019-09-18T14:31:05+00:00",
  "date_from_url": "2019-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Pope Leo XIII explains why it is important for Christians of an intellectual bent to read The Summa Theologica by St. Thomas Aquinas.</i></p><p>Whoso turns his attention to the bitter strifes of these days and seeks a reason for the troubles that vex public and private life must come to the conclusion that a fruitful cause of the evils which now afflict, as well as those which threaten, us lies in this: that false conclusions concerning divine and human things, which originated in the schools of philosophy, have now crept into all the orders of the State, and have been accepted by the common consent of the masses. For, since it is in the very nature of man to follow the guide of reason in his actions, if his intellect sins at all his will soon follows; and thus it happens that false opinions, whose seat is in the understanding, influence human actions and pervert them.</p><p>Whereas, on the other hand, if men be of sound mind and take their stand on true and solid principles, there will result a vast amount of benefits for the public and private good. We do not, indeed, attribute such force and authority to philosophy as to esteem it equal to the task of combating and rooting out all errors; for, when the Christian religion was first constituted, it came upon earth to restore it to its primeval dignity by the admirable light of faith, diffused “not by persuasive words of human wisdom, but in the manifestation of spirit and of power,” so also at the present time we look above all things to the powerful help of Almighty God to bring back to a right understanding the minds of man and dispel the darkness of error.</p><p>But the natural helps with which the grace of the divine wisdom, strongly and sweetly disposing all things, has supplied the human race are neither to be despised nor neglected, chief among which is evidently the right use of philosophy. For, not in vain did God set the light of reason in the human mind; and so far is the super-added light of faith from extinguishing or lessening the power of the intelligence that it completes it rather, and by adding to its strength renders it capable of greater things.</p><p>We know that there are some who, in their overestimate of the human faculties, maintain that as soon as man’s intellect becomes subject to divine authority it falls from its native dignity, and hampered by the yoke of this species of slavery, is much retarded and hindered in its progress toward the supreme truth and excellence. Such an idea is most false and deceptive, and its sole tendency is to induce foolish and ungrateful men wilfully to repudiate the most sublime truths, and reject the divine gift of faith, from which the fountains of all good things flow out upon civil society.</p><p>For the human mind, being confined within certain limits, and those narrow enough, is exposed to many errors and is ignorant of many things; whereas the Christian faith, reposing on the authority of God, is the unfailing mistress of truth, whom whoso followeth he will be neither enmeshed in the snares of error nor tossed hither and thither on the waves of fluctuating opinion. Those, therefore, who to the study of philosophy unite obedience to the Christian faith, are philosophizing in the best possible way.</p><p><i>The best way back from the Jesuit Church of Reason that has replaced the traditional Roman Catholic Church is <a href=\"https://www.crisismagazine.com/2019/vigano-speaks-the-infiltration-is-real\">a rejection of its surrender to the world</a> and its prince. And the intellectual foundation for this rejection and subsequent reformation will be found in the Church Fathers.</i></p><blockquote><p>In <i>La Nuova Chiesa di Karl Rahner</i>, Stefano Fontana soberingly traces the genealogy of Pope Francis’s “open Church” back to Rahner, the towering radical suspected of heterodoxy under Pope Pius XII. As Fontana shows, Rahner negotiated a “surrender to the world” which is being registered in this pontificate’s signature agendas—from Communion for adulterers and the ordination of married men to the enthronement of “conscience” and the rapid abandonment of evangelization.</p><p>Historian Roberto de Mattei likewise calls Rahner the Pope’s “grandfather,” arguing that the two Jesuits are linked through a third—Carlo Cardinal Martini, leader of the St. Gallen mafia and Pope Francis’s “father.” “The agenda of Cardinal Martini, which is the same as Rahner’s, offers us the key to understanding the papacy of Pope Francis,” says de Mattei, pointing to the Cardinal’s fiery last interview calling for the autonomy of conscience and Communion for adulterers.</p></blockquote></div>",
  "content_text": "Pope Leo XIII explains why it is important for Christians of an intellectual bent to read The Summa Theologica by St. Thomas Aquinas.\nWhoso turns his attention to the bitter strifes of these days and seeks a reason for the troubles that vex public and private life must come to the conclusion that a fruitful cause of the evils which now afflict, as well as those which threaten, us lies in this: that false conclusions concerning divine and human things, which originated in the schools of philosophy, have now crept into all the orders of the State, and have been accepted by the common consent of the masses. For, since it is in the very nature of man to follow the guide of reason in his actions, if his intellect sins at all his will soon follows; and thus it happens that false opinions, whose seat is in the understanding, influence human actions and pervert them.\nWhereas, on the other hand, if men be of sound mind and take their stand on true and solid principles, there will result a vast amount of benefits for the public and private good. We do not, indeed, attribute such force and authority to philosophy as to esteem it equal to the task of combating and rooting out all errors; for, when the Christian religion was first constituted, it came upon earth to restore it to its primeval dignity by the admirable light of faith, diffused “not by persuasive words of human wisdom, but in the manifestation of spirit and of power,” so also at the present time we look above all things to the powerful help of Almighty God to bring back to a right understanding the minds of man and dispel the darkness of error.\nBut the natural helps with which the grace of the divine wisdom, strongly and sweetly disposing all things, has supplied the human race are neither to be despised nor neglected, chief among which is evidently the right use of philosophy. For, not in vain did God set the light of reason in the human mind; and so far is the super-added light of faith from extinguishing or lessening the power of the intelligence that it completes it rather, and by adding to its strength renders it capable of greater things.\nWe know that there are some who, in their overestimate of the human faculties, maintain that as soon as man’s intellect becomes subject to divine authority it falls from its native dignity, and hampered by the yoke of this species of slavery, is much retarded and hindered in its progress toward the supreme truth and excellence. Such an idea is most false and deceptive, and its sole tendency is to induce foolish and ungrateful men wilfully to repudiate the most sublime truths, and reject the divine gift of faith, from which the fountains of all good things flow out upon civil society.\nFor the human mind, being confined within certain limits, and those narrow enough, is exposed to many errors and is ignorant of many things; whereas the Christian faith, reposing on the authority of God, is the unfailing mistress of truth, whom whoso followeth he will be neither enmeshed in the snares of error nor tossed hither and thither on the waves of fluctuating opinion. Those, therefore, who to the study of philosophy unite obedience to the Christian faith, are philosophizing in the best possible way.\nThe best way back from the Jesuit Church of Reason that has replaced the traditional Roman Catholic Church is\na rejection of its surrender to the world\nand its prince. And the intellectual foundation for this rejection and subsequent reformation will be found in the Church Fathers.\nIn\nLa Nuova Chiesa di Karl Rahner\n, Stefano Fontana soberingly traces the genealogy of Pope Francis’s “open Church” back to Rahner, the towering radical suspected of heterodoxy under Pope Pius XII. As Fontana shows, Rahner negotiated a “surrender to the world” which is being registered in this pontificate’s signature agendas—from Communion for adulterers and the ordination of married men to the enthronement of “conscience” and the rapid abandonment of evangelization.\nHistorian Roberto de Mattei likewise calls Rahner the Pope’s “grandfather,” arguing that the two Jesuits are linked through a third—Carlo Cardinal Martini, leader of the St. Gallen mafia and Pope Francis’s “father.” “The agenda of Cardinal Martini, which is the same as Rahner’s, offers us the key to understanding the papacy of Pope Francis,” says de Mattei, pointing to the Cardinal’s fiery last interview calling for the autonomy of conscience and Communion for adulterers.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-18T13:31:05+00:00"
}