{
  "url": "https://voxday.net/2019/09/30/psychoanalysis-as-pedocover/",
  "scraped_at": "2025-12-21T03:00:15.182736",
  "title": "Psychoanalysis as pedocover",
  "date_display": "September 30, 2019",
  "date_iso": "2019-09-30T16:02:11+00:00",
  "date_from_url": "2019-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve always believed that Freud and Freudianism were pure and unmitigated nonsense. But, as it happens, both the man and his pseudoscience were actually <a href=\"http://www.unz.com/article/freud-sexual-abuse-and-cover-up/\">a good deal worse than I had ever imagined</a>.</p><blockquote><p>Freud, having stumbled upon the widespread reality of child abuse among his mostly Jewish clientele, covered it up with the theory that all little girls desire their fathers’ penis and all little boys dream of screwing their mothers — and named his theory after a Gentile myth….</p><p>Denial means projection: to protect the dirty secret of child abuse in Jewish families—including his own—, Freud projected an imaginary repressed infantile perversion on all mankind. Projection, in turn, means inversion: Freud’s close disciple Otto Rank claimed that Jews had a more primitive, and therefore more healthy sexuality than Gentiles (Rank, “The Essence of Judaism,” 1905). Freudians and Freudo-Marxists have systematically denounced Christian civilization as suffering from sexual repression. According to Wilhelm Reich, anti-Semitism is itself a symptom of sexual frustration, and could be cured by sexual liberation (<i>The Mass Psychology of Fascism</i>, 1934)—an improvement from Leo Pinsker’s theory that Judeophobia was a “hereditary” and “incurable” “disease transmitted for two thousand years.” In order to understand the psychological background of this Reichian messianic mission to cure the Christian West, and in order to see more clearly the projective nature of the psychoanalytical theory of repression, it is helpful to know the personal story of Wilhelm Reich, which reads as a caricature of Freud’s: At ten years old, when he realized that his mother was having an affair with his tutor, the young Wilhelm thought of blackmailing his mother into having sex with him. Eventually, he confided in his father about his mother’s adultery. In 1910, after a period of beatings from his father, his mother committed suicide, for which Reich blamed himself.</p><p>One of the most puzzling aspects of Jews’ relationship with their host nations is its ambivalence—patterned on biblical “history”: within Jewish thinking, saving the nations and destroying them are not two sides of the same coin, but one and the same, because what nations are supposed to be cured of is their very identity (their gods, in biblical terms). According to Andrew Heinze, author of <i>Jews and the American Soul</i>, Jews have shaped “American ideas about the mind and soul” with the preoccupation “to purge the evils they associated with Christian civilization.” It really started with Freud. In September 1909, invited to give a series of lectures in New England, Freud jokingly asked his companions, Sandor Ferenczi and Carl Jung: “Don‘t they know we’re bringing them the plague?” An extraordinary statement for a medical doctor pretending to have found a “cure” for neurosis. And a prophetic one: Freudism became a justification for a sexual “liberation” that can be seen in retrospect as a massive sexual abuse of the youth.</p></blockquote><p>Sexual repression is not the problem. And the “sexual liberation” that is sought is nothing less than societal approval for incestuous child rape. Forget the Chinese, forget the Nazis, at this point I would take Quetzalcoatl-worshipping Aztecs over the Freudians and their devil dreams of Babel 2.0. By their fruits, <a href=\"https://www.telegraph.co.uk/news/2016/06/14/sir-clement-freud-exposed-as-a-paedophile-as-police-urged-to-pro/\">ye shall know them</a>.</p><p>And just to make things worse, if you actually trouble to read Keynes’s General Theory, you’ll soon discover that its all-important “animal spirits” are nothing more than Freud applied to economics. What this implies about the foundation of the global macroeconomic perspective of the last eighty years I leave it to the reader to conclude on his own.</p></div>",
  "content_text": "I’ve always believed that Freud and Freudianism were pure and unmitigated nonsense. But, as it happens, both the man and his pseudoscience were actually\na good deal worse than I had ever imagined\n.\nFreud, having stumbled upon the widespread reality of child abuse among his mostly Jewish clientele, covered it up with the theory that all little girls desire their fathers’ penis and all little boys dream of screwing their mothers — and named his theory after a Gentile myth….\nDenial means projection: to protect the dirty secret of child abuse in Jewish families—including his own—, Freud projected an imaginary repressed infantile perversion on all mankind. Projection, in turn, means inversion: Freud’s close disciple Otto Rank claimed that Jews had a more primitive, and therefore more healthy sexuality than Gentiles (Rank, “The Essence of Judaism,” 1905). Freudians and Freudo-Marxists have systematically denounced Christian civilization as suffering from sexual repression. According to Wilhelm Reich, anti-Semitism is itself a symptom of sexual frustration, and could be cured by sexual liberation (\nThe Mass Psychology of Fascism\n, 1934)—an improvement from Leo Pinsker’s theory that Judeophobia was a “hereditary” and “incurable” “disease transmitted for two thousand years.” In order to understand the psychological background of this Reichian messianic mission to cure the Christian West, and in order to see more clearly the projective nature of the psychoanalytical theory of repression, it is helpful to know the personal story of Wilhelm Reich, which reads as a caricature of Freud’s: At ten years old, when he realized that his mother was having an affair with his tutor, the young Wilhelm thought of blackmailing his mother into having sex with him. Eventually, he confided in his father about his mother’s adultery. In 1910, after a period of beatings from his father, his mother committed suicide, for which Reich blamed himself.\nOne of the most puzzling aspects of Jews’ relationship with their host nations is its ambivalence—patterned on biblical “history”: within Jewish thinking, saving the nations and destroying them are not two sides of the same coin, but one and the same, because what nations are supposed to be cured of is their very identity (their gods, in biblical terms). According to Andrew Heinze, author of\nJews and the American Soul\n, Jews have shaped “American ideas about the mind and soul” with the preoccupation “to purge the evils they associated with Christian civilization.” It really started with Freud. In September 1909, invited to give a series of lectures in New England, Freud jokingly asked his companions, Sandor Ferenczi and Carl Jung: “Don‘t they know we’re bringing them the plague?” An extraordinary statement for a medical doctor pretending to have found a “cure” for neurosis. And a prophetic one: Freudism became a justification for a sexual “liberation” that can be seen in retrospect as a massive sexual abuse of the youth.\nSexual repression is not the problem. And the “sexual liberation” that is sought is nothing less than societal approval for incestuous child rape. Forget the Chinese, forget the Nazis, at this point I would take Quetzalcoatl-worshipping Aztecs over the Freudians and their devil dreams of Babel 2.0. By their fruits,\nye shall know them\n.\nAnd just to make things worse, if you actually trouble to read Keynes’s General Theory, you’ll soon discover that its all-important “animal spirits” are nothing more than Freud applied to economics. What this implies about the foundation of the global macroeconomic perspective of the last eighty years I leave it to the reader to conclude on his own.",
  "tags": [
    "ClashofCivilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-30T15:02:11+00:00"
}