{
  "url": "https://voxday.net/2019/09/03/solving-the-current-crisis/",
  "scraped_at": "2025-12-21T02:56:51.594938",
  "title": "Solving the current crisis",
  "date_display": "September 3, 2019",
  "date_iso": "2019-09-03T10:40:09+00:00",
  "date_from_url": "2019-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While Babymetal has tried a number of different approaches for replacing the irreplaceable, none of them has come even close to working. I refer, of course, to the absence of Yui; they always had a guitarist to spare, so as much as “the smiley guy” is sorely missed – and who did not notice Ohmura playing his late friend’s red guitar instead of Pink-chan at Glastonbury – they have always had more than adequate options on hand.</p><p>However, in light of the third iteration of Ladybaby, there are two solid possible replacements. The more obvious one <a href=\"https://youtu.be/mMWwyRSsL5E?t=21\">is Fuka</a>, who actually bears some resemblance to Yui and has a similar low-key stage presence. But a more intriguing possibility is Rie, who has become the leader of Ladybaby as it has <a href=\"https://youtu.be/iqBFMF15qZU\">made a transition</a> similar to the one that Babymetal went through when it ditched the Babybones dancers in favor of the brilliant musicians of the Kami Band.</p><p>Speaking of the Kami Band, if that guitar riff from Haten Ni Ramei was any more Onedari Daisuken, they’d have had to put the guitarist in a sheet and paint his face white. Although it is a pity that with the addition of the live band, Ladybaby didn’t retain much of <a href=\"https://www.youtube.com/watch?v=MDi-P0G9VMU\">the kawai dance</a>.</p><p>Anyhow, as <a href=\"https://www.youtube.com/watch?v=tHwI58T4r_o\">this live version of Nippon Manju</a> shows, Rie has the energy and charisma to keep up with Su, and although her voice isn’t as strong, it has a nice and identifiable sound to it. And it would be interesting to see Babymetal pair someone up with Su rather than Moa.</p><p>Actually, there is a third option that might actually be the best one. What is Rei doing these days? Okay… <a href=\"https://www.youtube.com/watch?v=tSXfJHUEKjI\">was really not expecting that</a>.</p></div>",
  "content_text": "While Babymetal has tried a number of different approaches for replacing the irreplaceable, none of them has come even close to working. I refer, of course, to the absence of Yui; they always had a guitarist to spare, so as much as “the smiley guy” is sorely missed – and who did not notice Ohmura playing his late friend’s red guitar instead of Pink-chan at Glastonbury – they have always had more than adequate options on hand.\nHowever, in light of the third iteration of Ladybaby, there are two solid possible replacements. The more obvious one\nis Fuka\n, who actually bears some resemblance to Yui and has a similar low-key stage presence. But a more intriguing possibility is Rie, who has become the leader of Ladybaby as it has\nmade a transition\nsimilar to the one that Babymetal went through when it ditched the Babybones dancers in favor of the brilliant musicians of the Kami Band.\nSpeaking of the Kami Band, if that guitar riff from Haten Ni Ramei was any more Onedari Daisuken, they’d have had to put the guitarist in a sheet and paint his face white. Although it is a pity that with the addition of the live band, Ladybaby didn’t retain much of\nthe kawai dance\n.\nAnyhow, as\nthis live version of Nippon Manju\nshows, Rie has the energy and charisma to keep up with Su, and although her voice isn’t as strong, it has a nice and identifiable sound to it. And it would be interesting to see Babymetal pair someone up with Su rather than Moa.\nActually, there is a third option that might actually be the best one. What is Rei doing these days? Okay…\nwas really not expecting that\n.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-03T09:40:09+00:00"
}