{
  "url": "https://voxday.net/2019/09/01/the-z-man-guarantees-warren-2020/",
  "scraped_at": "2025-12-21T02:56:41.335104",
  "title": "The Z-Man guarantees Warren 2020",
  "date_display": "September 1, 2019",
  "date_iso": "2019-09-01T12:11:46+00:00",
  "date_from_url": "2019-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always wise to put these predictions on the record well ahead of time, before the predictors start performing the Scott Adams two-step. The Z-Man <a href=\"https://thezman.com/wordpress/?p=18527\">contemplates the upcoming 2020 US Presidential election</a> and confidently makes his call:</p><blockquote><p>The 2020 presidential campaign will be two sides of the 60’s Boomer culture, facing off against one another in one final battle. The male side, represented by Donald Trump, is nostalgic for an America that no longer exists. Trump sees himself as this generation’s Ronald Reagan. Instead of morning in American, though, it is dusk in America. His tenure is a cargo cult of sorts. He and his supporters seem to think if they carry on like it is 1985, it will suddenly become 1985. Trump is pure nostalgia.</p><p>Warren is the feminine side of this battle. Unlike Trump, she is not pining for a return to Reagan’s America. She is all of the liberal Boomers in the 80’s and 90’s, who talked about the terribleness of Reaganism, while enjoying the benefits. Just as Boomer feminists talked like Betty Friedan, but lived like June Cleaver, this side of the Boomer political culture publicly hated Reagan and the 80’s economic boom, but privately benefited from it. The conscience of the 60’s was always forgiving….</p><p>I guarantee you she will run as the person who wrote the book, <i>The Two Income Trap</i>. And she will win. Trump, for all his stupidity, has known Warren was his big problem all along. That’s why he went after her two years ago.</p></blockquote><p>I disagree, of course. I remain quite confident that President Trump <a href=\"https://crypto.fashion/collections/dark-lord-designs/products/trumpsl-de-2020-t-shirt-ladies-v-neck\">will win in 2020</a>, and by a bigger Electoral College margin than he did in 2016. And while I agree that Warren currently looks like the most likely Democratic nominee, I think it is too soon to declare that she will be the nominee, much less the eventual winner, let alone guarantee it. I’ve seen far too many media-anointed frontrunners wilt under the pressure of the actual caucuses and primaries to express any opinion on the matter yet.</p></div>",
  "content_text": "It’s always wise to put these predictions on the record well ahead of time, before the predictors start performing the Scott Adams two-step. The Z-Man\ncontemplates the upcoming 2020 US Presidential election\nand confidently makes his call:\nThe 2020 presidential campaign will be two sides of the 60’s Boomer culture, facing off against one another in one final battle. The male side, represented by Donald Trump, is nostalgic for an America that no longer exists. Trump sees himself as this generation’s Ronald Reagan. Instead of morning in American, though, it is dusk in America. His tenure is a cargo cult of sorts. He and his supporters seem to think if they carry on like it is 1985, it will suddenly become 1985. Trump is pure nostalgia.\nWarren is the feminine side of this battle. Unlike Trump, she is not pining for a return to Reagan’s America. She is all of the liberal Boomers in the 80’s and 90’s, who talked about the terribleness of Reaganism, while enjoying the benefits. Just as Boomer feminists talked like Betty Friedan, but lived like June Cleaver, this side of the Boomer political culture publicly hated Reagan and the 80’s economic boom, but privately benefited from it. The conscience of the 60’s was always forgiving….\nI guarantee you she will run as the person who wrote the book,\nThe Two Income Trap\n. And she will win. Trump, for all his stupidity, has known Warren was his big problem all along. That’s why he went after her two years ago.\nI disagree, of course. I remain quite confident that President Trump\nwill win in 2020\n, and by a bigger Electoral College margin than he did in 2016. And while I agree that Warren currently looks like the most likely Democratic nominee, I think it is too soon to declare that she will be the nominee, much less the eventual winner, let alone guarantee it. I’ve seen far too many media-anointed frontrunners wilt under the pressure of the actual caucuses and primaries to express any opinion on the matter yet.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-01T11:11:46+00:00"
}