{
  "url": "https://voxday.net/2019/09/16/this-is-what-it-sounds-like-2/",
  "scraped_at": "2025-12-21T02:58:29.900134",
  "title": "This is what it sounds like",
  "date_display": "September 16, 2019",
  "date_iso": "2019-09-16T12:23:43+00:00",
  "date_from_url": "2019-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do NOT ever attempt fiction if you are not a professional writer of it. Believe it or not, there is actually an amount of skill involved in creating a sense of verisimilitude in storytelling. And the first lesson is this: <i>write what you know</i>. Which means, if you are an individual from one identity group, do not attempt to invent details about other identity groups. You WILL get it wrong. In fact, you will not only get it wrong, you will get it LAUGHABLY wrong.</p><p>Michael Harriot <a href=\"https://twitter.com/michaelharriot/status/1172904996880441350\">dissects Joe Biden’s tale</a> of an encounter with a gang leader named Corn Pop that was the highlight of his 1962 Negro Summer Safari Adventure.</p><blockquote><p>I’m always astounded by the imaginings of white people as it relates to race. Many of them have this fictionalized jigaboo version that is almost alien-like. And one of the greatest examples of this ever is Joe Biden’s story about Corn Pop the gangsta.</p><p>Now it has already been demonstrably proven that Biden will make stuff up. But any black person who hears this story will automatically give you the side-eye and  says: “nigga please.”</p><p>It begins when Biden was working as a lifeguard at a pool.</p><p>Now Biden is like, 176 years old, but he’s still in pretty good shape. This supposedly happened in the summer of 1962. Biden says that, instead of hanging out all summer, he decided to take a job working as a lifeguard at a black pool.</p><p>So, that summer, Biden was the only white lifeguard at Prices Run swimming pool in Brown-Burton Winchester Park. He says he did it—y’all, I SWEAR this is true—”in hopes of learning more about the black community.” Yes, that’s an actual quote.</p><p>Biden says that he became popular at the pool because many of the black people in Wilmington, DE had never talked to a white person before. This raised by bullshit-o-meter, so I decided to look it up. In 1960, Wilmington was 73{ca04638509ab7618004169842ba062d20ec7073b69e1f0489735ce6a44ff3be4} white, according to census records</p><p>Anyway, during Biden’s Negro Summer Safari Adventure, one day, all of the town gangsters came to the pool. Now I know what you’re thinking, but don’t stereotype. Gangbangers are NOT a monolith.</p><p>Why can’t a real street nigga enjoy a nice refreshing dip? Sometimes a thug wants to play Marco Polo, too. Well, the gang that invaded Biden’s pool was called the Romans, which sounds gangsta AF. And the leader of the Romans was a dude named Corn Pop.</p><p>Now if you’re black, I know this shit sounds like some white kid tried to make a gang fairy tale for a sixth-grade play because you and I know there ain’t no squad led by a nigga named Corn Pop going around terrorizing Delaware pools.</p><p>But, I guess, in white people minds, thugs get two weeks vacation and go on retreats at city pools. Anyway, Biden says he had no idea that Corn Pop was the duly elected leader of the hood niggas. So when Corn Pop began bouncing on the diving board, which was against the rules,</p><p>Biden told him:</p><p>“Esther Williams! Get off the board, man…”</p><p>Then Biden kicked Corn Pop out of the pool. (I know you’re thinking “Who TF is Esther Williams?” She was a famous swimmer in the 50s. But I admit, I thought he was talking about the lady who played Florida Evans, too)</p><p>Anyway, after he kicked the probably fictitious Corn Pop out of the pool, everybody was like: They told Biden that Corn Pop carried a straight razor and was gonna be waiting for him when he got off work. Now you and I both know that, if this was true, Biden would’ve just called the cops to walk him to the car.</p><p>But this was in 1962, and before 911, you had to dial a whole seven numbers. Plus, Biden said that he knew that if he called the cops, he wouldn’t be allowed back into the African American community</p><p>Nigga, what?</p><p>Anyway, Biden says, instead he wrapped a six-foot metal chain around his arm and wrapped that in a towel. Because everyone knows there are ample black chains just laying around the “African America community” but no police officers.</p><p>When he went out to the car, Corn Pop was indeed waiting for him. But Biden went Clint Eastwood on Corn and told OG Pop from the Romans:</p><p>“You might cut me, Corn Pop, but I’m going to wrap this chain around your head before you do.”</p><p>Again, that is a direct quote.</p><p>And guess what happened?</p><p>Just like that, my nigga CP put down the straight razor and he and Biden became friends. From that day own, Biden was untouchable in the black community because Corn Pop vouched for him</p><p>Again, STOP LAUGHING!</p><p>Now I don’t know how it works where you live, but in my hood, you don’t actually get a laminated street credential card from the neighborhood thug council but, then again, I’ve never been on the mean streets of Wilmington. But this story is actually recounted in Joe Biden’s 2007 autobiography AND <a href=\"https://t.co/oN2TCKwKsw\">is retold in the Washington Post, here</a>.</p><p>But this is not about Biden.</p><p>This is a celebration of the life of a straight razor-carrying certified street thug who I’d bet my pinky toe never existed. But if you ask Biden, I bet he’d say Corn Pop has passed on.</p><p>RIP my nigga Corn Pop. This is how it sounds when thugs die.</p></blockquote><p>Of course, back in the 1970s, when Joe Biden was still semi-coherent, white Boomers knew so little about blacks that a water-loving gang leader named Corn Pop who <i>carried a knife</i> might have actually sounded credible to them. I very much doubt there is a single member of the Gen-X generational cohort, be he red or yellow, black or white, who could have heard that story with laughing out loud and immediately calling BS on it.</p><p>And “the Romans”? He might as well have said Corn Pop was the leader of the Sharks and threatened him with a scary doo-wop number sung acapella.</p><p>Boomers are such cheeseballs. They believe everything they are told by anyone they recognize as an authority figure.</p><p><i>Ceterum, non enim ad lunam.</i></p></div>",
  "content_text": "Do NOT ever attempt fiction if you are not a professional writer of it. Believe it or not, there is actually an amount of skill involved in creating a sense of verisimilitude in storytelling. And the first lesson is this:\nwrite what you know\n. Which means, if you are an individual from one identity group, do not attempt to invent details about other identity groups. You WILL get it wrong. In fact, you will not only get it wrong, you will get it LAUGHABLY wrong.\nMichael Harriot\ndissects Joe Biden’s tale\nof an encounter with a gang leader named Corn Pop that was the highlight of his 1962 Negro Summer Safari Adventure.\nI’m always astounded by the imaginings of white people as it relates to race. Many of them have this fictionalized jigaboo version that is almost alien-like. And one of the greatest examples of this ever is Joe Biden’s story about Corn Pop the gangsta.\nNow it has already been demonstrably proven that Biden will make stuff up. But any black person who hears this story will automatically give you the side-eye and  says: “nigga please.”\nIt begins when Biden was working as a lifeguard at a pool.\nNow Biden is like, 176 years old, but he’s still in pretty good shape. This supposedly happened in the summer of 1962. Biden says that, instead of hanging out all summer, he decided to take a job working as a lifeguard at a black pool.\nSo, that summer, Biden was the only white lifeguard at Prices Run swimming pool in Brown-Burton Winchester Park. He says he did it—y’all, I SWEAR this is true—”in hopes of learning more about the black community.” Yes, that’s an actual quote.\nBiden says that he became popular at the pool because many of the black people in Wilmington, DE had never talked to a white person before. This raised by bullshit-o-meter, so I decided to look it up. In 1960, Wilmington was 73{ca04638509ab7618004169842ba062d20ec7073b69e1f0489735ce6a44ff3be4} white, according to census records\nAnyway, during Biden’s Negro Summer Safari Adventure, one day, all of the town gangsters came to the pool. Now I know what you’re thinking, but don’t stereotype. Gangbangers are NOT a monolith.\nWhy can’t a real street nigga enjoy a nice refreshing dip? Sometimes a thug wants to play Marco Polo, too. Well, the gang that invaded Biden’s pool was called the Romans, which sounds gangsta AF. And the leader of the Romans was a dude named Corn Pop.\nNow if you’re black, I know this shit sounds like some white kid tried to make a gang fairy tale for a sixth-grade play because you and I know there ain’t no squad led by a nigga named Corn Pop going around terrorizing Delaware pools.\nBut, I guess, in white people minds, thugs get two weeks vacation and go on retreats at city pools. Anyway, Biden says he had no idea that Corn Pop was the duly elected leader of the hood niggas. So when Corn Pop began bouncing on the diving board, which was against the rules,\nBiden told him:\n“Esther Williams! Get off the board, man…”\nThen Biden kicked Corn Pop out of the pool. (I know you’re thinking “Who TF is Esther Williams?” She was a famous swimmer in the 50s. But I admit, I thought he was talking about the lady who played Florida Evans, too)\nAnyway, after he kicked the probably fictitious Corn Pop out of the pool, everybody was like: They told Biden that Corn Pop carried a straight razor and was gonna be waiting for him when he got off work. Now you and I both know that, if this was true, Biden would’ve just called the cops to walk him to the car.\nBut this was in 1962, and before 911, you had to dial a whole seven numbers. Plus, Biden said that he knew that if he called the cops, he wouldn’t be allowed back into the African American community\nNigga, what?\nAnyway, Biden says, instead he wrapped a six-foot metal chain around his arm and wrapped that in a towel. Because everyone knows there are ample black chains just laying around the “African America community” but no police officers.\nWhen he went out to the car, Corn Pop was indeed waiting for him. But Biden went Clint Eastwood on Corn and told OG Pop from the Romans:\n“You might cut me, Corn Pop, but I’m going to wrap this chain around your head before you do.”\nAgain, that is a direct quote.\nAnd guess what happened?\nJust like that, my nigga CP put down the straight razor and he and Biden became friends. From that day own, Biden was untouchable in the black community because Corn Pop vouched for him\nAgain, STOP LAUGHING!\nNow I don’t know how it works where you live, but in my hood, you don’t actually get a laminated street credential card from the neighborhood thug council but, then again, I’ve never been on the mean streets of Wilmington. But this story is actually recounted in Joe Biden’s 2007 autobiography AND\nis retold in the Washington Post, here\n.\nBut this is not about Biden.\nThis is a celebration of the life of a straight razor-carrying certified street thug who I’d bet my pinky toe never existed. But if you ask Biden, I bet he’d say Corn Pop has passed on.\nRIP my nigga Corn Pop. This is how it sounds when thugs die.\nOf course, back in the 1970s, when Joe Biden was still semi-coherent, white Boomers knew so little about blacks that a water-loving gang leader named Corn Pop who\ncarried a knife\nmight have actually sounded credible to them. I very much doubt there is a single member of the Gen-X generational cohort, be he red or yellow, black or white, who could have heard that story with laughing out loud and immediately calling BS on it.\nAnd “the Romans”? He might as well have said Corn Pop was the leader of the Sharks and threatened him with a scary doo-wop number sung acapella.\nBoomers are such cheeseballs. They believe everything they are told by anyone they recognize as an authority figure.\nCeterum, non enim ad lunam.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-16T11:23:43+00:00"
}