{
  "url": "https://voxday.net/2019/09/30/why-china-is-on-the-rise/",
  "scraped_at": "2025-12-21T03:00:13.360099",
  "title": "Why China is on the rise",
  "date_display": "September 30, 2019",
  "date_iso": "2019-09-30T12:30:36+00:00",
  "date_from_url": "2019-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The rise of Xi Jinping to supreme leadership may explain the recent and dramatic shift against China on the part of the Learned Elders of Wye. Given its proven value as a predictive model, <a href=\"https://wikileaks.org/plusd/cables/09BEIJING3128_a.html\">the entire Wikileaks report on Xi</a> by an academic acquaintance from his youth is well worth reading.</p><blockquote class=\"tr_bq\"><p>23. Xi knows how very corrupt China is and is repulsed by the all-encompassing commercialization of Chinese society, with its attendant nouveau riche, official corruption, loss of values, dignity, and self-respect, and such “moral evils” as drugs and prostitution, the professor stated. The professor speculated that if Xi were to become the Party General Secretary, he would likely aggressively attempt to address these evils, perhaps at the expense of the new moneyed class. </p></blockquote><p>And that is exactly what Xi has done, with a serious commitment to an anti-corruption campaign that has taken many by surprise. It may astonish Western readers to know that the Chinese government is now extremely popular with the people. Unlike the Western countries, in which various corporations and other organizations are reliably deemed to big to fail – which really means they are too corrupt to be permitted to fail – Xi has led a magnificently ruthless campaign against corruption in China on a scale that is absolutely unthinkable in the West.</p><p>To put it in perspective, imagine if President Trump had had both Hilary Clinton and Bill Clinton arrested and jailed, as well as two Supreme Court justices, two-thirds of the DNC, half the RNC, and numerous FBI, CIA, and IRS employees. That’s effectively what Xi <a href=\"https://infogalactic.com/info/Anti-corruption_campaign_under_Xi_Jinping\">has already done</a> since 2012.</p><blockquote class=\"tr_bq\"><p>Upon taking office, Xi vowed to crack down on “tigers and flies”, that is, high-level officials and local civil servants alike. Most of the officials investigated were removed from office and faced accusations of bribery and abuse of power, although the range of alleged abuses varied widely. As of 2016, the campaign has ‘netted’ over 120 high-ranking officials, including about a dozen high-ranking military officers, several senior executives of state-owned companies, and four national leaders. More than 100,000 people have been indicted for corruption. The campaign is part of a much wider drive to clean up malfeasance within party ranks and shore up party unity. It has become an emblematic feature of Xi Jinping’s political brand.</p></blockquote><p>Now THAT is what actually draining the swamp looks like. The greatest political mind of the 20th century, Lee Kuan Yew, described Xi as “a man of great breadth” and said he would “put him in the Nelson Mandela class of persons.” While there are certainly reasons to doubt the assumption that the 21st century will be the Chinese century, the fact that 1.6 billion people now have a leader of this reported rectitude and capability should not be discounted.</p><p>I’ve admired Xi since <a href=\"https://www.independent.co.uk/news/people/china-s-president-xi-jinping-turns-down-mark-zuckerberg-s-request-to-name-his-unborn-child-at-white-a6679156.html\">he publicly shot down</a> Mark Zuckerberg’s public attempt to put him on the spot by asking Xi to name his child in 2015. This is clearly not a man who permits himself to be manipulated by anyone, for any reason.</p></div>",
  "content_text": "The rise of Xi Jinping to supreme leadership may explain the recent and dramatic shift against China on the part of the Learned Elders of Wye. Given its proven value as a predictive model,\nthe entire Wikileaks report on Xi\nby an academic acquaintance from his youth is well worth reading.\n23. Xi knows how very corrupt China is and is repulsed by the all-encompassing commercialization of Chinese society, with its attendant nouveau riche, official corruption, loss of values, dignity, and self-respect, and such “moral evils” as drugs and prostitution, the professor stated. The professor speculated that if Xi were to become the Party General Secretary, he would likely aggressively attempt to address these evils, perhaps at the expense of the new moneyed class.\nAnd that is exactly what Xi has done, with a serious commitment to an anti-corruption campaign that has taken many by surprise. It may astonish Western readers to know that the Chinese government is now extremely popular with the people. Unlike the Western countries, in which various corporations and other organizations are reliably deemed to big to fail – which really means they are too corrupt to be permitted to fail – Xi has led a magnificently ruthless campaign against corruption in China on a scale that is absolutely unthinkable in the West.\nTo put it in perspective, imagine if President Trump had had both Hilary Clinton and Bill Clinton arrested and jailed, as well as two Supreme Court justices, two-thirds of the DNC, half the RNC, and numerous FBI, CIA, and IRS employees. That’s effectively what Xi\nhas already done\nsince 2012.\nUpon taking office, Xi vowed to crack down on “tigers and flies”, that is, high-level officials and local civil servants alike. Most of the officials investigated were removed from office and faced accusations of bribery and abuse of power, although the range of alleged abuses varied widely. As of 2016, the campaign has ‘netted’ over 120 high-ranking officials, including about a dozen high-ranking military officers, several senior executives of state-owned companies, and four national leaders. More than 100,000 people have been indicted for corruption. The campaign is part of a much wider drive to clean up malfeasance within party ranks and shore up party unity. It has become an emblematic feature of Xi Jinping’s political brand.\nNow THAT is what actually draining the swamp looks like. The greatest political mind of the 20th century, Lee Kuan Yew, described Xi as “a man of great breadth” and said he would “put him in the Nelson Mandela class of persons.” While there are certainly reasons to doubt the assumption that the 21st century will be the Chinese century, the fact that 1.6 billion people now have a leader of this reported rectitude and capability should not be discounted.\nI’ve admired Xi since\nhe publicly shot down\nMark Zuckerberg’s public attempt to put him on the spot by asking Xi to name his child in 2015. This is clearly not a man who permits himself to be manipulated by anyone, for any reason.",
  "tags": [
    "China"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-09-30T11:30:36+00:00"
}